{
  "id": "topic_5412091",
  "title": "Kakmakr",
  "author": "Kakmakr",
  "created_time": "September 02, 2022, 06:15:56 AM",
  "content": "The Banking industry now realized that the traditional Brick n Mortar Banking model are outdated and expensive, so they are closing a lot of their Brick n mortar branches and moving towards an online Banking alternative. They are not waiting for \"digital\" technologies to disrupt their business.... they are actively changing their whole operation. Generation Z is a lot more digitally savvy than Millennials, so their target market are changing ...and they are changing to adapt to the changing customer needs. They also realized that Brick n mortar operations are very expensive to operate and that those expenses has to be funded by high fees. The competition in the form of alternative digital payment offerings and Bitcoin's \"Be your own Bank\" principle....added to the threat of not having these high fees. Are we going to wait for the Banking sector to disrupt Bitcoin.... or are we going to spearhead innovation to stay in front? You decide, if you want to stagnate.... or if you want to run in the front.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5412091",
  "comments": [
    {
      "author": "NeuroticFish",
      "created_time": "September 02, 2022, 06:35:48 AM",
      "body": "Quote from: Kakmakr on September 02, 2022, 06:15:56 AMAre we going to wait for the Banking sector to disrupt Bitcoin.... or are we going to spearhead innovation to stay in front? You decide, if you want to stagnate.... or if you want to run in the front.  While you somewhat have a point, I'm afraid your call may remain unanswered. Or not in the way you'd like.* Banks' move toward cheaper, faster and online based services is ongoing for years* Banks are institutions with money and power they can change a lot pretty fast* Bitcoin is evolving - SegWit is a leap forward, Taproot too. LN is expanding, maybe not too fast, but it does. Bitcoin development is un- (or more precisely under-) funded.The bigger problem I see is that you've compared apples (private businesses working with money) with oranges (the new money). And here:* Bitcoin related businesses do evolve, but some care only about profit, or they are being slowed down by the financial sector they have to interact with, so it's not much visible* There is so much money to come if one starts just another business like the existing one, many won't even bother for innovation* Banks themselves start working with Bitcoin and I would not be surprised they would come with the innovation you may be expecting (as I said, they work with a completely different level of funds).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "September 02, 2022, 07:20:25 AM",
      "body": "Quote from: Kakmakr on September 02, 2022, 06:15:56 AMThe Banking industry now realized that the traditional Brick n Mortar Banking model are outdated and expensive, so they are closing a lot of their Brick n mortar branches and moving towards an online Banking alternative. They are not waiting for \"digital\" technologies to disrupt their business.... they are actively changing their whole operation. Generation Z is a lot more digitally savvy than Millennials, so their target market are changing ...and they are changing to adapt to the changing customer needs. They also realized that Brick n mortar operations are very expensive to operate and that those expenses has to be funded by high fees. The competition in the form of alternative digital payment offerings and Bitcoin's \"Be your own Bank\" principle....added to the threat of not having these high fees. Are we going to wait for the Banking sector to disrupt Bitcoin.... or are we going to spearhead innovation to stay in front? You decide, if you want to stagnate.... or if you want to run in the front.  You need to correct yourself, the traditional bricks and mortar in banking is part of the symbols of the banking industry, and it will never be outdated. The banking industry is advancing, yet they will always need the bricks and mortar for a lot of storages and transactions, which includes the keeping of valuables, though lesser employees might be kept there.You are just overbearing in your discussion here, Bitcoin has its advantages over banking and banking has its advantages over Bitcoin. As far as internet banking is even concerned, the traditional banking system started it and it would have been developed without Bitcoin innovation. Yet, I love the way Bitcoin is a strong competitor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "September 02, 2022, 07:32:54 AM",
      "body": "Quote from: NeuroticFish on September 02, 2022, 06:35:48 AMQuote from: Kakmakr on September 02, 2022, 06:15:56 AMAre we going to wait for the Banking sector to disrupt Bitcoin.... or are we going to spearhead innovation to stay in front? You decide, if you want to stagnate.... or if you want to run in the front.  While you somewhat have a point, I'm afraid your call may remain unanswered. Or not in the way you'd like.* Banks' move toward cheaper, faster and online based services is ongoing for years* Banks are institutions with money and power they can change a lot pretty fast* Bitcoin is evolving - SegWit is a leap forward, Taproot too. LN is expanding, maybe not too fast, but it does. Bitcoin development is un- (or more precisely under-) funded.The bigger problem I see is that you've compared apples (private businesses working with money) with oranges (the new money). And here:* Bitcoin related businesses do evolve, but some care only about profit, or they are being slowed down by the financial sector they have to interact with, so it's not much visible* There is so much money to come if one starts just another business like the existing one, many won't even bother for innovation* Banks themselves start working with Bitcoin and I would not be surprised they would come with the innovation you may be expecting (as I said, they work with a completely different level of funds).Yes, Banks have loads of money to fund innovative projects... but we have motivated and innovative people in our community that are driven by the goal to disrupt them. You only need people with brain storming capabilities and creative minds to come up with great ideas... and a goal driven developer team to code it. The prestige and fame that comes with having the privilege to work on a project like this, will open doors for these people to work everywhere they like. (Imagine if you worked on a network/database that held Billions of Dollars in wealth.... and you added that to your CV) SegWit and Taproot and the Lightning Network are good examples of innovation, but we need less complicated solutions to push Bitcoin adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "September 02, 2022, 08:37:46 AM",
      "body": "I don't see any connection, much less threat, here. Bitcoin wasn't invented to disrupt the brick and mortar banking model. So whether the banks totally abandon their branches or not, it doesn't matter to Bitcoin. It does not in any way diminish Bitcoin's relevance and value. Whether the banks shift to online operations or remain in brick and mortar operations, they remain as banks, intermediaries, third parties that have to be trusted by the people and where transactions will have to pass through. Moreover, they remain to be fiat entities. In science, this is like physical change and, as opposed to chemical change, nothing has actually changed in the substance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "September 02, 2022, 08:59:59 AM",
      "body": "Quote from: Kakmakr on September 02, 2022, 07:32:54 AMSegWit and Taproot and the Lightning Network are good examples of innovation, but we need less complicated solutions to push Bitcoin adoption.  What are you expect then? Giving free Bitcoin worth of around $5-$10 to each new people who creating a wallet? It's no gonna work to push adoption, but much likely only attract for money and after they can withdraw, their will leave Bitcoin space.I'd say Bitcoin doesn't need any innovation, the main problem of the less adoption is because Bitcoin still not accepted widely on every countries. We're need to push government to accept Bitcoin as legal, that's it. Legal for buy, sell and trading Bitcoin, not accepting as legal tender since it's too far.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bakasabo",
      "created_time": "September 02, 2022, 09:19:30 AM",
      "body": "I dont see any major changes in banking sector nowadays. From banks, I only get notifications that my account monthly fee will be higher, and changes of plastic card limits. I understand that every bank in every country is different, but except an option to buy car insurance, I cant remember nothing innovative during last 5 years. As to Bitcoin, what new can it innovate? We are only waiting for mass adoption and that is it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "September 02, 2022, 09:23:17 AM",
      "body": "That's the important aspect of competition, even though btc is not globally accepted compare the banking system yet they feel threatened by its existence and the unending capabilities.Banks have been updating their system and making it more user friendly and digitize enough for everyday usage, despite this, the simple fact that it is a centralized institution and has the power to control people's funds give btc the hedge over them. Those who know the importance of privacy and want to keep their transaction private will always look the other way. BTC already have the upper hand when it comes to privacy and decentralized which is something banks will not be willing to do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "September 02, 2022, 09:37:16 AM",
      "body": "They have to admit and accept that change is imminent and they have to adopt things digitally. There are many digital wallets and banks these days that are offering the same thing as what the bank offers.And their advantage is by having a better interest rate than the typical bank that they have. While some of these banks that are open with merge and changes will have that idea of having an integrated crypto exchange.Waking up to the reality isn't that late and they just have to embrace these changes and upgrades so that they won't lose most of their customers that are open to the current technology that offers greater adoption related to bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "amishmanish",
      "created_time": "September 02, 2022, 01:13:24 PM",
      "body": "A lot of countries have infact launched their own digital currencies, but there is something special about crypto that is they are decentralised. They don't need government control. More over time has come when crypto finance institutions have to become instruments of betterment of financial system, they need to offer lower interst rate bank loans, better financial asset management for companies so that they can compete with banks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "September 02, 2022, 01:14:17 PM",
      "body": "Quote from: Despairo on September 02, 2022, 08:59:59 AMQuote from: Kakmakr on September 02, 2022, 07:32:54 AMSegWit and Taproot and the Lightning Network are good examples of innovation, but we need less complicated solutions to push Bitcoin adoption.  I'd say Bitcoin doesn't need any innovation, the main problem of the less adoption is because Bitcoin still not accepted widely on every countries. We're need to push government to accept Bitcoin as legal, that's it. Legal for buy, sell and trading Bitcoin, not accepting as legal tender since it's too far.You spelled out my mind on this matter already. Bitcoin is on its own, just as the regular brick-and-mortar banking halls stand on their own as well. If countries move to adopt bitcoin as a means for transaction and trade, it is so as to facilitate efficiency in the income sector, not to erode the banking sector in that it ceases to exist. Although it is agreed that huge funds would have to be diverted or better still invested in bitcoin campaign by the government, if it is granted certification as legal tender. Bitcoin is being innovative as it is being accepted. It is the users that determine what and how it needs to be simplified by comments or posts or news letter reviews.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "September 02, 2022, 01:40:25 PM",
      "body": "Quote from: Kakmakr on September 02, 2022, 06:15:56 AMAre we going to wait for the Banking sector to disrupt Bitcoin.... or are we going to spearhead innovation to stay in front? You decide, if you want to stagnate.... or if you want to run in the front.  The banking sector is not becoming better to me, only more enticing with more digitalization! The banks are still the same banks. In my country, the banks have even started to steal more from us recently in the name fees. I get charged when someone sends money into my bank account just like when I send money, get charged a ridiculous amount for \" debit card maintenance fee\", a card that I keep safe myself, I get charged also for sms notifications etc...It is not like their services are getting better, the network challenges in using the banking service is now a common thing. For new persons who have never used bitcoin, this new enticing face that banks are taking may be able to fool them that the banks are becoming better and a challenge to bitcoins, but if you have used bitcoins, you will know that the banks come nothing close to it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jiovanni",
      "created_time": "September 02, 2022, 01:58:35 PM",
      "body": "Quote from: Kakmakr on September 02, 2022, 06:15:56 AMThe Banking industry now realized that the traditional Brick n Mortar Banking model are outdated and expensive, so they are closing a lot of their Brick n mortar branches and moving towards an online Banking alternative. They are not waiting for \"digital\" technologies to disrupt their business.... they are actively changing their whole operation. Generation Z is a lot more digitally savvy than Millennials, so their target market are changing ...and they are changing to adapt to the changing customer needs. They also realized that Brick n mortar operations are very expensive to operate and that those expenses has to be funded by high fees. The competition in the form of alternative digital payment offerings and Bitcoin's \"Be your own Bank\" principle....added to the threat of not having these high fees. Are we going to wait for the Banking sector to disrupt Bitcoin.... or are we going to spearhead innovation to stay in front? You decide, if you want to stagnate.... or if you want to run in the front.  The way forward that I see here is getting more countries to accept Bitcoin as a legal tender, this would increase the value of Bitcoin.I don't see the activities of bank disrupting the operation of bitcoin, but I'm quite sure some banks would have to close down when a greater percentage of population decides to get wiser and invest in Bitcoin instead of saving in banks with peanuts as interest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "September 02, 2022, 02:25:55 PM",
      "body": "Quote from: Kakmakr on September 02, 2022, 06:15:56 AMThe Banking industry now realized that the traditional Brick n Mortar Banking model are outdated and expensive, so they are closing a lot of their Brick n mortar branches and moving towards an online Banking alternative. They are not waiting for \"digital\" technologies to disrupt their business.... they are actively changing their whole operation. Only those who adapt will survive, and banks always adapt and survive, this is a fact that can be verified throughout history. It would be unusual if this did not happen and unreasonable from the perspective of anyone who wants to remain competitive on the market.Quote from: Kakmakr on September 02, 2022, 06:15:56 AMThey also realized that Brick n mortar operations are very expensive to operate and that those expenses has to be funded by high fees. The competition in the form of alternative digital payment offerings and Bitcoin's \"Be your own Bank\" principle....added to the threat of not having these high fees. I would not agree that this is the biggest threat to them, at least not in the near future, considering that most people are not ready to be their own bank, and many do not want it, no matter how you offer it. Banks will continue to be present and dominant, they will only reduce the number of physical branches and employees, because everyone will have a bank in their pocket in the form of an app, or will use online banking on their personal computer.Quote from: Kakmakr on September 02, 2022, 06:15:56 AMAre we going to wait for the Banking sector to disrupt Bitcoin.... or are we going to spearhead innovation to stay in front? You decide, if you want to stagnate.... or if you want to run in the front.  I don't know who you mean when you say \"are we going to wait...\" because what can an ordinary person do in that sense? If I go and close the bank account, how will I receive my salary? Banks are still a necessary evil, nobody likes them, but you can't live without them unless you cut yourself off from the world and go live in the wild.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "September 02, 2022, 02:33:38 PM",
      "body": "Bitcoin does not have to change, the same way money does not have to change the front end services to some extent need to become more user friendly and give people more options.There are many small banks and banking services and brokerages that have customer service and customer facing interfaces that are IMO generations ahead of some exchanges and other bitcoin services.Sorry but it's true, not saying that they are all that way, just that enough are that way to drive people away.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "September 02, 2022, 02:46:05 PM",
      "body": "What innovations are you proposing? The banking industry's only disruption to Bitcoin will be the introduction of CBDC's and they aren't necessarily a direct threat would require Bitcoin to be any different (not that you could make BTC inherently different anyways). Seems to me that Gen Z are less skeptical of government intervention in economic affairs than older generations that have lived through legitimate oppressive regimes, so the banks have open access to a naive market that is willing to deprive themselves of any autonomy. This isn't a slight directed at Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "September 02, 2022, 03:09:25 PM",
      "body": "Quote from: bakasabo on September 02, 2022, 09:19:30 AMI dont see any major changes in banking sector nowadays. From banks, I only get notifications that my account monthly fee will be higher, and changes of plastic card limits. I understand that every bank in every country is different, but except an option to buy car insurance, I cant remember nothing innovative during last 5 years. No not true that banks could be different from countries because they are set up to make profit therefore they are business oriented. If your bank is charging you on unexplainable bills so likewise other countries. To shock you on this just yesterday I got a debit alert from my bank deducting equivalent of $2 from my account on no good reason. However one of the challenges that bank worker will face in near future is downsizing of staff because the brick walls are no longer patronised as much with digital currencyQuote from: bakasabo on September 02, 2022, 09:19:30 AMAs to Bitcoin, what new can it innovate? We are only waiting for mass adoption and that is it.Despite the banning from countries, the importance of bitcoin is not to be overemphasized. Bitcoin and freedom are like joint ventures, no hidden charges or unexplainable charges. Is open source and you see every in blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "September 02, 2022, 03:29:29 PM",
      "body": "if what you mean by more innovatoin is smart contract, there are teams already doing it like the RSK and Taro. but if you mean modifying BTC code itself to its protocol, it will bring down its market with broken trust.  spare the decentralization to Bitcoin and give governments control to Eth POS.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "September 02, 2022, 03:39:51 PM",
      "body": "The banks that I've been dealing with for over a have since moved to a more digital approach on their banking services. Since the smartphones became more and more popular, and a lot of people have become more connected to the internet, it's a no-brainer for banks to really move into that space. It's just that a lot of their customers are still stuck with passbooks and the old ways that they cannot do a full overhaul of their services. Bitcoin remains as is because it is not actively competing with the traditional banking system. If anything, it just offers an alternative to people who are looking to store/invest their money elsewhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "September 02, 2022, 03:53:05 PM",
      "body": "Banks are adopting which we were wrong in thinking they'd be iirelevant one day when cryptocurrency is adopted. If they all have stablecoins like the USDT, they'd be trusted by the customers who had been their clients for years.If BTC is here to stay so are banks. They may probably become an exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}