{
  "id": "topic_5404704",
  "title": "Janyiah201",
  "author": "Janyiah201",
  "created_time": "June 30, 2022, 11:14:46 PMLast edit: July 04, 2022, 03:48:27 AM by Janyiah201",
  "content": "What happened:It was supposed to be instant exchange. They have good reputation on BestChange. When you go to their site all they ask you is the direction and email address. I have tried to exchange 0.256 BTC, one ChipMixer's chip, to Monero. After receiving enough confirmations they changed order status to \"Mistake\" and accused me of trying to money launder stolen funds. According to their AML bot funds that I have sent are stolen. I have tried to explain them what Chipmixer is and it was a waste of time. They keep insisting on:\"Risk of your transaction - Stolen 100.00%\".Conversation was going on inside their internal \"messages\" and now I can't find all that they asked me to refund me, but it was from source of funds, who sent me, conversations and screenshots, can't even remember everything and in the end KYC (ID, selfie, etc), but most of what they asked I couldn't provide even if I wanted to. It's the first part about source, who, how, links, transactions, conversations, crazy.Quote\"Risk of your transaction - Stolen 100.00%. You've tried to launder dirty money through us....Refund will be possible after receiving from you supporting documents. Now it looks like you stole money from the victim and failed to launder it.\"I kept asking them just to return funds to the same address from which they received the payment. And they keep repeating that they can do it after I send them all \"supporting documents\"Website: openchange.cashAmount Scammed:  0.25598350 BTC ($4,838.92)Proof of Payment: https://www.blockchain.com/btc/tx/1f393532c18ac21a21b17ea890579a6d071f008400b2c73ced357cd59fe194d3PM/Chat Logs: Some of them disappeared from their internal messages system (I don't see old messages) and I haven't took a screenshots, but there is a public conversation on https://www.bestchange.com/openchange-exchanger.htmlUPDATE:A couple of days after public posts, threats that I will expose their previous wrongdoings, their use of fake identities and everything else that I have found, and proved them that I do have some info, like names and addresses of their Australian Paypal accounts, that I will report them to every hosting, domain registrar, etc. they accepted to process my exchange after answering a few questions, without KYC, but to keep 10% as fee because transaction is high risk.So, I got 90% back. Just to let everyone know, they have at least one more site: imexchanger.proI'm finished here.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404704",
  "comments": [
    {
      "author": "Bitcoin_Arena",
      "created_time": "July 01, 2022, 01:08:50 AM",
      "body": "It's funny that you signed up to use openchange.cash but did not read their ToS and AML policy that were right there before you confirmedSincerely, who is to blame here?Did you sign up on gun point?1. https://openchange.cash/terms_of_service/ 2. https://openchange.cash/privacy_policy/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "owlcatz",
      "created_time": "July 01, 2022, 01:27:20 AM",
      "body": "yeah that's certainly one thing I've learned, is never put any money into anything with a TOS without reading it first completely for sure.I can see chipmixer addresses being flagged as well by the terms of that TOS, I bet they just googled your sending address and went uh, nope.... So I'm not really too surprised I guess... Sorry for the loss OP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Janyiah201",
      "created_time": "July 01, 2022, 04:54:59 AM",
      "body": "Please read my post again.I have used Bitcoin! BTC!Not Payin and I don't know even know what is Payin and how it works.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aew",
      "created_time": "July 01, 2022, 07:23:18 AM",
      "body": "But OP you know that Chipmixer is to lose track of the source if the coins used by people who want to hide the track How they knew it's from Chipmixer? You just went saying to them the funds is mixed ! ? I don't blame them then Chipmixer is for coin laundry. Add to it TO Monero the other untraceable coin .It doesn't need a bot to mark you in a red flag just hear Chipmixer and Monero I think you too obtained that coins illegally otherwise why laundering it at the mixer and then Monero?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "saxydev",
      "created_time": "July 01, 2022, 07:31:11 AM",
      "body": "The funds have an AML score of 94.89999999999999 according to my system. It is clearly 100% money laundering and they had all the right to take your funds if they have any kind of AML policy.Chipmixer is not recommended to use as mixer, it is detected 80-85% of cases. Try to use coinjoin wassabi, but there you have to extremly careful (there are some settings you need to apply) for a real mix.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "July 01, 2022, 07:32:50 AM",
      "body": "I would avoid using anti-privacy currency exchangers. Their privacy policy essentially reveals they treat bitcoin as non-fungible. Quote from: Bitcoin_Arena on July 01, 2022, 01:08:50 AMIt's funny that you signed up to use openchange.cash but did not read their ToS and AML policy that were right there before you confirmedWhat's even funnier is that you have no idea what you're talking about. There's nothing in their policy which prevents someone from using mixed funds. All they say is that they disapprove \"suspicious\" transactions, whatever the hell that means:QuoteOpenchange.me tracks suspicious transactions of the clients and transactions executed under nonstandard conditions. Openchange.me performs its action on the base of AML FATF recommendations. QuoteOpenchange.me is committed to regularly update its electronic system for inspection of suspicious transactions and for verification of client identification records, in accordance with any new regulations as they are promulgated, as well as providing training for its employees on enhancements to anti-money laundering procedures that may be required by new regulations.Quote from: aew on July 01, 2022, 07:23:18 AMChipmixer is for coin laundry.ChipMixer exists to protect your privacy. Thanks. Quote from: saxydev on July 01, 2022, 07:31:11 AMThe funds have an AML score of 94.89999999999999 according to my system. It is clearly 100% money laundering and they had all the right to take your funds if they have any kind of AML policy.Wanna share us how you calculate money-laundering score according to the chain?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "July 01, 2022, 07:39:35 AMLast edit: July 01, 2022, 08:01:45 AM by o_e_l_e_o",
      "body": "Quote from: saxydev on July 01, 2022, 07:31:11 AMChipmixer is not recommended to use as mixer, it is detected 80-85% of cases.It is trivial to detect coins which have come from ChipMixer due to their unique chip funding transactions, but that's not the point. The whole point of a mixer is to break the link between deposit and withdrawal, which ChipMixer does better than any other mixer out there. If some scammy centralized service is attacking bitcoin's fungibility by refusing mixed coins, then the solution is not to give up your privacy but rather to never use that service.Quote from: saxydev on July 01, 2022, 07:31:11 AMTry to use coinjoin wassabi, but there you have to extremly careful (there are some settings you need to apply) for a real mix.Wasabi spies on its users. If you want privacy, you should never use Wasabi.Openchange's terms, which Bitcoin_Arena has linked to above, are pretty clear. Incredibly scummy, but still clear. OP should have read them before sending his coins. You could maybe try arguing based on point 7.6 - that you have the right to independently verify the result of their risk assessment. As you say, the coins came directly from ChipMixer, so claiming they are \"100% anything\" is just an outright lie. They have no idea, and their risk assessment is wrong.And I must say, the way they are handling this issue on https://www.bestchange.com/openchange-exchanger.html is atrocious. This should be a warning for everyone to steer well clear of this service.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aew",
      "created_time": "July 01, 2022, 07:42:07 AM",
      "body": "Quote from: BlackHatCoiner on July 01, 2022, 07:32:50 AMI would avoid using anti-privacy currency exchangers. Their privacy policy essentially reveals they treat bitcoin as non-fungible. Quote from: Bitcoin_Arena on July 01, 2022, 01:08:50 AMIt's funny that you signed up to use openchange.cash but did not read their ToS and AML policy that were right there before you confirmedWhat's even funnier is that you have no idea what you're talking about. There's nothing in their policy which prevents someone from using mixed funds. All they say is that they disapprove \"suspicious\" transactions, whatever the hell that means:QuoteOpenchange.me tracks suspicious transactions of the clients and transactions executed under nonstandard conditions. Openchange.me performs its action on the base of AML FATF recommendations. QuoteOpenchange.me is committed to regularly update its electronic system for inspection of suspicious transactions and for verification of client identification records, in accordance with any new regulations as they are promulgated, as well as providing training for its employees on enhancements to anti-money laundering procedures that may be required by new regulations.Quote from: aew on July 01, 2022, 07:23:18 AMChipmixer is for coin laundry.ChipMixer exists to protect your privacy. Thanks. Quote from: saxydev on July 01, 2022, 07:31:11 AMThe funds have an AML score of 94.89999999999999 according to my system. It is clearly 100% money laundering and they had all the right to take your funds if they have any kind of AML policy.Wanna share us how you calculate money-laundering score according to the chain?To protect your privacy ? If owners of that site got caught Wich for sure someday as it's a service mostly must be in the deep web it's like life in prison money laundry is not a joke buddy.  To protect my privacy is a good way to put it. Im sure now you connected by some rdp or onion browser to reply here At least let people who use your laundry service knows how dangerous and illegal act they doing don't put it there like it's okay to use the service. Here just one example if small mixer operator got himself caught https://coingeek.com/bitcoin-mixers-are-illegal-and-anonymity-is-dangerous/To the OP don't go around saying to people I use Chipmixer and send your KYC ... You will get your self in serious troubles. Hope you realize what you are doing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "saxydev",
      "created_time": "July 01, 2022, 07:49:56 AM",
      "body": "Quote from: o_e_l_e_o on July 01, 2022, 07:39:35 AMQuote from: saxydev on July 01, 2022, 07:31:11 AMChipmixer is not recommended to use as mixer, it is detected 80-85% of cases.It is trivial to detect coins which have come from ChipMixer due to their unique chip funding transactions, but that's not the point. The whole point of a mixer is to break the link between deposit and withdrawal, which ChipMixer does better than any other mixer out there. If some scammy centralized service is attacking bitcoin's fungibility by refusing mixed coins, then the solution is not to give up your privacy but rather to never use that service.Quote from: saxydev on July 01, 2022, 07:31:11 AMTry to use coinjoin wassabi, but there you have to extremly careful (there are some settings you need to apply) for a real mix.Wasabi spies on its users. If you want privacy, you should never use Wasabi.I will try to find a paper from last year where it is very nice described how chipmixer coins were followed in a couple of ransomware cases; this is why i specified regarding wassabi that you may need to some custom changes to it.QuoteTry to use coinjoin wassabi, but there you have to extremly careful (there are some settings you need to apply) for a real mix.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "July 01, 2022, 07:51:06 AM",
      "body": "Quote from: aew on July 01, 2022, 07:42:07 AMTo protect your privacy ? If owners of that site got caught Wich for sure someday as it's a service mostly must be in the deep web it's like life in prison money laundry is not a joke buddy.Citation needed. All the evidence we have shows that a very small minority of coins which pass through mixers are associated with illicit activity, and the vast majority come from users simply looking to protect themselves from the mass surveillance of centralized exchanges.Quote from: aew on July 01, 2022, 07:42:07 AMIm sure now you connected by some rdp or onion browser to reply hereI mean, yes, but what's that got to do with anything?Quote from: aew on July 01, 2022, 07:42:07 AMAt least let people who use your laundry service knows how dangerous and illegal act they doing don't put it there like it's okay to use the service.Mixers aren't illegal.Quote from: aew on July 01, 2022, 07:42:07 AMHere just one example if small mixer operator got himself caught https://coingeek.com/bitcoin-mixers-are-illegal-and-anonymity-is-dangerous/The operator was arrested for operating an unlicensed money transmitter. That does not mean mixers are illegal. Also, coingeek is a CSW scam site.Quote from: aew on July 01, 2022, 07:42:07 AMTo the OP don't go around saying to people I use Chipmixer and send your KYC ... You will get your self in serious troubles. Hope you realize what you are doing.Hey everyone. I use ChipMixer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "July 01, 2022, 07:52:15 AM",
      "body": "Quote from: aew on July 01, 2022, 07:42:07 AMTo protect your privacy ? If owners of that site got caughtGot caught for what? Accepting bitcoin? There's no regulation that forbids the acceptance of \"tainted\" coins, because there are no \"tainted\" coins to begin with.Quote from: aew on July 01, 2022, 07:42:07 AMTo protect my privacy is a good way to put it. I'm glad you agree.Quote from: aew on July 01, 2022, 07:42:07 AMAt least let people who use your laundry service knows how dangerous and illegal act they doing don't put it there like it's okay to use the service. There's nothing dangerous nor illegal to using a mixer. Money laundering being illegal doesn't make mixing illegal just because a minority does both.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "saxydev",
      "created_time": "July 01, 2022, 08:00:23 AM",
      "body": "Check this out: https://www.fatf-gafi.org/media/fatf/documents/recommendations/Updated-Guidance-VA-VASP.pdfNot illegal, but without laws, still applied in a weird way, courts rulled 95% of time against the use of mixers",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "July 01, 2022, 08:34:07 AM",
      "body": "Openchange.cash's Contact page shows an email address. No phone number, no company address, no country of origin. That alone is reason enough to never send them any documents, and I'm pretty sure such an anonymous company doesn't care about \"combating the financing of terrorism\" and the other big words in their AML policy. They like to refer to \"international law\", which is as broad as it can be:Quote from: AMD policyIn accordance with international law Openchange.me is not obliged to inform the Client that it was reported to the corresponding bodies of the Client's suspicious activity.What does that even mean? A totally anonymous website is going to report Janyiah201 to some \"international government\"? I doubt it! This sounds like it's designed to keep your money. The policy on the .cash domain only refers to the .me domain.According to BestChange, OpenChange.cash is from Russia. That's the closest thing to an \"address\" I found.Quote from: Bitcoin_Arena on July 01, 2022, 01:08:50 AMIt's funny that you signed up to use openchange.cash but did not read their ToS and AML policy that were right there before you confirmed~Sincerely, who is to blame here?Did you sign up on gun point?It doesn't worry you that an anonymous entity demands people to share their legal documents? It worries me! I'm okay with legit companies following the law in the country they're registered in. I'm also okay with totally anonymous services that solely rely on their reputation.But I'm not okay with anonymous entities cherry picking which rules do or don't apply to them.Quote from: Bitcoin_Arena on July 01, 2022, 01:08:50 AM2. https://openchange.cash/privacy_policy/They call it a privacy policy, but it has nothing to do with that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "July 01, 2022, 10:59:27 AM",
      "body": "Quote from: aew on July 01, 2022, 09:30:37 AMCommon man you are getting paid by them.It's non of your business, but I have been using it before I wore the signature, and I'm sure others have been using it too.Quote from: aew on July 01, 2022, 09:30:37 AMIt's illegal buddy. Show me a regulation that says that I'm forbidden to mix bitcoin.Quote from: aew on July 01, 2022, 09:30:37 AMIf you are right go ahead show your KYC and tell the people like a centralized exchange you used a mixing service.  This is one of the million reasons people (should) avoid using centralized exchanges. There's a high chance I have my funds frozen because they don't like my inputs. I don't deal with services that require my personal data to make a purchase.Quote from: aew on July 01, 2022, 09:30:37 AMTalk easy. But it's ok what will you say about a service that pays you .I'll have to argue we're talking objectively.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "July 01, 2022, 11:41:57 AMLast edit: July 01, 2022, 11:53:14 AM by dkbit98",
      "body": "It's funny how they accused you for money laundering like you tried to exchange much larger amount of coins, instead of just 0.25 btc.  Openchange needs to return your coins if you don't want to pass kyc verfication, but Janyiah201 I think you should always read terms and conditions before using any centralized exchanges like this.There are always risks when you are using obscure exchanges like this, and I think BestChange should change some things and add warning for exchanges that have strict KYC rules like this.Quote from: aew on July 01, 2022, 09:30:37 AMIt's illegal buddy. So much legal hypocrisy it makes me puke...Tell me is it LEGAL to buy japanese decurret account verified, google play developer account, and is it legal to sell Japanese PayPal account?!  Quote from: aew on April 08, 2022, 04:16:02 AMwant to buy a japanese decurret account verified Quote from: aew on April 11, 2022, 04:13:42 AMI have old Japanese PayPal. If I remember maybe 2 years old. Quote from: aew on April 03, 2022, 02:46:28 AMHi i need a google play developer account",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "July 01, 2022, 01:35:32 PMLast edit: July 01, 2022, 01:56:55 PM by DireWolfM14",
      "body": "Quote from: aew on July 01, 2022, 09:30:37 AMIt's illegal buddy.Where is it illegal to ensure the privacy your funds?  I'm in a country where law enforcement has to prove a crime was committed before they can seize funds, and there's nothing illegal about using methods to remain private.This isn't about ChipMixer, or any other method of obfuscating your coins.  I earn a bit of bitcoin here, and I don't want people from this site following my money around.  I use obfuscation tools to break the link between me and the money for privacy and security, and that's all.  I have no illegal funds, I have no criminal intent, but I do value my privacy.Quote from: aew on July 01, 2022, 09:30:37 AM\"Hey everybody I use Chipmixer \" it's easy to say that why hiding behind a username and a keyboard. If you are right go ahead show your KYC and tell the people like a centralized exchange you used a mixing service.  I bet you my cent you won't.  Talk easy. But it's ok what will you say about a service that pays you .WTF are you talking about?  You're the one saying that privacy is only for the criminals.  If you're so confident you have nothing to hide, why don't you post your KYC?Quote from: saxydev on July 01, 2022, 07:49:56 AMI will try to find a paper from last year where it is very nice described how chipmixer coins were followed in a couple of ransomware cases; this is why i specified regarding wassabi that you may need to some custom changes to it.Wasabi is a joke, they are blacklisting UTXO's that don't meet their chain analysis requirements, so they only mix funds that don't need mixing.  What's the point of that?Consider how many US dollars are in circulation right now, and consider how many of those US dollars have been used to pay for criminal activity.  When you spend those dollars at a grocery store, are they going to check the serial number of each dollar you spend to make sure they've not been stolen from a bank, or suspected of being used to pay for drugs?  Give me a break, this is nothing but governments trying to hold on to the power they gain by controlling the method of trade.  They don't care to stop crime, they care to preserve their power and control.Take a look at the United States Constitution and tell me where you see that the Federal Government has the right to control currency, I dare you to find it.  The advent of bitcoin makes the US dollar and the Federal Reserve unconstitutional, and power brokers everywhere are panicking!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "July 01, 2022, 02:27:01 PM",
      "body": "Quote from: aew on July 01, 2022, 07:23:18 AMBut OP you know that Chipmixer is to lose track of the source if the coins used by people who want to hide the track How they knew it's from Chipmixer? You just went saying to them the funds is mixed ! ? I don't blame them then Chipmixer is for coin laundry. Add to it TO Monero the other untraceable coin .It doesn't need a bot to mark you in a red flag just hear Chipmixer and Monero I think you too obtained that coins illegally otherwise why laundering it at the mixer and then Monero?Quote from: saxydev on July 01, 2022, 07:31:11 AMThe funds have an AML score of 94.89999999999999 according to my system. It is clearly 100% money laundering and they had all the right to take your funds if they have any kind of AML policy.Chipmixer is not recommended to use as mixer, it is detected 80-85% of cases. Try to use coinjoin wassabi, but there you have to extremly careful (there are some settings you need to apply) for a real mix.You two are clearly very new to the whole subject of cryptocurrency and its roots in cypherpunk, anarchistic and liberalist ideology.I'd like to use this opportunity to suggest reading Bitcoin: The dream of Cypherpunks, libertarians and crypto-anarchists.If you really understand the importance of privacy for security and freedom, you would immediately see that the words you're spouting now are the propaganda someone made you believe; perfectly in line with the whole 'you have nothing to hide, have you?' narrative.I'm not surprised seeing your line of thought when speaking to people who have no idea or no interest in Bitcoin, but I am surprised when I come across it on a Bitcoin forum. My most plausible theory so far is that 'crypto enthusiasts' who buy into 'I have nothing to hide; so here have all my data, KYC, and whatever else you want'-nonsense are people who see Bitcoin and other cryptocurrencies merely as investment assets, nothing more, nothing less. They see them as a way to maximize their fiat holdings (hence the term 'fiat maxi'). But I'm interested to know about other theories.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "July 01, 2022, 02:44:57 PM",
      "body": "Quote from: aew on July 01, 2022, 09:30:37 AMCommon man you are getting paid by them. You wearing the signature of Chipmixer.  It's illegal buddy. \"Hey everybody I use Chipmixer \" it's easy to say that why hiding behind a username and a keyboard. If you are right go ahead show your KYC and tell the people like a centralized exchange you used a mixing service.  I bet you my cent you won't.  Talk easy. But it's ok what will you say about a service that pays you .Let's clear some things up.First, this is one of my old posts:Quote from: stompix on May 06, 2022, 03:23:13 PMThat being said, I made once stupid mistake of sending coins mixed through CM directly to Bitstamp the mother and father of all KYC, nothing has happened yet, deposit and SEPA without a hiccup, so probably it's not yet such a big deal. Exchanges will try to delay any such actions as long as they can, they are losing money and volume, they might want to obey the law but not to the point when it strat costing them money.So, I did send (by mistake) funds from a freshly mixed address directly to Bitstamp, coins that were just claimed, I didn't have a single problem to date with them, I'm full KYC (a thing I regret doing it also) but Bitstamp, probably the worse exchange when it comes to controlling everything has had no problem with it.Second:No exchange can confiscate your funds legally without a court order, they can freeze your account for a period but doing so because you have failed KYC would require them to inform the authorities where they operate about this transaction immediately. There is no such thing as these funds look stolen then we freeze it and we unfreeze it the moment you send us a pic of an id, this is illegal on so many levels it doesn't even need to be discussed.Quote from: saxydev on July 01, 2022, 07:31:11 AMThe funds have an AML score of 94.89999999999999 according to my system. It is clearly 100% money laundering and they had all the right to take your funds if they have any kind of AML policy.Please do quote any law from any country, territory, or fantasy world on this planetthat says something like this , since FATF says something differentQuoteConfiscation or forfeiture takes place through a judicial or administrative procedure that transfers the ownership of specified funds or other assets to be transferred to the State. In this case, the person(s) or entity(ies) that held an interest in the specified funds or other assets at the time of the confiscation or forfeiture loses all rights, in principle, to the confiscated or forfeited funds or other assets. Confiscation or forfeiture orders are usually linked to a criminal conviction or a court decision whereby the confiscated or forfeited property is determined to have been derived from or intended for use in a violation of the law.Quote from: ETFbitcoin on July 01, 2022, 12:08:46 PMThere's nothing much you could do since their ToS explicitly stated that. But i found out such ToS didn't exist last year, https://web.archive.org/web/20210613120712/https://openchange.cash/t%D0%B5rms_of_service/.ToS terms don't grant you power beyond the law, nor can they shield you from complaints or lawsuits.Of course, this is a no-name exchange with no location and no physical address but normally such ToS wound't stand a chance in any civil or criminal case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "July 01, 2022, 02:50:37 PM",
      "body": "Quote from: stompix on July 01, 2022, 02:44:57 PM[..]Second:No exchange can confiscate your funds legally without a court order, they can freeze your account for a period but doing so because you have failed KYC would require them to inform the authorities where they operate about this transaction immediately. There is no such thing as these funds look stolen then we freeze it and we unfreeze it the moment you send us a pic of an id, this is illegal on so many levels it doesn't even need to be discussed.That's what qualifies their behavior for a scam accusation. It's odd that this exchange isn't open about who they are, where they are, and all of that, but at the same time demands information from their customers.Quote from: stompix on July 01, 2022, 02:44:57 PMQuote from: saxydev on July 01, 2022, 07:31:11 AMThe funds have an AML score of 94.89999999999999 according to my system. It is clearly 100% money laundering and they had all the right to take your funds if they have any kind of AML policy.Please do quote any law from any country, territory, or fantasy world on this planetthat says something like this , since FATF says something differentIt's probably on a 'trust me, bro' basis.Real-life picure of saxydev:Quote from: stompix on July 01, 2022, 02:44:57 PMToS terms don't grant you power beyond the law, nor can they shield you from complaints or lawsuits.Of course, this is a no-name exchange with no location and no physical address but normally such ToS wound't stand a chance in any civil or criminal case. That's good to keep in mind! On the other hand, I doubt anyone is interested in going to court against an exchange unless it's BTC1+ ...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}