{
  "id": "topic_5416987",
  "title": "sverelst",
  "author": "sverelst",
  "created_time": "October 13, 2022, 02:45:23 PM",
  "content": "Hello there. I once made the mistake asking for a loan here without collateral once. I don't like  to repeat mistakes. I did not like the reactions I had and I don't want to see this happening again.I am not looking for people who don't know me from anywhere. If you don't know who i am or what i'm talking about, just ignore this post and dont't send hatred reactions.In the other case...I can prove i am the account sverelst at blackjack.fun. I wagered more than 200 btc on that site, you can check on the sites homepage. I ask for a loan of 50 mBTC, but I would also welcome lower amounts.What would I give you in return? You can check I am leading a weekly giveaway where the winner gets 50 mBTC. If anyone would lend me 50 mBTC, I would not only pay it back, but i would also give all of what I win from the weekly giveaway to the donator.That means, if you lend me 50 mBTC, I will pay you back 50 mBTC next week for sure. All prize money I get, and that is public so you can track it, will come to you too. In best case this is a 100% win. I am already leading the classification...If you have some crypto to spare, please contact me.Thanks.Best regardsSiemen",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416987",
  "comments": [
    {
      "author": "AB de Royse777",
      "created_time": "October 13, 2022, 03:15:24 PM",
      "body": "Quote from: sverelst on October 13, 2022, 02:45:23 PMThat means, if you lend me 50 mBTC, I will pay you back 50 mBTC next week for sure. This means you do not need the loan since you are not benefiting from it at all. Why would you risk money for someone else who will take all your money?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sverelst",
      "created_time": "October 13, 2022, 03:41:42 PM",
      "body": "Quote from: Royse777 on October 13, 2022, 03:15:24 PMQuote from: sverelst on October 13, 2022, 02:45:23 PMThat means, if you lend me 50 mBTC, I will pay you back 50 mBTC next week for sure. This means you do not need the loan since you are not benefiting from it at all. Why would you risk money for someone else who will take all your money?Indeed. I just want to keep playing. The money prize doesn't mean that much to me... So I would gladly give it to anyone. If anyone would help me these few days at first...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hodoor",
      "created_time": "October 13, 2022, 03:47:08 PM",
      "body": "That's cool and all but still, what guarantee does the lender have that you will fulfil your end of the deal and give him the 50mbtc after the you receive it ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "October 13, 2022, 03:47:21 PM",
      "body": "Why would someone trust you with 50 mBTC? You may have a significant wagering amount on blackjack, and whatever you have there, it won't be considered as valid collateral by most of the popular lenders here, at least I will not consider it as valid. I don't see how a non collateral loan and this loan differ from one another. Both are same.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sverelst",
      "created_time": "October 13, 2022, 04:21:29 PM",
      "body": "Quote from: Little Mouse on October 13, 2022, 03:47:21 PMWhy would someone trust you with 50 mBTC? You may have a significant wagering amount on blackjack, and whatever you have there, it won't be considered as valid collateral by most of the popular lenders here, at least I will not consider it as valid. I don't see how a non collateral loan and this loan differ from one another. Both are same.Hi. Yes it is indeed not a real collatteral. And as I said, if you don't know the Bj.fun community, please just ignore this post. But if you do know the community, you will know I am a valued member of the community and I will keep my promise. And then you might consider this as it would be a win both for you and for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "condoras",
      "created_time": "October 13, 2022, 05:53:43 PM",
      "body": "Quote from: sverelst on October 13, 2022, 04:21:29 PMQuote from: Little Mouse on October 13, 2022, 03:47:21 PMWhy would someone trust you with 50 mBTC? You may have a significant wagering amount on blackjack, and whatever you have there, it won't be considered as valid collateral by most of the popular lenders here, at least I will not consider it as valid. I don't see how a non collateral loan and this loan differ from one another. Both are same.Hi. Yes it is indeed not a real collatteral. And as I said, if you don't know the Bj.fun community, please just ignore this post. But if you do know the community, you will know I am a valued member of the community and I will keep my promise. And then you might consider this as it would be a win both for you and for me.It doesn't matter who you are elsewhere, it matters who you are here. And here, you are a noob, a total stranger.So if you are someone in this community, go ask there for a loan. Here you won't get a single satoshi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}