{
  "id": "topic_5476170",
  "title": "EFS",
  "author": "EFS",
  "created_time": "December 01, 2023, 12:06:57 PM",
  "content": "1 Ocak 2024'ten itibaren forumda mixerlerle ilgili konular kilitlenecek ve arşivlenecek.Mixerler hakkındaki tartışmalar sürebilir ancak insanları mixerlere yönlendirmeye kesinlikle izin verilmeyecek. Mixer linkleri paylaşanlar banlanabilir.İmzalarda mixer tanıtımı yapılması yasaklanacak.Mixerlerle ilgili eski mesajlar silinmeyecek.Quote from: theymos on December 01, 2023, 11:15:25 AMStarting Jan 1, 2024: - Existing mixer announcement topics (and a few topics that have no value without mixer-links) will be locked and archived. - Going forward, directing people to mixers in new posts/edits will be totally disallowed, and doing so could lead to a ban. Many mixer URLs will be wordfiltered-out, and if you bypass the wordfilter, then that'll definitely be ban-worthy. - Any remaining mixer signatures (etc.) may be deleted. Anyone persisting in advertising mixers will be banned. - In most cases, old posts will not be deleted. Nobody should be banned for old posts.You do not need to go edit/delete your past posts. Links will be automatically wordfiltered-out as of Jan 1, or in a few cases mods will archive or delete posts, but you will not be banned for old mixer-related posts.It will continue to be OK to discuss mixers in a general sort of way. Just don't direct people to mixers: don't link to a mixer, don't link to a directory with links to mixers, don't tell people to \"Google ASDFmixer\", don't link to a mixer's telegram, etc.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476170",
  "comments": [
    {
      "author": "mandown",
      "created_time": "December 01, 2023, 12:55:15 PM",
      "body": "Merkeziyetsizliğe inanan bir yapı üzerine oluşturulmuş bir forumun geldiği nokta cidden garip. Sanıım amerika bütün gücü elinde tutmak istiyor ve bunu başarıyorda. Mixer'leri para aklama gibi düşünülüyor olsada sistem adına harika bir teknolojiydi.Bu yapılara ait contratlarla etkileşime giren insanların başına acaba neler gelir? birkaç yıl sonra gel şu contratta neden etkileşime girdin diye hesap sorabilirler mi? Sonuçta borsalara kyc veriyoruz heryerde kimliğimiz var. Bugün yarın birçok kişiş üyeliğini kapatıp sahte kimliklerle kyc yapıp hayatına devam edecek gibi duruyor.@efs moderatör olmuş olsan bile senin görüşünü de merak ediyorum. Bu işin sonu nereye varacak? Merkeziyetli mi olacağız.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "December 01, 2023, 02:24:12 PM",
      "body": "Alınması zor olan bir karar almış @theymos biz sadece kağıt üzerinde gördüklerimizle okuduklarımızla yorum yapabiliriz. Genel olarak bakıldığında finansal gizlilik anlamında bireye daha rahat hissettirse de bu platformları kullananlar arasında ciddi anlamda tehlike arz edenler var. Bekara karı boşamak kolaydır ama @theymos'u bu kararı almaya iten şey ne oldu asıl ben onu merak ediyorum . Çünkü mesajında mixerlerin ortaya bir anda çıkıp büyüdüğünde hukuki güçler tarafından kapatıldığından bahsetmiş. Bu noktada bu hukuki güçler tarafından kendisine ya da foruma bir talep falan mı geldi acaba.Ancak ben birazcık ılımlı buluyorum diyebilirim şuan ki görüşümle çünkü forumu illegal kısımlardan birazcık geride tutmaya çalışmak gibi düşünüyorum. Tabi farklı noktalardan yanlış düşündüğümü belirten yorumlar gelirse fikrim değişebilir",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DryGrkm",
      "created_time": "December 01, 2023, 02:32:00 PM",
      "body": "Bu idiottan baska birsey beklenmezdi zaten.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CLS63",
      "created_time": "December 01, 2023, 03:50:21 PM",
      "body": "Theymos'un bu kararı almasındaki amaç tamamen forumu korumak kendisi de zaten böyle bir karar almak istemezdi ancak insanların uymak zorunda olduğu kurallar var.Sinbad.io olayında diğer olaylardan farklı olarak karalisteye alınan adreslerden bir tanesinin direkt olarak bitcointalk imza kampanyası ödeme adresi olduğunu aklımızdan çıkarmamak gerekiyor.Quote from: theymos on December 01, 2023, 02:01:03 PMI would prefer to allow them. I don't view using them as unethical, and I don't care about reputation. But this kind of thing is far from the core mission of bitcointalk.org, and the costs far outweigh the benefits.It wouldn't be illegal to continue allowing mixers here. That's why we're able to offer a 1-month grace period. But allowing them has become too risky/problematic, and it's only going to get worse. Imagine 5% of all active forum users being sanctioned due to being paid directly by mixers, or all participants in a big signature campaign being targets of a search warrant, or our service providers suddenly banning us due to being \"associated\" with mixers, etc. I think that the crypto community is near the start of a multi-year squeezing campaign against mixers; similar to the cannabis industry in the US, or Operation Choke Point, or what happened with Backpage, or the deplatforming of Parler.Yukarıdaki açıklamayı ben çok değerli buluyorum chipmixer'e düzenlenen operasyon sonucu chipmixer kapanmış ve yerine diğer mixerler geçmek için adeta bir savaşa girişmişti bundan sonra zaten services bölümünde dev bütçeli mikser kampanyaları gözükmeye başladı.Yukarıda Theymos'un kararı forumu korumak için demiştim ancak kendisinin bu kararıyla aynı zamanda forum kullanıcıları da korunmuş oluyor çünkü soruşturmaların zaman zaman ne kadar genişleyeceğini bilemezsiniz.Quote from: Turbartuluk on November 30, 2023, 08:24:18 AMQuote from: AHOYBRAUSE on November 30, 2023, 01:17:06 AMVielleicht werden die ja von FBI usw ja auch schon ins Visier genommen.  Ich könnte mir vorstellen, dass die Sinbad Kampagne da vielleicht schon noch ein Nachspiel haben wird, zumindest hat mich Binance heute folgendes gefragt:Dem aufmerksamen Leser dürfte die Adresse bekannt vorkommen, ist nämlich die Escrow Adresse der Sinbad Kampagne.Yukarıda sadece sinbad.io'dan ödeme alan(en son ödemesini yanlış hatırlamıyorsam 3 ay önce almış)bir kullanıcıya binance direkt olarak paranın hesabını sormuş.Kısacası bitcointalk forumu oldukça özgürlükçü ancak merkezi bir forum olduğu için bazı kurallara uymak zorunda şimdiden herhangi bir ihtar gelmeden bu kararın alınmış olması ve 1 ay süre verilmiş olması bence doğru.Keşke böyle olmasaydı ancak hükümetler elindeki argümanları sonuna kadar kullanarak bu devrimi geciktirmeye çalışacak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cacabey_40",
      "created_time": "December 01, 2023, 05:27:59 PMLast edit: December 01, 2023, 07:16:29 PM by Cacabey_40",
      "body": "Quote from: CLS63 on December 01, 2023, 03:50:21 PMTheymos'un bu kararı almasındaki amaç tamamen forumu korumak kendisi de zaten böyle bir karar almak istemezdi ancak insanların uymak zorunda olduğu kurallar var.Sinbad.io olayında diğer olaylardan farklı olarak karalisteye alınan adreslerden bir tanesinin direkt olarak bitcointalk imza kampanyası ödeme adresi olduğunu aklımızdan çıkarmamak gerekiyor.Quote from: theymos on December 01, 2023, 02:01:03 PMI would prefer to allow them. I don't view using them as unethical, and I don't care about reputation. But this kind of thing is far from the core mission of bitcointalk.org, and the costs far outweigh the benefits.It wouldn't be illegal to continue allowing mixers here. That's why we're able to offer a 1-month grace period. But allowing them has become too risky/problematic, and it's only going to get worse. Imagine 5% of all active forum users being sanctioned due to being paid directly by mixers, or all participants in a big signature campaign being targets of a search warrant, or our service providers suddenly banning us due to being \"associated\" with mixers, etc. I think that the crypto community is near the start of a multi-year squeezing campaign against mixers; similar to the cannabis industry in the US, or Operation Choke Point, or what happened with Backpage, or the deplatforming of Parler.Yukarıdaki açıklamayı ben çok değerli buluyorum chipmixer'e düzenlenen operasyon sonucu chipmixer kapanmış ve yerine diğer mixerler geçmek için adeta bir savaşa girişmişti bundan sonra zaten services bölümünde dev bütçeli mikser kampanyaları gözükmeye başladı.Yukarıda Theymos'un kararı forumu korumak için demiştim ancak kendisinin bu kararıyla aynı zamanda forum kullanıcıları da korunmuş oluyor çünkü soruşturmaların zaman zaman ne kadar genişleyeceğini bilemezsiniz.Quote from: Turbartuluk on November 30, 2023, 08:24:18 AMQuote from: AHOYBRAUSE on November 30, 2023, 01:17:06 AMVielleicht werden die ja von FBI usw ja auch schon ins Visier genommen.  Ich könnte mir vorstellen, dass die Sinbad Kampagne da vielleicht schon noch ein Nachspiel haben wird, zumindest hat mich Binance heute folgendes gefragt:Dem aufmerksamen Leser dürfte die Adresse bekannt vorkommen, ist nämlich die Escrow Adresse der Sinbad Kampagne.Yukarıda sadece sinbad.io'dan ödeme alan(en son ödemesini yanlış hatırlamıyorsam 3 ay önce almış)bir kullanıcıya binance direkt olarak paranın hesabını sormuş.Kısacası bitcointalk forumu oldukça özgürlükçü ancak merkezi bir forum olduğu için bazı kurallara uymak zorunda şimdiden herhangi bir ihtar gelmeden bu kararın alınmış olması ve 1 ay süre verilmiş olması bence doğru.Keşke böyle olmasaydı ancak hükümetler elindeki argümanları sonuna kadar kullanarak bu devrimi geciktirmeye çalışacak.Forumu korumak adına doğru bir karar olsa da aynı zamanda merkeziyetsizliği de baltalayan bir karar olmuş.Mixerler arka planda yine çalışmaya devam eder. Forum üzerinden izin verilmemesi forumun kapanmaması adına olumlu bir tavır olarak yorumlanabilir.Kesin theymos'a uyarı niteliğinde bir yazı gelmiştir. Aksi durumda sonuçları çok ağır olabilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mustang Shelby",
      "created_time": "December 01, 2023, 07:10:30 PM",
      "body": "Beyin fırtınası yaparsak eğer bu forum kapanırsa bundan en çok etkilenenlerden birisi de theymos olur. Hepimiz için forum çok önemli bir yerde ve bence de bir ihtar almış olabilirler. Chipmixer, Sinbad, Başka başka kampanyaların da sahibi olan şirketlerin polis tarafından engellendiğini düşününce herkesin akıbeti için en doğru kararı theymos vermiş. Ödemeleri güzel olsa da forum için risk ise engellemek mantıklı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "December 01, 2023, 08:43:36 PM",
      "body": "Binance doğrudan forumda yer alan cüzdanı sorduğuna göre bu yapılan hareket bence mantıklı. Elbette olay merkeziyetsizlik, iz sürülememesi gibi düşünülüyor ama foruma zarar verecek bir şeye izin vermelerini beklemek de mantıklı olmazdı.Mixerler ile ilgili bir sorun var ve herkesin gözü bu sektöre geçmiş durumda. Bu yüzden dikkatli hareket etmek gerek, yasak varsa uyulur. Birkaç imza kampanyası ya da reklam geliri için riske gerek yok",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CLS63",
      "created_time": "December 01, 2023, 09:39:17 PM",
      "body": "theymos'a sorulan sorular arasında tamam mixerleri yasakladık forumdan yarın öbür gün hükümetler başka bir şey isterlerse ne yapacağız bunun sonu gelmez tarzı sitemler vardı kendisi de bunun tüm merkezi forumların sorunu olduğunu söyledi ve merkezi olmayan bir forumun ileride açılmasını kendisinin de dilediğini hatta bağış yapmaya hazır olduğunu söyledi.Kısacası haklısınız ancak ne yapabilirim diyor varsa güzel bir proje bana rakip olcak olsa bile ben bu davaya inanmışım finansal destek bile sağlarım diyor    Gelecek yıllarda yeni bir olay beklemediğini de söylüyor.Quote from: theymos on December 01, 2023, 02:01:03 PMQuote from: CryptopreneurBrainboss on December 01, 2023, 12:16:46 PMTheymos, I understand this decision had to be taken to save the forum from alot of accusations in aiding fraudulent activity in the future but what next are we going to ban?I don't anticipate the need for major new restrictions in the next couple of years, but it could indeed happen. Maybe Bitcoin will be banned in the US someday, and then I'll have to either shut down bitcointalk.org or find a way of moving it to some remaining territory of freedom in the world. That's the problem with centralized forums. I wish that more work was being done on creating decentralized, uncensorable, but also usable forums. I would love nothing more than to be able to shut down bitcointalk.org due to some decentralized solution making it obsolete. Find me a 501(c)(3) nonprofit working on this, and I'll donate to it.Quote from: xzone on December 01, 2023, 08:43:36 PMBinance doğrudan forumda yer alan cüzdanı sorduğuna göre bu yapılan hareket bence mantıklı. Asıl bu hareketin yapılmasının sebebi binance'ın cüzdanı sorması değil binance'ın cüzdanı sorma sebebinden kaynaklanıyor. https://ofac.treasury.gov/recent-actions/20231129 bu makalede direkt olarak bu cüzdan geçiyor.Quote from: Cacabey_40 on December 01, 2023, 05:27:59 PMKesin theymos'a uyarı niteliğinde bir yazı gelmiştir. Aksi durumda sonuçları çok ağır olabilir.theymos'a sizin bu yorumunuz direkt olarak soruldu ve kendisi böyle bir uyarının gelmediği söyledi.Aşağıda alıntıladım theymosun mesajını.Ancak bu konuda kendisi zaten son dönemlerde hassas davranmaya başlamıştı forum personelinden mixer kampanyalarına katılmamalarını istemiş.Bundan dolayı bu hamle benim için süpriz olmadı ve açıklamalarına güveniyorum.İlgili konuya bakabilirsiniz.Quote from: theymos on December 01, 2023, 02:01:03 PMQuote from: ibminer on December 01, 2023, 12:13:27 PMI'm curious myself if there were any formal requests or warnings receivedWe've received no warnings or requests to change policy from law enforcement regarding mixers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "denemee",
      "created_time": "December 01, 2023, 09:51:35 PM",
      "body": "Vardır bir bildikleri, eskiler için bilgiler değerleniyor. Merkeziyetsizlik yavaş yavaş gidiyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bobita",
      "created_time": "December 01, 2023, 10:52:47 PM",
      "body": "Yorum yaparken fazla duygusal yaklaşmamak, rasyonellikten uzaklaşmamak lazım.İlgili başka bir konuda yazmıştım, sen, ben gibi pislikle işi olmayan basit kullanıcının basit anonimliğini koruyabilecek kadarını isterim ama diğer taraftan mixer üzerinden çok büyük miktar ve iğrençlikte para trafiği oluyor, bu da inkar edilemez bir gerçek diye.Çıkış dönemlerini geçtim, kripto varlıklar dünya çapında insanların gündemine, ticaretine gireli bile yıllar oldu ve hala bir numaralı referans Bitcointalk, şu an bile \"ben bu işlerle ilgilenmek istiyorum, ne tavsiye edersin?\" diye soranları foruma yönlendiriyoruz (en azından, ben öyle yapıyorum), yani ekosistemde forumumuz hala çok güçlü. Bu şartlar altında, mercek altındaki mixerler konusunda forum yönetimine ne kadar baskı yapılmış olabileceğini (hatta tehdit) tahmin etmek için müneccim olmaya gerek yok sanırım. Ayrıca kimse kusura bakmasın ama (yine kendi adıma konuşuyorum), sınırlı anonimliğimin bedeli başkalarının terörden, uyuşturucudan, çocuk pornosundan, yasa dışı kumardan, dolandırıcılıktan vb vb (yüz tane kalem sayılabilir) kazandıklarını rahatça sisteme sokabilmeleri olacaksa ben bu anonimlikten feragat ediyorum. Bunu söylemem otoritenin tam kontrolünde, merkezi ve anonimlikten uzak bir finans sisteminde sakınca görmediğim anlamına gelmiyor ama kar/zarar kıyası yapınca bunu tercih ediyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "December 02, 2023, 07:40:38 PM",
      "body": "Forumun korunması amacıyla gelecekte forum kullanımı negatif etkileyebilecek durumların yasaklanmasını anlayabiliyorum yine de daha genel pencereden baktığımda mixer kullanımı bu işin bir parçası ve forumda yasaklanmaması gerekiyordu.Daha açarak anlatmaya çalışayım bitcoin kullanarak uyuşturucu satılması yasaklanabilir çünkü yasaklı bir eylem içerir. Ama uyuşturucu satışında da kullanılıyor denerek bitcoinin yasaklanması mantıklı olmayacaktır.Mixerler için ise durum biraz daha farklı. Doğrudan bitcoinin yapısı kullanılarak üretilmiş bir çözüm yönteminin suçlular da kullanıyor diyerek hem devletler tarafından afaroz edilmesi hem de forumdan afaroz ediliyor oluşu bana doğru gelmiyor. Bıçağı ameliyat ederek bir hastayı kurtarmak için de kullanabilirsiniz yada birisini öldürmek için de kullanabilirsiniz. Bu durumda yargılanması gereken bıçağın kendisi değil insan öldürmek için kullananlardır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "execijutiere",
      "created_time": "December 02, 2023, 08:52:57 PM",
      "body": "4-5 tane imza kampanyası tamamen mixerlerin kampanyaları ve en yüksek ödemeleri bu imza kampanyaları yapıyordu.Biz alınmıyorduk genelde ve forumda bilindik isimleri kampanyalara alıyorlardı açıkcası.Aylık en az 2 katı fazla veren bu imza kampanyalarının kapanması açıkcası diğer imza kampanyalarını etkileyecek mi merak ediyorum doğrusu. Bu hamle biraz merkezi bir hamle gibi geldi ve forumun güvenliği açısından alındığı bariz bir şekilde ortada.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "December 03, 2023, 07:41:27 AM",
      "body": "mixer ile ilgili imza kampanyalarının yasaklanmasını bir yere kadar anlayabilirim. çünkü bu işin ucu sadece forumun kapanması gibi basit yerlere gitmez. burada sorumlu olan kişilerin kafalarının kesilmesine bile  neden olabilir. anlamadığım konu ise forumda mixer ile ilgili bir link paylaşılmasının yasaklanması hatta bu eylemi yapan kişilerin banlanma riskine sahip olması.sanırım yavaş yavaş vahşi batının sonlarına doğru geliyoruz dostlar. lan ibibikler elon musk'u ne zaman asacaksınız?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "December 03, 2023, 05:38:26 PM",
      "body": "Quote from: execijutiere on December 02, 2023, 08:52:57 PM4-5 tane imza kampanyası tamamen mixerlerin kampanyaları ve en yüksek ödemeleri bu imza kampanyaları yapıyordu.Biz alınmıyorduk genelde ve forumda bilindik isimleri kampanyalara alıyorlardı açıkcası.Aylık en az 2 katı fazla veren bu imza kampanyalarının kapanması açıkcası diğer imza kampanyalarını etkileyecek mi merak ediyorum doğrusu. Bu hamle biraz merkezi bir hamle gibi geldi ve forumun güvenliği açısından alındığı bariz bir şekilde ortada.Ben kampanyaları zaten umursamıyorum haftalık post ortalamam 4-5 sanırım ama emin olun mixer kampanyalarının olmaması diğer kampanyalara yönelecek kullanıcı sayısı artacağı için doğrudan etkileyecektir. Sizden önce mixer kampanyaları için tercih edilen kullanıcılar diğer kampanyalara da başvurduğunda aynı sonucu görmeniz olası.Quote from: gospodin on December 03, 2023, 07:41:27 AMmixer ile ilgili imza kampanyalarının yasaklanmasını bir yere kadar anlayabilirim. çünkü bu işin ucu sadece forumun kapanması gibi basit yerlere gitmez. burada sorumlu olan kişilerin kafalarının kesilmesine bile  neden olabilir. anlamadığım konu ise forumda mixer ile ilgili bir link paylaşılmasının yasaklanması hatta bu eylemi yapan kişilerin banlanma riskine sahip olması.sanırım yavaş yavaş vahşi batının sonlarına doğru geliyoruz dostlar. lan ibibikler elon musk'u ne zaman asacaksınız?Hemfikiriz, desteklememek adına imza kampanyaları yasaklanabilir ama konuşulmasını tamamen yasaklamak olağanüstü bir önlem olmuş. Ha tabiki bunun altında yatan sebepte yine birilerinin imza kampanyası olmasa bile hakkında başlık açarak promote edebilecek olması olabilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "December 03, 2023, 07:17:13 PMLast edit: December 03, 2023, 07:29:29 PM by mandown",
      "body": "Belliki önüne gelene alakasız suçlardan suçlayabilmek için bir ara kapı buldular. Bu olay şuna benziyor araba alıyorsunuz kaza yapıyorsunuz aracı üreten suçlu  ozaman satoshide suçlu doları basanda suçlu forumun davranışu tamamen saçmalık. Ne yani burada millet birbirine sövüyor hakaret ediyor birşey olmuyor mod silerse siliyor silmezse tarihin tozlu sayfalarında kalıyor ama mixer konuşmak yassak kardeşim.İmza işi @bthd gibi düşünüyorum illa btc ödemeli imzalara girmek zorunda değiliz. Forum zaten yeterli bedava kaynak içeriyor kafayı çalıştıran oradan gelen bilgilerle imzanın kat ve katını zaten kazanabiliyor.İşin daha komiği forumda konuların ban sebebi olabilmesi kardeşim sen zaten sadece forumu kurmuşssun içine koyulan mesajlar mesajı yazanı ilgilendiriyor zaten forumdaki bilgileri gerekirse verdğini söylüyorsun bu kadar korkuyuda anlamış değilim. Ne yani buradan yola çıkarsak bu kadar forum yönetimi bu olaydan korkuyorsa bugün yarın bu forum sayesinde satoshi bile ortaya çıkartılabilir mi? Forumda kim neyden korkuyorda bu olay yasaklanacak konuma geliyor. Forumda en çok mesaj atanlardan biri benim hiç mixer kullanmadım ama ne olduğunu biliyoruz insanı resmen forumdan soğutuyorlar.Bunlar diyorki kardeşim şimdiye kadar sözde vahşi batıydı buralar dutluktu ama gerçekte öyle birşey yok biz başımıza gelebileceklerden korkuyoruz öylemi?  Forumdaki bu olaydan sonra daha önce konusunu açtığım pos olayına yavaş yavaş geliyoruz. Node mu kurdun gel bakayım neden kurdun sebebini açıkla? senin kurduğun node'dan dolayı verilen onaylar sayesinde kara para mı aklanıyor denecek? BTC POW yerine pos'a geçmiş olsa demekki şimdiye kadar defalarca fişi çekilmişti. Bu olay imzadan alacağınız üç beş kuruştan inanılmaz derece değerli ve önemli bir konu. Benzer olaylar dao'lar içinde olabilir olamazmı? Sen kimsinki para topluyorsun diyeceklerdir demiş bile olabilirler.Kripto da sessiz bir darbe yapılmış durumda. Bugün yarın bu imzalara girenler yani bizler kardeşim gel hele sen bu adamlar bu parayı sana neden verdi ben reklam söylemini görüyor olsamda inanmıyorum gel gereken cezayı öde derse ne olacak?efs mesajın sadece bir kısmını burada paylaşmış ancak orada çok ince bir ayrıntı kalmış bu forumda kyc toplamıyor ne yani burası içinde mi bir problem var? Çok saçma lan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vispilio",
      "created_time": "December 03, 2023, 08:34:01 PM",
      "body": "Ana konuda çok isabetli ve cesurca yorum yapan arkadaşlar oldu kendilerini tebrik ediyorum,bu kararın hiçbir savunulacak tarafı yok, @theymos'un bir lider olarak belki de Bitcointalk kariyeri boyunca yaptığı en büyük hata olabilir...ABD'nin kriptolara ve bütün dünyaya karşı giderek artan sansürcü ve totaliter tutumu göz önüne alındığında, ciddi bir kripto girişimcisinin ABD'de oturması ve ABD yasalarına bağlı servisler kullanması zaten başlı başına bir hata, ondan doğan zaafiyetler aslında bu kararı getirdi diye özetleyebiliriz konuyu, Meta'daki ana konuyu incelemenizi de tavsiye ederim, İngilizce çok bomba eleştiriler var ki çoğuna katılıyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "December 04, 2023, 09:13:16 AM",
      "body": "Birde aklıma geldi bugün yarın forumada kyc gelecek ozaman. Yada bu forum kapanacak sonuçta bugun bu şartları getirenler yarın başka seylerde isteyecektir. Bu işin malesef sonu yok foruma olan bütün zevkim kaçtı gitti.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "December 04, 2023, 05:09:57 PM",
      "body": "Quote from: bobita on December 01, 2023, 10:52:47 PM...Ayrıca kimse kusura bakmasın ama (yine kendi adıma konuşuyorum), sınırlı anonimliğimin bedeli başkalarının terörden, uyuşturucudan, çocuk pornosundan, yasa dışı kumardan, dolandırıcılıktan vb vb (yüz tane kalem sayılabilir) kazandıklarını rahatça sisteme sokabilmeleri olacaksa ben bu anonimlikten feragat ediyorum. Bunu söylemem otoritenin tam kontrolünde, merkezi ve anonimlikten uzak bir finans sisteminde sakınca görmediğim anlamına gelmiyor ama kar/zarar kıyası yapınca bunu tercih ediyorum.büyük oranda benzer fikirlere sahibim, bizim elimize sapı plastik/ahşap olmayan bir bıçak verilmiş, \"bu bıçak ile isterseniz meyve, isterseniz adam kesebilirsiniz, eylemlerinizin sorumlusu bizzat sizlersiniz\" diyemeyiz, bu bıçak \"bıçağı tutan kişiye ve dolaylı olarak bıçağı tutan kişinin içinde bulunduğu topluma\" zarar veriyor. o halde bir kanun ve yaptırımdan söz etmek zorundaysak önleyici olmasını da pek tabii arzu edebiliriz...ayrıca, merkeziyetsiz veri depolama teknolojileri ve web3 teknolojisi yeterince gelişinceye kadar onlar güçlü... haklı olanın değil, güçlü olanın kanunları işliyor...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bobita",
      "created_time": "December 04, 2023, 08:57:27 PM",
      "body": "Quote from: gospodin on December 03, 2023, 07:41:27 AMmixer ile ilgili imza kampanyalarının yasaklanmasını bir yere kadar anlayabilirim. çünkü bu işin ucu sadece forumun kapanması gibi basit yerlere gitmez. burada sorumlu olan kişilerin kafalarının kesilmesine bile  neden olabilir. anlamadığım konu ise forumda mixer ile ilgili bir link paylaşılmasının yasaklanması hatta bu eylemi yapan kişilerin banlanma riskine sahip olması.sanırım yavaş yavaş vahşi batının sonlarına doğru geliyoruz dostlar. lan ibibikler elon musk'u ne zaman asacaksınız?İşte bu tespitlerin bana göre bu kararın forum yönetimine büyük ölçüde \"aldırıldığının\" kanıtı zaten, kaldı ki yönetimin şu ana kadar olan genel anlamda tavır ve kararlarına bakarsak bu gelişmenin çok bağdaşmadığını rahatlıkla görebiliriz. Ha, böyle bir baskı olduğunda forum olabildiğince direnç göstermiş midir ya da atılan pası gole mi çevirmiştir, onu bilemem ama işin içinde başka eller olduğu belli.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}