{
  "id": "topic_5521653",
  "title": "Jating",
  "author": "Jating",
  "created_time": "December 05, 2024, 02:01:22 AM",
  "content": "Anyone heard the latest stance of Putin as far as Bitcoin goes?QuoteGiven that the share of the United States in the global economy is decreasing, the influence of US Dollar on global economic process is also diminishing. So the emergence of alternative tools is a natural process.Take Bitcoin for example, who can ban it? No one.So I guess Putin already admitted that they might be stacking Bitcoin to circumvent the ban on them because of the continue war with Ukraine.And with that, whether we like it or not, Bitcoin is going to be used in this kind of situations and probably there will be hate coming because of Putin's statement. But regardless, I see the price pumping to $98k in the last couple of hours.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5521653",
  "comments": [
    {
      "author": "BADecker",
      "created_time": "December 05, 2024, 02:10:45 AM",
      "body": "At the same time Russia is stockpiling gold and silver.Russia Temporarily Bans Export of Gold and Silver Scrap https://activistpost.com/2024/12/russia-temporarily-bans-export-of-gold-and-silver-scrap.htmlThis strategic move is intended to boost the country's gold and silver supplies and direct those resources to domestic production. In effect, the Russian government hopes the ban will support domestic industries, enhance government revenues, and tighten control over the trade of valuable resources.Recycled gold accounts for about 25 percent of the annual global supply, with mine output making up the difference. Scrap makes up about 18 percent of the annual silver supply....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reljjh",
      "created_time": "December 05, 2024, 02:11:50 AM",
      "body": "He is lying. It is easy for a dictatorship to destroy cryptocurrencies. Most people know that the Chinese Communist Party has GFW, but few people know that they have stronger means than GFW, the whitelist mode.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "freedomgo",
      "created_time": "December 05, 2024, 02:41:48 AM",
      "body": "If they seriously join the conversation about making Bitcoin a national reserve, then that’s when his statement might start to seem real. The U.S. knows the dollar’s influence has weakened, and they’re reportedly considering Bitcoin as part of their national reserve. There was even news suggesting they might sell a portion of their gold reserves to speed up Bitcoin acquisition, aiming for 5% of the total market supply. If this happens, it would be a monumental shift in how nations view and adopt Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "December 05, 2024, 04:51:41 AM",
      "body": "We didn't really need some politician to tell us nobody can stop/ban bitcoin, we already knew that. Putin's random statements about bitcoin is just as insignificant as Trump's.The only thing that matters is their actions. If this leads to governments competing on accumulating bitcoin, then that is what we should discuss. I personally consider it a net negative thing even though it may have some positive sides like price rise and adoption rise. Because this gives these centralized authorities the power to significantly influence the price. They could end up manipulating the price to make profit, we already know US government has the biggest debt and Russian economy is also facing a lot of issues. If they start trying to make profit from bitcoin price manipulation, it is terrible for bitcoin.Quote from: BADecker on December 05, 2024, 02:10:45 AMAt the same time Russia is stockpiling gold and silver.Any government with a \"brain\" has been accumulating gold for a couple of years now. I picked up the first signs back in 2022:https://bitcointalk.org/index.php?topic=5418480.0https://bitcointalk.org/index.php?topic=5432581.0#WordWar5",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reid",
      "created_time": "December 05, 2024, 05:38:41 AM",
      "body": "It could also be just a strategy. He knows what Trump said during his debates and statements about supporting Bitcoin and Putin doesn't want America to be that strong in the future if ever the value of Bitcoin grows more and America keeps Bitcoin as their reserve. Now, what he can do is use statements like this to bring Bitcoin down but I don't believe there are so many fools that invest in Bitcoin. They will keep on holding even if it's the North Korean dictator who says this kind of words.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "December 05, 2024, 06:00:28 AM",
      "body": "Quote from: reljjh on December 05, 2024, 02:11:50 AMHe is lying. It is easy for a dictatorship to destroy cryptocurrencies. Most people know that the Chinese Communist Party has GFW, but few people know that they have stronger means than GFW, the whitelist mode.Now let's count how many times he in particular had banned Bitcoin and then in-banned it, the banned again and unbanned again.Putin knows he's powerless against Bitcoin. Everyone is. No one person can gain privileged access into the system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "December 05, 2024, 07:32:02 AM",
      "body": "Quote from: Jating on December 05, 2024, 02:01:22 AMAnyone heard the latest stance of Putin as far as Bitcoin goes?QuoteGiven that the share of the United States in the global economy is decreasing, the influence of US Dollar on global economic process is also diminishing. So the emergence of alternative tools is a natural process.Take Bitcoin for example, who can ban it? No one.From no one can stop BRICs, now Mr. Putin switched his focus on Bitcoin, \"No one can stop Bitcoin\", that's right, that's truth but let's think why he had to change. It's not about Bitcoin, it's about benefits Russia and he can get by this big legal decision in this nation.Bitcoin is for everyone, every country and Putin can not control it as his own national currency, he will never be able to do this. Russia is one of pioneering countries with CBDCs. The pilot phase was completed successfully and the last update is this one.https://cbdctracker.org/currency/russian_federation-digital_ruble",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FortuneFollower",
      "created_time": "December 05, 2024, 07:37:15 AM",
      "body": "Quote from: NotATether on December 05, 2024, 06:00:28 AMQuote from: reljjh on December 05, 2024, 02:11:50 AMHe is lying. It is easy for a dictatorship to destroy cryptocurrencies. Most people know that the Chinese Communist Party has GFW, but few people know that they have stronger means than GFW, the whitelist mode.Now let's count how many times he in particular had banned Bitcoin and then in-banned it, the banned again and unbanned again.Putin knows he's powerless against Bitcoin. Everyone is. No one person can gain privileged access into the system.Yeah, it's a cycle of a gov that doesn't know what to do with something they can't control.The only question is when would they stop to see the potential for BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "betswift",
      "created_time": "December 05, 2024, 07:39:57 AM",
      "body": "Quote from: Reid on December 05, 2024, 05:38:41 AMIt could also be just a strategy. He knows what Trump said during his debates and statements about supporting Bitcoin and Putin doesn't want America to be that strong in the future if ever the value of Bitcoin grows more and America keeps Bitcoin as their reserve. Now, what he can do is use statements like this to bring Bitcoin down but I don't believe there are so many fools that invest in Bitcoin. They will keep on holding even if it's the North Korean dictator who says this kind of words. It wouldn't have so much of an effect in my opinion.In my eyes - it's just a fuzz.Neither Trump nor Putin are crypto enthusiasts - they use crypto as a lever to do something they really want.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "john_egbert",
      "created_time": "December 05, 2024, 07:41:33 AM",
      "body": "Quote from: reljjh on December 05, 2024, 02:11:50 AMHe is lying. It is easy for a dictatorship to destroy cryptocurrencies. Most people know that the Chinese Communist Party has GFW, but few people know that they have stronger means than GFW, the whitelist mode.It's easy for them to say - I ban X (crypto, a coin on the market, etc.) - but they can't destroy it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fikrett",
      "created_time": "December 05, 2024, 07:45:53 AM",
      "body": "Quote from: pooya87 on December 05, 2024, 04:51:41 AMQuote from: BADecker on December 05, 2024, 02:10:45 AMAt the same time Russia is stockpiling gold and silver.Any government with a \"brain\" has been accumulating gold for a couple of years now. I picked up the first signs back in 2022:https://bitcointalk.org/index.php?topic=5418480.0https://bitcointalk.org/index.php?topic=5432581.0#WordWar5Hearing about the amount of sanctions they themselves do have on their necks - it's natural, I do agree.Thanks for the interesting threads to read along in the near future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "December 05, 2024, 08:27:01 AM",
      "body": "Quote from: freedomgo on December 05, 2024, 02:41:48 AMIf they seriously join the conversation about making Bitcoin a national reserve, then that’s when his statement might start to seem real. The U.S. knows the dollar’s influence has weakened, and they’re reportedly considering Bitcoin as part of their national reserve. There was even news suggesting they might sell a portion of their gold reserves to speed up Bitcoin acquisition, aiming for 5% of the total market supply. If this happens, it would be a monumental shift in how nations view and adopt Bitcoin.All of that is just Senator Lummis' call to Congress, the proposal to sell gold or use bitcoin as a national reserve has not yet become an official proposal for consideration. Also, the US accumulating and turning bitcoin into a national reserve has nothing to do with the USD and will not make the USD stronger, it is just a strategy to diversify national reserves. They will focus on protecting USD dominance because USD strength is their strength. I don't think they will abandon USD and choose bitcoin as an alternative, that will never happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MeGold666",
      "created_time": "December 05, 2024, 08:58:16 AM",
      "body": "I'm sure his technical advisors will let him know how wrong he is and that, with the increasing centralization of hashrate in the USA, it will be very easy to blacklist transactions at the mining level and even if this blacklisted coins finds their way to the block, no one in the right mind will want them as they will be marked forever.What Putin needs is Monero, as miners can't blacklist transactions because they are encrypted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "December 05, 2024, 09:14:13 AM",
      "body": "Seeing his words saying that no one can prevent the development of Bitcoin, I agree with what he said, because if we look back at how many governments have banned Bitcoin and how many officials or rich people have spread FUD to Bitcoin and said that it is just a ponzi scheme, but it continues to grow, and just now it printed a new ATH at $100k USD. That alone proves how powerful Bitcoin is - and it continues to grow and even if many people don't like it much, it will continue to spread globally and its adoption will increase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "December 05, 2024, 09:15:48 AM",
      "body": "Noise  Bitcoin is now so important that it is a must for every countries to have, you are a big fool if you believe that 1million dollars per Bitcoin is impossible, now that 100k is achieved, x10 is all Bitcoin need to reach 1M in the future, the more countries that accept that Bitcoin isn't a threat the more valuable it will become. 0.01 BTC will be the new target for many starting from now, you have this amount, you are set for life, this will serve as an example to all the non believers who think that Bitcoin value is too high. It was too high at $1,500, and it became too high at $16,000, then again it was extremely difficult to accumulate in 2021 @69,000, same old story till 1 Million dollars.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "December 05, 2024, 09:32:38 AM",
      "body": "Quote from: pooya87 on December 05, 2024, 04:51:41 AMWe didn't really need some politician to tell us nobody can stop/ban bitcoin, we already knew that. Putin's random statements about bitcoin is just as insignificant as Trump's.The only thing that matters is their actions. If this leads to governments competing on accumulating bitcoin, then that is what we should discuss. I personally consider it a net negative thing even though it may have some positive sides like price rise and adoption rise. Because this gives these centralized authorities the power to significantly influence the price. They could end up manipulating the price to make profit, we already know US government has the biggest debt and Russian economy is also facing a lot of issues. If they start trying to make profit from bitcoin price manipulation, it is terrible for bitcoin.Putin is another politician making some statement about what almost everyone knows in this forum. It is quite unfortunate that we now celebrate what politicians and big firms say about Bitcoin because of the influence in price and adoption. We should also be prepared to endure or face the consequences when the same people begin to talk down on Bitcoin and eventually abandon it (which is highly unlikely). Politicians cannot be trusted because what they give priority today might be abandoned tomorrow. The same politician who is calling Bitcoin gold today can call it a thrash later, and we all know what will happen to the price when such happens. With or without politicians, Bitcoin will be what it is destined to be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "December 05, 2024, 09:37:23 AM",
      "body": "I think he made some common sense. There are still many states left to capitulate, but eventually they will. We have gone from mini-valuing it, to wanting to ban it, to regulating it, and now to massively embracing bitcoin. It started in El Salvador but with what it will do in the USA in 2025 a game theory will be unleashed in which the fool will be the last one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "December 05, 2024, 09:49:19 AM",
      "body": "Quote from: MeGold666 on December 05, 2024, 08:58:16 AMI'm sure his technical advisors will let him know how wrong he is and that, with the increasing centralization of hashrate in the USA, it will be very easy to blacklist transactions at the mining level and even if this blacklisted coins finds their way to the block, no one in the right mind will want them as they will be marked forever.What Putin needs is Monero, as miners can't blacklist transactions because they are encrypted.Most of the exchanges have delisted Monero, so it's an ongoing fight for the Monero community to establish new P2P markets, centralized and decentralized.There is currently Haveno-reto (RetoSwap), and that's about it for now. As well as a handful of exchanges who still have Monero listed, and Bisq.Of course no government will help them in this regard.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "December 05, 2024, 10:56:09 AM",
      "body": "Yesterday I listened to it in the background as I was busy with other things. But when I heard the statement that no one can ban Bitcoin, I shuddered and laughed, as it was a \"revelation\" for me. A question immediately arose for Nabiullina, and her opinion, as always, as an indicator of misunderstanding, will be separate from the opinion of even the president. It is good that people are starting to wake up and understand that the sea or the wind is difficult to close with your hands.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}