{
  "id": "topic_5441163",
  "title": "Macadonian",
  "author": "Macadonian",
  "created_time": "February 25, 2023, 12:23:47 AMLast edit: February 28, 2023, 10:11:52 PM by Macadonian",
  "content": "Mankind has been looking for a solution to its problems for many years. Our Ancestors needed to find shelter, food and water. These things are often taken granted by most of the world but another problem is plaguing us every decade and it will continue to plague us if there is not a solution. I want to investigate whether that solution is already here and if people have not yet woken up to the solution. Some of us seeking a solution have turned to religion some have turned to the government and a few others have decided to take it into their hands. Satoshi was one of the few who took it into their own hands. Satoshi is often discussed and theorized about but I am not going to go into that cultish behavior today instead I will look at what motivated Satoshi to look for an answer and delve deep into the financial crisises which continue to plague our world. No one knows how old Satoshi was but I will look at the last 50 years and identify the most relevant financial crisises that might have been the motivation for Satoshi. I will include the present day to show that despite Bitcoin existing the world has yet to adopt it and I want to discuss with you guys if you think Satoshi's goal was achieved because financial crises still exist today but is that only because the world has not converted to using Bitcoin? I want your help on my reasoning because I know some of them will not be accurate and will need to be refined but I hope we can refine them and continue to add financial crisis and explain why Bitcoin can help prevent it form reoccurring and when people visit this forum they can read about past problems which can be solved if they convert to Bitcoin and hopefully it can help with adoption.First this is a list[1] of 'financial crisis' that have occurred in the last 50 years including the present day: 1970s 1970s energy crisis OPEC oil price shock (1973)1979 energy crisis (1979)Secondary banking crisis of 1973–1975 in the UKLatin American debt crisis (late 1970s, early 1980s) known as \"lost decade\"1980s  Early 1980s RecessionChilean crisis of 1982Bank stock crisis (Israel 1983)Japanese asset price bubble (1986–1992)Black Monday (1987) (1987) (US)Savings and loan crisis failure of 1,043 out of the 3,234 S&Ls from 1986 to 1995 in the U.S.1990s  Special Period in Cuba (1990–1994)Early 1990s Recession1991 Indian economic crisisFinnish banking crisis (1990s) (1991–1993)Sweden financial crisis 1990–1994Black Wednesday (1992)Mexican peso crisis1997 Asian financial crisis1998 Russian financial crisis1998–1999 Ecuador economic crisis1998–2002 Argentine great depressionSamba effect (1999) (Brazil)2000s1998–2002 Argentine great depressionEarly 2000s recessionDot-com bubble (2000–2002) (US)2001 Turkish economic crisis2001 September 11 Attacks2002 Uruguay banking crisisVenezuelan general strike of 2002–03Finance company collapses, 2006–2012 (New Zealand)Financial crisis of 2007–2008Great Recession (worldwide)2000s energy crisis (2003–2009) oil price bubbleSubprime mortgage crisis (US) (2007–2010)United States housing bubble and United States housing market correction (US) (2003–2011)Automotive industry crisis of 2008–2010 (US)2008–2011 Icelandic financial crisis2008–2010 Irish banking crisisRussian financial crisis of 2008–20092008 Latvian financial crisisVenezuelan banking crisis of 2009–102008-14 Spanish financial crisis2010s European sovereign debt crisis (EU) (2009–2019) Greek government-debt crisis (2009–2019)2010–2014 Portuguese financial crisis 2012–2013 Cypriot financial crisis (2012–2013)Crisis in Venezuela (2012–now)Russo-Ukrainian War (2014–now)2014 Russian financial crisis2014–2017 Brazilian economic crisis2015 Chinese stock market crashTurkish currency and debt crisis, 2018Argentine monetary crisis2020s  COVID-19 recession / Economic impact of the COVID-19 pandemic (2020–present day)2020 stock market crash (2020)Black Monday (9 March)  Black Thursday (12 March)Lebanese liquidity crisisSri Lankan economic crisis2020–2022 Chinese property sector crisis2022 Pakistan economic crisis2022 Russian financial crisis Source: https://en.wikipedia.org/wiki/List_of_economic_crises Talking about all of these will take too much time but I will pick 1 or maybe 2 from each decade and explain what happened and why I think Bitcoin is the answer to the crisis. I would like to hear in the comments what you think about my reasoning and if you can add anything. I want to know truly if you think Bitcoin is the answer to these financial crisises I want to be clear I do not think that Bitcoin is the answer to all of these events but I do think it can solve a lot of them. There are other crisis events that happened that are not included on this list and if you have any input on these please include them below and I will add them to the list.  1970s - The Latin American Debt Crisis AKA \"THE LOST DECADE\"  This financial crisis affected  Mexico, Brazil, Argentina, Venezuela, Chile, Peru, Ecuador, Bolivia, Uruguay and Paraguay. These countries had all borrowed from Citibank who were the largest lender at the time, Inter-American Development Bank and Saudi Arabia. Citibank alone wrote off billions of dollars worth in loans and that is without counting the other loanees that are not mentioned. You will find out later that Citibank have been involved in numerous scandals and are 1 of the reoccurring lenders in this list[2]The countries mentioned applied for large amount of loans mainly for infrastructure and because most of the countries had a good economies at the time of applying for the loans they were granted them but infrastructure often costs more then estimated and unexpected delays often occur. It was not different for these countries with projects getting delayed they did not make enough progress to see a return off the infrastructure in the time required to pay off the loans. The delays meant they were not meeting the interest payments and they were losing money because of the inflation of their economy. According to the Wikipedia article[3] they were accumulating 20.4% and led to them x4 their debt to foreign banks. The debt was settled in mid to late 1980s but it was at a large cost to the countries that borrowed the money and I think they are still paying the price of borrowing the money. When you mention these countries today they are experiencing high levels of inflation, high living costs and the homeless population is very large. A lot of which is the outcome of borrowing money from the banks and the borrowers defaulting on the loans because of rising inflation costs and because banks demand high interest repayments. The AnswerBanks, the buzz word of any Bitcoin maximalist but they have a good reason to hate them because without the banks lending money and applying large repayments to the borrowed money these countries would have never experienced the economy crisis. If banks did not exist they would not be able to develop the infrastructure without investing with their own money. Borrowing money from a bank and expecting to pay it off from the new income generated by the infrastructure is called gambling and because the banks own most of the money of the world they are the only centralized figure that can offer loans at crazy interest rates. When people default on their payments to banks their debt often gets written off by the government and the government prints money and increases the inflation further. Bitcoin does not have banks and there is no centralized figure that will provide you with loans. Forcing countries to only invest what they can afford instead of borrowing money to build infrastructure. Governments would not print more money off  which is the cause of most of the inflation and with no inflation loans would be easier to pay off because the interest rates will be lower. When a government increases the amount of money in the world the inflation goes up making your money from yesterday not worth as much as today. I do not expect Bitcoin to eliminate borrowing money but it is only so popular because the banks are pressuring countries into loans. Without banks we do not see countries using money that they do not own to develop projects which could incur more costs then estimated because Bitcoin operates on a decentralized network it does not follow the regulations that banks of today need to comply too. Which means there might be more freedom with P2P lending and I think at reduced rates and fairer rates because they are not being offered by a centralized figure but instead by a lot of smaller lenders which creates competition and fairer rates.  1980s - Bank stock crisis (Israel 1983) Rapid growth in economy might be exciting to read about but when you have rapid growth with fiat currencies it usually means when the exponential growth stops so does the money. Jobs will be cut and people a recession will begin. This is what happened in Israel they had a economy surge from the 1970s and then suddenly around 1983 when their boom ended they were hit by high inflation and high interest rates. When they could not pay off their loans they borrowed to fuel their economic boom they cut government spending and increased interest rates which affected the cost of living for the people of Israel. This meant that people were without jobs, food and shelter because the inflation rates priced people out of a home. The people of Israel lost faith in the banks and started withdrawing their money which meant the country fell into a liquidation crisis with many of the countries largest banks nearing bankruptcy the government needed to bail out the banks and cancel their debt unfortunately this is something that you will hear a few times in this list. Governments are forced to bail out banks that have tried to profit from the economic boom causing more inflation by forgiving the debts and printing more money off. [4]The AnswerAgain banks are the cause of a countries problems. Banks continue to try to profit off economic booms and in an attempt to fuel their greed they lend their customers that have stored money in the bank to riskier and riskier borrowers expecting to profit off the surge of borrowers looking to gamble on the current economic boom. When the economic boom ends the risky borrowers default on their loans which means the country suffers a liquidation crisis because people do not have their money any more because the banks used it to lend. Bitcoin solves this. You will be your own bank and Bitcoin does not gamble your money by lending to risky borrowers. The way banks work is by risking your money that you put in and they attempt to loan borrowers money hoping for a profit. But they know the risks and it is one of the biggest scams on earth because they are not using their own money but their customers. They are convincing their customers that they need the security of the bank and then using that money to fuel their own greed by trying to triple your money but they do not give you that money they keep that for them selfs. They pay them selfs big bonuses each year based on the profit earned through repayments and only give you a small interest to try and encourage you to keep your money in their bank for longer. With Bitcoin you are the bank and you know that your money is safe and cannot be lost through a 3rd party gambling your money.  Finnish banking crisis of 1990s Some banks allowed politicians to loan money without meeting the normal criteria of the banks [5]  but when those politicians could not meet the payments they defaulted leaving the banks with no return for their investment. I think the banks were investigated for corruption because they ignored the criteria that they required for other investors and because politicians occupy a special type of role in society they were granted it. Only the most well known banks and politicians were investigated but the truth is not everything has been revealed and a lot of the money is unaccounted for. This is corruption and is not easily proved with the current money systems. Banks practices are not monitored and they can hide information. They provided loans to high profile people that did not meet the requirements for loans which I think means they probably worked out deals that were illegal and were using their influence in government positions to secure the loans. Probably money being exchanged for promises to let banks escape some of the regulations that they need to follow.  The Answer If we did have lenders in Bitcoin then the Blockchain provides a transparency and discourages corruption. As we seen in the Finnish banking crisis there was many banks offering loans to high profile people without them meeting the criteria of the banks in more easy words they were offering loans to risky borrowers because they did not satisfy the financial requirements that every other person would need to meet. Most of the money was unaccounted for and this behavior only came to light because of the crisis but there are probably many examples of banks offering money to high profile people because of their position. Bitcoin with the Blockchain can prevent this because every transaction is recorded on the Blockchain. Banks or lenders would have their lending practices monitored and questions can be asked of suspicious amounts to suspicious people. We could have high profile people in government required to declare their Bitcoin addresses because governments of servants of the people. When they have declared their address their salary would be public knowledge and any loans they incur would be public knowledge. It would be easy to determine which bank has loaned a government official money and whether it satisfies the criteria of the bank. The criteria can be determined by analyzing previous loans that have been granted on the Blockchain.  The GREAT recession Most of us know the great recession in the 1930s but this is the 1 which I think is more significant because it might be what motivated Satoshi to create Bitcoin. We are all probably very familiar with this because this is when the banks worldwide were bailed out. Satoshi even left a message on the genesis block indicating his motivation in creating Bitcoin and was the latest development before Bitcoin was released in 2009. This recession was created by a lot of things all at once but I think the biggest problem was the housing crisis because banks were offering a lower deposit for homes and offering higher mortgages then normal. People were buying houses out of their earning potential. I think the normal calculation is 3x your annual salary in the 2000s people were borrowing up to x5 their annual salary. The banks again got greedy and wanted to profit from the housing boom of the late 90s and offered mortgages which were not sustainable. When people started missing payments for mortgages the liquidation crisis began and the similar story happened where the government had to forgive the debts of the banks and bail them out.  The answer Quote“The Times 03/Jan/2009 Chancellor on brink of second bailout for banks”[6]Bitcoin offers decentralization and I think the message Satoshi left in the genesis block is a direct attack on banks. He is saying that banks are not needed and I think the message is announcing Bitcoin as the bail out. Instead of a bail out for the banks I think it is more a bail out for the people using Bitcoin. Banks have plagued the economy for many years there are many examples in my 50 year list but before my list there are more bank bail outs. I would like to look at all bank bail outs ever recorded and demonstrate how banks never get punished for their investments, get bailed out by the government and then continue to do what they did to get them bailed out. But their actions have a big impact on the economies of countries and we are all paying the inflation costs that have been caused by banks. Bitcoin solves this because banks do not need to exist which means there is no central authority pushing up inflation because of bad investments. You do not need to trust banks when they freeze your assets because of their own investments. You will never be stopped from withdrawing your money because you are in charge of your wallet. Bitcoin is transparent and stops corruption of banks and the government. Bitcoin is deflationary because it is limited to 21 million coins which are not all available from the start. The halving is the only thing that increases the amount of Bitcoin in circulation and they are limited and preprogrammed to do it at a certain time to reduce the impact it has on the price causing volatility which is the opposite to what governments do when printing out money. When block rewards are no longer being mined Bitcoin will continue to be deflationary and will not be as volatile. When we have less inflation caused by banks and defaulted loans and a deflationary currency people earn money instead of lose it and the economy does not see these crisises.I wonder if Satoshi was developing Bitcoin before the great recession  because I do not think he could have reacted quick enough to develop Bitcoin in the time frame where the great recession started and ended. This is why I wanted to create this list and look at what else could have motivated him. Satoshi created a message in the genesis block about bank bail outs but maybe that was just a statement based on the current bank bail outs but there were many other financial crisises that could have led to him creating Bitcoin.  Present Day  We are still experiencing financial criseses and we will continue to experience them for as long as we use government controlled money. Governments continue to print off money which increases the inflation. Banks continue to be trusted and offering money to risky borrowers which eventually default. The banks are not punished and are bailed out by the government by writing off their debts. The government prints off more money and increases inflation. This is the current cycle we have seen for the last 50 years and will continue to do so until the people start making the change from government & bank controlled money to Bitcoin. Bitcoin is the answer to most of our problems and if it does not solve our money problems completely it will reduce them. Be in charge of your money and stop central figures from controlling it. Buy Bitcoin and use it but it is not meant to solve all problems and other currencies will always have a reason to be around but decentralization and transparency is solved with Bitcoin. 1: https://en.wikipedia.org/wiki/List_of_economic_crises2: https://money.cnn.com/2008/08/01/news/companies/citigroup_cuomo/index.htm?postversion=20080801153: https://en.wikipedia.org/wiki/Latin_American_debt_crisis4: https://en.wikipedia.org/wiki/Bank_stock_crisis_(Israel_1983)5: https://en.wikipedia.org/wiki/Finnish_banking_crisis_of_1990s6: https://www.investopedia.com/terms/g/genesis-block.aspI would appreciate help with wording things and making sure they are accurate. I will continue to edit and add to this as time progresses.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441163",
  "comments": [
    {
      "author": "Darker45",
      "created_time": "February 25, 2023, 01:43:40 AM",
      "body": "I'm not sure if Satoshi's motivation in creating Bitcoin were the financial crises that hit the world. He/she/they might have seen the shortcomings of fiat currency and the system that nurtures it, but Satoshi actually took off from the past creations of those who attempted to create a digital currency. To a certain extent, Bitcoin is an amalgamation of all those, together with Satoshi's own contributions. In the whitepaper, the goal is very simple. It was to create an electronic cash system. There wasn't even a slight mention of attempting to provide solution to the recurring financial crisis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tech30338",
      "created_time": "February 25, 2023, 06:54:27 AMLast edit: February 25, 2023, 07:19:13 AM by tech30338",
      "body": "As we progress and exist in this world we can encounter problems along the way since there is a need for something, with that it creates a problem to solve that issue, that will be a trend as time goes, bitcoin can be alternative payment system, and also for us to be free without any control from an organization, holding our money captive in their banks, where they make profit out of our hard earn money.I just think those incidents were man made to capitalized and get profit from the people, in return this people became richer and others became more poor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uchegod-21",
      "created_time": "February 25, 2023, 06:39:57 PM",
      "body": "Quote from: Darker45 on February 25, 2023, 01:43:40 AMI'm not sure if Satoshi's motivation in creating Bitcoin were the financial crises that hit the world. He/she/they might have seen the shortcomings of fiat currency and the system that nurtures it, but Satoshi actually took off from the past creations of those who attempted to create a digital currency. To a certain extent, Bitcoin is an amalgamation of all those, together with Satoshi's own contributions. As against Op, I do not think that the major reason why Satoshi created Bitcoin was to solve financial problems. Although the 2008 financial collapse was a motivation. But in the Bitcoin whitepaper it is stated that Satoshi wanted freedom more than richness. He wanted Bitcoin as an alternative decentralized finance for the world and I think the purpose is on course. It is only the volatility of bitcoin that makes it become more of an investment asset.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Macadonian",
      "created_time": "February 26, 2023, 11:45:14 AM",
      "body": "Quote from: uchegod-21 on February 25, 2023, 06:39:57 PMAs against Op, I do not think that the major reason why Satoshi created Bitcoin was to solve financial problems. Although the 2008 financial collapse was a motivation. But in the Bitcoin whitepaper it is stated that Satoshi wanted freedom more than richness. He wanted Bitcoin as an alternative decentralized finance for the world and I think the purpose is on course. It is only the volatility of bitcoin that makes it become more of an investment asset.Freedom because the banks and government run the world and they use the money system to keep you locked in. Bitcoin was created to solve a failing financial system and the financial crisis is a example but it shows how much control they have too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}