{
  "id": "topic_5411713",
  "title": "casinotester0001",
  "author": "casinotester0001",
  "created_time": "August 30, 2022, 10:39:38 AMLast edit: August 31, 2022, 10:59:24 AM by casinotester0001",
  "content": "5000 BTC from Satoshi-Era Wallet Moved, maybe 3 More Wallets Wait to Send Bitcoin as they have the same origin ~21000 BTC.A bitcoin address that had been dormant for nearly nine years transferred the entire balance of 5,001.51 BTCs to a new wallet on August 28, with a floating profit of more than $96 million.source: https://u.today/5000-btc-from-satoshi-era-wallet-moved-3-more-wallets-wait-to-send-bitcoinaddress: 15n6boxiQj45oHcmDjtNMjh35sFWZX4PBthttps://explorer.viawallet.com/btc/address/15n6boxiQj45oHcmDjtNMjh35sFWZX4PBtWhat for accounts are these? One might think lost wallet, but the owner proved that it's not.EDIT:Quote from: casinotester0001 on August 30, 2022, 07:40:31 PMQuote from: th3nolo on August 30, 2022, 07:13:07 PMAlso 5,000 BTC isn't that much compared to what some exchanges or funds have..Another transaction with 5,000 dormant Bitcoin  from 7y ~ 10y age bandhttps://www.technopixel.org/10-thousand-bitcoins-awakened-after-7-years-is-selloff-coming/This origin (~21000 BTC) is moving all their coins.One funny detail:transaction 0219d5bd944889a670687ffdf75e2d265b6066a355118eedd860a6aeb6f2eb32https://explorer.viawallet.com/btc/tx/0219d5bd944889a670687ffdf75e2d265b6066a355118eedd860a6aeb6f2eb321 input ~5000 BTC171 outputs, several outputs with exactly 47.98469209 BTC Has someone an explanation for these several 47.98469209 BTC? Check the transaction: https://explorer.viawallet.com/btc/tx/0219d5bd944889a670687ffdf75e2d265b6066a355118eedd860a6aeb6f2eb32",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411713",
  "comments": [
    {
      "author": "franky1",
      "created_time": "August 30, 2022, 11:04:22 AM",
      "body": "first TX was in 2013not satoshi erathis could be one of the MTgox batches as its more of mtgox era not satoshi era",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "larry_vw_1955",
      "created_time": "August 30, 2022, 02:09:47 PM",
      "body": "Quote from: franky1 on August 30, 2022, 11:04:22 AMfirst TX was in 2013not satoshi erathis could be one of the MTgox batches as its more of mtgox era not satoshi eranevertheless kids, its good to understand that there's always people hodling bitcoin waiting for you to forget they have a huge stash they want to unload onto the market and they won't necessarily care if that makes your bitcoin become worth less in price when they do that. they're not using bitcoin to buy something or anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "August 30, 2022, 02:53:00 PM",
      "body": "Addresses and money like this move all the time, sometimes people are looking around for them and see them. Many times they do not.The OP seems to be digging into and poking around old addresses for some reason. I think everyone who gets into BTC does that at some point in time.Old addresses with a lot of funds are not that big a deal. If they have 1 like that they probably have more.Not something to worry about the trading volume of BTC is on the order of 1.5 million coins a day. Having a few thousand more dumped into it is not something to worry about.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "August 30, 2022, 03:03:46 PM",
      "body": "Quote from: casinotester0001 on August 30, 2022, 10:39:38 AMWhat for accounts are these? One might think lost wallet, but the owner proved that it's not.It's almost impossible to determine if a wallet is lost. Lack of activity is not enough pointer that an account is lost, it is just dormant at that time.I personally don't understand the point of following or discussing activity on different addresses. It does not impact the Bitcoin space and it's purely natural to have an address that has not moved or received funds for a period of time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "August 30, 2022, 03:15:10 PM",
      "body": "Quote from: casinotester0001 on August 30, 2022, 10:39:38 AMWhat for accounts are these?Who cares? The bitcoin belongs to this individual. They are free to hold it, move it, sell it, trade it, dump it, anything they want, without any input or interference from third parties. Such is the beauty of bitcoin.Quote from: larry_vw_1955 on August 30, 2022, 02:09:47 PMnevertheless kids, its good to understand that there's always people hodling bitcoin waiting for you to forget they have a huge stash they want to unload onto the marketThe number of provably lost bitcoin numbers a few thousand at most. There are over 19 million coins in circulation, any of which could be unloaded on to the market at any time. No one is waiting for the market to \"forget\" about their coins.Further, moving coins doesn't mean they are being sold.Quote from: larry_vw_1955 on August 30, 2022, 02:09:47 PMthey're not using bitcoin to buy something or anything.How do you know that? Perhaps this person has just bought a luxury mansion for $100 million.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "August 30, 2022, 03:37:52 PM",
      "body": "Quote from: larry_vw_1955 on August 30, 2022, 02:09:47 PMnevertheless kids, its good to understand that there's always people hodling bitcoin waiting for you to forget they have a huge stash they want to unload onto the market and they won't necessarily care if that makes your bitcoin become worth less in price when they do that. they're not using bitcoin to buy something or anything.Why sort of demonize it though? Everyone has the right to buy or sell their bitcoin, regardless of how it would affect the markets. And why do they need to care anyway? The markets will drop to some extent regardless if the x,xxx BTC owner wants the market to drop or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RapTarX",
      "created_time": "August 30, 2022, 05:21:35 PM",
      "body": "This doesn’t seem like an individual transaction. I just had a quick look. Either on the output address belong to an exchange or a service from where most of the output were spent as small balance to a lot of addresses. While another output has been sent to an address which has 10k bitcoin balance. I guess it's a fund/cold storage of any old service/exchange. Whatever they are, I guess these are not anymore much of thinking about. I have been watching such thread every now and then lately but have hardly seen any big movement on the price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "casinotester0001",
      "created_time": "August 30, 2022, 05:41:56 PM",
      "body": "https://explorer.viawallet.com/btc/tx/0e3bbffe872689e8b0da1f04218aed2f0a50c6de02886873348dc01a478eea4bThis mentioned address 15n6boxiQj45oHcmDjtNMjh35sFWZX4PBt received over the years lots of dust transactions or small BTC values from several people. Whoever moved these ~5000 BTC took these dust transactions or small value transactions too. Is this ok?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "August 30, 2022, 06:10:43 PM",
      "body": "Quote from: casinotester0001 on August 30, 2022, 05:41:56 PMIs this ok?Yes.Each of those small UTXOs adds around 150 satoshi to transactions size. Given that the fee rate used for the transaction in question was only 1.8 satoshi/byte, the fee added by each of them was lower than 547 satoshi and the sender didn't lose anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pealr12",
      "created_time": "August 30, 2022, 06:50:56 PM",
      "body": "Bro one whale can easily scoop up 5k btc without flinching, some people are already freaky out about the mtgox news even though it hasn't taken place yet. Sometimes it baffles me why people are too concerned with old wallet asset movement when we have only 21 million btc out of which some already probably lost forever and the most important thing is that 90% of the world's population doesn't own btc yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "th3nolo",
      "created_time": "August 30, 2022, 07:13:07 PM",
      "body": "This dude are still ppl publishing non-sense here to get merit's, activity and maybe some bread?Also 5,000 BTC isn't that much compared to what some exchanges or funds have.. get over it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "casinotester0001",
      "created_time": "August 30, 2022, 07:40:31 PM",
      "body": "Quote from: th3nolo on August 30, 2022, 07:13:07 PMAlso 5,000 BTC isn't that much compared to what some exchanges or funds have..Another transaction with 5,000 dormant Bitcoin  from 7y ~ 10y age bandhttps://www.technopixel.org/10-thousand-bitcoins-awakened-after-7-years-is-selloff-coming/This origin (~21000 BTC) is moving all their coins.One funny detail:transaction 0219d5bd944889a670687ffdf75e2d265b6066a355118eedd860a6aeb6f2eb32https://explorer.viawallet.com/btc/tx/0219d5bd944889a670687ffdf75e2d265b6066a355118eedd860a6aeb6f2eb321 input ~5000 BTC171 outputs, several outputs with exactly 47.98469209 BTC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "August 30, 2022, 08:10:49 PM",
      "body": "Quote from: casinotester0001 on August 30, 2022, 10:39:38 AMWhat for accounts are these?What accounts for the fact that 1,000 other users moved more than 1 BTC today?Nothing!Just because someone has held lots of BTC for many years shouldn't mean that he or she is first supposed to explain to use why they are moving the BTC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "casinotester0001",
      "created_time": "August 30, 2022, 08:28:34 PM",
      "body": "Quote from: DaveF on August 30, 2022, 02:53:00 PMAddresses and money like this move all the time, sometimes people are looking around for them and see them. Many times they do not.The OP seems to be digging into and poking around old addresses for some reason. I think everyone who gets into BTC does that at some point in time.6 months ago discovered the chapter \"lost/damaged wallets/passwords/keys\" in the Bitcoin world. Since then looking for stories, wallets, transactions that are connected with such addresses. So found also this address. But so far no clues whether it's a recovered wallet. I must say there are so many fantastic stories (but also lot of fake wallets, damaged keys). I hope that people who lost their keys can be able to get their coins one day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DigitalMonk",
      "created_time": "August 30, 2022, 08:37:22 PM",
      "body": "There are many people in the Bitcoin community, those who have a great concern about Satoshi's Stash of Bitcoin. Some of them are trying to find out if they can hack those old BTC Address. So they will become rich quick. This is a kind of stupidity, what we can say. If Satoshi want to move his Bitcoin he will do it after getting advise from Bitcoin community and other Bitcoin big business men. He will not do anything nonsense. Anyway, I can assure you that if he want to move his Bitcoin to another address for security or for selling, he will definitely inform  me first with a signed message. Now you are going to say, \"who do you think you are ? Are you Satoshi's  twin brother ? \"  Well, I am the only Digital Monk here in the  Bitcoin Talk Forum. So, please trust me, when Satoshi come back from his time traveling, he will inform me that he has returned. So please be patience !  I will inform the Bitcoin community, when he come back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "larry_vw_1955",
      "created_time": "August 31, 2022, 02:57:21 AM",
      "body": "Quote from: o_e_l_e_o on August 30, 2022, 03:15:10 PMWho cares? The bitcoin belongs to this individual. They are free to hold it, move it, sell it, trade it, dump it, anything they want, without any input or interference from third parties. Such is the beauty of bitcoin.Well, money gets confiscated from people all the time, fiat I mean. Go on a plane and don't declare your large sum of money and guess what? you don't own it anymore. You have to declare it. Let people know you have it. So how you are describing is like a perfect utopia that ignores how things work in the real world. Only in imaginary bitcoin land do they maybe work that way until you try stepping out into the fiat world. You can't do anything you want \"without any input or interference from third parties\" not in the real world, only in your imaginary bitcoin land maybe. QuoteHow do you know that? Perhaps this person has just bought a luxury mansion for $100 million.do you have a link to a story about someone doing that recently? i didn't think so. and if they did then don't you think someone has some serious taxes to pay? and wouldn't the government want to know who they are? the seller and buyer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "amishmanish",
      "created_time": "August 31, 2022, 03:35:33 AM",
      "body": "That's the beauty of Bitcoin. I see a lot of people saying what is the value of Bitcoin, i say ask this fellow, he will tell you better. I think the time he would have bought it, it might would havr costed him a few thousand dollars and now he is making big profit out of it after so many years. And it's his money let him do as he desires.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SpenserReed",
      "created_time": "August 31, 2022, 04:25:17 AM",
      "body": "Quote from: casinotester0001 on August 30, 2022, 10:39:38 AM5000 BTC from Satoshi-Era Wallet Moved, maybe 3 More Wallets Wait to Send Bitcoin as they have the same origin ~21000 BTC.It's strange that they didn't have any movement when BTC was over 50k...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "worle1bm",
      "created_time": "August 31, 2022, 04:55:26 AM",
      "body": "There are many wallets which have been dormant for years and suddenly they move some coins so it's not a big deal at all as you if you check for such addresses you will find coins movement from one wallet to another after so many years and that also with big amounts.They have acquired btc at cheap rates and now they see huge profits in them so they might have some plans but we can't account for each of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}