{
  "id": "topic_5460626",
  "title": "alegotardo",
  "author": "alegotardo",
  "created_time": "July 22, 2023, 12:37:41 AM",
  "content": "Então, há alguns anos eu lembro que debatíamos que um dos profissionais mais cobiçados do futuro certamente seria aquele que possuisse conhecimentos em blockchain, pois assim como o Bitcoin se popularizou a sua tecnologia atraiu o interesse de diversas empresas, principalmente pela questão de segurança que esse protocolo proposrciona.Então, a notícia é antiga, mas achoq que vale a pena a discussão sobre o fato de que o MEC autoriza primeira pós-graduação em Desenvolvedor Blockchain do BrasilCursos na área já tem aos montes, mas uma pós na área é de fato algo inédito e que vai somar muito no currículo de quem já está estudando na área, bem como as faculdades também devem se beneficiar muito.Na empresa onde trabalho estamos à procura de pelo menos uma pessoa que conheça dessa área, e olha... tá muito difícil encontrar profissionais.Eu mesmo já havia pensado em estudar a respeito, mas faz pouco tempo que entrei de cabeça em novos projetos e sinceramente não tenho tempo para isso agora, mas quem estiver \"disponível\" agarre a oportunidade assim que surgir, pois esse é e ainda vai ser um mercado muito cobiçado e com falta enorma de profissinais.P.S.: Para quem nunca postava nada por aqui, esse é meu segundo tópico em menos de 24 horas, então acho que já posso ser considerado um spammer",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460626",
  "comments": [
    {
      "author": "joker_josue",
      "created_time": "July 22, 2023, 07:20:45 AM",
      "body": "Acredito que mais faculdades irão criar cursos e certificados, pois é uma área em crescimento e que ainda tem pouco profissionais.Por outro lado, acho este também é o momento das empresas libertarem esse estigma que só é bom quem tem um canudo. Existe muitas pessoas, com excelentes capacidades, mas o facto de não se conseguirem encaixar nos modelos educativos existentes, não conseguem fazer os cursos superiores e acabam por perder oportunidades.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "July 22, 2023, 06:37:56 PM",
      "body": "Legal, eu entrei no site agora mesmo pra conferir e o valor dessa pós graduação é R$ 497,00 hoje, com suposto preço promocional, o normal seria  R$ 1.036,00Esse tipo de curso eu acredito que os responsáveis tenha que atualizar constantemente, pois a tecnologia muda rápido demais.Sobre o que você falou de encontrar profissionais da área, a impressão que tenho é que quem tem conhecimentos bons de blockchain são programadores excelentes e que provavelmente já tem algo construído e é bem de situação financeira, talvez já tenha algum projeto cripto, ou é entusiasta antigo de BTC e esse conhecimento ainda não chegou para quem começa a estudar programação.Em alguns anos deve mudar, mas por enquanto é o que acho",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "July 22, 2023, 06:51:40 PM",
      "body": "No MIT há vários cursos relacionados com blockchain e houve uma altura que eu estive para ingressar num, mas quando vi o preço, aquilo era mais que um mestrado aqui em Portugal. Eram cerca de 3000€. Já voltei a procurar esse curso e nunca mais o encontrei. Ou mudou de nome e de valor ou desapareceu mesmo!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "July 22, 2023, 07:02:09 PM",
      "body": "Quote from: alegotardo on July 22, 2023, 12:37:41 AMNa empresa onde trabalho estamos à procura de pelo menos uma pessoa que conheça dessa área, e olha... tá muito difícil encontrar profissionais.Eu mesmo já havia pensado em estudar a respeito, mas faz pouco tempo que entrei de cabeça em novos projetos e sinceramente não tenho tempo para isso agora, mas quem estiver \"disponível\" agarre a oportunidade assim que surgir, pois esse é e ainda vai ser um mercado muito cobiçado e com falta enorma de profissinais.Mas o que é mais interessante: Qual é o salário para esse tipo de atividade ? Não adianta nada fazer uma pós-graduação, dezenas de cursos na área para depois te pagarem no máximo 2 ou quiçá 3 salários mínimos brasileiros. Coloquei salário mínimo brasileiro, pois já vi que na Europa paga-se muito mais para esse tipo de profissional. Principalmente na Alemanha.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "July 22, 2023, 10:19:53 PM",
      "body": "Quote from: Paredao on July 22, 2023, 07:02:09 PMMas o que é mais interessante: Qual é o salário para esse tipo de atividade ? Não adianta nada fazer uma pós-graduação, dezenas de cursos na área para depois te pagarem no máximo 2 ou quiçá 3 salários mínimos brasileiros. Coloquei salário mínimo brasileiro, pois já vi que na Europa paga-se muito mais para esse tipo de profissional. Principalmente na Alemanha.Ah... não é muito. Varia entre 12mil e 20mil por mês. Mas assim, junto com as campanhas de assinatura do Bitcointalk, acho que dá pra sobreviver Fonte: https://www.glassdoor.com.br/Sal%C3%A1rios/blockchain-developer-sal%C3%A1rio-SRCH_KO0,20.htmClaro que Blockchain é um termo bastante abrangente e qualquer curso/pós que tiver ou vai ser muito superficial ou então muito focada.Só pra listar algumas áreas de atuação, pelo que andei pesquisando as mais favoráveis em questão de vagas e salário são:Desenvolvedor Blockchain que por si só já é muito abrangente também;Auditor de Contratos Inteligentes, aquele que verifica a segurança deles, um trabalho muuuito bacana a meu ver, porém que exige bastante responsabilidade;Consultor de Blockchain, aquele que auxilia as empresas à começar à usar a tecnologia (exatamente aquilo que precisamos em nossa empresa)Enfim Paredão... vagas tem e o salário é muuuuito bom.Bora se especializar na área!?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "July 23, 2023, 08:26:55 PM",
      "body": "Quote from: alegotardo on July 22, 2023, 10:19:53 PMAh... não é muito. Varia entre 12mil e 20mil por mês. Mas assim, junto com as campanhas de assinatura do Bitcointalk, acho que dá pra sobreviver Fonte: https://www.glassdoor.com.br/Sal%C3%A1rios/blockchain-developer-sal%C3%A1rio-SRCH_KO0,20.htmClaro que Blockchain é um termo bastante abrangente e qualquer curso/pós que tiver ou vai ser muito superficial ou então muito focada.Só pra listar algumas áreas de atuação, pelo que andei pesquisando as mais favoráveis em questão de vagas e salário são:Desenvolvedor Blockchain que por si só já é muito abrangente também;Auditor de Contratos Inteligentes, aquele que verifica a segurança deles, um trabalho muuuito bacana a meu ver, porém que exige bastante responsabilidade;Consultor de Blockchain, aquele que auxilia as empresas à começar à usar a tecnologia (exatamente aquilo que precisamos em nossa empresa)Enfim Paredão... vagas tem e o salário é muuuuito bom.Bora se especializar na área!?Até que o salário parece bom. Pena que apenas OITO pessoas que trabalham na area que participaram da pesquisa mandando seus proventos e tudo no anonimato. Você realmente acredita nesses salários oferecidos? Eu tem os dois pés atrás em se tratando em informações salarias. Tem muita coisa que não aparece. Principalmente se o salário é bruto e se tem penduricalhos(gratificações e outros benefícios).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "July 24, 2023, 05:05:27 PM",
      "body": "Quote from: alegotardo on July 22, 2023, 10:19:53 PMQuote from: Paredao on July 22, 2023, 07:02:09 PMMas o que é mais interessante: Qual é o salário para esse tipo de atividade ? Não adianta nada fazer uma pós-graduação, dezenas de cursos na área para depois te pagarem no máximo 2 ou quiçá 3 salários mínimos brasileiros. Coloquei salário mínimo brasileiro, pois já vi que na Europa paga-se muito mais para esse tipo de profissional. Principalmente na Alemanha.Ah... não é muito. Varia entre 12mil e 20mil por mês. Mas assim, junto com as campanhas de assinatura do Bitcointalk, acho que dá pra sobreviver Fonte: https://www.glassdoor.com.br/Sal%C3%A1rios/blockchain-developer-sal%C3%A1rio-SRCH_KO0,20.htmClaro que Blockchain é um termo bastante abrangente e qualquer curso/pós que tiver ou vai ser muito superficial ou então muito focada.Só pra listar algumas áreas de atuação, pelo que andei pesquisando as mais favoráveis em questão de vagas e salário são:Desenvolvedor Blockchain que por si só já é muito abrangente também;Auditor de Contratos Inteligentes, aquele que verifica a segurança deles, um trabalho muuuito bacana a meu ver, porém que exige bastante responsabilidade;Consultor de Blockchain, aquele que auxilia as empresas à começar à usar a tecnologia (exatamente aquilo que precisamos em nossa empresa)Enfim Paredão... vagas tem e o salário é muuuuito bom.Bora se especializar na área!?A carreira parece boa mesmo.O que eu penso é que na maior parte das vezes saber fazer e ter contatos vale mais do que um diploma.O diploma acho que ajuda na parte dos contatos e deve dar uma boa noção técnica também. Essa área de informática tem uma grande carencia de profissionais, e ainda é bastante promissora no Brasil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 24, 2023, 06:18:02 PM",
      "body": "Quote from: bitmover on July 24, 2023, 05:05:27 PMO que eu penso é que na maior parte das vezes saber fazer e ter contatos vale mais do que um diploma.Agora é que você disse tudo.A pessoa aprende mais no terreno do que em cursos. Não estou a dizer que a pessoa não deva tirar cursos, apenas acho que não se deve só olhar para o diploma.Quando se tem bons contactos, é meio caminho para se conseguir progredir na carreira.As vezes até se pode começar por fazer algo que não tem nada haver com IT, mas se alguém com poder decisivo, conhecer-nos e souber o conhecimento que temos, pode fazer com que a nosso trabalha evolua para a área de IT.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "July 24, 2023, 08:11:16 PM",
      "body": "Quote from: bitmover on July 24, 2023, 05:05:27 PMO diploma acho que ajuda na parte dos contatos e deve dar uma boa noção técnica também. No meio acadêmico isso chama-se \"currículo oculto\". E a rede que você estabelece na universidade entre outros alunos e com os professores. Sempre aparecerá a indicação para um emprego. Me lembro que consegui um emprego muito bom na época que cursei a minha primeira faculdade, através da indicação de um colega de classe. Esse é um dos motivos que o ensino a distância tende a não pegar no Brasil. A falta da rede de contatos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 24, 2023, 11:24:33 PM",
      "body": "Quote from: Paredao on July 24, 2023, 08:11:16 PMEsse é um dos motivos que o ensino a distância tende a não pegar no Brasil. A falta da rede de contatos.Isso é agora, daqui a uns anos esse aspeto também se irá adaptar.Agora parece não haver meio termo, ou é tudo presencial ou tudo a distancia. Mas, gradualmente essa situação era equilibrar e num mix das duas situações, as coisas vão se dar como hoje.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "July 25, 2023, 01:12:05 AM",
      "body": "Quote from: alegotardo on July 22, 2023, 12:37:41 AMNa empresa onde trabalho estamos à procura de pelo menos uma pessoa que conheça dessa área, e olha... tá muito difícil encontrar profissionais.Eu mesmo já havia pensado em estudar a respeito, mas faz pouco tempo que entrei de cabeça em novos projetos e sinceramente não tenho tempo para isso agora, mas quem estiver \"disponível\" agarre a oportunidade assim que surgir, pois esse é e ainda vai ser um mercado muito cobiçado e com falta enorma de profissinais.Não sei se você pode falar, mas tenho curiosidade em saber qual seria a demanda dentro da empresa. Seria para qual caso de uso? Só por curiosidade mesmo para entender onde as empresas tem planos de aplicar \"blockchain\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "July 25, 2023, 08:14:44 PM",
      "body": "Quote from: tg88 on July 25, 2023, 01:12:05 AMNão sei se você pode falar, mas tenho curiosidade em saber qual seria a demanda dentro da empresa. Seria para qual caso de uso? Só por curiosidade mesmo para entender onde as empresas tem planos de aplicar \"blockchain\".Ele não vai dizer. Fará mistério a respeito do que farão com o Blockchain. Eu ainda acredito ser apenas alguma moda que alguém da diretoria quer aplicar. Tem sempre um diretor que quer inovar e gastar uma grana e não sabe como. Principalmente se a empresa for nacional. Multinacionais são mais criteriosas a esse respeito. Elas tem planejamento de longo prazo. Já as empresas nacionais...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 25, 2023, 11:32:55 PM",
      "body": "Quote from: Paredao on July 25, 2023, 08:14:44 PMJá as empresas nacionais... ... algum diretor tem de justificar a sua posição e o ordenado que recebe. Então, vai querer inventar alguma coisa, perder-se horas e horas a preparar/desenvolver algo, para no final ficar tudo na mesma. Ou o que mudou foram as cores dos ficheiros.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "July 25, 2023, 11:42:32 PM",
      "body": "Então... eu tinha até me esquecido que o @pjvperes se dedicou recentemente a investir seu tempo no aprendizado de blockchain e tem esse tópico aqui que inclusive foi atualizado recentemente: Diário de um Desenvolvedor Blockchain@pjvperes, me desculpe tirar o foco do assunto de seu tópico....Sei que não é educado pedir quanto uma pessoa ganha, também não sei o quão anônimo é esse nickname que você utiliza, mas qual a possiblidade de você nos compartilhar a sua situação pessoal quanto a salários?Nem precisa ser em números, mas dizer se essa faixa acima de R$ 10k (até R$ 20k) de fato é algo realista para se chegar com uma boa bagagem de conhecimento ou é algo para poucos e no geral paga-se muito menos que isso?Quote from: tg88 on July 25, 2023, 01:12:05 AMNão sei se você pode falar, mas tenho curiosidade em saber qual seria a demanda dentro da empresa. Seria para qual caso de uso? Só por curiosidade mesmo para entender onde as empresas tem planos de aplicar \"blockchain\".Na verdade não tem nada específico ainda.Trabalho em uma empresa que possui franquias espalhados por todo o Brasil, cobrindo 100% dos estados. Apesar de estar bem presente, é uma franquia pequena mas bastante sólida nos produtos que vende (para a área de saúde/estética) e também com grana sobrando para apostar nas capacidades da tecnologia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 26, 2023, 06:51:30 AM",
      "body": "Quote from: alegotardo on July 25, 2023, 11:42:32 PMNa verdade não tem nada específico ainda.Trabalho em uma empresa que possui franquias espalhados por todo o Brasil, cobrindo 100% dos estados. Apesar de estar bem presente, é uma franquia pequena mas bastante sólida nos produtos que vende (para a área de saúde/estética) e também com grana sobrando para apostar nas capacidades da tecnologia.E na sua opinião, conhecendo a tecnologia blockchain, onde achas que o blockchain seria útil para a empresa? Achas que isso iria mesmo melhorar o desempenho da mesma?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "July 26, 2023, 07:05:47 PM",
      "body": "Quote from: alegotardo on July 25, 2023, 11:42:32 PMNa verdade não tem nada específico ainda.Trabalho em uma empresa que possui franquias espalhados por todo o Brasil, cobrindo 100% dos estados. Apesar de estar bem presente, é uma franquia pequena mas bastante sólida nos produtos que vende (para a área de saúde/estética) e também com grana sobrando para apostar nas capacidades da tecnologia.O meu faro não me engana. Tinha certeza que era uma empresa nacional. Veja meu comentário logo acima. Empresas Nacionais tem sempre isso. Gostam de \"inventar moda\" para crescerem. É raro ver isso numa empresa multinacional que faz planejamento para vários anos, e mantém certas políticas internas intactas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "July 27, 2023, 11:37:55 PM",
      "body": "Quote from: Paredao on July 26, 2023, 07:05:47 PMO meu faro não me engana. Tinha certeza que era uma empresa nacional. Veja meu comentário logo acima. Empresas Nacionais tem sempre isso. Gostam de \"inventar moda\" para crescerem. É raro ver isso numa empresa multinacional que faz planejamento para vários anos, e mantém certas políticas internas intactas.Ah Paredao, tá na moda né!? Se a chefia tá podendo rasgar dinheiro, deixa eles",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "July 28, 2023, 07:26:02 PM",
      "body": "Quote from: alegotardo on July 27, 2023, 11:37:55 PMAh Paredao, tá na moda né!? Se a chefia tá podendo rasgar dinheiro, deixa eles Isso é mais do que normal. Tem muito dono de empresa que acha que a empresa tem que sempre crescer e crescer. É que eles ficam dando ouvido a muitos coaching de empreendedorismo. Me faz lembrar de um amigo meu dono de uma rede de academias de tênis. O cara vive fazendo todo tipo de curso e ouvindo palestras de coaching financeiros. Ele colocou na mente que a empresa dele tem que crescer todo ano e expandir. Se isso não acontecer, ele acredita que sua empresa quebrará. O cara está numa fissura danada nisso.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 28, 2023, 08:23:45 PM",
      "body": "Quote from: Paredao on July 28, 2023, 07:26:02 PMQuote from: alegotardo on July 27, 2023, 11:37:55 PMAh Paredao, tá na moda né!? Se a chefia tá podendo rasgar dinheiro, deixa eles Isso é mais do que normal. Tem muito dono de empresa que acha que a empresa tem que sempre crescer e crescer. É que eles ficam dando ouvido a muitos coaching de empreendedorismo. Me faz lembrar de um amigo meu dono de uma rede de academias de tênis. O cara vive fazendo todo tipo de curso e ouvindo palestras de coaching financeiros. Ele colocou na mente que a empresa dele tem que crescer todo ano e expandir. Se isso não acontecer, ele acredita que sua empresa quebrará. O cara está numa fissura danada nisso.É um erro que muito empresário e gestor comete. Não é preciso crescer ou expandir, todos os anos, para ser uma empresa solida e saudável.Sempre que falo com alguém que esta a tirar o curso de gestão e vem com essa ideia, faço o seguinte exercício:\"Imagina uma empresa que vende colchoes numa ilha de 100 habitantes. No primeiro ano ela vende 20 colchões. No segundo ano ela vende 30 colchões. No terceiro ano ela vende 40 colchões. E no quinto ano ela venda \"apenas\" 20 colchões (10 clientes são repetidos). O que vai acontecer no sexto ano?\"Sabem qual é normalmente a resposta? Ficam atrapalhados e mal respondem...Então eu dou a resposta:\"A empresa a partir do segundo ou terceiro ano, se não antes, tem de começar a vender almofadas e lenções. Porque a empresa não pode estar sempre a vender mais coleções do ano anterior, porque a ilha só tem 100 habitantes (admitindo que cada um vive sozinho), e não vai comprar colchões novos todos os anos. Pelo o menos as almofadas e lenções, vão dar uma renda constante, para manter a empresa em funcionamento saudável. Agora crescer? Não! É uma empresa saudável, que é o que importa.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}