{
  "id": "topic_5466461",
  "title": "Antotena",
  "author": "Antotena",
  "created_time": "September 11, 2023, 08:49:54 PM",
  "content": "Everyone has their favorite person they love as a fan either through music, football, actor and actress, Mr. and Mrs., and content creators and because of the power they possess, they get endorsement deals, and partnerships to influence products to the people to make outreach to the consumers and potential customers they can influence to buy the products because of that love and likeness they have for them.The past years, crypto isn't different from this as well. We have seen many of influencers with zero knowledge of crypto but because of the money attached and the greed to influence their fans to get money and because they have this power to make people rush anything they say, they influence people to buy or use them. Meanwhile, they have no clue about what they are influencing to the public and they don't care what happens after as long as their money is completely paid. I want to share to you some of the things you need to know about brand influencing and why you should avoid them.Most deeply don't understand what they are influencing: Many musicians and entertainers receive endorsement deals to make awareness about a project to their fans through social media and other quick places they can reach but if you interview them, many of them wouldn't be able to differentiate between ERC20 and BSC20, they don't do a background checks about the project they advertise or post on their page. Once their check has been paid, they do what they know best to post without doing a personal review if it's worth making a public announcement or not for the public, be careful about the crypto posts they display on their pages and timelines.They don't use what they advertise: A good leader must show a good example, that is what leadership entails, you lead then others follow but influencers don't buy crypto or coins they advertise on their page, the only thing they want is their money. You will be shocked that they received the influencing fees in BTC and USDT instead of the crypto they advertised, they know very well that the coin they are trying to advertise is fake and not worth it but they will sell it out to the public by the way, just to do their bad job for fans to buy what they don't use.They don't have accountability: In every 10 of projects that are out there, there is a high chance of 9 that will fail but influencers will advertise any deal that comes their way but when these projects fail, they don't care about the outcome, they will remain quiet or even mute mode of response like disabling their comment sections and inbox, they don't care unless there is legal challenge against them. There was some time back when Mayweather, DJ Khalid and Kim Kardashian advertised one altcoin last year but eventually turned out scam, fans lost money and were mad about it and they were later sued for promoting a scam project, this is how influencers can put you into bad situation if you are not careful.They don't care about the response of the public: If you buy any crypto that is advertised by influencers, two things is involved, either you buy and make some profit when they list it, which with this, you are safe but if it turn bad, you can't help it but accept the reality of the loss. It's better you do your own research and have a judgment and live by it instead of believing another person to buy.Avoid being influenced to buy a coin or any project, learn to do your own research, do some background check about the project, check the aims and objective of the project, the scope of the project and what they want to do, and not some unrealistic magic just to eat investors money.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466461",
  "comments": [
    {
      "author": "letteredhub",
      "created_time": "September 11, 2023, 09:31:49 PM",
      "body": "You won't ultimately blame these influencers and celebrities, they may not know if it's a scam project they are advertising or not, with the way it would be designed and presented to them that even with research done you still might not find a fault at that moment cause these scamming project are also good as fvck in covering their track. If the government are not declaring or raise an alarm that these projects as scam projects how will it be that the influencer who's just called to do an ambassadorial advert will know.We have had had some managers in the forum manage scam projects like casinos, exchanges which at the beginning they never showed any signs of scam. And these managers I supposed must have done their own background study before accepting to manage those kind of projects only for it to turn out to be a scam project running away with users money and even leaving the repute of such Manager at risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pokapoka124",
      "created_time": "September 11, 2023, 09:34:22 PM",
      "body": "What makes one a crypto influencer these days? They don’t need to have in-depth knowledge of crypto or blockchain, they can simply read an article online and rephrase it to make it look like theirs. Most crypto influencers don’t know what they are saying half of the time, they are like actors reading a well written script. Influencers are in it for the money, they are not interested in making a difference, they just want to make money from their followers. That’s why we see many influencers promote projects without doing their due diligence whether the project is genuine or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iroh",
      "created_time": "September 11, 2023, 10:27:56 PM",
      "body": "Admittedly, a whole lot of these influencers have little knowledge of what they’re trying to pitch to their followers. A lot only do so only cause of what they stand to gain without giving much thought on the sincerity of the project itself nor to their audience they’re trying to sell the project to. Some influencers do care about their reputation and influence they’ve got on their platform and wouldn’t be willing to propagate just any product but can as well be fooled into accepting a scammy project that was beautifully designed to look legit. In essence, we should not take the word of anyone(especially influencers)as truth without first, doing a bit of research about it. Opinions of influencers shouldn’t necessarily be adopted as ours.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "September 12, 2023, 01:41:00 AM",
      "body": "Quote from: Pokapoka124 on September 11, 2023, 09:34:22 PMWhat makes one a crypto influencer these days? They don’t need to have in-depth knowledge of crypto or blockchain, they can simply read an article online and rephrase it to make it look like theirs. Most crypto influencers don’t know what they are saying half of the time, they are like actors reading a well written script. Influencers are in it for the money, they are not interested in making a difference, they just want to make money from their followers. That’s why we see many influencers promote projects without doing their due diligence whether the project is genuine or not. This is the reason why I'm not watching any influencer anymore that's crypto related, or if I'm watching any of them, I'm making it sure that the video isn't a promotion to a new project whatsoever. I still think that there are still crypto influencers out there who are sharing some information to their followers. The problem though is that most of them are just making a video to promote a new project.I can still remember the notorious with this one is the Youtube Channel \"Bitboy Crypto\" where all or most of his videos at that time are just either a promotion to a new project, or just a shilling video towards any top coins out there. He will make a simple analysis on a particular coin, then he will say in the end that he will buy. TBH, I watched some of his videos, and some of his promotion videos in the past, but I didn't buy any of them. After all, he is getting money promoting a project, and he isn't liable if things go south because of the phrase \"Not a financial advice blah blah blah\". QuoteRe: The power of influencials and brand ambassadors,  don't fall for it.Thanks for the reminder OP, but I've been done this already for a very long time. In my 5 years that I've been involved into cryptocurrency, I didn't invest into a new project just because somebody shilled it on Youtube. Maybe the fact that I'm always low on budget also helped me not to invest into these new projects as well. Overall, I just hope that investors out there will make their own research, and don't just watch a video on Youtube regarding a particular project, and when they got attracted, they will invest immediately without any hesitation whatsoever. Influencers don't care about their followers. What they only care is themselves. Be careful to those newbies out there because influencers are kind of scamming you in a different way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "September 12, 2023, 02:02:11 AM",
      "body": "Quote from: Antotena on September 11, 2023, 08:49:54 PMMost deeply don't understand what they are influencing:They can either understand deeply about it or don't understand about it but their decisions are collaborating with those projects to advertise them to their followers and their communities. It is important that what you decide to do at the end, not what are in middle before you make your decisions to do or not to do.QuoteThey don't use what they advertise:Again, it depends. They can use it or not use it. But I am sure if they use it, it mostly comes from free products from those projects and they only experience with free products and receive sponsored money to review those products. Therefore their opinion, reviews can not be trusted.QuoteThey don't have accountability:But you are responsible for your capital and don't blame your irresponsibility on influencers.QuoteThey don't care about the response of the public:Even if they care about their mistakes, at the end when you already lost your capital, any excuse does not make sense. Influencers will not be able to compensate your loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gallar",
      "created_time": "September 12, 2023, 02:30:41 AM",
      "body": "Quote from: Antotena on September 11, 2023, 08:49:54 PM~SnipWhat the OP said is very true. Because what are called influencers or advertisers in the cryptocurrency sector, they only encourage the interest of fans or everyone to be able to enter and buy into the crypto projects they advertise.So for that reason, we as investors or cryptocurrency users, have to be smarter in filtering out things that smell like advertising from these influencers. Such as carrying out independent analysis first before trusting or buying crypto advertised by influencers. Because it seems like people who experience losses due to the cryptocurrencies advertised by these influencers, it's because they didn't do an analysis of the crypto first. In essence, they only believe in one thing, namely that even a big star (influencer) bought the cryptocurrency. That's why people like that become victims. Because they only look at popularity and don't do independent analysis.But even so, not all influencers have bad results regarding the crypto assets they advertise to many people. Because when I saw an argument on a site, it was written there that many influencers actually invest in cryptocurrencies.QuoteIn fact, data shows that 64% of influencers currently own cryptocurrency, and 49% prefer Bitcoin as a means of payment.Source: https://www.ajmarketing.io/post/17-best-crypto-influencers-to-followI don't know whether this data is true or false, but it seems to me. Ordinary people like us are also interested in the potential of cryptocurrencies. So an influencer won't be much different. Moreover, influencers have a lot of money that can be used as capital. So most likely, influencers also don't want to miss out on wasting the potential of cryptocurrency.And my conclusion, in order to avoid cryptocurrency scams that might be spread by influencers. Fill our minds with adequate knowledge about crypto. Because if that's the case, we can differentiate and most likely know whether the cryptocurrency advertised by the influencer has potential or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "September 12, 2023, 03:19:23 AM",
      "body": "Quote from: letteredhub on September 11, 2023, 09:31:49 PMYou won't ultimately blame these influencers and celebrities, they may not know if it's a scam project they are advertising or not, with the way it would be designed and presented to them that even with research done you still might not find a fault at that moment cause these scamming project are also good as fvck in covering their track. If the government are not declaring or raise an alarm that these projects as scam projects how will it be that the influencer who's just called to do an ambassadorial advert will know.We have had had some managers in the forum manage scam projects like casinos, exchanges which at the beginning they never showed any signs of scam. And these managers I supposed must have done their own background study before accepting to manage those kind of projects only for it to turn out to be a scam project running away with users money and even leaving the repute of such Manager at risk. That's only partly true. Unexpected rugpulls/bankruptcies(e.g. BlockFi) aren't the problem — it's mostly the fact that most influencers hop from shilling one project to another in short timespans just to make money off token pump and dumps. It's just them squeezing as much money as they can from their audiences; literally the shittiest way of making money as an influencer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "September 12, 2023, 04:55:13 AM",
      "body": "Influencers are mostly just people who are running after money with no understanding of what the hell it is they are supposed to influence you to get.That's what it all boils down to. Whether it comes from legit sources or from scammers, most of them don't care.Quote from: Iroh on September 11, 2023, 10:27:56 PMSome influencers do care about their reputation and influence they’ve got on their platform and wouldn’t be willing to propagate just any product but can as well be fooled into accepting a scammy project that was beautifully designed to look legit. I like to imagine that most people have a moral compass and will turn down something unethical, which is mostly true. FTX had me asking some serious questions of our gullibility, though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "September 12, 2023, 12:31:24 PM",
      "body": "Quote from: Antotena on September 11, 2023, 08:49:54 PMAvoid being influenced to buy a coin or any project, learn to do your own research, do some background check about the project, check the aims and objective of the project, the scope of the project and what they want to do, and not some unrealistic magic just to eat investors money.The only influencer I have is Satoshi Nakamoto, all the others who called themselves authority are just whales who just want to make a profit from dumping their bags on you, It is okay to look up to them but when it comes to deciding what is best to your portfolio it should be your own decision.One of the things you should learn is how to look and what to look at on a project, Whales are manipulators they use shill marketing to promote the coins they are managing and holding, so better learn a lot when you want to have a good portfolio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tech30338",
      "created_time": "September 12, 2023, 12:53:13 PM",
      "body": "If they post reviews of a certain coin that has no part or meaning and have no use stay away, because at the end of their videos they will post referral's, their only purpose is to have more followers for their personal gain, and have reward on the projects other than that they don't care, follow those who have post early about bitcoin and give suggestions, this people don't care if you follow them, or only few views they just love sharing information's, not those fake influencer's .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "September 12, 2023, 01:32:09 PM",
      "body": "Quote from: NotATether on September 12, 2023, 04:55:13 AMInfluencers are mostly just people who are running after money with no understanding of what the hell it is they are supposed to influence you to get.Well thats the definition of influencers anyway except that it has increase with additional description\"to influence with degree of compensation accordingly\" yes thats how influencers work, but I can still see some who picked moral than to earn or accept few dozen worth tokens for their reputations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "September 12, 2023, 02:20:11 PM",
      "body": "Most academic influencers specialize in a specific field, and therefore it is easy to find someone with superficial knowledge in this field. Here we are talking about a professor or a person with good scientific knowledge, let alone an influencer because he is rich, or a brilliant dancer, or makes funny videos, or cooks. The way we deal with celebrities. Although they know a lot that is wrong, they are human and it is rare for humans to have detailed knowledge in many areas. The first step is to choose well who to take advice from, do in-depth research, and then decide what your decision will be, whether this decision is to buy, sell, invest, or even waste your own time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "September 12, 2023, 02:28:23 PM",
      "body": "Quote from: Saisher on September 12, 2023, 12:31:24 PMThe only influencer I have is Satoshi Nakamoto,Satoshi Nakamoto is/was not an influencer, Satoshi created Bitcoin but never advertised or promoted it the way influencers do for shitcoins. Satoshi even went ahead to say:QuoteIf you don't believe me or don't get it, I don't have time to try to convince you, sorry.Influencers basically want to make money, and they'll do that even if it means promoting projects that are either a scam or one they don't have adequate knowledge about. Influencers should also do their own research about a project before promoting it, they owe that to their followers/fans, jumping on any project without doing any due diligence and only because of money is a bad thing to do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Razmirraz",
      "created_time": "September 12, 2023, 02:34:30 PM",
      "body": "Have you ever thought that most influencers are scammers? I have long studied their work and the methods they use to influence their fans. They never deepen their knowledge of something that has been conveyed to the public, every information they disseminate to the public is based on a script they wrote from a Google search.Influencers only think about personal gain without caring about the fate of their fans. Strangely, there are still people who believe what influencers say. Influencers are like ferrets in sheep's clothing, they will do anything to gain personal gain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helena Yu",
      "created_time": "September 12, 2023, 03:13:52 PM",
      "body": "Influencers are risking their reputation if they promote a high risk project, there was been a case an influencer promoting a ponzi scheme project and then he going to jail. But if they were promote a project that looks legit, even though the project will bankrupt or scam in the end, they're free because they have no intention to promote a scam project. Pretty much like few projects in this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "September 12, 2023, 03:46:00 PM",
      "body": "I often see this on YouTube but I'm not interested and will just press the next video button. They can use many ways to attract more people to join them. We have to be careful and do research is the best way to avoid being scammed.Usually, they get paid for certain projects to help spread information about the project. They have nothing to do with the new project and just accept the job offer and get paid. And we can't blame what they give their followers, especially money.But of the many influencers, some influencers are truly honest in sharing information with their followers. Usually, such influencers have very large and loyal followers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "September 12, 2023, 03:51:53 PM",
      "body": "Quote from: Antotena on September 11, 2023, 08:49:54 PM~snip~Avoid being influenced to buy a coin or any project, learn to do your own research, do some background check about the project, check the aims and objective of the project, the scope of the project and what they want to do, and not some unrealistic magic just to eat investors money.If you are referring to altcoins (and I assume that this is the case), is there any project that makes sense and that in some way brings some positive change? All I see are false promises, with the difference that they try again and again to pack it in the most luxurious and shiny packaging in order to sell their project as well as possible.What I want to say is that the people you are talking about have their price and will promote anything if they are paid well, but that speaks volumes about them and how much they care about all those who will lose their money because of them. Be smart, buy what they don't advertise, and we all know what that is, right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DYING_S0UL",
      "created_time": "September 12, 2023, 04:18:35 PM",
      "body": "To be honest I trust none but myself. There are many who would promise offer a lot. They will do that they will do those. But I am someone who believes in action not words. They may be powerful, they may be brand ambassadors but that doesn't make them all trusty. Let me give you an example. There was this new company and this famous cricketer from my country (I won't go to specific). He was paid to be an ambassador. To promote, to advertise for the new company.  Later they scammed the people and the people blamed the influencer/ambassador. Of course you wouldn't know, it was all fake before they actually scam you. So he had nothing to do to it.So before I go into something. I always do my own research. Of course I listen what they say what they offer what they promise. But until I am sure confident enough I don't make any move.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "September 12, 2023, 04:52:02 PM",
      "body": "That's true, most of the influencers only look at the amount of money they are being paid and never go out and search for what the product actually is and how it's going to help their followers who follow them for some reliable information, if we are actually talking about Crypto in this topic. Most of the influencers still shill one project and get paid $30-$50k per tweet and then they never look back into that project ever. That's the life of every single influencer in this community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}