{
  "id": "topic_5437865",
  "title": "Boakse",
  "author": "Boakse",
  "created_time": "February 03, 2023, 12:16:19 AMLast edit: February 03, 2023, 05:05:23 AM by Boakse",
  "content": "Simply said...Just deposited 0,25 LTC on Binance and transaction is confirmed in the LTC Blockchain...  (for a good time now...)After (more then)  6 - 8 hours LTC Blockchain says deposit is confirmed, Binance still doesn't confirm deppposit...?While deposit is confirmed in Binance deposit but the deposit is NOT counted to my account???Contacting Binance about the fact my LTC is (NOT) deposited  to my Binance Wallet adress seems to be immpossible!Some fucking BOT contact bullshit modules and no real contact!!There is now way to contact this  CENTRALIZED CORPORARATION  to  attend them there is something wrong..I send 0,25 LTC to my Binance adress and it is NOT deposited en NO WAY to contact Binance??Well, if shit is working this way, its even worse then 6 years back...No wonder BTC and LTC is not accepted by -normal- people who make the first step into Bitcoin....(ps. I don care about 0,25 LTC , it is nothing more the peanuts eating shit... but... however...)You reallly think ( as a legendary THIS is how to get people in?  A simple deposit is Fucked UP by Binance and you need to go to the whole process of getting your fucking digit coins on an exchange?Where more then 10 YEARS IN THIS SHIT!!  AND IT IS  -STILL-  NOT WORKING!!!AAAAHHHH,    WHEN IS IS FUCKING BULLSHIT GONNA WORK!!     10 years- 25 years....Oh yeah.    and don't  forget  about the (BTC) Lightning Bullshit (what has nothing to do with the REAL Bitcoin)  to Centralize Shit even more...Lightning =  the death to BTC    and   rule  of Corporate BTC   Centralization!!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437865",
  "comments": [
    {
      "author": "stompix",
      "created_time": "February 03, 2023, 12:33:19 AM",
      "body": "Quote from: Boakse on February 03, 2023, 12:16:19 AMGreat!  thanks Crypto! keep on going this way!!Crypto worked perfectly!Quotetransaction is confirmed in the LTC Blockchain.What failed, in this case, is a centralized exchange that provides no support, it's like blaming Ford because your mechanic forgot to tighten your wheel nuts and you ended up in a ditch. Anyhow you have a contact support option in the menu once you log in, or at least it was there the last time I used Binance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Boakse",
      "created_time": "February 03, 2023, 12:42:27 AMLast edit: February 03, 2023, 04:48:43 PM by mprep",
      "body": "I know....BUTT WHERE 10+ YEARS INTO THIS CRYPTO BULSHITT!!THINGS -NEED- TO WORK!!Imagine going to a bank, deposit 20 euro , you come home , AND it is NOT deposited!!This CANNOT be the case today...IT IS DIGITAL!  IT NEEDS TO WORK!If it doesn't work...   LOSE IT!   DUMP IT...BTC works!   Binace Doesn't!  (SEEMS TO BE..)  don't get me wrong...[moderator's note: consecutive posts merged]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "February 03, 2023, 01:11:17 AM",
      "body": "Quote from: Boakse on February 03, 2023, 12:45:37 AMImagine going to a bank, deposit 20 euro , you come home , AND it is NOT deposited!!This CANNOT be the case today...Banks have kinda been known for this though - losing deposits, mistaking transfers etc...Quote from: Boakse on February 03, 2023, 12:45:37 AMIf it doesn't work...   LOSE IT!   DUMP IT...BTC works!   Binace Doesn't!  (SEEMS TO BE..)  don't get me wrong...Why not use a DEX (like Bisq <- there are others but Bisq seems to be the safest for now)? They seem to be going up in liquidity too and they'll have a lot fewer problems than centralised exchanges do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Boakse",
      "created_time": "February 03, 2023, 05:01:46 AM",
      "body": "Well, I tried to use the -decentral-  exchange  inside  the Exodus  Wallet ....Doesn't seem to work perfect ( as Dec. Exch. )When I deposit (import wallet)  LTC in my  Exodus Wallet, at first, it doesn't show up?? (80% of time!)I have to close app in linux, then open again, and (mostly) then my import is OK  (Wow, really safe transfer here...)If transaction is OK i -can- exchange using the in build Exodus wallet exchange function = DEX ??  (am I wrong)Lot of times it doesn't work and my wallet freeze...Sometimes it works ok...I don't get it...Where using Blockchain POW here or not???  ->  means  100%  perfect!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "February 03, 2023, 07:22:59 AM",
      "body": "Quote from: Boakse on February 03, 2023, 05:01:46 AMWhere using Blockchain POW here or not???  ->  means  100%  perfect!!The built in exchange in Exodus is less decentralized, which mean there's someone can control the exchange and the smart contract.Bisq is different since it's a decentralized exchange where you don't need to create a new account to trade and there's no central site to control each users because you're download it to your PC or laptop. In this exchange, you can maximize the Bitcoin decentralization and don't need to worry anymore about frozen funds.The complete guide to use Bisq is here https://docs.bisq.network/getting-started.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "February 03, 2023, 10:38:31 AM",
      "body": "Quote from: Boakse on February 03, 2023, 12:16:19 AMContacting Binance about the fact my LTC is (NOT) deposited  to my Binance Wallet adress seems to be immpossible!Some fucking BOT contact bullshit modules and no real contact!!There is now way to contact this  CENTRALIZED CORPORARATION  to  attend them there is something wrong..I send 0,25 LTC to my Binance adress and it is NOT deposited en NO WAY to contact Binance??The live chat will try to solve your problem thru self-help articles first. You just have to click unsolved (or anything similar) so you'll be given an option to be transferred to a live agent. From my experience, once you're in the queue, it takes more or less an hour to get a reply (probably depends how hectic it is as well). Saying this just in case but try to contact them in a calm manner as doing the opposite could irk the customer support.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "February 03, 2023, 12:19:56 PM",
      "body": "Quote from: Boakse on February 03, 2023, 05:01:46 AMIf transaction is OK i -can- exchange using the in build Exodus wallet exchange function = DEX ??  (am I wrong)The exodus wallet exchange built in you're referring to is (afaik) provided by a third party as they explained[1]. I don't know what kind of exchange it is and how far it will run smoothly, what I know is that slowly regulations have also regulated DEX[2]QuoteLot of times it doesn't work and my wallet freeze...Your wallet technically can't be frozen, not even Exodus has that capability. cmiiw1. https://www.exodus.com/support/article/787-how-do-i-exchange-assets-in-exodus2. https://ambcrypto.com/did-uniswap-just-yield-to-the-evolving-regulatory-landscape/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "February 03, 2023, 03:15:56 PM",
      "body": "Try to contact them on any possible way, they are active on their social media accounts so sending message on their social media handles at least in twitter[1] and post also in their subreddit[2] page might help instead of complaining here where they don't have active representative.[1] https://twitter.com/binance[2] https://www.reddit.com/r/binance/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "February 03, 2023, 04:27:04 PM",
      "body": "People lose money via banks too which has century old history so what kind of shit is that comparing to 10 year old shit. If you want a solution then check the address you deposited is right because that is the most common mistake people do and start blaming the platform for their own mistake.If you are sure that you did everything right from your side then wait for someone to contact from their support and eventually it will take time atleast a week.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "February 03, 2023, 06:38:58 PM",
      "body": "Quote from: Boakse on February 03, 2023, 12:16:19 AMAfter (more then)  6 - 8 hours LTC Blockchain says deposit is confirmed, Binance still doesn't confirm deppposit...?While deposit is confirmed in Binance deposit but the deposit is NOT counted to my account???Are you sure that you sent to the same address shown in your account? Sometimes there are viruses on your device that modify the address that you copy to scammer address.If the address is correct and the transaction is not confirmed even though it was confirmed in any other block explorer, you have two options:Either there is a synchronization problem with the node, and then it will be resolved in the coming hours.Or there is a problem with your account, and then the support team is the only one who will solve the problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "February 03, 2023, 08:58:43 PM",
      "body": "That's how fucked up centralized exchanges can be. I had an ugly experience with bybit and swore never to use the exchange againIn the Live support, there is actually an option to chat with an agent, though you have to go through a few loops for the option to appear. The bot always never helps",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Boakse",
      "created_time": "February 04, 2023, 03:58:09 PM",
      "body": "Well, deposit is received meanwhile...closing topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}