{
  "id": "topic_5469847",
  "title": "DashingAgent",
  "author": "DashingAgent",
  "created_time": "October 10, 2023, 07:48:07 AM",
  "content": "Decreasing the volume of dollars or other fiat currencies does not increase purchasing powerCryptocurrencies, especially memes, have a much larger supply than dollar and other fiat currencies, If a person's purchasing power is to increase, more and more dollars and other fiat currencies need to be printed, The gold supply theory and the petrodollar theory in printing dollars must be completely eliminated, Because economically, these ideas of making the society prosperous are baseless, Similarly, increasing productivity to lead to economic prosperity is also a baseless theory, Because you need capital to increase production, And to get capital you need loans, And you need more production to pay off the debt, While the population of the world and the needs of the people are not increasing in the proportion in which the production is increasing, Moreover, even if production is increased, people are not prosperous, people do not have money, In all this, banks are only in profit and people are in loss, Because we have completely ignored the fundamental theory of necessity, Which is in addition to gold and production and this is labor, While AI is going to end this too, dollars and fiat currencies should be completely independent, There should be no need to repay loans or pay interest, Banks should be fully at the disposal of governments to issue loans to the people without any hindrance, Along with this, there should be no need to pledge any capital to get the loan",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469847",
  "comments": [
    {
      "author": "Ucy",
      "created_time": "October 10, 2023, 09:04:31 AMLast edit: October 10, 2023, 11:56:06 AM by Ucy",
      "body": "Increasing the volume of fiat currencies for consumption of scarce goods and services would make the prices of the goods and services go up and reduce purchasing power especially for previous holders of the fiat currencies. Bitcoin has a maximum supply of 21million, and its price started at less than a dollar. How many supply of dollar has ever been printed? Billions, trillions, quadrillion etc? And note it doesn't have maximum supply and seems to depreciate in value/price. Increasing purchasing power by printing more will only end up debasing a fiat currency, asssuming it's printed for just the consumption of scarce goods and services. Money is not necessary for increasing production. You can use seed or products you need to run the business. Beside, money should be printed in exchange for collateral, work or something.  That's what backs it up rather than printing it out of thin air without anything  backing it up. It's a gamble to lend out money to people without gurantee of repayment. Collateral is some sort of gurantee, a worker who's proven to be very productive/profitable could use the productivity as gurantee, otherwise a potential worker needs to first learn the business well before seeking for loan, or start with a seed or male & female chickens and learn from multiplying them.You prosper when your business/production succeeds and flourish so that you have enough for your/others needs.. People need to succeed in business to be able to exchange what they have amongst themselves for what they need. It's not necessarily about money  If you produce corn but need meat then give some to a meat producer in exchange for some meat. If he says \"sorry, I don't need corn\" or \"I already have enough corn\" then a service could match you with other meat producers who need corn.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sayeds56",
      "created_time": "October 10, 2023, 09:49:31 AM",
      "body": "Quote from: Ucy on October 10, 2023, 09:04:31 AMIncreasing the volume of fiat currencies for consumption of scarce goods and services would make the prices of the goods and services to go up and reduce purchasing power especially for previous holders of the Fiat currencies. Bitcoin has a maximum supply of 21million, and it started from less than a dollar. How many supplies of dollars has ever been printed? Billions, trillions, quadrillion etc? And note it doesn't have maximum supply and seems to depreciate in value/price. Increasing purchasing power by printing more will only end up debasing a fiat currency, asssuming it's printed for just the consumption of scarce goods and services. Money is not necessary for increasing production. You can use seed or products you need to run the business. Besides, the money should be printed in exchange for collateral, work or something.  That's what backs it up rather than printing it out of thin air without anything  backing it up. It's a gamble to lend out money to people without gurantee of repayment. Collateral is some sort of gurantee, a worker who's proven to be very productive/profitable could use that as gurantee, otherwise potential workers first learn the business well before seeking for loan, or start with a seed or male & female chickens and learn from multiplying them.You prosper when your business/production succeeds and flourish so that you have enough for your/others needs.. Everyone needs to succeed in business to be able to exchange what they have amongst other people for what they need. It's not necessarily about money  If you produce corn but need meat then give some to a meat producer in exchange for some meat. If he says \"sorry, I don't need corn\" or \"I already have enough corn\" then a service could match you with other meat producers who need corn. Well said. Your statement is 100% correct that increasing the money supply by printing more currency can indeed lead to devaluation and reduced purchasing power. of fiat currency, and unfortunately this is what is happening globally. The best way to create wealth is based on something real like hard work or something valuable you own. It is crucial to increase agricultural and industrial production to create new job opportunities and enhance the prosperity of the population.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chilwell",
      "created_time": "October 10, 2023, 11:00:42 AM",
      "body": "Quote from: Sayeds56 on October 10, 2023, 09:49:31 AMQuote from: Ucy on October 10, 2023, 09:04:31 AMIncreasing the volume of fiat currencies for consumption of scarce goods and services would make the prices of the goods and services to go up and reduce purchasing power especially for previous holders of the Fiat currencies. Bitcoin has a maximum supply of 21million, and it started from less than a dollar. How many supplies of dollars has ever been printed? Billions, trillions, quadrillion etc? And note it doesn't have maximum supply and seems to depreciate in value/price. Increasing purchasing power by printing more will only end up debasing a fiat currency, asssuming it's printed for just the consumption of scarce goods and services. Money is not necessary for increasing production. You can use seed or products you need to run the business. Besides, the money should be printed in exchange for collateral, work or something.  That's what backs it up rather than printing it out of thin air without anything  backing it up. It's a gamble to lend out money to people without gurantee of repayment. Collateral is some sort of gurantee, a worker who's proven to be very productive/profitable could use that as gurantee, otherwise potential workers first learn the business well before seeking for loan, or start with a seed or male & female chickens and learn from multiplying them.You prosper when your business/production succeeds and flourish so that you have enough for your/others needs.. Everyone needs to succeed in business to be able to exchange what they have amongst other people for what they need. It's not necessarily about money  If you produce corn but need meat then give some to a meat producer in exchange for some meat. If he says \"sorry, I don't need corn\" or \"I already have enough corn\" then a service could match you with other meat producers who need corn. Well said. Your statement is 100% correct that increasing the money supply by printing more currency can indeed lead to devaluation and reduced purchasing power. of fiat currency, and unfortunately this is what is happening globally. The best way to create wealth is based on something real like hard work or something valuable you own. It is crucial to increase agricultural and industrial production to create new job opportunities and enhance the prosperity of the population.Increasing in money supply causes inflation which means the price of items will in increase and the currency will not have value. On like America that doesn't produce anything rather than printing of dollars which is because is currency regulating global market. Now let assume the entire world has concluded not to transact with dollars anymore the entire America will collapse, that is why the fight any nation who is try to fight dollars. So for  someone to increase wealth is to be productive, hard work and so many things good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "October 10, 2023, 11:42:38 AM",
      "body": "QuoteThere should be no need to repay loans or pay interest, Banks should be fully at the disposal of governments to issue loans to the people without any hindrance, Along with this, there should be no need to pledge any capital to get the loanSo you suggest that the banks/government should simply start giving away money to the people for free, without any interest rates, requirements for repayment and collaterals? The inflation is going to hit absurd levels, if such thing happens.Are you trying to invent a new economic theory or something? All the people are complaining about fiat currency devaluation and decreasing purchasing power and yet you suggest the governments to print more money and give them away to the people, which will lead to more currency devaluation and lower purchasing power. This doesn't make any sense.I'm waiting for a politician to promise something like this. He will be elected for sure. \"Let's shower the people with newly printed helicopter money. Everyone will become a millionaire and the inflation won't hit 100000%. I promise.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tuturtinular",
      "created_time": "October 10, 2023, 11:56:30 AM",
      "body": "Quote from: DashingAgent on October 10, 2023, 07:48:07 AM~snip~I don't know what you mean. The argument constructed is not clear. The current financial system is (maybe) independent and the one who has financial authority is the central bank. The state does not have full power to intervene in the financial system. Even though they can make policies to regulate money circulation. The more money circulating in society, the state and banks will increase deposit interest so that more people save in banks and the circulation of money in society decreases. If there is too little money in society, banks will lower interest rates so that many people borrow money from banks and there is a lot of money circulating in society.Then when you say that banks must help people by giving money and debts do not need to be paid then that is the destruction of the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "October 10, 2023, 01:13:00 PM",
      "body": "Quote from: DashingAgent on October 10, 2023, 07:48:07 AMCryptocurrencies, especially memes, have a much larger supply than dollar and other fiat currencies, If a person's purchasing power is to increase, more and more dollars and other fiat currencies need to be printedThe large supply volume greatly affects the stability of the price in the long run. Memes adopt a large supply volume policy because it is a good lever for the price, especially in its effect on market capacity. If This means a market capacity of one billion dollars, while the real demand is one million dollars. These sharp differences in the market price are what give these currencies value, but they make the price very volatile and closer to being a scam.you find fluctuation in its price as shown.The petrodollar theory cannot be eliminated because it is the basis of today's economy. The global economy and global debt have grown in a way that has become impossible to cover with gold or any other valuable cover.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mvdheuvel1983",
      "created_time": "October 10, 2023, 03:01:23 PM",
      "body": "Meme coins may have been produced in larger quantities but meme coins as well as cryptocurrencies cannot beat the dollar when it comes to stability, trust, and value. Now look at the gold supply theory and the petrodollar theory which you have called for to be eliminated. Do you think our fiat currencies would be enjoying its stability if we didn't have these? It was the only option before crypto and even though it needs to be upgraded in my opinion to fit our current world, I don't think it should be eliminated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wajik-tempe",
      "created_time": "October 10, 2023, 03:21:05 PM",
      "body": "Quote from: mvdheuvel1983 on October 10, 2023, 03:01:23 PMMeme coins may have been produced in larger quantities but meme coins as well as cryptocurrencies cannot beat the dollar when it comes to stability, trust, and value. Now look at the gold supply theory and the petrodollar theory which you have called for to be eliminated. Do you think our fiat currencies would be enjoying its stability if we didn't have these? It was the only option before crypto and even though it needs to be upgraded in my opinion to fit our current world, I don't think it should be eliminated.The concept of a decentralized and fixed supply, such in the case of Bitcoin, tries to alleviate difficulties such as inflation and loss of buying value. The concept of decreasing the need for loans and interest payments while also holding banks more responsible to governments is undoubtedly intriguing. The emergence of cryptocurrency has compelled us to reconsider existing banking structures.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NewRanger",
      "created_time": "October 10, 2023, 03:51:22 PM",
      "body": "Quote from: wajik-tempe on October 10, 2023, 03:21:05 PMQuote from: mvdheuvel1983 on October 10, 2023, 03:01:23 PMMeme coins may have been produced in larger quantities but meme coins as well as cryptocurrencies cannot beat the dollar when it comes to stability, trust, and value. Now look at the gold supply theory and the petrodollar theory which you have called for to be eliminated. Do you think our fiat currencies would be enjoying its stability if we didn't have these? It was the only option before crypto and even though it needs to be upgraded in my opinion to fit our current world, I don't think it should be eliminated.The concept of a decentralized and fixed supply, such in the case of Bitcoin, tries to alleviate difficulties such as inflation and loss of buying value. The concept of decreasing the need for loans and interest payments while also holding banks more responsible to governments is undoubtedly intriguing. The emergence of cryptocurrency has compelled us to reconsider existing banking structures.Yes. Currently there are billions of people who can access the internet, but not everyone has access to a bank or money exchange system, but with digital keys, access to our own currency becomes very easy so that over time our dependence on banks will decrease.The market continues to run, the use of cryptocurrency cannot be frozen or restricted by any entity and Blockchain makes it difficult to be cheated, it's just that currently the price drama is too much if we pay attention.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "October 10, 2023, 04:57:10 PM",
      "body": "Quote from: DashingAgent on October 10, 2023, 07:48:07 AMThere should be no need to repay loans or pay interest, Banks should be fully at the disposal of governments to issue loans to the people without any hindrance, Along with this, there should be no need to pledge any capital to get the loanIf you believe that loans should not be repaid, then what is the reason to work or start a business (produce goods) when I can take out a loan for a house, car and everyday expenses and not pay it back for the duration of my life?Money loses value over time, which is why loans carry interest. Moreover, money is a product. You pay for renting a car and also for renting skis, so why should renting capital be free (zero interest)?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "October 10, 2023, 06:18:31 PM",
      "body": "It is such a funny idea that people may want free money lol. There is nothing like that, you can't possibly keep doing that, and you will run out of money and the growth will not be as good as you think, it would be mostly debt that doesn't get paid back, the default rate would skyrocket like crazy.There are a million other things that people could talk about other than me, there are economists who would help you on why this can't happen for many reasons a lot better than I can do, but even I as a person who did not study economy ended up figuring out at least half a dozen, so that means it makes sense that something like this doesn't happen. Life is not all free candy, you can2t just liver your life thinking that what you are thinking is the best idea, there is a reason why what you think is not the right way, you should always research why it doesn't happen, and if you can't find any, find the experts who says no, they will explain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinTurk",
      "created_time": "October 10, 2023, 08:04:34 PM",
      "body": "Purchasing power is something that varies depending on the currency value of the country a person owns and unless the currency appreciates there is no increase in purchasing power. Reducing the circulating supply of any fiat currency is of course a factor that helps that currency appreciate but this process alone is not sustainable. Therefore, constantly reducing the amount of fiat currency in the market will not literally help increase purchasing power.In addition, in order to increase purchasing power, cost-effective production must be realized because if production is limited the price of that product or service will increase as the supply will be low and there will be a decline in purchasing power due to the fixed salary of individuals. In addition, in case of low-cost production the product or service will reach individuals at a lower cost which will have a positive impact on purchasing power.On the other hand, if there is an increase in the fiat currency in circulation that currency will lose value and as a result a decrease in the purchasing power of individuals will be observed. The fact that all fiat currencies have an unlimited supply also supports that this situation is always likely to occur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "October 10, 2023, 08:27:25 PM",
      "body": "Quote from: DashingAgent on October 10, 2023, 07:48:07 AMThere should be no need to repay loans or pay interest, Banks should be fully at the disposal of governments to issue loans to the people without any hindrance, Along with this, there should be no need to pledge any capital to get the loanWhat you are proposing is an idea of how to make fiat money = toilet paper  Even though they are literally the same still people trust them because they believe that they hold the value of what it say and if you are proposing an idea to break that chain then what actually will be the value of your fiat?If people can get loans from the government when they want and there is no need to repay it will not increase the value, it makes the value zero so here comes the basic theory of all the demand and supply decide the value of a product.If there is a product with high supply and no demand the value is zero similarly if a product has no supply but high demand still the value is zero so balancing the part decides the value of every product.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "October 11, 2023, 06:30:49 AM",
      "body": "In what fantasy world are you living, where Banks will be profitable by giving interest free loans? That business model will destroy the Banking system and the world economy, because Banks cannot operate without some interest being paid on loans.  The problem is..... most interest charged by Banks and financial institutions are way too high and people are pushed into long-term debt as a result of that. Also, non-payment of the debt is also profitable for these Banks, because assets are repossessed and sold for a profit. (Debt has become a commodity that are sold to debt collectors... so Banks and other financial businesses are still profiting from the non-payment of these loans)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 11, 2023, 07:56:31 AM",
      "body": "There are many economic theories that believe that interest rates, no matter how low, are harmful to the economy, and therefore loans should be 1:1, and that there is no safe and secure way to generate money from money except through risk, such as trading, trading, and other methods, but given the world we are in and its nature. In the global economic system, this does not happen. We have a system based on interest and on creating money from money and printing more for prosperity, and the person who collects the assets remains the biggest winner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "October 11, 2023, 01:04:12 PM",
      "body": "Quote from: DashingAgent on October 10, 2023, 07:48:07 AM There should be no need to repay loans or pay interest, Banks should be fully at the disposal of governments to issue loans to the people without any hindrance, Along with this, there should be no need to pledge any capital to get the loanIt does not make sense, because it is totally against the order of things and will ruin a lot of things if things are done that way. Issuing free money to people will not make people more prosperous or put them in a better financial position. Money given freely without conditions has a high chance to be squandered, and if people know that taking loans come without conditions and no responsibility to pay back, people will keep taking loans and using this money on unimportant things that do not have the potential to make them financially independent. Such an act will promote financial irresponsibility and a sense of entitlement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "October 11, 2023, 01:49:32 PM",
      "body": "Quote from: Sayeds56 on October 10, 2023, 09:49:31 AMQuote from: Ucy on October 10, 2023, 09:04:31 AMIncreasing the volume of fiat currencies for consumption of scarce goods and services would make the prices of the goods and services to go up and reduce purchasing power especially for previous holders of the Fiat currencies. Bitcoin has a maximum supply of 21million, and it started from less than a dollar. How many supplies of dollars has ever been printed? Billions, trillions, quadrillion etc? And note it doesn't have maximum supply and seems to depreciate in value/price. Increasing purchasing power by printing more will only end up debasing a fiat currency, asssuming it's printed for just the consumption of scarce goods and services. Money is not necessary for increasing production. You can use seed or products you need to run the business. Besides, the money should be printed in exchange for collateral, work or something.  That's what backs it up rather than printing it out of thin air without anything  backing it up. It's a gamble to lend out money to people without gurantee of repayment. Collateral is some sort of gurantee, a worker who's proven to be very productive/profitable could use that as gurantee, otherwise potential workers first learn the business well before seeking for loan, or start with a seed or male & female chickens and learn from multiplying them.You prosper when your business/production succeeds and flourish so that you have enough for your/others needs.. Everyone needs to succeed in business to be able to exchange what they have amongst other people for what they need. It's not necessarily about money  If you produce corn but need meat then give some to a meat producer in exchange for some meat. If he says \"sorry, I don't need corn\" or \"I already have enough corn\" then a service could match you with other meat producers who need corn. Well said. Your statement is 100% correct that increasing the money supply by printing more currency can indeed lead to devaluation and reduced purchasing power. of fiat currency, and unfortunately this is what is happening globally. The best way to create wealth is based on something real like hard work or something valuable you own. It is crucial to increase agricultural and industrial production to create new job opportunities and enhance the prosperity of the population.when the government prints money excessively and without calculation, the fiat currency of that country will become worthless and the countries of Zimbabwe and Venezuela have become clear evidence of the government's failure to control the circulation of their own country's currency, but they are countries that have strong economies and influence.  Large companies are able to control the value of their currency even though they print new money continuously, for example the US and China.  Developing countries will not be able to follow in the footsteps of these two countries, so what developing countries need to do to increase the purchasing power of their people is to increase employment opportunities and also provide decent education.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davian144",
      "created_time": "October 11, 2023, 01:59:33 PM",
      "body": "Quote from: wajik-tempe on October 10, 2023, 03:21:05 PMThe concept of a decentralized and fixed supply, such in the case of Bitcoin, tries to alleviate difficulties such as inflation and loss of buying value. The concept of decreasing the need for loans and interest payments while also holding banks more responsible to governments is undoubtedly intriguing. The emergence of cryptocurrency has compelled us to reconsider existing banking structures.Banks really have to use more consideration in the present and the future if they don't want to see more customers fleeing elsewhere. Because the emergence of cryptocurrency has changed the forms and ways of thinking of many people in terms of saving and using money, any bank must be able to improve and develop according to today's technology. So that their services can continue to be relied on by customers even though cryptocurrency users will continue to increase over time.Quote from: NewRanger on October 10, 2023, 03:51:22 PMYes. Currently there are billions of people who can access the internet, but not everyone has access to a bank or money exchange system, but with digital keys, access to our own currency becomes very easy so that over time our dependence on banks will decrease.If banks in the world do not keep up with developments in today's modern era, it is clear that all banks will be left behind because there will be fewer users of bank services. So the reduction in bank service users will also result in banks closing slowly, so the bank must be able to change everything by trying to keep up with technological developments that are more advanced and easier, such as those in Blockchain so that bank users can survive even though we all have also used other services besides banks.QuoteThe market continues to run, the use of cryptocurrency cannot be frozen or restricted by any entity and Blockchain makes it difficult to be cheated, it's just that currently the price drama is too much if we pay attention.Price is not a drama, but it is a reality that can be seen through demand and supply in the market so we cannot deny it other than continuing to follow the market flow correctly and wisely and not panicking when there is a downturn. So the price issue is a very absolute issue and is not worthy of being considered a drama because it is not regulated by someone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alpha Marine",
      "created_time": "October 11, 2023, 02:05:39 PM",
      "body": "Quote from: DashingAgent on October 10, 2023, 07:48:07 AMThere should be no need to repay loans or pay interest, Banks should be fully at the disposal of governments to issue loans to the people without any hindrance, Along with this, there should be no need to pledge any capital to get the loanIt's no more a loan when it won't be repaired, is it? Banks can't give out loans if they don't make a profit from the loan because the money they use to give out the loans are other customer's money. So how do you expect that to give out other people's money just like that? This is not feasible at all. The banks would cease to exist. Now if the government starts giving out money, it would only increase inflation, thereby reducing the purchasing power of people.Don't forget that interest rate is one of the tools the government uses to fight inflation. Decreasing the volume of dollars printed will reduce inflation thereby making the money have more value and being able to afford more stuff. This has increased the purchasing power. Doing the opposite leads to inflation and reduces purchasing power.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}