{
  "id": "topic_5431314",
  "title": "pawel7777",
  "author": "pawel7777",
  "created_time": "December 24, 2022, 10:44:44 PMLast edit: February 18, 2023, 11:56:19 AM by pawel7777",
  "content": "Hypothetical scenario:You can bet on a single dye roll (choosing a number between 1-6), but if you win you get paid x12 of your stake (instead of x6).So the Expected Value is positive (see example below), but you'd still have 83% chance of losing.1 - will you take that bet?2 - if so, what % of your available funds would you put at stake (i.e. funds you're willing to gamble and afford to lose)?Again, this is a single, non-repetitive bet.-----------------------Simulation for BTC1 bet:EV = (83% x -BTC1) + (17% x BTC11) = +BTC1.04Edit: calculation corrected, credit to Saint-loupEdit2:A somewhat related video on a subject on unreasonable risk aversion. Good watch and not very long:",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5431314",
  "comments": [
    {
      "author": "jackg",
      "created_time": "December 24, 2022, 11:00:59 PM",
      "body": "I you knew if was legit and on a site you regularly visit, I doubt anyone would be saying no.If it were me, I'd consider anything up to a third of what you could afford to lose to be a reasonable bet for something like that - especially since you're not going to be able to do it again and have a chance to 2x or 1x your disposable funds. But I normally end up withdrawing from casinos while I still have a similar balance to what I've deposited so you might get a greater variety of answers below of people who may not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "December 24, 2022, 11:11:35 PM",
      "body": "The computation is very attractive having a 17% chance to win 1200% is huge enough considering most dice offer 580% return for 17% chance.  Definitely I will take the bet.  I would allocate 10% or 1/10 of my bankroll to stake for every roll, this way I will have 10 tries to get a win and hope for that 10 tries can hit 1 for a profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "December 25, 2022, 04:36:23 AM",
      "body": "I doubt anyone would say no, more so if the said offer came from a reputable casino (or even the individual who set up the bet really). As for how much, if we were talking about funds I solely use for gambling, I can pretty much bet everything in it. Solely my betting funds though, I allocate to it monthly if I ever want to play. It's a one-time chance, after all. I can still use my money to play other stuff later on if I wanted/needed to, just that it'd be on a different month.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nullama",
      "created_time": "December 25, 2022, 05:08:36 AM",
      "body": "Quote from: pawel7777 on December 24, 2022, 10:44:44 PMHypothetical scenario:You can bet on a single dye roll (choosing a number between 1-6), but if you win you get paid x12 of your stake (instead of x6).So the Expected Value is positive (see example below), but you'd still have 83% chance of losing.1 - will you take that bet?2 - if so, what % of your available funds would you put at stake (i.e. funds you're willing to gamble and afford to lose)?Again, this is a single, non-repetitive bet.-----------------------Simulation for BTC1 bet:EV = (83% x -BTC1) + (17% x BTC12) = +BTC1.21Well, since it's a single event then all the calculations you present do not apply because they assume long term, multiple shots, that's when the probabilities make sense.In a single throw, then you really only have 1 out of 6 chances to win, which doesn't really sound too good to be honest.I would just put a bit of money that wouldn't really affect me at all if I lose it, and see if I get something out of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "December 25, 2022, 12:52:58 PM",
      "body": "Quote from: jackg on December 24, 2022, 11:00:59 PMI you knew if was legit and on a site you regularly visit, I doubt anyone would be saying no....You'd be surprised. A lot of people (especially women) are unreasonably risk-averse.In this case though - you're still most likely to lose money than win, so not taking such bet at all would be fairly reasonable IMO.Quote from: jackg on December 24, 2022, 11:00:59 PMIf it were me, I'd consider anything up to a third of what you could afford to lose...Fair enough, but is there any reason you would risk max. third of your funds (not more or less)?What I'm trying to figure out is to see if there's any reasonable/mathematical approach to making such decision.Quote from: BitcoinPanther on December 24, 2022, 11:11:35 PM I would allocate 10% or 1/10 of my bankroll to stake for every roll, this way I will have 10 tries to get a win and hope for that 10 tries can hit 1 for a profit.  As in OP, you can only roll once. Still taking it?Quote from: nullama on December 25, 2022, 05:08:36 AMWell, since it's a single event then all the calculations you present do not apply because they assume long term, multiple shots, that's when the probabilities make sense....This is how you calculate EV. Positive EV doesn't mean you're guaranteed to win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "December 25, 2022, 02:15:35 PM",
      "body": "I love this statement of women being more risk-averse,I think that this is not that true everywhere,all of my women colleagues will not play gambling at all and there are a lot of them in the company where I work as we are consultants in many fields and professions.Having said that I would not risk that 17% chance of win against 83% chance of losing as it means I can only win 1 in every 6 rolls so that 1200% is not at all appealing to me when 83% of the rolls I would be a losing person.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "December 25, 2022, 03:02:07 PM",
      "body": "If I were a rich man seeking thrill with gambling, I'd take that bet in a heartbeat even when equipped with the knowledge of losing 83% of the time. If this kind of chance would happen only once in a day, and I'm someone that does not really care much about the money and just the outcome, this would be appealing to me. But knowing that I still value my money and I do not believe that it's reasonable for me to take the bet at all. Perhaps with a small amount, but not more than $100. But say, this is a once in a lifetime opportunity, I might just toss in a couple hundred and just be done with thinking 'what ifs' and maybe win the bet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "December 25, 2022, 03:18:18 PM",
      "body": "Quote from: dothebeats on December 25, 2022, 03:02:07 PMBut say, this is a once in a lifetime opportunity, I might just toss in a couple hundred and just be done with thinking 'what ifs' and maybe win the bet. I don’t see much a once in a lifetime opportunity for a single bet that just give extra 50% payment on a single roll opportunity while the chance of winning is still that low. If the pay rate will be x50 or more then this offer is good but since this is just a one time roll it’s just a regular game with extra payment which is still not worth it to risk huge bets.It's stil a 1/6 win chance probability and it doesn't change the fact that it's hard to win on that percentage with just increasing the multiplier a little bit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "December 25, 2022, 03:21:33 PM",
      "body": "You are considering how much to win when your bet is right but you are not really looking at the percentage that you are going to lose if the best fails, although you said it regarding betting as you can afford to lose. But for me I don't focus on what winning amount I'm expecting but the percentage in the loses incase I don't win. Betting with 1% of income is still on the sensible angle and that makes you not greedy because greed makes a gambler to take irrational decision.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "December 25, 2022, 03:28:12 PM",
      "body": "Such a generous casino. Although the risk is high, the amount to win is also tremendous. If you are fond of risking like betting for the underdog in a match, you would certainly try that chance of winning.  I may or might not be depending on how I feel on the day whether I feel lucky or not. If its not repetitive I might not really join. A casino would need to keep the offer to keep users coming. They could do this one-time offer daily or weekly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "December 25, 2022, 03:53:15 PM",
      "body": "Quote from: pawel7777 on December 24, 2022, 10:44:44 PMHypothetical scenario:You can bet on a single dye roll (choosing a number between 1-6), but if you win you get paid x12 of your stake (instead of x6).So the Expected Value is positive (see example below), but you'd still have 83% chance of losing.1 - will you take that bet?2 - if so, what % of your available funds would you put at stake (i.e. funds you're willing to gamble and afford to lose)?Again, this is a single, non-repetitive bet.yeah, I'd take the bet since it is a one-time bet and have a 17% chance of winning with a x12 payout. it would be a waste to pass on this kind of opportunity. as for how much I'd stake, probably half or 1/4 of the funds I can afford to lose, I am not willing to go all in despite it having a 17% chance of winning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "December 25, 2022, 04:00:14 PM",
      "body": "It’s definitely going to be a good decision to go with the bet since the results that you could get is better than the risk you are going to take so I think it boils down into the risk management on how much you are going to bet, but as long as you are ready to lose that kind of money, then it’s best to take it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ralle14",
      "created_time": "December 25, 2022, 04:15:16 PM",
      "body": "Quote from: pawel7777 on December 24, 2022, 10:44:44 PM1 - will you take that bet?2 - if so, what % of your available funds would you put at stake (i.e. funds you're willing to gamble and afford to lose)?Yup, i'd place that bet immediately even if it's only for a one time bet, win or lose it's still worth it for me since I wouldn't get that opportunity in any casinos.When it comes to the amount I'll be staking probably half of my deposit or maybe more since most of my deposits are usually small and I might as well place a bigger bet as i'm only going to get a single try.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "December 25, 2022, 04:17:58 PM",
      "body": "Quote from: pawel7777 on December 24, 2022, 10:44:44 PM-cut-1 - will you take that bet?2 - if so, what % of your available funds would you put at stake (i.e. funds you're willing to gamble and afford to lose)?-cut-When bet amount would be in the limits of my daily betting budget, i would take it. My current betting budget is 1% of my monthly income. It's not a lot and i wouldn't get rich by betting it with 12x multiplier, but i've bet far worse odds, so compared to them this would be a must bet.And obviously it needs to be a single bet like you said, as otherwise martingale would work for this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mauser",
      "created_time": "December 25, 2022, 04:18:30 PM",
      "body": "Quote from: pawel7777 on December 24, 2022, 10:44:44 PM1 - will you take that bet?2 - if so, what % of your available funds would you put at stake (i.e. funds you're willing to gamble and afford to lose)?Interesting question for the gamblers among us. I would definitely take that bet if it was offered to me. Having the chance to make 12x profit with a 1/6 chance of winning is no brainer. Like you showed us the expected value is positive for us. No casino could afford such a game for a long period of time, they would go bankrupt. The issue is of course that we can roll only once, so I'm 5 out of 6 cases we are going to lose our money. In that position I would probably bet 25% of my monthly gambling budget. That's the highest I could afford to lose in a single bet without feeling bad about it for weeks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "December 25, 2022, 06:17:10 PM",
      "body": "1 no I will not take this bet because this will be a winning bet only in 1/6 cases. moreover this not means I can win at least 1 time after 6 bets because each new run is not related to any previous run.2 well I will try maybe with a low amount, around 1-5% max of my bankroll. personally I don't like these kinds of bets even if there is a good jackpot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "December 25, 2022, 08:50:08 PM",
      "body": "1. I will if I've got a spare to bet with and that's usually our scenario with our bets. Here comes the YOLO mindset though.  2. Not that much, as I've said. It's going to be just a spare amount for which I can afford to lose so that it won't be too critical for me when I lose. Just playing safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "December 25, 2022, 09:04:03 PM",
      "body": "well, i am not going to take such a bet for several reasons, and one of them being that, aside the 83% chance of losing the bet, there is still a higher chance that such a bet will not pull through, so its better not to waste my time and money.For those that are observant, they should also have noticed that when you open your casino site to gamble, the chances you would lose the first bet you placed is always as high as 95% or more .And i cant take such a bet because if i should, i will only bet on it with the amount i can afford to lose, and that would be very small that even if i end up winning the bet, the profit wont make any sense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "December 25, 2022, 09:21:53 PM",
      "body": "Quote from: pawel7777 on December 24, 2022, 10:44:44 PMHypothetical scenario:You can bet on a single dye roll (choosing a number between 1-6), but if you win you get paid x12 of your stake (instead of x6).So the Expected Value is positive (see example below), but you'd still have 83% chance of losing.1 - will you take that bet?2 - if so, what % of your available funds would you put at stake (i.e. funds you're willing to gamble and afford to lose)?Again, this is a single, non-repetitive bet.-----------------------Simulation for BTC1 bet:EV = (83% x -BTC1) + (17% x BTC12) = +BTC1.21For me your calculations are wrong, because it's not the EV of a x12 payout, but the EV of a x13 one. When you play at a normal dice, hi-lo or coin toss game you say you're paid out x2 if you win, you don't say you are paid \"x1\", and EV is the sum of your excepted winnings minus the sum of your expected losses, then for me the EV of a x12 payout game is :EV = (83% x -BTC1) + (17% x +BTC11) = +BTC1.04 because if you win you get +11BTC not +12.Or if you consider that your stake is lost each you place a bet because you give it to the dealer and it belongs to your winnings when you win.EV = (100% x -BTC1) + (17% x +BTC12) = +BTC1.04 Usually casinos show payouts with this notation Winnings:Stake. And it's less confusing for calculating the EV IMO, here it would be 11:1 for your game (or 12:1 for your EV).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}