{
  "id": "topic_5438590",
  "title": "HailTheRabbit",
  "author": "HailTheRabbit",
  "created_time": "February 07, 2023, 08:59:17 PM",
  "content": "You be the judge. From the dev:\"Hello, first and foremost it is important to me that holders of RABBIT understand that this project is intended to further decentralization and offer fair opportunity to all. There are no team tokens. Everyone who wishes to be involved in this community driven project is a volunteer. Having been deeply engaged in the collective mission of bringing decentralization to the mases over the last couple years, i realize that my vision is no more important than that of any other holder, so I will not offer more of my thoughts than is necessary. I too am a volunteer and have purchased RABBIT on the open market. Hand in hand, the RABBIT community will realize the full potential of this experiment of decentralization in this rapidly evolving market and economic climate.The tokenomics of RABBIT are simple.  The supply is capped at 100,000,000,000. There is a 4% tax total on all transactions. Because supporting trade on a DEX is important in ensuring there is no price manipulation from a centralized entity, when trading on SushiSwap or other DEX, 3% of transactions will go to liquidity (1% automatically, 1% reserved for creating more RABBIT pools on DEX, for example RABBIT/USDT, and 1% to liquidity for the second ecosystem token, CARROT, which will play a central role in the RABBIT colony). I will be creating these pools using the paired tokens that i purchase on the open market. Additionally, 1% of all RABBIT transactions will be airdropped to holders as USDC as an added incentive to trade on DEX and a small reward for supporting decentralization. Arbitrum was chosen to build RABBIT on as it has become clear to me that gas costs on Ethereum mainnet have been burdensome for many. This Layer 2 solution is advantageous to holders and my team and I believe greatly in its promise as the choice scaling solution. In terms of managing socials and messaging platforms, this will largely be up to the RABBIT community. We have had a Telegram group made but please keep note that is ran by volunteers and not overseen by the devopment team. I will communicate through the official RABBIT Twitter, but only on occasion as to not interfere with this decentralized community driven experiment. Lastly remember, unless we announce it here or on the official RABBIT Twitter, the information or content being relayed is not coming from us.  Beware of pretenders, scammers, fake twitters,telegrams, discords, etc. Anyone publicly claiming to be behind this project is not being truthful.RABBIT is a champion of love and prosperity. May the Rabbit outrun and outwit the dog who hunts it. Telegram: https://t.me/RabbitTokenARBTwitter: https://www.twitter.com/Rabbit Contract #   0x0240506d8be181480DeE9b0b2983f76E535cD300 Trade on: www.Sushi.com/swapemail: allhailthegreatrabbit@gmail.com",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5438590",
  "comments": []
}