{
  "id": "topic_5449960",
  "title": "Yanalli",
  "author": "Yanalli",
  "created_time": "April 24, 2023, 07:03:18 AM",
  "content": "There is a lot of hostility between countries and people at this time, will it be possible to stop it or what will happen next? Is there such an opinion that all this is a political game of big people. How are things with ordinary people, money has taken over the world in a game with politics?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449960",
  "comments": [
    {
      "author": "nik268279",
      "created_time": "April 24, 2023, 07:06:39 AM",
      "body": "Quote from: Yanalli on April 24, 2023, 07:03:18 AM There is a lot of hostility between countries and people at this time, will it be possible to stop it or what will happen next? Is there such an opinion that all this is a political game of big people. How are things with ordinary people, money has taken over the world in a game with politics?When money is at the head of life, there is nothing to be surprised about, everyone pulls the blanket over themselves. Ordinary people are suffering from everything that is happening now. The political game has dragged on and got out of control, only a very strong person or a team of great specialists in politics can solve everything, probably..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fopesher",
      "created_time": "April 24, 2023, 08:10:19 AM",
      "body": "Politics and money, it's worth talking about this topic if you were somehow connected, let's say, in the social sphere. Nowadays, people with big wallets decide further for big people, so it's hard to say what kind of game is being played and how it will affect the rest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romahdewes",
      "created_time": "April 24, 2023, 08:21:13 AM",
      "body": "An interesting expression is political chess, probably this is a game that clearly will not shine on us and therefore we need to live our lives, and not think about where our opinion is not taken into account)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tsaroz",
      "created_time": "April 24, 2023, 12:52:58 PM",
      "body": "I think we've reached a point from where there's no going back. Everyone is fed with their part of propaganda and the government with their media are building permanent sense of hate on general people. \"Bringing others to sense\" mindset would never bring peace in the world. If the world leaders are wise enough, they should start talking to each other rather than fueling wars.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "April 24, 2023, 03:05:48 PM",
      "body": "It has always been a game of political and economical chess, since humankind invented diplomacy. Those who move the pieces are the powerful and the rich, while we (ordinary citizens) are just solitary gears in the machine of our countries, which we do not directly control. Hostilities can be stopped, it has happen before and it can happen again, specially when war between nations harm the economy of those in charge of big corporations. All we can do as citizens is to hope for the end of violence and raise people around us with love and understanding, so they can live without violence in their life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Newlifebtc",
      "created_time": "April 24, 2023, 10:12:09 PM",
      "body": "Quote from: Yanalli on April 24, 2023, 07:03:18 AM There is a lot of hostility between countries and people at this time, will it be possible to stop it or what will happen next? Is there such an opinion that all this is a political game of big people. How are things with ordinary people, money has taken over the world in a game with politics? the thing you are facing in your country is not in every country so the problem of a country is dependable by the leaders of that country especially the government so you cannot use the problem of your country and western the other and we cannot explain or accept the problem of another country challenge so other countries might have their own challenge but is not a challenge of War or crisis",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "April 25, 2023, 01:05:27 PM",
      "body": "For me it is a sort of political chess,if the USA are steadily helping Ukraine in a constant way with modern weapons which has made the war that Russia wanted to end in 3 days to still be going now in almost 1.5 years after it started in 2022.USA is smart,they are selling weapons but also Russia in this context was smart in the beginning as they were dumping all the old weapons in the bin but now they are also losing a lot of modern equipment which has weaken their army to a really weak point.In this context the only victims are innocent Ukrainians which both the US and Russia do not care to sacrifice as long as they achieve their goals,sad but true that is how the world looks today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "April 25, 2023, 09:14:02 PM",
      "body": "Quote from: Yanalli on April 24, 2023, 07:03:18 AM There is a lot of hostility between countries and people at this time, will it be possible to stop it or what will happen next? The majority is coming up with the idea of these contests and territorial disputes are going nowhere. And that's through the bloody war which has been happening for centuries. That's the way they demonstrate how powerful they are and no country shall come into their way, no country is wanting to be just under and be a subject to another country.Quote from: Yanalli on April 24, 2023, 07:03:18 AM Is there such an opinion that all this is a political game of big people. How are things with ordinary people,We, ordinary people are the pitiful on these case. When rumors of wars came into reality, the rich ones will just come and fly to another peaceful country and living their nation into havoc.Quote from: Yanalli on April 24, 2023, 07:03:18 AMmoney has taken over the world in a game with politics?It's power and a status symbol for everything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "April 26, 2023, 02:16:36 AM",
      "body": "Quote from: Yanalli on April 24, 2023, 07:03:18 AM There is a lot of hostility between countries and people at this time, will it be possible to stop it or what will happen next? Is there such an opinion that all this is a political game of big people. How are things with ordinary people, money has taken over the world in a game with politics?There is such opinion that the game is controlled by Rich people, but that opinion alone can't prove the reality. It has always been this way and it will always be this way. It is very hard for humans to stay in peace they will always find a way to disrupt it.Although, there are those people who want to live their life peacefully and they also want others to follow the peace, but unfortunately those who want to disrupt the peace will always find a way. They will definitely wait for the time to come when they can play their game.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "copersad",
      "created_time": "April 26, 2023, 06:23:23 AM",
      "body": "Politics is now showing its instability to influence, it cannot adapt to all circumstances. Chess plays a huge role here, the rearrangement of everything and everyone goes in full.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ftopikit",
      "created_time": "May 17, 2023, 05:08:41 AM",
      "body": "Chess is played by politicians, we are ordinary pawns, they dispose of our lives and do not want to be equal with us and report to us. The crisis will not end for a long time. I think it's just the beginning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alpha Marine",
      "created_time": "May 17, 2023, 07:36:02 AM",
      "body": "The thing is everybody is just trying to exploit everybody. The relationship between governments is not looking good. The media makes matters worst. The big corporations just look what what benefits them and they don't care about the consequences. Why should they, when they are not the ones feeling the consequences?Look at what's happening in Congo. How about countries where Oil is extracted? The truth is, no country actually cares about another country. All they care about is their own country. They only care about how they can make their countries better. The world is just fucked up. No country gets involved in a situation that doesn't benefit them somehow. I find it hard to believe that the government of any country, especially developed countries does anything out of the goodness of its heart.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "May 17, 2023, 09:07:58 AM",
      "body": "Hostility between states is hostility between dominant governments and not between peoples. Peoples are the victims of the policies of their dominant rulers.This hostility cannot be stopped unless the political ambitions of the world's top rulers end.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "May 17, 2023, 10:52:45 AM",
      "body": "Quote from: Yanalli on April 24, 2023, 07:03:18 AM Is there such an opinion that all this is a political game of big people. I have some believe that there are some elites in he soceity that benefit from crisis. It is possible to entertain the opinion that majority of global crisis is being fuelled by these elites both in politics and other top positions. Quote from: Yanalli on April 24, 2023, 07:03:18 AM How are things with ordinary people, Ordinary people are always the top victims of all these global crisis, they loose their properties, family and friends and even their lives.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "durop77",
      "created_time": "May 22, 2023, 05:52:23 AM",
      "body": "Quote from: swogerino on April 25, 2023, 01:05:27 PMFor me it is a sort of political chess,if the USA are steadily helping Ukraine in a constant way with modern weapons which has made the war that Russia wanted to end in 3 days to still be going now in almost 1.5 years after it started in 2022.USA is smart,they are selling weapons but also Russia in this context was smart in the beginning as they were dumping all the old weapons in the bin but now they are also losing a lot of modern equipment which has weaken their army to a really weak point.In this context the only victims are innocent Ukrainians which both the US and Russia do not care to sacrifice as long as they achieve their goals,sad but true that is how the world looks today.It's a pity that the world has turned out this way and no one feels sorry for ordinary people. Everyone started playing chess in the political sphere. I don't think about their future and how the game will develop all over the world. Absolutely everyone suffers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "May 22, 2023, 05:47:26 PM",
      "body": "Quote from: Yanalli on April 24, 2023, 07:03:18 AM There is a lot of hostility between countries and people at this time, will it be possible to stop it or what will happen next? Is there such an opinion that all this is a political game of big people. How are things with ordinary people, money has taken over the world in a game with politics?The rich have always controlled the poor. To keep holding the poor ransome they come up with different political and economic games. Internally politicians use electoral fraud, bribery, tribalism, and religion to control the common men. They manipulate elections, control the poor with money and divide the people along tribal and religious lines because they want to gain power and control over them. They know that if the people come together, they will be pushed out. Internationally rich nations sponsor coups, conflicts, and wars to ensure that only loyal politicians gain political power in developing nations. They support corrupt but loyal politicians to gain power because they will always benefit from their stealing. Even when it is clear that these politicians fraudulently grabbed power they still support them because they are scared that another influential nation will take over their place.Economically they use loans and grants to control poor nations. The interest and conditions of these loans are enslavement treaties. These debts make poor nations to be freely controlled and manipulated by influential countries. Our leaders don't care about the consequences of these death loans because they are beneficiaries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "May 22, 2023, 07:28:31 PM",
      "body": "We're living in world governed by idiots and we pay the price.Just think about it for a moment and you'll reach the same conclusion.Germany shut down its nuclear reactors to go green and as a result they went dark, because there's not enough energy production in the country to keep the grid stable. They're forced to buy it from France, that, yes, you've guessed it, uses nuclear reactors! Scotland decided to have green energy, like Germany, so they built some wind warms. Today I've read that they were using diesel generators to defrost these wind farms during winter, otherwise the generators would seize and stop producing power",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "May 22, 2023, 09:11:09 PM",
      "body": "The world is always run by political chess, it’s just more noticeable to people like us now because of the global financial system. Republicans & Democrats are currently gridlocked over a decision on raising the debt ceiling. Will they, won’t they etc. I assume it’s all to manipulate markets & then they will agree on some sort of deal at the last minute.Then we have the Ukraine vs Russia war with all the shenanigans there. I try to just get on with my life & not get top fixated on things that are out of my control.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ftopikit",
      "created_time": "May 24, 2023, 07:21:48 AM",
      "body": "Chess is always in politics, you have to get used to it and accept it. No one is able to resist this and change something. It is better to always take a neutral position so that it is not worse for yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}