{
  "id": "topic_5402142",
  "title": "jtylee",
  "author": "jtylee",
  "created_time": "June 10, 2022, 09:34:22 PM",
  "content": "Hey Guys, I'm James TyleeYears ago I was \"HottWeelz\" on this forum before some rogue ICO group hacked my username for promoting an ICO and I haven't been able to get it back. I'm well established amongst the crypto world, you may have heard of Cyber.FM Radio as well as some other sites.I'm helping to offer an Airdrop that was motivated by the recent Rebase Craze with High APY % Tokens that have this new \"Anti Dump\" and \"Anti Whale\" features. To compare: our APY is 1.2% per day, compounding as opposed to \"the others.\"After some fallouts with extremely high APY Rebase Tokens, whether it be from lack of experience or outright Rug Pulls, some friends, (including myself) decided to create a simple (realistic) rebase token that is literally free.  No strings attached. The amount of people that have been hurt and literally robbed with this recent craze is growing every day. I won't name the projects here obviously, but we just simply wanted to prove the theory that: The tokenomics (when backed with morals and responsibility) could actually work. No questions asked. Nothing to lose. Need A Token? Take A Token.Currently trading at $0.27 per token as per DexToolsCode:Token Quantity: 10Contract: 0xB43aC01603Ac5c686cdf0FD1682c6F5b5533f81CNetwork: Binance Smart ChainAPY: 1.2% Daily CompoundSell Limit: 1% per 24 hoursSwing by: https://atoken.info and claim your 10 Free Tokens and just watch in your wallet.We DO Appreciate help with spreading the word:Twitter: https://twitter.com/needatokenTelegram: https://t.me/needatoken***We have backed a small amount of liquidity on PancakeSwap using our own money and are all equally subject to the tokenomics as other users.We do indeed invite you to SELL them.We do want you to read the Whitepaper.Will this work? We don't know. NO Pinksale, NO Presale, NO Private Sale, Founders do NOT hold any majority (unless bought on open market).We are not asking you to do ANYTHING, the faucet distributing the tokens is automated.*Gas fees apply of course on the Binance Smart Chain.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402142",
  "comments": [
    {
      "author": "Napij40",
      "created_time": "June 10, 2022, 11:46:14 PM",
      "body": "#PROOF OF REGISTRATIONForum Username: Napij40Forum Profile Link: https://bitcointalk.org/index.php?action=profile;u=3334591Telegram Username: @napij0001Participated Campaigns: Twitter, Telegram BSE/ BEP-20 Wallet Address: 0x00fE2d662b1448102afE001E387D61B2E554cfe3",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Boss47@",
      "created_time": "June 10, 2022, 11:47:43 PM",
      "body": "#PROOF OF REGISTRATIONForum Username:Boss47@Forum Profile Link: https://bitcointalk.org/index.php?action=profile;u=3400724Telegram Username:@Alaminkhan4321Participated Campaigns: Twitter , TelegramBEP-20 Wallet Address:0xe56B11B09792D4a341E2E45EACad537c79860974",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Raihan543",
      "created_time": "June 11, 2022, 03:24:39 AM",
      "body": "#PROOF OF REGISTRATIONForum Username: Raihan543Forum Profile Link: https://bitcointalk.org/index.php?action=profile;u=3434623Telegram Username: @raihan 4441Participated Campaigns: Twitter,Discord, Telegram BSE/ BEP-20 Wallet Address: 0xD1CC6224B2A507ED034b57136AC8AD715EC0e4B1",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alamin32",
      "created_time": "June 11, 2022, 10:33:39 AM",
      "body": "#PROOF OF REGISTRATIONForum Username: Alamin32Forum Profile Link: https://bitcointalk.org/index.php?action=profile;u=3473097Telegram Username: @Alamin1832Participated Campaigns: twitter,  Telegram  BEP-20 Wallet Address BSC: 0x905B43C58601310b3e735bAe3FDfA24D68C43eF5",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}