{
  "id": "topic_5445014",
  "title": "OmegaStarScream",
  "author": "OmegaStarScream",
  "created_time": "March 15, 2023, 02:05:46 PMLast edit: March 15, 2023, 02:33:45 PM by OmegaStarScream",
  "content": "https://www.coindesk.com/policy/2023/03/15/germany-and-us-seize-over-46m-crypto-tied-to-chipmixer-investigation-europol/QuoteAuthorities from Germany and the U.S. have seized up to 44 million euros ($46.3 million) from ChipMixer, a noted cryptocurrency mixerThe respective authorities took down the platform's infrastructure, seizing four servers, 7 terabytes of data and 1909.4 bitcoins (BTC) ($47.7 million), Europol said on Wednesday.ChipMixer allowed its clients to hide the trails of their criminal exploits, such as drug or weapon trafficking, ransomware attacks and payments fraud.The seizure was also supported by Belgium, Poland and Switzerland.If you visit the URL, you can see that it has been seized by law enforcement: https://chipmixer.com/The same thing with the Tor version.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445014",
  "comments": [
    {
      "author": "DaveF",
      "created_time": "March 15, 2023, 02:08:19 PM",
      "body": "Well that's a bummer.Wonder if they are going to go after the operators. Usually when they do something like this if they know who they are / could find them they mention that.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "March 15, 2023, 03:24:01 PM",
      "body": "Quote from: DaveF on March 15, 2023, 02:08:19 PMWonder if they are going to go after the operators. Usually when they do something like this if they know who they are / could find them they mention that.I am sure they intend to hunt operators like what they did with Tornado Cash but I believe with capability of running ChipMixer successfully since 2017, operators are smart and clever enough to secure their identities. I hope so!In 2019, Bestmixer.io was seized and in May 2022, it's the turn of Blender.io mixer but there is no arrest after that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Edwardard",
      "created_time": "March 15, 2023, 03:47:09 PM",
      "body": "Ah, this is a very sad news to hear especially for our bitcointalk community ppl. I think chipmixer made a record of having a \"longest running\" signature campaign in the forum till date. I hope they come up with something although the chances seems very low after this seizure Well, so is this a sign that governments are not going to let us use mixers ? I myself love mixing services and promoting one in my sig. space as well. I hate to see them all at risk now (although coinomize is still up for now).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "March 15, 2023, 03:49:34 PM",
      "body": "Quote from: tranthidung on March 15, 2023, 03:24:01 PMI am sure they intend to hunt operators like what they did with Tornado Cash but I believe with capability of running ChipMixer successfully since 2017, operators are smart and clever enough to secure their identities. I hope so!So far it looks like CM's operator is still out there.Quote from: nioctib_100 on March 15, 2023, 03:33:18 PM\"German investigators said that the FBI is seeking the chief suspect, whom they didn't identify.\" From this article: https://abcnews.go.com/International/wireStory/german-investigators-crypto-money-laundering-site-97879857Chipmixer is still out there!Quote from: Edwardard on March 15, 2023, 03:47:09 PMWell, so is this a sign that governments are not going to let us use mixers ?Didn't you get the memo? Only criminals use mixers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "March 15, 2023, 03:52:09 PM",
      "body": "Quote from: TryNinja on March 15, 2023, 03:49:34 PMDidn't you get the memo? Only criminals use mixers.In the past, there was a memo. Only criminals use Bitcoin.  Quote from: TryNinja on March 15, 2023, 03:49:34 PMSo far it looks like CM's operator is still out there.Quote from: nioctib_100 on March 15, 2023, 03:33:18 PM\"German investigators said that the FBI is seeking the chief suspect, whom they didn't identify.\" From this article: https://abcnews.go.com/International/wireStory/german-investigators-crypto-money-laundering-site-97879857Chipmixer is still out there!Thanks. I guess so and read that article minutes ago too.I am thinking of the forum as well. If governments fail to seize and shutdown all mixers (that I believe they will never succeed), will they change to hunt for platforms that promote mixers like the forum?Any solid reason for them to seize bitcointalk.org?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LeGaulois",
      "created_time": "March 15, 2023, 04:00:11 PM",
      "body": "Quotethe primary operator of ChipMixer has been identified, and the FBI is already on a manhunt to bring him in front of justice.https://www.bka.de/DE/Presse/Listenseite_Pressemitteilungen/2023/Presse2023/230315_Geldwaesche_Darknet.htmlQuotea reward is now offered via the U.S. DoJ \"Rewards for Justice\" programQuoteMinh Quốc Nguyễn, 49, of Hanoi, Vietnam, was charged today in Philadelphia with money laundering, operating an unlicensed money transmitting business and identity theft, connected to the operation of ChipMixer.https://www.justice.gov/opa/pr/justice-department-investigation-leads-takedown-darknet-cryptocurrency-mixer-processed-over-3but he was here few hours ago",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "March 15, 2023, 04:38:17 PM",
      "body": "Quote from: tranthidung on March 15, 2023, 03:52:09 PM~snip~Any solid reason for them to seize bitcointalk.org?As if they need a solid reason to do something, they can just do it for any reason. Although when it comes to CM, it would be logical that they first attacked BTT as the main source of advertising, and now that they have demolished CM, the forum will probably not be an interesting target for them. However, these are strange times, we all need to prepare that one day we will be greeted by a message that the forum has been seized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "March 15, 2023, 04:42:26 PM",
      "body": "What will happened to those who use the mixer previously. Is there a chance that my Bitcoin will be connected by Bitcoin use from money laundering or we are still safe? I use Chipmixer every week to mix my coins. It’s sad to read this bad news.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "March 15, 2023, 04:46:11 PM",
      "body": "Quote from: Lucius on March 15, 2023, 04:38:17 PMQuote from: tranthidung on March 15, 2023, 03:52:09 PM~snip~Any solid reason for them to seize bitcointalk.org?As if they need a solid reason to do something, they can just do it for any reason. Exactly, they don't need a reason and furthermore, they are able to invent a myriad of them on the spot.But it makes no sense, the backslash would be too enormous for this and would yield basically nothing, let's not forget the forum is not even close to being completely anonymous, it's behind Cloudflare just to give an example, plus a few of the participants here leave so many traces that probably the most incompetent agency in the world would be able to track them, just grab addresses and force exchanges to disclose who has used it if they are theirs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "March 15, 2023, 04:47:46 PM",
      "body": "Quote from: Beparanf on March 15, 2023, 04:42:26 PMWhat will happened to those who use the mixer previously. Is there a chance that my Bitcoin will be connected by Bitcoin use from money laundering or we are still safe? I use Chipmixer every week to mix my coins. It’s sad to read this bad news.  I doubt you would get arrested just for using the mixer, this would be plain dumb. Now, if you used the mixer to move coins related to hacks, exploits, ransomware, drugs, etc... and they can link your coins to your identity, then you should be worried.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "March 15, 2023, 05:15:16 PM",
      "body": "I read a long attached document at https://www.justice.gov/opa/press-release/file/1574581/downloadHe was caught by using Paypal, unbelievable. Chipmixer is done!Shit happens is the document mentioned a lot about the forum. Maybe we must prepare for bad days for Bitcointalk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "March 15, 2023, 05:16:58 PM",
      "body": "Quote from: dzungmobile on March 15, 2023, 05:15:16 PMHe was caught by using Paypal, unbelievable. Chipmixer is done!Yep... was also reading and just came here to post about this before seeing your post. QuoteAccording to PayPal records for the V3 PayPal Account, on December 27, 2022,there was a credit card payment received from MINH NGUYEN, email addressnqminh73@yahoo.com for $150.00 with the comment “Thanks.” This transaction demonstrates the fact that NGUYEN is utilizing a personal payment method to fund operational ChipMixer infrastructure.Also, we are all being heavily spied on by our governments (in case anyone hasn't noticed yet). They had 149k data points about his location, provided by Google, back from 2016 to 2022.QuoteRecords from Google for the account jamessmithhelp@gmail.com revealedlocation history data. From September 2016 through March 2022, there were 149,027 data points associated to the account that resolved in and around Ha Noi, Vietnam. The location history data is a combination of different sources to include cell, GPS, and Wi-Fi, showing that NGUYEN was physically in Vietnam during these data points.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "March 15, 2023, 05:20:43 PM",
      "body": "Quote from: Beparanf on March 15, 2023, 04:42:26 PMWhat will happened to those who use the mixer previously. Is there a chance that my Bitcoin will be connected by Bitcoin use from money laundering or we are still safe? I use Chipmixer every week to mix my coins. It’s sad to read this bad news.  I believe people run to ChipMixer mostly for privacy protection, so I doubt if any user's identity will be reviewed, and ChipMixer, for its long existence, should be smart enough to keep its records kind of clean for this kind of case. Quote from: Lucius on March 15, 2023, 04:38:17 PMHowever, these are strange times, we all need to prepare that one day we will be greeted by a message that the forum has been seized.Is this even possible? Sometimes I do ask myself some kind of question, like, \"How and why has the government, which is against crypto, not made a move to shut the Bitcoin Talk Forum down?\" At the same time, I convince myself that there are things that are beyond the government's reach. But this statement just kept me in a confused state.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stedsm",
      "created_time": "March 15, 2023, 05:23:28 PM",
      "body": "After getting more than 7 TB of data (I don't know what's in it truly) and 1900 BTC being seized by the government, is it really possible for Chipmixer to keep running their business from some other country that allows mixing under their jurisdiction? I believe that this loss isn't a small number and if all they had was this only (which could be least possibility as criminals can pay hefty sums to get their coins mixed), then they will definitely do something to either gain this much back through some other business or start back running the same business from somewhere else as we are speaking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "March 15, 2023, 05:27:56 PM",
      "body": "Quote from: dzungmobile on March 15, 2023, 05:15:16 PMI read a long attached document at https://www.justice.gov/opa/press-release/file/1574581/downloadI'm still going through it, and saw thisQuoteAs part of the FBI’s efforts to combat ransomware attacks against victims in theUnited States, including the Eastern District of Pennsylvania (EDPA), the FBI became aware ofa cryptocurrency mixing service known as ChipMixer, operating through the following clearnetdomains and Tor sites:a. clearnet: chipmixer.comb. Tor: chipmixorflykuxu56uxy7gf5o6ggig7xru7dnihc4fm4cxqsc63e6id.onionc. clearnet: chipmixer.ioCase 2:23-mj-00528 Document 1 Filed 03/14/23 Page 12 of 6012d. Tor: chipmixerwzxtzbw.onione. clearnet: chipmixer.clubf. Tor: qw6xpezaqb57xsviksbsbjlrftevt52s7baaxiubwb6mkpwkqcfdppqd.onionThe second domain is still up and doing a redirect, not seized at all, they were known scams, how did they reach the conclusion they were the same?QuoteRecords from Google for the account jamessmithhelp@gmail.com revealed location history data. From September 2016 through March 2022, there were 149,027 data points associated to the account that resolved in and around Ha Noi, Vietnam. Damn, just makes you wodner how much data they collect!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GazetaBitcoin",
      "created_time": "March 15, 2023, 05:39:20 PMLast edit: May 27, 2023, 11:44:52 AM by GazetaBitcoin",
      "body": "Having the (main) website seized by authorities does not necessarily mean that the operations will be halted. For example, in May 2020 Romanian authorities seized the well known torrents website FileList (filelist.ro). Yet the very next day filelist.io was up and running.Main website is still seized:However, their mirror site is still up and running since main website was seized. All users moved to the mirror website and no other problem occurred since then. And, if I'm not mistaken, admins made a post back then saying something like even if that mirror website will be also seized, they still have several other mirrors for keeping their torrent site up and running.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "March 15, 2023, 05:47:34 PM",
      "body": "Quote from: GazetaBitcoin on March 15, 2023, 05:39:20 PMHaving the (main) website seized by authorities does not necessarily mean that the operations will be halted.Something tells me that if this situation doesn't end here, they'll pay a visit to bitcointalk. Also, if I was Minh, I'd not find it wise to setup another mixer now that everyone knows my name.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nioctib_100",
      "created_time": "March 15, 2023, 05:56:19 PM",
      "body": "Quote from: Stedsm on March 15, 2023, 05:23:28 PMAfter getting more than 7 TB of data (I don't know what's in it truly)Given how many selfies they include of him in the press release report at https://www.justice.gov/opa/press-release/file/1574581/download, I'd wager a terabyte or two are just his own personal photos  Quote from: BlackHatCoiner on March 15, 2023, 05:47:34 PMAlso, if I was Minh, I'd not find it wise to setup another mixer now that everyone knows my name. In most cases, a Vietnamese guy who has Europol and the US after him would make a break for the border with Vietnam-China. Given Minh's history in Taiwan though, I wouldn't think China would welcome him with very open arms, so it wouldn't be smart to go there. A lot of places to disappear to in that region of the world though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "March 15, 2023, 06:11:39 PM",
      "body": "Bad news to the the world of decentralization and privacy. These government officials will always hunt any innovation that want to promote privacy. They should investigate the matters and come up with reasonable finding. If not they should let the firm be. I wonder what will happen to the signature campaign in the forum. I always have so much respect for members in that campaign because they are just unique. And you will always learn from them. Government can try to stop decentralization but there will always be better alternatives.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}