{
  "id": "topic_5474366",
  "title": "sp535151",
  "author": "sp535151",
  "created_time": "November 16, 2023, 08:12:54 PM",
  "content": "Hi guys,I am a software developer and am currently working on the topic of trading bots.I want to dedicate myself to the topic for fun and am currently developing an HFT bot. I have two approaches for this:1. a bot that monitors different cryptocurrencies on different trading platforms. It buys and sells a coin immediately if there is a price difference of at least x on one platform.2. a bot that monitors two different currency pairs on one trading platform and trades based on historical price movements. These currency pairs should move similarly. I am thinking of BTC/USD and BTC/FDUSD, for example. When a price difference occurs, the coin that normally follows the other is bought or sold.Can anyone tell me if BTC/FDUSD \"follows\" the BTC/USD market and follows suit. Or if there are alternative coins?And does anyone have any tips for trading platforms that I can use for 1.?Thank you for you help",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474366",
  "comments": [
    {
      "author": "logfiles",
      "created_time": "November 17, 2023, 11:47:25 PM",
      "body": "Quote from: sp535151 on November 16, 2023, 08:12:54 PMCan anyone tell me if BTC/FDUSD \"follows\" the BTC/USD market and follows suit. Or if there are alternative coins?And does anyone have any tips for trading platforms that I can use for 1.?It's going to be quite tricky because we have different trading pairs and the most popular and one with high volume is BTC/USDT and then there is also BTC/USDC. I don't know what you mean by \"follows\" but if I was to look at the price of Bitcoin vs the USD, I would look at the actual price of Bitcoin directly from the order book which is BTC/USDT. BTC/USD is derived from those trading pairs. For example, on Binance there is no BTC/USD trading pair anywhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "November 18, 2023, 02:32:10 AM",
      "body": "Quote from: sp535151 on November 16, 2023, 08:12:54 PMI want to dedicate myself to the topic for fun and am currently developing an HFT bot. I have two approaches for this:1. a bot that monitors different cryptocurrencies on different trading platforms. It buys and sells a coin immediately if there is a price difference of at least x on one platform.There are already many bots that work. If what you offer is unique, distinctive, or has other features, then why not, try making it open source or free.Quote from: sp535151 on November 16, 2023, 08:12:54 PM2. a bot that monitors two different currency pairs on one trading platform and trades based on historical price movements. These currency pairs should move similarly. I am thinking of BTC/USD and BTC/FDUSD, for example. When a price difference occurs, the coin that normally follows the other is bought or sold.Why did you choose First Digital USD? It is not a popular stable currency and trading volumes will be limited compared to stable currencies that have better trading volumes such as USDC, or at least the difference between prices in stable currencies is less than a cent, and with trading fees it is difficult to create a fast bot and achieve profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}