{
  "id": "topic_5430538",
  "title": "DdmrDdmr",
  "author": "DdmrDdmr",
  "created_time": "December 20, 2022, 01:53:24 PM",
  "content": "La policía de Nevada practicó recientemente el vehículo de un sospechoso. En el evento, como allí es costumbre, tenían activada la cámara policial, grabando la secuencia. El asunto de peso es que el sospechoso tenía su semilla Ledger escrita en uno de los papeles que revisó uno de los policías, y éste se detuvo en intentan entender qué es lo que estaba viendo en el citado papel. Al detenerse en ello, la grabación permite ver la semilla con cierta nitidez, aunque con la mejor de las caligrafías.De alguna manera, el video se ha hecho viral, por lo que uno se pregunta cómo puede un video grabado por la cámara de cuerpo del policía llegar a hacerse público, pero bueno. Se entiende que el interesado ya habrá movido los fondos de todas las direcciones asociadas (o se las han quitado, a saber), pero entre otras cosas, ha dejado expuesto la traza de todos sus movimientos en todas las direcciones protegidas por el Ledger.La moraleja es que hay que considerar no sólo cómo y dónde guardamos las semillas, sino las consecuencias de que caigan en según qué manos ajenas en términos de poder perder los activos y dejar expuesta la trazabilidad de los mismos.Ver: https://cointelegraph.com/news/police-body-cam-leaks-suspect-s-seed-phrase-during-vehicle-inspection",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5430538",
  "comments": [
    {
      "author": "darxiaomi",
      "created_time": "December 20, 2022, 02:56:46 PM",
      "body": "Muy interesante articulo y noticia que da mucha tela para cortar.Primero lo de siempre esas filtraciones de la policia y justicia que pasan en todo el mundo y no deberian pasar, es como cuando los periodistas al instante tienen toda la informacion.Ahora bien yendo al meollo de la cuestion es una situacion muy dificil igual en varios aspectos, porque digamos la policia esta cumpliendo su trabajo y digamos que las imagenes no se difunden pero el policia que vio la frase la utiliza el para robarse los BTC, digamos que lo puede hacer tranquilamente y quedaria dentro de todo en un anonimato muy profundo si se mueve inteligentemente.Siguiendo con esta linea, en el caso de un allanamiento mas formal con todas las de la ley, cuando se incauta algo, supongamos un papel asi, primero que un policia se lo podria guardar en un bolsillo y no declararlo sutilmente, segundo se multiplica por todos los empleados judiciales, la gente que va a ver o tiene acceso a esas frases, a la vez no es como en un banco que uno tiene cierta garantia de que la plata queda ahi por mas que este embargada.La verdad que va a ser algo apra pensar muy seriamente y no se si tiene solucion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "December 20, 2022, 03:02:00 PM",
      "body": "La moraleja yo la veo en que no se qué hay que estar pensando para llevar tus semillas en la cartera por la calle. Una cosa es que cambies de domicilio, o de país, y te las lleves contigo, pero parece que las llevaba en la cartera como quien lleva un billete o una tarjeta de crédito. A lo mejor no tenía muchos fondos, pienso yo.Respecto de las grabaciones, hay muchos vídeos de la policía de EEUU publicados por la red, a lo mejor allí no hay las restricciones para publicar que hay en Europa, y cuando publicaron no sabían que esas palabras en el papel, las semillas, contenían información sensible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "December 20, 2022, 06:25:47 PM",
      "body": "Quote from: DdmrDdmr on December 20, 2022, 01:53:24 PMDe alguna manera, el video se ha hecho viral, por lo que uno se pregunta cómo puede un video grabado por la cámara de cuerpo del policía llegar a hacerse público, pero bueno. Es muy común encontrar videos de la policía estadounidense en youtube, es como si cada departamento de policía tubiera su canal, y si no me equivoco los videos de cada caso se hacen públicos para compartir la evidencia de los hechos, lo cual me hace aplaudir la actividad y personalment eme gustaría que así fuera en mi pais. Como comentas, no está padre que revelen información confidencial, pero aun así lo considero una buena práctica.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "December 20, 2022, 07:08:01 PM",
      "body": "Hay algunos detalles más del caso a contemplar. Como por ejemplo que:-   La fecha mostrada en el video indica que la grabación se corresponde als 22/04/2022 (ver: https://twitter.com/i/status/1604599964713328640). Es decir, ya han pasado muchos meses, por lo que puede que se haya liberado/filtrado ahora el video sin consecuencias para los fondos (no así para la privacidad).-   He visto dos hilos en Reddit apuntando a que la persona registrada era una un antiguo agente del FBI, uno de ellos apuntando a que la persona trabaja en el ámbito ciberseguridad …https://www.reddit.com/r/CryptoCurrency/comments/zo9i21/lesson_learned_cop_pulls_over_former_fbi_agent/https://www.reddit.com/r/Bitcoin/comments/zo7nq1/cops_pull_over_former_fbi_now_cyber_security_self/Creo que cita al respecto en el video siguiente, que el el video completo del registro, durando casi 54 minutos ...:https://youtu.be/-aJ--1-DFgQ",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "December 22, 2022, 08:44:41 PM",
      "body": "Puede ser un caso retorcido, vengativo... me hace recordar el caso del agente Rick Bowden, aunque esté si que es más ficticio",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "December 23, 2022, 06:29:54 AM",
      "body": "Aunque no es del todo de recibo, por curiosidad (y nada más), daban ganas de intentar descifrar la semilla para ver qué hay al otro lado. Pensaba que vería el ejercicio realizado de manera pública en algún post en Reddit o algo así, pero por ahora no he logrado dar con él. Dentro de lo que cabe, el texto tiene mala grafía, y resulta muy complicado de entender. Creo que el policía va y canta varias de las palabras de la semilla en el vídeo, algo que me pareció inaudito también. No sé, con un poco de suerte tendremos más episodios del caso.Leí en posts de Reddit que en EEUU los videos policiales grabados se pueden solicitar, aunque no he visto los detalles al respecto. En todo caso, una cosa es solicitar para su visionado como implicado, y otra es luego exponerlo a la vista de todos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "December 23, 2022, 05:34:09 PM",
      "body": "Por algo se llama mnemónico no? porque se supone que las palabras son memorizables. Dentro de tu coco nadie las puede grabar. Y, sin embargo, a ver quien es el guapo que se fía de no tener un papelito con las claves. Y si se tienen varias carteras, como suele ser habitual, ya no te cuento. Pero puede que memorizar una, la principal aunque fuera, no fuera mala idea. A la policía solo le quedará la tortura para sonsacártela",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "December 23, 2022, 05:59:45 PM",
      "body": "Quote from: Porfirii on December 23, 2022, 05:34:09 PM<…>Visto que la persona en cuestión tenía una Ledger (o por lo menos eso figura escrito en la hoja de papel con las 24 palabras), otra opción sería la de añadirle uno o varios  passphrases para poder realmente acceder a las cuentas Ledger, donde cada passphrase es precisa, junto con las 24 palabras de la semilla, para llegar a acceder a un conjunto de cuentas determinado.La web de Trezor lo explica mejor que la de Ledger, mediante este post:https://blog.trezor.io/passphrase-the-ultimate-protection-for-your-accounts-3a311990925bNota: Podría darse el caso de que la persona del video las usase (aunque lo dudo).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}