{
  "id": "topic_5401085",
  "title": "Andrik Viate",
  "author": "Andrik Viate",
  "created_time": "June 02, 2022, 08:23:48 AM",
  "content": "My questions is that ' is there any possibility that some point in time in future BTC community might decide something which can retrieve this lost BTCs?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401085",
  "comments": [
    {
      "author": "LoyceV",
      "created_time": "June 02, 2022, 08:30:05 AM",
      "body": "Quote from: Andrik Viate on June 02, 2022, 08:23:48 AMMy questions is that ' is there any possibility that some point in time in future BTC community might decide something which can retrieve this lost BTCs?No.Quote from: satoshi on June 21, 2010, 05:48:26 PMLost coins only make everyone else's coins worth slightly more.  Think of it as a donation to everyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "June 02, 2022, 08:35:37 AM",
      "body": "Quote from: Andrik Viate on June 02, 2022, 08:23:48 AMMy questions is that ' is there any possibility that some point in time in future BTC community might decide something which can retrieve this lost BTCs?1. We cannot foresee what the future holds.2. Untouched coins are not necessarily lost. One very common example is the funded collectible coins and items. Hence if it's ever decided that those coins will \"return into circulation\", that would mean in some cases stealing/confiscation (!).3. My questions to OP is: why do you think that such move is necessary? Do you know that the maximum (almost) 21M Bitcoin we'll ever have means (nearly) 210 000 000 0000 000 satoshi?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "June 02, 2022, 08:49:12 AM",
      "body": "I will speak for myself, as I don't know what's the others' opinion (neither do I care): I will never configure my node to do such thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "June 02, 2022, 08:58:29 AM",
      "body": "Quote from: BlackHatCoiner on June 02, 2022, 08:49:12 AMI will speak for myself, as I don't know what's the others' opinion (neither do I care): I will never configure my node to do such thing.I'm with you.@OP: I already came up with a name for your Forkcoin: Bitcoin Steal!While on the subject of Forking, if I ever make a Fork, I'll call it BitcoinLV (BLV): Bitcoin Loyce Vision or Bitcoin Loyce Valenzuela. I wouldn't hold my breath though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "June 02, 2022, 10:23:46 AM",
      "body": "Quote from: Andrik Viate on June 02, 2022, 08:23:48 AMMy questions is that ' is there any possibility that some point in time in future BTC community might decide something which can retrieve this lost BTCs?If technology (especially quantum computers) develops and the value of bitcoin increases exaggeratedly, some may try to (restore) some of the old bitcoins as they were sent to the public key directly (P2PK.)Other than that, as long as you are generating seeds randomly, you are not sending from your cold storage address, it is impossible for anyone to spend your money other than you as long as you are the only one who knows your seeds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "June 02, 2022, 10:26:36 AM",
      "body": "Quote from: BlackHatCoiner on June 02, 2022, 08:49:12 AMI will speak for myself, as I don't know what's the others' opinion (neither do I care): I will never configure my node to do such thing. [I assume you're referring to the [impossible] possibility that one day the BTC network decides to distribute the coins to everyone? ]Anyway, you can already make your node configured as strictly as a peer only, and disable the wallet functionality with wallet=0. I have actually done that already some time ago. Not that the protocol can force you to create a wallet or access and RPC calls purely by a message from a peer though, so adding this is not necessary.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "June 02, 2022, 10:35:54 AM",
      "body": "In the first place, how would you know if coins on certain wallet addresses are actually 'lost' and not with the owner just holding silently by not spending or moving the coins around?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "June 02, 2022, 10:39:31 AM",
      "body": "No one has the right to interfere into how other people are spending, storing, or using their Bitcoin. Bitcoin is censorship-resistant and immutable. If you change that principle, you no longer have Bitcoin. You have an altcoin where a centralized group decided to change year-long rules.Each Bitcoin holder decides for himself. I can keep my coins on the same address forever without moving them if I want to, without fear that someone might attempt to steal them for whatever reason.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kaggie",
      "created_time": "June 02, 2022, 10:47:58 AM",
      "body": "If that happened, then it would destroy the idea that bitcoin is a long term store of value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "June 02, 2022, 11:03:01 AM",
      "body": "Outside of the obvious no answer they can't be taken. I find it amazing the number of people who don't understand the concept of long term things.I actually have some 30 year bonds that I bought while I was in college. Just sitting there earning interest for the last 2 1/2 decades. What if people decided to do the same with their BTC do you just want to take that?Years ago (and they may still exist) there were 50 year bonds. Do you just want to take those from people?How about show up at their house and take the cash they have in a shoebox in the back of the closet that they have been collecting since they were young?-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "June 02, 2022, 11:12:55 AM",
      "body": "With Bitcoin, your money is secured by laws of the universeBrute force Bitcoin private key is very hard if you don't have any information, like wallet ID and json file in this video, it is impossible to brute force a Bitcoin private key. [1][1] https://www.youtube.com/watch?v=rMtW8vIHHek",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "June 02, 2022, 11:39:52 AMLast edit: June 02, 2022, 05:26:31 PM by BlackHatCoiner",
      "body": "Quote from: NotATether on June 02, 2022, 10:26:36 AM[...]What I meant is that I'll never accept to freeze coins or move them arbitrarily without a digital signature. That'd make bitcoin susceptible to censorship. Quote from: mk4 on June 02, 2022, 10:35:54 AMIn the first place, how would you know if coins on certain wallet addresses are actually 'lost' and not with the owner just holding silently by not spending or moving the coins around?Exactly. We don't know if those early outputs are still accessible, and therefore can't make a conclusion. In fact, we keep seeing people, occasionally, who unlock outputs that are more than a decade old.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "June 02, 2022, 11:46:02 AM",
      "body": "Quote from: Andrik Viate on June 02, 2022, 08:23:48 AMMy questions is that ' is there any possibility that some point in time in future BTC community might decide something which can retrieve this lost BTCs?What this can lead to is hardfork that will lead to the creation of an altcoin, just like bitcoin cash.If the lost bitcoin are to be recreated, who will be the owner? The lost coins are lost but not lost in value, the value of the lost coin will be added to the ones that are not lost as the circulatory supply is reduced. So, why creating it again, even no one knows the coins that have lost, because a coin is not transferred over 50 years does not mean it is lost. The more the circulatory supply is reducing the more the increase in price as the coin become more limited in supply and will become more valuable.Protect your wallet, seed phrase, private key and bitcoin so not to be a victim of a lost coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tadamichi",
      "created_time": "June 02, 2022, 12:16:43 PM",
      "body": "Quote from: Andrik Viate on June 02, 2022, 08:23:48 AMMy questions is that ' is there any possibility that some point in time in future BTC community might decide something which can retrieve this lost BTCs?Nah, but i dont think we should be too concerned about lost coins, because in the unlikely case that the circulating supply gets too low(because of lost coins) to still be functional, we could add more decimal places to it and so never run out of it(with the positive side effect of not screwing anyone up, because their amount of coins remains the same).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "June 02, 2022, 02:53:26 PM",
      "body": "Does anyone still believe in the theories launched by a spy company (blockchain analysis) to promote themselves and their business a few years ago? If memory serves me well, they based their theory of lost coins on a period of 4 years of inactivity, which is a completely meaningless methodology to determine how much Bitcoin has been irretrievably lost.Although the exact number will remain unknown, I think that given the human exaggeration around everything, the number of BTCs currently lost is close to 2 million - although this is just speculation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "June 02, 2022, 03:20:14 PM",
      "body": "Quote from: tranthidung on June 02, 2022, 11:12:55 AMWith Bitcoin, your money is secured by laws of the universeThat refers to a brute force attack on your keys alone.No law in this universe will be able to prevent a hard fork if the community is stupid enough to decide on it for whatever reasons that make no sense right now. Satoshi will keep his coins on his own chain but if that is abandoned his coins will have nearly the same value those currently mined on the BSV network have.Stupidity is the only thing in this universe that has no rules or limits, but I seriously doubt I would see something as stupid as this, at least in my lifetime. After that, who cares!Quote from: DaveF on June 02, 2022, 11:03:01 AMOutside of the obvious no answer they can't be taken. I find it amazing the number of people who don't understand the concept of long term things.I actually have some 30 year bonds that I bought while I was in college. Just sitting there earning interest for the last 2 1/2 decades. What if people decided to do the same with their BTC do you just want to take that?As I said there is no limit to stupidity, I can perfectly see somebody coming up with an idea of recreating the chain where everyone has to come with his addresses and all KYC details to receive clean coins in a new chain while the ones not claimed by anyone else are presumed lost and destroyed. And trust me, you're going to see people cheering for this as it will give BTC legitimacy or whatever!Just looks at the number of topics like this one where random guys want a piece of satoshis coins, just because they think they deserve!Greed and envy will always manage to ruin a lot of nice things and ideas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ale88",
      "created_time": "June 02, 2022, 03:20:46 PM",
      "body": "Quote from: Andrik Viate on June 02, 2022, 08:23:48 AMMy questions is that ' is there any possibility that some point in time in future BTC community might decide something which can retrieve this lost BTCs?There is nothing you can do about it. Anyway 5 years is a short amount of time, for sure we don't have 4.5 mln of bitcoins lost forever, many of them are just sitting in the wallets of some real hodlers. There are addresses without any transaction for the last 10 years and then suddenly the bitcoin move, so what you're asking could even be dangerous because it would suggest to take the bitcoin from someone who didn't actually lose them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "June 02, 2022, 03:37:03 PM",
      "body": "Quote from: Andrik Viate on June 02, 2022, 08:23:48 AMMy questions is that ' is there any possibility that some point in time in future BTC community might decide something which can retrieve this lost BTCs?Well, I don't think so, lost bitcoins are lost, and it's up to their individual owners to individually look or find a way to get their lost bitcoins back, and if they can't, then those bitcoins continues to stay lost forever.4.45 million bitcoins is no small amount and if this number continues to stay unaccessible to its owners, then this will help the ones in circulation to worth slightly more in price.Come to think of it, how do you expect the entire bitcoin community to collectively work together to retrieve lost bitcoins when the community doesnt own those bitcoins?, and when at the end of it, the owners of those bitcoins will claim their lost bitcoins and not give anything back to the community, I don't think it's worth the community's time and effort.Those who lost their bitcoins by carelessly misplacing or forgetting their password should carefully find a way to retrieve their lost bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 02, 2022, 03:50:33 PM",
      "body": "Quote from: Andrik Viate on June 02, 2022, 08:23:48 AMMy questions is that ' is there any possibility that some point in time in future BTC community might decide something which can retrieve this lost BTCs?as a member of the community, whereby i have coins i have not touched for more then 5 years. i have decided that you shall leave my coins alone!!my coins are not lost. i am just treating them as a retire plan.but if you think 5 years is enough. how about i come to your city, approach your employer and demand that i take your employment retirement plan of all funds over 5 years old. if you wish to steal funds that do not belong to you, first start by surrendering your own funds first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}