{
  "id": "topic_5407601",
  "title": "nicvin",
  "author": "nicvin",
  "created_time": "July 25, 2022, 06:19:25 PM",
  "content": "Hello, i got banned and now i cant withdrawal my commissions. And im not the only one. There was a rouge staff member trying to get “promotion” By doing a good job banning account that have lots on commissions. Im not even able to withdraw the commissions.“Saving the company money”, there is literally no support so if you get banned make sure not to waste your time with support because nobody will be willing to help you.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407601",
  "comments": [
    {
      "author": "Ulven",
      "created_time": "July 25, 2022, 06:35:31 PM",
      "body": "It says you were banned from the casino for no reason. Can you tell us which site has banned? Or you are based in a country that is not supported by the casino You can add more details so we know if the casino is illegal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "July 25, 2022, 06:36:50 PMLast edit: July 25, 2022, 07:10:41 PM by Oshosondy",
      "body": "Contact their customer care.  I have not heard about the gambling site before but seem to have been existing for long.But the gambling site would have a reason you were banned. Why do you not want to disclose the reason you were banned? Or no reason given?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nicvin",
      "created_time": "July 25, 2022, 07:00:13 PM",
      "body": "Already contacted Support they do not resolve the issue they just make excuses or say there is nothing they can do, i also registered from a legal Country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "July 25, 2022, 07:08:01 PM",
      "body": "Quote from: nicvin on July 25, 2022, 06:19:25 PMHello, i got banned and now i cant withdrawal my commissions. And im not the only one. There was a rouge staff member trying to get “promotion” By doing a good job banning account that have lots on commissions. Im not even able to withdraw the commissions.“Saving the company money”, there is literally no support so if you get banned make sure not to waste your time with support because nobody will be willing to help you.you are talking about this casino: https://bc.gameif yes then they have ANN Thread here on the forum: BC.Game-🔴🔴🔴BET RED IN CRASH!🔴🔴🔴 Find More Unique Games!Thread creator is not active on the forum, but I recommend you open scam accusation and post proofQuote from: nicvin on July 25, 2022, 07:00:13 PMAlready contacted Support they do not resolve the issue they just make excuses or say there is nothing they can do, i also registered from a legal Country. so you don't know why you were banned?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "July 25, 2022, 07:09:29 PM",
      "body": "Quote from: nicvin on July 25, 2022, 07:00:13 PMAlready contacted Support they do not resolve the issue they just make excuses or say there is nothing they can do, i also registered from a legal Country. Can you show us in any image, the response from the gambling site customer care? Newbies can not post image, but you can just use the image on https://imgur.com and paste here the link in a new post reply here on this thread. Before it can be concluded that a gambling site scammed someone, there should be enough proof from the victim. You have no proof yet that you were banned for no reason.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aew",
      "created_time": "July 25, 2022, 08:18:42 PM",
      "body": "Quote from: nicvin on July 25, 2022, 07:00:13 PMAlready contacted Support they do not resolve the issue they just make excuses or say there is nothing they can do, i also registered from a legal Country. Where is the proof I play on this casino since 2 years never has a problem. Either you had something like taking advantage of some promotion or doing something not good. Unless you show us proof then you just another crybaby and we think you the wrong one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ebede",
      "created_time": "July 25, 2022, 08:26:33 PM",
      "body": "Quote from: nicvin on July 25, 2022, 06:19:25 PMHello, i got banned and now i cant withdrawal my commissions. And im not the only one. There was a rouge staff member trying to get “promotion” By doing a good job banning account that have lots on commissions. Im not even able to withdraw the commissions.“Saving the company money”, there is literally no support so if you get banned make sure not to waste your time with support because nobody will be willing to help you.Since you are banned in that platform I don't think that there is any other further possibility for you to withdraw the money you win through the casino game in that particular site so that is why verification is needed in any gambling website especially kyc so if it is a website that sells kyc verification so I think your money can be withdrawn anything and anyone",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "July 25, 2022, 08:40:13 PM",
      "body": "Quote from: Ebede on July 25, 2022, 08:26:33 PMSince you are banned in that platform I don't think that there is any other further possibility for you to withdraw the money you win through the casino game in that particular site so that is why verification is needed in any gambling website especially kyc so if it is a website that sells kyc verification so I think your money can be withdrawn anything and anyoneWhat did you mean as 'sell KYC verification'? Gambling sites that are centralized can block a user from withdrawing and the user will not be able to withdraw, also the account can be banned because it is a centralized betting site. The best when using a centralized platform is to never violate their rules. Most likely that nicvin violated one of the rules of BC.game.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ebede",
      "created_time": "July 25, 2022, 08:53:22 PM",
      "body": "Quote from: Oshosondy on July 25, 2022, 08:40:13 PMQuote from: Ebede on July 25, 2022, 08:26:33 PMSince you are banned in that platform I don't think that there is any other further possibility for you to withdraw the money you win through the casino game in that particular site so that is why verification is needed in any gambling website especially kyc so if it is a website that sells kyc verification so I think your money can be withdrawn anything and anyoneWhat did you mean as 'sell KYC verification'? Gambling sites that are centralized can block a user from withdrawing and the user will not be able to withdraw, also the account can be banned because it is a centralized betting site. The best when using a centralized platform is to never violate their rules. Most likely that nicvin violated one of the rules of BC.game.My account that is going to be found in any particular site I don't think that the sound to have the authority 2 found it again that's one that yes it is a centralised platform so when you are properly verify what is the necessary thing again that will make them to buy new except that yes their is law that is involved coach you skip or you disobey",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "July 25, 2022, 08:59:18 PM",
      "body": "If you get banned its better for the site to let you know the reason of the ban so you can know if its right or not. Probably there’s an abuse with your part on promotions or maybe none at all. There’s no such thing that if an employee caught a cheater or ban a user, they will get a promotion, where did you get this idea?Anyway, show us a proof and communicate with the site they are still active here and probably they can answer your concern here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "July 25, 2022, 10:27:06 PM",
      "body": "Quote from: nicvin on July 25, 2022, 06:19:25 PMHello, i got banned and now i cant withdrawal my commissions. And im not the only one.There are many cases online similar to this about this same BCgame, even dated to 2021. As something to note, it has often been stated that before you subscribe to any online casino, It is proper to do your research to know if they can be trusted or if they have any particular issues peculiar to them. It is also good to familiarise yourself with their rules, terms and conditions.I don't know how long you've had an account with this casino, if you have done proper research in my opinion you would have found out that they've had some cases and would have avoided them. See this - Over $100k confiscated/locked by BCgame .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aew",
      "created_time": "July 25, 2022, 10:32:48 PM",
      "body": "Quote from: Rruchi man on July 25, 2022, 10:27:06 PMQuote from: nicvin on July 25, 2022, 06:19:25 PMHello, i got banned and now i cant withdrawal my commissions. And im not the only one.There are many cases online similar to this about this same BCgame, even dated to 2021. As something to note, it has often been stated that before you subscribe to any online casino, It is proper to do your research to know if they can be trusted or if they have any particular issues peculiar to them. It is also good to familiarise yourself with their rules, terms and conditions.I don't know how long you've had an account with this casino, if you have done proper research in my opinion you would have found out that they've had some cases and would have avoided them. See this - Over $100k confiscated/locked by BCgame .Didn't you read the full post of the guy ? Wjonfound a loophole on the site ?Read first then post. Beside that the OP didn't post any proof. There no way they will ban him without a reasonSo he doesn't want to tell the reason too So good luck believing him if you that naive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Newlifebtc",
      "created_time": "July 25, 2022, 10:53:10 PM",
      "body": "Quote from: crzy on July 25, 2022, 08:59:18 PMIf you get banned its better for the site to let you know the reason of the ban so you can know if its right or not. Probably there’s an abuse with your part on promotions or maybe none at all. There’s no such thing that if an employee caught a cheater or ban a user, they will get a promotion, where did you get this idea?Anyway, show us a proof and communicate with the site they are still active here and probably they can answer your concern here. Some of the side do not let their customers know before banning them. because they feel like before you partner with them all access their site you might have read there are rules and regulation so informing you before burning is not proper from the way I understand it so that is why anyone who is operating to any site have to read the rules and regulation before the person start working with the site",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "July 26, 2022, 12:38:45 AM",
      "body": "Quote from: aew on July 25, 2022, 10:32:48 PMQuote from: Rruchi man on July 25, 2022, 10:27:06 PMQuote from: nicvin on July 25, 2022, 06:19:25 PMHello, i got banned and now i cant withdrawal my commissions. And im not the only one.There are many cases online similar to this about this same BCgame, even dated to 2021. As something to note, it has often been stated that before you subscribe to any online casino, It is proper to do your research to know if they can be trusted or if they have any particular issues peculiar to them. It is also good to familiarise yourself with their rules, terms and conditions.I don't know how long you've had an account with this casino, if you have done proper research in my opinion you would have found out that they've had some cases and would have avoided them. See this - Over $100k confiscated/locked by BCgame .Didn't you read the full post of the guy ? Wjonfound a loophole on the site ?Read first then post. Beside that the OP didn't post any proof. There no way they will ban him without a reasonSo he doesn't want to tell the reason too So good luck believing him if you that naive. Naive? What do you mean aew? You are hiding something about your case against PrimeDice? You are not telling all the truth? That's why you think nicvin is a liar and \"crybaby\"?It's a well known fact that casinos don't like players who make profits, while they love players who spend all their money. So I wouldn't be surprised that they've locked his account to prevent him from withdrawing his earnings. It wouldn't be the first one neither the last one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aew",
      "created_time": "July 26, 2022, 02:15:51 AM",
      "body": "Quote from: Saint-loup on July 26, 2022, 12:38:45 AMQuote from: aew on July 25, 2022, 10:32:48 PMQuote from: Rruchi man on July 25, 2022, 10:27:06 PMQuote from: nicvin on July 25, 2022, 06:19:25 PMHello, i got banned and now i cant withdrawal my commissions. And im not the only one.There are many cases online similar to this about this same BCgame, even dated to 2021. As something to note, it has often been stated that before you subscribe to any online casino, It is proper to do your research to know if they can be trusted or if they have any particular issues peculiar to them. It is also good to familiarise yourself with their rules, terms and conditions.I don't know how long you've had an account with this casino, if you have done proper research in my opinion you would have found out that they've had some cases and would have avoided them. See this - Over $100k confiscated/locked by BCgame .Didn't you read the full post of the guy ? Wjonfound a loophole on the site ?Read first then post. Beside that the OP didn't post any proof. There no way they will ban him without a reasonSo he doesn't want to tell the reason too So good luck believing him if you that naive. Naive? What do you mean aew? You are hiding something about your case against PrimeDice? You are not telling all the truth? That's why you think nicvin is a liar and \"crybaby\"?It's a well known fact that casinos don't like players who make profits, while they love players who spend all their money. So I wouldn't be surprised that they've locked his account to prevent him from withdrawing his earnings. It wouldn't be the first one neither the last one. Yes naive. For believing a new created account without a proof or a single word on the reason.  It's probably he created multiple accounts since he talked about commission maybe he is self refered himself. Otherwise why doesn't he tell the reason or why doesn't he post a screenshot?For my case for and see the proofs. .don't be fooled so easily. Yes that's what naives do. Have you seen any proof to be judgmental?I will apologize to you of he posted a proof but believe me he have nothing if he did he will post it. I challenge him to do and post a proof of his claims and that he didn't break the casinos rules Also you posted a link to a post sis you read the post about that OP he admitted to his wrong doing and the loop hole he was using. .untill now yes I believe you are naive sorry but yes you are for believing one side of the story. .. without a single proof",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "July 26, 2022, 05:00:43 AM",
      "body": "Quote from: nicvin on July 25, 2022, 06:19:25 PMHello, i got banned and now i cant withdrawal my commissions. And im not the only one. There was a rouge staff member trying to get “promotion” By doing a good job banning account that have lots on commissions. Im not even able to withdraw the commissions.“Saving the company money”, there is literally no support so if you get banned make sure not to waste your time with support because nobody will be willing to help you.Maybe putting some proofs here since you are accusing a site about scamming would be better, and also there are no clarity in your posts about that Commissions? in what part did you have a commission and from how long?how much the amount and what is supposedly a reason because it is odd that they are just banning an account without giving initial case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iv4n",
      "created_time": "July 26, 2022, 05:26:49 AM",
      "body": "Quote from: aew on July 26, 2022, 02:15:51 AM...Have you seen any proof to be judgmental?I will apologize to you of he posted a proof but believe me he have nothing if he did he will post it. I challenge him to do and post a proof of his claims and that he didn't break the casinos rules ...Well, I think the same... where is some proof? Except some strong words, people jumping in with early conclusions (based on what?!), I don't see anything special here... and OP didn't gamble and win, he pointed out that he wish \"his commission\", probably some trick with referral, multi-accounting, etc...I doubt he has something to post...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rodskee",
      "created_time": "July 26, 2022, 06:57:50 AM",
      "body": "Quote from: nicvin on July 25, 2022, 07:00:13 PMAlready contacted Support they do not resolve the issue they just make excuses or say there is nothing they can do, i also registered from a legal Country. can you at least share here about the support contacts? the conversation from the support that they admit of nothing they can do to your case?and also it is impossible that they provide no reason for banning you as you claim that they answered your email?it is not common to just say they can do nothing and just like that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "July 26, 2022, 07:44:31 AMLast edit: July 26, 2022, 08:30:36 AM by Saint-loup",
      "body": "Quote from: aew on July 26, 2022, 02:15:51 AMYes naive. For believing a new created account without a proof or a single word on the reason.  It's probably he created multiple accounts since he talked about commission maybe he is self refered himself. Otherwise why doesn't he tell the reason or why doesn't he post a screenshot?For my case for and see the proofs. .don't be fooled so easily. Yes that's what naives do. Have you seen any proof to be judgmental?I will apologize to you of he posted a proof but believe me he have nothing if he did he will post it. I challenge him to do and post a proof of his claims and that he didn't break the casinos rules Also you posted a link to a post sis you read the post about that OP he admitted to his wrong doing and the loop hole he was using. .untill now yes I believe you are naive sorry but yes you are for believing one side of the story. .. without a single proof I haven't posted any link, so I don't understand what you are talking about. But if you think breaking some casino own rules is a sufficient reason to steal customers funds, you are defending casino scams. Because if you are not aware of that, it's precisely how worst reputed casinos like 1xbit are scamming people. They just claim you have breached their ToS and they steal your funds. I'm sure PD could be able to find one so called rule you've breached for example. Cases leading to lock or cancel customers winnings should be clearly defined and reminded, and cases leading to the lock of all customer funds should be the most serious and uncommon cases and should be always handled by a separate and independent entity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}