{
  "id": "topic_5404751",
  "title": "dkbit98",
  "author": "dkbit98",
  "created_time": "July 01, 2022, 10:25:18 AM",
  "content": "Few days ago one Singapore based company UKISS released their version of hardware wallet device called Hugware, but this is not ordinary hardware wallet.They claim this is world’s first recovery phrase-free hardware wallet, and it comes in pair of two devices, one serves as Authentication Key (A-key) and other as Rescue Key (R-key).Hugware uses master seed synchronisation across devices, and that is why recovery phrases are not needed, while master seed never gets out.A-key is protecting private keys and it is used for connection to computer and making transaction, but if you lose it you can use R-key to sync again with replacement A-key.Hugware devices looks similar like usb sticks made from metal, and it is obviously closed source device that is using patented technology.Interesting thing is that this device can be used for encrypting and hiding files on your computer with U-Hide software.There is closed source Hub software that is the only way to connect it with Hugware, and it's only available for wiNd0ws and Mac OS, not for Linux. https://www.ukiss.io/hugware/ Hugware is currently supporting Bitcoin and total of 30 major coins and tokens, and it can be purchased for $139 plus shipping.I don't like this system very much because in case you lose both your A and R keys you will lose everything, and you won't be able to recover your coins.In case you lose A-key, you will need to buy new A-key because R-key can only be used for backup, and you can't add wallet, add account, add coin or move assets. I want to see some independent reviews for Hugware, but until then I wouldn't recommend anyone to purchase this device.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404751",
  "comments": [
    {
      "author": "NeuroticFish",
      "created_time": "July 01, 2022, 11:35:04 AM",
      "body": "Quote from: dkbit98 on July 01, 2022, 10:25:18 AMI don't like this system very much because in case you lose both your A and R keys you will lose everything, and you won't be able to recover your coins.In case you lose A-key, you will need to buy new A-key because R-key can only be used for backup, and you can't add wallet, add account, add coin or move assets. While it does look neat, I would not buy it. I don't think that I'd buy a HW that doesn't allow me make an old fashioned non-electronic backup. If that's the only option, I'd simply use cold storage for the relevant funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "July 01, 2022, 08:56:53 PM",
      "body": "Quote from: NeuroticFish on July 01, 2022, 11:35:04 AMQuote from: dkbit98 on July 01, 2022, 10:25:18 AMI don't like this system very much because in case you lose both your A and R keys you will lose everything, and you won't be able to recover your coins.In case you lose A-key, you will need to buy new A-key because R-key can only be used for backup, and you can't add wallet, add account, add coin or move assets. While it does look neat, I would not buy it. I don't think that I'd buy a HW that doesn't allow me make an old fashioned non-electronic backup. If that's the only option, I'd simply use cold storage for the relevant funds.+1 to that And it's closed source. So we will never know what it's doing. Seems like yet another device that is an answer in search of a question.Add in their U-Hide software and it really starts to look like a gimmick. -Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "July 01, 2022, 11:37:07 PM",
      "body": "Other than looking like a cool pocket knife, this thing is a non-starter.  It has absolutely nothing going for it.  It's closed source, no independent backup, and no recourse against loss or failure of just one of the two required devices, making it a potential loss just waiting to happen.  Of course that's assuming that UKISS isn't keeping all the seeds in a spreadsheet, just waiting for enough wales to use their device.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "July 02, 2022, 08:06:44 AM",
      "body": "No seed or private keys means no independent and recoverable backups. If I can't recover my funds elsewhere, I am being forced to stick with their device unless I sweep my funds over to something else. At first glance I don't see anything which would justify purchasing this product. I will continue using standard hardware wallets with physical seed backups that I can import where I feel like it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "July 02, 2022, 01:37:34 PM",
      "body": "Quote from: dkbit98 on July 01, 2022, 10:25:18 AMIn case you lose A-key, you will need to buy new A-key because R-key can only be used for backup, and you can't add wallet, add account, add coin or move assets. Even though the R-key doesn't have the ability to add a wallet or move assets to another account, it can still be used for \"importing wallets\" and \"sending/receiving assets\" to/from other addresses [a bit strange], but I still hate every bit of this hardware wallet [e.g. they're not even selling them separately]!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "July 02, 2022, 02:31:50 PM",
      "body": "I just looked to them site and found they have more services like U-Archive (https://www.ukiss.io/suite/#u-archive) which encrypts data and stores it in the cloud, an act that does not suggest that they care about privacy or make the code open source and easy to trace.QuoteOnly the holder of the associated Hugware® can access your archive. This software will launch in August. it seems they have more software that are also closed source.I don't know but there is no reason to use them, the price is too high, the company is unknown, they are not open source and a lot of negative things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "July 04, 2022, 02:39:53 PM",
      "body": "Quote from: NeuroticFish on July 01, 2022, 11:35:04 AMWhile it does look neat, I would not buy it. I don't think that I'd buy a HW that doesn't allow me make an old fashioned non-electronic backup. If that's the only option, I'd simply use cold storage for the relevant funds.I think that Ukiss Hugware won't be the only hardware wallet using system like this, unless something changes in future Block (Square) is planning something similar for their upcoming hardware wallet.Quote from: DireWolfM14 on July 01, 2022, 11:37:07 PMOther than looking like a cool pocket knife, this thing is a non-starter.  It has absolutely nothing going for it.  It's closed source, no independent backup, and no recourse against loss or failure of just one of the two required devices, making it a potential loss just waiting to happen. Biggest problem for me is the fact that you can only use Hugware with their Hub software, and no third party wallet could ever work with it.In case their company goes bankrupt (like many crypto companies today) they will probably shut down their node, that would make Hugware useless and all coins lost forever.Quote from: SFR10 on July 02, 2022, 01:37:34 PMEven though the R-key doesn't have the ability to add a wallet or move assets to another account, it can still be used for \"importing wallets\" and \"sending/receiving assets\" to/from other addresses [a bit strange], but I still hate every bit of this hardware wallet [e.g. they're not even selling them separately]!This is full table of differences between A-key and R-key.I don't know how moving of assets is different from sending, but it is certainly limited.https://www.ukiss.io/userguide/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "July 04, 2022, 07:52:07 PM",
      "body": "Quote from: dkbit98 on July 04, 2022, 02:39:53 PMI don't know how moving of assets is different from sending, but it is certainly limited.From what I've understood, each wallet can contain multiple accounts [created by end-user] and that's where the move asset feature and A-key come into play [to move certain assets between accounts].- Luckily, there's no limit on sending assets [as long as you have the R-key].",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "July 05, 2022, 04:20:05 AM",
      "body": "Weird name & company, but let's continue...Quote from: dkbit98 on July 01, 2022, 10:25:18 AMInteresting thing is that this device can be used for encrypting and hiding files on your computer with U-Hide software.There is closed source Hub software that is the only way to connect it with Hugware, and it's only available for wiNd0ws and Mac OS, not for Linux. The operating systems where the majority of malware is created for are the only supported platforms? Strike 1. Proprietrary encryption software? Strike 2 (Why didn't they just use RSA? They know the NSA wants backdoors in all encryption algos).So two strikes already against this hardware wallet. I'll just be munching on my popcorn and waiting for one last screwup from this wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "July 05, 2022, 05:45:01 AM",
      "body": "Quote from: dkbit98 on July 04, 2022, 02:39:53 PMI think that Ukiss Hugware won't be the only hardware wallet using system like this, unless something changes in future Block (Square) is planning something similar for their upcoming hardware wallet.Yes, I know, sadly. It seems to be a trend of new type of Hardware wallets which, in a way or another, make the users rely 100% on 3rd party.After advocating for so many years moving the funds out of exchanges, we'll end up people tied to odd \"fool proof\" hardware wallets in which God knows what is implemented and what can the company do with your money, your KYC info or whatever.We will have to tell the users of the new generation of HW the same rule: not your keys, not your coins.Quote from: NotATether on July 05, 2022, 04:20:05 AMSo two strikes already against this hardware wallet. I'll just be munching on my popcorn and waiting for one last screwup from this wallet.And since the wallet will be bought by newbies (seasoned bitcoiners will see the traps), the screwups will certainly come.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "July 05, 2022, 07:24:26 AM",
      "body": "Here is an instruction on how to recover your keys if one of the devices (either A-key or R-key) is lost:https://www.ukiss.io/userguide/If I understand the recovery process correctly, then this closed-source piece of hardware doesn't offer any advantages over (and is even worse than) standard open-source hardware wallets because: 1) your security is as strong as the complexity of your PIN; 2) if one of the devices is stolen or secretly replaced, your funds are compromised since an attacker can synchronize his device with yours without fuss or muss by following the same key recovery process.But wait, there is more!https://whitepaper.ukiss.io/The biometric data that you will be using as a way to access your R-key will be stored on a centralized server, associated with your keys and addresses, and shared with or sold to third parties!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "July 05, 2022, 01:05:43 PM",
      "body": "Quote from: NotATether on July 05, 2022, 04:20:05 AMThe operating systems where the majority of malware is created for are the only supported platforms? Strike 1. Proprietrary encryption software? Strike 2 (Why didn't they just use RSA? They know the NSA wants backdoors in all encryption algos).I guess you could use it with Mac OS that is probably better option and less malware is created for that, but I don't understand why there isn't support for linux.It looks to me that all their business is revolving around release of their new kiss token, so when that collapses everything else will probably follow soon after.Quote from: witcher_sense on July 05, 2022, 07:24:26 AMThe biometric data that you will be using as a way to access your R-key will be stored on a centralized server, associated with your keys and addresses, and shared with or sold to third parties!Oh boy, does anyone really believe that Ukiss is working with IBM?  They say this will be semi-custodian service so it's not totally centralized, but we don't know how it actually works.It's funny they also claim there is no risk with this...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "July 05, 2022, 04:49:49 PM",
      "body": "Quote from: dkbit98 on July 05, 2022, 01:05:43 PMOh boy, does anyone really believe that Ukiss is working with IBM?  That token will be dead in the water long before UKISS works with Big Blue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}