{
  "id": "topic_5470039",
  "title": "robelneo",
  "author": "robelneo",
  "created_time": "October 11, 2023, 09:23:18 PM",
  "content": "So the gaming and gambling industry is contributing a very large percentage to the US economy roughly 26% and this has a significant impact on their economy and job generation, the US has 20 cities that are considered gambling cities, and they contribute to the coffer of every State where they are located QuoteThe latest study for the American Gaming Association (AGA) shows that the casino gaming industry annually generates almost $329 billion in economic activity to significantly contribute to the U.S. economy. According to the press release, the study conducted by Oxford economic on behalf of AGA shows that the industry supports 1.8 million jobs, provides $104 million of wages and salaries, and generates almost $53 billion in tax revenues to federal, state, and local governments.AGA Survey Finds That Gaming Industry Annually Contributes $329 Billion to U.S. EconomyHow about in your country does the casino industry contribute to your economy in terms of revenue coming from taxes, job generation, and establishment of companies that revolve around the gambling industry? do you think that your country should expand and encourage new stakeholders in the casino industry to increase revenue and employment?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470039",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "October 11, 2023, 09:30:48 PM",
      "body": "My country is one of the most populous in the world and there are many gambling companies with millions of users that are making money from their users. Gambling is regulated most in the way to favour the governments in tax generation. If there are many gambling companies in a country and people are using them, the government in the country will generate more internal revenue from gambling, while some will provide gambling service to people outside the country as additional way for the government to make more money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dunfida",
      "created_time": "October 11, 2023, 09:39:38 PM",
      "body": "Here's some statistics here in our country.1. The Canadian gaming industry contributes nearly $9 billion in annual revenue and supports various government and community programs and services.2. In 2021, the Canadian gambling industry was valued at $12.54 billion, with lottery sales being the primary source of revenue.3. Approximately 18.9 million people in Canada reported gambling in the past year, with 95% of players considered non-problem gamblers.4. Slots and bingo are the most popular types of electronic gambling in the country.5. The growth of the gaming industry in Canada can be attributed to the increase in the availability of legal gaming options.SourceIf we do speak about contribution of gambling industry then it cant really be denied that it do really make out that huge role in terms of economic approach considering on the revenue that it generates which its not really that something new considering that this industrycould really generate out billions.Although not all corners of the world would really be that legalizing gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "October 12, 2023, 02:35:37 PM",
      "body": "The casino industry has significant contributions to our country because the government is the one running the casino and the lottery QuoteTHE Philippine Amusement and Gaming Corporation (PAGCOR) came up with another record-breaking income performance after it posted a total revenue of P17.70 billion for the first quarter of 2023, surpassing by 42.8% its P12.4 billion production during the same period last year.Of the agency’s P17.70 billion roughly $31 million income haul for the first three months of the year, P16.87 billion came from gaming operations. Said amount is 49.43% higher than the P11.29 billion earnings from gaming in 2022.They support the health sectors in our country and our athletes' needs in preparation for the International meet, we are a third-world country and the contribution coming from the gambling industry sustains two sectors of our society that the government lacks the funds to sustain, like the United States it creates jobs and industry that revolves around the casino industry, especially the tourism industry, we have a robust tourism industry because part of that is we promote the casinos to our tourist since majority of our casinos are located on hotels.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "October 13, 2023, 04:57:33 PM",
      "body": "My country is quite a very interesting example of how things can go wrong with the gambling market when politics get involved. We used to have fairly established casino industry in resorts and cities where people liked to spend their vacations in, but all of it changed when the socialist party arrived and held onto power. They assumed gambling was completely contrary to the ideology they wanted to implant in the population, so they used their power to pass laws which would limit the establishment of casinos and even closed down many of them. Because of it, the contribution for my country from such industry is mostly null. It is one of the few cases I have seen gambling and politics to directly involve one against the other.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "October 19, 2023, 12:11:47 PM",
      "body": "Quote from: Hispo on October 13, 2023, 04:57:33 PMMy country is quite a very interesting example of how things can go wrong with the gambling market when politics get involved. We used to have fairly established casino industry in resorts and cities where people liked to spend their vacations in, but all of it changed when the socialist party arrived and held onto power. They assumed gambling was completely contrary to the ideology they wanted to implant in the population, so they used their power to pass laws which would limit the establishment of casinos and even closed down many of them. Because of it, the contribution for my country from such industry is mostly null. It is one of the few cases I have seen gambling and politics to directly involve one against the other. It's very different for us here in our country, our politicians fully support the casino industry, because it is attached to our tourism industry, and since our country run our casino industry here they encourage the proliferation of business associated with casinos because it creates jobs, and taxes for the government.Some countries restrict or even ban casinos, they fail to realize that there are revenues in casino industries while minimizing the exposure of their citizen, in the case of Macau they restrict their people and only allow tourists to play in casinos in their countries and they benefit a lot from this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avp2306",
      "created_time": "October 19, 2023, 12:24:15 PM",
      "body": "Quote from: coin-investor on October 19, 2023, 12:11:47 PMQuote from: Hispo on October 13, 2023, 04:57:33 PMMy country is quite a very interesting example of how things can go wrong with the gambling market when politics get involved. We used to have fairly established casino industry in resorts and cities where people liked to spend their vacations in, but all of it changed when the socialist party arrived and held onto power. They assumed gambling was completely contrary to the ideology they wanted to implant in the population, so they used their power to pass laws which would limit the establishment of casinos and even closed down many of them. Because of it, the contribution for my country from such industry is mostly null. It is one of the few cases I have seen gambling and politics to directly involve one against the other. Some countries restrict or even ban casinos, they fail to realize that there are revenues in casino industries while minimizing the exposure of their citizen, in the case of Macau they restrict their people and only allow tourists to play in casinos in their countries and they benefit a lot from this.They maybe come on some point that they allow the casino to operate in their country but they fail to regulate it and see the worse conditions rather than earning benefits for allowing its operation that's why they decide to ban casino to operate on their country.But if they really have a legal department that can handle this business and pass some regulation to safe guards their young people to engage with gambling then for sure this casino can really give some good revenue to the government. Also it can create a lot of jobs to their people but some of the country decide to ban it since maybe they can't accept the consequences brought up by casino and they think the income of their country is sustainable that's why maybe they are confident that they are still fine even if there's no revenue coming from those casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nara1892",
      "created_time": "October 19, 2023, 12:25:35 PM",
      "body": "Quote from: robelneo on October 11, 2023, 09:23:18 PMHow about in your country does the casino industry contribute to your economy in terms of revenue coming from taxes, job generation, and establishment of companies that revolve around the gambling industry? do you think that your country should expand and encourage new stakeholders in the casino industry to increase revenue and employment?I would say the opposite, I think the gambling industry is destroying the economy (in my country). Considering that based on government reports they lose typical state revenue due to gambling. Where the economic turnover, where people usually actively buy and sell goods, is now decreasing. Most of these cases refer to people's gambling activities which are becoming more and more significant day by day. They are more active in spending money on gambling than buying goods. As a result, economic turnover is hampered, this comparison is seen from before and after the pandemic. Therefore, if I'm not mistaken, the government is making improvements by blocking online gambling sites, in fact every day the government blocks more than 10K illegal gambling sites.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "edmundduke",
      "created_time": "October 19, 2023, 12:35:28 PM",
      "body": "Gambling is not really a huge thing where i am from, especially casinos. I was trying to also look up stats but there really sint much info out there.I feel like most of the gambling that happens must be loto related. Something like Bingo/Keno etc, the games that are on TV, those do get quite a lot of play. I also almost never see ads for offline casinos, the ony ones i see are for online casinos and usually with sporting events.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Russlenat",
      "created_time": "October 19, 2023, 12:40:49 PM",
      "body": "We can't deny that the gambling industry has a significant impact on the economy, but it varies from country to country. In developed countries like the USA, many people can afford to gamble for entertainment without significantly affecting their finances, which isn't the case in poorer countries.Let me provide an example from my country, the Philippines. We have state-sponsored gambling, such as the lottery or commonly known as lotto in the Philippines, which generates substantial revenue for the government. While this isn't like casinos, where people can lose larger sums of money, some individuals still become addicted despite the slim chances of winning.Now, speaking of casinos, we have the POGO (Philippine Offshore Gaming Operators). These are often operated by Chinese businessmen who come to the Philippines to run their businesses. The government benefits from the tax income generated by this operation. However, there are restrictions on citizens gambling in these establishments, which are primarily intended for tourists or high rollers within the country.By limiting access to the casinos, the government can increase tax revenue while also ensuring that the financial status of the average person isn't negatively impacted. Unlike traditional casinos, which are open to everyone, including those with limited means, this approach aims to reduce the temptation to gamble excessively. Effective control and policy implementation are crucial to ensure that the gambling industry has a positive impact on the overall economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "October 19, 2023, 12:45:18 PM",
      "body": "In Muslim-majority countries the casino industry does not provide tax income for the country because this industry is prohibited there, such as in my country which is Muslim-majority. Here the casino industry is prohibited from operating because it is against religious norms, so there is no national tax income from the casino industry. But in my area, which is a predominantly Christian area, the casino industry runs and provides a little income to the local government and they actively carry out charity actions to build various facilities. So even though nationally it is prohibited, locally it is allowed to operate and I think it has a good impact on society.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Viscore",
      "created_time": "October 19, 2023, 01:03:39 PM",
      "body": "Quote from: retreat on October 19, 2023, 12:45:18 PMIn Muslim-majority countries the casino industry does not provide tax income for the country because this industry is prohibited there, such as in my country which is Muslim-majority. Here the casino industry is prohibited from operating because it is against religious norms, so there is no national tax income from the casino industry. But in my area, which is a predominantly Christian area, the casino industry runs and provides a little income to the local government and they actively carry out charity actions to build various facilities. So even though nationally it is prohibited, locally it is allowed to operate and I think it has a good impact on society.Good impact on the society but not on the country, some countries with major casinos are really benefiting from the industry. Top biggest countries in the world as per https://blog.kheloo.com/top-20-biggest-gambling-countries-in-the-world/The top 3 are ;1. USA 2. China3. Japan.These are billion-dollar industries, and we can already imagine the significant impact of gambling on their country's revenue. Additionally, these are progressive countries. In short, the gambling industry could contribute to a country's economy and help it improve. Why do other countries ban gambling, aside from religious reasons?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "October 19, 2023, 01:53:45 PM",
      "body": "Not really sure how it contributed or what is the percentage, but I think just like any other nations with big casinos, it's huge and the government could also be taking taxes although I understand that they are very lenient about it so that they have to attract potential investors.So it's obvious that gambling is a big contributor to any country. And I remember this threads as well by @avikzHow gambling can effect the economy of a country [Part 1 - USA]How gambling can effect the economy of a country [Part 2 - Macau]How gambling can effect the economy of a country [Part 3 - Australia]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "October 19, 2023, 02:21:38 PM",
      "body": "Quote from: robelneo on October 11, 2023, 09:23:18 PMHow about in your country does the casino industry contribute to your economy in terms of revenue coming from taxes, job generation, and establishment of companies that revolve around the gambling industry?The gambling industry in my country is like a diamond at the bottom of the sea, whoever can dive is the one who enjoys the diamond.The gambling industry in my country is neither illegal nor legal, but almost 80% of online casino sites can be accessed and played. Many of the relevant ministries such as taxation, finance, DPR and so on have proposed that every online casino operating in the country be taxed for the country's economic growth, but until now all these proposals are like shrimp behind a rock.I'm sure online casino taxes go to the country and certain individuals in that part, that can be predicted from the online casinos that operate, they are very free, it could be said that no authorities dare to take action, In fact, some online gambling is played freely in my country, so the conclusion: the existence of a gambling industry in my country is very secret from taxation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Latviand",
      "created_time": "October 19, 2023, 02:41:03 PM",
      "body": "In my country, the current report it's around 3.7 billion USD, it doubled after the ease of restrictions in the pandemic protocols last year. The article I've checked which is the first article didn't have the exact percentage but I can attest that the gambling industry in the country is a thriving thing legitimate or illegitimate. Not to mention that most of the money made in that 3.7 billion USD is mostly from state run lotteries which is a big gambling thing for many of my paisanos for a long time now, even before I was born.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "October 19, 2023, 02:44:36 PM",
      "body": "Quote from: robelneo on October 11, 2023, 09:23:18 PMHow about in your country does the casino industry contribute to your economy in terms of revenue coming from taxes, job generation, and establishment of companies that revolve around the gambling industry? do you think that your country should expand and encourage new stakeholders in the casino industry to increase revenue and employment?The most recent research or survey by a reputable organization that I could get is in 2018 by PricewaterhouseCoopers International Limited[ (PwC). And it showed that my country earned a  Gross Gaming Revenue of $58 million in 2018. This revenue can increase if waste and corruption are reduced. Statistics on the percentage of people employed by the gambling sector of my country are sketchy. But through personal observation, I can attest that many citizens especially the youths are employed by mainly sporting bet companies. The gambling sector is one of the biggest contributors to finance and employment in my country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "October 19, 2023, 02:47:56 PM",
      "body": "I think I've already told the story here near my place in other threads but I will repeat it just for other readers who will visit this thread or in case the other one is buried somewhere. A cockpit was recently built here in our place, like 6 months ago. Then when they saw many players and gamblers coming because of the heavy traffic that it caused, they also worked out a parking space where car owners would also pay 20 pesos ($0.4) for their 1-hour stay. The parking space itself will accumulate a lot of money, what more with the gambling den, the cockpit. I heard stories/facts from the gamblers who visit the area, my neighbors to be precise. They say you bet for one an odd of 1.80 for one rooster you only get 1.60 if it wins. They are automatically taking the interest out of the winnings and no one can do anything about it because everything is computerized.Now, our city is upgrading, street lights, we felt it, paved and widened road, new city hall, and more. I am actually waiting for the next big thing, like a school, a big one that would surprise us all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "madnessteat",
      "created_time": "October 19, 2023, 03:01:26 PM",
      "body": "Quote from: robelneo on October 11, 2023, 09:23:18 PM~snip~In the country I live in there is a very high percentage of gamblers who play on foreign online gambling sites, because it is officially allowed to play only in a few specially designated areas for gambling. Many people do not make sense to lose a day or two to get to a land-based casino located in one of these territories, so a lot of money goes past the tax system of the country. I believe that this is a shortcoming of our authorities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "October 19, 2023, 04:02:22 PM",
      "body": "Quote from: madnessteat on October 19, 2023, 03:01:26 PMQuote from: robelneo on October 11, 2023, 09:23:18 PM~snip~In the country I live in there is a very high percentage of gamblers who play on foreign online gambling sites, because it is officially allowed to play only in a few specially designated areas for gambling. Many people do not make sense to lose a day or two to get to a land-based casino located in one of these territories, so a lot of money goes past the tax system of the country. I believe that this is a shortcoming of our authorities. The government missed so much money that is leaving without them profiting from it. Most countries however have their own sponsored lottery game where the locals can buy tickets in different stores. If this lottery contributes a large percentage to the economy, the more the country could get if they allow online operators.The catch however is that more of its citizens will be hooked into gambling. Bad enough with the terrible stories about housewives who are just addicted to social media. If housewives get hooked on casinos, its the end of it many will be divorced.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "October 19, 2023, 04:48:11 PM",
      "body": "Quote from: Russlenat on October 19, 2023, 12:40:49 PMNow, speaking of casinos, we have the POGO (Philippine Offshore Gaming Operators). These are often operated by Chinese businessmen who come to the Philippines to run their businesses. The government benefits from the tax income generated by this operation. However, there are restrictions on citizens gambling in these establishments, which are primarily intended for tourists or high rollers within the country.To be fair, Most of the casino in the Philippines is owned by foreign investors while they only hire Filipino citizen to front due to the Philippines law for foreign ownership of businesses here. POGO alone contributes approximately 1% of the Philippines GDP which is really insane that’s why I understand the special treatment given by the government on this sector despite it was owned by foreign investors yet many politicians still criticize this special treatment despite they are the one who benefits the most on tax money.  Quote from: Russlenat on October 19, 2023, 12:40:49 PMBy limiting access to the casinos, the government can increase tax revenue while also ensuring that the financial status of the average person isn't negatively impacted. Unlike traditional casinos, which are open to everyone, including those with limited means, this approach aims to reduce the temptation to gamble excessively. Effective control and policy implementation are crucial to ensure that the gambling industry has a positive impact on the overall economy.Agreed on this. Besides POGO is only for high rollers so I really doubt that a typical Filipino can play in there while there’s a lot of IRL casino available like city of dreams and okada. I believe the main reason why POGO is restricted to citizen is because foreign money in there often involved to money laundering which the government trying to control or hide. This Chinese businessman obviously scared to their shit in China since they have harsh law compared to our country that pro foreigners.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}