{
  "id": "topic_5436359",
  "title": "NwWork",
  "author": "NwWork",
  "created_time": "January 22, 2023, 01:51:13 PM",
  "content": "Need this wallet to be able to send usdt to Binance, Metamask since I know omni channel no longer supported so omniwallet and coinomi no good right?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436359",
  "comments": [
    {
      "author": "dbshck",
      "created_time": "January 22, 2023, 02:22:14 PM",
      "body": "I'm not entirely sure if I understood your question correctly, but AFAIK, Binance does not accept USDT on the Omni Layer. This means that it doesn't matter which wallet you're using, you will not be able to deposit USDT on the Omni Layer to Binance.Note that USDT is available on multiple blockchains, which include Bitcoin (Omni Layer), Ethereum, TRON, and Solana, to name a few. The USDT on one blockchain cannot be transferred to another blockchain. So, for example, if you have USDT on the Omni Layer, you will not be able to send it to an Ethereum wallet, such as Metamask. This is due to the multichain nature of USDT. Pay attention to which blockchain your USDT is on before trying to transfer it to a different wallet or exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NwWork",
      "created_time": "January 22, 2023, 02:42:20 PM",
      "body": "Understand I think Binance is TRC right so is there any TRC USDT non custodial wallets like Electrum which can be run on the laptop?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "January 22, 2023, 02:46:19 PM",
      "body": "Quote from: NwWork on January 22, 2023, 02:42:20 PMUnderstand I think Binance is TRC right so is there any TRC USDT non custodial wallets like Electrum which can be run on the laptop?Binance supports multiple chains — Tron, Solana, Ethereum, BSC, etc.If you're going to need a temporary wallet, probably Trust Wallet? I wouldn't suggest using it for long-term use though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dbshck",
      "created_time": "January 22, 2023, 02:56:03 PM",
      "body": "Quote from: NwWork on January 22, 2023, 02:42:20 PMUnderstand I think Binance is TRC right so is there any TRC USDT non custodial wallets like Electrum which can be run on the laptop?Yes, Binance does support USDT on the TRON blockchain, as well as many other EVM-compatible chains. In this case, I would recommend using Metamask as your wallet. It is a non-custodial wallet.  It can add any EVM-compatible chains (Ethereum, TRON, Binance Smart Chain, etc.) and it is widely used, which makes it easy to find help in case of any problems. Note that Metamask's default chain is Ethereum, so if you want to use other blockchains such as TRON, you will have to manually change the chain in the wallet settings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "January 22, 2023, 05:11:34 PM",
      "body": "Quote from: dbshck on January 22, 2023, 02:56:03 PM~ It can add any EVM-compatible chains (Ethereum, TRON, Binance Smart Chain, etc.) and it is widely used, which makes it easy to find help in case of any problems. Note that Metamask's default chain is Ethereum, so if you want to use other blockchains such as TRON, you will have to manually change the chain in the wallet settings.Although Tron is an EVM-compatible network, it is not an EVM-based chain that Metamask supports. So, AFAIK, the Tron network can't be used on Metamask since it is built on its own VM (Tron Virtual Machine). Quote from: NwWork on January 22, 2023, 02:42:20 PMis there any TRC USDT non custodial wallets like Electrum which can be run on the laptop?There is plenty of non-custodial wallets, but many of them are not open source. Take a look at https://tron.network/wallet?lng=en.If you specifically need a desktop wallet, Exodus and Atomic is one of many popular wallets that supports TRX. Do note that it multi-cryptocurrency wallet, so, if you don't need specifically need for other or many purposes, using the extension-based wallet would be simple. Tronlink seems the popular choice for Tron ecosystem users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NwWork",
      "created_time": "January 22, 2023, 10:57:19 PM",
      "body": "Quote from: vv181 on January 22, 2023, 05:11:34 PMQuote from: dbshck on January 22, 2023, 02:56:03 PM~ It can add any EVM-compatible chains (Ethereum, TRON, Binance Smart Chain, etc.) and it is widely used, which makes it easy to find help in case of any problems. Note that Metamask's default chain is Ethereum, so if you want to use other blockchains such as TRON, you will have to manually change the chain in the wallet settings.Although Tron is an EVM-compatible network, it is not an EVM-based chain that Metamask supports. So, AFAIK, the Tron network can't be used on Metamask since it is built on its own VM (Tron Virtual Machine). Quote from: NwWork on January 22, 2023, 02:42:20 PMis there any TRC USDT non custodial wallets like Electrum which can be run on the laptop?There is plenty of non-custodial wallets, but many of them are not open source. Take a look at https://tron.network/wallet?lng=en.If you specifically need a desktop wallet, Exodus and Atomic is one of many popular wallets that supports TRX. Do note that it multi-cryptocurrency wallet, so, if you don't need specifically need for other or many purposes, using the extension-based wallet would be simple. Tronlink seems the popular choice for Tron ecosystem users.Thank you for the great explanation, helped me actually research and realize that actually storing on Electrum itself is risky to a certain extent since can brute force 12word seed phrase but there is a pin requirement on login/import which is kind of comforting, but on Exodus not sure if have a pin to login+seed or only seed. But it seems Exodus has been hacked or support staff there has robbed some customers and also they charge a % for withdrawing which is very shady for a non custodial wallet. Gas fee understandable but this is not that. Atomic problem is lower security and again % being charged. Tron link super prone to hacks most common one seems the displayed address switch so when customer copies address it is not address shown by Tronlink but the intruders and they seem to have no idea how to patch it and have not given any proper support to those effected...What I am currently trying to do is diversify Crypto storage from Binance via USDT or USDC to non custodial wallets to spread the risk out. Hope there is any better software based cold wallets which support these currencies and exchange with Binance?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NwWork",
      "created_time": "January 22, 2023, 11:43:46 PM",
      "body": "Also does anyone know if chaintip is a legit site since apparently a random user called erogand tipped 10USD it seems and a message came via Reddit saying to claim it give a BCH address, is it legit?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "January 23, 2023, 05:06:17 AM",
      "body": "USDT is a centralized token and it can be frozen inside your non custodial wallet, which mean it's not 100% safe even though you've use non custodial wallet, you can't stop or prevent the creator to freeze your token.USDT is mainly run in ETH network, it's better if you use trezor or ledger if you want to be more secure rather than use non custodial wallet but the device is unsecure and has a lot applications that will compromise your device.Quote from: NwWork on January 22, 2023, 11:43:46 PMAlso does anyone know if chaintip is a legit site since apparently a random user called erogand tipped 10USD it seems and a message came via Reddit saying to claim it give a BCH address, is it legit?Did you mean this one? https://www.reddit.com/r/NoStupidQuestions/comments/ziyylu/a_random_tip/Based on the picture of that's thread, I don't see anything suspicious since he's only ask for BCH address, it would be different if they ask you to submit private key, seed phrase or ask for additional fee to unlock the reward. There's no way you can get hacked if you only share your BCH address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "savetheFORUM",
      "created_time": "January 23, 2023, 10:51:09 AM",
      "body": "Quote from: NwWork on January 22, 2023, 02:42:20 PMUnderstand I think Binance is TRC right so is there any TRC USDT non custodial wallets like Electrum which can be run on the laptop?TRC is the standard of tokens built using Tron Blockchain (if I remember right, there are TRC10 and TRC20 similar to ERC20 in ethereum environment).Moreover there are various none custodial tron wallets. TronLink is best among them according to me. It has both mobile app and browser extensions. Coinomi doesn't support TRC20 tokens. But, trustwallet does support TRC20 tokens as per I checked recently. So, you can use trustwallet too. Other than these two I don't suggest using any other wallets for tron based tokens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "January 23, 2023, 01:47:01 PM",
      "body": "Quote from: NwWork on January 22, 2023, 10:57:19 PMQuote from: vv181 on January 22, 2023, 05:11:34 PMQuote from: NwWork on January 22, 2023, 02:42:20 PMis there any TRC USDT non custodial wallets like Electrum which can be run on the laptop?There is plenty of non-custodial wallets, but many of them are not open source. Take a look at https://tron.network/wallet?lng=en.If you specifically need a desktop wallet, Exodus and Atomic is one of many popular wallets that supports TRX. Do note that it multi-cryptocurrency wallet, so, if you don't need specifically need for other or many purposes, using the extension-based wallet would be simple. Tronlink seems the popular choice for Tron ecosystem users.Thank you for the great explanation, helped me actually research and realize that actually storing on Electrum itself is risky to a certain extent since can brute force 12word seed phrase but there is a pin requirement on login/import which is kind of comforting, but on Exodus not sure if have a pin to login+seed or only seed. But it seems Exodus has been hacked or support staff there has robbed some customers and also they charge a % for withdrawing which is very shady for a non custodial wallet. Gas fee understandable but this is not that. Atomic problem is lower security and again % being charged. Tron link super prone to hacks most common one seems the displayed address switch so when customer copies address it is not address shown by Tronlink but the intruders and they seem to have no idea how to patch it and have not given any proper support to those effected...What I am currently trying to do is diversify Crypto storage from Binance via USDT or USDC to non custodial wallets to spread the risk out. Hope there is any better software based cold wallets which support these currencies and exchange with Binance?There is some misinformation from your understanding.1. seed phrases have near zero chance to be brute-forced if you generate and store them properly.2. most robbed users from the Exodus and Atomic wallet are very likely caused by the user's mistakes, not the wallet itself. AFAIK, there hasn't been known urgent security problem from both wallets.3. The issue from Tronlink is not a hack, it is a widely known scam attempt that happens widely. Every Tron wallet will have the same issue.If you seeking a simple and secure cold storage option, using a hardware wallet is surely worth it. It is more convenient than another manual cold storage method.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NwWork",
      "created_time": "January 23, 2023, 07:43:15 PM",
      "body": "Quote from: Apocollapse on January 23, 2023, 05:06:17 AMUSDT is a centralized token and it can be frozen inside your non custodial wallet, which mean it's not 100% safe even though you've use non custodial wallet, you can't stop or prevent the creator to freeze your token.USDT is mainly run in ETH network, it's better if you use trezor or ledger if you want to be more secure rather than use non custodial wallet but the device is unsecure and has a lot applications that will compromise your device.Quote from: NwWork on January 22, 2023, 11:43:46 PMAlso does anyone know if chaintip is a legit site since apparently a random user called erogand tipped 10USD it seems and a message came via Reddit saying to claim it give a BCH address, is it legit?Did you mean this one? https://www.reddit.com/r/NoStupidQuestions/comments/ziyylu/a_random_tip/Based on the picture of that's thread, I don't see anything suspicious since he's only ask for BCH address, it would be different if they ask you to submit private key, seed phrase or ask for additional fee to unlock the reward. There's no way you can get hacked if you only share your BCH address.You were right chaintip is legit and that person actually had sent BCH used a Binance wallet address to collect and converted to USDT just to be sure and it is 100% legit.Also good advice on USDT will consider USDCHere is a list of searches I did and their answers;is usdc and ustc the same?No, they are not the same. USDC is a stablecoin backed by the US dollar, while USTC is a stablecoin backed by the Chinese yuan.does Binance support USDC?Yes, Binance supports the USDC stablecoin.can I convert BCH to USDC inside Binance?Yes, you can convert BCH to USDC inside Binance.Is USDT non custodial?No, USDT is not non-custodial. It is a custodial stablecoin, meaning that the user's funds are held by a third party.Is USDC non custodial?Yes, USDC is a non-custodial stablecoin, meaning that the user's funds are not held by a third party.what is safer USDC or USDT?USDC is generally considered to be safer than USDT because it is a non-custodial stablecoin, meaning that the user's funds are not held by a third party.can anyone freeze USDC?No, USDC is a decentralized stablecoin, meaning that no one can freeze the funds.can any government takedown USDC?No, USDC is a decentralized stablecoin, meaning that no government can take it down.can any government takedown USDT?Yes, USDT is a custodial stablecoin, meaning that a government could take it down if they wanted to.who owns rights to USDC?The rights to USDC are owned by CENTRE, a consortium of Circle and Coinbase.is CENTRE a registered company?Yes, CENTRE is a registered company in the state of Delaware.so if CENTRE gets indiction to take down USDC can it be done?No, USDC is a decentralized stablecoin, meaning that CENTRE cannot take it down.Why not? If they have the rights to it?Because USDC is a decentralized stablecoin, meaning that no one entity has control over it. It is managed by a distributed network of computers, so no single entity can take it down.Ok but then how can CENTRE own rights to it if so?CENTRE owns the rights to the USDC protocol, which is the technology used to power the USDC stablecoin. They do not own the USDC tokens themselves, which are owned by the individuals who hold them.can you takedown the technology used to power USDC and the USDC will be a goner?No, even if the technology used to power USDC is taken down, the USDC tokens will still be in circulation and can still be used as a form of payment.would Binance have a reason to delist USDC?Binance may delist USDC if they believe that it is no longer a viable asset or if it violates any of their policies.In this case what would happen to our the USDC tokens kept at Binance?If Binance delists USDC, users can still withdraw their USDC tokens from Binance and store them in a secure wallet.Do they give a time limit to do so or any time can?If Binance delists USDC, they will usually give users a certain amount of time to withdraw their tokens before the delisting is effective.what happens if we missed that time given?If you miss the time given to withdraw your USDC tokens, your tokens may be lost.How can it be recovered?It may not be possible to recover your USDC tokens if you miss the time given to withdraw them.Why not?This is because, once they are delisted, they may no longer be accessible to you.But it is to Binance right?Yes, the USDC tokens are still stored on Binance, but if they are delisted, you may no longer be able to access them.But Binance can?Yes, Binance may still be able to access the USDC tokens, but they will not be accessible to you.Maybe they can transfer it for us?No, Binance will not transfer your USDC tokens for you. You must withdraw them yourself before the delisting is effective.How likely is it for USDC to get delisted?It is unlikely that USDC will be delisted, as it is a popular stablecoin and is widely used by many exchanges and users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "January 24, 2023, 05:21:57 AM",
      "body": "Years ago I used to use armoury to sign my Omni transactions for tether and it was in complete cold storage. However many exchanges these days no longer accept tether from the Omni protocol. Because it seems inefficient. Hence I had to switch to erc20.This is your only choice now if you want cold storage. Use MEW offline or get a hardware wallet and you can keep your tether safe this way. As long as your verify your downloads you shouldn’t have a problem. And don’t store your seeds somewhere unsafe such as on cloud storage. Keep it inside your house somewhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "January 24, 2023, 05:35:48 AM",
      "body": "Quote from: NwWork on January 23, 2023, 07:43:15 PMIs USDC non custodial?Yes, USDC is a non-custodial stablecoin, meaning that the user's funds are not held by a third party.what is safer USDC or USDT?USDC is generally considered to be safer than USDT because it is a non-custodial stablecoin, meaning that the user's funds are not held by a third party.can anyone freeze USDC?No, USDC is a decentralized stablecoin, meaning that no one can freeze the funds.You're completely wrong here!USDC is also centralized stablecoin just like USDT, the difference is only the company which issue the token. 2 years ago Centre's CEO froze someone USDC coin by blacklist the address [1] which mean if you hold your USDC in your non custodial wallet, your USDC token can be frozen too.The only trusted decentralized stablecoin which can't get frozen is DAI.[1] https://www.coindesk.com/markets/2020/07/08/circle-confirms-freezing-100k-in-usdc-at-law-enforcements-request/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NwWork",
      "created_time": "January 26, 2023, 12:28:16 PM",
      "body": "Quote from: Apocollapse on January 24, 2023, 05:35:48 AMQuote from: NwWork on January 23, 2023, 07:43:15 PMIs USDC non custodial?Yes, USDC is a non-custodial stablecoin, meaning that the user's funds are not held by a third party.what is safer USDC or USDT?USDC is generally considered to be safer than USDT because it is a non-custodial stablecoin, meaning that the user's funds are not held by a third party.can anyone freeze USDC?No, USDC is a decentralized stablecoin, meaning that no one can freeze the funds.You're completely wrong here!USDC is also centralized stablecoin just like USDT, the difference is only the company which issue the token. 2 years ago Centre's CEO froze someone USDC coin by blacklist the address [1] which mean if you hold your USDC in your non custodial wallet, your USDC token can be frozen too.The only trusted decentralized stablecoin which can't get frozen is DAI.[1] https://www.coindesk.com/markets/2020/07/08/circle-confirms-freezing-100k-in-usdc-at-law-enforcements-request/Hmm lots of smokes and screens then but anyways as the saying goes you cannot escape the law. But in terms of it being safe from delisting remains potentially true. And with regard to MEW wallet the reviews are just as bad on TP does it have 2FA with Google?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NwWork",
      "created_time": "January 26, 2023, 01:40:06 PM",
      "body": "Quote from: vv181 on January 23, 2023, 01:47:01 PMQuote from: NwWork on January 22, 2023, 10:57:19 PMQuote from: vv181 on January 22, 2023, 05:11:34 PMQuote from: NwWork on January 22, 2023, 02:42:20 PMis there any TRC USDT non custodial wallets like Electrum which can be run on the laptop?There is plenty of non-custodial wallets, but many of them are not open source. Take a look at https://tron.network/wallet?lng=en.If you specifically need a desktop wallet, Exodus and Atomic is one of many popular wallets that supports TRX. Do note that it multi-cryptocurrency wallet, so, if you don't need specifically need for other or many purposes, using the extension-based wallet would be simple. Tronlink seems the popular choice for Tron ecosystem users.Thank you for the great explanation, helped me actually research and realize that actually storing on Electrum itself is risky to a certain extent since can brute force 12word seed phrase but there is a pin requirement on login/import which is kind of comforting, but on Exodus not sure if have a pin to login+seed or only seed. But it seems Exodus has been hacked or support staff there has robbed some customers and also they charge a % for withdrawing which is very shady for a non custodial wallet. Gas fee understandable but this is not that. Atomic problem is lower security and again % being charged. Tron link super prone to hacks most common one seems the displayed address switch so when customer copies address it is not address shown by Tronlink but the intruders and they seem to have no idea how to patch it and have not given any proper support to those effected...What I am currently trying to do is diversify Crypto storage from Binance via USDT or USDC to non custodial wallets to spread the risk out. Hope there is any better software based cold wallets which support these currencies and exchange with Binance?Quote from: vv181 on January 23, 2023, 01:47:01 PMQuote from: NwWork on January 22, 2023, 10:57:19 PMQuote from: vv181 on January 22, 2023, 05:11:34 PMQuote from: NwWork on January 22, 2023, 02:42:20 PMis there any TRC USDT non custodial wallets like Electrum which can be run on the laptop?There is plenty of non-custodial wallets, but many of them are not open source. Take a look at https://tron.network/wallet?lng=en.If you specifically need a desktop wallet, Exodus and Atomic is one of many popular wallets that supports TRX. Do note that it multi-cryptocurrency wallet, so, if you don't need specifically need for other or many purposes, using the extension-based wallet would be simple. Tronlink seems the popular choice for Tron ecosystem users.Thank you for the great explanation, helped me actually research and realize that actually storing on Electrum itself is risky to a certain extent since can brute force 12word seed phrase but there is a pin requirement on login/import which is kind of comforting, but on Exodus not sure if have a pin to login+seed or only seed. But it seems Exodus has been hacked or support staff there has robbed some customers and also they charge a % for withdrawing which is very shady for a non custodial wallet. Gas fee understandable but this is not that. Atomic problem is lower security and again % being charged. Tron link super prone to hacks most common one seems the displayed address switch so when customer copies address it is not address shown by Tronlink but the intruders and they seem to have no idea how to patch it and have not given any proper support to those effected...What I am currently trying to do is diversify Crypto storage from Binance via USDT or USDC to non custodial wallets to spread the risk out. Hope there is any better software based cold wallets which support these currencies and exchange with Binance?There is some misinformation from your understanding.1. seed phrases have near zero chance to be brute-forced if you generate and store them properly.2. most robbed users from the Exodus and Atomic wallet are very likely caused by the user's mistakes, not the wallet itself. AFAIK, there hasn't been known urgent security problem from both wallets.3. The issue from Tronlink is not a hack, it is a widely known scam attempt that happens widely. Every Tron wallet will have the same issue.If you seeking a simple and secure cold storage option, using a hardware wallet is surely worth it. It is more convenient than another manual cold storage method.1. With the right hardware this would take probably a few hrs/days or a week at most to brute force, does these wallets have a way to auto reject connection incase of bruteforce attempts or a certain number of login tries? Like think about it for a second if random malicious party notices a fat crypto address and tracks it down to a specific wallet without Google 2FA the ROI is promised if they are willing to splurge on massive amounts of RAM and Network usage so that their software could bruteforce the hell out of the 12 word combination, I have seen people have even made programs to automate random seed injection into wallets and where the program auto detects if it has a balance and if not it continously loops entering random seed phrases it generates automatically till it finds one. And that is only if u run one program if u duplicate it they would be way faster. So anything without Google 2FA is no good as a software wallet.2.No not users mistake refer point 13.Makes senseSo know any laptop wallets that have Google 2FA login?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "January 26, 2023, 05:04:05 PM",
      "body": "Quote from: NwWork on January 26, 2023, 01:40:06 PM1. With the right hardware this would take probably a few hrs/days or a week at most to brute force, does these wallets have a way to auto reject connection incase of bruteforce attempts or a certain number of login tries? Like think about it for a second if random malicious party notices a fat crypto address and tracks it down to a specific wallet without Google 2FA the ROI is promised if they are willing to splurge on massive amounts of RAM and Network usage so that their software could bruteforce the hell out of the 12 word combination, I have seen people have even made programs to automate random seed injection into wallets and where the program auto detects if it has a balance and if not it continously loops entering random seed phrases it generates automatically till it finds one. And that is only if u run one program if u duplicate it they would be way faster. So anything without Google 2FA is no good as a software wallet.2.No not users mistake refer point 1Suppose brute forcing seed phrases are plausible. People won't even use cryptocurrency, and the cryptocurrency market won't have a one trillion dollar market cap, as the current CMC data. There is simply no use if it is crackable.I suggest you learn more about the differences between wallet and seed phrases. And do in mind there are various types of wallets, e.g. web wallets, desktop wallets, etc. If you truly comprehend it, you will understand why people are not dumb enough to use a broken system. In regard to point 2, show me the example of the issues, and I'm sure it is not the wallet's fault, instead, it is the users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NwWork",
      "created_time": "February 04, 2023, 10:45:57 AM",
      "body": "Quote from: vv181 on January 26, 2023, 05:04:05 PMQuote from: NwWork on January 26, 2023, 01:40:06 PM1. With the right hardware this would take probably a few hrs/days or a week at most to brute force, does these wallets have a way to auto reject connection incase of bruteforce attempts or a certain number of login tries? Like think about it for a second if random malicious party notices a fat crypto address and tracks it down to a specific wallet without Google 2FA the ROI is promised if they are willing to splurge on massive amounts of RAM and Network usage so that their software could bruteforce the hell out of the 12 word combination, I have seen people have even made programs to automate random seed injection into wallets and where the program auto detects if it has a balance and if not it continously loops entering random seed phrases it generates automatically till it finds one. And that is only if u run one program if u duplicate it they would be way faster. So anything without Google 2FA is no good as a software wallet.2.No not users mistake refer point 1Suppose brute forcing seed phrases are plausible. People won't even use cryptocurrency, and the cryptocurrency market won't have a one trillion dollar market cap, as the current CMC data. There is simply no use if it is crackable.I suggest you learn more about the differences between wallet and seed phrases. And do in mind there are various types of wallets, e.g. web wallets, desktop wallets, etc. If you truly comprehend it, you will understand why people are not dumb enough to use a broken system. In regard to point 2, show me the example of the issues, and I'm sure it is not the wallet's fault, instead, it is the users.The marketcap of crypto will be unaffected due to hacking:Since users put their hard earned money into seed only protected wallets and assume it is safe. Then a hackers program randomly by chance or luck guesses the matching seed phrase on whatever wallet u had Ur crypto then they simply transfer it to their wallet and then very slowly over several months and many transactions to mix origin done and cash out. So effectively crypto market cap unaffected only now hacker has the crypto user does not.It is not just plausible but very much possible and a very high security threat and any wallet developers who have not realized this is putting users money at risk.This also makes sense why even well experienced crypto ppl keep their money on CEX like Binance due to availability of uncrackable 2FA thanks to Google auth, Microsoft Auth, Authly etc since code changes every 20seconds to match that u need x10 computing power needed to crack the seed phrases on normal wallets.So please help me find a DEX or Non custodial wallet which uses this technology",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "February 04, 2023, 11:35:22 AM",
      "body": "Quote from: NwWork on February 04, 2023, 10:45:57 AMQuote from: vv181 on January 26, 2023, 05:04:05 PMQuote from: NwWork on January 26, 2023, 01:40:06 PM1. With the right hardware this would take probably a few hrs/days or a week at most to brute force, does these wallets have a way to auto reject connection incase of bruteforce attempts or a certain number of login tries? Like think about it for a second if random malicious party notices a fat crypto address and tracks it down to a specific wallet without Google 2FA the ROI is promised if they are willing to splurge on massive amounts of RAM and Network usage so that their software could bruteforce the hell out of the 12 word combination, I have seen people have even made programs to automate random seed injection into wallets and where the program auto detects if it has a balance and if not it continously loops entering random seed phrases it generates automatically till it finds one. And that is only if u run one program if u duplicate it they would be way faster. So anything without Google 2FA is no good as a software wallet.2.No not users mistake refer point 1Suppose brute forcing seed phrases are plausible. People won't even use cryptocurrency, and the cryptocurrency market won't have a one trillion dollar market cap, as the current CMC data. There is simply no use if it is crackable.I suggest you learn more about the differences between wallet and seed phrases. And do in mind there are various types of wallets, e.g. web wallets, desktop wallets, etc. If you truly comprehend it, you will understand why people are not dumb enough to use a broken system. In regard to point 2, show me the example of the issues, and I'm sure it is not the wallet's fault, instead, it is the users.The marketcap of crypto will be unaffected due to hacking:Since users put their hard earned money into seed only protected wallets and assume it is safe. Then a hackers program randomly by chance or luck guesses the matching seed phrase on whatever wallet u had Ur crypto then they simply transfer it to their wallet and then very slowly over several months and many transactions to mix origin done and cash out. So effectively crypto market cap unaffected only now hacker has the crypto user does not.It is not just plausible but very much possible and a very high security threat and any wallet developers who have not realized this is putting users money at risk.This also makes sense why even well experienced crypto ppl keep their money on CEX like Binance due to availability of uncrackable 2FA thanks to Google auth, Microsoft Auth, Authly etc since code changes every 20seconds to match that u need x10 computing power needed to crack the seed phrases on normal wallets.My point is, suppose cryptocurrency wallets are easily crackable, then simply the market just won't exist. I'm talking about the market net worth, not the subject of the hacker' who are getting away.To put it simply 1 in 5444517870735015415413993718908291383296 or 2048^12 chances, does it sound \"very much possible\" to you? I get that humans are bad with big numbers. Picture it like this, how possibly does you find someone's grain of sand within this world?Or simply answer this, why do we still haven't hear someone crack Satoshi's wallet or any big exchange addresses? Well, because it simply the success probability of cracking a seed phrase is near zero.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NwWork",
      "created_time": "February 04, 2023, 06:32:28 PM",
      "body": "Quote from: vv181 on February 04, 2023, 11:35:22 AMQuote from: NwWork on February 04, 2023, 10:45:57 AMQuote from: vv181 on January 26, 2023, 05:04:05 PMQuote from: NwWork on January 26, 2023, 01:40:06 PM1. With the right hardware this would take probably a few hrs/days or a week at most to brute force, does these wallets have a way to auto reject connection incase of bruteforce attempts or a certain number of login tries? Like think about it for a second if random malicious party notices a fat crypto address and tracks it down to a specific wallet without Google 2FA the ROI is promised if they are willing to splurge on massive amounts of RAM and Network usage so that their software could bruteforce the hell out of the 12 word combination, I have seen people have even made programs to automate random seed injection into wallets and where the program auto detects if it has a balance and if not it continously loops entering random seed phrases it generates automatically till it finds one. And that is only if u run one program if u duplicate it they would be way faster. So anything without Google 2FA is no good as a software wallet.2.No not users mistake refer point 1Suppose brute forcing seed phrases are plausible. People won't even use cryptocurrency, and the cryptocurrency market won't have a one trillion dollar market cap, as the current CMC data. There is simply no use if it is crackable.I suggest you learn more about the differences between wallet and seed phrases. And do in mind there are various types of wallets, e.g. web wallets, desktop wallets, etc. If you truly comprehend it, you will understand why people are not dumb enough to use a broken system. In regard to point 2, show me the example of the issues, and I'm sure it is not the wallet's fault, instead, it is the users.The marketcap of crypto will be unaffected due to hacking:Since users put their hard earned money into seed only protected wallets and assume it is safe. Then a hackers program randomly by chance or luck guesses the matching seed phrase on whatever wallet u had Ur crypto then they simply transfer it to their wallet and then very slowly over several months and many transactions to mix origin done and cash out. So effectively crypto market cap unaffected only now hacker has the crypto user does not.It is not just plausible but very much possible and a very high security threat and any wallet developers who have not realized this is putting users money at risk.This also makes sense why even well experienced crypto ppl keep their money on CEX like Binance due to availability of uncrackable 2FA thanks to Google auth, Microsoft Auth, Authly etc since code changes every 20seconds to match that u need x10 computing power needed to crack the seed phrases on normal wallets.My point is, suppose cryptocurrency wallets are easily crackable, then simply the market just won't exist. I'm talking about the market net worth, not the subject of the hacker' who are getting away.To put it simply 1 in 5444517870735015415413993718908291383296 or 2048^12 chances, does it sound \"very much possible\" to you? I get that humans are bad with big numbers. Picture it like this, how possibly does you find someone's grain of sand within this world?Or simply answer this, why do we still haven't hear someone crack Satoshi's wallet or any big exchange addresses? Well, because it simply the success probability of cracking a seed phrase is near zero.Actually it is not all 2048 since these hackers use machine learning to get the most common phrases narrowed down and word count of seed phrases also narrowed down due to previous successful iterations. And these guys simply run their programs continuously 24/7.  As I said earlier these programs are fully automated so it will keep trying on seed phrases till they hit a wallet with a balance and then it's game over for the user.In this context it has too much incentive for these nefarious parties to do this and already some are. So this we discuss as if one hacker did this now imagine this being done in a more commercial way running on 10-20pcs running like x10 programs per pc do you think it will take for ever for your wallet to fall victim if so you are sadly mistaken.Yeah sure some will be safe for a couple of years but that fateful day would be coming eventually....Well you may ask then why my PayPal or bank won't get hacked if they would do that and then only in crypto it can happen or why people would be putting money in crypto.PayPal or bank or any digital wallet is having a means of recourse both legally and financially where recovery of funds is possible but in cyrpto once a transfer is done it is done and there is no possibility for legal recourse due to decentralised nature.People put money in crypto trusting it would be safe if u have control of your own keys but they don't know it could be brute forced with these advanced tech due to static nature of seed and no retry preventative methods to prevent many failed entries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}