{
  "id": "topic_5440681",
  "title": "adi016",
  "author": "adi016",
  "created_time": "February 21, 2023, 11:37:42 AMLast edit: February 28, 2023, 04:03:33 PM by adi016",
  "content": "PST.NETPay • Store • TransferWe offer the best payment solution for advertising accounts and personal purchases. Issue your first card in 5 minutesThe best virtual cards for paying Google AdsFacebook AdsInstagram AdsMicrosoft AdsTikTok AdsAmazon Web ServicesDigital OceanMiroCanvaOr any website you want, our virtual card is 100% compatible for them.Fee Structure : Basic rates:We offer 4 types of cards (all have US corporate BIN(s)):•  Universal card ($15 per month).Suitable for most merchants (except for financial, banking and crypto sectors). Transactions in favor of Belarus, Burma, Burundi, Central Africa, Cuba, Congo, Hong Kong, Iran, Iraq, Lebanon, Libya, Nicaragua, North Korea, Russia, Somalia, Sudan, South Sudan, Syria, Ukraine, Venezuela, Yemen, Zimbabwe are strictly forbidden. We require that you use a US IP when making a purchase with these cards.Deposit commission - 8%• 3DS Universal card ($16 per month)3DS cards have a higher Success Rate and overall performs when paying for various services.Transactions in favor of Belarus, Burma, Burundi, Central Africa, Cuba, Congo, Hong Kong, Iran, Iraq, Lebanon, Libya, Nicaragua, North Korea, Russia, Somalia, Sudan, South Sudan, Syria, Turkey, Ukraine, Venezuela, Yemen, Zimbabwe are strictly forbidden. We require that you use a US IP when making a purchase with these cards. Deposit commission - 8%•  Advertisement card ($10 per month)Suitable for funding Facebook, Google Ads accounts and more. Deposit commission - 6%•  Premium Facebook card ($10 per month)Suitable only for paying Facebook Ads accounts.Deposit commission - 2.9%;Deposit commission for each successful authorization - $0.5Currently, our deposit methods are BTC and USDT (TRC-20).USDT (ERC-20) deposits are available only through support.PST PRIVATE PST Private offer is available for media buying teams with a minimum turnover of $30,000 per month.Additional Card Cost : $1 Top Up fees : 2%First 100 cards is free for test.Support Available at :Telegram : @PST_supportFollow PST to get notified about special offers and new contestshttps://t.me/pstdotnethttps://twitter.com/pstdotnetFor more detailed information, visit our website : https://pst.net",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440681",
  "comments": [
    {
      "author": "adi016",
      "created_time": "February 21, 2023, 11:38:05 AM",
      "body": "Reserved for future updates and feedback display",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "February 27, 2023, 10:00:47 PM",
      "body": "When you create a new bump, delete all previous bumps. such are the rules of the forum, and your thread will not look uninteresting with only bump posts.I tried to find some more information about this service, but there is very little available. can you write us a little more about everything, as far as I can see, the fee structure can only be found out after registration. It's from 2% and up to?You use a very old-aged domain, but how long this business is live?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adi016",
      "created_time": "February 28, 2023, 09:55:06 AM",
      "body": "Quote from: examplens on February 27, 2023, 10:00:47 PMWhen you create a new bump, delete all previous bumps. such are the rules of the forum, and your thread will not look uninteresting with only bump posts.I tried to find some more information about this service, but there is very little available. can you write us a little more about everything, as far as I can see, the fee structure can only be found out after registration. It's from 2% and up to?You use a very old-aged domain, but how long this business is live?Thank you for the suggestion.I edited the post and added the fee structure that you asked you.Yes, you mentioned it correct beside domain being old, we have been successfully running our services for 2 years now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "February 28, 2023, 10:10:28 AM",
      "body": "Quote from: adi016 on February 27, 2023, 07:34:54 PMBump of the dayIf you want to bump topics on this board, click \"bump\". See Bumping changes on some boards. You probably don't see that button, because you haven't earned any Merit in the past year. Without earned Merit, posting \"bump\" doesn't bump the topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}