{
  "id": "topic_5419012",
  "title": "catchfallingknife",
  "author": "catchfallingknife",
  "created_time": "November 01, 2022, 04:31:46 AM",
  "content": "What will Fed take tomorrow?We are confident that Fed will keep raising interest rates at this time, but by how much? What if it goes up by 50 points? What if it goes up by 75 points? Pump or Dump?Give me a good cause to make a big short (long) trade, I'm ready with cash  Peace!!!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5419012",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "November 01, 2022, 05:52:39 AM",
      "body": "Quote from: catchfallingknife on November 01, 2022, 04:31:46 AMGive me a good cause to make a big short (long) trade, I'm ready with cash  If you got the cash; then do the research.There are tons on information out there on inflation and the investment qualities of Bitcoin, sift through that and make your decision to invest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "November 01, 2022, 06:02:11 AM",
      "body": "Quote from: catchfallingknife on November 01, 2022, 04:31:46 AMWhat will Fed take tomorrow?We are confident that Fed will keep raising interest rates at this time, but by how much? What if it goes up by 50 points? What if it goes up by 75 points? Pump or Dump?Give me a good cause to make a big short (long) trade, I'm ready with cash  Peace!!!Whichever it is as long as they raise, there will be a dump. But they may actually pivot because they need to win the midterm election so that's something they'll have to consider or suffer the loss. If the Dems lose, the Reps will probably undo the policies they have decided and we'll have a big run. Anyway, this is just what I have read on the politics channel so we'll see what happens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "November 01, 2022, 07:40:19 AM",
      "body": "Quote from: catchfallingknife on November 01, 2022, 04:31:46 AMWhat will Fed take tomorrow?We are confident that Fed will keep raising interest rates at this time, but by how much? What if it goes up by 50 points? What if it goes up by 75 points? Pump or Dump?Give me a good cause to make a big short (long) trade, I'm ready with cash  Peace!!!Don't be desperate in trading the Federal Funds Rate tomorrow, the high inflation that is responsible for the huge rake hike this year has been actively priced-in already, therefore expected reaction might backfire. Furthermore, FED has ever made known its position of increasing the interest rate to 4.6%, so what we are seeing is not surprising anymore. However, economists expect the apex bank to raise the rate from 3.25% to 4.00% on Wednesday, which is 75 basis points. I hope this has answered your question, but be careful with what you want to do this time because the rake hike is highly expected, so it might trigger an aftermath negative reaction for the USD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "November 01, 2022, 08:00:00 AM",
      "body": "I see a completely different trend now, every crypto outlet has shifted 180° from the previous months and is claiming a rate increase equal to the predictions or of course, lower will trigger a price jump for Bitcoin. It's a bit weird, every hike in the rate has triggered a drop in the price, and although it has recovered after each it was never a course for a bull run, furthermore, I think the enthusiasm from a slowdown of interventions is already priced in, the last jump happened exactly because of this.I would be completely cautious in that hourly interval, If I would manage to get a trend right from the start I would take the profit and watch the next hour from the side, if it turns ugly and we do some -2k swings each way it will screw a lot of guys doing leverage. But, just to make it popcorn material, I would love to see the FED postponing the decision in the last minute, the chaos on the markets where everyone was putting their bets and now they are left clueless, reminds me of the RTW intro quotes:QuoteIt is pleasant, when the sea is high and the winds are dashing the waves about, to watch from the shores the struggles of anotherQuote from: bittraffic on November 01, 2022, 06:02:11 AMWhichever it is as long as they raise, there will be a dump.  I'm 99% inclined to think the same, but history has a habit of not repeating itself just when you're overconfident, and Bitcoin price also has this habit of doing some inexplicable movements, so neither a drop back below 20k nor a jump to 25k would surprise me genuinely.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "November 01, 2022, 08:29:42 AM",
      "body": "Quote from: stompix on November 01, 2022, 08:00:00 AMQuote from: bittraffic on November 01, 2022, 06:02:11 AMWhichever it is as long as they raise, there will be a dump.  I'm 99% inclined to think the same, but history has a habit of not repeating itself just when you're overconfident, and Bitcoin price also has this habit of doing some inexplicable movements, so neither a drop back below 20k nor a jump to 25k would surprise me genuinely.Once they give up fighting inflation, the investors may surely be looking for assets to hedge the value of their assets like BTC. However, if the FED still raises interest which is very likely what Pal wants, we're gonna see stocks diving again and perhaps BTC too.And then continue where we left off that people will all be going to tighten belts, maybe eat just twice a day and find 3 jobs to make ends meet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "November 01, 2022, 11:23:31 AM",
      "body": "Quote from: bittraffic on November 01, 2022, 08:29:42 AMOnce they give up fighting inflation, the investors may surely be looking for assets to hedge the value of their assets like BTC. However, if the FED still raises interest which is very likely what Pal wants, we're gonna see stocks diving again and perhaps BTC too.From here we're on different paths.The FED will never give up on inflation and inflation can't continue like this, not with these causes which are mainly energy costs and slow rebuilding of logistic and manufacturing chains.It's not a complete meltdown like Zimbabwe or Venezuela and this will either start to be contained as more and more industries resume complete operations and energy prices are going down alongside demand destruction. If there is no demand there won't be inflation either,  that's why contrary to some alarmists we don't have the barrel of oil at $300 and OPEC is cutting production after production capacity to keep it above $80.Quote from: bittraffic on November 01, 2022, 08:29:42 AMAnd then continue where we left off that people will all be going to tighten belts, maybe eat just twice a day and find 3 jobs to make ends meet.This is just impossible.Inflation happened because there was a lot of money and there was no production, if you think instead of having one job people will have 3 then you will have a ton of manufacturing and services, as these jobs have to produce something, which will mean more offer and with people tightening their pouch you will have exactly the opposite, deflation, what you picture here is exactly what's been happening in Japan for a decade, there won't be any trace of inflation in this scenario.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "November 01, 2022, 11:36:19 AM",
      "body": "Quote from: catchfallingknife on November 01, 2022, 04:31:46 AMGive me a good cause to make a big short (long) trade, I'm ready with cash  Peace!!!Don't rely on FED only to make your investment decision. The news from fed will only cause increase volatility because investors are trying to rush in to grab what they can and get out spontaneously and this will see the market settle down to the reality. You can only aim for pump gains but not the real longtime investment. You know the inflation so far is important to consider as it is a driving force to market price. Demand of crude and supply quantity from OPEC is another consideration and the year is running out different countries will make budget and their financial planning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "November 01, 2022, 02:45:09 PM",
      "body": "Tomorrow the fed will for sure raise by 75bps. But that isn’t the point.We are all waiting for their plan with future rate hikes in the year and early next year. If that dot plot is more dovish then we will rally.If we get 50bps tomorrow then we will rally like crazy and most likely bottomed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "November 01, 2022, 10:54:41 PM",
      "body": "There are a lot of rumors that they will increase it but why the price of the U.S. dollar is decreasing somehow? Maybe just a correct before another leg up?And also consider that most of bonds are dumping and stocks and crypto are pumping, so I believe there's something to do about the decision of the FED about increasing/decreasing the interest rate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "November 02, 2022, 05:27:28 AM",
      "body": "Quote from: catchfallingknife on November 01, 2022, 04:31:46 AMWhat will Fed take tomorrow?We are confident that Fed will keep raising interest rates at this time, but by how much? What if it goes up by 50 points? What if it goes up by 75 points? Pump or Dump?Give me a good cause to make a big short (long) trade, I'm ready with cash  Peace!!!Buy. I recommend Bitcoin to you. Let the FED take and make decisions today, but our best decision is to buy Bitcoins for future investments.Buying Bitcoin can secure our cash when the world is experiencing economic turmoil.You can read the two posts pinned on this economics board as important messages.Inflation and Deflation of Price and Money Supply[CHART] Bitcoin Inflation vs. Time",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "November 02, 2022, 05:40:17 AM",
      "body": "I think most people are expecting a 75 bps increase. The Fed does occasionally get accusations of being political so it wouldn’t come as a complete and total surprise if they increased by only 50 bps in order to let the market shoot upward in time to vote in the election. I think anything less than 75bps would signal a reversal from the Fed that the market would cheer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "November 02, 2022, 02:21:50 PM",
      "body": "The market has started calculating a quotation at 75 basis points, if that happens, the prices will start increasing, if the rate of increase is more than 75 basis points, there will be a big correction and vice versa.What matters is not the rate of increase, but impressions. Will the rate be the last, and we will start looking for stable points at 5%, or will the rate of increase be 10%?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "traderethereum",
      "created_time": "November 02, 2022, 03:08:02 PM",
      "body": "I don't think we need to think about what the FED will take tomorrow because it's none of our business.What we should pay attention to is if something happens to bitcoin and it means the price could drop even deeper, we have to buy it fast before things change.I think it will be difficult to make short or long trades because I feel that the bitcoin movement will become more difficult.I suggest you buy bitcoin, hold it, and don't care if the price goes up and down, and only buy when it goes down deep.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "November 02, 2022, 07:24:43 PM",
      "body": "Quote from: bittraffic on November 01, 2022, 06:02:11 AMQuote from: catchfallingknife on November 01, 2022, 04:31:46 AMWhat will Fed take tomorrow?We are confident that Fed will keep raising interest rates at this time, but by how much? What if it goes up by 50 points? What if it goes up by 75 points? Pump or Dump?Give me a good cause to make a big short (long) trade, I'm ready with cash  Peace!!!Whichever it is as long as they raise, there will be a dump. But they may actually pivot because they need to win the midterm election so that's something they'll have to consider or suffer the loss. If the Dems lose, the Reps will probably undo the policies they have decided and we'll have a big run. Anyway, this is just what I have read on the politics channel so we'll see what happens. Well Biden will veto everything in 2023 and 2024but come Jan 2025 things will explode under trump or whomever the republicans get in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rby",
      "created_time": "November 02, 2022, 08:28:12 PM",
      "body": "Quote from: bittraffic on November 01, 2022, 08:29:42 AMQuote from: stompix on November 01, 2022, 08:00:00 AMQuote from: bittraffic on November 01, 2022, 06:02:11 AMWhichever it is as long as they raise, there will be a dump.  I'm 99% inclined to think the same, but history has a habit of not repeating itself just when you're overconfident, and Bitcoin price also has this habit of doing some inexplicable movements, so neither a drop back below 20k nor a jump to 25k would surprise me genuinely.Once they give up fighting inflation, the investors may surely be looking for assets to hedge the value of their assets like BTC. However, if the FED still raises interest which is very likely what Pal wants, we're gonna see stocks diving again and perhaps BTC too.And then continue where we left off that people will all be going to tighten belts, maybe eat just twice a day and find 3 jobs to make ends meet. The last time I followed the FED resolution because I read a documentary about how the market will behave if FED moves above 75 or below. After following, FED made decision that we supposed was in favour of bitcoin. From that time till now what has really happened positively about bitcoin? They want us to follow again this time around. I will not waste my time again. The only important thing to me is the bitcoin halving and not all the FED bla blah",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "November 02, 2022, 09:49:50 PM",
      "body": "Quote from: catchfallingknife on November 01, 2022, 04:31:46 AMWhat will Fed take tomorrow?We are confident that Fed will keep raising interest rates at this time, but by how much? What if it goes up by 50 points? What if it goes up by 75 points? Pump or Dump?Give me a good cause to make a big short (long) trade, I'm ready with cash  Peace!!!I guess we got the answer now, it's 75 points.https://cointelegraph.com/news/bitcoin-price-hits-20-8k-as-volatility-ensues-over-fed-75-point-rate-hikeAnd obviously, it point a dent on the market price, hitting $20,100 right now and it seems that this might continue throughout the week and nosedive around high of $18k to lows to $19k.Hopefully though, those who see this as positive thing is going to buy at this current price or wait till it plunges again. So it is still a win-win for us regardless of what the Fed rate hike is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "November 03, 2022, 03:42:45 AM",
      "body": "Quote from: Jating on November 02, 2022, 09:49:50 PMQuote from: catchfallingknife on November 01, 2022, 04:31:46 AMWhat will Fed take tomorrow?We are confident that Fed will keep raising interest rates at this time, but by how much? What if it goes up by 50 points? What if it goes up by 75 points? Pump or Dump?Give me a good cause to make a big short (long) trade, I'm ready with cash  Peace!!!I guess we got the answer now, it's 75 points.https://cointelegraph.com/news/bitcoin-price-hits-20-8k-as-volatility-ensues-over-fed-75-point-rate-hikeAnd obviously, it point a dent on the market price, hitting $20,100 right now and it seems that this might continue throughout the week and nosedive around high of $18k to lows to $19k.Hopefully though, those who see this as positive thing is going to buy at this current price or wait till it plunges again. So it is still a win-win for us regardless of what the Fed rate hike is.This fed statement wasn’t about the 75bps hike. We all knew he would hike 75bps, it was listening to hints if they would slow down the hikes and pivot. Which wasn’t the case.Many had rumors that the fed was crashing the bond markets and would have to pivot. Since it happened in other G7 countries. So many were sure they would say they are hiking less next month, but it’s not the case and hence why stocks took a dump.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "November 03, 2022, 04:01:24 AM",
      "body": "That's 75 basis points and possibly dump, little ones though. If we take a look at the price of Bitcoin, the interest rate hike has possibly taken effect already. From around $20,700, Bitcoin's price has quickly fallen to just around $20,000 following the news. The same goes with US stocks. They've also closed down with negative figures. Despite the correction however it seems the hike didn't bring much effect to Bitcoin considering that it is still well within its stable range. It has been moving within this price range for many months already.This is just how I look at it. Don't bet on this with your cash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "November 03, 2022, 04:32:52 AM",
      "body": "Quote from: Fundamentals Of on November 03, 2022, 04:01:24 AMThat's 75 basis points and possibly dump, little ones though. If we take a look at the price of Bitcoin, the interest rate hike has possibly taken effect already. From around $20,700, Bitcoin's price has quickly fallen to just around $20,000 following the news. The same goes with US stocks. They've also closed down with negative figures. Despite the correction however it seems the hike didn't bring much effect to Bitcoin considering that it is still well within its stable range. It has been moving within this price range for many months already.This is just how I look at it. Don't bet on this with your cash.The fed rate hurts btc and all other coins.I bonds are still high like 6.89%i bonds were 7.12% nov 2021i bonds were 9.62% april 2022i bonds now at 6.89% nov 2022this means 18 months of really really good rates.actually 24 months minus a day.since if you buy some bonds today thats good for six months and you can get the same rate for six months if you buy on march 31.so basically a coordinated attack on btc and other coins is being effectively done and even if the fed backs off after 50+50 moves up to feb 2 the i bond numbers stay high until six months after march 31let me check exact i bond rates.note i corrected rates.so 7.12 and 9.62 and 6.89 are stellar why buy anything other than these bonds.btw 330 million usa citizens can buy 10000 each so 3.3 trillion available each year.actually there is a trick to get 15000 each so 4.95 trillion can be purchased every year.I submit that crypto is seeing a flight to these bonds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}