{
  "id": "topic_5446077",
  "title": "Patrol69",
  "author": "Patrol69",
  "created_time": "March 23, 2023, 04:57:32 PM",
  "content": "For every Muslim, the month of Ramadan is a month of great virtue. For a month, Muslims observe fasting by abstaining from all food and drink in order to gain the pleasure of Allah.  This month of Ramadan is celebrated in the ninth month of the year according to the Arabic month. The virtues of Ramadan will be attained only when a Muslim eats Sehri on time, offers five daily prayers, breaks Iftar on time, offers Taraweeh prayers and Tahajjud prayers along with it. May Allah grant us all the blessings of Ramadan. May the blessings of Ramadan be upon everyone.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446077",
  "comments": [
    {
      "author": "BADecker",
      "created_time": "March 23, 2023, 07:06:51 PM",
      "body": "An interesting movie series is the 'Jack Hunter' 3-movie, sci-fi series (https://www.imdb.com/title/tt1412094/). The main female star is Joanne Kelly who plays Nadia Ramadan in the movie. The whole set of movies is based around Middle East, Arabic cultures, even though they were made in the English language.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "March 23, 2023, 09:40:56 PM",
      "body": "As-salamu alaykum my brothers, please enjoy the month of Ramadam & be strong during your fasting. Allah will give you strength as you reaffirm your faith during the sacred month.May Allah be with us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Patrol69",
      "created_time": "March 23, 2023, 10:30:13 PM",
      "body": "Quote from: BADecker on March 23, 2023, 07:06:51 PMAn interesting movie series is the 'Jack Hunter' 3-movie, sci-fi series (https://www.imdb.com/title/tt1412094/). The main female star is Joanne Kelly who plays Nadia Ramadan in the movie. The whole set of movies is based around Middle East, Arabic cultures, even though they were made in the English language.I have not seen this beautiful movie related to Ramadan yet.  But since the movie is made entirely in Arabic culture and the theme of the movie is the theme of Ramadan, it can be said that the story of the movie is very beautiful. And I will definitely watch the movie.Quote from: DeathAngel on March 23, 2023, 09:40:56 PMAs-salamu alaykum my brothers, please enjoy the month of Ramadam & be strong during your fasting. Allah will give you strength as you reaffirm your faith during the sacred month.May Allah be with us.\"Walaikum Assalam\" Ramadan is undoubtedly a month of merit for every Muslim. May the blessings of this month shower upon you. And may Allah grant you Tawfiq to fully observe all the provisions of Ramadan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sexylizzy2813",
      "created_time": "March 24, 2023, 12:23:27 AM",
      "body": "Ramadan is really a blessful month indeed, I just pray for my Muslim brothers and sisters to enjoy the fasting and pray for the world to have less problems, no hate much love all over the world, pray for every month in every year to be of happiness and joy.Assalamualaikum brothers and sisters...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Popkon6",
      "created_time": "March 24, 2023, 05:11:31 AM",
      "body": "photo collectionRamadan is a paradise destination for Muslims. May the Creator give us all the grace to observe 30 fasts with the right, the virtue of fasting will be the greatest virtue for Muslims on the battlefield of tomorrow.  Fasting has been made obligatory by God on every Muslim. Islam has five pillars for Muslims, fasting is one of them.It is a very happy sign for the whole family to eat together during the month of Ramadan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NicNacCoin",
      "created_time": "March 24, 2023, 05:13:03 AM",
      "body": "OP Thank you for bringing us a beautiful topic about the month of Ramadan. Ramadan is a month of forgiveness for every person. Allah can forgive all the sins of life with the help of this month of Ramadan. May Allah grant all of us who are Muslims the grace to observe these 30 fasts. Allah Taala has described in the Qur'an Sharif that He Himself said that He will give the reward of this Ramadan with His own hands. So let us all reap the merits of these 30 days of fasting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Patrol69",
      "created_time": "March 24, 2023, 06:21:00 AM",
      "body": "Quote from: Popkon6 on March 24, 2023, 05:11:31 AM photo collectionRamadan is a paradise destination for Muslims. May the Creator give us all the grace to observe 30 fasts with the right, the virtue of fasting will be the greatest virtue for Muslims on the battlefield of tomorrow.  Fasting has been made obligatory by God on every Muslim. Islam has five pillars for Muslims, fasting is one of them.It is a very happy sign for the whole family to eat together during the month of Ramadan.Ramadan is a month of virtue and blessings. This month is a month of special blessings for every Muslim from Almighty Allah. The worshipers wait for a year only for this month of Ramadan. Allah Almighty has mentioned in the Qur'an Sharif that in the month of Ramadan He stops the punishment of all the graves and keeps Satan captive in this month. May Allah bless you to fast 30 days of RamadanQuote from: NicNacCoin on March 24, 2023, 05:13:03 AMOP Thank you for bringing us a beautiful topic about the month of Ramadan. Ramadan is a month of forgiveness for every person. Allah can forgive all the sins of life with the help of this month of Ramadan. May Allah grant all of us who are Muslims the grace to observe these 30 fasts. Allah Taala has described in the Qur'an Sharif that He Himself said that He will give the reward of this Ramadan with His own hands. So let us all reap the merits of these 30 days of fasting.You are welcome, and you are right that Almighty Allah will reward fasting. May we observe the 30 fasts of the month of Ramadan according to the complete rules of Islam and may the blessings of the month of Ramadan be upon everyone.Quote from: Sexylizzy2813 on March 24, 2023, 12:23:27 AMRamadan is really a blessful month indeed, I just pray for my Muslim brothers and sisters to enjoy the fasting and pray for the world to have less problems, no hate much love all over the world, pray for every month in every year to be of happiness and joy.Assalamualaikum brothers and sisters...Ramadan is a great blessing for every Muslim. Wishing everyone good health and praying that everyone can reap the full benefits of the month of Ramadan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.corol",
      "created_time": "March 24, 2023, 06:37:21 AM",
      "body": "Happy Ramadan everyone. Today I am going to observe the first fast of the month of Ramadan after a year of waiting. Today is a special day of Jumma and the first fast, the hadith states that Friday is the day of Hajj for the poor. May Allah bless us all to observe 30 fasts. And grant him the grace to pray five times a day. Many of us only fast and do not pray. Many of us spend our days watching television on our phones. This month of Ramadan is the month of forgiveness. Maybe this month of Ramadan can be the last Ramadan of my life. So we will all fast, pray and recite the Qur'an.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_people",
      "created_time": "March 24, 2023, 09:27:15 AM",
      "body": "Assalamu Alaikum, Ramadan is a holy month for Muslims. Fasting is done by abstaining from food and drink for the whole day in the hope of gaining the satisfaction of the Creator. And at the end of the day, iftar is eaten together with the family and everyone, it seems like a heavenly peace is found. So if we all Muslims fast in this month of Ramadan and keep busy in the worship of Allah Ta'ala then we will have peace in this world and in the hereafter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LDL",
      "created_time": "March 24, 2023, 03:06:24 PM",
      "body": "Photo source: https://images.app.goo.gl/B2SopfM2xB8EZisz6The month of Ramadan is a blessed month for the Muslim world, the month of forgiveness. The impurity of the servant's heart is removed through Ramadan. But this month we should not be busy with ourselves, we should inquire how those around us are spending their day. Those of us who are wealthy and able should extend a helping hand to those around us who are starving. There are many poor and helpless people around us who should be provided with Iftar. Dressing should be arranged for them.  We ourselves should spend a little less on ourselves this month and dedicate ourselves to their welfare. We must remember that our own welfare lies within the welfare of all. Therefore, in this month of Ramadan, we will take an oath that those who have the means to provide for the hungry people around them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "March 24, 2023, 03:50:24 PM",
      "body": "Quote from: DeathAngel on March 23, 2023, 09:40:56 PMAs-salamu alaykum my brothers, please enjoy the month of Ramadan & be strong during your fasting. Allah will give you strength as you reaffirm your faith during the sacred month.May Allah be with us.It's a wonderful thing to see people abstain from food and other pleasure because they want to please God and get favor from Him. Islam is a religion I have so much respect for because it promotes love, peace, and liberality. I wish the muslin faithful a fruitful Ramadan and let Allah grant you all your heart desires.I also want you to use this holy month to pray for global peace and don't forget to remember people suffering in war-torn nations like Ukraine and Palestine. Please remember people that are facing religious persecution in India and China. Also, don't forget to pray for nations going through political crises like Ethiopia and Nigeria.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "March 24, 2023, 04:57:22 PM",
      "body": "This is the best month of the year for all Muslims around the world. Reiterating on the importance of Ramadan in the forum is a great reminder to all Muslims here and a way of expressing the importance that comes with the month. It is a month of forgiveness, worship, given charity etc and most of all abstaining from eating. I pray this month serve as a reminder for all Muslims to remain steadfast in the worship to their creator and do the right things that is expected of them as a true Muslim. Happy Ramadan!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Compromise me",
      "created_time": "March 24, 2023, 05:24:34 PMLast edit: April 17, 2023, 09:21:46 AM by Compromise me",
      "body": "Happy Ramadan ! May this holy month bring you and your loved ones peace happiness, and spiritual growth. It is a beautiful time of the year to reflect practice self-discipline, and connect with Allah through prayer and recitation of the Qur'an. I pray that Allah grants you the strength to fulfill your religious obligtions and to make the most of this blessed month. May you receive Allah's blessings and forgiveness, and may your good deeds during Ramadan be rewarded in the hereafter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bahadurmunir",
      "created_time": "March 24, 2023, 05:42:13 PM",
      "body": "Ramadan Mubarak to everyone! Allah Almighty bestows us with the blessings of this month and helps us in our spiritual progress and worship. The spirit of this month gives us the opportunity to become better human beings in our lives. On this occasion, we should focus on the purpose of our lives and take advantage of this worship. I pray that Allah Almighty blesses us with the blessings of this month and keeps us and our loved ones happy and content.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hannahB4",
      "created_time": "March 24, 2023, 06:29:04 PM",
      "body": "Ramadan Kareem to all the Muslim forum members and I love the presentation of your fruit. May Allah accept all our petitions and answer speedily to our request",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sexylizzy2813",
      "created_time": "March 25, 2023, 05:42:19 AM",
      "body": "Quote from: Patrol69 on March 24, 2023, 06:21:00 AMRamadan is a great blessing for every Muslim. Wishing everyone good health and praying that everyone can reap the full benefits of the month of Ramadan.Yes indeed, is such a privilege to withness yet another Ramadan this year, we also pray for long life and prosperity in advance, our struggles shall never go in vain and may we see our children children...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Litzki1990",
      "created_time": "March 25, 2023, 08:44:31 AM",
      "body": "Greetings to all Muslim brothers on the holy month of Ramadan. May Ramadan bring peace in everyone's life. In this month of Ramadan, Muslims fast to seek the pleasure of Allah and there are some other Islamic rules that Muslims follow very seriously. Fasting is obligatory for every adult. In this month of Ramadan, Allah Ta'ala increases the amount of reward. If you give charity in the month of Ramadan, you will get 70 times more reward than what you get in other months.Quote from: Die_empty on March 24, 2023, 03:50:24 PMIt's a wonderful thing to see people abstain from food and other pleasure because they want to please God and get favor from Him. Islam is a religion I have so much respect for because it promotes love, peace, and liberality. I wish the muslin faithful a fruitful Ramadan and let Allah grant you all your heart desires.Yes you are right Muslims fast for a certain period of time by abstaining from all food only to gain the pleasure of the Lord.  And for every Muslim, the month of Ramadan is a month of great virtue and forgiveness of sins.Quote from: Die_empty on March 24, 2023, 03:50:24 PMI also want you to use this holy month to pray for global peace and don't forget to remember people suffering in war-torn nations like Ukraine and Palestine. Please remember people that are facing religious persecution in India and China. Also, don't forget to pray for nations going through political crises like Ethiopia and Nigeria. A lot of prayers are needed for those countries that are being persecuted in various ways. China India has been torturing Muslims in various ways may Allah guide them. And let them refrain from the inhuman torture that Ukraine has inflicted on the Palestinians.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "March 26, 2023, 02:08:49 AM",
      "body": "I am from a country where Islam and Muslims are a relatively small percentage of the population, so I have never experienced Ramadan in my life, but I admit and since I learnt how to speak English and started to interact with people from other cultures I have grown more curious on the festivities of the Muslin people and also the Jewish people.I hope someday I can have a muslin friend in the real life and helps me to understand and celebrate his yearly traditions through the guidance of theirs and their family. I assume fasting must be difficult.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "March 26, 2023, 03:41:53 PM",
      "body": "Quote from: Hispo on March 26, 2023, 02:08:49 AMI am from a country where Islam and Muslims are a relatively small percentage of the population, so I have never experienced Ramadan in my life, but I admit and since I learnt how to speak English and started to interact with people from other cultures I have grown more curious on the festivities of the Muslin people and also the Jewish people.I hope someday I can have a muslin friend in the real life and helps me to understand and celebrate his yearly traditions through the guidance of theirs and their family. I assume fasting must be difficult.The religious rituals are nothing, except that they produce real thinking and understanding of God in people.What understanding should the rituals be producing? That God is One God - One Allah if you speak Arabic. And more importantly, that the One God is made up of three parts that have equal importance, equal togetherness, and 'Full-God' authority in the One God.These three are known as:1. The Father, who we generally attribute creation to;2. Jesus, the Savior of mankind;3. The Holy Spirit, Who exists throughout this universe.These three all have complete God-ness separately and together, complete individuality, complete oneness... and we don't understand how this can be. It is beyond our simple comprehension.However, if we don't accept it, we are not really worshiping God. Rather, we are worshiping an idol that our hearts and minds have made up.The above is most important. Living a good life is second. And ritual, if it doesn't take away from the first two, might only be third.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}