{
  "id": "topic_5470698",
  "title": "krishnaverma",
  "author": "krishnaverma",
  "created_time": "October 17, 2023, 03:12:48 PM",
  "content": "Most of the grown up people do not live with parents. At such, the parents are not aware about the interests and habits of individuals. Do you parents know that you gamble ? What was their first reaction towards your gambling habit ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470698",
  "comments": [
    {
      "author": "Odohu",
      "created_time": "October 17, 2023, 05:23:01 PM",
      "body": "Quote from: krishnaverma on October 17, 2023, 03:12:48 PMMost of the grown up people do not live with parents. At such, the parents are not aware about the interests and habits of individuals. Do you parents know that you gamble ? What was their first reaction towards your gambling habit ? Gambling is not supposed to be for kinds. Many casinos and gambling companies do not allow children to register or use their services. Consequently, anyone up to the age of gambling is supposed to be able to make his decisions with little to no interference from parents or anyone. If it is just my parents knowing that I am into gambling, they do and not that they really have any way to interfere as I'm independent and can take my decisions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mvdheuvel1983",
      "created_time": "October 17, 2023, 05:26:19 PM",
      "body": "Quote from: krishnaverma on October 17, 2023, 03:12:48 PMMost of the grown up people do not live with parents. At such, the parents are not aware about the interests and habits of individuals. Do you parents know that you gamble ? What was their first reaction towards your gambling habit ? I am a grown assed human. My parents doesn't have to know my activities. Besides I moved out many years ago.What I think I owe them now is respect by not bringing shame to their name through irresponsible gambling, like going into debts, getting fired from place of work because of my gambling habits, and other negative ills associated with gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "October 17, 2023, 05:40:58 PM",
      "body": "As you mean and personally I say that adult men have the right to privacy to do anything as long as they can control it, after all, not many parents want to know about the activities of their adult children unless they are still underage, of course they are still under parental control, where They must know what activities they usually do, so parents are obliged to guide them properly.Adult men don't live with their parents, how can they know you are gambling when you don't live together, even if you live together, is it possible to gamble in front of your parents, I don't think there will be many people who do that, although there are, it could be that he is already an addict so it's difficult to be controlled so that he plays gambling in front of his parents without caring about their suggestions and advice. but personally, until now my parents have never known that I gamble because they don't need to know that and so far my gambling is still under control so there won't be any problems.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "October 17, 2023, 05:55:36 PM",
      "body": "Your mom knows what you are doing the moment it shows signs.my mom already knew I was gambling with the bystanders in the corner as it was a known place where they could set up a poker table for the night. So yes they knew about it. They disapproved of it and they kept asking when I would go back to college.  Fathers are just fine, he just smiles and it feels like I can do what I want. It's not like when you are just a kid which if you do something stupid, they can demand you to do this and that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "October 17, 2023, 05:55:56 PM",
      "body": "Nope, even if I am already on a legal age; I still do not let them know about this activity of mine. One reason is stereotype that I’d end up addicted into it but in reality it just depends on the type of gambler you are. Second is because I am using my own money which makes me authorized to where would I be using it. In short it would be much better not to in order to avoid making things more complicated. Of course if I were them I wouldn’t also allow my future child to gamble ‘coz I know the risk. He/she might probably gamble once in his life but I will never support it. Since I am doing something against their will then I guess there’s really no need to involve other or more people towards this activity. Fewer the better as I would like it to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "October 17, 2023, 05:56:42 PM",
      "body": "I don't think my parents know about my gambling habits but if really they do, I don't think they will react badly or question me about it since am above 18, I feed and care for myself, and they haven't heard or seen me selling my properties over gambling bets. So if they are to know or not, it won't make any difference to my stand on gambling habits",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iv4n",
      "created_time": "October 17, 2023, 05:58:06 PM",
      "body": "Quote from: krishnaverma on October 17, 2023, 03:12:48 PMMost of the grown up people do not live with parents. At such, the parents are not aware about the interests and habits of individuals. Do you parents know that you gamble ? What was their first reaction towards your gambling habit ? Yes, they know about my gambling habits... they know about many other shit as well, from some things we can't run away. But I am still close with my parents, they understand what it means to be \"young and foolish\", I can only hope I will have the same understanding for my own kids when the time comes.In the end, you don't have anyone closer than your parents... it's something we figure out along the way, sooner or later... all others will abandon you, but parents will hold you, it's something you understand when shit starts falling on you! Of course, this works if \"parents\" are normal people, some parents are disasters and don't deserve kids in the first place. I am in the first group, I did a lot of shit in my life, and my parents were the ones who stayed with me along the way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sanugarid",
      "created_time": "October 17, 2023, 06:40:38 PM",
      "body": "I don't think so, I don't need to tell my parents that I'm going to gamble because I'm of legal age and for me it's just a pastime. And I also think that even though my parents know about gambling, it's okay with them because they know me very well and my parents have a lot of trust in me that's why I love them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "October 17, 2023, 07:04:17 PM",
      "body": "Quote from: krishnaverma on October 17, 2023, 03:12:48 PMMost of the grown up people do not live with parents. At such, the parents are not aware about the interests and habits of individuals. Do you parents know that you gamble ? What was their first reaction towards your gambling habit ? Let me tell you reality, if you are grown up already and you even feed your parent, if they know that you are gambling, they will not be bothered because they know that you are a man and a successful person. But if you are gambling and gambling turn you to something else, they will blame you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Juse14",
      "created_time": "October 17, 2023, 07:05:41 PM",
      "body": "Quote from: krishnaverma on October 17, 2023, 03:12:48 PMMost of the grown up people do not live with parents. At such, the parents are not aware about the interests and habits of individuals. Do you parents know that you gamble ? What was their first reaction towards your gambling habit ? My parents don't really agree with the gambling activities that I do so I try to keep these activities a secret. I keep this a secret so that I can maintain harmony with my family and I think as long as I can control myself over the gambling activities that I do then I think this will be fine.And I think I am also mature enough to enter the world of gambling because now I am 22 years old, so I don't need to tell my parents about the gambling activities I do and I will always be responsible for everything I do, including gamble.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LDL",
      "created_time": "October 17, 2023, 07:13:25 PM",
      "body": "Quote from: krishnaverma on October 17, 2023, 03:12:48 PMMost of the grown up people do not live with parents. At such, the parents are not aware about the interests and habits of individuals. Do you parents know that you gamble ? What was their first reaction towards your gambling habit ? My parents don't live with me, I live separately but I was not addicted to gambling when I lived with them. But after two years of marriage I included myself a little in gambling but my father didn't know it. But if my parents had known, they would not have allowed me to join gambling because they value religion and religion. Gambling is considered a sinful act according to my religion but if my parents had known about this, they would have never allowed me to join such a dirty profession. But even though my parents did not know that I was involved in gambling, my wife knew about it. He sometimes quarrels with me about joining this dirty profession. The matter is bad but I have never indulged myself in gambling so much that I can stop myself from gambling completely at any time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "October 17, 2023, 08:13:59 PM",
      "body": "Quote from: krishnaverma on October 17, 2023, 03:12:48 PMMost of the grown up people do not live with parents. At such, the parents are not aware about the interests and habits of individuals. Do you parents know that you gamble ? What was their first reaction towards your gambling habit ? You called them grown; means they are adults. Parents may not react so much to gambling as they would have if you were still underage and depending on them financially. I have seen many parents not react so much but just give advice to their kids who are grown when they discover them to have some habits because they realize that they are adults. Some parents will even consider their grown kids having gambling as a habit than some other habits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "October 17, 2023, 08:27:57 PM",
      "body": "Quote from: krishnaverma on October 17, 2023, 03:12:48 PMMost of the grown up people do not live with parents. At such, the parents are not aware about the interests and habits of individuals. Do you parents know that you gamble ? What was their first reaction towards your gambling habit ? in my culture (here in Italy) it is pretty normal to gamble during the Christmas period in family, with all a series of card games. It's also pretty fun  and all people are involved (younger older etc etc...)Obviously we gamble ridiculous amounts (the classic pennies) on these occasions....They have always known that I like gambling.Meanwhile I remember that they never said anything about this fact... because there has never been a culture (I'm talking about many years ago) in which there was a risk of developing a gambling addiction, it was not considered a risk.now there is an almost sensational abundance of offers in this sector... every day there are dozens of games to bet on, it is clear that the gambling sector is completely transformed",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odusko",
      "created_time": "October 17, 2023, 08:29:06 PM",
      "body": "Quote from: Queentoshi on October 17, 2023, 08:13:59 PMQuote from: krishnaverma on October 17, 2023, 03:12:48 PMMost of the grown up people do not live with parents. At such, the parents are not aware about the interests and habits of individuals. Do you parents know that you gamble ? What was their first reaction towards your gambling habit ? You called them grown; means they are adults. Parents may not react so much to gambling as they would have if you were still underage and depending on them financially. I have seen many parents not react so much but just give advice to their kids who are grown when they discover them to have some habits because they realize that they are adults. Some parents will even consider their grown kids having gambling as a habit than some other habits.Finance is the most important thing in the family and once you attend your financial freedom you become free to do whatever suit and make you happy and without your parent interference, so most of the time, our parent may be too old to even understand what gambling is all about, lime me I have an aged mother who doesn't know anything about gambling and would only be interested in things I choose to talk to her about.My spouse on the other hand is very okay with my gambling activities, since i can balance between my gambling life and family perfectly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rockstarguy",
      "created_time": "October 17, 2023, 08:34:20 PM",
      "body": "Quote from: krishnaverma on October 17, 2023, 03:12:48 PMMost of the grown up people do not live with parents. At such, the parents are not aware about the interests and habits of individuals. Do you parents know that you gamble ? What was their first reaction towards your gambling habit ? People always tend to keep gambling a secret because they feel of people should know about their is an impression that people will feel towards them. Even if parents are aware about their adult children gambling lifestyle, they may not be too worried because they are old enough to afford money for gambling and are in the age of making choice on the kind of life they need for themselves. Some people who know their parents to be strict will prefer to let their gambling life to be secret to avoid much  talks from their parents.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "October 17, 2023, 08:38:15 PM",
      "body": "I don't think even if my parents knew about my gambling habits, they would bother. One has to get to a certain age to understand that parents actually want you to live your life based on the principle and morals they have inculcated in you at a very early age.Where it becomes a problem and they start blowing their fuses about ones gambling habit should probably be when one lives with their parents or in close proximity. Else, if one lives alone, is married or have a good job even if it is a well paying hustle to support the gambling habit and makes parents happy by sending them some funds for upkeep along with occasionally check-up, why would they care or bother? Its not important whether they know or not, what's important is if ones immediate family or responsibility is suffering because of such a habit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "October 17, 2023, 08:39:46 PM",
      "body": "they know that I gamble and they weren't surprised when they found out, I mean I learned a lot of gambling games because of them and our relatives. what they don't know how is much or how often I gamble, I mean there is really no reason for me to tell them how much and how often I gamble. anyway, while they weren't surprised when they found out that I gamble, they had something to say to me, what they said was, that I should always remember my priorities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "macson",
      "created_time": "October 17, 2023, 08:41:34 PM",
      "body": "Quote from: krishnaverma on October 17, 2023, 03:12:48 PMMost of the grown up people do not live with parents. At such, the parents are not aware about the interests and habits of individuals. Do you parents know that you gamble ? What was their first reaction towards your gambling habit ? i haven't lived with my parents for a long time so i don't need to worry about them finding out that I often gamble, my parents once told me, whatever i do outside the house, i have to do it with full responsibility and readiness, after all my parents still have an old-fashioned mindset, i don't want to burden them with strange thoughts, they still think that gambling players are the trash of society (they are quite religious people in their old age and are very against their children gambling)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "topbitcoin",
      "created_time": "October 17, 2023, 08:43:44 PM",
      "body": "Quote from: krishnaverma on October 17, 2023, 03:12:48 PMMost of the grown up people do not live with parents. At such, the parents are not aware about the interests and habits of individuals. Do you parents know that you gamble ? What was their first reaction towards your gambling habit ? Even though I am old enough and able to take full responsibility for everything I do, to prevent things that I don't want from happening, I always tell my parents about everything I do, but when it comes to gambling, I only talk about this. to a father, because he is the one who understands this best. And when I told him about the gambling activities that I did, he didn't show an expression of panic or anger because maybe he also thought that a man could never get away from gambling and my father just advised me to be careful when gambling because it involves money and \"The risks are very high,\" he understood very well because perhaps he had also been at the same point.As for talking about this to a mother, I don't think I'm brave enough to do that...hihihi",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}