{
  "id": "topic_5428980",
  "title": "simata.pro",
  "author": "simata.pro",
  "created_time": "December 15, 2022, 04:24:17 PM",
  "content": "Наша команда создала аналитический платформу моделирования цен на финансовых рынках - SimataPro. Ядро платформы - это кластерно-облачный комплекс программных решений: кластерный анализ ценовых котировок и исторических данных; система машинного обучения анализа подтвержденных моделей и закономерностей; визуализация данных технического анализа с дальнейшим моделированием трендовых направлений цены.   Платформа SimataPro обеспечивает максимальную автоматизацию по предоставлению трейдинговых данных. Поставщиком ценовых котировок и исторических данных выступают биржевые площадки как центры формирования цен и объемов.   В настоящее время мы заканчиваем реализацию первого этапа разработки нашей платформы - продукт по моделированию цен на рынке криптовалют. Для того что бы пользователи смогли оценить эффективность нашего продукта мы запускаем публикацию моделей  в нашем Twitter @SimataPro.  На этом графике Вы можете увидеть направление тренда, направление BUY и SELL, силу тренда, модель для тейк-профит в виде прямоугольной TP зоны и расчетных абсолютных значений, модель для стоп-лосс в виде прямоугольной SL зоны и расчетных абсолютных значений.   Готовы выслушать все ваши комментарии, пожелания и замечания.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5428980",
  "comments": [
    {
      "author": "simata.pro",
      "created_time": "December 15, 2022, 06:08:16 PM",
      "body": "Добрый день. Спасибо за интерес к нашему проекту. Мы не класические сигналы, предоставляемые в телеграмм группах. Наши сигналы основаны на машинном обучении с бэктестингом. Именно поэтому у нас есть вся статистика по отработанным из них. Сейчас у нас активная стадия улучшения продукта, и мы проводим его альфа-тестирование. Мы не можем раскрыть всю информацию, пока не выйдем в релиз, но точность наших прогнозов, измеряется не количеством отработанных прогнозов, а прибылью и убытком, который тот или иной прогноз приносит. Это позволяет добиться отслеживания реальной пользы сигналов и не их гипотетической ценности.   Для примера за последний месяц PNL по CHZUSDT показала по всем сделкам 138.671% прибыли, и 92.486% убытка.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "simata.pro",
      "created_time": "December 15, 2022, 07:31:08 PM",
      "body": "Quote from: Ratimov on December 15, 2022, 06:45:22 PMQuote from: simata.pro on December 15, 2022, 06:08:16 PMДля примера за последний месяц PNL по CHZUSDT показала по всем сделкам 138.671% прибыли, и 92.486% убытка.То есть, грубо говоря распределение убыточных и прибыльных сделок, в среднем, 4 к 6, что пока что слабовато. Это чуть лучше, чем почти равный исход события. Я не знаю, какая срочность была у вашей торговой стратегии, но если мы рассматриваем краткосрочный трейдинг, скальпинг, то 4к6, это, считай, не рабочая стратегия. Сужу только по собственному опыту. Когда я занимался скальпингом, то торговать в общем в плюс удавалось при распределении убыточных и профитных сделок не меньше чем 1 к 9, это на скальпинге. 4 к 6 на дистанции точно погрузит депозит в минуса.Quote from: simata.pro on December 15, 2022, 06:08:16 PM...но точность наших прогнозов, измеряется не количеством отработанных прогнозов, а прибылью и убытком, который тот или иной прогноз приносит. Это позволяет добиться отслеживания реальной пользы сигналов и не их гипотетической ценности. ...Те цифры которые мы указали, являются абсолютными цифрами прибыли и убытка, а не соотношение прибыльных сделок к убыточным.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "simata.pro",
      "created_time": "May 09, 2023, 12:54:34 PM",
      "body": "2022 год был годом роста и развития для SimataPro. Одним из наших наиболее значительных достижений в 2022 году стало развитие и улучшение наших собственных алгоритмов для моделирования цен на финансовых рынках. Используя машинное обучение и передовые методы анализа данных, SimataPro смогла предоставить более точные прогнозы для различных криптовалют. Это позволит нашим пользователям в будущем принимать более осознанные решения в отношении своих инвестиций.   Вот основные показатели работы SimataPro за 2022 год (timeframe:day):      В будущем мы планируем продолжать развиваться и улучшаться, чтобы оставаться лидером в этой быстро меняющейся индустрии. Следите за нашими новостями и обновлениями, и присоединяйтесь к революции в анализе криптовалют вместе с SimataPro!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "simata.pro",
      "created_time": "September 05, 2023, 09:20:43 AM",
      "body": "Всем доброго времени суток,С радостью сообщаем о запуске платформы SimataPro, вашего нового надежного помощника. С этого момента мы открыты для Вас, предлагая следующие привилегии:1. Доступ к платформе по специальным ценам на период подписки.2. Возможность бесплатного тестирования наших услуг в течение 14 дней.Дополнительно мы рады предложить эксклюзивное предложение для пользователей форума: подписавшись на наш аккаунт в Twitter и оставив своё имя пользователя в комментариях, Вы получите купон, предоставляющий скидку 99% на первый месяц подписки.С уважением,Команда Simata",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "internetional",
      "created_time": "September 06, 2023, 07:48:56 AM",
      "body": "Зашёл посмотрел.Мне показалось, что регистрация на сайте организована непонятно. Я не нашёл кнопки Sign Up. Нашёл только кнопки Login и Sign In (по-моему, эти два слова означают одно и то же). Внизу ещё есть кнопка Subscribe, но она не про то. В итоге я нажал Sign In, и получилось зарегистрироваться с учётной записью Гугла. В общем, я целых две минуты разбирался с тем, куда нажимать, чтобы потом за две секунды зарегистрироваться.Цены тоже непонятны. Quote from: simata.pro on September 05, 2023, 09:20:43 AMДополнительно мы рады предложить эксклюзивное предложение для пользователей форума: подписавшись на наш аккаунт в Twitter и оставив своё имя пользователя в комментариях, Вы получите купон, предоставляющий скидку 99% на первый месяц подписки.Это скидка от какой цены?- от 499 евро за премиум-подписку,- от 199 евро за обычную подписку,- или от 19 евро, за которые вы предлагаете подписку сейчас?Кстати, как долго планируется продолжать эту акцию с подпиской за 19 евро в месяц?А ещё смущает вот эта фраза:Quote from: simata.pro on September 05, 2023, 09:20:43 AMмы открыты для Вас, предлагая следующие привилегии:1. Доступ к платформе по специальным ценам на период подписки.Сформулировано так, как будто, имея подписку, нужно ещё дополнительно платить за доступ к платформе. Вы что имели в виду? Какие специальные цены на период подписки? Сами сервисы я не увидел. Чтобы получить к ним доступ, нужно сначала купить подписку, введя данные банковской карты. А как же бесплатное тестирование в течение 14 дней?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "simata.pro",
      "created_time": "September 06, 2023, 05:42:13 PMLast edit: September 06, 2023, 06:00:11 PM by simata.pro",
      "body": "Доброе время суток,Огромное спасибо за Ваш конструктивный разбор и заинтересованность нашим продуктом!Quote from: internetional on September 06, 2023, 07:48:56 AMМне показалось, что регистрация на сайте организована непонятно. Я не нашёл кнопки Sign Up. Нашёл только кнопки Login и Sign In (по-моему, эти два слова означают одно и то же). Внизу ещё есть кнопка Subscribe, но она не про то. В итоге я нажал Sign In, и получилось зарегистрироваться с учётной записью Гугла. В общем, я целых две минуты разбирался с тем, куда нажимать, чтобы потом за две секунды зарегистрироваться.Тут Вы совершенно правы. Это требует корректировки.Quote from: internetional on September 06, 2023, 07:48:56 AMЭто скидка от какой цены?- от 499 евро за премиум-подписку,- от 199 евро за обычную подписку,- или от 19 евро, за которые вы предлагаете подписку сейчас?Это дополнительная скидка к акционной цене подписки 19 евро. Эта дополнительная скидка на первый месяц, все остальные месяцы по акционной цене подписки 19 евро.Quote from: internetional on September 06, 2023, 07:48:56 AMКстати, как долго планируется продолжать эту акцию с подпиской за 19 евро в месяц?Пока в планах минимум один месяцQuote from: internetional on September 06, 2023, 07:48:56 AMСформулировано так, как будто, имея подписку, нужно ещё дополнительно платить за доступ к платформе. Вы что имели в виду? Какие специальные цены на период подписки?Тут имеется ввиду акционная цена 19 евроQuote from: internetional on September 06, 2023, 07:48:56 AMСами сервисы я не увидел. Чтобы получить к ним доступ, нужно сначала купить подписку, введя данные банковской карты. А как же бесплатное тестирование в течение 14 дней? Запрос карточки необходим что-бы исключить злоупотребления с бесплатным пробным периодом и регистрации одним человеком разных электронных адресов. На время действия пробного периода списаний с карточного счета не производится. Оплата подписки происходит после окончания пробного периода. До окончания пробного периода всегда можно отменить подписку.Наша команда хочет пренести максимальную пользу криптосообществу и готова выслушать все конструктивные замечания для улучшения нашего продукта.Специально для Вас мы высылаем в ЛС код на скидку 99%.  С уважением,Команда Simata",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "internetional",
      "created_time": "September 07, 2023, 10:02:30 AM",
      "body": "Спасибо, получил код на скидку. Разбираюсь дальше.Первое, с чем я сразу столкнулся, - это то, что непонятно, куда этот код вводить. В поле Referral Code? Я ввёл туда, потому что другого места нет. Или этот код нужно применить потом, когда пробный период истечёт, и тогда поле для ввода кода на скидку появится где-то?Российская карта ожидаемо не сработала.Заблокированная грузинская карта тоже не сработала. Это насторожило. Закралось подозрение, что деньги всё-таки списываются. Тем более, что в личном кабинете нигде нет ни намёка на то, что деньги в течение 14 дней списаны не будут. Наоборот, всё выглядит так, как будто я плачу прямо сейчас. Даже на кнопке, которую нужно нажать, написано “Pay”.Пробую грузинскую карту, которая активна, но на ней нет денег. Эта карта принимается без проблем. Вижу уведомление “Payment successful”.После этого стали доступны торговые рекомендации.Рекомендации есть по 17 парам. Всё это пары криптовалюта/стейблкоин. Немного не то, что я искал, но в принципе сгодится.Мне сейчас интересна торговля в парах альткоин/биткоин. Там общее направление понятно: глобальный тренд почти на всех парах нисходящий. Нужно только выбрать конкретные активы, найти правильный момент для входа, а потом для выхода. Получается, что нужно дождаться момента, когда сервис будет давать по биткоину бычий сигнал, а по альткоину - медвежий. Что ж, подожду.Сейчас Симата настроена по медвежьи в отношении всех активов. По семнадцати криптовалютам (в том числе по биткоину) дана рекомендация на продажу. Я обратил внимание, что стоп-лосс во всех рекомендациях стоит в 3,5 раза дальше, чем тейк-профит. Это запрограммированное соотношение, или случайно так совпало?А ещё у всех рекомендаций разный Ratio rating. Я не нашёл объяснения, что это такое. Кажется, что рекомендацию с более высоким Ratio rating предлагается использовать в первую очередь. Так?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "simata.pro",
      "created_time": "September 08, 2023, 06:07:02 AM",
      "body": "Наша команда благодарна Вам за заинтересованность в нашем продукте!Quote from: internetional on September 07, 2023, 10:02:30 AMПервое, с чем я сразу столкнулся, - это то, что непонятно, куда этот код вводить. В поле Referral Code? Я ввёл туда, потому что другого места нет. Или этот код нужно применить потом, когда пробный период истечёт, и тогда поле для ввода кода на скидку появится где-то?Да, поле «Referral Code» именно для этого и предназначено. Для исключения злоупотреблений, код вводится сразу при оформлении подписки, Вам начисляется скидка и он больше не активный. Quote from: internetional on September 07, 2023, 10:02:30 AMРоссийская карта ожидаемо не сработала.Заблокированная грузинская карта тоже не сработала. Это насторожило. Закралось подозрение, что деньги всё-таки списываются. Тем более, что в личном кабинете нигде нет ни намёка на то, что деньги в течение 14 дней списаны не будут. Наоборот, всё выглядит так, как будто я плачу прямо сейчас. Даже на кнопке, которую нужно нажать, написано “Pay”.Пробую грузинскую карту, которая активна, но на ней нет денег. Эта карта принимается без проблем. Вижу уведомление “Payment successful”.Спасибо большое что провели такой расширенный тест с картами. За работу с картами отвечает сервис Stripe. Для проверки корректности ввода данных проводится транзакция авторизации на 0 евро. Более подробно это описано у нас на сайте в разделе «Terms of Service»Quote from: internetional on September 07, 2023, 10:02:30 AMРекомендации есть по 17 парам. Всё это пары криптовалюта/стейблкоин. Немного не то, что я искал, но в принципе сгодится.Мне сейчас интересна торговля в парах альткоин/биткоин. Там общее направление понятно: глобальный тренд почти на всех парах нисходящий. Нужно только выбрать конкретные активы, найти правильный момент для входа, а потом для выхода. Получается, что нужно дождаться момента, когда сервис будет давать по биткоину бычий сигнал, а по альткоину - медвежий. Что ж, подожду.У всех своя стратегия торговли. При принятии решении ни когда не стоит полагаться на один источник. Информация с нашей платформы это один из многих фактров который влияет на принятия Вами решения.Quote from: internetional on September 07, 2023, 10:02:30 AMСейчас Симата настроена по медвежьи в отношении всех активов. По семнадцати криптовалютам (в том числе по биткоину) дана рекомендация на продажу. Я обратил внимание, что стоп-лосс во всех рекомендациях стоит в 3,5 раза дальше, чем тейк-профит. Это запрограммированное соотношение, или случайно так совпало?Тут немного не понятно о чем речь. Не могли бы Вы более расширенно описать.Quote from: internetional on September 07, 2023, 10:02:30 AMА ещё у всех рекомендаций разный Ratio rating. Я не нашёл объяснения, что это такое. Кажется, что рекомендацию с более высоким Ratio rating предлагается использовать в первую очередь. Так?Это рейтинг рисков. При наведении на название колонки должна появляться информация с объяснением. 0 - высокие риски, 9 - самые низкие",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "internetional",
      "created_time": "September 08, 2023, 07:51:20 AM",
      "body": "Quote from: simata.pro on September 08, 2023, 06:07:02 AMQuote from: internetional on September 07, 2023, 10:02:30 AMА ещё у всех рекомендаций разный Ratio rating. Я не нашёл объяснения, что это такое. Кажется, что рекомендацию с более высоким Ratio rating предлагается использовать в первую очередь. Так?Это рейтинг рисков. При наведении на название колонки должна появляться информация с объяснением. 0 - высокие риски, 9 - самые низкиеА, понятно. У меня iPad. На нём onmouseover не сделать. Поэтому я эту всплывающую информацию увидеть не могу.Quote from: simata.pro on September 08, 2023, 06:07:02 AMQuote from: internetional on September 07, 2023, 10:02:30 AMСейчас Симата настроена по медвежьи в отношении всех активов. По семнадцати криптовалютам (в том числе по биткоину) дана рекомендация на продажу. Я обратил внимание, что стоп-лосс во всех рекомендациях стоит в 3,5 раза дальше, чем тейк-профит. Это запрограммированное соотношение, или случайно так совпало?Тут немного не понятно о чем речь. Не могли бы Вы более расширенно описать.Ну вот три примера.По первой монете срабатывание тейк-профита даст прибыль 5,61% (без учёта плеча), а срабатывание стоп-лосса - убыток 19,77%.По второй монете - 3,41% и 11,71% соответственно.По третьей - 5,18% и 15,74%.Во всех трёх примерах убыток в случае неудачи будет примерно в три с половиной раза больше, чем прибыль в случае удачи. И в остальных рекомендациях - то же самое. Интересно узнать: такое превышение допустимого риска над ожидаемой прибылью заранее предустановлено для всех ваших рекомендаций? Или это просто в текущей рыночной ситуации программный комплекс предлагает именно это соотношение, а в другой рыночной ситуации возможно, что тейк-профит будет в три раза дальше отстоять от точки входа, чем стоп-лосс?Вот сейчас актуальными являются 30 рекомендаций. И все они - SELL. Это очень смело. Если сейчас вдруг весь рынок резко пойдёт вверх, то это же будет 30 неудачных прогнозов! И при таком соотношении ожидаемой прибыли и допустимого убытка получится, что для покрытия убытка нужно будет больше ста удачных прогнозов.В какой захватывающий момент я оформил подписку! Интересно посмотреть, какими будут результаты этих тридцати однонаправленных рекомендаций.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "simata.pro",
      "created_time": "September 08, 2023, 05:47:00 PM",
      "body": "Quote from: internetional on September 08, 2023, 07:51:20 AMА, понятно. У меня iPad. На нём onmouseover не сделать. Поэтому я эту всплывающую информацию увидеть не могу.На самом деле можно. Если нажать на заголовок столбца и удерживать, то появится подсказка.Quote from: internetional on September 08, 2023, 07:51:20 AMВо всех трёх примерах убыток в случае неудачи будет примерно в три с половиной раза больше, чем прибыль в случае удачи. И в остальных рекомендациях - то же самое. Интересно узнать: такое превышение допустимого риска над ожидаемой прибылью заранее предустановлено для всех ваших рекомендаций? Или это просто в текущей рыночной ситуации программный комплекс предлагает именно это соотношение, а в другой рыночной ситуации возможно, что тейк-профит будет в три раза дальше отстоять от точки входа, чем стоп-лосс?Вот сейчас актуальными являются 30 рекомендаций. И все они - SELL. Это очень смело. Если сейчас вдруг весь рынок резко пойдёт вверх, то это же будет 30 неудачных прогнозов! И при таком соотношении ожидаемой прибыли и допустимого убытка получится, что для покрытия убытка нужно будет больше ста удачных прогнозов.Как я уже говорил - у всех своя торговая стратегия. Наша платформа моделирует тренды и другие рыночные представления, а уже за Вами решение применять смоделированный платформой «stop loss» или применять собственную стратегию по установке рисков на сделку. Для моделей значение колонки «stop loss» следует рассматривать как комплексное представление зоны риска: в которой содержится рыночный «stop loss» (возможно установленный согласно вашей торговой стратегии) и исторически подтвержденная зона разворота тренда. Значение является расчетно-прогнозируемым и исторически подтвержденным учитывая многие рыночные ситуации и не является точным к исполнению. В подтверждение прошу обратить внимание в History Models на значение колонки Risk per Trade % - где представлено фактическое рыночное значение stop loss.В любом случае наша платформа оперирует этими абсолютными значениями и показывает результаты в History models. История моделей Вам доступна в кабинете для проверки и анализа. Результативность по PNL и показателю Net Market Exposure Вам так же доступна для анализа в абсолютных значения и процентном соотношении.Quote from: internetional on September 08, 2023, 07:51:20 AMВ какой захватывающий момент я оформил подписку! Интересно посмотреть, какими будут результаты этих тридцати однонаправленных рекомендаций. Нам очень важно Ваше впечатление от платформы в такой момент.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "internetional",
      "created_time": "October 23, 2023, 10:19:33 AM",
      "body": "Quote from: simata.pro on September 08, 2023, 05:47:00 PMНам очень важно Ваше впечатление от платформы в такой момент.Я проследил за пятью рекомендациями, заявленными 7 сентября как рекомендации с самым низким риском. 1. LTCUSDT. Было предложено встать в шорт по 62,87 с тейк-профитом 59,34 и стоп-лоссом 75,3. Выполнение этой рекомендации принесло бы прибыль.2. DASHUSDT. Было предложено встать в шорт по 25,34 с тейк-профитом 24,47 и стоп-лоссом 28,81. Выполнение этой рекомендации принесло бы прибыль. 3. UNIUSDT. Было предложено встать в шорт по 4,4 с тейк-профитом 4,1719172 и стоп-лоссом 5,092934. Выполнение этой рекомендации принесло бы прибыль.4. ADAUSDT. Было предложено встать в шорт по 0,256 с тейк-профитом 0,215 и стоп-лоссом 0,353. Выполнение этой рекомендации на текущий момент давало бы небольшой плавающий убыток.5. BNBUSDT. Было предложено встать в шорт по 214,4 с тейк-профитом 209,7422 и стоп-лоссом 226,9797. Выполнение этой рекомендации принесло бы прибыль.Хотел дождаться, когда отработает последняя из пяти рекомендаций, но появился повод написать раньше. Вчера Simata попыталась списать с моей карты деньги за подписку. (Карта пустая - специально для таких подписок, которые я пока не планирую использовать.) Списание, как ни странно, было инициировано не в евро, а в долларах. Стоимость подписки 19 евро, а с карты пытались списать 21,06 долларов. Вывод: для оплаты лучше использовать долларовую карту, а не евровую.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}