{
  "id": "topic_5443428",
  "title": "BitcoinNeedHelp",
  "author": "BitcoinNeedHelp",
  "created_time": "March 05, 2023, 05:34:23 PM",
  "content": "Good evening guysi have a big problem.I had created an Electrum MultiSig wallet 2 of 3 and all 3 was created with hardware wallets.My computer just broke down and it won't start anymore.I have all 3 x 24 seeds and all 3 hardware wallets device, however I have not backed up the xpub.....Can I now restore my MultiSig wallet with my 3 hardware wallets or do I need the xpub in addition to the 3x 24 seeds?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5443428",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "March 05, 2023, 05:54:34 PM",
      "body": "So far you have the seed phrase, you can use it to recover your multisig wallet, the seed phrase can always generate the master private key and the master public key can always be generated if you have the seed phrase.So far you are only the owner of the wallet, you can even use seed phrase all through without using the master public key.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinNeedHelp",
      "created_time": "March 06, 2023, 09:47:27 AM",
      "body": "Quote from: Charles-Tim on March 05, 2023, 05:54:34 PMSo far you have the seed phrase, you can use it to recover your multisig wallet, the seed phrase can always generate the master private key and the master public key can always be generated if you have the seed phrase.So far you are only the owner of the wallet, you can even use seed phrase all through without using the master public key.I'm glad to hear that what is the xpub for then?I read somewhere that you should keep them.And you can't get your coins without the xpubBest regards",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "March 06, 2023, 09:54:44 AM",
      "body": "Quote from: BitcoinNeedHelp on March 06, 2023, 09:47:27 AMwhat is the xpub for then?I read somewhere that you should keep them.And you can't get your coins without the xpubXpub is the master public key, it can generate the addresses. But master private key is what that is most important, the seed phrase can generate the master private key while from the master private key, the master public key can be generated. If you have your seed phrases, you have your coins as you can recover it and spend it with the seed phrase (which can generate the master public key).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinNeedHelp",
      "created_time": "March 06, 2023, 10:14:34 AM",
      "body": "Quote from: Charles-Tim on March 06, 2023, 09:54:44 AMQuote from: BitcoinNeedHelp on March 06, 2023, 09:47:27 AMwhat is the xpub for then?I read somewhere that you should keep them.And you can't get your coins without the xpubXpub is the master public key, it can generate the addresses. But master private key is what that is most important, the seed phrase can generate the master private key while from the master private key, the master public key can be generated. If you have your seed phrases, you have your coins as you can recover it and spend it with the seed phrase (which can generate the master public key).ahh ok, well understood so farand the seed always creates the same private key and the private key always creates the same public key when restoring the wallet?So just like the seed always stays the same, do the private and public keys stay the same?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "March 06, 2023, 10:12:16 PM",
      "body": "Quote from: BitcoinNeedHelp on March 06, 2023, 10:14:34 AMand the seed always creates the same private key and the private key always creates the same public key when restoring the wallet?Yes, the same seed phrase will generate the same keys and addresses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "March 07, 2023, 01:33:39 AM",
      "body": "Quote from: BitcoinNeedHelp on March 06, 2023, 10:14:34 AMand the seed always creates the same private key and the private key always creates the same public key when restoring the wallet?So just like the seed always stays the same, do the private and public keys stay the same?It depends on your derivation path but with a same seed and same derivation path, you will get a same master private key then same set of public key for your addresses.A biggest advantage of hardware wallet is you are not relied on computer to use your wallet. You can plug your hardware wallets to any device to use without fear that you will lose your coins. Because you don't leak your private key with hardware wallet on any device by broadcasting transactions.BIP32 - Hierarchical Deterministic Wallets (Child Key Derivation Function)Two chapters in Mastering Bitcoin can help you more.Keys, AddressesWallets (read in HD wallets)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}