{
  "id": "topic_5423064",
  "title": "Hispo",
  "author": "Hispo",
  "created_time": "November 25, 2022, 05:16:47 AM",
  "content": "MetaMask comenzará a recopilar las direcciones IP de los usuariosFuente: https://es.cointelegraph.com/news/metamask-will-start-collecting-user-ip-addressesQuoteSegún un acuerdo revisado de política de privacidad publicado por ConsenSys el 23 de noviembre, MetaMask comenzará a recopilar las direcciones IP de los usuarios y las direcciones de las billeteras de Ethereum durante las transacciones on-chain.Sin embargo, ConsenSys, el creador de la billetera, explica que la recopilación de datos de los usuarios solo se aplicará si utilizan la aplicación Infura de llamada a procedimiento remoto (RPC) por defecto de MetaMask. Por lo tanto, las personas que utilicen su propio nodo de Ethereum o un proveedor de RPC de terceros con MetaMask no están sujetas a la nueva política de privacidad de ConsenSys. En su lugar, se aplican los términos del otro proveedor de RPC. Quote... la información recopilada de esta manera puede ser revelada a los afiliados, durante los tratos comerciales, o para cumplir con los requisitos de \"conozca a su cliente\" y contra el lavado de dinero dictados por las autoridades. MetaMask es actualmente uno de las billeteras de autocustodia más populares del mercado, con más de 21 millones de usuarios activos mensuales.Bueno, se que probablemente muchos de ustedes ya vieron esta noticia por allí, incluso fue tendencia en Twitter (en donde mucha de la comunidad de Bitcoin y Ether hacen vida).Metamask, luego de supuestamente cambiar su licencia hace un par de años, cerrando su código, ha dado un paso más hacia la centralización.No es para nada una noticia pequeña, Metamask es una de esas wallets con mucha importancia para los usuarios de Ether y el hecho de que estén haciendo estas cosas me hace pensar que quizá efectivamente detrás del desarrollo de la wallet hay personas infiltradas de Dios sabe donde, para acabar con los valores más importantes de nuestro ecosistema.Al parecer es posible saltarse estas medidas violatorias de la privacidad, pero para ello los usuarios tienen que correr su propio nodo o conectarse a uno de confianza, en todo caso, creo que sería mejor desechar Metamask de una vez.¿Opiniones?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5423064",
  "comments": [
    {
      "author": "Don Pedro Dinero",
      "created_time": "November 25, 2022, 05:28:44 AM",
      "body": "Quote from: Hispo on November 25, 2022, 05:16:47 AM¿Opiniones?Otro motivo más para usar solo bitcoin con tus claves privadas y dejarse de mierdas de alts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "November 25, 2022, 05:45:01 AM",
      "body": "Quote from: Don Pedro Dinero on November 25, 2022, 05:28:44 AMQuote from: Hispo on November 25, 2022, 05:16:47 AM¿Opiniones?Otro motivo más para usar solo bitcoin con tus claves privadas y dejarse de mierdas de alts.He allí una de las fortalezas de Bitcoin: Los usuarios no están concentrados solo en un par de wallets para interactuar con la red, si no que tienen a disposición varias y que son definitivamente de código abierto, populares y accesibles.Siempre nos quedará Bitcoin Core, por ejemplo. Ni idea de porque la fundación Ethereum no hace lo mismo que los desarrolladores de Bitcoin y sacan su propia wallet nativa y de código abierto, en lugar de dejar a los usuarios a la buena de Dios y en las manos de desarrolladores que pretenden ir en contra de los propios valores de los activos a los cuales dan soporte.¿Tu te imaginas que pasaría si alguien si quiera llegase a sugerir convertir Bitcoin Core en código cerrado citando cualquier supuesta \"ventaja\"?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "November 25, 2022, 06:18:08 AM",
      "body": "No sé bien bien de dónde ha venido esta necesidad por parte de la wallet de recopilar las IPs, pero desde luego es una práctica nada deseable, y que siempre está en la mente de uno al utilizar cualquier wallet que no sea autosuficiente. Incluso en wallets ligadas a las hardware wallets pueden hacer algo similar y no parece dársele demasiado bombo:QuoteLedger Live does not contain identifying information that allows us to know your identity.(*Your IP address is only collected to be transmitted to our partners when this information is required to provide their services, and is not stored by Ledger) Ledger neither stores nor has access to your crypto assets and private keys. We only provide ‘cold storage’ services.https://www.ledger.com/privacy-policy#:~:text=To%20do%20this%2C%20we%20provide,what%20we%20do%20with%20itEs decir, en el caso de Ledger por ponerlo como ejemplo de prácticas en una línea similar, ellos indican no almacena esta información, pero si derivarla hacia proveedores terceros que \"precisen\" esta información …Una VPN ayuda a camuflar todo esto, pero es posible que, de vez en cuando, uno se conecte sin tenerla activa, y el dato de la IP real ya ha fluido.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "November 25, 2022, 08:16:44 PM",
      "body": "Quote from: Hispo on November 25, 2022, 05:16:47 AM[...] acabar con los valores más importantes de nuestro ecosistema.Y ¿cuales serán los valores más importantes del ecosistema de Ethereum?  Me parece que son un poco diferentes que los de Bitcoin, sobre todo en cuanto a censura/privacidad veo grandes diferencias. Ethereum parece que siempre apunta más a la \"compliance\" y a otros valores tradicionales del mundo financiero, quieren atraer a Wall Street, no a los cypherpunks ...No creo que haya nadie \"infiltrado\" en eso ... si Metamask recurre a un proveedor centralizado para los datos de la blockchain, este deberá actuar de acuerdo a las leyes (AML/KYC y demás) de su país de residencia. Es también un actor en el que hay que confiar, y por ende, se puede elegir también otro nodo. Nada más usar el proveedor oficial debe ser lo más cómodo   (Yo también usé Metamask durante un tiempo, sí, es muy cómodo, pero no lo usaría para nada que sea importante.)Igual en el sitio web de ethereum.org hay filtros que permiten encontrar a varias aplicaciones que permiten tener tus propias claves y son de código abierto, tanto para celulares como para PCs. Con varios otros filtros útiles (layer 2, importar tokens ...) encuentro no menos de 13. Así que, alternativas parece haber. (Aunque lo raro es que en este listado aparece Metamask también, ¿no habían posteado que este ya no era de código abierto?).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "November 26, 2022, 03:06:09 AM",
      "body": "Quote from: DdmrDdmr on November 25, 2022, 06:18:08 AM-snip-Solo se me ocurren dos opciones, las cuales creo que son lo suficientemente razonables: necesitan las IP para posibles campañas de marketing en un futuro, las típicas campañas guiadas (de nada sirve saber los gustos y hábitos de clientes potenciales si no saben donde viven) y la segunda opción supongo que sería el monitoreo por parte de las agencias de inteligencia y compañía.Quote from: d5000 on November 25, 2022, 08:16:44 PMQuote from: Hispo on November 25, 2022, 05:16:47 AM[...] acabar con los valores más importantes de nuestro ecosistema.-snip-No creo estar equivocado su pienso que Ethereum compartió varios de los valores de Bitcoin en sus primeros días, pero esos ideales se fueron desviando con el tiempo. Yo creo que personalmente los cryptoactivos que se precien de ser serios deberían compartir por lo mínimo la propiedad de la descentralización. Asumo que ETH busca desligarse de eso y convertirse más bien en una herramienta del sistema tradicional actualmente, solo puedo especular el porque.Si, tengo entendido que Metamask cambió su licencia y que ya no es de código abierto desde el 2020.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "November 26, 2022, 04:15:44 PM",
      "body": "Que las aplicaciones o sitios web registren nuestras direcciones IP no es algo nuevo o algo de lo que debamos preocuparnos, es una práctica mas común de lo que te imaginas, incluso este foro lleva registro de nuestras IP. Y cada usuario puede ver su registro personal en el siguiente enlace:https://bitcointalk.org/myips.phpAfortunadamente en mi país usamos IP dinámicas, y basta con apagar y prender el modem para obtener una nueva IP",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "November 26, 2022, 05:14:06 PM",
      "body": "Me estaba preguntando si, como dice DdmrDdmr, con una simple VPN se solucionaría el problema. Si es así, es bastante sencillo mantener la privacidad de quien lo quiera. Basta con tener instalado un navegador para usarlo solo cuando se vaya a utilizar metamask. Así, aunque se caiga frecuentemente la VPN, disminuyen las probabilidades de filtrado de IP al servicio al que nos referimos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "November 26, 2022, 05:14:58 PM",
      "body": "Quote from: seoincorporation on November 26, 2022, 04:15:44 PM<…>No obstante, entiendo que los proveedores de servicios de internet si llevan registro de las asociación de las IP a sus clientes, o como se denota en el log de IPs de Bitcointalk, queda traza de todas las IPs desde las cuales te conectas al foro. Quote from: Hispo on November 26, 2022, 03:06:09 AM<…>Entiendo que la motivación base está en la de mantener traza de las IPs por cuestiones de de trazabilidad y pseudo-identificación ante potenciales requerimientos. Por lo menos en el caso de Ledger tiene sentido así, dado que si te conectas desde la wallet a servicios de terceros, quien se conecta es el framework de la wallet. El framework, al operar en tu entorno, lógicamente les pasará la IP.En la política general de Consensys, matriz de Metamask y la citada Infura, se cita que:QuoteInformation collected by Infura when you use Infura as your default RPC provider in MetaMask. https://metamask.io/ (“MetaMask”) and https://infura.io/ (“Infura”) are both products offered by the Company and Infura is the default Remote Procedure Call (RPC) provider in MetaMask. When you use Infura as your default RPC provider in MetaMask, Infura will collect your IP address and your Ethereum wallet address when you send a transaction. However, if you’re using your own Ethereum node or a third party RPC provider with MetaMask, then neither Infura nor MetaMask will collect your IP address or Ethereum wallet address (but you should be aware your information will be subject to whatever information collection performed by the RPC provider you are using and their terms regarding such collection).Que es más o menos lo citado en el artículo del OP.Pero también añade que:QuoteInformation Automatically Collected. We may automatically record certain information about how you use our Sites (we refer to this information as “Log Data“). Log Data may include information such as a user’s Internet Protocol (IP) address, device and browser type, operating system, the pages or features of our Sites to which a user browsed and the time spent on those pages or features, the frequency with which the Sites are used by a user, search terms, the links on our Sites that a user clicked on or used, and other statistics. We use this information to administer the Service and we analyze (and may engage third parties to analyze) this information to improve and enhance the Service by expanding its features and functionality and tailoring it to our users’ needs and preferences.Ver: https://consensys.net/privacy-policy/Lo de la mejora del servicio no digo que no pueda ser una causa. En entornos sin mejor identificador, la IP se usa omo sucedáneo de ello, y aun con todos los errores que se puedan derivar de su uso con estos fines (por la relación n:m entre IPs y Clientes), se intenta perfilar clientes con base a este pseudo-idntificador. Tambien se puede derivar información geográfica de interés.Ahora bien, lo más probable es que uno preferiría priorizar su privacidad por encima de la explotación comercial de tus conexiones.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "November 26, 2022, 06:25:57 PM",
      "body": "Quote from: Hispo on November 26, 2022, 03:06:09 AM../Q/...:::Solo se me ocurren dos opciones, las cuales creo que son lo suficientemente razonables: necesitan las IP para posibles campañas de marketing en un futuro, las típicas campañas guiadas (de nada sirve saber los gustos y hábitos de clientes potenciales si no saben donde viven)...Es el asunto aquí, IP+ hábito siempre están juntas, no andan solas de hecho en el concepto de recopilación de data puedes gestionar la recopilación de IP y no priorizar los hábitos.Pero la contraria no existe o no tiene sentido.Y ese mismo concepto se da en la relevancia de la protección de tu información que nos lleva a el derecho de la privacidad que no del anonimato, dos concepto que se rozan se mezclan pero si se mira bien en el proceso no solo sistemático sino legal son como el agua y el aceite.En algunos países o leyes tienes derecho a la privacidad pero no al anonimato y lo primero no implica que estés entregando información si no como está es gestionada.Es el caso aquí, ahora solo te lo están diciendo.En todo caso VPN para el sistema operativo (Windows, Android, etc) ya sea PC,  Smartphone, Smart TV, si te descuidás por ahí igual te pillan.------Creo que este en un buen tema para  llevar en el tablero de Alts, y así le metemos movimiento a esa sección.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xylber",
      "created_time": "November 27, 2022, 11:25:38 PM",
      "body": "Lo ideal sería tener un nodo propio. Pero seguramente se necesite un nodo para cada red: eth, binance smart chain, polygon, etc.Los requisitos para un nodo Ethereum son muy bajos:Minimum requirements    CPU with 2+ cores    8 GB RAM    700GB free disk space    10+ MBit/s bandwidthY recomiendan tener un disco SSD para guardar los datos. O sea, es más trabajoso, pero es mucho mejor que seguir confiando en el sistema bancario que supuestamente hace todo fácil pero nos terminan robando.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "November 28, 2022, 03:14:41 PM",
      "body": "Quote from: Xylber on November 27, 2022, 11:25:38 PMLo ideal sería tener un nodo propio. Pero seguramente se necesite un nodo para cada red: eth, binance smart chain, polygon, etc.Los requisitos para un nodo Ethereum son muy bajos:Minimum requirements    CPU with 2+ cores    8 GB RAM    700GB free disk space    10+ MBit/s bandwidthY recomiendan tener un disco SSD para guardar los datos. O sea, es más trabajoso, pero es mucho mejor que seguir confiando en el sistema bancario que supuestamente hace todo fácil pero nos terminan robando.No siento que esos requisitos sean realmente bajos, no todo el mundo tiene accesso a discos duros SSD de 1TB... y si queremos contratar un VPS con esas características no es nada barato. Si analizamos los reguisitos the BSC son aún peores:    →VPS con Mac OS X, Linux, o Windows.    → 2TB de disco SSD, gp3,     →16 cores of CPU and 64 gigabytes of memory (RAM).    →Conexión de 5 megabyte por secondCualquiere puede correr un nodo de Bitcoin pero no cualquiere puede correr un nodo de ETH o BSC, thanto los conocimiento requeridos como el hardware son mucho mas exigentes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "November 29, 2022, 06:15:40 PM",
      "body": "Quote from: famososMuertos on November 26, 2022, 06:25:57 PMQuote from: Hispo on November 26, 2022, 03:06:09 AM-snip-Quote from: DdmrDdmr on November 26, 2022, 05:14:58 PMQuote from: seoincorporation on November 26, 2022, 04:15:44 PM<…>-snip-Me hace reflexionar en el hecho de que aunque el querer mejorar los servicios y productos para los clientes suene como una explicación lógica para la recolección de datos, la mejora continua es algo que ya existía antes del internet y el avance tecnológico que vemos hoy. Claro, actualmente es más fácil con los aparatos que tenemos.Al final, la tentación de la vigilancia de los usuarios es muy grande y no la han dejado pasar y no la seguirán dejando pasar y menos con algo tan \"preocupante\" como las criptomonedas. Incluso ya he escuchado un poco en Deutsche Welle, sobre supuestas intenciones de utilizar inteligencia artificial para predecir si una persona podría cometer un crimen.Quote from: seoincorporation on November 26, 2022, 04:15:44 PMQue las aplicaciones o sitios web registren nuestras direcciones IP no es algo nuevo o algo de lo que debamos preocuparnos, es una práctica mas común de lo que te imaginas, incluso este foro lleva registro de nuestras IP. Y cada usuario puede ver su registro personal en el siguiente enlace:https://bitcointalk.org/myips.phpAfortunadamente en mi país usamos IP dinámicas, y basta con apagar y prender el modem para obtener una nueva IP  Igual aquí, en el pasado ha sido un poco problemático, pero supongo que tiene sus ventajas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darxiaomi",
      "created_time": "November 29, 2022, 08:42:41 PM",
      "body": "La verdad es que es un pepinazo enorme para la web 3.0 \"simple\" ya que Metamask es el buque insignia de tener todo medianamente cerca al alcance de la mano y sin demasiadas vueltas.Pero bueno sabemos todos que todos los caminos conducen a roma, en cuanto algo toma algo de vuelo le caen las mil y una regulaciones.Es un tedio enorme tener que usar 45 billeteras distintas dependiendo que token sea.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "November 30, 2022, 11:26:28 PM",
      "body": "Quote from: Porfirii on November 26, 2022, 05:14:06 PMMe estaba preguntando si, como dice DdmrDdmr, con una simple VPN se solucionaría el problema. Si es así, es bastante sencillo mantener la privacidad de quien lo quiera. Basta con tener instalado un navegador para usarlo solo cuando se vaya a utilizar metamask. Así, aunque se caiga frecuentemente la VPN, disminuyen las probabilidades de filtrado de IP al servicio al que nos referimos.Desafortunadamente es mucho más difícil mantener un nivel básico de privacidad hoy en día, y eso es porque no solo se puede usar una IP para rastrear tus acciones en línea, todo tu sistema es como una huella digital que puede usarse para identificarte.Así que se puede usar la combinación de tu sistema operativo, navegador, plugins, addons, uso horario, idioma del teclado, hardware y hasta tu resolución de pantalla para crear un perfil de usuario, así que incluso si ocultases tu IP si los demás factores no cambian es bastante trivial para un tercero con esa información identificarte.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "December 01, 2022, 03:08:01 AM",
      "body": "Quote from: darxiaomi on November 29, 2022, 08:42:41 PMLa verdad es que es un pepinazo enorme para la web 3.0 \"simple\" ya que Metamask es el buque insignia de tener todo medianamente cerca al alcance de la mano y sin demasiadas vueltas.Pero bueno sabemos todos que todos los caminos conducen a roma, en cuanto algo toma algo de vuelo le caen las mil y una regulaciones.Es un tedio enorme tener que usar 45 billeteras distintas dependiendo que token sea.Creo que no es necesario tener un número tan alto de billeteras para poder prescindir de Metamask. Es conservador asumir que sería una billetera adicional por cada red con la cual nosotros como usuarios quisieramos interactuar: sería una billetera para la red principal de Ethereum, otra billetera para la red de Binance, etc. Aunque para ser justos, ya existen billeteras que integran varias redes en una solo solución, por ejemplo, Trust tiene ambas ETH & BNB (lo malo es que también es de código cerrado. Sea como sea, entiendo y comparto la frustración.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "th3nolo",
      "created_time": "December 03, 2022, 05:38:32 PM",
      "body": "Es un poco comico esto, pero es una realidad.. aunque creo que eso solo lograra minimizar la confianza que se tiene en este grande de las wallets web3, pero.. es tan simple como cambiar el servidor principal al cual le estas pegando y utilizar alguno de los forks que esta en el mercado de metamask, o bueno sus competidores aunque creo qeu todos estan haciendo lo mismo..Si no eres tu mismo el que tiene el nodo dudo que puedas tener confiaza de que estas haciendo las cosas bien para mantener tu privacidad, y seguridad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "December 04, 2022, 03:17:39 PM",
      "body": "Quote from: th3nolo on December 03, 2022, 05:38:32 PMutilizar alguno de los forks que esta en el mercado de metamask...Si de por si es difícil confiar en Metamask, ahora confiar en un fork lo veo aun mas complejo. Desafortunadamente los que copian el código y lo liberan lo hacen con una intención maligna la mayoría de la veces. Así que yo no recomendaría a los usuarios instalar una copia del plugin. Siempre hay que verificar que estamos instalando la versión original.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}