{
  "id": "topic_5449033",
  "title": "Outhue",
  "author": "Outhue",
  "created_time": "April 16, 2023, 01:18:19 PMLast edit: August 19, 2023, 08:18:52 AM by Outhue",
  "content": "There are many disadvantages of excessive gambling that we need to talk about, and I do hope that newbies who plan to start gambling will learn something from this thread.Gambling is not for everyone, some people tend to always get attached to whatever they do in their lives, too caring, too foodie, too protective, all these comes with disadvantages too, because I believe that too much of everything is bad.If you are someone like this, stay away from gambling. In the Gambling case, it's a different story entirely, if humans can get used to drugs, alcohol, and other harmful things in this category how much more trying to make money off gambling? It is easier to start dteaming about quitting your job one day and retire in your 30s, you know what I am talking about, those weird dreams that one never dreamt about when working in a company from 8am to 5pm everyday. Here are some Negative effects of excessive gambling.Too much stress Anxiety and Depression Debt Making wrong decisions And if all these is active in one's life low self-esteem is sure to follow, many people messed up their lives by gambling and they don't know when they start borrowing money, or selling off properties because of gambling until they have nothing left. Thier families are the one who got caught up in the mess, imagine a family man that has a home to take care of ending up losing everything to gambling and start living a wrecked life, I have seen a lot. My advice for upcoming gamblers reading this thread today, always makes sure you gamble like a responsible man. Remember where you came from and think about your children and family.  Gambling must not be your path to success, you will get rekt very fast.Do not build any dreams around gambling at all.Gamble for fun only, using small money that you aren't needing, and think about losing that money first, to make sure that you won't be needing the money if it's gone.Take a break.Play for fun.Don't chase your losses.Stick to your Limits.Gamble Responsibly.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449033",
  "comments": [
    {
      "author": "Get-Paid.com",
      "created_time": "April 16, 2023, 01:25:20 PM",
      "body": "The problem with posts like this is that the majority of users in this forum are going to criticize those who lose, telling them it's their own fault and their own problem, but indeed - what you say makes a lot of sense - suicide rate from gambling is on the high and has never been so high....20-30 years ago in order to gamble you had to drive to a casino or a bookie, today it's all laid down for you at the ease of your fingertips... yes, it is designed against you but people still get addicted to it just like alcohol, cigarettes and more ... the only trouble with this addiction is that it could be silent, invisible, there won't be visible symptoms...Nonetheless, we still believe some people can gamble and keep it sane, we also believe in taking advantage of gambling offers (hence - our blog), but by all means your thread should not be taken lightly neither.Thanks for posting this info.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "April 16, 2023, 01:41:06 PM",
      "body": "I still hard to believe if a gambling addict will stop and realized if they was wrong with their gambling habit, because there are many gambling addict get forced by their parents to not gamble and get kicked from their company, but it doesn't make them to stop gambling. There's nothing wrong about this thread, but if you hope you can help an addict by creating this thread, you shouldn't hope to high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "April 16, 2023, 01:48:44 PM",
      "body": "Quote from: Get-Paid.com on April 16, 2023, 01:25:20 PMThe problem with posts like this is that the majority of users in this forum are going to criticize those who lose, telling them it's their own fault and their own problem, but indeed - what you say makes a lot of sense - suicide rate from gambling is on the high and has never been so high....Thanks for posting this info.It's not criticism but telling a fact. This kind of topic had been discussed multiple times in the majority of gambling thread in any possible way when gambling loss topic is brought up. It's simple, no one force you to gamble so you are playing at your own. Similar thread that start discussion like this:https://bitcointalk.org/index.php?topic=5126134.0https://bitcointalk.org/index.php?topic=5438014.0https://bitcointalk.org/index.php?topic=5444704.... many more.Nice info OP but topic like this will just result to recycle comment and discussion that been tackle multiple times here in gambling board. Make sure to watch out for this thread closely because it can feast by same same comment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "April 16, 2023, 02:36:50 PM",
      "body": "Quote from: Outhue on April 16, 2023, 01:18:19 PMHere are some Negative effects of excessive gambling.Too much stress Anxiety and Depression Debt Making wrong decisions You will not think of the negative effects when you're still enjoying the game but when you don't know how to get out and you stated chasing your losses, is not enjoyable anymore, you think of your losses you think that you can beat the house because you've experienced winning because you experienced how is it like to win big amount but you did not quit on time.Everything depends on quitting at the right time and knowing your limitation, without this, you will fall into addiction so enjoying it becomes a source of anxiety and depression.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "April 16, 2023, 02:45:04 PM",
      "body": "Quote from: Jawhead999 on April 16, 2023, 01:41:06 PMI still hard to believe if a gambling addict will stop and realized if they was wrong with their gambling habit, because there are many gambling addict get forced by their parents to not gamble and get kicked from their company, but it doesn't make them to stop gambling. There's nothing wrong about this thread, but if you hope you can help an addict by creating this thread, you shouldn't hope to high.   -   The change of a gambling addict will also only come from themselves, and we here are the only thing we can do is to warn if there are any cryptocurrency gambling addicts out there.And we also know that on the part of the gambling addict, he has a bit of difficulty in the beginning, but if he works hard, he will also be able to get rid of the vice that he has committed or is in the habit of.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eureka_07",
      "created_time": "April 16, 2023, 02:58:26 PM",
      "body": "Personally, the stress and anxiety that I get from gambling has decreased drastically when I started applying some rules to myself with regards to me playing in casinos. First is to set limitations. This is about how much is the max bet I should do and how much money am I willing to lose. Next is just applying these to each of my playing session.Lastly is to have fun, enjoy the game. Accept whatever the result is. This terms really helped me. So if you also have these problems, maybe this could also be helpful to you. Or maybe you can set up rules which is applicable with your case.Gamble Responsibly!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "April 16, 2023, 03:02:52 PM",
      "body": "Gambling addict will not listen easily, they are drowning on their greed and they need proper assistance and medication, I'm talking about the worst case scenario of being addict in gambling. As much as possible, you have to help yourself if you are still in the early stage of addiction, it's not too late for you. These reminders are being posted here repeatedly and I'd hope that many are already aware about the possible risk of gambling and the threat of its addiction. If you can help someone who are into gambling, please do so because you can save his/her life by guiding them slowly but surely.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "April 16, 2023, 03:05:50 PM",
      "body": "Quote from: Outhue on April 16, 2023, 01:18:19 PMDo not build any dreams around gambling at all.Maybe these words are suitable for beginners, sometimes it all starts with the dreams of beginners who want something difficult to achieve so they try to find luck through gambling, that's what must be stopped, never dream of getting rich from casinos, there are many out there those who become poor because of gambling because they play irresponsibly and do not play wisely until they become addicts to the point where they are willing to lose assets and also owe debt everywhere to play gambling. Gambling must be prepared with the risk of losing.Never gamble too to pay for the necessities of life, because that is clearly impossible and very impossible especially not many people do that to make ends meet from winning at gambling machines, I think this thread can be a reference so that beginners can read it before really playing gambling .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Get-Paid.com",
      "created_time": "April 16, 2023, 03:17:23 PM",
      "body": "Quote from: Eternad on April 16, 2023, 01:48:44 PMIt's simple, no one forces you to gamble so you are playing at your own.Firstly, it's \"forces\", no one forces you to gamble with 's'. (if anything it should be \"no one is forcing\")Secondly,If what you say is so \"simple\" and reflecting the reality, then why the Premier League has chosen to ban gambling sponsors on the players' shirts? (hint: La Liga in Spain already did it)Why is there so much regulation around that topic?Why do businesses acquire a license in order to operate some games or at least most of them do so?No, it's not as simple as you're trying to portray - yes, we do believe it can be done responsibly and for many people there might not be any issue with it, however there are the ones who suffer from it, and this is why governments step in.So what you say (\"this is so simple\") is wrong, but you are not wrong about this being discussed many times, totally agree with you on that, and it looks like there would never be enough discussions about this topic, fortunately or unfortunately, depends who you're asking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "April 16, 2023, 03:54:29 PM",
      "body": "Quote from: Eternad on April 16, 2023, 01:48:44 PMQuote from: Get-Paid.com on April 16, 2023, 01:25:20 PMThe problem with posts like this is that the majority of users in this forum are going to criticize those who lose, telling them it's their own fault and their own problem, but indeed - what you say makes a lot of sense - suicide rate from gambling is on the high and has never been so high....Thanks for posting this info.It's not criticism but telling a fact. This kind of topic had been discussed multiple times in the majority of gambling thread in any possible way when gambling loss topic is brought up. It's simple, no one force you to gamble so you are playing at your own. Similar thread that start discussion like this:https://bitcointalk.org/index.php?topic=5126134.0https://bitcointalk.org/index.php?topic=5438014.0https://bitcointalk.org/index.php?topic=5444704.... many more.Nice info OP but topic like this will just result to recycle comment and discussion that been tackle multiple times here in the gambling board. Make sure to watch out for this thread closely because it can feast by same comment.Still, someone has to do this once in a while, how many newbies even understand that some discussions have been discussed a few times on this forum before? I don't even know the function of the forum search engine until someone told me how using the search engine can be helpful, so newbies might not even know how good the search engine is until they are been told since we keep getting new members almost every time someone has to keep bringing this warning up.  Thanks for your comment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "April 16, 2023, 03:58:39 PM",
      "body": "There are several points in your thread that can be drawn a conclusion and a lesson for anyone who is addicted and involved in the world of gambling, especially online gambling.Example: good point.Quote from: Outhue on April 16, 2023, 01:18:19 PMGambling must not be your path to success, you will get rekt very fast.Do not build any dreams around gambling at all.Gamble for fun only, using small money that you aren't needing, and think about losing that money first, to make sure that you won't be needing the money if it's gone.The world of gambling in my opinion is exactly like the world (hallucinations), where everyone who wants to gamble always wants to have the hope of winning and with high hallucinations, whether we are responsible or not is all up to us.Meaning: everyone has principles for gambling, they know how much money has been spent and earned in gambling, meaning: try to control the gambling, don't let gambling control you and try to control the gambling for you, for that you are safe, whether for fun, entertainment and so on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "April 16, 2023, 04:21:58 PM",
      "body": "Self discipline should be a basic requirement for every individual then only they can survive in this world, of course when it comes to gambling the financial risks will also be added along with others as mentioned but gambling is an experience which should be experienced by everyone but don't get obsessed with it, don't think it is a way of making easy money and get rich cause that is the problem of most people who addict to gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "April 16, 2023, 04:33:38 PM",
      "body": "Quote from: Get-Paid.com on April 16, 2023, 03:17:23 PMIf what you say is so \"simple\" and reflects the reality, then why the Premier League has chosen to ban gambling sponsors on the players' shirts? (hint: La Liga in Spain already did it)Why you are making things complicated?  You control yourself and not the other way around. You have free will to do everything that you want like avoiding gambling. Don’t make my comment complicated with your ideology. Quote from: Get-Paid.com on April 16, 2023, 03:17:23 PMWhy is there so much regulation around that topic?Why do businesses acquire a license in order to operate some games or at least most of them do so?You are not sticking on the topic here. This is a gambling responsibility topic. I just stated a fact that people have free will to gamble or not. Lol",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slapper",
      "created_time": "April 16, 2023, 04:36:08 PMLast edit: July 16, 2023, 08:23:33 PM by slapper",
      "body": "Your message fits the old saying, \"Gotta know when to clutch 'em, when to ditch 'em, when to make tracks, and when to bolt!\" Gambling is fun if you know when to stop.Gambling excessively leads to stress town, anxiety oblivion, depression capital, and debt gulch. It's fine. Gamble without jeopardizing everything. Only gamble with money you can afford to lose.Take breaks when needed! Gambling might be tempting, so it's crucial to keep busy. After your break, the game will be more interesting than ever!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "April 16, 2023, 04:43:48 PM",
      "body": "Quote from: Outhue on April 16, 2023, 01:18:19 PMTake a break.Play for fun.Don't chase your losses.Stick to your Limits.Gamble Responsibly. Those are actually good points you out listed above @ O.P, of which only if 50% of the world's gambling population could adhere to it, will likely reduce the number of frustrated gamblers we all have in our different cities all over the world. And another vital point I will love to add is that people should stop having the concept that they can use $10 to stake 10,000 odds and win $100,000 in sport betting, because that's the major factor why most betting slip cuts, as the longer the betting slip, the more riskier it becomes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "April 16, 2023, 04:48:01 PM",
      "body": "It's good to acknowledge such posts. We need to monitor our gambling habits regularly and make sure we don't fall under the gambling addict category.Fortunately, I don't fall under this category but I don't gamble that frequently. I do gamble 2-4 times a week but that's about it.This is because I don't get time to gamble that much and every time I do gamble, it's only for fun.For those who are in this category, I would suggest them to decrease their gambling frequency and gamble within limits.To reduce the dopamine levels increases by gambling they will have to go through a dopamine detox through any of the methods they like.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "April 16, 2023, 04:49:32 PM",
      "body": "Quote from: Outhue on April 16, 2023, 01:18:19 PMThere are many disadvantages of excessive gambling that we need to talk about, and I do hope that newbies who plan to start gambling will learn something from this thread.Gambling is not for everyone, some people tend to always get attached to whatever they do in their lives, too caring, too foodie, too protective, all these comes with disadvantages too, because I believe that too much of everything is bad.If you are someone like this, stay away from gambling. In the Gambling case, it's a different story entirely, if humans can get used to drugs, alcohol, and other harmful things in this category how much more trying to make money off gambling? It is easier to start dteaming about quitting your job one day and retire in your 30s, you know what I am talking about, those weird dreams that one never dreamt about when working in a company from 8am to 5pm everyday. Here are some Negative effects of excessive gambling.Too much stress Anxiety and Depression Debt Making wrong decisions And if all these is active in one's life low self-esteem is sure to follow, many people messed up their lives by gambling and they don't know when they start borrowing money, or selling off properties because of gambling until they have nothing left. Thier families are the one who got caught up in the mess, imagine a family man that has a home to take care of ending up losing everything to gambling and start living a wrecked life, I have seen a lot. Gamble for fun only, using small money that you aren't needing, and think about losing that money first, to make sure that you won't be needing the money if it's gone.You mention people can \"get used to drugs, alcohol, etc\" but gambling works in much the same way. It is a habit forming behavior, which can be the same with drugs or alcohol, at least at the start - before you potentially become addicted to chemicals you might get from some of the worse drugs or dependency on alcohol. Habits can become very hard to break if you've been doing the same thing again and again for a long time. You need to seek out reasons to change and most importantly you need to abstain completely from the vice, there can be no half measures when trying to break free again. If you've reached the stage of addiction then the best cure will be to block yourself from all the sites and actively change your routine up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jody.Drummer",
      "created_time": "April 16, 2023, 04:54:46 PM",
      "body": "The message the OP conveyed has good points for making good management for a gambler. Our responsibility is not only for ourselves, especially if we already have a family to provide for its needs. So don't let it be because of gambling that we ignore them, that's tantamount to destroying your own family.Don't make gambling a living, because from what I've seen, those who become addicted to gambling initially place too much hope on winning. In fact, we know that winning in gambling is largely influenced by luck. And we can be sure we will not be in a lucky situation every time.Using money that we really don't need, meaning we don't disturb everything in our needs, we really have to be aware of that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "April 16, 2023, 05:10:41 PM",
      "body": "One sad truth is that there are too many irresponsible gamblers that are coming to that moment of taking loans because they can't contain the excitement that they want to gamble. And, when they've lost a lot and there's no money anymore they're trying to chase losses through selling their properties and other assets.It's an emotional battle that's hard to overcome when the affected person is no longer controllable. No one stops anyone from gambling but please don't be too much that you're harming yourself and also affecting others especially your immediate family.There are no other people that's going to help you at first but them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}