{
  "id": "topic_5397809",
  "title": "Question:",
  "author": "tokeweed",
  "created_time": "May 08, 2022, 09:12:13 PMLast edit: June 01, 2022, 03:40:28 PM by tokeweed",
  "content": "Here's the monthly chart.  It's pretty clear that it is not looking good rn but then again we've seen these spots with BTC before a lot of times when it all looks bad til it's not.  You guys think the bulls will come back at least for this month and get the price to go above at least 40k again or are we in bear territory?  I see some people in these parts saying we're not in a bear market yet.  But dunno..  would like to hear from them again.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5397809",
  "comments": [
    {
      "author": "palle11",
      "created_time": "May 08, 2022, 09:28:58 PM",
      "body": "At $34,250 price still looking bear and the candle dropping and continuing bear. A spike is what may turn this up back but since last week it has been dropping consistently from $38,000. I can't say what is responsible for this drop but I believe it is looking to drop more in days to come until it gets to a level when strong hands will come up because of buying cheap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "May 09, 2022, 02:56:43 AM",
      "body": "The price still seems kinda high to me (like we should still be considering ourselves to be in a bull market). We've been around this area for quite a while and I don't think much has changed. I didn't expect up to reach 40k the last time we did and if we keep ranging between about 30k-40k (+/- a few k) then I think the price is pretty stable and strong.We didn't have a blow off top this time either, we had a top that was reached twice and exceeded the second time. We have economic uncertainty to compete with this time too (2 years ago at the start of the pandemic, we crashed down to $3k)...I think this is more a case of waiting for a strong break in either direction and either waiting for that to enter or just holding tight with what you have.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "May 09, 2022, 03:07:37 AM",
      "body": "We had basically 6 weekly bearish candles in a row, this only happened twice in bitcoins history. Most likely this week will end bullish. However anything is possible.We are approaching the yearly low, most likely we will get some bounce out of this level, perhaps close the week bull however the global sentiment is very bad right now and who knows what will actually take place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "May 09, 2022, 03:08:21 AM",
      "body": "Quote from: tokeweed on May 08, 2022, 09:12:13 PMYou guys think the bulls will come back at least for this month and get the price to go above at least 40k again or are we in bear territory?High probability of not seeing any bulls this month. This is indeed bears' territory. Bitcoin continues dropping sharply right now towards 32,000$ price range like we haven't seen since the beginning of the last bull run which took bitcoin to its ATH (middle of 2021). This is a dangerous zone to enter which can take investors' confidence away for now. Panic selling is also possible at this point.I suggest everyone to not rely on their crypto investments from now on for anything they are going to need soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "May 09, 2022, 04:29:14 AM",
      "body": "I voted No.Obviously, the price is going down hard in the last couple of weeks, although at the end of April we see some good movement and we thought that May will be a good month. Unfortunately, it's worst that we though. And with that said, this month might be the start of the bearish cycle, I mean the price is fluctuating, bouncing back to almost $50k. But this month is very different, we might see the price hovering around <$32k or even lower than that at the end of the month.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "May 09, 2022, 04:58:05 AM",
      "body": "I voted again no idea similar to last month's sentiment poll. I want to agree with @adaseb where statistics implies that the next weekly candle will be a green candle, however, where the world presently is, we cannot be certain anymore. China might invade Taiwan, UST might depeg, Elon might dump or Saylor might be liquidated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "May 09, 2022, 05:08:05 AM",
      "body": "In May? Most probably not because even if the market manipulation stopped right now and price didn't drop more, it would still take a long time for the same weak hands who have been panic selling to regain confidence and stop panic selling* and for price to go above $40k.For now we are going to continue seeing the struggle specially as the weak Western economy slowly falls apart.* The problem with panic sell is that even if it is no longer happening, it could resume when price goes a little higher because some newbies are waiting for a little rise to panic sell so for example if price were to recover from $35k to $38k these newbies would start their panic sell and prevent the momentum from shaping which is why I think it takes longer than that for their effects to go away.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "May 09, 2022, 05:46:29 AM",
      "body": "Quote from: tokeweed on May 08, 2022, 09:12:13 PMHere's the monthly chart.  It's pretty clear that it is not looking good rn but then again we've seen these spots with BTC before a lot of times when it all looks bad til it's not.  You guys think the bulls will come back at least for this month and get the price to go above at least 40k again or are we in bear territory?  I see some people in these parts saying we're not in a bear market yet.  But dunno..  would like to hear from them again. Probably we will stay this low even in the coming month as 2nd quarter mostly the dumping season and this has been listed for years.But what we wanted to know is how hard this can fall and how hard we can wait.Maybe for the next couple of quarter? But i do believe that 4th quarter will bring significant and will make many of us worth of waiting .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wind_FURY",
      "created_time": "May 09, 2022, 10:22:59 AM",
      "body": "Quote from: jackg on May 09, 2022, 02:56:43 AMThe price still seems kinda high to me (like we should still be considering ourselves to be in a bull market). We've been around this area for quite a while and I don't think much has changed. I didn't expect up to reach 40k the last time we did and if we keep ranging between about 30k-40k (+/- a few k) then I think the price is pretty stable and strong.We didn't have a blow off top this time either, we had a top that was reached twice and exceeded the second time. We have economic uncertainty to compete with this time too (2 years ago at the start of the pandemic, we crashed down to $3k)...I think this is more a case of waiting for a strong break in either direction and either waiting for that to enter or just holding tight with what you have. The United States' next narrative during the second quarter will be \"We're in a recession!\" causing markets to tumble and crash, and it will take everything with it. That announcement will be on June.Plus from the current price movement, there's more than 50% probability Bitcoin will crash to the 200-weekly SMA line in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "May 09, 2022, 11:29:54 AM",
      "body": "Probably going back down a bit more or a steady movement. The sentiment is rather negative right now especially after it dropped down from that recovery from the initial bearish impression it gave that let the price reach almost below $30k. We're still gonna see a lot of struggling for the month, I reckon we would only really see a recovery by the last quarter of the year. We might see it go up as a recovery, but I don't think it's going to stay there that long, the market would still probably stay at the current range.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tokeweed",
      "created_time": "May 09, 2022, 09:31:32 PM",
      "body": "Quote from: pooya87 on May 09, 2022, 05:08:05 AMIn May? Most probably not because even if the market manipulation stopped right now and price didn't drop more, it would still take a long time for the same weak hands who have been panic selling to regain confidence and stop panic selling* and for price to go above $40k.For now we are going to continue seeing the struggle specially as the weak Western economy slowly falls apart.* The problem with panic sell is that even if it is no longer happening, it could resume when price goes a little higher because some newbies are waiting for a little rise to panic sell so for example if price were to recover from $35k to $38k these newbies would start their panic sell and prevent the momentum from shaping which is why I think it takes longer than that for their effects to go away.^  Yup sell the bounce.  And it's not just the 'newbies' and regular guys like us.  A lot f traders with stuck longs will be taking it as a chance to get off BTC too and hold most of the stuff in their accounts in fiat too.  It's just the nature of the beast and you gotta admit it's really the right move.  I mean if they're just here to trade and make some money...  Which they are.  Lol.Anyway yeah, it's better now than later.  It was all going to happen eventually anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "May 09, 2022, 11:13:44 PM",
      "body": "Quote from: Wind_FURY on May 09, 2022, 10:22:59 AMQuote from: jackg on May 09, 2022, 02:56:43 AMThe price still seems kinda high to me (like we should still be considering ourselves to be in a bull market). We've been around this area for quite a while and I don't think much has changed. I didn't expect up to reach 40k the last time we did and if we keep ranging between about 30k-40k (+/- a few k) then I think the price is pretty stable and strong.We didn't have a blow off top this time either, we had a top that was reached twice and exceeded the second time. We have economic uncertainty to compete with this time too (2 years ago at the start of the pandemic, we crashed down to $3k)...I think this is more a case of waiting for a strong break in either direction and either waiting for that to enter or just holding tight with what you have. The United States' next narrative during the second quarter will be \"We're in a recession!\" causing markets to tumble and crash, and it will take everything with it. That announcement will be on June.Plus from the current price movement, there's more than 50% probability Bitcoin will crash to the 200-weekly SMA line in my opinion.And also the ECB are looking to increase interest rates in the Eurozone in June orJuly followed by potentially 2 more this year to try and curb rising inflation, thatsgonna hit the markets which in turn will hit Bitcoin market.Quote from: tokeweed on May 09, 2022, 09:31:32 PMQuote from: pooya87 on May 09, 2022, 05:08:05 AMIn May? Most probably not because even if the market manipulation stopped right now and price didn't drop more, it would still take a long time for the same weak hands who have been panic selling to regain confidence and stop panic selling* and for price to go above $40k.For now we are going to continue seeing the struggle specially as the weak Western economy slowly falls apart.* The problem with panic sell is that even if it is no longer happening, it could resume when price goes a little higher because some newbies are waiting for a little rise to panic sell so for example if price were to recover from $35k to $38k these newbies would start their panic sell and prevent the momentum from shaping which is why I think it takes longer than that for their effects to go away.^  Yup sell the bounce.  And it's not just the 'newbies' and regular guys like us.  A lot f traders with stuck longs will be taking it as a chance to get off BTC too and hold most of the stuff in their accounts in fiat too.  It's just the nature of the beast and you gotta admit it's really the right move.  I mean if they're just here to trade and make some money...  Which they are.  Lol.Anyway yeah, it's better now than later.  It was all going to happen eventually anyway.We almost hit $31k today, we might get a bounce alright which I'm sure there are a lot of people waiting for it to take advantage of before a further dip to follow. Sowhile a bounce is probable, going over $40k is a big ask in this current climate and$40k is a big sell off target IMO.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "May 09, 2022, 11:37:12 PM",
      "body": "If you take a look at last month's candle (monthly) it's very awful and worst.That's why I believe we experienced this huge dump at the start of the month of May. But the good thing here is that there is very huge support around $28,000 - $30,000 which for me I believe that there are a lot of buy orders lining up in that level.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "May 10, 2022, 12:08:05 AM",
      "body": "Quote from: pooya87 on May 09, 2022, 05:08:05 AMIn May? Most probably not because even if the market manipulation stopped right now and price didn't drop more, it would still take a long time for the same weak hands who have been panic selling to regain confidence and stop panic selling* and for price to go above $40k.For now we are going to continue seeing the struggle specially as the weak Western economy slowly falls apart.* The problem with panic sell is that even if it is no longer happening, it could resume when price goes a little higher because some newbies are waiting for a little rise to panic sell so for example if price were to recover from $35k to $38k these newbies would start their panic sell and prevent the momentum from shaping which is why I think it takes longer than that for their effects to go away.Exactly. Honestly, before this dive I was predicting to remain in the £30k-£35k range for the remainder of the year, and I think this recent dive has reinforced my prediction in that. Even if I was wrong in my reasoning's prior to this dive, I do believe we often underestimate the faith that is lost by those that are entering the market, simply to buy, and sell quickly aiming to sort of get rich quick. I think that's been a common occurrence of each rise, and drop Bitcoin has had. The thing is, whenever something like this happens the people around me always point out the fact that Bitcoin has finally burst, then when we do eventually recover (which hasn't been a awful amount of time in the past) they go rather quiet, and just wait for their next opportunity. The thing is though, the constant volatility we're seeing is actually quite good for speculative investors, since they can actually make a lot of money. It's probably one of the most unique investment opportunities, because if you truly believe in Bitcoin, then you probably are quite confident that it'll recover.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "May 10, 2022, 01:19:23 AM",
      "body": "It cannot be denied. We are in deep bear shit right now. I don't think somebody would still insist that we are still currently in a bull market. The price has been falling terribly hard and there seems to be no support strong enough to somehow delay further more dips. I am now becoming more and more realistic when some people predict a fall to the $20,000 level. I'm afraid this is it. This is the bear season everybody is afraid of. The market would once again shake the weak hands.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "May 10, 2022, 03:11:30 AM",
      "body": "Quote from: Fundamentals Of on May 10, 2022, 01:19:23 AMIt cannot be denied. We are in deep bear shit right now. I don't think somebody would still insist that we are still currently in a bull market. The price has been falling terribly hard and there seems to be no support strong enough to somehow delay further more dips. I am now becoming more and more realistic when some people predict a fall to the $20,000 level. I'm afraid this is it. This is the bear season everybody is afraid of. The market would once again shake the weak hands. Yes, I already said when we entered this year 2022 that I was pessimistic and that I thought the best of this cycle was over, as there were still people predicting that we were in a somewhat delayed cycle and that we were going to surpass $100k this year.If things are the way they are, despite having positive news specific to Bitcoin, I don't want to think how they can get if we have negative news.The only thing I see that is negatively affecting Bitcoin is the general economic situation with inflation and rising rates, which has also affected the stock market and most assets. If we had news like the mining ban in China last year now we would be in deep shit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "May 10, 2022, 03:28:47 AM",
      "body": "Today bitcoin had a bad day for 2 reasons1) Stock sell off especially the tech nasdaq index2) UST Luna peg started to drop all the way from $1 to $0.60 and spooked investors because it’s backed by BTC reserves and those reserves started to move.So the BTC would be sold to keep the peg at 1:1. No idea if they were sold yet. However someone is dumping large amounts of UST on all exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "May 10, 2022, 03:47:22 AM",
      "body": "Quote from: tokeweed on May 09, 2022, 09:31:32 PMyou gotta admit it's really the right move.It's hard to say.For a short term trader that does hundreds of trades every day, it is a very good move. In fact the high volatility is always best for them.For others the \"good move\" would have bee selling long before the price came this low instead of taking a much bigger risk of selling inside the dip after the price went about 60% below ATH.Also the \"better move\" would be to start buying the dip instead of selling in the dip!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tokeweed",
      "created_time": "May 16, 2022, 03:48:20 PM",
      "body": "^  While I agree that dip buying could be a good strategy to build a stack but just not with the market conditions like we're having now.  It's perfect during huge and somewhat long bull runs like we had from mid 2020 - mid 2021 but not right now when it's so possible there's another dip to the dip to the dippity dip.  Lolol.    I mean who knows how long the bear market would really be this time around.  I do hope it's short tho.Oh and it looks like some guys are making a thing out of the 7 weekly red candles will make the next candle surely green.  I don't think so...  It could but all it's really showing is how strong the down trend is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}