{
  "id": "topic_5403797",
  "title": "darxiaomi",
  "author": "darxiaomi",
  "created_time": "June 23, 2022, 05:10:28 PM",
  "content": "WHY ITS SO POSITIVE THIS BEARMARKET.  Well i made this thread to show to you why i feel confident in this bear market.I feel so confident because we need this bear market and lets me explain why.1-   We need to clean of the market all the shitcoins. We cant have a market with thousands of coins and tokens and the mayoriti of them only go up because the market its bullish. That its clearly not healthy.2-   Clean the child and Young thoughts, i think the crypto world has a very childish way of thinking, lets see an example.“Oh i buy that coin because Elon say”“ oh i want to leverage per 1000 because i read in a web that token its to the moon”“Take loans for a presentiment”Take loans because the market is bullish and understimate the market.How the fuck you can think in over 10000 coins all have to has value? WAKE UP.Its like i said all the FIAT currencies has high value its a non sense.3-   Clean all the corporations and new companies with this mindset. As i said, why we have to pay for idiots movements made by idiots. Like Terra (i know maybe its a Scam but lets take another point of view ). Or if the Celsius position if that was true.4-   CLEAN the trading boys, and for me this its one of the most important things.And when i said this im not saying you cant trade, but i refered to the boys who want to make money in short times and takes with they the childish way of thinking and also all the tricks of the traders. One of the worst its the “stop loss”. Because that tool produces a cascade in the Price, clearly affecting us when we are holding.This tool make a ton of auto-sells if the Price go below and with that a cascade keep producing and the big player can make a huge profit and destroying the price.After we pass this storm we can have a much better financial ecosystem in crypto.A more healthy one, i thin the NFTs made a lot of damage to the ecosystem carrying with him more and more childish thinking boys. And this was a short Little of time after the another wave of damage received by the so called “play to earn”.Again dont missundestand me, im not opposing against this things but yes against the wave of idiots they carry.After this negative i show you some positives.Every time we hit a bear market here in crypto always was a step ahead.In the first nobody talks a loto f Bitcoin and was marginal.In the second , small investors and some snoobs invest, and some press take an eye.In 2018 we have more serious investors and more press coverage.And now we have a lot more serious investor, companies, investment funds.As you can see we are ever growning and now we are maturing, we keep growing but like a human now we reach some height and we are cleaning the body of all the shit we do in our adolescence.In human terms, crypto market maybe has 25 years old.Disclaimer: Sorry if my semantic its not good, im not a native speaker.Disclaimer 2 : Im not a maximalist.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403797",
  "comments": [
    {
      "author": "Rruchi man",
      "created_time": "June 23, 2022, 06:56:30 PM",
      "body": "It is good that you have found reasons to stay positive and console yourself in these times, not many can do so and choose to see the positive even when their current situation is not going well. I particularly like thisQuote from: darxiaomi on June 23, 2022, 05:10:28 PM1-   We need to clean of the market all the shitcoins. It is true that there are many shitcoins currently in the market and not many will survive the bear market, but what is the assurance that more shitcoins will not just spring up again when the market becomes normal again?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darxiaomi",
      "created_time": "June 23, 2022, 08:05:55 PM",
      "body": "Quote from: Rruchi man on June 23, 2022, 06:56:30 PMIt is good that you have found reasons to stay positive and console yourself in these times, not many can do so and choose to see the positive even when their current situation is not going well. I particularly like thisQuote from: darxiaomi on June 23, 2022, 05:10:28 PM1-   We need to clean of the market all the shitcoins. It is true that there are many shitcoins currently in the market and not many will survive the bear market, but what is the assurance that more shitcoins will not just spring up again when the market becomes normal again?Yes, you have a point. But i think its become less and less shitocins after a big clean up, because nobody wants again to put money in such proyects. Obviusly we cant clean the whole market but we can cut some of the weeds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "June 23, 2022, 08:16:01 PM",
      "body": "Quote from: darxiaomi on June 23, 2022, 05:10:28 PM4-   CLEAN the trading boys, and for me this its one of the most important things.And when i said this im not saying you cant trade, but i refered to the boys who want to make money in short times and takes with they the childish way of thinking and also all the tricks of the traders. One of the worst its the “stop loss”. Because that tool produces a cascade in the Price, clearly affecting us when we are holding.You made some points which I personally understand, but some other points, I don't really understand, like the one I quoted above, Now let's break it down. QuoteCLEAN the trading boys, and for me this its one of the most important things.OK......Am listening. QuoteAnd when i said this im not saying you cant tradeOK, then what are you saying?, make me understand cus am kind of lost here. Quotebut i refered to the boys who want to make money in short times What is the essence of trading in the place? Is it not to make some quick money? And besides, there are professional traders, who trading is their job, it's through trading they earn money for livelihood, why do you want to take food out of their mouth? Quoteand takes with they the childish way of thinking and also all the tricks of the traders. LOL, everything in this life requires you apply some kind of trick to succeed, right?, just like you don't buy Bitcoin or any other altcoin carelessly, you first strategize, analyze the market, do some research, monitor the price movements first, wait for a good entry point before finally buying(doing this also is a trick), so also it is with trading, just like you are investing to make profit, so also a trader is trading to make profit, just as you employ tricks in order to buy at the best price that will guarantee you profit in the future, so also a trader need to employ tricks to be able to profit from the market at that moment. QuoteOne of the worst its the “stop loss”. Because that tool produces a cascade in the Price, clearly affecting us when we are holding.It's a lie and a misconception on your path, stop loss is not the reason why asset prices fall.For example, you set a stop loss at a lower price from what the market price is, if your stop loss is triggered, it means the price of the asset in question was already falling and it hit your stop loss on its way down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darxiaomi",
      "created_time": "June 23, 2022, 08:33:25 PM",
      "body": "Well seems like you are a trader, good for you.Its not a missconception when we have a lot of idiots with leverage and the bigs knowing this the stop loss cascade can destroy a lot of value.They can buy so low because of that. Obviusly you always have tricks but when you are addicted to them you go down.I dont know what its your point, im against the traders of 1 hr / 1 day / 1 week. Its not healthy , its the same in conventional markets. You can be a Warren Buffet or be an idiot operating 24/7. You know the phrase \" Wall street wins money when you operate and lose when you dont\".If you trade 24/7 you are not a liberty financial dude, you are one more slave.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "June 23, 2022, 08:51:34 PM",
      "body": "Quote from: darxiaomi on June 23, 2022, 08:33:25 PMWell seems like you are a trader, good for you. I can categorically, with all honesty and sincerity, tell you that I am not a trader, atleast, not yet, but I do understand all the rudiments to trading. And I also understand, and can tell you that traders/trading has very little to nothing to do with the market condition of any asset in terms of price. Quote If you trade 24/7 you are not a liberty financial dude, you are one more slave.I disagree with you, if it's what i choose to do, and I am not doing it for anyone or cus of anyone, and I choose to do it 24/7, everyday because I love and enjoy doing it, then that is not slavery but freedom.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Genamant",
      "created_time": "June 24, 2022, 03:27:22 PM",
      "body": "Quote from: darxiaomi on June 23, 2022, 05:10:28 PMWHY ITS SO POSITIVE THIS BEARMARKET.  Well i made this thread to show to you why i feel confident in this bear market.I feel so confident because we need this bear market and lets me explain why.1-   We need to clean of the market all the shitcoins. We cant have a market with thousands of coins and tokens and the mayoriti of them only go up because the market its bullish. That its clearly not healthy.2-   Clean the child and Young thoughts, i think the crypto world has a very childish way of thinking, lets see an example.“Oh i buy that coin because Elon say”“ oh i want to leverage per 1000 because i read in a web that token its to the moon”“Take loans for a presentiment”Take loans because the market is bullish and understimate the market.How the fuck you can think in over 10000 coins all have to has value? WAKE UP.Its like i said all the FIAT currencies has high value its a non sense.3-   Clean all the corporations and new companies with this mindset. As i said, why we have to pay for idiots movements made by idiots. Like Terra (i know maybe its a Scam but lets take another point of view ). Or if the Celsius position if that was true.4-   CLEAN the trading boys, and for me this its one of the most important things.And when i said this im not saying you cant trade, but i refered to the boys who want to make money in short times and takes with they the childish way of thinking and also all the tricks of the traders. One of the worst its the “stop loss”. Because that tool produces a cascade in the Price, clearly affecting us when we are holding.This tool make a ton of auto-sells if the Price go below and with that a cascade keep producing and the big player can make a huge profit and destroying the price.After we pass this storm we can have a much better financial ecosystem in crypto.A more healthy one, i thin the NFTs made a lot of damage to the ecosystem carrying with him more and more childish thinking boys. And this was a short Little of time after the another wave of damage received by the so called “play to earn”.Again dont missundestand me, im not opposing against this things but yes against the wave of idiots they carry.After this negative i show you some positives.Every time we hit a bear market here in crypto always was a step ahead.In the first nobody talks a loto f Bitcoin and was marginal.In the second , small investors and some snoobs invest, and some press take an eye.In 2018 we have more serious investors and more press coverage.And now we have a lot more serious investor, companies, investment funds.As you can see we are ever growning and now we are maturing, we keep growing but like a human now we reach some height and we are cleaning the body of all the shit we do in our adolescence.In human terms, crypto market maybe has 25 years old.Disclaimer: Sorry if my semantic its not good, im not a native speaker.Disclaimer 2 : Im not a maximalist.to make it simple, it's inevitable to have bear seasons and it's okay. It just proves that the crypto market is a healthy market.nothing goes straight up and of course nothing goes straight down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fiulpro",
      "created_time": "June 24, 2022, 04:41:44 PM",
      "body": "These points are definitely good but I do think that you should understand that this market is extra beneficial for Trading, it would make way for other investments and also it would give people a chance to hold their coins on for long but what's important is to note how long this would go on for. If that works for the whole year people might definitely loose interest there are still some coins on the market hitting +30% which to be absolute honestly is weird to see since this is making way for more varied investment opportunities. Rest there would always be an influence on the market from very rich and the powerful people that's what being in a decentralized market with almost half being held my whales means.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "June 24, 2022, 04:48:17 PM",
      "body": "I quite agree with Fivestar4everMVP's analysis. What I see is that you are trying to find arguments to be optimistic at this time, and, well, you can always find something, but I would rather be with the price at $222k as some predictions for this time were giving, even if that meant that some shitcoins would survive instead of being cleaned by the market.The height of exaggeration is the \"so\":Quote from: darxiaomi on June 23, 2022, 05:10:28 PMWHY ITS SO POSITIVE THIS BEARMARKET.  For next time, an analysis without exaggeration and without so much emotion in between the lines will suit you better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "June 24, 2022, 06:33:40 PM",
      "body": "I am not thrilled with what's going on, but viewing it as a positive thing is IMO better than panic selling, so good job, op. As for the points you're making,1. I don't think it'll clean the market from shitcoins, as previous bear market didn't succeed in that. While some will effectively die, many will probably rise again, especially if influencers like Elon Musk get involved.2. Maybe it will sober people up, but then again I believe hype over some shitcoin is possible in the future, so I don't think everyone will learn the lesson.3-4. Companies and traders don't care if it's a shitcoin or not, a bubble or not, as long as they can profit from it and jump off the train in time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "June 24, 2022, 09:17:14 PM",
      "body": "Simply the bull market is going to be the next which summarize everything right?Bear market is really a pain for the people and an opportunity for the people who have funds and can be risked to reap profits in the next couple of years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "June 24, 2022, 09:29:37 PM",
      "body": "Quote from: Findingnemo on June 24, 2022, 09:17:14 PMSimply the bull market is going to be the next which summarize everything right?Bear market is really a pain for the people and an opportunity for the people who have funds and can be risked to reap profits in the next couple of years.Not all are happy with bear market since many are still losing money and this is the normal scenario in cryptomarket, not everyone can be a winner here. Bull market will still happen, its just a matter of time so if you have extra and still believe in cryptocurrency, you can start buying now even on a small amount of money, at least you still able to buy at a cheaper price and just hold it. Hopefully, bear market will start to slowdown so we can now start the recovery, but for sure it will take time before we reach the peak again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "June 24, 2022, 10:52:30 PM",
      "body": "It's always like this during the bear market, there's the popular term of \"shaking the weaklings\" and this isn't just for the investors but also for the projects.Projects that have became popular during the bull run is likely can no longer be the same as good it was before. And if the bull run comes again, there will be another trend, new sets of investors that have just looked upon to the success stories shared to them without really knowing if the market they're taking is bearable, tolerable or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "June 24, 2022, 11:10:54 PM",
      "body": "Quote from: jossiel on June 24, 2022, 10:52:30 PMIt's always like this during the bear market, there's the popular term of \"shaking the weaklings\" and this isn't just for the investors but also for the projects.Projects that have became popular during the bull run is likely can no longer be the same as good it was before. And if the bull run comes again, there will be another trend, new sets of investors that have just looked upon to the success stories shared to them without really knowing if the market they're taking is bearable, tolerable or not.sometimes this kind of season is good, so the crappy projects will be gone for good. because if the motive of the dev team is just to pocket money, we will see how their plans go. usually, they won't move forward but just to give empty talks or promises. but if the project is sincere and really wants to implement their goals, you will see that even if it is bearish period, they are working. so yeah, better for these crap projects to abandon their platform so they won't be screwing more people in the long run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "June 25, 2022, 03:33:22 AM",
      "body": "Of course, there's always a silver lining. One of the most common positive comments that I hear during bear markets is that people would once again focus on the technology. When the price is always in green, people would only look at Bitcoin in terms of its fiat value. The influx of new Bitcoin supporters may be huge but they are usually only after the price growth. They don't really mind the features that made Bitcoin what it is. So a bear market such as this happening every now and then is also greatly appreciated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "June 25, 2022, 05:58:20 AM",
      "body": "No matter what, its good to see you find the bear market to be positive for the industry. Most of the time people see it positive when they make money out of it. If they didn't sell the last time the market did the bull run, they may still regret not selling. But in general bear market always makes the whales happy since they  are the ones going to benefit more after they buy the bottom with the profit they made. Just to make everyone feel the same way as positive as you are, Bear Market always means another ATH when the market is bullish again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "June 25, 2022, 09:26:43 AM",
      "body": "Quote from: AmoreJaz on June 24, 2022, 11:10:54 PMQuote from: jossiel on June 24, 2022, 10:52:30 PMIt's always like this during the bear market, there's the popular term of \"shaking the weaklings\" and this isn't just for the investors but also for the projects.Projects that have became popular during the bull run is likely can no longer be the same as good it was before. And if the bull run comes again, there will be another trend, new sets of investors that have just looked upon to the success stories shared to them without really knowing if the market they're taking is bearable, tolerable or not.sometimes this kind of season is good, so the crappy projects will be gone for good. because if the motive of the dev team is just to pocket money, we will see how their plans go. usually, they won't move forward but just to give empty talks or promises. but if the project is sincere and really wants to implement their goals, you will see that even if it is bearish period, they are working. so yeah, better for these crap projects to abandon their platform so they won't be screwing more people in the long run.Actually, it's a good season.The negativity or the positivity of the season and situation will base on how you foreseeing things. If this bear market is such a good opportunity for you to have more, it's positive.But if your outlook is that it's actually a negative season then so be it but you have the idea that this won't be forever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "June 25, 2022, 09:44:54 AM",
      "body": "Quote from: Johnyz on June 24, 2022, 09:29:37 PMNot all are happy with bear market since many are still losing money and this is the normal scenario in cryptomarket, not everyone can be a winner here. Bull market will still happen, its just a matter of time so if you have extra and still believe in cryptocurrency, you can start buying now even on a small amount of money, at least you still able to buy at a cheaper price and just hold it. Hopefully, bear market will start to slowdown so we can now start the recovery, but for sure it will take time before we reach the peak again.The losing money part is depend on the holder itself whether he's weak hands or strong hands, if he's weak hands then he already sold his coins and you're correct he's lose his money. While the strong hands still hold until now even he bought at the higher price, but he's not lose as long as he not sell his coins since this can be said as unrealized loss. Most of people buy Bitcoin is using all of his money, not afford to lose money. This is why they're panic and no have any money left to buy the dip.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "June 25, 2022, 10:51:11 AM",
      "body": "Everything in the world always repeats itself, sooner or later. Those who followed Elon, shouting about his every step, will behave in the same way if they have another leader. This is the psychology of the crowd. Read Freud. But there are always units that go their own way. The OP is probably an individualist; he does not cry when he falls and is calm about growth. Experience is important here, which is sincerely lacking for those who are in a hurry to buy, copying the actions of others, and are also seized by greed. And then he complains about the fall, not fully understanding that sooner or later, his losses, if he is patient, will turn into profit again. Do not fuss, but it is better to calculate each of your financial steps more deeply.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "traderethereum",
      "created_time": "June 25, 2022, 11:18:13 AM",
      "body": "Quote from: Findingnemo on June 24, 2022, 09:17:14 PMSimply the bull market is going to be the next which summarize everything right?Bear market is really a pain for the people and an opportunity for the people who have funds and can be risked to reap profits in the next couple of years.I guess it will depend on each person because if they can sell the asset at the right time, they will have more funds and can use them to buy other potential coins.But if they don't sell their coins during the bull market and don't have the funds to buy when the bear market comes, they will surely regret it.That is why we must really be able to take advantage of the time we have, know what to do, and adapt to the existing situations and conditions.In today's time, we have a good time buying potential coins but be careful that not all are good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}