{
  "id": "topic_5477941",
  "title": "_act_",
  "author": "_act_",
  "created_time": "December 14, 2023, 10:05:45 PM",
  "content": "I saw the tweet today. Making it sound like it is noncustodial wallet fault. This is the tweet:Quote from: https://twitter.com/Ashcryptoreal/status/1735292085303906594?t=BGm-iRTJgVcJTgR_HXCAEQ&s=19I put money in the bank - Banks going bankrupt. I put money in crypto exchange - The crypto exchanges going bankrupt I put money in defi wallets - Fcking defi wallets getting hacked I put my money on offline wallet - NOW FCKING LEDGER GETTING DRAINEDI think he is a rich person. But I am disappointed that people like him is still using Ledger Nano wallet which is not a wallet that people should advise anyone to use. Ledger wallets are full of flaws. I am expecting another flaw again but some people will not listen until they are affected. I will like to say that DeFi, DAO, Dapps and other innovations are just another way to give scammers privilege to do their work.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477941",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "December 14, 2023, 10:29:39 PM",
      "body": "I think you shouldn't use a hardware wallet like Ledger because it is a closed source.Even if you warn people to stay away from using this wallet they won't listen until they experience these vulnerabilities.There is no safe wallet if you keep your device connected to the internet hackers and scammers nowadays are smart and they are growing to develop new ways and programs just to steal funds.So it's not always great to have a 3rd party hardware wallet like a ledger or any hardware wallet except for a cold storage wallet or air gap wallet it's safer than a hardware wallet that needs to be connected to an online PC to interact with Defi and dApps.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "December 14, 2023, 11:12:32 PM",
      "body": "There is some hacks that happened with the dApps and it was a wrong timing if he just did it and got his money swept by those hackers.Quote from: _act_ on December 14, 2023, 10:05:45 PMI will like to say that DeFi, DAO, Dapps and other innovations are just another way to give scammers privilege to do their work.Too many incidents before that has involved DeFi hacks, DAO, dApps, etc. And they're also have a lot of flaws and they're just making it look like that these hacks are attacked but don't say that they're like internal and intended attacks for an exit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "December 15, 2023, 03:12:35 AM",
      "body": "Quote from: _act_ on December 14, 2023, 10:05:45 PMQuote from: https://twitter.com/Ashcryptoreal/status/1735292085303906594?t=BGm-iRTJgVcJTgR_HXCAEQ&s=19I put money in the bank - Banks going bankrupt. I put money in crypto exchange - The crypto exchanges going bankrupt I put money in defi wallets - Fcking defi wallets getting hacked I put my money on offline wallet - NOW FCKING LEDGER GETTING DRAINEDIt seems this man did not learn anything from his losses. Not all banks go bankrupted. Not all centralized exchanges go bankrupted. Not all DeFi platforms are exploited and same for wallets.He must diversify the ways and methods he stores his capital. Diversify into different banks, centralized exchanges, wallets and always avoid to store money on centralized platforms. If storing money on centralized platforms, don't store all money there and in a single business company.Ledger is a hardware wallet but there are other hardware wallets too and there are open source ones. He can diversify his cryptocurrency storage in different hardware wallets.[LIST] Open Source Hardware Wallets",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "December 15, 2023, 04:28:45 AM",
      "body": "The problem of this case is trustingness, he always trust with someone behind the tool he used, so to overcome this he need to built by himself.Of course this need a high knowledge because if you don't know what you're doing, your wallet will not be completely safe. Self created cold storage is the most safest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ruttoshi",
      "created_time": "December 15, 2023, 09:16:14 AM",
      "body": "Ledger has been confirmed to have a back door which will enable them have access to customer bitcoin in the wallet.Quote\"The bombshell here is the explicit confirmation that *Ledger themselves* hold the master decryption key for *all Ledger Recover users*.Your seed is encrypted using their key and not your own, so they always hold the ability to decrypt your seed from shards.\"@sethforprivacyThe man is just unfortunate to be a victim to all that he mentioned.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tajimas",
      "created_time": "December 15, 2023, 12:41:13 PM",
      "body": "Quote from: _act_ on December 14, 2023, 10:05:45 PMLedger wallets are full of flaws. I am expecting another flaw again but some people will not listen until they are affected. I will like to say that DeFi, DAO, Dapps and other innovations are just another way to give scammers privilege to do their work.DeFi projects with low secured protection suffered so many uncountable hacks this year, a lot of victims felt frustrated from this hack and it's really sucks.The question here, how will you know a DeFi platform is highly govern with high security standards, even big centralized exchange got hacked couple of years ago, what to 100% completely trust at this moment, nothing to think.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}