{
  "id": "topic_5454022",
  "title": "sokani",
  "author": "sokani",
  "created_time": "May 25, 2023, 05:48:04 PMLast edit: August 23, 2024, 08:41:42 AM by sokani",
  "content": "Translated Topic in Pidgin Language: Bitcoin: De dream of Cypherpunks, libertarians and crypto-anarchistsOriginal Topic: The dream of Cypherpunks, libertarians and crypto-anarchistsAuthor: GazetaBitcoinRelief representing Romans paying taxex || Image source: historyhit.comGoverns don dey oppress piple for centuries. One of de first form of such oppression bin start during de Roman Empire, 2000 years ago. Time don pass but dis practice still dey exist. De method plenty and e include direct taxes, indirect taxes, inflation, censoring access to information, indictments, prohibition, slavery, unfair trials, collecting personal information and to use am against honest piple. However, all dis dey lead to de same supreme goal: de pawa need to stay in de hands of de elites, and de poor need to work for de benefit of de elites. Piple bin fight back, but nothing com out for de fight most times. Dis epic battle wey last since ancient time Murray Rothbard best describe am as \"de great conflict wey dey eternally waged between Liberty and Pawa\".One way to obtain freedom and liberty na thru private money, but governs no fit gree wit dat kind competition. And d governs get monopoly over minting coins since de Roman Empire. However, piple desire for private money bin start centuries ago and history tell us in many occasions say private money exit in various forms. De illustrious economist and philosopher Friedrich August Von Hayek, winner of Nobel in Economic Sciences in 1974, bin raise a very legitimate debate for him masterpiece  Denationalization of Money: De Argument Refined: \"[...] No fit understand why piple go put up for so long with government to dey exercise an exclusive pawa for over two thousand years to regularly exploit and defraud dem\". Anoda emblematic figure wey sustain de need for private money na Murray Rothbard.Between 1700 and 1900 various private coins bin circulate in de United States. De first private coin for US history na de Higley Copper coin, wey Higley family bin mint for 1773. Maybe de most popular ones na de Bechtler gold coins (first issued in 1831) dem be know am becus e get greater purity dan de coins wey de state issue. De San Francisco company Moffat&Co bin also write a page of history about de gold rush, and their minted coins. One of de most wanted coin na de Brasher Doubloon, wey Ephraim Brasher bin mint in 1787. Oda notable private minted coins to mention na: Morgan Dollars, Saint-Gaudens Double Eagles, Barber Quarter. Of course, de govern no agree with de private mints but wetin dey certain be say at various points in time de private minted money bin exist. Piple bin use dis coins at large scale, no mata de state efforts to shut dem down.Libertarianism and anarchismMurray Rothbard || Image source: fee.org“I define anarchist society as one wey no get legal possibility for coercive aggression against de person or property of any individual” -- Murray RothbardYears don pass and de state still dey ban private money thru any means possible. De oppression dey grow even stronger. But piple desire for liberty don become stronger as well. In de past, piple bin dey express dis ideas thru liberalism, but later e con change to libertarianism. De first forms of libertarianism bin appear between 18th and 19th centuries. De modern libertarianism, start since 1950 wey great minds bin talk about such as Murray Rothbard, Milton Friedman or Hayek. According to Rothbard, \"De libertarian creed rest upon one central axiom: dat no man or group of men fit show pawa against anoda person or de property of anyone else. Dis na wetin dem call \"nonaggression axiom.\" \"Aggression\" na de initiation or de use of physical violence to threaten person or de property of anyone else. Aggression dey synonymous with invasion\". At large, we fit talk say libertarianism dey focus on individual rights, limitation of de govern, encouragement of free market and peace.One particular side of libertarianism na anarchism. Although dis movement dey more radical, but e still dey individual oriented. Basically, anarchism dey look at a govern-free society, free individuals, wey de law no go fit control, but by free agreements. De \"anarchy\" term itself mean \"absence of government\". However, e no good to associate anarchism with violence: e bin no dey about violence and e no go fit be about violence. One great explanation for dis mata Canadian theoretician L. Susan Brown bin yan about am: \"While de popular understanding of anarchism dey about violence, anti-state movement, anarchism na much more subtle and nuanced tradition dan one simple opposition to government pawa. Anarchist oppose de idea say pawa and dominion dey necessary for society but instead e advocate for more co-operative, anti-hierarchical forms of social, political and economic organisation\".Crypto warsMunition t-shirts, according to US law, originally created by Adam Back || Image source: Twitter\"If privacy dey outlaw, only de outlaws go get privacy\" -- Phil ZimmermannWe leave behind de year 1950 and enter de technology era, ARPANET, de ancestor of Internet, wey bin com out for 1967, microprocessors con spring up base on Moore's law; personal computers (PCs) con launch for 1975; World Wide Web com launch for 1989. Cryptography con dey flourish with Friedman's brilliant mind. But all dis technological developments no dey meant for public (yet): de state con discover one new way of oppression, maybe na de most dangerous one - surveillance. Wey be de continuous process for invading piple privacy. If person dey spy on him neighbour thru de window him go fit face de court of law; if de govern dey spy on de entire nation no problem. If an ordinary person try to find de financial transaction of anoda person dem fit sue am, but if de state want find out all de financial transactions of every person no problem.Technology offer great weapon to de govern and dem start to dey use am to full capacity, in oda to get full control, and mainly thru agencies like NSA. Governs permanent hunger for information about citizens become hunger for big data: each individual dey condition by govern-issued documents. You no fit give birth without govern-issued ID, you no fit get married without govern-issued ID, you no fit die without govern-issued ID, you no fit prove your identity without govern-issued ID, you no fit access hospitals without govern-issued ID and so on. And all de information dey recorded for their database, wey de various arms of de state dey control; and ultimately, na de state dey control am.During dis harsh times, in 1975, Whitfield Diffie bin invent de public-key cryptography wey bring de brilliant tool to de public. De govern bin react, to offer their help to \"keep secure\" piple private keys. Dis neva happen and from dis movement de crypto wars con begin. In 1977, Ron Rivest, Adi Shamir and Leonard Adleman bin invent encryption algorithm; de algorithm bin use de public-key cryptography. NSA next move na to ban public access to Diffie invention and de export encryption algorithms outside de US. NSA director Bobby Inman bin really dey worry becus piple fit access encryption technology, wey for dat time na only government agencies dey use am. One 1993 article from The Wired leak an address wey Inman send for 1979, wey dey warn \"non-governmental cryptologic activity and publication [...] pose clear risks to de national security\". Dem bin consider de encryption algorithms as classified information protected by federal regulations such as ITAR (International Traffic in Arms Regulations, 22 CFR 121-128). Exporting dem fit lead to 10 years in jail. As a response, de public con print small of de RSA code on t-shirts and de agency con warn dem say if dem wear dis kind of shirt wen dem dey travel outside US or export dem, dem go face jail time for \"offenders\", as dis kind of t-shirt na something wey dem consider as \"munitions\". Dose wey dey wear tattoos with RSA algorithm dem consider dem also as first offenders. Maybe na de first time wey de govern fear say dem fit lost control. You fit see dis fear for de address wey Inman issue: \"Sky is falling\".John Gilmore, one brave man, wey stand tall in de front of de agency. De same Wired article quote am emphasizing: \"Show us. Show de public how your ability to violate de privacy of one citizen don prevent any major disaster. Dem dey deny de freedom and privacy of all citizens–to defend us against one bogeyman wey dem no fit explain. De decision to literally trade away our privacy na one wey de whole society suppose make, no be by unilateral decision by one military spy agency.\"Cypherpunks and crypto-anarchy: \"Rebels with a cause\"Front cover of Wired magazine (\"Rebels With a Cause\"), May/June 1993 || Image source: Wired.com\"I dey fascinated by Tim May's crypto-anarchy. Unlike de communities wey dey traditionally associated with de word \"anarchy\", in a crypto-anarchy de government no dey temporarily destroyed but permanently forbidden and permanently unnecessary. Na one community where de threat of violence dey impotent becus violence dey impossible, and violence dey impossible becus de participants no fit dey link to their true names or physical locations.\" -- Wei DaiMake we fast forward to 1992, one group of three code enthusiasts and cryptographers wey Timothy C. May, John Gilmore and Erich Hughes form, discover say all of dem get similar vision about de govern surveillance and censorship. All of dem get deep knowledge about Computer Science. May bin dey work as chief scientist for Intel, Gilmore bin spend two years for Sun Microsystems before starting him own company, while Hughes be programmer and mathematician. Dem begin dey meet for Gilmore office, for San Francisco Bay area, as dem dey try to protect piple privacy thru cryptography. Soon, anoda enthusiast join dem: de hacker Jude Milhon, dem also kno am as St. Jude. She con find a name for de group: by combining de words \"cipher\" (wey relate to cryptography) and \"cyberpunk\" (wey be part of science fiction genre base on dystopian reality and anarchy) she con invent de name \"Cypherpunks\".De group con evolve and many odas too con join. For keeping in touch dem con launch a mailing list; you fit find de mail archive on Metzdowd.com and Cypherpunks.venona.com. At peak, e bin get about 2000 subscribers.Cypherpunk ideology bin take libertarianism and anarchism to a whole new level: crypto-anarchy. \"A specter wey dey haunt modern world, de specter of crypto anarchy\", Tim May bin yan so for 1988. Wetin piple con kno as a masterpiece in Cypherpunks literature: \"The Crypto Anarchist Manifesto\".\"Cypherpunks write de code\", wey Eric Hughes emphasize, for \"A Cypherpunk's Manifesto\", anoda illustrious writing wey represent a piece of history. And thru de code, Dem bin wan offer de piple privacy. Dem bin wan make de piple get free access to cryptography. oda important points of reference na online anonymity, game theory, secure file sharing, reputation systems, free market and civil disobedience. Steven Levy,  wey be de author of de above mention Wired article, call dem with one term wey dey impossible to translate in foreign language: \"techie-cum-civil libertarians\".Anoda big desire of de Cypherpunks na to create electronic cash. A form of untraceable money wey fit stop de govern surveillance over de financial life of de individuals.In time, many enthusiasts wey bin dey share dis ideology bin adhere to de group. Among de most notorious ones, wey we fit mention na Philip Zimmermann, de inventor of PGP, Julian Assange, de founder of WikiLeaks, Jacob Appelbaum, de developer of Tor and Hal Finney, de developer of PGP 2.0 and Reusable Proof-of-Work. You fit find oda remarkable Cypherpunks here.DigiCashSome of dis cryptographers start to dey work on de dream wey dem get: electronic cash. And dem get a role model: Dr. David Chaum's DigiCash. David Chaum work represent an inspiration to de Cypherpunks group and dem fit call am de godfather of Cypherpunks. Him writing (such as \"Untraceable Electronic Mail, Return Addresses, and Digital Pseudonyms\", \"Blind Signatures for Untraceable Payments\" or Security without Identification Card Computers to make Big Brother Obsolete\") prove say him bin dey think way ahead of time. In 1989 him bin already manage to launch de electronic money company DigiCash Inc. De company offer to de public de eCash payment system and de CyberBucks coins, wey dey base on blind signatures. Dem bin apply de proposal for real world payments, and several banks, such as Mark Twain Bank from St. Louis, Deutsche Bank, Credit Suisse, Norske Bank and Bank Austria. Oda big players con pick interest for Chaum creation: Visa, Netscape, ABN Amro Bank, CitiBank and ING Bank. Even Bill Gates try to put DigiCash for Windows '95. Unfortunately, dis players wey I mention above no sign de contract with Chaum. In de end, in 1998, DigiCash Inc. come go bankrupt. Piple no come dey attracted to use de system. Chaum proposal come cast. De Cypherpunks think also say de failure of DigiCash Inc. na becus of de fact say e dey base on a central authority. De key to success na a totally decentralized form of money.e-GoldGold & Silver Reserve, Inc. bin develop a similar business between 1996 - 2009. De company start with a subsidiary name e-Gold Ltd. to operate electronic gold. De users fit remotely transfer gold between dem selves, in grams or troy ounces units. De business bin dey flourish, con reach a peck of about 5M users. Many exchange con adopt dis electronic gold and de users fit also do transfer thru their phones. However, in 2007, US govern con accuse de owners of operating money without a license. De owners con plead guilty and dem con find dem guilty (in 2008); dem con close de exchanges. For admitting say dem break de law and for accepting say dem need money operating license, dem receive a lesser charge. However, according to de US law, as dem find dem guilty, dem no con allow dem to get such license and e-Gold no con exit again.HashCashImage source: Cypherpunks mailing listIn 1997, Dr. Adam Back com up with a proposal on de mailing list wey dem call HashCash. Na de era wen internet spams (especially email spams) start to be serious problem. De problem con enter big companies radar, thus in 1992, IBM bin take de first step with a proposal name Pricing via Processing or Combating Junk Mail. Dem go name IBM  researcher proposal somewhere in de future as Proof-of-Work.Adam Back's invention no dey base on de IBM proposal; however e get many things in common. HashCash concept na Proof-of-Work procedure to limit de email spams and DSos attacks, base on de cost of each email, e go make spam to dey too costly to use. Later, HashCash go become part of bitcoin engine, as e don already show up for bitcoin whitepaper.Besides, piple kno Adam as de person wey dey point Satoshi Nakamoto to Wei Dai, after him find de similarities between their electronic money proposals. Na just two persons Satoshi bin contact in regards to Bitcoin: de first person na Adam Back; de second person na Wei Dai.b-moneyWei Dai rare photo, which fit be(or no be) him picture; according to dis him statement from WeiDai.com, \"Please note dis, any purported photos of me on de Internet na actually oda piple wey de name na Wei Dai\" || Image source: steemit.comIn 1998, anoda remarkable Cypherpunk com with one electronic money proposal: b-money wey Wei Dai introduce. De draft also dey base on Proof-of-Work and e dey in two version. Unfortunately, b-money con dey vulnerable to Sybil attack and Wei Dai bin no finish him work. Dem no con implement de proposal.And him no con finish him invention becus him no trust anymore de utility of b-money or crypto-anarchy ideology. For later discussion on LessWrong forum, him admit: \"I no take any step to code b-money. Part of am na becus b-money no get complete practical design yet, but I no continue to work on de design becus I don dey disillusion with crypto-anarchy by de time I finish to write b-money, and I no foresee say a system like dis, once e dey implemented e go fit attract much attention and dem no fit use am beyond a small group of hardcore cypherpunks\". Him position con dey clear for one discussion wey him send to Adam Back and to oda Cypherpunks, wey prove say him no believe in de practical application of b-money. \"I think b-money go at most be a niche for currency/contract enforcement mechanism, to serve dose piple wey no wan use government sponsor ones\".Although, Wei Dai bin no trust too much him invention but someone else trust am. Decade later, following Adam Back advice, Satoshi Nakamoto contact am make him take a look at him proposal of electronic cash name Bitcoin. Dem exchange three emails. For de first one, From August 22nd, 2008, Satoshi write: \"I bin dey very interested to read your b-money page.  I ready to release a paper wey expand on your idea into a complete working system.  Adam Back (hashcash.org) notice similarities and con refer me to your site\".I need to find out de year of publication of your b-money page so dat I go cite am for my paper.  E go look like: [1] W. Dai, \"b-mone,\" http://www.weidai.com/bmoney.txt (2006).You fit download de pre-release draft at http://www.upload.ae/file/6157/ecash-pdf.html.  Feel free to forward am to any person else you think dey interested.\"Wei Dai con reply dis email. Him write: Hi Satoshi. I bin announce b-money on de Cypherpunks mailing list in 1998. Na de archive post be dis: http://cypherpunks.venona.com/date/1998/11/msg00941.htmlE get some discussions about am wey dey here http://cypherpunks.venona.com/date/1998/12/msg00194.html.Thank you as you let me kno about your paper. I go read am and I go let you kno if I get any comment or question.\"But Wei Dai bin no analyze Satoshi draft or give Satoshi response. Him receive on January 10th, 2009 anoda email from Satoshi, wey inform am say Bitcoin don dey fully work: \"I wan let you kno say, I just release de full implementation of de paper I send you few months ago, Bitcoin v0.1.  Details, download and screenshots dey for www.bitcoin.org.I think e don achieve nearly all d goals you bin set out to solve for your b-money paper. De system dey entirely decentralized, without any server or trusted parties.  De network infrastructures fit support a full range of escrow transactions and contracts, but for now de focus dey on de basics of money and transactions.\"Wei Dai bin no keep de connection with Satoshi for reasons wey only him kno. Maybe him bin no trust Bitcoin potential or maybe him bin no agree with de currency as e no get stable value. Wetin dey certain be say after years him regret him action: \"I for consider say Bitcoin don fail with regard to de monetary policy (becus de policy cause high price volatility wey impose heavy cost on de users, who need to either take undesirable risk or go engage on costly hedge in oda to use de currency). (Dis na partially my fault becus wen Satoshi bin write to me to ask me to comment on him draft paper, I neva reply am back. Perhaps I for discourage am (or dem) from de \"fixed supply of money\" idea.)\"Although, as at dat time I bin no no, say Wei Dai remain for history as de two persons wey Satoshi contact personally before him launch Bitcoin.Bit GoldAnoda prominent Cypherpunk wey try a solution for de private form of electronic money na Nick Szabo. Him bin dey familiar with de idea, as him bin don work in de past with Dr. Chaum at DigiCash. In 2005, him bin con go public with a proposal call Bit Gold. But him create de proposal since 1998. According to de white paper him invention suppose to \"use benchmark functions, as well as de techniques of cryptography and replication, to construct a novel financial system, bit gold wey go serve as not only payment scheme, but also long term store of value wey dey independent of any trusted authority\". More details about de proposal you go fit find am for Szabo blog.Bit Gold bin use Reusable Proof-of-Work but e also dey vulnerable to Sybil attack, similar to b-money. De concept no launch as a real life application and e remain for history as a blog post, as e bin face too many technical difficulties to work for a real environment. However, de basic idea behind Bit Gold bin inspire Satoshi for him masterpiece - Bitcoin.Satoshi, the last (?) CypherpunkThe Times, January 3rd, 2009, London issue, morning edition || Image source: TheTimes03Jan2009.com\"De root problem with conventional currency na de trust wey dey require to make am work. De central bank must dey trusted to debase de currency, but de history of de fiat currencies dey full of breaches of data trust. Banks must dey trusted to hold our money and to transfer am electronically, but dem dey lend am out in waves of credit bubbles with barely a fraction for reserve. We get to trust dem with our privacy, trust dem make dem no let identity thieves drain our accounts.\" -- Satoshi NakamotoPicture Satoshi Nakamoto in de morning of January 3rd, 2009. Him just buy The Times newspaper from a downstairs kiosk. As him get back to him house, him com dey drink hot coffee and dey read de main title: \"Chancellor on Brink of Second Bailout for Banks\". Still dey wait to find de genesis block. Which thoughts him fit get? Maybe him whisper to himself \"now dis dey too much. De govern don cross every possible limit! But bitcoin dey here now...\".Nobody no wetin him bin think dat day. But wetin dey certain be say on January 3rd, 2009, him bin mine Bitcoin genesis block. And stamp with de title of de main article from The Times.De work concerning Bitcoin bin start almost 2 years ago, in 2007. Satoshi, wey also join de Cypherpunks mailing list, go don assist with wetin happen to e-Gold and to de owners. De state dey clear about their intentions for private forms of money. De economic and politic context dey bad, as de world bin dey face a huge crisis. Maybe Bitcoin na de personal dream of Satoshi. Or maybe de world context bin wan make am work on him invention. Whatever, de truth be, de fact be say him follow him dream of de Cypherpunks, de dream wey de libertarian ancestors bin also share.Base on de libertarian and crypto-anarchic ideology, and as him follow de concept of him predecessors, Satoshi Nakamoto manage to create \"a new electronic cash system wey dey fully peer-to-peer, with no trusted third party\". De system \"go allow make we send online payments from one party to anoda without de burdens of going thru a financial institution.  Digital signatures provide part of of de solution, but de main benefits go dey lost if we require a trusted party to prevent double-spending.\"In oda words, Bitcoin na de first electronic form of private money, wey finally fully liberate de piple from de govern surveillance, as de funds dey directly transferable between individuals, without de intervention of any third party - such as de banks, wey dey act as de long term arms of de govern. Bitcoin genesis block || Image source: RedditSatoshi's libertarianism dey present in many of him words.\"De traditional banking model bin achieve a level of privacy as dem limit access to information to de parties involve and de trusted third party. De necessity to show all de transactions publicly no follow for dis method, but dem go fit achieve privacy by breaking de flow of information for anoda place: by keeping public keys anonymous. De public fit see say someone dey send money to someone else without de information wey link de transaction to anyone. Dis dey similar to de level of information wey stock exchange dey release, where de time and size of individual trades, de 'tape' dey public, but without piple knowing who de parties be.\"Anoda good example for dis mata dey for one 2015 article from The Verge, wey explain him first discussion with Martti Malmi, wey later become de administrator of BitcoinTalk. Martti also na individual with archaic views, as him be formally member of de defunct forum anti-state.org. De article yan:\"For him email to Satoshi Nakamoto, in May 2009, Martti bin don offer him services: \"I for like to help with Bitcoin, if e get something wey I fit do,\" him write.Before him reach out to Satoshi, Martti bin don write about Bitcoin for anti-state.org, one forum wey dey dedicated to de possibility of an anarchist society organized only by de market. Using de screen name Trickster, Martti bin give brief description of de Bitcoin idea and him con ask for thoughts: \"Wetin you think about dis? I dey really excited about de thought of something wey dey practical wey fit bring us closer to freedom for our lifetime :-)\"Martti bin include a link to dis post for him first email to Satoshi, and Satoshi quickly read am con respond.\"Your understanding of Bitcoin dey spot on,\" Satoshi write back.\"QuoteDi following part show di first sign of Bitcoin development (n.b. -- thank you, cygan for dis part!) -- 5 emails wey exchange hands between Satoshi and Adam Back. If we go believe dis 5 emails (e no get how we go take find out easily) say contact bin dey between Satoshi Nakamoto and Adam Back since August 2008, when Satoshi bin ask Adam on him opinion about di paper. With dis 5 important 'documents' we go fit once again map a certain period of time and realize say Satoshi bin dey in contact with some Cypherphunks.     Satoshi answer dey crystal clear about him vision. And de lesson make we no forget am.De same dey true about am wen him talk about sharing de Cypherpunk's points of interest - him give piple free access to Bitcoin, for de privacy wey Bitcoin offer. Free access and easy use of cryptography keys wey dis protocol dey use. Bitcoin suppose (and succeed to) fully change de free market. Utimately, na form of civil disobedience. One method to take position for front of de govern money - de traceable money, de inflated money, de money wey day by day dey lost their value, as governs printers dey constantly issue new money.He wan help piple to dey free again. And dis dey possible thru bitcoin. No bank and no govern fit \"milk\" de piple off their money anymore with more or less sophisticated mechanism, like taxes to dey transfer their funds, taxes to dey sell their products, taxes to dey sell their work pawa. Bitcoin dey free for everyone and freedom reside inside am, if you wan get control over your privacy and finance, all you need to do na to embrace am.Tim May bin don foresee Bitcoin many years on multiple occasions. For example, for him 1994 essay Crypto Anarchy and Virtual Communities him say \"Technology don let de genie out of de bottle. Crypto anarchy dey liberate individual from coercion by their physical neighbours - Who we no fit kno who dem be on de Net - and from de government. For de libertarians, strong crypto provide de means by which we go fit avoid de government\".Bitcoin dey true and e don come to stay. Sky don start to dey fall since 1979 and e go continue to dey fall. Govern don lost de war. Freedom dey our ours.Dis na my 1000th post.And na sequel of my previous writing wey dey related to Cypherpunks, history and crypto-anarchy. De Cypherpunks spirit live thru many of us. Na our duty to keep am alive. Na our duty to keep to dey fight for freedom and liberty!References:- 12 years don pass and people no still sabi how dem go use Bitcoin or waiting e good for- Governs dey come 4 traders!- Cryptocurrency nd digital money Palava by di state- De Crypto Anarchist Manifesto - Make all of us read am- Governs try to limit de public to access of information and freedom long long time ago- Wetin Phil Zimmermann's Dey Reason about PGP  - Make all of us read am- Wen de govern wan to hold your private keys- De call for Julian Assange || De WikiLeaks Manifesto - Make all of us read am",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454022",
  "comments": [
    {
      "author": "sokani",
      "created_time": "May 25, 2023, 05:49:50 PM",
      "body": "According to Gazeta dis na one of a kind comparison between Bitcoin and all im ancestors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GazetaBitcoin",
      "created_time": "May 26, 2023, 06:57:35 AM",
      "body": "Thank you for translating my 1000th post, dear sokani! Great job as always! I bin wan write a memorable essay wit 1000th post, so I con decide to write about Bitcoin and im ancestors. I hope say all Nigerian users go enjoy to read dis piece of history wey talk how Wei Dai, Adam Back, Nick Szabo and David Satoshi pave de way for Satoshi, decades ago.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "May 26, 2023, 07:06:53 AM",
      "body": "Quote from: GazetaBitcoin on May 26, 2023, 06:57:35 AMThank you for translating my 1000th post, dear sokani! Great job as always! I bin wan write a memorable essay wit 1000th post, so I con decide to write about Bitcoin and im ancestors. I hope say all Nigerian users go enjoy to read dis piece of history wey talk how Wei Dai, Adam Back, Nick Szabo and David Satoshi pave de way for Satoshi, decades ago.We go enjoy am as dem don brake down into our pidgin language.Na d first time wey I de come across this thread be this, and I see say d thread contain some histories wey relate decentralization for olden days and Bitcoin. Even though the thread long, I find it interesting to read.Quote from: sokani on May 25, 2023, 05:49:50 PMAccording to Gazeta dis na one of a kind comparison between Bitcoin and all im ancestors.Good job @sokani, I know say this thread take you time to translate.I hope say our people go read am to get some knowledge and information from the thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartGold01",
      "created_time": "May 26, 2023, 07:50:36 AM",
      "body": "Quote from: GazetaBitcoin on May 26, 2023, 06:57:35 AMThank you for translating my 1000th post, dear sokani! Great job as always! I bin wan write a memorable essay wit 1000th post, so I con decide to write about Bitcoin and im ancestors. I hope say all Nigerian users go enjoy to read dis piece of history wey talk how Wei Dai, Adam Back, Nick Szabo and David Satoshi pave de way for Satoshi, decades ago.Senior man I dey feel ur vibe, dey wey you dey swim our pidgin ehh e be like say you self don come sabi am pass us oo, bicus e stil dey surprised me dey wey you dey carry flow free with de pidgin.Anyway you try bicus 9ja pidgin swit for belle pass anytin.@Sokani you too try bicus to seat one place to dey write dis post back with our pidgin language no easy at all but anyhow me self go begin try put eyes too.Weldon my brother.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GazetaBitcoin",
      "created_time": "May 27, 2023, 10:16:23 AM",
      "body": "Quote from: SmartGold01 on May 26, 2023, 07:50:36 AMSenior man I dey feel ur vibe, dey wey you dey swim our pidgin ehh e be like say you self don come sabi am pass us oo, bicus e stil dey surprised me dey wey you dey carry flow free with de pidgin.Anyway you try bicus 9ja pidgin swit for belle pass anytin.E sweet me for belly say you enjoy reading dis historic essay about Bitcoin. E bin dey very important for me wen I write am (and e still dey important for me, as na my 1000th post for de forum. E take me plenti time to properly document am and after I con finish, I con feel really good 😊About my pidgin skills, I go like confess say na sokani na im help me out with my previous post, so I kno no your language. However, I sabi English very well so I dey partially understand your pidgin english but e dey impossible for me to write in your language. So if you dey surprise, abeg no dey surprise again. Na sokani handiwork 😊 and thank you sokani for help.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}