{
  "id": "topic_5452029",
  "title": "UchihaSarada",
  "author": "UchihaSarada",
  "created_time": "May 09, 2023, 01:50:36 AMLast edit: May 09, 2023, 02:29:47 AM by UchihaSarada",
  "content": "Your Bitcoin transaction fees will depend on two main factors:Transaction sizeFee rateYou can control them both.Controlling transaction size by choosing appropriate address type like Segwit (Bech32) starts with bc1q as well as consolidate your small inputs to reduce transaction size when you need to move your coins.Choosing a feasible fee rate to use for your transaction (after consolidate your small inputs when mempools give you cheap fee rate for consolidation).A chart for mempool history from which you can see it barely has congestion or periods in which people have to accept Deadly Red Fee Rate Bands. Only three times and I made screenshots for you.December 2017April 2021May 2023Only about 2 weeks ago, mempools were cleared but now things are worse and worse day by day.[May 2023] Fees not low! Wait for opportunity to Consolidate your small inputs.You can wait for cheaper fee, if you join the fee race, you will help miners richer easily.Currently they have very joyful time with massive transaction fee. Fee in block reward is very high at the moment and it is up to 42%, a second highest value in history.Bitcoin fee in reward",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452029",
  "comments": [
    {
      "author": "witcher_sense",
      "created_time": "May 09, 2023, 06:52:56 AM",
      "body": "Quote from: UchihaSarada on May 09, 2023, 01:50:36 AMYou can control them both.Controlling transaction size by choosing appropriate address type like Segwit (Bech32) starts with bc1q as well as consolidate your small inputs to reduce transaction size when you need to move your coins.Choosing a feasible fee rate to use for your transaction (after consolidate your small inputs when mempools give you cheap fee rate for consolidation).I guess that rational actors in the Bitcoin market are capable of determining the correct time to both consolidate small inputs and split those of large amounts. Rational behavior also implies that the economic value of a transaction will always be larger than the fee paid to transfer it. If a person doesn't understand these simple concepts and still behaves illogically trying to attach value to arbitrary binary data inscribed in a transaction, he also won't consult guides on how to act properly during crises or attacks like we witness today. The problem is rational actors' actions always depend on the actions of irrational actors, which means people reading the guides of input consolidation and learning things have to be inactive as long as economic ignoramuses do stupid things selling and buying scams.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}