{
  "id": "topic_5476341",
  "title": "Question:",
  "author": "BabyBandit",
  "created_time": "December 02, 2023, 10:51:39 PM",
  "content": "Members, reputable members. Was it better before back then when this forum was without merits or is it better or even much better now with merits? Please explain your answer so users like me can get an idea how it was and what you prefer.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476341",
  "comments": [
    {
      "author": "_act_",
      "created_time": "December 02, 2023, 10:54:40 PM",
      "body": "Merit system was created in 2018 because of the way many people are spamming and having low quality posts. Merit system was introduced and the spam and low quality posts with multiple accounts become reduced. I think this answers your question.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mrbluntzy",
      "created_time": "December 02, 2023, 11:38:51 PM",
      "body": "when merit was not yet introduced, members only require activity to rank up but after the merit system got introduced, users now need merit and activity before they can enter a new rank. There are members who are complaining that they can't earn merit to be able to rank up, i think for members now, it's becoming more of a merit hunt than quality post but any member who gets tired of hunting for merit will get tired an leave if they don't earn merit on their low quality post. I am not saying this because I feel that my post is of extremely good quality but I know that the quality of posters before was better than now and that's what changed. I also know that the introduction of the merit system was to help encourage users to make quality post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "December 03, 2023, 12:23:10 AM",
      "body": "Better after but also I remember the newest members had a special forum section and only posted there, to some extent that was good containment and discouragement to start new accounts and spam.  I guess that was and still is the largest problem.  Merit isnt perfect but its generally a good idea to have some limited scoring to posts, I do think it should be a little more liquid for anyone active but I understand it has to lean on the hard money side of balancing things rather then letting it all be too loose and becoming not a worthwhile marker or commodity to circulate on the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "December 03, 2023, 12:54:09 AM",
      "body": "Much, much better now than before the merit system was created--and I think I've said that like a million times across the span of 5 years already.  While I think there's still a big shitposting problem, at least people aren't doing it with a stable of alt accounts that they're ranking up either to enroll in bounties/campaigns or to sell to account buyers.  The merit system swept the legs right out from under account farmers, and that was no small thing.There used to be threads where it was obvious that alt accounts were responding to each other as though they were actually different people; you don't see that much anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "December 03, 2023, 01:23:28 AM",
      "body": "Quote from: BabyBandit on December 02, 2023, 10:51:39 PMMembers, reputable members. Was it better before back then when this forum was without merits or is it better or even much better now with merits? Please explain your answer so users like me can get an idea how it was and what you prefer. In my opinion, the addition of merits has brought a positive change to the community. Merits provide a structured way to acknowledge and reward valuable contributions, which helps in recognizing the efforts of members who consistently provide helpful and insightful content.Before merits, while the forum might have been functional, there may have been challenges in highlighting and appreciating quality contributions. The introduction of merits seems to have added a layer of accountability and recognition, encouraging members to contribute meaningfully and maintain a positive and constructive environment.Of course, improvement for the better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "December 03, 2023, 01:34:05 AM",
      "body": "I am not sure whether it was better back then (before the implementation of the merit system) or not, because of the simple fact I joined this wonderful community back during the pandemic. Though, reading the opinions of The Sceptical Chymist (aka The Pharmacist) among other members who joined much earlier than me, it makes sense the merit system helped to halt to some degree the spamming and the account farming. Now obviously takes much more effort to account farm for the purpose of selling them outside of the forum, to the extent many of the farmers probably stopped trying at this point. No system is perfect, that is for sure, but having a system like this one is better than not having one. At least, that is my humble opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "December 03, 2023, 03:46:25 AM",
      "body": "I'm registered since 2020, but since I've check the old thread discussions where most users were create one liner posts and there are many airdropped merit users stuck can't receive many merits, I'll say the forum is better after merit implementation.Unfortunately the current merit system isn't perfect yet, we need to improve in punishment for user who keep meriting each other with his alts or friends.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "December 03, 2023, 04:21:36 AM",
      "body": "Quote from: BabyBandit on December 02, 2023, 10:51:39 PMMembers, reputable members. Was it better before back then when this forum was without merits or is it better or even much better now with merits?Before the merit system, as consequence of cryptocurrency market and ICO booming in 2017 and 2018, the forum was flooded with shit posters. Merit system kicked off in January 2018 helped to indirectly eliminate shit posters because they have no available space to spam and get money for their 'works'.Then another wave of spam returned when those farms exchanged merits to rank up to like Junior member (without 1 merit required back in the day with initial merit system), then theymos launched an Enhanced merit system (with 1 merit required to be Junior member, previous junior members without 1 earned merit will be deranked to newbies). Spam reduced effectively and significantly again.Then the massive booster of monthly sourced merits caused another issue, when I can see many shit posters rising again. They wrote wall of texts and use those text walls as their fake marks of quality to exchange merit, rank up and spam to work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "December 03, 2023, 05:07:28 AM",
      "body": "Quote from: _act_ on December 02, 2023, 10:54:40 PMMerit system was created in 2018 because of the way many people are spamming and having low quality posts. Merit system was introduced and the spam and low quality posts with multiple accounts become reduced. I think this answers your question.That's true if we don't have a merit system to rank up we will see newbies ranking up to legendary because of activity and post count when their contributions to the community are bounty reports, those who contributed and earned the respect the respect of the community are the one who deserves to rank up.Merits are a vote of confidence by the community to members who make a great contribution to what the forum should be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "December 03, 2023, 05:55:54 AMLast edit: December 03, 2023, 06:25:02 AM by TheUltraElite",
      "body": "I was here 2years before the merit system was started and I am still here after 5years of the merit system.The good thing/or so we thought, was that alt-accounts would reduce in number and account farming would be discouraged, although the second point has fairly been effective, they eventually are managing to rank up and introduce their own into multiple campaign and defraud them like previously. In other words, there are loopholes and its not perfect, but sometimes merit ends up being a distraction rather than engaging in the community.So my opinion is that not much has changed, we had bootlickers previously and we still have, its just how democracy works. Suck it up and continue on your one man army life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "December 03, 2023, 06:11:09 AM",
      "body": "Quote from: BabyBandit on December 02, 2023, 10:51:39 PMPlease explain your answer so users like me can get an idea how it was and what you prefer. It's obvious that the merit system brought a level of sanity and control in the forum and helped push account farmers off the forum or minimized their activities and kicked shitposters in the balls. Though I'm of the opinion that meriting a post is a subjective thing than objective. I've said this times without number. By the way, in the past with your current status of 126 activities you would've ranked up to Full Member long ago but that's not possible now as you've merit to contend with and that will push you to put more efforts in your posts to get merit. You see how a plus it's?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wallet4bitcoin",
      "created_time": "December 03, 2023, 07:12:53 AM",
      "body": "Quote from: BabyBandit on December 02, 2023, 10:51:39 PMMembers, reputable members. Was it better before back then when this forum was without merits or is it better or even much better now with merits? Please explain your answer so users like me can get an idea how it was and what you prefer. To a larger extent, the forum is better with the integration of the merit system to it. However, it comes with its own downsides just like every other invention.Firstly, the way the merit system is being earned. People are have to depend on sources to issue them merit based on their inputs.Secondly, the pace of growth being slow. One has to satisfy activity as well as merit also to move up the rank ladder, if one of these conditions is satified leaving the other then the growth is impaired.These basics have not settled in properly with a good percentage of the form users but it does help regulate the system and move along with those who give meaningful input into the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shenanigan",
      "created_time": "December 03, 2023, 07:22:26 AM",
      "body": "Quote from: BabyBandit on December 02, 2023, 10:51:39 PMWas it better before back then when this forum was without merits or is it better or even much better now with merits? Please explain your answer so users like me can get an idea how it was and what you prefer. I don’t know what is \"merits\" are so I can’t answer your question.I only know that here at the forum you can simply communicate and debate without any \"merits\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "December 03, 2023, 07:28:20 AM",
      "body": "Quote from: BabyBandit on December 02, 2023, 10:51:39 PMWas it better before back then when this forum was without merits or is it better or even much better now with merits? Please explain your answer so users like me can get an idea how it was and what you prefer. The merit system is not perfect, but notwithstanding, it's doing a great job.I wasn't here before the merit system was newly introduced, and so are many Legendary members as well, yet, we could imagine just as it is in other forums without much moderation. This also goes in line with the story I heard that there was too much spamming. I can't but imagine that as well in a forum where there was an opportunity to earn, a lot of people might be writing jargons just to meet up with their pay posts requirements, but careless about the quality of posts that could move the forum forward.This makes me conclude that this merit era is better and will also reduce the stress on the moderators.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "December 03, 2023, 09:01:34 AM",
      "body": "IMO merit was introduced to try to force users to do better since they weren't taking the initiative to do it on their own. Merit is needed in order to rank up and in order to earn some merit you have to put some effort in when posting. If merit was used correctly, then of course it's a good thing for the forum. The issue is these farmers all got airdropped merit and are able to merit new accounts and rank them up, sell merit and make a buck, or help their already existing accounts rank up. Overall, merit is great for the forum, but like everything else there are some issues.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "December 03, 2023, 09:58:21 AM",
      "body": "For me, I find the forum after activating the merit system much better than it was before the merit system was in place. Merit distinguishes between good members who provide benefit to the forum and others who spread spam.In general, the merit that a member obtains is an indicator of the quality of posts and the positive, constructive activity of members in the forum. Activity alone is not enough.Of course, there is no perfect system. There must be some defects, but I find that the benefits that the forum obtains are much greater than the defects that may exist in this system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "December 03, 2023, 10:25:27 AM",
      "body": "I was not a part of the forum before the implementation of the merit system, but from the research I’ve done and several posts I have read I think I can boldly say that the merit system has done a pretty good job and there have been an improvement in posts standards. But that does not mean that you still won’t come across a low quality post, some are made due to the poster not understanding the Op or something similar, but you won’t see anyone post just to increase their activity status like they did before the merit era. Quote from: Mrbluntzy on December 02, 2023, 11:38:51 PM~~~Some gave up when they were unable to earn merits from their posts while the rest realized that something was wrong and then decide to up their game and right now they are doing quite well and will still be in support of the merit system of asked to give their opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shield132",
      "created_time": "December 03, 2023, 10:28:51 AM",
      "body": "Quote from: BabyBandit on December 02, 2023, 10:51:39 PMMembers, reputable members. Was it better before back then when this forum was without merits or is it better or even much better now with merits? Please explain your answer so users like me can get an idea how it was and what you prefer. It was better when bitcoin was something new and people were discovering it, it was better when web wasn't super advanced and when crypto businesses were a new thing. It was just a good time, a new day, revolution in financial system, a new niche, a new thing to build business around.Merit was implemented in 2017, this was the time when bitcoin gained widespread attention and become a very successful cryptocurrency. Also, since 2017, web and crypto businesses developed further and this forum lost popularity a little bit. This forum is not as mainstream as it was before and new things don't start from this forum like it was before.So, I wouldn't ask whether was this forum better before merit or not, I would ask, was this forum better before 2017 or not. Btw it's noticeable that forum members are putting more effort to post high quality posts. To be honest, merit and high-paying signature campaigns, like Chipmixer, played very important role into making this forum a better place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "December 03, 2023, 10:39:23 AM",
      "body": "The forum is much better now. This thread reminded me of one I opened in this same section when I had only been on the forum for a week. Take a look at it to get an idea of what was going on:Poor English, careless writing, ranks and signature campaigns.Basically before the merit system the forum was ranked up by time since registration and activity, and the forum was full of rubbish as has been mentioned. Neither the people reporting could report everything nor the moderators couldn't cope with it, so no matter how hard they tried the forum looked pretty filthy, much worse than now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}