{
  "id": "topic_5442599",
  "title": "Jlh74",
  "author": "Jlh74",
  "created_time": "March 04, 2023, 07:54:09 PM",
  "content": "I have specter connects to my core node. Its 2/3 multisig. However, the balance is spendable on core. I want it to be watch only on core. I've tried to add disableprivatekey=1 in config, doesn't work. Is there anyway to do this? The wallet was created from a specter desktop export in sparrow.  Sparrow does this by default when linked to node, balance in core is watch only. Any help appreciated",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5442599",
  "comments": [
    {
      "author": "jackg",
      "created_time": "March 05, 2023, 02:23:14 AM",
      "body": "How do you know its spendable in core, does core have both or all three private key sets? I haven't used spectre but I'm not sure how you'd know the coins were spendable just from seeing the balance there (if your intention was to only import one key, how do you know you haven't?)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "March 05, 2023, 06:29:20 AM",
      "body": "Quote from: Jlh74 on March 04, 2023, 07:54:09 PMHowever, the balance is spendable on core. I want it to be watch only on core. I've tried to add disableprivatekey=1 in config, doesn't work.I've tested it, the wallet in Bitcoin Core isn't spendable since it shows \"private_keys_enabled\": false,\" in getwalletinfo command.You can also check the Send tab in the GUI if it has \"Create Unsigned\" in place of the \"Send\" button.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jlh74",
      "created_time": "March 05, 2023, 06:21:03 PM",
      "body": "It does say create unsigned. I am newer to core, so that means it will allow a psbt?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "March 06, 2023, 01:01:10 PM",
      "body": "Quote from: Jlh74 on March 05, 2023, 06:21:03 PMIt does say create unsigned. I am newer to core, so that means it will allow a psbt? Yes, it can create partially signed raw transaction (without any signature) but cannot sign since it only contains master public key.So it can't spend your bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}