{
  "id": "topic_5469434",
  "title": "joker_josue",
  "author": "joker_josue",
  "created_time": "October 06, 2023, 03:49:38 PM",
  "content": "Estava aqui a pesquisar umas coisas, e lembrar-me se eventualmente existira algum registo do preço do bitcoin, no momento em que cada bloco foi minado.Fiz varias pesquisas, e não encontrei nenhum apanhado que indica-se, o valor do BTC em determinado bloco.Vocês conhecem alguma plataforma que esteja a fazer esse tipo de registo?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469434",
  "comments": [
    {
      "author": "TryNinja",
      "created_time": "October 06, 2023, 03:54:26 PM",
      "body": "Tem algum motivo especifico?Longe de ser infalivel, mas você podia só olhar o gráfico de 10 minutos de alguma exchange. Claro que tem dias em que os blocos demoram 5 min, outros que eles demoram 30 min, e as vezes alguns saem só depois de 80 min...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "October 06, 2023, 04:16:09 PM",
      "body": "Quote from: TryNinja on October 06, 2023, 03:54:26 PMTem algum motivo especifico?Nada em especifico, só curiosidade estatística.Eu sei que os blockchains online, mostram o valor da transação com base na cotação atual. Mas, acho que seria bem interessante ter uma ideia de quanto valeu aquela transação quando saiu o bloco.Fazer algo do gênero, poderia ser interessante, mas já estaria desatualizado face ao passado. Só se atribuíssemos a cotação do dia a todos os blocos minados naquele dia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "October 06, 2023, 04:22:35 PM",
      "body": "Quote from: joker_josue on October 06, 2023, 04:16:09 PMEu sei que os blockchains online, mostram o valor da transação com base na cotação atual. Mas, acho que seria bem interessante ter uma ideia de quanto valeu aquela transação quando saiu o bloco.O explorer da blockchain.com fazia isso de mostrar quanto valeu a transação lá atrás, mas olhei aqui e mudaram todo o design, tendo perdido essa funcionalidade. Mas o blockchair aparentemente mostra o valor considerando o preço na hora tx. Exemplo: https://blockchair.com/bitcoin/transaction/dc5b1aedb6bde4bf7f8d67f4945580791fcdd66e65333a49b443ab3dd82746440.01451894 BTC37.29 USDHoje, esses btcs valem 10x mais = $395.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "October 06, 2023, 04:30:10 PM",
      "body": "Quote from: TryNinja on October 06, 2023, 04:22:35 PMMas o blockchair aparentemente mostra o valor considerando o preço na hora tx. Exemplo: https://blockchair.com/bitcoin/transaction/dc5b1aedb6bde4bf7f8d67f4945580791fcdd66e65333a49b443ab3dd8274644Esse explorador, já da para conseguir essa informação.Por exemplo, o bloco 510924:https://blockchair.com/bitcoin/block/510924Gerou 12.50BTC num valor total de 124,221USDOu seja, o valor do 1 BTC era de 9.94$Fiz bem as contas?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "October 06, 2023, 04:32:33 PM",
      "body": "Quote from: joker_josue on October 06, 2023, 04:30:10 PMEsse explorador, já da para conseguir essa informação.Por exemplo, o bloco 510924:https://blockchair.com/bitcoin/block/510924Gerou 12.50BTC num valor total de 124,221USDOu seja, o valor do 1 BTC era de 9.94$Fiz bem as contas?  $9.94? Não lembro desses preços em 2018. Respondendo sua pergunta, fez não, rsrsrs.Ali são 124 mil, 221 dólares... e não 124 dólares, 221 centavos.124221/12.5 = $9937,68",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "October 06, 2023, 04:37:08 PM",
      "body": "Quote from: TryNinja on October 06, 2023, 04:32:33 PM$9.94? Não lembro desses preços em 2018. Respondendo sua pergunta, fez não, rsrsrs.Ali são 124 mil, 221 dólares... e não 124 dólares, 221 centavos.124221/12.5 = $9937,68Upsss... Porcaria dos pontos e das virgulas.  Sendo assim, já é um ponto de partida para fazer um apanhado.Tinha-se era de fazer uma raspagem de +820000 paginas, que isto não para.Achas que isso iria demorar quanto tempo?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "October 06, 2023, 04:40:21 PM",
      "body": "Quote from: joker_josue on October 06, 2023, 04:37:08 PMSendo assim, já é um ponto de partida para fazer um apanhado.Tinha-se era de fazer uma raspagem de +820000 paginas, que isto não para.Achas que isso iria demorar quanto tempo?Tem que ver como eles limitam as requisições. Se der para fazer 1 req por segundo, com 810926 blocos, demorariam cerca de 9 dias e meio para conseguir tudo. Se eles forem mais brandos e/ou usar vários IPs, dá pra fazer tudo em 1 dia ou menos. O quanto você quer esses dados? Talvez seja um desafio legal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "October 06, 2023, 04:46:17 PM",
      "body": "Quote from: TryNinja on October 06, 2023, 04:40:21 PMTem que ver como eles limitam as requisições. Se der para fazer 1 req por segundo, com 810926 blocos, demorariam cerca de 9 dias e meio para conseguir tudo. Se eles forem mais brandos e/ou usar vários IPs, dá pra fazer tudo em 1 dia ou menos. O quanto você quer esses dados? Talvez seja um desafio legal.  Bem, não tenho nenhum prazo em mente.Apenas lembrei, que podia ser interessante, ter um explorador onde o visitante coloca o numero do bloco, e ele diz quanto valia o BTC nesse momento.Se quiser agarrar o desafio, podemos trabalhar em equipa para montar uma coisa desse gênero.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}