{
  "id": "topic_5417782",
  "title": "pakhitheboss",
  "author": "pakhitheboss",
  "created_time": "October 20, 2022, 02:06:35 PM",
  "content": "Liz Truss just announced her resignation! I am not sure when in the past I heard about political instability in the UK. Things have now gone from bad to worst after her resignation. Back in the past England was the one country that had the biggest colonies. In the 20th century England was a rising economy but things have gotten sour after COVID-19 and the Russian war. The conservative party doesn't have a clue on how to revive the economy and this means dark days ahead for the citizens. I am sure that Rishi Sunak will become the next PM but will he be able to revive the economy and social instability is now a concern.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417782",
  "comments": [
    {
      "author": "Majestic-milf",
      "created_time": "October 21, 2022, 08:19:30 AM",
      "body": "Although there are various reasons suspected to be behind her reason for resigning, we still are not sure what actually prompted her decision. To be honest, ever since she took over her predecessor, Boris Johnson, there has been nothing significant that one could point that she has done. Critics even say that the British economy took a nosedive as her policies where deemed poor and unessential. But according to events that transpired in the House of Commons on Wednesday, I think it was the behavior of the Conservative whips that actually broke the camel's back.There's a likelihood that Boris could still run for the spot but I see fierce competition coming from Rishi sunak and he could be the likely replacement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Moneyprism",
      "created_time": "October 21, 2022, 11:25:08 AM",
      "body": "i was reminded of the words of one of the foreign media who said that \"England is a developing country under the guise of a developed country\" because of its unstable political and economic conditions",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "October 21, 2022, 12:01:05 PM",
      "body": "I do not really understand the reason for the resignation all of a sudden? The reasons given for her being un-prepared for the job and lack of support, but leaving it seems to be quite unprofessional. I did not expect her to quit in this manner as I had heard that she was a very hard working person and a leader that could work with others. She appeared to be fearless and confident. I think that this resignation was an impulsive decision on her part, and it reflected a much more impulsive side to her character.In any event, this is a huge political move that could shake things up in England, not to mention the United Kingdom as a whole. The political implications are wide-ranging and could completely change the course of British politics.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "October 21, 2022, 12:05:52 PM",
      "body": "No party, let alone even the most strict fiscal conservatives could revive an economy that blew out the budget in 2020 and is facing an unprecedented rise in energy costs.https://www.statista.com/statistics/298465/government-spending-uk/Conservatives should not have signed on with blowing out the budget over COVID lockdowns that had little to no returns. They'll have to deal with the consequences. Social spending and healthcare are the biggest expenditures -- there is no feasible chance you could lower these costs so any attempt at having a balanced budget is dead on arrival. The only hope is that the economy picks back up, and energy prices decreases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "October 21, 2022, 04:36:34 PM",
      "body": "Quote from: pakhitheboss on October 20, 2022, 02:06:35 PMLiz Truss just announced her resignation! I am not sure when in the past I heard about political instability in the UK. Things have now gone from bad to worst after her resignation. Back in the past England was the one country that had the biggest colonies.  I am not going to analyze what has gone before, especially since the colonial era.What I will say is that Truss is an embarrassed Torie, as happens in many right-wing politicians who at the slightest criticism by someone from the left are ashamed. Lowering taxes and cutting government spending always works. However it seems she was more concerned about diversity, quotas and not getting criticized too much than implementing what actually works.In this regard I leave here Laffer's analysis of the situation, who has recently published a book \"Taxes have consequences\".‘Bidenomics’ have thrown the US into a ‘tizzy’: Laffer",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "October 21, 2022, 06:51:20 PM",
      "body": "Quote from: Majestic-milf on October 21, 2022, 08:19:30 AM To be honest, ever since she took over her predecessor, Boris Johnson, there has been nothing significant that one could point that she has done. Critics even say that the British economy took a nosedive as her policies where deemed poor and unessential.It has not been an easy period in the UK, and she became prime minister at a very difficult economic time, and in the same period the Queen died which definitely would have had a further affected their economy. She must have resigned from the job because she has seen that the challenges she had ahead where bigger than what she had expected and became intimidated by them. Whatever she has said her reasons are, It is still possible that some political game was played and she was put under the pressure to resign.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "October 21, 2022, 07:53:13 PM",
      "body": "UK is in a bad spot. They had a PM who wanted to stay, so they kicked him out for bad behavior and then picked a woman to do the job, but she bailed. To be honest, she was way over her head trying to create prosperity in a high inflation environment, but at least she'll be getting that 100k a year, so she's all set. A month's work, a lifetime of pension, what more could you possibly want?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "White pawn",
      "created_time": "October 21, 2022, 08:44:50 PM",
      "body": "Quote from: Bananington on October 21, 2022, 06:51:20 PMQuote from: Majestic-milf on October 21, 2022, 08:19:30 AM To be honest, ever since she took over her predecessor, Boris Johnson, there has been nothing significant that one could point that she has done. Critics even say that the British economy took a nosedive as her policies where deemed poor and unessential.It has not been an easy period in the UK, and she became prime minister at a very difficult economic time, and in the same period the Queen died which definitely would have had a further affected their economy. She must have resigned from the job because she has seen that the challenges she had ahead where bigger than what she had expected and became intimidated by them. Whatever she has said her reasons are, It is still possible that some political game was played and she was put under the pressure to resign.How exactly did the economy of the UK get affected with the queen passing away? It hasn’t been an easy time in the UK as well as pretty much everywhere else right now. She had strived to be PM but now resigning after probably after realizing she actually has to work and her policies she thought was superb is actually not superb.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrimeNumber7",
      "created_time": "October 22, 2022, 03:51:01 AM",
      "body": "Quote from: Majestic-milf on October 21, 2022, 08:19:30 AMCritics even say that the British economy took a nosedive as her policies where deemed poor and unessential.She was in office for only about 6 weeks, and her policy proposals had not yet been voted on, let alone implemented. IMO, it is more likely that markets were responding to the potential for a winter energy crisis that was caused by her predecessors, and Job Biden. Quote from: Gyfts on October 21, 2022, 12:05:52 PMConservatives should not have signed on with blowing out the budget over COVID lockdowns that had little to no returns. This.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "be.open",
      "created_time": "October 22, 2022, 07:24:34 AM",
      "body": "Liz Truss served as prime minister for 44 days and earned herself a lifetime annual pension of £110,000. And what have you achieved?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "October 22, 2022, 02:23:57 PM",
      "body": "Quote from: be.open on October 22, 2022, 07:24:34 AMLiz Truss served as prime minister for 44 days and earned herself a lifetime annual pension of £110,000. And what have you achieved?You are absolutely right I just questioned without earning a single penny.? GOD HELP UK! So who do you think will be the next who will be in line for that pension and also for less week.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}