{
  "id": "topic_5476160",
  "title": "TheIrishman",
  "author": "TheIrishman",
  "created_time": "December 01, 2023, 11:08:27 AMLast edit: December 03, 2023, 07:48:33 AM by TheIrishman",
  "content": "O Plenário do Senado aprovou a proposta que muda o Imposto de Renda sobre fundos de investimentos e sobre a renda obtida no exterior incluindo imposto sobre bitcoin e criptomoedas; a medida deve valer para 2024.<< Na última quarta-feira, 29, o Plenário do Senado aprovou a proposta que muda o Imposto de Renda sobre fundos de investimentos e s<obre a renda obtida no exterior por meio de offshores (PL 4.173/2023), entre outros pontos, o projeto cria um imposto de até 15% para o bitcoin e criptomoedas armazenado em exchanges fora do Brasil.A matéria vai agora para sanção presidencial, porém como é um projeto criado pelo Poder Executivo, deve ser sancionado com urgência.\"O enquadramento de ativos virtuais e de carteiras digitais como aplicações financeiras no exterior constará da regulamentação da Secretaria Especial da Receita Federal do Brasil (RFB). Os rendimentos que não constituam aplicações financeiras nos termos da nova norma, continuam sujeitos às regras atuais e específicas de tributação dispostas no art. 21 da Lei nº 8.981, de 20 de janeiro de 1995. \", destaca o projeto.Deste modo, a tributação dos investimentos ocorrerá sobre rendimentos de aplicações financeiras, lucros e dividendos de entidades controladas no exterior (offshores) e trusts, incluindo criptomoedas.Assim, qualquer usuário que tiver criptomoedas avaliadas em mais de R$ 6 mil, em empresas no exterior, como Binance, Bitget, Gate.io. Crypto.com, Coinbase, Bitfinex, OKX, Crypto.com, Bybit, e outras deve pagar imposto de até 15%. >>https://exame.com/future-of-money/senado-aprova-imposto-de-15-para-rendimentos-com-criptomoedas-no-exterior* * *Notem que o texto aprovado prevê a cobrança do imposto sobre os lucros mesmo que não ocorra alienação (venda ou troca). Ou seja, o cidadão simplesmente terá que conseguir levantar de alguma forma o valor do imposto sobre a valorização para pagar à Receita Federal. Mais detalhes nos vídeos abaixo.Imposto de 15% sobre Cripto é inconstitucional - PL 4173https://www.youtube.com/watch?v=KqImNTXy4noImposto de 15% sobre as criptos aprovado. O que fazer?https://www.youtube.com/watch?v=ARPDonmkCl8",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476160",
  "comments": [
    {
      "author": "TryNinja",
      "created_time": "December 01, 2023, 02:18:56 PM",
      "body": "Quote from: TheIrishman on December 01, 2023, 11:08:27 AMNotem que o texto aprovado prevê a cobrança do imposto sobre os lucros mesmo que não ocorra alienação (venda ou troca). Ou seja, o cidadão simplesmente terá que conseguir levantar de alguma forma o valor do imposto sobre a valorização para pagar à Receita Federal. Mais detalhes nos vídeos abaixo.Bom, já há concordancia sobre esse tópico?Na última discussão o que eu entendi é que *não* há cobrança do imposto sem alienação (venda ou troca). A menos que tenham mudado o texto, sigo com a mesma opinião de que isso pode ser \"clickbait\" pra botar mais pânico ainda:Quote from: TryNinja on October 29, 2023, 07:22:28 PMQuote from: jpouza on October 29, 2023, 07:04:53 PM\"Art. 3º:§ 2º Os rendimentos de que trata o caput serão computados na DAA e submetidos à incidência do IRPF no período de apuração em que forem efetivamente percebidos pela pessoa física, como no recebimento de juros e outras espécies de remuneração e, em relação aos ganhos,inclusive de variação cambial sobre o principal, no resgate, na amortização, na alienação, no vencimento ou na liquidação das aplicações financeiras.2.3) Prevê regulamentação futura, provavelmente revogará atos anteriores:§ 3º O enquadramento de ativos virtuais e de carteiras digitais como aplicações financeiras no exterior constará da regulamentação da Secretaria Especial da Receita Federal do Brasil do Ministério da Fazenda.\"3) \"Conclusos para o Despacho\"  Entendi diferente esse trecho, o contrário do que você falou.Basicamente:- No resgate, na amortização, na alienacão, no vencimento ou na liquidação:-- Teve ganho? Paga-- Teve ganho INCLUSIVE de variação cambial? PagaOu seja, mesmo assim só ocorre no resgate/vencimento/liquidação = venda.Para ser mais claro, o trecho já decreta o condicional para a analise da necessidade de pagamento: \"como no recebimento de juros e outras espécies de remuneração [...] no resgate, na amortização, na alienação, no vencimento ou na liquidação das aplicações financeiras.\"Só depois que se complementa o que se entende como ganho (variação cambial):\"[...] E, em relação aos ganhos, inclusive de variação cambial sobre o principal [...]\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "December 01, 2023, 08:11:16 PM",
      "body": "Como já respondi sobre esse assunto em outro tópico. Por enquanto não vai mudar em nada em relação a criptomoedas. Está no texto do projeto de lei:\" O enquadramento de ativos virtuais e de carteiras digitais como aplicações financeiras no exterior constará da regulamentação da Secretaria Especial da Receita Federal do Brasil (RFB). Os rendimentos que não constituam aplicações financeiras nos termos da nova norma, continuam sujeitos às regras atuais e específicas de tributação dispostas no art. 21 da Lei nº 8.981, de 20 de janeiro de 1995. \"Para mudar, terá que mudar a Instrução normativa 1888 da Receita Federal. Senão fica conflitante esse projeto de lei, quase lei, com a IN 1888. E também, logo vai parar no Supremo. É inconstitucional cobrar imposto sem alienação e obtenção de ganho de Capital. Em tributação, não se pode cobrar imposto sobre lucro sem fato gerador.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "December 01, 2023, 10:03:30 PM",
      "body": "Quote from: Paredao on December 01, 2023, 08:11:16 PMEm tributação, não se pode cobrar imposto sobre lucro sem fato gerador.Exatamente.... de vez em quando aparece alguém aqui c essa dúvida sem pé nem cabeça. Nem me preocupo c isso.Mas como falei, investimentos no exterior agora serão um problema.Em vez de aumentarem os 35k de isenção mensal (corrigindo pela inflação) acabaram com ele... e o das criptomoedas não deve durar muito.O cerca está fechando para quem deseja sair do país...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheIrishman",
      "created_time": "December 02, 2023, 07:32:38 AMLast edit: December 03, 2023, 07:48:54 AM by TheIrishman",
      "body": "Quote from: Paredao on December 01, 2023, 08:11:16 PMEm tributação, não se pode cobrar imposto sobre lucro sem fato gerador.Vá dizer isso para o \"supremo\" Gilmarzão, que \"mudou de opinião\" sobre a cobrança obrigatória do imposto sindical - digo, \"constribuição assistencial\"   - mesmo para não filiados, e foi acompanhado pelo resto dos \"supremos\". O mesmo sujeito que mandou soltar três vezes o Jacob Barata, conhecido como \"o Rei do Ônibus\" no Rio - Gilmar é padrinho de casamento da filha do indivíduo - e, novamente, teve sua decisão ratificada pelos outros \"supremos\". O mesmo \"supremo\" que mandou arquivar o inquérito da PF contra Arthur Lira e aliados no caso dos desvios na compra de kits de robótica para municípios alagoanos (terra do Lira), determinou à PF o fim das investigações e ainda ordenou que a PF destruísse as gravações (provas) do assessor do Arthur Lira a respeito.Quote from: bitmover on December 01, 2023, 10:03:30 PMQuote from: Paredao on December 01, 2023, 08:11:16 PMEm tributação, não se pode cobrar imposto sobre lucro sem fato gerador.Exatamente.... de vez em quando aparece alguém aqui c essa dúvida sem pé nem cabeça. Nem me preocupo c isso.Prezado, num país em que o STF muda o entendimento sobre o que é constitucional e o que não é de acordo com os interesses do conchavo político em poder no momento e/ou dos amigos e parentes dos \"supremos\" e/ou de seus próprios interesses pessoais, não existe \"dúvida sem pé nem cabeça\" no que diz respeito a inconstitucionalidades. O entendimento do autor do vídeo é de que a cobrança ocorrerá sem a alienação. Você coloca sua mão no fogo pelo STF, caso isto se torne norma e a \"corte\" seja acionada para decidir quanto à sua constitucionalidade? Eu não coloco.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "December 02, 2023, 10:57:01 AM",
      "body": "Quote from: TheIrishman on December 02, 2023, 07:32:38 AMO entendimento do autor do vídeo é de que a cobrança ocorrerá sem a alienação. Isso não está escrito em lugar nenhum.Se estiver, poste por favor.Mesmo nesse video ele não postou hora nenhuma sobre tributação sem venda. \"Rendimentos de carteiras digitais\" (2min do video) não quer dizer tributar sem vender... Pode ser mais relacionado a airdrops, rendimentos de dex, staking e coisas do genero (ai sim pode gerar imposto).Sobre os 8% de imposto sem alienação, é totalmente opcional e voce nao prcisa fazer. É uma tributação favorecidaQuoteTambém é criada uma janela de transição, com adesão facultativa, em condições específicas de tributação favorecida, para o contribuinte atualizar o valor de bens e direitos mantidos fora do Brasil e se adequar às novas normas. Neste caso, a alíquota cobrada é de 8%.https://www.infomoney.com.br/politica/investimentos-no-exterior-terao-aliquota-unica-de-15-a-partir-de-2024/#:~:text=Todos%20os%20rendimentos%20do%20capital%20aplicado%20no%20exterior,tributados%20como%20rendimento%20ou%20como%20ganho%20de%20capital.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheIrishman",
      "created_time": "December 02, 2023, 11:40:37 AMLast edit: December 03, 2023, 07:49:03 AM by TheIrishman",
      "body": "Quote from: bitmover on December 02, 2023, 10:57:01 AMQuote from: TheIrishman on December 02, 2023, 07:32:38 AMO entendimento do autor do vídeo é de que a cobrança ocorrerá sem a alienação. Isso não está escrito em lugar nenhum.Se estiver, poste por favor.Tentar argumentar com vocês é como discutir com uma parede. As analogias que o autor do vídeo faz são justamente para mostrar a inconstuticionalidade do que o PL pretende implementar - a tributação sem alienação (fato gerador). Ele precisa desenhar pra você entender? A atitude de \"sabe-tudo\" de alguns aqui, especialmente a sua e a do paredão, afasta MUITA gente desse subfórum - isso quando os dois não partem para o teatrinho de postagens de apoio mútuo. Basta olhar o histórico de posts de vocês dois para confirmar. Já notou como a quantidade de usuários aqui é ínfima com relação ao número de usuários brasileiros de cripto? Pois é.Enfim, permaneçam na sua bolha alienada patética. Até o dia em que ela estourar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheIrishman",
      "created_time": "December 02, 2023, 11:51:15 AMLast edit: December 02, 2023, 12:31:53 PM by TheIrishman",
      "body": "Quote from: TryNinja on December 01, 2023, 02:18:56 PMQuote from: TheIrishman on December 01, 2023, 11:08:27 AMNotem que o texto aprovado prevê a cobrança do imposto sobre os lucros mesmo que não ocorra alienação (venda ou troca). Ou seja, o cidadão simplesmente terá que conseguir levantar de alguma forma o valor do imposto sobre a valorização para pagar à Receita Federal. Mais detalhes nos vídeos abaixo.Bom, já há concordancia sobre esse tópico?Na última discussão o que eu entendi é que *não* há cobrança do imposto sem alienação (venda ou troca). A menos que tenham mudado o texto, sigo com a mesma opinião de que isso pode ser \"clickbait\" pra botar mais pânico ainda:Vamos esperar que seja mesmo apenas \"click bait\". Mas a minha percepção é de que vão, sim, forçar uma tributação sem alienação. É uma insanidade tributária e constitucional? Obviamente - o que nunca impediu insanidades tributárias e constitucionais de serem estabelecidas no país.Segue outro vídeo em que o entrevistado Alexandre Senra - Procurador da República e coordenador do Grupo de Trabalho de Criptoativos do Ministério Público Federal - responde enfaticamente à pergunta de um espectador a respeito. Já coloquei o link nesse ponto.PERGUNTA: \"mas para ser considerado rendimento, eu tenho que ter realizado? (trocado por fiat)\"RESPOSTA: \"NÃO\" (e ele complementa com uma explicação muito interessante)https://www.youtube.com/watch?v=ryye5B6si4U&t=2000s",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "December 02, 2023, 01:34:57 PM",
      "body": "Quote from: TheIrishman on December 02, 2023, 11:40:37 AMTentar argumentar com vocês é como discutir com uma parede. As analogias que o autor do vídeo faz são justamente para mostrar a inconstuticionalidade do que o PL pretende implementar - a tributação sem alienação (fato gerador). Ele precisa desenhar pra você entender? Mostre seus argumentos e vamos debater, achei o video muito fraco e nao mostra em nenhum local algo escrito como \"o imposo será cobrando independente da venda ou alienacao\". oEm nenhum momento ele mostra isso escrito. O Texto nao fala em imposto sem venda, fala justamente o oposto. Na verdade está escrito o opost\"inclusive ganhos na venda\".Olhei boa parte do video e achei muito fraco os argumentos. Nao tem nenhum jornal ou alguém com grande conhecimento amplamente reconhecido com essa opniao. Se voce olhar na globo.com, infomoney, estadao, etc ninguem esta falando isso. Pq eu achar que  todos estao errados menos esses 3 youtubers e em voce?Se esse fosse o entendimento mais correto e mais aplicado da nova lei, simplesmente estaria em tudo que é jornal de grande credibilidade, ou pelo menos em alguns. Mas está longe de ser o caso.Quote from: TheIrishman on December 02, 2023, 11:40:37 AMA atitude de \"sabe-tudo\" de alguns aqui, especialmente a sua e a do paredão, afasta MUITA gente desse subfórum - isso quando os dois não partem para o teatrinho de postagens de apoio mútuo. Basta olhar o histórico de posts de vocês dois para confirmar. Já notou como a quantidade de usuários aqui é ínfima com relação ao número de usuários brasileiros de cripto? Pois é.Enfim, permaneçam na sua bolha alienada patética. Até o dia em que ela estourar.Sobre eu e o Paredao, voce pode olhar mesmo nosso historico, temos varias discussoes sobre politica, ele é de esquerda e eu de direita....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheIrishman",
      "created_time": "December 02, 2023, 01:46:48 PMLast edit: December 03, 2023, 07:49:13 AM by TheIrishman",
      "body": "Quote from: bitmover on December 02, 2023, 01:34:57 PMNao tem nenhum jornal ou alguém com grande conhecimento amplamente reconhecido com essa opniao. Se voce olhar na globo.com, infomoney, estadao, etc ninguem esta falando isso. Pq eu achar que  todos estao errados menos esses 3 youtubers e em voce?Quote from: TheIrishman on December 02, 2023, 11:51:15 AMSegue outro vídeo em que o entrevistado Alexandre Senra - Procurador da República e coordenador do Grupo de Trabalho de Criptoativos do Ministério Público Federal - responde enfaticamente à pergunta de um espectador a respeito. Já coloquei o link nesse ponto.PERGUNTA: \"mas para ser considerado rendimento, eu tenho que ter realizado? (trocado por fiat)\"RESPOSTA: \"NÃO\" (e ele complementa com uma explicação muito interessante)https://www.youtube.com/watch?v=ryye5B6si4U&t=2000sQual parte em que eu menciono que o entrevistado (não \"youtuber\") é UM PROCURADOR DA REPÚBLICA E COORDENADOR DO GRUPO DE TRABALHO DE CRIPTOATIVOS DO MPF a sua mente limitada de esquizofrênico seguidor de seita política não compreendeu ou preferiu ignorar? Foda-se a mídia vendida, quem vai saber mais sobre como essa legislação pode ser implementada do que alguém como ele?Quote from: bitmover on December 02, 2023, 01:34:57 PMSobre eu e o Paredao, voce pode olhar mesmo nosso historico, temos varias discussoes sobre politica, ele é de esquerda e eu de direita....Antes de passar a te ignorar, apenas um comentário. O que é \"esquerda e direita\" pra vocês, ter apoiado um dos dois conchavos imundos populistas (13 ou 22) que se equivalem e se retroalimentam? Malditas sejam essas catervas a que vocês pertencem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "December 02, 2023, 02:09:01 PM",
      "body": "Quote from: TheIrishman on December 02, 2023, 01:46:48 PM a sua mente limitada de esquizofrênico seguidor de seita política não compreendeu ou preferiu ignorar? Foda-se a mídia vendida, quem vai saber mais sobre como essa legislação pode ser implementada do que alguém como ele?Esse é o o tipo de atitude que você estava falando?Sinto muito você ter ficado ofendido com minha falta de preocupação sobre ser tributado sem vender",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "December 02, 2023, 08:24:29 PM",
      "body": "Quote from: TheIrishman on December 02, 2023, 11:40:37 AMTentar argumentar com vocês é como discutir com uma parede. As analogias que o autor do vídeo faz são justamente para mostrar a inconstuticionalidade do que o PL pretende implementar - a tributação sem alienação (fato gerador). Ele precisa desenhar pra você entender? A atitude de \"sabe-tudo\" de alguns aqui, especialmente a sua e a do paredão, afasta MUITA gente desse subfórum - isso quando os dois não partem para o teatrinho de postagens de apoio mútuo. Basta olhar o histórico de posts de vocês dois para confirmar. Já notou como a quantidade de usuários aqui é ínfima com relação ao número de usuários brasileiros de cripto? Pois é.Enfim, permaneçam na sua bolha alienada patética. Até o dia em que ela estourar.Não sei por que tanta agressividade. Atitude de \"sabe-tudo\"  Eu apenas disse a mesma coisa que as pessoas nos vídeos que você postou disseram. O projeto de lei, agora quase lei, é inconstitucional. O que tem a ver isso com \"saber tudo\" Agora, as pessoas se afastarem desse subfórum, ao meu ver, seria por outro motivo. É que quando elas chegam aqui com perguntas impertinentes e descabidas, elas já recebem um \"choque de realidade\" e acabam não voltando mais.Gostei do vídeo onde o \"Procurador da República e coordenador do grupo de trabalho de criptoativos do MPF\" diserta sobre o Direito. Eu mesmo sempre falo por aqui no fórum que o Direito não é uma ciência exata, basta ver meus comentários em outros tópicos.Agora, não entendi o motivo que você colocou a fala do Procurador da República. É essa pessoa que vai representar contra o cidadão, perante a justiça, caso o mesmo não pague os impostos devidos ao Fisco. Quanto a eu e o Bitmover, sempre divergirmos de muitas coisas por aqui. Principalmente em se tratando de política. Eu não sou Esquerda. Para ser mais preciso, sou centro-esquerda. Sou social-democrata. Sou a favor do Estado de Bem Estar Social. Algo que o Bitmover e totalmente contrário. E nem por isso brigamos. Há um respeito mutuo entre nós. Fica na Paz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheIrishman",
      "created_time": "December 03, 2023, 07:32:51 AMLast edit: December 03, 2023, 09:03:37 AM by TheIrishman",
      "body": "Quote from: Paredao on December 02, 2023, 08:24:29 PMbla bla blaOhhh, quanta sinalização de virtude! Os mais incautos devem ter se comovido. Escreva ao Papa e peça a sua canonização.Quote from: Paredao on December 02, 2023, 08:24:29 PMNão sei por que tanta agressividade. Atitude de \"sabe-tudo\"  Eu apenas disse a mesma coisa que as pessoas nos vídeos que você postou disseram. O projeto de lei, agora quase lei, é inconstitucional. O que tem a ver isso com \"saber tudo\" Melhor agressivo e honesto do que cínico e manipulador. Você e o bozolóide discordam patologicamente de qualquer um que venha oferecer uma visão diferente de algo e que afete a necessidade de vocês de ter sempre razão e de ter sempre a última palavra. Vocês não opinam, como o TryNinja, por exemplo. Vocês \"exigem\" que as suas posições prevaleçam. Tem sido assim desde que vocês infestaram esse subfórum com as suas presenças repulsivas.Quote from: Paredao on December 02, 2023, 08:24:29 PMAgora, as pessoas se afastarem desse subfórum, ao meu ver, seria por outro motivo. É que quando elas chegam aqui com perguntas impertinentes e descabidas, elas já recebem um \"choque de realidade\" e acabam não voltando mais.A única pergunta que eu fiz foi retórica, quando o bozolóide falou em \"esquerda e direita\". O imbecil, assim como a escória lulopetista que o GEROU, só consegue enxergar o mundo dentro dessas \"caixinhas\" e de acordo com esses rótulos. Você é obviamente mais inteligente e soube distorcer e criar uma narrativa com mais habilidade. O câncer subhumano atualmente no poder - escolhido pelo general Golbery lá na época da ditadura para liderar uma oposição ilusória - é especialista nisso. Se eu tivesse algum tipo de \"dúvida\", com certeza não viria tentar esclarecê-la com vocês ou algum outro habitante da bolha que é esse subfórum.Quote from: Paredao on December 02, 2023, 08:24:29 PMGostei do vídeo onde o \"Procurador da República e coordenador do grupo de trabalho de criptoativos do MPF\" diserta sobre o Direito. Eu mesmo sempre falo por aqui no fórum que o Direito não é uma ciência exata, basta ver meus comentários em outros tópicos.Agora, não entendi o motivo que você colocou a fala do Procurador da República. É essa pessoa que vai representar contra o cidadão, perante a justiça, caso o mesmo não pague os impostos devidos ao Fisco. Mais uma tentativa baixa de criar uma narrativa para distorcer o contexto e atacar o interlocutor. A fala do indivíduo foi apresentada porque não tem ninguém aqui que conheça mais sobre como o sistema funciona do que alguém como um procurador da república, especialmente um que coordena um grupo interno do MPF sobre criptoativos. No mais, eu quero que ele se foda.Quote from: Paredao on December 02, 2023, 08:24:29 PMQuanto a eu e o Bitmover, sempre divergirmos de muitas coisas por aqui. Principalmente em se tratando de política. Eu não sou Esquerda. Para ser mais preciso, sou centro-esquerda. Sou social-democrata. Sou a favor do Estado de Bem Estar Social. Algo que o Bitmover e totalmente contrário. E nem por isso brigamos. Há um respeito mutuo entre nós. Em política, talvez. No resto, vocês agem igualzinho, e juntos. Não há um tópico de alguém onde vocês consigam não dar pitaco. E não me venha com essa conversa fiada de \"centro-esquerda\". Se não votou nulo no 2o turno de 2022, é apoiador do desgraçado maldito que é o grande responsável pela tragédia brasileira, incluindo a ascenção do bolsonarismo. Quanto ao seu teatrinho de \"respeito mútuo\", creio que você saiba bem o que fazer com ele.Quote from: Paredao on December 02, 2023, 08:24:29 PMFica na Paz. Todo o inferno, infelicidade e desgraça possível pra você e todos que você ama.O tópico agora será fechado, já que vocês conseguiram (como de praxe) desvirtuá-lo totalmente. Fiquem à vontade para seguir compensando as frustrações de suas vidas pessoais medíocres \"tendo razão\" num subfórum de merda que ninguém minimamente relevante nem usa mais.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}