{
  "id": "topic_5441570",
  "title": "FirmWars",
  "author": "FirmWars",
  "created_time": "February 28, 2023, 03:26:11 PM",
  "content": "I spent five years away from friends and family, because whenever I bring up how crypto can be life-changing they always discourage me, maybe because I lost some money to few trades and I was not that good at trading at the time, I got mad one day and I left the city and move to another city, because they won't let me be and they felt I will waste my life away.Today, I now own a home and a nice ride, I was able to get married and settle down, but now they feel like they made a huge mistake for not listening to me. I believe this was the best decision I've ever made, I was able to gathered some BTC in 2019  to 2020 bear market and also with the help of my trading skills. Only God knows what would have happened if I never left, my mind kept telling me to venture into crypto at the time and even my own family shut the idea down. I don't know why and now they are asking for my help, I have to do it since they are my family, and even my friends are asking for help, would you help your discouraging friends if you are in my shoe? They were my friends, but not anymore, I believe friends should be supportive of each other, am I wrong.If you are a crypto newbie, make sure you set your mind on your goals, do not be discouraged by anyone, people can't see the future, we are not gods or demigods who can read the future, do not listen to any naysayers.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441570",
  "comments": [
    {
      "author": "HajiBagi",
      "created_time": "February 28, 2023, 04:17:09 PM",
      "body": "Wow, your story about how people treat you when you are unsure of your beliefs was so heartbreaking. It would be a good idea for a new investor to put any thoughts about a bitcoin investment in the back of his mind because no matter how challenging it is, it will undoubtedly be successful because no one is born to lose.In addition, if your family is asking for your assistance, you should assist them and forget about everything they did because no matter what, they are still your family, they might be thinking something else because I believe they don't know much about bitcoin investment. You can even help your friends by showing them that you have a good heart and making them believe that investing in bitcoin is a good way to achieve your goals in life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "February 28, 2023, 04:37:31 PM",
      "body": "Quote from: FirmWars on February 28, 2023, 03:26:11 PMI spent five years away from friends and family, because whenever I bring up how crypto can be life-changing they always discourage me, maybe because I lost some money to few trades and I was not that good at trading at the timeNo one will want to believe in what you're saying if the result is not showing in you, you want to talk about bitcoin to someone you know very well, there's high tendencies they won't believe byou until they see the results in you, they may also consider how internet scam is going wide on the digital networks as everyone wants to get rich quick and scam is increasing, they may not want to be scammed the secon time but only your own result will convince them enough in giving a try.Quote from: FirmWars on February 28, 2023, 03:26:11 PMIf you are a crypto newbie, make sure you set your mind on your goals, do not be discouraged by anyone, people can't see the future, we are not gods or demigods who can read the future, do not listen to any naysayers. Same way Satoshi Nakamoto started very strong but people doubted his delivery capacity because of fear of missing out and now it has turned into a global recognition, everybody want to know about bitcoin, that decentralized digital currency trending online everywhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z390",
      "created_time": "February 28, 2023, 04:49:05 PM",
      "body": "You can't blame anyone for this, do you know how many times families have safe some people from grave mistakes? They have every right to try and stop you because this days everything online is 90% scam, I don't know if anyone have heard about MMM before? It is a Ponzi scheme and many people took this to their homes and confused their friends and families to invest, they end up losing all their money, I believe this is why some people don't believe in Bitcoin and they don't bother to do research because they have male up their minds that Bitcoin is scam. So anyone, most especially, parents will try to stop you if you bring any online investment idea to them as your new goal, this doesn't mean they hate you, it is love. You took the risk and it favored you, I am happy for you, but do not blame anyone for discouraging you. Sometimes, when a door opens, only you will see a way through and those close to you will see something else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "March 01, 2023, 12:25:41 AM",
      "body": "I don't know if your story is real or not. But in summary you are trying to show us that you got rich trading crypto and you left your house, family and friends for not supporting you in your crypto trading. Now somehow you got rich from crypto trading and now your friends and family are trying to get you back or they ask for help from you. Now you are confused about whether you help them or not. At first, you should not have left your family just they discourage you from doing what you were doing with crypto/bitcoin. It was not a good move from you.I agreed with the part don't get discouraged by others but also don't leave your family just because they don't see the potential of what you are doing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "March 01, 2023, 04:46:24 AM",
      "body": "Quote from: FirmWars on February 28, 2023, 03:26:11 PMIf you are a crypto newbie, make sure you set your mind on your goals, do not be discouraged by anyone, people can't see the future, we are not gods or demigods who can read the future, do not listen to any naysayers. Newbies must try all decisions, so if they never have had any experience of losing money, they will not give up and be cured. I believe successful people out there have very much experience with losing millions of dollar money before success. and that will be whipped for the better in the future. Newbie, If you never try anything, you will be a weak person, let's try to be lost a lot of money, and learn from that experience to be strong and know what is good and what is bad before make the decision.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "March 01, 2023, 04:55:53 AM",
      "body": "Trading in general — regardless if cryptocurrency trading or not, is such a difficult path to take that you really can't blame people for being skeptical/cautious. Long-term success rates are staggeringly bad that you're better off doing something else instead.Assuming you're telling a true story of you doing well, don't get too cocky — because not because you did well in the past, doesn't automatically you're going to do well in the long-term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "March 01, 2023, 06:40:48 AM",
      "body": "I hope you are content with what you have received. But can a person be happy when his family needs something? No one is obliged to believe you in any of your ideas; another thing is important. How much do you believe in it yourself? And only after receiving the results can you say that you are a winner. I don’t understand what the grudge is. But if you refuse to help your friends or family today, how are you different from them?People should be above harboring resentment against their relatives. And so if you are talking about friends as unimportant people, you probably have never had friends, or you do not understand the whole meaning of real friendship.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "March 01, 2023, 10:04:18 AM",
      "body": "However, your family and friends have advised you well. It's just that maybe you are overinterpreting it and not taking any good out of it. Good people will give good advice based on what they have experienced or heard bad stories.Anywhere, someone more experienced than you in crypto trading will be the first to warn of the risks instead of profits. You should be aware of the risks regardless of how involved you are in the crypto space.Quote from: FirmWars on February 28, 2023, 03:26:11 PM-snip-I don't know why and now they are asking for my help, I have to do it since they are my family, and even my friends are asking for help, would you help your discouraging friends if you are in my shoe? They were my friends, but not anymore, I believe friends should be supportive of each other, am I wrong.I think you should help them if you want them to hear about your success story during a new life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "March 01, 2023, 10:17:29 AM",
      "body": "Quote from: mk4 on March 01, 2023, 04:55:53 AMAssuming you're telling a true story of you doing well, don't get too cocky — because not because you did well in the past, doesn't automatically you're going to do well in the long-term.Life is a process and things get stronger as it goes, sometimes it gets nice or not, yet we are expected to be pliable instead of static. Op made the right step by doing what he thinks, as whatever a man thinketh so he is, but it doesn't guarantee that a person who did succeed from their previous thought won't face some disputes again. That's why it's always good to be free and forget the past, empty yourself, OP, and be useful to your friends and family, like a cup; its usefulness is determined by its emptiness. Let go of how they treated you and help them if you wish. Good luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "March 01, 2023, 08:09:14 PM",
      "body": "I just love the topic because it is self explanatory in itself.In my lifetime, I have never seen anyone with a testimony of success, who didn't attribute it to following their path. I.e, sheer focus on their goals, shunning all forms all distractions that comes from environment, neighbors, friends and family, even colleagues. It works like magic elixir and am not surprised it worked for you OP. Fortune always favor the bold. Your bold move and believe in yourself, triggered your success. Am a firm believer in focusing on goals and nothing else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "March 01, 2023, 08:16:32 PM",
      "body": "It's important to have something that drives you. In that way, it'd be easy to have a reason to be determined and focused. You were probably angry and disappointed that your folks just lost faith in you after an investment went south but I'm real glad that you stuck to your guns and your focus paid off.  Now I think your folks would have something to believe you for😏",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sanitough",
      "created_time": "March 01, 2023, 08:55:05 PM",
      "body": "Quote from: mk4 on March 01, 2023, 04:55:53 AMTrading in general — regardless if cryptocurrency trading or not, is such a difficult path to take that you really can't blame people for being skeptical/cautious. Long-term success rates are staggeringly bad that you're better off doing something else instead.Assuming you're telling a true story of you doing well, don't get too cocky — because not because you did well in the past, doesn't automatically you're going to do well in the long-term. And to think that trading is not for everyone seeing how hard it is, then you can’t put your shoe on to them and blame them for being unsupportive. Just be grateful that you succeed and live a comfortable life right now. But then again, no matter how good you are in trading, that won’t guarantee that you are excuse from losing. You can be profitable today, but maybe tomorrow you will also suffer from a great loss, that’s why trading is somewhat like gambling, it’s never a win-win all the time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Finestream",
      "created_time": "March 01, 2023, 08:59:02 PM",
      "body": "Quote from: lovesmayfamilis on March 01, 2023, 06:40:48 AMI hope you are content with what you have received. But can a person be happy when his family needs something? No one is obliged to believe you in any of your ideas; another thing is important. How much do you believe in it yourself? And only after receiving the results can you say that you are a winner. I don’t understand what the grudge is. But if you refuse to help your friends or family today, how are you different from them?People should be above harboring resentment against their relatives. And so if you are talking about friends as unimportant people, you probably have never had friends, or you do not understand the whole meaning of real friendship. I don’t see any success if you are still hurting deep within. Yes, you are in profits right now, but you can never hold the grudge against your family forever. Family no matter what happens, will always be your family. And real friends will always be friends forever. That’s why instead of hating them because they weren’t there when you need their support, why not share your success to them so that all of you will experience the good life that trading has given you. Do not focus on resentment, just live a good life together with your friends and family. After all, success will not be genuine if you are not completely happy about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "March 01, 2023, 09:11:43 PM",
      "body": "Your drive and determination in life have brought you this far toward achieving your life goal. I'll say you're the patient and focused type after you've overcome all of these obstacles. If your friends who initially discouraged you from investing in bitcoin require your assistance and guidance, you should teach them. Knowledge shared is like a charity from which you will benefit more. Bitcoin investment should not be forced or persuaded, but since they came at their own freewill, go ahead and guide them into the world of bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "March 01, 2023, 09:25:42 PM",
      "body": "Quote from: FirmWars on February 28, 2023, 03:26:11 PMI spent five years away from friends and family, because whenever I bring up how crypto can be life-changing they always discourage me, maybe because I lost some money to few trades and I was not that good at trading at the time, I got mad one day and I left the city and move to another city, because they won't let me be and they felt I will waste my life away.Today, I now own a home and a nice ride, I was able to get married and settle down, but now they feel like they made a huge mistake for not listening to me. I believe this was the best decision I've ever made, I was able to gathered some BTC in 2019  to 2020 bear market and also with the help of my trading skills. Only God knows what would have happened if I never left, my mind kept telling me to venture into crypto at the time and even my own family shut the idea down. I don't know why and now they are asking for my help, I have to do it since they are my family, and even my friends are asking for help, would you help your discouraging friends if you are in my shoe? They were my friends, but not anymore, I believe friends should be supportive of each other, am I wrong.If you are a crypto newbie, make sure you set your mind on your goals, do not be discouraged by anyone, people can't see the future, we are not gods or demigods who can read the future, do not listen to any naysayers. You can’t hold a grudge against your family for giving you advice which they believed was the best at the time. Ever put yourself in their shoes? Imo they were being supportive in the way they could. Imagine it was difficult for them watching you everyday on a computer looking at graphs and charts. Truth to told, bitcoin trading as a full time job seem unorthodox to our parents and they assume it’s same as gambling. You can’t hate a person for being ignorant, you can only teach them to see your point of view. Forget the past, you are living good now I think you should be supportive of your family.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Russlenat",
      "created_time": "March 01, 2023, 09:32:51 PM",
      "body": "Quote from: mk4 on March 01, 2023, 04:55:53 AMTrading in general — regardless if cryptocurrency trading or not, is such a difficult path to take that you really can't blame people for being skeptical/cautious. Long-term success rates are staggeringly bad that you're better off doing something else instead.Assuming you're telling a true story of you doing well, don't get too cocky — because not because you did well in the past, doesn't automatically you're going to do well in the long-term. Trading has always its uncertainties. Even good traders cannot secure profits all the time, as they may eventually lose in some days especially if they trade when the market is not stable. So just be happy because you have made huge profits from trading, but do not expect that you will experience being profitable all the time. And never think that you knew everything about trading, as even professional traders even fail in times when they least expect it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "March 01, 2023, 10:05:45 PM",
      "body": "Quote from: FirmWars on February 28, 2023, 03:26:11 PMI don't know why and now they are asking for my help, I have to do it since they are my family, and even my friends are asking for help, would you help your discouraging friends if you are in my shoe? They were my friends, but not anymore, I believe friends should be supportive of each other, am I wrong.If you are a crypto newbie, make sure you set your mind on your goals, do not be discouraged by anyone, people can't see the future, we are not gods or demigods who can read the future, do not listen to any naysayers. Speaking of supportive friends, that you are being discouraged by your friends not to invest in cryptos doesn't mean they aren't being supportive. I think they are in there own capacity, trying to save you from a lose as they don't know any better. The level of support you would get is that which comes from how much they know which in this case, is only lose and you presumably know better and so, you stay your course. That your friends don't see opportunity where you find one doesn't mean they are not being supportive!You've done yourself good in not listening to the FUD they tried to sell you. Risks is indeed rewarding to the darery. You took your chances and you've won. That proving of yourself as a success is a good enough lesson for your friends. If you can aid them in whatever capacity that brings you peace, you should. That's how to be the bigger and better person.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "savetheFORUM",
      "created_time": "March 03, 2023, 09:53:01 AM",
      "body": "Quote from: FirmWars on February 28, 2023, 03:26:11 PMI spent five years away from friends and family, because whenever I bring up how crypto can be life-changing they always discourage me, maybe because I lost some money to few trades and I was not that good at trading at the time, I got mad one day and I left the city and move to another city, because they won't let me be and they felt I will waste my life away.Today, I now own a home and a nice ride, I was able to get married and settle down, but now they feel like they made a huge mistake for not listening to me. I believe this was the best decision I've ever made, I was able to gathered some BTC in 2019  to 2020 bear market and also with the help of my trading skills. It's good for you that you managed to get success after taking that decision, otherwise, your words wouldn't have been the same. Your friends and family were not wrong from their side, since they probably didn't know much about it, and just because they used to discourage you, it doesn't mean they were against you, but they were simply against the fact that you might ruin yourself and your life.Imagine you moved out of the city, and then couldn't achieve what you did, and then you would also say that they were right, and none of it was worth it. So there are always two sides to a story, it is always better to see both angles and then base your thoughts on that.Regarding help, of course, you should help them out if you are in a situation where you can. They might haven't been in the favor of you being involved with Bitcoin, but they were at least your friends and family, and you've had them since childhood. Don't ruin it just because of your ego.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oti147",
      "created_time": "March 03, 2023, 10:29:19 AM",
      "body": "In this life I believe only myself and I can only trust myself your friends and family advice most can lead you to where and place that you are not supposed to be or path that is not yours but you are their because you wants to respect the wish of others making you to get little which you may feel is comfortable for you but yourself knows that that path is not yours therefore I encourage others to just trust God in all your steps of life do what you have to do to be happy with yourself and to achieve your goals most times we just have to be our own adviser because most people will wants to discourage in any path you wants to take because their can only see the present without the future for me forgive them by introducing them to bitcoin so that there will see what they said you shouldn’t do was what gave you life so pass on that life to them also by doing so their will also tell other people about bitcoin because most people don’t believe that bitcoin actually can change someone story",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}