{
  "id": "topic_5419577",
  "title": "Betcrypto.cr",
  "author": "Betcrypto.cr",
  "created_time": "November 06, 2022, 05:23:09 AM",
  "content": "Hi i am thinking in developing a crypto raffle gameTo make it fair i could do a live stream each week of the drawings and use a program like pickerwheel. com to pick the winner, each ticket is going to cost $1We can donate 10% of all tickets sales to a crypto foundation of our players selection60% of all tickets sales is going to the prize and 30% for the operation cost, signature campaigns , affiliates , servers , ads etc  Let me know what you think",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5419577",
  "comments": [
    {
      "author": "CoinageMint",
      "created_time": "November 06, 2022, 05:25:55 AM",
      "body": "Why not just use the blockchain to decide the winner..Check the collectables board, we use the hash from a future block to find a raffle winner",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Betcrypto.cr",
      "created_time": "November 06, 2022, 05:30:01 AM",
      "body": "Cool thanks i will check it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "November 06, 2022, 05:38:54 AM",
      "body": "Quote from: Betcrypto.cr on November 06, 2022, 05:23:09 AMand 30% for the operation cost, signature campaigns , affiliates , servers , ads etc  I guess you include profits there too, right? Or are you doing it for art's sake? If you are planning to do a signature campaign, also make a good Ann thread on the forum and buy a copper membership. It's cheap and allows you to post images. Many times we see botched projects with a newbie account that don't post images and get nowhere on the forum. As you can see, the gambling section is very busy, and the houses that advertise here move lots and lots of money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Betcrypto.cr",
      "created_time": "November 06, 2022, 05:45:00 AM",
      "body": "Yes, we contemplate profits in the 30% also thanks for the suggestion",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "November 06, 2022, 06:13:42 AM",
      "body": "30% off the top to pay for costs is a bit nuts IMO. Most gambling sites have games that are 1-5% house edge and that's their compensation for server costs advertising and whatever else may be needed. I think you need to come up with some capital before trying to take 30% from the pot. I also feel like lots have tried lotteries and raffle type ideas and have failed. Research the idea and see if its even worth the time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Betcrypto.cr",
      "created_time": "November 06, 2022, 06:16:53 AM",
      "body": "Ok thanks for the feedback well yeah i think we could lower instead of 30% change it to 5%",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AB de Royse777",
      "created_time": "November 06, 2022, 08:53:52 AM",
      "body": "Quote from: Betcrypto.cr on November 06, 2022, 05:23:09 AMTo make it fair i could do a live stream each week of the drawings and use a program like pickerwheel. com to pick the winner, each ticket is going to cost $1This kind of raffles are hard to get traction. People are more into Lotto and EuroMillions type of lotteries. In online, people wants quick result instead of waiting for x amount of time LOL",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Daltonik",
      "created_time": "November 06, 2022, 11:07:40 AM",
      "body": "Quote from: Betcrypto.cr on November 06, 2022, 05:23:09 AMHi i am thinking in developing a crypto raffle gameTo make it fair i could do a live stream each week of the drawings and use a program like pickerwheel. com to pick the winner, each ticket is going to cost $1We can donate 10% of all tickets sales to a crypto foundation of our players selection60% of all tickets sales is going to the prize and 30% for the operation cost, signature campaigns , affiliates , servers , ads etc  Let me know what you think It would be relevant if you had an account with more than 10 million followers on Twitter, for example, then it would attract attention, and so I think few people would be interested because of the small pool of prize money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "November 06, 2022, 12:25:53 PM",
      "body": "Quote from: Betcrypto.cr on November 06, 2022, 06:16:53 AMOk thanks for the feedback well yeah i think we could lower instead of 30% change it to 5% Considering that this is still a new project and probably limited in a budget, getting a 30% income to support the operation is not that bad and this is not pure gambling I guess since it's a raffle game which is purely depend on the luck of every participants. Just create a good plan and rules for this one, and make sure that the reward are very attractive. Anyway, doing live might be ok for now but if you still have other option to make this more fair then much better. Try also to ask for some help with the reputable user here and manage this project together, try to seek their professional opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "November 06, 2022, 12:35:22 PM",
      "body": "I'm no expert in this field, but don't you know that live streams can be pre-recorded and therefore faked? Software like Open Broadcast Studio (OBS) can be used to such purpose. Do you remember all the scam Youtube \"Bitcoin giveaway\" channels with their fake pre-recorded livestreams?I'm sorry to say this.Your idea of an online lottery seems so generic that probably around 1000 people before you had come up with the same idea.1.Sell 1 dollar tickets. Check.2. Pick the lottery winner using random.org, pickerwheel, etc. Check.3. Keep 10-20-30% of the ticket revenue for operational costs and profit. Check.This business model simply doesn't work. So far I have never seen a truly successful online lottery. Good luck with this project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "November 06, 2022, 02:47:12 PM",
      "body": "Lottery from scratch is the hardest thing to become successful because of competition and also you are using only the pot money for the prize which means it will be small because you are just a startup casino. Most of the DEX and DeFi has a built-in lottery games while casino has keno and live games that has lotto type categories that will be the toughest competitors to beat.Do you have huge budget for the startup operation for a couple of months or you will just get it all from the pot on initial release of the game because players will usually don't buy startup casino with less competitive offers in terms of bonus and prize pool.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "November 06, 2022, 02:58:03 PM",
      "body": "Quote from: Betcrypto.cr on November 06, 2022, 05:23:09 AMTo make it fair i could do a live stream each week of the drawings and use a program like pickerwheel. com to pick the winner, each ticket is going to cost $1That is not a provably fair way to make a giveaway because the image you are streaming could be a prerecorded video, or an edited video, so for me that method can be rigged.I would suggest to use the data from a future block to make the giveaways, some weeks ago i posted the guide about how to make real provably fail giveaways, so take a look to it and i hope that information helps to make your game fair for all:[How-To] Make a provably fair giveaway: https://bitcointalk.org/index.php?topic=5416890.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "November 06, 2022, 03:12:57 PM",
      "body": "Participants only get 60% and they give 30% for the casino marketing. Is Jay Leno your host? Forchristsake! This raffle game hasn't started yet but has already attempted to squeeze from users. Maybe you should have thought of the funds to build up your casino. So many have tried with huge funds but failed. They've tried campaigning too for a very minimum weekly pay but the competition is harsh.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "November 06, 2022, 03:44:57 PM",
      "body": "Quote from: Betcrypto.cr on November 06, 2022, 05:23:09 AMand 30% for the operation cost, signature campaigns , affiliates , servers , ads etc  Is your profit included with operation? 'coz you need to prioritize it as for your effort. I like the idea that you've considered donating but atleast compensate your effort as well given that you'd make live videos which would consume time and energy.Anyway, I do also think that the allocation is not clear enough; much better if you would make a breakdown to be more precised. It will help you as well on organizing this project of yours and other aspects of it.Quote from: cabron on November 06, 2022, 03:12:57 PMParticipants only get 60% and they give 30% for the casino marketing. Is Jay Leno your host? Forchristsake! This raffle game hasn't started yet but has already attempted to squeeze from users. Maybe you should have thought of the funds to build up your casino. So many have tried with huge funds but failed. They've tried campaigning too for a very minimum weekly pay but the competition is harsh.Campaigning won't be a good idea if you will have a small fund that will circulate on the whole project. If it is a small one, and you are a solo player you can euther hire or make efforts to minimize the costings and to  balance things out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "November 06, 2022, 03:51:11 PM",
      "body": "To be honest, I'm pretty sure you will have a very few joiners on your lottery if you ever continue and launched it. People who knows crypto are not trusty enough to buy this type of crypto raffle. If you ever tried using pickerwheel to choose a winner, I'm sure people will laugh at your crypto raffle. There are many tutorials on how to make a probably fair raffle system and raffles or giveaways here are doing that. I've never seen anyone use pickerwheel to a crypto raffle, Only company parties are using it. I also think it is too early to think about the promotion since you are just starting to build your idea, 30% of the pot money for marketing and other stuffs is not right. People would just probably choose to play on an established lotto casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Betcrypto.cr",
      "created_time": "November 06, 2022, 04:43:05 PM",
      "body": "Quote from: crzy on November 06, 2022, 12:25:53 PMQuote from: Betcrypto.cr on November 06, 2022, 06:16:53 AMOk thanks for the feedback well yeah i think we could lower instead of 30% change it to 5% Considering that this is still a new project and probably limited in a budget, getting a 30% income to support the operation is not that bad and this is not pure gambling I guess since it's a raffle game which is purely depend on the luck of every participants. Just create a good plan and rules for this one, and make sure that the reward are very attractive. Anyway, doing live might be ok for now but if you still have other option to make this more fair then much better. Try also to ask for some help with the reputable user here and manage this project together, try to seek their professional opinion.  Thanks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "November 06, 2022, 05:34:50 PM",
      "body": "Quote from: abel1337 on November 06, 2022, 03:51:11 PMTo be honest, I'm pretty sure you will have a very few joiners on your lottery if you ever continue and launched it. People who knows crypto are not trusty enough to buy this type of crypto raffle. If you ever tried using pickerwheel to choose a winner, I'm sure people will laugh at your crypto raffle. There are many tutorials on how to make a probably fair raffle system and raffles or giveaways here are doing that. I've never seen anyone use pickerwheel to a crypto raffle, Only company parties are using it. I also think it is too early to think about the promotion since you are just starting to build your idea, 30% of the pot money for marketing and other stuffs is not right. People would just probably choose to play on an established lotto casino. his players will pay for the marketing. that literally sucks. anyway its just his plans for now nothing is lost.i think it will be fun to have a youtube channel for his raffle or just have a wheel of fortune type gambling to build trust to its audience. make it a fun game and he can ask donations from youtube live chat or twitch. he can develop his youtube channel too. that's a win-win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitinity",
      "created_time": "November 07, 2022, 08:38:59 AM",
      "body": "Since you have other plan to create your own casino, better to focus on that one and leave the idea to create a raffle game aside. You can use the raffle as one of your promotion tools for your casino once it is alive. Raffle where players collect ticket by wagering is better and more attractive than a raffle where your players need to buy the tickets. As previously said by other members, raffle game is not attractive at all and it will just waste your time and money because the interest for such lottery/raffle game is so low in this crypto gambling industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "November 07, 2022, 09:45:45 AM",
      "body": "You can adjust the percentage depending on how much will be the pool collected on that raffle game. I think it's good to start with some dry run and like having people to have some incentives like having some free spins after joining that $1. Although it's kind of too much to ask but it's up to you, that's sort of idea is what I think because it should really take the attention of many for you to have that much expectation based on the percentage and cut that you've given as an example.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}