{
  "id": "topic_5461237",
  "title": "Chilwell",
  "author": "Chilwell",
  "created_time": "July 27, 2023, 06:53:01 PM",
  "content": "Original Topic: There are 2^256 private keys out there: how big is that number?Author: fillipponeYesterday I com discova di infamous keys.lol website wen I dey browse Bitcoin rabbit growinghttps://keys.lol(Warnung: Zeitverschwendung!)Basically na website e bi, wch randomly dey generates 128 private keys 4 each page and den checks account balance 4 di associated addresses ( and e does not compress ) in block chain, 2 dey report any positive account balances or transactions wey don past. Wow!If you go find a positive credit on dis client-side generated pages, you go actually own di private keys, so you go be di rightful owner 4 dis credit and notin go prevents you 4rm, transfer it 2 your own wallet.I spend plenty hours 4 dis website and I generate thousands of private keys, of course witout findin anythin, no even one address used, let alone one wit credit.Den I com start 2 dey think about am hw I go improve di process a little bit, and I dey talk to some oda users here in di forum, I think say we go have a script, generates di random private key, den asks 4 my own Bitcoin node 4 di credit at dis address and finally transfers di credit to my own wallet. Working locally go speed up di process a bit, I dey think so.I no say 4rm di start dat di ways to find something were tiny, but I want 2 try it becus if I dey look 4 credit and found nothin, I go be sure, dat nobody go do am disame wit my own bitcoins, wch I keep so carefully in my cold wallet.While wen I dey wait 4  @babo make e disclose his script, I think, \"Fillippone na just a game ball in di game of life\" ... hw is it dat nobody has ever think of am?Back in di rabbit farm, I quickly discovered di Large Bitcoin Colliderhttps://lbc.cryptoguru.org/aboutWow, dat na serious project.Basically, thousands of distributed servers generate and check 26 trillion ( !!! ) of private keys.In di first three years, dey dey manage 2 find 7 private keys. Dat's a lot! I think say di chance go be much less, but dere is probably an error in a wallet dat uses a suboptimal random number generator to create keys. ( Further examinations go be required here! )Make we take a quick look at some numbas:Numba of theoretically possible private keys: 2 ^ 256 or approximately 10 ^ 77Numba of bitcoin addresses: 2 ^ 160Numba of private keys searched by Bitcoin Collider: 2 ^ 160Numba of atoms in di universe: 10 ^ 78 to 10 ^ 82Numba of Bitcoin addresses used: 18.000.000Di numba of private keys ACTUALLY possible, is a little bit smaller dan 2^256, as specified hereMake we work out a few examples.Suppose we get a billion active addresses, each of dem wit a positive balance: we no dis na roughly 10^3 bigger dan di actual numba.Probably di numba of atoms in di universe is 10^3 times bigger dan di number of addresses, so it is fair to say dat finding a private Key wit a positive amount is roughly as likely as finding one of dose atoms spread all over di whole visible universe.How big is a billions of atoms? According to dis Quora answer, it’s smaller dan an E.Coli bacteria. So guess taking this bacteria, shred at atomic level, distribute it in the universe and trying to find one of those an atoms. Pretty tough, isn’t it?Second example is 4rm dis article. Suppose we wan to scan all private keys in search of a positive balance and suppose dat each inhabitant of di earth has a scanning speed one billion times higher dan twice di current computing power of di Bitcoin network, thus:* 10 billion piple;* multiplied by one billion;* multiplied by twice di computing power of Bitcoin, about 100 thousand terahash per second;we obtain: 1,000,000,000,000*1,000,000,000*100,000*100,0000,000,000 = 10^10*10^9*10^5*10^12 = 10^36For simplicity, we  dey round down ‘115,792,089,237,316,195,423,570,985,008,687,907,852,837,564,279,074,904,382,605,163,141,518,161,494,336’ to 10^77, and we obtained dat, if we dey check every single private key, in search of a positive balance, e go take 10^77/10^36 = 10^41 seconds, hw many years e be?Since dere are about 31557600 seconds in a year, it corresponds to abot 10^41/31557600 = 31^33 years, wch is more or less 10^23 times di estimated age of di universe (currently estimated at 13.82 billion years), in short100,000,000,000,000,000,000,000, i.e. about 100 billion billion times di age of di universe.dis video on hw much secure is di SHA 256 algorithm. https://youtu.be/S9JGmA5_unYAll past example did nt account 4 di energy involved in such calculations. Of course all dose very powerful machines go need to be power by some kind of energy. Hw much energy go be necessary? Well, a lot, according 2 dis infographic:Link 2 RedditOda examples about hw much e go take to dey random guess  a private key:Reddit: Time and energy dey require 2 brute-force a AES-256 encryptionFurther references:dis Bitcointalk thread on possible numba 4 bitcoin addressesMastering Bitcoin: Keys, AddressesOda vey big numbas:52!:E Starts wit a Simple Deck 4 Playing CardsHere are only little examples, if you get some additional resources or comment, do not hesitate to post am below and I go add 2 di list!Translation created on the initiative of AOBT",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461237",
  "comments": []
}