{
  "id": "topic_5402018",
  "title": "Maus0728",
  "author": "Maus0728",
  "created_time": "June 10, 2022, 03:56:26 AM",
  "content": "Heya! Is it possible to remove all of the threads from my \"Current Topic Notifications\"?I know I can check all the threads at once by using the checkbox next to \"Started by.\" However, I have more than 80+ pages of threads to clear, and repeating the same process is time-consuming. Is there a bot or SMF function that I'm overlooking?This is the only time I've used these settings in all my years on the forum...LOL:",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402018",
  "comments": [
    {
      "author": "LoyceV",
      "created_time": "June 10, 2022, 05:36:02 AM",
      "body": "I can't help you (and I don't use notify), but maybe the Watchlist is easier in the future:Quote from: theymos on November 01, 2012, 07:41:09 PMI don't understand why anyone would not use the watchlist. You can configure the watchlist to be exactly the same as \"show new replies to your posts\" by configuring your posts to be auto-watched and adding your posted-in topics to your watchlist. After this is done, you can unwatch topics that you don't want to see.Before I read this, I used Show new replies to your posts.. Watchlist is much better  And you can remove all topics at once.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "June 10, 2022, 09:46:59 AM",
      "body": "Quote from: LoyceV on June 10, 2022, 05:36:02 AMI can't help you (and I don't use notify), but maybe the Watchlist is easier in the future:Quote from: theymos on November 01, 2012, 07:41:09 PMI don't understand why anyone would not use the watchlist. You can configure the watchlist to be exactly the same as \"show new replies to your posts\" by configuring your posts to be auto-watched and adding your posted-in topics to your watchlist. After this is done, you can unwatch topics that you don't want to see.Before I read this, I used Show new replies to your posts.. Watchlist is much better  And you can remove all topics at once.Thanks. You just took away that \"headache\" from me. I manually had to delete 13-14 pages of topics using the \"mark all messages as read\" button (the one on the right in the upper corner)- https://bitcointalk.org/index.php?action=unreadreplies. But now I will take your advice and edit the Watchlist as I see fit. Still, I would like to be aware of the changes in some topics.Thanks to Maus0728 for raising this issue, which allowed us to quickly get a solution.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "June 10, 2022, 11:00:57 AM",
      "body": "Quote from: m2017 on June 10, 2022, 09:46:59 AMStill, I would like to be aware of the changes in some topics.Click watch instead of notify",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "June 10, 2022, 11:19:30 AM",
      "body": "Quote from: Maus0728 on June 10, 2022, 03:56:26 AMI know I can check all the threads at once by using the checkbox next to \"Started by.\" However, I have more than 80+ pages of threads to clear, and repeating the same process is time-consuming. Is there a bot or SMF function that I'm overlooking?How many threads are on a page for you to not just be able to hit clear all a few times (if you're clearing everything, you probably don't even need to change pages).I don't think you've explained what you'd want a script to do better, remove everything (it's probably quite easy to make one if so)?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "June 10, 2022, 02:08:40 PM",
      "body": "Quote from: jackg on June 10, 2022, 11:19:30 AMHow many threads are on a page for you to not just be able to hit clear all a few times (if you're clearing everything, you probably don't even need to change pages).I don't think you've explained what you'd want a script to do better, remove everything (it's probably quite easy to make one if so)? Yeah, I think the same way. Like you can do it in just few seconds, say every page there's 10 threads since i don't have that much thread on that list (of course the many the easier and faster), then it could take just few clicks to make an 80 threads to delete on that page maybe even for 100 threads just clicking the \"Started by\" checkbox.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}