{
  "id": "topic_5415455",
  "title": "Buchi-88",
  "author": "Buchi-88",
  "created_time": "September 30, 2022, 08:28:26 AMLast edit: October 05, 2022, 12:55:47 PM by Buchi-88",
  "content": "Ich habe schon vor einem Jahr gefragt ob ich von SiNeReiNZzz die Anleitung als Vorlage für das Einbinden von Bildern im Forum verwenden darf und auf miaus Beitrag habe ich mir Heute die Zeit genommen dies auch umzusetzen.Die Bilder (Screenshots) können nur umständlich per extra Uploads auf externe Webseiten vorgenommen werden, vor allem wenn man Screenshots benötigt. In der Firma verwenden wir ein kleines Tool (unsere IT ist sehr heikel beim freigeben von externer Software) und ich verwende es bereits zu Hause auch und stufe es als Bedenkenlos ein.Auch möchte ich auch gleich erklären wie ein einfaches anpassen der Größe der Bilder möglich ist.Greenshot ToolEs bleibt natürlich jeden selbst überlassen ob er sich für das Einfügen ein eigenes Programm installieren möchte, der integrierte Upload zu Imgur ist meiner Meinung nach aber sehr praktisch.1. Schritt: InstallationNach der Installation (die finde ich muss nicht detailliert durchgenommen werden) hat man ein kleines Symbol auf der Taskleiste  und findet mit der rechten Maustaste folgendes Menü.In dem Menü gibt es verschiedene Möglichkeiten des kleinen Tools, ich möchte euch aber nur die Funktionen Bild Editor und Screenshot Upload vorstellen.2. Schritt: Screenshot editieren und UploadenAls Beispiel werde ich den Bitcoin Kurs hernehmen und willkürlich zwei Pfeile einzeichnen.Einen Screenshot machen mit dem Tool ist sehr einfach, mit der Taste \"Druck\" kommt sofort ein Fadenkreuz und man kann das gewünschte Fenster markieren, danach kommt ein weiteres Menü.Da kann man mehrere Optionen auswählen, ich verwende jetzt \"Im Greenshot-Editor öffnen\" wer nur einen Screenshot verwenden will klickt auf \"Zu Imgur hochladen\" und springt zum Schritt 3 der Anleitung.Es gibt verschiedene Bearbeitungsmöglichkeiten und sobald man mit der Bearbeitung fertig ist einfach \"Zu Imgur hochladen\" anklicken und im Hintergrund wird der Link zum Bild abgespeichert.3. Schritt: Bild Link einfügen und als \"Bild\" setzenWenn ihr nun den Link JETZT hier ALLEIN einfach einfügen würdet, sähe das ganze ja so aus:https://i.imgur.com/FfjzpvD.pngDamit es funktioniert, müsst ihr den eben kopierten Link nur noch in die folgend hinterlegten Zeichen packen:Code:[img][/img][img]ᗌLINK/BILD/LINKᗏ[/img]Dann sollte das so ausschauen wie hier:Code:[img]https://i.imgur.com/FfjzpvD.png[/img]Ohne den \"Code\" wird das Bild jetzt korrekt im Beitrag angezeigt, sollte die Größe nicht korrekt sein kann man die im nächsten Schritt einfach ändern.4. Schritt: Größe des Bildes anpassenSollte die Größe des Bildes überdurchschnittlich groß oder klein sein im Beitrag kann man die Größe nachträglich mit \"Edit\" ändern oder man sieht sich seinen Beitrag zuvor im \"Preview\" an (sollte bevorzugt werden):https://i.imgur.com/FfjzpvD.pngDer Link des Bildes sieht folgendermaßen ausCode:[img]ᗌLINK/BILD/LINKᗏ[/img]Um die Größe des Bildes zu ändern benötigt man nur folgenden Zusatz: \"height=xxx\" nach dem ersten [img ...]Code:[img height=xxx]ᗌLINK/BILD/LINKᗏ[/img]Die xxx sind zB. mit 250 bis 450 zu ersetzen, je nach Größe des Original BildesUnd damit habt ihr schon euer (vielleicht sogar erstes) gewünschtes Bild in einer vernünftigen Größe gepostet! Klasse!  Ich weiß, dass es noch viele andere Methoden gibt. Allerdings finde ich diese hier sehr einfach. Auch eben für Leute, welche sich erstmals mit der Materie auseinander setzen.@SiNeReiNZzz Danke das ich einiges von deiner Anleitung übernehmen durfte.Der Beitrag wird nach Wünsche/Anregungen und Fehlern verbessert.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415455",
  "comments": [
    {
      "author": "CoinEraser",
      "created_time": "September 30, 2022, 09:14:09 AM",
      "body": "Schöne Anleitung. Bisher kannte ich dieses Zusatzprogramm noch nicht und habe es auf die übliche Weise gemacht. Werde das Programm heute oder morgen mal an testen. Es scheint ja alles ein wenig zu vereinfachen. Danke dir auf jeden Fall für diesen Tipp.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "September 30, 2022, 09:42:48 AM",
      "body": "Gutes Thema und schöner Beitrag dazu Buchi Dachte mir aber, dass da irgendwas bei mir klingelt und tatsächlich hatten wir das schon Mal: Bilder im Bitcointalk verwenden von 1miau.Ich verwende noch immer ganz klassich Screenshot per Windows-Shift-S + IrfanView + www.abload.de aber es gibt natürlich viele Wege um ans Ziel zu kommen Grundsätzlich kann man das Thema ruhig wieder neu besprechen und eine Anleitung für Greenshot (ich kenne das Programm) ist sicher kein Fehler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Koal-84",
      "created_time": "September 30, 2022, 10:32:00 AM",
      "body": "Quote from: mole0815 on September 30, 2022, 09:42:48 AMGutes Thema und schöner Beitrag dazu Buchi Dachte mir aber, dass da irgendwas bei mir klingelt und tatsächlich hatten wir das schon Mal: Bilder im Bitcointalk verwenden von 1miau.Ich verwende noch immer ganz klassich Screenshot per Windows-Shift-S + IrfanView + www.abload.de aber es gibt natürlich viele Wege um ans Ziel zu kommen Grundsätzlich kann man das Thema ruhig wieder neu besprechen und eine Anleitung für Greenshot (ich kenne das Programm) ist sicher kein Fehler.Verwende auch schon einige Zeit Greenshot, das Einfügen wie du es beschreibst war mir irgendwann einmal zu aufwändig und danach das Bild extra hochladen, da habe ich nach einer Alternative gesucht und bin auch über Greenshot gestolpert und habe es gleich behalten, funktioniert wie in der Beschreibung einwandfrei. https://www.ionos.at/digitalguide/websites/webdesign/screenshot-tools/Aber trotzdem Danke, den Beitrag von miau kenne ich gar nicht mehr, wie du immer alte Beiträge ausgräbst oder noch erinnern kannst?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "September 30, 2022, 11:09:50 AM",
      "body": "@Buchi-88 danke dir für diese anleitung!👌ich persönlich kannte das tool nicht und bin immer (bei meinen ganzen bildern, die ich hier so hochlade) extra über die imgur website gegangendieser schritt fällt nun weg und ich kann nun einfacher und schneller alles erledigen",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "September 30, 2022, 12:57:08 PM",
      "body": "Quote from: Koal-84 on September 30, 2022, 10:32:00 AMAber trotzdem Danke, den Beitrag von miau kenne ich gar nicht mehr, wie du immer alte Beiträge ausgräbst oder noch erinnern kannst?Das hatte ich tatsächlich so noch im Hinterkopf (warum auch immer) Damals habe ich auch das kleine Hilfstool von abload.de installiert und eine Zeit lang verwendet: https://abload.de/tool.phphttps://abload.de/hilfe.php#toolAuch damit gibt es die Möglichkeit nach die Bilder einfach upzuloaden aber wie so oft ist es einfach nur Geschmackssache und hier geht es ja um Greenshot",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "October 01, 2022, 01:04:13 AM",
      "body": "Danke für die detaillierte Anleitung.  Quote from: Buchi-88 on September 30, 2022, 08:28:26 AMEs gibt verschiedene Bearbeitungsmöglichkeiten und sobald man mit der Bearbeitung fertig ist einfach \"Zu Imgur hochladen\" anklicken und im Hintergrund wird der Link zum Bild abgespeichert.Das ist praktisch, weil bei Imgur der in der URL angezeigte Link (zumindest damals) nicht als Bild einfügen ging und auch die Option \"Link kopieren\" von Imgur nur den normalen Link ergibt, der nicht einbinden geht. Daher der Teil in meiner Anleitung, immer auf das hochgeadene Bild zu klicken (Linksklick) und dann \"Bildaddresse kopieren\" zu wählen. Es braucht anscheinend immer den i.imgur Link (mit dem i davor). Und für schnelle Bildbearbeitung (Pfeile, Rahmen) nehme ich normal Paint 3D, welches bei Windows standardmäßig dabei ist.  Da lassen sich auch Screenshots manuell schneiden.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bullrun2024bro",
      "created_time": "October 01, 2022, 12:14:37 PM",
      "body": "Quote from: Buchi-88 on September 30, 2022, 08:28:26 AM~Schöner Thread. Sehr nützliches Tool! Ich nutze die Fireshot Extension, die es für einige Browser (z.B. Chrome oder Firefox) gibt. Funktioniert seit einigen Jahren problemlos. Insbesondere die zuschneide Funktion und das automatische Zwischenspeichern, macht es für die spätere Verwendung im Forum oder bei Twitter sehr einfach. Dann müllt man seinen Computer nicht mit diversen Bilder für die einmalige Verwendung voll.Aber ansonsten funktioniert es ähnlich wie von dir beschrieben.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Buchi-88",
      "created_time": "October 05, 2022, 12:59:40 PM",
      "body": "Quote from: 1miau on October 01, 2022, 01:04:13 AMDas ist praktisch, weil bei Imgur der in der URL angezeigte Link (zumindest damals) nicht als Bild einfügen ging und auch die Option \"Link kopieren\" von Imgur nur den normalen Link ergibt, der nicht einbinden geht. Daher der Teil in meiner Anleitung, immer auf das hochgeadene Bild zu klicken (Linksklick) und dann \"Bildaddresse kopieren\" zu wählen. Es braucht anscheinend immer den i.imgur Link (mit dem i davor). Und für schnelle Bildbearbeitung (Pfeile, Rahmen) nehme ich normal Paint 3D, welches bei Windows standardmäßig dabei ist.  Da lassen sich auch Screenshots manuell schneiden. Das ist mir auch aufgefallen (auch wenn ich mich an deine Anleitung nicht mehr erinnern konnte und habe den Titel auch etwas angepasst) mit dem \"i\" davor und habe da eine Alternative gesucht und mit Greenshot gefunden. Die Standard Bearbeitungen von \"Paint\" hat Greenshot auch und reicht mir bei 95% aller Bilder aus.Quote from: bullrun2020bro on October 01, 2022, 12:14:37 PMIch nutze die Fireshot Extension, die es für einige Browser (z.B. Chrome oder Firefox) gibt. Funktioniert seit einigen Jahren problemlos. Insbesondere die zuschneide Funktion und das automatische Zwischenspeichern, macht es für die spätere Verwendung im Forum oder bei Twitter sehr einfach. Dann müllt man seinen Computer nicht mit diversen Bilder für die einmalige Verwendung voll.Danke kannte ich noch gar nicht, werde ich bei Gelegenheit einmal testen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}