{
  "id": "topic_5447210",
  "title": "Sadki004",
  "author": "Sadki004",
  "created_time": "April 02, 2023, 03:56:55 AMLast edit: April 02, 2023, 02:27:25 PM by Sadki004",
  "content": "The reason of making Bitcoin in the first time is decentralized money and make P2P safely but now we can see many platform start controlling this crypto currency by KYC . My question is can we make platform that can we verify account by deposit only . Account have two wallet one of crypto and other with real money he can swap and withdrawal money or crypto anytime",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447210",
  "comments": [
    {
      "author": "digaran",
      "created_time": "April 02, 2023, 04:07:30 AM",
      "body": "There are some and they are unsafe, whatever you do involving fiat you have to abide the laws of governments, they control the banks. Use decentralized exchanges which will let you to freely swap crypto but no fiat though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "April 02, 2023, 05:09:56 AM",
      "body": "It seems like you're want to create an anonymous P2P platform, some existing P2P platform and decentralized exchange won't ask your KYC, but you need to link your bank account or digital wallet that you have verify in order to receive your fiat money.So the problem about your' idea project is about the no KYC wallet that can receive fiat money, I don't know about such wallet and you need to have a high trust on that since it must be not legal or licensed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maslate",
      "created_time": "April 02, 2023, 05:18:54 AM",
      "body": "Quote from: Sadki004 on April 02, 2023, 03:56:55 AMThe reason of making Bitcoin in the first is decentralized money and be P2P safely but now we can see many platform start controlling this crypto currency buy KYC . My question is can we make platform that can we verify account by deposit only . Account have two wallet one of crypto and other with real money he can swap and withdrawal money or crypto anytime Although it's your platform and you can make your own rules, if you want to succeed, you need to follow the standards. KYC is required for users, as you will become regulated by the government when applying for a license.Running a decentralized exchange without permits and licenses is equivalent to running an illegal exchange. I apologize for potentially ruining your plan, but that's the reality now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fullcoinese",
      "created_time": "April 02, 2023, 05:19:17 AM",
      "body": "it could be but it all depends on regulation from your government. because if it's like what you said, the platform will still be in touch with the bank where you live. and the platform must cooperate with the bank for deposit and withdrawal linkages.I'm not sure that's enough to verify account ownership data. and I think KYC will still be the solution to such exchange platform problems.although I'm not really into KYC, it seems that all data nowadays can't be truly anonymous. everyone is more open with their data to accelerate their activities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "April 02, 2023, 07:11:15 AM",
      "body": "Quote from: Sadki004 on April 02, 2023, 03:56:55 AMThe reason of making Bitcoin in the first is decentralized money and be P2P safely but now we can see many platform start controlling this crypto currencyYou can not control Bitcoin and if you can control it, many people would have successfully controlled it before you. Long time before you someone would have controlled it if it is a possible thing to do. Governments will do it first and you would have not seen Bitcoin with its good adoption and high marketcap like today.QuoteMy question is can we make platform that can we verify account by deposit only . Account have two wallet one of crypto and other with real money he can swap and withdrawal money or crypto anytime You can have it on Remitano and that Peer-to-Peer marketplace provides you wallets for Bitcoin, some cryptocurrencies as well as for fiat currencies.You have multiple modes to trade on Remitano: Buy / Sell, Swap, etc.https://remitano.com/Check more withhttps://kycnot.me/List of P2P/no-KYC exchanges",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "April 02, 2023, 08:25:44 AM",
      "body": "If you're planning to involve fiat, I think it needs to be a decentralized exchange. I'm not talking about hybrids or pseudos but an actual one like bisq.network - p2p, private, does not hold funds. Because so long as it's centralized and can be controlled it will receive regulatory pressure if the exchange has gained significant volume.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "April 02, 2023, 08:49:43 AM",
      "body": "Quote from: Sadki004 on April 02, 2023, 03:56:55 AMMy question is can we make platform that can we verify account by deposit only . Account have two wallet one of crypto and other with real money he can swap and withdrawal money or crypto anytime 1. What do you mean by verification only with the deposits?2. Almost every exchange has separate wallet for Bitcoin, ETH, and other thousands of coins as well as fiat but its under the control of service provider which we call as centralized however there are decentralized exchanges are there which lacks liquidity compared to the centralized exchanges.But to answer you question, you can't because it needs banking system so needs to follow the regulations and guidelines so eventually KYC will become a part of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "QueenVera",
      "created_time": "April 02, 2023, 09:47:45 AM",
      "body": "I see no reason why people shy away from KYC and we ought to understand that KYC isn't the fault of this exchanges as well because I know that if they have their ways, they will do everything possible to please their customers and do all they want. And there are other exchanges that might allow you to make deposit and also make withdrawals without doing kyc directly on their platforms but in one way or the other, you might be required to input a fiat payment method that already has physical kyc done in the bank.No matter how it seems, mist times it seems people are confused because the moment they see a platform without KYC, they suspect it to be scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "death69",
      "created_time": "April 02, 2023, 09:51:06 AM",
      "body": "As the Bitcoin frenzy goes \"legen—wait for it—dary,\" more platforms are enforcing KYC rules. But hey, wasn't Bitcoin all about being free from Big Brother? Fear not, there might be a fix that keeps Bitcoin's decentralized soul intact and users safe.Imagine a platform with deposit-only verification, sporting two wallets—one for crypto, another for cold, hard cash. Users prove their identity without killing Bitcoin's core concept. It's a delicate dance between security and user-friendliness, like Homo Deus balancing on a tightrope.If we nail it, we'll kick off a new age of decentralized, P2P currency, free from The Man's control. So, let's keep pushing Bitcoin's limits and strive for a future where cryptocurrency shines in all its decentralized glory!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "April 02, 2023, 03:53:59 PM",
      "body": "Quote from: Sadki004 on April 02, 2023, 03:56:55 AMThe reason of making Bitcoin in the first time is decentralized money and make P2P safely but now we can see many platform start controlling this crypto currency by KYC . My question is can we make platform that can we verify account by deposit only . Account have two wallet one of crypto and other with real money he can swap and withdrawal money or crypto anytime Some platforms were P2P and know-your-customer procedures that were unconditional, continued for many years, and closed at the end. The closest example is the LocalBitcoins platform. We must acknowledge the fact that some use cryptocurrencies in money laundering, financing terrorism, tax evasion, and other illegal things, so KYC is a regulatory and legal condition whose regulations differ from one country to another; so in my opinion, you can create a platform without KYC, but your platform is not expected to last long, or you will be legally liable, in addition to that you mentioned that people could verify their account through deposit only, so how can people to trust your new P2P platform from the first sight and deposit their funds, and how do you ensure that these people are not from sanctioned countries or they are not sanctioned individuals?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "April 03, 2023, 11:21:29 PM",
      "body": "Quote from: MusaMohamed on April 02, 2023, 07:11:15 AMYou can have it on Remitano and that Peer-to-Peer marketplace provides you wallets for Bitcoin, some cryptocurrencies as well as for fiat currencies.You have multiple modes to trade on Remitano: Buy / Sell, Swap, etc.https://remitano.com/Are you aware that remitano need KYC verification?Also, I don't Remitano is anything close to being a peer to peer marketplace because Remitano still acts as a third party.It's just another poor man's version of local bitcoinsThe only truly well-known p2p decentralized exchange is bisq.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "April 03, 2023, 11:57:49 PM",
      "body": "I don't think there are still platforms that you can use that require no KYC at all. There are still some platforms that doesn't require KYC on your initial deposit, but over time they will still be requiring you to complete the pre-requisites, otherwise they will be holding your funds and your account hostage until you complete what they need. It's the way how things work nowadays for crypto; most of the services wouldn't allow you to proceed using them unless you complete their KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gocryptoz",
      "created_time": "April 04, 2023, 02:31:39 AM",
      "body": "most of the the platforms required to complete kyc before trading now its impossible to create new platform without kyc its not 2017 anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "|MINER|",
      "created_time": "April 04, 2023, 04:40:16 AM",
      "body": "Quote from: Sadki004 on April 02, 2023, 03:56:55 AMThe reason of making Bitcoin in the first time is decentralized money and make P2P safely but now we can see many platform start controlling this crypto currency by KYC . My question is can we make platform that can we verify account by deposit only . Account have two wallet one of crypto and other with real money he can swap and withdrawal money or crypto anytime To transact between fiat currency and cryptocurrency, your personal data must be shared, especially bank information. But for avoid kyc verification you can use the exchange service board for to transact the P2P trading. Anyway I don't think you can find any good platform where you can do any transaction without KYC verification especially p2p trading. Moreover, through this forum you can create a local community where you can transact directly through cash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "April 04, 2023, 11:59:51 AM",
      "body": "Quote from: dothebeats on April 03, 2023, 11:57:49 PMI don't think there are still platforms that you can use that require no KYC at all. There are still some platforms that doesn't require KYC on your initial deposit, but over time they will still be requiring you to complete the pre-requisites, otherwise they will be holding your funds and your account hostage until you complete what they need. It's the way how things work nowadays for crypto; most of the services wouldn't allow you to proceed using them unless you complete their KYC. There's a dex called bisq, no central authority and relies on p2p network similar to bitcoin and torrent hence protects itself from censorships. They don't hold user funds as well so there is nothing to hostage. There are some which sits in the middle - basically, centralized but doesn't hold user funds e.g. robosatsHowever don't expect them to be as liquid as mainstream platforms and they may also not be beginner friendly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stadus",
      "created_time": "April 04, 2023, 12:11:37 PM",
      "body": "Quote from: Sadki004 on April 02, 2023, 03:56:55 AMThe reason of making Bitcoin in the first time is decentralized money and make P2P safely but now we can see many platform start controlling this crypto currency by KYC . My question is can we make platform that can we verify account by deposit only . Account have two wallet one of crypto and other with real money he can swap and withdrawal money or crypto anytime If you are considering creating a platform, keep in mind that you must adhere to government regulations and obtain a license to operate. This means that you cannot unilaterally establish your own rules as a provider, as you will be held to regulatory standards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rby",
      "created_time": "April 04, 2023, 12:37:21 PM",
      "body": "Quote from: Sadki004 on April 02, 2023, 03:56:55 AMThe reason of making Bitcoin in the first time is decentralized money and make P2P safely but now we can see many platform start controlling this crypto currency by KYC . My question is can we make platform that can we verify account by deposit only . Account have two wallet one of crypto and other with real money he can swap and withdrawal money or crypto anytime Not every company or project owner actually wanted to implement the know-your-customer policy. It is just a requirement by the law or government in order for you to run your company smoothly. If you do not comply by the know-your-customer policy you might find it difficult to register your company and if there are fraudulent activities, you may not be able to help the government to track whoever that is involved. That is why the government will not be happy to approve, your no KYC project.Fnally, kyc is also good for you as a company to track the members activities in case people would want to manipulate you with multiple accounts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "April 04, 2023, 01:23:14 PM",
      "body": "Quote from: Sadki004 on April 02, 2023, 03:56:55 AMMy question is can we make platform that can we verify account by deposit only . Account have two wallet one of crypto and other with real money he can swap and withdrawal money or crypto anytime Deposit for verification? That sounds like what scammers like to do. What does it prove anyway? If you want to ensure that buyer and seller honor their trade, you need to set up something like a multisig. An initial deposit doesn't serve anything. That can work if you're building a forum and deterring spammers from registering on your website, but it has no value on a trading platform. Especially if you want to integrate fiat and crypto, you'll need more than just a multisig if you want to prevent others from scraping users' data from their marketplace information.I also believe that even if all of the parties involved are anonymous, as long as your platform can ensure or prevent scams from happening, anyone would happily use it. Try to host your business in a country with friendly regulations for anonymous exchange if you want to do it. That being said, I doubt you can be free regardless of where you do your business if you integrate fiat into your platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jaberwock",
      "created_time": "April 05, 2023, 06:55:20 PM",
      "body": "Quote from: gocryptoz on April 04, 2023, 02:31:39 AMmost of the the platforms required to complete kyc before trading now its impossible to create new platform without kyc its not 2017 anymore.I think it's still possible. What about the decentralized exchange? But I think even if your exchange is centralized, adopting KYC can only be optional or only needed if you want to get a license and make your exchange more established.Big crypto exchanges are mainly doing this because governments are also watching them and maybe the governments wants a piece of their income. That is why they are regulating them and regulations involves KYC verifications for the customers. For a small exchange, they shouldn't worry too much about these things but focus first on how can they improve their platform to attract customers to trade on it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}