{
  "id": "topic_5452941",
  "title": "Justtoons",
  "author": "Justtoons",
  "created_time": "May 16, 2023, 01:30:24 PM",
  "content": "I am writing to bring attention to a significant issue that many members, especially beginners and myself are facing when browsing older threads. It has come to my attention that several images uploaded using imgur are currently displaying errors making it difficult for newcomers to understand the content and context of those threads.As a beginner, I have always relied on studying old posts to gain knowledge and insights about various aspects of cryptocurrencies. However, with the disappearance of these images, the threads become incomplete and challenging to comprehend fully. With the help of the script written by @tryninja, users can update all their previous threads. Thanks to joker_josue for the creation of the new Bitcointalk image url web we are glad to have you here in a time of need.I kindly request the assistance members in addressing this issue. It would be greatly appreciated if some users  put in effort  to restore or replace the broken images ensuring that valuable information is accessible to all members including junior members  like myself and newcomers.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452941",
  "comments": [
    {
      "author": "Jawhead999",
      "created_time": "May 16, 2023, 01:35:04 PM",
      "body": "Based on theymos replies, it seems nothing will change.Quote from: theymos on May 12, 2023, 12:41:48 AMI think that what it is is that imgur added a new very restrictive per-IP limit on image downloads. So all ip.bitcointalk.org requests are blocked, but even many Tor exit nodes are being blocked, for example.I'm not going to attempt to play some cat-and-mouse game with imgur, so people will just have to use a different service such as TalkImg.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "May 16, 2023, 01:39:44 PM",
      "body": "Let me quote my old reply regarding same issue sometimes this week.QuoteThe issue I noticed it about a week ago, and a lot of forum members have been complaining about it here on the forum, and a user has also created a thread regarding the issue.  Imgur images suddenly became invalid.There have also been alternative suggestions to the imgur issue, and joker_josue created a specific design for Bitcointalk users to avoid this kind of imgur issue in the future .  TalkImg.com: Image Hosting for BitcoinTalk Today, a new progress was also launched by TryNinja . [Script] Imgur to TalkImg: automatically fix your broken imagesThe issue of Imgur is no longer something new here on the forum, and very soon all those whose post images are affected will have them fixed up again, and those old posts will go back to normal again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bureau",
      "created_time": "May 16, 2023, 01:40:48 PM",
      "body": "Did you check the threads that are active on this board about the same issue? What you said is the main issue on the Meta board. Please check every song thread before you create anew one. There is another topic on the board Beginners & help which suggest a remedy and call for action. Please visit this thread for remedial issues. Please do check this board with open eye why this issue has happened. Thanks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "May 16, 2023, 02:19:53 PM",
      "body": "Quote from: Bureau on May 16, 2023, 01:40:48 PMDid you check the threads that are active on this board about the same issue? What you said is the main issue on the Meta board. Please check every song thread before you create anew one. Based on his post he has knowledge of these threads and information about what's going wrong with imgur images as he has already mentioned about @TryNinja script to convert the images to other site but what he specially talking about is that can anyone replace all those links with new platforms BBcode so the images on the threads are visible again.But the users have to shift the alternate links to make their post images visible and don't use Imgur anymore when we have forum based image hosting platform so use it for betterment and staying away from these third party softwares.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God Of Thunder",
      "created_time": "May 16, 2023, 03:48:34 PM",
      "body": "Quote from: Justtoons on May 16, 2023, 01:30:24 PMI kindly request the assistance members in addressing this issue. It would be greatly appreciated if some users  put in effort  to restore or replace the broken images ensuring that valuable information is accessible to all members including junior members  like myself and newcomers. I thought you are too new not to notice and not to know what was going on. Well, It seems you already know everything. You know why the images are not showing anymore and you know TryNinja and Joker_josue working on it with their website and script. So, what other assistance do you expect from members addressing this issue? Whoever is active in the forum already knows that images on their thread are not showing anymore. They are already using some of the methods TryNinja and LoyceV bring to recover the images. About old threads, Only thread creators and Moderators have access to edit their posts. Moderators are unlikely to edit those posts to replace the images. It's not their job. If the thread creator changes the image link, that's the only way those images can be back. LoyceV downloads around 800K images. Currently, he working on Zip those images by username. If anyone wants to fix the images of their thread, they can knock LoyceV if they want or use the method of TryNinja.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "May 16, 2023, 04:02:17 PM",
      "body": "Alternative solutions for you.Image uploading websites/ scripts for Bitcointalk usershttps://www.talkimg.com/ is a great alternative. Let's try it!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "May 16, 2023, 04:48:49 PM",
      "body": "Op from your days in the forum, observations of the forum and your content here says that you read and seen different scholars threads concerning how to fix the broken image. joker_josue, TryNinja, tranthidung and others have provided different solution to the problem, though the solving is still on process, they are some things they are still doing to fix everything back to normal. Therefore, anything they said we should do, we should up to make the forum back to normalcy with the image problem now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "May 16, 2023, 08:01:36 PM",
      "body": "Quote from: Justtoons on May 16, 2023, 01:30:24 PMI am writing to bring attention to a significant issue that many members, especially beginners and myself are facing when browsing older threads. It has come to my attention that several images uploaded using imgur are currently displaying errors making it difficult for newcomers to understand the content and context of those threads.As a beginner, I have always relied on studying old posts to gain knowledge and insights about various aspects of cryptocurrencies. However, with the disappearance of these images, the threads become incomplete and challenging to comprehend fully. With the help of the script written by @tryninja, users can update all their previous threads. Thanks to joker_josue for the creation of the new Bitcointalk image url web we are glad to have you here in a time of need.I kindly request the assistance members in addressing this issue. It would be greatly appreciated if some users  put in effort  to restore or replace the broken images ensuring that valuable information is accessible to all members including junior members  like myself and newcomers.You are right, there are some old educative topics with imgur broken images that have a wealth of knowledge from where one can draw from and with this imgur issue it becomes harder for readers to fully assimilate the information that is being passed. The good news is that some forum members have taken it upon themselves to update or replace the broken imgur images with other image hosting site bbcode and among such persons is GazetaBitcoin and I believe others will follow suit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karmamiu",
      "created_time": "May 17, 2023, 06:08:57 AM",
      "body": "Quote from: aysg76 on May 16, 2023, 02:19:53 PMQuote from: Bureau on May 16, 2023, 01:40:48 PMDid you check the threads that are active on this board about the same issue? What you said is the main issue on the Meta board. Please check every song thread before you create anew one. Based on his post he has knowledge of these threads and information about what's going wrong with imgur images as he has already mentioned about @TryNinja script to convert the images to other site but what he specially talking about is that can anyone replace all those links with new platforms BBcode so the images on the threads are visible again.But the users have to shift the alternate links to make their post images visible and don't use Imgur anymore when we have forum based image hosting platform so use it for betterment and staying away from these third party softwares.Thanks for explaining it, you have answered my curiosity. Back then I always keep using imgur whenever I posted images here on this forum, and since there are alternatives there is no need for me to be so worried. Earlier today, I noticed on our local board that there are some images having the same issue as what was posted here so I just ignored it maybe it was my own browser that is somehow not loading those images or maybe my internet network is just too poor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "May 17, 2023, 09:29:03 AM",
      "body": "Quote from: Mate2237 on May 16, 2023, 04:48:49 PMOp from your days in the forum, observations of the forum and your content here says that you read and seen different scholars threads concerning how to fix the broken image. joker_josue, TryNinja, tranthidung and others have provided different solution to the problem, though the solving is still on process, they are some things they are still doing to fix everything back to normal. Therefore, anything they said we should do, we should up to make the forum back to normalcy with the image problem now. It is expected to always go through the forum using the search option or button to look for the intending topic if such had not been discussed before, but toy surprised, just as the whole issue had been discussed on countless occasions on different threads right on the Meta board here, yet OP has not seen an opportunity to locate one or heard about this experience over a week now, it wouldn't make sense if topics were continually discussed after the first thread had been created.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "May 17, 2023, 10:26:06 PM",
      "body": "Quote from: Dunamisx on May 17, 2023, 09:29:03 AMIt is expected to always go through the forum using the search option or button to look for the intending topic if such had not been discussed before, but toy surprised, just as the whole issue had been discussed on countless occasions on different threads right on the Meta board here, yet OP has not seen an opportunity to locate one or heard about this experience over a week now, it wouldn't make sense if topics were continually discussed after the first thread had been created. The forum contains some repetition of topics but not so much that it is noticeable.  Some users, particularly newbies, might not necessarily want to know whether a topic already exists or not before starting a new one they believe they have an idea for or want others to pay attention to. Some people don't know how to utilize the search option or don't see the need to learn about it, resulting in the forum's posts being repeated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}