{
  "id": "topic_5473498",
  "title": "adultcrypto",
  "author": "adultcrypto",
  "created_time": "November 09, 2023, 01:59:19 PM",
  "content": "There is growing excitement in the Bitcoin community following the gains recorded by Bitcoin. The reason for this growth is hardly unconnected to rumors of Bitcoin ETF approval. Have we thought about what will happen to Bitcoin price should all the ETF get rejected? I don't want to imagine this but whatever happens, hold on to your Bitcoin. There have been bull run without Bitcoin ETF and there will always be bull run even if the ETF is rejected. So even when the market temporarily nosedives if the ETF is rejected, do not panic. Once again, hold on to your Bitcoin and do not panic.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473498",
  "comments": [
    {
      "author": "Marvelman",
      "created_time": "November 09, 2023, 02:10:32 PM",
      "body": "The enthusiasm around Bitcoin is understandable, particularly with all the chatter about possible ETF approvals pushing prices up.  It's tempting to get caught up in the excitement and speculate about potential outcomes like the ETF getting rejected.  But you're right that sticking to your plans and holding steady during the market's ups and downs takes discipline.  Easier said than done for sure! Keeping emotions in check is tough when theres so much anticipation and  let's hope things turn out favorably in the end.  For now, staying focused on the long game rather than getting distracted by short-term swings is probably wise.But the thrill of the ride sure makes that hard sometimes!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "November 09, 2023, 02:13:53 PM",
      "body": "People get too excited about small pumps in the market, it brings the idea of the time to sell and make profit is at hand but, what becomes of you and the fiat or whatever coin/commodity your Bitcoin values is transferred into after you sell?You might just miss out of all the other events, bear market inclusive, which will come playing out after that.Many have the ideas of, they would have to buy again during the bears but, how often do you make it to that.Anyway, after the rain comes the shine and as such, being excited isn’t out of place but, never get to sell all your coins.News on the continued approval of various ETF platforms might be a course for nothing but, I very much feel this is just happening as a bid by this platforms to actually take advantage of the expected bullrun, come next halving. You get to work with them to build yourself and them as well. It’s a cool thing but, ensure your not loosing out on accumulating some Bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "November 09, 2023, 02:21:55 PM",
      "body": "At least someone looking at the possibility of the SEC rejecting ETF although with the ever growing news of it getting approve soon and even a fake report that it was approved I think it will be a huge surprise that it doesn’t get approved. But regardless of what happens I have not place any of my predictions on ETF saga, yes it’s approval will certainly causes a pump in price of bitcoin but it will only be on yeh basis of FOMO and as such I don’t see it lasting that long. But a disapproval will also causes a retract of the price, in face of this just hodl and if possible accumulate more then. The real bull run will be caused by the bitcoin halving and as with ETF approval or not we will be in bull run come 2025 or late 2024 that’s where my predictions lies",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "November 09, 2023, 02:27:17 PM",
      "body": "I'm sure many are feeling good about the gains made by Bitcoin recently, but I think that holding Bitcoin no matter what is not a great strategy. If someone invested a long time ago, the current price might be good for that person to sell. Or, maybe a person wants to keep hodling but sell just a bit to enjoy the profits made due to recent gains. I think it's totally fine, and it is important to actually benefit from the profits once in a while. I agree that Bitcoin will probably rise with or without an ETF approval, but it can easily happen after another year of a bear market, for instance, so if someone wants to sell a bit now, it makes sense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "November 09, 2023, 02:37:08 PM",
      "body": "Bitcoin was always going to go up - approved ETFs or not. Even if ETF was the subject matter of today's bitcoin community and market discussions, Bitcoin's price was primed for a good upward swing and the Cointelegraph fake news was only evident of what could be and we're seeing a of it happening as expected. Imo, Bitcoin's price imo will get better and better from here until and after the halving event next year. Evenif ETF is not approved, I wouldn't say it would have a really huge impact on Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "November 09, 2023, 02:37:29 PM",
      "body": "Quote from: adultcrypto on November 09, 2023, 01:59:19 PMThere have been bull run without Bitcoin ETF and there will always be bull run even if the ETF is rejected. So even when the market temporarily nosedives if the ETF is rejected, do not panic. Once again, hold on to your Bitcoin and do not panic. This is right approach when the market suddenly change momentum. Keep buying when everyone is fearing about the dump since you will have a chance to purchase more token on cheap price. People who always win on trading are those who patiently wait for the right price to sell since it’s just changing of Bitcoin from less patient to more patient people.This is why DCA is always the best practice on trading since you can average your buy price no matter what happened in the price. We should keep holding on that Bitcoin price grows parabolic in long term while we are just starting that curve.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PIMPdev",
      "created_time": "November 09, 2023, 02:38:44 PM",
      "body": "Never had any thoughts about giving up on Bitcoin. If bad things happen I'll be glad to buy more. Because the future is bright and I know it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "November 09, 2023, 02:40:24 PM",
      "body": "The way Bitcoin price is surging, one will be tempted to sell, no doubt but I feel too that there are those  who won't get easily tempted to. This is not the first time we've seen such pumps that shook the market and since the recent one is the spot ETFs that are being perceived to get a nod of approval from the SEC, I just believe it won't be the only thing that, if not approved, will stop Bitcoin from being bullish. The halving event is just next year and to me the ETFs approval is just a plus.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jegileman",
      "created_time": "November 09, 2023, 02:41:14 PM",
      "body": "Quote from: adultcrypto on November 09, 2023, 01:59:19 PMThere is growing excitement in the Bitcoin community following the gains recorded by Bitcoin. The reason for this growth is hardly unconnected to rumors of Bitcoin ETF approval. Have we thought about what will happen to Bitcoin price should all the ETF get rejected? I don't want to imagine this but whatever happens, hold on to your Bitcoin. There have been bull run without Bitcoin ETF and there will always be bull run even if the ETF is rejected. So even when the market temporarily nosedives if the ETF is rejected, do not panic. Once again, hold on to your Bitcoin and do not panic. When the Bitcoin ETF is ultimately approved, we expect the price of bitcoin to skyrocket, but if it does not, there is a potential and a significant likelihood that the price will fall. But, regardless of what occurs, your title tells it all. When the price begins to fall, there are bound to be panic and anxiety of losing all of the money invested. The market is expected to see a bull run after the halving occurs by next year; if this time comes, those who hung on to their coins would profit handsomely. Those that sold out of fear of the bitcoin price falling likely miss out if the bitcoin ETF is not approved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "November 09, 2023, 02:43:27 PM",
      "body": "Yup, anyone thinking of selling now and taking out 2x of profit (if they were lucky enough to buy at $18k) is a fool and will be missing a major/big profit which we all will see happening in 2025.I make sure to keep everyone in touch with my goal or target of Bitcoin i.e. $178k for November 2025. I am definitely sure Bitcoin will be able to achieve this target.So, hold on to your Bitcoin as the OP said.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "November 09, 2023, 02:44:26 PM",
      "body": "Quote from: adultcrypto on November 09, 2023, 01:59:19 PMThere is growing excitement in the Bitcoin community following the gains recorded by Bitcoin. The reason for this growth is hardly unconnected to rumors of Bitcoin ETF approval. Have we thought about what will happen to Bitcoin price should all the ETF get rejected? I don't want to imagine this but whatever happens, hold on to your Bitcoin. There have been bull run without Bitcoin ETF and there will always be bull run even if the ETF is rejected. So even when the market temporarily nosedives if the ETF is rejected, do not panic. Once again, hold on to your Bitcoin and do not panic. Those people telling that this pump happen due to the hype brought up by ETF situation but they didn't even realize that bitcoin is naturally growing its because people are looking forward for great thing that halving effect can possibly bring to them that's why its so irrelevant for people to hold just because they are speculating about the possible result since they might get dismayed if this one get disapprove and might result to capital lost to them. If they are just aiming for halving then maybe they can get much better result from it since for sure that this is more realistic to happen rather speculating about those ETF acceptance which is hard to happen for now since there are some regulators still not open for bitcoin adoption that's why we always see it get disapprove by those officials.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Latviand",
      "created_time": "November 09, 2023, 02:55:56 PM",
      "body": "Bro, I'm sure that you're not going to see any sane person selling all of their bitcoins right now so your advice on the title is moot, a lot has seen bitcoin go from 69k USD already and there's more that's expecting bitcoin to go much higher after halving or in halving so you don't need to worry about people being unstable with what price they're planning to sell their bitcoins.Quote from: ImThour on November 09, 2023, 02:43:27 PMYup, anyone thinking of selling now and taking out 2x of profit (if they were lucky enough to buy at $18k) is a fool and will be missing a major/big profit which we all will see happening in 2025.I make sure to keep everyone in touch with my goal or target of Bitcoin i.e. $178k for November 2025. I am definitely sure Bitcoin will be able to achieve this target.So, hold on to your Bitcoin as the OP said.They can probably get away with not selling all of their bitcoins and then getting some profit out of their initial purchase and then hope to get in bitcoin again by buying back in case the price of bitcoin goes down again so those people selling at the current highest price have a little window to get in again. As with what OP said, anyone would probably also have to consider not doing anything stupid like selling everything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "November 09, 2023, 02:57:49 PM",
      "body": "Sounds like the real deal to me if anyone wants to take advantage of the price drop it's going to be the powerful people unless they already bought all the Bitcoin they want, if not, all they need to do is reject all the ETF applications and watch how the price of Bitcoin will get heavily dump, it's something they can actually pull off and that's why I don't trust anything in this space. I like your advice and it's best for others to take it very serious, too many people are now calling for the bull market, like isn't that too early? But it's expected that Bitcoin will pump at the end of 2023 anyway so the correction that I am expecting should be in the first quarter of next year. There is nothing to be scared of, just get ready to take advantage of another, maybe last buying opportunity, there is no way a correction won't happen, so be ready with your USD or stable coin to buy more Bitcoin when any form of correction takes place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dickiy",
      "created_time": "November 09, 2023, 03:17:42 PM",
      "body": "Quote from: Majestic-milf on November 09, 2023, 02:40:24 PM The way Bitcoin price is surging, one will be tempted to sell, no doubt but I feel too that there are those  who won't get easily tempted to. This is not the first time we've seen such pumps that shook the market and since the recent one is the spot ETFs that are being perceived to get a nod of approval from the SEC, I just believe it won't be the only thing that, if not approved, will stop Bitcoin from being bullish. The halving event is just next year and to me the ETFs approval is just a plus.Yes in the last few weeks bitcoin has seen entering a bullish phase which indirectly makes people assume and speculate that \"this is the right moment\" to sell, of course it is a natural thing and that is always awaited by everyone involved in bitcoin accumulation. I think the people you mean who are not easily tempted by bullish conditions on bitcoin now are those who have long-term planning that has targeted at least the next 4 years. Honestly, I'm not really sure that there is an ETF agreement, but maybe some people have concluded that it really happened because they saw from how the bullish conditions that bitcoin is experiencing now.Bitcoin always has a great opportunity to go up, because of course as you said now is the time for bitcoin to start its potential, none other than because the halving time is just around the corner, honestly I don't know how high bitcoin will be in the next year but certainly we must maintain even though many sales temptations come.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "November 09, 2023, 03:21:44 PM",
      "body": "Quote from: adultcrypto on November 09, 2023, 01:59:19 PMThere is growing excitement in the Bitcoin community following the gains recorded by Bitcoin. The reason for this growth is hardly unconnected to rumors of Bitcoin ETF approval. Have we thought about what will happen to Bitcoin price should all the ETF get rejected? I don't want to imagine this but whatever happens, hold on to your Bitcoin. There have been bull run without Bitcoin ETF and there will always be bull run even if the ETF is rejected. So even when the market temporarily nosedives if the ETF is rejected, do not panic. Once again, hold on to your Bitcoin and do not panic. I agree with you that bitcoin could go up even without an ETF, but it should not be denied that what is happening is not related to the ETFs. The market is very bullish on ETFs and what is happening is the impact of news related to ETFs. Certainly, bitcoin will still recover and increase in price without ETFs, but if the SEC rejects ETFs again, you will see the bitcoin plummet immediately. We should continue to hold bitcoin no matter what happens but don't think that bitcoin will be unaffected by this news.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "November 09, 2023, 03:39:36 PM",
      "body": "Quote from: adultcrypto on November 09, 2023, 01:59:19 PMThere is growing excitement in the Bitcoin community following the gains recorded by Bitcoin. The reason for this growth is hardly unconnected to rumors of Bitcoin ETF approval. Have we thought about what will happen to Bitcoin price should all the ETF get rejected? I don't want to imagine this but whatever happens, hold on to your Bitcoin. There have been bull run without Bitcoin ETF and there will always be bull run even if the ETF is rejected. So even when the market temporarily nosedives if the ETF is rejected, do not panic. Once again, hold on to your Bitcoin and do not panic. Bitcoin did not have an issue with the ETF approval because, with or without ETF approval, Bitcoin halving will happen, and we are expecting a bull run.People willing to invest, we still have time to wait for the news of either approval or rejection to know our next move. We should not panic and sell in case the Bitcoin price drops a bit if the ETF is rejected; instead, we should buy more because we are almost there (2024 halving year).On the other hand, most altcoins have made great moves due to this hype. One will not mind keeping a good look on the market to take advantage of their profit when the ETF get rejected because the market will go a bit down and it will have massive impact in altcoin price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "November 09, 2023, 03:42:51 PM",
      "body": "Quote from: Zaguru12 on November 09, 2023, 02:21:55 PMAt least someone looking at the possibility of the SEC rejecting ETF although with the ever growing news of it getting approve soon and even a fake report that it was approved I think it will be a huge surprise that it doesn’t get approved. But regardless of what happens I have not place any of my predictions on ETF saga, yes it’s approval will certainly causes a pump in price of bitcoin but it will only be on yeh basis of FOMO and as such I don’t see it lasting that long. But a disapproval will also causes a retract of the price, in face of this just hodl and if possible accumulate more then. The real bull run will be caused by the bitcoin halving and as with ETF approval or not we will be in bull run come 2025 or late 2024 that’s where my predictions lies It would not surprise me if the spot ETF approval does not materialize. It probably won't be a surprise for the markets either. Because the markets have bought the news and this has a big impact on the increases we have experienced. If the ETF approval is approved, contrary to your view, I think the crypto market will start a bull run and rockets may emerge at the halving. The bull market is looking for a spark and ETF approval could be it. With the news of ETF approval, I think that the bulls will continue to break the resistance in the market where the bears have difficulty in resistance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "November 09, 2023, 03:47:17 PM",
      "body": "Quote from: adultcrypto on November 09, 2023, 01:59:19 PMThere is growing excitement in the Bitcoin community following the gains recorded by Bitcoin. The reason for this growth is hardly unconnected to rumors of Bitcoin ETF approval. Have we thought about what will happen to Bitcoin price should all the ETF get rejected? I don't want to imagine this but whatever happens, hold on to your Bitcoin. You are right about the idea of holding onto the BTC if the market goes up due to the approval of ETFs, and we should not fall greedy on small profits while we can make big ones, but about the other idea of you holding on to the BTC when the market will go down due to the rejection of these ETFs (which in my opinion will not happen, although delay could occur, rejection is not an option), as when the market is going down we should avoid holding and book our investment while we can so we can take entry again in the market at some good point to make more profit instead of regretting like those who bought at $50k and $60k 2 years ago and are holding onto their buying till now.However, even if we wanted to book our capital or profit, we should try to do that in part because the market is currently making me a huge profit, and the first profit I book is $30,700. If I had booked all of my seed profit at that time, I might not have made the profit that I am making now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gallar",
      "created_time": "November 09, 2023, 03:49:09 PM",
      "body": "Quote from: adultcrypto on November 09, 2023, 01:59:19 PM~SnipThere have been bull run without Bitcoin ETF and there will always be bull run even if the ETF is rejected. So even when the market temporarily nosedives if the ETF is rejected, do not panic. Once again, hold on to your Bitcoin and do not panic. There is no reason to panic for me personally, especially regarding bitcoin ETFs. Because as OP said, there is still a bullish market that we are ready to welcome together. Even if, for example, the bitcoin ETF is rejected, there will definitely be a decline in the price of bitcoin. However, don't panic and remain firm in holding onto the bitcoins we have, until our sales target is achieved.So basically we as bitcoin investors have to remain calm and not be influenced by anything. Because after all, Bitcoin will always provide price surprises for investors, once every four years (Halving & Bullish market). Therefore, even if a bitcoin ETF is not approved, I believe bitcoin will reach its maximum price when the bull market arrives. Therefore, I agree with the OP's opinion, that at this time we must be strong in holding the bitcoin assets we own and must remember the initial intention of investing in bitcoin and must remember the desired price target. So that our mentality becomes stronger.Because if fail halfway (selling bitcoin assets), I'm sure will most likely regret it later. Because if look at the positive side that usually occurs in the price of bitcoin, every time the price drops, there is a big possibility that the price will also rise again. Therefore, don't worry too much about the bitcoin ETF, though the bitcoin ETF will have an influence on the price of bitcoin. But we all have to be sure that bitcoin will remain strong in terms of price value, even if the bitcoin ETF is rejected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}