{
  "id": "topic_5529385",
  "title": "Call_Me_Guru",
  "author": "Call_Me_Guru",
  "created_time": "February 07, 2025, 02:17:26 PM",
  "content": "Foundation matters, Bitcoin has it most-solid, it created the idea, without Bitcoin, no cryptocurrency. Who dares belittle Bitcoin with Ethereum again? Only a fool, 2025 is not 2021. In 2021, also before then, you would hear it loud that Ethereum will beat Bitcoin one day, yes in their dreams. Bitcoin broke the 2021 ATH [$69k] in 03/2024 to reached $73,850, recorded a new height in 11/2024 [$108k], finally the current ATH≈$110k.What did Ethereum? Nothing, it has been lazy.  The ATH of 2021 [$4,870] is still holding in 2025.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5529385",
  "comments": [
    {
      "author": "Ziskinberg",
      "created_time": "February 07, 2025, 02:20:22 PMLast edit: February 07, 2025, 02:30:55 PM by Ziskinberg",
      "body": "If you’re only realizing now that Bitcoin is the boss, then you’ve been misled in the past.Bitcoin and Ethereum should never be compared as Bitcoin will always be the original.Think about it, Bitcoin dominates the entire altcoin market, and Ethereum is just one of those altcoins.if we are thinking of bitcoin and Ethereum comparison, here's some data.               initial price                  Current price   increase (%)Bitcoin - $ 0.08 (estimate)            $100,000       1,250,000Ether  - $ 0.75                                $2,793          3,724",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Call_Me_Guru",
      "created_time": "February 07, 2025, 02:26:59 PM",
      "body": "Quote from: Ziskinberg on February 07, 2025, 02:20:22 PMIf you’re only realizing now that Bitcoin is the boss, then you’ve been misled in the past.Misled by who? I am a definition of originality. I don't follow people's idea. It is never late to say my opinion on Bitcoin. Is it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "February 07, 2025, 02:28:44 PM",
      "body": "Quote from: Ziskinberg on February 07, 2025, 02:20:22 PMIf you’re only realizing now that Bitcoin is the boss, then you’ve been misled in the past.Some people misled people that ethereum one day will increase above bitcoin in marketcap. But they forgot that there are ethereum competitors. As usual, people will leave the old altcoins and move to new altcoins. That is what that happened to ethereum. Ethereum still tried as it did not get really dumped but it is not a store of value just like the other coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "February 07, 2025, 02:30:17 PM",
      "body": "Quote from: Call_Me_Guru on February 07, 2025, 02:17:26 PMFoundation matters, Bitcoin has it most-solid, it created the idea, without Bitcoin, no cryptocurrency. Who dares belittle Bitcoin with Ethereum again? Only a fool, 2025 is not 2021. In 2021, also before then, you would hear it loud that Ethereum will beat Bitcoin one day, yes in their dreams. What did Ethereum? Nothing, it has been lazy.This fact is known for many years already, not in 2024, not in 2025, not now. You are too late to realize this fact but it's better than never realize this big hidden fact, about Ethereum, and you can expand it to altcoins too.I don't need too advanced tools like Trading view, and I assume I am a newbie, search about Ethereum, and want to know about its price pair with Bitcoin, in ETH/BTC.Google it, I find this pagehttps://www.google.com/finance/quote/ETH-BTC?sa=X&ved=2ahUKEwjJ0Mro4rGLAxWf4jgGHRDbNFsQ-fUHegQIFxAX&window=MAXMax time frame gives me a hidden fact that if I used 1 BTC to buy Ethereum, I lost my bitcoins with time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ziskinberg",
      "created_time": "February 07, 2025, 02:35:48 PM",
      "body": "Quote from: Charles-Tim on February 07, 2025, 02:28:44 PMQuote from: Ziskinberg on February 07, 2025, 02:20:22 PMIf you’re only realizing now that Bitcoin is the boss, then you’ve been misled in the past.Some people misled people that ethereum one day will increase above bitcoin in marketcap. But they forgot that there are ethereum competitors. As usual, people will leave the old altcoins and move to new altcoins. That is what that happened to ethereum. Ethereum still tried as it did not get really dumped but it is not a store of value just like the other coins. Ethereum's competition is only within the altcoin market, and recently, there’s been news about potential issues that could affect Ethereum.Because of these risks, there’s a chance that Ethereum might not be able to hold onto its #1 spot among altcoins in the future.Ethereum core developer departs for AI amid leadership concernsQuoteEthereum core developer Eric Conner exits, citing Vitalik Buterin’s leadership decisions, shifts focus to building AI tools like Freysa.ai.Quote from: Call_Me_Guru on February 07, 2025, 02:26:59 PMQuote from: Ziskinberg on February 07, 2025, 02:20:22 PMIf you’re only realizing now that Bitcoin is the boss, then you’ve been misled in the past.Misled by who? I am a definition of originality. I don't follow people's idea. It is never late to say my opinion on Bitcoin. Is it?You're misleading yourself by creating a thread with a pointless title, because everyone already knows that ETH can't compete with Bitcoin.Bitcoin has been the king since day one, and it still is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "February 07, 2025, 02:44:59 PM",
      "body": "Ethereum isn't even a worthy opponent against Bitcoin.Ethereum is just a token that facilitates other tokens to use their network, there will be a time the Layer 2 overtake Ethereum position. In the past Polygon and Ton coin have potential to beat them, but now it's turn for Solana.Ethereum can't be the boss because they're centralized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "February 07, 2025, 02:55:52 PM",
      "body": "I don't understand how bitcoin became the boss? All I know is that bitcoin is the leading cryptocurrency in this field industry, besides being the most expensive, it was also the first crypto that was really enjoyed by businessmen.And when others saw that it had potential, other developers copied the concept of bitcoin, so that's where altcoins (alternative coins) started that can also help people financially.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "February 07, 2025, 03:03:31 PM",
      "body": "since long ago bitcoin has been the boss and that is something that does not need to be questioned anymore ... because from many aspects bitcoin is the first popular cryptocurrency, decentralized, and has the highest trust compared to altcoins. that's why even though there are thousands of altcoins on the market, it is not an obstacle for bitcoin to be able to increase its adoption globally and reach the latest ath ... because people who understand the potential of bitcoin will see that bitcoin is much better than all existing cryptocurrencies, even when these cryptocurrencies claim that they offer better transaction speed or security than bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "atookz",
      "created_time": "February 07, 2025, 03:38:38 PM",
      "body": "Yes, that's right. In the past, many people often compared Bitcoin with Ethereum. Some even said that Ethereum would be superior to Bitcoin and could replace it. But I have always had the opinion that Altcoins like Ethereum will not be able to replace it because Bitcoin is the first crypto and has the strongest position. Although many Altcoins (especially Ethereum) offer better features, the possibility of being completely replaced is very small because Bitcoin has many factors that support its position as the Gold Standard in the crypto world. Moreover, Bitcoin is better known than Ethereum, so it has a wider and stronger user network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "February 07, 2025, 03:47:54 PM",
      "body": "You're talking about 2021 Ethereum being loud? You should have been around in 2016/17, socials were awash with talk of the Flippening. Not saying Ethereum's trash, it certainly has found its uses amongst certain speculators, and they did have earnest developers (probably still do). But I think they really shot themselves in the foot changing the way supply happens but I'm not keen to get into arguments.There's no boss when there are no subordinates, mind you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "red4slash",
      "created_time": "February 07, 2025, 03:54:45 PM",
      "body": "Quote from: Call_Me_Guru on February 07, 2025, 02:17:26 PMFoundation matters, Bitcoin has it most-solid, it created the idea, without Bitcoin, no cryptocurrency. Who dares belittle Bitcoin with Ethereum again? Only a fool, 2025 is not 2021. In 2021, also before then, you would hear it loud that Ethereum will beat Bitcoin one day, yes in their dreams. You are late enough to realize this because from the beginning even almost everyone who is here will not compare bitcoin with ethereum or other altcoins because in the end the position and situation remains the same where bitcoin is always above all and becomes the king so that not only ethereum but all altcoins also cannot be compared with bitcoin in the end.So why discuss things that even everyone already knows this where in the end the comparison of bitcoin with all altcoins that always exist every year the results remain the same.Bitcoin has always been the king and will continue to be so why complicate things further when everything will remain the same and nothing will change. Eth might be good for an altcoin but they'll just keep following bitcoin so it's not really worth trying to compare something that isn't comparable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "February 07, 2025, 04:00:00 PM",
      "body": "Quote from: Ziskinberg on February 07, 2025, 02:20:22 PMIf you’re only realizing now that Bitcoin is the boss, then you’ve been misled in the past.Bitcoin and Ethereum should never be compared as Bitcoin will always be the original.Think about it, Bitcoin dominates the entire altcoin market, and Ethereum is just one of those altcoins.That's right, this so-called guru comes to tell us something we have known for a long time. There is a trend that I think comes from the influencers in which you see suckers giving lessons when they really have no idea about anything. That's why we call the rest shitcoins, including Eth, because there is only one bitcoin, the rest is shit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "February 07, 2025, 04:09:19 PM",
      "body": "Ethereum is not really decentralized too. It is Vitalik Butterin’s personal project and it is massively premined. He somehow got lucky an made it big but it will die right after when something happens to VB.Bitcoin on the other hand has been around more than a decade without satoshi. It is the only crypto that’s truly decentralized.Charlie Lee also noticed that and that’s why he abandoned his position in LTC because he wanted to copy satoshi’s move and give LTC a more decentralized future. Did he succeed? I am not sure but his intention wasn’t malicious.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AVE5",
      "created_time": "February 07, 2025, 04:17:35 PM",
      "body": "Quote from: Call_Me_Guru on February 07, 2025, 02:17:26 PMFoundation matters, Bitcoin has it most-solid, it created the idea, without Bitcoin, no cryptocurrency.If you're talking about foundation, be let known that there had been lot of digital currencies intended to build using the cryptograph but failed to achieve valuable potentials that'd attract massive adoptions which majorly the DigiCash was a closed approach to get it dream achievable but due to it correspondence of the central authority to validate it transactions, it was seem not what it proposed of executing transactions anonymously with decentralized motive untill it was crashed as a case of poor adoption. Meanwhile there had also been some other tried but failed that were all digital currencies on cryptographical inputs such as the Bit Gold, Hash Cash and B-money that were still invented but has no good rate about.Then Satoshi Nakamoto came with the ability to had figured the lapses of why all the intended digital currencies ought to be decentralized currency failed to exist and stayed and then he invented bitcoin fixing those loopholes and on gradual process bitcoin was able to acquire those concepts of digital currency with the procession of anonymous transactions and the potential hedge to store values which has come a most trending digital investment today and had also become a most dominance in the crypto industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "February 07, 2025, 05:22:43 PM",
      "body": "The gap too big for you to compare the two. Since when I came here till now I have not seen such comparison. All the altcoins follow the movement of bitcoin and they are not even planning to overtake bitcoin. Bitcoin has created  the store of value and those who has invested in 2022 which was the time I came fully in the forum have made good profit in Bitcoin investment and those who invested in Ethereum as of that time till now have not made good profit. And because of that many people have Ethereum for bitcoin. And I don't see Ethereum as a good crypto to invest because it looks a stable coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "February 09, 2025, 01:22:47 AM",
      "body": "Ethereum is just another alt-coin and nothing else. Only Bitcoin is the king of the market and the one that's free from any competitors. It's supported by the community and its developer has left the scene so community can run it and enjoy using it, while Ethereum's co-creator Vitalik Buterin  is someone who's supporting it and it's not in anyway community driven project. No one controls Bitcoin and anyone who holds Bitcoin is the one who's controlling the Bitcoin that he/she is holding and that makes Bitcoin many times better and superior than that Ethereum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Princess Leah",
      "created_time": "February 09, 2025, 02:18:23 AM",
      "body": "Quote from: SamReomo on February 09, 2025, 01:22:47 AMEthereum is just another alt-coin and nothing else. Only Bitcoin is the king of the market and the one that's free from any competitors. It's supported by the community and its developer has left the scene so community can run it and enjoy using it, while Ethereum's co-creator Vitalik Buterin  is someone who's supporting it and it's not in anyway community driven project. No one controls Bitcoin and anyone who holds Bitcoin is the one who's controlling the Bitcoin that he/she is holding and that makes Bitcoin many times better and superior than that Ethereum. Yeah buddy that's just it, comparing Ethereum and Bitcoin is like comparing a gaint with a little boy and it's no David and Goliath Bible tale it's the real deal and Bitcoin would always be superior, it would have Ethereum many years more then even 10 or there about to get to the point where Bitcoin has gotten to Ethereum is just so lazy and is yet to reach $5k but them Bitcoin has gone way beyond that for years now. However, most of these other Cryptocurrencies depends on Bitcoin for their prices to increase including Ethereum as well, do you noticed how every other coins kept dipping when Bitcoin was undergoing correction days ago, that's to say it's superior and they depend on it. It's superior to all Cryptocurrencies and second to none.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "February 09, 2025, 04:32:51 AM",
      "body": "Quote from: buwaytress on February 07, 2025, 03:47:54 PMYou're talking about 2021 Ethereum being loud? You should have been around in 2016/17, socials were awash with talk of the Flippening.It is only purely speculation and expectation on a flippening in market cap. 1 Ethereum has never had chance to flip 1 Bitcoin in price, and this fact means for investors.If you use $10,000 to invest in bitcoin, and $10,000 to invest in Ethereum, with past years so far, Bitcoin makes you richer than Ethereum.Saying one coin is better than another based on market cap is very inaccurate.Bitcoin vs. Altcoins – projected Marketcap",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "X-ray",
      "created_time": "February 09, 2025, 04:46:23 AM",
      "body": "Quote from: Call_Me_Guru on February 07, 2025, 02:17:26 PMFoundation matters, Bitcoin has it most-solid, it created the idea, without Bitcoin, no cryptocurrency. Who dares belittle Bitcoin with Ethereum again? Only a fool, 2025 is not 2021. In 2021, also before then, you would hear it loud that Ethereum will beat Bitcoin one day, yes in their dreams. Bitcoin broke the 2021 ATH [$69k] in 03/2024 to reached $73,850, recorded a new height in 11/2024 [$108k], finally the current ATH≈$110k.What did Ethereum? Nothing, it has been lazy.  The ATH of 2021 [$4,870] is still holding in 2025.  ethereum depends on its technology to get big but smart contract blockchain keep appearing, meanwhile bitcoin is just bitcoin and people buy bitcoin because it's the first crypto ever making it legitimate in the eyes of investor even government that right now plan about strategic bitcoin reserve is coming up.I always expect altcoin like ethereum to not be able to keep up, because technology grow, eventually altcoin will get replaced by newer one, but bitcoin is like gold.just see in the future maybe the next cycle you'd find crypto market cap rank getting dominated by a coin you would never heard of before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}