{
  "id": "topic_5456354",
  "title": "PytagoraZ",
  "author": "PytagoraZ",
  "created_time": "June 14, 2023, 05:16:14 PM",
  "content": "Hello friend...I've been on this forum for a week. As a beginner, the first step in this forum is read some rules such as:Newbies - Read before postingWriting a welcome message  FAQ: Everything you need to know about forum 'activity, account ranks and meritRatimov's Forum Guides, Tutorials & ListsAnd other thread in my local subforumI think this forum has a lot of rules. To be honest, I don't fully understand it yet, but I'll continue to study itI've tried creating a thread and many members have provided feedback. I am happy with their warm welcome. I've learned how to write with quotes, insert links, insert images, insert code, and more. I think it's not as difficult as I imagined beforeI don't know if what I'm doing is right or not, but maybe I think it's the best way to start in this forum. Honestly, I'm still afraid of violating the rules and getting banned. I know there are many members who got banned, but I don't know what they did wrongFor the next step, maybe I will read about bitcoin wallets. I just got an electrum wallet, but I don't know what its features are yet. I thought I could learn it here for free.RegardsAlways take care of the family",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456354",
  "comments": [
    {
      "author": "un_rank",
      "created_time": "June 14, 2023, 05:35:40 PM",
      "body": "Quote from: PytagoraZ on June 14, 2023, 05:16:14 PMI don't know if what I'm doing is right or not, but maybe I think it's the best way to start in this forum. Honestly, I'm still afraid of violating the rules and getting banned. I know there are many members who got banned, but I don't know what they did wrongWhat got them banned is likely either of plagiarism or sharing malwares or ban evasion (for users that were initally banned for any of the first two reasons). If you can avoid doing any of these you have a low chance of getting banned.Quote from: PytagoraZ on June 14, 2023, 05:16:14 PMFor the next step, maybe I will read about bitcoin wallets. I just got an electrum wallet, but I don't know what its features are yet. I thought I could learn it here for free.There is a thread about wallets[1] you can read that would help guide your decision. Electrum is one of the most recommended choices on the forum and you cannot go wrong with it. If you have any questions about their features along the way, feel free to ask.[1] https://bitcointalk.org/index.php?topic=1631151.0- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PytagoraZ",
      "created_time": "June 14, 2023, 05:46:56 PM",
      "body": "Quote from: un_rank on June 14, 2023, 05:35:40 PMWhat got them banned is likely either of plagiarism or sharing malwares or ban evasion (for users that were initally banned for any of the first two reasons). If you can avoid doing any of these you have a low chance of getting banned.Is this forum strictly against plagiarism? then what if I quote a part of another website's sentence as a reference argument in the discussion? is it a violation?Quote from: un_rank on June 14, 2023, 05:35:40 PMThere is a thread about wallets[1] you can read that would help guide your decision. Electrum is one of the most recommended choices on the forum and you cannot go wrong with it. If you have any questions about their features along the way, feel free to ask.[1] https://bitcointalk.org/index.php?topic=1631151.0- Jay -Yes I've found that thread, I've read it but still confused by some terms, like multi sign",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "June 14, 2023, 05:53:04 PM",
      "body": "Quote from: PytagoraZ on June 14, 2023, 05:46:56 PMIs this forum strictly against plagiarism? then what if I quote a part of another website's sentence as a reference argument in the discussion? is it a violation?\"Quoting\" something does not count as plagiarism at all. It is only plagiarism when you copy and paste a text without any reference to the original writer or any indication that it is copied, like using quote tags or \"\" in the text.Quote from: PytagoraZ on June 14, 2023, 05:46:56 PMYes I've found that thread, I've read it but still confused by some terms, like multi signMulti sig indicates how many signatures are needed to sign a transaction. If you create a regular wallet, you own the private keys and can sign a transaction using it.If you create a 2-3 multi sig wallet, there are three keys and two out of three of them are needed to sign transactions, so one party cannot sign without one of the others.2-2 is used on bisq platform where both the buyer and seller are needed to sign any transaction being made. One party cannot sign without the other.Multi sig can also be used by a single person to back up their wallets in different locations for more security.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "June 14, 2023, 05:57:22 PM",
      "body": "Quote from: PytagoraZ on June 14, 2023, 05:16:14 PMFor the next step, maybe I will read about bitcoin wallets. I just got an electrum wallet, but I don't know what its features are yet. I thought I could learn it here for free.Just to be sure, did you verify your electrum wallet? see tutorial at: https://bitcointalk.org/index.php?topic=5240594.0In any case, here's a brief description on what to expect on electrum, see: https://bitcoin.org/en/wallets/desktop/windows/electrum/Note: other wallets as well as bitcoin related resources are also on there, you could try to explore the whole website as well.Electrum Tutorials can be found on: https://bitcoinelectrum.com/ and we also have an Electrum child board if you have further questions, see: https://bitcointalk.org/index.php?board=98.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "June 14, 2023, 07:12:13 PM",
      "body": "You cannot actually understand everything at once, so it is normal to still be confuse, as you get accustomed with the forum you will understand both officiall and unofficial rules. Quote from: PytagoraZ on June 14, 2023, 05:46:56 PMIs this forum strictly against plagiarism? then what if I quote a part of another website's sentence as a reference argument in the discussion? is it a violation?Plagiarism is the most frowned act upon not only on the forum. You can actually quote anything to either add to the point you making but be sure to add the right reference that leads to that article. Not adding any reference link makes the enter statement yours. QuoteYes I've found that thread, I've read it but still confused by some terms, like multi signUn_rank has already explained the meaning of multi sig for you. Multi is just adding another security layer to your wallet where you have multiple keys and with at least two co signers before a transaction can be initiated. The most common multi sig are the 2-3 multi sig and the 3-5 multi sig, the higher the signatures the better the security. This kind of wallet can be set up when two or more people decide to hold their funds in a single wallet. This will protect one party from withdrawing  funds without the other party(s) getting informed. I would advice that once you don’t understand something you can just search upon it on the forum and if you don’t find any then you can create a thread asking the questions",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "June 14, 2023, 07:14:53 PM",
      "body": "I really don't get your point of view for this thread; it just seems pointless. You know quite a lot of things already, which is enough to expose you to more new and educative contents. What do you want now? because you don't have any serious question you have asked on this thread. It's a good start that you have 28 merits and 28 activities; that shows a good start for yourself, but it doesn't call for any celebration; just stay cool and keep learning since you already know what to do and how to find yourself around the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "June 14, 2023, 07:15:56 PM",
      "body": "Welcome on board mate and you shouldn't  see the forum.as a very strict place but rather a home away from home.There is basically  one offense in the forum that is seriously frown at, which plagiarism and anyone been caught in this act is hardly forgiven, so hence don't plagiarize and whatever you copied should be referenced.Outside the above mentioned,  I don't think there is any very serious law in the forum, just do the right things, respect each member, engage in meaningful discussions, learn to accept criticisms and avoid scam or account buying which is frown at my users and not the forum as a whole.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "June 14, 2023, 07:33:42 PM",
      "body": "Quote from: PytagoraZ on June 14, 2023, 05:16:14 PMHonestly, I'm still afraid of violating the rules and getting banned. I know there are many members who got banned, but I don't know what they did wrongThere is nothing to be afraid of since you've got links about the guides in the forum and for you to avoid those violations which will result of being banned, you already have it and you just need to remember not to do it. Just make yourself familiar with those guides and rules so that you'll avoid them if you think that you're about to do it. Otherwise, you're doing fine as long as you'll never attempt to do any of those that's listed on the Unofficial list of (official) Bitcointalk.org rules, guidelines, FAQ.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "June 14, 2023, 07:36:39 PM",
      "body": "You are a fast growing newbie for that matter as its clear that your knowledge about the forum is good and I will just tell something which will be of great  help which is fear is actually the best teacher, it helps us to be always conscious of what we are doing either going wrongly or right and since you already how intense the forum can and you have already stated that you covered most of the rules it better now to just read more so your knowledge on bitcoin and wallets like you said will be vast so you can help other like yourself learn.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "June 14, 2023, 09:24:18 PM",
      "body": "Looking at your profile and your post history, I no longer consider you a newbie, especially for someone who drops a comment and posts like this one: https://bitcointalk.org/index.php?topic=5253221.msg62387639#msg62387639.The rules of the forum might look very huge for anyone to cover up the whole time if they said they wanted to start doing that before they could eventually start posting here. I will advise you to make those most important ones and be yourself in the forum. There are not many things about yourself for you to be so afraid of or interested in learning from. With time, one thing will lead to another, and you will eventually have to learn almost everything about the forum, including the official rules.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Amphenomenon",
      "created_time": "June 14, 2023, 09:26:40 PM",
      "body": "Quote from: PytagoraZ on June 14, 2023, 05:16:14 PMI don't know if what I'm doing is right or not, but maybe I think it's the best way to start in this forum. Honestly, I'm still afraid of violating the rules and getting banned. I know there are many members who got banned, but I don't know what they did wrongPunishment for violating rules is not only ban (there are other punishment), it depends on the rule violated by the user or how many times it was continously done before a user is banned. Here is a Thread about the rules of this forum Unofficial list of (official) Bitcointalk.org rules, guidelines, FAQQuote from: PytagoraZ on June 14, 2023, 05:16:14 PMFor the next step, maybe I will read about bitcoin wallets. I just got an electrum wallet, but I don't know what its features are yet. I thought I could learn it here for free.Quote from: Ratimov on September 20, 2020, 09:10:07 AM67.Helpful Guides For Newbie on the Electrum WalletBeginners & HelpJuly 29, 2021",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "June 14, 2023, 09:49:21 PM",
      "body": "It seems to me that you are already familiar with the forum, I don’t think you really need help. The forum rules are simple and easy to understand, only two things can get you banned; plagiarism and sending unsolicited message. The thread by Ratimov that you quoted has educational materials about bitcoin wallets. You can also watch videos on YouTube, I recommend Andreas Antonopoulos videos.   Quote from: Nwada001 on June 14, 2023, 09:24:18 PMLooking at your profile and your post history, I no longer consider you a newbie, especially for someone who drops a comment and posts like this one: https://bitcointalk.org/index.php?topic=5253221.msg62387639#msg62387639.It’s not everyday you see a newbie that can make use of forum tables so well, which makes me doubt if this is truly his first time on the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "June 14, 2023, 09:57:11 PM",
      "body": "First of all, welcome to the forum. As a newbie, the very main focus is to learn through asking questions here in the forum and also doing your own research. There is a thread created that contains different links to a thread or topics that would be helpful in learning. The thread title is Beginners & Help Encyclopedia and be sure to check it out. Anyway, the reason why many got banned is because of violating the forum rules and make sure you think that every rules that are violated will result in getting banned even though some of it are not getting banned but getting a negative trust which is most likely much the same as getting banned in my own opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "June 14, 2023, 09:59:11 PMLast edit: June 15, 2023, 11:38:47 AM by Sandra_hakeem",
      "body": "Yes, we all know you are ... infact, anyone that gets registered in here newly is a NEWBIE. Now that shouldn't have been your topic sentence at all; it doesn't seem really interesting to read that all the time, especially since that's the nearest phrase anyone would choose to use.. be salient!!You're welcome!! I read that you're afraid of getting banned - no one likes that at all, but you shouldn't be afraid, which should be the reasons why you should get to work, and Know what you're doing in here just so you could keep doing it appropriately... Never feel belittled,.. we all started like you and we became what we are today... Consistency and focus is what I give to you!!  I DON'T MAKE POSTS JUST TO INCREASE MY COUNTS OR JUST FOR THE PERSON IN QUESTION, I BELIEVE THE NEW GENERATION WOULD GET TO READ AND KNOW ALOT WHEN WE CEASE TO EXIST IN HERE.Sandra 🧑‍🦰",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "June 14, 2023, 10:05:05 PM",
      "body": "The forum may have lots of rules like you said, but few rules must not be broken and those rules you should be wary of, such as plagiarism, spamming, AI contents, and using abusive words on members. Plagiarism and spamming are two easy route out of the forum, if boycotted. If you can use the forum without breaking few rules out of the many rules, you won't have any reason to be scared. When you are not sure, if you are getting things right, scroll through the rules again and refresh your memory. Also visit the mega board to know why some users with ban appeals are getting banned. It will enlighten you more on how to place yourself in the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "June 14, 2023, 10:15:34 PM",
      "body": "Quote from: Sandra_hakeem on June 14, 2023, 09:59:11 PMYes, we all know you are ... infact, anyone that's gets registered in here newly is a NEWBIE. Now that shouldn't have been your topic sentence at all; it doesn't seem really interesting to read that all the time, especially since that's the nearest phrase anyone would choose to use.. be salient!!You're welcome. The first rank would be brand new before it will become a newbie rank when someone registered here in the forum but the ranks that are officially starts from newbie and even the thread with a title of merit and rank requirements starts at newbie. Yes, it's not interesting at all but there are some newbie rank account in the forum but already knowledgeable about Cryptocurrency and other related information. Let's not forget that some newly accounts here in the forum are not entirely newbies at all but only their account us newbie.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "June 14, 2023, 10:25:22 PM",
      "body": "Quote from: Accardo on June 14, 2023, 10:05:05 PMThe forum may have lots of rules like you said, but few rules must not be broken and those rules you should be wary of, such as plagiarism, spamming, AI contents, and using abusive words on members. Plagiarism and spamming are two easy route out of the forum, if boycotted. If you can use the forum without breaking few rules out of the many rules, you won't have any reason to be scared. When you are not sure, if you are getting things right, scroll through the rules again and refresh your memory. Also visit the mega board to know why some users with ban appeals are getting banned. It will enlighten you more on how to place yourself in the forum. Well I think I understand where you are coming from but there is no rule and regulations that should be broken, yes some punishment for breaking a rule can be different from the other still there is always punishment for all rules that are broken.Although if we are very honest keeping to the rules is very easy just be civilized and do what's right. What I would advice newbies is not to do the unnecessary things like making unnecessary post it may give you away as using your post to hunt for merit. I think rather than that take your time to learn and then come back here with helpful post that isn't plagiarized then you would get good recognition and also the merit to grow your account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "June 14, 2023, 10:37:53 PM",
      "body": "Quote from: PytagoraZ on June 14, 2023, 05:46:56 PMQuote from: un_rank on June 14, 2023, 05:35:40 PMWhat got them banned is likely either of plagiarism or sharing malwares or ban evasion (for users that were initally banned for any of the first two reasons). If you can avoid doing any of these you have a low chance of getting banned.Is this forum strictly against plagiarism? then what if I quote a part of another website's sentence as a reference argument in the discussion? is it a violation?The forum have zero tolerance for plagiarism and at that i advise you avoid anything of such to avoid getting your account banned, and if you must cite another person's work, then you must make sure that you properly have it referenced to the original content creator and never take responsibility for another person work in form of copy and pasting.Making proper quote and including a link will go a long way in solving that issue if you have to post other people's work here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "June 14, 2023, 11:04:40 PM",
      "body": "Quote from: PytagoraZ on June 14, 2023, 05:16:14 PMHello friend...I've been on this forum for a week. <...> Hello! There are folks who have been around here for way longer than just a week, and guess what? We still don't have all the answers. That's precisely why this platform exists - to share knowledge and help each other out. So, don't hesitate to ask if there's something you don't understand. It's way better to seek clarification than to end up doing something foolish, especially when it involves money. We're all in this together, and learning from each other is what it's all about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}