{
  "id": "topic_5470948",
  "title": "RaveniaPX",
  "author": "RaveniaPX",
  "created_time": "October 19, 2023, 05:51:42 PM",
  "content": "Hi,wollte mal fragen ob es möglich UND sinnvoll ist, z.B. in Electrum mehrere Adressen zu benutzen, um Coins verschiedener Herkunft unter dem gleichen Private Key bzw. der gleichen Passphrase zu lagern. Soweit ich das mal gesehen habe kann man in Electrum \"spend from adress\" oder sowas machen, und dann kann man ganz genau die coins ausgeben die unter einer bestimmten Adresse gespeichert sind, und dabei werden alle anderen Coins die auf anderen Adressen sind nicht angefasst und das spending hört auf sobald die coins einer adresse benutzt wurden. Lässt sich das so machen daß man die Trennung der Coins auf den verschiedenen adressen vollständig, sicher und wiederholbar aufrechterhalten kann, so daß man keine Sorge haben müßten, aus Versehen Coins verschiedener Herkunft zusammenzumischen wenn man eine Transaktion macht? (Ginge sowas auch mit einer Hardware Wallet?)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470948",
  "comments": [
    {
      "author": "mv1986",
      "created_time": "October 19, 2023, 06:39:18 PMLast edit: October 19, 2023, 10:02:43 PM by mv1986",
      "body": "Quote from: RaveniaPX on October 19, 2023, 05:51:42 PMHi,wollte mal fragen ob es möglich UND sinnvoll ist, z.B. in Electrum mehrere Adressen zu benutzen, um Coins verschiedener Herkunft unter dem gleichen Private Key bzw. der gleichen Passphrase zu lagern. Soweit ich das mal gesehen habe kann man in Electrum \"spend from adress\" oder sowas machen, und dann kann man ganz genau die coins ausgeben die unter einer bestimmten Adresse gespeichert sind, und dabei werden alle anderen Coins die auf anderen Adressen sind nicht angefasst und das spending hört auf sobald die coins einer adresse benutzt wurden. Lässt sich das so machen daß man die Trennung der Coins auf den verschiedenen adressen vollständig, sicher und wiederholbar aufrechterhalten kann, so daß man keine Sorge haben müßten, aus Versehen Coins verschiedener Herkunft zusammenzumischen wenn man eine Transaktion macht? (Ginge sowas auch mit einer Hardware Wallet?)Ja, das geht grundsätzlich, aber ich brauche Dir wahrscheinlich nicht zu sagen, dass es in der Regel besser ist fürs Management zwei Wallets im Client aufzusetzen. Wenn Du das also genau managen willst, dann eben im selben Wallet mit Coin Control über verschiedene Adressen bzw. UTXOs. Die Adressen haben übrigens trotzdem unterschiedliche Private Keys, auch wenn Du sie im selben Wallet managed. Dein Seed Phrase hingegen erlaubt Dir, das gesamte Wallet inklusive aller Adressen wiederherzustellen. Ist bei Ethereum übrigens nichts anderes, wenn Du über Metamask ein Wallet erstellst. Du sicherst den Seed Phrase und kannst dann mit diesem Seed Phrase sämtliche Wallets auf einem anderen System erneut generieren, da deterministisch. Edit: also das ist jedenfalls was die meisten nutzen. Es gibt auch non-deterministische Wallets, da muss man bei den Backups anders vorgehen. Nur der Vollständigkeit halber, weil ich tatsächlich irgendwann mal unbewusst ein non-deterministisches Wallet von Electrum aufgesetzt habe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaveniaPX",
      "created_time": "October 19, 2023, 08:24:46 PM",
      "body": "Vielen Dank. Da ich also tatsächlich eher noob bin denke ich, falls ich mal in die Lage kommen sollte, daß ich dann eher mal verschiedene Wallets benutzen würde. Wie ist das eigentlich bei Hardware Wallets, hat man pro Gerät einen private key oder kann man wie auf einem Rechner beliebig viele Wallets auf so einem Gerät einrichten?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mv1986",
      "created_time": "October 19, 2023, 10:01:09 PM",
      "body": "Quote from: RaveniaPX on October 19, 2023, 08:24:46 PMVielen Dank. Da ich also tatsächlich eher noob bin denke ich, falls ich mal in die Lage kommen sollte, daß ich dann eher mal verschiedene Wallets benutzen würde. Wie ist das eigentlich bei Hardware Wallets, hat man pro Gerät einen private key oder kann man wie auf einem Rechner beliebig viele Wallets auf so einem Gerät einrichten?Da ich erst jüngst über diesen Thread gestolpert bin, verlinke ich den hier mal direkt, denn da haben sich schon einige dazu geäußert. Es lohnt sich aber durchaus einige der dort gegebenen Antworten zu lesen, denn es gibt sehr wohl Unterschiede zwischen den einzelnen am Markt verfügbaren Hardware Wallets. Aber eine kleine Anmerkung zu Deiner Frage noch: Ein Wallet hat einen Seed Phrase und je nach Art des Wallets eine oder mehrere Adressen. Der Seed Phrase kann Dir sämtliche darin angelegten Adressen wiederherstellen, sofern es ein deterministisches Wallet ist. Das heißt, Du hast sozusagen Deine \"Wurzel\" (Seed Phrase) und von da aus kannst Du sämtliches darüber angelegtes \"Geäst\" bestehend aus Adressen wiederherstellen. Trotzdem besteht aber auch für jede der Adressen (Public Key) ein dazugehöriger Private Key. Man sollte also nicht \"Wallets\" mit \"Adressen\" vertauschen. Ein neues Wallet benötigt auch einen neuen Seed Phrase. Deshalb ist es nämlich wichtig, wenn man ein non-deterministisches Wallet benutzt und bspw. einen Private Key importiert, dass man dann daran denkt, diesen Private Key auch weiterhin geschützt aufzubewahren, denn die importierte Adresse kann mit dem Seed Phrase für das non-deterministische Wallet NICHT wiederhergestellt werden.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxMueller",
      "created_time": "October 20, 2023, 09:16:47 AM",
      "body": "Quote from: RaveniaPX on October 19, 2023, 08:24:46 PMWie ist das eigentlich bei Hardware Wallets, hat man pro Gerät einen private key oder kann man wie auf einem Rechner beliebig viele Wallets auf so einem Gerät einrichten?Um die Frage sinnvoll zu beantworten müsste man erstmal wissen welche Hardware Wallet du hast und was du unter \"Wallet\" verstehst (vermutlich 24 Wörter = Wallet A, andere 24 Wörter = Wallet B).Du kannst aber wie schon von von mv1986 beschrieben mehrere Adressen aus den selben 24. Wörtern ableiten, z.B. durch Verwendung eines oder mehrerer 25. Wörter (schau dir dazu mal  BIP39 und BIP85  an.Die Bitbox02 kann zum Beispiel nur einen Satz aus 24 Wörtern gleichzeitig managen, unter dem aber dann alle mit BIP39 abgeleiteten Adressen angezeigt werden, sodass man also trotzdem ne Kontentrennung machen kann wenn man das will. Da müsstest du also präziser werden. Welche Hardware wallet geeignet ist hängt halt auch stark davon ab was du vor hast und was du ausgeben willst...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaveniaPX",
      "created_time": "October 24, 2023, 07:46:42 PM",
      "body": "Hi, vielen Dank!Ja also was ich meinte ist ein einzelnes Set an Adressen, also ein mal 12/24/25 Wörter. Wenn ich verschiedene Coins mit verschiedener Herkunft darunter lagern wollen würde, dann müßte ich die verschiedenen Adressen voneinander separat behandeln können. Mir wird aber langsam klar daß es wohl einfach zur Sicherheit besser wäre wenn ich mehrere Sets (also mehrere 12/24/25 Wörter) einrichten würde. Ich dachte nur es könnte vielleicht von Vorteil sein sich nur eine einzige Seed Phrase merken zu müssen.Schade daß die Bitbox nur eine einzelne Seed Phrase kann. Ich hätte mir jetzt gedacht, daß so eine Hardware Wallet eigentlich genug Kapazitäten für mehr haben sollte. Ich selbst habe ja noch gar keine Hardware Wallet, bin aber am Überlegen ob es nicht vielleicht Sinn machen könnte sowas zu haben.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mv1986",
      "created_time": "October 24, 2023, 11:47:25 PM",
      "body": "Quote from: RaveniaPX on October 24, 2023, 07:46:42 PMHi, vielen Dank!Ja also was ich meinte ist ein einzelnes Set an Adressen, also ein mal 12/24/25 Wörter. Wenn ich verschiedene Coins mit verschiedener Herkunft darunter lagern wollen würde, dann müßte ich die verschiedenen Adressen voneinander separat behandeln können. Mir wird aber langsam klar daß es wohl einfach zur Sicherheit besser wäre wenn ich mehrere Sets (also mehrere 12/24/25 Wörter) einrichten würde. Ich dachte nur es könnte vielleicht von Vorteil sein sich nur eine einzige Seed Phrase merken zu müssen.Schade daß die Bitbox nur eine einzelne Seed Phrase kann. Ich hätte mir jetzt gedacht, daß so eine Hardware Wallet eigentlich genug Kapazitäten für mehr haben sollte. Ich selbst habe ja noch gar keine Hardware Wallet, bin aber am Überlegen ob es nicht vielleicht Sinn machen könnte sowas zu haben.Hardware Wallets sind schon immer sinnvoll und zwar aus verschiedenen Gründen. Wenn Du Dich noch nicht so auskennst und die Beträge, die Du managen willst, als relativ klein betrachtest, dann ist es eigentlich genau der richtige Zeitpunkt sich damit auseinanderzusetzen und zu schauen, was für einen wie am besten funktioniert. Wenn man das erste mal ein Hardware Wallet bedient und dann eine für sich persönlich sehr ernstzunehmende Summe auf einem unbekannte Systeme transferiert, dann ist man immer erstmal skeptisch. Also, ruhig schon mal eins anschaffen und sich damit bekanntmachen. Dann natürlich ganz klar, wenn es um größere Mengen Krypto geht, ist das ein Muss. Es ist schon so, wenn mich mal jemand fragt, wie er das am besten machen kann und grad noch nicht so viel Zeit/Lust hat, sich mit der Verwahrung aufzuhalten, dass man dann mal ein Auge zudrücken kann bei Kleinstbeträgen und es als Überbrückung OK wäre, dass bei einer Börse wie Bitcoin.de liegen zu lassen. Aber sobald das über das Herumprobieren hinausgeht, sollte man grundsätzlich willens sein, sich damit zu befassen. Überleg mal wie viel Zeit Du in die Anschaffung Deines letzten Computers/Laptops oder auch Smartphones/Smartwatch sonstwas gesteckt hast!  Das ist immer ein gutes Beispiel, das ich gern bringe, weil ich mich selbst kenne. Ich sitze mal Tage und Wochen, bevor ich mich dann für so ein Technikteil entscheide. Also sollte es ja auch möglich sein, sich ebenfalls die Zeit für ernstgemeinte Investments zu nehmen. Und so wie es bei Laptops und Smartphones halt das passende Setup sein soll, so geht es bei Investments vor allem ums Management und im Fall von Bitcoin speziell um die Verwahrung.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}