{
  "id": "topic_5449759",
  "title": "Forever101",
  "author": "Forever101",
  "created_time": "April 22, 2023, 05:46:33 AM",
  "content": "When I was new to Cryptocurrency, I had join several crypto groups in other to expand my understanding of cryptocurrency and how it works. On several occasions , I have come across groups of people in a social media groups who talks about pumping a particular crypto for a specific period of time before getting out of the market. This is nothing but a dubious means of getting away with others  money. The pump and dumb scheme is orchestrated by people with the intention of selling their cryptocurrency as the price surges. There are some who keep pushing others to buy while they secretly sell their Cryptocurrency to make money from the price movement.Most pump and dump scheme is achieved through the use of bots. Such post and messages on social media are carried out by bots that spread it to their followers. In most groups, we have seen a  situation where everyone(mostly bots) seems to support the pump and dump mechanism which is detrimental to good investing ethics.Today , a lot of people depend on social media influence on some cryptocurrency price movement, could the signal from social media be referred to as a measure Cryptocurrency performance with the current use of bot across all social media. ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449759",
  "comments": [
    {
      "author": "Dakcrypto",
      "created_time": "April 22, 2023, 09:33:02 AM",
      "body": "Basically, fraud has taken over the most serious part of cryptocurrencies, especially bitcoin. It's now seen as scam stuff, and only a few know the truth and the good parts of bitcoin.The problem people who fall into these simple tricks have is greed. How can you wake up one morning and expect $25,000 with just $200 when you didn't work for it? This is exactly what happens to people who get involved in social media and cryptocurrency influence.The Google search engine is a big tool to help people learn about Bitcoin and how to invest, but people underestimate that and go where they are told to bring just $200 to trade and make $25,000 and above.Thank God you are part of this forum, and here you will learn more and more of what you wanted to know about Bitcoin or cryptocurrencies in general.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "April 22, 2023, 10:17:11 AM",
      "body": "Quote from: Forever101 on April 22, 2023, 05:46:33 AMtalks about pumping a particular cryptoYes, this is a risk, especially in the case of coins with low cap, maybe low liquidity too.It's something the regulators have to address, because indeed, it's not right. But, historically, I think that the stocks too had this kind of problems many many years ago.However, doesn't this belong to altcoins?Bitcoin should be much safer against this kind of attacks. Not 100%, but still, I expect one such group needs really big funds to pull this on bitcoin with money alone. However, you'll learn that pump and dump schemes can these days also involve a great amount of social engineering (from FUD to posts even like your very own!) and inside jobs too (wash trading), but that's no longer gray area, it's plain illegal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "April 22, 2023, 12:31:56 PM",
      "body": "Quote from: Forever101 on April 22, 2023, 05:46:33 AMToday , a lot of people depend on social media influence on some cryptocurrency price movement, could the signal from social media be referred to as a measure Cryptocurrency performance with the current use of bot across all social media. ? Social media is not a determinant for bitcoin price but I can't say for other cryptocurrencies, crypto news has a little influence in it but not the major factor on bitcoin price, it's by demand and supply rate, so wether the social media perform well or not it has nothing to do with price determination, same also is applicable to other economy that operate under fiat, they have nothing to do with crypto irrespective of the inflation or market fluctuations, they don't set the price for bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "April 22, 2023, 12:59:28 PM",
      "body": "Most of those pump-and-dump schemes actually work. I don't know how they do it, but it's not something someone has to relay on because those people are in it for something (profit), which they have to achieve by whatever means necessary. If you already consider yourself not to be a newbie on crypto again, then you should be aware of lots of scams on the internet these days. There is nothing new again; some crypto projects go as far as paying huge amounts of money to influencers online who will promote their project just for them to rug pull when the price reaches a point where they can cash out huge. Quote from: Dakcrypto on April 22, 2023, 09:33:02 AMThe Google search engine is a big tool to help people learn about Bitcoin and how to invest, but people underestimate that and go where they are told to bring just $200 to trade and make $25,000 and above.Don't rely too much on the information you get from Google; Google is an organization that is profit-oriented; they can advertise even wrong information regarding something, provided they are paid enough for them to do that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "merekamo",
      "created_time": "April 22, 2023, 03:11:18 PM",
      "body": "I would say that while social media can provide some insights into the popularity and sentiment around a particular cryptocurrency, it's essential to be cautious and not take everything at face value. Yeah, there are definitely cases of manipulation through pump and dump schemes, and bots can skew the perception of genuine support or interest in a certain crypto.Finally, crucial to do your research and not solely rely on social media signals to make investment decisions. It's always a good idea to look at multiple sources of information, including expert opinions, news articles, and market data, before making any moves in the crypto market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "April 22, 2023, 03:20:29 PM",
      "body": "It doesn't require scientific knowledge to edit website content using Inspect Element tool in a web browser. Most of the screenshots which are posted on Crypto Twitter are fake and are only promoted just to scam most money out of the newbies who want to make quick money. You already know how the quick money mentality works and they attract only those who are willing to gamble their money.This is a general idea of how these pumps and dumps work -1. select a coin with zero to no volume2. buy the coin at 9:28 PM, announce it in the group at 9:30 PM3. set take profit at 10-15% of the price you bought at and dump it on your followersThis is generally how these pumpNdump work. I was invited once to a group which was of elite members and their main motive was to invite as much as many people from crypto to their telegram groups so that they can create actual demand of a dead coin in the market and this way, those who are not even part of the telegram group starts buying after seeing that a coin is pumping for no reason just for the hype.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "April 22, 2023, 03:57:34 PM",
      "body": "Quote from: Forever101 on April 22, 2023, 05:46:33 AMThis is nothing but a dubious means of getting away with others  money. The pump and dumb scheme is orchestrated by people with the intention of selling their cryptocurrency as the price surges. There are some who keep pushing others to buy while they secretly sell their Cryptocurrency to make money from the price movement.If you look at many Alticoins that suffer loss you will find social media influencers or it’s whales trying to convince the investors that it is just a bearish period. And due to FOMO many people have jumped into buying it. The most recent ones are this AI tokens, people have turn serious attention towards it because of the mass evolution of ChatGPT coming up. Memecoins are the clear examples of the dump and pump coins. The clear thing newbies need to know is that there’s isn’t anything like a clear signal or a trusted one. Many of these works on just past experiences. Also one of the last place to trust an investment advice on the social media. Because most of this influencers do not even know a thing about bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}