{
  "id": "topic_5475904",
  "title": "bluebit25",
  "author": "bluebit25",
  "created_time": "November 29, 2023, 08:41:05 AM",
  "content": "- Have you ever wondered what factors in this market make people feel interested and keep going for a long time? With the advent of dozens of Layer 2 today, it really makes me laugh about competition.- Not to mention far-fetched, the BLAST Layer 2 ponzi  (in my personal opinion) was born not long ago but is far surpassing TVL among the familiar names in this field that have appeared before, such as Zksync, Starknet... This is not an introductory topic about BLAST, so everyone should be responsible for their own decisions. Although I previously created a topic about BLAST's airdrop issue, https://bitcointalk.org/index.php?topic=5475377.0- What do you think about this?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475904",
  "comments": [
    {
      "author": "tajimas",
      "created_time": "November 29, 2023, 09:36:12 AM",
      "body": "Only the desperate newbies that never understand how layer 2 works fall into such heavy scam. You can detect a ponzi project by proper checking on the whitepaper, observing the scalability and interoperability problem solving if you are a full-stack blockchain developer. If not, the ponzi story will never end.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "November 29, 2023, 11:02:00 AM",
      "body": "Quote from: bluebit25 on November 29, 2023, 08:41:05 AM- Not to mention far-fetched, the BLAST Layer 2 ponzi  (in my personal opinion) was born not long ago but is far surpassing TVL among the familiar names in this field that have appeared before, such as Zksync, Starknet... So are you saying that injected funds via blast and other L2 are kind of ponzi? In difference, those ponzi platform guaranteed you a reward and later will rug out of blue moon. These L2 platforms are operating in the idea of defi. They are inviting people to interact, add liqudity anf use their network and that includes dapps that works under them. Its like building an ecosystem plus a chance to earn free tokens whenver they issued one. But they dont promise like L2 does.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "November 29, 2023, 11:11:18 AM",
      "body": "I see that investing in new projects that are not a trend is better than repeating projects such as web V3, layer 2, DeFi, DEX and other project words. It will not be better than investing in layer 3, AI, or AI V2 and new projects, as the entire market is based on hot money and investments. Instantaneous, which may not often have a high return on investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "November 29, 2023, 12:34:50 PM",
      "body": "Quote from: tajimas on November 29, 2023, 09:36:12 AMOnly the desperate newbies that never understand how layer 2 works fall into such heavy scam. You can detect a ponzi project by proper checking on the whitepaper, observing the scalability and interoperability problem solving if you are a full-stack blockchain developer. If not, the ponzi story will never end.Sometimes old investors also fall victim to this kind of scamming method because those scammers have some techniques that haven't been listed in the books yet. that's why when some projects offer you some high returns, it already gives you a reason not to invest in their platforms because it is obviously a red flag and there is no need to further investigate their whitepapers and roadmaps. But there's nothing you can people become greedy because they are already blinded by false promises and the only thing that will make them awake is when they see their investments are gone because the price has crashed and will never recover again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kentrolla",
      "created_time": "November 29, 2023, 12:54:40 PM",
      "body": "Nowadays it's bit difficult to differentiate between scam and the coins with good potential and apart from going through the whitepaper I always check for the returns which they promise and gone are those days when only newbie used to get trapped in their scams now we have seen people who are in crypto domain for a while falling for these traps due to unique methodologies used by these scammers. But I would not go with the trend as per my personal experience because once anythings starts trending be it NFT, Layer2 or meme coin because scammer knows people will blindly follow the trend and it's the easiest way to scam. As you said the best way is to do your own research and analysis take opinions but don't blindly go with other's opinions and blame them later. It should be our research and analysis with overall reviews and opinion playing minor role",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sana54210",
      "created_time": "November 29, 2023, 06:41:31 PM",
      "body": "Quote from: kentrolla on November 29, 2023, 12:54:40 PMNowadays it's bit difficult to differentiate between scam and the coins with good potential and apart from going through the whitepaper I always check for the returns which they promise and gone are those days when only newbie used to get trapped in their scams now we have seen people who are in crypto domain for a while falling for these traps due to unique methodologies used by these scammers. But I would not go with the trend as per my personal experience because once anythings starts trending be it NFT, Layer2 or meme coin because scammer knows people will blindly follow the trend and it's the easiest way to scam. As you said the best way is to do your own research and analysis take opinions but don't blindly go with other's opinions and blame them later. It should be our research and analysis with overall reviews and opinion playing minor role The issue was there were ones that promised like 5000% returns yearly, and people did fall for it. The trick with DeFi world was that if you have only a thousand dollars in LP then yes you could make a lot of return, but the most likely outcome in most cases was that you would have tens of thousands join after you, and drop it to under 10% return yearly, in a place that was already quite risky.This means that we are talking about scams and also failures, just because a place is not a scam, doesn't mean that they are not screwed up or terrible. In the end, if you know what you are doing then you should trust yourself and keep on making as much money as you could with it, but if you are unsure then do not risk your money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "November 30, 2023, 01:52:14 AM",
      "body": "Quote from: cryptoaddictchie on November 29, 2023, 11:02:00 AMQuote from: bluebit25 on November 29, 2023, 08:41:05 AM- Not to mention far-fetched, the BLAST Layer 2 ponzi  (in my personal opinion) was born not long ago but is far surpassing TVL among the familiar names in this field that have appeared before, such as Zksync, Starknet... So are you saying that injected funds via blast and other L2 are kind of ponzi? In difference, those ponzi platform guaranteed you a reward and later will rug out of blue moon. These L2 platforms are operating in the idea of defi. They are inviting people to interact, add liqudity anf use their network and that includes dapps that works under them. Its like building an ecosystem plus a chance to earn free tokens whenver they issued one. But they dont promise like L2 does.The picture I mentioned above probably portrays the message I'm talking about, I'm not claiming everything but just talking about Blast,and the rest L2, but projects that are heavily DeFi  like you said,  they are pure tech and have a sustainable development plan, not any hype to pump/dump.The issue of finding each person's airdrop through many programs and long-term interactions in the ecosystem is each person's own research, and usually there is no complete guarantee, but most of us understand. Those projects will be airdropped to users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Makus",
      "created_time": "November 30, 2023, 02:42:15 AM",
      "body": "These scam project are often times a bit tempting to invest in, first they'll create a trend that will attract investors, even with the knowledge of the investor on concerning scam project yet some still act blindly to investing huge amount money but later regrets would normally be the outcome, they say \"A wise man can never be cheated twice\" so anyone falling into this kind of scam for more than one time is just displaying some characteristic of an unwise. No matter how much you invest, a loss will definitely trigger  emotional switch. Sometimes its good to just concentrate on one project rather than having too many projects in your portfolio. Because of such scams I have gone as far as making all my investment in bitcoin alone, so I'll not be having such experience of tragic loss in the hands of deliberate scam project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "asriloni",
      "created_time": "November 30, 2023, 03:43:52 AM",
      "body": "This is a classic story. Those investors who have been sending their ethereum and stable token to be locked in the blast multisig have known so well about what they were doing. They were trying to take a huge risk to get a huge gain. People will always repeat the classic storyThey called that blast as a ponzi. In fact, blast was not offering non sense yield for its stakers. The only rules that was triggering people to call it as a ponzi is- 2-3 months vesting- Invitation mechanismOnce the blast is successfully launched and people are able to withdraw their ethereum, they will regret their decision to participate in the blast early launch phase and their opinion will change.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Publictalk792",
      "created_time": "November 30, 2023, 04:03:53 AM",
      "body": "We mostly seen many projects and airdrops which are dropping on Layer 2. And this is really difficult to differentiate between the real and scam projects. And mostly there are meme coins which are coming up. Not now if we look into the past so we will see that scammers are always tried to invent new methods to scam people.They invent new and new methods to grab money. They also go with the trend. If there were the trend of ICO so they were in it. If there were the trend of meme coins so we saw them in that trend. In move to earn in watch to earn means everywhere you will see them. And now we are looking that the on going trend is Layer 2 and Web3 so we are looking them in this trend too. The main thing is that how we are securing ourselves from these kind of scammers. So always be careful and never fall in to the scam projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "November 30, 2023, 07:06:03 AM",
      "body": "Quote from: asriloni on November 30, 2023, 03:43:52 AMOnce the blast is successfully launched and people are able to withdraw their ethereum, they will regret their decision to participate in the blast early launch phase and their opinion will change. Fraud comes from the window and not from the door, meaning that fraudsters will invent new ways to deceive you, but the principle is the same, which is that they make you hungry enough to believe that they can make you rich in a short time without knowing how it is done. They may convince you of the possibility of withdrawing and making profits, and some may collect profits, but in the end, what method? It tells you to make a quick profit and double your money is a scam, and you should not lose your money to reach this conviction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Velemir Sava",
      "created_time": "November 30, 2023, 07:30:33 AM",
      "body": "Quote from: tajimas on November 29, 2023, 09:36:12 AMOnly the desperate newbies that never understand how layer 2 works fall into such heavy scam. You can detect a ponzi project by proper checking on the whitepaper, observing the scalability and interoperability problem solving if you are a full-stack blockchain developer. If not, the ponzi story will never end.I think so too, but people's ambitions to make money quickly are not restrained and they will do anything to get it in various ways, from ICO, IEo and through Airdrop too. but there are still people who are interested without analyzing it first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ultrloa",
      "created_time": "November 30, 2023, 07:48:48 AM",
      "body": "Quote from: yazher on November 29, 2023, 12:34:50 PMQuote from: tajimas on November 29, 2023, 09:36:12 AMOnly the desperate newbies that never understand how layer 2 works fall into such heavy scam. You can detect a ponzi project by proper checking on the whitepaper, observing the scalability and interoperability problem solving if you are a full-stack blockchain developer. If not, the ponzi story will never end.Sometimes old investors also fall victim to this kind of scamming method because those scammers have some techniques that haven't been listed in the books yet. that's why when some projects offer you some high returns, it already gives you a reason not to invest in their platforms because it is obviously a red flag and there is no need to further investigate their whitepapers and roadmaps. But there's nothing you can people become greedy because they are already blinded by false promises and the only thing that will make them awake is when they see their investments are gone because the price has crashed and will never recover again.But if they could just understand the type of investment they are participating on for sure they can determine how risky this investment they are participating on that's why all investors should know that if there's something offer like giving you a huge advantage to other if you invest some amount for their project then this is totally huge red flag to take. Especially if they are not really true to the words they are saying since for sure we know how those project will end up since we see a lot of them fall instantly.I guess we need to learn from other methods used by scammer and we shouldn't let them fool us by using other word innovative tech introduce so that they can't harm us financially. If we really want to invest with them then we should do all safety precaution since this makes us more smarter than those scammers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}