{
  "id": "topic_5422982",
  "title": "MinMan",
  "author": "MinMan",
  "created_time": "November 24, 2022, 12:56:23 PM",
  "content": "https://bitcointalk.org/index.php?topic=5400828.msg61334521#msg61334521Expecting your reply there...I am just curious on knowing who is lying?Quote from: shasan on November 21, 2022, 04:51:00 PMalso ignored answering about the link (on telegram).Quote from: Carollzinha on November 23, 2022, 12:21:54 AMwhen you asked to add the link to the OP and I mentioned that it is not supposed to be an public sheet for everyone to go in & out but a sheet for the campaign members only.. I never did ignore you or have been rude in any wayAll the above, I feel like it is kind of breach to others privacy. I am saying this because this is a community which values own privacy at ultimate priority and expect the same from others as well and hence should follow the same for the case of others privacy as well.Quote from: shasan on November 21, 2022, 04:27:08 PMCan anyone share the link to the spreadsheet?Here is the short story about the situation:1. shasan wanted to see/check stake's signature camp sheet.2. As they could not find that on OP, tried to get from the camp manager in telegram.3. Seems like managers did not provide the link, shasan asked for link in campaign topic and someone got them the link.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5422982",
  "comments": [
    {
      "author": "shasan",
      "created_time": "November 24, 2022, 01:11:16 PM",
      "body": "I could not understand the reason for creating this topic. We both are right. I was right at the time I posted and the manager of the campaign was right too at the time of posting. There is no reason to argue on the signature campaign thread. I have got the necessary information which I need. Someone may stay busy with other tasks that's why the person may not respond on time on the contrary the needed person may try to solve the problem as soon as possible. As the manager has not replied at that time I posted on the thread and got the solution in a several ways.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MinMan",
      "created_time": "November 24, 2022, 01:13:48 PM",
      "body": "Sorry I could not imagine about the situation like you asked on telegram and on topic at a time. Locking the topic....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}