{
  "id": "topic_5470325",
  "title": "ChiBitCTy",
  "author": "ChiBitCTy",
  "created_time": "October 14, 2023, 02:08:22 PMLast edit: October 16, 2023, 02:57:19 PM by ChiBitCTy",
  "content": "I am posting this on behalf of a buddy of mine. Him and I are likely the two biggest collectors of Pinnacle Mint Collection coins. From 1996-98 NFL, MLB, NHL & NASCAR had a card/coin series (as some of you may remember). There were all sorts of coins made for each year, but only 1 of 1 solid gold coins were made for each player and likely only 20-25 of each player for Fine Silver (NFL fine silver coins only produced for 1996 & 1997).. These were pack redemptions, making it all the more difficult to acquire. This is likely the only complete NFL set you’ll ever come across again. This buddy and I got very lucky meeting a relative of a Pinnacle/Fleer/Donruss executive whom passed away and inherited these coins. Otherwise the likelihood of us completing sets (I completed my 1998 MLB fine silver set) would have been near impossible. “Listed is the RARE, COMPLETE SET of the 1997 Pinnacle Mint Fine Solid Silver Coins! This is the complete set of ALL 30 coins! Set includes many Hall of Famers, such as Brett Favre, Dan Marino, Troy Aikman, Steve Young, John Elway, Barry Sanders, Emmitt Smith, and Jerry Rice! It is believed that only 20-25 of each coin was ever made! Please use the pictures as a reference. Don’t miss out on this one-of-a-kind” eBay link- https://www.ebay.com/itm/325842627376?mkcid=16&mkevt=1&mkrid=711-127632-2357-0&ssspo=JbXcbFI9SbO&sssrc=4429486&ssuid=6B7-avqJQ5K&var=&widget_ver=artemis&media=COPYIf you’re interested let me know and I can help broker the deal. Bitcoin is accepted as a form of payment. Questions, please ask! Edit (example of what the boxes/packs look like as well as some of the cards which some have holes to place the coins in):https://imgur.com/a/2lYgcud",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470325",
  "comments": []
}