{
  "id": "topic_5472321",
  "title": "NotATether",
  "author": "NotATether",
  "created_time": "October 31, 2023, 11:51:02 AM",
  "content": "What are bitcoiners doing nowadays to make KYC-free transfers from their bank accounts? I don't particularly care from which country this is done.Localbitcoins has shut down and pretty much every exchange including KuCoin is enforcing KYC nowadays. So in your experience, what is your reliable (as in, you don't have to wait for several days) method of buying and selling Bitcoin without shelling out your documents?I'm just curious, not in a rush to do anything.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472321",
  "comments": [
    {
      "author": "hugeblack",
      "created_time": "October 31, 2023, 01:56:51 PM",
      "body": "It will differ from one region to another, but I see that the adoption of Bitcoin is increasing significantly, or at least in my region. Therefore, it is easy to search on Twitter or Facebook for people interested in buying and selling, and then meeting in a public place and conducting the exchange is the best method. Sometimes they accept cash, and at other times a bank transfer.After time passes, you can create a network of trust between these people or perform a new process every time if you want to enhance your privacy.You can also ask someone to search Binance P2P for active traders and communicate with them outside the platform.Bisq is another way if you are outside my country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "October 31, 2023, 08:10:42 PM",
      "body": "The best choice is to find a trusted network for a P2P deal. Meeting with people is highly risky for your funds and your life as well. So I will prefer to avoid it. For me, it's pretty easy to buy and sell Bitcoin without any exchange. We have a trusted reselling network where we can buy and sell any crypto with fiat. We just need to make sure the seller or buyer is trusted and doesn't have a history of scams. I do this when I need to convert my crypto to fiat. We build a trusted network somehow that covers almost the entire country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alani123",
      "created_time": "October 31, 2023, 08:13:41 PM",
      "body": "Want KYC free access to BTC from your bank account? You'd have to use someone else's bank account... Sadly the exchanges with big liquidity utilize bank wires to fund accounts. If you can find a local seller to give you in-person services however, you can skip this yourself. But  it's going to cost you 10% to 3% above market price because the seller also has to make it worthy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "October 31, 2023, 08:28:18 PM",
      "body": "Depends on where you are.For the US Zelle for now does not report to the government and so long as you keep it under certain limits banks in general don't report it either. There are some P2P places that have that as an option:https://localcoinswap.com/sell/crypto/united-states/zelle-payA lot also depends on your own level of what you are willing do deal with.There are a lot of banks that don't report internal transfers to the IRS or anyplace else (unless they get a subpoena or similar) but do you want to have a dozen different bank accounts so you can get funds from people who bank with different banks.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "October 31, 2023, 09:47:45 PM",
      "body": "I mostly use Localcoinswap and AgoraDesk when cashing out after Localcryptos shutdown. Fortunately for me, the payment options offered by the advertisers from my area are pretty swift. Transactions can be done in under 15 minutes.I abandoned localbitcoins wayback even before they shutdown so when they eventually announced that they were exiting. I didn't feel a thing. Localcryptos stopping their services on the other hand hurt a bit since it was my preferred platform at that time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "October 31, 2023, 10:29:26 PM",
      "body": "Quote from: NotATether on October 31, 2023, 11:51:02 AMWhat are bitcoiners doing nowadays to make KYC-free transfers from their bank accounts? I don't particularly care from which country this is done.Localbitcoins has shut down and pretty much every exchange including KuCoin is enforcing KYC nowadays. So in your experience, what is your reliable (as in, you don't have to wait for several days) method of buying and selling Bitcoin without shelling out your documents?I'm just curious, not in a rush to do anything.In my region, a community has been formed through the Telegram group, where offers are given exclusively for direct exchange through personal contact. Only without a commission. Now it has been going on for a couple of years, so I would say that it is quite a stable method.There is also a list with user ratings, that provides additional security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "November 01, 2023, 02:26:44 AM",
      "body": "If you're specifically asking about transactions \"in and out of banks,\" is there a way to avoid KYC? In the first place, that bank itself has all your details. There are a number of KYC-free recommended platforms, though, like AgoraDesk, Hodhodl, Bisq, non-KYC ATMs, Robosats, xchange.me, and so on, but if the money is sent or received through a bank, I don't see how that is a KYC-free transaction. Personally, the best non-KYC transaction I prefer is face-to-face, but even this is risky especially when it involves a relatively large amount. So far, I admit I have a hard time selling Bitcoin without somehow passing through parties which require KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EmpoEX",
      "created_time": "November 01, 2023, 01:19:01 PM",
      "body": "Quote from: NotATether on October 31, 2023, 11:51:02 AMI'm just curious, not in a rush to do anything.What about localmonero and agoradesk? You can also try https://unstoppableswap.net, https://peachbitcoin.com, https://blockdx.netYou can check https://kycnot.me/?type=exchange for more exchanges that does not require KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "November 02, 2023, 02:01:11 AM",
      "body": "Some of my friends rely on P2P to deal with BTC liquidation. I don't think much has changed for them since they never rely on exchanges to liquidate their BTC. On the other hand, my local exchange KYC policy is still not that aggressive so a lot of people still use them to liquidate their crypto. I'm not sure how long it will stay, though they will probably follow the US or other markets soon since they don't want to deal with foreign bans and something like that. Not to. mention some local exchanges are actually owned by foreign companies like Binance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "November 02, 2023, 04:44:37 AM",
      "body": "For me, the only way I use to transfer Bitcoin to Cash is via P2P, the cash is received via money transfers or bank accounts in an internal, unobtrusive manner. There are reliable Telegram channels that I have been dealing with for a while and I make transfers on the same day with a commission of about 2% and there is no problem. In my country, this is the only method available for buying and selling Bitcoin, so there are a lot of buying and selling requests in the channel and things are done quickly and easily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "November 02, 2023, 06:49:46 AM",
      "body": "Quote from: EmpoEX on November 01, 2023, 01:19:01 PMQuote from: NotATether on October 31, 2023, 11:51:02 AMI'm just curious, not in a rush to do anything.What about localmonero and agoradesk? You can also try https://unstoppableswap.net, https://peachbitcoin.com, https://blockdx.netAll very good options. Although UnstoppableSwap and BlockDX (naturally) do not have fiat capability.So I'm getting the gist here that buying and selling here is mainly be done by Telegram channels.I am going to need some channel links since I'm not going to risk getting burned by looking for them myself and encountering less-than-savory buyers / sellers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "November 02, 2023, 07:10:38 AM",
      "body": "I never use a telegram channel, but I usually trade using someone service in my local which don't need to submit KYC when the amount is small. I ever tried to use Agoradesk, but the rate isn't make sense, I need to pay 10-20% more since that's the best deal in my country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "November 02, 2023, 06:51:56 PM",
      "body": "Quote from: The Cryptovator on October 31, 2023, 08:10:42 PMThe best choice is to find a trusted network for a P2P deal. Meeting with people is highly risky for your funds and your life as well. So I would prefer to avoid it. For me, it's pretty easy to buy and sell Bitcoin without any exchange. We have a trusted reselling network where we can buy and sell any crypto with fiat. We just need to make sure the seller or buyer is trusted and doesn't have a history of scams. I do this when I need to convert my crypto to fiat. We build a trusted network somehow that covers almost the entire country.Security is one of the challenges of using social media to find a P2P deal. We have a few social media channels that advertise bitcoin exchange deals but they are also used by criminals to carry out evil activities. It will be difficult to know a genuine trader except you have had dealings several times with him. Engaging in the transaction in a public space is good but it is also an infringement on your privacy. There have been cases where people have been traced to their homes and robbed. The best option is to use the available decentralized exchanges and just keep hoping that will always be around. Alternatively, if you can be fortunate to have a group of trustee bitcoiners, that would also be nice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "November 05, 2023, 02:38:39 PM",
      "body": "I have always tried to avoid banks when it comes to cryptocurrencies, and I will continue to do so in the future - although I can do so thanks to the specific situation of having physical exchanges available where KYC is not required up to a certain amount. When that is no longer possible, then the only options left for me are to look for someone who wants to exchange face to face, or perhaps to acquire a bank card that enables anonymity - which again has its price.There is also an option to buy something online and pay with BTC, and then try to sell it for cash. In each of these cases, I can avoid the bank and KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}