{
  "id": "topic_5460632",
  "title": "ESUD-cfntif",
  "author": "ESUD-cfntif",
  "created_time": "July 22, 2023, 03:17:39 AM",
  "content": "PREAMULEWhat is the metaverse? What is the future direction of artificial intelligence? Is digital currency really only a securitized investment product? Can decentralization really change the world? These are questions that we have thought about for a long time.The Knle family team is made up of a group of natural people, and we have said this many times in different ways to different people. In the very beginning, everyone came together just to do something that would allow them to have no regrets in their lives. But it is always in the state of being explored and cannot get a clear direction.Until the time came to 2018, the team members inadvertently got the idea and direction of real artificial intelligence and metaverse. At that time, there was no word \"metaverse\"; after our continuous verification, the theory of artificial intelligence with self-awareness has been verified, and the construction framework of the metaverse has been truly completed, but how to implement our achievements at this time has become the biggest problem. confusion;But luckily, we are strong. At this time, some team members proposed blockchain technology. Just like the few questions we raised at the beginning of the article, the business we are engaged in, like blockchain and cryptocurrency, is a seemingly unsolvable problem.Therefore, through our in-depth participation, understanding and analysis of digital currency, we have developed a complete plan including digital currency, decentralization, enterprise establishment and operation, factory production and social operation. This plan is Es-Universe, where ES is the abbreviation of Emperor Star. It comes from an ancient oriental legend, and it is also the cause that everyone really wants to complete since the establishment of the Knle family.After the plan is completed, the team members have a deep sense of pride, because once the plan is implemented, the talents of more people will not be buried. At the same time, the implementation of the plan will also create a more equitable society, and the future of prosperous business and increasing population is no longer out of reach, like a ray of light in a cold night.In our eyes, this is not only a change in the business system, but also an innovation based on digital currency. It is our expectation and hope for a better society;Finally, I hope that everyone who can read this white paper can be happy, happy and healthy;                                                                                                             2023.6.23  Cfntif.JN.Knle",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460632",
  "comments": [
    {
      "author": "ESUD-cfntif",
      "created_time": "July 22, 2023, 03:28:45 AM",
      "body": "Es-universe：A comprehensive metaverse system that includes the establishment, governance, and operation of decentralized entities that can circulate digital currenciesSummary                                                                                                                                                           Brief introduction: Es-universe is a new metaverse system highly related to social and economic activities, people's daily work, life, entertainment, etc. The system consists of K-DEP decentralized enterprise platform, ESUD token, KESBusiness holographic business metaverse, KES Holographic Holographic Virtual Universe. This article focuses on the K-DEP decentralized enterprise platform and ESUD system. KESBusiness and KES Interpretation; -1- About Decentralized Enterprises（DE)                                                                                                 A decentralized enterprise refers to a DE enterprise in which all participants can equally and completely participate in DE enterprise governance and decision-making, and equally enjoy rights such as governance and dividends. Its characteristics are as follows:(1) Project design and IEO (Initial Equity Offering) are initiated by people with project planning capabilities;(2) All participants enjoy equal dividend rights, decision-making rights, and governance rights;(3) The established DE enterprises are production, sales, trade, service and other entities, and pure network projects and DE enterprises that rely on personnel and do not generate actual value are not accepted;(4) All equity participants are decision makers, anyone can submit a proposal, and reach a consensus layer by layer according to the block generation method, and must implement it after obtaining all consensus;(5) All participants share the role of the DE enterprise board of directors, and the actual operation is in charge of the professional managers who participate in the voting and reach a consensus based on the voting results;(6) The voting incentive scheme based on the hierarchical voting algorithm and the absence processing scheme ensures the rapid execution of DE enterprise decision-making;(7) Equity and incidental rights can be publicly transferred at any time;-2- About IEOs                                                                                                                                     The most fundamental difference between the IEO of a decentralized enterprise project (DEP) and a common IPO (initial public offering) is as follows:(1) What IEO issues is equity with equal dividend rights and governance rights, rather than shares in the IPO. IEOs focus on governance, dividends and other rights attached to shares;(2) The IPO sponsor is a distributed enterprise that has been operating stably, and the basis for the initiation is the actual operating data and potential of the distributed enterprise. The subject of IEO issuance is an individual, and the basis for issuance is project planning ability and understanding of market planning;(3) No matter how many shares they hold, shareholders can intervene and govern the affairs of distributed enterprises in the form of proposals. The amount of equity is only related to the length of the decision-making process, but has nothing to do with the content of power;(4) The initiation, review, and subscription of IEO are all carried out in a decentralized manner, and the platform does not conduct any form of human intervention;-3- About ESUD                                                                                                                                  ESUD is a brand-new algorithmic digital currency designed according to the Es-universe project, and its actual value and convenience of circulation will be guaranteed:(1) The actual productivity, consumption power and daily operation of ESUD and DE (Decentralized Enterprise Project, hereinafter referred to as DEP) are fully bound to ensure its value;(2) ESUD will publicly build a local exchange network and an online exchange network covering the world to ensure the smooth exchange of ESUD with various legal currencies;(3) ESUD adopts a brand-new algorithm, which does not require mining and can be traded online or small-amount dual offline (both parties to the transaction do not need to be connected to the Internet) fast Bluetooth transactions, allowing the use of ESUD to return to the essence of currency;(4) The issuance function of legal currency acceptance notes, any ESUD wallet holder can issue legal currency acceptance notes so that the counterparty of the transaction can be converted into legal currency at any place;(5) Account transfer authorization mechanism. Public accounts can determine the transfer authorization method based on decentralized consensus or rights registration. ESUD can only be transferred if the holder is authorized. This point plays an important role in the management of groups and DE enterprises;(6) Agreement binding function, all ESUD transactions can be bound with the entity's agreements, contracts, and transactions in the database in order to establish rights and responsibilities;(7) Pseudo-anonymous mechanism of the account: The daily use of the account adopts a purely anonymous mechanism, and no one can know the identity of the other party; however, the registration needs to register the real identity information, when it involves judicial investigation or when the identity of the account holder needs to be announced based on the decentralized consensus is publicly displayed;-4- On the management and execution of decentralized enterprises and ESUD                                                                                  The management and execution of decentralized enterprises and ESUD are managed by a non-profit decentralized enterprise comprehensive platform and ESUD management center (DE type), as follows:(1) Decentralized enterprise comprehensive platform: This platform is a non-profit platform, and the work undertaken and non-profit details are as follows:A. Provide DE enterprise registration, professional manager recruitment interviews, judicial assistance, etc. for all DEPs;B. Establish, manage and maintain the K-DEP decentralized enterprise platform;C. All operating costs are obtained in advance in the form of loans from K-DEP to K-ESU and disclosed monthly, and the resulting costs are shared by all participating DEs according to the profit amount of the DE enterprise;(2) About the ESUD Management Center: The ESUD Management Center is a closed decentralized enterprise to be established. It is composed of early participants in the Es-universe project. Its work includes ESUD casting, issuance, policy formulation and implementation, etc. The basic details are as follows:A. The ESUD management center is responsible for the construction of the ESUD ecology, and at the same time, it is a profit-making decentralized enterprise that assumes a role similar to the central bank of legal currency in actual operation;B. ESUD is responsible for the development and management of cooperative financial institutions, so as to provide all users with practical services such as deposits, loans, and wealth management based on ESUD;C. Non-encrypted content, the ESUD management center will disclose it regularly, and the encrypted content will be disclosed once a year after decryption;D. The ESUD management center is a closed decentralized enterprise, and its ownership cannot be transferred. All new personnel must obtain the consent of the original members when entering. It can only be transferred internally when exiting (all rights and responsibilities can only be transferred internally when withdrawing);-5- About the Knle Family Team                                                          The Knle family team is the first initiator and management team of the Es-universe project. Since the main members of the Knle family formed a team in the form of a combination of natural persons in 2018, the Knle family has made unremitting efforts to complete the work through the exploration of decentralized models, encryption algorithms, finance and other fields.(1) The Knle family is not a DE enterprise or organization, but a team of natural persons composed of natural persons with the target project as a combination factor;(2) The governance structure of the Knle family is similar to that of traditional families. Discuss by key personnel and make a unified external voice. Family members have no personal property;(3) The Knle family is also committed to the technological advancement of strong artificial intelligence, metaverse, and high-simulation digital humans;(4) The final ownership and interpretation right of the Es-universe system belongs to the Knle family;(5) Establish an ESUD management center with the Knle family as the main body and early participants; after 2022, no new members will be accepted in principle;",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ESUD-cfntif",
      "created_time": "July 22, 2023, 03:58:54 AM",
      "body": "K-DEP Decentralized Enterprise Platform-1- overview                                                                                                                                                     What is a decentralized enterprise platformThe Decentralized Enterprise Platform is an initial component of the Es-universe program with the following objectives：a. The threshold for setting up a DE enterprise and participating in business has been greatly reduced to a minimum of only US$10;b. Make the exchanges of DE enterprises, individuals, and organizations immutable and can be stored as evidence;c. Strengthen the breadth and depth of DE enterprise decision-making, and improve the management level and survival status of DE enterprises;d. Utilize the authorization mechanism to make the management order of DE enterprises firmer, clarify rights and responsibilities, and improve the actual efficiency of enterprises;Prerequisites for setting up a DE enterprisea. A project plan and IEO plan with clear feasibility;b. The promoters agree to retain only 2%-5% of the equity;c. The promoters agree that, other than direct voting by all members, no remaining privileges are required in governance;d. The services and products provided by enterprises through production and work activities must accept ESUD payment, and the price must be at least 10% lower than other currencies, and it is not illegale. Enterprises are willing to share the operating costs of the K-DEP platform while making profits;DE business registration place and place of businessa. The headquarters of DE company is registered in the South Pacific region, and the specific country is determined according to the DE company registration process negotiated by the Knle family and the local government;b. The actual business location of the enterprise is not restricted, and the actual business activities are carried out in the name of the subsidiary company;How DE Enterprises Operatea. The operation of the DE enterprise is based on the consensus of all shareholders and employs professional managers for daily operation and management;b. All shareholders can apply to become professional managers;c. Professional managers are responsible to all shareholders, and professional managers must unconditionally obey decisions made based on the decentralized consensus of shareholders;d. The initiator who applies to become a professional manager has priority. Only when more than 60% of the shareholders disagree with their appointment as a professional manager can they choose other shareholders or hire outsiders.-2- Establishment of DE Enterprise                                                                                                                                       Preparations for the establishment of DE enterprisesA. Complete IEO white paper;B. Market research report and feasibility report based on DEP (Decentralized Enterprise Project);C. The sponsor must provide a true personal resume;D. The initiator must provide a 1-15 minute project introduction video with subtitles in mainstream languages;E. Prepare an IEO review fee of at least 450ESUD (to be paid to platform users participating in the review);F. The promoter needs to invest at least 300 ESUD in the equity of the project he initiated;The IEO white paper when the DE enterprise was establishedThe white paper must contain the following:a. Project plans, business logic, costs and profit margins;b. The maximum and minimum number of shareholders allowed;c. In principle, the maximum time for the IEO process shall not exceed 60 natural days;d. The maximum and minimum equity that each shareholder can hold;e. The design of the shareholder block (the less equity you hold, the lower the voting block, anyone’s proposal will be passed in the bottom block to which he belongs first, and then passed step by step until all pass;)F. Proposals on special handling and restrictions on emergency affairs of shareholders with low shareholdings;g. If there is an IEO institution, the authentic signature of the institution is required;Decentralized IEO Audita.IEO auditors are members with experience in business operations. Members can apply to be auditors at any time during and after registration.b. The auditor application must provide a real resume and pass the online test;c. IEO applicants submit IEO applications and necessary white papers, introduction videos, personal resumes, market research reports and feasibility reports to the platform, and upload the materials to the IEO review platform;d. All reviewers can accept orders or accept assignments to participate in review on the IEO review platform. The project must be reviewed by 15 random auditors to be valid, and the designated auditors shall not refuse without special reasons;e. Among the 15 auditors, 9 are randomly assigned and 6 are accepted by the platform;F. When the reviewer reviews the manuscript, no matter whether he agrees or not, he must attach his own views and opinions on the project;g. If the applicant has any objection to the review result, it can submit a review to the platform. The fee needs to be paid again for the second audit, and the platform will randomly assign 15 auditors to conduct the audit;H. After passing the review, the IEO will be officially launched and pushed to platform users in an orderly manner;Initiation and process of IEOa. After passing the review, the platform will push the ladder to the platform users. In order not to disturb the normal life of users, the platform will randomly push it to a certain number of users after the review is passed. When more than 1% of the first push users participate in the project, it will be pushed to more users;b. If the project initiator promotes independently, when the fundraising target reaches 5%, 10%, and 30%, the platform will reward a large number of users for promotion;c. After the review, an IEO account will be opened for the business. After the IEO is successful, it will be automatically converted into an enterprise account, and if the IEO fails, it will be returned to the participating platform users;d. The IEO that reaches the target within the application time is declared successful;e. If the IEO deadline is unsuccessful but the gap with the target is not higher than 25%, an extension can be applied for, up to 30 natural days;F. During the IEO process, the initiator can publicly release the live broadcast to the platform users at any time and describe the project. The initiator can invite users, and the platform will also push traffic;IEO success or failurea. If the IEO completes the shareholder fundraising target within the time limit or within the new time limit after the extension, the IEO will be declared successful; after the IEO is successful, it will enter the stage of enterprise operation preparation;b. If the extension is still unsuccessful and the IEO progress is lower than 80%, the IEO will be declared a failure;c. If the IEO progress is higher than 80% after the postponement, the sponsor can submit a proposal, and all invested members will conduct a decentralized vote to confirm whether to start operations with existing shareholders and costs. After the vote is passed, the IEO is declared successful;d. If the IEO is successful, the IEO fee paid by the initiator will be deducted from the IEO account and returned to the initiator as the cost of the enterprise. If the IEO fails, it will not be refunded;The establishment of DE enterprises after IEOa. After the IEO is successful, the enterprise officially enters the establishment stage. With the unanimous consent of the enterprise, first determine whether the promoters or shareholders are professional managers.b. When there are multiple shareholders competing for professional managers, each candidate must pass the platform interview. After the interview, each candidate must obtain at least 30% approval rate to enter the professional manager election;c. Those who enter the election of professional managers will be divided into two groups to vote in the designated area (each group of candidates can only vote in one random voting area), until there are only two or three candidates left;d. The last two to three people vote for all members, and the person with the highest number of votes will become a professional manager;e. If neither the project sponsor nor the shareholder proposes to become a professional manager, enter the link of external recruitment of professional managers. Any shareholder can put forward a proposal to determine the standards of professional managers, and entrust K-DEP to conduct external recruitment after the standards are voted through;F. After determining the standards, K-DEP conducts interviews according to the standards and discloses the interview materials to all shareholders. All shareholders vote to determine the two candidates with the highest number of votes.g. Two candidates each write a governance plan, and all shareholders elect a professional manager through consensus;H. Professional managers start business registration, establishment and operation;-3- DE Corporate Governance                                                                                                                                              How decisions are madea. All shareholders exist in a pyramidal voting block structure. Each level of block structure contains all upward and downward blocks;b. Each shareholder has the right to make any suggestions on the operation of the enterprise. After the writing is completed, first vote on the block where it is located and the block it belongs to. After the vote is passed, enter the upper and lower blocks to vote;c. In the end, if more than half of all votes are passed, the proposal will be passed and issued to professional managers for implementation;d. All voting is time-limited, and the decision-making time for any decision shall not exceed 48 hours in principle;e. There is no lower limit on the number of voters, and shareholders who do not vote are deemed to have abstained. Approved by actual participating shareholders;F. Withdraw a certain percentage of corporate profits every month to distribute voting rewards to shareholders who participate in voting;g. When abstaining shareholders pay dividends, the platform will force the distribution of 20% of the dividends of voting shareholders who enter the voting period during the two voting periods (based on the profit time);Conflict of decisiona. When two or more conflicting proposals appear in the same block at the same time. Take elimination voting. The proposal with the highest elimination vote is eliminated. Proposals with lower elimination votes will continue to be voted on;b. In principle, if the new proposal conflicts with the original proposal, it is necessary to submit a proposal to overturn and terminate the execution of the original proposal before voting. If the new proposal has been passed, the professional manager will freeze the result until the original proposal is overturned and terminated;Implementation of decisionsa. Shareholders make decisions on the basis of consensus and distribute them to professional managers. Professional managers review whether it conflicts with the original proposal.b. If it conflicts with the original proposal, the professional manager freezes the implementation of the proposal and notifies the proposer;c. If there is no conflict with the original proposal, the professional manager shall implement it according to the time schedule required by the proposal, and issue an implementation announcement to all shareholders regarding the implementation plan and situation;Operating Authorization Mechanisma.a. All shareholders can directly grant the professional managers and various departments, positions, and personnel within the company the authority to issue a communiqué upon consensus through consultation.b.b. The publication authority of the communique can be published in secret, and other people other than shareholders have no right to know and not publicly display;c.c. All shareholders can bypass professional managers and directly grant any operating authority to any branch, department or personnel;d.d. If professional managers and employees carry out work without authorization, the shareholders have the right to pursue the responsibility according to the principle of consensus among shareholders, and the responsible person should bear the consequences;e.e. The level of authorization is determined by shareholders based on common principles, such as what kind of authorization professional managers have the right to issue to department managers;f.F. All authorized content can be viewed by any shareholder in the background;Shareholder dutiesa. In view of the actual needs of affairs supervision, any shareholder can apply to become a member of the shareholder secretariat;b. The shareholder secretariat is responsible for the supervision of business risks and the accountability of professional managers on the basis of consensus;c. The establishment and operation of the shareholder secretariat shall be conducted by consensus voting;d. The salary of the staff of the shareholder secretariat shall be borne by the profits of the enterprise, and the treatment standard shall be negotiated and determined;Equity transfera. Shareholder equity (including dividend rights and governance rights) can be traded on the platform (shareholders who undertake the work of the shareholder secretariat must first cancel the membership of the secretariat);b. Profits and dividends generated during the holding period will not be affected;c. The transaction of the platform refers to the transaction method of the existing financial market;DE business ceases operationsa. With the unanimous consent of the shareholders, the enterprise can stop operating;b. When the enterprise ceases to operate, the existing property is liquidated and returned to shareholders in proportion;c. When the cessation of business proposal is approved, the company's equity trading channel will be frozen;d. The liquidation work is jointly handled by the professional manager and the shareholder secretariat;e. During the liquidation period, the wages and corresponding remuneration of relevant personnel shall be paid as usual.-4- Operation of DE enterprises                                                                                                                                   professional managera. The professional manager is the actual operator of the enterprise, responsible to all shareholders, and the actual business is carried out by the professional manager;b. The formation of the management team, the leasing of the venue, and the management of daily affairs are all in the charge of professional managers;c. The actual operating authority of professional managers is determined by voting by all shareholders in accordance with the principle of consensus through consultation;d. Professional managers can put forward a proposal to require their own operating authority to be voted by all shareholders, or any shareholder can initiate a authority proposal and vote.e. Professional managers can authorize downwards within their own scope of authority, but the authorization must be reflected in the business background that all shareholders have the right to view;Subsidiarya. A subsidiary is the actual operator of the business, and generally a subsidiary is run by a professional manager;b. When an enterprise has two or more subsidiaries, all shareholders can designate a subsidiary that is not under the jurisdiction of a professional manager, and designate a responsible person for a certain subsidiary;c. The authority of the legal person subsidiary is determined by all shareholders based on decentralization, and professional managers can make suggestions or shareholder proposals;supervision of operationsa. The K-DEP system has an enterprise management system. In principle, all operations of the enterprise should be reflected in the background;b. The enterprise management background is mainly to automatically check whether the transaction execution complies with the authorization system, and to check the work content, communication, and execution communication among various departments and personnel of the enterprise.c. The shareholder secretariat is responsible for the daily supervision of the enterprise management system. When the shareholders' secretariat cannot complete this work well, any shareholder has the right to propose a proposal for re-election of the secretariat;d. Any shareholder has sufficient authority to view all business records and make relevant decision-making suggestions based on relevant records;Financial system inside DE enterprisea. DE corporate finance is supported by the management system provided by K-DEP, which has a strict authorization mechanism and supervision mechanism;b. Under normal circumstances, in order to ensure the smooth progress of the daily operation of the enterprise, professional managers should be given certain financial authority. Within the scope of authority, professional managers can carry out financial authorization downwards (automatic deposit of certificates in the background of enterprise management);c. For matters that cannot be authorized by professional managers, an application shall be submitted to the general meeting of shareholders, and authorization shall be granted after voting by the general meeting of shareholders;d. Without authorization, the financial personnel can only check the accounts, and have no right to operate the accounts;e. Shareholders may propose to freeze professional managers' powers;F. Shareholders can propose to bypass professional managers and directly grant, adjust, and freeze financial authority to anyone;g. ESUD's system fully cooperates with K-DEP's financial management and will be embedded in the entire system;emergency treatmenta. In the event of an emergency, any shareholder may submit a proposal to the shareholder secretariat urgently;b. When the shareholder secretariat believes that the proposal is indeed urgent and valid, it can directly start voting by all members;c. The opinion of whether the event is considered urgent must be attached to the vote of all members. If non-emergency incidents accumulate five times within a month. The shareholders' secretariat was dissolved and reorganized. Existing members are not allowed to participate in the application;d. If the shareholder secretariat is dissolved, the professional manager shall temporarily act as the shareholder secretariat;DE Corporate Legal Affairsa. The legal personality of the enterprise is generated at the place of registration;b. The legal personality of the place where the enterprise actually operates is carried out in the name of the local registered subsidiary;c. Legal affairs in the place where the enterprise operates are handled by professional managers;d. The legal issues of the corporate headquarters can be handled by the K-DEP platform or professional managers;e. The legal personality of the headquarters of the enterprise shall be based on the negotiation results between the Knle family and the South Pacific region. There are two possibilities: an independent company and a subsidiary company under the name of K-DEP;f. If it is in the name of a K-DEP subsidiary company, the user agreement shall clearly mark the ownership;g. In the form of establishment of K-DEP’s subordinate enterprises, it shall be clearly marked in the agreement that the relevant legal responsibilities shall be borne by the actual shareholders and actual operators;-5- DE Enterprise Financial Management                                                                                                                                                financial disposala. For enterprises established on the K-DEP platform, in principle, ESUD must be used as the daily accounting unit for financial use and supervision;b. In daily use, the fund generator submits an application to the financial staff, and the financial staff submits an application for account use permission to the professional manager or the shareholder secretariat after review. After the authority is approved, the financial personnel will automatically obtain the account transfer authority in the system;c. Financial personnel can use legal currency acceptance bills, electronic checks, etc. to pay when transferring accounts, and have no right to directly use accounts by means of transfers;d. Any transaction must be bound to the submitted business in order to transfer successfully;Disposition of non-ESUD financialsa. If legal currency must be used for transaction settlement under the legal system of the country where the business is located, the subsidiary's appropriation is mainly based on ESUD.b. When legal currency is needed, the headquarters will convert ESUD into legal currency for transfer after indicating the relevant content;c. The operating expenses of enterprises in this district are allocated once a month according to the application;d. For each tax cycle, regional subsidiaries need to transfer relevant income to the headquarters;e. In principle, the legal currency kept in the account in the actual business area shall not exceed the actual business needs;f. When special circumstances arise under the local legal framework, professional managers should formulate a plan and submit it to all shareholders;dividend paymenta. The shareholder dividend cycle is initiated by any shareholder. After the proposal is passed, dividends will be distributed according to the content of the proposal;b. Shareholders who conduct equity transactions retain the right to distribute dividends for the profits generated during their holding period;c. Shareholders who generate profits during the period of holding shares but have not recorded them in the account shall distribute dividends after the profits are recorded in the account;Borrowing and Repaymenta. When the company has actual needs, professional managers and any shareholders have the right to submit proposals for ESUD loans, and K-DEP platform and financial cooperation institutions can provide loans;b. The loan amount is based on the actual operating data of the enterprise and the actual standards of each institution;c. When the loan occurs, K-DEP will automatically deduct the corresponding repayment from the business account according to the repayment plan.d. After the loan occurs, the minimum amount of the enterprise account shall not be less than one time of the repayment due in the current period. The use of this part of the funds will be frozen by K-DEP; -6- Foreign Cooperation                                                                                                 Cooperation Processa. External cooperation of DE enterprises is divided into general cooperation and major cooperation. When the amount or significance of the funds is relatively large, it is a major cooperation, and other cooperation is general cooperation;b. Except for major cooperation, it will take effect after confirmation by professional managers;c. When a major cooperation occurs, the professional manager or relevant business department will directly upload it to the shareholder secretariat, and the shareholder secretariat will initiate a vote of all shareholders to take effect;d. After the cooperation takes effect, the cooperation shall be carried out by professional managers;e. Major cooperation can be negotiated and signed by professional managers first, but professional managers must clearly indicate that it must be voted by shareholders before it becomes effective, otherwise the cooperation is invalid;Evidence preservation of contracts and fundsa. In principle, all contracts are electronic contracts signed through the K-DEP platform. This type of contract has the advantages of non-tamperable encryption and clear fund transfers;b. If the electronic contract involves capital exchange, the capital exchange is bound to the contract, and no one may tamper with it;Evidence Preservation During Collaborationa. Relevant matters in the cooperation process need to be bound with the contract when uploaded to the enterprise management background. Therefore, a contract number is the deposit certificate of the entire cooperation;b. During the cooperation process, the relevant persons in charge of both parties need to confirm the transaction before uploading and verifying the voucher;c. Once the certificate is stored, it will not be tampered with, and its encryption method is the same as DUES;Cooperate with other DE companiesa. DE enterprise/individual cooperation can be completed only by initiating a contract on the platform and binding the contract with the account and the person in charge;b. Changes in account and person in charge during the cooperation process require the consent of the other party to take effect;c. Any party in the cooperation process can issue a warning to the platform that the cooperation cannot be sustained, and the two parties can negotiate to terminate the cooperation after the platform approves;d. Both parties can voluntarily change the content of the cooperation, but the external cooperation accounts of both parties need to approve and encrypt the changed content;Cooperation with non-DE companiesa. The cooperation of non-DE enterprises is divided into centralized enterprises on the platform and enterprises outside the platform;b. The cooperation between enterprises/individuals in the platform is consistent with the cooperation between DE enterprises;c. For the cooperation of enterprises/individuals outside the platform, the contract needs to be uploaded and scanned and encrypted and confirmed by business, financial and professional managers before it becomes effective;d. In the cooperation with enterprises outside the platform, the uploading of all transactions is consistent with the cooperation between DE enterprisese. In cooperation with companies outside the platform, financial expenditures can only be in the form of legal currency acceptance notes, which must be drawn and transferred after the finance company issues acceptance notes according to the exchange rate rules of legal currency;f. The termination of the contract shall be subject to the conditions stipulated in the contract and local laws;ESUD Financial System-1- overview                                                                                                                     Components of the ESUD financial systema. ESUD's complete financial system includes ESUD management center, K-ESU platform, legal currency C2C exchange platform; cooperative financial institutions, etc.;b. The ESUD Management Center is responsible for ESUD casting, destruction, issuance management, financial policies and other affairs;c. The K-ESU platform is responsible for C2C investment management of funds, communication with major cooperative financial institutions, direct issuance and management of ESUD loans on behalf of the ESUD Management Center, and acceptance of user deposits;d. The fiat currency C2C exchange platform is the official ESUD-fiat currency exchange platform, which is composed of individuals who hold fiat currency; it is responsible for the ESUD and fiat currency exchange work and small loan work in various regions. Participants can obtain lifetime discounted ESUD and loan interest rewards, and adjust the relationship between legal currency and ESUD stocks at any time through communication with K-ESU;e. The role of cooperative financial institutions is similar to commercial banks and fund companies in the legal currency system, handling deposits and loans, fund issuance, currency exchange, ESUD monetary policy implementation and other affairs;F. The above parts constitute a complete ESUD financial system, which is used to complete the exchange, deposit and loan transactions of different amounts of ESUD and legal currency;The usage scenarios of the ESUD financial system include:a. Based on the actual exchange between enterprises and equity investors in the K-DEP platform;b. The actual use of ESUD and various fiat currency exchanges in daily life;c. Use of the system by individuals who purchase products produced by DE companies at a discount;d. Use of DE business loanse. The use of ESUD savings groups due to deposit interest;f. The use of the system during the cooperation between DE enterprises;g. Use of currency by DE corporate deposits;Advantages of the ESUD financial system                                                                                           Binding of real economic valuea. The actual productivity of DE enterprises is bound, so that the products they produce can be obtained at discounted ESUD prices;b.DE enterprises based on the security and governance transparency needs of deposits, loans, dividends, cooperation and other matters of use scenario value bindingc. Binding of savings habits of ordinary individual users based on interest rates and healthier financial features (such as more reasonable interest rates, healthier loan credit reporting systems, and more competitive financial products);d. Based on DE enterprise products, the consumption power of ordinary users is bound;Dual Offline Transactionsa. Both parties to the transaction can trade normally in an offline environment, maintaining a high similarity with the use of legal currency;b. The launch of the Bluetooth transaction wallet makes the digital currency more like a currency;c. Dual offline transactions upload transaction data, stubs, recharge, quick deposits, and encryption changes through regular networking;d. The encryption method of the dual offline transaction is the same as the online encryption method, and it is still irrevocable, tamper-proof and inviolable;Pre-Authorization and Decentralized Cancellation Transactionsa. Both online transactions and off-net transactions can be pre-authorized transactions.b. When withdrawing pre-authorized funds, it is necessary to upload the transaction data to the network and confirm the withdrawal;c. The withdrawal of the pre-authorization requires both parties to conduct online transactions or upload the transaction data to the network at the same time and confirm through the pre-authorization withdrawal application;d. Users who apply for withdrawal of pre-authorization need to pay the withdrawal fee so that other users can review the withdrawal;e. If the withdrawal review fails, the fund recipient can directly withdraw the funds;legal tender acceptancea. Holders of any ESUD account can issue promissory notes of relevant fiat currencies;b. Acceptance drafts can be withdrawn in legal currency by selecting financial institutions in your region or regions that require legal currency through the online platform;c. The withdrawal of the acceptance bill is one-time and cannot be withdrawn multiple times, but part of the face value can be withdrawn in legal currency, and the rest can be deposited into your own ESUD account;ESUD Checking Systema. Any business user can issue ESUD checks to any business or individual;b. ESUD electronic checks can be directly deposited into your own ESUD account or Bluetooth wallet;c. To deposit the electronic check into the Bluetooth wallet, you need to go to the relevant institutional entity to handle it or enter your own account first and then recharge the Bluetooth wallet;Integrity of ESUD usage ecologya. ESUD has financial services such as deposits, loans, checks, legal currency acceptances, legal currency exchange agencies/agents, financial products, etc., which generate practical system support;b. ESUD official consumption guide lists all online and offline consumption channels; including ESUD sales platforms of DE companies, offline stores opened by DE companies, offline stores for cooperation, etc.;c. Set up K-DEP and ESUD promotion teams in various regions through self-management and outsourcing to ensure the actual applicability of ESUD in most regions;d. Allow merchants to accept ESUD as the actual currency in circulation through the form of rebates from cooperative merchants;e. Since the launch of the platform, the quota of business promotion type DE enterprises will be opened, and the number of quotas will be 15% of productive enterprises;ESUD technology and mechanism                                                                                             Multi-chain encryption security transaction technologya. When the two parties generate an online transaction, the two parties directly carry out data transmission, and randomly designate users to participate in the certificate deposit calculation;b. No handling fee. The way to participate in the certificate deposit calculation is to automatically send a string of data from your wallet to the server. All users will participate in the calculation of other users' certificates without knowing it, and maintain the principles of decentralization and fairnessc. The calculation method is based on function operation. Calculation functions are random. When the transaction is generated, the two parties to the transaction perform disorderly transmission of functions, 64 sets of random calculation numbers, and encrypted sequence passwords, and restore each other;d. The identity data of users involved in bookkeeping participate in the calculation, and the sorting method is still confirmed by the data passed by both parties;e. The transaction generation time and several delay time points are involved in the calculation, and are randomly sent when both parties trade;Binding interface between ESUD system and actual transactionsa. ESUD's encryption algorithm is deeply connected to K-DEP's voting and enterprise management system/equity trading system, K-ESU and cooperative institutions and individuals to ensure that ESUD's encryption is used in the entire system;b. The transaction of ESUD itself is completely bound to the relevant system and the interface is reserved. Whether it is an e-commerce platform, a personal website or a physical store, you can easily access the ESUD usage network;c. Bind the enterprise end of the merchant's payment collection program to actually enhance the generalization of application scenarios;Security Mechanism for Dual Offline Transactionsa. Dual offline transactions highly simulate online security mechanisms by simulating online calculation data and function programs in the Bluetooth wallet;b. Automatically upload transaction data, change encryption algorithm and online stub when recharging and withdrawing cash via Bluetooth wallet network;Pseudo-anonymous mechanisma. ESUD accounts are registered with real names, but adopt the same encryption mechanism as ESUD transactions, and only the authority based on decentralized anonymous voting can decrypt the registered identity;b. When the account is suspected of breaking the law or committing a crime, the platform will launch a decryption vote for random K-DEP platform users at the request of the judiciary, and disclose their identities to the judiciary when the vote is passed;c. Particularly serious behavior will launch targeted anonymous voting for the group to decrypt the identity of the account holder;d. When the identity is not decrypted, the platform cannot know the real identity of the account holder;ESUD Financial Ecological Construction                                                                                                use ecologya. K-DEP's entrepreneurship, management, investment, operation, and dividends are the basic ecological support;b. The products and services of DE enterprises must open the ESUD purchase discount channel;c. Develop merchants to accept ESUD payments through rebates;d. Open the ESUD collection interface to centralized enterprises, and give a 10%-30% collection rebate for one year according to the collection amount;e. Encourage the establishment of relevant ecological development-oriented DE enterprises, set up self-operated use ecological expansion departments, and expand use scenarios;ESUD circulation and financial service ecologya. Any individual who sets up a C2C platform and is willing to undertake the exchange of ESUD and fiat currency in the form of an exchange deposit can obtain ESUD from K-ESU at a discounted price of 70%-85%;b. The business agent of the C2C platform has the right to charge a fee for exchanging with legal currency, but needs to follow the recommendations of the ESUD Management Center;c. Cooperate with financial institutions to undertake large-scale exchange, deposit and loan of legal currency. And in the early stage, encouragement methods such as deposit rewards, loan interest discounts, and exchange quota rewards were given to cooperative institutions;d. Cooperate with financial institutions and DE companies in specific industries to issue tradable ESUD financial products; expand the actual circulation usage scenarios;Financial Security Ecologya. The initial issuance of ESUD is based on the registered capital of the DE enterprise + 10% and is exchanged at the anchor value.b. When the initial enterprises and individuals produce the credit judgment basis, they will be issued additionally according to 30% of their credit line;c. When the consumption scene increases, an additional 10% will be issued according to the estimated amount of the consumption scene;d. Destroy ESUD through the repurchase of loan users' repayments and other policy changes when the transaction data decreases;e. Respond to any crisis through the reserve of other fiat currencies;ESUD's Currency Issuance Program                                                                                               Issue preparationa. Determine the 1:1 equivalence between ESUD and USD;b. Cast ESUD exchange chips based on the existing digital currency chain to complete the crowdfunding before issuance;c. Formulate a complete cooperation charter and management plan for C2C agents and financial institution partners;d. Determine the enterprise development plan and value estimate before the initial issuance (completed);e. Raise necessary funds such as ecological construction through crowdfunding;First issuea. According to the estimated value of enterprise development, the initial issuance is determined to be 660 million ESUD;b. Issue 35 million ESUD through crowdfunding as the preliminary construction;c. Distribute 400 million ESUD discounts to cooperative financial institutions for exchange to EUSD;d. The remaining ESUD of K-ESU is exchanged with K-DEP platform users;Additional issuance mechanism of ESUDa. When the usage scenarios and usage increase, the ESUD management center will evaluate the increased usage;b. Formulate additional issuance plans and issuance plans, and publicize the fundraising and adjustment plans to the public;c. The final proposal will be produced at the end of the publicity period;d. Additional issuance and release to the market;ESUD's stock destruction mechanisma. When a usage scenario or scale reduction occurs, the ESUD management center will conduct a destruction assessment;b. Formulate a destruction plan and publicize the solicitation and adjustment plan;c. The final proposal will be produced at the end of the publicity period;d. Execute the destruction plan;Initial crowdfunding of the Es-universe project-1- overview                                                                                                                                                       Purpose of crowdfunding and use of fundsa. Build the actual functions of K-DEP platform and ESUD interface;b. Construction of system server, hardware, software, office space/facilities;c. Large-scale publicity and development of DE enterprises in the K-DEP platform;d. The construction of ESUD's global financial ecology starts;e. ESUD's early offline use scene expansion work;Basic Crowdfunding Dataa. The first phase of crowdfunding is mainly based on USDT, and the crowdfunding fund is 35 million USDT;b. The crowdfunding platform is the official website of the Es-universe project;c. The reward chips for the first crowdfunding are ESU tokens (ERC-20 tokens) minted on the MATIC chaind. The entire crowdfunding process will be carried out through email exchanges on the official platform;e. Methods of accepting crowdfunding funds include digital wallet transfer and Binance transferESUD discount deliverya. Early participants can obtain ESUD at different discounts according to different stages of investment;b. Participants will receive corresponding ESUD chips in crowdfunding;c. Adopt a step-by-step distribution; the earlier you participate, the lower the discount you will get for ESUD exchange chips;d. The total demand for discounted delivery is 30.8 million ESUD, and the specific discount standards are as follows:Pre-recruitment of collaborators (institutions and individuals) in the ESUD financial ecologya. Institutions and individuals who participate in the ESUD system in the form of deposit prepayment in crowdfunding can obtain C2C business agent authority or authority similar to commercial banks or institutions under more favorable conditions;b. After the end of the first phase of crowdfunding, the ratio of the margin to the ESUD allowed to be held in the account is 1:20 (institutions) or 1:30 (individuals), that is, the margin is 1USDT or other equivalent foreign currencies and assets can be held in the account at most Get 20ESUD discount delivery;c. The allowable ratio of participants in the initial crowdfunding process is 1:60 (institutions) or 1:90 (individuals)d. Early participants will be displayed on the official platform (in the form of a list of cooperative institutions and C2C agents);e. We will issue cooperation confirmation letters to early cooperation participants (authorization signed by all members of the Knle family)f. The minimum cooperation amount for individuals is 3,000 USDT, and for institutional partners is 50,000 USDT;g. The maximum demand limit of this type of crowdfunding participants is 2.8 million USDT, while the amount is full;Collaborator pre-recruitment in the K-DEP systema.a. This type of crowdfunding participants are those who are willing to set up related ESUD application scenario expansion, DE enterprise promotion and service and other types of enterprises (centralized or decentralized) on the K-DEP platformb.b. This kind of crowdfunding participants do not need to write white papers and other materials, and the project plan will be provided by the official;c.c. The participation amount of this kind of crowdfunding is a fixed amount of 2000USDT. At the same time, when entering the enterprise establishment process, the writing of the white paper is exempted and 3500ESUD is injected in the name of the crowdfunding participant as a promoter or investor;d.d. The upper limit of the total demand of this type of crowdfunding participants is 2 million USDT, while the amount is full;Crowdfunding Publicity Specialista. Anyone who has already participated in this crowdfunding, such as inviting others to participate in crowdfunding through publicity, both parties can get ESUD chip rewards;b. The reward amount obtained by both parties is based on the participation amount of the invitee, and the reward ratio is 5%-10% respectively;c. Crowdfunding amount below 2000USDT will be rewarded with 5% respectively, crowdfunding amount of 2000-10000USDT will be rewarded with 7%, and crowdfunding amount above 10000USDT will be rewarded with 10%;-2-  Crowdfunding Relevant Returns                                                                                                   ESUD returna. Crowdfunding participants can obtain ESU chips at a discount and exchange them for ESUD after a few months;b. The obtained ESUD can be consumed or exchanged for any legal currency or stable currency in the consumption scene built earlier;c. The obtained ESUD is bound one by one with the value of USD;ESUD Financial Authority Returnsa. Crowdfunding participants can obtain ESUD's deposit and loan, exchange, and permanent discount to obtain ESUD's financial authority;b. This permission is a lifetime permission without violating relevant rules;c. Relevant crowdfunding participants have the right to participate in the issuance and destruction of ESUD;Open a DE company that cooperates with the officiala. Crowdfunding participants in designated forms can obtain official project cooperation authority;b. On the basis of this authority, crowdfunding participants can establish DE companies without a white paper and directly start IEO;c. On the basis of this authority, crowdfunding participants can also establish their own centralized enterprises and unconditionally use the management system and external cooperation system of the K-DEP platform for detailed management;d. Official project cooperation is life-long, unless the collaborator violates the relevant rules;How to participate in crowdfunding                                                                                                    Crowdfunding Registration and Queuinga. Crowdfunding participants download the crowdfunding registration form on the official website and fill it out, then send it to the email address published on the official website for registration;b. Enter the crowdfunding queue after registration, and we will contact you in order and carry out relevant confirmation work;c. The queuing time is determined according to the number of crowdfunding participants, and we do not guarantee the queuing time;Crowdfunding paymentsa. In the crowdfunding stage, we will only accept USDT-ERC20 as a fundraising certificate;b. The payment channels we accept are wallet transfer and Binance account transfer;c. When our staff gets in touch with you, we will confirm our crowdfunding collection account with you;Crowdfunding return certificatea. Users who participate in crowdfunding by obtaining ESUD at a discount will use the ESU exchange chips we released on the MATIC chain as a reward voucher;b. For crowdfunding users who participate in ESUD system cooperation, we will provide reward vouchers in the form of cooperation confirmation letters and official website announcements;c. For users who participate in crowdfunding through the official K-DEP platform project, we will provide you with reward vouchers in the form of official website announcement and IEO special permission;Return realizeda. Users who obtain ESUD at a discount will be able to obtain ESUD directly in K-ESU with relevant vouchers when we officially complete the casting of ESUD;b. Users who cooperate with ESUD will be able to immediately obtain permissions and obtain ESUD and relevant business permissions through the agreed discount ratio;c. For K-DEP official project cooperation, we will carry out multiple promotions for all staff when the platform goes online and start the IEO work in the first batch; after the IEO is over, crowdfunding participants can trade and realize their equity at any time;Es-universe execution planning-1- Preliminary preparation                                                                                                                                                (1) According to the crowdfunding progress, we will first confirm the office space (an independent area without interference)(2) We will simultaneously recruit relevant collaborators in the system according to the crowdfunding progress;(3) The purchase of relevant hardware equipment will be carried out simultaneously with the work of the venue;(4) Large-scale formation of a team of technical personnel with crowdfunding funds to complete the relevant construction;-2- Technical construction scheme of K-DEP and ESUD                                                                                                               (1) The workload of technical construction is huge, we will form a large-scale temporary technical staff team according to the progress of crowdfunding, and complete the construction within 60-90 days;(2) The construction content includes the ports of relevant application ecology;(3) For technical construction work, we will take the form of core team + outsourcing team + independent technical personnel to complete it as quickly as possible;(4) The core functions are launched step by step. When a function is completed, we will open the test immediately until it is fully completed;(5) We will update the technical construction progress on the official website as soon as possible;-3- Basic financial ecological construction                                                                                                                                  (1) We will arrange the related ecology simultaneously with the technical construction;(2) The ecological layout is carried out simultaneously in all regions of the world according to the principle of average;(3) We will do our best to ensure that all legal currencies and valuable digital currencies in the world can be exchanged with ESUD when the platform is launched;(4) We will do our best to have a network or realistic basic application ecology in any country and region in the world when the platform is launched;(5) We will give priority to guaranteeing the use ecology including basic necessities of life;-4-  Strong artificial intelligence and highly simulated digital humans                                                                                                      (1) Here and below are the work plans we will implement after the completion of K-DEP and ESUD;(2) The corresponding technologies and theories that we have developed and verified can realize the complete replication of strong artificial intelligence with autonomous consciousness and real human personality;(3) The value of strong artificial intelligence and highly simulated digital humans is still ESUD;(4) Same as K-DEP and ESUD, strong artificial intelligence and highly simulated digital humans are part of the Es-universe system;-5- KESBusiness Metaverse                                                                                                        (1) The concept of the commercial metaverse is based on the holographic metaverse;(2) The commercial metaverse refers to the metaverse commercial system that completely restores the texture of the commodity and entertainment, office environment, and on-site experience except for food and drink;(3) The commercial metaverse will be presented in the form of virtual shopping malls and office buildings;(4) The commercial metaverse is constructed based on non-3D modeling technology and sensor technology;(5) Its technical core and specific details will be explained in detail in the second white paper of Es-universe;-6- KES Holographic Complete Metaverse                                                                                                                      (1) The construction method of the holographic metaverse is the same as that of the commercial metaverse;(2) The commercial metaverse will be provided to the digital human produced by high-simulation copy personality, so that its lifestyle is the same as the real world;(3) The mountains, rivers and land of the holographic metaverse will be constructed in two ways;(4) The type constructed first is a one-to-one replica of the real world(5) In addition to the one-to-one replica, we will create an overhead holographic metaverse;(6) The physical rule parameters and biological functions of the fictional metaverse will be different from the real world;(7) The specific content will be presented in detail in the third white paper of Es-universe;written in the last wordsThe Es-Universe framework is a complete system carefully crafted by the Knle family team for five years. During these five years, we have completed theoretical design, investigation, and solicitation of relatively extensive opinions;We deeply hope that this system can truly solve social problems and provide practical help to more people;At the same time, all members of the Knle family sincerely hope that what we do will gain the understanding and support of more people;It is the deepest expectation of all members of the Knle family to return the value of digital currency, to make investment products pure, and to make technology contribute to mankind.I hope more people join us to make this world a better place, and salute to all readers here                                                                          The Knle family team will be released on the Es-universe official website on June 25, 2023",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}