{
  "id": "topic_5401371",
  "title": "Don Pedro Dinero",
  "author": "Don Pedro Dinero",
  "created_time": "June 04, 2022, 05:49:06 PMLast edit: June 05, 2022, 06:19:02 AM by Don Pedro Dinero",
  "content": "I first saw this in a Spanish forum, but I see that a national newspaper in Spain has brought it out.https://www.elmundo.es/economia/macroeconomia/2022/06/04/629a1c44e4d4d8fb2a8b460d.htmlIn English:https://www.marketwatch.com/story/why-india-is-set-to-win-big-as-eu-bans-russian-oil-imports-11654021874India is receiving 600,000 barrels per day from Russia compared to 90,000 barrels per day last year, which buys at below market price, refines and sells at a higher price to Europe. What a masterstroke by the European Union, LMAO.Nobody thought of this? Last Friday the EU adopted sanctions banning oil imports from Russia. https://thehill.com/policy/energy-environment/3511129-eu-officially-adopts-russian-oil-embargo/Once this has come to light, what are they going to do? Not buy from India? It reminds me of exchanges or other entities that don't want tainted coins.I put this comment here because I think it is the key to the issue:Quote from: Sithara007 on June 05, 2022, 05:54:07 AMOnce the oil is refined in to diesel, it will be impossible to know about it's origin. And here, the situation is further complicated by the fact that the two oil companies who have purchased huge amounts of oil recently (Nayara Energy and Reliance Industries) also import a lot of oil from Iraq and Saudi Arabia. So they can always claim that the diesel they sell to the EU is sourced from Iraqi crude. After all, it is same substance with the same chemical composition coming from different oil wells. There is no 100% accurate method to find out how many molecules came from Russia, and how many came from Iraq. So India claims that what it sells to the EU does not come from Russia, the EU claims that what it buys does not come from Russia, when most likely at least some of what it buys from India comes from Russia, and more expensively. LMAO.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401371",
  "comments": [
    {
      "author": "mindrust",
      "created_time": "June 04, 2022, 06:09:58 PM",
      "body": "Indians are making money, Russians are making money, Europeans getting robbed and still buying the Russian gas.Brilliant scheme. Lmao What happened to Europe’s unicorn fart powered windmills anyway? I thought oil/gas was outdated… What happened to WEF’s push for zero carbon footprint?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "June 04, 2022, 09:02:05 PM",
      "body": "This is old news but the U.S. was very upset about India buying oil from Russia. In fact, the U.S. believed it was bestowed upon them to dictate the bilateral trades of other countries and complicate them with their own internal political turmoil. Seems very arrogant.https://www.independent.co.uk/news/world/americas/us-politics/russia-india-oil-deal-us-psaki-b2036822.htmlI don't think anything came out of the ordeal, other than some words critical of India's purchasing habits with Russia. If this story is legitimate -- then good for India. They have an obligation to their billions of people to fuel their energy needs and grow their economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "June 04, 2022, 09:25:47 PM",
      "body": "Eh, they are still going to buy it until OPEC countries ramp up their production. Europe still needs oil, and even though it looks like Russia is going around these sanctions, at the end of the day demand will still make EU buy these things since they are relatively cheaper and easier to get. They can express their disappointment all they want but in the end it's still just business for India and Russia. The West can be petty about it but India needs to profit, and they need the oil and they get it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "June 04, 2022, 10:06:53 PM",
      "body": "Quotewhich buys at below market price, refines and sells India has very few oil reserves like China, two of the worlds most populated countries but they do intend to have refining capability and have built alot of assets on that basis.   They need to process oil to justify the cost of those operations while having little oil and with elevated market prices probably not creating much opportunity.  They might fall in line later on but Im not sure if they are allied with Russia or not, seems they are not from last Ive read on it.   Pakistan changed leader after appearing to back Putin, the government dismissed the prime minster though that too is disputed no doubt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "June 04, 2022, 10:38:23 PM",
      "body": "This is the reason, or at least one of the many reasons to never trust politics, politicians or other business crooks, who hide their real intentions behind a poisonous smile. None of them care about morality in the slightest. Don't be fooled.India is just doing the same as EU has been doing since the EU even came into existence. Chipping away at morality for the sake of money and power...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "June 04, 2022, 11:21:45 PM",
      "body": "Quote from: goldkingcoiner on June 04, 2022, 10:38:23 PMThis is the reason, or at least one of the many reasons to never trust politics, politicians or other business crooks, who hide their real intentions behind a poisonous smile. None of them care about morality in the slightest. Don't be fooled.India is just doing the same as EU has been doing since the EU even came into existence. Chipping away at morality for the sake of money and power... well, it just shows who is the smart one in this market.  lol for sure, india is just laughing at this situation and they are gaining a lot from this war situation. we can't blame them, this is a good opportunity for them and they grabbed it, why not? after all, business is business. politics will always play a role in this humanity. and if they can gain from it, they will go for it. it is a matter of survival also.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "June 05, 2022, 01:25:28 AM",
      "body": "India deny it though, Quote“There’s an enormous shortage of oil...Getting access to oil is difficult. A country like India would be crazy to get oil from somebody and sell it to somebody else. This is nonsense,” he said when asked about the reports at the ‘GlobeSec Bratislava Forum’ conference in the Slovak Republic on Friday.https://www.thehindu.com/news/national/india-is-not-a-conduit-for-russian-oil-sales-jaishankar/article65491475.eceBut we really don't know who is saying the truth here. India is playing their cards very well here and it's up to us to who really believed or who to side in this story. And let's see if US is going to sanction India or it is just a empty threat as we all know that the US-India relationship as far as political and non-political interests are.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sithara007",
      "created_time": "June 05, 2022, 02:08:17 AM",
      "body": "I had already mentioned about it a few days back: Quote from: Sithara007 on May 31, 2022, 03:14:08 PMBeing a resident of India, I would say that this is true. Although I don't have accurate figures for import of LNG from Russia, various media sources have published the volume of imports of crude oil from that country. Here is one source:https://timesofindia.indiatimes.com/business/india-business/indias-imports-of-cheap-russian-crude-surge-since-ukraine-invasion/articleshow/91897107.cmsAs per TOI, this is how the crude oil imports from Russia have zoomed up:March 2022: 97,000 barrels per dayApril 2022: 240,000 barrels per dayMay 2022: 775,000 barrels per dayJune 2022 (projected): 935,000 barrels per dayIf I am not wrong, now India is the second largest importer of Russian crude (if EU is not taken as a single country). China is importing 2,000,000 barrels of crude per day from China, with around 1.1 million coming from oil tankers and the rest transported through pipeline. This month, India is expected to import almost a million barrels of Russian crude per day, which is almost 35 times the volume for 2021. And the Indian consumers are not benefitting from these imports. Most of this crude is refined to diesel and gasoline and then exported to European Union and other South Asian nations. And the Indian government is in talks with Russia to further increase the imports later this year, if Russia is willing to increase the discount. As of now, the discount is $30 to $35 per barrel. The Indian government is requesting for discounts in the range of $45-$50 per barrel.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "June 05, 2022, 02:44:39 AM",
      "body": "Quote from: Sithara007 on June 05, 2022, 02:08:17 AMI had already mentioned about it a few days back: Quote from: Sithara007 on May 31, 2022, 03:14:08 PMBeing a resident of India, I would say that this is true. Although I don't have accurate figures for import of LNG from Russia, various media sources have published the volume of imports of crude oil from that country. Here is one source:https://timesofindia.indiatimes.com/business/india-business/indias-imports-of-cheap-russian-crude-surge-since-ukraine-invasion/articleshow/91897107.cmsAs per TOI, this is how the crude oil imports from Russia have zoomed up:March 2022: 97,000 barrels per dayApril 2022: 240,000 barrels per dayMay 2022: 775,000 barrels per dayJune 2022 (projected): 935,000 barrels per dayIf I am not wrong, now India is the second largest importer of Russian crude (if EU is not taken as a single country). China is importing 2,000,000 barrels of crude per day from China, with around 1.1 million coming from oil tankers and the rest transported through pipeline. This month, India is expected to import almost a million barrels of Russian crude per day, which is almost 35 times the volume for 2021. And the Indian consumers are not benefitting from these imports. Most of this crude is refined to diesel and gasoline and then exported to European Union and other South Asian nations. And the Indian government is in talks with Russia to further increase the imports later this year, if Russia is willing to increase the discount. As of now, the discount is $30 to $35 per barrel. The Indian government is requesting for discounts in the range of $45-$50 per barrel. Suddenly rise of importation, its a money machine for India. If Russia intends to help his allies, this is the kind of help that will help India. The whole India benefits from it, with gas supply, the prices of goods will not spike high.This is a  rising country that is just starting its growth, speculated to become superpower as well. Will Russia be upset about it if its true that they resell to EU?  Its pretty much a business after all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "June 05, 2022, 03:43:48 AM",
      "body": "This is why I knew these sanctions wouldn’t of done anything. If anything it’s hurting the consumer because traders are buying up the crude oil futures and everybody suffers at the pumps.But the non sanctioned countries buys the oil and they resell to a sanctioned country with Russia. Makes pretty much no sense.Like putting money in one pocket and out the other. They need to sanction all the countries for this to work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "June 05, 2022, 04:10:18 AM",
      "body": "Quote from: Sithara007 on June 05, 2022, 02:08:17 AMI had already mentioned about it a few days back: Quote from: Gyfts on June 04, 2022, 09:02:05 PMThis is old news but the U.S. was very upset about India buying oil from Russia. The fact that India buys oil from Russia is not new, but it is not what I wanted to emphasise in the thread. What I wanted to emphasise was the European Union making a fool of itself by buying more expensive Russian oil from India.What does the US have to say to the EU now for buying Russian oil from India? Or is it just going to blame India and turn a blind eye to the EU?Quote from: TravelMug on June 05, 2022, 01:25:28 AMIndia deny it though, Quote“There’s an enormous shortage of oil...Getting access to oil is difficult. A country like India would be crazy to get oil from somebody and sell it to somebody else. This is nonsense,” he said when asked about the reports at the ‘GlobeSec Bratislava Forum’ conference in the Slovak Republic on Friday.https://www.thehindu.com/news/national/india-is-not-a-conduit-for-russian-oil-sales-jaishankar/article65491475.eceBut we really don't know who is saying the truth here. India is playing their cards very well here and it's up to us to who really believed or who to side in this story. And let's see if US is going to sanction India or it is just a empty threat as we all know that the US-India relationship as far as political and non-political interests are.Thank you, we have no way of knowing who is telling the truth, I'm afraid. What I think is that the EU must be buying the oil from somewhere that it used to buy from Russia, I don't think they have magically stopped consuming 2.5 million barrels a day.https://theconversation.com/que-ocurriria-si-europa-dejara-de-comprar-petroleo-a-rusia-178253",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romero121",
      "created_time": "June 05, 2022, 04:45:18 AM",
      "body": "Indian recently made a tax cut on petrol and diesel. Maybe the reselling of fuel could've let the government lower the excise duty. The ruling government increased the excise duty more than 10% and now it has made a 3% cut finding the compensation out of selling to the European countries. Somehow Indian government is making money out of the war crisis. Recently US condemned India, but the news wasn't transparent and condemn was made for some other reason.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "South Park",
      "created_time": "June 05, 2022, 04:57:58 AM",
      "body": "Quote from: adaseb on June 05, 2022, 03:43:48 AMThis is why I knew these sanctions wouldn’t of done anything. If anything it’s hurting the consumer because traders are buying up the crude oil futures and everybody suffers at the pumps.But the non sanctioned countries buys the oil and they resell to a sanctioned country with Russia. Makes pretty much no sense.Like putting money in one pocket and out the other. They need to sanction all the countries for this to work. Regardless of all the talks we have listened for the past months the European Union needs the oil and gas coming from Russia, maybe over the long term with an effective set of policies they could reduce their reliance on Russia, but for now this is not something possible for them, so how to solve this on the short term? They cannot do it, which is precisely the reason we are seeing something as nonsensical as this happening.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sithara007",
      "created_time": "June 05, 2022, 05:54:07 AM",
      "body": "Quote from: Don Pedro Dinero on June 05, 2022, 04:10:18 AM~~~The fact that India buys oil from Russia is not new, but it is not what I wanted to emphasize in the thread. What I wanted to emphasize was the European Union making a fool of itself by buying more expensive Russian oil from India.What does the US have to say to the EU now for buying Russian oil from India? Or is it just going to blame India and turn a blind eye to the EU?Once the oil is refined in to diesel, it will be impossible to know about it's origin. And here, the situation is further complicated by the fact that the two oil companies who have purchased huge amounts of oil recently (Nayara Energy and Reliance Industries) also import a lot of oil from Iraq and Saudi Arabia. So they can always claim that the diesel they sell to the EU is sourced from Iraqi crude. After all, it is same substance with the same chemical composition coming from different oil wells. There is no 100% accurate method to find out how many molecules came from Russia, and how many came from Iraq.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "June 05, 2022, 06:23:09 AM",
      "body": "Quote from: Sithara007 on June 05, 2022, 05:54:07 AM<..>In the end, they are making a play because the fact is that at least part of what India sells to Europe is of Russian origin, but as it has plausible deniability, they hide behind that. In my view, it's a showboating move by the EU, but it's a botched job if you stop to analyse it minimally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "June 05, 2022, 09:02:31 AM",
      "body": "Quote from: Don Pedro Dinero on June 04, 2022, 05:49:06 PMI first saw this in a Spanish forum, but I see that a national newspaper in Spain has brought it out.https://www.elmundo.es/economia/macroeconomia/2022/06/04/629a1c44e4d4d8fb2a8b460d.htmlIn English:https://www.marketwatch.com/story/why-india-is-set-to-win-big-as-eu-bans-russian-oil-imports-11654021874India is receiving 600,000 barrels per day from Russia compared to 90,000 barrels per day last year, which buys at below market price, refines and sells at a higher price to Europe. What a masterstroke by the European Union, LMAO.Nobody thought of this? Last Friday the EU adopted sanctions banning oil imports from Russia. https://thehill.com/policy/energy-environment/3511129-eu-officially-adopts-russian-oil-embargo/Once this has come to light, what are they going to do? Not buy from India? It reminds me of exchanges or other entities that don't want tainted coins.I put this comment here because I think it is the key to the issue:Quote from: Sithara007 on June 05, 2022, 05:54:07 AMOnce the oil is refined in to diesel, it will be impossible to know about it's origin. And here, the situation is further complicated by the fact that the two oil companies who have purchased huge amounts of oil recently (Nayara Energy and Reliance Industries) also import a lot of oil from Iraq and Saudi Arabia. So they can always claim that the diesel they sell to the EU is sourced from Iraqi crude. After all, it is same substance with the same chemical composition coming from different oil wells. There is no 100% accurate method to find out how many molecules came from Russia, and how many came from Iraq. So India claims that what it sells to the EU does not come from Russia, the EU claims that what it buys does not come from Russia, when most likely at least some of what it buys from India comes from Russia, and more expensively. LMAO.India is playing the game that benefits their people, but it won't go unnoticed and it's clear the India is losing any status it had as a freedom loving democracy. That being said, Russia is still the ultimate loser in this situation because India will be paying them much less than market rates and it has much lower capacity to receive Russia oil. It's more expensive for Russia to send oil there, so they lose all around. I'm not sure why you are gloating that Europe pays more when the whole war in Ukraine is absolutely pointless and achieves nothing but to stroke Putin's vanity. Many people are dying, Russia becomes isolated and desperate, these insignificant events like who pays much less for Russian oil is the best you can come up with?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "June 05, 2022, 09:41:24 AM",
      "body": "China was almost doing this with Iran. I wonder how India was not demonized or tried to prevent it from doing so.If we read the numbers, it jumped from less than 200,000 barrels at the beginning of the year to less than 800,000 dollars.It is not enough to solve the energy problem, and I think that the final consumer is the one who decides whether this step will succeed or not, just as happened with Shell (Shell agrees to sell Russian retail business to Lukoil - BBC).Let's see how Russia will be able to sell about 3 million barrels that were going to Europe and its allies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "be.open",
      "created_time": "June 05, 2022, 10:04:35 AM",
      "body": "Quote from: Husires on June 05, 2022, 09:41:24 AMLet's see how Russia will be able to sell about 3 million barrels that were going to Europe and its allies.Through the Druzhba pipeline? Haven't you realized yet that the EU oil embargo is pure farce and bluff. Hungary did not join the embargo, Bulgaria, Slovakia and Croatia did, but with a number of reservations and delays. A large refinery in East Germany that produces aviation fuel for the whole of Europe is designed for heavy Russian oil, and it is easier to build a new plant than to reconfigure an old one. Europe has painted itself into a corner with populist statements by incompetent politicians, and now their voters will have to pay the price. Russia does not need to sell three million barrels to Europe when Europe is driving up oil prices through its actions. It is enough to sell two million and get the same money or even more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "June 05, 2022, 10:11:39 AM",
      "body": "Quote from: Sithara007 on June 05, 2022, 02:08:17 AMThis month, India is expected to import almost a million barrels of Russian crude per day, which is almost 35 times the volume for 2021. And the Indian consumers are not benefitting from these imports. Most of this crude is refined to diesel and gasoline and then exported to European Union and other South Asian nations. And the Indian government is in talks with Russia to further increase the imports later this year, if Russia is willing to increase the discount. As of now, the discount is $30 to $35 per barrel. The Indian government is requesting for discounts in the range of $45-$50 per barrel. This is business as usual and I think that this will make their relationship and friendship better. While the world is in economic turndown due to the price of oil. There goes India that won't be affected by it and instead, they're making business in this situation. This is the same as the start of the pandemic, while the world is experiencing fear of the virus, there go the huge pharma companies that have been making billions out of the situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}