{
  "id": "topic_5449530",
  "title": "tomlondon16",
  "author": "tomlondon16",
  "created_time": "April 20, 2023, 04:02:41 AM",
  "content": "We'll comment on new posts that have been posted on certain hashtags that you will choose! for example everyone who posted on #dog will get a new custom comment that you will choose. We can do up to 500K comments a day. People will get a notification and see your comment and check your profile!How does it work?1. After the purchase you will fill up a form with all the required information that needed such as target hashtags and custom message.2. We'll scrap your target hashtags and will start commenting!3. We'll send you reports of all the comments we've posted with proof of delivery! How much does it cost?Automatic Mass Comments on Hashtags:From 50k mentions: $2.1 per 1,000From 100k mentions : $2 per 1,000From 250k mentions : $1.9 per 1,000How can I place an order?Contact us on Telegram or through our panel!@igmassdmIGMassDM.pro",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449530",
  "comments": [
    {
      "author": "tomlondon16",
      "created_time": "May 05, 2023, 07:39:50 AM",
      "body": "Instagram Mass Scraping! Scrape emails, phone numbers, websites and more!Welcome to Instagram Mass Scraping!Get Massive data for Instagram that includes, Username, Phone Number, Email, Website (if public) and much more!Example of scraping the hashtag #realestate:What is Instagram Mass Scraping and who does it work?Instagram Mass Scraping is a service for anyone who is looking to do outreach by Emails, Phone numbers and needs fresh and uqinue data. We can scrape based on your request specific accounts' followers, hashtag, locations and more! For example, we want to scrape 1M accounts from the hashtag #realestate. We'll scrape from the hashtag, get 1M users and then extract all the data we can get on them!With this data you could call them to send them your services, do cold emailing, contact them through their website or maybe even through social media! the more creative you are, the better!How much does it cost? Instagram Scraping with emails, phone numbers, websites etc (filters avb):From 250k records: $40 per 100kFrom 500k records: $30 per 100kFrom 1M records: $25 per 100kAdd-on Services:* Extract Email addresses if available from found website URL (even multiple emails per domain)* Email Validation* Social Media such as Instagram, Facebook, Linkedin, Twitter from their website (if available)What are the payment methods?Cryptocurrencies - BTC, ETH, LTC, BCH, USDTHow long do orders take to process?It depends on the amount of your order and your add-on services, can take between a day or two for 250K records and a week long for 1M recordsWhat's the refund policy?We can guarantee that we will get you the list from Instagram based on your request. If we won't be able to deliver the service then we will refund you!How can I place an order?Contact us on Telegram!IGMASSDM.PRO",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tomlondon16",
      "created_time": "June 06, 2023, 06:06:57 PM",
      "body": "We are taking new orders!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tomlondon16",
      "created_time": "June 07, 2023, 04:09:57 PM",
      "body": "We are taking new orders!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}