{
  "id": "topic_5465992",
  "title": "sokani",
  "author": "sokani",
  "created_time": "September 07, 2023, 12:12:37 PMLast edit: September 07, 2023, 06:11:05 PM by sokani",
  "content": "Translated Topic in Pidgin Language: De call for Julian Assange || De WikiLeaks Manifesto - Make all of us read amOriginal Topic: The call for Julian Assange || The WikiLeaks Manifesto - We all should read itAuthor: GazetaBitcoinMaybe plenti pipo don hear about de name Julian Assange, but na only few persons know who him be, wetin him do and wetin him dey do now. From dis, na only few person who know why him be emblematic figure for de crypto space.Dis topic na call for help, na him make I post am for the beginners and Help board. Na call to help Julian!I bin don plan to write about dis topic for sometime, but for some reasons (de most important be say I no get time) delay am. However, another recent discrediting of de press (in one way or de other) come make me to write dis thread. Though de reason behind dis dey less important. Wetin dey important be say Julian need help!De last sentence for dis topic na cautionary tale: \"Make all of us continue Cypherpunks' work and dey fight for freedom!\"De Cypherpunks group bin emerge initially for 1992 from Eric Hughes, de author of \"The Cypherpunk Manifesto\", John Gilmore and Timothy May, de author of \"The Crypto Anarchist Manifesto\". From one former meeting for Gilmore office, dem come create one mailing list, under de name of Cypherpunks mailing list.During dat time, odas join Cypherpunks fight against de state as dem dey surveil de citizen. De number persons bin reach more dan 1000 contributors.Julian Assange bin dey part of de group between 1995 and 2002. Him get brilliant mind wey odas bin observe. If May, Hughes or Gilmore bin focus more on \"algorithms for people\", for digital cash and for public access to cryptography (for de era wey NSA bin dey fight wit all their power against dis), Assange bin get different principle: “Freedom of information na respected liberal value.\"The WikiLeaks Manifesto, one document less known, unfortunately, e contain oda words of wisdom from Julian: \"Only reveal injustice person fit answer; for one man to do anything thing intelligent him suppose know wetin dey go on.\" As Gutenberg printing press bin surface for 1448, wey come lead to Printing Revolution, elite power over classified documents come dey reduce constantly. Dis na one of de first form of information decentralization. Julian Assange take am to a whole new level.And dis one happen after de launch of Wikileaks, in 2006.\"I grow wit de understanding say de world wey I live na one wey people dey enjoy some kind of freedom to communicate wit each oda in privacy, without pipo to dey monitor am, without pipo to dey look into or analyze am or judge by some shadowy figures or systems any time they talk anything wey dey travel through public line.\" - Edward SnowdenI dey reason de same way as Snowden, and even more: I dey try to help am by recommending where him go fit settle and where him no fit settle for him new life after him betray de govern; Assange published thousands of classified information from all parts of de world. Him connection to Bitcoin?, Some fit as.After US govern bin come initiate a financial blockage of WikiLeaks accounts, Julian come realized de potential of Bitcoin and come dey reason to accept de new cryptocurrency as a way for donation. De idea bin put BitcoinTalk on flames dat time:\"Bring am come\", as RHorning bin emphasize.However, Asange continue, \"\"Satoshi Nakamoto\", de pseudonymous inventor of Bitcoin, bin respond: \"No, no \"bring am come.\" De project need to grow gradually so dat de software fit get strength along de way. I don appeal to WikiLeaks make dem no try to use bitcoin. Bitcoin na small beta community wey dey very young. You no go get any beta thing oda dan pocket change, and de heat wey you go bring go likely destroy us at dis stage.\"[...] Six days later, for 12 December 2012, Satoshi come famously disappear from de Bitcoin community, after him post dis message: \"e for dey nice to get dis kind attention for any oda context, WikiLeaks don kick de hornet net and de swarms dey come towards our direction.\"\"As a deep sign of respect for Satoshi and for him work, as Asange bin talk (for de previous mentioned link), \"WikiLeaks bin read and agree with Satoshi analysis, and come decide to stop de launch of bitcoin donation channel until de currency don dey more established. WikiLeaks later launch their bitcoin donation address after de currency major boom, for 14 June 2011.\"A sign for respect wey na rara avis nowadays.Julian rely on Bitcoin certainly no only help WikiLeaks: e also help make Bitcoin to dey popular; e raise awareness about Satoshi creation; e bring more and more people to de path wey Satoshi open.Wetin happen next dey well known dan de above mentioned history. US government start to dey hunt Assange for 2011, and in response, Julian come manage to help himself by seeking asylum for de Ecuadorial embassy for London. Dem come grant him request for 2012. However, him stay for de embassy bin no dey easy - among many oda things, him bin no step outside de embassy until 2019(!), him bin dey live almost like an inmate. Between fabricated accusation of sexual harassment, wey dem drop after years by the Swedish govern, and him continue work for WikiLeaks, Asange also try to keep his moral and do him best to avoid extradition to the US, as him dey aware say if dem carry go there na death penalty or at least 175 years behind bars.Unfortunately, for 2019 Ecuador come end him asylum, for reasons wey dey more or less ridiculous, but e dey almost clear say dem force de decision somehow by oda secret agencies or by oda governs.As I dey write dis thread, Julian trial for extradition don start. During de trial, him dey stay for prison.As I bin talk recently, for one of my previous topic,Quote from: GazetaBitcoin on January 21, 2020, 10:25:04 AMDe fight for freedom of speech, for privacy and to dey render governs irrelevant start long long time ago. Now e dey our hands.E dey our hands also to help Julian. And to help am mean to help freedom of information!I no go talk how to offer dis help, I dey sure say everybody know, or atleast, get small intuition about am.Time dey for debate and time dey for action. Now debating time don pass.Issues to note:I also recommend make una read de following:- Nils Melzer's The Trial of Julian Assange: A Story of Persecution - The shocking story of de legal persecution of Wikileaks founder Julian Assange and The dangerous implications for The whistleblowers of The future- Robert Manne's piece of art The Cypherpunk Revolutionary Julian Assange- The Most Dangerous Man In The World: The Inside Story On Julian Assange And WikiLeaks, written by Andrew Fowler- Cypherpunks: Freedom and the Future of the Internet, by Julian Assange. De book na discussion between Julian, Jacob Appelbaum (Tor developer) and Jérémie Zimmermann (co-founder of La Quadrature du Net)- Underground, by Suelette Dreyfus & Julian Assange. Na fascinating book about de rise of Australian hackers and phreakers from 1980s, including de early activity of Julian Assange, which by dat time dem bin know am as Mendax.- When Google Met WikiLeaks, by Julian Assange- The Unauthorised Autobiography, by Julian Assange.Besides de following movies dey parts of a most watch category:Ithaka - na documentary wey show Julian struggle to avoid extradition to de USNa WikiLeaks very own documentary - full movieRisk - Na WikiLeaks documentary, directed by Laura Poitras (a friend of Julian Assange) - full movieThe Fifth Estate - Na great movie about WikiLeaksWe Steal Secrets: The Story of WikiLeaks - Na yet anoda documentary about WikiLeaksUnderground: The Julian Assange Story - Na anoda movie about Julian, wey describe him early career.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465992",
  "comments": [
    {
      "author": "GazetaBitcoin",
      "created_time": "September 07, 2023, 04:31:32 PM",
      "body": "Thank you dear Sokani as you translate one more of my topic! Great job! Dis way more and more pipo go dey aware of de struggles of de poor Julian Assange.Dis theme na dedication to Cypherpunk, to freedom of journalism, and at de same time, de material try to bring out de unjust justice wey Asange bin face. And all dis because he want talk de truth, de whole truth and nothing but de truth.Similar to Ross Ulbricht, US government bin hold Asange as an example. At de same time, none of de oda journalist wey cooperate with am face similar allegations. No New York Times journalist wey secret agencies don ever persecute. No Der Spiegel journalist wey US don accuse of spying. No Guardian journalist wey dem don hunt. And all dis na de biggest names for de press wey collaborate with Asange. Instead dem bin hold am as role model.We go only fit hope say him go dey finally free again...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}