{
  "id": "topic_5455780",
  "title": "Dank14",
  "author": "Dank14",
  "created_time": "June 08, 2023, 06:38:09 PMLast edit: June 08, 2023, 08:21:54 PM by Dank14",
  "content": "Hey guys,Way back in 2016, some guy named \"Malboroza\" added a \"-1\" rating to my profile JUST because I had more than one account — I didn't enter into ANY trade neither did I scam anyone.I stopped posting on this forum. . . When I checked back in 2020, the \"-1\" was still there!This is 2023. . . The \"-1\" is still there!!2016 — 2023!Is this fair?!Who exactly did I scam? . . . I'm asking all the moderators to identify who I scammed. . . Because this is getting really extreme",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455780",
  "comments": [
    {
      "author": "TheBeardedBaby",
      "created_time": "June 08, 2023, 07:02:13 PM",
      "body": "Moderators have nothing to do with scams. They do not moderate scams and cannot remove neg trust. Only the one who left the trust can remove it, or theymos (but those are very rare cases).since Marlboroza is away for quiet some time now, I think you have no luck with the neg trust.Having more than 1 account is no problem, joining same campaign with many accounts is a rule breaking event and deserves neg tag.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dank14",
      "created_time": "June 08, 2023, 07:17:59 PMLast edit: June 08, 2023, 08:22:58 PM by Dank14",
      "body": "That's the thing, it was a self-appointed moderator who put it there. . .Mind you, I didn't join one campaign with multiple accounts either!Even Malboroza can't accuse me of joining the same campaign with multiple accounts.The only rap was that I had more than one account — that was all!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "June 08, 2023, 07:22:28 PM",
      "body": "marlboroza was not a moderator and he is not active in forum anymore, so you will have that feedback forever on your profile.Quote from: Dank14 on June 08, 2023, 07:17:59 PMThat's the thing, it was a freshman—moderator who put it there. . .Not true.He wrote that feedback in 2019, he registered in forum during 2016, and I repeat he was NOT a moderator.Anyone can write a feedback on any profile.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dank14",
      "created_time": "June 08, 2023, 07:36:28 PMLast edit: June 08, 2023, 08:03:26 PM by Dank14",
      "body": "Quote from: dkbit98 on June 08, 2023, 07:22:28 PMNot true.He wrote that feedback in 2019, he registered in forum during 2016, and I repeat he was NOT a moderator.Anyone can write a feedback on any profile.The first time he gave me a negative trust was in 2016, he probably updated it again in 2019. . .In that case, I will give Marlboroza a negative trust as well. . . One good turn deserves another.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "June 08, 2023, 08:03:01 PM",
      "body": "Quote from: Dank14 on June 08, 2023, 07:36:28 PMIn that case, I will give marlboroza a negative rating also.If you wish you can but it won't be shown unless you're a part of DT members when others see his profile.But why suddenly you're bringing this to a discussion when the member who left the feedback on you isn't active anymore, FYI the feedbacks can't be deleted by mods it can be deleted by only the person who left it on your profile so it will be there unless Marlboroza comes active and decides to revert it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dank14",
      "created_time": "June 08, 2023, 08:09:09 PM",
      "body": "See, I have to alert people that Malboroza is a bully who loves to hurt people for no good reason.Forum members have the right to know how dirty he can be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "June 08, 2023, 08:12:00 PM",
      "body": "For what it’s worth, I don’t see your profile as having a -1 but that is because I have DT removed from my trust network due to people like marlboroza who make heavy handed decisions when it comes to leaving negative trust. I much preferred the old days when feedback was positive and accounts were labeled as scammers if they did something wrong. Pretty sure I’ve said before that with the flags system, negative trust is redundant.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "June 08, 2023, 08:53:32 PM",
      "body": "Quote from: Dank14 on June 08, 2023, 07:36:28 PMIn that case, I will give Marlboroza a negative trust as well. . . One good turn deserves another.That is the wrong way to use the trust system, retaliatory feedbacks are not necessary, if you think someone is constant in giving inaccurate feedbacks, you should distrust that member. The member who left you that feedback is inactive and only them can remove it, so i feel you should forget about the feedback and use the forum as normal.Quote from: Dank14 on June 08, 2023, 06:38:09 PMThis is 2023. . . The \"-1\" is still there!!2016 — 2023!Is this fair?!Feedbacks are not time-barred, they can only be removed or modified by the person who sent them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "June 08, 2023, 09:24:33 PM",
      "body": "Quote from: Z-tight on June 08, 2023, 08:53:32 PMQuote from: Dank14 on June 08, 2023, 07:36:28 PMIn that case, I will give Marlboroza a negative trust as well. . . One good turn deserves another.That is the wrong way to use the trust system, retaliatory feedbacks are not necessary, if you think someone is constant in giving inaccurate feedbacks, you should distrust that member. The member who left you that feedback is inactive and only them can remove it, so i feel you should forget about the feedback and use the forum as normal.I think you do not fully understand what theymos said about retaliatory feedback. Infact, for the system to be healthy, there should be retaliatory feedback and I have been seeing it on people's trust feedback. You mean if I give you a negative tag for an offence you didn't commit, all you could to is to distrust me? If I give you an inaccurate negative feedback, you have the right to complain to the forum by creating a thread, that's when I refused to remove it. If the forum discovers that my negative feedback is unworthy, it means I will not last long on DT. Many people will distrust me but if few still holds me on DT, you have the right to send a retaliatory feedback. QuoteA major goal of this is to allow retaliatory distrusts and ratings to actually have some chance of mattering so that contentious ratings have an actual cost. If someone is obviously scamming, then any retaliatory rating should not last long due to the DT1 \"voting\", but if you negative-rate someone for generally disliking them, then their retaliation against you may stick. In borderline cases, it should result in something of a political battle.The problem with Op is that his retaliatory feedback won't be that effective, and also people still hold the user who stopped using the forum on trust list.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "June 08, 2023, 11:45:25 PM",
      "body": "1. Why didn't you come out to defend yourself against the accusations and feedback that were made against your account at that time?Why wait for almost 4 years to start crying about foul play even when the members that accused you are no longer active2. This thread contains hard evidence about the accounts' connection to a big account, farm - https://bitcointalk.org/index.php?topic=5182721 especially Veleor's investigation.What do you say about this?Quote from: Veleor on September 10, 2019, 04:33:20 AMI combined the records about OP's alts for future references.10+ Accounts Connected: Goms, Daisy14, Dank14, Das, Dinki, Dassi, Dahhi, Gaugh, Gohs, GahsProof:Quote from: Goms on September 04, 2016, 03:26:39 PMName:  GomsPosts:   184Position:   Full memberBitcoin Address: 1LQS9mtcUFxN5KbZ5CAyFE8urViVJPRLozCan I join as a member if there are no full member slots available?(Archive)Quote from: Daisy14 on August 11, 2016, 04:53:38 PMUsername: Daisy14Rank: Full memberPosts: 136BTC address: 1LQS9mtcUFxN5KbZ5CAyFE8urViVJPRLozI will change my signature if accepted. Thanks (Archive)Quote from: Dinki on August 23, 2016, 09:50:07 PMUsername: DinkiPost count: 71BTC address: 1LQS9mtcUFxN5KbZ5CAyFE8urViVJPRLozPlease sign me up!(Archive)Quote from: https://archive.is/8HEgD#selection-309.0-309.5Name:    DassiBitcoin address:    1LQS9mtcUFxN5KbZ5CAyFE8urViVJPRLozQuote from: Dahhi on August 18, 2016, 02:49:37 PMI will like to take part in the campaign..Name: DahhiPost Count: 141Rank: Full MemberBitcoin Address: 1LQS9mtcUFxN5KbZ5CAyFE8urViVJPRLozProfile UID: 813174(Archive)Quote from: Gahs on August 17, 2016, 07:21:34 AMBtctalk Name: GahsRank: Full memberCurrent post count: 250Btc address: 1LQS9mtcUFxN5KbZ5CAyFE8urViVJPRLozWear appropriate signature: Definitely Would like to participate. Thanks.(Archive)Quote from: Goms on July 15, 2016, 12:44:13 PMName: GomsRank: Full memberBitcoin Address: 1Dk35CC2bktMUJoUwWGKmR35ykVLyBCJ92Profile UID: 808046Hope to get in (Archive)Quote from: Daisy14 on July 22, 2016, 02:30:17 PMLink to Profile: https://bitcointalk.org/index.php?action=profile;u=812240;sa=summaryBitcointalk Rank: MemberCurrent number of posts: 80Bitcoin Address to send the payment: 1Dk35CC2bktMUJoUwWGKmR35ykVLyBCJ92I will like to participate in this campaign.(Archive)Quote from: rizzlarolla on September 30, 2016, 03:06:58 PM~https://bitcointalk.org/index.php?action=profile;u=812240  Daisy14 (158)https://bitcointalk.org/index.php?action=profile;u=812245  Dank14 (143)  https://bitcointalk.org/index.php?action=profile;u=812251  Das (340)        https://bitcointalk.org/index.php?action=profile;u=812256  Dinki (136)dank also has 1Dk35CC2bktMUJoUwWGKmR35ykVLyBCJ92First post history's almost identical. Conclusive.(Archive)Quote from: Das on July 17, 2016, 02:29:11 AMName: DasRank: MemberBitcoin Address: 1Dk35CC2bktMUJoUwWGKmR35ykVLyBCJ92Profile UID: 812251Would love to be a part of the team!(Archive)Quote from: Dassi on November 01, 2016, 06:36:30 PMName: DassiPost count: 211Rank: Full MemberBitcoin address: 1Dk35CC2bktMUJoUwWGKmR35ykVLyBCJ92Profile UID: 813171Thanks.(Archive)Quote from: Dahhi on July 20, 2016, 01:15:18 PMUser: DahhiPosts Start: 78Pay in: btcAddress: 1Dk35CC2bktMUJoUwWGKmR35ykVLyBCJ92I will like to join.Thanks.(Archive)Quote from: Gahs on July 23, 2016, 10:23:16 AMMy bitcoin address was omitted, it's not on your list. I wasn't among those who were paid... Please check it: 1Dk35CC2bktMUJoUwWGKmR35ykVLyBCJ92(Archive)Quote from: Das on September 08, 2019, 04:07:46 AMUsername: DasBitcoin talk profile link: https://bitcointalk.org/index.php?action=profile;u=812251;sa=accountTelegram chat: @mestiip(Archive)Quote from: Gohs on September 08, 2019, 04:32:29 AMBitcointalk username: GohsBitcointalk profile link:https://bitcointalk.org/index.php?action=profile;u=813708;sa=accountTelegram username: @mestiip(Archive)Profiles Daisy14, Dank14, Das, Dinki have been registered within 1 hour.Profiles Dassi and Dahhi have been registered within 6 minutes.Profiles Gaugh, Gohs, Gahs have been registered within 2 hours.Accounts Goms, Dank14, Das, Dassi, Gahs \"woke up\" at the same period.Quote from: https://bpip.org/profile.aspx?p=Goms9/7/2019 8:40:42 PM    woke upQuote from: https://bpip.org/profile.aspx?p=Dank149/7/2019 4:07:45 PM    woke upQuote from: https://bpip.org/profile.aspx?p=Das9/8/2019 3:05:06 AM    woke upQuote from: https://bpip.org/profile.aspx?p=Dassi9/8/2019 3:31:07 AM    woke upQuote from: https://bpip.org/profile.aspx?p=Gahs9/7/2019 8:42:03 PM    woke upRelated Addresses:Code:1LQS9mtcUFxN5KbZ5CAyFE8urViVJPRLoz1Dk35CC2bktMUJoUwWGKmR35ykVLyBCJ92Telegram @mestiipMiscellaneous:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "June 09, 2023, 12:14:07 AM",
      "body": "Quote from: Dank14 on June 08, 2023, 06:38:09 PMHey guys,Way back in 2016, some guy named \"Malboroza\" added a \"-1\" rating to my profile JUST because I had more than one account — I didn't enter into ANY trade neither did I scam anyone.I stopped posting on this forum. . . When I checked back in 2020, the \"-1\" was still there!This is 2023. . . The \"-1\" is still there!!2016 — 2023!Is this fair?!Who exactly did I scam? . . . I'm asking all the moderators to identify who I scammed. . . Because this is getting really extreme  I think you kinda late though, Marlboroza is no longer active in this community.And he is the only one that can remove the negative on your profile.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "June 09, 2023, 12:36:47 AM",
      "body": "Quote from: OgNasty on June 08, 2023, 08:12:00 PMFor what it’s worth, I don’t see your profile as having a -1 but that is because I have DT removed from my trust network due to people like marlboroza who make heavy handed decisions when it comes to leaving negative trust. Ditto (but not for the same reasons).  However, I'm pretty sure it's not the rare cases like us who have rebuked the DT system that concern OP but rather the 99.x% of the rest of the forum who will end up seeing his red tag.Aside from marlboroza being MIA, he did leave a reference link for the feedback he left so it's not as though it isn't justified or something that should be removed after an arbitrary period of time.  Assuming what marlboroza alleged is true, I don't see what OP has done since the feedback was given that would warrant it being removed.Quote from: logfiles on June 08, 2023, 11:45:25 PM1. Why didn't you come out to defend yourself against the accusations and feedback that were made against your account at that time?While that's a valid question, even if OP successfully defends himself, there's still the issue of marlboroza not being active.  I guess someone on DT could leave a counter-feedback, but OP really ought to have spoken up when the accusation was made.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nutildah",
      "created_time": "June 09, 2023, 04:30:11 AM",
      "body": "I know OP admitted to having other accounts already but the lack of address connection to the other alts was bugging me so...Quote from: rizzlarolla on September 30, 2016, 03:06:58 PMQuote from: satmas on September 29, 2016, 03:01:55 PMDaisy14 is connected to these guys as well.proof; this address: 1Dk35CC2bktMUJoUwWGKmR35ykVLyBCJ92 was used hereEdit: Dinki is also connected via wallet address 1LQS9mtcUFxN5KbZ5CAyFE8urViVJPRLoz, as seen here. Sorry about the WOT.https://bitcointalk.org/index.php?action=profile;u=812240  Daisy14 (158)https://bitcointalk.org/index.php?action=profile;u=812245  Dank14 (143)  https://bitcointalk.org/index.php?action=profile;u=812251  Das (340)        https://bitcointalk.org/index.php?action=profile;u=812256  Dinki (136)dank also has 1Dk35CC2bktMUJoUwWGKmR35ykVLyBCJ92First post history's almost identical. Conclusive.Here's the piece of evidence that was missing (or at least I didn't see it anywhere previously):which firmly ties Dank14 to the other accounts, if there was any question remaining.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "June 09, 2023, 05:04:41 AM",
      "body": "Quote from: The Sceptical Chymist on June 09, 2023, 12:36:47 AMWhile that's a valid question, even if OP successfully defends himself, there's still the issue of marlboroza not being active.  I guess someone on DT could leave a counter-feedback, but OP really ought to have spoken up when the accusation was made.I don't think counter-feedback is still valid with the current trust system, other user can leave a neutral feedback, but still it doesn't clean off the negative feedback. Quote from: nutildah on June 09, 2023, 04:30:11 AMI know OP admitted to having other accounts already but the lack of address connection to the other alts was bugging me so...The post where the @OP accused for using that address was happen on 2016, but all of post where archived by forum members were started since 2018, so it seems no way to track it back.There are many DT members on that thread and they're still trusted until now, if marlboroza wrongly accused @OP, other DT users should've pointed it before.I think the @OP creating this post right now is on purpose because he know marlboroza is inactive, so he think he will win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God Of Thunder",
      "created_time": "June 09, 2023, 06:01:43 AM",
      "body": "Quote from: Dank14 on June 08, 2023, 08:09:09 PMForum members have the right to know how dirty he can be.Forum members should also know how dirty you can be. There are a bunch of people who already provided a lot of proof that your account is connected to at least 14 more accounts. What makes you create that many accounts? Of course, I believe his statement that you are an account farmer who creates accounts to sell them. I don't see any other reason why a single person needs to create more than two accounts. For various purposes, someone could create three accounts. But, when it comes to 14 accounts, I don't believe that you are an innocent guy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "June 09, 2023, 07:14:16 AM",
      "body": "What's the point of a thread like that, it's a \"-1\" and if it bothers you, remove Malboroza from your trust list.If you want to discuss, it will not affect you, and if you want to start a business, all you have to do is use a BTT escrow and you will not worry about this trust, and if you want to join signature campaigns, you must prove that you are a trustworthy member, create several high-quality posts and one of the managers may accept you if your posts Absolutely excellent. Otherwise, create a new account and make an honest start without scams or spam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "June 09, 2023, 11:15:03 AM",
      "body": "Quote from: Dank14 on June 08, 2023, 06:38:09 PMHey guys,Way back in 2016, some guy named \"Malboroza\" added a \"-1\" rating to my profile JUST because I had more than one account — I didn't enter into ANY trade neither did I scam anyone.I stopped posting on this forum. . . When I checked back in 2020, the \"-1\" was still there!This is 2023. . . The \"-1\" is still there!!2016 — 2023!Is this fair?!Who exactly did I scam? . . . I'm asking all the moderators to identify who I scammed. . . Because this is getting really extreme  I can't believe you're still on this right from 2016 to date, this account would have mean so much to you really, but if i may ask you, that have you tried to contact him through PM over the years, secondly if you have used that your alts account for scam, spamming or any related illicit activities in the past that the other account was tagged red then the two accounts can bear this same consequences since you're the owner of them both, just as the same rule that applied on ban evasion, but anything aside this should be in what transpired between both of you in the past which we may not know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dank14",
      "created_time": "June 09, 2023, 03:45:03 PMLast edit: June 10, 2023, 07:07:57 AM by mprep",
      "body": "Quote from: Learn Bitcoin on June 09, 2023, 06:01:43 AMForum members should also know how dirty you can be.  . . .Guy(Learn Bitcoin), keep learning all you can about BTC and don't conclude on what you know nothing about.You will appear more gracious.Quote from: logfiles on June 08, 2023, 11:45:25 PM1. Why didn't you come out to defend yourself against the accusations and feedback that were made against your account at that time?I did protest about it back in 2016, it's a pity my thread may no longer be in the archives. I repeatedly stated that1) There was nothing like me selling accounts2) I didn't give myself trust ratings — this should be obvious for everyone to see.He didn't remove it. . . And I didn't know about retaliatory feedback then.But I got busy with life, became occupied with other needs and left the forum for some years thinking the rating will fade off.Fast forward to 2023, I have some PayPal funds I wish to convert to crypto. Then I remembered bitcointalk.org and thought it will be a good place to find a good crypto seller but guess what?I see this \"-1\" staring at me.That really got me pissed. Which is why I started this thread again after so many years.I learnt a lot about crypto from this forum. . . Never did ONE trade before.Now that I really need to do a trade, I'm finding it difficult because of someone's arrogance.What gives Malboroza the right to think he can just throw lies at people — it all boils down to PRIDE, SELF-RIGHTEOUS attitude.[moderator's note: consecutive posts merged]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "June 09, 2023, 04:14:52 PM",
      "body": "Quote from: Dank14 on June 09, 2023, 04:03:47 PMWhat gives Malboroza the right to think he can just throw lies at people — it all boils down to PRIDE, SELF-RIGHTEOUS attitude.The user who put him in their trust list. Malboroza is very reputable forum user here because he busted a lot of scammers and cheaters. He has the right to tag you because of the solid connection involving you to multiple account that cheat bounty campaigns.Also, He is now long active so the tag will stay there forever until he came back and removes it or all the user that put him on their trust list will remove him or distrust him which is not gonna happened because he leave the forum with same reputation.You can still use the marketplace by using an escrow to your deals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}