{
  "id": "topic_5436297",
  "title": "Spaceman1000$",
  "author": "Spaceman1000$",
  "created_time": "January 21, 2023, 08:10:23 PMLast edit: January 21, 2023, 08:54:19 PM by Spaceman1000$",
  "content": "Power outages in south Africa has caused the death of over 40000 birds in a poultry farm in south Africa, the farmer recounts his losses as the electricity distribution company refuse to bring power for some days. The farmer said, his ready to press for charges for the damages he has incurred.The situation has really caused him a homogeneous economic loss, sincerely it's really an unfortunate situation.https://www.news24.com/fin24/economy/see-farmer-to-put-r15m-claim-to-eskom-after-tens-of-thousands-of-chickens-killed-20230119",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436297",
  "comments": [
    {
      "author": "franky1",
      "created_time": "January 21, 2023, 08:38:06 PM",
      "body": "should have bought a generator.if a hospital cant sue an electric company.. a hospital instead realises lives are at risk and invests in a generator back upalso poultry farmer should think about he area he set up his farm and its reliance on resources of that areaa farmer of wheat wouldnt set up in the desert after all, where water is not reliableunless the power company COULD produce electric. but simply decided \"nah not today, lets go on vacation instead\" then they are liable. especially if a farmer pre-paid their bill to get power for the month, but didnt receive it. as thats a breach of service agreement",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "January 21, 2023, 09:28:50 PM",
      "body": "Quote from: franky1 on January 21, 2023, 08:38:06 PMunless the power company COULD produce electric. but simply decided \"nah not today, lets go on vacation instead\" then they are liable. especially if a farmer pre-paid their bill to get power for the month, but didnt receive it. as that's a breach of the service agreementIn some parts of the world, where electricity supply is highly privatised and some of their clients are under insurance the customer may claim damages after all a prepaid customer already load their electricity prepaid meter to serve them for the entire period written in the agreementand power supply in the such region is near 100%/available. The poultry farmer should have made available alternative power sources and the best alternative that is suitable for such business with low cost are solar panels since the poultry doesn't need a lot of electricity because what the birds need is just 💡 ligntening points.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "January 21, 2023, 09:58:32 PM",
      "body": "A poultry farm that purely relay on the light and other things that requires an electricity without any backup plan should be the one to blame for, power outages is normal as they experience problem as well or even with the maintenance. This should not happen if they have generators or starting to invest with the solar power, though if the power outages came from the fault of the provider, I guess it can be valid but I’m sure they are valid reason for outages or else they have to pay for the damages.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "January 21, 2023, 10:21:13 PM",
      "body": "Something similar sort of happened in the USA as well, in Texas and this was last year if I am not wrong. They had such a huge shortage that people would not get electricity at all, and they were trying to use generators and such to keep it going, using gas to keep it running and it was a lot more expensive. Some people got literally 10k+ dollars in electricity bills because they used the very few that was left. All in all, you know what happened? Energy companies made more money from that situation than normal, because they gave less energy and yet charged more so they did alright. It should be a public law that energy companies that sell energy should guarantee running time, if not they should be given some competition so that everyone would have energy from one or the other.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "January 21, 2023, 10:35:03 PM",
      "body": "Quote from: Captain Corporate on January 21, 2023, 10:21:13 PMSomething similar sort of happened in the USA as well, in Texas and this was last year if I am not wrong. They had such a huge shortage that people would not get electricity at all, and they were trying to use generators and such to keep it going, using gas to keep it running and it was a lot more expensive. Some people got literally 10k+ dollars in electricity bills because they used the very few that was left. All in all, you know what happened? Energy companies made more money from that situation than normal, because they gave less energy and yet charged more so they did alright. It should be a public law that energy companies that sell energy should guarantee running time, if not they should be given some competition so that everyone would have energy from one or the other.I remember the U.S. A incident. It was not out for so long as compared to what most countries, in West Africa, go through. The reason so much was spent or lost is due to the over dependance on these power companies. Or should I better say, the confidence they have.What South Africa is facing is same scenario, wherein they have gotten so used to having power and have grown their economy with it, only to run into huge losses once the power is out. I am indeed empathic towards the plight of those who have made some losses. I hope the power company resolves it quickly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Distinctin",
      "created_time": "January 21, 2023, 11:17:41 PM",
      "body": "Quote from: Koadharber on January 21, 2023, 09:41:08 PMQuote from: franky1 on January 21, 2023, 08:38:06 PMif a hospital cant sue an electric company.. a hospital instead realises lives are at risk and invests in a generator back upShouldnt be this as a standard thing? Considering that hospitals does really have those apparatus or machines which do mainly needing up some electricity, which does means that it would reallybe that crucial if there would be some power outages.It is understandable somehow basing on which or what country we are talking into which is really that sad that they cant be ableto produce it out but generator prices to support some back up power wont really be that much a huge expense considering on how an hospitals do makes money.Power outages does really affect lots of businesses which is heavily reliant on power source which i do believe that most of us does really need it. And since it could be a threat on our businesses, then we should always prepare back ups for that like installing a generator or a solar panel in case power outages suddenly happen due to unforeseen bad weather that could cause a great loss from our own business. However, if the power source do it for their own personal reason, then maybe suing the company will certainly be valid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Leviathan.007",
      "created_time": "January 22, 2023, 04:52:13 PM",
      "body": "Quote from: franky1 on January 21, 2023, 08:38:06 PMshould have bought a generator.if a hospital cant sue an electric company.. a hospital instead realises lives are at risk and invests in a generator back upalso poultry farmer should think about he area he set up his farm and its reliance on resources of that areaa farmer of wheat wouldnt set up in the desert after all, where water is not reliableunless the power company COULD produce electric. but simply decided \"nah not today, lets go on vacation instead\" then they are liable. especially if a farmer pre-paid their bill to get power for the month, but didnt receive it. as thats a breach of service agreementI'm not an expert with electricity and these devices but from what I know even if they buy a power generator this will solve any problem because firstly the power generators can consume too much gas and fossil energy which can make is expensive to use and unsafe for the environment in the same time. Instead, I headed most of the hospitals will use the big batteries called UPS, and in some cases and depending on their location they will use Solar panels to decrease power usage for the hospital.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "January 22, 2023, 06:04:42 PM",
      "body": "Quote from: Ojima-ojo on January 21, 2023, 09:28:50 PMThe poultry farmer should have made available alternative power sources and the best alternative that is suitable for such business with low cost are solar panels since the poultry doesn't need a lot of electricity because what the birds need is just 💡 ligntening points. So if a poultry farm only needs lighting, why did those chickens die? Because they were afraid of the dark?The main problem with indoor farming is the temperature, I've just checked the weather in the town where the farm was located and it was over 30C every single day, that means temperature went up by at least 10 more degrees inside there, without power ventilation or the HVAC unit kicking in those chickens probably either died of heat or suffocated because high ammonia levels. With temperatures still hitting 28-29C by the time the sun sets and solar panels are already at half capacity you won't be able to do anything with them.And for the others talking about back-ups and so and so, there were back-ups:QuoteIssues started in mid-December when a faulty transformer prompted Eskom to connect the area to another line, causing voltage damage in his pumps and motors. The backup generators that were powered by Eskom didn't kick in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "January 22, 2023, 06:39:42 PM",
      "body": "Yes, I have a lot of friends that are living in South Africa .. and they have a system called \"Loadshedding\" ...where whole suburbs are shutdown for several times during the day for hours. The Electricity provider (Eskom) are doing this, because they cannot produce enough electricity for the whole country and they want to protect the grid from total collapse. During this time several businesses (big and small) have to run on diesel generators to keep their doors open for business and this is a huge capital expense for those businesses. (The increase expenses are being pushed onto the consumers, because they simply increase their prices to cover those costs.)Many small businesses are forced to close down, because they cannot afford the increase in the expense to run these generators. Cellphone towers cannot charge their backup UPS to provide power to the towers, so you also have communication failures and the batteries in people's house alarms cannot recharge enough to keep people safe) It is a total disaster for South Africa ...and this is caused by bad political leaders and corruption in Eskom. (Syndicates are sabotaging the Coal power plants and mismanagement and theft are everywhere)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "January 22, 2023, 07:32:40 PM",
      "body": "In an industry such as raising poultry in farms, electricity is an important variable because power outages for several hours are enough to kill many of them, let alone days later.Therefore, in my country and many countries, they are required to have a back-up generator that does not work for several hours and solar panels, and I do not think that someone who wants to invest seriously will ignore the provision of a backup energy source, especially in poultry farming that needs constant air conditioning, accurate temperature control and ventilation using large fans .I would sympathize with the story if the government promised to restore electricity at a time and failed to do so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "January 23, 2023, 10:00:06 PM",
      "body": "Lack of steady uninterrupted power supply is like a pandemic diseases that's been suffered by all African countries and non is excused of this situation, it's so embarrassing that even in this contemporary time African leaders still see power supply as challenge to be used as part of election manifesto in every election year, still the situation remains the same.As a businessman it's best you own a power generating set for your business especially when the survival of your business depends on power for it to keep running. For me I'll advise the farmer to rather use the more he would spend in pressing charges and hiring of attorney to purchasing a power generating set so to avoid a reoccurrence of the situation. These electricity distribution companies are just a pain in the neck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Desmong",
      "created_time": "January 23, 2023, 10:52:43 PM",
      "body": "Quote from: Spaceman1000$ on January 21, 2023, 08:10:23 PMPower outages in south Africa has caused the death of over 40000 birds in a poultry farm in south Africa, the farmer recounts his losses as the electricity distribution company refuse to bring power for some days. The farmer said, his ready to press for charges for the damages he has incurred.The situation has really caused him a homogeneous economic loss, sincerely it's really an unfortunate situation.https://www.news24.com/fin24/economy/see-farmer-to-put-r15m-claim-to-eskom-after-tens-of-thousands-of-chickens-killed-20230119This is very unfortunate and I hope this won't happen again because this had really caused a great disaster and I hope the power holding company would compensate the owner of the livestock factory for there loses. This is a great loses and it will cause huge decrease in livestocks making the price to increase. The government need to look and this matter and make sure it will not happen again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "January 24, 2023, 06:44:02 AM",
      "body": "Quote from: Spaceman1000$ on January 21, 2023, 08:10:23 PMPower outages in south Africa has caused the death of over 40000 birds in a poultry farm in south Africa, the farmer recounts his losses as the electricity distribution company refuse to bring power for some days. The farmer said, his ready to press for charges for the damages he has incurred.The situation has really caused him a homogeneous economic loss, sincerely it's really an unfortunate situation.https://www.news24.com/fin24/economy/see-farmer-to-put-r15m-claim-to-eskom-after-tens-of-thousands-of-chickens-killed-20230119This news is very strange to me because we have never had a constant power supply in my country. Sometimes there is no electric supply for months and years. The majority of businesses in my country depend solely on generators and other sources of power. We have had issues when a power outage and the breakdown of generating set caused the death of over sixty babies in incubators in a well-known government hospital. None of the parents took any legal action against the state because the government would always influence court judgments.As regards this case in South Africa, I might not blame the poultry farmer for not having an alternative power source because maybe they have never experienced a power outage for a long time, hence there was no need to own a generator. But this would serve as a lesson to other business owners that relying solely on a particular source for a vital service is not advisable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "January 24, 2023, 07:38:09 AM",
      "body": "Quote from: franky1 on January 21, 2023, 08:38:06 PMshould have bought a generator.Yeah, fuck that farmer for his own goddamn negligence and may the smell of those rotting birds forever be in his nostrils.Uh huh.  Not sure about how big his operation is, but I'm guessing he might not have had enough money to buy a generator big enough to power a poultry farm.  Or, like a lot of people, he just didn't think he'd ever need one until he really needed one.Quote from: Captain Corporate on January 21, 2023, 10:21:13 PMSomething similar sort of happened in the USA as well, in Texas and this was last year if I am not wrong. There have been all kinds of blackouts in the US over the years and for a variety of reasons.  Back in 2000, California was having \"rolling blackouts\" because Enron was manipulating the energy market so hard that they drove up prices to the point where CA just couldn't get enough supply (I may have the details a little bit wrong, but I'm not way off base).  And right now, electricity prices are skyrocketing.  We're being told it's because of the Russia/Ukraine war, but I'm not sure if I buy that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sithara007",
      "created_time": "January 24, 2023, 07:50:23 AM",
      "body": "I saw some of the posts blaming the farmer, but you guys need to understand that this issue was not specific to any one farm. The farm mentioned in the article (the one owned by Herman du Preez, named Lichtenburg Frangipani Boerdery) lost around 50,000 chicken to extreme temperature. The same article mentions that farmers were forced to cull a total of 10 million chicks as a result of power outage. Smaller farms have closed down, and Astral Foods alone suffered damages worth ZAR 138 million in 2022. This is what happens when the same party remains in power for more than three decades.  South Africa needs to look beyond traditional sources for electricity. They are a country of 60 million people and have only one active nuclear power plant (Koeberg). There were plans for new plants, but those were rejected and the country will not see any additional nuclear power capacity before 2030.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "January 24, 2023, 08:33:08 AM",
      "body": "All blame is on the farmer, he should better don't waste his time and resources pressing for charges because he wont win the case if taken to court..He was never serious with his business, because if he was, he would have invest some money in a backup electricity system, it could be a generator of solar system, in the current world we live in, depending on electricity from power holding companies to run a business is a big mistake and one that will only result in loses for the business if the business owner does not find a way to invest in an electricity backup plan.Sorry for his loss, but this should serve as a lesson to him and other like him out there, always have a backup plan for everything including electricity, don't just depend on one source.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "autumnleaf",
      "created_time": "January 24, 2023, 08:57:59 AM",
      "body": "I'm sorry to hear this, however I'm curious as to why he neglected to prepare a generator. You know, given his line of work, he ought to at least plan for unforeseen power outages. Being affected by this power outage or shortage is really difficult and has a significant negative impact on our life and our business. Modern technology requires electricity to function and to allow us to live comfortably.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "January 24, 2023, 09:34:58 AM",
      "body": "That's not an excuse, before the grid power start misbehaving they should have know the situation they are into, a backup generator or diesel would have safe the live of the livestocks instead of relying on grid power, how can poultry lacks backup generator, they say it coming one way or the other and they failed to prepare. It's the owner's fault.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "January 24, 2023, 12:30:19 PM",
      "body": "Quote from: franky1 on January 21, 2023, 08:38:06 PMshould have bought a generator.if a hospital cant sue an electric company.. a hospital instead realises lives are at risk and invests in a generator back upalso poultry farmer should think about he area he set up his farm and its reliance on resources of that areaa farmer of wheat wouldnt set up in the desert after all, where water is not reliableunless the power company COULD produce electric. but simply decided \"nah not today, lets go on vacation instead\" then they are liable. especially if a farmer pre-paid their bill to get power for the month, but didnt receive it. as thats a breach of service agreementThat's wrong. If the farmer is getting electricity from a company then he is paying for the electricity. The same payment goes into the maintenance, salaries and services of the company. If they are producing electricity and distributing it in the area then they are doing it for a business and not out of charity (!)They can not just shut down the plant and stop providing electricity. He has all the rights to sue the company for what they did. There is no such thing that you need to have back ups in farming and shit. If company is having any maintenance issues, some failures then that should be broadcasted to the consumers via proper channel so that it can give the required time for consumer to get settle with back ups.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}