{
  "id": "topic_5443622",
  "title": "paxmao",
  "author": "paxmao",
  "created_time": "March 05, 2023, 11:49:27 PM",
  "content": "Before opinions, a few facts: - The population in Russia is missing the people between 20 and 30 years. They are simply not there:- Life expectancy is around 70 years, compared to nearly 80 average in Europe. In Ukraine is more than 73 BTW.- People leave Russia more than they come. Like a lot more.QuoteNet loss of one person every 30 seconds[19] One net migrant every 4 minutes- Population has been declining steadily since the early 90s. Abortion is sky-high and natality very low. Russians do not want children (or more likely, they cannot afford children).https://www.rand.org/pubs/issue_papers/IP162.html- One of the reasons why some (https://www.ft.com/content/8c576a9c-ba65-4fb1-967a-fc4fa5457c62) argue Russia has a demographic crisis is the mortality in men and the war in Ukraine has made a significant impact on life expectancy of the young.Does this look like a success from the government that claims to \"protect the Russians\"?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5443622",
  "comments": [
    {
      "author": "Macadonian",
      "created_time": "March 06, 2023, 12:20:32 AM",
      "body": "Russia exports most of their resources to other countries for profit and they have harsh winters which do not allow them to grow as much crop as other countries. They have a very big population and it is spread out on 1 of the biggest land masses in the world. The population is declining because it cannot sustain itself and the people are tired of these living conditions and are looking to neighboring countries which do not have these problems.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "March 09, 2023, 07:07:11 PM",
      "body": "Right, all! When Russians leave Russia, it's so that they can start business elsewhere, to improve the motherland by sending funds back home.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "March 10, 2023, 07:16:16 PM",
      "body": "Population is decreasing in most developed nations. One of the potent economic development strategy that most nations adopted was reduction of birth rate. This had made their population to decline greatly and most of them are trying to reverse this trend. Also the rise of abortion right also contributed to this trend. So Russia is not alone in this challenge. The war in Ukraine have affected both the population of Ukraine and Russia. Military mobilization have scared many young people to migrate to other parts of the world. Some of the citizens of both countries don't believe that war is the solution to the crisis, hence they prefer to leave the country than to fight. We cannot also deny that both parties have lost so many young people because of this war which will have a negative effect now and in the future. I think both of them would soon start relying on immigrants from some services.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "March 10, 2023, 09:46:13 PM",
      "body": "But this is not happening in Russia alone, even in countries like Japan, there have been reports of a decline in birth rate while the molarity rate keeps going up (in fact at the moment, it's above the birth rate)Japan has not been in a war, so why is the population declining?Japan’s Population Crisis Nears Point of No Return",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "March 11, 2023, 01:39:26 AM",
      "body": "Perhaps, it also has something to do with the drug abuse epidemic that has been going on in Russia since some years ago.In general, it is about the opioids that get into the south of Russia from middle east (Afghanistan). We cannot argue that the consumption of those drugs definitively shorten the lifespan of those who are addicted to them.I watched a documentary film about it, it is on YouTube. If you all have some time, you should check it out.https://www.youtube.com/watch?v=JsUH8llvTZo",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}