{
  "id": "topic_5469516",
  "title": "krishnaverma",
  "author": "krishnaverma",
  "created_time": "October 07, 2023, 09:01:19 AM",
  "content": "Sourcehttps://cryptotale.org/bitcoin-whales-accumulate-71155-btc-in-6-weeks-nearing-all-time-high/They have accumulated 71555 btc in less than 6 weeks. Is this a sign of coming bull run now ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469516",
  "comments": [
    {
      "author": "Odohu",
      "created_time": "October 07, 2023, 09:11:59 AM",
      "body": "Quote from: krishnaverma on October 07, 2023, 09:01:19 AMSourcehttps://cryptotale.org/bitcoin-whales-accumulate-71155-btc-in-6-weeks-nearing-all-time-high/They have accumulated 71555 btc in less than 6 weeks. Is this a sign of coming bull run now ? Anyone who have been following will understand that now is the best time to buy. So, I am not surprised seeing that many people are taking advantage of the low price of Bitcoin now. Before the end of this year, I don't think we will see the price as low as it is now. Mt.Gox refund is the only one huddle left to overcome before we see all positive news for Bitcoin.Anyone still doubting will have to rethink because next year is filled with so much positive news for Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "krishnaverma",
      "created_time": "October 07, 2023, 09:16:08 AM",
      "body": "Quote from: Odohu on October 07, 2023, 09:11:59 AMQuote from: krishnaverma on October 07, 2023, 09:01:19 AMSourcehttps://cryptotale.org/bitcoin-whales-accumulate-71155-btc-in-6-weeks-nearing-all-time-high/They have accumulated 71555 btc in less than 6 weeks. Is this a sign of coming bull run now ? Anyone who have been following will understand that now is the best time to buy. So, I am not surprised seeing that many people are taking advantage of the low price of Bitcoin now. Before the end of this year, I don't think we will see the price as low as it is now. Mt.Gox refund is the only one huddle left to overcome before we see all positive news for Bitcoin.Anyone still doubting will have to rethink because next year is filled with so much positive news for Bitcoin.  Whales are showing confidence and it translates to good time for crypto most of the times.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "October 07, 2023, 09:33:43 AM",
      "body": "Flashback to few months ago, there was a whale sold his Bitcoins which he hold since 2017, it's a sign of bear market? look, is Bitcoin price keep declining since that news? nope. There's no correlation if a whale bought a lot Bitcoins, it has been predicted bull run will happen because of Bitcoin halving, not because of the whales.https://crypto.news/ancient-bitcoin-whale-sells-all-his-coins-amounting-to-10-6m-profit/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "October 07, 2023, 09:44:35 AM",
      "body": "Quote from: krishnaverma on October 07, 2023, 09:01:19 AMSourcehttps://cryptotale.org/bitcoin-whales-accumulate-71155-btc-in-6-weeks-nearing-all-time-high/They have accumulated 71555 btc in less than 6 weeks. Is this a sign of coming bull run now ?  Probably they're just buying because they have the means to. These whales will want to dominate the market ad much as possible and i will not tie their action as a sign of the next bull run. Sheesh, the Bitcoin halving event is like a prophecy that's bound to be fulfilled and just like @Odohu pointed, any investor who believes in the prospects Bitcoin holds will want to take advantage of the low price now. I mean,who would want to miss out on the Bitcoin train?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "October 07, 2023, 09:57:20 AM",
      "body": "Quote from: krishnaverma on October 07, 2023, 09:01:19 AMThey have accumulated 71555 btc in less than 6 weeks. Is this a sign of coming bull run now ? Some people will be waiting, thinking the price of bitcoin may fall. Even if bitcoin fall to $20000, those kind of people may still be waiting for the price to fall to $15000. It is better to buy now becuase bitcoin is going all-time-high. And bitcoin halving is getting closer everyday. You know what bitcoin halving is and how people are sentimental and buying bitcoin after halving which later lead to skyrocketed price. I do not think this is bull run for now, the price of bitcoin may still fall or not. But with doubts like this, it is good to DCA.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TakeItEasy",
      "created_time": "October 07, 2023, 10:40:59 AM",
      "body": "Quote from: krishnaverma on October 07, 2023, 09:01:19 AMSourcehttps://cryptotale.org/bitcoin-whales-accumulate-71155-btc-in-6-weeks-nearing-all-time-high/They have accumulated 71555 btc in less than 6 weeks. Is this a sign of coming bull run now ? I hope that will be the better news for the bitcoin holders, A long time ago there was a bull run, and everyone is waiting for the bull run to take part in their best trading pairs. From this news, a way to buy the bitcoin at this stage, because it is very low now. Probably by the end of the year 2024, it will cross $50k again, as it was before. So, that would be a positive sign for the bitcoin, and for a bull run to come. And also many traders are still waiting for bitcoin to go below $18k and then they want to buy it, I don't even think it will go below $20k again, as this is crypto so we can assume everything can happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "October 07, 2023, 11:18:11 AM",
      "body": "I still don't buy into this whole crypto whale narrative. These are different Bitcoin addresses that may belong to all sorts of entities, right? Maybe it's major companies relocating funds into cold wallets, maybe it's some companies trying to reorganize their finances. Some of them can belong to individuals, sure, but that doesn't mean to me that there's actually any consolidation between major holders, that 'whales' act for similar reasons and have similar intentions. I really think it doesn't mean anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "October 07, 2023, 11:26:58 AM",
      "body": "Quote from: krishnaverma on October 07, 2023, 09:01:19 AMSourcehttps://cryptotale.org/bitcoin-whales-accumulate-71155-btc-in-6-weeks-nearing-all-time-high/They have accumulated 71555 btc in less than 6 weeks. Is this a sign of coming bull run now ? No that doesn't indicate anything, they are just buying then hope for the best on their investment and they announce it  to create hype since it will be beneficial to them if more people will look forward on actions they do and they even want to make you feel like bull run is coming so that they can take their position and be the first to sell when there huge movement will happen.Remember that next year is halving season so I guess on that time we should prepare since we might fall unto manipulators trap if we believe on early manipulation made by them. But if you know how to deal with the risk then its good to ride with the flow they made but we need to follow the updates so that we will not left behind if suddenly they announce that they dump it or manipulate the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Texac",
      "created_time": "October 07, 2023, 11:40:28 AM",
      "body": "Quote from: Odohu on October 07, 2023, 09:11:59 AMMt.Gox refund is the only one huddle left to overcome before we see all positive news for Bitcoin. You must have missed the news from Mt.gox, in their most recent announcement they continued to delay compensation to victims for another year.  this means we will have new announcements from Mt.gox from September 2024, so there will be nothing to fix here.  but I believe that even if they compensated everyone, those bitcoins would not have any serious impact on the market.  because as OP mentioned, many people are quietly buying large amounts of bitcoin during this time so if someone sells cheap bitcoins there will always be buyers regardless of quantity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "October 07, 2023, 11:58:37 AM",
      "body": "Quote from: krishnaverma on October 07, 2023, 09:16:08 AMWhales are showing confidence and it translates to good time for crypto most of the times. the whales may be preparing for the Bitcoin halving. or they really have experience in the previous moment and they want to repeat it again.Bitcoin price movements may not be too big with this news. In fact, we still see this happening regularly. not an event that quickly created a pump in the market.what happens if they end up selling fast when Bitcoin makes a pump in a short time? in large quantities maybe it will affect market prices, but it won't take too long for prices to improve.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "October 07, 2023, 12:17:20 PM",
      "body": "for those unsure of the maths (using todays numbers, not the articles dates numbers)[10 - 100)   4,460,738 BTC   [100 - 1,000) 3,877,099 BTC   [1,000 - 10,000) 4,696,672 BTC   $131,371,471,600[10,000 - 100,000) 2,271,469 BTCtotalling up these amounts gets to ~15.3m btc hoarded in \"whale addresses\"and they are saying this number is XXk more coins than 6 weeks agohowever this does not mean whales are privately hoarding in their own addresses it also means equally that lots of users of small amounts deposited funds into exchange hotwallets where users are about to sellso in short the stats are meaningless.. it can equally mean:whales are privately hoarding away from exchanges to not sell meaning less exchange supplyor users have deposited into exchanges(exchanges are treated as whales too) where users are ready to sellif the stats showed that many small sub 10btc addresses had more addresses, then it shows many new users buying small amounts are then withdrawing from exchanges, thus diluting exchange supplyhowever by funds collating and accumilating more into large lumps above 10btc allotments, it \"could\" be a sign that many exchange deposits are happening ready to sellthe stats are meaningless because they 15.3m coins which they say has risen over 6weeks by xxk coins.. has alot of exchange wallets included, its not really a list of holdings totals of just non-exchange addresses",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "October 07, 2023, 12:46:05 PM",
      "body": "Quote from: kryptqnick on October 07, 2023, 11:18:11 AMI still don't buy into this whole crypto whale narrative. These are different Bitcoin addresses that may belong to all sorts of entities, right? Maybe it's major companies relocating funds into cold wallets, maybe it's some companies trying to reorganize their finances. Some of them can belong to individuals, sure, but that doesn't mean to me that there's actually any consolidation between major holders, that 'whales' act for similar reasons and have similar intentions. I really think it doesn't mean anything.Possible and whoever started this whole narrative about whales accumulating, sending, receiving, and selling Bitcoin in bulk, they always get to track them without even verifying if they've sold because it's hard to verify it even if it ends up on an exchange wallet. The thing with that is they'll just speculate that those balances are about to be sold. And with these \"whales\" accumulating or having more Bitcoin, the closest one that we can think of doing it are the none other than but exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "October 07, 2023, 12:49:35 PM",
      "body": "Quote from: tabas on October 07, 2023, 12:46:05 PMQuote from: kryptqnick on October 07, 2023, 11:18:11 AMI still don't buy into this whole crypto whale narrative. These are different Bitcoin addresses that may belong to all sorts of entities, right? Maybe it's major companies relocating funds into cold wallets, maybe it's some companies trying to reorganize their finances. Some of them can belong to individuals, sure, but that doesn't mean to me that there's actually any consolidation between major holders, that 'whales' act for similar reasons and have similar intentions. I really think it doesn't mean anything.Possible and whoever started this whole narrative about whales accumulating, sending, receiving, and selling Bitcoin in bulk, they always get to track them without even verifying if they've sold because it's hard to verify it even if it ends up on an exchange wallet. The thing with that is they'll just speculate that those balances are about to be sold. And with these \"whales\" accumulating or having more Bitcoin, the closest one that we can think of doing it are the none other than but exchanges.also to note when people deposit BTC into an exchange. it doesnt mean they will sell for fiat to cause a price change of bitcoin price. they may trade it for a altcoin, meaning not touching the btc-usd market order list",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "October 07, 2023, 01:13:22 PM",
      "body": "This is not the first time that we have heard such news about whales buying huge amount of bitcoin within a short period of time. The address might belong to an institution of an individual, nobody knows. From what I understand, I believe that the person is taking advantage of the market now that the prices is 27k+ to buy as much as he can, so that he can prepare for the next bull run because the halving is in the next 6 months and some days. I believe that this is the best time to buy now that bitcoin is in its consolidation price, and that is why whales are taking advantage of the market to stack up their bags. It might be that the person might not even sell those coins during the next bull run but just might be using bitcoin as a store of value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "October 07, 2023, 01:17:03 PM",
      "body": "Reminder: Bitcoin whales are people with huge amounts of money, they're not people who have magic crystal balls. You people really need to stop over-glorifying whales as if they never get things wrong from time to time and that they have total control over markets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "October 07, 2023, 01:20:37 PM",
      "body": "Quote from: Odohu on October 07, 2023, 09:11:59 AMAnyone who have been following will understand that now is the best time to buyActually, the best time to buy was yesterday. Now it's the second best time. But there is one thing about the news that I don't understand. It talks about \"wallets\".QuoteIn the fast-paced world of cryptocurrency, Bitcoin’s mid to large-sized wallets made headlines as they embarked on a relentless accumulation spree. QuoteThis accumulation surge brought these select wallets within striking distance of their previous record of 15.29 million BTC, a milestone reached back in November 2021. I don't know if the people who use these wallets reuse addresses or how they can identify that several addresses belong to the same wallet, because if I receive bitcoins and in each transaction I create a different address they will not be able to know that they are part of the same wallet. Or maybe they mean \"addresses\" when they talk about wallets, and people reuse them as we do when we receive payments from signature campaigns.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "October 07, 2023, 01:27:37 PM",
      "body": "Quote from: mk4 on October 07, 2023, 01:17:03 PMReminder: Bitcoin whales are people with huge amounts of money, they're not people who have magic crystal balls. You people really need to stop over-glorifying whales as if they never get things wrong from time to time and that they have total control over markets.Bitcoin whales can do their games and manipulations but they can succeed or fail because they are Bitcoin whales and are almost nothing in other aspects of society, nation and the globe. Their manipulations will be affected by governments, central banks and many issues from geo-politics, global financial, economic status.Bitcoin whales even have to fearful that their manipulations will fail but they are long term so if they fail this year, next year, they will sit back, relax and come back with new manipulative strategies. They are well but speculators will have more difficulties to keep their capital safely when their speculation is not like how market actually moves.Bitcoin whales have many different plans, A, B, C or more but speculators usually only have plan A.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lorence.xD",
      "created_time": "October 07, 2023, 01:53:43 PM",
      "body": "Quote from: Oshosondy on October 07, 2023, 09:57:20 AMQuote from: krishnaverma on October 07, 2023, 09:01:19 AMThey have accumulated 71555 btc in less than 6 weeks. Is this a sign of coming bull run now ? Some people will be waiting, thinking the price of bitcoin may fall. Even if bitcoin fall to $20000, those kind of people may still be waiting for the price to fall to $15000. It is better to buy now becuase bitcoin is going all-time-high. And bitcoin halving is getting closer everyday. You know what bitcoin halving is and how people are sentimental and buying bitcoin after halving which later lead to skyrocketed price. I do not think this is bull run for now, the price of bitcoin may still fall or not. But with doubts like this, it is good to DCA.It's possible for Bitcoin to reach below $20,000 this year, so there's nothing wrong if some people are patient enough for Bitcoin's price to drop. But due to Bitcoin's volatility and unexpected price, it would be better to secure and accumulate Bitcoin as soon as possible so you wouldn't miss the upcoming halving. But from OP's post it seems like it's just a normal transaction made by a whale or group so there's no need to fear of missing out. Safest thing to do if you're confuse in this time is to stick with DCA method. Just double check the sources of the information cause sometimes it's fake to cause fomo to people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_Hiloveua_",
      "created_time": "October 07, 2023, 02:17:25 PM",
      "body": "Quote from: krishnaverma on October 07, 2023, 09:01:19 AMSourcehttps://cryptotale.org/bitcoin-whales-accumulate-71155-btc-in-6-weeks-nearing-all-time-high/They have accumulated 71555 btc in less than 6 weeks. Is this a sign of coming bull run now ? I believe there is no time to waste now. Because we are in the best time to invest in Bitcoin. I am investing about 70 percent of my fund in Bitcoin. And the remaining 30 percent invested in other altcoins. I hope my investment will not turn into a loss. If you want to understand the future of Bitcoin, you see two reasons.1. Bitcoin halving.2. 2024 - 2025 bull run.You can invest in Bitcoin for bull run. Then you can profitI think during the bull run, the price will cross the highs. However, investment companies and big investors are already filling their bags, investing heavily. You can invest now if you want.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}