{
  "id": "topic_5459145",
  "title": "Rocou",
  "author": "Rocou",
  "created_time": "July 07, 2023, 08:25:45 AM",
  "content": "Quote from: oscar2000 on July 06, 2023, 05:21:48 PMque veut dire une baisse du niveau de vie du français moyen de 40 % en 20 ans ? imaginez que le niveau des prix reste stable en france et que les revenus des français baisse de 40 %.ou alors, ce qui revient au même, les revenus des français restent stable mais le niveaux des prix de tout ce que l'on achète augmente de 66 %.certainement que le scénario le plus probable serait une hausse des revenus de 20 % et de 100 % des prix de ce qu'on achète.Le pire c'est que les français s'imaginent qu'une telle baisse de pouvoir d'achat signifie: \"manger de la viande une fois par semaine plutôt que tous les jours, c'est pas la mort\"Alors qu'en réalité c'est une effondrement de tout ce que nous connaissons. Un incroyable régression de la médecine, par exemple. Terminé les IRM, rationnement des radios, interdiction des traitements les plus chers (c'est déjà le cas, les nouveaux médocs les plus performants arrivent en France avec 1 à 2 ans de retard sur l'Allemagne).C'est également un écroulement du niveau des retraites; les français vont goûter à la dolce vita des retraites russes.  C'est un entassement de 3 à 4 familles dans le même appartement (en ruine).C'est une multiplication des traffics et des bandes de pilleurs, des agressions, etc.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459145",
  "comments": [
    {
      "author": "patrickus",
      "created_time": "July 08, 2023, 11:10:05 AM",
      "body": "Il parait que les gens qui reviennent en France aprés un long séjour à l'étranger perçoivent immédiatement, dés la sortie de l'avion, la baisse du niveau de vie des français: gens mal habillés, voitures mal entretenues, mines renfrognées (sans compter tous les mendiants roms professionels venus de Roumanie grâce à l'UE, les roumains trop contents de s'en débarasser enfin).Et je confirme que le délabrement du système de santé en est l'une des manifestations les plus spectaculaires: l'ensemble du territoire, y compris les grandes villes, est en train de devenir un désert médical. Et le site Doctolib (que je hais) n'améliore pas la situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rocou",
      "created_time": "July 08, 2023, 01:48:48 PM",
      "body": "Quote from: patrickus on July 08, 2023, 11:10:05 AMEt le site Doctolib (que je hais) n'améliore pas la situation.Je ne comprends pas. Ce site et ses concurrents offrent de grands services et permettent de lisser les différences du nombre de consultations disponibles selon les régions (ie: luttent contre les déserts médicaux).En Suisse ça fonctionne vraiement très bien; c'est très pratique.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "patrickus",
      "created_time": "July 08, 2023, 02:54:30 PM",
      "body": "En Suisse peut-être. Mais en France, j'ai l'impression que l'on dit aux français: \"ok votre système de santé se déteriore mais en compensation, on vous donne doctolib alors estimez vous heureux.\"(sans compter le jour où les informations médicales personnelles seront révélées suite à un hack)Un peu comme quand pour faire face à un problème de société, Macron fournit un numéro vert.Ces gadgets techniques ne compensent pas les problèmes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LeGaulois",
      "created_time": "July 08, 2023, 10:50:16 PM",
      "body": "Disons que c'est pratique pour ne pas avoir à passer 15 coups de téléphone pour trouver un médecin/spécialiste.En attendant...... Parce que bon, le but premier est d'en avoir un près de chez soi et ca doctolib ne fera pas venir de médecins ou ne changera pas le numerus clausus....Dernier RDV chez le dentiste: 6 mois d'attenteDernier RDV chez l'ophtalmo: 15 mois pour en trouver un (l'ancien étant parti à la retraite)J'ai lu que la Suisse est aussi confrontée à une pénurie de médecins, etc. C'est rassurant, presque, de se dire qu'on n'est pas les seuls.Quote from: patrickus on July 08, 2023, 11:10:05 AM gens mal habillés.Je me suis fais cette même reflexion il y a quelque temps.La classe à la Francaise grand remplacée",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Joan of Arc official",
      "created_time": "July 09, 2023, 03:02:41 PM",
      "body": "Et les noirs et les arabes qui viennent pour profiter gratuitement du systeme de santé dans notre pays, alors meme qu' un francais sur 4 n'arrive pas à se soigner, faute de moyenFaut le dire ca.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Danydee",
      "created_time": "July 10, 2023, 01:24:41 AM",
      "body": "Quote from: Joan of Arc official on July 09, 2023, 03:02:41 PMEt les noirs et les arabes qui viennent pour profiter gratuitement du systeme de santé dans notre pays, alors meme qu' un francais sur 4 n'arrive pas à se soigner, faute de moyenFaut le dire ca.Oui pour le dire, il faut le dire!....  Comment ça, le système de santé il est pas gratuit ? Faut comprendre un peu ??",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}