{
  "id": "topic_5453310",
  "title": "bonfire66",
  "author": "bonfire66",
  "created_time": "May 19, 2023, 03:05:54 PM",
  "content": "Хочу в очередной раз напомнить, с чего все когда-то началось. Хотя… это все не так. Началось совсем с другого. ОК, я хочу напомнить только один из фрагментов международных отношений России и Остального Мира. Про Самолеты.    Как не прискорбно будет упомянуть, но примерно 60-70% самолетов в Росси еще до 24 февраля 2022 года были Ирландскими. А отнюдь не Российскими. Были в Лизинге. А не были выкуплены авиакомпаниями типа Аэрофлот или Победа или Россия. То есть, российские авиакомпании просто пользовались ЧУЖИМИ самолетами.    А что произошло потом? А потом ирландцы, владельцы лизинга, потребовали вернуть самолеты взад. Потому что так им захотелось. Потому что самолеты аэрофлота – они, юридически, не российские, а ирландские, в своей массе. Я тут пишу чисто примерно, по-памяти, без подробностей. И что сказали российские авиакомпании в ответ на законное требование вернуть НЕ ПРИНАДЛЕЖАЩИЕ им самолеты? Правильно, они послали ирландцев нафиг. «Самолеты не отдадим».    И что в таком случае делать международному сообществу? В ответ на вопиющее нарушение всех международных норм и законов? В ответ на явное и открытое воровство? Вот допустим, вы взяли машину в прокат. Покатались на ней сколько  нужно. А вернуть отказались. Типа «идите нафиг, машина моя, я, что хочу с ней, то и делаю. Где хочу, там на ней и катаюсь». Тут произошло примерно то же самое.   Вот примерно так все 14 месяцев назад и произошло. Не нужно путать причину и следствие. Сначала СВО, а потом – самолеты. Впрочем – это даже тут и вообще не важно. Самолеты – они НЕ РОССИЙСКИЕ. Они – Ирландские! Запомните это!   Россия УКРАЛА ирландские самолеты. Просто и легко. Потому что – смогла. И сраный Западный мир до сих пор ничего реально не смог противопоставить этому ВОРОВСТВУ. Потому что т.н. Западный мир – это просто аморфная полужидкая (почти как гавно) субстанция, которая только и может, как выражать неодобрение и порицание. А вот бахнуть ядерными зарядами по провинившийся стороне – почему-то нет. Боится. А вот Россия – не боится!   Россия, своровавшая десятки чужих самолетов, продолжает практически ежедневно угрожать Западу возмездием. За что? За то, что она – СВОРОВАЛА, а Запад – он обосрался и ничего взамен не возразил асимметрично. Все как обычно. История уже в который раз идет обратно на свой порочный круг и ни разу не учится на ошибках прошлого. Увы… это было, и это есть. Обидно! Печально! Ну ладно…",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453310",
  "comments": []
}