{
  "id": "topic_5477779",
  "title": "shark32",
  "author": "shark32",
  "created_time": "December 13, 2023, 09:37:36 PM",
  "content": "I'm looking to sell 1.5 BTC for physical cash in Kolkata, India.If anyone is interested, please notify me. Thanks.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477779",
  "comments": [
    {
      "author": "Husires",
      "created_time": "December 14, 2023, 08:17:43 AM",
      "body": "Move the topic to India local board and will find more interest. if you divide the total amount into smaller amounts, such as $1,000, you will definitely find buyers because everyone believes that the price of Bitcoin will increase and will inevitably want to buy more, especially if you offer a 1% to 5% discount and you can make several deals on the same day.local board link https://bitcointalk.org/index.php?board=89.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hellteamvik",
      "created_time": "December 14, 2023, 12:41:30 PM",
      "body": "ready to buy your bitcoinsmy telegram @scarlettlondon",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "December 15, 2023, 03:43:52 PM",
      "body": "Your account is a pretty old one and it woke up after a long time of inactivity.Before this you were someone located in Germany. How come now you are in India? That too selling a load of 1.5 BTC which is no joke amount at all as far as INR is concerned.A lot of red flags to consider here in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "December 16, 2023, 03:25:37 AM",
      "body": "Quote from: TheUltraElite on December 15, 2023, 03:43:52 PMBefore this you were someone located in Germany. How come now you are in India? That too selling a load of 1.5 BTC which is no joke amount at all as far as INR is concerned.A lot of red flags to consider here in my opinion. Good note, I don’t know why he decided to post using this account because it seems to be an old but useless account, but the amount is large and it is better to be careful when making a deal with this person. I do not want the amount of 60k to be huge in India, but it is definitely not small.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tenakha",
      "created_time": "December 19, 2023, 02:56:24 PM",
      "body": "Quote from: shark32 on December 13, 2023, 09:37:36 PMI'm looking to sell 1.5 BTC for physical cash in Kolkata, India.If anyone is interested, please notify me. Thanks.Can send you cash via Ria or MoneyGram. PM if interested.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}