{
  "id": "topic_5417524",
  "title": "DdmrDdmr",
  "author": "DdmrDdmr",
  "created_time": "October 18, 2022, 09:34:48 AM",
  "content": "La pieza que será liberada en breve en UK es de caza mayor, siendo un criminal relacionado con dirigir redes de narco, y llevando ya un largo periodo en la cárcel, donde entró por última vez en el 2009.Su próxima liberación, no obstante, está sujeta a condiciones, entre las cuales figura la prohibición de usar bitcoin (y otras criptomonedas según citan otros medios). De alguna manera, esto envía el mensaje a la sociedad de que bitcoin puede ser usado por el crimen organizado para los cobros/pagos de sus fechorías, algo que es innegable, pero denota presuponer que sería utilizado para tales fines.También el titular puede ser un tanto capcioso: La SCPO (Serious Crime Prevention Order) contra Curtis Warren no la he visto, y seguramente hay bastantes más restricciones financieras. He leído en algún otro medio que deberá declarar cualquier acción por encima de 1K libras esterlinas, por lo que, y como es lógico, también hay restricciones en el ámbito fiat.Podría por tanto, ser que las condiciones de la SCPO abarcan un espectro potencial amplio, y en este sentido, se cubra las espaldas sobre los ámbitos cripto y fiat.Por otro lado, ya le pueden prohibir, que seguro que se nos ocurren maneras de pasarse la prohibición por el Arco de Triunfo.https://bitcoinist.com/uk-court-bans-britains-pablo-escobar-from-using-whatsapp-and-bitcoin/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417524",
  "comments": [
    {
      "author": "Don Pedro Dinero",
      "created_time": "October 18, 2022, 10:16:27 AM",
      "body": "Yo me pongo de los nervios con esto. Espero que sea una exageración del titular más que una verdad de la sentencia en si, pero todo indica que la sentencia le prohibe de verdad usar bitcoin. Espero que le prohiba también explícitamente usar armas, o drogas, ¿no? ¿Y dinero fiat?Está claro que al poder establecido no le gusta el bitcoin, y hará lo posible para darle una imagen de marginalidad y criminalidad. Por otra parte, es como ponerle puertas al campo, pues si quiere conseguir bitcoin en exchanges descentralizados, P2P o en este mismo foro, lo va a hacer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "October 18, 2022, 07:25:52 PM",
      "body": "Quote from: Don Pedro Dinero on October 18, 2022, 10:16:27 AMPor otra parte, es como ponerle puertas al campo, pues si quiere conseguir bitcoin en exchanges descentralizados, P2P o en este mismo foro, lo va a hacer.Y este es el verdadero dilema, como pueden garantizar que una persona no utilizará bitcoins nunca mas? Es tan simple como conseguir un presta-nombres que haga las transacciones por el o utilizar VPS para adquirirlos de forma anónima.Aun que el criminal sea baneado de usar ciertas tecnologías no creo que esto lo detenga para seguir cometiendo crímenes en un futuro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darxiaomi",
      "created_time": "October 20, 2022, 02:23:46 PM",
      "body": "Todas estas cosas en realidad tambien existen en lo cotidiano, es una forma estupida que tiene la justicia de la mayoria de los paises occidentales de intentar quedar bien con dios y con el diablo. Me explico con un ejemplo.Aca en Argentina por ejemplo, en cuanto a los accidentes de transito la ley es bastante mala, ya que se escribio en su momento vista desde la buena voluntad, por ende la pena maxima que uno puede recibir es de 3 años de carcel. Un monto muchas veces irrisorio cuando hablamos de accidentes donde murieron personas.Entonces que hace la justicia berreta, da los 3 años maximos que ampara la ley y suma la inhabilitacion de por vida para poder manejar. Que es algo que no contenta a nadie, pero en la gimnasia mental de los juristas es la panacea, ya que evitan encerrar a una persona , la \"resociabilizan\" como dirian ellos y a la vez en sus mentes creen que es una pena enorme. La persona seguira manejando pero sin carnet como ya ha pasado.Creo que aca sucede algo similar, es para mostrar a los que no saben mucho, ven que hacemos algo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "October 20, 2022, 03:26:40 PM",
      "body": "Esto me recuerda esas películas sobre un futuro distópico en el cual el brazo de la Ley ha obtenido una forma de arrestar a los criminales antes de que cometan los crímenes, y de allí se desarrolla el dilema moral de la trama.  Aunque no sea el mismo caso aquí, porque este es un criminal completamente comprobado, supuestamente.Lo de no poder utilizar Bitcoin y otros cripto activos es de esperarse supongo, así como otras restricciones mencionadas, se trata de intercambiar derechos a cambio de la libración de la prisión, lo importante es que las personas que nunca hemos tenido la intención de lavar dinero, cometer crímenes de cualquier tipo o negociar con sustanciar prohibidas nos tengamos que preocupar por eso. Las decisiones financieras personales o la privacidad no son un crimen.Al final, si un país reconoce empresas como exchanges dentro de su territorio y entrega licencias a los mismos, eso implica que reconocen a los activos comerciados como medios de transmisión de valor efectivos y al igual que las transacciones FIAT, se restringen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}