{
  "id": "topic_5426578",
  "title": "oolalula",
  "author": "oolalula",
  "created_time": "December 07, 2022, 05:06:22 PM",
  "content": "Всем привет. Недавно был запущен коин UAHT, представляющий собой криптогривну. Несмотря на неплохую техническую организацию этой моенты, которая уже попала в листинг, с точки зрения нашей команды, этот токен не взлетит. По нескольким простым причинам - он никому не нужен (т.е. неверно выбрана целевая аудитория), у токена проблемы с обеспечением (он хоть и стейбл, только по факту совсем не стейбл) и токен противоречит законодательству Украины (увы). Тем не менее, история это хорошая и правильная. Наша команда знает как сделать такой же стейблкоин, с некоторыми нетехническими отличиями, а именно:- токен не будет противоречить действующему законодательству (даже не смотря на отсутствие Криптозакона, который в настоящее время в Украине не является действующим)- мы разработали механизм гарантий, который превращает фиатную гривну в 100% неприкосновенный актив, который нельзя будет украсть из системы, и который будет действительно обеспечивать токен по курсу 1-1. - этот токен будет ориентирован на правильную целевую аудиторию, что позволит токену взлететь в достаточно сжатые сроки. Более того, эта модель уже протестирована на целевой аудитории и отзывы более чем положительные. Самое главное - спрос на этот токен реально есть, но не в случае с конкурирующим проектом.Существует также еще один конкурирующий проект UAX. По разным причинам этот токен заглох и в настоящее время не видно, чтобы Куна каким-то образом адаптировала свою криптогривну к реально целевой аудитории. Мы обоснованно подозреваем, что у UAX и UAHT одна и та же проблема, а именно - выбор неправильной целевой аудитории. Наша команда состоит преимущественно из финансистов, банкиров и юристов. Поэтому для технической реализации этого стартапа мы бы хотели привлечь программистов, которые бы сделали этот проект совместно с нами. Наша зона ответственности - система юридических договоров, делающих это возможным, гарантии неприкосновенности фиатных средств (такие гарантии, которые будут более чем приемлемы для целевой аудитории), бухгалтерия, юридическая бизнес структура, законное движение фиатных средств между всеми участниками, а также самое главное - привлечение большого количества новых пользователей в сжатые сроки. Зона ответственности команды - техническая реализация проекта, запуск, поддержка, довороты нових фишек. В перспективе, проект может стать глобальным, т.к. может обслуживать интересы не только украинских клиентов. Обратная связь с нашей стороны - оставляйте ваш телеграм, мы свяжемся. P.S. C орками не работаем. Остальным - добро пожаловать.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5426578",
  "comments": [
    {
      "author": "echogomodrill",
      "created_time": "December 08, 2022, 06:24:18 AM",
      "body": "осталось доказать, что вы не соскамитесь как создатель луны, не сбежите и честно будете показывать каждый день счет в банке для поддержки курса, но чтобы токен кого то заинтересовал, нужно чтобы на максах его можно было продать без задержек, потом легко перевести в юсд и незаметно исчезнуть в джунглях европейск-американских банках",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "oolalula",
      "created_time": "December 08, 2022, 10:50:18 AMLast edit: December 08, 2022, 12:44:06 PM by Xal0lex",
      "body": "Quote from: echogomodrill on December 08, 2022, 06:24:18 AMосталось доказать, что вы не соскамитесь как создатель луны, не сбежите и честно будете показывать каждый день счет в банке для поддержки курса, но чтобы токен кого то заинтересовал, нужно чтобы на максах его можно было продать без задержек, потом легко перевести в юсд и незаметно исчезнуть в джунглях европейск-американских банкахна 100% с вами согласен. с несколькими уточнениями. 1. в основу проекта положен принцип - Legality, Liquidity, Security. как я написал выше - проект полностью лежит в правовом поле (Legality), разработанный механизм гарантий на 100% защищает токен фиатным обеспечением (Security), что касается последнего принципа ликвидности (Liquidity) - мы можем гарантировать обеспечение токена по курсу 1-1 к фиатной валюте, а курс между токеном и юсдт определит рынок. это, кстати, будет интересно понаблюдать с точки зрения курсов, установленных национальным регулятором для гривны и ЕЦБ. подозреваю, что курс будет хуже, чем у НБУ, но лучше чем в европейских банках. в итоге получится некое медианное значение. но рынок покажет.исходя из вышесказанного, доказывать мы это будем уже широкой общественности после запуска проекта. и, если честно, эти доказательства не потребуют очень больших усилий. 2. в выбранной модели сбегать будет бессмысленно ) либо мы сбежим без денег, либо мы не сбежим )) 3. мы не просто будем показывать счет в банке, мы обяжем банк предоставлять эту информацию всем желающим по требованию. не зависимо от нашего желания или нежелания.4. что до продажи токена и перевода в юсдт, повторяю - это вопрос к рынку. мы можем гарантировать обеспечение. следовательно, ликвидность токена - это некое соглашение между продавцом и покупателем по курсу, который устроит обе стороны. до тех пор, пока в природе существует фиатная валюта, обеспечивающая токен, токен является таким же ликвидным, как и фиатная валюта. превращать его в средство платежа или не превращать - решат поставщики товара/услуг и покупатели. 5. после принятия пэтриот акт никто не может исчезнуть бесследно в джунглях европейских и американских банков. для всех, кто со мной связывался, но так и не осилил первый же вопрос - пожалуйста, не присылайте предложений о сотрудничестве, если вам стыдно сказать в какой стране вы находитесь территориально. чистоплотность имеет значение. с панамой, северной кореей, кубой и другими подсанкционными юрисдикциями, спонсирующими терроризм, не работаю )",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "internetional",
      "created_time": "December 09, 2022, 08:11:38 AM",
      "body": "oolalula, наверное, Вы не для обсуждения здесь написали, а для поиска разработчиков. Но я вижу, что на обсуждение Вы тоже откликаетесь, поэтому задам вопрос, который меня очень интересует.Вот Вы написали: Legality, Liquidity, Security. Говоря о ликвидности, Вы уводите вопрос в сторону обеспечения. Но, например, для меня ликвидность - это не обеспечение, а возможность в любой момент обменять токены на то, что их обеспечивает. Как можно дать такие гарантии в современном мире, если ни один банк не даёт гарантию того, что его клиенты смогут в любой момент получить гривны со своих счетов? Восемь месяцев назад ПриватБанк закрыл мне доступ к моим деньгам на моём счёте из-за моего российского паспорта. Ещё через восемь месяцев любой другой банк может точно так же эмитенту стейблкоина закрыть доступ к деньгам на счёте проекта, и тогда ни о какой ликвидности речи не будет.   Именно в этом я вижу основную проблему стейблкоинов с фиатным обеспечением. Может быть, у Вас есть идея, как её решить?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "~DefaultTrust",
      "created_time": "December 09, 2022, 08:47:10 AM",
      "body": "Ничего у ТСа не получится с его подходом к ведению бизнеса. Успешный бизнес в политику не лезет. А стейблкоины - это билеты МММ. Как и любые другие фантики, чье существование основывается на доверии. Следуйте заветам Сатоши: все вокруг мошенники, но с этим можно жить если не доверять никому и ничему кроме законов математики.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "marwell",
      "created_time": "December 09, 2022, 08:57:53 AM",
      "body": "Quote from: ~DefaultTrust on December 09, 2022, 08:47:10 AMНичего у ТСа не получится с его подходом к ведению бизнеса. Успешный бизнес в политику не лезет. Полностью согласен. У некоторых есть фантазии что они этим что-то изменят....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "oolalula",
      "created_time": "December 10, 2022, 12:10:22 AM",
      "body": "Quote from: internetional on December 09, 2022, 08:11:38 AMoolalula, наверное, Вы не для обсуждения здесь написали, а для поиска разработчиков. Но я вижу, что на обсуждение Вы тоже откликаетесь, поэтому задам вопрос, который меня очень интересует.почему же не пообсуждать? тогда и разработчки быстрее найдутся. тем более, если этот вопрос вас очень интересует. но вы тогда будьте готовы, что я дам развернутый ответ на много букв. Quote from: internetional on December 09, 2022, 08:11:38 AMВот Вы написали: Legality, Liquidity, Security. Говоря о ликвидности, Вы уводите вопрос в сторону обеспечения. Но, например, для меня ликвидность - это не обеспечение, а возможность в любой момент обменять токены на то, что их обеспечивает. Как можно дать такие гарантии в современном мире, если ни один банк не даёт гарантию того, что его клиенты смогут в любой момент получить гривны со своих счетов? я отвечу вам в американском стиле, который мне близок по духу, образованию и сфере бизнеса. сначала экзекьютив саммэри в виде выводов, а потом развернутое обоснование. что касается ликвидности, то это решает рынок. что касается гарантии, то абсолютно все банки дают гарантию, что клиенты в любой момент получат гривны, доллары, евро или динары со своих счетов. любой банк, который не выполняет требование клиента о выдаче денег со счета, априори признается банкротом, подлежит вводу временной администрации и последующей ликвидации с погашением задолженностей согласно уставным документам и политике регулятора. тем не менее, в некоторых случаях согласно регуляторным правилам, банки могут вводить некоторые ограничения для обслуживания клиентов. и любой клиент, подписывающий договор с банком, может легко в этом убедиться, т.к. любой банковский договор содержит пункт об одностороннем изменении в правилах обслуживания, в связи с изменением политики регулятора. это означает, что если, например, завтра, регулятор потребует анализ мочи, то банк будет вынужден заморозить операции по счету клиента до тех пор, пока клиент не предоставит свой анализ мочи. если бы этого пункта не было бы, то при изменении законов, распоряжений регулятора и т.п., банк потерял бы лицензию, продолжая обслуживать клиента по старым правилам. теперь давайте поговорим развернуто (можете не читать, но, возможно, другим будет интересно).предположим, вы взяли в долг у вашего лучшего друга некоторую сумму денег с абсолютно честным намерением эти деньги вернуть. ваш друг вам доверяет. у вас нет злых мыслей. более того, ваше рукопожатие скреплено нотариальным договором займа, в котором прописаны гарантии возврата залога. залог устраивает заимодателя. более того, у вас есть гарант, авторитет которого не вызывает никаких сомнений у вас и вашего друга. все честно, прозрачно и без задних мыслей. вы взяли деньги, обернули их, получили прибыль, положили тело займа в чемодан и направились к другу возвращать долг. тут вдруг прилетает метеорит, геологические плиты сдвигаются, приходит цунами в 500 метров высотой, температура повышается на 10 000 градусов из-за разливающейся лавы из разломов земной коры, а потом опускается до -110 из-за ядерной зимы, новый ледниковый период, динозавр ест вашу руку, сжимающую чемодан бумажек. долг вы так и не отдали. причем, ваш друг мог бы и выжить теоретически. но вряд ли бы он продолжал на вас обижаться. о чем это говорит? о том, что существует класс рисков, на которые никто не может повлиять. а значит эти риски не рассматриваются в принципе. соответственно, в случае наступления этих рисковых случаев, никакие даже самые твердые гарантии неприменимы. обычно, эти риски перечислены в разделе договора с форс-мажорами. если никакие гарантии неприменимы, то вы имеете полное право отрицать мировую финансовую систему, банки, деньги, финансовые инструменты, деривативы и прочее. вам никто не запрещает это делать. однако, если вы пойдете по этому пути, то очень скоро вы окажетесь в среде, где люди занимаются ручным трудом и натуральным обменом. есть масса плюсов - все друг друга знают, живут общиной, работают на свежем воздухе, одеваются в одежду из натуральной ткани. правда, минусы тоже есть - вместо медицины молитвы, вместо электричества - восковые свечи, вместо интернета - передача сообщений от человека к человеку и т.д. кто сказал, что так жить нельзя? очень даже можно. типичный пример - религиозные общины амишей в США. это обратная сторона медали для первого примера. если же вы все таки хотите пользоваться современными технологиями, покупать товары не в обмен на яйца или козье молоко, а в обмен на чирканье кредитки по терминалу и в целмо вести более ли менее современный образ жизни, вам придется искать некую золотую середину и подстраиваться под бОльшую часть социума, которая и производит все блага, основанные на современных технологиях. поэтому дальше мы не будем рассматривать ни первый пример, ни второй. следовательно, вам придется признать, что есть некоторые применимые гарантии, на которые вы можете пойти (и пойдете), если хотите оставаться в струе жизни, а не за ее пределами. теперь давайте разберемся с вопросом какие же гарантии применимы? существует международное соглашение о том, что самые твердые гарантии - это гарантии стран и правительств, которые представляют эти страны. тверже гарантий не существует. конечно, гарантии некоторых стран вызывают больше доверия, некоторых наоборот меньше. у каждой страны есть свой рейтинг, который рассчитывается по многим факторам, но в целом, международным сообществом принято считать, что гарантии, выданные страной, являются достаточными. далее, каждая страна через законодательные органы устанавливает правила игры на своей территории. а правительства и суды следят, чтобы эти правила соблюдались. важный признак государственности - собственная денежная единица. и чтобы не превращаться в амишей и не заниматься натуральным обменом, абсолютно каждая страна выделяет особый класс финансовых законов и создает различные регуляторные структуры в виде центробанков, комиссий по ценным бумагам, лицензионным органам для финансовых учреждений и т.д. и т.п. поскольку гранатии стран и правительств как правило касаются денег, в результате именно банковская система каждой отдельно взятой страны является наиболее строго регулируемой. и это логично - правительство берет внешний займ, но оно не может пойти и всем раздать по 100 долларов. оно может отдать эти деньги банкам, чтобы банки сами приняли решение кому что раздавать будь то кредитование бизнеса, потребительское или субсидии для фермеров. но за международный займ отвечает правительство, следовательно, оно регулирует банковскую систему таким образом, чтобы в конечном итоге иметь возможность выполнить взятые на себя обязательства.  после того, как правила игры установлены и контролируются правительством, возникает вопрос - что делать, если в разных странах разные правила игры? ответом на этот вопрос является примат международного права над локальным. это значит, что все страны собрались, договорились о международных правилах игры относительно друг друга и договорились, что если правила внутри страны отличаются от международных, то международные имеют бОльший приоритет. дальше все просто - соблюдать международное законодательство или нет - дело добровольное. никто никого не заставляет. но те страны, которые соблюдают договоренности, образуют экономические, политические и военные союзы, либо тихо мирно существуют в виде нейтральных государств. те, которые не соблюдают, противопоставляют себя этим союзам и объединяются с другими ренегатами. в итоге начинают существовать разные союзы, объединенные общими целями, экономическими интересами, видением развития и т.д. и т.п. если же объединения стран видят свою судьбу по разному, они могут ввести друг против друга различные экономические санкции, эмбарго и т.п. логика очень простая - если вы не хотите соответствовать нашим требованиям и принимать правила игры, которые мы установили, мы не будем давать вам денег, покупать вашу продукцию, закроем свои рынки и окажем влияние на другие страны через аналогичные запреты и ограничения. но вы можете делать все, что угодно внутри вашей песочницы - хотите продавать нефть? продавайте. только возить вы ее будете не на наших танкерах и не через наши проливы. а так - хоть марсианам продавайте. и возите хоть ведрами. а нашим партнерам - только внутри установленного коридора цены. либо возвращайтесь в лоно святой католической церкви и начинайте играть по ранее озвученным международным правилам. но в конечном итоге - выбор делаете сами. внезапно оказывается, что это все оказывает непосредственное влияние на конечных потребителей финансовых услуг. например, хочешь пользоваться американским долларом? будь добр, соответствуй требованиям США к банковской системе в части долларовых расчетов. хочешь рассчитываться евро - соответствуй требованиям ЕС. не соответствуешь? - никаких проблем, только долларом больше не рассчитываешься. а если не рассчитываешься долларом, то вдруг оказывается, что продавцы за непонятные левые фантики отказываются продавать свою продукцию. да еще и эти фантики начинают постоянно обесцениваться. в общем, сплошные проблемы и головняк. кому в итоге хуже? на этот вопрос каждый отвечает сам себе. но если быть объективным, то сильный диктует правила игры слабому. потому что в противном случае сильному придется ослабеть до уровня слабого, а это противоречит логике развития стран и обществ. под словом сильный тут понимается совокупность факторов - от защиты редких растений до авианосцев и космической группировки, конечно, включая экономику, медицину и социальное обеспечение своих граждан. теперь, когда мы все это выяснили, давайте спустимся еще раз на уровень ниже. есть частный бизнес с желанием вести свою деятельность как локально, так и на международной арене и есть банковская система, как локальная, так и международная. бизнес использует банковскую систему для своих нужд - реализации бизнес логики, движения денег, использование банковских гарантий и т.д. и т.п. и банковская система эти услуги бизнесу оказывает. как только изменяется локальное законодательство в части банковской системы, банки требуют у бизнеса перезаключить договор либо отказывают в обслуживании. бизнес в свою очередь адаптируется и меняет свои бизнес-процессы, перекладывая бремя проблем и издержек на конечных потребителей. а как же иначе? бизнес на то и бизнес, чтобы зарабатывать, а не терять. если же изменяется международное законодательство, то, как правило, локальное законодательство адаптируется под международное, если страна по прежнему хочет оставаться в союзе с более сильными игроками и видит свое развитие в их форватере. при этом, в этих союзах существуют различные механизмы, более ли менее позволяющие справедливо учесть мнение каждого игрока. я закончу в следующем посте",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "echogomodrill",
      "created_time": "December 11, 2022, 03:24:57 PMLast edit: December 12, 2022, 10:06:32 AM by echogomodrill",
      "body": "многа букав, сразу появляются подозрения, что  пытаются скрыть слабые  места схемы бла бла рассуждениями, Луна , ихмо, была вроде почти идеальным алгоритмическим стейблом, но чтото пошло не так(банально шеф доверился другим людям и его \"прокатили\" как деревенскую дурочку, надеюсь вы нас такими не считаете)лушчая гарантия - это либо репутация, либо какие  то материальыне активы , которые можно изьять в случае \"гнилых\" телодвижений.Второй вопрос - почему стоимость токена будет расти? вы продаете за него товар или услугу? ктото будет их коллекционировать? раскройте более явно, чтобы даже 5летнему ребенку было понятно, что за него можно поиметь.Таких как вы, гениальных в инете миллион и кучка, будьте проще, короче и понятнее и к вам потянутся хитрые инвесторы",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "welik",
      "created_time": "December 11, 2022, 09:44:28 PM",
      "body": "Quote from: echogomodrill on December 11, 2022, 03:24:57 PMпочему стоимость токена будет расти?Ты даже не осилил название темы, где написано \"стейблкоин\"...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "echogomodrill",
      "created_time": "December 12, 2022, 10:37:00 AM",
      "body": "Quote from: welik on December 11, 2022, 09:44:28 PMQuote from: echogomodrill on December 11, 2022, 03:24:57 PMпочему стоимость токена будет расти?Ты даже не осилил название темы, где написано \"стейблкоин\"...какой серьезный пацык будет делать стейбл в гривне, если тамошние крипто гансты сидят в битке или эфире?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "~DefaultTrust",
      "created_time": "December 12, 2022, 06:43:00 PM",
      "body": "Quote from: echogomodrill on December 12, 2022, 10:37:00 AMделать стейбл в гривне, Это как раз нормальная тема.Сейчас все, что про Украину - в мировом тренде. Бизнес всегда пытается поймать волну. Кстати все, что против Росии - тоже тренд. Так что может ТС не так уж и прост",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "echogomodrill",
      "created_time": "December 15, 2022, 09:05:59 AM",
      "body": "Quote from: ~DefaultTrust on December 12, 2022, 06:43:00 PMQuote from: echogomodrill on December 12, 2022, 10:37:00 AMделать стейбл в гривне, Это как раз нормальная тема.Сейчас все, что про Украину - в мировом тренде. Бизнес всегда пытается поймать волну. Кстати все, что против Росии - тоже тренд. Так что может ТС не так уж и прост сейчас скучный и прибыльный стейбл(в микро нано масштабе) никого не заинтересует, все хотят фана, движухи и тп(я б даже заплатил, чтобы потопить какую нибудь крипту, которую накопили \"кровососы\")",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "oolalula",
      "created_time": "December 15, 2022, 04:19:05 PM",
      "body": "к сожалению, не смог дописать раньше и ответить всем остальным, но я снова тут. итак, продолжаем. вот пример к сказанному выше - маленькая убогая Венгрия накладывает вето на решение всего Евросоюза в плане финансовой помощи Украине (мотивы не обсуждаем). тем не менее, этот кейс имеет место быть и ЕС подчиняется этому вето, поскольку это правила игры, с которыми согласились все участники, и пусть Венгрия маленькая и убогая, но в рамках Евросоюза она равноправная. с другой стороны, ведущие экономики ЕС отвечают в рамках тех же самых правил правительству Венгрии, что, мол, раз вы такие умные, то мы сейчас в рамках общих правил, проведем у вас аудит и посмотрим, куда вы дели ранее выделенную вам экономическую помощь, а заодно не дадим вам 12 млрд евро (7 на реформы, 5 на ковид). https://www.dw.com/ru/evrokomissia-namerena-urezat-vengrii-75-mlrd-evro-izza-korrupcii/a-63163135 Понятно, что Венгрия не просто так борзеет. и один игрок, который норовит все время нагадить под коврик, решил коррумпировать правительство этой маленькой убогой страны и способен удвоить эту цифру экономической помощи хоть бы даже и наличными. тем более, этот самый игрок уже простил всяким там кубам, иракам, эфиопиям и анголам совокупно 140+ млрд долларов денег своих налогоплательщиков. Венгрия прекрасно понимает, что налогоплательщики щедрые и легко поживут в нищете и убогости без больниц, школ, дорог, пенсий, газификации и канализации, но ради счастья венгерского народа, а значит есть большая вероятность срубить бабла по легкому. все равно возвращать не придется - вернут пенсы, многодетные и работающие зэки по эксклюзивному законодательству  этого т.н. партнера. каждый ведет свою игру. но самая интересная ситуация возникает, когда наш бизнес, ведущий международную игру, вдруг внезапно сталкивается с клиентами из юрисдикции, на которую наложены санкционные ограничения. умный и уважаемый бизнес очень быстро отгребает в сторону чтобы не пачкать репутацию (даже если перед этим и провалит в серую парочку подсанкционных турбин). бизнес победнее и поотчаяннее начинает мутить разные схемы через левые страны, которые и не вашим и не нашим, начинает делать вид, что он не имеет никакого отношения к нарушению эмбарго и тп и тд. еще хуже, если он начинает уклоняться от налогов, разводить всяких уважаемых людей и тд. и вот когда этот бизнес начинает игнорировать конкретные такие предъявы от всяких разных структур типа IRS, SEC, FTC, CFTC или не дай бог FRS, появляются серьезные парни из организаций типа CIA или NSA, и конкретно дают по шапке так, что клиент разлетается на молекулы. таким образом, очевидно, что для сохранения гарантий, бизнесу не стоит нарушать международное законодательство как минимум и локальное законодательство как максимум. и если этот бизнес играет по правилам, то он вполне может положиться на банковскую систему, которая его обслуживает. именно потому, что банковская система - самое охраняемое, что есть в государстве. конечно же, банки, как коммерческие структуры, могут стать банкротами. но это не имеет никакого отношения к гарантиям. для того, чтобы выбрать обслуживающий банк правильно, нужно смотреть не рекламу, а читать финансовые отчеты. более того - диверсифицировать свои риски, разворачивая одну и ту же законную бизнес модель в разных обслуживающих банках. если же вы по прежнему не доверяете банковской системе, добро пожаловать в амиши.  но, как мы договорлись выше, амишей мы трогать не будем - это не наш путь. а значит вопрос стоит исключительно в выборе банка. поэтому, когда наши пользователи стейблкоина будут просто тыкать пальцем и кричать - банки не дают никаких гарантий - мы все (и мы, как команда, и сообщество, как пользователи) будем просто понимать уровень профессионализма и образования толпы и спорить с толполй не будем, чтобы не плевать против ветра. человек грамотный и образованный прекрасно понимает, о чем я тут пишу и спорит о конкретном обслуживающем банке ин витра, т.е. конкретно - этот банк плохой, потому что у него большая дебеторская задолженность, плохие показатели, упал оборот год к году, снизились дивиденды на акцию, сексуальный скандал в топ-менеджменте, обвинение от прокуратуры в отмывании бабла и т.д., а вот этот банк хороший и его гарантии приемлемы, т.к. банк имеет высокий рейтинг, выполняет требования регулятора к капиталу, отличные финансовые отчеты, растет количество клиентов, пройдет аудит независимыми международными аудиторами с рейтингом А или А+ и т.д. более того, есть еще один очень важный нюанс, о котором постоянно забывают любители. а именно - забалансовые активы. любая финансовая компания при выполнении определенных требований регулятора имеет право выступать управляющей для разного рода инвестиционных фондов и т.п. забалансовые активы - это чужие деньги, которыми управляющая компания распоряжается согласно договору с владельцем этих денег. согласно законодательствам почти всех стран, управляющие компании не имеют права выдавать эти деньги в виде кредитов или брать займы под обеспечение этих денег за исключением краткосрочных займов с целью выполнения обязательств перед владельцами таких активов. другими словами, в случае банкротства банка, все забалансовые деньги возвращаются регулятором владельцу. конечно, это длительный процесс работы временной администрации, но тем не менее.  а пока банк работает в обычном режиме, забалансовые активы не участвуют в валютной позиции. таким образом, банк получает свой гешефт от выполнения строго регламентированных операций. все остальное - цифры на мониторе под жестким контролем регулятора. конечно, можно этого всего бояться и не доверять. просто по факту. не верю и все. ну ок, будь амишем. ешь сырые яйца и занимайся сексом для рождения детей. - твое дело.тут отдельно нужно отметить кэш. почему-то все считают, что достаточно выйти в кэш и вы исчезли из поля зрения регулятора. на самом деле, кэш - это такой же продукт банковской системы, как и безнал. и рисков в кэше гораздо больше чем в безнале. поскольку мы тут говорим о криптовалютах, то стремление выйти в кеш, чтобы сохранить свою анонимность, как минимум имеет два следствия - во-первых, в кеше очень мало денег. кеш - это примерно 2% от всех оборачиваемых средств. любой бизнес ориентируется на безнал - там просто больше денег. даже розничная торговля превращает кеш в безнал и начинает применять безналичные технологии оплаты. что до крипты, то есть ложное мнение, что флешка с биткоинами, купленная за кеш, делает вас анонимным держателем и вы становитесь более защищены. до какой-то степени ваша анонимность соблюдается. но когда вам нужно превратить вашу крипту в фиатные деньги (а это неизбежно, потому что за крипту не продаются ни товары ни услуги, ограниченными продавцами, разбросанными по миру, можно пренебречь), оказывается, что вы должны с вашей флешкой спуститься в стремный подвал, который охраняют мутные амбалы с уголовными выражениями лиц, и вы в этом заведении можете обменять вашу крипту на фиат. насколько тут больше рисков, чем в банковской системе - даже перечислять не буду. по сути, если вы в банке нормально объяснили откуда деньги и имеете бумажку об уплате налогов, то вы уважаемый человек. а в случае с подвалом - вы потенциальная добыча. ну что, с гарантиями разобрались. теперь разберемся с ликвидностью. это займет меньше времени ) ликвидность - это порождение рынка. спрос и предложение. вы продаете свой токен и покупаете юсдт, а владелец юсдт, наоборот, хочет купить ваш токен. по какому курсу будет совершена сделка - решаете вы сами. т.е. рынок. официальный курс гривны относительно доллара устанавливается НБУ, обслуживающий банк устанавливает коммерческий курс в определенном коридоре. страна за пределами Евросоюза, например, Молдова, устанавливает один курс лея-гривна. Чехия, как член Евросоюза, устанавливает другой курс крона-гривна и тд. В целом, условия в стране-эмитенте валюты, в Евросоюзе, в США, в европейских странах не членах ЕС, Африке, США, Азии и т.д. - могут очень сильно отличаться. но в любом случае, будет какой-то медианный курс, который возникнет сам собой, как результат действия законов рынка - спроса и предложения. поэтому курс обеспеченного токена будет примерно равен курсу другого обеспеченного токена. и если вы захотите совершить обмен на одной из регулиряемых бирж (Binance, ErisX и т.п.), вы всегда сможете найти контрагента при определенном компромиссе. не говоря уже о локальных и глобальных обменниках. что до абсолютно правильного понимания ликвидности, которое вы озвучили, то это также не является проблемой. именно гарантия в 100% в нашей бизнес модели позволяет вам обменять ваш токен обратно на фиатные деньги в любой момент по требованию. причем, вам не стоит сейчас подвергать мои слова сомнениям. просто принимайте это на веру. т.к. наша бизнес модель - это ноу-хау и она будет вынесена на всеобщее обсуждение после запуска проекта. тогда вам станет понятно, что я абсолютно прав. пока же у вас нет достаточной информации, поэтому просто поверьте на слово, что юристы и банкиры из нашей команды такой механизм разработали и он абсолютно легален. другими словами, любой участник может провести быстро и законно как операцию ввода фиата в систему и получение криптотокена, так и операцию вывода фиата из системы путем уничтожения своего криптотокена. в данном случае, фиат будет зачислен на р/с в безналичной форме. конечно, за вычетом накладных расходов, которые будут складываться из коммерческой комиссии, комиссии блокчейна и комиссии банка. еще раз. откуда берется ликвидность, гарантирующая отсутствие проблем с выходом в фиат? клиент внес фиат и получил токен. фиат заблокирован банком таким образом, что никто больше не имеет к нему доступ. теперь клиент выходит из токена в фиат - токен уничтожается и одновременно с этим банк разблокирует соответствующее количество фиатных денег, которые и перечисляются на счет клиенту. да, вы по прежнему можете не доверять банковской системе. тогда это просто не для вас, а для тех, у кого нет особых проблем с доверием. просто потому. что невозможно организовать безналичное движение фиатных средств без банковской системы. это очевидно. и мы это обсудили уже миллион раз.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "oolalula",
      "created_time": "December 15, 2022, 04:55:28 PM",
      "body": "Quote from: internetional on December 09, 2022, 08:11:38 AMВосемь месяцев назад ПриватБанк закрыл мне доступ к моим деньгам на моём счёте из-за моего российского паспорта. теперь, что до ваших личных проблем. во-первых, банковские санкции Украина-РФ зеркальны. вас это. конечно, мало утешает. как и меня. у меня, например, зависли деньги в российских банках и счастья мне это не добавило. но в данном случае этот пример приводите вы. поэтому ваш кейс и будем разбирать. вы знали, что страна, гражданином которой вы являетесь, нарушила международное законодательство, в частности - устав ООН (при том, что РФ является постоянным членом совбеза) и Будапештский меморандум, по которому РФ выступила гарантом для Украины. согласно международному определению, экономическая агрессия приравнивается к военной агрессии и вышеупомянутый Будапештский меморандум включает черным по белому обязательства не допускать агрессивных экономических действий со стороны гарантов. тем не менее, РФ начала экономическую войну с Украиной в 2005 году с необоснованного повышения цен на газ. https://uk.wikipedia.org/wiki/%D0%93%D0%B0%D0%B7%D0%BE%D0%B2%D1%96_%D0%BA%D0%BE%D0%BD%D1%84%D0%BB%D1%96%D0%BA%D1%82%D0%B8_%D0%BC%D1%96%D0%B6_%D0%A0%D0%BE%D1%81%D1%96%D1%94%D1%8E_%D0%B9_%D0%A3%D0%BA%D1%80%D0%B0%D1%97%D0%BD%D0%BE%D1%8Eдалее, эта газовая агрессия то затихала то разгонялась снова и снова аж до тех пор, пока Украина не выиграла Стокгольмский арбитраж против РФ и не победила в этой войне, полностью отказавщись от российского газа. кроме этой агрессии, РФ устраивала сырную блокаду https://uk.wikipedia.org/wiki/%D0%A1%D0%B8%D1%80%D0%BD%D0%B0_%D0%B2%D1%96%D0%B9%D0%BD%D0%B0конфетную блокадуhttps://uk.wikipedia.org/wiki/%D0%A8%D0%BE%D0%BA%D0%BE%D0%BB%D0%B0%D0%B4%D0%BD%D0%B0_%D0%B2%D1%96%D0%B9%D0%BD%D0%B0_(2013)да и в целом экспортное эмбаргоhttps://uk.wikipedia.org/wiki/%D0%95%D0%BA%D1%81%D0%BF%D0%BE%D1%80%D1%82%D0%BD%D0%B0_%D0%B1%D0%BB%D0%BE%D0%BA%D0%B0%D0%B4%D0%B0_%D0%A3%D0%BA%D1%80%D0%B0%D1%97%D0%BD%D0%B8_%D0%A0%D0%BE%D1%81%D1%96%D1%94%D1%8Eа в 2020г. РФ вообще отказалась признавать примат международного права над локальным https://www.dw.com/ru/putin-podpisal-zakony-o-prioritete-konstitucii-nad-mezhdunarodnym-pravom/a-55872285при этом, Украина наоборот наращивала уровень взаимодействия с такими международными институциями как ЕС, ВТО, МВФ и другими. полный список в той же википедии. фактически, Украина выбрала стратегию интеграции с ЕС, приводила свое локальное законодательство к международным нормам, что вылилось в подписание документа, известного как Евроассоциация Украина -ЕС - полный текст на сайте Верховной Рады. другими словами, для Украины, как и для большинства нормальных стран, примат международного законодательства над локальным - есть непреложный факт, более того, закрепленный в Конституции. теперь посмотрите мой пост выше о банковской системе и задайте вопрос себе - вы платили налоги в РФ, на ваши налоги РФ устраивала экономические войны и блокады, а 9 месяцев назад, как вы написали, вообще приехала на танках в чужую страну, которые были также куплены, обслужены, заправлены соляркой на ваши налоги... и... что должен был сделать Приватбанк? Проценты вам начислить за ваши деньги и включить вас в программу лояльности? ПБ выполнил требования регулятора. вот и все. но чтобы регулятор эти требования заявил, РФ очень долго, с 2005го года, выпрашивала. более того, эта позиция не просто регулятора Украины, это международная позиция США, ЕС и союзников. страны, которые присоединились к санкциям, также есть в википедии. Именно тот факт, что ПБ не заблокировал ваши счета и не национализировал ваши средства сразу после аннексии украинских территорий в 14м году, как раз и свидетельствует о надежности банковской системы, в частности, украинской банковской системы, которая в полной мере интегрирована в международную банковскую систему. а то что вы жили с позиции - а че такова? - и не предпринимали никаких действий, чтобы ваша страна не вела себя как взбесившийся гопник со всеми этими войнами - от экономических до горячих, и не включили вовремя мозг, чтобы подумать - а как же мне защитить собственные активы? не задали себе вопрос - моя страна ведет войну против Украины - а вдруг с моими деньгами в ПБ что-то случится? так это уже исключительно ваши проблемы. в конце концов, деньги любят тишину. я вангую, что когда-нибудь, лечт через 50-70, когда все репарации будут выплачены, возможно, ваш счет и будет разблокирован. почему нет? ну, если раньше он просто не будет конфискован с целью уплаты тех самых репараций. Quote from: internetional on December 09, 2022, 08:11:38 AMЕщё через восемь месяцев любой другой банк может точно так же эмитенту стейблкоина закрыть доступ к деньгам на счёте проекта, и тогда ни о какой ликвидности речи не будет.   Именно в этом я вижу основную проблему стейблкоинов с фиатным обеспечением. Может быть, у Вас есть идея, как её решить?  нет. не может. банк ничего просто так никому не закрывает и не блокирует. как это все работает я описал выше. поэтому у стейблкоинов нет никаких проблем с фиатным обеспечением. вообще никаких. проблема есть в конкретных банках, которые находятся на территории стран, которые не соблюдают международное законодательство. поэтому давайте разделять мухи отдельно, а котлеты отдельно. банк в северной корее и барклайс в Лондоне - это два разных банка. и гарантии у них разные. также как международные гарантии Сомали и Люксембурга. рассматривайте каждый кейс ин витро и не будет путаницы.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "oolalula",
      "created_time": "December 15, 2022, 05:04:34 PMLast edit: December 15, 2022, 06:15:54 PM by Xal0lex",
      "body": "Quote from: ~DefaultTrust on December 09, 2022, 08:47:10 AMНичего у ТСа не получится с его подходом к ведению бизнеса. Успешный бизнес в политику не лезет. знаете, сколько раз я слышал эти слова? и ничего. собаки лают, караван идет. и вообще не понятно, где вы увидели политику в обеспеченном стейблкоине  Quote from: ~DefaultTrust on December 09, 2022, 08:47:10 AMА стейблкоины - это билеты МММ. Как и любые другие фантики, чье существование основывается на доверии. телефоны эппл - это билеты ммм. автомобили мерседес - это билеты мммшвейцарские франки - это билеты мммзолотые бонды центробанка индии - это билеты мммвылов тунца -это билеты мммудаление аппендицита - это билеты мммгуглэдс - это билеты мммдальше продолжать? воевать за лично ваше доверие никто не будет. перечитайте стартпост - там написано черным по белому - бизнес модель протестирована на целевой аудитории и целевая аудитория в восторге. Quote from: ~DefaultTrust on December 09, 2022, 08:47:10 AMСледуйте заветам Сатоши: все вокруг мошенники, но с этим можно жить если не доверять никому и ничему кроме законов математики. все, что касается доверия, а также законов, регулятора и банковской системы я описал в двух больших постах выше. больше пережевывать доверие или недоверие я не буду. а вам - добро пожаловать в амиши. да, что там с этими постоянно лопающимися криптобиржами, основанными на чистой математике? - вопрос риторический. Quote from: Volax on December 09, 2022, 10:02:24 AMСовершенно верное опасение. Для ликвидности стейблкоина в классическом понимании необходимо отойти от модели фиатного обеспечения, или от алгоритмической модели - эти модели в итоге скатываются к централизации, или к низкой капиталоэффективности. Как поступить в этом случае не буду подсказывать ТС, пусть испытает муки творчества в процессе поиска верного решения. благодарю, мы обойдемся без мук творчества. я повторяю еще раз - перечитайте стартпост, бизнес модель протестирована на целевой аудитории и целевая аудитория осталась довольна. если лично вы считаете кока-колу ужасной гадостью, вы можете ее не пить. надеюсь, намек понятен. в этой теме я ищу программистов, которые заходят реализовать с нами этот проект на партнерских началах. я не рассказываю в этой теме нашу бизнес-модель или как это работает или как это все будет выгледть, как будут работать гаранти стейблокина и т.д. и т.п. - это все станет известно щирокой публике после официального запуска преокта и публикации вайтпейпер. в настоящий момент все эти ваши высказывания сомнений и прочего простоне имеют смысла, потому что вы спорите с пустотой. чтобы спорить со мной или с моей бизнес-моделью, вам нужно как минимум эту модель знать. до тех пор, пока вы ее не знаете, с чем вы спорите? соответственно, раз вы спорите с пустотой, то я не буду даже пытаться вас переубеждать. Quote from: echogomodrill on December 11, 2022, 03:24:57 PMмнога букав, сразу появляются подозрения, что  пытаются скрыть слабые  места схемы бла бла рассуждениями, во-первых, перед этими много букв, было краткое резюме. во-вторых, я ничего и нигде не писал о схеме. чтобы скрывать слабые места и подчеркивать сильные, нужно сначала эту схему опубликовать. во-вторых, беспочвенные подозрения - это психическое расстройство. ваш КО.Quote from: echogomodrill on December 11, 2022, 03:24:57 PMлушчая гарантия - это либо репутация, либо какие  то материальыне активы , которые можно изьять в случае \"гнилых\" телодвижений.как было написано выше, наша схема гарантирует неприкосновенность фиатного обеспечения на 100%. я предлагаю вам поверить на слово. просто потому, что это тема для поиска программистов, а не для дистрибуции токена. Quote from: echogomodrill on December 11, 2022, 03:24:57 PMВторой вопрос - почему стоимость токена будет расти? вы продаете за него товар или услугу? ктото будет их коллекционировать? раскройте более явно, чтобы даже 5летнему ребенку было понятно, что за него можно поиметь.а кто вам сказал, что стоимость токена будет расти? я не знаю откуда вы сделали такой вывод. курс будет определен рынком. это все, что я могу сказать. Quote from: echogomodrill on December 11, 2022, 03:24:57 PMТаких как вы, гениальных в инете миллион и кучка, будьте проще, короче и понятнее и к вам потянутся хитрые инвесторытаких как я - нету. я - единственный и уникальный. если вам приятно считать себя частью серой массы - я не буду с вами спорить. только хамить не надо. и советовать как мне себя вести. я разберусь с этим без вас. что до простоты краткости и понятности - если вы не способны осилить написанное, то это не мои проблемы. постарайтесь прокачать свой интеллект с помощью пары учебников, но не ждите, что я буду опускаться до вашего уровня.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "~DefaultTrust",
      "created_time": "December 19, 2022, 11:57:29 AM",
      "body": "Quote from: oolalula on December 15, 2022, 05:04:34 PMкак было написано выше, наша схема гарантирует неприкосновенность фиатного обеспечения на 100%. я предлагаю вам поверить на слово. просто потому, что это тема для поиска программистов, а не для дистрибуции токена. Если тема для поиска программистов, то ей место в разделе форума \"Работа\".В разделе идей принято обсуждать идеи, а не искать/предлагать работу. Причем идеи не все подряд, а связанные конкретно с биткоином и/или технологией блокчейн ибо это форум про биток. Для шиткоинов тут тоже есть отдельный раздел если что.Вы можете перенести свою тему самостоятельно или можете попросить это сделать администратора.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "oolalula",
      "created_time": "December 19, 2022, 03:03:24 PM",
      "body": "Quote from: ~DefaultTrust on December 19, 2022, 11:57:29 AMQuote from: oolalula on December 15, 2022, 05:04:34 PMкак было написано выше, наша схема гарантирует неприкосновенность фиатного обеспечения на 100%. я предлагаю вам поверить на слово. просто потому, что это тема для поиска программистов, а не для дистрибуции токена. Если тема для поиска программистов, то ей место в разделе форума \"Работа\".В разделе идей принято обсуждать идеи, а не искать/предлагать работу. Причем идеи не все подряд, а связанные конкретно с биткоином и/или технологией блокчейн ибо это форум про биток. Для шиткоинов тут тоже есть отдельный раздел если что.Вы можете перенести свою тему самостоятельно или можете попросить это сделать администратора. Благодарю за информацию. не очень понимаю, какой раздел подойдет лучше всего. я ищу команду именно для стартапа, а не предлагаю работу. и я не знаю, как перенести тему самостоятельно.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nik009",
      "created_time": "December 20, 2022, 02:31:12 PM",
      "body": "В крипте по определению ничего с гарантиями быть не может и последние скамы этого года - хорошее тому подтверждение. К тому же изначально ставка на гривну - это ограниченная украинцами аудитория, так себе начало.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "oolalula",
      "created_time": "December 20, 2022, 05:09:42 PM",
      "body": "Quote from: nik009 on December 20, 2022, 02:31:12 PMВ крипте по определению ничего с гарантиями быть не может и последние скамы этого года - хорошее тому подтверждение. вы можете судить о проектах, о которых имеете досаточно информации. вы не можете судить об этом проекте, поскольку у вас нет достаточной информации. все остальное - демагогия. Quote from: nik009 on December 20, 2022, 02:31:12 PMК тому же изначально ставка на гривну - это ограниченная украинцами аудитория, так себе начало. никто не мешает резидентам Германии, Алжира или Аргентины использовать гривну для рассчетов в крипте или для фиатных переводов. сама по себе валюта никак и никого не ограничивает. тем более, если речь идет о стейблкоине.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VladisE",
      "created_time": "December 22, 2022, 05:12:41 PM",
      "body": "В последнее время стейбкоинов валится. Также биржы скамлятся. Я думаю, что это проверка индустрии на прочность. Останутся только сильные и верные юзеры)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}