{
  "id": "topic_5434870",
  "title": "KingJJ",
  "author": "KingJJ",
  "created_time": "January 16, 2023, 01:40:47 AM",
  "content": "I have an old wallet that I just found out about that has some Bitcoin in it. It’s been a failure thus far trying to access the coin. The wallet app no longer functions as the company, BTC.com has stopped supporting it. I have the Recovery Data Sheet which includes the Master Seed (24 words) and I know the Passphrase used to create the wallet. A simple seed import to wallets like BlueWallet, Exodus, Trust Wallet.. all gives me a new wallet using the seed, but no coin. I can import the Public Key to Electrum and the “watch wallet” imports just fine and shows the balance and transaction history. What am I doing wrong? Is is the fact that it’s a Multi-Sig wallet trying to import into BIP39 wallets? The derivation path is different and I’m thinking that makes a difference as well. I have no technical experience with these wallets, I’ve just used them for about 10 years but still have limited experience when things go wrong but I’m willing to give it a shot if some people can point me in the right direction. I know that I have to use a wallet that accepts the 24 word seed plus the Passphrase and I’ve tried that with a few wallets but I still makes no difference. I can see the Bitcoin addresses being created by the new wallets when I import like into BlueWallet and they don’t match the addresses I’m importing. Any help would be appreciated. Here’s the GitHub page on my wallet so that you can see what we are dealing with. https://gist.github.com/rubensayshi/da922774d43976e0804cAlso an image of the 2 Public Keys. https://ibb.co/Km0jg6Z",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434870",
  "comments": [
    {
      "author": "jackg",
      "created_time": "January 16, 2023, 03:55:12 AM",
      "body": "Have you tried here yet? https://recovery.btc.com/That and their support are the best two choices considering how much effort this looks like it could take if you try doing it in a wallet.You also sound like you haven't done the start properly either as I assume it means you have 2 nmemonics (perhaps they're both 12 words - you still need the third though).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "January 16, 2023, 04:53:06 AM",
      "body": "Quote from: KingJJ on January 16, 2023, 01:40:47 AM-snip- I can import the Public Key to Electrum and the “watch wallet” imports just fine and shows the balance and transaction history. I tried this and only the master public key at m/1' has BTC.So if it's the funds that you're trying to recover, it's not a MultiSig wallet but a standard legacy wallet.Is there more to recover than what's being shown by the second master public key?If not, you can try these options, you can use Electrum but verify its integrity for safety: tutorial.The options:option1: Recover your seed phrase in Electrum, in options, tick \"BIP39 seed\" Create the wallet using \"legacy (p2pkh)\" script type.option2: Do the steps in option1 but after selecting the legacy script type, edit the derivation path below from m/44'/0'/0' into: m/1'option3: Recover your seed phrase in Electrum, in options, tick \"BIP39 seed\" and \"Extend this seed with custom words\", type your passphrase in the next window. Create the wallet using \"legacy (p2pkh)\" script type.option4: Do the steps in option3 but after selecting the legacy script type, edit the derivation path below into: m/1'option5: Do the steps in option1 up until the script type window, but instead of selecting an address type, click \"Detect Existing Accounts\" instead (if empty repeat this with option3).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "January 16, 2023, 12:11:15 PM",
      "body": "As nc50lc says, if you have the seed phrase for the second of those two master public keys you can simply recover it as normal and retrieve the funds on it.If there are other funds in a 2-of-3 multi-sig as you suggest, then at a minimum you need two different seed phrases and the third master public key. Based on the Github link you provided, you will need the seed phrase for your \"Primary Key\", the seed phrase for your \"Backup Key\", and the master public key from the \"Blocktrail Key\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}