{
  "id": "topic_5412721",
  "title": "Robert518",
  "author": "Robert518",
  "created_time": "September 07, 2022, 10:48:16 AM",
  "content": "In such an event, I believe the price of Bitcoin would plummet. What if it fell so low during the halving that miners couldn't recoup their costs? During a world war, I'm sure a lot of assets would be destroyed. But is BTC particularly vulnerable?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5412721",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "September 07, 2022, 10:52:31 AM",
      "body": "Only what I think is that many people would see bitcoin as a safe means of keeping money, if a country is affected, fiat is affected, banks can close down and many people will not be able to have access their money. But with bitcoin, you have the total control over your coins. Bitcoin do increase in counties where there is war as they buy it in premium, but about world war, I do not  know what could happen than the price to increase because more people will move from bank to bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "September 07, 2022, 12:00:09 PM",
      "body": "Quote from: Robert518 on September 07, 2022, 10:48:16 AMWhat if it fell so low during the halving that miners couldn't recoup their costs? Difficulty adjustments happen every 2016 blocks or ~2weeks. With such decline in price, some miners would shut down operations due to the costs, and this would lower the hashrate, dropping the difficulty level during the next adjustment. This drop will attract new miners.It is a self balancing system.Quote from: Robert518 on September 07, 2022, 10:48:16 AMDuring a world war, I'm sure a lot of assets would be destroyed. But is BTC particularly vulnerable?During a hypothetical world war, ease of carrying money around would be paramount, with bitcoin doing that better than almost all assets. It is also not as restricted as fiat to the country where it is the national currency.A big draw back to be how it is heavily dependent on the internet, but if you only want to store your assets, Bitcoin would function well and can hold its value through it.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Henrobakkara",
      "created_time": "September 07, 2022, 12:24:31 PM",
      "body": "If you are talking about the world war, everything will fall including banks that would be destroyed, and fiat monies too as you presume and I dont think Bitcoin would be any different. Major mining rigs could be distroyed which might have a negetive effect on the network and eventually the price. The price of Bitcoin don't immediately go up right after Halving it will usually take some time and could even fall a bit from the price during Halving but until all your assumption truly happens, nothing to fear as far as I am corncern for now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "September 07, 2022, 12:52:42 PM",
      "body": "The mining feedback loop of more hashrate and higher prices with lower rewards has to come to an end at some point.  I imagine when it does, there will be a death spiral of price and hashrate that lasts quite a long time and likely bankrupts some of the largest players in the game.  Will that happen this cycle?  Probably not.  It is inevitable though.  The decoupling of this feedback loop will happen and it will hurt for a long time.  I think we've got one more cycle to go before this becomes an issue though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "smartaction",
      "created_time": "September 07, 2022, 01:07:58 PM",
      "body": "We all believe in Bitcoin and think that Bitcoin is a safe place where money can be controlled as own wish. A facility that a bank will not provide . Maybe the price of Bitcoin may drop for a while but I don't think it will ever crash to 0, not only Bitcoin but any type of product in the world fluctuates with time and situations . Bitcoin had previously dropped from $20k to just under $4K  but it was go above 60K again some month ago so I am not too worried about Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "posi",
      "created_time": "September 07, 2022, 01:19:30 PM",
      "body": "Quote from: smartaction on September 07, 2022, 01:07:58 PMWe all believe in Bitcoin and think that Bitcoin is a safe place where money can be controlled as own wish. A facility that a bank will not provide . Maybe the price of Bitcoin may drop for a while but I don't think it will ever crash to 0, not only Bitcoin but any type of product in the world fluctuates with time and situations . Bitcoin had previously dropped from $20k to just under $4K  but it was go above 60K again some month ago so I am not too worried about Bitcoin.This has been demonstrated by bitcoin many times in the past, where it has slumped 80% to 85% in value, and then bounced back and will always reach new ATHs after that. This time, I think it will be no exception bitcoin will repeat the past even though the world economic situation will be many times worse than now. The stronger the decline, the stronger the growth will be, that's what bitcoin has always done.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "September 07, 2022, 01:37:44 PM",
      "body": "if there is a world war of course not only bitcoin but all stocks will fall and many more including fiat money or banks will close, but bitcoin can actually be an alternative also in times of war can send bitcoin via radio as I read on this forum as well via sms so that without having to use the internet if there is a problem with the internet network, actually bitcoin can be a hedge depending on the perspective of the person holding it, the bitcoin price will recover so be patient for it take it and buy it cheap now",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "September 07, 2022, 01:42:07 PM",
      "body": "Quote from: Robert518 on September 07, 2022, 10:48:16 AMDuring a world war, I'm sure a lot of assets would be destroyed. But is BTC particularly vulnerable?A world war is like a cancer that destroys everything except those who produce the means by which people destroy each other. If that ever happens, the least of your worries will be Bitcoin, and of course if you survive a nuclear, chemical or biological weapon.QuoteWhat if the price of Bitcoin continued to fall during the halving?And why would it be strange if we know that the effects of halving are not visible right now, but only in the months after that? There is a chance that in 2 years Bitcoin will be worth 5 or 10 times less than today, but you have to ask yourself how achievable such a thing is? I don't think it's a very promising scenario, but for those who think differently, maybe it's time to leave the Bitcoin ship.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "poldanmig",
      "created_time": "September 07, 2022, 02:21:22 PM",
      "body": "Quote from: piebeyb on September 07, 2022, 01:37:44 PMif there is a world war of course not only bitcoin but all stocks will fall and many more including fiat money or banks will close, but bitcoin can actually be an alternative also in times of war can send bitcoin via radio as I read on this forum as well via sms so that without having to use the internet if there is a problem with the internet network, actually bitcoin can be a hedge depending on the perspective of the person holding it, the bitcoin price will recover so be patient for it take it and buy it cheap nowWorld war will destroy all existing sectors, the financial economy, sports, politics and also other sectors, but I think maybe it will not affect the development of bitcoin too much, because after all bitcoin cannot be regulated by a system that is controlled by the government unlike the case with majority shares are controlled by the value of certain companies, I personally believe that if when the world war occurs then bitcoin will become an alternative means of payment for the whole world as happened some time ago when the war in ukraine and russia occurred, where bitcoin became a means of donation for several institutions in Ukraine and the anonymous nature of bitcoin transactions allows each recipient and sender to remain safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzy887",
      "created_time": "September 07, 2022, 02:42:16 PM",
      "body": "Quote from: OgNasty on September 07, 2022, 12:52:42 PM Will that happen this cycle?No, because BTC is not a two-day trusted coin, it is our trusted coin. The market may go up and down but Bitcoin will never be completely gone. Almost many countries around the world have legalized Bitcoin and we can expect in the future countries that will legalize Bitcoin and one day the countries will run with the coins of the same currency and it is going to be very soon.It will reach 50 thousand dollars very soon and it will never end. Maybe the market condition is bad nowHopefully the market will be better in the future and Bitcoin will be stronger. All coins go up and down in the market, but don't think that Bitcoin is going to end all at once. So no one will fear Bitcoin halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "|MINER|",
      "created_time": "September 07, 2022, 02:56:48 PM",
      "body": "Quote from: Robert518 on September 07, 2022, 10:48:16 AMIn such an event, I believe the price of Bitcoin would plummet. What if it fell so low during the halving that miners couldn't recoup their costs? During a world war, I'm sure a lot of assets would be destroyed. But is BTC particularly vulnerable?I also agree that it's one of the big reason for price dumping of bitcoin . Apart from the effects of the war, along with various countries sanctoining it or declaring it illegal, then the bearish season of cryptocurrencies, etc., the price of Bitcoin has now fallen by more than 70% of its ath.  But I think the war won't last forever and the bullrun coming after the bearish season and that's how bitcoin and cryptocurrencies are going and it's normal that some projects will collapse in the bearish season.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "isaac_clarke22",
      "created_time": "September 07, 2022, 03:07:54 PM",
      "body": "Quote from: Robert518 on September 07, 2022, 10:48:16 AM~I am pretty sure that you have better things to worry about during world war aside from Bitcoin. If we could even put it into imagination, it should not affect BTC directly. It could affect some such as having their access lost from their BTC wallet from any destruction caused by the war, but directly it should not affect BTC since it is decentralized as well.Maybe people would continue to sell Bitcoin that day, but that is not surely the case only nor the events happening  at this point.I believe I recall having this same discussion back in the day as well about Bitcoin and War effect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "September 07, 2022, 03:24:11 PM",
      "body": "Quote from: Robert518 on September 07, 2022, 10:48:16 AMIn such an event, I believe the price of Bitcoin would plummet. What if it fell so low during the halving that miners couldn't recoup their costs? During a world war, I'm sure a lot of assets would be destroyed. But is BTC particularly vulnerable? These type of question arise because one does not understand how the market works on buying and selling. A price can plummet only when the selling pressure exceeds the buying pressure and halving is irrelevant to this. Because there are people ready to buy bitcoin as soon it drops below a set point, the reversal occurs and this is shown as \"correction\" to the market watchers.War and assets have already been tested, there has been a war which is ongoing and bitcoin does not seem to be correlated to its actions. Truely this war is a small scale than a world war, but instead of doing doomsday predictions which are never going to happen during our lifetime, it is better to dwell in the present and be ready to buy bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "September 07, 2022, 03:45:47 PM",
      "body": "Quote from: poldanmig on September 07, 2022, 02:21:22 PMQuote from: piebeyb on September 07, 2022, 01:37:44 PMif there is a world war of course not only bitcoin but all stocks will fall and many more including fiat money or banks will close, but bitcoin can actually be an alternative also in times of war can send bitcoin via radio as I read on this forum as well via sms so that without having to use the internet if there is a problem with the internet network, actually bitcoin can be a hedge depending on the perspective of the person holding it, the bitcoin price will recover so be patient for it take it and buy it cheap nowWorld war will destroy all existing sectors, the financial economy, sports, politics and also other sectors, but I think maybe it will not affect the development of bitcoin too much, because after all bitcoin cannot be regulated by a system that is controlled by the government unlike the case with majority shares are controlled by the value of certain companies, I personally believe that if when the world war occurs then bitcoin will become an alternative means of payment for the whole world as happened some time ago when the war in ukraine and russia occurred, where bitcoin became a means of donation for several institutions in Ukraine and the anonymous nature of bitcoin transactions allows each recipient and sender to remain safe.yes like that I mean that bitcoin seems to be able to survive even when there is a world war, because we have seen since the war in ukraine bitcoin can be relied on for that, so I think people should learn more how to adopt bitcoin and use it as a means of paying also understand how to transact with bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "September 07, 2022, 03:54:12 PM",
      "body": "Miners already have calculation about the cost and how much the halving reward, so it doesn't make sense if every miners couldn't recoup the mining cost.Correct, world war can make every asset including fiat will destroyed, but the question is does it happen? Russia vs Ukraine isn't a world war currently. A big world war will make everything useless since the most important stuffs are foods, weapon and medicine.But it's world war, not halving event... I don't expect Bitcoin price will fall during the halving, it's only around 10% chance since most people are looking based on history.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "proTECH77",
      "created_time": "September 07, 2022, 04:03:24 PM",
      "body": "I don't think, there will be world war again but if there is Bitcoin will not collapse like other centralized currency,  because we experienced such challenges during the pandemic that made Bitcoin still more stand than fiat money at the moment. Many people are waiting for this bearish season to take like 2 or 3 years for them to use all their capital to purchase Bitcoin and hold until 2025 before they can sell to make a good income because by then the price of Bitcoin will reach $100k or 80k. The decreased of Bitcoin that happened early this year 2022 is for people like us to embrace the opportunity to use our monthly salary to buy and hold to have something good to achieve before the end of December.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "September 07, 2022, 04:29:47 PM",
      "body": "There's  no proof that halving directly affects the price in any way. Some believe it leads to a bullish market but fail to explain why it doesn't often happen right away. Some probably believe the price goes down because the reward gets smaller. In any case, it seems to me that most of major Bitcoin price movement has nothing to do with halving and does not happen around halving. As for miners, yeah, they can be mining at a loss, like any business can get in a situation of operating at a loss. Some will continue, hoping it will all be worth it in the end, while others will leave mining.Regarding the war, I think it's about the scope and character of the war and whether the Internet keeps being very accessible to many people, as well as electricity in general.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Raflesia",
      "created_time": "September 07, 2022, 04:41:26 PM",
      "body": "When we relate this to the world war, we certainly know that all will be affected and it is clear that finances will continue to decline, indirectly this is also a domino effect that will surely spread to bitcoin but on the other hand we also have to see the difference that can actually be seen. to be significant because with this world war it is clear that many people will look at bitcoin because the only reason is that they can be protected from inflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChiBitCTy",
      "created_time": "September 07, 2022, 07:20:47 PM",
      "body": "Quote from: Robert518 on September 07, 2022, 10:48:16 AMIn such an event, I believe the price of Bitcoin would plummet. What if it fell so low during the halving that miners couldn't recoup their costs? During a world war, I'm sure a lot of assets would be destroyed. But is BTC particularly vulnerable?I don’t think bitcoin simply going down during that time period of halving would necessarily make bitcoin plummet at all. I think it just all depends on the situation around that. Also yes bitcoin is going to take a big hit if there was another world war but so is everything else not to mention bitcoin will have some major advantages during times like that , many banks will freeze and bitcoin will not, for example.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}