{
  "id": "topic_5450624",
  "title": "Free Market Capitalist",
  "author": "Free Market Capitalist",
  "created_time": "April 29, 2023, 03:32:02 PM",
  "content": "So, I had been an Android user for a long time, specifically a high-end Samsung, except once when I got a Huawei or Xiaomi as a present, I don't remember.I recently decided to buy an Iphone to see for myself what was good about it and compare it with Android, because I had seen eternal debates on the internet and I preferred to decide for myself.I bought the Iphone 14, paid in cash, without insurance or shit, and after a few weeks of use, the only thing I see better than Android is the camera. The operating system sucks, and has disadvantages like it sucks to copy and paste conversations on Whatsapp, or not being able to edit a word you are writing when you see that you made a mistake in a letter without deleting the whole word. The swype keyboard sucks. The same for phone numbers: if you make a mistake while typing or you copy and paste a phone number and you want to add the international prefix, you can't do it, you have to delete the whole number and write it again without the error or with the prefix at the beginning, depending on the case.  In the end, I think it's at the very least equal to, if not worse than any $300 Android, which I came to the conclusion that if Apple has managed to sell shit at a gold price, I wanted to be part of the deal and have bought Apple stock.I know people with low incomes that finance the Iphone for 24 months and when the new one comes out they go to get it by refinancing (although they also get a discount for returning the old one). Apple has managed with the Iphones to sell an idea of status or prestige that has no justification in the quality of the product, but in the faith that their followers have in them.Therefore, I think it will continue to be a very good business for many years to come.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450624",
  "comments": [
    {
      "author": "EarnOnVictor",
      "created_time": "April 29, 2023, 04:45:08 PM",
      "body": "You just talked like an investor, they don't reason like the common people as you rather prefer to gain from Apple instead of giving them your money for what might not be worth it. I've always known that iPhone is an ostentatious good, you buy the popularity and relevance rather than the value for your money.This is so me, I prioritise investment over buying frivolities, especially when a cheaper thing could still serve the purpose perfectly well. There's nothing wrong with using expensive things but I prefer those things in terms of an asset, not goods like the iPhone that goes worthless the more I use it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "umbara ardian",
      "created_time": "April 29, 2023, 05:39:08 PM",
      "body": "It's unclear why you would purchase Apple stock if you believe their products, specifically iPhones, are garbage. Investing in a company typically indicates a belief in its ability to generate profits and create value for shareholders.Just because you're not satisfied with your iPhone doesn't mean everyone else is like you. People have different preferences and priorities when it comes to choosing a smartphone, and what works best for one person may not work for another.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lorence.xD",
      "created_time": "April 29, 2023, 05:42:29 PM",
      "body": "Quote from: umbara ardian on April 29, 2023, 05:39:08 PMIt's unclear why you would purchase Apple stock if you believe their products, specifically iPhones, are garbage. Investing in a company typically indicates a belief in its ability to generate profits and create value for shareholders.Just because you're not satisfied with your iPhone doesn't mean everyone else is like you. People have different preferences and priorities when it comes to choosing a smartphone, and what works best for one person may not work for another.Here in my country, Apple products such as iPhone are well known due to it's camera quality and too expensive for us. Knowing it's background probably it would be best to invest there as I know the quality of iPhone is good but of course we all know that cellphones also has their cons.I agree with you that people has their own preferences so reading the OP's post I disagree in some parts, if we don't like the products don't invest simply as that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "April 29, 2023, 06:05:17 PM",
      "body": "Quote from: umbara ardian on April 29, 2023, 05:39:08 PMIt's unclear why you would purchase Apple stock if you believe their products, specifically iPhones, are garbage. Investing in a company typically indicates a belief in its ability to generate profits and create value for shareholders.Just because you're not satisfied with your iPhone doesn't mean everyone else is like you. People have different preferences and priorities when it comes to choosing a smartphone, and what works best for one person may not work for another.OP just stated his view about a particular product which might not be the general view. I have some friends that will never use any other phone than iPhones. @EarnOnVictor might also be aware that in our country iPhones are cherished by some groups of people because they use them for their business. I have used an iPad and I also think I love the product.I also share OP's view that iPhones have built a high reputation that even when they produce low-quality products, loyal clients are already in the queue to purchase them. In some societies owning an iPhone is a symbol of belonging to the high-class of the society. Even Apple founder's daughter Eve Job once criticized the company when she said there was no difference between iPhone 13 and 14. Quote from: Lorence.xD on April 29, 2023, 05:42:29 PMI agree with you that people has their own preferences so reading the OP's post I disagree in some parts, if we don't like the products don't invest simply as that.Investment most time is not driven by love for the product but by how profitable the business will be. As much as the business is not illegal or immoral, even if I don't like or use the product, I will gladly invest in it if it is profitable. But truthfully Apple stock will be a good investment based on the product's reputable goodwill.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "April 29, 2023, 06:44:10 PM",
      "body": "Not every business that worked so far has to continue like that for a long time. Yes apple worked great so far and they are making a bank, plus they have other stuff like PC as well and a few others if I am not wrong, but that doesn't mean in 20 years they will be where they are, suddenly some competition could do something better and have the market share apple has today. Plus, if you spend money on buying the latest Samsung as well, that is a bit close, Samsung s23 ultra I believe is the latest one and the camera there is better too, there is absolutely nothing worse, everything is better, and yet people prefer phones. That will eventually change one day, not quickly, but it will slowly change. It already started with most of the world because there are cheap other phones, not everyone wants to pay 1k+ for a single phone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BRINIRHA",
      "created_time": "April 29, 2023, 07:15:53 PM",
      "body": "But anyway I like how apple has built their reputation in the market and among consumers. Even young people who prioritize style in life always feel they haven't followed today's lifestyle (outdated) if they don't have Apple products such as the Iphone. But to be honest I like apple Macbook laptops. I am comfortable using it until now. but for the phone I really have no interest in owning it. Even my employees have iphones. but instead I personally as a boss do not have it. I'm comfortable with both Samsung and HTC. because I put forward good quality but at a price that is also not too expensive. as long as they have the same usability and the performance is not much different then I will choose the cheaper one.I'm not sure how long Apple's popularity will last. But investing in it might also be something to pay attention to or consider. Because after all this giant company is really good at building a reputation throughout the country. The first impression that comes to mind when talking about apple is classy, ​​expensive and cool.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "April 29, 2023, 07:29:09 PM",
      "body": "Wait, so did you actually buy Apple stock or not?  I used to follow how their business was doing, but they dropped off my radar a few years ago when I sold the share or two that I owned.  If you didn't, it probably wouldn't be a bad idea to do so because you're spot-on in your assessment that what they sell as far as phones go are prestige items.  Not that I actually think iPhones are complete garbage, but the main reason I never owned one was because years ago you weren't able to put mp3 or other audio files on them, only Apple's proprietary MP4 ones.That might have changed, but I'm not the kind of person who uses their smartphone for a lot of things and I absolutely wouldn't buy one to show off to idiots I don't know and don't care to impress anyway.  I can whip out other things to do that job, lol.  Right now I've got an incredibly cheap Android that I wouldn't even be able to sell for $1 on eBay or wherever, and it does what I need it to just fine.Apple products have always been overpriced, going back to before the days of the iMac (yep, I owned one of those with the stupid circular mouse and everything).  As long as people keep seeing those products as goods to show off, they'll keep raking in the money.  And if their stock's P/E isn't through the roof, it might be a decent long-term investment even now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "April 29, 2023, 07:49:39 PM",
      "body": "Quote from: Poker Player on April 29, 2023, 03:32:02 PM...Apple has managed with the Iphones to sell an idea of status or prestige that has no justification in the quality of the product, but in the faith that their followers have in them.Therefore, I think it will continue to be a very good business for many years to come.You hit the nail on the head, apple products are no different than other luxury goods, like expensive handbags, clothes, jewelry, watches or cars, if you care only about the functionality you can get it for much cheaper with other products, but if you want to brag about owning something costly then you go for the luxury good, at the end it is a valid business strategy as many of those luxury brands have been around for a very long time and I expect the same to be the case when it comes to Apple.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "April 29, 2023, 08:10:06 PM",
      "body": "Quote from: Poker Player on April 29, 2023, 03:32:02 PMI came to the conclusion that if Apple has managed to sell shit at a gold price, I wanted to be part of the deal and have bought Apple stock.Yep, they did. Plus they use child labor and so on for cutting costs and their garbage is still getting more and more expensive.So yes, you may have done a good deal. However... Bitcoin usually is an even better deal. Would this mean that you already have enough Bitcoins (I am not sure what that means though) and you started diversifying?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "April 29, 2023, 08:13:40 PM",
      "body": "Apple has a lot of international deals and they're popular for the same reasons why brands like LV are popular and bring a lot of money to the owner. It's fashion, you can't reason with that.I've never owned a single Apple product. What kept me away was the price and the fact they have their own connectors, unlike USB that I've used since forever. I did not understand why I'd have to pay 2x for a product that requires special connectors to be used with my PC and that doesn't even have a headphone jack. For the last 5 years I'm a xiaomi user and it's been a great experience so far.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "April 29, 2023, 08:18:01 PM",
      "body": "Apple products may not be the best one can get for the money, I agree that the things they sell are over priced and mostly people seek to buy from them because the sense of elitism that the brand itself can give, it may be appealing to people who want to feel they belong to a higher social status.We can critic Apple for many things but both supporters and detractors can agree that company (specially when Steve Jobs was around) has mastered the art of advertisement and public relations.I personally believe there will come a time people will slowly realize they are not being treated fairly by Apple and their stock could start to under perform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "April 29, 2023, 08:34:43 PM",
      "body": "Impressive way of thinking; I honestly admire it. I've always been a low-end Android user, as I couldn't be bothered to spend a fortune on a phone. I couldn't fathom why people are paying a ton of money for such a smartphone when you can spend 1/3 of the money on something equivalent in specifications. A good portion of Apple's users are extremely fanatical and will buy whatever is released.As you've mentioned yourself, it's the so-called prestige that characterizes their products; no one is ever going to comment on your high-end Android phone. Apple is doing a great job keeping their customers fanatized.Anyway, good luck on your investment, I hope they are at least paying dividends that boost your final returns.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "teosanru",
      "created_time": "April 29, 2023, 09:11:11 PM",
      "body": "I would say it's sort of a non conventional way of thinking, even investors don't think like this. Most of the investors, invest in products and solutions which they feel are groundbreaking or have even solved problems in their own lives. Here I feel you are feeling that the product or the solution is a complete shit but the story that the product tells is good, which is why Apple is running nicely. I somehow agree with the story part, but will tell you one thing for sure. If a product is not worthy and only sells due to story telling, the company surely doesn't has a good future ahead so beware while investing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panganib999",
      "created_time": "April 29, 2023, 10:02:58 PM",
      "body": "Quote from: umbara ardian on April 29, 2023, 05:39:08 PMIt's unclear why you would purchase Apple stock if you believe their products, specifically iPhones, are garbage. Investing in a company typically indicates a belief in its ability to generate profits and create value for shareholders.Just because you're not satisfied with your iPhone doesn't mean everyone else is like you. People have different preferences and priorities when it comes to choosing a smartphone, and what works best for one person may not work for another. To spite the company probably. Instead of giving them any more of his money, he's seeing an opportunity to make money out of Apple's success in the smartphone market by cashing in on a few of their stocks. A little counterintuitive to some but whatever works really. I would agree with you though. I'm an iPhone user myself and even though there are times when I find some of its controls a little clunky, for the most part I could say it's the most streamlined device there is on the market. Add the fact that it's also the most secure and you're getting so much quality of life benefit out of the money you pay them.Specs-wise, It's not going to be the best, as many Chinese smartphone developers and manufacturers already offer something better specs-wise. But as an established brand they could just get away with the most ridonculous things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uchegod-21",
      "created_time": "April 29, 2023, 10:29:19 PM",
      "body": "I cam honestly say that your assessment of apple is based on your prolonged usage and knowledge of android. I know if you use apple for quite more time, you will give a totally different review to what you gave today.I am also not a fan of iPhone as I had used iPhone 11 some years ago and I didn't like how it worked for me, I quickly returned to my Samsung (one of the s series).But now many of my friends use it and what they say most about it  is the privacy aspect of it. Meanwhile, where I come from there's an unsaid tag that follows young iPhone owners.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mv1986",
      "created_time": "April 29, 2023, 11:36:06 PM",
      "body": "Quote from: teosanru on April 29, 2023, 09:11:11 PMI would say it's sort of a non conventional way of thinking, even investors don't think like this. Most of the investors, invest in products and solutions which they feel are groundbreaking or have even solved problems in their own lives. Here I feel you are feeling that the product or the solution is a complete shit but the story that the product tells is good, which is why Apple is running nicely. I somehow agree with the story part, but will tell you one thing for sure. If a product is not worthy and only sells due to story telling, the company surely doesn't has a good future ahead so beware while investing.It can't be about the story telling only. I doubt that the Apple products are worth as much as they actually are, but I have been an Apple user for a long time and apart from the fact that any necessary repairs are extremely expensive, I got stuff replaced for free most of the time. Their service has been pretty strong for me personally and they are quick to help. The only thing that is really a pain in the ass is the material smartphone producers use for their displays. I am sure they could be using material that can't get broken as easily. That was probably the biggest issue I had with my iPhones. But in general I think the devices are highly reliable. Never had a phone dying out of a sudden or anything like that. Now this is no safe bet per se, but Apple is also sitting on 200 billion USD in cash. Their ability to undertake major investments in R&D and to pay huge dividends for quite some time to come is probably a big pro from an investor's point of view.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "April 30, 2023, 04:11:28 AM",
      "body": "Quote from: The Sceptical Chymist on April 29, 2023, 07:29:09 PMWait, so did you actually buy Apple stock or not?  Yes I did. But I did it for the opposite of what would be logical at first glance: it would be logical for me to have bought shares because I believe they sell good products, and I did it for the opposite, because they sell bullcrap at the price of gold.Quote from: NeuroticFish on April 29, 2023, 08:10:06 PMWould this mean that you already have enough Bitcoins (I am not sure what that means though) and you started diversifying? My conception of how much Bitcoin to own is far from that of the maximalist user of this forum. I have not started diversifying now, I have been diversifying for a long time, my Bitcoin holdings are a small part of my net worth. Having all your net worth in Bitcoin is too risky IMO. Anyway, tech stocks like Apple are second only to Bitcoin in profitability over the last 15 years. It's not like I've stopped buying Bitcoin to buy some asset that gives me a 2% annual return.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ancafe",
      "created_time": "April 30, 2023, 04:16:31 AM",
      "body": "Quote from: Poker Player on April 29, 2023, 03:32:02 PMI know people with low incomes that finance the Iphone for 24 months and when the new one comes out they go to get it by refinancing (although they also get a discount for returning the old one). Apple has managed with the Iphones to sell an idea of status or prestige that has no justification in the quality of the product, but in the faith that their followers have in them.Therefore, I think it will continue to be a very good business for many years to come.In my country the iPhone is the most sought-after product and many people are even willing to buy it on credit, even though they don't have cash because it's hard to get a job nowadays. What I saw in this product is nothing special, more or less the same as other products such as Samsung. They have controlled the market and generally use this product by the upper middle class, but unfortunately in my country there are almost many teenagers who extort their parents to buy these goods. The goal is nothing but to show his friends that they are people who can afford it and no longer buy products based on user needs.I have a cell phone that is cheaper than an iPhone, but I can take advantage of all the features available to support it and for me this is far more sufficient than having to buy an iPhone. Returning to the idea or prestige attached to these products which has justification in the quality of iPhone and Apple products. This business has grown rapidly and my suggestion is that the Asian region is the place you should go if you want to develop a business in these two products because currently the usage trend in the Asian region continues to increase for these products.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "April 30, 2023, 04:58:27 AM",
      "body": "Quote from: ancafe on April 30, 2023, 04:16:31 AMIn my country the iPhone is the most sought-after product and many people are even willing to buy it on credit, even though they don't have cash because it's hard to get a job nowadays. What I saw in this product is nothing special, more or less the same as other products such as Samsung. They have controlled the market and generally use this product by the upper middle class, but unfortunately in my country there are almost many teenagers who extort their parents to buy these goods. The goal is nothing but to show his friends that they are people who can afford it and no longer buy products based on user needs.This is what I mean, Iphone purchases are usually more emotional than rational, almost of faith I would say. A lot of people expectantly awaiting the unveiling of each new Iphone and lining up to buy it when the reality is that it's a little less shitty than the last one and that a $300 Android works just as well if not better. It is also a way of trying to appear status, in a crude way, because if you have a Ferrari you are seen with status but almost nobody can afford it. On the other hand, people with very low income believe that with the apple on the back of the phone they look like they have a certain status or prestige.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}