{
  "id": "topic_5413943",
  "title": "Cuda911",
  "author": "Cuda911",
  "created_time": "September 18, 2022, 07:15:03 AM",
  "content": "The new Ethereum PoW is a useless coin, there will never be any demand for such a coin that has no usefulness than a proof of work algorithm, no DeFi usecase, no Smart Contract use case, what is this coin good for? Honestly we miners have been scammed, this is a scam that no one needs.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413943",
  "comments": [
    {
      "author": "maXonja",
      "created_time": "September 18, 2022, 07:40:23 AM",
      "body": "How are you beeing scamed? No one is forcing you to mine it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JangoUnchained",
      "created_time": "September 18, 2022, 01:55:14 PM",
      "body": "Vitalik is not a scammer, he is more like a traitor, he became everything he was fighting against, from decentralized to centralised, I think it's a go ahead for him now if regulation is for real, maybe there was never a true decentralisation, who knows? It's a dream that crypto could build that but now I guess not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "badbart",
      "created_time": "September 18, 2022, 02:44:20 PM",
      "body": "This is why I'm shorting it, I would love it to be successful but its junk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "September 18, 2022, 02:55:38 PM",
      "body": "Quote from: JangoUnchained on September 18, 2022, 01:55:14 PMVitalik is not a scammer, he is more like a traitor, he became everything he was fighting against, from decentralized to centralised, I think it's a go ahead for him now if regulation is for real, maybe there was never a true decentralisation, who knows? It's a dream that crypto could build that but now I guess not.I think OP is talking about ETH POW, it's the fork of ETH, it's another coin.They did this fork of ETH to continue mining, it's suppose to benefit miners, but a coin needs more than that, only time will tell if the coin will succeed.I think it's hard to do, because people will always compare to ETH, and even if some people don't like, Vitalik and the devs of ETH are great, it's not lucky they have ETH at second place of marketcap, and lots of another projects running on ETH.In my opinion, ETH POW will need to do some different things to succeed, not only repeating the same features of ETH.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "September 18, 2022, 04:54:57 PM",
      "body": "Quote from: rdluffy on September 18, 2022, 02:55:38 PMQuote from: JangoUnchained on September 18, 2022, 01:55:14 PMVitalik is not a scammer, he is more like a traitor, he became everything he was fighting against, from decentralized to centralised, I think it's a go ahead for him now if regulation is for real, maybe there was never a true decentralisation, who knows? It's a dream that crypto could build that but now I guess not.I think OP is talking about ETH POW, it's the fork of ETH, it's another coin.They did this fork of ETH to continue mining, it's suppose to benefit miners, but a coin needs more than that, only time will tell if the coin will succeed.I think it's hard to do, because people will always compare to ETH, and even if some people don't like, Vitalik and the devs of ETH are great, it's not lucky they have ETH at second place of marketcap, and lots of another projects running on ETH.In my opinion, ETH POW will need to do some different things to succeed, not only repeating the same features of ETH.I think offering the same features as ETH and on top of them to be a mineable coin like EthW wants to be and help the community should be enough to make this coin to take the second place from ETH which is currently second (but most probably not for long).If on top of that the community and developers of EthW are able to implement even more features than the ones running on ETH then this is a no brainer that this coin is going to be the new one in the second place at market cap and also keeping all of us miners happy,I have the rigs shut down but most likely will turn them on soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xylber",
      "created_time": "September 18, 2022, 05:12:50 PM",
      "body": "Obviously it is a stupid coin with the only purpose of keep mining, but has 0 development. Just sell it and done. Quote from: JangoUnchained on September 18, 2022, 01:55:14 PMVitalik is not a scammer, he is more like a traitor, he became everything he was fighting against, from decentralized to centralised, I think it's a go ahead for him now if regulation is for real, maybe there was never a true decentralisation, who knows? It's a dream that crypto could build that but now I guess not.ETH POS was planned since the very beggining and should be here since 2018. Miners should be thankful of having these extra 4 years to mine. Who knows, maybe crypto wouldn't be so mainstream if mining were not so profitable, and we would never had a GPUs shortage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JayDDee",
      "created_time": "September 18, 2022, 05:53:33 PM",
      "body": "Protest coins never do well, just look at all the BTC forks from a few years ago.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "September 18, 2022, 08:49:40 PM",
      "body": "Quote from: swogerino on September 18, 2022, 04:54:57 PMI think offering the same features as ETH and on top of them to be a mineable coin like EthW wants to be and help the community should be enough to make this coin to take the second place from ETH which is currently second (but most probably not for long).If on top of that the community and developers of EthW are able to implement even more features than the ones running on ETH then this is a no brainer that this coin is going to be the new one in the second place at market cap and also keeping all of us miners happy,I have the rigs shut down but most likely will turn them on soon.I don't know swogerino, ETH is different than Bitcoin for example.ETH is totally dependent on Vitalik, and he is probably one of the best minds of crypto, people trust Vitalik, not only ETH itself.ETH pow will fight against ETC too, not only ETH, so it will be pretty hard to survive. ETH POW is not the only coin to mine, there's ETC too, ERGO and RVN.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "September 18, 2022, 08:58:26 PM",
      "body": "QuoteETH pow will fight against ETC too, not only ETH, so it will be pretty hard to survive. ETH POW is not the only coin to mine, there's ETC too, ERGO and RVN.This is something beneficial for these coins as ETC and ERGO got almost all of the ETH hash rate so we need another good coin to get back some of that hash rate because with the price of ETC and the apparent increase in difficulty sure it is not a good coin to be mined anymore,the same can be said for ERGO,only RVN didn't get that huge of an hash rate and is some what better to mine than ETC and ERGO but pretty soon it will not be anymore seeing how things are going.Maybe people trusted Vitalik but right now most of them will not anymore after switching from PoW to PoS and centralizing ETH to a huge degree,most crypto owners do not like centralization which is against core philosophy of crypto itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Myleschetty",
      "created_time": "September 18, 2022, 10:11:00 PM",
      "body": "Quote from: JangoUnchained on September 18, 2022, 01:55:14 PMVitalik is not a scammer, he is more like a traitor,Scam is done in anyways in crypto and he can say Vitalik is a scammer because he didn't follow the ETH2.0 roadmap as it was illustrated years ago.Quote from: JangoUnchained on September 18, 2022, 01:55:14 PMhe became everything he was fighting against, from decentralized to centralisedI don't understand what you're saying by from decentralized to centralized. How's POW a centralized protocol?Quote from: JangoUnchained on September 18, 2022, 01:55:14 PMI think it's a go ahead for him now if regulation is for real, maybe there was never a true decentralisation, who knows? It's a dream that crypto could build that but now I guess not.There's decentralization in crypto if you search deep and you don't want to be bothered by all this naive crypto dev just bag your fund on Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Salamande",
      "created_time": "September 18, 2022, 10:32:23 PM",
      "body": "Problem with any new ETH fork, is the the BIG ETH holder got some huge amount of those newly created fork. So they can dump this to hurt any good attempt of creating another good ETH minable coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "badbart",
      "created_time": "September 18, 2022, 11:00:36 PM",
      "body": "What is the difference between ETC and ETHW?  Why would a developer pick ethw over etc?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "September 18, 2022, 11:55:38 PM",
      "body": "Quote from: swogerino on September 18, 2022, 04:54:57 PMI think offering the same features as ETH and on top of them to be a mineable coin like EthW wants to be and help the community should be enough to make this coin to take the second place from ETH which is currently second (but most probably not for long).If on top of that the community and developers of EthW are able to implement even more features than the ones running on ETH then this is a no brainer that this coin is going to be the new one in the second place at market cap and also keeping all of us miners happy,I have the rigs shut down but most likely will turn them on soon.At the end of the day it's all about the numbers my friend. Whether the developers implement more features or not. if the numbers are not there EthW will keep going downwards just like you saw with ETC or all those Bitcoin folks you have witnessed.Honestly I don't see EthW surpassing ETH in terms of marketcap let alone even get close to top 10. the coin is taking a huge dump.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "September 19, 2022, 03:20:31 AM",
      "body": "I wouldn't short it however.This reminds me of what happened with Bitcoin Cash when it launched. People assumed it would go to $0.However it traded between $200-$300 for a few weeks and then boom. 10x gains or so. Many will dump the airdrop and many whales will buy it up to pump it. So shorting it is just crazy. Maybe short it after it pumps.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Getmon",
      "created_time": "September 19, 2022, 04:17:22 AM",
      "body": "OP nobody is forcing you to mine ETHW. Do not claim your ETHW if you think they are scamming you. But I know you will sell it because at the bottom of your mind it is free money at zero effort.The dumping started already. Price per ETHW was $4 an hour ago. I made another check and it is now at $5.17. Did it bottomed already? And just like BCH, whales will pump this coin for some gains. Many big miners are whales too, and together with the anti-Vitalik group, they will try to stabilize this coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batsonxl",
      "created_time": "September 19, 2022, 05:39:26 AM",
      "body": "Thanks to google ads i saw this somewhere: short the merge   i was unhappy anyway and shorted all what i got since eth 1800$ today im closed it thanks Vitka for merge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "September 19, 2022, 01:06:39 PM",
      "body": "Quote from: Getmon on September 19, 2022, 04:17:22 AMOP nobody is forcing you to mine ETHW. Do not claim your ETHW if you think they are scamming you. But I know you will sell it because at the bottom of your mind it is free money at zero effort.The dumping started already. Price per ETHW was $4 an hour ago. I made another check and it is now at $5.17. Did it bottomed already? And just like BCH, whales will pump this coin for some gains. Many big miners are whales too, and together with the anti-Vitalik group, they will try to stabilize this coin.I don't think it bottommed yet. The bottom will be once Binanace, Coinbase and a few other exchanges creddits their users and allows trading. Most likely it'll be a slow grind down. Then it'll find a bottom somewhere, trade for a few weeks and then some whales might end up pumping it if they feel like it.Then it'll top out at $50 or $100, people will think it'll be the next real ETH and it'll peak like Bitcoin Cash did at like $3000-$4000 with retail holding the bag.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aio Ikari",
      "created_time": "September 19, 2022, 01:50:08 PM",
      "body": "Quote from: adaseb on September 19, 2022, 01:06:39 PMQuote from: Getmon on September 19, 2022, 04:17:22 AMOP nobody is forcing you to mine ETHW. Do not claim your ETHW if you think they are scamming you. But I know you will sell it because at the bottom of your mind it is free money at zero effort.The dumping started already. Price per ETHW was $4 an hour ago. I made another check and it is now at $5.17. Did it bottomed already? And just like BCH, whales will pump this coin for some gains. Many big miners are whales too, and together with the anti-Vitalik group, they will try to stabilize this coin.I don't think it bottommed yet. The bottom will be once Binanace, Coinbase and a few other exchanges creddits their users and allows trading. Most likely it'll be a slow grind down. Then it'll find a bottom somewhere, trade for a few weeks and then some whales might end up pumping it if they feel like it.Then it'll top out at $50 or $100, people will think it'll be the next real ETH and it'll peak like Bitcoin Cash did at like $3000-$4000 with retail holding the bag.ethw wont even be 50.and never 3 or 4k.eth may never recover its ath with this transition to pos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RentGPU",
      "created_time": "September 19, 2022, 02:26:57 PM",
      "body": "Greed destroyed crypto in many ways , we just can't do anything about it , POW or POS only the rich will eat the cake eth just destroyed everything",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}