{
  "id": "topic_5461836",
  "title": "tech30338",
  "author": "tech30338",
  "created_time": "August 02, 2023, 02:14:32 PM",
  "content": "We have windows and Linux operating system running for our computers windows , and Linux operating system with lots of flavors to choosebitcoin and crypto also have their operating system, called over ledger operating system, made by quant networks ,this is needed for bitcoin and others to work.I thought it runs in Linux operating system since its an opensource and also because of widely use by the communities I guess I was wrong, Here is the link about it:https://www.golinuxcloud.com/blockchain-operating-system/#:~:text=The%20Overledger%20Operating%20System,-The%20Overledger%20operating&text=It%20was%20created%20by%20Quant,as%20an%20enterprise%20operating%20system.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461836",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "August 02, 2023, 02:56:09 PM",
      "body": "An operating system is a software that helps in the running of programs on a device. It basically integrates the hardware components and the software which allows apps to function. Bitcoin does not need its own operating system, that's a whole new field which spreads far beyond crypto and even currencies.You can choose to run your node on an OS of your choice, preferablly TAILS or Ubuntu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "August 03, 2023, 10:12:13 AM",
      "body": "It will make much sense, especially for security reasons, to have a simple Bitcoin/crypto compatible PC and mobile phones operating system called Bitcoin Operating System for running only Open-source Applications, Bitcoin nodes and nodes of other Decentralized Applications that can safely connect to the Bitcoin Network. We could just have seperate laptops and phones for running the open-source decentralized apps rather than running them on our regular device",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "August 03, 2023, 10:19:06 AM",
      "body": "Based on your article, it looks like people who use term \"Blockchain Operating System\" intentionally misuse term \"Operating System\" to make certain cryptocurrency/blockchain system sounds more powerful/useful. It's not like we can install it to empty computer or smartphone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "August 03, 2023, 12:07:06 PM",
      "body": "Looks like a paid article or an article from a text spinner. The writer is also not clear. Does the website have any credibility, to begin with? Some parts of the articles look like it was paraphrased from Investopedia on more or less the same topic[1]. I suggest you not use their definition which is deliberately misleading. [1] https://www.investopedia.com/terms/b/blockchain-operating-system.asp",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sinzu_",
      "created_time": "August 07, 2023, 08:32:34 PM",
      "body": "Quote from: tech30338 on August 02, 2023, 02:14:32 PMWe have windows and Linux operating system running for our computers windows , and Linux operating system with lots of flavors to choosebitcoin and crypto also have their operating system, called over ledger operating system, made by quant networks ,this is needed for bitcoin and others to work.I thought it runs in Linux operating system since its an opensource and also because of widely use by the communities I guess I was wrong, Here is the link about it:https://www.golinuxcloud.com/blockchain-operating-system/#:~:text=The%20Overledger%20Operating%20System,-The%20Overledger%20operating&text=It%20was%20created%20by%20Quant,as%20an%20enterprise%20operating%20system.Great article but I am slightly confused. Why does Bitcoin need its own OS?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "August 07, 2023, 08:57:56 PM",
      "body": "Quote from: tech30338 on August 02, 2023, 02:14:32 PMbitcoin and crypto also have their operating systemNo they don't.  Bitcoin is open-source and compatible with almost every OS under the sun, and it certainly doesn't have or need \"it's own.\"  Overledger is a proprietary OS that needs to be purchased to use, which obviously means it's not open-source.  I think you're confused by Quant's advertising and promotion campaigns, but I'm not sure how you got there.Overledger is just another operating system, with built-in technology for blockchain management and integration.  I don't know what kernel it's based on, but I'll bet it's one of the more popular free Linux distros such as Debian or OpenBSD.  It's designed to help blockchain companies build and integrate blockchains more efficiently and faster.  At least that's what I've gathered from their literature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coindigitalcoin",
      "created_time": "August 08, 2023, 09:44:53 AM",
      "body": "I guess one could consider it a meta-os that can exist on a variety of OS.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "August 08, 2023, 10:49:11 AM",
      "body": "It does not. The article is clickbait bullshit at the very least, very likely even AI generated.Some gems (i.e. completely false statements):QuoteThe Blockchain operating system has a better user experience and has facilitated easier development.QuoteMost of the popular blockchains, including Bitcoin, Ripple, Ethereum, Corda, etc., use this platform [Overledger OS] as an enterprise operating system.QuoteThe entrepreneurial operating system is a blockchain operating system that is simple and multi-purpose platform for the development of decentralized applications.I just did a quick web search; EOS is not even an operating system at all! It's a set of business guidelines...Quote from: https://www.eosworldwide.com/what-is-eosEOS, the Entrepreneurial Operating System, is a complete set of simple concepts and practical tools that has helped thousands of entrepreneurs around the world get what they want from their businesses.Quote from: tech30338 on August 02, 2023, 02:14:32 PMbitcoin and crypto also have their operating system, called over ledger operating system, made by quant networks ,this is needed for bitcoin and others to work.No, this is completely false. Bitcoin runs through Bitcoin Core which you can install on any desktop OS of your choice. It was developed by Satoshi and the Bitcoin community; 'Quant Networks' has contributed nothing to it.Quote from: tech30338 on August 02, 2023, 02:14:32 PMI thought it runs in Linux operating system since its an opensource and also because of widely use by the communities I guess I was wrong, Don't blindly trust everything you find on sketchy web articles. You actually were not wrong; most people run Bitcoin Core on Linux machines, although it also runs on Windows and macOS. The website is simply wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "August 08, 2023, 11:59:59 AM",
      "body": "Quote from: n0nce on August 08, 2023, 10:49:11 AMQuote from: tech30338 on August 02, 2023, 02:14:32 PMI thought it runs in Linux operating system since its an opensource and also because of widely use by the communities I guess I was wrong, Don't blindly trust everything you find on sketchy web articles. You actually were not wrong; most people run Bitcoin Core on Linux machines, although it also runs on Windows and macOS. The website is simply wrong.The thing that Blockchain itself is not an operating system while the website refers it as OS is very funny. It already felt wrong when I read it as OS and since various thread that are published on the forum itself tells us how it algorithm that is creating nodes, adding the info in it, building it into a block, and repeating the process as we move. If I am not wrong then it is simply a mathematical expression getting resolved using miners brain and once its resolved we get the confirmation. Everything runs through the miners OS, transacts/broadcasts through the wallets, and all of them runs on specific OS. I mean that's the simplification, I know it could be layman - layman explanation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zoomic",
      "created_time": "August 09, 2023, 03:51:51 PM",
      "body": "Quote from: tech30338 on August 02, 2023, 02:14:32 PMBitcoin has its own operating system The contradiction started from the article writter and maintained by you. While the article is talking about blockchain OS, you are saying about BTC OS. If there be a BTC OS, it means that only Bitcoin related tasks will run on it.QuoteA blockchain operating system is a layer beneath the software that uses blockchain as a support system that runs on the system or platform. What an unclear definition. A new innovation if it is practicable should be able to be explained in an understandable language.  \"A layer beneath which software \"?QuoteThe Blockchain operating system has a better user experience and has facilitated easier development.What a bogus statement.  The blockchain OS, has a better user experience than which OS?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}