{
  "id": "topic_5476546",
  "title": "BenCodie",
  "author": "BenCodie",
  "created_time": "December 04, 2023, 09:18:22 PMLast edit: December 05, 2023, 08:38:13 PM by BenCodie",
  "content": "Dear Theymos,This is a letter to you, urging a medium for the recent Ban on mixers, and presenting a solution that has been proposed and voted on already for 11 months.We can all agree that centralized mixers can never be pure, that is out of even the operators control. This point is clearly understood in the recent decision to ban custodial mixers on the forum on basically all fronts, in order to remove liability and to keep this forum safe from persecution. However, the result this will have on innocent users will be significant. One benefit of allowing advertising of these campaigns (that will become clearer from the ban forward) is the force of good practice on services by holding reputation as collateral in exchange for advertising. Services can not steal from users or do so on an isolated level, they could not be unfair to users in a subtle way, and they must do as the service promises and no less, or else the service will immediately face negative attention from the community. Aside from the economic benefits it provided to users through signature campaigns, the advertising of mixers (and other services) provided oversight to mixers and kept forum users safe, at the cost of the service through advertising costs rather than community volunteering.As of this ban, the goal of privacy through a centralized mixer will become increasingly risky, and without advertising causing the eyes of many to monitor and ensure mixer legitimacy, the mixing industry will become a very dangerous place for anyone to be a part of. Humans are creatures of habit, until habits are forced to change. For those who don't know other solutions to help achieve on chain privacy, it is likely that they will still seek out mixers and it is likely that the reduced liability following the mixer ban will lead to scams and loss of Bitcoins to the mixing industry. With no names of services being allowed in the forum from the ban forward, it will be virtually impossible to report these scams effectively in the scam accusations board.The complete removal of these tools are an attack on Bitcoin privacy, and presents risks to privacy and safety going forward if there is no medium solution, so, a medium should be found before January 1 if the privacy of users on this forum are of care to the administration of this forum...and thanks to the work of your community, the medium is already in front of you, theymos.Over all months of 2023, the community have thoroughly discussed the addition of a cybersecurity and privacy board on the forum. Following discussion, community members who were passionate about this request additionally cast written, reasoned votes in an unofficial community voteThe results of these polls proved that the majority of the active community have achieved two consensus votes to add a board that is focused on Cybersecurity and PrivacyThe results of the forum poll in the discussion thread yielded 66 yes votes (91.7%) vs. 6 no votes (8.3%)The results of the unofficial community vote yielded 26 written yes votes (96.2%) vs 1 written no vote (3.8%)The community is very much in favor of this board for a variety of reasons discussed. 3 of these reasons are:- Cybersecurity is an integral topic to support the security of Bitcoin storage.- System security is layer 0 to the storage of Bitcoin (layer 1, if you will)- Privacy is a fundamental human right, as Bitcoin has propagated since day 1. Discussion about privacy is integral, especially since privacy can no longer be achieved by paying a service fee (due to mixers being banned)The discussion of Cybersecurity and Privacy can usher a new wave of legitimate discussion that will empower individuals with the ability to be and feel safe within the bitcoin ecosystem, within this bitcoin community and on the internet, in the face of an increasingly unsafe digital world. The board will help reduce growing vulnerabilities to theft, spying and targeting through discussion about defence from the aforementioned.With this board, you will be providing not just what the forum should already have, but also a fair medium between the censorship of mixing services, and adding this board will prove to us all that you care for the communities safety of their assets, and privacy of their forum usage, bitcoin ecosystem participation and internet usage.Please do not leave us in the dark any longer, and provide the community with one of two of the following outcomes to this request before the mixer ban takes effect on January 1, 2024:1. Provide a reasoned response as to why the community can not have this board despite clear consensus that this is what the community wants.2. Add the Cyber security and Privacy board in the Other category of the forum:Quote from: BenCodie on January 12, 2023, 04:15:51 AMName: Cybersecurity and PrivacyCategory: OtherDescription: Discussion about cybersecurity and online privacy and its improvement to minimize the risk of data breaches, hacks, tracking or system compromise which may result in exploitation or loss of Bitcoins.It has been discussed to have the main board as the discussion board, news, questions, general topics, etc. with a child board purposed specifically to be a knowledgebase, including compiled community contributed information that can help to achieve either cybersecurity and/or privacy. It has also been discussed to make news a separate child board, rather than mixing it into the main board. Do as you wish with this information, alongside the wealth of information in the discussion topic.Respectfully, a response as to which outcome the community can expect before the mixer ban becomes active on January 1, 2024 would be appreciated.Thank you.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476546",
  "comments": [
    {
      "author": "Shenanigan",
      "created_time": "December 06, 2023, 09:13:19 PM",
      "body": "Quote from: BenCodie on December 04, 2023, 09:18:22 PMThe community is very much in favor of this board for a variety of reasons discussed. 3 of these reasons are:- Cybersecurity is an integral topic to support the security of Bitcoin storage.- System security is layer 0 to the storage of Bitcoin (layer 1, if you will)- Privacy is a fundamental human right, as Bitcoin has propagated since day 1. Discussion about privacy is integral, especially since privacy can no longer be achieved by paying a service fee (due to mixers being banned)This forum doesn't care about privacy. User Loycev has many more privileges and rights than a regular user. He can see things that the average user cannot see. However, Loycev is not an even a global moderator. This is a potential threat to the security of the forum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "December 06, 2023, 09:16:58 PM",
      "body": "Quote from: Shenanigan on December 06, 2023, 09:13:19 PMUser Loycev has many more privileges and rights than a regular user. However, Loysev is not an even a global moderator. This is a potential threat to the security of the forumI see that you keep writing things that you know nothing (or very little) about, but I will ask you nevertheless to mention some of those \"rights and privileges\" that he has and the other regular users don't and what it has to do with OP's topic of the thread?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shenanigan",
      "created_time": "December 06, 2023, 09:25:49 PM",
      "body": "Quote from: Rikafip on December 06, 2023, 09:16:58 PMI will ask you nevertheless to mention some of those \"rights and privileges\" that he has and the other regular users don'tLoyceV has ability to unban. But he is not a global moderator. How is this even possible?Quote from: Rikafip on December 06, 2023, 09:16:58 PMand what it has to do with OP's topic of the thread?This has to do with privacy. If LoyceV has ability to unban, than with high probability LoyceV may has access to ip's of users like global moderators has",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EL MOHA",
      "created_time": "December 06, 2023, 09:32:11 PM",
      "body": "Quote from: Shenanigan on December 06, 2023, 09:25:49 PMQuote from: Rikafip on December 06, 2023, 09:16:58 PMI will ask you nevertheless to mention some of those \"rights and privileges\" that he has and the other regular users don'tLoyceV has ability to unban. But he is not a global moderator. How is this even possible?LoyceV has the ability to unban?, who did he unban that made you say so? And only admin or probably mods can do that he doesn’t belong in any of those categories. Also I don’t see the issue or unbanning related to this thread. Don’t derail the thread and allow others make valuable contributions rather than trolling",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "December 06, 2023, 09:34:04 PM",
      "body": "Quote from: Shenanigan on December 06, 2023, 09:25:49 PMLoyceV has ability to unban. But he is not a global moderator. How is this even possible?First of all, he can whitelist members who got affected with \"evil fee\" and 2nd, he is not the only one as theymos added few more members that can do that. If you took some time to study the matter you would understand that's actually a good thing. Quote from: Rikafip on December 06, 2023, 09:16:58 PMThis has to do with privacy. If LoyceV has ability to unban, than with high probability LoyceV may has access to ip's of usersAnd yet again you showed that you have no idea what you are talking about. Anyway, I don't wanna derail this thread further so gonna stop now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shenanigan",
      "created_time": "December 06, 2023, 09:38:09 PM",
      "body": "Quote from: Rikafip on December 06, 2023, 09:34:04 PMQuote from: Shenanigan on December 06, 2023, 09:25:49 PMLoyceV has ability to unban. But he is not a global moderator. How is this even possible?First of all, he can whitelist members who got affected with \"evil fee\" and 2nd, he is not the only one as theymos added few more members that can do that. If you took some time to study the matter you would understand that's actually a good thing. This is a \"right and privilege\" that LoyceV has and the other regular users don'tQuote from: EL MOHA on December 06, 2023, 09:32:11 PMDon’t derail the thread and allow others make valuable contributions rather than trolling Don't try to shut everyone's mouths, people see everything. This is not trolling, but a discussion where simple folks will be expose a snickering high-ranking old-timersMake way for newcomers",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "December 06, 2023, 09:59:26 PM",
      "body": "Quote from: Shenanigan on December 06, 2023, 09:25:49 PMThis has to do with privacy. If LoyceV has ability to unban, than with high probability LoyceV may has access to ip's of users like global moderators hasLoyceV does not have the ability to unban users. Adding forum users to a \"whitelist\" is a slightly different thing. And yes, global moderators do not see the IP addresses of forum users. Only forum administrators can see the IP addresses of forum users.Quote from: theymos on March 15, 2015, 06:57:53 AMOnly administrators have access to user IPs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shenanigan",
      "created_time": "December 06, 2023, 10:09:25 PM",
      "body": "Quote from: Xal0lex on December 06, 2023, 09:59:26 PMQuote from: theymos on March 15, 2015, 06:57:53 AMOnly administrators have access to user IPs.Only administrators? Give me full list of these administrators. I thought theymos was the only one administrator hereQuote from: Xal0lex on December 06, 2023, 09:59:26 PMLoyceV does not have the ability to unban users. Adding forum users to a \"whitelist\" is a slightly different thing. Whats the difference? Whitelsiting - is a privilege",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "December 06, 2023, 10:16:58 PM",
      "body": "Quote from: Shenanigan on December 06, 2023, 09:13:19 PMUser Loycev has many more privileges and rights than a regular user. He can see things that the average user cannot see. Sounds like sorcery. Internet is full of mystery after all. Fyi user roles features can be given to someone, everyone will know what their roles by special role given by the admins.Quote from: Shenanigan on December 06, 2023, 10:09:25 PMOnly administrators? Give me full list of these administrators. I know only theymosYou even didn't know how many admins this forum have. You should read more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vod",
      "created_time": "December 06, 2023, 10:20:49 PM",
      "body": "Quote from: Shenanigan on December 06, 2023, 09:13:19 PMThis forum doesn't care about privacy. User Loycev has many more privileges and rights than a regular user. He can see things that the average user cannot see. Name one thing LoyceV has access to that you do not.  Liars are not trustworthy, friend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "December 06, 2023, 10:33:55 PM",
      "body": "Quote from: Shenanigan on December 06, 2023, 10:09:25 PMQuote from: Xal0lex on December 06, 2023, 09:59:26 PMQuote from: theymos on March 15, 2015, 06:57:53 AMOnly administrators have access to user IPs.Only administrators? Give me full list of these administrators. I thought theymos was the only one administrator hereInstead of offtopic and trolling, better do some forum research if you're so interested. There is a topic with a list of all forum staff in the same section List of the forum's admins/ global moderators/ staffs. If you had the desire, you would have no problem finding it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "December 06, 2023, 10:36:23 PM",
      "body": "Quote from: Shenanigan on December 06, 2023, 10:09:25 PMQuote from: Xal0lex on December 06, 2023, 09:59:26 PMQuote from: theymos on March 15, 2015, 06:57:53 AMOnly administrators have access to user IPs.Only administrators? Give me full list of these administrators. I thought theymos was the only one administrator hereyou really need to follow what LoyceV suggested.anyway, from what I know Theymos and Cyrus(check the link to see cyrus's position) are the admins on this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shenanigan",
      "created_time": "December 06, 2023, 10:39:29 PM",
      "body": "Quote from: LoyceV on July 20, 2021, 03:59:04 PMNow the tricky part: apart from including your Bitcointalk username, you'll need to convince me you deserve it. In my opinion, this Loycev is very arrogant. Sounds very arrogant. No self-respecting person who accidentally ends up in a proxyban deserves to be treated like that",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nutildah",
      "created_time": "December 07, 2023, 01:41:53 AM",
      "body": "Quote from: BenCodie on December 04, 2023, 09:18:22 PM1. Provide a reasoned response as to why the community can not have this board despite clear consensus that this is what the community wants.2. Add the Cyber security and Privacy board in the Other category of the forum:Although I don't think such a board would be a totally unreasonable idea, putting demands on theymos has traditionally not yielded fruitful results. I don't think the decision to ban mixers was taken lightly. He puts a lot of consideration into making these types of decisions before announcing them.Quote from: Shenanigan on December 06, 2023, 10:39:29 PMIn my opinion, this Loycev is very arrogant. Sounds very arrogant.You will receive back the energy you project into the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "December 07, 2023, 01:56:37 AM",
      "body": "Quote from: Shenanigan on December 06, 2023, 09:25:49 PMLoyceV has ability to unban. But he is not a global moderator. How is this even possible?LoyceV is like some forum users who can whitelist newbies. I don't know how they got those rights to do it but I see nothing is harmful for the community with it (I could be wrong of course, feel free to correct me).Unban, I think it is not a too relevant term to use about LoyceV's power/ rights/ privileges!Remove Proxyban (evil fees) - email to get whitelisted for free (LoyceV)Whitelisting for Brand New accounts (Enable posting) (Upgrade00)Remove Proxyban (evil fees) - whitelisted for free | my list (hugeblack)They are all not forum moderators!Quote from: acroman08 on December 06, 2023, 10:36:23 PManyway, from what I know Theymos and Cyrus(check the link to see cyrus's position) are the admins on this forum. There are admins who left the forum like satoshi, sirius and recent years, we have only 2 admins: theymos and Cyrus.List of the forum's admins/ global moderators/ staffsBitcointalk's important historic changesQuote from: tranthidung on September 23, 2019, 06:23:57 AMForum administratorsFounder and first admin: satoshi. Created this forum on Nov 22, 2009theymos was promoted as one of admins in 2011 together with Gavin Andersen and siriussirius become the head admin since 2012 since the disappearance of satoshi until 2012Since 2012, theymos was the head admintheymos did not have any special access to Bitcointalk.org and its DNS until around 2013 not sure. It seems theymos mistakenly remembered something with time in 2012 and 2013.Since still searching, forum has a second head admin, Cyrus",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vod",
      "created_time": "December 07, 2023, 02:49:59 AM",
      "body": "Quote from: nutildah on December 07, 2023, 01:41:53 AMYou will receive back the energy you project into the world.For the last few years I have been projecting very negative energy, hoping for a return!  Forget THC, I'd like just 1g of negative energy (worth $62.5 trillion dollars according to Google).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nutildah",
      "created_time": "December 07, 2023, 03:30:34 AM",
      "body": "Quote from: Vod on December 07, 2023, 02:49:59 AMFor the last few years I have been projecting very negative energy, hoping for a return!  Me too Vod. It would be great to have the old Vod back. A lot of us in the early (early-ish) days looked up to you as a force for doing what's right. You've accumulated a lot of wisdom and experience over the years and could easily return to a position of being able to share it with others.Quote from: Vod on December 07, 2023, 02:49:59 AMForget THC, I'd like just 1g of negative energy (worth $62.5 trillion dollars according to Google).Sounds like its really potent stuff!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "December 07, 2023, 04:32:08 AM",
      "body": "Wonderful thread this, I laughed a lot. You have to see what you can see lately in Meta. First we have our friend BenCodie who takes advantage of the mixers ban to push his much loved Cybersecurity and Privacy board, which seems reasonable to me, and more considering the positive votes it has had in the forum, but it seems to me that the promotion of this topic is not purely disinterested but has quite a lot to do with this:[Consultations available] Personalized Cybersecurity & Privacy Report for $42Then we have our dumb friend Shenanigan saying a stupidity of his own and making a fool of himself, which leads to the first 14 comments of the thread having nothing to do with what the OP is saying.To top it off we have a staff member who acknowledges the following:Quote from: Xal0lex on December 06, 2023, 10:33:55 PMInstead of offtopic and trolling, better do some forum research if you're so interested. But who does not take action on this, such as deleting the ridiculous off topic garbage replies from Shenanigan on the subject.Of the rest of the comments, only nutildah has an on topic reply, with which I agree.According to the above, my conclusion is the following: hey BenCodie, please change the thread title to something like: \"Discussion, LoyceV powers on the forum.\" so at least this thread in Meta will look like an on topic one, although what will be weird is the OP, I recommend you also to edit it to match the main discussion of the thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "December 07, 2023, 06:55:01 AMLast edit: December 07, 2023, 07:32:02 AM by BenCodie",
      "body": "Quote from: Poker Player on December 07, 2023, 04:32:08 AMWonderful thread this, I laughed a lot. You have to see what you can see lately in Meta. First we have our friend BenCodie who takes advantage of the mixers ban to push his much loved Cybersecurity and Privacy board, which seems reasonable to me, and more considering the positive votes it has had in the forum, but it seems to me that the promotion of this topic is not purely disinterested but has quite a lot to do with this:[Consultations available] Personalized Cybersecurity & Privacy Report for $42This thread has nothing to do with the temporary service I offered, all of the info being used there will be published for free in the board if it's added. I only have good intentions with this board, as do all of the people who voted for it. As for me \"taking advantage\" - This is for everyone here. For the safety of everyone, for the security of everyone, and even spanning further than just this forum. For you to think that I am doing this for my own benefit just goes to show how determined you are to hurt my reputation. You are one of the perfect examples of the defaulttrust system being far from perfect. Take your unbased accusations to the reputation board so I can laugh at you there, not in serious threads...and also, how dare you put my thread on the same level as this total spammer \"shenanigan\". Quote from: Poker Player on December 07, 2023, 04:32:08 AMThen we have our dumb friend Shenanigan saying a stupidity of his own and making a fool of himself, which leads to the first 14 comments of the thread having nothing to do with what the OP is saying.To top it off we have a staff member who acknowledges the following:Quote from: Xal0lex on December 06, 2023, 10:33:55 PMInstead of offtopic and trolling, better do some forum research if you're so interested. But who does not take action on this, such as deleting the ridiculous off topic garbage replies from Shenanigan on the subject.I'll be making a new self-moderated topic if a moderator doesn't remove the obvious spam that's occurred here, since this one has been completely derailed with totally off topic spam posts. I have no idea how it got onto the topic of bans and permissions when it had absolutely nothing to do with that topic. Quote from: Poker Player on December 07, 2023, 04:32:08 AMAccording to the above, my conclusion is the following: hey BenCodie, please change the thread title to something like: \"Discussion, LoyceV powers on the forum.\" so at least this thread in Meta will look like an on topic one, although what will be weird is the OP, I recommend you also to edit it to match the main discussion of the thread.While what you are suggesting is a ridiculous one, it's probably the next best thing to do if a moderator doesn't just delete the completely off topic spam (which they very well should, or merge them into a new thread) I can't believe that this kind of obvious spam is just being allowed in such a serious topic about a 12 month, consensus voted request in the face of a huge hit to on-chain privacy.Quote from: nutildah on December 07, 2023, 01:41:53 AMQuote from: BenCodie on December 04, 2023, 09:18:22 PM1. Provide a reasoned response as to why the community can not have this board despite clear consensus that this is what the community wants.2. Add the Cyber security and Privacy board in the Other category of the forum:Although I don't think such a board would be a totally unreasonable idea, putting demands on theymos has traditionally not yielded fruitful results. I don't think the decision to ban mixers was taken lightly. He puts a lot of consideration into making these types of decisions before announcing them.Probably the only on topic post in the sea of off topic nonsense. Thank you.Definitely not demanding theymos. I'm writing a public letter, appreciating a response before mixers are banned. As following that point, privacy will be hindered on this forum - and this board will be a fair medium to the ban. As of Jan 1, it will be 12 days from 12 months since the request was made. That's a long time for a community to be heard, especially when there is a 90% consensus agreeing that the addition is not just in line with Bitcoin, but a need for the community given all of the threats to security and privacy out there.To me, a response is needed to know whether our security of coins and privacy is cared about, if we are on a forum that is actually not entirely governed by theymos, or if community consensus votes and requests are a priority. The only reason I see for this board not being added as a medium to the removal of an industry that enabled on-chain privacy, is that if a party other than theymos is calling the shots and if the board is against their interests. I think that'd be fair to say, as if theymos did solely govern this forum, then I can't see why at least a yes/no hasn't been provided to date. I'm sure theymos would/is an advocate of cybersecurity or privacy if he runs a forum to do with Bitcoin. Both are in line with its purpose, sovereignty of bitcoin and privacy of bitcoin ownership.I hope I've worded this correctly. It's not meant to be hostile or assumptive of any party, it's just my thoughts on this interesting set of matters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}