{
  "id": "topic_5468570",
  "title": "Iamcrypticguy",
  "author": "Iamcrypticguy",
  "created_time": "September 29, 2023, 04:35:46 PM",
  "content": "Over the past couple of years, we've witnessed the emergence and introduction of bots and AI in the crypto space, enabling smarter and more profitable trading. While some people may argue about their importance as trading tools, everything with pros has it's cons, right?But that's not the main reason I'm writing this. I'm aware of bots that can detect price trends and execute trades based on data analytics, closing positions, and more. So here's the catch: the bull market is speculated to follow the BTC halving, and I've been accumulating alts that I believe have potential in anticipation of the bull season. However, I've encountered challenges in managing my spot portfolio to take advantage of the current market's volatility. So, I'm pondering on the possibility of a bot tool that can assist with this. I haven't come across any yet, but is it a possibility? If you happen to know of such tools, I would appreciate some direction.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468570",
  "comments": [
    {
      "author": "mk4",
      "created_time": "September 29, 2023, 05:22:06 PM",
      "body": "Why does it necessarily need to be using bots? You can simply just check websites that provides crypto/defi metrics that have automatically been sorted out for you to see. You just need to know what to look at (it's subjective).e.g. Nansen, TokenTerminal, ArkhamIntelligence, etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "September 29, 2023, 07:49:33 PM",
      "body": "Quote from: Iamcrypticguy on September 29, 2023, 04:35:46 PMOver the past couple of years, we've witnessed the emergence and introduction of bots and AI in the crypto space, enabling smarter and more profitable trading. While some people may argue about their importance as trading tools, everything with pros has it's cons, right?But that's not the main reason I'm writing this. I'm aware of bots that can detect price trends and execute trades based on data analytics, closing positions, and more. So here's the catch: the bull market is speculated to follow the BTC halving, and I've been accumulating alts that I believe have potential in anticipation of the bull season. However, I've encountered challenges in managing my spot portfolio to take advantage of the current market's volatility. So, I'm pondering on the possibility of a bot tool that can assist with this. I haven't come across any yet, but is it a possibility? If you happen to know of such tools, I would appreciate some direction.I am glad that you are holding in alts because many people think that they should only hold BTC when halving comes but they don't know the potential of diversifying the portfolio and not depending on the BTC only. You did the right thing and I hope you selected the good ones. I am also not a user of portfolio management tools or AI trading tools but I did learn a few names in this section and those names are: Shrimpy- You can opt among investment styles that suit you best.3Commas- It consists of some advanced featuresCryptohopper- Provide a social trading featurePionex- it's an exchange but I think you should go for 3commas instead of it but I mentioned it for your own choice. The first thing you should keep in mind is, don't trust blindly any of the above tools or exchanges, because AI trading or profile management does not mean you will win all the trades and you will earn a lot of money. There might be errors and omissions in them too. So DYOR dear. Test them with what you can do without fear.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "September 29, 2023, 08:57:27 PM",
      "body": "Bot portfolio management tools might not do you much good. Even if you do find any, it'll take you a long time to fine-tune it in order to maximize the performance.What you actually need is a:- portfolio tracker:- Token metrics/insights tool: ArkhamIntelligence /NansenAI as mk4 has suggested.There's a shitcoin version of trading bots like the unibot that automates the process of trading on decentralized exchanges. You might want to check those out as well only if you are a degenerate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "September 29, 2023, 11:59:07 PM",
      "body": "Quote from: mk4 on September 29, 2023, 05:22:06 PMNansen,Nansen that recently admitted that some of their customer data was leaked?Quote from: ZAINmalik75 on September 29, 2023, 07:49:33 PM3Commas- It consists of some advanced featuresThose who care to know. 3 commas had an API Key leak where some of its customers lost funds due to a breach. \"fool me once, shame on you; fool me twice, shame on me\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "September 30, 2023, 03:16:41 AM",
      "body": "Quote from: Bitcoin_Arena on September 29, 2023, 11:59:07 PMNansen that recently admitted that some of their customer data was leaked?Didn't know about that, but yea that sucks. In general still a very useful platform though, and just remember that exploits and databreaches like this are possible to happen to literally any platform so submit as little personal information as possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "September 30, 2023, 03:50:46 AM",
      "body": "There are no expectations that the price of Bitcoin will rise with a clear difference until the end of next year. The use of bots is mostly in daily trading, which requires being online for most of the day and executing orders quickly, and not in long-term trading, as the difference of a day or two may not clearly affect the prices. Or trading can be automated using tools available on trading platforms.You do not need trading bots here, and know that when Bitcoin starts to rise, it is the appropriate opportunity to buy alternative currencies and sell them when the altcoin/bitcoin difference is profitable or with dollar accounts. Buying altcoins before the price of Bitcoin starts to rise is a big mistake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Altcoiner007",
      "created_time": "September 30, 2023, 08:22:13 AM",
      "body": "I've seen some of those arguments and misconceptions with the use of Bot for trading or managing Crypto Investment portfolio but the fact is that A.I is here to stay and it'll make profiting easier, either with trading or just analyzing the market. I would have loved to make some recommendations of a few bots I'm trying out with impressive portfolio management functions that you may find useful. One of it, Smart Portfolio Bot boosted my returns noticably within 6Hrs of running it. Well, It's not just by having bots that will give you good profit, it depends on you. Like Smart Portfolio Bot, it depends on the assets on your portfolio as it capitalizes on price fluctuations based on those assets to earn you higher profit. Maybe you've previously tried that, I don't know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slaman29",
      "created_time": "September 30, 2023, 09:43:56 AM",
      "body": "I've said it before, 15 years ago in fact when I was active in forex, bots and AI are great tools. But like any tool, they are supposed to make our lives easier, not think for us.If AI and bots could even make 1% of the claims we've seen over 20 years in trading, there would be no need for human traders anymore.I think what you're looking for is a simple limit order  Read the insights suggested but don't take it as the rule. Gunbot is a simple tool that can do this, forum used to ad it heavily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zee27",
      "created_time": "September 30, 2023, 12:59:49 PM",
      "body": "Quote from: Altcoiner007 on September 30, 2023, 08:22:13 AMI've seen some of those arguments and misconceptions with the use of Bot for trading or managing Crypto Investment portfolio but the fact is that A.I is here to stay and it'll make profiting easier, either with trading or just analyzing the market. I would have loved to make some recommendations of a few bots I'm trying out with impressive portfolio management functions that you may find useful. One of it, Smart Portfolio Bot boosted my returns noticably within 6Hrs of running it. Well, It's not just by having bots that will give you good profit, it depends on you. Like Smart Portfolio Bot, it depends on the assets on your portfolio as it capitalizes on price fluctuations based on those assets to earn you higher profit. Maybe you've previously tried that, I don't know.Do you have a link of some more information about this smart portfolio not you talked about? Is it offered by an exchange or some other trading platform? Maybe a link would be fine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Altcoiner007",
      "created_time": "September 30, 2023, 01:56:56 PM",
      "body": "Quote from: Zee27 on September 30, 2023, 12:59:49 PMQuote from: Altcoiner007 on September 30, 2023, 08:22:13 AMI've seen some of those arguments and misconceptions with the use of Bot for trading or managing Crypto Investment portfolio but the fact is that A.I is here to stay and it'll make profiting easier, either with trading or just analyzing the market. I would have loved to make some recommendations of a few bots I'm trying out with impressive portfolio management functions that you may find useful. One of it, Smart Portfolio Bot boosted my returns noticably within 6Hrs of running it. Well, It's not just by having bots that will give you good profit, it depends on you. Like Smart Portfolio Bot, it depends on the assets on your portfolio as it capitalizes on price fluctuations based on those assets to earn you higher profit. Maybe you've previously tried that, I don't know.Do you have a link of some more information about this smart portfolio not you talked about? Is it offered by an exchange or some other trading platform? Maybe a link would be fine.Here's an article with details about the Smart Bot: https://www.bitget.com/blog/articles/bitget-smart-portfolio-bot-enables-sophisticated-crypto-trading-for-usersYou can find this too as a direct link to running the bot if you find it worth what you'd like: https://www.bitget.site/trading-bot/spot/hoard/BTCUSDT",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iamcrypticguy",
      "created_time": "September 30, 2023, 04:16:16 PM",
      "body": "Quote from: ZAINmalik75 on September 29, 2023, 07:49:33 PMQuote from: Iamcrypticguy on September 29, 2023, 04:35:46 PMOver the past couple of years, we've witnessed the emergence and introduction of bots and AI in the crypto space, enabling smarter and more profitable trading. While some people may argue about their importance as trading tools, everything with pros has it's cons, right?But that's not the main reason I'm writing this. I'm aware of bots that can detect price trends and execute trades based on data analytics, closing positions, and more. So here's the catch: the bull market is speculated to follow the BTC halving, and I've been accumulating alts that I believe have potential in anticipation of the bull season. However, I've encountered challenges in managing my spot portfolio to take advantage of the current market's volatility. So, I'm pondering on the possibility of a bot tool that can assist with this. I haven't come across any yet, but is it a possibility? If you happen to know of such tools, I would appreciate some direction.I am glad that you are holding in alts because many people think that they should only hold BTC when halving comes but they don't know the potential of diversifying the portfolio and not depending on the BTC only. You did the right thing and I hope you selected the good ones. I am also not a user of portfolio management tools or AI trading tools but I did learn a few names in this section and those names are: Shrimpy- You can opt among investment styles that suit you best.3Commas- It consists of some advanced featuresCryptohopper- Provide a social trading featurePionex- it's an exchange but I think you should go for 3commas instead of it but I mentioned it for your own choice. The first thing you should keep in mind is, don't trust blindly any of the above tools or exchanges, because AI trading or profile management does not mean you will win all the trades and you will earn a lot of money. There might be errors and omissions in them too. So DYOR dear. Test them with what you can do without fear.I've actually used some of these options you stated but had to stop because I noticed some suspicious activities. Hence, I'm looking for other ideas, but I think I've seen a good option from the comments, so I'll pursue that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iamcrypticguy",
      "created_time": "September 30, 2023, 04:23:25 PM",
      "body": "Quote from: slaman29 on September 30, 2023, 09:43:56 AMI've said it before, 15 years ago in fact when I was active in forex, bots and AI are great tools. But like any tool, they are supposed to make our lives easier, not think for us.If AI and bots could even make 1% of the claims we've seen over 20 years in trading, there would be no need for human traders anymore.I think what you're looking for is a simple limit order  Read the insights suggested but don't take it as the rule. Gunbot is a simple tool that can do this, forum used to ad it heavily.Thanks for the suggestion, but I'm not looking for a limit order tool. I need something to manage and rebalance my portfolio in case of volatility, etc. I've already seen a suggestion, the Smart Portfolio Bot, and I'll do some research on it. It seems to perform exactly what I'm looking for.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "September 30, 2023, 09:37:54 PM",
      "body": "Quote from: Iamcrypticguy on September 29, 2023, 04:35:46 PMSo, I'm pondering on the possibility of a bot tool that can assist with this. I haven't come across any yet, but is it a possibility? If you happen to know of such tools, I would appreciate some direction.If there was a very perfect bot that could make possible the purchase of better altcoins that could generate significant profit during a bull market when some altcoins get pumped, then I believe that's the bot that everyone will be using to manage their portfolio, and it would not have been a secret. Mate, if you are looking for a better project, then you can do your own research, and when you think you have seen a better project, you can buy it and hold it in your portfolio. You can use the coin-tracking sites Coinmarket or Coingecko to track most of those altcoins.I know some bot that has been integrated into some centralized exchange. What the bot does is buy the coin you want them to buy at a certain price, and they also sell it at the price you have set them to execute the trade. For example, if you set the bot to buy Bitcoin when the price gets to $25k and sell it when it gets to $26k, the bot can execute such a trade and keep automatically buying and selling for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "September 30, 2023, 09:57:36 PM",
      "body": "The potentials of many of todays tech is massive in that bots and A.i has recently been applauded and given a front row in cryptocurrency trading and exchange.While it is okay to program bots to do some strategic trading, the fun in being human and trading while being exposed to the emotions of trading, will have been greatly minimized.Bitget is a pro exchange with more advanced features that offers both bots and AI assistance for its customers and users.For a portfolio management however, it would be on track and recommended to use bots since they are more awake and will do exactly as programed to do at any time of the day .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "harizen",
      "created_time": "September 30, 2023, 09:58:07 PM",
      "body": "Someone can correct me here and if I'm wrong about this but I do believe there is no crypto-trading bot yet that will automatically do all the actions based on its own generated market situation (maybe AI?) that will happened next. It's even risky to just allow these bots to do all the moves? Crypto is volatile and even bots won't unlikely to predict the closest possible thing that can happened.The purpose of using a trading bot is to execute actions based on the algorithm on your own. In that way, you are sure that your bot will just follow your own command and not to trigger something that is AI generated. Who knows that it might execute an action that you are not expecting since you rely all the work on that bot.Anyways, you can also consider searching for a copy trading feature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "September 30, 2023, 11:41:30 PM",
      "body": "Quote from: nelson4lov on September 29, 2023, 08:57:27 PM-snip-What you actually need is a:- portfolio tracker:Portfolio Trackers that I use such as Coinmarketcap, Coingecko and more specifically using Blockfolio. provides complete information about what I hold and how those assets are performing, it's a complete package.Quote from: nelson4lov on September 29, 2023, 08:57:27 PM- Token metrics/insights tool: ArkhamIntelligence /NansenAI as mk4 has suggested.ArkhamIntelligence is a very impressive tool, this is a powerful new intel metrics tracking tool that is able to track all blockchain transactions with ease and an attractive UI. No wonder Binance supports ArkhamIntelligence because it is a new innovation that provides a blockchain address lookup database, bounty program, and blockchain intelligence data marketplace. It uses Artificial Intelligence which makes it smarter to analyze data. Quote from: nelson4lov on September 29, 2023, 08:57:27 PMThere's a shitcoin version of trading bots like the unibot that automates the process of trading on decentralized exchanges. You might want to check those out as well only if you are a degenerate. And about Unibot on the shitcoin trading version that automates trading on DEX exchanges, it simply provides easy trading because it uses bots. But there is a new automated trading bot that is more powerful than Unibot, namely X-Caller which is a utility of the XProject ERC20 token that uses artificial intelligence so that it is smarter and chooses which coins have good potential and will go up.and will also be supported by the X-SHOT bot to automate everything. For more information, read herehttps://linktr.ee/projectx_erc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zee27",
      "created_time": "October 01, 2023, 12:12:14 PM",
      "body": "Quote from: taufik123 on September 30, 2023, 11:41:30 PMQuote from: nelson4lov on September 29, 2023, 08:57:27 PM-snip-What you actually need is a:- portfolio tracker:Portfolio Trackers that I use such as Coinmarketcap, Coingecko and more specifically using Blockfolio. provides complete information about what I hold and how those assets are performing, it's a complete package.Quote from: nelson4lov on September 29, 2023, 08:57:27 PM- Token metrics/insights tool: ArkhamIntelligence /NansenAI as mk4 has suggested.I dread using ArkhamIntelligence due to the fact that Arkham accidentally doxxed thousands of users’ private email addresses through their referral program.Read more on DailyCoin: https://dailycoin.com/arkham-crypto-is-dox-to-earn-threat-to-cryptocurrency/#h-consArkhamIntelligence is a very impressive tool, this is a powerful new intel metrics tracking tool that is able to track all blockchain transactions with ease and an attractive UI. No wonder Binance supports ArkhamIntelligence because it is a new innovation that provides a blockchain address lookup database, bounty program, and blockchain intelligence data marketplace. It uses Artificial Intelligence which makes it smarter to analyze data. Quote from: nelson4lov on September 29, 2023, 08:57:27 PMThere's a shitcoin version of trading bots like the unibot that automates the process of trading on decentralized exchanges. You might want to check those out as well only if you are a degenerate. And about Unibot on the shitcoin trading version that automates trading on DEX exchanges, it simply provides easy trading because it uses bots. But there is a new automated trading bot that is more powerful than Unibot, namely X-Caller which is a utility of the XProject ERC20 token that uses artificial intelligence so that it is smarter and chooses which coins have good potential and will go up.and will also be supported by the X-SHOT bot to automate everything. For more information, read herehttps://linktr.ee/projectx_erc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "October 01, 2023, 04:19:34 PM",
      "body": "Quote from: Iamcrypticguy on September 29, 2023, 04:35:46 PM<snip>Until now, trading bots have been ineffective in trading since I have not seen any profitable traders use bots or artificial intelligence in trading. But even if there is a profitable trader, he can't convince me that the bot is effective; maybe next time there will be a trading bot that is effective, reliable, and profitable.So if the bot is not yet effective in trading, how much more if it is in the management of your portfolio. Many projects have been launched that can manage a spot portfolio and Arkham is one of them. Even though this project is once hyped, you still need to research about it before using their service.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "October 01, 2023, 05:01:41 PM",
      "body": "Using a bot for portfolio management can be risky because all of these bot has their limitation and it's possible that any totally new scenario occurred that the bot can not identify and react accordingly. If you are a busy man and needs to use bot then i would suggest you to use copy trading instead. Most of the exchange offer copy trading features and you can see their past performance and switch trader any time you want.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}