{
  "id": "topic_5521614",
  "title": "legiteum",
  "author": "legiteum",
  "created_time": "December 04, 2024, 04:29:35 PM",
  "content": "Because of the hype around the US election in the past months, interest in digital currencies is exploding with millions of new entrants into the market.What one would expect in this situation is for Bitcoin to gain market share, as newbies tend to only know about the market leader at first.  But that's not what is happening. Instead, Bitcoin's overall market share is dropping.  As I discussed in another thread, Bitcoin now sits on a \"store shelf\" alongside thousands of other products today who all compete for the same exact investor dollars.What is driving this? Most investors use an app of some kind to invest in Bitcoin. These apps display Bitcoin alongside many other choices as equals. And like the shelves at your local grocery store, the arrangement of those items will depend on what makes the broker the most money and that can be driven by the product's backers who can share the wealth (and Bitcoin has no such backers).This is very, very bearish for Bitcoin (and bullish for non-Bitcoin digital currencies).",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5521614",
  "comments": [
    {
      "author": "Kemarit",
      "created_time": "December 04, 2024, 04:40:19 PM",
      "body": "I thought that Bitcoin's dominance is meaningless? It's because those altcoins can artificially inflate and in some point cheat themselves with their big total coin supplies. So regardless of, I do not see it as somewhat has bearing, and we all know that when Bitcoin goes up, all other altcoins goes up as well.So don't over complicate things, if some newbies or institutions wanted to invest on Bitcoin, then it's very easy. And again, this numbers, dominance or market cap or whatever we call it, serves no real purpose.Bitcoin goes down, the whole market goes down.Bitcoin goes up, some altcoins goes up. That's how it is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "December 04, 2024, 04:43:03 PM",
      "body": "It's an altcoin season so it's not very strange to see Bitcoin dominance is dropping as expected.Bitcoin, altcoin season indexhttps://www.blockchaincenter.net/altcoin-season-index/Except if you don't see the altcoin season is coming, you will not find an answer for Bitcoin dominance decrease recent days. Its dominance can drop more when Ethereum takes off and trigers the ERC20 ecosystem with many tokens to rise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "December 04, 2024, 04:58:12 PM",
      "body": "Quote from: legiteum on December 04, 2024, 04:29:35 PMWhat is driving this? Most investors use an app of some kind to invest in Bitcoin. These apps display Bitcoin alongside many other choices as equals.In the past, bitcoin will first increased in a way that the dominance will increase. But this will later trigger altcoins season in which most altcoins will be increasing and the bitcoin market dominance will fall. But later bear market will come and the altcoins will fall more, making their marketcap to fall more and make bitcoin dominance to increase again which will further increase when the bull run begin again. It is just like a cycle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "December 04, 2024, 04:58:32 PM",
      "body": "Quote from: legiteum on December 04, 2024, 04:29:35 PMWhat is driving this?Bitcoin did its pump for now, and now its time for alts to do the same before bitcoin (probably) continues going up. Its been happening every bull run and this one probably be no exception.Quote from: legiteum on December 04, 2024, 04:29:35 PMThis is very, very bearish for Bitcoin (and bullish for non-Bitcoin digital currencies).Tell me that this is your first bull without telling the that its your first bull.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "December 04, 2024, 05:28:19 PM",
      "body": "Quote from: Kemarit on December 04, 2024, 04:40:19 PMI thought that Bitcoin's dominance is meaningless? It's because those altcoins can artificially inflate and in some point cheat themselves with their big total coin supplies. You are talking about fraud associated with non-Bitcoin digital currencies, and yes, in the past, this was a problem. But not in 2024. The market has evolved and there are major products out there like ETH, XRP, HBAR etc. that are obviously not fraudulent--and brokers like Coinbase and others are presenting these products alongside Bitcoin as equals in terms of fraud exposure.Quote from: Rikafip on December 04, 2024, 04:58:32 PMQuote from: legiteum on December 04, 2024, 04:29:35 PMThis is very, very bearish for Bitcoin (and bullish for non-Bitcoin digital currencies).Tell me that this is your first bull without telling the that its your first bull.  In previous cycles Bitcoin did not have long-established competitors like this, nor was the market dominated by consumer investors who use brokers and apps to buy, wherein they are presented/promoted with competitors.  Follow the money, people. In this year's election, those gigantic crypto-related donations came from brokers like Coinbase, not individual holders of Bitcoin. Coinbase is in the business of helping Coinbase, not Bitcoin--and now they and others like them control a huge portion of the market, and they now also have the US government on their side too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "December 04, 2024, 05:40:43 PM",
      "body": "Quote from: legiteum on December 04, 2024, 05:28:19 PMIn previous cycles Bitcoin did not have long-established competitors like thisTalking about competition strictly from market share point of view, right? Anyway, I see pretty much the same names as in previous cycles so I don't see what changed in the meantime to be so bearish about bitcoin.Quote from: legiteum on December 04, 2024, 05:28:19 PMCoinbase is in the business of helping Coinbase, not Bitcoin--and now they and others like them control a huge portion of the marketSo exactly the same as in all previous years?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "December 04, 2024, 05:58:40 PM",
      "body": "Quote from: Rikafip on December 04, 2024, 05:40:43 PMQuote from: legiteum on December 04, 2024, 05:28:19 PMIn previous cycles Bitcoin did not have long-established competitors like thisTalking about competition strictly from market share point of view, right? Anyway, I see pretty much the same names as in previous cycles so I don't see what changed in the meantime to be so bearish about bitcoin.You do, but most consumer investors didn't. There has been an explosion of products (and additions to existing product e.g. PayPal) in the last few years geared to making it easy to invest in digital currencies. These products show you Bitcoin alongside a dozen other market leaders. This is new.And even on the ETF front, there are now several other ETFs for other cryptos, with many more on the way. Soon BTC will lose that advantage as well.QuoteQuote from: legiteum on December 04, 2024, 05:28:19 PMCoinbase is in the business of helping Coinbase, not Bitcoin--and now they and others like them control a huge portion of the marketSo exactly the same as in all previous years?  Except that Coinbase is 10x bigger than they were, and 100x more powerful in the market thanks to them getting in bed with the US government.Look, we'll see, but I'm actually finding it a bit strange that BTC can't even break 100k despite the almost insane levels of hype it's getting. I mean, it doesn't get any bigger than the US president actively promoting BTC and promising to use the US government's money to pump it--and yet it can't break through a key barrier.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 04, 2024, 06:07:23 PM",
      "body": "i know legiteum acts the fool to get others to solve his queries for him (like a baby cries to get spoonfed)i know legiteum has already been corrected about the fact that market cap is MEANINGLESSit does not indicate market share..it does not represent how much popularity the market has of one coin or anotherit does not represent any % of whom invests in what more or lessit does not represent %dominance nor %demand nor %desirethe point:anyone can make a 200trillion pre-mined coin and with just $0.10 buy one of those coins and create a $20trillion market capone person + $0.10 = largest market capthe other point:so legiteum has been informed of this yet continues to be a dim-whit.. so the real question is why does he continue to be ignorant of how things like crypto work and whats actually important.. and why does he continue to pretend that he has not already been told this stuff",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mia Chloe",
      "created_time": "December 04, 2024, 06:08:05 PM",
      "body": "Quote from: Kemarit on December 04, 2024, 04:40:19 PMI thought that Bitcoin's dominance is meaningless? It's because those altcoins can artificially inflate and in some point cheat themselves with their big total coin supplies. So regardless of, I do not see it as somewhat has bearing, and we all know that when Bitcoin goes up, all other altcoins goes up as well.Well it's not totally useless. It's more like a simple mathematical calculation of the percentage relationship between bitcoin's market capitalisation or market cap as we usually say and the total crypto crypto currency market cap. Say if we are to make out a formula for it we'll get something like this;BTC Dominance (%) = (Bitcoin's Market Capitalization / Total Cryptocurrency Market Capitalization) x 100Well you have a point about altcoins manipulating price but that is more common with premarket prices and in a calculation like this such data isn't including when summing the total market cap. Well to be frank the price of literally any commodity can be manipulated ranging from metals like Gold and silver to stuffs like oil and Gas and even crypto including bitcoin too. It's just a matter of adjusting supply in relation to demand , or in the case of bitcoin create an avenue for FOMO to cause price shifts buy either buying or selling huge amounts of bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "December 04, 2024, 06:09:59 PM",
      "body": "Quote from: legiteum on December 04, 2024, 05:58:40 PMLook, we'll see, but I'm actually finding it a bit strange that BTC can't even break 100k despite the almost insane levels of hype it's getting. I mean, it doesn't get any bigger than the US president actively promoting BTC and promising to use the US government's money to pump it--and yet it can't break through a key barrier. Dunno about you, but I certainly didn't expect that we will go through 100k mark on the first try so I see nothing strange in all this. Altcoins are getting their little pump before those who control the market decide that its time for bitcoin to finally break it. If I were you, I would rather see it as a chance to get some more under 100k bitcoin than worry about it and thinking its some sort of a sign that bitcoin is in trouble.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "December 04, 2024, 06:12:44 PM",
      "body": "Quote from: franky1 on December 04, 2024, 06:07:23 PMi know legiteum acts the fool to get others to solve his queries for him (like a baby cries to get spoonfed)I'm not going to respond to a post like this, nor should anybody else...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "December 04, 2024, 06:19:26 PM",
      "body": "Quote from: Rikafip on December 04, 2024, 06:09:59 PMQuote from: legiteum on December 04, 2024, 05:58:40 PMLook, we'll see, but I'm actually finding it a bit strange that BTC can't even break 100k despite the almost insane levels of hype it's getting. I mean, it doesn't get any bigger than the US president actively promoting BTC and promising to use the US government's money to pump it--and yet it can't break through a key barrier. Dunno about you, but I certainly didn't expect that we will go through 100k mark on the first try so I see nothing strange in all this. Altcoins are getting their little pump before those who control the market decide that its time for bitcoin to finally break it. If I were you, I would rather see it as a chance to get some more under 100k bitcoin than worry about it and thinking its some sort of a sign that bitcoin is in trouble.Okay, but... if you invested in (say) XRP during this latest bull run for BTC, you would have 10x your profits, at least. Just saying.To be clear, I personally hate speculating and I don't personally own more than $100 in other cryptos (besides my company's), and I definitely don't do \"day trading\" or trying to predict what is going to go up or down in a week or a month.But I think it's interesting to look at long-term trends, because they can change the way you look at the business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EL MOHA",
      "created_time": "December 04, 2024, 06:49:24 PM",
      "body": "Quote from: legiteum on December 04, 2024, 06:19:26 PMOkay, but... if you invested in (say) XRP during this latest bull run for BTC, you would have 10x your profits, at least. Just saying.To be clear, I personally hate speculating and I don't personally own more than $100 in other cryptos (besides my company's), and I definitely don't do \"day trading\" or trying to predict what is going to go up or down in a week or a month.But I think it's interesting to look at long-term trends, because they can change the way you look at the business.Not that I don’t get your point here but the market hasn’t changed much from how the trend use to be from the previous bull runs and that’s why bitcoin dominance is reducing and more people are going into them altcoins, and as usual many people have started this trend of if there is always going to be an altcoin season why not join them just like you have insinuated of buying XRP. And my question is always this what is that altcoin to buy.Take XRP for example were we confident of it doing a 10x after the last bull run? I don’t think many actually did think of that, it had its problems and overcome and just like Solana and SUI it is back up, but how do one hand pick this Altcoins to know which will pump or not, you simply just gamble on them, so for bitcoiner like me why gamble when you can get a solid 2x+ from bitcoin which is also an hedge against inflation",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asuspawer09",
      "created_time": "December 04, 2024, 06:57:53 PM",
      "body": "As it is, we might expect for sure some slowdown on the pump of Bitcoin since the money might just go into altcoins for sure, since there are a lot of people probably already cashing out on Bitcoin, and investing it on altcoins for sure. But if we believe in the cycle of Bitcoin a lot of investors are going to believe that the market price could still peak in October next year, and I also believe in it, and for some it might just be easy to chill on the position since we buy and invest on Bitcoin on a very low price so, so buying early on Bitcoin could easily pay off right now that we are already on top around 90k$, its easy for a lot of people to take a profit at this point.Would still continue to hold my Bitcoin but mostly planning to sell it next year whatever the market price might be, I just want to see if the market price is going to continue to increase in the coming months even though the market dominance is decreasing, but I'm planning to sell around 120k$-150k$ which I think is very possible at this rate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "December 04, 2024, 07:23:43 PM",
      "body": "Quote from: Rikafip on December 04, 2024, 06:09:59 PMQuote from: legiteum on December 04, 2024, 05:58:40 PMLook, we'll see, but I'm actually finding it a bit strange that BTC can't even break 100k despite the almost insane levels of hype it's getting. I mean, it doesn't get any bigger than the US president actively promoting BTC and promising to use the US government's money to pump it--and yet it can't break through a key barrier. Dunno about you, but I certainly didn't expect that we will go through 100k mark on the first try so I see nothing strange in all this. Altcoins are getting their little pump before those who control the market decide that its time for bitcoin to finally break it. If I were you, I would rather see it as a chance to get some more under 100k bitcoin than worry about it and thinking its some sort of a sign that bitcoin is in trouble.No one is expecting Bitcoin to achieve the $100k benchmark on the first lump pull like the last one and infact everyone was expecting Bitcoin to reach a 90k price benchmark for this bull season, but unexpectedly Bitcoin reached above 99k+ this alone is a merging that should be viewed at the same light with a 100k Bitcoin price achievement in this bull season.So expecting Bitcoin to climb above 100k and staying above that price per BTC is somewhat an unsustainable price benchmark for Bitcoin, but at least with the current Bitcoin  resistance price we are sure that the next leg up for Bitcoin will take us to a price position that will put us above $100kBTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "justdimin",
      "created_time": "December 04, 2024, 09:46:30 PM",
      "body": "Quote from: legiteum on December 04, 2024, 06:19:26 PMQuote from: Rikafip on December 04, 2024, 06:09:59 PMDunno about you, but I certainly didn't expect that we will go through 100k mark on the first try so I see nothing strange in all this. Altcoins are getting their little pump before those who control the market decide that its time for bitcoin to finally break it. If I were you, I would rather see it as a chance to get some more under 100k bitcoin than worry about it and thinking its some sort of a sign that bitcoin is in trouble.Okay, but... if you invested in (say) XRP during this latest bull run for BTC, you would have 10x your profits, at least. Just saying.To be clear, I personally hate speculating and I don't personally own more than $100 in other cryptos (besides my company's), and I definitely don't do \"day trading\" or trying to predict what is going to go up or down in a week or a month.But I think it's interesting to look at long-term trends, because they can change the way you look at the business.Not really? The return was from 50 cents to $2.4, which is a bit less than x5 return, so I can't really say that there are enough reasons to consider this anything great, because even bitcoin went under 20k and reached to nearly 100k, so we have seen 5x return from bitcoin as well, and that's the biggest name, if you look for others, there are better ones too.So there is really no reason to invest into XRP at all, makes no sense to me why people insist that it's a good coin, I would avoid that if I could. I agree that long term investment is better, and I do that too, I have mostly bitcoin, and then there are some other ones as well that I try to look at this as a good way to move forward as well, that will be a lot better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "December 04, 2024, 09:59:17 PM",
      "body": "Quote from: legiteum on December 04, 2024, 04:29:35 PMBecause of the hype around the US election in the past months, interest in digital currencies is exploding with millions of new entrants into the market.\"Millions\" of new entries!Surely that would be a red flag to stay the hell away from them?\"Millions\" of new entrants mean they each have a very nominal \"market share\" just like all the other $hit coins in existence",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "December 04, 2024, 10:17:10 PM",
      "body": "Quote from: EL MOHA on December 04, 2024, 06:49:24 PMQuote from: legiteum on December 04, 2024, 06:19:26 PMOkay, but... if you invested in (say) XRP during this latest bull run for BTC, you would have 10x your profits, at least. Just saying.To be clear, I personally hate speculating and I don't personally own more than $100 in other cryptos (besides my company's), and I definitely don't do \"day trading\" or trying to predict what is going to go up or down in a week or a month.But I think it's interesting to look at long-term trends, because they can change the way you look at the business.Not that I don’t get your point here but the market hasn’t changed much from how the trend use to be from the previous bull runs [...]I guess I simply disagree with this. Comparing the current market to only three years ago, for instance, tells me that things have drastically changed.Crypto brokers were the single-biggest contributor to the US elections in 2024. That's crazy--and very, very different from before when political contributions were basically nil. This tells me that crypto has grown up as an industry, and there are now key players that control this industry--and they are the major brokers like Coinbase and Binance, as well as the major private chains like Ripple, Solana and Hedera. None of these industry leaders have any specific reason to boost Bitcoin, and they have billions of reasons to pump it's competitors.Quote[...] so for bitcoiner like me why gamble when you can get a solid 2x+ from bitcoin which is also an hedge against inflation ?Um, because \"past performance is not indicative of future results\"? Just because Bitcoin went up in the past doesn't mean it will go up in the future.Also in the past: Bitcoin dropped by 75%. So there's that...Quote from: justdimin on December 04, 2024, 09:46:30 PMNot really? The return was from 50 cents to $2.4, which is a bit less than x5 return, so I can't really say that there are enough reasons to consider this anything great, because even bitcoin went under 20k and reached to nearly 100k, so we have seen 5x return from bitcoin as well, and that's the biggest name, if you look for others, there are better ones too.I was talking about the current bull run after the US election. XRP (and many others) have blasted off many times their previous value, and Bitcoin has risen perhaps 35%.QuoteSo there is really no reason to invest into XRP at all, makes no sense to me why people insist that it's a good coin, I would avoid that if I could. I agree that long term investment is better, and I do that too, I have mostly bitcoin, and then there are some other ones as well that I try to look at this as a good way to move forward as well, that will be a lot better.I'm sure you have your reasons--and I wouldn't know how to predict any coin's price (except Legiteum, which is going to the moon). But you are bolstering my overall point here: today, Bitcoin has... competitors. People are much more comfortable buying non-Bitcoin currencies than they used to be.Quote from: aoluain on December 04, 2024, 09:59:17 PMQuote from: legiteum on December 04, 2024, 04:29:35 PMBecause of the hype around the US election in the past months, interest in digital currencies is exploding with millions of new entrants into the market.\"Millions\" of new entries!Surely that would be a red flag to stay the hell away from them?\"Millions\" of new entrants mean they each have a very nominal \"market share\" just like all the other $hit coins in existenceI was talking about new individual investors, not new currencies. Newbies usually gravitate toward the most well-known brands, which Bitcoin is by far the biggest. It's very bearish, therefore, that Bitcoin is actually losing marketshare in this context.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "icalical",
      "created_time": "December 04, 2024, 11:24:42 PM",
      "body": "After the significant price spike of Bitcoin, I believe investors expect that altcoin would gain some effect of those Bitcoin bullish, and they began to speculate that there is going to be altcoin season, as shown in previous event, altcoin season is not really a threat to Bitcoin market both in term of price or marketcap, investors will finally take profit and sell their altcoins and buying bitcoin again to secure the value of their assets, and I think the case is still the same that people consider altcoins are not very safe for long-term investment afterall.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}