{
  "id": "topic_5431697",
  "title": "PawGo",
  "author": "PawGo",
  "created_time": "December 26, 2022, 10:44:41 AM",
  "content": "Another sad story related to exchanges... Anyone used Gemini? We all love KYC so much... Gemini crypto exchange announced this week that customers were targeted in phishing campaigns after a threat actor collected their personal information from a third-party vendor. The Gemini product security team published a short notice that an unnamed third-party vendor suffered an \"incident\" that allowed an unauthorized actor to collect email addresses and incomplete phone numbers belonging to some Gemini customers.KYC is dangerous from many reasons, one of them is that you give your data to people who do not know how to keep them safe...more details: https://www.bleepingcomputer.com/news/security/hackers-leak-personal-info-allegedly-stolen-from-57m-gemini-users/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5431697",
  "comments": [
    {
      "author": "DaveF",
      "created_time": "December 26, 2022, 11:13:33 AM",
      "body": "Was discussed here a couple of weeks ago: https://bitcointalk.org/index.php?topic=5428632Looks to just be name & email & partial phone.Not as bad as it could have been, but still not good.Not just crypto related but, looking at the amount of data breaches over the last few months and how they happened it really looks like more and more of them are not actually coming from main service themselves but rather 3rt parties that they are using. -Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PawGo",
      "created_time": "December 26, 2022, 11:16:53 AM",
      "body": "Quote from: DaveF on December 26, 2022, 11:13:33 AMWas discussed here a couple of weeks ago: https://bitcointalk.org/index.php?topic=5428632I am sorry I missed that.I decided to post it as all that news creates so much bad PR for crypto. Almost every week you read something disappointing. Stolen data, stolen money, stolen trust.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "December 26, 2022, 12:55:21 PM",
      "body": "Quote from: PawGo on December 26, 2022, 10:44:41 AMAnother sad story related to exchanges... Anyone used Gemini? We all love KYC so much... Gemini crypto exchange announced this week that customers were targeted in phishing campaigns after a threat actor collected their personal information from a third-party vendor. The Gemini product security team published a short notice that an unnamed third-party vendor suffered an \"incident\" that allowed an unauthorized actor to collect email addresses and incomplete phone numbers belonging to some Gemini customers.KYC is dangerous from many reasons, one of them is that you give your data to people who do not know how to keep them safe...more details: https://www.bleepingcomputer.com/news/security/hackers-leak-personal-info-allegedly-stolen-from-57m-gemini-users/It is sad to see how many people prefer comfort over security. Comfort, its the very reason why they keep giving their coin to third party members and give away their personal information/government documents to faceless entities. When will they learn the two most important lessons in the world of cryptocurrency and blockchain?First: not your keys, not your coins. Second: be your own bank.Those are the two only rules you need to never be tricked into giving up your money/anonymity/control.And of course the affected people will find a way to blame Bitcoin/crypto for this, instead of improving themselves...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "December 26, 2022, 02:27:06 PM",
      "body": "Quote from: PawGo on December 26, 2022, 10:44:41 AMAnother sad story related to exchanges... Anyone used Gemini? We all love KYC so much... Gemini crypto exchange announced this week that customers were targeted in phishing campaigns after a threat actor collected their personal information from a third-party vendor. The Gemini product security team published a short notice that an unnamed third-party vendor suffered an \"incident\" that allowed an unauthorized actor to collect email addresses and incomplete phone numbers belonging to some Gemini customers.KYC is dangerous from many reasons, one of them is that you give your data to people who do not know how to keep them safe...more details: https://www.bleepingcomputer.com/news/security/hackers-leak-personal-info-allegedly-stolen-from-57m-gemini-users/You don't have tobget worried of these kind of news if you're the type not interested in using a centralized exchange but if you're using a centralized exchange then always expect such continuous pop of this kind of news around ceaselessly because they have their privacy revealing policy and the attack they are prone to from hackers, if you uses them you're on your own, it's as risky as investing on a shitcoin from other cryptos, learn to have your bitcoin with you and not with exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "December 26, 2022, 04:03:46 PM",
      "body": "Quote from: Doan9269 on December 26, 2022, 02:27:06 PMYou don't have tobget worried of these kind of news if you're the type not interested in using a centralized exchange but if you're using a centralized exchange then always expect such continuous pop of this kind of news around ceaselessly because they have their privacy revealing policy and the attack they are prone to from hackers, if you uses them you're on your own, it's as risky as investing on a shitcoin from other cryptos, learn to have your bitcoin with you and not with exchanges. Sir DaveF said the topic has already been discussed here but I'll still drop this comment here.@Doan9269, I don't think the OP is worried for himself, but his worries are for some of us who love KYC without knowing how unsecure it is. Even if the OP doesn't use CEX that requires KYC, I guess that's what you mean to say, but there are still a lot of members for whom this information is vital.  I have a question: if a user passes KYC in an exchange, can the user's information be erased if they want it in any way? ThanksDr.Bitcoin_Strange 👺",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "December 26, 2022, 04:48:18 PM",
      "body": "Quote from: PawGo on December 26, 2022, 10:44:41 AMKYC is dangerous from many reasons, one of them is that you give your data to people who do not know how to keep them safe...It's true and unfortunate! However, in a real world business, no financial services firm can operate without \"knowing their customer\". That's the rule everywhere! I am sure companies are learning from their mistakes and they will make themselves better over a period of time to secure their user's data. But at this point, no legal entity can operate without implementing KYC framework. Unfortunately that's the law! I believe, companies will be more serious about data security of the government starts imposing heavy financial penalty for each data breaches regardless of the fact why and how it happened. Then only these companies will take data security seriously and start investing there!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "December 26, 2022, 05:01:52 PM",
      "body": "Quote from: PawGo on December 26, 2022, 10:44:41 AMAnother sad story related to exchanges... Anyone used Gemini? We all love KYC so much... Glad I didn't sign up with them yet.  I'm actually thinking of shunning this whole exchange idea altogether (I don't have any exchange accounts - intending to use them only as onramps and offramps), but I am concerned that Bisq crypto-to-bank transfers (and vice versa) will be slow while you wait for another party to come, make an agreement, etc...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "December 26, 2022, 07:52:40 PM",
      "body": "No, I do not use the Gemini exchange or sign-up. Though this type of data leak is not new to us, it is unfortunate that centralized exchange failed to project users' personal data, which is extremely harmful to us. It's also adversely affecting when we get random emails from scammers with phishing links. When it comes to centralized exchange of personal documents, we are helpless. Moving a decentralized exchange completely is difficult for a variety of reasons. But every incident involving centralized exchange reminds us that we are not safe there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}