{
  "id": "topic_5476740",
  "title": "hack3rcon",
  "author": "hack3rcon",
  "created_time": "December 06, 2023, 09:35:50 AM",
  "content": "Hello,What cheap projects do you know that have good potential?Thank you.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476740",
  "comments": [
    {
      "author": "cryptoaddictchie",
      "created_time": "December 06, 2023, 11:12:40 AM",
      "body": "Quote from: hack3rcon on December 06, 2023, 09:35:50 AMHello,What cheap projects do you know that have good potential?Thank you.Cheap prices? As an advice its not about the price but the mcap of the tokens. Low price doesnt mean it will reach higher price like other theres a lot of factor for that and we must gauge that importantly like supply, mcap and many more. But basically you should use the marketcap to see if the upside is great and also if that is a good project too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hack3rcon",
      "created_time": "December 06, 2023, 11:23:49 AM",
      "body": "Quote from: cryptoaddictchie on December 06, 2023, 11:12:40 AMQuote from: hack3rcon on December 06, 2023, 09:35:50 AMHello,What cheap projects do you know that have good potential?Thank you.Cheap prices? As an advice its not about the price but the mcap of the tokens. Low price doesnt mean it will reach higher price like other theres a lot of factor for that and we must gauge that importantly like supply, mcap and many more. But basically you should use the marketcap to see if the upside is great and also if that is a good project too. Hello,Thank you so much for your reply.Good projects whose prices are not high or have a number of zeros.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "December 06, 2023, 01:58:15 PM",
      "body": "Only invest in a project that has a potential future and not only for cheap. And for now a coin or a project that you have to invest upon and will have a great fortune is the project of Eloncoin. I am not saying it because I am a participants but I am saying it because it has good future. Those who investing in it will never regret. Then another one which I will also recommend is dogecoin. These two coins have nice future. To invest upon.Op you can invest with those two with Bitcoin then have the long term goal for the investment and have a smile in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "December 06, 2023, 02:15:23 PM",
      "body": "Quote from: hack3rcon on December 06, 2023, 09:35:50 AMHello,What cheap projects do you know that have good potential?Thank you.Research more, literally there are lot of tools this time around to use for that and even Twitter you'll find those gems. Just follow the right persons though I be blunt that there are lot of frauds out there. Look into the trend narratives they're likely the projects that will have potential.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kentrolla",
      "created_time": "December 06, 2023, 02:17:40 PM",
      "body": "This is a common misconception that low prices Altcoin can touch $1 or more and investing in it would give more returns compared to higher priced cryptos? It's a myth and share by people who have zero knowledge about crypto there are thousands of altcoins which were prices under $1 or had countless zeroes in its values an they failed miserably, if you look at their total supply you will figure out that the coin can never reach $1 as multiplying their supply with $1 will give you total market cap of more than global economy. Don't be fooled this concept of going with cheaply prices coins as it's the biggest misconception and intentionally some projects keeps their price at these range to attract naive investors and they will promise to tokens but don't buy their point and rather go with credible project without looking at price",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "December 06, 2023, 03:27:54 PM",
      "body": "Quote from: hack3rcon on December 06, 2023, 11:23:49 AMHello,Thank you so much for your reply.Good projects whose prices are not high or have a number of zeros.Above all, what is most important to me is technology, its use case, and the problems it aims to solve. Projects with innovative solutions to real-world problems are precious. You can also research the team members, their expertise, and their development progress. A clear roadmap, transparency, and consistent progress are also good indicators.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "December 06, 2023, 07:40:38 PM",
      "body": "Quote from: hack3rcon on December 06, 2023, 09:35:50 AMHello,What cheap projects do you know that have good potential?Thank you.It's hard to say because many of them are undervalued and it's still unknown if someday they're going to be with a decent value. So, for every niche that we have on the crypto market, you can take time and look at each of them, and based on what you think as long as the price are very low, you can have that consideration on how you're going to give them some look.Quote from: Text on December 06, 2023, 03:27:54 PMAbove all, what is most important to me is technology, its use case, and the problems it aims to solve. Projects with innovative solutions to real-world problems are precious. You can also research the team members, their expertise, and their development progress. A clear roadmap, transparency, and consistent progress are also good indicators.I agree with the technology projects and we can include here the AI projects. But not all of them are going to do well, let's just be clear with that some of them are literally good projects but it doesn't mean that they'll have a good future. This is what's clear on this market despite being good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "December 06, 2023, 11:45:23 PMLast edit: December 09, 2023, 07:25:15 PM by btc78",
      "body": "Quote from: cryptoaddictchie on December 06, 2023, 11:12:40 AMQuote from: hack3rcon on December 06, 2023, 09:35:50 AMHello,What cheap projects do you know that have good potential?Thank you.Cheap prices? As an advice its not about the price but the mcap of the tokens. Low price doesnt mean it will reach higher price op probably wants to invest in something that could turn into bitcoin over time but that is highly unlikely to happen at least in the near futureeveryone wants to buy low and sell high which is the mindset that most traders have but the capability to find one is lacking thats why ending to the wrong buying .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "poodle63",
      "created_time": "December 07, 2023, 01:18:40 AM",
      "body": "honestly right now most of the token or coin with high potential are always those that are backed by big VC and investment company and they usually starts out without the zeros but they could be rising in price so high anyway, I guess SUI is a coin that have quite the potential though fairly speaking the market capitalization is already quite high but at least it have some zeros, nowadays i rarely any coin that have that much of zeros to be honest that could make it into the big exchanges out there. however for such coin you could easily try to look at CMC though, most of such coin that have that much zero are always in dex because they are not qualified to get into cex so they resort into dex, therefore it might be more effective finding there.other than that, shitcoin might be viable but always remember, these shitcoins are lowly priced for a reason and that reason is not a good one, which means be prepared for the hyper volatile market that could cause you lose your money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ShinyStarPrincess",
      "created_time": "December 07, 2023, 01:35:51 AM",
      "body": "Quote from: hack3rcon on December 06, 2023, 09:35:50 AMHello,What cheap projects do you know that have good potential?Thank you.Check the new Layer 1 of Arbitrum and gamefi Gameswift. This one is a Modular Chain with zkEVM rollups designed on demand for different and specific games. The token is on Bybit and Bitget(The last one has an event on the Candy Bomb). The token is cheap and is under 700 on MC https://www.coingecko.com/es/monedas/gameswift",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "December 07, 2023, 03:12:44 AM",
      "body": "Quote from: hack3rcon on December 06, 2023, 11:23:49 AMHello,Thank you so much for your reply.Good projects whose prices are not high or have a number of zeros.Is this how investors look at cheap prices now? The ones who have a higher number of 0's in it are cheap? What if there are no 0s on it? Is it considered expensive then? It's kind of funny how investors have different factors in how they pick between a good project and a bad project. FYI, a good project doesn't mean having many 0s on it. How about Bitcoin? Ethereum? No 0s in it, but they are considered one of the top cryptocurrencies right now. Change your way of investing OP. Change your perspective. It doesn't matter if the project has a cheap price or it has many 0s. Do your research on the project. Have some bases that will help you pick which are good projects and which are not. Don't focus on the price, but focus on how beneficial it is. The community behind it might help you decide as well, but don't focus on the price of it. Maybe it would be better if you will just focus on buying Bitcoin, or even Ethereum if you don't have any time to research.  The fact that you're asking here is a sign that you don't want to spend time researching, and you just want to buy tokens base on other's suggestions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "December 07, 2023, 03:25:02 AM",
      "body": "Quote from: hack3rcon on December 06, 2023, 09:35:50 AMHello,What cheap projects do you know that have good potential?Thank you.Let me tell you this, in your mind, you only prefer quantity to quality. Get rid of this immediately and focus on re-learning knowledge about investing, crypto, technology,... And if you never knew, remember that anyone can create nonsense. With lots of zeroes and links to social channels to spam, and the ignorant easily falling into the trap (more precisely, stupidity), by the way, if you still think it's an opportunity, then I can tell you I can mass create those tokens, and whether you are willing to buy it after hearing what I shared above, it's all just garbage. You need to understand that even if you hold a lot of junk in your hands that has no value in terms of quality, you will never change the asset differently.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "December 07, 2023, 03:46:11 AM",
      "body": "Go for memecoins, memecoins are known for being cheaper, especially Dogecoin.For me, memecoins are the common cheapest right now, especially in the top 100, you will see memecoins on the top like PEPE or Shiba Inu or Dogecoin. But take note not all cheap are good to buy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samlucky O",
      "created_time": "December 07, 2023, 05:46:41 AM",
      "body": "Quote from: hack3rcon on December 06, 2023, 09:35:50 AMHello,What cheap projects do you know that have good potential?Thank you.It is difficult to predict a cheap coin with potential. There are a lot of coin that has surface the crypto market on daily basis and has different prices, market cap, total supply. But most of them are fake projects it takes time for you to discover the right one that's why people will always anticipate that only invest on BTC because it's the most trusted amongst all. But if need be to invest on shit coin or meme coin the one I will sudjest is pepe or Shiba Inu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Publictalk792",
      "created_time": "December 07, 2023, 06:08:03 AM",
      "body": "I don't now what you want to ask exactly. If you want to buy the cheap prices cryptocurrency so meme coins are best and you should buy them. If you are talking about low cap coins so you should visit coingecko or coinmarketcap. There you can find much coins.If you want any suggestion so I will say that don't think about cheaper coins. You should think about others coins which can give you more profit. So you should make a good research before investing. When you make research so you should share your experience here then you will get more information and other experienced members will share their thoughts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NewRanger",
      "created_time": "December 07, 2023, 07:53:01 AM",
      "body": "Quote from: Publictalk792 on December 07, 2023, 06:08:03 AMI don't now what you want to ask exactly. If you want to buy the cheap prices cryptocurrency so meme coins are best and you should buy them. If you are talking about low cap coins so you should visit coingecko or coinmarketcap. There you can find much coins.If you want any suggestion so I will say that don't think about cheaper coins. You should think about others coins which can give you more profit. So you should make a good research before investing. When you make research so you should share your experience here then you will get more information and other experienced members will share their thoughts.I'm sure OP already understands the meaning and function of coins and tokens. Now, moving on to the core question, from the OP and I think we should also look at market share, both fundamentals, usage adoption, and liquidity of coins and tokens as both can vary over time before we make an investment decision as for now so many coins and tokens circulating on the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoknightt",
      "created_time": "December 07, 2023, 10:01:41 AM",
      "body": "Atlas, Ordi, Solana, and several coins that have not yet been released and are under monitoring such as Jito which will be listed today, and maybe you can see it herehttps://crypto-fundraising.info/ you can see early  project potential there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bureau",
      "created_time": "December 07, 2023, 11:16:08 AM",
      "body": "I recently came across an Instagram post by coingecko, the title of the post was Top 10 Crypto from January 2023 till December 6th, 2023. Three coins caught my attention, all three are below $1 and have the potential to explode when the bull runs come after. These three coins are performing well in the present market condition. XRP gave a return of 83%, Tron gave a return of 90% and Dodge gave a return of 23%, the biggest surprise for me was Tron. All three are trusted cryptocurrencies that have been dominating the market cap for quite some time now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "criptoevangelista",
      "created_time": "December 07, 2023, 11:56:51 AM",
      "body": "This is a question that is very difficult to know, as we cannot know the market narrative when we are really in an alcoin season, the narrative that can happen is that of artificial intelligence, thinking about this I have something of a token called singularity dao (SDAO )",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}