{
  "id": "topic_5404569",
  "title": "coupable",
  "author": "coupable",
  "created_time": "June 29, 2022, 09:02:37 PM",
  "content": "According to many studies and the opinions of experts in behavioral psychology, gambling-related behaviors can be controlled, whether to reduce addictive behaviors or avoid addiction for beginners;In brief, You can deal well with your gambling problems by learning about it, addressing it, controlling what might drive you to gambling, and then getting support.Is this possible according to your opinion and what are the tips that can be followed?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404569",
  "comments": [
    {
      "author": "milewilda",
      "created_time": "June 29, 2022, 09:20:09 PM",
      "body": "It can really be controlled and that one would be starting from yourself.- Strong self discipline- Strong control of emotion- Limited or dont go beyond border lines in terms of spending- Dont believe one easy money or making yourself rich with gambling.Once you do have this kind of mindset or beliefs and you strictly followed itthen making yourself addicted through gambling is less likely to happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "June 29, 2022, 09:20:13 PM",
      "body": "Quote from: coupable on June 29, 2022, 09:02:37 PMIs this possible according to your opinion and what are the tips that can be followed?This is possible and I think it’s a must, we should always control our emotions, and that could lead to a positive behavior towards your gambling activities. Proper planning can be a big help, start with budgeting and have the target for winning. If you lose the whole budget for that day, you can just go home and with that you can be a responsible gambler. Just don’t spend so much time in gambling because the more you gamble, you are slowly forgetting the good behavior and it can lead you to being greedy because of too much exposure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "June 29, 2022, 09:25:16 PM",
      "body": "Your behavior will be your guide in gambling, if you have that positive behavior you can achieve more in gambling and it can prevent you from being addict so technically, this is very important. It can be controlled, its just a matter of execution and planning, if you plan to gamble occasionally the better, but if you plan to gamble actively maybe you should focus on creating the positive behavior, and you are the only one who can control it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "June 29, 2022, 09:35:00 PM",
      "body": "Quote from: coupable on June 29, 2022, 09:02:37 PMAccording to many studies and the opinions of experts in behavioral psychology, gambling-related behaviors can be controlled, whether to reduce addictive behaviors or avoid addiction for beginners;In brief, You can deal well with your gambling problems by learning about it, addressing it, controlling what might drive you to gambling, and then getting support.Is this possible according to your opinion and what are the tips that can be followed?It's really on the character and how well you've been trained all your life if early in your life you've learned the bad effects of gambling and you have a good upbringing you will not suffer from any kind of addiction, addiction is an escaped from reality too much of anything will harm you, it's ok to gamble as long as its for fun and there is allocation on it, on time and money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pokapoka124",
      "created_time": "June 29, 2022, 09:37:04 PM",
      "body": "Gambling can be controlled. The first step is to realize that there is a giant in the room, you have to see you have a gambling problem you want to stop or control. This is the difficult part imo, people often have self denial if you can get that out of the way then you're a step closer to your goal. You also need a support group where you can talk about your problem with people who understand and are going through the same phase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "June 29, 2022, 09:40:46 PM",
      "body": "I think gambling behaviour can be controlled and it starts by ourselves. In the beginning I think if you realise that you have been making alot of loses and you are getting into debts, you can caution yourself on the reason to stop because you will have many debts to offset and when you don't have money to do that, you will have all the reason to reduce or stop. For an addict, it is difficult to control because if he has money, high tendencies are there to go back into it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lanatsa",
      "created_time": "June 29, 2022, 09:48:00 PM",
      "body": "Quote from: aioc on June 29, 2022, 09:35:00 PMQuote from: coupable on June 29, 2022, 09:02:37 PMAccording to many studies and the opinions of experts in behavioral psychology, gambling-related behaviors can be controlled, whether to reduce addictive behaviors or avoid addiction for beginners;In brief, You can deal well with your gambling problems by learning about it, addressing it, controlling what might drive you to gambling, and then getting support.Is this possible according to your opinion and what are the tips that can be followed?It's really on the character and how well you've been trained all your life if early in your life you've learned the bad effects of gambling and you have a good upbringing you will not suffer from any kind of addiction, addiction is an escaped from reality too much of anything will harm you, it's ok to gamble as long as its for fun and there is allocation on it, on time and money. Indeed and not all people are really that good on handling out their emotions which do greatly affect their decisions towards gambling involvement or dealing with it.If you are a type of person who could control variousthings in terms of making good decisions or something that only just needs common sense then i dont really see any problems that would be molded into it.When you do gamble thenonly seek out for entertainment and leisure and dont go beyond on making profits because that would really just make you greedy.Once you cant control yourself then gambling isnt for you and having that high chance on getting addicted which is the worst thing to happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "June 29, 2022, 09:49:43 PM",
      "body": "Being honest with yourself, knowing your goals and your limitations. Those are the most important things when it comes to managing any addiction. Ask yourself a few questions like why you're doing it, is it affecting your life in a negative way, do you feel good or bad afterwards... Don't lie to yourself, don't try to forget your mistakes, don't run away from responsibility. You fuck up, you work it out to make it up to everyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "June 29, 2022, 10:18:55 PM",
      "body": "Quote from: coupable on June 29, 2022, 09:02:37 PMAccording to many studies and the opinions of experts in behavioral psychology, gambling-related behaviors can be controlled, whether to reduce addictive behaviors or avoid addiction for beginners;In brief, You can deal well with your gambling problems by learning about it, addressing it, controlling what might drive you to gambling, and then getting support.Is this possible according to your opinion and what are the tips that can be followed?It really can be controlled. But it all depends to your ability based on your mental strength. If you're strong mentally, then you really can. Think of those addicted gamblers that can no longer control themselves.They're the ones that gets into addiction and lose their control because they're weak mentally and they've been overcome by their own desire to gamble.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "June 29, 2022, 10:20:01 PM",
      "body": "Quote from: coupable on June 29, 2022, 09:02:37 PMIn brief, You can deal well with your gambling problems by learning about it, addressing it, controlling what might drive you to gambling, and then getting support.it is usually more easily said than done, the truth is that in reality it requires a whole lot of discipline, discipline first finding out if it is possible to stop gambling by oneself or if help is required. It is also a problem when you realize that you need help to put your gambling problem in check but feel too reluctant and decide to try to help yourself by yourself, a very dangerous situation you are building up because trying successively to break an addiction or fix a problem without success may make one just accept it as normal and believe that their case is too far to remedy. We should as much as possible maintain sincerity with ourselves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "June 29, 2022, 10:40:51 PM",
      "body": "Quote from: coupable on June 29, 2022, 09:02:37 PMAccording to many studies and the opinions of experts in behavioral psychology, gambling-related behaviors can be controlled, whether to reduce addictive behaviors or avoid addiction for beginners;The first two or three months of starting to gamble are the crucial it becomes a habit and falls into addiction, the worse thing about addiction is you always want more and you want more risk because of the high of itQuoteIn brief, You can deal well with your gambling problems by learning about it, addressing it, controlling what might drive you to gambling, and then getting support.If you established your own pattern in the first month and it's a safe pattern then you are good to go, addiction develops when you are at it most of your time, so if you are gambling be sure you are allocating little time and you have time for the most important thing in life, like job family and recreatingQuoteIs this possible according to your opinion and what are the tips that can be followed?There are more good players than gambling addicts, gambling addicts I believe are only on small percentage and the key to safe gambling is moderation, don't take too much of it and you should be good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rengga Jati",
      "created_time": "June 29, 2022, 10:47:02 PM",
      "body": "Quote from: coupable on June 29, 2022, 09:02:37 PMAccording to many studies and the opinions of experts in behavioral psychology, gambling-related behaviors can be controlled, whether to reduce addictive behaviors or avoid addiction for beginners;Truly, before this becomes an addiction, actually we ourselves can control and manage ourselves into gambling. We can manage not only our money but also our behavior, mental and psychological, and also our emotion. On the other hand, if we have been in the gambling addiction, it will be very difficult, moreover, we need certain help from the expert in order to understand which is actually best to do. Controlling self n gambling will help us under controlled, will have more stable situation, not panic mroeover.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "June 29, 2022, 10:55:17 PM",
      "body": "Quote from: coupable on June 29, 2022, 09:02:37 PMAccording to many studies and the opinions of experts in behavioral psychology, gambling-related behaviors can be controlled, whether to reduce addictive behaviors or avoid addiction for beginners;In brief, You can deal well with your gambling problems by learning about it, addressing it, controlling what might drive you to gambling, and then getting support.Is this possible according to your opinion and what are the tips that can be followed?I think it's definitely possible, but it's going to be very difficult. But if you have will power, and just like any addiction, you can stop it. But your mind should be the first one to really to understand and tell you that it's time to stop. Maybe just do something different, to get out out gambling in your system. Talk to your families often as they are your support in this time. Again, channel your mind and tell yourself that gambling is not good and it will just make you lose money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "June 29, 2022, 10:56:54 PM",
      "body": "Quote from: coupable on June 29, 2022, 09:02:37 PM...Is this possible according to your opinion and what are the tips that can be followed?I have gambled at a young age but I never got addicted to it. I wasn't particularly told by someone that addiction is bad but I understood that it's not good to lose money you're supposed to use on something else. I don't know but perhaps growing up with less teaches you to value money more than those easily gets it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DoublerHunter",
      "created_time": "June 29, 2022, 11:03:57 PM",
      "body": "Quote from: coupable on June 29, 2022, 09:02:37 PM~snip~Is this possible according to your opinion and what are the tips that can be followed?^ It will be healed but it takes a lot of time to it and it should be there is a rehabilitation of the patient who experienced gambling addiction. Addiction is not easy to deal with. When you are at that stage of addiction, your mind always looking at a gambling casino and the best is the rehabilitation and divert into other activities that you can forget gambling and as I said, it can be healed over time. It is very possible for a gambling addiction behavior to be healed but the problem is how long it will take.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "June 29, 2022, 11:18:17 PM",
      "body": "Quote from: Yogee on June 29, 2022, 10:56:54 PMQuote from: coupable on June 29, 2022, 09:02:37 PM...Is this possible according to your opinion and what are the tips that can be followed?I have gambled at a young age but I never got addicted to it. I wasn't particularly told by someone that addiction is bad but I understood that it's not good to lose money you're supposed to use on something else. I don't know but perhaps growing up with less teaches you to value money more than those easily gets it.This is not the kind of gambling I mean. Most of the people in the gambling section of the forum are not addicted and almost practice gambling with moderation, even from themselves, which push them to get involved and addictive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "June 29, 2022, 11:19:54 PMLast edit: June 29, 2022, 11:39:16 PM by Hydrogen",
      "body": "Looking at billionaires flying in private jets, riding in expensive luxury cars with their trophy wives and living in mansions.The only path many believe they have to living that type of life, is through gambling. They view it as their only path to success. Gambling is also the laziest potential path to a higher standard of living. There is no need to attend 4 years of schooling to earn a degree. No need for licensing or certification. Its an entry level career.These factors coupled together hold a powerful attraction over those who can't envision another path for themselves to achieve the type of life they want to live.Quitting gambling involves finding other ways to earn income and find a side hustle that works. I think a lot of people suffering from gambling addiction have no other hope, they firmly believe gambling is their only hope. Which makes it difficult to quit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zilon",
      "created_time": "June 29, 2022, 11:43:15 PM",
      "body": "Quote from: coupable on June 29, 2022, 09:02:37 PMIn brief, You can deal well with your gambling problems by learning about it, addressing it, controlling what might drive you to gambling, and then getting support.Is this possible according to your opinion and what are the tips that can be followed?One can also deal with gambling problem by discussing it with close relatives, friends, psychiatrists and specialist therapists. It is possible to deal with addiction the first step is admitting that there is a problem and second is seeking a solution. When it comes to issues related to gambling addiction it all starts by trying to recover from lost bets and gradually it begins to accumulate. Having a budget will help avoid anything that seem to represent addiction in gambling",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goinmerry",
      "created_time": "June 29, 2022, 11:53:20 PM",
      "body": "Quote from: coupable on June 29, 2022, 09:02:37 PMIs this possible according to your opinion and what are the tips that can be followed?Of course, gambling behaviors can be controlled. I don't see any reason why it can't be controlled. Even a gambling addict can overcome that worst behavior.Tips? It varies and depends on how the gambler is. - For casual gamblers, no need for any tips as these people are just gambling moderately or when they just feel it- For regular gamblers, even if they do gamble frequently, these people are still in control of themselves and just a bit of medication if they want to stop for good- For addictive gamblers, it's not mean that they are addicted, they are not responsible. There are lots of gambling addicts that are still responsible for their life outside gambling. Treatment here varies on how that person is managing their gambling activity.- For hardcore gambler that isn't responsible now for everything and showing worst actions, they should be assisted by their families and friends as these type of gamblers will ignore any advice and help.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}