{
  "id": "topic_5450533",
  "title": "Wolfblood200$",
  "author": "Wolfblood200$",
  "created_time": "April 28, 2023, 05:04:00 PM",
  "content": "Please recommend a good laptop for crypto..I want to use it for exchanges and holding crypto (wallets)..",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450533",
  "comments": [
    {
      "author": "mindrust",
      "created_time": "April 28, 2023, 05:10:15 PM",
      "body": "Quote from: Wolfblood200$ on April 28, 2023, 05:04:00 PMPlease recommend a good laptop for crypto..I want to use it for exchanges and holding crypto (wallets)..Pretty much any laptop? Acer, Dell, Asus, Lenovo, MSI... These are all well known brands. I used HP too but somehow I don't like them. Mine was getting too hot. I used Acer, Asus and Dell before and never had any problems with them. Asus and Acer were great. Some of my friends say Lenovo is making great products too but I never tried them.The thing is, any of these good brands are making good laptops. You just need to use the right operating system on them. So, whatever you get, don't get a Windows machine. Get something freedos and install a linux distribution. It will be the best thing you will do to yourself.Also don't get a bulky laptop. Get a slim one with a very good battery life and a good CPU. Everything else is noise. Never ever think about playing games on your laptop. You will fry it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "April 28, 2023, 05:42:44 PM",
      "body": "Quote from: Wolfblood200$ on April 28, 2023, 05:04:00 PMPlease recommend a good laptop for crypto..I want to use it for exchanges and holding crypto (wallets)..Any brand new, clean PC is pretty cool with me. You just need a clean PC with any product and OS. We all have our preferred choices, and the kind of specification you need to see in your design system.For me, I will recommend MAC laptops. It seems more secure to me than Windows. But when installing an OS, you should make sure you get it from a licensed and direct store in order not to get your PC infected even before you start using it. Most strong system viruses, like clipboard viruses and others that target crypto-related applications and extensions, have always been confirmed to be from infected OS.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayu7adi",
      "created_time": "April 28, 2023, 06:00:14 PM",
      "body": "There are no specific laptop specifications required for crypto needs. However, for those who enjoy trading, investing, or simply monitoring the market, there are some laptop recommendations based on features that I would suggest.First, look for a laptop with long battery life, at least 8 hours of usage. This is especially useful when you want to monitor the market while on the go, such as when traveling or at a cafe.Second, make sure the specifications are sufficient to open the latest UI graphics. When using a laptop for trading, for user convenience, ensure that hardware such as RAM, Processor, CPU, and graphics card uses the latest model. Besides minimizing issues, the performance of the latest hardware models is also more effective.Lastly, look for a laptop from a reputable brand. This is for the benefit of user experience quality and warranty period. Asus, Apple, and Toshiba may be my recommendations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z390",
      "created_time": "April 28, 2023, 06:00:20 PM",
      "body": "@Nwada001 there is a new crypto hijacking malware affecting Mac OS right now and it's getting out of hands. I won't advice anyone most especially the newbies to use crypto wallet on a PC, they can make all the mistakes in the book.OP try buying a hardware wallet or just use your mobile phone, get Electrum on the phone and recovery seed somewhere safe, you can carve the words on a stainless steel and keep the steel in your locker or somewhere no one can get to, running crypto wallet on PC as a newbie is not safe at all, if you are already good with PC you won't be asking this question.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ludmilla_rose1995",
      "created_time": "April 28, 2023, 06:06:19 PM",
      "body": "there is no standard laptop for crypto transactions, but a laptop with an Intel 13th generation processor, in my opinion, is good for that. especially if it has high ram specs like 16gb, that would be even better. For the graphics card it doesn't really matter, because your goal is only to exchange and hold tokens in the wallet you don't need a high-end graphics card for that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aikidoka",
      "created_time": "April 28, 2023, 06:14:36 PM",
      "body": "Quote from: Wolfblood200$ on April 28, 2023, 05:04:00 PMPlease recommend a good laptop for crypto..I want to use it for exchanges and holding crypto (wallets)..You don't necessarily need to buy an expensive laptop for crypto stuffs purposes. A mid-range or normal laptop would suffice for trading or other activities. However, I would advise against storing private data such as seed phrases, private keys, and personal documents on it, as it could be susceptible to hacking once connected to the internet.The best approach would be to purchase a new, inexpensive laptop and keep it air-gapped, meaning it is never connected to any network. Alternatively, you could repurpose an old android phone as an air-gapped device, but it should be thoroughly cleaned (formatted and free of viruses and malware) before using it to store your wallet and sign transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "April 28, 2023, 06:14:42 PM",
      "body": "Quote from: Wolfblood200$ on April 28, 2023, 05:04:00 PMPlease recommend a good laptop for crypto..I want to use it for exchanges and holding crypto (wallets)..Any used or new laptop is good if you are using it in a way that it is immune to viruses. There's a lot of antivirus that can prevent your laptop pc from getting hacked. But you need to look at the specification of any laptop before you buy it. Processor and it's generation, ram, cooling capability. You can all that info from YouTube on internet. One channel that I can suggest is Linus Tech Tips(LTT). But you need to do your own research on what you are looking for in that laptop. And using a laptop as a wallet is never a good choice. Better to have a hardware software than using laptop for that purpose. Software wallets are never immune to hacks and hackers. And I have seen this many times because it has happened to me already. Once you get hacked one time, doesn't matter what you do, use new OS, change internet connection, all this can't prevent you from getting hacked again. Those hackers will always find a way. For exchange and trading purpose, you can use it and buy the one that suites you. But for hodling crypto? Use hardware wallets. Trust me, you'll be in safe hands.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "April 28, 2023, 06:21:52 PM",
      "body": "Quote from: Z390 on April 28, 2023, 06:00:20 PM@Nwada001 there is a new crypto hijacking malware affecting Mac OS right now and it's getting out of hands. I won't advice anyone most especially the newbies to use crypto wallet on a PC, they can make all the mistakes in the book.OP try buying a hardware wallet or just use your mobile phone, get Electrum on the phone and recovery seed somewhere safe, you can carve the words on a stainless steel and keep the steel in your locker or somewhere no one can get to, running crypto wallet on PC as a newbie is not safe at all, if you are already good with PC you won't be asking this question. Both Mac OS and Windows are already target victims of dark developers. No operating system is completely safe, Mate.You can't tell someone who already has a preferred means and choice of storage to make another choice; you will only give them advice and directives on how to be free from those malwares.Even the so-called mobile device, which you propose as something safer than any other device like a PC, is also a victim of attacks from dark developers. [Warning]: New Android Malware - Chameleon  and you will see how this Malware have been targeting android devices using different methods. No device is completely safe; you just have to take responsibility for your own security and be careful of what you do with the gadget you use as a crypto storage device. You might never know where the leak is going to come from.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "entebah",
      "created_time": "April 28, 2023, 07:00:32 PM",
      "body": "Quote from: Wolfblood200$ on April 28, 2023, 05:04:00 PMPlease recommend a good laptop for crypto..I want to use it for exchanges and holding crypto (wallets)..you don't need to buy a laptop just to hold crypto, I recommend you just buy any hardware wallet like trezor or ledger.because right now I use trezor to hold my wallet and until now it's a very safe wallet for me to hold my coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "April 28, 2023, 07:40:30 PM",
      "body": "Quote from: Z390 on April 28, 2023, 06:00:20 PM@Nwada001 there is a new crypto hijacking malware affecting Mac OS right now and it's getting out of hands. I won't advice anyone most especially the newbies to use crypto wallet on a PC, they can make all the mistakes in the book.OP try buying a hardware wallet or just use your mobile phone, get Electrum on the phone and recovery seed somewhere safe, you can carve the words on a stainless steel and keep the steel in your locker or somewhere no one can get to, running crypto wallet on PC as a newbie is not safe at all, if you are already good with PC you won't be asking this question. Yeah I agree with you. As a newbie halving crypto assets for \"hodling\" purpose in a laptop that's is connected to the internet is not advisable as there's the possibility that he/she might visit sites that are compromised with malware or install apps developed by attackers, thereby losing his/her assets. The best thing is to get a hardware wallet like trezor or ledger to hodl the crypto assets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Furious 7",
      "created_time": "April 28, 2023, 07:48:29 PM",
      "body": "Actually in this case there are no special specifications about it and I'm also still using a laptop that's been around for years to do that no problem there.But maybe for the sake of more convenience, of course, something new will be better in any case if indeed we can buy it because in this case the use of a laptop is also not only for crypto, of course, but if you really don't have something like that, just use what you really can do it I think it's also still very capable even though the generation may still be backward in terms of processors and others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Weezenhofnar",
      "created_time": "April 28, 2023, 07:55:15 PM",
      "body": "When choosing a laptop for crypto-related activities, look for features like high processing power, ample storage, good battery life, and a strong internet connection. Some recommended laptops are the Dell XPS 13, MacBook Pro, Lenovo ThinkPad X1 Carbon, and ASUS ROG Zephyrus G15.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "April 28, 2023, 08:26:06 PM",
      "body": "Quote from: Wolfblood200$ on April 28, 2023, 05:04:00 PMPlease recommend a good laptop for crypto..I want to use it for exchanges and holding crypto (wallets)..If the purpose for acquiring the laptop is only for trading and holding crypto, then any popular brand would do. I don’t think the model of computer or device matters in terms of security as much as the wallets you choose to use to hold your bitcoins. Use a non custodial wallet and store your keys offline. Observe security practices like avoiding suspicious links that may appear on your browser, also check for malware occasionally to know if your computer has been compromised.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasog",
      "created_time": "April 28, 2023, 08:34:42 PM",
      "body": "Quote from: Wolfblood200$ on April 28, 2023, 05:04:00 PMPlease recommend a good laptop for crypto..I want to use it for exchanges and holding crypto (wallets)..This is one of the hilarious questions I come across asking about storing crypto. You can store them in any laptop or use exchanges on any computer as these things do not require any specific processors and do not take much hard disk space or ram usage.The important thing is that in which ever laptop you install the wallets on, make sure the latest version of Anti Virus is installed on that laptop and also try not to surf the Internet from that laptop, and even if you do, try not to click on links which you do not know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "April 28, 2023, 08:43:38 PM",
      "body": "Quote from: Wolfblood200$ on April 28, 2023, 05:04:00 PMPlease recommend a good laptop for crypto..I want to use it for exchanges and holding crypto (wallets)..There isn't a particular laptop that is good for cryptocurrencies I can only advise you which are the best for Linux for example, and my choice is Thinkpad in first place and Dell next because both have excellent firmware support.So take any laptop and install a distro like Debian or Slackware which are both very stable and secure, but these are for day-to-day use.While for your cryptocurrencies, buy a USB stick and put Tails in it, which is an excellent operating system that will transform your USB into an excellent tool for your Bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "April 28, 2023, 08:50:51 PM",
      "body": "Quote from: Wolfblood200$ on April 28, 2023, 05:04:00 PMPlease recommend a good laptop for crypto..I want to use it for exchanges and holding crypto (wallets)..Even a desktop computer would be able to serve in that capacity although, it depends largely on the loads of work you subject the device to. Any device would work as exchanges are basically online and don't need any much space to work except for browsers that can access them sites. Wallets just need a few kilobytes to be installed and run successfully, although how safe it is depends largely on what and what you install or choose to click on your device.Keep a device very functional would add you in working a exchange and so, you might as well want to ensure a proper well being of your device by updating antivirus programs, have well enough ram & rom, avoid over hitting of your device, close tabs that aren't in use and general stuff like that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "April 28, 2023, 08:52:42 PM",
      "body": "Quote from: Ludmilla_rose1995 on April 28, 2023, 06:06:19 PMthere is no standard laptop for crypto transactions, but a laptop with an Intel 13th generation processor, in my opinion, is good for that. especially if it has high ram specs like 16gb, that would be even better. For the graphics card it doesn't really matter, because your goal is only to exchange and hold tokens in the wallet you don't need a high-end graphics card for that.What does the processor and ram have to do with storing bitcoin? You can use an older PC if you like. Honestly, I'd rather have an older HDD than a new SSD because it's much harder to recover data from an SSD if it gets damaged or wiped. Quote from: Z390 on April 28, 2023, 06:00:20 PM@Nwada001 there is a new crypto hijacking malware affecting Mac OS right now and it's getting out of hands. I won't advice anyone most especially the newbies to use crypto wallet on a PC, they can make all the mistakes in the book.OP try buying a hardware wallet or just use your mobile phone, get Electrum on the phone and recovery seed somewhere safe, you can carve the words on a stainless steel and keep the steel in your locker or somewhere no one can get to, running crypto wallet on PC as a newbie is not safe at all, if you are already good with PC you won't be asking this question. So a PC is bad and unsafe, but you recommend OP stores coins on a phone?  At least with a PC if a component dies you'll be able to replace it yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ever-young",
      "created_time": "April 28, 2023, 09:12:49 PM",
      "body": "Quote from: sokani on April 28, 2023, 07:40:30 PMQuote from: Z390 on April 28, 2023, 06:00:20 PM@Nwada001 there is a new crypto hijacking malware affecting Mac OS right now and it's getting out of hands. I won't advice anyone most especially the newbies to use crypto wallet on a PC, they can make all the mistakes in the book.OP try buying a hardware wallet or just use your mobile phone, get Electrum on the phone and recovery seed somewhere safe, you can carve the words on a stainless steel and keep the steel in your locker or somewhere no one can get to, running crypto wallet on PC as a newbie is not safe at all, if you are already good with PC you won't be asking this question. Yeah I agree with you. As a newbie halving crypto assets for \"hodling\" purpose in a laptop that's is connected to the internet is not advisable as there's the possibility that he/she might visit sites that are compromised with malware or install apps developed by attackers, thereby losing his/her assets. The best thing is to get a hardware wallet like trezor or ledger to hodl the crypto assets.I totally disagree with your both point, it's not only PC that's requires internet connection and goes to the net, mobiles phone do too and they are also subjected to be infected by virus. Any device which have access to the internet can be infected by virus if the user is not careful enough. Hardware wallet is the safest even as that you need to also be very much careful in other not to connect it to an infected device. Just as a member above has suggested, it will be of best interest if you have separate device for separate purposes. Just as the OP has proposed for PC which it's it's primary purpose is to be used as wallet and trading on exchanges. The OP can have that pc separately for that, and bookmark all his trading website and download wallets only from the direct source, not using any kind of other apps which might endanger the system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "April 28, 2023, 09:41:50 PM",
      "body": "Quote from: sokani on April 28, 2023, 07:40:30 PMYeah I agree with you. As a newbie halving crypto assets for \"hodling\" purpose in a laptop that's is connected to the internet is not advisable as there's the possibility that he/she might visit sites that are compromised with malware or install apps developed by attackers, thereby losing his/her assets. The best thing is to get a hardware wallet like trezor or ledger to hodl the crypto assets. the OP would also have other needs for the laptop apart from crypto exchanges, and the Mac suggested by Nwada001 is a good PC. By the way, as long as any device you are using to hold your Bitcoin is always going online, it is at risk of malware attacks, so even the mobile phone is not safe. Perhaps if the OP gets a hardware wallet to hold their Bitcoin in cold storage, they may still have a need for a hot wallet that can be used on their laptop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}