{
  "id": "topic_5494878",
  "title": "krishnaverma",
  "author": "krishnaverma",
  "created_time": "May 01, 2024, 06:32:19 AM",
  "content": "What is you research process for events like bitcoin halving ? From where did you learn about it and its impact on bitcoin prices. Personally, I gathered all the information from bitcointalk forum and reddit.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5494878",
  "comments": [
    {
      "author": "SquirrelJulietGarden",
      "created_time": "May 01, 2024, 06:50:16 AM",
      "body": "Quote from: krishnaverma on May 01, 2024, 06:32:19 AMWhat is you research process for events like bitcoin halving ? From where did you learn about it and its impact on bitcoin prices.Most people care about price on the market and profit or chance to get profit. They don't care about technical developments, adoption, value of Bitcoin.For Bitcoin halving and its impacts on Bitcoin price, you can see the chart and make your own thinking or conclusion.Pi cycle top and bottom indicator is a good one to use because it helps you to find top and bottom range. When you see the top and bottom range, you can make your entries and exits.https://www.lookintobitcoin.com/charts/pi-cycle-top-bottom-indicator/https://charts.bitbo.io/pi-cycle-top/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "May 01, 2024, 07:04:39 AM",
      "body": "Quote from: krishnaverma on May 01, 2024, 06:32:19 AMPersonally, I gathered all the information from bitcointalk forum and reddit. I, too, knew about the halving event through this forum. I don’t know if reddit is the best source for cryptocurrency information though. A lot of spammers and just people spreading misinformation go around reddit. Anyway once I saw halving being talked about I went on and researched more about it. It took a lot to understand the why, how and when. After that I researched about how to move forward. I tried acquiring as much as I can right before halving. And now all is left to do is wait.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ambatman",
      "created_time": "May 01, 2024, 07:11:48 AM",
      "body": "Just halving or accurate information on Bitcoin? If it's accurate information I would say Github and Bitcointalk but if it's about the halving then various sources in the Net. It's a well known event so you source out various information by just searching the web.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Felicity_Tide",
      "created_time": "May 01, 2024, 09:14:54 AM",
      "body": "As a newbie to the Bitcointalk forum, I must admit that there is already enough information for everyone, even for those who choose to start investing or learning about Bitcoin. I recently made the decision to go into Bitcoin investment, and I thought there must be a need to learn so many things. Something interesting about learning on Bitcointalk is that you would remember what you've read faster after reading series of replies of similar nature.I made my research about halving on Bitcointalk, and here are a few posts and comments I found, as I have previously dedicated my time to searching through the forum and reading about halving and its effect on price.Post by @Zlantannhttps://bitcointalk.org/index.php?topic=5492644.msg63939674#msg63939674Post by @bitzizzixhttps://bitcointalk.org/index.php?topic=5492644.msg63939399#msg63939399Post by @chmod755 https://bitcointalk.org/index.php?topic=5493703.msg63975312#msg63975312There are so many you would find when you use the search button in the home page. The ability to gather every replies into one piece makes it an information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "May 01, 2024, 01:06:52 PM",
      "body": "As a Bitcoin user, bitcoin halving may not affect you, as you do not need to update your wallet or do anything. the effect of halving is economic, and since the effect is economic, studying the basics of technical analysis is the basis for understanding and developing charts, and then sharing what you have learned and reviewing the free analyzes provided by some analysts on X reddit or here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joeperry",
      "created_time": "May 01, 2024, 01:22:51 PM",
      "body": "Quote from: krishnaverma on May 01, 2024, 06:32:19 AMWhat is you research process for events like bitcoin halving ? From where did you learn about it and its impact on bitcoin prices. Personally, I gathered all the information from bitcointalk forum and reddit. Halving is common and usually every 4 years so there's no research needed for that and there's actually a countdown in that. But if you are referring to something what will happen after that event? There's some comparisons of the price before and after the halving and usually it goes up but there's a difference now because it pumps first before the halving, now I do get information not only here and reddit but I do also read some news articles about crypto and also other established trader's insight.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Morpheus_Exodus",
      "created_time": "May 01, 2024, 01:32:49 PM",
      "body": "Researching events like the Bitcoin halving involves several steps:1. Understanding the Event: Start by understanding what the Bitcoin halving is. It's a process that reduces the reward for mining new bitcoins by half, which occurs approximately every four years. This event is crucial because it affects the supply and demand dynamics of Bitcoin.2. Historical Analysis: Look at past Bitcoin halving events to understand how the market and price reacted before, during, and after the event. Analyze factors such as price trends, trading volume, miner behavior, and investor sentiment.3. Market Sentiment Analysis: Monitor forums, social media platforms, and news outlets to gauge market sentiment leading up to the halving. Pay attention to opinions from experts, traders, and investors to understand their expectations and predictions.4. Technical Analysis: Use technical analysis tools to assess Bitcoin's price chart patterns, support and resistance levels, and indicators like moving averages, RSI (Relative Strength Index), and MACD (Moving Average Convergence Divergence). This can help identify potential price movements.5. Fundamental Analysis: Evaluate fundamental factors such as Bitcoin's adoption rate, network hash rate, transaction volume, institutional interest, regulatory developments, and macroeconomic trends. These factors can influence Bitcoin's price performance before and after the halving.6. Expert Opinions: Seek insights from cryptocurrency analysts, economists, and industry leaders. Attend webinars, read research reports, and follow interviews to gather diverse perspectives and expert opinions on the potential impact of the halving.7. Risk Assessment: Consider the risks associated with Bitcoin halving, such as increased price volatility, mining profitability changes, regulatory uncertainty, and market manipulation. Develop risk management strategies to mitigate potential downsides.8. Scenario Planning: Develop different scenarios based on various outcomes of the halving event. This includes bullish scenarios where Bitcoin's price surges, bearish scenarios with price corrections, and sideways trends. Prepare contingency plans for each scenario to adapt to market changes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "May 01, 2024, 01:40:32 PM",
      "body": "If you want to know the process, here's the source code and you can check on mempool.space to see the blocks that currently processing and the completed blocks.Quote from: https://gist.github.com/nelruk/d00d785f84e47288b0ab734d4aab5f49CAmount GetBlockSubsidy(int nHeight, const Consensus::Params& consensusParams){    int halvings = nHeight / consensusParams.nSubsidyHalvingInterval;    // Force block reward to zero when right shift is undefined.    if (halvings >= 64)        return 0;    CAmount nSubsidy = 50 * COIN;    // Subsidy is cut in half every 210,000 blocks which will occur approximately every 4 years.    nSubsidy >>= halvings;    return nSubsidy;}If you talk about halving event affect Bitcoin, halving only make Bitcoin scarce, it doesn't make the price will increase instantly because it depends on demand. Even Bitcoin halve for 10x times, but the demand is stagnant, the price won't increase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "May 01, 2024, 11:46:27 PMLast edit: May 01, 2024, 11:56:56 PM by AmoreJaz",
      "body": "Quote from: joeperry on May 01, 2024, 01:22:51 PMQuote from: krishnaverma on May 01, 2024, 06:32:19 AMWhat is you research process for events like bitcoin halving ? From where did you learn about it and its impact on bitcoin prices. Personally, I gathered all the information from bitcointalk forum and reddit. Halving is common and usually every 4 years so there's no research needed for that and there's actually a countdown in that. But if you are referring to something what will happen after that event? There's some comparisons of the price before and after the halving and usually it goes up but there's a difference now because it pumps first before the halving, now I do get information not only here and reddit but I do also read some news articles about crypto and also other established trader's insight.Most crypto-related websites like coindesk, cointelegraph and others have their own articles related to bitcoin halving. That is, if you are not a user of this forum. But if you are here, there are countless threads having this discussion. There are also technical discussion on this to understand better what is happening in halving and what to expect, what you can do before and after halving. But of course, need to filter valuable insights depending on your financial capability.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ancafe",
      "created_time": "May 02, 2024, 02:01:13 AM",
      "body": "Quote from: krishnaverma on May 01, 2024, 06:32:19 AMWhat is you research process for events like bitcoin halving ? From where did you learn about it and its impact on bitcoin prices. Personally, I gathered all the information from bitcointalk forum and reddit.  If we don't have the ability to analyze Bitcoin's journey then all we can do is look at some slightly more accurate predictions from experts. Although practices like this are not good because we do not have the knowledge to recognize them and generally to make it easier for us to see halvings we make adjustments to the four-year cycle so that we have a trail of images that we can analyze. Forums are a more comfortable place to recognize that the halving process is occurring because many people discuss it every day.Any information will be quite useful for us, but how can we verify it first before deciding. For this reason, knowledge is the basis when we carry out studies. With knowledge, it will be much easier to recognize the halving process that is occurring. The formula may be different, but what we need to think about is the final result where the halving brings us the expected profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "May 02, 2024, 04:55:16 AM",
      "body": "Usually, because these events will have a halving, most communities in this field expect that after the halving, the price value of Bitcoin will rise or rally. That's why they are wrong in their assumptions. Because if we look at history, that's not what happens.Instead, after the halving, there is a correction for a few months before there is a rally in the price value of Bitcoin. And I only have updates on these events through article platforms, and even though this forum is becoming more popular, I also have tools for these kinds of events.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AVE5",
      "created_time": "May 02, 2024, 09:42:30 AM",
      "body": "The bitcoin halving is an event which occurs in every circles of 4 years in the bitcoin industry where the miners earns rewards from the services offered to manage the complexities of transaction.It brings about the impacts to attract more investors and also period of time by which Investors could buy more of bitcoins to their holdings during which the price of the bitcoin falls to the Dip.Periodically it enables large scales of DCAing for Investors to accumulate.I've spent all my bitcoin historical life here in the bitcointalk forum and right here I explore to learn lot of variety events of bitcoin Such as the halving, bull, bear and the Dips. Etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "May 02, 2024, 10:03:12 AM",
      "body": "Quote from: krishnaverma on May 01, 2024, 06:32:19 AMWhat is you research process for events like bitcoin halving ? From where did you learn about it and its impact on bitcoin prices. Personally, I gathered all the information from bitcointalk forum and reddit. From my own experience.There's no need for me to research further about it because being with it for two times is already enough for me that the market cycle is for real. The 4-year cycle that includes the halving really is going to make the price of BTC up anytime soon.If we're experiencing some dips nowadays, don't rush as this is normal and part of the market's rise for the upcoming bull run that we're all waiting for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "May 02, 2024, 04:53:43 PM",
      "body": "Quote from: krishnaverma on May 01, 2024, 06:32:19 AMWhat is you research process for events like bitcoin halving ? From where did you learn about it and its impact on bitcoin prices. Personally, I gathered all the information from bitcointalk forum and reddit. Information about Bitcoin halving is everywhere and the event is simple to understand. One doesn't need to invest so much time to read about the halving. Anyway, Bitcointalk is my major source of Bitcoin education. The forum has many materials on Bitcoin and many members have deep knowledge of Bitcoin. There are no questions about Bitcoin that forum members cannot answer. However, I visit some websites to get acquainted with the latest news in the Bitcoin space. Some of these websites are helpful but I always verify the information I get from them with other information centres. It is vital to note that some of these websites might come up with fake or unverified information. And they can also be used to spread FUD or promote unreliable projects. Reddit is not a bad place to get information but just like other social media platforms comments are based on the knowledge of users. Hence information from Reddit should be verified because fake information could also emanate from the platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "May 02, 2024, 05:08:58 PM",
      "body": "Quote from: krishnaverma on May 01, 2024, 06:32:19 AMWhat is you research process for events like bitcoin halving ? From where did you learn about it and its impact on bitcoin prices. Personally, I gathered all the information from bitcointalk forum and reddit. It's not all about the platform used in gathering of the information, it's all about having the full in-depth of these informations and how we could make use of every piece of them to achieve what we want, we have to understand that there are times in which we have to make use of every opportunity we have investing at the right time, knowing the implications that comes with the halving event, this will help us by knowing when right to make any decision concerning our investment, I will say it's more of the use and application of halving event that matters than where we learned them from.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "R100K-Martin-Lunger",
      "created_time": "May 02, 2024, 05:23:36 PM",
      "body": "I start with a historical analysis. I read up on past trends first and foremost and then look up what reputable industry names, i.e., analysts are saying about the event. For instance, right now many investors are worried about the price dips, but having done my research I understand that it's expected after the halving. It's just price corrections and even if the price dips further, it will recover during the bull run. I am also hopeful for bitcoin to achieve a new ATH this year as the post-halving bull run is yet to come. Historically as well, the bull run comes a few months after the halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "May 02, 2024, 05:37:46 PM",
      "body": "Researching the halving depends on what your \"end game\" is.If you plan on HODL'ing for the long term there really isnt anything to research other thanwhen its going to happen, what block height. HODL'ing long term means your belief is thatBitcoin will continue to increase in value.There are so many places to get your information regarding a halving. If you want past markettrends pre and post halving the easiest way I suppose would be to determine the dates they happened . . .Quote1st Bitcoin halving date — November 28, 2012 — Reward down: 50 BTC to 25 BTC2nd Bitcoin halving date — July 9, 2016 — Reward down:  25 BTC to 12.5 BTC3rd Bitcoin halving date — May 11, 2020 — Reward down:  12.5 BTC to 6.25 BTC4th Bitcoin halving date — April 19, 2024 — Reward down: 6.25 BTC to 3.125 BTCswanbitcoin.comthen cross reference these with coinmarketcap.com . . .Here is the first one",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChiBitCTy",
      "created_time": "May 02, 2024, 05:56:33 PM",
      "body": "The first thing I ever did was read Mastering Bitcoin by Andreas Antonopoulos.  In my opinion he's the greatest bitcoin teacher of all time.  Bitcoin owes him a great deal of gratitude. He also has other books such as \"The internet of Money\".  His YouTube account is great as well  https://www.youtube.com/@aantonop .  This is how I learned about the halving and so many other details of bitcoin.  Trust me when I say if you haven't heard of him or viewed his content, DO SO.  He is not some simple YouTuber who doesn't understand cryptography and promotes shitcoins for kick backs..he's the real deal!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "May 02, 2024, 07:15:38 PM",
      "body": "Quote from: ChiBitCTy on May 02, 2024, 05:56:33 PMThe first thing I ever did was read Mastering Bitcoin by Andreas Antonopoulos.  In my opinion he's the greatest bitcoin teacher of all time.  Bitcoin owes him a great deal of gratitude. He also has other books such as \"The internet of Money\".  Really? Then you must have some IT background. The book is pretty difficult for beginners with a lot of complex stuff and many pages about the code. Most of us aren't really interested in bitcoin code, so honestly I would not recommend that for your first book.What I would recommend is The Bitcoin Standard by Saifedean Ammous. If you're not interested in learning the inner workings of bitcoin and are more into finances, how bitcoin works as money and the importance of holding, choose that. If you really want something by Andreas, watch his youtube videos. They're much more comprehensive than the book.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}