{
  "id": "topic_5398331",
  "title": "famososMuertos",
  "author": "famososMuertos",
  "created_time": "May 12, 2022, 02:45:11 PM",
  "content": "\"El dólar no había estado tan fuerte en 20 años: ... \" para saber que dicen los puntos suspensivos vaya a la fuente, es bastante capitalista.QuoteEl dólar alcanzó la semana pasada máximos de 20 años frente a una cesta de las principales divisas del mundo y tuvo en abril su mejor mes de los últimos siete años, ya que la preocupación por la economía mundial y la postura de la Reserva Federal, que se muestra muy agresiva, reforzaron la demanda por el billete verde.Fuente:https://es-us.finanzas.yahoo.com/noticias/el-dolar-no-habia-estado-tan-fuerte-en-20-anos-se-crece-en-la-adversidad-160441543.htmlSegún la fuente la región (LA) mantiene buen aspecto, eso si en la imagen de unos cuantos solamente.El articulo se deja la idea de y cito: \"...renovado papel como moneda refugio.\"En serio, renovado? refugio?Para muchos siempre ha sido refugio en el resultado del activo de las inversión en dólares, y en el asunto de renovado, creo que el asunto positivo del dólar medido en los estándares tradicionales perjudican la percepción real del pueblo y en consecuencia en la realidad de su bolsillo, la inflación sigue ahí, sin duda los números macroeconómicos lavan la cara del dólar y en especifico su lucha inflacionaria.Digo! estas posiciones benefician gobiernos según lo apegados al verde en el resultado benigno de esos positivos números, según el artículo, entonces bien por los empresarios que se benefician por la posición del dólar ante sus respectivas divisas locales, aha! y los importadores o los compromisos de pago, bien por Estados Unidos en la teoría el más beneficiado, pero tiene un efecto limitado siempre en la realidad del poder adquisitivo del resto.Recapitulo: Renovado! Refugio!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398331",
  "comments": [
    {
      "author": "Hispo",
      "created_time": "May 21, 2022, 01:13:36 AM",
      "body": "Para ser justos, desde la perspectiva de la economía de los paises latino-americanos más golpeados, el dolar Estado Unidense ha sido tradicionalmente un refugio a la inflación local, quizá porque el 2% de inflación al cual apuesta la reserva federal es minúscula al compararlo.Ahora bien, creo que estamos en momentos especiales e inéditos en los cuales la hegemonía del Dolar se ve afectado por las medidas económicas de políticos que están dispuestos a sacrificar la teoría en pro de impulsar sus ideologìas específicas, sin mencionar la cantidad de nuevo circulante que se imprimió desde el inicio de la pandemia.Al final, @Famososmuertos esto se trata de la fé que exista en las instituciones Norteamericanas para poder seguir pagando su gigantesca deuda y el como evolucione la sociedad de Estados Unidos en comparación con otros paises, mientras tanto, lo queramos o no para el No-Coiner promedio de América Latina los refugios por ahora son: Los dolares y los metales preciosos (en especial el oro) y seguirá siendo así mientras la cripto-revolución continue con su avance lento pero seguro o ocurra algo catastrófico que mine la confianza en el dolar a largo plazo, desplazandose de la mente del colectivo como la supuesta reserva de valor que es.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}