{
  "id": "topic_5452713",
  "title": "Crypt jnr",
  "author": "Crypt jnr",
  "created_time": "May 14, 2023, 04:34:47 PM",
  "content": "I had a math class with third graders of which we discussed money I told them about virtual and real money of which I was very shocked and happy that they had knowledge about Bitcoin.However we ended the class after we had spoken alot about Bitcoin they were soo happy and loved the class also Like wow being with the kids was a nice time for them and I to get to know Bitcoin better look forward to having a class with them next week",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452713",
  "comments": [
    {
      "author": "gantez",
      "created_time": "May 14, 2023, 05:03:40 PMLast edit: May 15, 2023, 02:50:48 PM by gantez",
      "body": "Nothing is wrong with third graders to understand the bitcoin technology. Class room knowledge is not true taste for being intelligent or brilliant. There are people that do everything academic to be at top in the class but they perform poor on total average performance in IQ. Being third class grade is not stopping anyone from doing well in the outside world or being rich. The people who are rich are not best people in the classroom. Anyone can have interest to learn bitcoin and invest because bitcoin technology is not class room grading. It is better to test your kids on their IQ on early stage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "May 14, 2023, 05:40:11 PM",
      "body": "Quote from: Crypt jnr on May 14, 2023, 04:34:47 PMI had a math class with third graders of which we discussed money I told them about virtual and real money of which I was very shocked and happy that they had knowledge about Bitcoin.However we ended the class after we had spoken alot about Bitcoin they were soo happy and loved the class also Like wow being with the kids was a nice time for them and I to get to know Bitcoin better look forward to having a class with them next weekThird graders are between the ages of 7-9year. It is not a bad idea to introduce Bitcoin to them as a currency and highlight some of the benefits of Bitcoin. It will also be nice to relate some maths topic that deals with investment to Bitcoin during classes. But arranging a class to teach them about Bitcoin is going to the extreme. Children at this stage should focus on their school scheme of work and building interpersonal skills. Children should be allowed to build their cognitive and emotional lives. They should be allowed to enjoy their childhood by playing games and relaxing with friends. You have good intentions, but I think it is not the right time for the children to be exposed to Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "May 14, 2023, 07:10:55 PM",
      "body": "Quote from: Crypt jnr on May 14, 2023, 04:34:47 PMI had a math class with third graders of which we discussed money I told them about virtual and real money of which I was very shocked and happy that they had knowledge about Bitcoin.However we ended the class after we had spoken alot about Bitcoin they were soo happy and loved the class also Like wow being with the kids was a nice time for them and I to get to know Bitcoin better look forward to having a class with them next weekThey probably see or heard it in Tiktok or Youtube or any other social media. That's how kids are nowadays as compare to let's say 50 years ago wherein the knowledge of money is not with us when we are young.However, I totally doubt that they knew blockchain or what Bitcoin as far as technical terms. Again, they heard it somewhere and we don't know if the knowledge that they have is correct or not. So I will advise you to listen to them and see what they've learn about Bitcoin or crypto in general.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "May 14, 2023, 07:14:41 PM",
      "body": "Quote from: Crypt jnr on May 14, 2023, 04:34:47 PMI had a math class with third graders of which we discussed money I told them about virtual and real money of which I was very shocked and happy that they had knowledge about Bitcoin.However we ended the class after we had spoken alot about Bitcoin they were soo happy and loved the class also Like wow being with the kids was a nice time for them and I to get to know Bitcoin better look forward to having a class with them next weekBeautiful, I love it when you talk to children about Bitcoin and they start asking you questions with all their curiosity.  An Italian user wrote and then translated into many languages ​​a book he illustrated that could be right for you.MONEY: From Its Origins To Our Times - 5 Minute Reading – 5 Years & Up (English Edition) https://amzn.eu/d/8608vfcTry it you will be amazed by its simplicity",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "May 14, 2023, 07:54:34 PM",
      "body": "Quote from: Kemarit on May 14, 2023, 07:10:55 PMQuote from: Crypt jnr on May 14, 2023, 04:34:47 PMI had a math class with third graders of which we discussed money I told them about virtual and real money of which I was very shocked and happy that they had knowledge about Bitcoin.However we ended the class after we had spoken alot about Bitcoin they were soo happy and loved the class also Like wow being with the kids was a nice time for them and I to get to know Bitcoin better look forward to having a class with them next weekThey probably see or heard it in Tiktok or Youtube or any other social media. That's how kids are nowadays as compare to let's say 50 years ago wherein the knowledge of money is not with us when we are young.However, I totally doubt that they knew blockchain or what Bitcoin as far as technical terms. Again, they heard it somewhere and we don't know if the knowledge that they have is correct or not. So I will advise you to listen to them and see what they've learn about Bitcoin or crypto in general.Exactly! While Bitcoin can be a fascinating topic for kids to learn about, teachers should not overlook the importance of traditional financial literacy skills like budgeting and saving. So let us teach our kids the value of saving up for something they really want, and the importance of smart financial decisions. Because in the end, whether they are using Bitcoin or good old-fashioned dollars, money management is key.So, teaching kids about Bitcoin and other cryptocurrencies can be fun and engaging. However, we should not forget to cover all bases and provide an equal understanding of both traditional financial skills and decentralized currencies. This approach will help prepare them for the ever-evolving world of finance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "May 14, 2023, 08:28:00 PM",
      "body": "The early you start, the more time you get to understand the thing. This is a great thing that they know about it already. This is what we need if we want to create a generation that understand the concept of freedom and accepts Bitcoin. Never too late when you start early. As they say, practice makes you perfect. So more time equals more experience. It's going to be great to see what they will do with this information in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "May 14, 2023, 08:36:41 PM",
      "body": "Well, it's prolly because to the videos that they've been seeing on their socials. When there's some random videos comes out that's related to Bitcoin and they've watched a few seconds of it.Then, the algorithm of that social media will keep on feeding them with the same type of videos and niche and every time they browse. Those videos are the ones that will appear.It's good that these third graders are already aware of Bitcoin. But did you know how they're able to obtain the idea of Bitcoin or where they've first heard of it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "May 14, 2023, 08:38:14 PM",
      "body": "Quote from: Crypt jnr on May 14, 2023, 04:34:47 PMI had a math class with third graders of which we discussed money I told them about virtual and real money of which I was very shocked and happy that they had knowledge about Bitcoin.They must have heard it somewhere growing up as a kid, either on the internet or social media which kids of nowadays are exposed to at a very young age. Since they already have knowledge about it from now, learning about it more will be easier for them because their brain is still young and accumulative at the moment. They’re lucky to be this exposed and able to learn about financial literacy at this stage.QuoteHowever we ended the class after we had spoken alot about Bitcoin they were soo happy and loved the class also Like wow being with the kids was a nice time for them and I to get to know Bitcoin better look forward to having a class with them next weekThat’s great that you’re planning to have another class with them again, although just take it slow and steadily and don’t move away from the scope of work too much to focus totally on teaching them about bitcoin. You can inter switch as the class is going to give example where need be about bitcoin and how it relates to what they’re learning at that moment in time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "May 14, 2023, 08:41:33 PM",
      "body": "Letting children know about Bitcoin at such an early age is great and even discussing it with them is superb but don't let your class be distracted by such a thing.  I think you still need to implement the school curriculum on these kids since you are paid for that.  Being distracted and using your time in teaching to discuss Bitcoin is somehow unfair to these kids.  They should be learning the subject you are supposed to teach and not about Bitcoin and its economics.  I believe each subject has its proper place and time to learn and your time is for these kids to learn about mathematics to prepare them for higher math.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "May 14, 2023, 08:50:40 PM",
      "body": "Quote from: serjent05 on May 14, 2023, 08:41:33 PMLetting children know about Bitcoin at such an early age is great and even discussing it with them is superb but don't let your class be distracted by such a thing.  I think you still need to implement the school curriculum on these kids since you are paid for that.  Being distracted and using your time in teaching to discuss Bitcoin is somehow unfair to these kids.  They should be learning the subject you are supposed to teach and not about Bitcoin and its economics.  I believe each subject has its proper place and time to learn and your time is for these kids to learn about mathematics to prepare them for higher math.Agree. It will only cause a distraction to them. Kids in such grade normally just play around. They are probably more interested in you teaching them how to sing and dance My stupid heart than Bitcoin but they may have heard of it.They may learn basics but after it, they'd still be back to playing games on their phone and TikTok. 5 years soon all they know will just be the Fednow or that Unicoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GideonGono",
      "created_time": "May 14, 2023, 09:50:05 PM",
      "body": "It's great to start early but lets be honest we all know that at those age kids just want to have fun playing.We all know about saving up money at an early age but most of us didn't even bother to do it we buy what we want it's just the same for those kids,we could introduce it to them but only those who are interested would really get into it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "May 14, 2023, 09:58:10 PM",
      "body": "Quote from: Crypt jnr on May 14, 2023, 04:34:47 PMI had a math class with third graders of which we discussed money I told them about virtual and real money of which I was very shocked and happy that they had knowledge about Bitcoin.However we ended the class after we had spoken alot about Bitcoin they were soo happy and loved the class also Like wow being with the kids was a nice time for them and I to get to know Bitcoin better look forward to having a class with them next weekIt's a good idea to introduce virtual money like Bitcoin and compare it to fiat money. If they already know enough about Bitcoin, that's good news. they can now get information from anywhere easily. Social media is where they look for everything. I hope you can include photos of your teaching activities related to the topic you are discussing, so that it doesn't look like a fictional story. Because many stories like this are only hoping for merit and will eventually be ignored.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "May 14, 2023, 10:42:23 PM",
      "body": "Quote from: Crypt jnr on May 14, 2023, 04:34:47 PMI had a math class with third graders of which we discussed money I told them about virtual and real money of which I was very shocked and happy that they had knowledge about Bitcoin.However we ended the class after we had spoken alot about Bitcoin they were soo happy and loved the class also Like wow being with the kids was a nice time for them and I to get to know Bitcoin better look forward to having a class with them next weekIt's to devote out time to study bitcoin and understand exactly what bitcoin is all about, but the aspect you said you have known bitcoin because of the class you attended, I say that bitcoin is a technology that you can not know it all, I believe that knowing bitcoin technology have to come with a gradual process for my understanding concerning bitcoin, so I believe that bitcoin technology is something i believe that it have to take us time to acclimatised with the system, so you  have alot to learn in cryptocurrency technology and way of understanding, some of the potential users in the forum have not mastered it all in bitcoin because the technology will keep updating or transform to another form, so you have to learn bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "May 14, 2023, 11:12:09 PM",
      "body": "Quote from: Crypt jnr on May 14, 2023, 04:34:47 PMI had a math class with third graders of which we discussed money I told them about virtual and real money of which I was very shocked and happy that they had knowledge about Bitcoin.However we ended the class after we had spoken alot about Bitcoin they were soo happy and loved the class also Like wow being with the kids was a nice time for them and I to get to know Bitcoin better look forward to having a class with them next weekNowadays kids have internet access on their tab, iPad and also they use their parent's smartphones to watch youtube and tiktok. They might watch videos about bitcoin on their digital devices there is nothing to be shocked with that. Actually, if their parent are into bitcoin technology and talk and watch videos about bitcoin they will follow them and learn about the technology.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qwertyup23",
      "created_time": "May 14, 2023, 11:33:49 PM",
      "body": "Quote from: Crypt jnr on May 14, 2023, 04:34:47 PMI had a math class with third graders of which we discussed money I told them about virtual and real money of which I was very shocked and happy that they had knowledge about Bitcoin.However we ended the class after we had spoken alot about Bitcoin they were soo happy and loved the class also Like wow being with the kids was a nice time for them and I to get to know Bitcoin better look forward to having a class with them next weekA third-grader who knows about the existence of BTC? That is indeed surprising! But how did these kids view BTC? Did they mention anything positive or negative about it? How did they understand the concept behind the usage of BTC also?Personally, understanding the fundamentals of BTC can be challenging especially for children due to the complexity of the concepts. It is possible that these kids may heard about BTC but they do not entirely understand the concept behind it.I guess it is good that they know about BTC but I doubt that they fully comprehend about it. Though this may be the case, like what most have mentioned, teach 'em young!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "May 14, 2023, 11:59:47 PM",
      "body": "Quote from: Crypt jnr on May 14, 2023, 04:34:47 PMI had a math class with third graders of which we discussed money I told them about virtual and real money of which I was very shocked and happy that they had knowledge about Bitcoin.However we ended the class after we had spoken alot about Bitcoin they were soo happy and loved the class also Like wow being with the kids was a nice time for them and I to get to know Bitcoin better look forward to having a class with them next weekThat sounds like a wonderful experience and I like it.It's always great to see children engaging with financial concepts and learning about Bitcoin. It's particularly impressive that these third graders already had some knowledge about Bitcoin, which is still a relatively new and complex concept for many adults.  By teaching this, we can help them build important skills and knowledge that will serve them well throughout their lives, and who knows, might some of these third graders will grow up to be future Bitcoin experts or entrepreneurs.Not bad for an age of 8-9 will have an interest in Bitcoin, but IMO it's important to explain the concept in simple terms and emphasize the risks and potential benefits.  It's also important to make it clear that investing in Bitcoin is not a guaranteed way to make money, it might be good if just starting with basic concepts such as saving money, budgeting, and spending wisely.  As they get older and gain more understanding of this digital finance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "May 15, 2023, 12:11:22 AM",
      "body": "It is likely some of them are aware of Bitcoin because someone in their house or family is into Bitcoin, probably trading or holding. I personally believe that a third grader is not aware of how computers work enough to understand how actually Bitcoin works or it is about. If I wanted to introduce Bitcoin to a kid that young, I would need to do it in a very didactical way so they ended up having an idea on the differences between the conventional money and the decentralized money, aka Bitcoin.I am confident that future generations are going to be more likely to own Bitcoin and actively use it, specially in developing countries, where banking can be inefficient or corrupted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "May 15, 2023, 01:56:40 AM",
      "body": "Lol, I have niece and nephews at 8 years old talking about Elon Musk and Bitcoin as well, so I'm surprised by this. The transfer of knowledge is really very quick because of social medias right now.But for us who hasn't experience this obviously, if there are talking about money and investment, I think monopoly is the biggest influence to us. Even the author of rich dad poor dad, Robert Kiyosaki said that his rich dad thought him about money thru the concept of monopoly games. But as far as bitcoin goes, this are just kids, too young for them to really understand it, just the social influence from media that they heard but for sure their young minds are not into it at 8 years old.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "May 15, 2023, 02:23:18 AM",
      "body": "I don't think it's appropriate to teach children before the age of 10 about Bitcoin and things related to trading and the like, there are much more important things for children of this age.Also, I do not know what the legal position is towards teaching minor children things that may be prohibited in many countries and involve risks, such as Bitcoin and trading.Don't forget the parents' attitude towards this as well, I'm sure many parents of young students will not like this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}