{
  "id": "topic_5427126",
  "title": "Kufrux",
  "author": "Kufrux",
  "created_time": "December 08, 2022, 07:15:05 PM",
  "content": "Whether you're an inspiring trader just testing the waters in the crypto ocean or a veteran investor making a living out of digital assets, London-based cryptocurrency exchange Kufrux.com has got you covered.Trusted by over 5 million users around the world, we know firsthand that trust isn’t something given but needs to be earned, and still more so with respect to such transformative ideas as blockchain technology. That’s why we see our mission in giving our customers the best trading experience in the crypto space and beyond.And to do that, we offer you the opportunity to easily trade digital assets – no matter who you are and where you are.Equipped with our suite of trading products, you get access to over 100 cryptocurrencies which you can trade with your own funds or on margin, with a leverage of up to 100x. We offer an array of advanced order types, which allow you to get exactly what you want from the market – at what price and in what amount.For traders who are looking to bet on the future action of cryptocurrencies and thus potentially achieve more profit, as well as for investors who want to manage risk and fine-tune their exposure to digital assets, we provide access to derivatives markets for trading Bitcoin and Ethereum futures contracts.We offer traditional contracts with an expiry date, and perpetual contracts which have an unlimited shelf life.You can automate your trading process with our industry-leading API via both a RESTful API that uses HTTP requests to send and receive data, and Websocket API with which you can send messages to our servers and receive event-driven responses from the Kufrux platform.Now you can control your orders right from within your application.We know how important security of funds means – and here, at Kufrux , the safety of your funds is our top priority too. All funds of our customers are fully protected at all times against loss, theft, and misuse by BitGo’s insurance coverage.Chart your path toward financial success and independence with Kufrux.com !",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5427126",
  "comments": [
    {
      "author": "JeromeTash",
      "created_time": "December 08, 2022, 09:48:53 PMLast edit: May 14, 2023, 03:45:06 PM by JeromeTash",
      "body": "Quote from: Kufrux on December 08, 2022, 07:15:05 PMWhether you're an inspiring trader just testing the waters in the crypto ocean or a veteran investor making a living out of digital assets, London-based cryptocurrency exchange Kufrux.com has got you covered.Can you prove to as that your crypto exchange is based in London? I see no information linking it to London, or are you just making this up?In your terms and privacy policy. You say something else.1. MEK Global Limited is associated with Kucoin, are you trying to say you are associated with Kucoin?2. What is this? 3. And now all of a sudden, you are registered in the US  All pages archived: 1. https://web.archive.org/web/20220000000000*/https://kufrux.com/help/legal/User_Agreement2. https://web.archive.org/web/20221208055313/https://kufrux.com/help/legal/Privacy_Policy",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "December 09, 2022, 08:59:59 AM",
      "body": "Quote from: JeromeTash on December 08, 2022, 09:48:53 PMIn your terms and privacy policy. You say something else...These discrepancies are most likely caused by the fact that they copy/pasted their privacy policy from someone else and then forgot to change some stuff. If you do google search some of those parts that you screenshoted you will find that few other unknown exchanges like Hobabit and Coinethera have the very same privacy policy, word for word, with only the name obviously changed. Quote from: https://hobabit.com/privacy1.The purpose of this Privacy Policy is to inform you and provide you with an understanding of how Mek Global Limited (“Hobabit” or “we” or “us” or “our”) handles, collects, uses, discloses and deals with personal data about you (“User”) that you give us, that we receive through third parties or that is in our possession. Further, this Privacy Policy governs the manner in which Hobabit collects, uses, maintains and/or discloses personal data collected from Users of the Hobabit website (“Site”). To provide you with our Services, we might need (and sometimes obliged by the law) to collect your personal data. 2.We take our responsibilities under the Constitution of United States of Amerie seriously. We also recognize the importance of the personal data you have entrusted to us and believe that it is our responsibility to properly manage, protect and process your personal data.Quote from: https://coinethera.com/privacyThe purpose of this Privacy Policy is to inform you and provide you with an understanding of how Mek Global Limited (“coinethera.com” or “we” or “us” or “our”) handles, collects, uses, discloses and deals with personal data about you (“User”) that you give us, that we receive through third parties or that is in our possession. Further, this Privacy Policy governs the manner in which coinethera.com collects, uses, maintains and/or discloses personal data collected from Users of the coinethera.com website (“Site”). To provide you with our Services, we might need (and sometimes obliged by the law) to collect your personal data. 2.We take our responsibilities under the Constitution of United States of Amerie seriously. We also recognize the importance of the personal data you have entrusted to us and believe that it is our responsibility to properly manage, protect and process your personal data.It says a lot about the exchange when they can't write even that by themselves, or at least proofread it before copy/pasting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "December 09, 2022, 10:14:58 AM",
      "body": "Quote from: Kufrux on December 08, 2022, 07:15:05 PM-snip-Trusted by over 5 million users around the world,Claims to have 5 million users, reached in 5 days? The team must have lied worked really hard to get these fake customers so fast.Definitely all your users are experienced traders have trusted your platform that short.Quote from: https://whois.domaintools.com/kufrux.com5 days oldCreated on 2022-12-04Expires on 2023-12-04Updated on 0001-01-01",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "December 09, 2022, 10:32:56 AMLast edit: May 20, 2023, 07:20:11 PM by stompix",
      "body": "Besides the whole fake registration, fake claims, copy-paste terms and policies, one big F**You!!! for the price scam you're pulling, I forgot these are still around, and since I didn't bother to check the prices today before your site made me skip a beat when I saw themCompletely forgot about those traps with inflated prices that make newbies eager to take the opportunity of making a quick 10%.Quote from: JeromeTash on December 08, 2022, 09:48:53 PM1. MEK Global Limited is associated with Kucoin, are you trying to say you are associated with Kucoin?Isn't that obvious, it's KUfrux, after trying to get such a domain name what's a bit of copy-paste. Besides, these scammers know that the only ones looking at ToS and other pages are the ones who will not deposit a penny, we're not their customer target base.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "December 09, 2022, 09:56:49 PM",
      "body": "Quote from: stompix on December 09, 2022, 10:32:56 AMBesides, the whole fake registration, make claims, copy-paste terms and policies, one big F**You!!! for the price scam you're pulling, I forgot these are still around, and since I didn't bother to check the prices today before your site made me skip a beat when I saw themDamn, totally missed that part as I don't check the crypto prices often. What's interesting though is that all prices are increased at the very similar percentage, from 10-11%. How convenient. Since this is the obvious trap and considering all other red flags, gonna leave them negative feedback so at least users of this forum avoid dealing any business with them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}