{
  "id": "topic_5475922",
  "title": "johnsaributua",
  "author": "johnsaributua",
  "created_time": "November 29, 2023, 12:16:54 PMLast edit: November 29, 2023, 12:50:00 PM by johnsaributua",
  "content": "Have you ever thought about a condition? The board as mediation.1. There are true beginners so writing in any thread is very simple.2. The discussion is mostly questions and confused conditions.3. Choosing local boards and topics according to what he likes as a       beginner and tends to be about altcoins, or of a general nature.4. Not knowing the mega treads that often share merit with ongoing discussions.5. The flow of writing is different.In contrast to some people with glasses who are newbies with advanced as the opposite, miraculous! I admire these people, very effective use of time. I don't think there is any intimidation, discrimination or ethnicity in what I think.My assumption is that there are still quite a few who do not want to ask questions will hesitate to start opening threads, choosing to listen. The enthusiasm of the old users who are very good at making replies is exemplary. But they may be hesitant to ask for your transmission to rank up, especially if it's through private messages. Yes, I'm talking about speed in ranking even though the thoughts are almost the same. no offense If you want to share your tips with the achievers, I think it will help feel free to let me know if this thread is worth it or not.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475922",
  "comments": [
    {
      "author": "cryptoaddictchie",
      "created_time": "November 29, 2023, 12:57:27 PM",
      "body": "Quote from: johnsaributua on November 29, 2023, 12:16:54 PMMy assumption is that there are still quite a few who do not want to ask questions will hesitate to start opening threads, choosing to listen. The enthusiasm of the old users who are very good at making replies is exemplary. But they may be hesitant to ask for your transmission to rank up, especially if it's through private messages. Yes, I'm talking about speed in ranking even though the thoughts are almost the same. no offense Well different people different perspective I think. You are right, some prefer to be a listener and read a lot of questions and answers here. But thats smart also as they learned what they needed just by being an spectator. Only those who keep posting are the one active since they wanted to gain merits. Some are here for pure knowledge and answered thoughts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "November 29, 2023, 02:04:24 PM",
      "body": "People come to this forum for different purposes, most people come to learn about a particular thing, why some comes to interact, share their knowledge with others and learn more. Being a newbie in this forum does not make someone a newbie in knowledge. There are areas where they are expected, and with the knowledge they have, just coming in here with such knowledge, they are going to explore. The fact is, just be original and know what you are doing.  There are people who visit this forum time without number to learn something, but they never for a day drop a post or comment on anywhere. Even if they drop a post, it's not always that constant, but they are always actively coming online, and guess such people make use of the search button a lot or they just have a particular board of interest where they visit or the time to get their desire information.  Sometimes, the problem most people do have as a Newbie is not being focused: They actually don't know what they want, if they are here to learn, or if they are here to make post and look for means to rank up, which then leads to the earning part, and when they are chasing almost everything all at once, they lose focus, which can either get them in trouble or get them stock just in one place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "November 29, 2023, 02:12:55 PM",
      "body": "Quote from: johnsaributua on November 29, 2023, 12:16:54 PMSnippedJust get used to this maybe, we have two categories of beginners, the fast learners and slow learners, know this also that not everyone of them are newbies, some might be experienced in one way or the other, what is expected of them is to make sure they acted as accordingly to how they were being expected to behave while on the forum, when they moderately acts, posts and relate with the community, they will have the best desired fun by coming here or being a member, all that is expected of every beginners is for them to know what they are doing, obey the rules and make a quality post, learn when it is required and give information as you have it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samlucky O",
      "created_time": "November 29, 2023, 03:03:58 PM",
      "body": "In every where you find yourself in life, there are people whom are good learner and also the noisy type. A good learner is a good listener and often ask questions to know more. It might look as if such person is joking but really not. Sooner or later you will discover that it's not really what you think about the person. These people Excel than the noisy type.The noisy type always think they know much and often don't want to be corrected. Dey always rub shoulders with people who are far beyond them. Sometimes dey learn but still act as if what you said is wrong but they correct themselves later but not in your presence. Most people who usually open thread, does that not to learn but want to grow an alt acc, these set of people are people with higher rank but created an alt account and they mostly ague because they know what they are saying but people always underestimate them base on there newbie identity. These set of people are always found everywhere in the forum, among legendary members who are far far bigger in experience. and always making comments there. You will see new account of 1 week I quoting everyone with lengthy post. No matter what, we can not cheat nature. Because who you are speaks for itself. It's only someone who is not observant will not know an alt account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "November 29, 2023, 03:48:36 PM",
      "body": "Quote from: johnsaributua on November 29, 2023, 12:16:54 PMMy assumption is that there are still quite a few who do not want to ask questions will hesitate to start opening threads, choosing to listen. The enthusiasm of the old users who are very good at making replies is exemplary. But they may be hesitant to ask for your transmission to rank up, especially if it's through private messages. Yes, I'm talking about speed in ranking even though the thoughts are almost the same. no offense If you want to share your tips with the achievers, I think it will help feel free to let me know if this thread is worth it or not.Newbies should read and observe more than coming up with posts or starting threads. They need time to learn about Bitcoin and the operations of the forum. I know that there is this anxiousness to write something immediately after you join a forum. But this is not necessary because we are encouraged to put up posts that contribute to the forum positively and not just a thread to announce our presence. The truth is that most of the questions that newbies ask have already been answered several times in the forum. Most of them are not aware of the search option or have refused to use it. You need two things to rank up which are activity and merit. You will gain activity as you stay in the forum and keep making posts. Merits will come when your posts are productive. When your post contributes positively to the forum such as answering questions, asing relevant question, sharing relevant information, solving problems, bringing innovative ideas, etc. You don't need to send personal message to anybody to rank up, except for top members that asked for it for post reviews. Don't also be in a haste to rank up, just be patient because it will come naturally if you keep learning. Many nwbies that wanted to ran up as fast as possible ended up in trouble because of plagiarism or use chatbots.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "November 29, 2023, 03:53:11 PM",
      "body": "Think about what is better: listen, read, understand what the meaning is, and then ask a question that seems smart and interesting. And another thing: on the first day, noisily burst into the forum screaming? \"Hello. Here I am. What is Betcoin?\"?\"    What will users think about this behavior? Where can one rush to increase rank if a person does not have enough knowledge? Is it possible to place an impostor at the operating table who “teaches” everyone how to treat without having any experience behind him?It is a pity that those beginners who are in a hurry do not understand these truths. They look very stupid and pretentious, while people who come to the forum and sincerely and carefully research topics on their own and then surprise everyone with the created topics collect dozens of merits at a time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "johnsaributua",
      "created_time": "November 29, 2023, 04:48:34 PM",
      "body": "All your replies have impressed me, there are two additional types between noisy and fast readers and the main focus is on activity and merit, that is undeniable and indeed the main requirement for further rank.Quote from: lovesmayfamilis on November 29, 2023, 03:53:11 PMThink about what is better: listen, read, understand what the meaning is, and then ask a question that seems smart and interesting. And another thing: on the first day, noisily burst into the forum screaming? \"Hello. Here I am. What is Betcoin?\"?\"    What will users think about this behavior? Where can one rush to increase rank if a person does not have enough knowledge? Is it possible to place an impostor at the operating table who “teaches” everyone how to treat without having any experience behind him?It is a pity that those beginners who are in a hurry do not understand these truths. They look very stupid and pretentious, while people who come to the forum and sincerely and carefully research topics on their own and then surprise everyone with the created topics collect dozens of merits at a time.Your statement represents what I think further, I like your words at the end of that last paragraph. Very brilliant, maybe I don't believe that it's a beginner, do others even pity that much? I recognize that their posts are quality and the praise is deserved. But if their experience is anything to go by. It has its own quirks. And I like the structure of their discussions. I just admire them and wonder.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "November 29, 2023, 04:51:49 PM",
      "body": "Haha, what a weird title \"Beginner vs fast Starter\". So OP TBH whatever I'm gonna write in this post is going to be my personal experience with the Forum. So as you are saying most newbies ask questions, and post quarries as usual locally or in their posts on other boards, they are newbies without mentor this is what I think and those who starts making big threads somehow gets a little information from the scenarios to get an effective response.Here with this type of user, there are some of them post plagiarised content in the greed of getting more attention and merits, let me one thing very clear here post quality and rank up have nothing to do with your overall journey, I've seen many newbies and nonproductive members getting rank up much faster because they are somehow getting more attention of the mods, or the merit sources in the local. It really matters how strong your board is as in Russia I've seen a lot of users ranking much faster compared to any other board because there is more merit source, for example if you consider in my locality we have only shahzadafzal as a merit source and those who only post int he local in my country's thread, they are ranking as slow as 1 or 2 merits from the merit source per month haha, so you can imagine how hard is for them to rank up.So the moral of the story is, don't look at others keep making good posts, and stay consistent you'll definitely get ranked, just make sure to engage people in your discussion the way to have more attention.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mvdheuvel1983",
      "created_time": "November 29, 2023, 06:29:52 PM",
      "body": "Quote from: cryptoaddictchie on November 29, 2023, 12:57:27 PMWell different people different perspective I think. You are right, some prefer to be a listener and read a lot of questions and answers here. But thats smart also as they learned what they needed just by being an spectator. Only those who keep posting are the one active since they wanted to gain merits. Some are here for pure knowledge and answered thoughts. I believe that newbies who show a willingness to listen and extensively read through the posted questions and answers are typically not novices when it comes to online forums. They already have an understanding of how these platforms operate and often demonstrate an intermediate level of understanding regarding bitcoin and the broader cryptocurrency ecosystem. Usually, their first goal I think is to spend a significant portion of their time studying the forum.On the other hand, there is another group who I feel have entry-level knowledge of bitcoin because they are eager to ask any questions or uncertainties on their minds. This eagerness sometimes leads them to unintentionally repeat questions already addressed on the forum. Interestingly as they spend more time on the forum, we find that their frequency of confusion-related questions begins to decrease. Eventually they grow to the point where they can answer queries posed by other beginners.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "November 29, 2023, 07:55:02 PM",
      "body": "Each of us have different reasons why we come here in the forum. For me, I came here as a true beginner before I learned what I have learn till this day while some aren't new to crypto but new to the forum therefore it won't be hard for them to write or post something here in the forum. My journey here in thr forum isn't easy to be honest but still I managed to do it. That's why there are some newbies who aren't really newbies at all. You can say that they only have newbie account in the forum but isn't newbie when it comes to crypto knowledge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "November 29, 2023, 07:56:07 PM",
      "body": "Quote from: johnsaributua on November 29, 2023, 12:16:54 PM...My assumption is that there are still quite a few who do not want to ask questions will hesitate to start opening threads, choosing to listen. The enthusiasm of the old users who are very good at making replies is exemplary. But they may be hesitant to ask for your transmission to rank up, especially if it's through private messages. Yes, I'm talking about speed in ranking even though the thoughts are almost the same. no offense If you want to share your tips with the achievers, I think it will help feel free to let me know if this thread is worth it or not.In my opinion, this topic is quite worthy of the beginner and help section because there are still many newbies out there who don't know what they are doing with their posts. In fact, it's not that difficult to reply to posts we like on this forum, it's just that there are a few rules that must be followed. applied in every post to make it seem decent, such as using quite a lot of sentences not under 100 words because usually writing under 100 words looks like spam (unless your account are a big account that has a good reputation like some of the members in the WO thread). beginners really have to adapt to the habits of this forum and first understand the implicit rules in this forum, don't set your mind on building your account in a short time because it's impossible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "November 29, 2023, 08:03:20 PM",
      "body": "Quote from: cryptoaddictchie on November 29, 2023, 12:57:27 PMQuote from: johnsaributua on November 29, 2023, 12:16:54 PMMy assumption is that there are still quite a few who do not want to ask questions will hesitate to start opening threads, choosing to listen. The enthusiasm of the old users who are very good at making replies is exemplary. But they may be hesitant to ask for your transmission to rank up, especially if it's through private messages. Yes, I'm talking about speed in ranking even though the thoughts are almost the same. no offense Well different people different perspective I think. You are right, some prefer to be a listener and read a lot of questions and answers here. But thats smart also as they learned what they needed just by being an spectator. Only those who keep posting are the one active since they wanted to gain merits. Some are here for pure knowledge and answered thoughts. I am a student and I have taking part time jobs to teach the best way to learn is effective communication, learning always go both ways you can't properly learn by just being a spectator and reading, the person who asked the question may have a different comprehension than you so it's best to understand at your own pace, asking questions is one good way to understand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "November 29, 2023, 09:15:05 PM",
      "body": "Everyone of us here started as a beginner, so yeah, we don't open that much thread and just prefer to read topics over topics to sharpen our knowledge. And with that, once we gain some understand, then that is the time we open threads and asks questions or share some that it very interesting.I don't think there is such thing as fast learner, everyone started here at 0 knowledge. Maybe they just have a lot of time compare to others to browse the community and play around and gain that knowledge.My tip as well is to bookmark those threads that you read and then comeback to really understand it.In this way, you won't forget about certain topics that you want to discuss or what subject interest you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odusko",
      "created_time": "November 29, 2023, 09:38:07 PM",
      "body": "Let's take the forum ranking and activities quotas for example since we have a system in Ace that allows you to move through the forum ranking systems, and if anyone is smart enough to research on previous behaviours of the entire forum system before 2018 when the merit systems were introduced, so if we want to talk about members ranking, as important to as merits are, we tend to look away from that angle and focus more on the quality activities of the members because sometimes, when it comes to quality of posts, I don't take forum rank or a number of merits as most important at most point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "November 29, 2023, 10:55:55 PM",
      "body": "There are beginners that don't need to open threads because they are resourceful and good at researching the topics that they need to know. That's the reason why they like to learn more on their own and not to keep opening threads if there are topics already that are made for them.Quote from: Jating on November 29, 2023, 09:15:05 PMMy tip as well is to bookmark those threads that you read and then comeback to really understand it.I agree on this tip, I've done this on the past especially on the topics that I really liked and have full of resources and knowledge to share with. So, if there are newbies there or even not, if there are helpful topics to you, try doing this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "November 29, 2023, 11:22:48 PM",
      "body": "Quote from: Jating on November 29, 2023, 09:15:05 PMEveryone of us here started as a beginner, so yeah, we don't open that much thread and just prefer to read topics over topics to sharpen our knowledge. And with that, once we gain some understand, then that is the time we open threads and asks questions or share some that it very interesting.I think we don't just need to read topics over topics, we also need to verify the validity of information written on that topic.  This way misunderstanding and misconception can be avoided and if thee is any, it can be fixed at an early stage before it is inculcated in our brains.QuoteI don't think there is such thing as fast learner, everyone started here at 0 knowledge. Maybe they just have a lot of time compare to others to browse the community and play around and gain that knowledge.There are people who are fast learner.  These people have a high level of comprehension and can easily understand what they are reading.  While, there are also people who have low comprehension ability and can't easily understand what they are reading even if they tried to analyze it several times.QuoteMy tip as well is to bookmark those threads that you read and then comeback to really understand it.I highly agree, it is good to bookmark important topic for references even if we fully understand them, there are times when we forget about some details and bookmarking the source of the information is a good way of keeping our sources of information in hand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "johnsaributua",
      "created_time": "December 01, 2023, 02:23:08 PM",
      "body": "Indeed, the responsiveness of a person is different, this also includes effective time, energy and thought, the factors supporting these two conditions between motivation and suggestion play an important role, many want to always be active on bitcointalk because they have a lot of time with their laptops, some are used to it because it becomes a fun routine. Because merit is an additional goal for those above newbie. I agree with all of you, that the giver and receiver of information will be more detailed if the development of the topic gives each other a chance, from what is discussed. There are various reasons to stay longer in bitcointalk forum even the merit system is not an obstacle for everyone to prove the quality of writing and thinking, Make the forum cleaner than the old days of hit and run bounties. both sides of a necessity and a fair idea.I really enjoy your responses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AakZaki",
      "created_time": "December 01, 2023, 09:28:21 PM",
      "body": "Many types of beginners continue to appear on the forums. On average, they only appear when there is hype and start to fade when they don't get merit from the posts they make. even though it depends on how intellectual they are and how they can learn crypto and its technology in this forum. Smart beginners will continue to improve and will eventually climb the ranks easily. but for beginners who can't develop well it will just be an abandoned account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tech30338",
      "created_time": "December 02, 2023, 01:23:58 AM",
      "body": "as a beginner, I always read post and topics that I don't have clue what it is and search it in google, the reason for that is that once someone ask question I can reply and share little knowledge that I know about it to help them in the way that I know it, also I like being corrected in the forum because I know that I can learn something about it, instead of hating their comment and take it personal turn it into motivations, I see people who became hurt when they are corrected by those who already spend year in the forum and high reputation, but you should be thankful that they spend time to correct your mistakes.i consider those fast starters are those who post lots of things sometimes even off-topic, and airdrop posting daily to pad up their activities just my thought about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}