{
  "id": "topic_5446185",
  "title": "HedgeFx",
  "author": "HedgeFx",
  "created_time": "March 24, 2023, 03:35:40 PM",
  "content": "Buonasera a tutti,Come se non bastasse la figura di merda colossale fatta qualche settimana , quando lasciarano senza posta servizi di posta elettronica milioni di utenti per oltre una settimana, sapete cosa hanno fatto di bello questi geniacci di IOL/LIBERO? Hanno pensato bene di bannare /bloccare tutte le email provenienti dall'ecosistema crypto! In poche parole:- Non posso ricevere più email da Kraken- Non posso ricevere più email da Coinbase- Non posso ricevere più email da Okex- Non posso ricevere più email da FreebitcoinSia con kraken che con coinbase mi trovo impantanato, non potendo accedere su PC (in quanto mi invia mail di conferma, che ovviamente non arriva). Sto iniziando a valutare un'azione legale, perchè questa situazione mi sta scocciando e non poco, e non sono disposto a pagare per le loro inefficienze!PS: alla luce di questi ban/blocchi, penso che IOL/LIBERO non ci abbia detto tutta la verità su quanto accaduto, e la puzza che siano stati bucati congrave perdita di dati si fa sempre più intensa.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446185",
  "comments": [
    {
      "author": "Ale88",
      "created_time": "March 24, 2023, 03:53:38 PM",
      "body": "Quote from: HedgeFx on March 24, 2023, 03:35:40 PM Hanno pensato bene di bannare /bloccare tutte le email provenienti dall'ecosistema crypto!Ma l'hanno fatto di punto in bianco oppure hanno avvisato prima?Rimane comunque una cosa ridicola, già sono un servizio email da terzo mondo, ci mancava solo questa. Le motivazioni dietro questa stronz... ehm, scelta, quali sarebbero?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HedgeFx",
      "created_time": "March 24, 2023, 03:56:00 PM",
      "body": "Quote from: Ale88 on March 24, 2023, 03:53:38 PMMa l'hanno fatto di punto in bianco oppure hanno avvisato prima?Rimane comunque una cosa ridicola, già sono un servizio email da terzo mondo, ci mancava solo questa. Le motivazioni dietro questa stronz... ehm, scelta, quali sarebbero?Di punto in bianco! La mia fortuna è che sia su Kraken che su Coinbase ho tutto impostato (li uso pr qualche cashout) e quindi il disagio l'ho sentito poco.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ale88",
      "created_time": "March 24, 2023, 04:08:37 PM",
      "body": "Quote from: HedgeFx on March 24, 2023, 03:56:00 PMDi punto in bianco!Non so quanta gente utilizzi Libero per i conti crypto (a parte te ) però qualche causa legale mi sa che se la ritroveranno tra le mani perché non c'è nessuna legge che vieta le crypto e/o gli exchange, soprattutto se non danno nemmeno il tempo di prepararsi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "usque_ad_finem",
      "created_time": "March 24, 2023, 04:21:31 PM",
      "body": "A mio parere queste realtà \"locali\" anche se utilizzatissime devono essere abbandonate, anche se questo comportasse un notevole sforzo per passare a una nuova email. Il rischio è che un domani tocchi comunque farlo in fretta e furia, senza poter pianificare la cosa, che sarebbe tremendo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jack0m",
      "created_time": "March 24, 2023, 05:12:59 PM",
      "body": "Va bè dai, ci metti 2 minuti a farti un account con Gmail e sticazzi Libero... sì, libero di andarsene aff...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ale88",
      "created_time": "March 24, 2023, 05:15:28 PM",
      "body": "Quote from: jack0m on March 24, 2023, 05:12:59 PMVa bè dai, ci metti 2 minuti a farti un account con Gmail e sticazzi Libero... sì, libero di andarsene aff...Il problema è che bisogna vedere quali sono le richieste dell'exchange per cambiare l'email registrata: se ti mandano un codice o un link e l'email viene bloccata da Libero allora l'utente deve risolvere il problema con l'assistenza dell'exchange per tutte le verifiche del caso, non so quanto possa essere veloce questa operazione.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HedgeFx",
      "created_time": "March 24, 2023, 05:22:50 PM",
      "body": "Quote from: Ale88 on March 24, 2023, 05:15:28 PMIl problema è che bisogna vedere quali sono le richieste dell'exchange per cambiare l'email registrata: se ti mandano un codice o un link e l'email viene bloccata da Libero allora l'utente deve risolvere il problema con l'assistenza dell'exchange per tutte le verifiche del caso, non so quanto possa essere veloce questa operazione.Hai centrato in pieno il problema: e vi assicuro che non è affatto facile (ne scontato) uscirne fuori.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "duesoldi",
      "created_time": "March 24, 2023, 07:44:54 PM",
      "body": "Quote from: HedgeFx on March 24, 2023, 03:35:40 PM.....- Non posso ricevere più email da Kraken- Non posso ricevere più email da Coinbase- Non posso ricevere più email da Okex- Non posso ricevere più email da Freebitcoin.....Sicuro che abbiano messo questo tipo di blocco? io ho ricevuto una mail da Binance proprio due giorni fa.Mi sembra strano che abbiano bloccato i cex che hai elencato e non Binance.Ne ho ricevute anche da TRT per notificare il blocco del sito ma... va beh TRT non fa testo, è talmente piccola che probabilmente non l'hanno messa in blacklist.Qualcun altro che possa riportare altre esperienze?Quote from: HedgeFx on March 24, 2023, 03:35:40 PMPS: alla luce di questi ban/blocchi, penso che IOL/LIBERO non ci abbia detto tutta la verità su quanto accaduto, e la puzza che siano stati bucati congrave perdita di dati si fa sempre più intensa.Mmmm, non ho però capito il collegamento tra il blocco mail da cex e la perdita di dati. Perché pensi a questo ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "March 25, 2023, 02:53:17 PM",
      "body": "Quote from: jack0m on March 24, 2023, 05:12:59 PMVa bè dai, ci metti 2 minuti a farti un account con Gmail e sticazzi Libero... sì, libero di andarsene aff...Gmail? Perchè affidarsi a servizi cosi centralizzati che ti analizzano anche il b..o del cul. (scusate il francesismo). Uno dei migliori servizi di posta elettronica penso sia ProtonMail non mi sono mai trovato bene quanto con loro, ma anche tutanota non è male. Altrimenti se siete ancora più freedom potete aprirvi una mail su esiliatio.org oppure su disroot.org . Lasciate stare libero, yahoo, gmail e altre cagate simili.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jack0m",
      "created_time": "March 25, 2023, 04:44:28 PM",
      "body": "Quote from: mendace on March 25, 2023, 02:53:17 PMQuote from: jack0m on March 24, 2023, 05:12:59 PMVa bè dai, ci metti 2 minuti a farti un account con Gmail e sticazzi Libero... sì, libero di andarsene aff...Gmail? Perchè affidarsi a servizi cosi centralizzati che ti analizzano anche il b..o del cul. (scusate il francesismo). Uno dei migliori servizi di posta elettronica penso sia ProtonMail non mi sono mai trovato bene quanto con loro, ma anche tutanota non è male. Altrimenti se siete ancora più freedom potete aprirvi una mail su esiliatio.org oppure su disroot.org . Lasciate stare libero, yahoo, gmail e altre cagate simili.Io ho account sia ProtonMail che Tutanota, che uso soprattutto per servizi in cui è particolarmente critica la riservatezza (fra cui anche Kraken). Sono comunque servizi centralizzati anche quelli, per cui la garanzia al 100% che i tuoi dati siano ben protetti non la puoi avere.Diciamo che da qualcuno che storicamente si affida a Libero non mi aspetto una così grande sensibilità in tema di privacy. Se non altro, dal punto di vista dell'affidabilità rispetto a Gmail non c'è confronto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "carcassone",
      "created_time": "March 26, 2023, 10:48:35 AM",
      "body": "Quote from: mendace on March 25, 2023, 02:53:17 PMesiliatio.orgNon funziona, puoi darmi url corretto?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HedgeFx",
      "created_time": "March 26, 2023, 11:15:28 AM",
      "body": "Quote from: mendace on March 25, 2023, 02:53:17 PMQuote from: jack0m on March 24, 2023, 05:12:59 PMVa bè dai, ci metti 2 minuti a farti un account con Gmail e sticazzi Libero... sì, libero di andarsene aff...Gmail? Perchè affidarsi a servizi cosi centralizzati che ti analizzano anche il b..o del cul. (scusate il francesismo). Uno dei migliori servizi di posta elettronica penso sia ProtonMail non mi sono mai trovato bene quanto con loro, ma anche tutanota non è male. Altrimenti se siete ancora più freedom potete aprirvi una mail su esiliatio.org oppure su disroot.org . Lasciate stare libero, yahoo, gmail e altre cagate simili.Concordo, Tutanota e Protonmail a vita! Aggiungo che avast VPN su iPhone e ciao ciao",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "March 26, 2023, 11:52:02 AM",
      "body": "Quote from: carcassone on March 26, 2023, 10:48:35 AMQuote from: mendace on March 25, 2023, 02:53:17 PMesiliatio.orgNon funziona, puoi darmi url corretto?Si scusami ho inserito una o per sbaglio.https://www.esiliati.org/Questo è corretto.Quote from: HedgeFx on March 26, 2023, 11:15:28 AMConcordo, Tutanota e Protonmail a vita! Aggiungo che avast VPN su iPhone e ciao ciao  Mmh...per la VPN consiglio o sempre proton che ti offre anche un piccolo account free ma con pochi server a scelta. (Il piano a pagamento è una bomba).Oppure Mullvad è un'ottima scelta, entrambi hanno piani di pagamento in btc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HedgeFx",
      "created_time": "March 27, 2023, 08:38:13 AM",
      "body": "Quote from: mendace on March 26, 2023, 11:52:02 AMMmh...per la VPN consiglio o sempre proton che ti offre anche un piccolo account free ma con pochi server a scelta. (Il piano a pagamento è una bomba).Oppure Mullvad è un'ottima scelta, entrambi hanno piani di pagamento in btc.Ho avast in scadenza domani, quanid fra proton e Mullvad cosa consigli?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "March 27, 2023, 08:41:40 AM",
      "body": "Quote from: HedgeFx on March 27, 2023, 08:38:13 AMQuote from: mendace on March 26, 2023, 11:52:02 AMMmh...per la VPN consiglio o sempre proton che ti offre anche un piccolo account free ma con pochi server a scelta. (Il piano a pagamento è una bomba).Oppure Mullvad è un'ottima scelta, entrambi hanno piani di pagamento in btc.Ho avast in scadenza domani, quanid fra proton e Mullvad cosa consigli?Sono ottime entrambe, io uso Proton premium e non mi sono mai trovato meglio con altre. Te la consiglio a mani basse e considera che con Proton se fai abbonamento hai casella mail, drive a 100gb, VPN e una chicca con simple login ti crei alias infiniti per registrarti ai siti senza dare la tua mail, cosa importantissima (vedi il leak di ledger ad esempio).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HedgeFx",
      "created_time": "March 27, 2023, 09:32:04 AM",
      "body": "Quote from: mendace on March 27, 2023, 08:41:40 AMSono ottime entrambe, io uso Proton premium e non mi sono mai trovato meglio con altre. Te la consiglio a mani basse e considera che con Proton se fai abbonamento hai casella mail, drive a 100gb, VPN e una chicca con simple login ti crei alias infiniti per registrarti ai siti senza dare la tua mail, cosa importantissima (vedi il leak di ledger ad esempio).Fatto l'unlimited , per ora per un mese. Poi se mi trovo bene vado annuale. Al momento la VPN sembra fluida e decisamente migliore di quella di AVAST (la uso IPHONE). Ora, permettimi una domanda banale ma non essendo esperto mi rifaccio alla tua clemenza: se voglio usare la VPN dal PC casa come caspita devo fare?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "March 27, 2023, 09:45:03 AM",
      "body": "Quote from: HedgeFx on March 27, 2023, 09:32:04 AMQuote from: mendace on March 27, 2023, 08:41:40 AMSono ottime entrambe, io uso Proton premium e non mi sono mai trovato meglio con altre. Te la consiglio a mani basse e considera che con Proton se fai abbonamento hai casella mail, drive a 100gb, VPN e una chicca con simple login ti crei alias infiniti per registrarti ai siti senza dare la tua mail, cosa importantissima (vedi il leak di ledger ad esempio).Fatto l'unlimited , per ora per un mese. Poi se mi trovo bene vado annuale. Al momento la VPN sembra fluida e decisamente migliore di quella di AVAST (la uso IPHONE). Ora, permettimi una domanda banale ma non essendo esperto mi rifaccio alla tua clemenza: se voglio usare la VPN dal PC casa come caspita devo fare? Semplice vai su https://protonvpn.com/download-windows e ti scarichi il client loggandoti con le tue credenziali (ho scelto windows come OS ma ci sono praticamente tutti, solo se tu avessi derivate tipo arch allora va cercato nei Repository). Consiglio di attivare 2fa sull'account mentre per la VPN puoi utilizzare sia il client sia scaricare un certificato e utilizzare ad esempio su openvpn. Ti consiglio nei settaggi di utilizzare protocollo wireguard oppure sthealt (protocollo sviluppato da proton).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HedgeFx",
      "created_time": "March 27, 2023, 01:14:33 PM",
      "body": "Ed ecco che da Kraken mi confermano che forse i miei dubbi potrano presto diventare certezza... Hello XXXX, Thanks for contacting Kraken. Issues with delivery to your email address are now resolved. Please try again at your earliest convenience.We have found that your email address has been detected by our system to appear on a recently leaked database - external and unrelated to Kraken. As sensitive information (including passwords) may be associated with it, we strongly advise you to:     Reset your email account password and secure your email address.    Reset your Kraken account password using these guidelines. These passwords should be unique, randomly generated and longer than 12 characters. Do not share passwords between services (e.g. same password used for both your Kraken account and your email account). Use a password manager such as KeePassXC to generate random passwords and to keep your passwords safe from theft or forgetfulness.Please let us know if you experience similar issues or have any questions.Regards,KenjiKraken Support",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ale88",
      "created_time": "March 27, 2023, 05:09:42 PM",
      "body": "Quote from: HedgeFx on March 27, 2023, 01:14:33 PMWe have found that your email address has been detected by our system to appear on a recently leaked database - external and unrelated to Kraken.Hai provato a controllare su haveibeenpwned.com se ci sono maggiori informazioni per caso?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}