{
  "id": "topic_5418799",
  "title": "udayantha11",
  "author": "udayantha11",
  "created_time": "October 30, 2022, 06:29:19 AM",
  "content": "As far as i know, Solana is the current highest TPS. BTC and ETH are comparatively low TPS at the moment. So lets dicuss , why TPS more important than previous years? as far as i know , TPS is more important if Crypto adoption massivly happended, TX need to more speed.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418799",
  "comments": [
    {
      "author": "TastyChillySauce00",
      "created_time": "October 31, 2022, 12:29:11 PM",
      "body": "Quote from: udayantha11 on October 30, 2022, 06:29:19 AMSo lets dicuss , why TPS more important than previous years? as far as i know , TPS is more important if Crypto adoption massivly happended, TX need to more speed.Let's say that if you wanna try to swap but there are so many transactions in queue caused by the blockchain has a few TPS. This gives limitation to the blockchina to process the transaction in second. TPS will make everything become cheap. You can compare ethereum with another layer 1 blockchain the market. Mostly of layer 1 blockchain will make you pay a few cents to did a swap in the blockchain but when you are using low scalability blockchain like ethereum. It will need you to pay a few dollay just to swap a coin. You must remember if when the traffic was increasing and then it will be making the fees become even higher than before caused by people must pay more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "October 31, 2022, 01:39:05 PM",
      "body": "Quote from: udayantha11 on October 30, 2022, 06:29:19 AMwhy TPS more important than previous years?On what reason does TPS are gaining its importance? Is there any data that supports cryptocurrencies transaction are raising compared to the previous year?Quote from: udayantha11 on October 30, 2022, 06:29:19 AMas far as i know , TPS is more important if Crypto adoption massivly happended, TX need to more speed.The thing about expanding scalability, in which, it will help TPS is the reason it is hard to solve that problem without sacrificing the security of the network. It classic blockchain trilemma, decentralization, scalability, and security. It is indeed that in order for cryptocurrencies to thrive further, developing the ecosystem with convenience in mind is essential. Nevertheless, maintaining the decentralization and also security of a network is require thorough thinking and well-thought development. So it won't happen overnight.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "October 31, 2022, 08:05:06 PM",
      "body": "Quote from: udayantha11 on October 30, 2022, 06:29:19 AMSo lets dicuss , why TPS more important than previous years? as far as i know , TPS is more important if Crypto adoption massivly happended, TX need to more speed.I can't agree with the fact that for crypto adopting it is more important such indicator as TPS. To prove this, I will give bitcoin as an example. No one will argue that bitcoin has the strongest mass adopsion among all cryptocurrencies, but at the same time bitcoin has an extremely weak TPS. In addition to TPS, a cryptocurrency must have good tokenomics, a robust protocol, interest among investors and the community, strong demand for blockchain, and a deflationary model to strive for mass adopting. No one is interested in an inflationary altcoin with pos and exposure to censorship, even if it has a TPS of 100,000 transactions per second.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}