{
  "id": "topic_5476314",
  "title": "yonton",
  "author": "yonton",
  "created_time": "December 02, 2023, 04:52:04 PM",
  "content": "",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476314",
  "comments": [
    {
      "author": "rhomelmabini",
      "created_time": "December 02, 2023, 09:10:04 PM",
      "body": "With the current circulating supply right now multiplied by the current price I think there's a possibility that it may hit that level unless we see some massive unlocks on their tokenomics. I think GameFi especially P2E will still be a huge narrative that will boom this coming bull run and with Splinterlands it's more on delivering good products and extensive marketing same with other gaming tokens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yonton",
      "created_time": "December 05, 2023, 01:36:17 PM",
      "body": "Quote from: rhomelmabini on December 02, 2023, 09:10:04 PMWith the current circulating supply right now multiplied by the current price I think there's a possibility that it may hit that level unless we see some massive unlocks on their tokenomics. I think GameFi especially P2E will still be a huge narrative that will boom this coming bull run and with Splinterlands it's more on delivering good products and extensive marketing same with other gaming tokens.SPS will melt faces this cycle!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "December 06, 2023, 03:29:00 PM",
      "body": "Quote from: yonton on December 05, 2023, 01:36:17 PMQuote from: rhomelmabini on December 02, 2023, 09:10:04 PMWith the current circulating supply right now multiplied by the current price I think there's a possibility that it may hit that level unless we see some massive unlocks on their tokenomics. I think GameFi especially P2E will still be a huge narrative that will boom this coming bull run and with Splinterlands it's more on delivering good products and extensive marketing same with other gaming tokens.SPS will melt faces this cycle! Never heard token with already $30m marketcap ($90M fully diluted) token will go to top 20 with what merits exactly? 100x is just a random number for hyping, right?. Anon devs and dao aren't really a good mix for success. Game itself looks nice, but generic and nothing new, so how would it even pop up to seperate it from the competition? As there have been ton of these. Crypto gaming communities can only keep up with so many new coming games and rather stick with their favorite, that they already invested time to learn..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yonton",
      "created_time": "December 06, 2023, 10:06:34 PM",
      "body": "Quote from: o48o on December 06, 2023, 03:29:00 PMQuote from: yonton on December 05, 2023, 01:36:17 PMQuote from: rhomelmabini on December 02, 2023, 09:10:04 PMWith the current circulating supply right now multiplied by the current price I think there's a possibility that it may hit that level unless we see some massive unlocks on their tokenomics. I think GameFi especially P2E will still be a huge narrative that will boom this coming bull run and with Splinterlands it's more on delivering good products and extensive marketing same with other gaming tokens.SPS will melt faces this cycle! Never heard token with already $30m marketcap ($90M fully diluted) token will go to top 20 with what merits exactly? 100x is just a random number for hyping, right?. Anon devs and dao aren't really a good mix for success. Game itself looks nice, but generic and nothing new, so how would it even pop up to seperate it from the competition? As there have been ton of these. Crypto gaming communities can only keep up with so many new coming games and rather stick with their favorite, that they already invested time to learn.. \"Never heard token with already $30m marketcap ($90M fully diluted) token will go to top 20 with what merits exactly?\"Even if it pulls a 100x during a bull market, it's not enough to break into the top 20 because every other altcoin is soaring too. And who cares about fully diluted! Burned tokens are ignored, and current supply and demand don't give a damn about what the supply will be in 5 years.\"Anon devs and dao aren't really a good mix for success.\"Hold up, none of the devs are anonymous. They're legit, registered in the good ol' USA, with a legal team dealing with the SEC and all that jazz. The DAO isn't some shady thing; it's separate from Splinterlands Corp, and the whole point of Web 3 is decentralization. Otherwise, might as well slap the game on a centralized server. Cheaper and more efficient, right? Don't be fooled by games claiming to be blockchain when they're just NFTs on OpenSea. That's not Web 3, just a web 2 game trying to look cool.\"Game itself looks nice, but generic and nothing new, so how would it even pop up to seperate it from the competition\"This ain't your generic game, buddy. Splinterlands rocks a fully operational DAO making legit decentralized calls (30+ proposals voted on!). They've built dozens of bridges to other chains, set up many liquidity pools, and their in-game blockchain infrastructure is light years ahead. In-game marketplaces operating fully on-chain? Way more complex than any other game or DeFi protocol. Building that blockchain stuff is no joke. Others haven't done it because they can't.So, if you're after flashy trailers and buzzwords, be ready for rug pulls. But if you want the OG Web 3 game that's been holding strong through two bear markets, Splinterlands is where it's at.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "December 07, 2023, 09:18:54 PM",
      "body": "Quote from: yonton on December 06, 2023, 10:06:34 PM\"Anon devs and dao aren't really a good mix for success.\"Hold up, none of the devs are anonymous. They're legit, registered in the good ol' USA, with a legal team dealing with the SEC and all that jazz.Well you got me there. My bad for not digging deep enough. It seems you can't go docs directly from their homepage where the founders are. I will look deeper into it. I've only invested to godsunchained from the start, and even though it was highly profitable for me, the whole experience took for ages, and while everything must have looked cool to outsiders, it was extremely annoying for someone who was part of it from the start. Lack of communication and misleading information. Outsider it looked like moon potential.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}