{
  "id": "topic_5470790",
  "title": "DubemIfedigbo001",
  "author": "DubemIfedigbo001",
  "created_time": "October 18, 2023, 01:00:08 PMLast edit: October 18, 2023, 01:10:19 PM by DubemIfedigbo001",
  "content": "The issue of holding organization funds by an individual, lets say the treasurer of the organization should be heavily discouraged as most times it does not end well and leads to the funds being utilized or stolen by the person in charge. organizations should plan their startup properly and that includes being properly registered with the government which enables them to open a company account with approved banks.However, there are slim exceptions whereby the organization are not much financially stable and funds are not readily available to go through the process of company registration and they startup their activities with the motive of doing the needful later as they grow in finance. this now leads to the organization funds being held by trusted members for the time being. Another one and the one that prompted me to start this topic gave me a really big challenge and I learnt invaluable lessons from it. It is the issue of holding association funds temporarily pending the rectification of accounts and change of signatories with past leaders whom have relocated from the state.This is a very risky and complicated matter, and it is even more complicated when you combine the association funds with your own personal funds in the same account. The risk of overspending may arise as you will constantly see enough funds in your account and might tend to forget that there are foreign funds present and before you realize what you've done, you're already indebted to the company.Secondly, there is this sense of caution that arise instinctively when your personal funds is diminishing whereby you restrict yourself to having only things you really need and curb all excesses until you are back to having much funds. In the case of combined funds, that discipline might not be observed as you see encouraging figures always.Thirdly, You might intentionally spend the alien funds with the thought of replacing it whenever you own funds are available. This is a very big mistake without proper accounting and documentation to checkmate what you spend because before you know it, you've utilized more than your assumed funds can handle and leave yourself in a great mess.A good solution to this is to have an entirely different account to receive funds that is not yours and refuse to have ATM card or much access to that account. In fact, the account should be as good as forgotten by you and the only connection to it is withdrawing funds for the organization purpose, Receiving credit and debit alerts to be able to monitor the activities of the account. You also need to have a place that you detail the transactions on that account, like your private record so that you can have the account record ready at any time it is requested by the organization. this rapid accounting relieves you the stress and time wastage of explaining yourself too much as everything related to the transactions on the account is properly penned down and possibly snapped and backed up in your google drive for retrieval in case you misplace the books.This way, you will have two advantagesReduced Interaction with with funds that are not yours as there is a separation of concerns and you get to plan yourself properly with your fundsYou gain respect by being accountable for the funds anytime as you have the transactions carefully spelt out in your accounting books and a backup online if books are far fetchedFinally, Keep the pressure for account rectification on and ensure funds are out of your control as soon as it's done to relieve yourself from the temptations that are associated with being in custody of association funds. I advise you to update your personal records immediately there is a transaction whether debit or credit as you may forget the details sooner or later and put yourself under unnecessary stress.Note: At the time of developing this topic, Discussing it with a friend, I learnt of a woman leader whom squandered millions under her care for the purchase of association luxurious buses and started shedding tears when asked to return the funds within one week. All these could have been avoided If the organization had its account or if she had known these principles above.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470790",
  "comments": [
    {
      "author": "DeathAngel",
      "created_time": "October 18, 2023, 01:25:49 PM",
      "body": "You will need a very good accountant who knows how to get inventive, if you do this. Without one you have a big chance of getting in serious trouble with the IRS. I don’t think it’s worth it to be looking over your shoulder all the time. Peace of mind is priceless, record & pay your taxes properly, it’s the smart thing to do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "October 18, 2023, 01:37:03 PM",
      "body": "OP, you are right one must not keep organization funds in where he can reach it easily, especially when he puts it in his house. This might be very risky when you will face some challenges that will lead to you using such funds, believing that you will be able to replace it. What if the funds is needed urgently by the organization and you can't afford to replace it at that moment. This will bring distrust,shame, embarrassment and tarnish of image. This is why one needs to avoid such act of mixing organization funds with your own personal funds because, must be tempted to use it. Putting the funds in the bank or channel it to the right person that should be in charge is the best for peace of mind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Russlenat",
      "created_time": "October 18, 2023, 01:48:16 PM",
      "body": "You really need to understand the fundamental principle of running a business if you're thinking about mixing your personal funds and company funds. The business entity is separate and distinct from the owner; that's the essence of the business entity concept. In accounting principles, it's crucial to keep them separate. When you have a business, you should only account for the transactions of the business itself. You can't include your personal transactions because that will not provide an accurate picture of the business's financial status. We're specifically talking about the income and expense status, commonly known as the income statement in accounting terms.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "October 18, 2023, 02:07:15 PM",
      "body": "Business and personal, two different issues in the life of every individual, statement below.QuoteDangers of combining company and personal funds in the same account.This will clearly pose a big danger from an economic perspective, especially if your company is growing rapidly and at the end of the story if the two pieces of money are combined into one box then everything will fall apart.The company has employees and a treasurer, all professions are in the company, within the company there is a financial management system to determine needs and goals for the development of the company being managed, The company has separate accounts in its name, so it is not a good idea to combine one account.Personal accounts also have their own role for our personal needs, wives/husbands automatically know about personal accounts, Well, if the company's money is combined with personal money, it is clear that the company will go bankrupt, various factors, cannot be explained here one by one, which is clearly very dangerous.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "October 18, 2023, 02:17:03 PM",
      "body": "Quote from: DubemIfedigbo001 on October 18, 2023, 01:00:08 PMThe issue of holding organization funds by an individual, lets say the treasurer of the organization should be heavily discouraged as most times it does not end well and leads to the funds being utilized or stolen by the person in charge. organizations should plan their startup properly and that includes being properly registered with the government which enables them to open a company account with approved banks.However, there are slim exceptions whereby the organization are not much financially stable and funds are not readily available to go through the process of company registration and they startup their activities with the motive of doing the needful later as they grow in finance. this now leads to the organization funds being held by trusted members for the time being. Another one and the one that prompted me to start this topic gave me a really big challenge and I learnt invaluable lessons from it. It is the issue of holding association funds temporarily pending the rectification of accounts and change of signatories with past leaders whom have relocated from the state.This is a very risky and complicated matter, and it is even more complicated when you combine the association funds with your own personal funds in the same account. The risk of overspending may arise as you will constantly see enough funds in your account and might tend to forget that there are foreign funds present and before you realize what you've done, you're already indebted to the company.Secondly, there is this sense of caution that arise instinctively when your personal funds is diminishing whereby you restrict yourself to having only things you really need and curb all excesses until you are back to having much funds. In the case of combined funds, that discipline might not be observed as you see encouraging figures always.Thirdly, You might intentionally spend the alien funds with the thought of replacing it whenever you own funds are available. This is a very big mistake without proper accounting and documentation to checkmate what you spend because before you know it, you've utilized more than your assumed funds can handle and leave yourself in a great mess.A good solution to this is to have an entirely different account to receive funds that is not yours and refuse to have ATM card or much access to that account. In fact, the account should be as good as forgotten by you and the only connection to it is withdrawing funds for the organization purpose, Receiving credit and debit alerts to be able to monitor the activities of the account. You also need to have a place that you detail the transactions on that account, like your private record so that you can have the account record ready at any time it is requested by the organization. this rapid accounting relieves you the stress and time wastage of explaining yourself too much as everything related to the transactions on the account is properly penned down and possibly snapped and backed up in your google drive for retrieval in case you misplace the books.This way, you will have two advantagesReduced Interaction with with funds that are not yours as there is a separation of concerns and you get to plan yourself properly with your fundsYou gain respect by being accountable for the funds anytime as you have the transactions carefully spelt out in your accounting books and a backup online if books are far fetchedFinally, Keep the pressure for account rectification on and ensure funds are out of your control as soon as it's done to relieve yourself from the temptations that are associated with being in custody of association funds. I advise you to update your personal records immediately there is a transaction whether debit or credit as you may forget the details sooner or later and put yourself under unnecessary stress.Note: At the time of developing this topic, Discussing it with a friend, I learnt of a woman leader whom squandered millions under her care for the purchase of association luxurious buses and started shedding tears when asked to return the funds within one week. All these could have been avoided If the organization had its account or if she had known these principles above.Normally as a manager of a company or a CEO supposedly, it is best for you to always have a separate account with your business account most marketers and account managers will give you the advice of not wanting to run your entire financial activity on one account. Most cases it's even advised to have more than one company account, with different account managers. The complexity of running a business is too flexible to want to mix it with your family or your private money, you have staff's to pay, you will advertise your product all of this cost money, so it should be separated so you would know  your operational cost and what the company is generating so you could check and balance ⚖️ your business, to know if your making profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "October 18, 2023, 02:20:39 PM",
      "body": "Quote from: DubemIfedigbo001 on October 18, 2023, 01:00:08 PMThe issue of holding organization funds by an individual, lets say the treasurer of the organization should be heavily discouraged as most times it does not end well and leads to the funds being utilized or stolen by the person in charge. organizations should plan their startup properly and that includes being properly registered with the government which enables them to open a company account with approved banks.The real question is there any company that still doing this kind of funds keeping within the officer because the last time I experienced this kind of model is on my school back in college which our treasurer store our funds on his own wallet.  All companies nowadays using bank to deposit their funds and it was owned by multiple people and require multiple signature to access and withdraw funds. There’s no serious company that will hire a treasurer instead of using bank to save funds because this is really dangerous.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "October 18, 2023, 02:23:39 PM",
      "body": "It's a must to separate your personal account and company account since it will make you easier to track the transaction, combining it will make you need to record it every single transaction, otherwise you will lose count.Open a new account isn't hard, if you think it will cost you some money, you shouldn't start a business when you lack of money since there would be many unnecessary spend may happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lorence.xD",
      "created_time": "October 18, 2023, 02:26:10 PM",
      "body": "You will have to be professional in this case scenario, and it's common thing to have a separate account to your business account to avoid the mix of transactions, that might cause inaccuracy and errors which will affect the company's budget. These principles were already taught in a course related to accounting, so most of the company are hiring people with educational background related to accounting, since they are the one that are capable in managing finances. (In my country PH)Some people would be tempted with the amount of money on their hands, but always remember that once you used it on your own, it could be consider as a theft crime. That's why it's a crucial role for you to handle money, which is what you signed up for. Even a small discrepancy could be deducted to your salary. Even if you own a business, separating business account and personal is always a must. You wouldn't know how much funds to budget you still have to circulate the money once again by buying resources. There's a lot of factor to consider if you do this thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayu7adi",
      "created_time": "October 18, 2023, 03:36:59 PM",
      "body": "Quote from: DubemIfedigbo001 on October 18, 2023, 01:00:08 PMThirdly, You might intentionally spend the alien funds with the thought of replacing it whenever you own funds are available. This is a very big mistake without proper accounting and documentation to checkmate what you spend because before you know it, you've utilized more than your assumed funds can handle and leave yourself in a great mess.Everyone will have a valid account when you possess transparent documents shared with every member. In this context, members' roles encompass not only scrutinizing the treasurer's actions but also participating in correcting financial discrepancies should any errors occur in the organization's financial dealings. After all, humans are not infallible, and forgetfulness is a natural trait. To help minimize the treasurer's mistakes, it's reasonable for members to assist in finding valid evidence regarding the flow of funds from the treasurer.If the treasurer uses organization funds to buy food, it will reflect as a negative balance in the books. Essentially, maintaining separate personal and organizational wallets serves as a straightforward reference to detect calculation errors.Using organization funds for small debts temporarily is permissible, but within reasonable limits. It might function as a lifesaver when you forget your wallet at a restaurant during lunch, which I believe members would understand as a reasonable occurrence. However, it should not be employed for acquiring anything unrelated or extravagant, as that could lead to significant problems.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gallar",
      "created_time": "October 18, 2023, 03:43:09 PM",
      "body": "Quote from: DubemIfedigbo001 on October 18, 2023, 01:00:08 PMThe issue of holding organization funds by an individual, lets say the treasurer of the organization should be heavily discouraged as most times it does not end well and leads to the funds being utilized or stolen by the person in charge.~SnipI totally agree with you friend. Because what you describe is very real and happens everywhere. Personally, I am also sometimes confused by the behavior of people who dare to corrupt funds within an organization or within the government agency where they work. So in my personal opinion, do people like that never see the news, because there are lots of reports about people being punished for committing corruption? Do these people have no fear? However, what is clear in my personal opinion is that the main factor in someone committing acts of corruption is being too greedy and unable to resist the temptation of large amounts of money (belonging to a company or organization). Indeed, in some cases of corruption the reason is that it starts with borrowing. But in my personal opinion, the main point is definitely greed and not being able to resist temptation. Because if people are not greedy and are able to resist temptation, I am sure they will not dare to steal even half a penny from the organization/company funds entrusted to them.So, choosing someone to serve as treasurer is not an easy matter. Because we all certainly don't know in depth about how to choose people who are truly honest and responsible. Because humans always change, be it their attitudes, personalities, or habits. So it is possible that people who are initially honest can turn into dishonest people. Therefore, to avoid corruption, I think financial affairs must be transparent and known and supervised by everyone in the company or within the organization. So if an organization/company's funds decrease, everyone in that organization/company will definitely rush to find out where the money went.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "October 18, 2023, 05:46:04 PM",
      "body": "Quote from: DubemIfedigbo001 on October 18, 2023, 01:00:08 PMThe issue of holding organization funds by an individual, lets say the treasurer of the organization should be heavily discouraged as most times it does not end well and leads to the funds being utilized or stolen by the person in charge. organizations should plan their startup properly and that includes being properly registered with the government which enables them to open a company account with approved banks.You started a good topic; it really needs discussion. Even these things are taught by many mentors, if you have any in the field of organizations. I mean, those who are planning to be in charge of the funds of some organisation, or if you want to vote for some person to make him one. Then you must have some mentors or seniors who are already aware of such things.They should have told you about such things; otherwise, the studies of accountants are also comprised of this knowledge. But as we are all not accounting students or have any experience,  this topic is really a good help for those who don't have any idea before.Quote from: DubemIfedigbo001 on October 18, 2023, 01:00:08 PMA good solution to this is to have an entirely different account to receive funds that is not yours and refuse to have ATM card or much access to that account. In fact, the account should be as good as forgotten by you and the only connection to it is withdrawing funds for the organization purpose, Receiving credit and debit alerts to be able to monitor the activities of the account. You also need to have a place that you detail the transactions on that account, like your private record so that you can have the account record ready at any time it is requested by the organization. Your tips are awesome, I think you should add another tip of another security level in making Transaction from the organization's funds. Which is similar to multi signature wallets. In this, if you are the custodial of the organization's money, then in order to use them, you have to get permission, but of course you might not remember or don't want to take permission, so those people should have to set a setting in the bank, that once we 2 or 3 people approve the transaction, then you are allowed to transfer the funds. I think this system is known as Dual control system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "October 18, 2023, 06:01:25 PMLast edit: October 18, 2023, 06:17:59 PM by franky1",
      "body": "if you are self employed where your \"business\" is a hobby(low income/not registered), then i see lots of people co-mingling their \"business\" with their normal life. however if you have an actual business that is tax registered.. or/and has employees. then you should have separate accountsif a company is set up to need a treasury. but that treasury is putting funds into his personal account. he is not a treasurer. he is a criminal yet to be caught..no company that has enough business structure to have/need a treasury, would hire a treasurer that uses their personal account for business uses.the company should have a company account registered to the business with the treasurer authorised to access the account. whereby if the treasurer retires, resigns or is sacked its a simple name change by the company of authorised persons to the account. instead of asking ex-treasurer(or their family) to close that ex-treasurers personal account and send funds to company",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Juse14",
      "created_time": "October 18, 2023, 06:17:43 PM",
      "body": "There are some business people who behave carelessly by only relying on their instincts to advance their business and manage their finances. And behavior like this is often carried out by those who are just entering the world of \"beginner\" business.Actually, the reason why we have to separate personal finances and business finances is quite simple, namely to separate finances and personal needs, so that with this the money used as initial capital will not be disturbed by issues of personal needs. \"Because it often happens, especially to micro and small entrepreneurs, that even though they run out of merchandise today, the next day they are confused about finding capital to trade again, because the money they previously got was used up to buy personal needs.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mvdheuvel1983",
      "created_time": "October 18, 2023, 08:21:41 PM",
      "body": "Anyone who combines their company funds and personal fund in the same account is a novice business person. Any experienced business person would know that this is like swimming with the sharks. You are going to get bitten. You'll end up using company funds for the unending plethora of personal and family problems and running bankrupt. At least the business person should get someone to do their finances for them. If they do not employ any other person in the organization.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "October 18, 2023, 08:33:40 PM",
      "body": "Anyone who combines business money with his own money is a person who does not understand anything in the ABCs of business. The company or business is a completely independent entity from the self-unit. Frankly, I am surprised that this topic was brought up because I do not imagine that there is still anyone who combines them, especially since we are now living in a globalized reality in which everything is organized and subject to clear legal controls. Any person who launches a company in any financial system will have to create a special account for the company, usually called a “business account,” and all the company’s financial transactions are carried out on it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "October 18, 2023, 08:40:03 PM",
      "body": "Quote from: DeathAngel on October 18, 2023, 01:25:49 PMYou will need a very good accountant who knows how to get inventive, if you do this. Without one you have a big chance of getting in serious trouble with the IRS. I don’t think it’s worth it to be looking over your shoulder all the time. Peace of mind is priceless, record & pay your taxes properly, it’s the smart thing to do.that is very correct! if you don't want to go crazy later on, better separate those funds, it will also make your life easier. there's no price of having such peace of mind on this matter. you will thank yourself even if you do that diligently.it is no difficult to create separate accounts. so why not go thru such easy path rather than a headache later on?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "knowngunman",
      "created_time": "October 18, 2023, 08:49:30 PM",
      "body": "Quote from: DubemIfedigbo001 on October 18, 2023, 01:00:08 PMNote: At the time of developing this topic, Discussing it with a friend, I learnt of a woman leader whom squandered millions under her care for the purchase of association luxurious buses and started shedding tears when asked to return the funds within one week. All these could have been avoided If the organization had its account or if she had known these principles above.This is not new and it's not peculiar to only organizations that have no company account. It depends on the character of the person who's in charge of overseeing the account. We have seen cases of people squandering money from the association's account both the single signatory and multi signatory account. If the people managing the treasury account are not sincere, such disaster are bound to happen. My friend is the one managing their association account using his personal account but has never been query before for misappropriation of funds or any suspicious transaction. During my days in school, my association was operating a multi signatory account and the president, treasurer and financial secretary conspired and falsify the patron signature to withdraw the association funds and squander it recklessly. It has nothing to do with method using in saving the money but has everything to do with the individual behind the management of funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "October 18, 2023, 08:54:13 PM",
      "body": "everyone is vulnerable to the temptation of taking money that doesn't belong to them, this is the reason why every association - organization - community must have its own financial account and not mix it up with the personal financial account of the chairman - treasurer or anyone who has high influence in the association. I am currently joining a church association, our association is very open with the members and every money that goes out and comes in is announced to the public so that nothing is hidden and kept transparent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "topbitcoin",
      "created_time": "October 18, 2023, 09:17:30 PM",
      "body": "This discussion is quite useful, especially for someone who has just started a business, especially if the business being built is an independent business, not a collaboration involving many people.In building an independent business due to limited costs and human resources, we as pioneers sometimes have to be both a conceptor and an actor, where we are required to be able to do everything, be it planning, implementation, management and even marketing. And so that our business can develop, we must be as wise as possible and as careful as possible in doing everything, especially in managing finances because this is the determining factor. And if our business has started to develop then never hesitate to recruit employees, especially employees who are quite capable of managing the company's finances and don't ever think that recruiting someone who understands financial management will only increase the burden of expenses because there is a certain amount of money that you have to pay. pay every month. In fact, this will have the opposite impact, when you hand something over to an expert, your company's finances will be managed better because your company's income and expenses will be clearer and this will of course help you to minimize risks and losses. Because good financial governance really determines whether a business or company will progress or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}