{
  "id": "topic_5436378",
  "title": "MiliMil",
  "author": "MiliMil",
  "created_time": "January 22, 2023, 06:00:07 PM",
  "content": "Am I the only one who believes Binance knew in advance that FTX was going to collapse?We all know that Binance played a significant role in the downfall of FTX and CZ disliked SBF.I recall reading CZ's tweets last year and he seemed to be in communication with SBF. Did he know the terrible financial situation that FTX was in but hide it from the public?Binance also divested its complete stake in FTX before bankruptcy. Is that a pure coincidence or something more sinister?Nobody has benefited more during this whole fiasco than CZ. Perhaps more things will come out in the future but as it stands the whole situation is shady.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436378",
  "comments": [
    {
      "author": "Hamza2424",
      "created_time": "January 22, 2023, 06:16:41 PM",
      "body": "Bro let's consider it as the game of traps so,The story is as follows....... Let's start it.We are the players who are plying to achieve rewards in the game and our primary priority is to achieve that reward and that is Bitcoin on its ATH value, not the cyclical value. The actual potential value now there are levels. Levels mean to say time to time ATHs of the bitcoin cycle on every cycle we receive rewards, as we hold BTC from the bear zone to the peak of Bull and book massive profit. Now as in a game, you have to suffer from the difficulties or enemies in this game these traps, enemies or difficulties are these platforms, I can give a bunch of examples but that is not what I am trying to explain. So from these traps, we have to be consistent and play one time two times, and so on until we achieve the final level.  Dear now the answer to the question from this example is all of these are interconnected yes my analysis is that Binance was aware of FTX's bankruptcy, and even from sources it is confirmed Binance offered some funds on FTX reserves without flowing them into the market as collateral.Then Binance played a wonderful card by CZ and boom one strong competitor is out of the competition now. NDRC, China, Luna, MT Gox, Binance, and FTX are nothing but time-to-time enemies of our players. Their motive is to break us and trap our funds. Be careful.....#bitcoin community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "January 22, 2023, 06:41:07 PM",
      "body": "Quote from: MiliMil on January 22, 2023, 06:00:07 PMBinance also divested its complete stake in FTX before bankruptcy. Is that a pure coincidence or something more sinister?CZ knows something was wrong or highly suspected something was wrong with FTX, at least, otherwise Binance wouldn't have liquidated 580$ million in FTT holdings as mititgation risk measure:QuoteFTX customers began withdrawing FTT after CZ tweeted on Nov. 6, 2022, that Binance would liquidate its $580 million in FTT holdings as a risk management measure. Binance received FTT after exiting its position as an equity investor in 2021 but later sold the tokens.Binance CEO Changpeng Zhao Warned Sam Bankman-Fried to Own Up Before FTX BankruptcyOn the contrary of what some people said on the internet, I don't think CZ sabotaged FTX. He acted responsively protecting his reputation, his platform and his customers.After that, CZ even advised SBF on how to act towards the crisis. He told him to answer all the questions in public, to not hide anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "January 22, 2023, 06:42:40 PM",
      "body": "Quote from: MiliMil on January 22, 2023, 06:00:07 PMWe all know that Binance played a significant role in the downfall of FTX and CZ disliked SBF.I don't blame him. SBF is one of the most unlikable characters I've seen in years. He's the physical representation of that imaginary guy we punch in the face when we're angry. As for the role in their downfall, FTX was already gone the moment CZ did his thing. How do you expect SBF got all those houses and a yacht? How was he able to give loans to his friends? FTX had the lowest fees so they weren't making money this way, so how were they making money? The scheme was decent and it might've worked if only SBF had some skilled traders. Instead, he had a Harry Potter fan, who liked to take drugs and have sex with her co-workers, and didn't like to use stop losses for her billion dollar levered trades.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "January 22, 2023, 06:59:27 PM",
      "body": "Quote from: MiliMil on January 22, 2023, 06:00:07 PMAm I the only one who believes Binance knew in advance that FTX was going to collapse?The short answer is yes, but it is difficult to know exactly when they knew and how much they knew about the financial situation. Were they the financial actions of the company and how bad the financial situation was?My personal guess is that they knew at some point after the collapse of Luna and after the talks, they may have helped save the institution, and because they knew about the exploitation of the money, they had to wait for the right moment to deliver the final blow that finally happened.Even if we assume that they have known for a longer period, 2021 was excellent for crypto, liquidity was available, and it was difficult for them to strike this blow at that time.They took advantage of the situation to their advantage and came out with the most gains.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MiliMil",
      "created_time": "January 22, 2023, 07:29:09 PM",
      "body": "Quote from: darkangel11 on January 22, 2023, 06:42:40 PMI don't blame him. SBF is one of the most unlikable characters I've seen in years. He's the physical representation of that imaginary guy we punch in the face when we're angry. As for the role in their downfall, FTX was already gone the moment CZ did his thing. How do you expect SBF got all those houses and a yacht? How was he able to give loans to his friends? FTX had the lowest fees so they weren't making money this way, so how were they making money? The scheme was decent and it might've worked if only SBF had some skilled traders. Instead, he had a Harry Potter fan, who liked to take drugs and have sex with her co-workers, and didn't like to use stop losses for her billion dollar levered trades. I am in no way defending SBF. I know he is a scumbag who has no moral compass however I find it hard to believe that CZ had no knowledge of FTX's struggles. He was the only person to benefit from this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "January 22, 2023, 07:43:44 PM",
      "body": "Quote from: Husires on January 22, 2023, 06:59:27 PMMy personal guess is that they knew at some point after the collapse of Luna and after the talks, they may have helped save the institution, and because they knew about the exploitation of the money, they had to wait for the right moment to deliver the final blow that finally happened.You may be right. Crypto is a smaller world than we imagine, especially regards these big companies. These people know each other and make partnerships all the time, lending or borrowing money, launching projects together, etc... Due to the level of close contact and relationship they have, I believe it's impossible if one company is going bankrupt and its pairs don't know about it. Gossips go around, and employees leak it to acquaintances from other companies or even to CEOs they have access.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "January 22, 2023, 07:45:07 PM",
      "body": "Well probably never know for sure and there's a good chance it was coincidence too. Binance may have been trying to do a lot of sell offs at once to reduce their risk after luna collapsed and wiped out quite a lot of their free investment capital (and ftx's). This seems like it could've been something that started ftx's insolvency issues too (along with bailing out other services that were insolvent without having the funding for them).I don't think it's possible binance would know for definite what they'd destroy by devesting ftt and other coins (I don't think it's unreasonable to assume they'd shake out a few exchanges by doing that and then launching their \"proof of reserves\" program).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Casdinyard",
      "created_time": "January 22, 2023, 08:00:43 PM",
      "body": "Quote from: MiliMil on January 22, 2023, 06:00:07 PMAm I the only one who believes Binance knew in advance that FTX was going to collapse?We all know that Binance played a significant role in the downfall of FTX and CZ disliked SBF.I recall reading CZ's tweets last year and he seemed to be in communication with SBF. Did he know the terrible financial situation that FTX was in but hide it from the public?Binance also divested its complete stake in FTX before bankruptcy. Is that a pure coincidence or something more sinister?Nobody has benefited more during this whole fiasco than CZ. Perhaps more things will come out in the future but as it stands the whole situation is shady. Right from the get-go? No, not really. But CZ eventually realized that something was fishy about FTX and the way they handle their customers funds, thus the $500 million liquidation. He's as transparent as anyone in that situation can be. He let the people know that something was wrong with FTX, which was his reason to pull out their investments in the company, whether this caused a bank run or not is still up for debate, but I'm leaning towards the latter, because losing a competitor in a still budding industry like this is tantamount to a whole infrastructure collapse. Something that he of all people, is not keen about. Anyhow, the damage has set in and we are slowly recovering from the fuckups of SBF. If you're trying to pin the blame to CZ for letting people know about the issues that FTX hid from their customers, go for it, but it doesn't change the fact that SBF mismanaged FTX funds, even went so far as to gamble some of it in hopes of recovering losses to fund customer withdrawals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "January 22, 2023, 09:25:33 PM",
      "body": "Quote from: Husires on January 22, 2023, 06:59:27 PMQuote from: MiliMil on January 22, 2023, 06:00:07 PMAm I the only one who believes Binance knew in advance that FTX was going to collapse?The short answer is yes, but it is difficult to know exactly when they knew and how much they knew about the financial situation. Were they the financial actions of the company and how bad the financial situation was?My personal guess is that they knew at some point after the collapse of Luna and after the talks, they may have helped save the institution, and because they knew about the exploitation of the money, they had to wait for the right moment to deliver the final blow that finally happened.Even if we assume that they have known for a longer period, 2021 was excellent for crypto, liquidity was available, and it was difficult for them to strike this blow at that time.They took advantage of the situation to their advantage and came out with the most gains.I believe they knew it but already too late. Maybe a lil bit earlier than most in the crypto community.Because if they knew the extent of bankruptcy the FTX had, they won't even offer to buy it as  CZ tweeted about it.But once they realized the massive problem of FTX, they backed out, which I believe was a good decision for Binance.They will be buying a company full of problems, that it will only reduce their assets greatly. I guess, CZ is thanking himself that they didn't pursue purchasing this company.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "January 22, 2023, 09:47:31 PM",
      "body": "Quote from: MiliMil on January 22, 2023, 06:00:07 PMAm I the only one who believes Binance knew in advance that FTX was going to collapse?We all know that Binance played a significant role in the downfall of FTX and CZ disliked SBF.I recall reading CZ's tweets last year and he seemed to be in communication with SBF. Did he know the terrible financial situation that FTX was in but hide it from the public?Binance also divested its complete stake in FTX before bankruptcy. Is that a pure coincidence or something more sinister?Nobody has benefited more during this whole fiasco than CZ. Perhaps more things will come out in the future but as it stands the whole situation is shady.FTX bankruptcy is caused by SBF's failure in financial management, not by CZ or whoever is behind harming SBF. CZ only owns 500 million FTT, and if FTX has more than 10 billion reserves as SBF's girlfriend claims, if CZ sells all FTT to kill FTX intentionally, he can't do it either. So, the obvious problem is that FTX is having a very serious internal financial crisis, if CZ is not the one to clarify things, sooner or later, FTX will go bankrupt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "January 22, 2023, 09:51:22 PM",
      "body": "That's possible, with these whales known each other in real life but in competition for their businesses. I guess that these folks are sharing some details of how their business are doing and they've got a way to closely monitor the finances and status of each other. I don't know, it's just like a private and close door meeting which is like I'm only seeing on the television but happening in real life. But, it can just be that CZ has seen it recently and has stated the actual situation for which FTX chose not to be vocal about it so CZ did spoke for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Myleschetty",
      "created_time": "January 22, 2023, 10:41:57 PM",
      "body": "Quote from: MiliMil on January 22, 2023, 06:00:07 PMAm I the only one who believes Binance knew in advance that FTX was going to collapse?There's a lot of game played by SBF and it's not hard for you to know things behind doors in an ecosystem if you're one of the most powerful men in the field.Quote from: MiliMil on January 22, 2023, 06:00:07 PMWe all know that Binance played a significant role in the downfall of FTX and CZ disliked SBF.Information is powerful, there's nothing showing CZ disliked SBF and he dislike him he would have dumped the FTT crypto when he had the chance.Quote from: MiliMil on January 22, 2023, 06:00:07 PMI recall reading CZ's tweets last year and he seemed to be in communication with SBF. Did he know the terrible financial situation that FTX was in but hide it from the public?Binance also divested its complete stake in FTX before bankruptcy. Is that a pure coincidence or something more sinister?Nobody has benefited more during this whole fiasco than CZ. Perhaps more things will come out in the future but as it stands the whole situation is shady.CZ appears to have known the FTX issue but he was not sure until Caroline Ellison tweeted and CZ tweeted after Caroline revelation. Don't blame CZ for the wrong management and abuse of user's funds done by SBF.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "January 23, 2023, 05:22:14 AM",
      "body": "Quote from: MiliMil on January 22, 2023, 06:00:07 PMAm I the only one who believes Binance knew in advance that FTX was going to collapse?Binance is one of the largest holders of FTX securities tokens (23 million tokens [1]). Like whale holders in general, CZ is obliged to know the financial health of FTX in anyway to protect its own company.QuoteWe all know that Binance played a significant role in the downfall of FTX and CZ disliked SBF.Idk about this, I 've never read a statement about their emotional relationship even implicitly anywhere, the actual reality is still in doubt.1. https://www.investopedia.com/binance-to-sell-ftt-6826211",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "malcovi2",
      "created_time": "January 24, 2023, 05:09:24 AM",
      "body": "I wonder why people keep on talking about Binance when it was Coindesk raised the insolvency issue of FTX to the public.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "January 25, 2023, 07:11:37 PM",
      "body": "Quote from: malcovi2 on January 24, 2023, 05:09:24 AMI wonder why people keep on talking about Binance when it was Coindesk raised the insolvency issue of FTX to the public.At the time of Coindesk posting of that article and the spread of rumors, Binance had already got rid of its FTT, and then news and rumors were leaked that led to the withdrawal of funds, lack of liquidity, and with mismanagement bankruptcy occurred, so Coindesk was the last point and it was possible for CZ rumors to spread without themThe best thing we can say is that if there is no water running under the bridge, it will not collapse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "January 25, 2023, 07:19:14 PM",
      "body": "It's possible. But the time when he suspects something is wrong was when Binance got a huge chunk of FTT deposit which as CEO of an exchange he knows already will be dumped to the Binance clients.If CZ was aware of its collapse long before it happen, CZ wouldn't wait for the price to dive to $22. He would have sold at $70+ to profit more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "January 25, 2023, 08:17:26 PM",
      "body": "Opinion and nothing more. The higher ups at Binance knew something was wrong at FTX. They probably had a lot of suspicions that they were not fully solvent or were having other issues.Did they know it was that bad, probably not. Otherwise they would have not wasted time even 'looking' at what FTX was worth, look at their books. It just turned into a total waste of time and made Binance look worse.Had they come out and said 'FTX be fucked run away as fast as you can' then we could have a good clue that they were aware. But looking at the mess that SBF created, I don't think anyone knew how bad it really was.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "January 26, 2023, 03:18:07 AM",
      "body": "We're on this again. FTX will probably collapse at some point. That it collapsed at that exact point was more or less CZ's move. Nothing was coincidental. CZ dumped almost $600 million of FTT in the market. He publicly announced the move. Not only that, he made it public that SBF was involved in some kind of lobbying in DC for crypto regulations and he accordingly badmouthed Binance there. It is, of course, possible that CZ knew that something is wrong with FTX, but all his actions are saying he hated FTX and SBF so much so that he terribly wanted them to burn. And he's doing his part to make it happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "January 26, 2023, 09:12:06 PM",
      "body": "Quote from: MiliMil on January 22, 2023, 06:00:07 PMAm I the only one who believes Binance knew in advance that FTX was going to collapse?We all know that Binance played a significant role in the downfall of FTX and CZ disliked SBF.I recall reading CZ's tweets last year and he seemed to be in communication with SBF. Did he know the terrible financial situation that FTX was in but hide it from the public?Binance also divested its complete stake in FTX before bankruptcy. Is that a pure coincidence or something more sinister?Nobody has benefited more during this whole fiasco than CZ. Perhaps more things will come out in the future but as it stands the whole situation is shady.You are not alone with that belief. CZ is a smart man and surely knew that tweeting about dumping FTT would cause panic. And not only dumping but hinting that they might not be solvent it would cause bank run. And as he knew they were not solvent he could have easily calculated what happens next. It would be hard to prove though. And we woudn't know if his intentions were purely to hurt them a little and things got out of hand. And as their relationship seemed to be tense, i would imagine that CZ didn't mind this happening to sam. However it's not like CZ is EVER going to take any blame for this. That would be too much to carry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}