{
  "id": "topic_5524973",
  "title": "Odusko",
  "author": "Odusko",
  "created_time": "January 02, 2025, 02:04:53 AM",
  "content": "With recently tightened regulations and crack down on Bitcoin miners and traders in China and other countries, a lot of cryptocurrency platforms head quarter are now relocating to the United States, with cited optimism of Trump pro-Bitcoin administration, and as we can see the president-elect made his administration will make America the Bitcoin country which means a lot of opportunities for businesses and favorable place for new crypto projects.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5524973",
  "comments": [
    {
      "author": "_act_",
      "created_time": "January 02, 2025, 02:09:40 AM",
      "body": "But it is good to know that Vancouver is not in China but in Canada. China remain the second in having more miners after United States since the bitcoin mining crackdown in China some years ago. But many miners moved to Kazakhstan which is the third on the list since that time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bestcandy",
      "created_time": "January 02, 2025, 02:18:21 AM",
      "body": "Quote from: Odusko on January 02, 2025, 02:04:53 AMWith recently tightened regulations and crack down on Bitcoin miners and traders in China and other countries, a lot of cryptocurrency platforms head quarter are now relocating to the United States, with cited optimism of Trump pro-Bitcoin administration, and as we can see the president-elect made his administration will make America the Bitcoin country which means a lot of opportunities for businesses and favorable place for new crypto projects.Every investor like to site their investment where it will strive. I'm not surprised for propose relocations of digital currency platform headquarters to USA because US has one the biggest economy in the world and with the Donald Trump positive instance on Bitcoin, there is every indication that many America investors will consider Bitcoin as alternate investment thereby creating more opportunity for Bitcoin to strive economically. And if this happen, many other develop countries with stable economy may likely follow suit in Bitcoin investment which may likely lead to a potential bullish of Bitcoin value and price before the end of 2025.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rodskee",
      "created_time": "January 02, 2025, 02:47:46 AM",
      "body": "Quote from: Odusko on January 02, 2025, 02:04:53 AMWith recently tightened regulations and crack down on Bitcoin miners and traders in China and other countries, a lot of cryptocurrency platforms head quarter are now relocating to the United States, i would not doubt that anything crypto related projects are restricted and prohibited in China but the image says Vancouver which is a city in Canadaas far as I know, cryptocurrencies are legal in Canada so I am guessing that they are only targeting mixers specifically despite being quite accepting of crypto or at least more accepting compared to China it would make sense to relocate to US and i am sure that this is one of the benefits the US has expected when they decided to welcome crypto to their government many if not most crypto enthusiasts will pack their bags and operate on US soil instead fulfilling their dream of becoming the bitcoin capital",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "X-ray",
      "created_time": "January 02, 2025, 03:15:18 AM",
      "body": "seems to be the case, those miners got the money to relocate, if they see regulation supports them heavily then they'd definitely think about relocating.this is the benefit of having good regulation around bitcoin, basically attracting the big miner to invest because those miners are probably tired of legal uncertainty knowing how much money at stake here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "January 02, 2025, 03:19:48 AMLast edit: January 02, 2025, 03:33:07 AM by goldkingcoiner",
      "body": "China bans and crackdowns is the gold standard of proving Bitcoin to be UNTOUCHABLE by any government or bank time and time again.December 2013 - China bans banks from handling Bitcoin transactions.June 2019 - Access to domestic and foreign crypto-exchanges were banned.May 2021 - Institutions/companies were banned from providing cryptocurrency-related services.June 2021 - Banks/payment platforms banned from facilitating crypto transactions and mining activities.September 2021- China declares cryptocurrency transactions illegal.January 2025: China accounts for about 21% of the global hashrate. Thank you China, for making Bitcoin hodlers/miners feel safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "spectre71",
      "created_time": "January 02, 2025, 03:34:21 AM",
      "body": "Well, sure the US is pro BTC and not a third world country.But damn near the most important part is the cheap excess power in Texas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "January 02, 2025, 05:29:39 AM",
      "body": "As far as I can tell neither the company (HIVE Digital) nor the location of it (Vancouver, Canada) had anything to do with China and yet the title mentions China!BTW this is a hasty decision in my opinion. The president elect has not yet taken office and the regulations he will enforce on bitcoin businesses is completely unknown. This is an even riskier move when you consider how radical and unpredictable Trump is!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "January 02, 2025, 07:03:01 AM",
      "body": "the relocation of their mining location must have something to do with Trump's election as US president and that could provide legal certainty regarding bitcoin mining to them (at least in the next 5 years). besides that, Texas is also the choice of miners because they have a large energy supply, with an estimated lower operating cost compared to other countries, and they are more lenient towards environmental regulations, making miners more confident to operate their mining there.and there is also the consideration that Trump will make oil prices cheaper, and that will directly affect electricity prices in the country. so maybe this consideration is what made the company move their headquarters to Texas, and maybe there will be other mining companies that follow what they do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "January 02, 2025, 08:14:01 AMLast edit: January 02, 2025, 08:26:15 AM by Zlantann",
      "body": "Quote from: Odusko on January 02, 2025, 02:04:53 AMWith recently tightened regulations and crack down on Bitcoin miners and traders in China and other countries, a lot of cryptocurrency platforms head quarter are now relocating to the United States, with cited optimism of Trump pro-Bitcoin administration, and as we can see the president-elect made his administration will make America the Bitcoin country which means a lot of opportunities for businesses and favorable place for new crypto projects.What is the source of this information? It looks like fake news arranged by an unskilled and uninformed individual. How will miners start moving the the US while they have not seen a single policy document on Bitcoin mining from the incoming administration. It takes so much money to relocate a business which will lead to great loss if not well planned. Miners will certainly move to any country that has the facilities, low tax and flexible policies. But it will be wrong to relocate a country without knowing the direction of its policies. Quote from: rodskee on January 02, 2025, 02:47:46 AMas far as I know, cryptocurrencies are legal in Canada so I am guessing that they are only targeting mixers specifically despite being quite accepting of crypto or at least more accepting compared to China The problem is not about the legality of Bitcoin in a locality. It could be legal but regulatory laws might be too stringent. Government might also increase that the business will become unprofitable. Which might force these miners to flee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "January 02, 2025, 08:26:08 AM",
      "body": "Quote from: Odusko on January 02, 2025, 02:04:53 AMsnip..F2Pool and Antpool are located in Beijing China, I do not think these two will shift to the US. They both provide approximately 20% of the hash rate whereas Canada has again two mining companies. Hive Blockchain & Bitfarms contribute approximately 6% to the hash rate. As a result of Hive relocating to the US, Canada will lose a significant percentage of the hash rate. The new US administration's pro-Bitcoin policy will be favorable to big mining giants, but they will shift when they calculate whether setting up a new base will be profitable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}