{
  "id": "topic_5427779",
  "title": "Bthd",
  "author": "Bthd",
  "created_time": "December 10, 2022, 10:17:27 PM",
  "content": "Nedenini bir kaç gündür binance borsasında ani pumplanan ve sonrasında hemen düşen birimlerde görebilirsiniz. En yaygın kullanılan trade botlarından birisi olan 3commas kullanıcıları sürekli varlıklarını kaybettikleriyle ilgili paylaşımlarda bulunuyorlar ve ekipten bir geri dönüş yok. Şekilde gördüğünüz anlık yeşil çubuk aslında API kodlarını 3commas ile entegre etmiş kullanıcıların varlıklarının resmi. Taban fiyattan 5x görmenizin sebebi ise geçtiğimiz senelerde SYS'de yaşanan benzer olayın (yine API kodu kaynaklı) önüne geçmek için binance borsasının alım satım teklifi limitini 5x'e düşürmüş olması. İlk başta limitsizdi ve çalınan API kodları ile SYS fiyatı 0.00002 BTC'den 96 BTC'ye fiyatlanarak (yanlış duymadınız 1 sys = 96BTC yapıldı) bir çok kişinin hesabı boşaltıldı.Trade botu satan kişiler genelde çekim izni olmadığı sürece hesapların boşaltılamayacağını söyler ancak yukarıdaki olasılık her zaman hırsızlar için açık kapı demek. Siz çekim izni vermemiş olasınız bile API kodunu eline geçiren kişi yeterli hacime sahipse hacmin çok düşük olduğu birimlerde daha önceden yüksek emirler girerek sizin paranızla satın alır. Doğal olarak size ait olan tüm para artık ona geçmiştir. Sizin elinizde ise SYS gibi anlamsız birimler kalır. Bu nedenle trade botları kim tarafından üretiliyor olursa olsun güvenmeyin, sadece kendinize özel trade botu yaratabilecek bilgiye sahipseniz tabi ki kendinize güvenebilirsiniz. Eğer eskiden kullandığınız ve deaktif etmediğiniz API kodlarına sahipseniz muhakkak değiştirin. Olayın bir başka boyutu ise gerçekten çalındı mı yada ekibin kendisi tarafından mı gerçekleştirildi bilmek pek mümkün değil. Eğer bu planı yapabilecek kapasiteye sahiplerse paraları aktaracakları hesapları da OTC marketlerden sahte KYC ile satın almışlardır. Bu yüzden binance borsasında bazı isimler görünüyor olsa da hesap sahipliklerinin doğru olma ihtimali %1 bile değil. 3commas'ın ana yatırımcılarından birisinin FTX olması da olayı biraz daha bulandırıyor. Umarım FTX datasında bulunan API kodları ile ilgili bir hikaye ortaya çıkmaz. Eğer öyleyse Sam zaten dolandırdığı kullanıcılarının diğer borsalardaki varlıklarına da göz dikmiş demektir.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5427779",
  "comments": [
    {
      "author": "mandown",
      "created_time": "December 11, 2022, 07:20:20 AMLast edit: December 11, 2022, 08:14:42 AM by mandown",
      "body": "Her boğa sonrasında benzer durumlar yaşanmıyormu? İşlem hacimleri kaybolunca ortalık apilere kalıyor binance gibi borsalarda malı borsada tutuyorsanız 5x 4x gibi yerlere satış girmek lazım ama ben borsada mal artık tutmuyorm Hala klasik hikayelerin devam etmeside çok üzücü eskiden de bu durumlar oluyordu şimdide oluyor sonuçta kriptoya yeni girenler bir şekilde reklam vs ile apiyi duyuyor ve kullanıyor. Bu yüzden ciddi zararlar görüyorlar kriptoda insan deneyimlemeden neyin ne olduğunu anlayamıyor malesef genelde sonuçları kötü oluyor.Konu için teşekkürler.Binance dünki pumpları araştırıyormuş bencede api tarafı ile ilgili. https://twitter.com/binance/status/1601851957660246016",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "50promil",
      "created_time": "December 11, 2022, 11:22:46 AM",
      "body": "çok klasiktir ama kimse gerçekten para kazanan algoritmayı satmaz. oturur kendi kullanır ,havaide parmak arası terlikle gezer. ayrıca derinliği düşük yerlerde algo kullanmayın. hadi kullandın içeriğini bilmediğin şeye otomatik emir bağlama. o sinyal versin sen manuel gerçekleştir. çok algoritmik işlem istiyorsanız btc,eth,bnb başınızdan aşar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silence Scream",
      "created_time": "December 11, 2022, 06:26:26 PM",
      "body": "Botlara sürekli karşı oldum. Hayatın bir çok alanında avantaj sağlıyor sağlamasına ama şöyle bir sıkıntı var bunu size satan adama ne kadar güvenebilirsiniz? Bana iddia kuponu satmaktan farklı gelmiyor. Bu kadar yüksek getirisi varsa otur sen kullan neden insanlara satıyorsun ki? Böyle ara sıra mal boşalttıkları zaman da ben bot kullanmamalıydım diyorlar. Kullanmamak en güzeli, borsada kripto para tutmamak en güzeli.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bobita",
      "created_time": "December 11, 2022, 10:37:31 PM",
      "body": "Quote from: 50promil on December 11, 2022, 11:22:46 AMçok klasiktir ama kimse gerçekten para kazanan algoritmayı satmaz. oturur kendi kullanır ,havaide parmak arası terlikle gezer. ayrıca derinliği düşük yerlerde algo kullanmayın. hadi kullandın içeriğini bilmediğin şeye otomatik emir bağlama. o sinyal versin sen manuel gerçekleştir. çok algoritmik işlem istiyorsanız btc,eth,bnb başınızdan aşar. Kesinlikle katılıyorum, parayla ilgili bir şey ya da ticaret yaparken şunu mutlaka sormak lazım: Bunu niye yapsın? İnsanlar sadece çok pahalıya aldıkları şeylerden şikayet ediyorlar, halbuki aynı şekilde çok ucuz olanlar da sorgulanmalı, hatta bu örnekte olduğu gibi bazı malların niye satıldığı da sorgulanmalı. Benim için aynı şey kısmen bulut madencilikte de geçerli, orada da diyorum ki madem böyle bir altyapı var, niye paylaşsın? Üstelik ona gerekçe bulabilirsin bile, sonuçta büyük bir yatırım maliyeti var, krediyle yapılmıştır vb, düzenli para girişi gerekiyordur, falan filan. E burada o da yok, oturmuş çok kazandıran(!) bir kod yazmış \"ki, önemli bir kısmı hazır zaten\", niye paylaşsın?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MasterOogway",
      "created_time": "February 04, 2023, 02:30:32 PM",
      "body": "bu trade botlarına nasıl güveniyorlar hala anlayabilmiş değilim. para ile satılanı da free olanı da benim için aşırı derece güvensiz geliyor benim yerime alış satış yapıp kazandıracak.peki bu ürünü üreten eleman yada elemanlar ne kazanacak? nasıl kazanacak? ürünü satarak mı kar ediyor yoksa arkadaşımızın bahsettiği gibi cüzdanlarımızı boşaltıp dalgasına mı bakıyor?borsalara bile zar zor güvenirken böyle botlara kanmamak lazım ileride geri dönüşü olmayan zararlara yol açacağı bariz herkesin dikkatli ve bilinçli olması dileği ile.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "February 04, 2023, 03:03:07 PM",
      "body": "Quote from: MasterOogway on February 04, 2023, 02:30:32 PMbu trade botlarına nasıl güveniyorlar hala anlayabilmiş değilim. para ile satılanı da free olanı da benim için aşırı derece güvensiz geliyor benim yerime alış satış yapıp kazandıracak.peki bu ürünü üreten eleman yada elemanlar ne kazanacak? nasıl kazanacak? ürünü satarak mı kar ediyor yoksa arkadaşımızın bahsettiği gibi cüzdanlarımızı boşaltıp dalgasına mı bakıyor?borsalara bile zar zor güvenirken böyle botlara kanmamak lazım ileride geri dönüşü olmayan zararlara yol açacağı bariz herkesin dikkatli ve bilinçli olması dileği ile.Cüzdan boşaltmak diye birşey yok hocam takas var program yıllarca düzgün çalışır bir gün bakarsın tam tersi işlem yapmış bir bakmışsın hacim olmayan coine programcı eleman ucuzdan topluyor bir anlık program pumplanan ve o arkadaşın satış olarak belirlediği yerden alım yapıyor ve tadaaa bir anda sen çöpü alıyorsuneleman bilmem kaç xden satıyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "February 09, 2023, 05:35:48 AM",
      "body": "Çok güzel bir başlık olmuş hocam. Hele de FTX ismini görünce gözlerim faltaşı gibi açıldı. Bir şey olacağından demiyorum bunu ama kirliliğin boyutu nereye varabilir diye söylüyorum. Ben de çevremdekilere her zaman ısrarla kripto botları kullanmamalarını tavsiye ettim. Evinizin anahtarını kapıcıya verir misiniz? Eşyaların güvenliğinden ne kadar emin olursunuz ki? Evinizin anahtarını neden ister birisi? Bu sorular üzerine kafa patlatmak gerekiyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vonutage",
      "created_time": "February 10, 2023, 08:39:57 AM",
      "body": "Quote from: Bthd on December 10, 2022, 10:17:27 PM...Çalmıyorlar, isteğinizle sizden alıyorlar hatta  Olay çok trajik.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "February 13, 2023, 09:45:43 AM",
      "body": "Kolay para kazanma arzusu her zaman düşmanımız olmadı mı. Biraz düşünülse, kazanan bir sistemi yapan biri neden size versin diye sorgular insan. Ücretli ya da ücretsiz olarak hepsinden aynı düşünceye sahip olunmalı. Hiç teknik detayına inmeden sadece basit mantıkla yaklaşımın bile sizi zarar etmekten kurtaracağını biliyorum. Yakınımda bot yazan, yazabilecek olan kişiler var. Ama hiçbirini bunu pazarlarken ya da birine verirken görmedim. Bana coin söyle onu alayım düşerse de düşsün diyip, düşünmekten uzaklaşarak yapılan davranışla birebir aynı. Yanlış, uzak durun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HakanYAZICI",
      "created_time": "March 09, 2023, 09:54:08 AM",
      "body": "Bu konuyla ilgili kendimize şu soruları sorsak yeterli olur.-İyi çalışan bir botunuz olsa satar mısınız?-Bir botun nasıl çalıştığını kötü niyetli insanlar keşfederse o botu manipüle edilmekten kim koruyacak?-Hesabınızın al sat yetkisini verdiğiniz bir sistemin yarın bir gün pump dump zerzevatlarına girmeyeceğine %100 emin misiniz?Özetle kimse size çalışan bir botu al kardeşim diye koduyla beraber vermez. Kimse sizi altın yumurtlayan tavuğuna ortak etmez.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l99l",
      "created_time": "March 13, 2023, 09:39:06 PM",
      "body": "En doğru soruyu sormak yeterli olacaktır neden güvenmemiz gerektiği konusunda.Elinizde böyle bir mekanizma bir robot olsa belli bir kar yüzdesiyle istediğiniz gibi para kazanırsın kimseyle de uğraşmazsın robot sobot",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xenit0",
      "created_time": "March 19, 2023, 04:15:30 AM",
      "body": "Quote from: Bthd on December 10, 2022, 10:17:27 PMNedenini bir kaç gündür binance borsasında ani pumplanan ve sonrasında hemen düşen birimlerde görebilirsiniz. En yaygın kullanılan trade botlarından birisi olan 3commas kullanıcıları sürekli varlıklarını kaybettikleriyle ilgili paylaşımlarda bulunuyorlar ve ekipten bir geri dönüş yok. https://telegra.ph/file/07db6a25f989f6b65c730.pngŞekilde gördüğünüz anlık yeşil çubuk aslında API kodlarını 3commas ile entegre etmiş kullanıcıların varlıklarının resmi. Taban fiyattan 5x görmenizin sebebi ise geçtiğimiz senelerde SYS'de yaşanan benzer olayın (yine API kodu kaynaklı) önüne geçmek için binance borsasının alım satım teklifi limitini 5x'e düşürmüş olması. İlk başta limitsizdi ve çalınan API kodları ile SYS fiyatı 0.00002 BTC'den 96 BTC'ye fiyatlanarak (yanlış duymadınız 1 sys = 96BTC yapıldı) bir çok kişinin hesabı boşaltıldı.Trade botu satan kişiler genelde çekim izni olmadığı sürece hesapların boşaltılamayacağını söyler ancak yukarıdaki olasılık her zaman hırsızlar için açık kapı demek. Siz çekim izni vermemiş olasınız bile API kodunu eline geçiren kişi yeterli hacime sahipse hacmin çok düşük olduğu birimlerde daha önceden yüksek emirler girerek sizin paranızla satın alır. Doğal olarak size ait olan tüm para artık ona geçmiştir. Sizin elinizde ise SYS gibi anlamsız birimler kalır. Bu nedenle trade botları kim tarafından üretiliyor olursa olsun güvenmeyin, sadece kendinize özel trade botu yaratabilecek bilgiye sahipseniz tabi ki kendinize güvenebilirsiniz. Eğer eskiden kullandığınız ve deaktif etmediğiniz API kodlarına sahipseniz muhakkak değiştirin. Olayın bir başka boyutu ise gerçekten çalındı mı yada ekibin kendisi tarafından mı gerçekleştirildi bilmek pek mümkün değil. Eğer bu planı yapabilecek kapasiteye sahiplerse paraları aktaracakları hesapları da OTC marketlerden sahte KYC ile satın almışlardır. Bu yüzden binance borsasında bazı isimler görünüyor olsa da hesap sahipliklerinin doğru olma ihtimali %1 bile değil. 3commas'ın ana yatırımcılarından birisinin FTX olması da olayı biraz daha bulandırıyor. Umarım FTX datasında bulunan API kodları ile ilgili bir hikaye ortaya çıkmaz. Eğer öyleyse Sam zaten dolandırdığı kullanıcılarının diğer borsalardaki varlıklarına da göz dikmiş demektir.Böyle bir bot almadan önce kendinize şunu sorun:Neden benim para kazanmam için bir sistem geliştirsin?Borsa da herkes birbirinin parasını almaya çalışıyor. Borsalar botşarı ile milletin parasını almaya çalışıyor. Coin sahipleri sahte vaatler ile sahte yükselişler ile milletin parasını alıyor.Peki bu sistemi yapan adam neden benim kazanmamı istesin?Demek ki milletin parasını almak için yeni yollar arıyorlar o kadar.Klasik bir söz:Birşey ücretsizse ürün sizsiniz.Ama yazılıma para ödüyorum.Doğru ödüyotsun ve adam sana ne diyor bizim bot ile parana para demeyeceksin. Yani bize verdiğin parayı gözün bile görmeyecek. Yani beleşe almış gibi olacaksın. Sende tabi kanıp dalış yapıyorsun.Borsaların yaptığı botları da kullanmayın. Ben borsa da satış vd alış emri bile vermem. Çünkü bu emirlere göre işlemler belirlenebiliyor. Bunu norsa botuna bıraktığında paranı adama veriyorsam al senin olsun der gibi...Velhasıl kelam sadece kendine güven.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "50promil",
      "created_time": "March 29, 2023, 11:02:58 AM",
      "body": "bende bot yazıyorum . para kazandıran düzgün botu asla satmam . botu 100 kişiye bile satsan seninle aynı yerde girip çıkacak 100 kişi yaratıyorsun . aynı noktada çok fazla kişi bilinçli olarak alıp satmaya başlarsa o bot bir süre sonra zırtlar .  hiç satılan bir botu kullanmadım olsa olsa orta şeker bir trend  takip sistemi satıyordur diye düşünüyorum. onu siz de yaparsınız.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gramble",
      "created_time": "July 04, 2023, 12:53:15 PM",
      "body": "internetteki çoğu gördüğümüz ponzi sisteminin bir benzeri de trade botlarıdır. Ponzinin amacı nedir kazan kazan  Beyler siz gerçekten de her girdiği işlemi başarıyla trade eden yada %70 başarı oranına sahip bir bot yazdınız satarmısınız ? trade piyasasında ki mantık nedir senin alttan aldığın malı yukardan birilerine satmandır yada yukardan yakaladığın bir shortu en dipte yine birine shortlamaktır. siz kendiniz yazdığınız bu mğkemmel sistemi 50-100 dolar gibi komik rakamlara satıp pastadaki payınızı koca bir dilimden bir çay kaşığına düşürürmüsünüz ?? hemde uzun vadede çok güzel karlar edecekken minik aylık abonmanlık ücretlerine bu birincisi.. ve  diyelimki çatır çatır çalışan bir bot var milyon dolarlık hesabınızla trade yaptırıyorsunuz. peki ya binance'ın botu yok mu bu da ikincisi..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinTurk",
      "created_time": "July 14, 2023, 05:34:25 PM",
      "body": "Quote from: MasterOogway on February 04, 2023, 02:30:32 PMbu trade botlarına nasıl güveniyorlar hala anlayabilmiş değilim. para ile satılanı da free olanı da benim için aşırı derece güvensiz geliyor benim yerime alış satış yapıp kazandıracak.peki bu ürünü üreten eleman yada elemanlar ne kazanacak? nasıl kazanacak? ürünü satarak mı kar ediyor yoksa arkadaşımızın bahsettiği gibi cüzdanlarımızı boşaltıp dalgasına mı bakıyor?borsalara bile zar zor güvenirken böyle botlara kanmamak lazım ileride geri dönüşü olmayan zararlara yol açacağı bariz herkesin dikkatli ve bilinçli olması dileği ile.Tam olarak cüzdan boşaltma yapıldığını söylemek pek doğru olmayacaktır çünkü ücretli veya ücretsiz hiçbir trade botunun cüzdan bakiyesini çektiğine hiç denk gelmedim büyük ihtimalle gelmeyeceğim de. Genellikle bu tarz botlar cüzdan boşaltma işlemi yapacağı zamanlarda pek işlem hacmi bulunmayan kripto para paritelerinde işlemler yaparak kullanıcılarını ters pozisyonda bırakmaktadır. Tabii, yapılan bu işlemde genel olarak işlem hacmi pek bulunmayan bu kripto paraları bot yazılımının sahibi kişi veya firma satmış oluyor. Bu şekilde, traderların cüzdanlarına herhangi bir para çekim talebi girilmeksizin para çekimi de gerçekleşmiş oluyor.Sadece bu tarz şüpheli işlem yapan trade botlarına değil piyasada bulunan hiçbir trade botuna güvenmemek gerekiyor. Bahsettiğim şekilde kötü niyetli olmadan da botlar hatalı işlemler yapabilir ve çok ciddi miktarda zarar edilmesine sebep olabilir. Ayrıca, gerek balinalar gerekse botların yazılımcıları bu botları nasıl kandıracağı hakkında da bilgi sahibi olduğu için botlar kolaylıkla kandırarak ters işlem açmalarına sebep olabilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "July 17, 2023, 07:41:52 PM",
      "body": "Quote from: BitcoinTurk on July 14, 2023, 05:34:25 PMTam olarak cüzdan boşaltma yapıldığını söylemek pek doğru olmayacaktır çünkü ücretli veya ücretsiz hiçbir trade botunun cüzdan bakiyesini çektiğine hiç denk gelmedim büyük ihtimalle gelmeyeceğim de. Genellikle bu tarz botlar cüzdan boşaltma işlemi yapacağı zamanlarda pek işlem hacmi bulunmayan kripto para paritelerinde işlemler yaparak kullanıcılarını ters pozisyonda bırakmaktadır. Tabii, yapılan bu işlemde genel olarak işlem hacmi pek bulunmayan bu kripto paraları bot yazılımının sahibi kişi veya firma satmış oluyor. Bu şekilde, traderların cüzdanlarına herhangi bir para çekim talebi girilmeksizin para çekimi de gerçekleşmiş oluyor.Sadece bu tarz şüpheli işlem yapan trade botlarına değil piyasada bulunan hiçbir trade botuna güvenmemek gerekiyor. Bahsettiğim şekilde kötü niyetli olmadan da botlar hatalı işlemler yapabilir ve çok ciddi miktarda zarar edilmesine sebep olabilir. Ayrıca, gerek balinalar gerekse botların yazılımcıları bu botları nasıl kandıracağı hakkında da bilgi sahibi olduğu için botlar kolaylıkla kandırarak ters işlem açmalarına sebep olabilir.Binance ve çeşitli borsaların girilebilecek emir miktarını sürekli olarak daraltmasının altında da botlarla ilgili olaylar yatıyor. SYS için benzer bir olay yaşandıktan sonra normalde sınırsız emir verilebilirken bunu önce üstte ve altta 10 kat olacak şekilde kısıtlamışlardı. Daha sonra olaylar devam edince bunu 5 kata indirdiler. Yani uygulamadan önce BTC için bile 1$ emir vermek mümkündü daha sonra BTC fiyatını 30k alarak örneklendiriyorum bu limiti 3k alt ve 300k üst olarak değiştirdiler. Şimdi ise 6k alt sınır, 150k üst sınır durumunda. Bitcoin için bu sınırların gerçekleşmesi pek mümkün olmasa da az hacimli altcoinler için çok olası. Şimdilerde ise botlar binance'da bu işlemi gerçekleştirmek için anlık çakılma yada yükselme yerine 1-2 dakika gibi sürece dayanan aralıkla işlem gerçekleştiriyor bu uygulanan kat limitini aşmalarını sağlıyor kısmen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dTAH",
      "created_time": "August 04, 2023, 01:59:24 PM",
      "body": "Trade botlarının varlığı bile beni gülme krizine sokuyor. Saadet zincirleri bile trade botlarından daha cazibeli geliyor.Trade botlarının olayı, size otomatik al-sat yaparak para kazandırabileceğini söylemesidir.Herkesin aklına gelen soru olayı özetliyor: Satan niye yapmıyor?Hiçbir şey yapmadan, evde yatarak arka planda çalışan bottan para kazanıyorsa bir kişi, bunu niye satsın? Hadi insanlara yardım etmek istiyor diyelim ama eğer bu botu satarsa bu sefer de hacim sebebiyle bot bozulacak ve bir işe yaramayacak.Anlayacağınız kimse böyle bir ürünü satmaz.Ya açıkça dolandırıcıdır ya da kendi bile güvenmiyordur yaptığı bota ama satayım da para kazanayım derdindedir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "barisbilgili",
      "created_time": "October 12, 2023, 05:15:37 AM",
      "body": "Quote from: dTAH on August 04, 2023, 01:59:24 PMTrade botlarının varlığı bile beni gülme krizine sokuyor. Saadet zincirleri bile trade botlarından daha cazibeli geliyor.Trade botlarının olayı, size otomatik al-sat yaparak para kazandırabileceğini söylemesidir.Herkesin aklına gelen soru olayı özetliyor: Satan niye yapmıyor?Hiçbir şey yapmadan, evde yatarak arka planda çalışan bottan para kazanıyorsa bir kişi, bunu niye satsın? Hadi insanlara yardım etmek istiyor diyelim ama eğer bu botu satarsa bu sefer de hacim sebebiyle bot bozulacak ve bir işe yaramayacak.Anlayacağınız kimse böyle bir ürünü satmaz.Ya açıkça dolandırıcıdır ya da kendi bile güvenmiyordur yaptığı bota ama satayım da para kazanayım derdindedir.Buna inanmamız gerçekten mantıklı değil çünkü eğer gerçekten işe yarasaydı elbette kişi onu satmazdı ve zengin olmak için kendisi için para kazanırdı ve eğer bunu başka birine satarsa ​​bence hala buna ihtiyacı vardı. para ve henüz zengin olmadı. İnsanların kolaylıkla zengin olmalarını sağlayacak bir şey varsa, bunun da gerçekleşmesi imkansız bir şey olduğunu düşünüyorum.Evet ben de sizinle aynı şeyi düşünüyorum, botu yaptıktan sonra kendisi denemedi ve para kazanmak için sattı ve eğer başarılı olursa zengin olmak için kendisi deneyecekti.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}