{
  "id": "topic_5413941",
  "title": "Crypt0Gore",
  "author": "Crypt0Gore",
  "created_time": "September 18, 2022, 06:56:51 AM",
  "content": "1. The minimum deep that BTC dived to was 17,500$ do you still think we are going below 13,000$? If yes please explain.2. Does it matter if you build a crypto portfolio at 15k per BTC or 10k per BTC.3. In 2020 covid was the reason why BTC crumbled to 3,500$ what will happen in 2023 that will bring the same deep dive to crypto market. 4. Crypto keeps looking stronger every year, it's getting more recognised and big players of the world are saying BTC is a better store of value than the dollar for long term, are they right.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413941",
  "comments": [
    {
      "author": "hyudien",
      "created_time": "September 18, 2022, 07:48:58 AM",
      "body": "No one knows for sure and predictions won't be right. It's just that for those of us who believe in Bitcoin having the principle as long as you can buy when it's cheap then why not do it today? The ups and downs of the crypto market are always volatile and you cannot predict from one side only. Let's say you sell bitcoin because you hear there will be a deep bearish, but subconsciously people have been waiting for your sale without thinking it will be bearish. Investors always think 10 steps further and in fact, they manage to take profits in the long term. If it only measures to 2023 of course it's not a good choice if you keep it temporarily. Gradually the Bitcoin market will continue to grow. Digitization has spiked since the pandemic and in today's era people have learned a lot that keeping money in Bitcoin has given them the option of complete control despite the bear market has come many times.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "September 18, 2022, 07:53:07 AM",
      "body": "Your thread is more about Bitcoin than Altcoins, so it should be in the Bitcoin discussion or speculation board.Quote from: Crypt0Gore on September 18, 2022, 06:56:51 AM1. The minimum deep that BTC dived to was 17,500$ do you still think we are going below 13,000$? If yes please explain.Whilst i don't think that $13k is possible right now, nothing can be ruled out in this Bitcoin network, it is absolutely unpredictable, but $13k or even below wouldn't matter too much to long term investors who are hodling, they would pretty much just accumulate more.Quote from: Crypt0Gore on September 18, 2022, 06:56:51 AM2. Does it matter if you build a crypto portfolio at 15k per BTC or 10k per BTC.It doesn't. If you are waiting for a desired price to invest, what happens when you never get to see Bitcoin in that price, let's say $10k for example, so you should build your Bitcoin portfolio now or whenever you are ready financially.Quote from: Crypt0Gore on September 18, 2022, 06:56:51 AM3. In 2020 covid was the reason why BTC crumbled to 3,500$ what will happen in 2023 that will bring the same deep dive to crypto market. Are you certain Covid was the reason? Well nobody can see 2023 from now, so obviously there can't be an answer to this question.Quote from: Crypt0Gore on September 18, 2022, 06:56:51 AM4. Crypto keeps looking stronger every year, it's getting more recognised and big players of the world are saying BTC is a better store of value than the dollar for long term, are they right.Yes they are prolly right!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "September 18, 2022, 08:04:07 AM",
      "body": "As far as the cryptocurrency market is going, we would never know what would happen until we're there ourselves. However, to make an educated guess about it, it's still best to keep an optimistic mind because if you believe in BTC, then it might just spread and people would see that at this price, it's still relatively cheap.Building a portfolio is essential if you are looking forward to making things better for your future in the long run. I think having that would be beneficial to your money investment-wise. Just believe what you want and take the appropriate risks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z390",
      "created_time": "September 18, 2022, 10:10:34 AM",
      "body": "Altcoins are 95% down from their all time high and BTC is over 75% down as well, its a stupid strategy to keep waiting for more down fall, it's possible that BTC could go below 17,500$ but right now it's not looking like it, smart investors know that we are in a accumulation phase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "September 18, 2022, 10:11:09 AM",
      "body": "Quote from: Crypt0Gore on September 18, 2022, 06:56:51 AM1. The minimum deep that BTC dived to was 17,500$ do you still think we are going below 13,000$? If yes please explain.2. Does it matter if you build a crypto portfolio at 15k per BTC or 10k per BTC.3. In 2020 covid was the reason why BTC crumbled to 3,500$ what will happen in 2023 that will bring the same deep dive to crypto market. 4. Crypto keeps looking stronger every year, it's getting more recognised and big players of the world are saying BTC is a better store of value than the dollar for long term, are they right.1. Take note that bitcoin is very volatile and it's a speculative market, so yes, it's possible no matter how high the bull run has went.2. What matters is how long you're foreseeing yourself staying. If you've seen $20k-$69k then it's up to you if you think that bitcoin's price will come back there. So, it means that $10k-$15k is a good buy if it comes back there. Otherwise, $20k and up is also a good price to catch up.3. I looked at the chart of 2020, the lowest was $5k and it wasn't all about covid-19. But look at how high it has ended by that year @ $29k.As for 2023, we don't know what shall happen then. 4. Them being right is subjective, it'll depend to the person reading and hearing what they say. For me, yes, they're right that bitcoin is a good store of value and it's better to hold btc than fiat/dollar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jeger.Kiting",
      "created_time": "September 18, 2022, 01:41:54 PM",
      "body": "For now, the bear market is still haunting the crypto market and seems to have not recovered, because in the cryptocurrency world no one knows which crypto will be the choice and good in the future because it is an unknown mystery. So do your best for your own choice, if you make a choice from someone else you will definitely regret it if you have a loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "September 18, 2022, 01:53:24 PM",
      "body": "Quote from: Crypt0Gore on September 18, 2022, 06:56:51 AM1. The minimum deep that BTC dived to was 17,500$ do you still think we are going below 13,000$? If yes please explain.2. Does it matter if you build a crypto portfolio at 15k per BTC or 10k per BTC.3. In 2020 covid was the reason why BTC crumbled to 3,500$ what will happen in 2023 that will bring the same deep dive to crypto market. 4. Crypto keeps looking stronger every year, it's getting more recognised and big players of the world are saying BTC is a better store of value than the dollar for long term, are they right.If it is possibility in its broadest sense, ofcourse there is a tendency for its market price to go that low especially if there's something or factors which may pull down its market value such as economic crisis or let's say series prohibition with its usage to many countries. But let us hope, given and as you mentioned that more countries are following adaptation, that this thing would be more in the positive path. With your last question, it is quite situational.Fiat for sure would be a more secure storage but being profitable as a currency would be another kind of story for cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JangoUnchained",
      "created_time": "September 18, 2022, 02:10:07 PM",
      "body": "OP it looks like you are looking forward to investing, by 2024 when BTC surge high to 90k it won't matter if you buy at 17k or 10k, this is why dollar cost average is good strategy for investing in crypto, you can never tell what the bottom is, everyone are just saying that they believe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "September 18, 2022, 08:55:51 PM",
      "body": "Quote from: Crypt0Gore on September 18, 2022, 06:56:51 AM1. The minimum deep that BTC dived to was 17,500$ do you still think we are going below 13,000$? If yes please explain.2. Does it matter if you build a crypto portfolio at 15k per BTC or 10k per BTC.3. In 2020 covid was the reason why BTC crumbled to 3,500$ what will happen in 2023 that will bring the same deep dive to crypto market. 4. Crypto keeps looking stronger every year, it's getting more recognised and big players of the world are saying BTC is a better store of value than the dollar for long term, are they right.1. If the economic situation worsens, 17,500 will no longer be the minimum, the decline will continue;2. If you invest in bitcoin for 10 years, you don't, if you invest for 1 year, you do;2. Why does it suddenly have to happen in 2023? Anything can happen in 2024;4. In the long run bitcoin certainly retains value better than the dollar, as inflation eats away at the value of fiat at a rapid pace.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "September 18, 2022, 09:27:17 PM",
      "body": "Quote from: Crypt0Gore on September 18, 2022, 06:56:51 AM1. The minimum deep that BTC dived to was 17,500$ do you still think we are going below 13,000$? If yes please explain.2. Does it matter if you build a crypto portfolio at 15k per BTC or 10k per BTC.3. In 2020 covid was the reason why BTC crumbled to 3,500$ what will happen in 2023 that will bring the same deep dive to crypto market. 4. Crypto keeps looking stronger every year, it's getting more recognised and big players of the world are saying BTC is a better store of value than the dollar for long term, are they right.War is not probably stopping soon. Things get rougher before they get better. But there's a possibility that next 2 years have been already priced in, and those next 2 years are going to be really bad for bitcoin. If it doesn't get banned in cexes for PoW, it will most likely be taxed near death.If it doesn't get banned, it will probably stay on these levels as people are too afraid to fomo or sell. Most of the investors are probably slowly taking the risk and dollar averaging their buys while it's under 20k",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "September 18, 2022, 09:49:20 PM",
      "body": "Quote from: Crypt0Gore on September 18, 2022, 06:56:51 AM1. The minimum deep that BTC dived to was 17,500$ do you still think we are going below 13,000$? If yes please explain.There is no need for an explanation if someone says that crypto will plummet way below $10k or skyrocket above $80k.  Crypto moves according to its trend aside from saying cryptocurrency market move is unpredictable and crazy.  So anything can happen depending on what the news will come up next.  Everything is uncertain so all prices comes out in our mind is simply a guess, we just wanted to find a justification for it which is not actually available.Quote from: Crypt0Gore on September 18, 2022, 06:56:51 AM2. Does it matter if you build a crypto portfolio at 15k per BTC or 10k per BTC.It does matter, the cheaper we get BTC, the higher the profit we get when it surges, regardless of the price we sell it, the lower we scoop BTC the higher the profit we get.   This is just a simple subtraction.Quote from: Crypt0Gore on September 18, 2022, 06:56:51 AM3. In 2020 covid was the reason why BTC crumbled to 3,500$ what will happen in 2023 that will bring the same deep dive to crypto market. 2023, I think it is time for the transition so I think the same thing won't happen because they are not on the same frame when we talk about the Bitcoin 4 year cycle.Quote from: Crypt0Gore on September 18, 2022, 06:56:51 AM4. Crypto keeps looking stronger every year, it's getting more recognized and big players of the world are saying BTC is a better store of value than the dollar for long term, are they right.Definitely, it is obvious, that holding Bitcoin in a long term will give us more benefits than holding USD in that same amount of time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "September 18, 2022, 09:49:55 PM",
      "body": "Quote from: Crypt0Gore on September 18, 2022, 06:56:51 AM1. The minimum deep that BTC dived to was 17,500$ do you still think we are going below 13,000$? If yes please explain.Right now, none that I can think, of but the market is dynamic what we don't see that is going to happen now is very much different tomorrow or next month, always do your research and keep updated so you'll know what action to follow in every market condition.Quote2. Does it matter if you build a crypto portfolio at 15k per BTC or 10k per BTC.Of course, it matters, because when the price spike the percentage of your profit depends on your investment Quote3. In 2020 covid was the reason why BTC crumbled to 3,500$ what will happen in 2023 that will bring the same deep dive to crypto market. We cannot accurately predict the economy of the world or its condition next year, you just have to trust what you invest and follow its development it is a case-to-case basis for every coin in your portfolio, the bottom line when investing in Cryptocurrency is always investing what you can afford to lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "September 18, 2022, 10:32:00 PM",
      "body": "Quote from: Crypt0Gore on September 18, 2022, 06:56:51 AM1. The minimum deep that BTC dived to was 17,500$ do you still think we are going below 13,000$? If yes please explain.2. Does it matter if you build a crypto portfolio at 15k per BTC or 10k per BTC.3. In 2020 covid was the reason why BTC crumbled to 3,500$ what will happen in 2023 that will bring the same deep dive to crypto market. 4. Crypto keeps looking stronger every year, it's getting more recognised and big players of the world are saying BTC is a better store of value than the dollar for long term, are they right.I think this is very different situation though, we don't have the covid-19 or at least the whole have somewhat manage to control it with vaccine. But the biggest noise we have this year is the war in Europe, although there could be signs of it being in a stand still, it has put a dent on every world's economy as there are shortage of fuel oil and then food supply is dwindling. Inflation rate is everywhere, and so we are in a recession similar to 2018.As for crypto, it's obvious we are in a bear market, BTC hits lowest low of $17,500 but we don't know if we can do lower than that this year. And this crypto winter will continue up to next year 2023, so we better be ready for it and take advantage by continuing to accumulate as much cheap BTC and other crypto as we can.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "samcrypto",
      "created_time": "September 18, 2022, 10:33:49 PM",
      "body": "Quote from: Crypt0Gore on September 18, 2022, 06:56:51 AM1. The minimum deep that BTC dived to was 17,500$ do you still think we are going below 13,000$? If yes please explain.2. Does it matter if you build a crypto portfolio at 15k per BTC or 10k per BTC.3. In 2020 covid was the reason why BTC crumbled to 3,500$ what will happen in 2023 that will bring the same deep dive to crypto market. 4. Crypto keeps looking stronger every year, it's getting more recognised and big players of the world are saying BTC is a better store of value than the dollar for long term, are they right.1. Expect for the worst, Bitcoin might continue to aim for the bottom as long as the world economy is still down, Bitcoin is following the trend a d a price of $13k is possible so stay cautious. 2. Build your portfolio now that is composed of many good coins and good projects, don’f wait for that level because there’s still no assurance that we will hit that kind of bottom.3. 2023 can be a bullish year because we are already experiencing bear market and usually it didn’t last longer so I’m optimistic that in 2023, the bottom will he above $25k. 4. Store of value probably yes, but because of its volatility I don’t think its ideal to depend on this that much, better to stay in profit always.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitDane",
      "created_time": "September 18, 2022, 10:36:06 PM",
      "body": "The cryptocurrency market is unpredictable.  The opposite always happen when we are so sure about the next trend.  Aside from that, even the most expert in TA is shamed by the cryptocurrency market so saying some figures that may happen in the future is just speculation and personal guesses.  So I think instead of making a problem of what will happen in the future, it is better to take advantage of the current market event and decide on what we think the future of the market will be.  It is better to act now and buy BTC while it is cheap than stuck on thinking about things to happen when it is clearly unpredictable but one thing is certain, BTC will surge!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "September 18, 2022, 10:57:00 PM",
      "body": "Quote from: Crypt0Gore on September 18, 2022, 06:56:51 AM1. The minimum deep that BTC dived to was 17,500$ do you still think we are going below 13,000$? If yes please explain.IMO, it will not drop further beyond $15k, though Bitcoin now has been struggling to increase the price I believed it will not down too much this year.  As we noticed the adoption has been widely spread and not only that, some countries started legalizing Bitcoin.  So possible there's an increase and this time we're on the correction stage that might possibly will trigger to become pump after this year. Quote2. Does it matter if you build a crypto portfolio at 15k per BTC or 10k per BTC.Price doesn't matter at all, if you invested at the $20k price range, never sell under that price, because if the price falls down and you have 1 Bitcoin, it will remain 1 Bitcoin and nothing will be a loss, not unless if you sell at the lowest price from where you purchase. Quote3. In 2020 covid was the reason why BTC crumbled to 3,500$ what will happen in 2023 that will bring the same deep dive to crypto market.This isn't true, during that time, Bitcoin wasn't affected by covid-19.Though we know that Bitcoin price is unpredictable and for sure there's also no infinite growth but I believed new ATH will always come, just wait for it. Quote4. Crypto keeps looking stronger every year, it's getting more recognised and big players of the world are saying BTC is a better store of value than the dollar for long term, are they right.Then at least you open your eyes here, it's indeed holding a long term will be the best way to make a profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "budi691",
      "created_time": "September 19, 2022, 02:37:18 AM",
      "body": "Taking care of your portfolio is very important if you want to make things better for the future, don't think too much about the Bitcoin price drop, the cryptocurrency market is volatile and unpredictable for now, so enjoy a cup of coffee while looking at your portfolio,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "len01",
      "created_time": "September 19, 2022, 05:58:36 AM",
      "body": "Quote from: Crypt0Gore on September 18, 2022, 06:56:51 AM1. The minimum deep that BTC dived to was 17,500$ do you still think we are going below 13,000$? If yes please explain.2. Does it matter if you build a crypto portfolio at 15k per BTC or 10k per BTC.3. In 2020 covid was the reason why BTC crumbled to 3,500$ what will happen in 2023 that will bring the same deep dive to crypto market. 4. Crypto keeps looking stronger every year, it's getting more recognised and big players of the world are saying BTC is a better store of value than the dollar for long term, are they right.no one will ever know what will happen to the future of bitcoin. you said in 2020 when covid hit the bitcoin dump reached the price of $3500 and who would have thought if in 2021 when covid was still attacking in several countries and actually bitcoin pumped up to $60k. everyone did not expect the price of bitcoin to reach 60k and no one could predict all of that because the cryptocurrency market is very volatile and predictions are not necessarily accurate, only estimates.but investing in bitcoin is quite promising after several years of breaking records the value is always high, not a promise but real evidence",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "September 19, 2022, 06:18:40 AM",
      "body": "Quote from: Crypt0Gore on September 18, 2022, 06:56:51 AM1. The minimum deep that BTC dived to was 17,500$ do you still think we are going below 13,000$? If yes please explain.2. Does it matter if you build a crypto portfolio at 15k per BTC or 10k per BTC.3. In 2020 covid was the reason why BTC crumbled to 3,500$ what will happen in 2023 that will bring the same deep dive to crypto market. 4. Crypto keeps looking stronger every year, it's getting more recognised and big players of the world are saying BTC is a better store of value than the dollar for long term, are they right.1. I think there's a possibility for this to happen as the war at Ukraine is still going on and we may get another war starting during the next years.2. It doesn't matter start your portfolio at whatever price you like, but do it.3. Yes it was, the stock market had a very strong drop and then the market of cryptocurrencies followed because of the panic created by the pandemic and the effects of it which were unknown at the time.4, Yes, bitcoin is a better store of value than the dollar, but you need to give it enough time to work its magic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}