{
  "id": "topic_5401509",
  "title": "OUTERDEFi",
  "author": "OUTERDEFi",
  "created_time": "June 06, 2022, 02:06:08 AM",
  "content": "Hello everyone,My name is Danny and I have recently created a buyback merchandise store. But before I go into that I must say that I really prefer this forum over Reddit. I have only spent a few minutes here, but the discussions that I have seen are so much more unique and I have learned so much more because of it. So I just want to say thank you! Now, as previously stated, I have created a buyback merchandise store. Now what does that mean? For every product that is purchased OUTERDEFi will allocate a certain percentage back to the projects themselves (at the moment we have received both direct and indirect permission from eighteen projects). For instance, if you purchase a bitcoin t-shirt, a percent will be allocated back to bitcoin and it will forever be locked up. As of this moment we have over 200 products and in the near future we will make it so that you can pay with various cryptocurrencies and possibly the only true cryptocurrency, bitcoin. Thank you very much if you have read this in its entirety. Check it out here: https://outerdefi.com/I hope you all have a wonderful day!Feel free to ask me any questions!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401509",
  "comments": [
    {
      "author": "bmwister",
      "created_time": "June 06, 2022, 04:55:46 PM",
      "body": "What is a reverse report on the site?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OUTERDEFi",
      "created_time": "June 06, 2022, 08:02:40 PM",
      "body": "I don't know either. Could you possibly elaborate? Thanks!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mbitr",
      "created_time": "June 06, 2022, 09:01:22 PM",
      "body": "Can u explain the “buy back” system a bit better?Quote - “if you purchase a bitcoin t-shirt, a percent will be allocated back to bitcoin and it will forever be locked up.”I’m a bit confused - if it’s locked up forever - it’s gone ! Might as well make the sales item  cheaper ? For example - Can’t see the point of buying an item for $11 and throwing away $1 - just sell it for $10 ?Sorry if I’m a bit confused on this premise .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OUTERDEFi",
      "created_time": "June 06, 2022, 11:36:29 PM",
      "body": "I understand, I should have clarified. Great question though! So our stores prices are comparable/same/cheaper to that of other stores and they don't allocate a percent of the gross profits back to each individual project. If we allocate a certain percent and lock it up (meaning we will never sell whatever cryptocurrency that it may be) what it does is essentially increase buy pressure. It is the theory of supply/demand right? If demand increases and supply remains constant, then the price should increase. Who wouldn't want the price of bitcoin or Rune or XRP to have added buy pressure while also get their merchandise at the same or cheaper or comparable price? Really love the question! Hopefully that answers your question and if it doesn't, feel free to keep messaging me on this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}