{
  "id": "topic_5466515",
  "title": "Oshosondy",
  "author": "Oshosondy",
  "created_time": "September 12, 2023, 11:12:08 AM",
  "content": "Two days ago, I opened a position with a very risky volatile coin at some minutes to its funding rate fee, the coin was having -1.98% funding rate fee. You can see how risky that is which I can not call trading but gambling. After I opened a long position, luckily I was able to have unrealized PnL of $67, but it was just some seconds remaining to another 8 hours funding rate time to start counting down. I waited and all that I noticed in less than a second after the next eight hours began was that the $67 profit that was seen suddenly droped to $4.I was paid the funding fee which made me to make almost $60 in total. I mean the profit from trading is around $3 if trading fee has been deducted while the remain profit was from funding fee. I noticed that traders are using the funding fee to manipulate the market, although we can not call it manipulation too because they want to make profit, but they can also lose. That is trading. If you are trading these less volatile coins with high funding fee, you will noticed what that I am talking about. Are you using funding fee to make money from the derivative market? If so, what is the most possible way have you used it to make money successfully or it is not actually working?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466515",
  "comments": [
    {
      "author": "logfiles",
      "created_time": "September 12, 2023, 08:57:41 PM",
      "body": "Trying to make money out of the funding fee is more of gambling IMO because 1. It's dynamic2. The market can either go against your position or not.Just the other day some trader was complaining about how rampant the funding fee was for the shitcoin perpetuals on MEXC. This is one of the reasons I don't even want to trade on MEXC. It is complete chaos over there, with very volatile shitcoin going for as high as 200X with barely any liquidity. Now who provides the liquidity? I still feel as though at times, traders could be trading against the exchange unknowingly and the exchange will always make sure they win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "September 13, 2023, 01:37:01 AM",
      "body": "There is actually a thread that discussed about Funding fees and I already talked about it but i forget when  and yes you can actually make a profit by harvesting the funding fee but your eyes need to stick to the monitor to see how the price is moving. and usually, the price tends to move against the funding rate. So when the funding rate is big positive like 5% and the countdown rate is less than 30~20 minutes you can actually see that the price is head to down because there are lot of people shorting position and when the funding rate is restarted price back to normal and vice versa. and from that, you can gain profit like you said but funding fee farming is not happening every day you can actually check the funding rate here https://www.binance.com/en/futures/funding-history/perpetual/real-time-funding-rate is real-time",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "September 13, 2023, 03:34:57 PM",
      "body": "Hmm, well Op you've reflected on a very important topic for perpetual futures contract traders, I never used to endorse perpetual futures contract trading for a particular set of reasons, To guide newbies, so they can be emotionally stronger with the spot market and religious factor as well. Still on the basis of my own knowledge, OP, funding rate harvesting is purely based on the Balancing Mechanism and funding Fee payouts. As per your case in the Long position, the funding fee pouts were (Long pays to Short), as per your Unrealized PNL was 67$ before the funding fee payouts, and due to the volatile market and periodical adjustment (Fee payout), you've charged for the 60$ funding fees, but what you've noticed that traders are using funding rate to manipulate the market, in this case, I won't say they are manipulating the market they are doing the \"funding rate arbitrage\", most of the people don't really prefer this strategy as you also consider it's not trading (Gambling) particularly if we take a close look to the risk management.In perpetual futures contract trading, traders never neglect risk management; however, for position traders focused on maximizing profit, the approach can sometimes lead to the elimination of risk management, thereby revealing motives driven by greed, reminiscent of gambling. Making money from the funding rate harvesting in the derivative market involves the 99% figured potential risk so, better avoid it (As I do  ) and prefer a decent trading mode free of greed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "September 15, 2023, 10:52:50 AM",
      "body": "Quote from: Oshosondy on September 12, 2023, 11:12:08 AMIf so, what is the most possible way have you used it to make money successfully or it is not actually working?I would go with funding arbitrage strategy. If longs pay shorts, you go short on futures (use as little leverage as possible to make sure you wont be liquidated) and at the same time you buy on spot with the same position size. You are net 0, so you are not exposed to currency risk (as long as you will not get liquidated) but you earn on funding and price spread (very often when there is a big funding there is also big price spread)You can also compare funding on different exchanges. For example if funding on binance is -1.5% and -0.8% on bybit, you can go long on binance (to get 1.5%) and short on bybit (you pay 0.8%). your position is net zero, but you get 0.7% from funding spread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "September 15, 2023, 04:56:04 PM",
      "body": "Quote from: Oshosondy on September 12, 2023, 11:12:08 AMTwo days ago, I opened a position with a very risky volatile coin at some minutes to its funding rate fee, the coin was having -1.98% funding rate fee. You can see how risky that is which I can not call trading but gambling. Maybe we should know this and understand the rest part of it all that when we are trading bitcoin, we are on a low level risk but when we invest to trade on other coins, we are gambling   to me which is far higher than taking risk itself, maybe it's also an avenue for you to learn and prepare yourself more better for the future, if we are investing, we should use the rate we can afford to loose especially when on altcoins, their trading could loose position at anytime and the value can go down completely before we realized we made a wrong pair for our trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "usekevin",
      "created_time": "September 15, 2023, 07:06:57 PM",
      "body": "Quote from: logfiles on September 12, 2023, 08:57:41 PMTrying to make money out of the funding fee is more of gambling IMO because 1. It's dynamic2. The market can either go against your position or not.Just the other day some trader was complaining about how rampant the funding fee was for the shitcoin perpetuals on MEXC. This is one of the reasons I don't even want to trade on MEXC. It is complete chaos over there, with very volatile shitcoin going for as high as 200X with barely any liquidity. Now who provides the liquidity? I still feel as though at times, traders could be trading against the exchange unknowingly and the exchange will always make sure they win.Instead of doing the future trading,you can directly do the gambling.So you analysis and understand their is the probability of loss in the gambling.But in future trading,you never understand the fact you may lose the entire amount.If the market is totally against the prediction,then all the money you staked and the money you keep for liquidity will be the loss.The trader in this field over decade will have a try of the future trading once in their life time.With my experience and my friends experience most of the people had loss their money at the last.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "September 15, 2023, 11:25:55 PM",
      "body": "Quote from: usekevin on September 15, 2023, 07:06:57 PMInstead of doing the future trading,you can directly do the gambling.So you analysis and understand their is the probability of loss in the gambling.Not worth itQuote from: usekevin on September 15, 2023, 07:06:57 PMBut in future trading,you never understand the fact you may lose the entire amount.If the market is totally against the prediction,then all the money you staked and the money you keep for liquidity will be the loss.The trader in this field over decade will have a try of the future trading once in their life time.With my experience and my friends experience most of the people had loss their money at the last.Of course, you are not going to win all the trades. This is where risk management comes in, and I put risk management far in front of almost anything in trading. When you are gambling, it's hard to have a proper risk management plan because you don't even know what you are doing. You are simply at the mercy of the funding rate or probability.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "September 16, 2023, 04:52:55 AM",
      "body": "I played around with this in the past. There is no real way to profit here. When you are entering a trade like that it means that there are massive shorts and it can go against you alot before there is a short squeeze. So depending how early you enter can put you in massive negative PnL.You got lucky but usually you would collect the fee and the trade would start to go against you. Some people close their position right after the funding fee. So seconds after you would see a dip since longs close.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beerwizzard",
      "created_time": "September 18, 2023, 07:25:42 AM",
      "body": "Funding rate is one of the coolest thing when it comes to searching for upcoming pumps. But you need to use it in combination with another forms of analysis.Basically, highly negative funding is indicating the high sell pressure at the moment and since the price is not going down then some market maker is keeping the price in a certain range. It happens once the price of some coin is going up, some traders are catching a falling knife and go short. Then, their stop losses liquidations are becoming fuel for upside to continue which is used by the market maker. It often works like this with the middle tier altcoins and you need to control your RR ratio in such trades.Another tip is that you may check if the team of some particular coin got a partnership with some marker maker and you may check the MM's portfolio. There you may easily find their typical pump patterns and try to find a coin for upcoming pump. This worked pretty good on DWF Labs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "September 18, 2023, 09:32:21 PM",
      "body": "Quote from: Beerwizzard on September 18, 2023, 07:25:42 AMFunding rate is one of the coolest thing when it comes to searching for upcoming pumps. But you need to use it in combination with another forms of analysis.Basically, highly negative funding is indicating the high sell pressure at the moment and since the price is not going down then some market maker is keeping the price in a certain range. It happens once the price of some coin is going up, some traders are catching a falling knife and go short. Then, their stop losses liquidations are becoming fuel for upside to continue which is used by the market maker. It often works like this with the middle tier altcoins and you need to control your RR ratio in such trades.I get your point, that is not easy, though. Maybe you can pull this off on a spot market with a stop loss that is not tight but with futures chances of hitting a stop loss or liquidation are high. Coins with abnormal funding rates tend to become very volatile, as some market players have found away of manipulating the market to gain advantage through the funding rate.A very good example is TRB. I have been following it for quite some time. Every time the funding rate is up the roof we have huge swings in both sides sweeping up some liquidity especially towards or shortly after the 8-hourly funding fee interval",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beerwizzard",
      "created_time": "September 19, 2023, 08:52:48 AM",
      "body": "Quote from: logfiles on September 18, 2023, 09:32:21 PMI get your point, that is not easy, though. Maybe you can pull this off on a spot market with a stop loss that is not tight but with futures chances of hitting a stop loss or liquidation are high. Coins with abnormal funding rates tend to become very volatile, as some market players have found away of manipulating the market to gain advantage through the funding rate.A very good example is TRB. I have been following it for quite some time. Every time the funding rate is up the roof we have huge swings in both sides sweeping up some liquidity especially towards or shortly after the 8-hourly funding fee intervalI agree. Market is manipulative and generally, it all is about guessing the market maker's actions. This is obvious pretty risky and you need control your potential losses. But there is not so much to do during the flat market rather than researching the pumps Regarding TRB, the overall uptrend was not broken. Setting SL beyond previous lows could help.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "September 19, 2023, 11:57:16 PM",
      "body": "Quote from: Beerwizzard on September 19, 2023, 08:52:48 AMRegarding TRB, the overall uptrend was not broken. Setting SL beyond previous lows could help.Depends on the time frame the trader used and whether it was spot or derivatives. Entering a position with a safer SL would mean one would have to do it much earlier, way before the funding rates became abnormally high/low.People still got REKT on shorter timeframes and futures basing on the liquidations data.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "September 20, 2023, 02:15:09 AM",
      "body": "Quote from: Oshosondy on September 12, 2023, 11:12:08 AMI noticed that traders are using the funding fee to manipulate the market, although we can not call it manipulation too because they want to make profit, but they can also lose. That is trading. If you are trading these less volatile coins with high funding fee, you will noticed what that I am talking about. To manipulate the market, market makers use more tools than funding rate. I consider funding rate as one of consequences of market manipulations. It is not a cause of market manipulation but it is one of results from manipulation.Funding rate is like supply and demand of amateur traders with loan in the market. It shows their demand and sentiment, greed or fear. You can look at funding rate to guess the market sentiment but it is not enough to have an overview of the market. Funding rate, trading volume, zoom out the chart to see a general trend of the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beerwizzard",
      "created_time": "September 20, 2023, 08:36:23 AM",
      "body": "Quote from: logfiles on September 19, 2023, 11:57:16 PMQuote from: Beerwizzard on September 19, 2023, 08:52:48 AMRegarding TRB, the overall uptrend was not broken. Setting SL beyond previous lows could help.Depends on the time frame the trader used and whether it was spot or derivatives. Entering a position with a safer SL would mean one would have to do it much earlier, way before the funding rates became abnormally high/low.People still got REKT on shorter timeframes and futures basing on the liquidations data.Indeed. It is pretty hard to catch the funding if you targeting only on funding. This is more like an instrument that helps to find the upcoming pump and a juicy reward for the ones who hold a long position for the majority of the pump which can be up for up to a week.You need to see the whole market picture and not focus on funding only.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "September 21, 2023, 04:10:27 AM",
      "body": "Regarding the TRB which was posted above, look at how much higher it went when the funding rate was already peaked. Basically people shorting which got squeezed. Looks amazing doesn’t it but how do you apply it to make a profit? You really can’t.It kept squeezing and squeezing and squeezing, when would you enter a short? Or when would you enter a long? Both would of been difficult to time. So the funding rate helps but it’s not the entire picture. Maybe use technical analysis to help you on when to enter the trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "September 21, 2023, 04:55:52 AM",
      "body": "I agree that these type of things are quite risky, if you are insisting that you want to do this then you can do it, that's your own deal and your own money so you are free to do this, but nothing would make me do something like this personally, probably because I do not trust the market enough. No matter how good it looks, I will always consider that as a big risk and there is no need for that at all.I personally would rather have something that would be a bit more different in the end. I know that these type of things are done by a lot of people but I am not one of those people because of the risk OP basically talked about. He literally talks about the big risk, which is why I rather not do it at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "September 21, 2023, 07:03:06 AM",
      "body": "Quote from: el kaka22 on September 21, 2023, 04:55:52 AMI personally would rather have something that would be a bit more different in the end. I know that these type of things are done by a lot of people but I am not one of those people because of the risk OP basically talked about. He literally talks about the big risk, which is why I rather not do it at all.I agree. We must be flexible with our actions that serve the ultimate goal, protecting our capital first. Profit from trading, profit from funding rate are all not important. They are second or third or lower important thing when we are trading. Profit is good, we all want to get profit but if we only think of profit, and forget about our initial capital, it's wrong, risky and can cause serious loss.Quote from: adaseb on September 21, 2023, 04:10:27 AMRegarding the TRB which was posted above, look at how much higher it went when the funding rate was already peaked. Basically people shorting which got squeezed. Looks amazing doesn’t it but how do you apply it to make a profit? You really can’t.It kept squeezing and squeezing and squeezing, when would you enter a short? Or when would you enter a long? Both would of been difficult to time. So the funding rate helps but it’s not the entire picture. Maybe use technical analysis to help you on when to enter the trade.Funding rate is derivative profit or loss for our trading. Our focus should be closing our position when we feel no longer safe as market shows dangerous signals. Exit it and if luckily enough, to gain small profit from funding rate, we can take it. But if we open our trading positions because of funding rate, because we think it can help us to get profit, it's very risky.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "September 21, 2023, 06:08:17 PM",
      "body": "Quote from: OcTradism on September 21, 2023, 07:03:06 AMQuote from: adaseb on September 21, 2023, 04:10:27 AMRegarding the TRB which was posted above, look at how much higher it went when the funding rate was already peaked. Basically people shorting which got squeezed. Looks amazing doesn’t it but how do you apply it to make a profit? You really can’t.It kept squeezing and squeezing and squeezing, when would you enter a short? Or when would you enter a long? Both would of been difficult to time. So the funding rate helps but it’s not the entire picture. Maybe use technical analysis to help you on when to enter the trade.Funding rate is derivative profit or loss for our trading. Our focus should be closing our position when we feel no longer safe as market shows dangerous signals. Exit it and if luckily enough, to gain small profit from funding rate, we can take it. But if we open our trading positions because of funding rate, because we think it can help us to get profit, it's very risky.Indeed. We must not rely our trade in funding rate because it's not guarantee that you will always win. If we rely with funding rate but the market sentiment is declining, funding rate can't stop it. Maybe the best way to do is to use this as confluence in our strategy. However, if he is profitable already with the funding rate tactics I think he should continue doing that, because even traders who had the best strategy got from his mentor will also fail. So keep doing what makes you profitable because that is the main reason why we are here in trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "September 21, 2023, 10:49:40 PM",
      "body": "Quote from: adaseb on September 21, 2023, 04:10:27 AMRegarding the TRB which was posted above, look at how much higher it went when the funding rate was already peaked. Basically people shorting which got squeezed. Looks amazing doesn’t it but how do you apply it to make a profit? You really can’t.It kept squeezing and squeezing and squeezing, when would you enter a short? Or when would you enter a long? Both would of been difficult to time. So the funding rate helps but it’s not the entire picture. Maybe use technical analysis to help you on when to enter the trade.From what I discovered some people, perhaps with the help of bots or high frequency trading, have a chance of getting some profit out of funding rate by arbitraging across different exchanges where the funding rates are different. The task is to look for token perpetual contracts who funding rates have gone wild.For example, at one point the funding rate in binance would consistently be as low as -2.5% across different hours while on bybit it would somewhere more than -2% (Like -1.5%). Every time the funding minute passed, there would be an immediate shorting spree leading to a long red 1 minute candle (since people would now enter short positions without worrying about getting taxed that funding fee, at least for the next 8 hours) and then shortly the price would spike back upwards.The logic would be to open a short position in Bybit (shortly before the fund minute) and open a long position on Binance at the same time, using the similar margin. 1. if the price went down in that minute, the short position in bybit would be in profit, but would have a hefty 1.5% funding fee deducted from it. The long position in Binance would be in a loss, but have that 2.5% funding fee added to it. Both the take profit and stop loss which have to be similar cancel out. The difference which is 1% from the fund fees would be the profit.2. If the price went up in that minute, the long position in Binance would be in profit and also have an additional 2.5% funding fee added to it and the same logic about TP and SL would apply here",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}