{
  "id": "topic_5434251",
  "title": "flipme",
  "author": "flipme",
  "created_time": "January 11, 2023, 05:56:36 PM",
  "content": "QuoteNepal‘in telekomünikasyon düzenleyicisi, ülkenin internet servis sağlayıcılarına (İSS) tüm kripto para ticareti web sitelerini engelleme emri verdi ve uymayanlara karşı yasal işlem tehdidinde bulundu.https://www.btchaber.com/nepalden-kripto-sitelerine-engel/Nepal küçük bir ülke ama Çin'in komşusu ve Çin'den etkilenmişe benziyor. Çünkü aynı bahanelerin ardına sıralanmışlar. Bitcoin'in kara para aklama, yolsuzluk ve finansal güvensizlik gibi konularda suça açık bir yapıya sahip olduğunu belirtmişler. Bu bahanelerin itibari para birimleriyle de işlenebilecek suçlar olduğunu ve Nepal'in de tıpkı Çin gibi finansal sistem üzerindeki kontrolünü kaybetmek istemediğini hepimiz biliyoruz. Nepal küçük bir ülke olduğu için kriptopara sitelerini engellemesini önemsiz buluyorum ama Çin'den sonra bu kadar geniş kapsamlı bir yasak uygulayan ikinci ülke oldukları için bir domino etkisi oluşturmalarından endişe duyuyorum.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434251",
  "comments": [
    {
      "author": "bobita",
      "created_time": "January 11, 2023, 10:01:55 PM",
      "body": "Bir çok kültürün arasında sıkışmış, çok bilinmese de içi karışık, halkın büyük çoğunluğu yoksul (ama tanrıdan yana zenginler, yaklaşık 33 milyon tanrıları var ve ülke nüfusundan daha fazla demek oluyor), yolsuzluğun dörtnala gittiği bir koçan cumhuriyeti (muz bile diyemedim). Böyle yerlerdeki yasakların arkasında genellikle duygusal nedenler(!) vardır ve o incinen duygular doyurulunca işler düzelir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "January 12, 2023, 07:48:07 AM",
      "body": "Asya toplumlari maalesef cok icine kapanik oluyorlar. Izole olmak adamlarda adeta kulturel bir seye donusmus. Bence buyuk yanlis yapiyorlar cunku gelisim icin disaridan gelen teknolojiye acik olmakta fayda vardir. Ben ileride bu kararlardan pisman olacaklarini ve geri doneceklerini dusunuyorum. Bitcoin talebi asla bitmez cunku turku faydasi var hepimiz icin. Cinliler devlete biraz olsun baski yapabilse bence Cin de geri adim atabilir. Nepalliler icin uzgunum. Turkiye iyi ki ayni yola sapmadi diye dusunuyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}