{
  "id": "topic_5429817",
  "title": "Mustang Shelby",
  "author": "Mustang Shelby",
  "created_time": "December 17, 2022, 07:36:35 PM",
  "content": "İşte yıllardır düşündüğüm şeylerden birisini hayata geçiren bir çalışma. Her zaman bu oyunun sinematik kısımlarının ne kadar mükemmel olduğunu düşünüp bir dizi film neden yapılmadığını sorgulardım. Amazon Prime God Of War dizisini çekmeye hazırlanıyor. Tarihi net değil ancak bir süre sonra piyasaya çıkacağı kesin. Kratos’un hayatını izlemek için sabırsızlanan kaç kişiyiz arkadaşlar? Kaynak https://www.webtekno.com/haber/amp/124176",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5429817",
  "comments": [
    {
      "author": "ILuckyGuyI",
      "created_time": "December 17, 2022, 09:31:19 PM",
      "body": "Ben bu haberi Twitter'da Prime Video'nun resmi profilinden okuduğumda çok heyecanlandım açıkçası.  Çünkü God of War'ın tam anlamıyla hastasıyım diyebilirim. Şu ana kadar çıkmış olan tüm oyunları (GoW Ragnarok hariç) oynamış bulunmaktayım. Hikaye anlatımı çok başarılı bir seri kesinlikle. Hatta en son çıkan oyununun Game Awards'ta ödül aldığı dallardan birisi de hikaye anlatımıydı. Dizisinin çıkacağını duymak ve hatta oyunun kendi yönetmeninin dizinin başında olacağını öğrenmek benim çok ilgimi çekti. Amazon Yüzüklerin Efendisi dizisiyle beklentileri boşa çıkarsa da bu diziyle artı puan kazanabilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mustang Shelby",
      "created_time": "December 17, 2022, 09:55:31 PM",
      "body": "Quote from: ILuckyGuyI on December 17, 2022, 09:31:19 PMBen bu haberi Twitter'da Prime Video'nun resmi profilinden okuduğumda çok heyecanlandım açıkçası.  Çünkü God of War'ın tam anlamıyla hastasıyım diyebilirim. Şu ana kadar çıkmış olan tüm oyunları (GoW Ragnarok hariç) oynamış bulunmaktayım. Hikaye anlatımı çok başarılı bir seri kesinlikle. Hatta en son çıkan oyununun Game Awards'ta ödül aldığı dallardan birisi de hikaye anlatımıydı. Dizisinin çıkacağını duymak ve hatta oyunun kendi yönetmeninin dizinin başında olacağını öğrenmek benim çok ilgimi çekti. Amazon Yüzüklerin Efendisi dizisiyle beklentileri boşa çıkarsa da bu diziyle artı puan kazanabilir.God of War oynayan başkalarının olduğunu bilmek güzel. Gerçekten Sony’nin açık ara en iyi oyunu. Nasıl ki Nintendo Mario ile özdeşleşmişse Sony Playstation için de God of War öyle bir oyun oldu. Hayranlıkla oynadığımız zamanlar PS2 zamanlarıydı. Dizisi için takipteyim umarım çabuk çekilir hocam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "December 17, 2022, 11:18:22 PM",
      "body": "God of War oyunların efsanelerinden biridir. Hikayesiyle başlı başına en iyi filmlerle, dizilerle yarışır. Yan karakterler için diziler yapılmaya başlansa bile sonu gelmeyebilir. Bu kadar çok öğesi varken dizisini yapmak bir hayli zor olabilir. Yine de bir efsaneyi izleyebilirsek ilk oyunundan bugüne hatıralarımız canlanabilir. Tüm serilerini biliyorum. Ragnarok'u oynama fırsatım olmadı ama oynayan bir youtuber'dan tüm oyunu izledim ve bitirdim. En son Warcraft'ın filmi çıktığında böyle sevinmiştim. Film de hiç kötü değildi gayet yerli yerinde bir film olmuştu. Sevdiğimiz serilerin dizilerini ve filmlerini görmek güzel oluyor. Merakla bekliyorum. Playstation kafelerinde gecesini gündüzüne katıp God of War oynayanların yorumlarını bekliyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "December 18, 2022, 08:57:08 AM",
      "body": "Yıllardır en sevdiğim oyun kategorisinde zirvede yer alan oyundur kratos karakteri mükemmel bir karakter olmuştur ve oyunu oynadığınızda oyun size o anı resmen yaşatıyor tabii ben son oyunları oynayamadım dizisini de izlemeyi düşünürüm ayda 7.90 a adamlar süper hizmet yapıyor vallaha alanında tek amazon prime",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "December 18, 2022, 01:35:31 PM",
      "body": "God of War severim sevmesine Kratos karakterini biliyorum. Oyunu hiç oynamadım, bir kaç kere youtube,twitch gibi alanlarda denk gelmişimdir. Oyun olarak daha çok rekabet seviyesi yüksek oyunları seviyorum, hikaye üzerin kurgulanan oyunlar uykumu getiriyorlar. Dizisi olursa kaçırmam Witcher dizisini de netflixte severek izlemiştim. Amazon verdiğimiz ücrete karşı aldığımız hizmet harika çok fazla içerik yok ama bir kaç tane hafızamda yer edinen dizi izlettirdi bana.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pulsar77",
      "created_time": "December 18, 2022, 09:32:45 PM",
      "body": "God of War gibi bir oyunun harika hikayesini umarım en efektif şekilde kullanırlar. Oyundan birileri yapım aşamasında yer aldığı sürece benim güven seviyem yüksek olacak. Amazon yaptığı her işte başarılı olmasa bile şu ana kadar başarılı çok yapımını da gördüm. Böyle büyük sorumluluk gerektiren yapımlarda kötü nam salmamak için God of War dizisine olabildiğince fazla önem göstermeliler.Kratos'u kim oynayacak çok merak ediyorum. Umarım yine sırf ırkçılığa karşı durmak vs. diyip siyahi birini oynatmazlar. Ben açıkçası orjinal esere ne kadar yakın olursa o kadar keyif verir diye düşünüyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "December 19, 2022, 08:11:59 AM",
      "body": "God of War, çıkmış en iyi oyunlardan birisi. Bir çok oyun oynamama rağmen özellikle PS2 ve 3’te en iyi oyun bana göre net GOW’du. Witcher gibi kaliteli bir yapım olmasını umuyorum. Tanrılar ile olan savaşının birisi bir sezona yayılabilir bence. Hades ile dövüşünden tutun Zeus’a kadar mitolojik çok iyi bir dizi bizi bekliyor. İnşallah karşılığını verebilecekleri güzel bir dizi olur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "December 20, 2022, 10:02:35 AM",
      "body": "Severek oynadığım bir oyundu, şimdi severek izleyeceğim bir dizi olacak sanırım, bakalım Kratos’u kim canlandıracak, saçı olmayan bir sürü ünlü oyuncu var aklıma ilk gelen Dwayne Johnson oldu, bu kadar iri yarı görünmüyor ama bir şekilde kılıfına uydururlar bence, güzel dizi olacak ben heyecanla bekliyorum,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "December 20, 2022, 10:16:59 AM",
      "body": "Quote from: kriminall on December 20, 2022, 10:02:35 AMSeverek oynadığım bir oyundu, şimdi severek izleyeceğim bir dizi olacak sanırım, bakalım Kratos’u kim canlandıracak, saçı olmayan bir sürü ünlü oyuncu var aklıma ilk gelen Dwayne Johnson oldu, bu kadar iri yarı görünmüyor ama bir şekilde kılıfına uydururlar bence, güzel dizi olacak ben heyecanla bekliyorum, Dwayne Johnson hiç ama hiç Kratosu canlandıracak fiziksel özelliklerde değil. Dwayne Johnson, Kratos karakterinin en az iki katı kadar büyüktür daha atletik bir oyuncu olması gerekiyor. Ayrıca Johnsonda Kratos yüzü de yok bana kalırsa daha sert bir mizaç olması lazım kim canlandıracaksa. Travis Fimmel olabilir diye düşündüm. Jason Statham da olabilir aslında bakalım kim oynayacak bende çok merak ediyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "December 20, 2022, 10:28:53 AM",
      "body": "Quote from: SUPERSAIAN on December 20, 2022, 10:16:59 AMQuote from: kriminall on December 20, 2022, 10:02:35 AMSeverek oynadığım bir oyundu, şimdi severek izleyeceğim bir dizi olacak sanırım, bakalım Kratos’u kim canlandıracak, saçı olmayan bir sürü ünlü oyuncu var aklıma ilk gelen Dwayne Johnson oldu, bu kadar iri yarı görünmüyor ama bir şekilde kılıfına uydururlar bence, güzel dizi olacak ben heyecanla bekliyorum, Dwayne Johnson hiç ama hiç Kratosu canlandıracak fiziksel özelliklerde değil. Dwayne Johnson, Kratos karakterinin en az iki katı kadar büyüktür daha atletik bir oyuncu olması gerekiyor. Ayrıca Johnsonda Kratos yüzü de yok bana kalırsa daha sert bir mizaç olması lazım kim canlandıracaksa. Travis Fimmel olabilir diye düşündüm. Jason Statham da olabilir aslında bakalım kim oynayacak bende çok merak ediyorum.Biliyorum hocam, bana da öyle geldi de sonuçta tanrıları öldürecek bir kahramandan bahsedince böyle heybetli göstermek için onu belki diziye koyabilirler diye düşündüm, yoksa benim aklıma gelen ilk isim Jason Statham’dı, bakalım belki de başka bir yıldızı bu diziyle birlikte tanıyacağız belli mi olur, mimikleri çok sert olmalı, bu karakter yüzünde tebessüm bile olmayan bir karakter,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "velbet",
      "created_time": "December 22, 2022, 08:50:13 AM",
      "body": "Umarım süre kısıtlamalarından dolayı hikayeyi kesip biçmezler. Çoğu oyundan ya da kitaptan aktarımda filmin-dizinin içinden geçen olay detayların kesilmesi ve hikayenin havasında kalmasına neden oluyor. Umarım buna dikkat ederler. Oyununu oynayamasam da hikayelerini hep açıp izlerim. İçine çeken bir hikayesi var kesinlikle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "W Jr.",
      "created_time": "December 22, 2022, 09:04:26 AM",
      "body": "Quote from: velbet on December 22, 2022, 08:50:13 AMUmarım süre kısıtlamalarından dolayı hikayeyi kesip biçmezler. Çoğu oyundan ya da kitaptan aktarımda filmin-dizinin içinden geçen olay detayların kesilmesi ve hikayenin havasında kalmasına neden oluyor. Umarım buna dikkat ederler. Oyununu oynayamasam da hikayelerini hep açıp izlerim. İçine çeken bir hikayesi var kesinlikle.Oyununu da oynayabilirsiniz hocam.Ben de bir dönem oyununu oynamıştım ve oyunda özellikle gizlenmiş-saklanmış eşya, kutu gibi nesneleri bulmak bayağı bir kafa patlatmaya sebep olmuştu.Şimdi dönüp bakıyorum da güzel bir oyun yapılmış ve hala dünya üzerinde büyük hayran kitleleri oluşmuş.Bir de kitap uyarlaması filmlerin çoğunda eksiklikler oluyor.Harry Potter’da da olmuştu, Yüzüklerin efendisinde de.Bu yüzden God of War’da umarım böyle eksiklikler olmaz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "velbet",
      "created_time": "December 22, 2022, 10:41:13 AM",
      "body": "Quote from: W Jr. on December 22, 2022, 09:04:26 AMQuote from: velbet on December 22, 2022, 08:50:13 AMUmarım süre kısıtlamalarından dolayı hikayeyi kesip biçmezler. Çoğu oyundan ya da kitaptan aktarımda filmin-dizinin içinden geçen olay detayların kesilmesi ve hikayenin havasında kalmasına neden oluyor. Umarım buna dikkat ederler. Oyununu oynayamasam da hikayelerini hep açıp izlerim. İçine çeken bir hikayesi var kesinlikle.Oyununu da oynayabilirsiniz hocam.Ben de bir dönem oyununu oynamıştım ve oyunda özellikle gizlenmiş-saklanmış eşya, kutu gibi nesneleri bulmak bayağı bir kafa patlatmaya sebep olmuştu.Şimdi dönüp bakıyorum da güzel bir oyun yapılmış ve hala dünya üzerinde büyük hayran kitleleri oluşmuş.Bir de kitap uyarlaması filmlerin çoğunda eksiklikler oluyor.Harry Potter’da da olmuştu, Yüzüklerin efendisinde de.Bu yüzden God of War’da umarım böyle eksiklikler olmaz.Hocam konsolum yok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "emrecemsan",
      "created_time": "December 22, 2022, 09:38:07 PM",
      "body": "God of War'un yeni nesil iki oyunu mevcut birisi 2018'te çıktı ve bu sene de God of War Ragnarok adında yeni oyunu çıktı. Yeni çıkanı sadece konsolda var şimdilik ama 2018'te çıkmış olan oyununu PC'den de oynayabiliyorsunuz.Diziye gelince de Amazon tarafından yeni bir açıklama gelmiş. Oyununa tamamen sadık kalınacağı bir yapım geleceğini söylüyorlar. Ama keşke şu ana kadar diğer işlerde de orjinalliğe sadık kaldıklarını eklemeselermiş. Çünkü Yüzüklerin Efendisi'nin bölük pörçük hikayesini hatırladığımda gülesim geliyor.    Umarım bu sefer gerçekten özenli bir iş ortaya koyarlar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flipme",
      "created_time": "December 29, 2022, 08:53:16 PM",
      "body": "Quote from: SUPERSAIAN on December 20, 2022, 10:16:59 AMQuote from: kriminall on December 20, 2022, 10:02:35 AMSeverek oynadığım bir oyundu, şimdi severek izleyeceğim bir dizi olacak sanırım, bakalım Kratos’u kim canlandıracak, saçı olmayan bir sürü ünlü oyuncu var aklıma ilk gelen Dwayne Johnson oldu, bu kadar iri yarı görünmüyor ama bir şekilde kılıfına uydururlar bence, güzel dizi olacak ben heyecanla bekliyorum, Dwayne Johnson hiç ama hiç Kratosu canlandıracak fiziksel özelliklerde değil. Dwayne Johnson, Kratos karakterinin en az iki katı kadar büyüktür daha atletik bir oyuncu olması gerekiyor. Ayrıca Johnsonda Kratos yüzü de yok bana kalırsa daha sert bir mizaç olması lazım kim canlandıracaksa. Travis Fimmel olabilir diye düşündüm. Jason Statham da olabilir aslında bakalım kim oynayacak bende çok merak ediyorum.Kratos benim zihnimde de iri yarı bir karakter olarak yer edinmiş. Benim aklıma da ilk Dwayne Johnson geldi. Jason Statham da fena değil ama Travis Fimmel fiziksel olarak biraz zayıf gibi geldi. Oyun tamamen Kratos'un etrafında şekilleniyordu. Kratos'u canlandıracak karakter çok önemli. Doğru adayı seçemezlerse filmin tadı da bozulur. Bence önemli bir konu olacak onu canlandıracak kişinin seçimi. Oyun olarak gelmiş geçmiş en iyi oyunlardan biri. Hikayeleri ve grafikleri oyuncular tarafından hep tam not aldı. Çok sevildiği için oyun konsollarından sonra PC versiyonları da oluşturuldu. Filmi şimdiden bekleyen milyonlarca kişi olacaktır. Oyundan uyarlanmasının en büyük avantajı bu olacak. Ancak oyunu oynayan kişiler filmi çok fazla kritize edecek. Bu da filmin en büyük dezavantajı olacak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "January 04, 2023, 05:31:08 AM",
      "body": "iyi bir oyuncu değilim, pes dışında bir şey de oynamadım sayılır ama bana futbol dışında bir oyundan bahset deseler ilk olarak aklıma god of war gelir; gerçekten sinematik sahneleri harbiden efsaneydi ve aksiyon içeren bölümlerde oyuncudan seri kombolar isteyen oyun mekaniği çok iyiydi. akrabalarımdan aldığım ps2'de bulunan bir versiyonunu gece gündüz oynamışlığım vardır zamanında... evet, oyun hakkında yapabileceğim goygoy bu kadar ve god of war'ın harika bir oyun olduğu da tartışılmaz bir gerçek ama oyunlardan sinemaya aktarılan yapımların genelde başarısız olduğu da çok bilinen başka bir gerçek... mesela, mortal combat ya da street fighter veya varsa tekken veya king of fighters filmlerinden hangisi başarılı olmuş ki god of war'dan beklentimiz olsun...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}