{
  "id": "topic_5473155",
  "title": "K.G.F-2",
  "author": "K.G.F-2",
  "created_time": "November 07, 2023, 03:05:37 AM",
  "content": "Saya sudah lama ingin menghabiskan waktu dengan forum ini tetapi tidak bisa karena tekanan ekstra dalam studi saya. Tapi saya cukup bebas sekarang, walaupun saya hanya menghabiskan waktu singkat di forum bitcoin ini, jadi saya tidak punya banyak pengalaman, tapi saya akan segera bergabung dengan rekan-rekan saya dalam diskusi tentang bitcoin. Sehingga saya bisa mempelajari sesuatu tentang cryptocurrency dan mendapatkan pengetahuan sebagai pemula di masa depan. Tapi saya tidak bisa menghabiskan banyak waktu di forum ini sekarang, karena saya ada ujian masuk universitas sebentar lagi, jadi saya harus meluangkan waktu untuk belajar. Ketika saya mulai belajar di universitas saya akan selalu berusaha meluangkan waktu dan tenaga yang cukup di forum ini untuk tujuan pembelajaran. Cinta tulus saya kepada semua orang di negara saya tidak ada habisnya dan doa sangat saya panjatkan.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473155",
  "comments": [
    {
      "author": "Okayama",
      "created_time": "November 07, 2023, 03:40:31 AM",
      "body": "Disini saya juga pemula bang dan niat untuk belajar tentang Bitcoin di forum ini sepertinya sudah benar dan tepat. Sebelumnya saya tidak tahu sama sekali tentang wallet Electrum, tetapi banyak sekali member forum disini yang membantu saya untuk memecahkan masalah ini ketika saya mengajukan pertanyaan.Jika yang jadi permasalahan adalah waktu luang, saya rasa bukan itu masalahnya. Tetapi ini masalah prioritas. Jika memiliki niat untuk belajar pasti akan sering meluangkan waktu buat belajar dan main ke forum ini. Biasanya saya mempercepat pekerjaan rumah saya untuk bisa membuka forum lebih awal, dengan begitu waktu saya untuk membaca tulisan disini cukup banyak.Masih banyak sekali bacaan-bacaan yang belum saya selesaikan dan saya tidak terburu-buru untuk menyelesaikannya dalam waktu sehari atau dua hari. Tidak mengapa jika membutuhkan waktu lama, jika belajar sesuatu yang baru itu masih menyenangkan itu akan membuat saya tidak mudah bosan.Tetap semangat dan semoga tidak lekas bosan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tuturtinular",
      "created_time": "November 09, 2023, 10:41:46 PM",
      "body": "Quote from: K.G.F-2 on November 07, 2023, 03:05:37 AMSaya sudah lama ingin menghabiskan waktu dengan forum ini tetapi tidak bisa karena tekanan ekstra dalam studi saya. Tidak masalah gan, agan bisa mulai aktif di forum saat agan memiliki waktu senggang dan study tetap menjadi fokus utama dari agan karena itu adalah bekal untuk masa depan agan. Tetapi kalo saya boleh menyarankan, mungkin sebaiknya agan posting setidaknya sebulan sekali agar aktifitas agan tetap bertambah dan ketika agan sudah memiliki waktu senggang maka sudah memiliki cukup aktifitas untuk naik rank dan hanya perlu mencari tambahan merit.Semoga agan bisa masuk di kampus dan fakultas yang di inginkan, karena semakin kesini semakin banyak persaingan jika ingin masuk ke kampus kampus populer",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reagansimms",
      "created_time": "November 10, 2023, 12:02:39 PM",
      "body": "Anda bisa aktif di forum saat tidak disibukkan oleh kegiatan lain di luar forum seperti belajar di universitas. Banyak member yang sudah bergabung disini harus membagi fokus antara kegiatan wajib di luar forum dengan pekerjaan di forum atau mereka yang ingin menambah wawasan di forum.Jangan lewatkan Thread ini setiap kali anda memiliki waktu mengunjungi forum.Newbies - Read before postingUnofficial list of (official) Bitcointalk.org rules, guidelines, FAQPosting techniqueMerit and rank requirementSelain beberapa thread diatas, anda perlu memeriksa beberapa link dibawah untuk menambah wawasan lebih lanjut tantang Bitcoin.https://bitcoin.org/en/bitcoin-paperhttps://github.com/bitcoinbook/bitcoinbook#chaptershttps://www.bitcoin.com/get-started/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "November 11, 2023, 12:02:57 AM",
      "body": "Quote from: K.G.F-2 on November 07, 2023, 03:05:37 AMSaya sudah lama ingin menghabiskan waktu dengan forum ini tetapi tidak bisa karena tekanan ekstra dalam studi saya. Kalau ane bandingkan antara pekerjaan dan belajar, justru lebih berat itu tekanan pekerjaan karena ada tanggung jawab moral yang harus segera diselesaikan, kalau tidak, pasti akan ada kerugian untuk perusahaan. Sedangkan belajar, menurut ane tekanannya tidak begitu besar sehingga kalau untuk sekedar posting dan membaca di forum ini bisa, tanpa meninggalkan belajar. Soalnya, ane dulu itu pernah ikut diklat full selama sebulan di asrama, tapi masih sangat sempat untuk posting di forum ini, malah porsinya lebih gede, karena lebih fokus sambilannya dari pada ikut diklatnya.Malah dulu ada member yang sambil ngerjain skripsi, dan sampai sekarang dianya kerja full di forum ini dengan banyak akun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "armanda90",
      "created_time": "November 11, 2023, 02:24:04 AM",
      "body": "Posisi lagi belajar saya rasa justru lebih mudah mengatur waktu untuk belajar di forum dibandingkan beberapa teman kita saat ini posisi antara bekerja dan tetap berkecimpung di dalam forum. Tidak salah untuk fokus 100% belajar apalagi menjelang ujian agar mendapatkan nilai yang terbaik, namun saya rasa aktif dan belajar di forum tidak menghabiskan banyak waktu seperti belajar untuk menghadapi ujian. Coba selesaikan terlebih dahulu ujiannya mungkin setelah ujian masuk universitas selesai pasti agan memiliki banyak waktu luang dan bisa dimanfaatkan untuk bergabung dan belajar lebih banyak di forum.Sudah dijelaskan detail oleh agan @reagansimms dan bisa dicoba untuk pelajari satu persatu dimana harus memulai jika ingin aktif dan belajar banyak di forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khiholangkang",
      "created_time": "November 11, 2023, 04:22:17 AM",
      "body": "Keputusan bijaknya adalah fokus mempersiapkan diri unutk ujian penilaian agar mendapatkan nilai terbaik terlebih dahulu untuk bisa masuk ke universitas harapan anda OP, karena itu jauh lebih penting menurut saya, setelah semuanya berjalan baik anda bisa memulai kembali dan bergabung bersama kami di forum untuk berdiskusi, entah itu bitcoin, ekonomi, politik, budaya dan hal semacam nya tentang perkembangan forum, crypto currency, dan situasi kondisi negara kita, dan hal-hal seperti proyek altcoin yang mungkin anda ingin membahasnya, kita bisa berdiskusi di waktu yang tepat. Saya ingin menyarankan kepada anda bahwa anda harus memiliki managemen waktu, di lihat dari aktivitas anda, mungkin kedepannya akan lebih banyak tugas dan hal semacamnya yang harus di pelajari untuk keperluan perkuliahan, jangan sampe mengganggu konsentrasi studi anda, manage waktu anda dengan baik agar semuanya berjalan dengan lancar.Selamat berjuang kawan",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lombok",
      "created_time": "November 11, 2023, 11:59:21 AM",
      "body": "Quote from: khiholangkang on November 11, 2023, 04:22:17 AMKeputusan bijaknya adalah fokus mempersiapkan diri unutk ujian penilaian agar mendapatkan nilai terbaik terlebih dahulu untuk bisa masuk ke universitas harapan anda OP, karena itu jauh lebih penting menurut saya, setelah semuanya berjalan baik anda bisa memulai kembali dan bergabung bersama kami di forum untuk berdiskusi, entah itu bitcoin, ekonomi, politik, budaya dan hal semacam nya tentang perkembangan forum, crypto currency, dan situasi kondisi negara kita, dan hal-hal seperti proyek altcoin yang mungkin anda ingin membahasnya, kita bisa berdiskusi di waktu yang tepat. Saya ingin menyarankan kepada anda bahwa anda harus memiliki managemen waktu, di lihat dari aktivitas anda, mungkin kedepannya akan lebih banyak tugas dan hal semacamnya yang harus di pelajari untuk keperluan perkuliahan, jangan sampe mengganggu konsentrasi studi anda, manage waktu anda dengan baik agar semuanya berjalan dengan lancar.Selamat berjuang kawan Saya sependapat gan, Tipe seseorang itu berbeda-beda ada yang perlu fokus lebih dan hanya terpusat pada satu hal saja. Dan ada juga yang bisa fokus ke beberapa hal, dan ada orang yang tidak terlalu intens dalam belajar namun dia paham dan cepat menguasai hal tersebut. Jika OP mengetahui mana yang harus diprioritaskan terlebih dahulu disini maka itu lebih bagus agar apa yang direncanakan kedepan mengenai ujian berjalan lancar dan mendapatkan hasil maksimal. Kegiatan diForum bisa dibuat flexible, akhir-akhir ini forum adalah mood boster saya saat kegiatan trading dan pekerjaan nyata saya sebagai pedagang dan kerja serabutan 😅 sedang mengalami titik jenuh, apalagi berkecimpung dipasar tradisional yang akhir akhir ini sedang saya geluti, saat pasar sepi saya langsung meluncur ke Forum. Dulu sewaktu masih kuliah juga saya lebih fokus ke belajar dari pada di Forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Arenga pinnata",
      "created_time": "November 11, 2023, 12:29:15 PM",
      "body": "Quote from: K.G.F-2 on November 07, 2023, 03:05:37 AMSaya sudah lama ingin menghabiskan waktu dengan forum ini tetapi tidak bisa karena tekanan ekstra dalam studi saya. Tapi saya cukup bebas sekarang, walaupun saya hanya menghabiskan waktu singkat di forum bitcoin ini, jadi saya tidak punya banyak pengalaman, tapi saya akan segera bergabung dengan rekan-rekan saya dalam diskusi tentang bitcoin. Sehingga saya bisa mempelajari sesuatu tentang cryptocurrency dan mendapatkan pengetahuan sebagai pemula di masa depan. Tapi saya tidak bisa menghabiskan banyak waktu di forum ini sekarang, karena saya ada ujian masuk universitas sebentar lagi, jadi saya harus meluangkan waktu untuk belajar. Ketika saya mulai belajar di universitas saya akan selalu berusaha meluangkan waktu dan tenaga yang cukup di forum ini untuk tujuan pembelajaran. Cinta tulus saya kepada semua orang di negara saya tidak ada habisnya dan doa sangat saya panjatkan.  Yang terpenting atau yang harus menjadi fokus utama Mas K.G.F-2  adalah untuk bisa sukses di ujian masuk universitasnya sekarang. Setelah itu barulah mas bisa lebih fokus untuk lebih aktif di forum ini. Karena ujian masuk universitas memang memerlukan fokus yang lebih tinggi. Soalnya itu sangat penting juga untuk kehidupan atau karir Mas nya didunia nyata. Kita sebagai saudara satu negara hanya bisa mendoakan supaya si Mas Nya bisa lulus ujian dan masuk universitas dengan nilai yang bagus. Belajar tentang kripto dan forum ini bisa dilakukan dengan santai. Sambil Mas nya nanti kuliah. Seperti yang disarankan yang lain. Mas setelah ujian selesai bisa mulai membagi waktu untuk kembali aktif di forum. Good Luck pokoknya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ThemFloo",
      "created_time": "November 11, 2023, 01:09:24 PM",
      "body": "Saya disini baru, adakah yang bisa bantu saya bagaimana tata cara posting yang lebih menarik dan terlihat bagus seperti postingan orang yang jago",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mamesso",
      "created_time": "November 11, 2023, 03:08:14 PM",
      "body": "Quote from: K.G.F-2 on November 07, 2023, 03:05:37 AMSaya sudah lama ingin menghabiskan waktu dengan forum ini tetapi tidak bisa karena tekanan ekstra dalam studi saya. Anda masih bisa memanfaatkan waktu luang disela-sela studi untuk belajar tentang Cryptocurrency dan mendapatkan pengetahuan cara berforum dengan baik, asalkan ada keinginan, pasti ada jalan. Menurut saya, anda harus menganggap studi dan mengunjungi forum sama pentingnya, keduanya bisa dikombinasikan sebagai kewajiban yang tidak bisa anda tinggalkan.Pengetahuan tentang Cryptocurrency bisa memberi keuntungan buat anda, sama halnya dalam menyelesaikan studi. Keduanya bisa dijalani dengan beriringan di waktu yang berbeda, ketika anda sudah menguasai sebagian besar tentang Cryptocurrency dapat dijadikan sebagai sumber pendapatan untuk menambah penghasilan.Konsisten aktif di forum juga dapat memberi manfaat besar buat anda, lihatlah para senior yang memakai kode tanda tangan di profilnya, mereka telah mendapat manfaat dari waktu yang selama ini mereka habiskan di forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rengga Jati",
      "created_time": "November 11, 2023, 09:34:31 PM",
      "body": "Halo, selamat datang.Ada beberapa hal di sini yang harus diperhatikan:1. Belajar manajemen waktu dengan lebih baik dan bijak, berawal dari manajemen waktu, agan nantinya bisa membagi waktu dengan bijak, kapan belajar untuk persiapan masuk universitas dan kapan beajarhal-hal lain. 2. Tentukan skala prioritas sehingga agan bisa menyesuaikan skala prioritas mana yang harus dilakukan terlebih dahulu dan mana yang menjadi selanjutnya. Dalamhal ini, fokus agan saat ini adalah persiapan masuk universitas,sehingga pastikan agan ebih fokus ke sana  terlebih dahulu, kemudian jika memang sedang suntuk dengan rutinitastersebut ataupun dengan adaw aktu selo, maka bisa mulai sambil baca-baca berbagai informasi di forum ini. 3. Optimalkan waktu yang disiapkan untuk forumini dengan efektif, maksudnya adalah bacalah berbagai innformasi basicnya dulu, seperti yang sudah diinfokan oleh @reagansimms. Kemudian, pelajarilahd engan optimaldan efektif, jangan langsung ke  bahasan yang berat-berat dulu, nanti justru tambah pusing. Jika sedang meluangkan waktu di forumini ya optimalkan untuk fokus ke sini dulu walau hanya sebenatr,bukan hanya buka akun kemudian skip-skip postingan-postinganyang notabene penting. 3. Konsistenlah dalam belajar, ini yang biasanyacukup sulit dilakukan, konsistensinya. Konsisten dalam belajar, dalam memahami,dan juga dalam mencoba untuk membuat postingan yang semakin bagus. 4. Open minded terhadap segala kritik dan masukan darimember lain, dalamhalini jangan mudah baperketika adakritik dengan bahasa yang mungkin agak sedikit pedas. Yang penting pahamisaja maksud dari kritikan tersebut apakah membangun atau tidak. karnea, hidup itu tidakadayang manis full terus.Quote from: K.G.F-2 on November 07, 2023, 03:05:37 AM....Ketika saya mulai belajar di universitas saya akan selalu berusaha meluangkan waktu dan tenaga yang cukup di forum ini untuk tujuan pembelajaran. Cinta tulus saya kepada semua orang di negara saya tidak ada habisnya dan doa sangat saya panjatkan.  Sejatinya, sekali lagi,manajemen waktu dan konsistensi menajdi dua hal yang cukuppenting untuk terus eksis di forum ini. Karena bagaimanapun,kita pasti akan sellau ada kesibukan.Ketika sudah mulaibelajar di universitas nanti,pasti akans ellau ada saja alasan sibuk karena banyaknya tugas. ketika sudah bekerja,pasti akan ada alasan sibuk kerjadan capek ketika sudah ulang, atau bahkan masih terbebanioekerjaan walausudah di rumah. Atau bagi para ibu rumah tangga pun begitu, waktunya habis untuk mengerjakan pekerjaan rumah yang tidak ada  habisnya samasekali. karena inilah, manajemen waktu sangat diperlukand alam segala hal agar agan bisa menyesuaikan beberapa waktu untuk bisa secara optimal baik di universitas di forum ini, di pekerjaan lain,atau di aktivitas atau kesibukan lain.meluangkan waktu yang efektif dan optimal di sini bukan berarti agan meluangkan waktu berjam-jam, bukan. tetapi lebih ke luangkan waktu walau hanya sebentar di forum ini,, di sela-sela minum kopi di depan rumah atau di saat sedang santai atau break belajar dengan membuka forum ini dan membaca berbagai informasi yang tersedia di sini. Semuanya butuh proses..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "November 11, 2023, 11:54:53 PM",
      "body": "Quote from: Rengga Jati on November 11, 2023, 09:34:31 PMQuote from: K.G.F-2 on November 07, 2023, 03:05:37 AM....Ketika saya mulai belajar di universitas saya akan selalu berusaha meluangkan waktu dan tenaga yang cukup di forum ini untuk tujuan pembelajaran. Cinta tulus saya kepada semua orang di negara saya tidak ada habisnya dan doa sangat saya panjatkan.  :oSejatinya, sekali lagi,manajemen waktu dan konsistensi menajdi dua hal yang cukuppenting untuk terus eksis di forum ini. Karena bagaimanapun,kita pasti akan sellau ada kesibukan.Ketika sudah mulaibelajar di universitas nanti,pasti akans ellau ada saja alasan sibuk karena banyaknya tugas. ketika sudah bekerja,pasti akan ada alasan sibuk kerjadan capek ketika sudah ulang, atau bahkan masih terbebanioekerjaan walausudah di rumah. -snip-Menurut opini saya, jika memang saat ini sudah mulai belajar di Universitas dan waktu yang ada lebih dominan banyak untuk kegiatan di sana, sebaiknya fokus dulu di kuliah-nya. Karena sifatnya formal, termasuk waktu dan mungkin juga syarat usia maka jangan stuck di tengah hanya karena konsentrasi terpecah di forum. Kecuali jika memang program studinya masih ada paling tidak sedikit terkait dengan teknologi Bitcoin (biasanya pemrograman masih bisa nyambung untuk kedepannya semisal menjadi developer software wallet, atau IT di layanan exchange, dll).Selama forum Bitcointalk masih ada, agan K.G.F-2 bisa saja kembali untuk mulai fokus di forum jika memang sudah menyelesaikan studi-nya.Btw, @agan Rengga Jati mungkin perlu memanfaatkan fitur Preview untuk membaca ulang tulisannya, karena saya lihat banyak yang tipo (maaf, ini sekedar saran untuk perbaikan).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dewiana",
      "created_time": "November 12, 2023, 04:56:23 AM",
      "body": "Quote from: armanda90 on November 11, 2023, 02:24:04 AMPosisi lagi belajar saya rasa justru lebih mudah mengatur waktu untuk belajar di forum dibandingkan beberapa teman kita saat ini posisi antara bekerja dan tetap berkecimpung di dalam forum. Tidak salah untuk fokus 100% belajar apalagi menjelang ujian agar mendapatkan nilai yang terbaik, namun saya rasa aktif dan belajar di forum tidak menghabiskan banyak waktu seperti belajar untuk menghadapi ujian. Coba selesaikan terlebih dahulu ujiannya mungkin setelah ujian masuk universitas selesai pasti agan memiliki banyak waktu luang dan bisa dimanfaatkan untuk bergabung dan belajar lebih banyak di forum.Sudah dijelaskan detail oleh agan @reagansimms dan bisa dicoba untuk pelajari satu persatu dimana harus memulai jika ingin aktif dan belajar banyak di forum.Semua kita harus saling membantu karna dengan membantu saudara-saudara kita maka ilmu dan lainnya akan bertambah, tapi untuk membantu bagi yang ingin belajar juga harus peka dan serius sehingga tidak mudah menyerah ditengah jalan, juga bagi yang belajar harus banyak membaca setiap berita atau postingan aktual digrub karna itu manjadi referensi dalam meningkatkan bahan belajar serta jangan segan-segan untuk bertanya, fokus terhadap target yang hendak dicapai",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tamaperdana",
      "created_time": "November 12, 2023, 11:53:53 AM",
      "body": "Quote from: K.G.F-2 on November 07, 2023, 03:05:37 AMSaya sudah lama ingin menghabiskan waktu dengan forum ini tetapi tidak bisa karena tekanan ekstra dalam studi saya. Tapi saya cukup bebas sekarang, walaupun saya hanya menghabiskan waktu singkat di forum bitcoin ini, jadi saya tidak punya banyak pengalaman, tapi saya akan segera bergabung dengan rekan-rekan saya dalam diskusi tentang bitcoin. Sehingga saya bisa mempelajari sesuatu tentang cryptocurrency dan mendapatkan pengetahuan sebagai pemula di masa depan. Tapi saya tidak bisa menghabiskan banyak waktu di forum ini sekarang, karena saya ada ujian masuk universitas sebentar lagi, jadi saya harus meluangkan waktu untuk belajar. Ketika saya mulai belajar di universitas saya akan selalu berusaha meluangkan waktu dan tenaga yang cukup di forum ini untuk tujuan pembelajaran. Cinta tulus saya kepada semua orang di negara saya tidak ada habisnya dan doa sangat saya panjatkan.  Keinginan agan untuk bisa ikut nimbrung di forum ini adalah sebuah hal yang sangat bagus. Karena bagaimana pun juga forum ini adalah tempat yang paling cocok untuk bisa mempelajari BTC dan juga mata uang kripto. Masalah waktu, menurut saya sih agan bisa membuka forum ini di saat agan sedang memiliki waktu luang saja. Karena agan kan sebentar lagi akan menghadapi ujian untuk masuk di universitas,jadi agan pasti harus lebih memprioritaskan ujian tersebut terlebih dahulu. Mungkin setelah ujian masuk tersebut selesai,agan bisa lebih fokus lagi untuk belajar dan berdiskusi di forum ini. Tapi sudah pasti meskipun agan sudah di terima di universitas,agan pasti harus lebih fokus di situ. Dan forum ini harus agan jadikan nomer 2. Sebab belajar di universitas sudah pasti memang lebih penting dan juga harus lebih serius.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "November 12, 2023, 02:07:01 PM",
      "body": "Quote from: K.G.F-2 on November 07, 2023, 03:05:37 AMSaya sudah lama ingin menghabiskan waktu dengan forum ini tetapi tidak bisa karena tekanan ekstra dalam studi saya. Tapi saya cukup bebas sekarang, walaupun saya hanya menghabiskan waktu singkat di forum bitcoin ini, jadi saya tidak punya banyak pengalaman, tapi saya akan segera bergabung dengan rekan-rekan saya dalam diskusi tentang bitcoin. Sehingga saya bisa mempelajari sesuatu tentang cryptocurrency dan mendapatkan pengetahuan sebagai pemula di masa depan. Tapi saya tidak bisa menghabiskan banyak waktu di forum ini sekarang, karena saya ada ujian masuk universitas sebentar lagi, jadi saya harus meluangkan waktu untuk belajar. Ketika saya mulai belajar di universitas saya akan selalu berusaha meluangkan waktu dan tenaga yang cukup di forum ini untuk tujuan pembelajaran. Cinta tulus saya kepada semua orang di negara saya tidak ada habisnya dan doa sangat saya panjatkan.  Jangan lupa berorganisasi internal atau eksternal kampus saat sudah menjadi mahasiswa/i untuk lebih kritis. Jadi kupu-kupu (kuliah pulang) tidak bagus walau semua itu adalah pilihan pribadi. Iklan lewat.Semoga jadi mahasiswa yang bermanfaat untuk pribadi, keluarga dan lingkungan domisili.Topik 5 Cara Mengajari Orang Awam Tentang Bitcoin terjemahan Husna QA bagus untuk dibaca berulang sebagai referensi dalam belajar tentang Bitcoin dan kripto.Belajar tentang forum, agan perlu konsisten untuk membuka setiap papan atau board. Terutama thread seperti yang dicantumkan agan reagansimms. Diatas terdapat topik yang diberi tanda pinned tentang [RULES] Peraturan Sub-Forum Indonesia dan FAQ | BACA SEBELUM POSTING!.Keseluruhannya, aktif di forum tergantung keinginan untuk mengaktifkan diri.Ane ulangi seperti yang sudah di sampaikan, jangan yang berat-berat dulu. Ringan dan mudah dipahami.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MegameSama",
      "created_time": "November 12, 2023, 03:49:37 PM",
      "body": "Quote from: K.G.F-2 on November 07, 2023, 03:05:37 AMSaya sudah lama ingin menghabiskan waktu dengan forum ini tetapi tidak bisa karena tekanan ekstra dalam studi saya...~~snip~~sama gan, posisi ane juga sama seperti ente, disibukan sama tugas kuliah yang gak ada habisnya dari hari - hari, belum praktimunya wkkwkw, tapi ya gitu kalau ane ya kupu - kupu, jadi agak banyak waktu buat nongkrong disini, walaupun gak ikut post hanya baca - baca aja. saran ane kalau lagi persiapan masuk kuliah fokus ke ujian aja dulu. biar fokusnya gak kepecah. kecuali agan orangnya bisa multitask dan tidak terpengaruh fokusnya ya aman. semoga keterima di univ impianya btw, goodluck Quote from: ThemFloo on November 11, 2023, 01:09:24 PMSaya disini baru, adakah yang bisa bantu saya bagaimana tata cara posting yang lebih menarik dan terlihat bagus seperti postingan orang yang jagopertanyaan agan saya yakin bisa di jawab full sama postingan ini, soalnya saya banyak belajar dari sini : [GUIDE] Panduan Bikin Thread & Indeks Thread Berkualitas Sub-Forum Indonesiahttps://bitcointalk.org/index.php?topic=2979183.0 jangan lupa selalu ikuti rules biar akunnya aman dan forum tetap kondusif :[RULES] Peraturan Sub-Forum Indonesia dan FAQ | BACA SEBELUM POSTING!https://bitcointalk.org/index.php?topic=764664.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CK485",
      "created_time": "November 12, 2023, 04:00:33 PM",
      "body": "Adakah yang bisa bantu saya secara langsung, Apa maksud dan tujuankepercayaan :  +0 / =0 / -0Sebelum nya saya sudah telusuri di bagian  Pemula & Bantuan hanya saja tidak ada ringkasan yang dapat saya mengertiDi profile saya tidak tau fungsi dan apa maksudnya..Dan ketika berubah angka nya apa yang akan terjadi?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "November 12, 2023, 10:12:51 PM",
      "body": "Quote from: CK485 on November 12, 2023, 04:00:33 PMAdakah yang bisa bantu saya secara langsung, Apa maksud dan tujuankepercayaan :  +0 / =0 / -0Sebelum nya saya sudah telusuri di bagian  Pemula & Bantuan hanya saja tidak ada ringkasan yang dapat saya mengertiDi profile saya tidak tau fungsi dan apa maksudnya..Dan ketika berubah angka nya apa yang akan terjadi?Mungkin kata pencariannya diganti dengan menggunakan bahasa aslinya: \"Trust\" (saran saya, agar tidak bingung kedepannya, gunakan istilah aslinya daripada menggunakan istilah terjemahan).Trust: +xx / =xx / -xxPada dasarnya Trust itu merupakan feedback yang diberikan salah satu user ke user lain.Feedback trust yang terlihat dan diperhitungkan nilainya itu yang berasal dari DT (Default Trust) member dan pada dasarnya ini untuk hal-hal yang terkait dengan transaksi atau perdagangan yang pernah dilakukan user tersebut dengan user lain, namun pada perkembangannya terkadang feedback ini juga digunakan untuk hal lain.Angka di bagian kiri itu untuk Trust Positive (biasanya digunakan untuk menilai ketika seseorang dianggap berperilaku baik dan tidak mungkin menipu orang lain);yang tengah untuk Trust Neutral (untuk penilaian lain);dan yang kanan untuk Trust Negative (untuk penilaian ketika melakukan transaksi dengan user tersebut dianggap beresiko tinggi akan ditipu atau merugikan).Ketika ada DT member yang memberikan feedback ke user tertentu, maka orang lain yang mau berinteraksi bisa melihat profilnya dan mempertimbangkan terlebih dulu apakah user tersebut memang bisa dipercaya atau tidak.Beberapa contoh trust:- Trust Positive dan Neutral: https://bitcointalk.org/index.php?action=profile;u=1051955;dt -> https://bitcointalk.org/index.php?action=trust;u=1051955;dt- Trust Positive, Neutral dan Negative: https://bitcointalk.org/index.php?action=profile;u=2548375;dt -> https://bitcointalk.org/index.php?action=trust;u=2548375;dtUntuk contoh trust yang kedua, agan CK485 bisa menilai sendiri ketika ingin bertransaksi dengannya.Note: tambahkan ;dt pada akhir url dari profile user untuk melihat penilaian yang diberikan DT member.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khiholangkang",
      "created_time": "November 13, 2023, 02:08:34 PM",
      "body": "Quote from: lombok on November 11, 2023, 11:59:21 AMQuote from: khiholangkang on November 11, 2023, 04:22:17 AMKeputusan bijaknya adalah fokus mempersiapkan diri unutk ujian penilaian agar mendapatkan nilai terbaik terlebih dahulu untuk bisa masuk ke universitas harapan anda OP, karena itu jauh lebih penting menurut saya, setelah semuanya berjalan baik anda bisa memulai kembali dan bergabung bersama kami di forum untuk berdiskusi, entah itu bitcoin, ekonomi, politik, budaya dan hal semacam nya tentang perkembangan forum, crypto currency, dan situasi kondisi negara kita, dan hal-hal seperti proyek altcoin yang mungkin anda ingin membahasnya, kita bisa berdiskusi di waktu yang tepat. Saya ingin menyarankan kepada anda bahwa anda harus memiliki managemen waktu, di lihat dari aktivitas anda, mungkin kedepannya akan lebih banyak tugas dan hal semacamnya yang harus di pelajari untuk keperluan perkuliahan, jangan sampe mengganggu konsentrasi studi anda, manage waktu anda dengan baik agar semuanya berjalan dengan lancar.Selamat berjuang kawan Saya sependapat gan, Tipe seseorang itu berbeda-beda ada yang perlu fokus lebih dan hanya terpusat pada satu hal saja. Dan ada juga yang bisa fokus ke beberapa hal, dan ada orang yang tidak terlalu intens dalam belajar namun dia paham dan cepat menguasai hal tersebut. Jika OP mengetahui mana yang harus diprioritaskan terlebih dahulu disini maka itu lebih bagus agar apa yang direncanakan kedepan mengenai ujian berjalan lancar dan mendapatkan hasil maksimal. Kegiatan diForum bisa dibuat flexible, akhir-akhir ini forum adalah mood boster saya saat kegiatan trading dan pekerjaan nyata saya sebagai pedagang dan kerja serabutan 😅 sedang mengalami titik jenuh, apalagi berkecimpung dipasar tradisional yang akhir akhir ini sedang saya geluti, saat pasar sepi saya langsung meluncur ke Forum. Dulu sewaktu masih kuliah juga saya lebih fokus ke belajar dari pada di Forum.Saya harap dia berhasil lolos ujian dan bisa menjadi bagian dari kita di forum ini dan mungkin bisa menjadi akademisi baru di forum, dengan mata kuliah yang di pahami di kampusnya saya harap dia bisa bertukar pikiran dengan kita di forum ini, sepengalaman saya anak kampus itu sering sekali ingin berdiskusi tentang hal apapun, jadi mungkin kita bisa melakukan kajian mengenai topik tertentu di masa depan di forum ini. Ya karakter/tipe seseorang itu beda-beda dalam menjalankan suatu proses kehidupan termasuk kemampuan belajar, dan memang kita juga sebenarnya tidak tahu bagaimana dia bisa melakukan itu atau tidak, sekalipun dia bisa berkunjung ke forum dengan waktu yang flexible, iya sih gan benar, wah ternyata agan juga memiliki pengalaman yang cukup keren sebelum masuk ke forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}