{
  "id": "topic_5444205",
  "title": "Question:",
  "author": "d5000",
  "created_time": "March 10, 2023, 05:11:27 AM",
  "content": "Bei so schönen Preis-Rücksetzern ist es immer mal wieder schön, sich etwas zu gruseln. Ich überlegte mir vor kurzem: was würde ich bei einem \"fast\" worst Case* tun?Zur Erläuterung: Der \"worst case\" wäre für mich ein fundamental bedingter Kollaps des Bitcoins. Beispielsweise aufgrund eines Bugs, aufgrund eines Verbots in allen größeren Ländern, eines technisch wesentlich, uneinholbar besseren Altcoins usw. Um das soll es hier nicht gehen.Stattdessen wäre auch ein rein spekulativer extremer Preiseinbruch denkbar. Also bei identischen regulatorischen und technischen Rahmenbedingungen. Bitcoin hätte eigentlich noch alle seine Vorteile, aber irgendwie will niemand mehr kaufen. Es kommt aus der Mode, die Luft ist raus. Das wäre der \"fast\" worst case.Ein Beispiel für so ein Szenario: Nehmen wir mal an, dass etwa aufgrund einer Kettenreaktion Stablecoins - Börsen - Fonds usw., also einer noch extremeren Variante dessen, was mit Terra/Luna und FTX passierte, so viele Wale pleitegehen und alles verkaufen müssen (z.B. Saylor, Grayscale, Binance, Tether ...) , dass wir noch mal mindestens 90% im Vergleich zum bisherigen Tiefs des Zyklus fallen. Was natürlich auch bei Privatanlegern eine womöglich nie gesehene Panik auslösen könnte. Wir würden mindestens auf den Stand vor ca. 2017 zurückfallen, und das für mehrere Jahre, etwa aufgrund anhaltend negativem Medienecho. Sagen wir mal mit einem Bitcoinpreis im Bereich von höchstens drei- bis geringer vierstelliger Zahlen.Nehmen wir auch mal an, viele liebgewonnene Möglichkeiten, Geld mit Bitcoin zu verdienen versiegen aufgrund dieses rein spekulativen Kollapses ebenfalls. Ein Beispiel sind Bountykampagnen. Was würdet ihr dann tun? Wärt ihr wirklich weiter dabei?Und: wäre sowas überhaupt denkbar? Oder kann man es inzwischen ausschließen? Wenn ja, warum?Ich glaube, wenn ich ehrlich bin, würde ich versuchen in einem guten Moment (was so aussieht wie ein Dead Cat Bounce, z.B.) doch einiges \"in Sicherheit\" zu bringen. Aber mit allem würde ich wahrscheinlich nicht rausgehen, da wäre ich dann doch lange zu optimistisch, und stattdessen versuchen, wenn alles ganz düster aussieht noch mal etwas reinzustecken. Das Konzept hinter Bitcoin ist einfach zu gut um es ganz ad acta zu legen. Und solche ganz düsteren langjährigen Phasen kennt man ja von gewissen Altcoins *Finde dafür leider kein griffiges deutsches Wort",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444205",
  "comments": [
    {
      "author": "willi9974",
      "created_time": "March 10, 2023, 06:20:21 AM",
      "body": "Wenn absehbar ist das es weiter fallen wird und ich die Reaktionszeit habe, coins vom cold storage auf den Exchange zu schieben, würde ich verkaufen und weiter unten wieder zurückkaufen.Würde also versuchen Kapital zu sichern und im zweiten Schritt meinen BTC Bestand zu erhöhen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxMueller",
      "created_time": "March 10, 2023, 07:42:16 AM",
      "body": "Naja die krux liegt ja schon in der frage ob der drastische Preisverfall absehbar ist, schnell flash-crash mäßig eintritt oder sich eher gemächlich hinzieht.Wenn ich ne insider Info hätte, dass BUSD nicht hinterlegt sind und Binance zu 100% wie ein Kartenhaus zusammenfallen wird, dann würde ich alles verkaufen, shorten und geduldig auf die nächste endgültige Bodenbildung warten und wieder einkaufen. Das ist nur nicht sonderlich realistisch (dass ich da an insider Infos käme).Realistischer wäre bei einem Binance Kollaps eher dass ich nach 2 Wochen aus dem Urlaub komme, nix mitbekommen habe, wieder reinschaue und der kurs 80% tiefer läge. Dann würde ich wohl hodln bis zur Rente.Käme der Niedergang gemächlich und man hätte genug zeit zu reagieren würde ich vermutlich weiter DCA mäßig nachkaufen bis irgendwann das kapital ausgeht... Danach dann wohl hoffen, beten und hodln.Wobei natürlich bei solch einer theoretischen Diskussion hier Emotionen keine Rolle spielen und die Handlungen im Fall dann durchaus abweichen könnten...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "March 10, 2023, 08:06:17 AMLast edit: March 10, 2023, 09:38:47 AM by mole0815",
      "body": "Kein schönes Szenario was du uns hier aufzeigst d5000 Aber es macht schon Sinn sich auch solche Gedanken zu machen.Quote from: d5000 on March 10, 2023, 05:11:27 AMWas würdet ihr dann tun?Weitermachen.Quote from: d5000 on March 10, 2023, 05:11:27 AMWärt ihr wirklich weiter dabei?Ja.Quote from: d5000 on March 10, 2023, 05:11:27 AMUnd: wäre sowas überhaupt denkbar? Oder kann man es inzwischen ausschließen? Wenn ja, warum?Ob es realistisch ist? Gute Frage ich tendiere zu nein. Aber das hat man auch bei anderen Dingen schon gedacht und dann kam es anders.Ich wünsche es uns nicht! Aber ausschließen kann man einen (richtigen!) Einbruch (warum auch immer) leider nie.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CoinEraser",
      "created_time": "March 10, 2023, 01:29:19 PM",
      "body": "Quote from: d5000 on March 10, 2023, 05:11:27 AMWas würdet ihr dann tun? Wärt ihr wirklich weiter dabei?Und: wäre sowas überhaupt denkbar? Oder kann man es inzwischen ausschließen? Wenn ja, warum?So eine Umfrage in Zeiten von fallenden Preisen und schlechten Neuigkeiten gibt auf jeden Fall kein gutes Gefühl.  Tja, was würde ich tun?! Eigentlich habe ich mir darüber noch keine Gedanken gemacht, da ich immer noch in Bitcoin volles Vertrauen habe. Vielleicht würde ich ab einem bestimmten Punkt auch versuchen zu verkaufen, um mit dem Geld dann meinen Bestand an Bitcoins zu vergrößern. Aber da ich eigentlich bisher immer meine Bitcoins gehalten habe, egal wie tief die Preise runtergingen, ist es fraglich, ob auch bei mir irgendwann eine Schmerzgrenze erreicht ist. Ich hoffe eigentlich nicht.Ich würde aber weiterhin Bitcoin nutzen. Warum auch nicht? Immerhin hat sich bis auf den Preis nichts verändert. Er bleibt ja weiterhin sicher und zuverlässig.Trotzdem hoffe ich, es wird nicht zu deinem beschriebenen \"Worst Case\"-Szenario kommen. Das würde sicherlich den kompletten Bereich verändern bzw. dem Sektor einen richtigen Schaden zufügen. Ob sich der Sektor davon irgendwann erholen würde, ist halt fraglich. Sicherlich würde es mehr den Weg für CBDC freimachen, aber ob das eine gute Entwicklung per se ist, bezweifel ich. Wir sollten halt nie vergessen, dass Bitcoin auch für Freiheit steht, und das sehe ich bei CBDC sehr kritisch, aber das ist ein anderes Thema.Ausschließen kann man in der heutigen Zeit leider nichts, auch nicht, das dein Szenario eintreffen könnte. Daher habe ich auch keine Argumente, was dagegen sprechen könnte. Aber die Zeit wird zeigen, wie sich alles entwickeln wird. Wie können nur hoffen, dass wir auch diesen Sturm überleben und nächstes Jahr entspannt auf diese Zeit zurückschauen können.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mv1986",
      "created_time": "March 10, 2023, 01:54:06 PM",
      "body": "Hey @d5000,@mole0815 hat Deinen thread hier empfohlen und ja, das ist ein extrem interessantes Thema, zu dem man eine Menge guter Ideen austauschen kann. Werde mich noch ausführlich einbringen hier.Vielleicht kann man sogar ein bisschen Struktur reinbringen, je nachdem wie die Diskussion läuft. Der Klassiker ist ja sowas wie \"Quantum Computing\" könnte Bitcoin knacken, oder eben der \"Bug\" wie Du ihn erwähnst. Aber es gibt ja eine Menge Aspekte, die hier eine Rolle spielen könnten. Vielleicht kann man die dann mal geordnet festhalten und wenn man bei der Recherche auf etwas stößt, das zu einem Aspekt passt, hat man einen guten Grund es hier einzubringen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "March 10, 2023, 05:56:06 PM",
      "body": "Da wir hier von einem \"fast worst case\" sprechen, würde ich wahrscheinlich Bitcoin nachkaufen. Wenn der Preis bereits um 80% oder 90% gesunken ist, wäre da eh nicht mehr viel für mich zu holen. Stattdessen würde ich dann meine Bitcoin Vorräte endlich mal aufstocken und dann natürlich hoffen, dass sich die Lage wieder beruhigt und wir irgendwann in 3-10 Jahren neue Höchstwerte verzeichnen können -> so denke ich zumindest fiktiv darüber nach. Wenn der Fall wirklich eintritt, ist die Stimmung vielleicht eine andere",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Unknown01",
      "created_time": "March 10, 2023, 06:06:42 PM",
      "body": "Wenn ich aus der Zukunft kommen würde und wüsste, dass der Kurs noch weiterfallen wird, würde ich aufjedenfall verkaufen und nachkaufen aber da ich nicht aus der Zukunft komme würde ich Hodln und nicht nur dabei bleiben sondern immer wieder nach Möglichkeiten nachkaufen. Wenn‘s dann irgendwann untergeht möchte ich wie der Kapitän bei der Titanic mituntergehen",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Danydee72",
      "created_time": "March 10, 2023, 06:08:00 PM",
      "body": "Ich bin mir ziemlich sicher, dass ich regelmässig nachkaufen (DCA) und das meiste mindestens bis zur Pension hodln würde. Auf irgendeinem Kurs muss sich der BTC ja einpendeln, selbst wenn nur noch die Leute investiert bleiben, die sich hier im Forum tummeln und dem BTC vertrauen. Das zeigt sich ja grade an vergangenen Währungen wie z.B. dem LUNC. Auf Null kommt ja nicht mal der.Was ich aber auch (weiterhin) tun würde ist auf Währungen zu achten, die sich dem BTC-Kurs entgegen verhalten. Das eine oder andere Tauschgeschäft schliesse ich da per se nicht aus.Im Grunde ändert sich also nicht wirklich viel.   denke ich mal. Wie es dann wirklich wäre weiss ich auch nicht.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MinoRaiola",
      "created_time": "March 10, 2023, 07:26:54 PMLast edit: March 11, 2023, 10:30:26 AM by MinoRaiola",
      "body": "Quote from: Unknown01 on March 10, 2023, 06:06:42 PMWenn ich aus der Zukunft kommen würde und wüsste, dass der Kurs noch weiterfallen wird, würde ich aufjedenfall verkaufen und nachkaufen aber da ich nicht aus der Zukunft komme würde ich Hodln und nicht nur dabei bleiben sondern immer wieder nach Möglichkeiten nachkaufen. Wenn‘s dann irgendwann untergeht möchte ich wie der Kapitän bei der Titanic mituntergehenUntergehen will doch niemand und wir hier (die schon so lange dabei sind) hätten es nicht verdient  Quote from: d5000 on March 10, 2023, 05:11:27 AMWas würdet ihr dann tun? Wärt ihr wirklich weiter dabei?Und: wäre sowas überhaupt denkbar? Oder kann man es inzwischen ausschließen? Wenn ja, warum?Also „All Out“ wäre ich glaube nie, ich habe vor BTC weiterzugeben. Alleine weil es alte Adressen sind und für mich haben da einige einen nostalgischen Wert, egal ob mit Coins oder ohne. Das liegt aber auch daran, das ich Old School (die alte Schule) favorisiere. Ich habe zb. noch einen alten Antminer S5 im Schrank, die gab es früher in schwarz und alte USP Miner. Es ist keine riesige Sammlung, ganz bescheiden.Auch weil es so etwas wie Bitcoin kein zweites Mal gibt, ausgenommen BSV (dem originalem Bitcoin? ). Das wir so wenige sind, die BTC nutzen, verstehe ich nur bedingt. In Deutschland ist Bitcoin gefühlt ein Spekulationsobjekt, die Chance dahinter verstehen nur sehr wenige, ggfs. nur wir hier im Forum. Von einer Finanzinstitution nicht kontrolliert zu werden ist Gold Bitcoin wert.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "March 10, 2023, 08:06:57 PMLast edit: March 10, 2023, 11:38:32 PM by d5000",
      "body": "Danke schon mal für die Antworten  Im Grunde genommen sehen es also die meisten ähnlich wie ich. Das würde ja im Prinzip bedeuten, dass irgendwo eine Bodenbildung einsetzen würde, da ja die \"langjährigen Bitcoin-Fans\" irgendwann einkaufen würden. Und wenn es bei 1 € = 1 BTC ist Altcoin-Kollapse wie das von @Danydee72 genannte Beispiel LUNC ist tatsächlich sowas wie eine Blaupause für das Szenario, was ich mir etwa ausmalen würde, wenn der BTC \"aus der Mode kommt\". (Wenn auch ich eher das Beispiel Namecoin bringen würde: der erste Altcoin, dazu ein gutes Konzept, und trotzdem fast vergessen.)Die Frage, die ich mir irgendwann in eine solchen (bisher hypothetischen) tiefen Depressionsphase stellen würde für die endgültige Entscheidung, ob ich \"weiter dabei bleibe\", wäre, ob zumindest eine eingeschränkte Nutzung als \"globale Internetwährung\" weiter möglich ist. Wenn es weiterhin in vielen Ländern zumindest ein paar Nischen-Merchants gibt, die BTC akzeptieren, wäre das für mich auf jeden Fall ein Pluspunkt, und selbst nach (sagen wir mal) 5 Jahren \"hoffnungsloser\" Preisdepression wäre ich klar weiter dabei.Gäbe es aber irgendwie geartete Alternativen die sich herausbilden und ähnliche Vorteile bringen, dann könnte es sein, dass ich doch aussteigen würde. Eine Möglichkeit wäre z.B. eine globale nicht blockchainbasierte Währung, die z.B. von einer basisdemokratischen Organisation verwaltet würde, ähnlich wie es z.B. Faircoin (allerdings auf Blockchainbasis) versucht, aber mit weitgehend zentral verwalteten Servern, die aber durchaus mit \"noch zu erfindender\" Kryptographie auch zensurresistent sein könnte.Allerdings ginge das schon in Richtung des wirklichen \"worst case\". Also einem fundamentalen Problem von Bitcoin.Zum von @CoinEraser genannten Stichwort CBDC: Ich halte das schon länger nicht wirklich für eine Gefahr für Bitcoin, sondern eher für traditionelle e-Wallet-Dienste, aber auch eventuell für private Stablecoins wie Tether. CBDCs könnten in der Tat natürlich von einer Bitcoindepression profitieren, aber die Bitcoin-Vorteile wie die Zensurresistenz würden dadurch nicht eingeschränkt.Allerdings könnten CBDCs, je nachdem wie sie ausgestaltet sind, durchaus die Bitcoin-Nachfrage zeitweise schmälern. Gerade in den bekannten südamerikanischen \"Inflationsstaaten\" sind Tether und Co. für viele Menschen eine Art \"Einstiegsdroge\" für Bitcoin. Fällt dies weg, weil es CBDCs gibt, die offen für Menschen aus aller Welt sind (was es womöglich geben dürfte, da Anreize besonders bei kleineren, aber relativ stabilen Währungen dafür existieren würden), dann könnte auch dieser \"Einstiegsdrogen\"-Weg wegfallen.Irgendwann dürfte es aber bei entsprechender Bodenbildung wieder einen Bullenmarkt geben. Allerdings halte ich es nicht für ausgemacht, dass dieser wirklich die alten Höchststände erreicht. Denn irgendwo könnte auch eine natürliche Preisgrenze liegen. Derzeit gehe ich davon aus, dass diese etwa bei der Gold-Marketcap liegt, aber ich kann mich auch irren, je nachdem welche Alternativen existieren.Aber wie gesagt, reine Spekulation. Der derzeitige Dip ist dagegen imo ideal zum Nachkaufen und ich erwarte nicht wirklich einen Test des 2022er Tiefs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "March 10, 2023, 10:35:29 PM",
      "body": "Quote from: d5000 on March 10, 2023, 08:06:57 PMDanke schon mal für die Antworten  Im Grunde genommen sehen es also die meisten ähnlich wie ich. Das würde ja im Prinzip bedeuten, dass irgendwo eine Bodenbildung einsetzen würde, da ja die \"langjährigen Bitcoin-Fans\" irgendwann einkaufen würden. Und wenn es bei 1 € = 1 BTC ist Ja so einen Boden würde es sicher irgendwann geben. Bei 1€ wäre man ja gerade mal bei einer gesamten Marktkapitalisierung von < 20 Millionen Euro.Spätestens da würden doch so einige mal ein paar Bitcoin mehr besitzen wollen Ich hoffe einfach, dass das hier reine Spekulation bleibt und wir den \"fast worst case\" gar nicht erleben werden/müssen...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Real-Duke",
      "created_time": "March 11, 2023, 10:24:43 AM",
      "body": "Da freut man sich gestern Abend noch über die günstigen monatlichen Kaufkurse und in diesem Beitrag geht es mit volldampf in den Untergang... Im Prinzip ist irgendwie alles möglich, aber:Quote from: d5000 on March 10, 2023, 08:06:57 PMda ja die \"langjährigen Bitcoin-Fans\" irgendwann einkaufen würden. Und wenn es bei 1 € = 1 BTC istAlso unter 1€ oder 1$ werden wir schon mal ganz sicher nicht fallen, denn dort warten im schlimmsten Fall die Bitcoin Ultras um alles aufzukaufen.Möchte mir den hoffentlich nicht ganz ernst gemeinten Beitrag nicht weiter in meinem Kopf ausmalen, daher plädiere ich ebenfalls dafür, dass dieses Szenario bitte niemals eintreffen möge",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Unknown01",
      "created_time": "March 11, 2023, 10:54:36 AM",
      "body": "Quote from: sam00 on March 10, 2023, 10:35:29 PMQuote from: d5000 on March 10, 2023, 08:06:57 PMDanke schon mal für die Antworten  Im Grunde genommen sehen es also die meisten ähnlich wie ich. Das würde ja im Prinzip bedeuten, dass irgendwo eine Bodenbildung einsetzen würde, da ja die \"langjährigen Bitcoin-Fans\" irgendwann einkaufen würden. Und wenn es bei 1 € = 1 BTC ist Ja so einen Boden würde es sicher irgendwann geben. Bei 1€ wäre man ja gerade mal bei einer gesamten Marktkapitalisierung von < 20 Millionen Euro.Spätestens da würden doch so einige mal ein paar Bitcoin mehr besitzen wollen Ich hoffe einfach, dass das hier reine Spekulation bleibt und wir den \"fast worst case\" gar nicht erleben werden/müssen...Selbst wenn ich wüsste es wird nie wieder hochgehen würde ich alleine für das Feeling hunderte Bitcoins kaufen um einen Euro das Stück um dann einfach irgendwann zurückblicken zu können und mich an die guten alten Zeiten zu erinnern. Wir können ja Notfalls mit BTC intern etwas entwickeln",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "allyouracid",
      "created_time": "April 22, 2023, 08:46:10 AM",
      "body": "Ausschließen? Niemals, das wäre naiv. Aber bei bisherigen Crashes der wirklich schmerzhaften Sorte habe ich immer versucht, den Schmerz zu ignorieren und das Ganze ins Verhältnis zu setzen: ist das, was da gerade passiert, noch angemessen? Was treibt das Ökosystem so, ist es realistisch, dass alles, was nicht reine Spekulation ist (Firmen/Produkte, Hardware, Events, ...) sich jetzt prozentual vergleichbar dezimiert? Meistens erscheint dann ein relativ klares \"Nein\" als vernünftige Antwort. D.h. ich ärgere mich, dass ich zum hundertsten Mal nicht raus bin, als es am schönsten war, dann schaue ich, wie es um meine passiven Einnahmen steht, reduziere Dinge, die Geld kosten ein wenig und mache weiter.Komplett aussteigen kommt für mich nicht infrage. Dafür ist das Thema einfach noch in zu vielen Köpfen. Das verschwindet nicht einfach so... haben wir ja damals gesehen, als China noch relevant war und Crypto andauernd \"verboten\" und irgendwann schließlich tatsächlich (?) verboten haben: die Politik um die Ereignisse herum wird als Verstärker genutzt (aktiv oder passiv, ist aber eigentlich egal, weil es am Ergebnis nichts ändert) und dann geht es einfach weiter.Bei 2017-Preisen allerdings würde ich meine Strategie stark anpassen. Die letzten Jahre war es für mich keine Option, neues Fiat-Quatschgeld reinzustecken. Dafür sind mir die Preise einfach zu hoch; ich arbeite nicht mehrere Wochen für rein netto ein Ether-Gamblingtoken. Das sehe ich nicht ein, das lässt sich einfacher mit den vorhandenen Mitteln innerhalb der Blase in Kombination mit etwas Geduld schaffen. Wenn wir allerdings nochmal 90% runter wären, sähe das schon anders aus und das Anhäufen neuer Bluechip-Gamblingtokens wäre absolut eine Option. Es wäre halt wieder genauso ein Gamble wie 2015/16. Der hat funktioniert und es könnte wieder funktionieren.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}