{
  "id": "topic_5451688",
  "title": "apogio",
  "author": "apogio",
  "created_time": "May 06, 2023, 09:14:07 AM",
  "content": "Hello.Two days ago I broadcasted a transaction of 55000 sats and I had set a fee of 6 sats/BFor this transaction I used MUUN wallet. Now, there is something strange. MUUN wallet balance shows 55000 sats and the transaction statua is \"failed\"The transactions is the following: https://mempool.space/tx/1544302a89f6bfa2a36cebf583f11d3a4bf6200537059d9e2c800d5c018db9ddWhat does failed mean? I can understand that the transaction will take a looooong time to be confirmed since the fee was quite low. But why does it say failed?Also I would like to know why the fees are so high atm",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451688",
  "comments": [
    {
      "author": "elevates",
      "created_time": "May 06, 2023, 09:30:59 AM",
      "body": "Quote from: apogio on May 06, 2023, 09:14:07 AMHello.Two days ago I broadcasted a transaction of 55000 sats and I had set a fee of 6 sats/BFor this transaction I used MUUN wallet. Now, there is something strange. MUUN wallet balance shows 55000 sats and the transaction statua is \"failed\"The transactions is the following: https://mempool.space/tx/1544302a89f6bfa2a36cebf583f11d3a4bf6200537059d9e2c800d5c018db9ddWhat does failed mean? I can understand that the transaction will take a looooong time to be confirmed since the fee was quite low. But why does it say failed?Also I would like to know why the fees are so high atmThe current transaction fee is by the way around 104sat/vb to 151sat/vb. I think the miners have rejected your transaction due to the low fee & network is congestion. That is why you got the message failed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "May 06, 2023, 09:34:27 AMLast edit: May 06, 2023, 09:50:33 AM by Plaguedeath",
      "body": "I read in some article if Bitcoin transaction can be cancelled if there's no miner pick your transaction into the Bitcoin block after 24 hours, so you get a notification in your wallet as failed, not pending or unconfirmed.I don't find any user complaint about failed transaction by using Muun wallet, so it's a general matter, not from the Muun wallet. AFAIK Muun wallet have different format regarding it's seed phrase, but that's should be not a problem for sending Bitcoin.Edit:The article I mentioned before https://cointelegraph.com/explained/why-is-my-bitcoin-transaction-unconfirmed",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "May 06, 2023, 09:53:55 AM",
      "body": "Quote from: elevates on May 06, 2023, 09:30:59 AMThe current transaction fee is by the way around 104sat/vb to 151sat/vb. I think the miners have rejected your transaction due to the low fee & network is congestion. That is why you got the message failed.What do you mean? All the miners have rejected my transaction? I thought my transaction would stay in the mempool until fees were low again. Am I wrong?Quote from: Plaguedeath on May 06, 2023, 09:34:27 AMI read in some article if Bitcoin transaction can be cancelled if there's no miner pick your transaction into the Bitcoin block after 24 hours, so you get a notification in your wallet as failed, not pending or unconfirmed.I don't find any user complaint about failed transaction by using Muun wallet, so it's a general matter, not from the Muun wallet. AFAIK Muun wallet have different format regarding it's seed phrase, but that's should be not a problem for sending Bitcoin.Edit:The article I mentioned before https://cointelegraph.com/explained/why-is-my-bitcoin-transaction-unconfirmedThat's awkward but thanks for this info. Yeah it has nothing to do with MUUN wallet, but I have never heard the word \"failed\" for a bitcoin transaction. That's why I thought it might have been application specific. I mean failed is not the same as unconfirmed. This is what got me curious. Anyway",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "May 06, 2023, 09:54:20 AMLast edit: May 06, 2023, 11:25:32 AM by hosseinimr93",
      "body": "Some nodes have dropped your transaction from their mempool while some others still have your transaction. For example, you can see your transaction on blockchain.com, blockstream and mempool.space, but it's not shown on blockchair.com.I'm not familiar with the wallet you are talking about, but as it shows your transaction as failed, it means that your transaction has been dropped from their mempool as well and you should be able to broadcast a new transaction. The problem here is that the first transaction hasn't been marked as RBF and nodes that have your first transaction in their mempool will reject the new transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 06, 2023, 09:55:36 AM",
      "body": "If the mempool of a node is very congested and it become full, transactions of higher fee which are getting broadcasted will be replacing the transactions of lower fee on the mempool node. This will cause the transactions of lower fees to be dropped out of the mempool. You should be able to rebroadcast your coins.You can use this for fee estimation: https://mempool.space/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "May 06, 2023, 09:59:21 AM",
      "body": "Quote from: Charles-Tim on May 06, 2023, 09:55:36 AMIf the mempool of a node is very congested and it become full, transactions of higher fee which are getting broadcasted will be replacing the transactions of lower fee on the mempool. This will cause the transactions of lower fees to be dropped out of mempool. You should be able to rebroadcast your coins.Thanks but I have a very important question here. Let's say I have signed a transaction using timelock for 20 years in the future. Then, let's say I die and my child needs to broadcast the transaction. What if he has the same problem and I am not alive to re-sign a new transaction?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "May 06, 2023, 10:03:50 AM",
      "body": "Quote from: hosseinimr93 on May 06, 2023, 09:54:20 AMbut as it show your transaction as failed, it means that your transaction has been dropped from their mempool as well and you should be able to broadcast a new transaction. @OP, this is the answer what does your transaction cancelled/failed means. Your wait is over and you have to send it again with a better priority fee. For you to have the idea how much the current transaction fees that's being accepted for it to have a fast to average to no confirmation, check the website of mempool.https://mempool.space/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "May 06, 2023, 10:17:45 AM",
      "body": "Quote from: apogio on May 06, 2023, 09:59:21 AMThanks but I have a very important question here. Let's say I have signed a transaction using timelock for 20 years in the future. Then, let's say I die and my child needs to broadcast the transaction. What if he has the same problem and I am not alive to re-sign a new transaction? They can wait until the network becomes less congested and rebroadcast that transaction. If the network stays congested, they will have to pay a miner to include the transaction in a block.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "May 06, 2023, 10:20:53 AM",
      "body": "Quote from: hosseinimr93 on May 06, 2023, 10:17:45 AMQuote from: apogio on May 06, 2023, 09:59:21 AMThanks but I have a very important question here. Let's say I have signed a transaction using timelock for 20 years in the future. Then, let's say I die and my child needs to broadcast the transaction. What if he has the same problem and I am not alive to re-sign a new transaction? They can wait until the network becomes less congested and rebroadcast that transaction. If the network stays congested, they will have to pay a miner to include the transaction in a block. Now that (unfortunately in my opinion) there are ordinals and taproot, what if in 20 years from now the network is congested and the fees are much higher than the transaction I have signed? Quote from: tabas on May 06, 2023, 10:03:50 AMQuote from: hosseinimr93 on May 06, 2023, 09:54:20 AMbut as it show your transaction as failed, it means that your transaction has been dropped from their mempool as well and you should be able to broadcast a new transaction. @OP, this is the answer what does your transaction cancelled/failed means. Your wait is over and you have to send it again with a better priority fee. For you to have the idea how much the current transaction fees that's being accepted for it to have a fast to average to no confirmation, check the website of mempool.https://mempool.space/Thanks! This is helpful",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 06, 2023, 10:25:04 AM",
      "body": "Quote from: hosseinimr93 on May 06, 2023, 10:17:45 AMThey can wait until the network becomes less congested and rebroadcast that transaction. If the network stays congested, they will have to pay a miner to include the transaction in a block. I have not tried time lock before, but I think it is a transaction made to be broadcasted at certain date or block height. What I think he meant is that what if someone has a time lock transaction for his child and he dies, the set date or block height reached and the fee used is low while the mempool is congested at the time, leading to the transaction to be dropped out of the mempool.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "May 06, 2023, 10:29:44 AM",
      "body": "Quote from: apogio on May 06, 2023, 10:20:53 AMNow that (unfortunately in my opinion) there are ordinals and taproot, what if in 20 years from now the network is congested and the fees are much higher than the transaction I have signed? I answered this above in my previous post. As I said, they can pay a miner to include the transaction. Note that even if the fee is zero, there's nothing prevents miners from including the transaction. Assuming the fee is enough for the transaction to enter the mempool of nodes, the other thing they can do is to broadcast that transaction and then do CPFP with spending the unconfirmed outputs with high fee rate. Quote from: Charles-Tim on May 06, 2023, 10:25:04 AMWhat I think he meant is that what if someone has a time lock transaction for his child and he dies, the set date or block height reached and the fee used is low while the mempool is congested at the time, leading to the transaction to be dropped out of the mempool.Right. I understood the same thing from apogio's question.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "May 06, 2023, 10:33:17 AM",
      "body": "Quote from: Plaguedeath on May 06, 2023, 09:34:27 AMI read in some article if Bitcoin transaction can be cancelled if there's no miner pick your transaction into the Bitcoin block after 24 hours, so you get a notification in your wallet as failed, not pending or unconfirmed.Your waiting transaction can be dropped from mempools after a while but it does not mean it is cancelled. Mempools only can drop waiting transactions that they think have very low fee rate but only you can cancel your transaction.Quote from: apogio on May 06, 2023, 10:20:53 AMNow that (unfortunately in my opinion) there are ordinals and taproot, what if in 20 years from now the network is congested and the fees are much higher than the transaction I have signed? Taproot does not involved in Ordinals. Do you think Taproot is responsible for what happened in mempools last three months?It is a Segwit type and is better than Legacy by reducing used space in mempools than Legacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "May 06, 2023, 10:39:17 AM",
      "body": "Quote from: tbct_mt2 on May 06, 2023, 10:33:17 AMYour waiting transaction can be dropped from mempools after a while but it does not mean it is cancelled. Mempools only can drop waiting transactions that they think have very low fee rate but only you can cancel your transaction.So, if my transaction exists in at least one nodes mempool, then it can be processed? Sorry for my lack of knowledge. I don't understand itQuote from: apogio on May 06, 2023, 10:20:53 AMTaproot does not involved in Ordinals. Do you think Taproot is responsible for what happened in mempools last three months?It is a Segwit type and is better than Legacy by reducing used space in mempools than Legacy.No I don't claim that. I am not well educated on taproot. I thought that ordinals became possible because of taproot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "May 06, 2023, 10:43:14 AM",
      "body": "If you can adjust your wallet node server, you will be able to watch this transaction, I do not know whether that option is available in that wallet, but that transaction can still be sure, as soon as you confirm it and the synchronization of the wallet will disappear from your wallet.Quote from: apogio on May 06, 2023, 09:59:21 AMThanks but I have a very important question here. Let's say I have signed a transaction using timelock for 20 years in the future. Then, let's say I die and my child needs to broadcast the transaction. What if he has the same problem and I am not alive to re-sign a new transaction? When you sign a message with a timelock, after the transaction is confirmed, you do not need to re-broadcast it for the next 20 years, but those coins will be locked in that block till the locked block number. (so it is not about date)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "May 06, 2023, 10:50:52 AM",
      "body": "Quote from: apogio on May 06, 2023, 10:39:17 AMSo, if my transaction exists in at least one nodes mempool, then it can be processed? Sorry for my lack of knowledge. I don't understand itOnly if that node is owned by a miner.If the miner that have your transaction in the their mempool mine a block, your transaction can be included in the blockchain. (This is assuming the network has become less congested and the fee rate used for transaction is enough now.)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "entebah",
      "created_time": "May 06, 2023, 10:52:00 AM",
      "body": "Quote from: apogio on May 06, 2023, 09:14:07 AMHello.Two days ago I broadcasted a transaction of 55000 sats and I had set a fee of 6 sats/Bmaybe you need to see this site https://mempool.space/ to set your fee because if you use 6 sats/B I believe your transaction will take a few weeks to get confirmation.since you use muun wallet to send your transaction and that app does not enable RBF it will be good if you use electrum because you can do RBF to increase your transaction fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomiles1",
      "created_time": "May 06, 2023, 12:14:12 PM",
      "body": "I am having same issues currently I made a transfer of 0.00142BTC and the transaction fee was charged about $4 so I had to readjust the fee to about $1.7 since then till now there have been no confirmation but when I scanned through tx id, saying payment received but not yet confirmed. This has kept me worried over 6 to 7 hours now and does this mean it won't be confirmed again anymore? Although from the tx saying confirmation may likely take 24 hrs. Now the reason I replied here was to know if I can send another transaction to counter the first transaction, I actually wanted to create a topic but seeing this was an avenue for me to also lodged my complaint.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Edwardard",
      "created_time": "May 06, 2023, 12:44:23 PM",
      "body": "Quote from: Cryptomiles1 on May 06, 2023, 12:14:12 PMI am having same issues currently I made a transfer of 0.00142BTC and the transaction fee was charged about $4 so I had to readjust the fee to about $1.7 since then till now there have been no confirmationDon't calculate your fee in terms of usd to get an estimate of your transaction priority. In your case, the fee per kvB part is little bit (~25%) below the average fee (should've been 0.00075 BTC per KvB and it would be confirmed by now), but it should get confirmed as the mempool clears itself out during the late weekend maybe?!. My opinion is just wait for few more hours and see.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "May 06, 2023, 12:54:23 PMLast edit: May 06, 2023, 02:13:51 PM by hosseinimr93",
      "body": "Quote from: Cryptomiles1 on May 06, 2023, 12:14:12 PMNow the reason I replied here was to know if I can send another transaction to counter the first transaction, I actually wanted to create a topic but seeing this was an avenue for me to also lodged my complaint.Given the information displayed on the image you shared, your transaction should be: d3d69e769a318de71d165cf3ccfaa1fb0fab7ac570fc2aba172132056f7e4fdf.As your transaction hasn't been flagged as RBF, you can't replace that with a new one even if you use much higher fee for the new transaction. Now, your transaction is around 4.5 vMb from the tip and I also expect it to be confirmed in the next 24 hours. Of course, there is no guarantee that it will be confirmed in the next 24 hours. Edit:I just submitted your transaction to ViaBTC free accelerator. Assuming your transaction won't be confirmed normally, it will be likely included in the next block mined by ViaBTC. They have around 9% of the total hash rate and mine a block around every 2 hours on average. Edit 2:ViaBTC included the transaction in block number 788,519.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}