{
  "id": "topic_5438449",
  "title": "Scambuster03",
  "author": "Scambuster03",
  "created_time": "February 07, 2023, 03:15:04 AMLast edit: February 23, 2023, 02:51:01 PM by Scambuster03",
  "content": "Bounty Link: https://bitcointalk.org/index.php?topic=5415338.0The Playnoam project, managed by the BAVERU, after collecting Kyc did not keep theirs promise. They promised to pay Theirs token but later they change their mind and those users who eligible for more than 200$ worth of token according to current price of token they only received 4$ Ethereum. They only ask for Passport and there was no other option to complete Kyc.https://i.imgur.com/2RYCmow.pngThis is going to be another kyc scam after bounty detective tagged previously.Quote from: Mpamaegbu on September 17, 2020, 07:11:40 AMThe ClipX project, another bounty, managed by the Bounty Detectives' team early today let down bounty hunters gently in what seems a soft exit by announcing that it would no longer continue with the project. The announcement was made here: https://t.me/clipXchannel/13That was after it had cunningly collected KYC documents from hunters (even though that wasn't explicitly on the bounty thread). ClipX insisted it was going to be a passport document for KYC or nothing. It was really a suspicious move but anxious hunters neglected it. Why ask for only a passport for KYC and not any other document.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5438449",
  "comments": [
    {
      "author": "thaksena",
      "created_time": "February 07, 2023, 03:32:55 AM",
      "body": "Playnomn big scammer. Team cheat with bounty hunter. Big scammer team Don't invest this project",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "February 07, 2023, 04:04:24 AM",
      "body": "There's no mentioned which KYC requirement they will ask, do you have a proof if the manager or project's owner is saying they accept any form of KYC and it's not only limited to passport? show it here.The bad thing is the project doesn't have official announcement thread in this forum, so there's no way to tag the project's owner account.Anyway @beveryu778 have wrote disclaimer if he's not a part of the project, it would be a drama if a DT member give negative tag to his account. I think many of campaign managers right now protect their reputation by just put a disclaimer and they will be free of getting tagged even he's managing scam project and not responsible if the project turn become scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sn5",
      "created_time": "February 07, 2023, 04:39:58 AM",
      "body": "Playnomm team scam bounty hunterDon't invest any more Playnomm all  scam link Below: https://playnomm.com/https://discord.gg/playNommhttps://twitter.com/playNomm",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Scambuster03",
      "created_time": "February 07, 2023, 05:09:52 AM",
      "body": "Quote from: Plaguedeath on February 07, 2023, 04:04:24 AMThere's no mentioned which KYC requirement they will ask, do you have a proof if the manager or project's owner is saying they accept any form of KYC and it's not only limited to passport? show it here.There was no other option other the. passport. For bounty Registration reward you must passed kyc through Passport. This member post in BAVERU bounty group clearly show that the only option was to complete Kyc through passporthttps://t.me/c/1579572007/10347https://i.ibb.co/26KQxFQ/Screenshot-2023-0207-095823.jpg",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Akramulbd10",
      "created_time": "February 07, 2023, 07:23:43 AM",
      "body": "Play norm is scam project, please every one didn’t buy LM token. Play norm bounty team cheating all Bounty participate. So didn’t buy LM token.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cornia",
      "created_time": "February 07, 2023, 07:46:43 AM",
      "body": "Scam project,  Scam team and Scam LM. Don't invest in this project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hakimbaba",
      "created_time": "February 07, 2023, 08:34:28 AM",
      "body": "Playnomn LM project big scammer. Team cheat with bounty hunter so Don't invest this project. Big cheater and scammer",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jojocing",
      "created_time": "February 07, 2023, 09:00:12 AM",
      "body": "scam scam scam dont invest cheat team and scammer",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "February 07, 2023, 09:25:48 AM",
      "body": "Quote from: Scambuster03 on February 07, 2023, 03:15:04 AMbut later they change their mind and those users who eligible for more than 200$ worth of token according to current price of token they only received 4$ Ethereum. They only ask for Passport and there was no other option to complete Kyc.That's a rare deal with bounty programs, unless you can provide reference evidence that the $30k bounty will be distributed at current rates. Or you misunderstood your calculation, where $200 refers to the selling price and the market price is only $4.KYC matter, yeah hunters I think have gotten used to exchanging their valuable identities for something bs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cutfish28",
      "created_time": "February 07, 2023, 09:29:58 AM",
      "body": "@playNomm is a scam project and a great cheater. Do not distribution on bounty hunter. Please don't invest the PlayNomm or LM tokens.Make a slogan day by day Scam project,Scam project.....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "February 07, 2023, 11:42:31 AM",
      "body": "Quote from: rat03gopoh on February 07, 2023, 09:25:48 AMQuote from: Scambuster03 on February 07, 2023, 03:15:04 AMbut later they change their mind and those users who eligible for more than 200$ worth of token according to current price of token they only received 4$ Ethereum. They only ask for Passport and there was no other option to complete Kyc.That's a rare deal with bounty programs, unless you can provide reference evidence that the $30k bounty will be distributed at current rates. Or you misunderstood your calculation, where $200 refers to the selling price and the market price is only $4.KYC matter, yeah hunters I think have gotten used to exchanging their valuable identities for something bs.I assume that most of the participants in this discussion are also participants of the mentioned bounty campaign. from what we can read (or at least try to), they obviously deserve each other. The fake campaign promoted by poor bounty hunters strength.I see no justification for why hunters complain about unpaid worthless tokens, they just need to ignore such and not participate in every BS they see on the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Scambuster03",
      "created_time": "February 08, 2023, 04:11:50 AM",
      "body": "Quote from: rat03gopoh on February 07, 2023, 09:25:48 AMThat's a rare deal with bounty programs, unless you can provide reference evidence that the $30k bounty will be distributed at current rates. Or you misunderstood your calculation, where $200 refers to the selling price and the market price is only $4. Spreadsheet has been finalized by bounty manager and admin of project was satisfied. Check there spreadsheet and you will see the number of token of each users .Token is listed in LBank and you can easily estimate the current value of each user.SpreadsheetToken Price: LBank LM TokenPlaynoam Telegram admin Message: https://i.ibb.co/GFh5hjh/Screenshot-2023-0208-090956.jpg",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "February 08, 2023, 04:46:43 AM",
      "body": "Quote from: Scambuster03 on February 08, 2023, 04:11:50 AMPlaynoam Telegram admin Message: They said they weren't done with the payment. Delaying payments is an ancient trick of project owners to keep prices down. If you look more closely, liquidity is actually not enough just to cover up the massive dumps by hunters. Only 31k tokens need to be sold for a reasonable price (selling price), the rest is dust buy orders amount down to price @$.0001 if selling another 22k tokens. The bounty prize is 100k tokens, so what do they expect?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Scambuster03",
      "created_time": "February 08, 2023, 05:46:13 AM",
      "body": "Quote from: rat03gopoh on February 08, 2023, 04:46:43 AMThey said they weren't done with the payment. Delaying payments is an ancient trick of project owners to keep prices down. Why don't you research the problem thoroughly first then would replied here. This telegram message before distribution. They distributed only 4$ and many users done theirs KYC. I don't why Bounty Detective had been tagged while No DT member is looking this situation.Quote If you look more closely, liquidity is actually not enough just to cover up the massive dumps by hunters. Only 31k tokens need to be sold for a reasonable price (selling price), the rest is dust buy orders amount down to price @$.0001 if selling another 22k tokens. The bounty prize is 100k tokens, so what do they expect?If they cannot afford to pay hunters and cannot keep promise, why they run bounty program. If the price dump is issue then they can send Eth at half price at least but 4$ for 200$ is just nonsense.What will be your reaction when you have given 4$ for signature after one month and promised reward was 200$?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "February 08, 2023, 12:54:43 PM",
      "body": "Quote from: Scambuster03 on February 07, 2023, 05:09:52 AMThere was no other option other the. passport. For bounty Registration reward you must passed kyc through Passport. This member post in BAVERU bounty group clearly show that the only option was to complete Kyc through passportIt means he's not lying, bounty hunters need to accept any KYC which requested to them because it's written the bounty need KYC verification. If they don't comfortable to submit KYC, they have a choice to not join from the beginning.Quote from: Scambuster03 on February 08, 2023, 05:46:13 AMI don't why Bounty Detective had been tagged while No DT member is looking this situation.What does the relation between Playnomm's bounty and Bounty Detective? I don't understand.QuoteWhat will be your reaction when you have given 4$ for signature after one month and promised reward was 200$? No one will want it, but bounty which paid with their own shitcoin is already nothing normal if the payment is really different with the first promise. All bounties need to pay with top 10 cryptos to prevent from this kind issue, but it's impossible because 99% of the projects don't want this. Moreover bounty hunters don't care with it and just trying to join all of campaigns and use multiple accounts in order to maximize their profit.I think this accusation isn't valid because no one get scammed, it's just a fault from the hunters who have a high expectation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MFahad",
      "created_time": "February 14, 2023, 06:43:35 PM",
      "body": "Actually there was some mis understanding from Marketing team and they send very low amount of Ethereum instead of distributing Their Token LM. Now Team have announced that they will pay all bounty hunters and distribution will probably be started in 48 Hours. The official message in telegramQuoteIMPORTANT: If you have a claim for the bounty hunt reward - please come to playNomm Discord room and open a ticket.Come to https://discord.gg/playNommNow every one should follow the rules by Joining Discord, Create Ticket and send your Bitcointalk Username. i hope all users will recieve their reward. Bounty manager also announced in  telegram bounty group that he discussed with team and they are ready to distribute. Now for hunters to be patients and wait until further news come.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gladitorcomeback",
      "created_time": "February 16, 2023, 06:36:01 AM",
      "body": "PLAYNOAM successfully Distributed all rewards to Bounty hunters and i think this thread now should be locked. Every body can check the details In Bounty Group FIRST 2 Batch already distributed while Batch 3 and 4 will be processed very soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "February 16, 2023, 08:01:22 AM",
      "body": "If you could reason why there's alot of scams happening around it's all because of things related to this kind of experience, have you guys taken your time to research on the project before working for them, did you read their policy statement of privacy before choosing them, who are the developers behind the token, what's their liquidity, their location and if possible the past records they have on successful projects, i expect people to understand the risk attached to hunting for bounties because it's hard to get a reliable one, we may not assume them for scam yet until a fact is established on them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rigon",
      "created_time": "February 16, 2023, 10:10:14 AM",
      "body": "Quote from: Scambuster03 on February 07, 2023, 03:15:04 AMBounty Link: https://bitcointalk.org/index.php?topic=5415338.0The Playnoam project, managed by the BAVERU, after collecting Kyc did not keep theirs promise. They promised to pay Theirs token but later they change their mind and those users who eligible for more than 200$ worth of token according to current price of token they only received 4$ Ethereum. They only ask for Passport and there was no other option to complete Kyc.I think it's cheating with campaign participants. It is the responsibility of each project team to provide customer payments. Because those who work in the lower section work very hard and work there for a long time. Those who do not pay this toil never qualify as honest people. Here people who got 200 dollars worth of tokens were given $4 of ethereum so I can say for sure it's a scam with people.Although the bounty manager is not at fault, the bounty manager should have escrowed the tokens. I would like to tell @BAVERU sir that you must bring escrow while bringing the campaign.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}