{
  "id": "topic_5467863",
  "title": "ZeeshanTrade",
  "author": "ZeeshanTrade",
  "created_time": "September 24, 2023, 04:47:14 AM",
  "content": "This is the ICC Cricket World Cup 2023 Discussion thread where one can freely discuss on all the matches of the World Cup 2023.Schedule & ResultsOfficial Website: https://www.cricketworldcup.com/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467863",
  "comments": [
    {
      "author": "noormcs5",
      "created_time": "September 24, 2023, 08:16:28 AM",
      "body": "Quote from: ZeeshanTrade on September 24, 2023, 04:47:14 AMSchedule & ResultsThis schedule does not contain the warm up matches for the World Cup. The World Cup will kick off with the warm up match between Bangladesh and Sri Lanka on 29th September. There will be a total of 10 warm up matches. Each team will play two matches each before the start of the WC.I do not know if the sports betting sites will allow the betting on the warm up matches too ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "3kpk3",
      "created_time": "September 25, 2023, 12:50:06 PM",
      "body": "I don't really think a separate thread for the upcoming ODI World Cup is required op because there are already multiple discussion threads involving it(ODI discussion thread and prediction pool threads).I suggest locking this particular thread asap and posting in those threads op.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZeeshanTrade",
      "created_time": "September 26, 2023, 06:15:15 AM",
      "body": "Quote from: 3kpk3 on September 25, 2023, 12:50:06 PMI don't really think a separate thread for the upcoming ODI World Cup is required op because there are already multiple discussion threads involving it(ODI discussion thread and prediction pool threads).I suggest locking this particular thread asap and posting in those threads op.Those are predictions threads where contest is taking place and that is for the members who participated.This one is the clean ICC Cricket World Cup 2023 Discussion thread and it is also not self -mod thus fulfilling the purpose of freedom of speech.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JohnBitCo",
      "created_time": "September 26, 2023, 07:04:13 AM",
      "body": "Quote from: noormcs5 on September 24, 2023, 08:16:28 AMQuote from: ZeeshanTrade on September 24, 2023, 04:47:14 AMSchedule & ResultsThis schedule does not contain the warm up matches for the World Cup. The World Cup will kick off with the warm up match between Bangladesh and Sri Lanka on 29th September. There will be a total of 10 warm up matches. Each team will play two matches each before the start of the WC.I do not know if the sports betting sites will allow the betting on the warm up matches too ?On the 6th of October 2023, the first match of the ICC Men’s ODI World Cup. The first match is play in between New Zealand and England, and the second match is play in between Pakistan vs Netherlands. If we look at the 1st match of this World Cup so England team is confident because England won the last world cup.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "September 26, 2023, 09:12:12 AM",
      "body": "Quote from: JohnBitCo on September 26, 2023, 07:04:13 AMOn the 6th of October 2023, the first match of the ICC Men’s ODI World Cup. The first match is play in between New Zealand and England, and the second match is play in between Pakistan vs Netherlands. If we look at the 1st match of this World Cup so England team is confident because England won the last world cup. I agree; they have high confidence as the defending champions. They are the favorites to win the first match due to their very strong team, good form, and a well-balanced batting and bowling lineup. As far as I know, their batting lineup is the most explosive in the world and capable of scoring big runs quickly. Additionally, their bowling attack is also very good and capable of taking wickets at a good pace.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noormcs5",
      "created_time": "September 26, 2023, 02:48:16 PM",
      "body": "Quote from: Text on September 26, 2023, 09:12:12 AMQuote from: JohnBitCo on September 26, 2023, 07:04:13 AMOn the 6th of October 2023, the first match of the ICC Men’s ODI World Cup. The first match is play in between New Zealand and England, and the second match is play in between Pakistan vs Netherlands. If we look at the 1st match of this World Cup so England team is confident because England won the last world cup. I agree; they have high confidence as the defending champions. They are the favorites to win the first match due to their very strong team, good form, and a well-balanced batting and bowling lineup. As far as I know, their batting lineup is the most explosive in the world and capable of scoring big runs quickly. Additionally, their bowling attack is also very good and capable of taking wickets at a good pace.I think the warm matches will give us a hint team's current form and how they adapt to the conditions in India. England will be playing their warm up match against India on 30 September while New Zealand's warm up match is scheduled against South Africa on 2nd October.Although people do not give much importance to these warm up matches but i think the win in these matches gives a confidence booster to the teams right before the start of the major event; World Cup.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btctodamon",
      "created_time": "September 26, 2023, 05:44:31 PM",
      "body": "finally pakistan cricket team reach india for participate in icc cricket world cup 2023 in india",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sithara007",
      "created_time": "September 27, 2023, 03:18:00 AM",
      "body": "Quote from: btctodamon on September 26, 2023, 05:44:31 PMfinally pakistan cricket team reach india for participate in icc cricket world cup 2023 in indiaFrom what I heard, they were held up by some visa issues, but in the end everything got sorted out. The contingent got their visa less than 48 before their scheduled arrival. Pakistani media are complaining that India delayed the visa, in order to disrupt the preparations and to prevent Pakistani players from getting acclimatized. Anyway, now they should concentrate on the warmup matches (first one is against New Zealand on 29th September, and there is another one scheduled against Australia on 3rd October).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noormcs5",
      "created_time": "September 27, 2023, 03:45:34 AM",
      "body": "Quote from: btctodamon on September 26, 2023, 05:44:31 PMfinally pakistan cricket team reach india for participate in icc cricket world cup 2023 in indiaThis is a history in itself as both countries have tense political relationships between them. The last time it was T20 World Cup in 2016 when the Pakistan cricket team visited India. If we talk about India, it is a long time since they were in Pakistan for the 2008 Asia Cup.Both nations have a strong love for cricket, but what a pity that they can't go to each other countries to play bilateral series. Bad for the nations, bad for sports and bad for the sponsors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "September 27, 2023, 04:14:20 AM",
      "body": "Quote from: noormcs5 on September 26, 2023, 02:48:16 PM-snipI think the warm matches will give us a hint team's current form and how they adapt to the conditions in India. England will be playing their warm up match against India on 30 September while New Zealand's warm up match is scheduled against South Africa on 2nd October.Although people do not give much importance to these warm up matches but i think the win in these matches gives a confidence booster to the teams right before the start of the major event; World Cup.Right, these warm-up matches are important as preparation. They will provide good indications of how teams are adapting to the conditions in India. It can help identify any areas where they need to improve. And yes, a win in these matches can be a great confidence booster before the major tournament. It's interesting to see a good test and performance, and how they are shaping up against their opponents.Let’s hope for some exciting cricket! 😊",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sithara007",
      "created_time": "September 27, 2023, 06:28:15 AM",
      "body": "Quote from: Text on September 27, 2023, 04:14:20 AMRight, these warm-up matches are important as preparation. They will provide good indications of how teams are adapting to the conditions in India. It can help identify any areas where they need to improve. And yes, a win in these matches can be a great confidence booster before the major tournament. It's interesting to see a good test and performance, and how they are shaping up against their opponents.Let’s hope for some exciting cricket! 😊Not very sure about this. Look at the warmups that are scheduled for 29th. For example take the match between New Zealand and Pakistan, which is scheduled at the Rajiv Gandhi International Stadium in Hyderabad. In this case, both the teams are unfamiliar with the Indian conditions. So how can we measure the adaptability of these two teams from just one match? The tournament will be played over the course of 1.5 months, and the participating teams will continue to adjust to the conditions and improvise. Warmups may or may not give an indication for that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noormcs5",
      "created_time": "September 28, 2023, 08:43:56 AM",
      "body": "Quote from: Sithara007 on September 27, 2023, 06:28:15 AMQuote from: Text on September 27, 2023, 04:14:20 AMRight, these warm-up matches are important as preparation. They will provide good indications of how teams are adapting to the conditions in India. It can help identify any areas where they need to improve. And yes, a win in these matches can be a great confidence booster before the major tournament. It's interesting to see a good test and performance, and how they are shaping up against their opponents.Let’s hope for some exciting cricket! 😊Not very sure about this. Look at the warmups that are scheduled for 29th. For example take the match between New Zealand and Pakistan, which is scheduled at the Rajiv Gandhi International Stadium in Hyderabad. In this case, both the teams are unfamiliar with the Indian conditions. So how can we measure the adaptability of these two teams from just one match? The tournament will be played over the course of 1.5 months, and the participating teams will continue to adjust to the conditions and improvise. Warmups may or may not give an indication for that. We do not need to check the adaptability of the teams in India conditions on their warm matches but actually the purpose of the warm uo matches is that the teams get used to the playing conditions and have a match practice with a competitive team, before the start of the World cup.This helps the team to check their combinations of bowling and batting, though winning the match is not the motive of warm up matches. The primary purpose is to find the right combination before the start of the WC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "3kpk3",
      "created_time": "September 28, 2023, 11:58:24 AM",
      "body": "Quote from: ZeeshanTrade on September 26, 2023, 06:15:15 AMThose are predictions threads where contest is taking place and that is for the members who participated.This one is the clean ICC Cricket World Cup 2023 Discussion thread and it is also not self -mod thus fulfilling the purpose of freedom of speech.Wrong. Some of them are prediction pool threads as you mentioned, but some are strictly about different formats of cricket. The ODI discussion thread is the proper discussion thread related to the ODI World Cup.This is simply some advice to avoid unnecessary cricket related spamming. Also, this is my last post in this thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jasonjm",
      "created_time": "September 28, 2023, 12:05:23 PM",
      "body": "Quote from: noormcs5 on September 28, 2023, 08:43:56 AMWe do not need to check the adaptability of the teams in India conditions on their warm matches but actually the purpose of the warm uo matches is that the teams get used to the playing conditions and have a match practice with a competitive team, before the start of the World cup.This helps the team to check their combinations of bowling and batting, though winning the match is not the motive of warm up matches. The primary purpose is to find the right combination before the start of the WC.I think the purpose of these warmup matches is to acclimatize to the host country's playing conditions. Teams will get some know-how about the weather conditions, humidity, and the pitches. Choosing the right combination might not be the sole purpose of these warmup matches. As far as the right team combination is concerned, I think it will be decided on the actual match after assessing the pitch and ground conditions. We all know that teams have already somewhat fixed the combination, except for a few changes (depending on the pitch) on the match day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bureau",
      "created_time": "September 28, 2023, 12:31:15 PM",
      "body": "Quote from: 3kpk3 on September 28, 2023, 11:58:24 AMQuote from: ZeeshanTrade on September 26, 2023, 06:15:15 AMThose are predictions threads where contest is taking place and that is for the members who participated.This one is the clean ICC Cricket World Cup 2023 Discussion thread and it is also not self -mod thus fulfilling the purpose of freedom of speech.Wrong. Some of them are prediction pool threads as you mentioned, but some are strictly about different formats of cricket. The ODI discussion thread is the proper discussion thread related to the ODI World Cup.This is simply some advice to avoid unnecessary cricket related spamming. Also, this is my last post in this thread. It is spamming, why would someone create a thread only on ICC World Cup discussion. There are threads which are for prediction pool and there are mega threads, that are best to discuss about Cricket. The biggest issue here is that we as cricket fans are not united. The obvious reason is that none of the users from Pakistan, Bangladesh, India and Srilanka tend to forget political issue and be fan of this wonderful game. As of now self moderated threads which a big are being questioned because of spam. You know the reason and why it is being questioned. While big football threads are still not being noticed as they are not that stupid like us. I believe that this thread should be closed by the OP before someone points it as a spam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dimitri94",
      "created_time": "September 28, 2023, 01:39:19 PM",
      "body": "Quote from: noormcs5 on September 28, 2023, 08:43:56 AMQuote from: Sithara007 on September 27, 2023, 06:28:15 AMQuote from: Text on September 27, 2023, 04:14:20 AMRight, these warm-up matches are important as preparation. They will provide good indications of how teams are adapting to the conditions in India. It can help identify any areas where they need to improve. And yes, a win in these matches can be a great confidence booster before the major tournament. It's interesting to see a good test and performance, and how they are shaping up against their opponents.Let’s hope for some exciting cricket! 😊Not very sure about this. Look at the warmups that are scheduled for 29th. For example take the match between New Zealand and Pakistan, which is scheduled at the Rajiv Gandhi International Stadium in Hyderabad. In this case, both the teams are unfamiliar with the Indian conditions. So how can we measure the adaptability of these two teams from just one match? The tournament will be played over the course of 1.5 months, and the participating teams will continue to adjust to the conditions and improvise. Warmups may or may not give an indication for that. This helps the team to check their combinations of bowling and batting, though winning the match is not the motive of warm up matches. The primary purpose is to find the right combination before the start of the WC.Agreed, the results of these matches don't have value but a players get a good sense of the place, the field and the opponent. Not just the player, those who organizers also receive ideas about the pitch. Basically it is a match where a player's performance can be observed or get a surface idea about the whole condition. Some players have no interest in playing that match. Though there is no obligation but it can be said that warm matches are very important for starting any tournament.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noormcs5",
      "created_time": "September 30, 2023, 04:52:20 AM",
      "body": "Quote from: Dimitri94 on September 28, 2023, 01:39:19 PMAgreed, the results of these matches don't have value but a players get a good sense of the place, the field and the opponent. Not just the player, those who organizers also receive ideas about the pitch. Basically it is a match where a player's performance can be observed or get a surface idea about the whole condition. Some players have no interest in playing that match. Though there is no obligation but it can be said that warm matches are very important for starting any tournament.We have seen some strange results in yesterday's match where the Bangladesh team beat the more stronger Srilankan team. But still, we should not change our bias for the teams as sometimes i feel the stronger team do not play with full dedication however a team with a lower rank, tries to take every match seriously and this is true for the warm matches too.Today the host India will take on England. This would be a more viewed match today as compared to the other one between Australia and the Netherlands. I would like to see how the Netherlands perform today as they were the ones who didn't let West Indies make it to the World Cup.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fuso.hp",
      "created_time": "September 30, 2023, 05:12:08 AM",
      "body": "Quote from: Dimitri94 on September 28, 2023, 01:39:19 PMQuote from: noormcs5 on September 28, 2023, 08:43:56 AMQuote from: Sithara007 on September 27, 2023, 06:28:15 AMQuote from: Text on September 27, 2023, 04:14:20 AMRight, these warm-up matches are important as preparation. They will provide good indications of how teams are adapting to the conditions in India. It can help identify any areas where they need to improve. And yes, a win in these matches can be a great confidence booster before the major tournament. It's interesting to see a good test and performance, and how they are shaping up against their opponents.Let’s hope for some exciting cricket! 😊Not very sure about this. Look at the warmups that are scheduled for 29th. For example take the match between New Zealand and Pakistan, which is scheduled at the Rajiv Gandhi International Stadium in Hyderabad. In this case, both the teams are unfamiliar with the Indian conditions. So how can we measure the adaptability of these two teams from just one match? The tournament will be played over the course of 1.5 months, and the participating teams will continue to adjust to the conditions and improvise. Warmups may or may not give an indication for that. This helps the team to check their combinations of bowling and batting, though winning the match is not the motive of warm up matches. The primary purpose is to find the right combination before the start of the WC.Agreed, the results of these matches don't have value but a players get a good sense of the place, the field and the opponent. Not just the player, those who organizers also receive ideas about the pitch. Basically it is a match where a player's performance can be observed or get a surface idea about the whole condition. Some players have no interest in playing that match. Though there is no obligation but it can be said that warm matches are very important for starting any tournament.Everyone is just saying that this match has no value or that this match has no importance but when the players of any country go on the field to represent their country against the opposition but they don't want them to lose. We saw Sri Lanka try their best. We saw Bangladesh try their best. Both teams tried but those who performed better won. We always just calculate the ledger whether we can go to the next round due to winning this match or if we win this match we will get points, if we lose how many points we have lost all the time we have to calculate beyond these things, those who are their best. Couldn't get back into rhythm I saw all those players found their rhythm for Bangladesh don't you think this kind of result in this match will encourage them in future. Every match is important to the players and everyone is on the field to win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noormcs5",
      "created_time": "September 30, 2023, 06:07:04 AM",
      "body": "Quote from: Fuso.hp on September 30, 2023, 05:12:08 AMEveryone is just saying that this match has no value or that this match has no importance but when the players of any country go on the field to represent their country against the opposition but they don't want them to lose. Just to be clear, I am not saying that these warm up matches are not important for the teams or the players. Players do need match practices and these practice matches are a blessing for them. I was saying this from the spectator's point of view. You would not be willing to watch all day long, the player practice in the nets or would you?I had a different perspective in mind when i said that these matches have no value.  I specifically mean \"No value\" for the viewers like me and you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}