{
  "id": "topic_5424408",
  "title": "Portocervo777",
  "author": "Portocervo777",
  "created_time": "November 29, 2022, 11:22:55 PM",
  "content": "im trader and If i see something ill notice right to way. about SOLANA the price of SOL are very low. the fact that SOL are very well known coin and right now TA analysis shows it's very oversold zone. there is a lot buying pressure becouse traders see that SOL are so low this price allready atracts a lot buyers in. to be very honest i dont think sol can really stay that low for too long when coin price falling that low then the law of gravitation upward will take over and sol can move very fast to 22$-25$ price range right now i don't see any lower resitance then 25$ anyways let's see but to be honest im buying here becouse its really low now. but first i want to see if it can confirm the 14$ price to brake over 14.70$ then the next price could be 16$-17$   when the SOL can move who knows but one thing is for sure there is a lot buying pressure and strong support zone now.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5424408",
  "comments": [
    {
      "author": "mk4",
      "created_time": "November 30, 2022, 03:51:16 AM",
      "body": "SOL is oversold(imo) because it's heavily affiliated with FTX/Alameda. It doesn't deserve the #18 spot in my opinion, taking note that chains that have far less activity has higher marketcaps(XRP, ADA, etc).It's slightly justifiable though, knowing that FTX/Alameda has a good chunk of SOL. There are fears of liquidation obviously.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Portocervo777",
      "created_time": "November 30, 2022, 08:27:41 AM",
      "body": "Quote from: mk4 on November 30, 2022, 03:51:16 AMSOL is oversold(imo) because it's heavily affiliated with FTX/Alameda. It doesn't deserve the #18 spot in my opinion, taking note that chains that have far less activity has higher marketcaps(XRP, ADA, etc).It's slightly justifiable though, knowing that FTX/Alameda has a good chunk of SOL. There are fears of liquidation obviously.That's true but RIGHT now Im waiting If it can brake the 14.70$ the key price so the bullish trend can be confirmed then.Oversold by RSI put a lot pressure on the price and it can break out suddenly. No matter what's the news TA Analysis are king in trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "November 30, 2022, 12:16:55 PM",
      "body": "Quote from: mk4 on November 30, 2022, 03:51:16 AMSOL is oversold(imo) because it's heavily affiliated with FTX/Alameda. It doesn't deserve the #18 spot in my opinion, taking note that chains that have far less activity has higher marketcaps(XRP, ADA, etc).SBF owns $50 million worth of solana was what I read but I do not know how true it is, definitely Solana price decreased because of SBF link to FTX and Alameda and because of the fail of FTX and Alameda.FTT which was FTX token decreased from $22 to less than $1.53 in just a single day CZ did not buy FTX, but Solana decreased from around $38 in four days to $9. But does this mean Solana will never rise again? Yet in the 8 position still means how strong the coin is, see what happened to Luna.As for me, the best coin to buy is bitcoin because it is the one that is not centralized among them all, but if going for altcoin, I think going for Solana as part of the altcoins you want to buy is good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "November 30, 2022, 05:47:04 PM",
      "body": "Quote from: Oshosondy on November 30, 2022, 12:16:55 PMQuote from: mk4 on November 30, 2022, 03:51:16 AMSOL is oversold(imo) because it's heavily affiliated with FTX/Alameda. It doesn't deserve the #18 spot in my opinion, taking note that chains that have far less activity has higher marketcaps(XRP, ADA, etc).SBF owns $50 million worth of solana was what I read but I do not know how true it is, definitely Solana price decreased because of SBF link to FTX and Alameda and because of the fail of FTX and Alameda.-cut-It's not only about what FTX, SBF or Alameda research own that they would be dumping. In addition to that there's ton of fear for any token SFB and any links to. Just fear, and it doesn't need to be based on anything concrete but it will still move markets. And SOL was strongly linked to Sam. He even bragged about buyng ton of it in twitter in the early days of SOL when it was dumping.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "December 01, 2022, 05:53:44 PM",
      "body": "The TA you do on SOL doesn't matter because it is something that may crash later on and that is what matters. If there is a problem with the team or the chain itself then it could crash. While it may look like something good in the long run, it doesn't sound like a great thing in the short term at all, it would really be something troublesome if we just look at the charts and nothing more.There are so many coins and tokens that has a good chart, but the team behind it is shady, I believe the team behind SOL is not \"shady\" but they are not great, so they may fail and do something wrong that they shouldn't and just crash the price at any point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "December 01, 2022, 09:16:01 PM",
      "body": "I guess when a project is affiliate to the collapse of FTX, it might be doomed just like what we have seen in Solana. And prior to that, just in August, lots of their wallets have been drain by the hackers.And I think that's where the problem starts, when project gets hack, investors lose their confidence on that project.So goodluck with your analysis and buying of Solana, as for me, I will stay away from this project for the meantime.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "December 02, 2022, 02:54:24 AM",
      "body": "Quote from: Portocervo777 on November 29, 2022, 11:22:55 PMbut first i want to see if it can confirm the 14$ price to brake over 14.70$ then the next price could be 16$-17$   (.....) Here's my technical analysis for Solana, for me, I agree with OP that Solana is really oversold. But for me, it's a good buy starting now every time Solana drops below $13. Since I believe, if Bitcoin still continues dropping will not be able to regain the $20,000 level. All altcoins too are affected and continue to dump.For fundamental side, FTX Exchange really fcked up Solana, that's what another reason why Solana is extremely oversold right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "December 03, 2022, 04:49:22 AM",
      "body": "Yes, I do agree that it was on the oversold region for many months and yet those who make TA thinks that they are still going to make in this bear market?And now that they have been exposed as somewhat connected to SBF and FTX, now the price is going down hard and I don't see it recovering, or worst it may not recover till the next bull run.So as others have said, it might break $14.70, so far the price is still below that price range.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chato1977",
      "created_time": "December 03, 2022, 07:22:29 AM",
      "body": "I use to trust solana last year but now ? with what happened to the to FTX? I am not sure if there is a best result about this project , SOL  had been affected to what is the result of ftx so there will be more dumping to come in the coming days or years so this TA does not really bring any good to investors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "doomloop",
      "created_time": "December 03, 2022, 09:53:03 AM",
      "body": "Quote from: Chato1977 on December 03, 2022, 07:22:29 AMI use to trust solana last year but now ? with what happened to the to FTX? I am not sure if there is a best result about this project , SOL  had been affected to what is the result of ftx so there will be more dumping to come in the coming days or years so this TA does not really bring any good to investors.Sol isn't the only coin that is affected by the FTX crash. There is also btc, so will that means you don't trust btc anymore? No man, that shouldn't be our mentality. Solana is still one of the top coins and there are no news that it is now turning into a scam so you shouldn't drop the support for this coin however just before FTX collapse I heard that solana had some issues but it was already fixed so the confidence of the solana supporters are once again restored.The FTX drama is almost over so I expect that price of the coins are now going to recover especially now that we are on the last month of the year. There might be great surprises that will come later on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TastyChillySauce00",
      "created_time": "December 03, 2022, 03:30:48 PM",
      "body": "To be honest FTX has a very important role for solana as it was always promoting solana. The fact that FTX owned lots of SOL in the past. FTX's impact to the solana was very big as the price has been dumping a lot. It was loosing more than 50% in a short time due to the FTX. There was also another problem that happened with solana just like when it was getting shutdown due to the shortage. that makes people were also unable to do something with their assets as they can't access the blockchain. Basically solana has a problem but FTX as a backer made people believe in solana even though that blockchain has been doing down so many times and it's very centralized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seleme",
      "created_time": "December 03, 2022, 09:53:57 PM",
      "body": "Over $15 can be indicator for bullish market but investors have to wait for end of FTX storm. SOL is good project and has some future perspective but about Technical analysis I dunno it works. Just drawing random lines or spotting patterns have no effect on predicting market, it is all about whales and money flow, IMHO. As forex trader, I believe the effect of TA on regulated stock and foreign exchange markets but in crypto markets it is simply unpredictable due to lack of many variables.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "December 04, 2022, 11:30:50 PM",
      "body": "There's something that stops me from buying SOL even if it's just a little amount of it. The news that has been with the outage of its network, makes me stop investing in it. Well, analyses here and there are good stuff to read from someone who may want or want not to invest in SOL. It's another reference to being a source of the decision whether it'll be a good coin to buy or not. Additionally, those opinions that I've read of it, as usual, they're mixtures of good and bad as well as neutral.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoYar",
      "created_time": "December 05, 2022, 11:23:03 AM",
      "body": "Quote from: Portocervo777 on November 29, 2022, 11:22:55 PMthe fact that SOL are very well known coin and right now TA analysis shows it's very oversold zone. There is no doubt that Solana is a well-known project and it is one of those projects whose ecosystem has grown very quickly. But it is also a fact that its biggest supporter FTX exchange is now bankrupt. Quote from: Portocervo777 on November 29, 2022, 11:22:55 PManyways let's see but to be honest im buying here becouse its really low now.  I heard that its investors' tokens are going to be unlocked if thats true then, we should wait as VCs/early investors will dump it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "December 06, 2022, 09:09:00 PM",
      "body": "I think that now to evaluate Solana on some technical analysis, it is like guessing on coffee grounds. The proceedings with Alameda and FTX are not over yet, the consequences for SBF are not completely clear, so the evaluation of assets, which are related to SBF should be based only on fundamental analysis. If new details emerge now regarding Alameda, your whole technical analysis with its levels will collapse like a house of cards. One piece of news can change everything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ScamViruS",
      "created_time": "December 06, 2022, 10:28:59 PM",
      "body": "FTX matters are not over. And Solana is connected to Ftx since Sam's name is associated with the Solana project. So in this situation it is very difficult to come to any conclusion after technical analysis of Sol. Because if any more secrets of Ftx are leaked suddenly, it will have a direct effect on Sol. If something more negative comes out against ftx, now there will be no time to think about Solana.So I think Solana's market is not stable yet. There are many more solid projects in the market and it would be better to look for them than to bother with sol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "December 07, 2022, 12:25:46 PM",
      "body": "the title is redundant , TA means Technical Analysis already and there is no need to mention that word again from abbreviation .______________________________Now solana? I think this has nothing to do good in the coming days as the FTX comes dying and this will effect the project totally .so if i were you better to keep out or a while unless  you are a complete supporter and willing to trust the coin even if it dies down for the next coming years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "December 08, 2022, 05:06:32 AM",
      "body": "The issue with solana is that FTX holds a large amount in locked coins. These coins will be sold at the market when the liquidator start to sell anything of value. There is going to be huge sell pressure.I think they own maybe $500M now worth, if it ever goes to like $100-150 a coin , there is going to be billions dumped by the liquidators to give to the creditors. The future is not looking good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "December 14, 2022, 05:41:23 PM",
      "body": "Quote from: GreatArkansas on December 02, 2022, 02:54:24 AM-cut- Here's my technical analysis for Solana, for me, I agree with OP that Solana is really oversold. But for me, it's a good buy starting now every time Solana drops below $13. Since I believe, if Bitcoin still continues dropping will not be able to regain the $20,000 level. All altcoins too are affected and continue to dump.For fundamental side, FTX Exchange really fcked up Solana, that's what another reason why Solana is extremely oversold right now.As you said, SOL fundamentals are f*ked up and oversold doesn't mean it couldn't be more oversold. So your chart could be huge bear flag as well. I might buy it when it's under $5 like sam famously did, but i am not going to rush in now. Ironically Sam Bankman said last august that SOL was the most underrated token and after few months he managed to crash it down by himself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}