{
  "id": "topic_5477436",
  "title": "red4slash",
  "author": "red4slash",
  "created_time": "December 11, 2023, 01:11:13 PM",
  "content": "Oktober lalu kita memiliki sebuah drama dimana banyak sekali pedagang online yang mulai mengeluh tentang ditutupnya tiktokshop dari pasar e-commerce yang padahal disana banyak sekali para pelaku UMKM yang menjajakan pasarnya lewat digital karena memang beberapa masalah terutama masalah perizinan yang tidak bisa dilakukan oleh Tiktok sebelumnya (karena Tiktok hanya melakukan perizinan tentang media sosial) membuat mereka harus ditutup sementara di bulan Oktober lalu.Saat ini ada pemberitaan yang menarik tentang hal ini karena mulai besok tanggal 12 Desember dikatakan bahwa tiktok shop akan dibuka kembali walaupun dengan skema yang sedikit berbeda.Yang membuat ini menjadi menarik adalah karena Tiktok tidak main-main sekarang untuk mengembangkan E-commerce mereka mengingat saat ini Tiktok langsung Bersinergi dengan PT GoTo Gojek Tokopedia Tbk (GoTo) untuk kemitraan secara strategis dalam mengembangkan pasar e-commerce yang mana hal ini terjadi karena Tiktok mengakuisisi sebagian besar saham Tokopedia beberapa waktu lalu. Quote from: https://katadata.co.id/desysetyowati/digital/65766e4c7ea21/tiktok-akuisisi-tokopedia-dari-goto-nilainya-ditaksir-rp-22-5-triliunTikTok akan menginvestasikan lebih dari US$ 1,5 miliar atau sekitar Rp 22,5 triliun. Ini sebagai komitmen jangka panjang untuk mendukung operasional Tokopedia, tanpa dilusi lebih lanjut pada kepemilikan GoTo di Tokopedia.Dengan hal ini secara tidak langsung selain dari nama tiktok ini sendiri sepertinya tiktok akan merubah skema baru dalam e-commerce mereka karena akan langsung bersanding dengan tokopedia sebagai bentuk pengembangan bisnis yang mereka lakukan.Saya rasa ini akan menjadi langkah cerdas dari segi ekonomi karena saat ini Tokopedia adalah salah satu e-ccomerce terbesar yang di minati di Indonesia dengan bergabungnya atau dengan adanya tiktok sebagai penambah kekuatan mereka saat ini bisa saja mereka akan semakin diminati dan bahkan menjadi penguasa untuk E-Commerce yang mana kita tahu saat ini persaingan Shoppe dan Tokopedia sebenarnya cukup sengit untuk perebutan E-commerce terbaik.Lantas apakah dengan yang terjadi sekarang apakah ini akan membuat pelaku UMKM akan mendapatkan hak mereka kembali serta apakah ini akan menguntungkan? terlebih kita tahu banyak sekali mereka (para pedagang offline) yang memang berada di pasar terutama pasar tanah abang yang sebelumnya menuntut bahwa E-Commerce di tutup karena dianggap mengganggu mereka selalu resah dengan tiktok dan e-commerce lainnya. apakah ini akan membuat kisruh kembali antara pedagang online dan offline di salah satu pasar sama seperti yang terjadi beberapa waktu lalu yang memang selalu saja ada pro kontra di media sosial?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477436",
  "comments": [
    {
      "author": "Furious 7",
      "created_time": "December 11, 2023, 01:24:10 PM",
      "body": "Pengakuisisian ini tejadi karena dampak menurunnya saham Go To yang memang mengharuskan mereka memikirkan cara yang tepat untuk tetap berjalan dengan baik dan memang hal yang terjadi adalah mereka merelakan tokopedia yang di akuisisi sebesar 75 persen oleh ByteDance yang notabene adalah perusahaan induk dibalik platform Tiktok.Ini jelas menguntungkan untuk Tiktok karena mereka sekarang bisa kembali menjalankan kembali E-commerce tanpa takut terhambat perizinan dari Kementrian perdagagangan (Kemendag) yang memang menjadi masalah awal kenapa mereka harus rela menutup tiktokshop sebelumnya.Ini jelas menjadi kabar yang sangat menggembirakan untuk mereka yang berada di ruang lingkup tiktok shop karena mereka bisa kembali membuka lembran baru dengan berjualan di tiktok shop seperti yang mereka lakukan sebelumnya selain itu, memang ini akan membuat persaingan e-commerce sepertinya menjadi menarik karena aplikasi ijo dan orange akan kembali bersaing untuk membuktikan diri siapa yang lebih besar karena dengan adanya sumber daya baru dari ByteDance dengan nominal yang cukup besar.Adapun tentang permasalahan yang terjadi antara para pedagang offline yang memang mengharapkan e-commerce di tutup saya rasa itu tidak akan munkgin bisa terjadi sekalipun mereka menginginkan hal itu karena secara tidak langsung ini menutup peluang usaha orang lain serta mengintervensi adanya inovasi yang terjadi dalam pertumbuhan ekonomi.Justru dengan adanya opsi online dalam perdagangan harusnya mereka juga melakukan hal seperti itu untuk dagangan mereka bukan menutup suatu inovasi agar mereka terus bisa berwirausaha (berdagang) karena bagaimanapun juga ini adalah tantangan bisnis yang memang mau tidak mau itu harus dijalani.Kita hidup semakin canggih sehingga daripada menutup diri dengan teknologi dan inovasi yang baru dan hanya ingin hidup stagnant seperti ini maka akan lebih baik untuk mencoba bersaing secara sehat dengan memanfaatkan sumber daya yang telah ada karena pada akhirnya rezeki juga tidak akan tertukar serta sudah ada yang mengatur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "December 11, 2023, 02:37:24 PM",
      "body": "langkah tiktok shop untuk kembali ke pasar indonesia sudah bisa ditebak dari awal. mana mungkin mereka mau meninggalkan \"ladang basah\" dengan cuma-cuma, pasti mereka akan kembali ke pasar indonesia menggandeng e-commerce lain dalam operasionalnya. ya, itu cukup bagus sih karena tiktok shop sudah mendukung banyak umkm di indonesia pada operasionalnya beberapa waktu lalu. tiktok shop juga membantu pelanggan dalam berbelanja langsung dari live dan promo-promonya juga lebih menarik, apalagi promo gratis ongkirnya itu yang paling ditunggu.mungkin kembali beroperasinya tiktok shop ini akan disambut negatif oleh penjual offline karena mereka merasa terancam dan takut produk mereka tidak laku. namun saya pikir jika penjual offline merasa terancam dengan tiktok shop, mengapa tidak bergabung saja dengan tiktok shop? toh juga sistemnya sudah berubah sekarang dan lebih baik. jika tidak mau bersaing lagi dengan tiktok shop, itu resiko sendiri sih karena barang-barang di tiktok shop juga sudah berasal dari dalam negeri dan harganya sudah diatur menyesuasikan e-commerce tokped, jadi tidak ada lagi alasan penjual offline untuk memprotes operasional tiktok shop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "masulum",
      "created_time": "December 11, 2023, 03:46:54 PM",
      "body": "Quote from: red4slash on December 11, 2023, 01:11:13 PM-snip-apakah ini akan membuat kisruh kembali antara pedagang online dan offline di salah satu pasar sama seperti yang terjadi beberapa waktu lalu yang memang selalu saja ada pro kontra di media sosial? Kisruh sudah pasti akan muncul, karena ini akan dianggap sebagai keputusan \"plin-plan\" pemerintah. padahal, ada atau tidak TikTok shop pun tidak mengubah kebiasaan pelanggan yang sudah bergeser dalam proses transaksi dari offline ke online. Tapi, apakah ini akan menjadi hambatan? tentu tidak, ada banyak hal yang bisa menjadi solusi, Misal, karena saat ini TikTok bekerja sama dengan GoTo, saya yakin pada tiktok shop nanti, sistem shopping tokopedia akan diintegrasi dengan tiktok. Jadi, produk yang ada di TikTok adalah produk yang dijual di Toped, mungkin lho ya ini, karena kita masih belum tahu tiktok shop yang baru ini sistemnya seperti apa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pusaka",
      "created_time": "December 12, 2023, 10:02:23 AM",
      "body": "Sebelumnya saya juga berpikir bahwa kemungkinan Tiktok Shop akan hadir kembali ditengah tengah kita, sebab penutupan beroperasinya Tiktok Shop beberapa waktu lalu karena mereka tidak memiliki izin untuk transaksi jual beli. Namun dari apa yang saya baca, sebenanya mereka juga belum memiliki izin e-comerce pada saat mereka mulai beroperasi ini. Namun dari apa yang saya kutip dari CNBC Indonesia,QuoteMenteri Perdagangan Zulkifli Hasan menegaskan bahwa TikTok itu bukan ecommerce. Oleh karena itu, TikTok tidak bisa menyediakan layanan jualan di platformnya.\"Jadi begini, ecommercenya itu Tokopedia. kerja sama dengan TikTok. Jadi TikTok itu dia tidak ecommerce, ecommerce-nya, jualannya, yang jualan Tokopedia,\" kata Mendag, Selasa (12/12/2023).Namun, ia menjelaskan pola kerja sama TikTok dan Tokopedia menggunakan teknologi tinggi. Oleh karena itu, kemitraan antara kedua perusahaan terlebih dulu melalui masa uji coba selama 3-4 bulan.https://www.cnbcindonesia.com/tech/20231212130447-37-496470/tiktok-shop-buka-tanpa-izin-ecommerce-ini-penjelasan-mendagJadi jika melihat dari apa yang disampaikan Mendag, bisa saja Tiktok Shop kembali ditutup atau justru akan berjalan seterusnya.Untuk polemik masyarakat yang mengeluh tentang kehadiran Tiktok Shop ini, saya pikir mereka juga harus menyesuaikan diri dengan perkembangan teknoligi digital agar mereka juga menjadi salah satu bagian orang yang bisa mendapatkan keuntungan disana. Sebab jika hanya protes dan keberatan, menurut saya itu tidak akan berdampak banyak, tetap saja mereka yang harus berusaha.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CK485",
      "created_time": "December 12, 2023, 01:51:52 PM",
      "body": "Quote from: moneystery on December 11, 2023, 02:37:24 PMlangkah tiktok shop untuk kembali ke pasar indonesia sudah bisa ditebak dari awal. mana mungkin mereka mau meninggalkan \"ladang basah\" dengan cuma-cuma, pasti mereka akan kembali ke pasar indonesia menggandeng e-commerce lain dalam operasionalnya. ya, itu cukup bagus sih karena tiktok shop sudah mendukung banyak umkm di indonesia pada operasionalnya beberapa waktu lalu. tiktok shop juga membantu pelanggan dalam berbelanja langsung dari live dan promo-promonya juga lebih menarik, apalagi promo gratis ongkirnya itu yang paling ditunggu.mungkin kembali beroperasinya tiktok shop ini akan disambut negatif oleh penjual offline karena mereka merasa terancam dan takut produk mereka tidak laku. namun saya pikir jika penjual offline merasa terancam dengan tiktok shop, mengapa tidak bergabung saja dengan tiktok shop? toh juga sistemnya sudah berubah sekarang dan lebih baik. jika tidak mau bersaing lagi dengan tiktok shop, itu resiko sendiri sih karena barang-barang di tiktok shop juga sudah berasal dari dalam negeri dan harganya sudah diatur menyesuasikan e-commerce tokped, jadi tidak ada lagi alasan penjual offline untuk memprotes operasional tiktok shop.Ada benernya juga sih gan, Quotemungkin kembali beroperasinya tiktok shop ini akan disambut negatif oleh penjual offline karena mereka merasa terancam dan takut produk mereka tidak laku. namun saya pikir jika penjual offline merasa terancam dengan tiktok shop, mengapa tidak bergabung saja dengan tiktok shop? toh juga sistemnya sudah berubah sekarang dan lebih baik. akan tetapi saya rasa bisa jadi itu karena dipengaruhi oleh pengusaha sewa gedung dan sejenisnya, jika offline tidak berjalan maka saya rasa sewa gedung tak di gunakan lagi, alhasil mereka pastinya mencari cara supaya sewa offline berjalan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "masulum",
      "created_time": "December 12, 2023, 03:12:31 PM",
      "body": "Quote from: CK485 on December 12, 2023, 01:51:52 PMakan tetapi saya rasa bisa jadi itu karena dipengaruhi oleh pengusaha sewa gedung dan sejenisnya, jika offline tidak berjalan maka saya rasa sewa gedung tak di gunakan lagi, alhasil mereka pastinya mencari cara supaya sewa offline berjalan.Tidak juga mas, banyak pelaku bisnis online yang baru muncul justru mengalami pertumbuhan bisnis yang pesat, sehingga mereka butuh gedung baru untuk digunakan sebagai gudang. Dalam hal ini, jika memang pelaku bisnis properti yang dikhususkan untuk bisnis misal ruko, maka mereka harus bisa mengakomodir penyewa untuk bisa ikut mengembangkan bisnisnya dalam bisnis online. Jika itu di suatu pasar, maka pengembang pasar/pemilik gedung dapat membuka layanan online yang mana barang-barangnya disesuaikan dengan apa yang ada di pasar/gedung tersebut. Tentu ini akan butuh waktu, khususnya untuk upload dan sebagainya dan bisa saja penjualnya tidak paham karena tidak memiliki perangkat atau gaptek. Maka dari itu, pengembang yang berkewajiban untuk mengupload secara bertahap. jika memang pemilik gedung merasa terancam akan bisnisnya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "red4slash",
      "created_time": "December 12, 2023, 09:18:28 PM",
      "body": "Quote from: Furious 7 on December 11, 2023, 01:24:10 PMJustru dengan adanya opsi online dalam perdagangan harusnya mereka juga melakukan hal seperti itu untuk dagangan mereka bukan menutup suatu inovasi agar mereka terus bisa berwirausaha (berdagang) karena bagaimanapun juga ini adalah tantangan bisnis yang memang mau tidak mau itu harus dijalani.Kita hidup semakin canggih sehingga daripada menutup diri dengan teknologi dan inovasi yang baru dan hanya ingin hidup stagnant seperti ini maka akan lebih baik untuk mencoba bersaing secara sehat dengan memanfaatkan sumber daya yang telah ada karena pada akhirnya rezeki juga tidak akan tertukar serta sudah ada yang mengatur. Saya sependapat dengan hal ini sebenarnya tetapi ketika berada di Indonesia sebenarnya kita sudah tahu watak di negara kita ini seperti apa untuk orang-orangnya karena memang kita terlalu nyaman dengan situasi dimana zona nyaman ada sehingga ketika ada sebuah hal baru maka sangat wajar akan ada penentangan termasuk hal ini.Alih-alih untuk berkompetisi dan memperbaiki merk dagang atau cara dalam berdagang justru kebanyakan dari masyarakat kita akan membuat cara yang lebih pintas dengan mencari alasan agar inovasi baru itu tidak ada karena tidak ingin direpotkan dengan inovasi baru yang memang akan merugikan mereka sendiri Ini menjadi masalah lain yang terjadi di sini karena memang kita terlalu menutup diri dengan yang namanya perkembangan zaman meskipun memang tidak semua seperti itu tetapi rata-rata yang terjadi seperti itu yang membuat kita sulit untuk beradaptasi dengan sesuatu yang baru atau dengan teknologi yang semakin canggih yang membuat kita jalan ditempat tanpa ada perkembangan.Quote from: masulum on December 11, 2023, 03:46:54 PMQuote from: red4slash on December 11, 2023, 01:11:13 PM-snip-apakah ini akan membuat kisruh kembali antara pedagang online dan offline di salah satu pasar sama seperti yang terjadi beberapa waktu lalu yang memang selalu saja ada pro kontra di media sosial? Kisruh sudah pasti akan muncul, karena ini akan dianggap sebagai keputusan \"plin-plan\" pemerintah. padahal, ada atau tidak TikTok shop pun tidak mengubah kebiasaan pelanggan yang sudah bergeser dalam proses transaksi dari offline ke online. Tapi, apakah ini akan menjadi hambatan? tentu tidak, ada banyak hal yang bisa menjadi solusi, Misal, karena saat ini TikTok bekerja sama dengan GoTo, saya yakin pada tiktok shop nanti, sistem shopping tokopedia akan diintegrasi dengan tiktok. Jadi, produk yang ada di TikTok adalah produk yang dijual di Toped, mungkin lho ya ini, karena kita masih belum tahu tiktok shop yang baru ini sistemnya seperti apa.Masalahnya untuk sekarang menyalahkan pemerintah juga percuma karena dengan akuisisi sebesar itu dari ByteDance selaku pemilik platform tiktok maka secara tidak langsung sekarang Tokopedia sudah menjadi bagian dari tiktok itu sendiri yang membuat pemerintah sudah tidak bisa mendapatkan alasan untuk menutup tiktokshop dengan alasan perizinan karena itu bisa dilakukan dengan mudah apalagi perizinan tokopedia juga sudah ada.Sebenarnya ini adalah tentang bagaimana strategi pasar dan mau tidak mau para pedagang offline online harus siap dan menerima dengan kemajuan teknologi sekarang jika memang ingin tetap menjadi pedagang yang bisa menguntungkan karena bagaimanapun sekarang ini tingkat konsumtif kita sangat tinggi sehingga daripada kita berfokus dengan menutup diri dengan sistem yang ada maka lebih baik kita lebih bisa untuk mengupgrade diri agar bisa menyaingi penjual lain dengan trik kita sendiri dengan memanfaatkan kemajuan teknologi sekarang.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "December 13, 2023, 02:18:32 AM",
      "body": "Quote from: red4slash on December 11, 2023, 01:11:13 PMLantas apakah dengan yang terjadi sekarang apakah ini akan membuat pelaku UMKM akan mendapatkan hak mereka kembali serta apakah ini akan menguntungkan? terlebih kita tahu banyak sekali mereka (para pedagang offline) yang memang berada di pasar terutama pasar tanah abang yang sebelumnya menuntut bahwa E-Commerce di tutup karena dianggap mengganggu mereka selalu resah dengan tiktok dan e-commerce lainnya. apakah ini akan membuat kisruh kembali antara pedagang online dan offline di salah satu pasar sama seperti yang terjadi beberapa waktu lalu yang memang selalu saja ada pro kontra di media sosial? Entah kenapa pedagang offline tidak segera move on ke online?, kalau mereka tetap bertahan di offline, ane yakin mereka akan tumbang dengan cepat. Ane malah tidak habis pikir, kesempatan mereka untuk ngikut berjualan online itu besar, mereka bisa mulai dari sekarang dengan mengikuti cara berjualan yang sudah ada. Ya tentu tidak usah ambil untung banyak, yang penting cari pelanggan dulu. Zaman sekarang kalau sudah banyak pelanggan walau untung kecil sekalipun akan jadi bukit juga.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "December 13, 2023, 02:28:58 AMLast edit: December 13, 2023, 02:52:12 AM by Renampun",
      "body": "Quote from: masulum on December 11, 2023, 03:46:54 PMQuote from: red4slash on December 11, 2023, 01:11:13 PM-snip-apakah ini akan membuat kisruh kembali antara pedagang online dan offline di salah satu pasar sama seperti yang terjadi beberapa waktu lalu yang memang selalu saja ada pro kontra di media sosial? Kisruh sudah pasti akan muncul, karena ini akan dianggap sebagai keputusan \"plin-plan\" pemerintah. padahal, ada atau tidak TikTok shop pun tidak mengubah kebiasaan pelanggan yang sudah bergeser dalam proses transaksi dari offline ke online. Tapi, apakah ini akan menjadi hambatan? tentu tidak, ada banyak hal yang bisa menjadi solusi, Misal, karena saat ini TikTok bekerja sama dengan GoTo, saya yakin pada tiktok shop nanti, sistem shopping tokopedia akan diintegrasi dengan tiktok. Jadi, produk yang ada di TikTok adalah produk yang dijual di Toped, mungkin lho ya ini, karena kita masih belum tahu tiktok shop yang baru ini sistemnya seperti apa.saya membuka toko online di shopee dan tiktok dan jujur saja semua produk yang saya jual berasal dari tokopedia, yah di tokopedia ada fitur jual sebagai reseler atau dropshipper, ini yang sebenarnya sangat menguntungkan para penjual, nah sejak awal pun saya yakin bahwa tiktok shop bakal bisa beroperasi kembali di indonesia namun dengan trik lain, dan terbukti mereka menjalin kerja sama dengan tokopedia, sebenarnya saya merasa dengan kehadiran tiktok shop ada banyak ekonomi warga yang terbantu hanya saja para pedagang offline yang mengeluh karena dagangan mereka sepi, kalo saja mereka juga berjualan online pasti dagangan mereka bakal rame juga.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MiauKitchen",
      "created_time": "December 13, 2023, 08:03:32 AM",
      "body": "Quote from: Renampun on December 13, 2023, 02:28:58 AMQuote from: masulum on December 11, 2023, 03:46:54 PMQuote from: red4slash on December 11, 2023, 01:11:13 PM-snip-apakah ini akan membuat kisruh kembali antara pedagang online dan offline di salah satu pasar sama seperti yang terjadi beberapa waktu lalu yang memang selalu saja ada pro kontra di media sosial? Kisruh sudah pasti akan muncul, karena ini akan dianggap sebagai keputusan \"plin-plan\" pemerintah. padahal, ada atau tidak TikTok shop pun tidak mengubah kebiasaan pelanggan yang sudah bergeser dalam proses transaksi dari offline ke online. Tapi, apakah ini akan menjadi hambatan? tentu tidak, ada banyak hal yang bisa menjadi solusi, Misal, karena saat ini TikTok bekerja sama dengan GoTo, saya yakin pada tiktok shop nanti, sistem shopping tokopedia akan diintegrasi dengan tiktok. Jadi, produk yang ada di TikTok adalah produk yang dijual di Toped, mungkin lho ya ini, karena kita masih belum tahu tiktok shop yang baru ini sistemnya seperti apa.saya membuka toko online di shopee dan tiktok dan jujur saja semua produk yang saya jual berasal dari tokopedia, yah di tokopedia ada fitur jual sebagai reseler atau dropshipper, ini yang sebenarnya sangat menguntungkan para penjual, nah sejak awal pun saya yakin bahwa tiktok shop bakal bisa beroperasi kembali di indonesia namun dengan trik lain, dan terbukti mereka menjalin kerja sama dengan tokopedia, sebenarnya saya merasa dengan kehadiran tiktok shop ada banyak ekonomi warga yang terbantu hanya saja para pedagang offline yang mengeluh karena dagangan mereka sepi, kalo saja mereka juga berjualan online pasti dagangan mereka bakal rame juga.Saya gak pernah sih belanja di tiktokshop satu kali pun(yang kata nya lebih murah dari toko-toko online lainnya).Dengan dibukanya tiktokshop,pasti akan menimbulkan perbinycangan baru lagi dikalangan masyarakat khususnya pedagan offline.Tapi mudah-mudahan untuk tiktokshop yang sekarang ini soal harga dan lainnya bisa lebih bijak lagi ya,menyetarakan dengan toko-toko online lainnya(karena untuk di toko online lain misal lazada itu untuk sekarang ini ongkosnya saja sudah 20rb).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "masulum",
      "created_time": "December 13, 2023, 02:01:22 PM",
      "body": "Quote from: MiauKitchen on December 13, 2023, 08:03:32 AMSaya gak pernah sih belanja di tiktokshop satu kali pun(yang kata nya lebih murah dari toko-toko online lainnya).Dengan dibukanya tiktokshop,pasti akan menimbulkan perbinycangan baru lagi dikalangan masyarakat khususnya pedagan offline.Tapi mudah-mudahan untuk tiktokshop yang sekarang ini soal harga dan lainnya bisa lebih bijak lagi ya,menyetarakan dengan toko-toko online lainnya(karena untuk di toko online lain misal lazada itu untuk sekarang ini ongkosnya saja sudah 20rb).Kalau bisa saya katakan, untuk harga tidak sepenuhnya murah juga. Ini bergantung pada subsidi yang diberikan oleh tiktok untuk masing-masing toko. Kadang juga ada yang lebih murah di shopee dengan barang yang sama. Jadi, murah atau tidaknya itu relatif sih. Yang membuat tiktokshop rame sih emang karena dulu sistem afiliasinya yang lebih baik daripada di marketplace lainnya. Tapi ga tau juga untuk sekarang. Ongkos kirim yang ditanggung oleh Tiktok (promo free ongkir) pun sejatinya tidak ada yang spesial. Kalau misalkan di Lazada kena ongkir, mungkin mereka tidak punya lagi budget untuk promosi ongkir dengan besar. Yang pasti, dengan penjualan koin Tiktok, saya pikir ini menguatkan Tiktok untuk memberikan free ongkir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayu7adi",
      "created_time": "December 14, 2023, 12:08:17 AM",
      "body": "Untuk masalah ini bakal berdampak positif atau negatif untuk warga Indonesia, jelas yang menentukan adalah sikap warga untuk menyambut TikTok Shop ini sendiri. Re-start yang di lakukan TikTok Shop x GoTo jelas bukan tanpa tujuan, karena itulah persaingan marketplace dan e-commerce semakin panas sehingga menurut saya perekonomian bisa berkembang lebih baik. Selama banyak orang yang punya smartphone dan mereka gratis buat unduh aplikasi belanja online, saya yakin peminat nya akan tetap banyak dan tidak berkurang meski ada satu atau dua platform di tutup.Cara transaksi secara online sudah lama jadi penantang transaksi offline, sedangkan di ruang platform online, TikTok jadi penantang buat Shopee, Lazada, BL bahkan banyak juga yang membuat isu menantang Amazon juga. Kalau melihat perkembangannya, ini possible banget buat terjadi.Sebagai konsumen pun ane lebih condong beli barang secara online yang bisa di beli dengan aman saja. Jadi ga semua barang lebih prefer ke belanja online. Masih ada banyak barang lain yang ane lebih suka beli secara offline, seperti barang yang volume dan berat nya besar, atau barang yang cocok-cocokan sesuai dengan karakter ane supaya bisa coba langsung di TKP seperti raket badminton, sarung tangan, celana panjang dll. Jadi, seharusnya pasar untuk jual beli offline masih ada, namun jumlahnya jelas berkurang. Tinggal seberapa kreatif saja penjual masa kini.Bisa dikatakan era sudah semakin hari semakin berubah, kalau kita tidak bisa menyesuaikan dengan perkembangan era, maka jangan marah juga kalau kita ketinggalan. TikTok Shop bikin era baru dengan kombinasi platform sosial + e-commerce, dan terbukti laku di pasaran Indonesia karena promonya yang juga menarik.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MiauKitchen",
      "created_time": "December 14, 2023, 07:17:25 AM",
      "body": "Quote from: masulum on December 13, 2023, 02:01:22 PMQuote from: MiauKitchen on December 13, 2023, 08:03:32 AMSaya gak pernah sih belanja di tiktokshop satu kali pun(yang kata nya lebih murah dari toko-toko online lainnya).Dengan dibukanya tiktokshop,pasti akan menimbulkan perbinycangan baru lagi dikalangan masyarakat khususnya pedagan offline.Tapi mudah-mudahan untuk tiktokshop yang sekarang ini soal harga dan lainnya bisa lebih bijak lagi ya,menyetarakan dengan toko-toko online lainnya(karena untuk di toko online lain misal lazada itu untuk sekarang ini ongkosnya saja sudah 20rb).Kalau bisa saya katakan, untuk harga tidak sepenuhnya murah juga. Ini bergantung pada subsidi yang diberikan oleh tiktok untuk masing-masing toko. Kadang juga ada yang lebih murah di shopee dengan barang yang sama. Jadi, murah atau tidaknya itu relatif sih. Yang membuat tiktokshop rame sih emang karena dulu sistem afiliasinya yang lebih baik daripada di marketplace lainnya. Tapi ga tau juga untuk sekarang. Ongkos kirim yang ditanggung oleh Tiktok (promo free ongkir) pun sejatinya tidak ada yang spesial. Kalau misalkan di Lazada kena ongkir, mungkin mereka tidak punya lagi budget untuk promosi ongkir dengan besar. Yang pasti, dengan penjualan koin Tiktok, saya pikir ini menguatkan Tiktok untuk memberikan free ongkir. Mungkin ada + dan - nya ya untuk masing-masing marketplace,tapi teman-teman saya pada nyaranin udah deh jangan pernah sekali-kali belanja di tiktokshop,saya tanya kenapa? Mereka bilang takut nya saya keracunan(kecanduan),pengen belanja mulu kata nya di tiktokshop 😅,emang iya sampe segitu nya,tapi saya juga gak pernah penasaran sih walau cuma liat-liat saja,akun tiktok udah pernah punya dulu,untuk sekarang kurang tertarik(menurut saya liat tiktok itu kuota suka boros banget).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CK485",
      "created_time": "December 14, 2023, 02:28:40 PM",
      "body": "Quote from: masulum on December 12, 2023, 03:12:31 PMQuote from: CK485 on December 12, 2023, 01:51:52 PMakan tetapi saya rasa bisa jadi itu karena dipengaruhi oleh pengusaha sewa gedung dan sejenisnya, jika offline tidak berjalan maka saya rasa sewa gedung tak di gunakan lagi, alhasil mereka pastinya mencari cara supaya sewa offline berjalan.Tidak juga mas, banyak pelaku bisnis online yang baru muncul justru mengalami pertumbuhan bisnis yang pesat, sehingga mereka butuh gedung baru untuk digunakan sebagai gudang.Iya gan mungkin itu bagi pengusaha yang memang sudah harus menggunakan gudang untuk penyimpanan produk, cuman kenyataannya disituasi sekarang ruko tidak begitu digunakan atau jarang-jarang digunakan karena ruko itu rata-rata ruangan nya kecil/terbatas.Quote from: masulum on December 12, 2023, 03:12:31 PMini akan butuh waktu, khususnya untuk upload dan sebagainya dan bisa saja penjualnya tidak paham karena tidak memiliki perangkat atau gaptek. Maka dari itu, pengembang yang berkewajiban untuk mengupload secara bertahap. jika memang pemilik gedung merasa terancam akan bisnisnya.Saya rasa orang yang anda maksud \"gaptek\" memang akan kesulitan dalam hal membangun usahanya secara online. Dan memang betul yang anda katakan Quotemaka mereka harus bisa mengakomodir penyewa untuk bisa ikut mengembangkan bisnisnya dalam bisnis online.jika tidak saya rasa mungkin semua itu akan terhambat dalam perjalanan usaha mereka terlebih dijaman sekarang itu hampir semua serba online.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GoldMagic",
      "created_time": "December 15, 2023, 05:59:40 AM",
      "body": "Quote from: pusaka on December 12, 2023, 10:02:23 AMSebelumnya saya juga berpikir bahwa kemungkinan Tiktok Shop akan hadir kembali ditengah tengah kita, sebab penutupan beroperasinya Tiktok Shop beberapa waktu lalu karena mereka tidak memiliki izin untuk transaksi jual beli. Namun dari apa yang saya baca, sebenanya mereka juga belum memiliki izin e-comerce pada saat mereka mulai beroperasi ini. Namun dari apa yang saya kutip dari CNBC Indonesia,QuoteMenteri Perdagangan Zulkifli Hasan menegaskan bahwa TikTok itu bukan ecommerce. Oleh karena itu, TikTok tidak bisa menyediakan layanan jualan di platformnya.\"Jadi begini, ecommercenya itu Tokopedia. kerja sama dengan TikTok. Jadi TikTok itu dia tidak ecommerce, ecommerce-nya, jualannya, yang jualan Tokopedia,\" kata Mendag, Selasa (12/12/2023).Namun, ia menjelaskan pola kerja sama TikTok dan Tokopedia menggunakan teknologi tinggi. Oleh karena itu, kemitraan antara kedua perusahaan terlebih dulu melalui masa uji coba selama 3-4 bulan.https://www.cnbcindonesia.com/tech/20231212130447-37-496470/tiktok-shop-buka-tanpa-izin-ecommerce-ini-penjelasan-mendagJadi jika melihat dari apa yang disampaikan Mendag, bisa saja Tiktok Shop kembali ditutup atau justru akan berjalan seterusnya.Untuk polemik masyarakat yang mengeluh tentang kehadiran Tiktok Shop ini, saya pikir mereka juga harus menyesuaikan diri dengan perkembangan teknoligi digital agar mereka juga menjadi salah satu bagian orang yang bisa mendapatkan keuntungan disana. Sebab jika hanya protes dan keberatan, menurut saya itu tidak akan berdampak banyak, tetap saja mereka yang harus berusaha. Gak ada habisnya ya membicarakan tiktokshop ini, kemarin demo minta tiktokshop di tutup,sekarang sudah dibuka kembali,dan menjadi perbincangan hangat lagi di kalangan masyarakat (terutama pedagan offline),ada yang senang dan ada juga yang merasa tidak senang,entah lah masih menjadi permasalahan dan belum ada jalan keluarnya, khusus nya untuk pedagan-pedagan offline.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ryu_Ar1",
      "created_time": "December 15, 2023, 02:32:31 PM",
      "body": "Saya menerima email ini beberapa hari lalu dan memang sekarang saya dan partner saya sudah bisa memulai kembali untuk berjualan di tiktok karena memang dengan beberapa kondisi yang terjadi saat ini memungkinkan untuk Tiktok membuka kembali tiktokshop mereka karena saat ini jika melihat dari apa yang terjadi ini seperti saat ini untuk Tiktok dan tokopedia sebenarnya ini saya rasa adalah cara cerdas mereka yang memiliki uang berbisnis terutama untuk bytedance yang notabene adalah pemilik dari tiktok.Dengan pengakuisisian yang dilakukan maka secara tidak langsung saat ini mereka tidak perlu direpotkan dengan perizinan meskipun pasti ada formalitas yang terjadi tetapi ini tidak akan terlalu di persulit terlebih sudah ada nama besar tokopedia yang notabene adalah salah satu e-commerce terbesar di Indonesia saat ini.Adapun untuk masalah persaingan dagang antara yang online dan offline sebenarnya sekarang tergantung dari kita sebagai pelaku UMKM yang memang harus melakukan pengupgrade an diri karena seperti yang anda OP katakan. Saat ini dunia semakin canggih dan alat-alat sekarang sudah semakin modern sehingga dalam hal ini mindset kita perlu di ubah dan cara pandang kita terhadap kemajuan teknologi harus sedikit lebih di perbaiki karena bagaimanapun juga kita harus melek akan hal itu jika memang tidak ingin tertinggal dari perkembangan zaman sehingga pro dan kontra pasti akan ada hanya saja untuk mereka yang lebih bisa mengerti dan tidak menutup diri dari kemajuan teknologi dan perkembangan zaman saya rasa tidak akan sulit untuk mereka mengerti situasinya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arjunmujay",
      "created_time": "December 16, 2023, 12:00:03 AM",
      "body": "sebenarnya yang menjadi pro kontra bukanlah platform berjualannya, baik itu ecoomerce atau sosial commerce. sebagaimana kita tau facebook juga sosial commerce akan tetapi memiliki fitur marketplace dari dulu sebelum tiktok. aman-aman saja. lalu kenapa tiktok dilarang? katanya tidak berizin. ya mungkin bisa.tetapi sejauh pengelihatan saya, sekarang ini platform penjualan online sangatlah tidak fear. banyak yang banting harga jauh di harga pasaran. alhasil penjual offlinepun tidak laku karena pembeli lebih memilih barang yang murah dengan kualitas yang sama di ecommerce. bahkan saya juga pernah beremu dengan pembeli yang membandingkan harga dengan platform online saat membeli di pedagang secara langsung. padahal penjual offline itu lebih ribet belum mengurus ijin, apalagi bayar pajak juga.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "marcous",
      "created_time": "December 16, 2023, 12:47:39 PM",
      "body": "Rezki atau nama lainnya uang akan mencari pemiliknya, dan terkait Pro dan Kontra yang timbul akibat dari kerjasama antara Tiktok dengan Tokopedia dengan pedagang Offline memang tidak dapat terelakkan. Saya pikir para pelaku atau pedagang Offline harus beradaptasi dengan perkembangan zaman, mereka harus memperbaharui cara mereka berjualan. Saya pikir mereka sudah memikirkan hal ini, dan kita juga melihat bahwa di antara mereka juga berjualan secara Online di berbagai Platform. Negara tentu tidak berencana menciptakan kisruh dan tidak akan merubah kebijakannya untuk mendukung salah satu diantara kedua pelaku usaha ini. Tetapi yang di lihat oleh Negara adalah seberapa besar pendapatan yang di dapatkan dalam bentuk pajak, ya pendapatan tahunan yang membuat Negara untung.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "December 16, 2023, 09:16:58 PM",
      "body": "Quote from: MiauKitchen on December 13, 2023, 08:03:32 AMSaya gak pernah sih belanja di tiktokshop satu kali pun(yang kata nya lebih murah dari toko-toko online lainnya).Dengan dibukanya tiktokshop,pasti akan menimbulkan perbinycangan baru lagi dikalangan masyarakat khususnya pedagan offline.Tapi mudah-mudahan untuk tiktokshop yang sekarang ini soal harga dan lainnya bisa lebih bijak lagi ya,menyetarakan dengan toko-toko online lainnya(karena untuk di toko online lain misal lazada itu untuk sekarang ini ongkosnya saja sudah 20rb).tidak semua toko ddi tik tok mau memberikan promo potongan harga untuk pelanggan mereka namun cukup banyak potongan harga itu di berikan oleh pihak tokopedia sendiri, yah saya lihat kerjasama antara tik tok dan tokopedia ini bakal menjadikan brand tik tok sangat kuat, dan bahkan bisa menggeser dominasi shopee, sungguh langkah yang bijak yang di lakukan pemilik tokopedia ddalam kerjasama ini, kedua platform benar benar untung untuk jangka panjang, saya menyarankan untuk pelaku toko offline memiliki toko online juga di tik tok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}