{
  "id": "topic_5460099",
  "title": "Faisal2202",
  "author": "Faisal2202",
  "created_time": "July 17, 2023, 01:15:53 PM",
  "content": "As the title suggested, to understand the potential BTC blockchain. what is necessary to know about BTC. is it how a block is formed and what is its architecture, or to know the algorithms behind the encryption of addresses and blockchain smart contracts. OR do we have to get familiar with the use cases of the BTC blockchain like how one can not tamper with it? I think not! we must know another thing which is the following:If we really wanted to understand the potential of BTC or BTC blockchain then we have to understand the current flaws in the financial system currently run by banks. This means we have to get familiar with the working of the banking sector and get to know how they are manipulating us to think that they are our only hope to manage our funds. But I think they are not our only hope and source to place our money. Instead, we are the only hope to which they lived for so many years. If I took my own example, i didn't come to know about the truth behind the banking sector, how they manipulate the money deposited in their wallets so that they could make more money by giving loans to others from our money, etc., etc. Until I came to know about BTC/Blockchain. If we really want to know how banks are making money (which you can learn from the following thread)How do banks generate income? Then you will understand the potential BTC blockchain has and how it will free you from the only hope of the Banking sector which they had put inside our brains from very long ago.The point is, Get the knowledge of Banking sector how they make money, how they manipulate our money, how they are using our money for their own purposes, why we should trust them, is there any other way to manage our finances. What's the essence of depending only on the banking sector? Why we have been taught only about Banks as the only way to store, send, receive, and borrow money? ------------------------------What Potential Does BTC Have?1.We can send, receive, borrow, and store BTC. Example of how BTC is better than the Banking sector. Bitcoin continue to safe life in the face of financial crisiswell, i had read many other real-life scenarios here on the BTT but during writing, only this one came to my mind i will add more once i remember them. 2.We can remain anonymous while hiding our real identity which is not possible in banks. So that's how we will save ourselves from debit/credit card offers from the banks. We would save ourselves from all the offers or i would say phishing offers by banks to borrow money or lend money to earn more interest etc. which will sink our money. other than this, we will save many other offers coming directly or indirectly from the banking sector, how do they know about our current financial situation? Because they have our whole information and they know about us but here on the BTC blockchain that's not an option.3.BTC blockchain is decentralized and i know even the newbies know this, that Decentralization is the only thing for which BTC has been made (if I am not wrong about the financial crisis of 2008 in which the centralization of banks becomes a reason of all banks collapsed I know the other reasons too but i am just writing the whole story in one statement). 4.BTC Blockchain provides us the level of security that banks don't because there is no single vault or wallet where all the money is placed. There is no single entity owning the whole BTC blockchain that could run away with all the money (Rug Pull). BTC blockchain is tamper-proof while the banking sector still has many back doors even in the age of modernization.---------------------------Banks also came to know the potential of BTC That's why they are:As i said, That's why they are launching their own CBDC or many other shits (like ETFs) to control the whole interest of users shifting towards decentralization. Because the banks are not from like 100 years old or 200 years old they exist for thousands of years and how such an organization (even if they have not formed a collude) will let this power slip away of controlling the money of others? So, to shift the interest of people of 3 types. TowardsThe one who knows about crypto (as a newbie)The one who did;nt know about the crypto The one who is already into deep down of Crypto sea. (Pro)Towards centralization which is framed as decentralization as they had pictured the whole thing as decentralization (ETFs) but those who knew are against it and know that this will only hurt the main purpose of BTC/Blockchain. ConclusionOverall, I would like to say, if we knew about the flaws in our current financial system then we could easily understand the potential BTC/Blockchain is holding. Many topics were made here on BTT asking how one could start to teach another (newbie) about BTC? and many have shared their opinions but here is mine to them. To understand the BTC find why it was made against the current Financial system and why the current financial system doesn't like it. What do they afraid of?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460099",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "July 17, 2023, 01:31:14 PM",
      "body": "Quote from: Faisal2202 on July 17, 2023, 01:15:53 PM2.We can remain anonymous while hiding our real identity which is not possible in banks. I will agree with you while comparing bitcoin with fiat, but know that to have anonymity while using bitcoin, you need to use Tor with your noncustodial wallet.Using IP address makes you not anonymous because centralized server operator that your wallet is using can know your addresses and your IP addresses. Also your internet service provider can know that you are connecting to certain sites and that you are using certain apps.To have privacy, if you want more than anonymity, you need to use full client like Bitcoin Core with Tor. For anonymity, use SPV wallet that support Tor, like Electrum and connect it with Tor.For privacy and anonymity, there are sometimes that you will need to use a mixer and the use of coin control is very important.Quote from: Faisal2202 on July 17, 2023, 01:15:53 PMAs i said, That's why they are launching their own CBDC or many other shits (like ETFs) to control the whole interest of users shifting towards decentralization.I guess that is true. But they are failing because people will only adopt CBDCs as fiat and it will remain to be fiat too. CBDCs are fiat and nothing more about them. Unlike bitcoin that has more to offer like full control and investment.Quote from: Faisal2202 on July 17, 2023, 01:15:53 PMTo understand the BTC find why it was made against the current Financial system and why the current financial system doesn't like it. Bitcoin is not against anything, but just an alternative. It is superior to fiat and better.But I like that people need to depend on fiat, because without the inferior, there will not be a superior. Let the fiat keep depreciating but bitcoin should continue to appreciate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "July 17, 2023, 02:17:50 PM",
      "body": "You need to explain more when you want to say Bitcoin is decentralized and privacy oriented.Most of people only know the surface, they know Bitcoin is decentralized, no one can control, pseudonymous, etc. But they still didn't hide their IP address or only use free VPN, they leave their coins on CEX, they're not run full node, they don't know what is mixer and which mixer is the best for privacy etc.One mistake will ruin everything especially about privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "July 17, 2023, 02:23:18 PM",
      "body": "Quote from: Faisal2202 on July 17, 2023, 01:15:53 PM2.We can remain anonymous while hiding our real identity which is not possible in banks. In short, bitcoin doesn't offer to hide user's identities. Bitcoin just doesn't need user's identities to work, so how well privacy goes is up to the user maintaining it.Quote3.BTC blockchain is decentralized 4.BTC Blockchain provides us the level of security I agree with both, and actually they are causal. Because blockchain is an interpretation of decentralization, it has many advantages, one of which is security from several risks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "July 17, 2023, 04:51:16 PM",
      "body": "Bitcoins true potential is in its use case. Many users tend to expose about their Bitcoin holdings, how much they earn in bitcoin, how much they posses in their wallet. Slowly when these users start spending it to those known people then it start connecting the dots further with the blockchain being public and all the transaction history being preserved. One can trace back to that first owner easily and could be unrealistic to think what might happen. Now this is what makes Bitcoin “pseudonymous” in nature. If a full privacy is needed then we have mixers all over the internet now. With little fees we can easily get full safety of our Bitcoins. That is what people needs to understand. “How to be private and use Bitcoin to its fullest”.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "July 17, 2023, 05:09:03 PM",
      "body": "Quote from: Flexystar on July 17, 2023, 04:51:16 PMThat is what people needs to understand. “How to be private and use Bitcoin to its fullest”. Privacy and anonymity require many practical steps to achieve. Bitcoin can not help you get it if you don't have appropriate practice which only can be achieved if you have good knowledge about Bitcoin wallets, coin controls, inputs, outputs, full node and Tor connection.So depends on your need to have privacy and anonymity, you must have different practices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Forever101",
      "created_time": "July 17, 2023, 09:15:13 PM",
      "body": "This is great , however, we must not forget that, both centralized and Decentralized financial system work hand in hand, the difference is that users get more control when it comes to bitcoins and they escape the gruesome cheat of banks. We still look forward to mass adoption of bitcoins across the world, When bitcoins becomes a well accepted means of payment across the world, it will become easy  for transaction to take place on every crook and cranny.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "July 17, 2023, 09:18:54 PM",
      "body": "I have that point of view before that it's really made to be against the fiat system. But everything is being set and changes that it's a great alternative instead of having that view that it should be against.And the government is afraid of it due to the fact that they have no control over it. That's all that they're thinking of and that's why they're against to it. Other than that, they have to recognize the power of the people and this is what Bitcoin is all about that has made a financial disruption and they need to realize that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0ne",
      "created_time": "July 17, 2023, 09:49:30 PM",
      "body": "On of the prime thing that needs to be remembered is the limited supply. The limited supply increases the demand, if not as an alternative this could've never been a success. The BlockChain technology is the backbone, but the same couldn't have brought big success. Whether things function centralised or decentralised, it is all about the demand that makes bitcoin even more potential. We must know the process behind the generation of each and every bitcoin. Only then people will come to know better about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "July 18, 2023, 01:41:24 AM",
      "body": "Quote from: Faisal2202 on July 17, 2023, 01:15:53 PMMany topics were made here on BTT asking how one could start to teach another (newbie) about BTC?Most people are simply incapable of explaining Bitcoin correctly. The right move for 99% of people is to simply point people to the right content and direction instead of trying to teach such a complex concept to people.My copypasta; feel free to use it:Code:[size=7pt]* If you like reading articles: https://coindesk.com/learn* If you like reading books: https://theinternetofmoney.info/* If you like watching videos: https://www.youtube.com/playlist?list=PLPQwGV1aLnTuN6kdNWlElfr2tzigB9NnjSecurity related:* https://chainsec.io* https://www.lopp.net/bitcoin-information/security.htmlIf you want to get more technical* https://github.com/bitcoinbook/bitcoinbook#chapters[/size]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Latviand",
      "created_time": "July 18, 2023, 02:08:35 AM",
      "body": "Quote from: Plaguedeath on July 17, 2023, 02:17:50 PMYou need to explain more when you want to say Bitcoin is decentralized and privacy oriented.Most of people only know the surface, they know Bitcoin is decentralized, no one can control, pseudonymous, etc. But they still didn't hide their IP address or only use free VPN, they leave their coins on CEX, they're not run full node, they don't know what is mixer and which mixer is the best for privacy etc.One mistake will ruin everything especially about privacy.I think that what OP posted is enough explanation, the other stuff it should be an individual discovery and research so that way, we can form more opinions thus creating more discussions. Regarding VPN, even if it's a paid one, you can't use it to truly hide your location, yes you can mask your IP address but that's about it, your ISP still knows your real IP address and not to mention that you still have your geolocation so even if you hide your IP, the smart ones will still be able to find you. The things that you want the casual people to do are not basic stuff and not everyone has the interest or time to do those things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bazzu",
      "created_time": "July 18, 2023, 02:09:02 AM",
      "body": "I think that in life we ​​will still need fiat currency which is of course centralized but of course to improve the economy we also need bitcoin which is of course decentralized.I think to better understand the potential of btc i.e. have to look at the potential of btc in the future due to the limited supply of btc and the increasing adoption rate of btc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gallar",
      "created_time": "July 18, 2023, 02:25:57 AM",
      "body": "Quote from: Faisal2202 on July 17, 2023, 01:15:53 PMAs the title suggested, to understand the potential BTC blockchain. what is necessary to know about BTC. is it how a block is formed and what is its architecture, or to know the algorithms behind the encryption of addresses and blockchain smart contracts. OR do we have to get familiar with the use cases of the BTC blockchain like how one can not tamper with it? I think not! we must know another thing which is the following:I agree with the advice you give. Because conducting analysis and research related to assets that will be used as investments, is an important thing to do. Why do all of this have to be done, so that we can know more deeply about the reasons and uses for these assets (bitcoins) to be created. But studying the systems related to bitcoin, it is also very important. Because learning like the blockchain and about all the systems that run on bitcoin, it is also not to be missed. Because if you study bitcoin only from the point of view of where it was made and from the point of view of its use, in my opinion it is not good. So the point is to learn as a whole about bitcoin (in terms of the system and in terms of history), so that everything becomes more perfect, when you want to invest or trade in bitcoin.QuoteIf we really wanted to understand the potential of BTC or BTC blockchain then we have to understand the current flaws in the financial system currently run by banks. Studying the systems that run in banks to better understand the systems that run on bitcoins, indeed doing this, will definitely better understand the systems that run on bitcoins. Because by doing this, the point is to be able to compare, between the systems that apply in banks and in bitcoin.But in my opinion, this can be done (if you want) and if you don't do it, that's okay. Because this is done only to measure how good the system implemented by bitcoin is.QuoteThis means we have to get familiar with the working of the banking sector and get to know how they are manipulating us to think that they are our only hope to manage our funds. But I think they are not our only hope and source to place our money. Instead, we are the only hope to which they lived for so many years. That's right, because actually it is the customers who make the bank able to benefit and be able to run all the systems they implement. Because without customers, the bank will not be able to benefit, let alone progress. So in essence, the bank cannot boast, because actually the bank cannot do anything when there are no customers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "July 18, 2023, 03:30:42 AM",
      "body": "Quote from: Faisal2202 on July 17, 2023, 01:15:53 PM... and why the current financial system doesn't like it. What do they afraid of?Bitcoin has the potential to make people see banks as less important. It can reduce business for the banks and even take them out of business, so they will not gladly be welcoming to it. Some old technology that existed and have been replaced by modern one were very important before until better alternatives came and took over, it is an unavoidable thing. The current financial system is much different from other technologies that have been easily replaced in the past because it is under the control of the government still existing, and it is for a purpose and benefit to them. Bitcoin is a challenge to that, that is why they do not like it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "July 18, 2023, 06:14:18 AM",
      "body": "Bitcoin is not 100% anonymous, because people re-use Bitcoin addresses and this creates opportunities for people to break that pseudo anonymity that Bitcoin offers. The moment when you pay for something with Bitcoin and that item is linked to a senders identity, then it destroys your anonymity. Bitcoin's underlying technology are decentralized, but the wrong configuration of full nodes and the wrong use of these nodes, can compromise the system. (We saw how attempts were made during the Bitcoin fork to undermine the voting process, by spinning up loads of AWS (fake) nodes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "July 20, 2023, 12:13:06 PM",
      "body": "Quote from: Faisal2202 on July 17, 2023, 01:15:53 PMWhat Potential Does BTC Have?1.We can send, receive, borrow, and store BTC. Example of how BTC is better than the Banking sector. You can't borrow bitcoin as banks do borrow money from you and lend to others, if you have your money you can exchange it to bitcoin or best means to have this is to earn bitcoin just as you earned your regular fiat currency when you get paid for something, so i will like to put it this way that bitcoin will not put you into the mess of indebtedness, it will rather erace your mentality from such to learn how to work for and earn finances than relying on institutions to borrow you, if you have your own money, you can go decentralized but if it's not yours, you're under centralized authorities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "July 20, 2023, 02:00:36 PM",
      "body": "Quote from: 348Judah on July 20, 2023, 12:13:06 PMQuote from: Faisal2202 on July 17, 2023, 01:15:53 PMWhat Potential Does BTC Have?1.We can send, receive, borrow, and store BTC. Example of how BTC is better than the Banking sector. You can't borrow bitcoin as banks do borrow money from you and lend to others, if you have your money you can exchange it to bitcoin or best means to have this is to earn bitcoin just as you earned your regular fiat currency when you get paid for something, so i will like to put it this way that bitcoin will not put you into the mess of indebtedness, it will rather erace your mentality from such to learn how to work for and earn finances than relying on institutions to borrow you, if you have your own money, you can go decentralized but if it's not yours, you're under centralized authorities. We can borrow BITCOIN, but not from banks. We can buy it from another person in p2p trade. But most of the BTC lender charge interest with high or lower rates. Which i do not promote. Because interest will lead one to usury which is not good for the social life of one. And also its an immoral work.After showing my feelings towards interest, and usury, you might think, the thread i am going to mentioned now, that i am against it. So, no hard feelings. But people are borrowing in BTC means people can borrow BTC.Lending Service Started! (USDT/BUSD/BTC/LTC/ETH/DOGE/ETC)!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "July 20, 2023, 02:48:01 PM",
      "body": "I think that a wiser approach to acknowledging potential in bitcoin, is to take advantage of the disadvantages of the banking sector, rather than to replace it, as you make it sound like. Governed by corrupted politicians, arbitrary fee charges, limited accessibility and privacy invasion are a few from the top of my head.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "July 20, 2023, 03:04:45 PM",
      "body": "I agree with the op's general idea. The potential of Bitcoin as a currency shines if one understands the issues with banks and fiat, and knows that Bitcoin is truly different. The fact that your funds can't be frozen, and you can send and hold money without anyone's approval, using a non-custodial wallet, is a big thing, but only if a person knows how much oversight banks have.But to many people, Bitcoin's potential as an investment is much more interesting, and to estimate that, I think one needs to be familiar with the main adoption stories and the price chart.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blitzboy",
      "created_time": "July 20, 2023, 10:03:55 PM",
      "body": "What a fervent critique you have just delivered against the banking system! Its like the passionate discussions we used to have in college over cups of coffee, except the subject matter has changed. Is there something broken about the way banks operate? Absolutely! But heres the thing: these institutions provide us with a stable infrastructure, which is why we are here to air our grievances. Haha, isnt it great?Your perspective is interesting, yet its quite binary. Understanding BTC requires moving beyond simple either/or choices. The Bitcoin blockchain is an attempt to test out a new approach to money as well as a protest against traditional financial institutions. A beautiful illustration of human ingenuity at work!Its really entertaining to debate these issues. Finally, we're here to discuss the inner workings of our respective monetary systems. The might of the human mind is on full display here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}