{
  "id": "topic_5447127",
  "title": "Smartvirus",
  "author": "Smartvirus",
  "created_time": "April 01, 2023, 08:25:14 AMLast edit: April 02, 2023, 07:38:30 AM by Smartvirus",
  "content": "Is this another April fool?Am I the only one seeing this or its supposed to be a part of the newly created Nigerian board allocation for a merit source.Obviously, there have been many applications at least, I've seen that of Charles-Tim before hand and it's been pending consideration as a merit source but, I've not filled any application and still, I noted this minutes ago after trying to send some merit.How the hec am I having 572 Smerits?Am no merit source and am yet to apply for one but, that's what am seeing up there 572 Smerits! I don't get how it's happening except, I was just made a merit source @Theymos, its that you...? For the forum and Nigerian local board...I wouldn't want to rush or over do anything but, I'll be waiting on your responses and if someone else could have similar experience but, I think things would be a lot Crystal by tomorrow and maybe I'll run a merit thread for a start along with, doing more expenditions on reading/searching out merit deserving posts. In the mean time, I hold my peace!!!Edited:Meanwhile, I'll be looking forward to testing them Smerits later but for now, I am solely about understanding what possible scenarios that might result this, whats happening here and when its done, I'll see what to do with them merits.Users can drop quality posts on the sidelines if you may. You might refer to some of the existing merit threads by Ratimov for some rules. Can't go about quoting those now as I've got my hands full but, would surely apply them.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447127",
  "comments": [
    {
      "author": "slashz9",
      "created_time": "April 01, 2023, 08:35:02 AM",
      "body": "i think its a april fool, i have to do some captcha to posting, and the number is always increase, for the first i was panic, but the end i see all people posting.and some got \"This user is a suspected spammer!\", even staff got that.so i just ignore that captcha that make he headache",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "April 01, 2023, 08:39:52 AM",
      "body": "Quote from: Smartvirus on April 01, 2023, 08:25:14 AMAm I the only one seeing thisWell, merit source looks different. And I also don't have more sMerit than half of my merit, so it must be only you.PS. Your question was not that clear, hence getting odd answers is expected, especially today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "April 01, 2023, 08:42:37 AM",
      "body": "I did not see any increase in my smerits, so I do not think it is April fool. Or maybe it is. Quote from: NeuroticFish on April 01, 2023, 08:39:52 AMWell, merit source looks different. And I also don't have more sMerit than half of my merit, so it must be only you.PS. Your question was not that clear, hence getting odd answers is expected, especially today.I think what he meant is that he saw increase in his smerits and thinks theymos has made him a merit source already. But I think that merit source have their own smerit and also theymos allocation different smerits to them every month. Is it like that?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "April 01, 2023, 08:43:56 AM",
      "body": "If I understand you correctly, you're asking if you're a merit source or not?According to BPIP [1] you have earn 1037 Merit and have sent 513 sMerit, You should only have 5 sMerit, but when you want to send sMerit, there are 572 sMerit you can send?Well it's weird, I don't think it's an April Fools' because my remaining sMerit is still same, but there's no mentioned if you're a merit source. However congratulations, now you're unofficially a merit source [1] https://bpip.org/Profile?id=2737799",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nutildah",
      "created_time": "April 01, 2023, 08:48:41 AM",
      "body": "Quote from: Smartvirus on April 01, 2023, 08:25:14 AMAm I the only one seeing thisMost assuredly, your \"2\" looks like a different font  Next time right-click \"inspect\" or \"inspect element\" on the part of the webpage you want to edit and just put your new text in field on the page source.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "April 01, 2023, 08:49:36 AM",
      "body": "Quote from: NeuroticFish on April 01, 2023, 08:39:52 AMQuote from: Smartvirus on April 01, 2023, 08:25:14 AMAm I the only one seeing thisWell, merit source looks different. And I also don't have more sMerit than half of my merit, so it must be only you.PS. Your question was not that clear, hence getting odd answers is expected, especially today.Updated OP on clarity of the nature of my curiosity.Then again, what does a merit source allocation spot looks like, I've got no idea so maybe I could have a pip if you may with an image.Edited:Okay, Nutildah just clarified my next curiosity from the last statement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "April 01, 2023, 08:54:31 AM",
      "body": "Nice one OP! You managed to fool some people lol. Great April Fools Prank. XD. HOLD YOUR PEACE! Lol",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "April 01, 2023, 09:36:52 AM",
      "body": "As some means to verify this, I just sent 1merit to Nutildah and instead of d decrease, am getting an increase in the value equivalent to the 1merit I sent out. There is definitely something wrong I think...Till tomorrow then or untill i get a better understanding but till then, the plan still stands as, I'll like to see some posts to merit later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "April 01, 2023, 09:46:51 AM",
      "body": "Quote from: Smartvirus on April 01, 2023, 08:49:36 AMThen again, what does a merit source allocation spot looks like, I've got no idea so maybe I could have a pip if you may with an image.For merit sources the source sMerits are separated from the normal merits (and normal sMerits) plus it tells \"You are a merit source\" somewhere. So a merit source will know that clearly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karmamiu",
      "created_time": "April 01, 2023, 09:52:07 AM",
      "body": "If this is true, then you've got loads of sMerits in your bag and I don't think that's normal either. If this is a prank, then you've definitely nailed it. I don't think that is also an indication that you've become a merit source, I'm not too sure either but that's what I know as far as I am concern.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "April 01, 2023, 09:56:12 AM",
      "body": "Since you supposedly have 5 smerit prior to this “bug” on April fools day. Your issue can be solved by sending merits greater than 5 to make sure that the current smerit count is legit. You should spend it quick if that is legit smerit count because it will surely decay after April fools day. This might be part of the classical prank of Theymos that granting wish on unexpected day.  Congratulations!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "April 01, 2023, 09:56:18 AM",
      "body": "You are not a merit source, because for merit sources, the merit page displays a completely different text. So, don't feel bad, you are not a merit source  And you won't have to look for places to give out merits. I don't think theymos will assign a person a merit source without consent.Quote from: Ratimov on March 18, 2023, 10:46:31 AM",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "April 01, 2023, 10:03:53 AM",
      "body": "Quote from: Smartvirus on April 01, 2023, 09:36:52 AMAs some means to verify this, I just sent 1merit to Nutildah and instead of d decrease, am getting an increase in the value equivalent to the 1merit I sent out. There is definitely something wrong I think...Till tomorrow then or untill i get a better understanding but till then, the plan still stands as, I'll like to see some posts to merit later.No need to wait till Tomorrow why don’t you just send him 20 merits to see maybe it will increase more.  Quote from: karmamiu on April 01, 2023, 09:52:07 AMIf this is true, then you've got loads of sMerits in your bag and I don't think that's normal either. If this is a prank, then you've definitely nailed it. It’s April fool mate, nutildah just busted him right here. But seriously OP really got me, I was actually on my way to the Nigerian Board to create a thread him been a new merit source",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "April 01, 2023, 10:25:25 AM",
      "body": "Good one OP. You made me check my profile to see if I got any smerits. I almost missed the irregularities in the image posted, though I think you had little time to edit the image and only did it this morning, the numbers were crooked but somehow I didn’t notice till Nutildah pointed it out. I really need to learn to pay attention to detail.  I was caught in the April fool madness. Watching this thread to see how many will only read the OP and fall for this trick.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "April 01, 2023, 10:50:20 AM",
      "body": "Smartvirus congratulations on becoming and unofficial merit source with special duty you here by Asign to exhaust and infinity merit in the next 24 hours until your tenure expires, enjoy the rest of your day spreading merits like a various I hope you end your day 100% fulfilled afterwards. 01-04",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "April 01, 2023, 11:02:48 AM",
      "body": "Quote from: Smartvirus on April 01, 2023, 09:36:52 AMAs some means to verify this, I just sent 1merit to Nutildah and instead of d decrease, am getting an increase in the value equivalent to the 1merit I sent out. There is definitely something wrong I think...One of the forum staff just confirmed you aren't a merit source and yet its kind of confusing hear you say you just sent 1 smerit, and instead of it to decrease its increased. So what if this is a test to see if you can be able to utilize huge smerits if made a merit source? So I will kindly advise how about you wait till tomorrow and please don't send this merit to anyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God Of Thunder",
      "created_time": "April 01, 2023, 11:46:21 AM",
      "body": "SmartVirus is not Smart Enough. Let me share mine!I thought I would create a new thread. But I will not create one because the topic title seems reasonable for me to share here. I am not an Established member of this forum. As far as I know, To be a merit source, you must be established in the forum. But, I didn't know if there is any criteria to become a Coin Source  . I just Noticed there is a Personal News for me saying Hey Learn Bitcoin! You were appointed as Coin Source! Click here to read more. See the screenshot. Who else got appointed as Coin Source?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UserU",
      "created_time": "April 01, 2023, 03:20:30 PM",
      "body": "Quote from: nutildah on April 01, 2023, 08:48:41 AMMost assuredly, your \"2\" looks like a different font  Next time right-click \"inspect\" or \"inspect element\" on the part of the webpage you want to edit and just put your new text in field on the page source.  Ahha, I knew something was off the moment I saw the numbers",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uchegod-21",
      "created_time": "April 01, 2023, 09:25:02 PM",
      "body": "Quote from: Smartvirus on April 01, 2023, 08:25:14 AMIs this another April fool?Well, this is a good news. Can you please spray me some merits to take me to Hero Rank. I don't care if this is the 1st day of April. My first time of entering meta today even after being scared that I am a suspected spammer.There are alot of April related posts today, from meta board to service board and by tomorrow things may calm. Besides tomorrow could stick be April 1st in other countries due to time difference.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}