{
  "id": "topic_5468967",
  "title": "MaxMueller",
  "author": "MaxMueller",
  "created_time": "October 02, 2023, 11:12:32 PM",
  "content": "Wie ja bereits im ANN Faden von eXch beschrieben, habe ich mich kürzlich mit der Nachverfolgung von Transaktionen beschäftigt. Da mir der Blockexplorer und mempool in der Darstellung der Transaktionen zu unübersichtlich waren, habe ich etwas mit besserer Visualisierung gesucht.Über dieses Video bin ich dann auf den dienst oxt.me gestoßen, der in sachen Visualisierung einen sehr guten Job macht und obendrein noch kostenlos ist.Um den dienst nutzen zu können, muss man sich mit einer Mailadresse registrieren (Müllmail reicht). Außerdem macht der Dienst bei den Nutzungsbedingungen folgende Angaben:QuotePRIVACY POLICYOXT does not use identification cookies.OXT may collect IP addresses for purposes of system administration and to audit the use of the site. An 'IP address' is a set of numbers that is automatically assigned to your computer whenever you log into your internet service provider or use your company's LAN or WAN.OXT may use third-party services (like Cloudflare) using identification cookies and/or collecting IP addresses.OXT does not use and will never use IP addresses collected during the use of the site for the purpose of data analysis related to the bitcoin blockchain.OXT can and will use IP addresses when we feel it is necessary to enforce compliance with these terms, or to protect our service.Quelle: oxt.me Terms and ConditionsWer hier skeptisch ist ob unter der IP bzw. dem Account nicht ggf. Daten anhand der getätigten Abfragen zusammen geführt werden, der sollte entsprechende Vorkehrungen treffen.So nun zum eigentlichen Dienst:Will man Transaktionen zurückverfolgen kann man die Inputs rot markieren und einzeln nachverfolgen.In meinem Beispiel bei eXch sind die Transaktionsvolumina in einzelnen Sprüngen immer größer geworden. Kommt man dann zu einer Transaktion die je einen sehr Großen Ein- und Ausgang hat, lohnt sich ein Blick ob das nicht eine zentrale Börse ist. Das könnte dann so aussehen:Um zu schauen wie ein Mixer wohl aussieht bin ich von der Escrow Adresse der Sindbad Kampagne gestartet und hab das zurückverfolgt. Neben einem Strang der zu CEXn führte, ging ein anderer Strang in ein Labyrinth, bei dem jede Transaktion 1-3 Eingänge und 30-50 Ausgänge hatte. Meistens war ein Eingang direkt mit einem bereits bekannten Ausgang verknüpft und die weiteren Eingänge waren \"frisch\" führten also weiter raus. Nachdem ich mich ca. 30min da durch geklickt hatte und kein Ende in Sicht und viele Eingänge offen waren, hab ich abgebrochen. Das Bild sah dann so aus:Auch wenn ich es ziemlich cool finde sich da so durch zu klickern, weiß ich noch nicht so recht was es einem nutzt um die Historie von coins zu beurteilen. Wenn man nach nicht so vielen hops bei einer Börse raus kommt, spricht das wohl für eine gute Historie der Coins. Aber wie erkennt man dann eine \"schlechte\" Historie (z.B. Coins aus Hacks)? Und wie erkennt man dienste wie Mixer, Dexn und Co bei denen die Historie wohl eher semi ist?Ich würde mich freuen wenn hier ein paar Experten ihr Wissen teilen, die bei der ganzen Materie schon mehr durchsteigen als ich es tue.  Auch alternative Dienste sind hier gerne gesehen!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468967",
  "comments": [
    {
      "author": "1miau",
      "created_time": "October 03, 2023, 12:02:45 AM",
      "body": "Danke für die Präsentation. Bei oxt.me habe ich mich noch nicht angemeldet, werde dies aber definitiv noch tun. Danke für den Tipp. Hilfreich ist die Seite auf jeden Fall, da man sich nicht mühsam durch diverse Blockexplorer klicken muss, die dazu mehr schlecht als recht geeignet sind. Inwiefern \"bekannte\" Adressen von namhaften Börsen als solche angezeigt werden, müsste man dann jedoch sehen. Das wird an sicht von oxt.me abhängen, wie verlässlich das dort gehandhabt wird. Das dürfte dann auch der einzige Unterschied zu Blockexplorern sein, weil alle restlichen Daten sind in der Blockchain sowieso frei verfügbar. Weshalb ich auch darauf hoffe, dass wir diesbezüglich in Zukunft (ähnlich wie bei Blockexplorern) viele verschiedene Anbieter haben werden.  Merit hole ich nach. Quote from: Turbartuluk on October 02, 2023, 11:12:32 PMAuch wenn ich es ziemlich cool finde sich da so durch zu klickern, weiß ich noch nicht so recht was es einem nutzt um die Historie von coins zu beurteilen. Nutzen gibt es bestimmt vielerlei, wie den Fall, den ich im internationalen Forumsteil geschildert habe, als bei P2P-Kauf ein Forenteilnehmer (siehe hier und hier) prüfen wollte, ob die angebotenen Coins aus einem Hack etc. kommen. Im Forum selbst könnte es neue Entdeckungen unbekannter Alt-Accounts geben, die mit verschiedenen Adressen zusammenhängen (oder die bisherige Prozedur vereinfachen). Man könnte schauen (so wie du), wo eXch die Coins her hat oder wie verlässlich ein Mixer mixt / CoinJoin ist. Oder die damals von Real-Duke gehackten Coins verfolgen, wobei das eher was für professionelle Ermittler wäre aber auch die waren leider nicht erfolgreich. Gibt bestimmt noch mehr interessante Anwendungsfälle. Quote from: Turbartuluk on October 02, 2023, 11:12:32 PMWenn man nach nicht so vielen hops bei einer Börse raus kommt, spricht das wohl für eine gute Historie der Coins. Aber wie erkennt man dann eine \"schlechte\" Historie (z.B. Coins aus Hacks)? Und wie erkennt man dienste wie Mixer, Dexn und Co bei denen die Historie wohl eher semi ist?Bin kein Profi dafür aber vielleicht suche ich mal die Tage, ob es dazu noch spannende Inhalte gibt. Wenn nicht viele Hops / Hopsies? / Hopser? zwischen der eigenen Adresse und dem vermeintlichen Herkunftsort liegen, würde ich davon ausgehen, jedoch gibt es auch Ausnahmen, z.B. wenn die Exchange gehackt wurde.   Aber das wäre ja ein guter Anwendungsfall, dass oxt.me hier einen möglichen Hack anzeigt. Für Mixer wird das davon abhängen, wie der Mixer konkret funktioniert. Es gibt ja einige Methoden, wie z.B. der \"vorgefertigte Chip (= privater Schlüssel)\"-Ansatz von ChipMixer, oder dort, wo alles in mehrere Töpfe kommt und \"vermixt\" wird, der Ansatz von MixTum, bei dem die Coins von großen Börsen kommen (dürfte dann bei eXch so ähnlich sein) usw. CoinJoin sollte man ebenfalls als individuelles Muster dort erkennen können. In vielen Fällen wird man wohl selbst noch etwas Recherche betreiben müssen, aber kommt ganz auf das Muster an. Da wird es viele Variablen geben. Deine Bilder verdeutlichen das ja sehr schön.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxMueller",
      "created_time": "October 03, 2023, 09:47:20 AM",
      "body": "Achso, genau... Einen Nachbrenner hab ich noch:Und zwar wird ja für Signaturkampagnen o.Ä. immer empfohlen eine \"saubere\" BTC-Adresse zu nehmen, damit etwaige Transaktionen nicht bis zu den KYC Informationen einer Börse zurückverfolgt werden können. Da habe ich noch nicht so recht verstanden warum?!Wenn man direkt eine CEX-Adresse nähme, könnten außenstehende Dritte anhand der Bitcointalk BTC-Adresse ja nur auf die CEX schließen, nicht aber auf die KYC-Infos.Bei der Steuererklärung fährt man langfristig wohl eh besser, wenn man immer alles korrekt angibt, da kann mir das ja dann eigentlich auch egal sein, wenn Vater Staat die Infos ohnehin schon bekommt.Und im Falle eines Hacks ist mein größeres Problem glaube eher, dass Bitcoin Guthaben in Verbindung mit Name, Adresse und Co. im Umlauf sind, da ist doch dann die Verknüpfung mit dem Bitcointalk Account auch zweitrangig, oder nicht?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "October 03, 2023, 05:14:21 PM",
      "body": "Quote from: Turbartuluk on October 03, 2023, 09:47:20 AMUnd zwar wird ja für Signaturkampagnen o.Ä. immer empfohlen eine \"saubere\" BTC-Adresse zu nehmen, damit etwaige Transaktionen nicht bis zu den KYC Informationen einer Börse zurückverfolgt werden können. Da habe ich noch nicht so recht verstanden warum?!   Den Ratschlag habe ich echt noch nie bei irgendeiner Signaturkampagne gehört. Den meisten Kampagnen ist das doch völlig egal?  Und ja, sehe ich ebenfalls wie du, nämlich dass es ziemlich wenig Sinn macht, außer, dass die wiederholte Verwendung von Adressen generelle Nachverfolgung von Bitcoinströmen einfacher macht, weil man einfach mehr Verknüpfungspunkte hat. Aber das gilt generell und ist nicht aus Signaturkampagnen beschränkt. Kann ja auch eine (wiederverwendete) Adresse ohne KYC-Bezug für die Kampagne sein...Was unsinnige Tipps und Signaturkampagnen angeht: es wurde früher einmal behauptet, dass die Verwendung von SegWit-Adressen bei Signaturkampagnen die Transaktionskosten (besonders bei vielen Teilnehmern in einer Kampagne) senken (was insbesondere früher ein Problem war). Dabei stimmt das überhaupt nicht, da nur die Adresse selbst relevant ist, von der das BTC gesendet wird, nicht die Empfängeradresse der Teilnehmer...Da war wohl der Kampagnenmanager falsch informiert.  Was dadurch allerdings schon erreicht wird: dass das Bitcoin-Netzwerk weniger belastet wird, denn dazu wurde SegWit ja eingeführt. Das war auch so ein (von der Begründung her falscher) Ratschlag.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mv1986",
      "created_time": "October 03, 2023, 07:41:55 PM",
      "body": "Ich habe mir gestern mal den Report von Jonelle Still (Cyphertrace) zum Fall \"United States vs. Roman Sterlingov\" gegönnt.  Ich sage einfach mal gegönnt, weil man sich dann schon auch Zeit nehmen muss. Ein hochinteressanter Fall zu dem ich eigentlich einen eigenen Thread eröffnen wollte, aber warum nicht hier posten. Dazu kann man sich ebenfalls diesen Artikel vom Bitcoinmagazine durchlesen. Ich fasse das mal salopp zusammen: Alter Schwede, liebe Freunde, auf welcher Basis der Sterlingov da verknackt wurde von den Amerikanern. Wirklich, also wirklich, da war ich echt baff. Es gibt keine Zeugen, keine Nachrichten über Messenger, keine Emails, keine Dokumente, es gibt gar nichts. Es gibt einen Bericht von Chainalysis und die werden komplett von Jonelle Still auseinandergenommen. Der absolute Hammer ist, dass Chainalysis die eigene Software nicht offenlegen will. Es hat nie eine unabhängige Beurteilung der Software gegeben. Es gab nie einen externen Audit. Es gibt überhaupt nichts. Aber sie sagen, dass ihre Nachverfolgungs-Ergebnisse halt genau zu dem führen, was die amerikanischen Behörden sagen. Und jetzt ist der interessante Part, über den ich auch erst im zweiten Zug nachgedacht habe, dass dieser Fall und das Urteil - was ja gerade alles noch läuft, weil die Anwälte gegen angehen wollen - eine enorme Bedeutung für Chainalysis' Bewertung hat, die aktuell bei über 8 Milliarden liegt. Das wirft ein ganz übles Licht auf diesen Bericht, der Sterlingov hinter Gitter gebracht hat. Denn wenn das kassiert wird und somit festgelegt wird, dass diese vage Chainalysis-Software, von der keiner weiß wie sie funktioniert und die US-Gerichte keinen Einblick fordern bisher, wenn das kassiert wird, dann fällt die Bewertung kometenhaft in den Keller. Das ist die Befürchtung. Auf der anderen Seite ist die Tatsache, dass sich Gerichte blind auf diese Reports von Chainalysis stützen, goldwert für das Unternehmen. Also ich kann das wirklich nur empfehlen und ich bin sicher, dass hier jeder meine Meinung teilt, weil bereits erwiesen ist, dass die Richter das überhaupt nicht nachvollziehen können. Sie können es schlicht nicht. Und eine Offizielle von Chainlaysis musste halt schon attestieren, dass es keine, absolut keine Qualitätsüberprüfungen dieser Software gibt. Dass es keine Metriken bzgl. Standardabweichungen gibt, keine Art von Fehlerwahrscheinlichkeiten bei Adressverknüpfungen. Und der Hammer ist, dass der Report von Chainalysis auch noch wirklich ganz bittere Amateurfehler enthält. Da ist auch für jeden Nichtprogrammierer, der sich aber ein bisschen mit Bitcoin auskennt, was zum Lachen dabei. Ist mein Ernst.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "October 03, 2023, 08:24:11 PM",
      "body": "Quote from: mv1986 on October 03, 2023, 07:41:55 PMIch habe mir gestern mal den Report von Jonelle Still (Cyphertrace) zum Fall \"United States vs. Roman Sterlingov\" gegönnt.  ...Es gibt einen Bericht von Chainalysis und die werden komplett von Jonelle Still auseinandergenommen. Jonelle Still von Ciphertrace (https://ciphertrace.com/), dem Konkurrenten von Chainalysis?  Wenn dem so ist, bin ich echt nicht überrascht über das große Bohei. Gab es ja auch schon bei Shitcoins, die sich gegenseitig ans Bein pinkeln. Die Frage, welches Blockchainanalyseunternehmen sich hier die Vormachtstellung sichern kann ist da vermutlich übergeordnet relevant und da würde mich nicht wundern, wenn es da ziemlich ruppig zugeht. Wer glaubt denn nicht, dass Chainalysis seine Software besser verkauft, als sie ist und dass Cyphertrace ganz alturistisch auftritt und alle Fehler gefunden hat, jedoch selbst nicht ihrerseits die Blockchain aufdröseln kann? Der Markt der Blockchainanalyseunternehmen ist beinhart, da kann man aber von ausgehen. Quote from: mv1986 on October 03, 2023, 07:41:55 PMAlso ich kann das wirklich nur empfehlen und ich bin sicher, dass hier jeder meine Meinung teilt, weil bereits erwiesen ist, dass die Richter das überhaupt nicht nachvollziehen können. Sie können es schlicht nicht. Das wundert mich nicht, dass Richter von Blockchainanalyse keine Ahnung haben.  Wenn das in Zusammenarbeit mit einer anderen Blockchainanalysefirma nachvollzogen werden kann, wird sich da das große Bohei schnell legen und das sollte auch möglich sein. Ich vermute eher, dass sich da einige Blockchainanalyseunternehmen mächtig auf den Schlips getreten fühlen, weil nicht ihre Software angewendet wurde (so ja auch Ciphertrace). Weil die anderen Blockchainanalysefirmen könnten ja auch ihrerseits die Transaktionen aufdröseln und das Gegenteil beweisen. Die Blockchain ist ja für jeden öffentlich verfügbar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mv1986",
      "created_time": "October 03, 2023, 08:38:19 PM",
      "body": "Quote from: 1miau on October 03, 2023, 08:24:11 PM-Jonelle Still von Ciphertrace (https://ciphertrace.com/), dem Konkurrenten von Chainalysis?  Wenn dem so ist, bin ich echt nicht überrascht über das große Bohei. Gab es ja auch schon bei Shitcoins, die sich gegenseitig ans Bein pinkeln. Die Konstellation ist mir schon klar. Grundsätzlich ist nicht überraschend, dass Cyphertrace da kein Lob ausspricht. Aber viele Stellen im Bericht sind wirklich klar nachvollziehbar und verheerend für Chainalysis, wie ich finde. Da sind Sachen drin, die können nicht angehen und wenn man dann halt noch an diese extreme Gefängnisstrafe denkt, die Sterlingov bevorsteht, dann ist das wirklich katastrophal. Wenn das durchgeht und nicht erfolgreich angefochten werden kann, da werden aber noch einige tief durchatmen und nie wieder amerikanischen Boden betreten. Was ich überhaupt nicht verstehe, ist, ob das überhaupt so geht, dass jemand auf Basis einer Closed-Source-Software derartig verknackt wird, dem sozusagen das Leben genommen wird, und selbst seine Anwälte und die zuständigen Richter keine unabhängigen Experten einschalten können/wollen, um die Prüfmethode einzusehen und auf Validität zu überprüfen? Ich weiß, wir sind hier in Amerika. Aber das wäre doch in Deutschland im Leben nicht möglich, dass ein Forensiker nicht die Validität seiner Prüfmethode nachweisen muss oder dass man weitere Gutachter hinzuzieht, die wenigstens ebenfalls eigene Berichte einbringen müssen mit einer eigens entwickelten Methode? Wir reden hier ja eigentlich von einer experimentellen Software mehr oder weniger. Naja, kann man nur hoffen, dass da noch Klarheit reingebracht wird.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "October 03, 2023, 08:49:51 PM",
      "body": "Quote from: mv1986 on October 03, 2023, 08:38:19 PMQuote from: 1miau on October 03, 2023, 08:24:11 PM-Jonelle Still von Ciphertrace (https://ciphertrace.com/), dem Konkurrenten von Chainalysis?  Wenn dem so ist, bin ich echt nicht überrascht über das große Bohei. Gab es ja auch schon bei Shitcoins, die sich gegenseitig ans Bein pinkeln. Die Konstellation ist mir schon klar. Grundsätzlich ist nicht überraschend, dass Cyphertrace da kein Lob ausspricht. Aber viele Stellen im Bericht sind wirklich klar nachvollziehbar und verheerend für Chainalysis, wie ich finde. Auf jeden Fall, da scheinen einige krasse, handwerkliche Fehler drin zu sein. Die Frage ist nur, wie akkurat sind die Reklamationen von Ciphertrace? Oder sind da auch handwerkliche Fehler drin, sodass ein Teil davon am Ende hinfällig ist? Das kann ich nicht beurteilen aber wie du sagt, ist es wichtig, dass hier vorhandene Fehler aussortiert werden. Dass Chainalysis da nichts offen legen will und offenbar nicht kooperieren möchte (Ciphertrace scheint da ja Interesse dran zu haben), sieht nicht gut aus für Chainalysis, auch wenn die natürlich ihre Strategien nicht an einen Konkurrenten verraten wollen. Quote from: mv1986 on October 03, 2023, 08:38:19 PMWas ich überhaupt nicht verstehe, ist, ob das überhaupt so geht, dass jemand auf Basis einer Closed-Source-Software derartig verknackt wird, dem sozusagen das Leben genommen wird, und selbst seine Anwälte und die zuständigen Richter keine unabhängigen Experten einschalten können/wollen, um die Prüfmethode einzusehen und auf Validität zu überprüfen? Ich weiß, wir sind hier in Amerika. Aber das wäre doch in Deutschland im Leben nicht möglich, dass ein Forensiker nicht die Validität seiner Prüfmethode nachweisen muss oder dass man weitere Gutachter hinzuzieht, die wenigstens ebenfalls eigene Berichte einbringen müssen mit einer eigens entwickelten Methode? Wir reden hier ja eigentlich von einer experimentellen Software mehr oder weniger. Mit der Gesetzgebung dort kenne ich mich nicht aus aber ja, es müsste doch zumindest möglich sein, dass eine (noch einzurichtende) unabhängige Expertengruppe des Gerichts vollen Einblick bekommt, wie Chainalysis nachvollziehbar zu diesem Ergebnis kam. Das wäre das Mindeste.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cricktor",
      "created_time": "October 08, 2023, 08:57:38 AM",
      "body": "Quote from: mv1986 on October 03, 2023, 07:41:55 PM...Das ist schon etwas ernünchternd, zu lesen, auf was für einer Gutachtenbasis dort Recht gesprochen wird (ja, woanders auch). Mir ist auch klar, daß man die Position von Ciphertrace als Konkurrent von Chainalysis durchaus kritisch hinterfragen sollte. Andererseits wäre Ciphertrace nicht gut beraten, wenn sie sich auch mit handwerklichen Fehlern diskreditierten.Ich habe auch schon mit oxt.me gearbeitet. Was mir dort fehlt, ist ein umfangreicheres markieren von Coin-Flüssen, sei es mit mehr Farben oder Labeln. Wirklich schade, daß es für die private Blockchain-Forensik anscheinend kaum oder keine Open-Source-Tools gibt. Ich habe jedenfalls bisher keine gefunden.Ein weiteres Tool, über das ich vor kurzem erst \"gestolpert\" bin (Links nur als Beispiele):Bewertung, was wahrscheinlich das Wechselgeld ist: https://explorer.bitquery.io/bitcoin/tx/d41f5de48325e79070ccd3a23005f7a3b405f3ce1faa4df09f6d71770497e9d5 (hier ist es offensichtlich)Money flow: https://explorer.bitquery.io/bitcoin/address/bc1qvndmep839uexn899qy865cvddgj4txm0nkjua9/graph(um etwas zu sehen, muss man leider erst beim Datumsbereich \"Custom range\" auswählen und dann am besten auf \"Clear\" klicken; wenn man natürlich einen sinnvollen Datumsbereich für Transaktionen kennt, dann wählt man eben diesen)Aber auch bei diesem Tool fehlen einem die Möglichkeiten, sinnvolle Marker zu setzen, um schwierigere Fälle analysieren zu können, besonders wenn es nicht eindeutig ist und man auch spekulieren muss.Verbindungen von Adressen zueinander, die sich auf dem Zeitstrahl der Blockchain erst ggf. wesentlich später zeigen, kann man mit obigen Web-Werkzeugen eher schlecht \"clustern\" oder ich habe es beim explorer.bitquery.io noch nicht ganz verstanden, welche Möglichkeiten es einem bietet. (Ist ja mehr eine Demo für das API von bitquery.io)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxMueller",
      "created_time": "October 08, 2023, 09:30:20 AM",
      "body": "Eigentlich will ich die ganze Nachverfolgung ja gar nicht selber machen....Gibt es dann vielleicht (kostenlose) Dienste, wo man einfach nur die Wallet Adresse eingibt und dann nen \"Daumenwert\" (z.B. rot-gelb-grün Skala) zurück bekommt, ob die Historie der coins eher gut oder schlecht ist?!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lakai01",
      "created_time": "October 08, 2023, 10:22:26 AM",
      "body": "Quote from: Cricktor on October 08, 2023, 08:57:38 AMIch habe auch schon mit oxt.me gearbeitet. Was mir dort fehlt, ist ein umfangreicheres markieren von Coin-Flüssen, sei es mit mehr Farben oder Labeln. Wirklich schade, daß es für die private Blockchain-Forensik anscheinend kaum oder keine Open-Source-Tools gibt. Ich habe jedenfalls bisher keine gefunden.-snip-Ich persönlich kenne dazu leider auch nur BlockSci, welches aber seit November 2020 nicht mehr weiterentwickelt wird: QuelleEs gibt jedoch sehr viele Forks von dem Projekt (also quasi abgespaltete Weiterentwicklungen), ein paar davon auch mit durchaus aktuellen Änderungen. Man müsste sich also die Zeit nehmen und die Projekte mal durchgehen um etwas Passendes zu finden. Warum sich in diesem Bereich aber generell sehr wenig (open-source) tut mag vielleicht mit folgender Aussage zusammenhängen: QuoteProblem is everyone hates people who do chain analysis. So nobody wants to waste time on a project that will be shared as a bad actor even though it will help in improving privacy. – QuelleDie Aussage kann ich gut und gerne nachvollziehen. Das Feld der forensischen Analyse und dem damit verbundenen Aufschlüsseln der Daten- und Bitcoin-Ströme ist einfach nicht gerne gesehen bei Leuten, die von sich aus deutlich mehr wert auf Privatsphäre und finanzieller Unabhängigkeit legen als der Durchschnittsbürger.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mv1986",
      "created_time": "October 08, 2023, 11:41:29 AM",
      "body": "Quote from: Lakai01 on October 08, 2023, 10:22:26 AMDie Aussage kann ich gut und gerne nachvollziehen. Das Feld der forensischen Analyse und dem damit verbundenen Aufschlüsseln der Daten- und Bitcoin-Ströme ist einfach nicht gerne gesehen bei Leuten, die von sich aus deutlich mehr wert auf Privatsphäre und finanzieller Unabhängigkeit legen als der Durchschnittsbürger. Das wäre genauso wie wenn man sagt, dass man keine Spaghetti mehr herstellen sollte, weil es unter den Nudel-Liebhabern zu viele Leute gibt, die gegen Spaghetti sind und die Penne-Form bevorzugen. Die Blockchain-Forensik ist ein absolut solider und wichtiger Bereich und das erinnert mich auch an diejenigen, die doch die furchtbare Polizei immer durch den Schmutz ziehen, aber wenn es in der dunklen Küche nachts knatscht, dann direkt die ersten sind, die die Polizei zur Hilfe rufen. Das Feld hat durchaus seine Daseinsberechtigung und wird übrigens vermutlich hinter verschlossenen Türen schon deutlich intensiver betrieben, als wir das jetzt hier so glauben. Ich bin mir sehr sicher, dass in allen fortschrittlicheren Ländern bereits Forensik-Einheiten entweder bei den Finanzbehörden oder generell Ermittlungsbehörden vorhanden sind. Mit was die arbeiten und wen die sich so ins Haus holen, keine Ahnung. Außerdem lässt man hier einen ganz wichtigen Aspekt außen vor und das offenbart auch einen Knick in der Logik: Was gäbe es denn besseres, als ein öffentlich zugängliches open-source Tool, das state of the art ist und mit dem jeder seine eigenen Bewegungen forensisch und bullet-proof nachvollziehen kann? Denn wenn jeder genau das tun kann, dann ist er erst recht in der Lage die zukünftigen Bewegungen mit Hinblick auf Privatsphäre so anzupassen, dass das Tool eben solche Ergebnisse ausspuckt, die für eine erhöhte Privatsphäre sprechen. Schlechter wäre es, wenn ein solches Tool hinter verschlossenen Türen entwickelt wird von den besten in der Industrie und es nicht jeder nutzen kann. Also ich glaube, dass der Markt dafür riesig ist und es sehr viele Leute nutzen würden. Meine Idee wäre, dass ein Entwickler eines solchen Tools in einem Analysebericht am besten noch direkt mögliche weitere Tools und Routen anbietet, um entsprechende unerwünschte forensische Ergebnisse bei weiteren Transaktionen zu vermeiden. Könnte als eine Art Up-Selling oder Cross-Selling laufen. \"Wie kannst du zu künftig einen Score von X erreichen? Nutze folgende Optionen...\" Hoher Score X = hohe Privatsphäre usw. Also ich bin sogar der Überzeugung, dass da ein gewaltiger Bedarf ist gerade auch für schlechter informierte und gebildete (im Security- und Privatsphäre-Bereich) Nutzer. Ich wäre für ein grundsolides Forensik-Tool, dass mir sogar noch Empfehlungen und Optionen aufbietet, wirklich erfreut.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cricktor",
      "created_time": "October 08, 2023, 02:36:52 PM",
      "body": "Quote from: mv1986 on October 08, 2023, 11:41:29 AM...Da bin ich ganz bei dir. Pauschale Kritik und Verteufelung von forensischen Werkzeugen ist schade und ziemlich unreflektiert. Es ist meines Erachtens so wie mit anderem Werkzeug: mit einem scharfen Messer kannst du Brot, Wurst und Anderes schneiden, du kannst aber auch Jemanden verletzen oder gar töten. Entscheidend ist die Intention des Werkzeugnutzers; es besteht kein Zwang dazu, Werkzeuge zu missbrauchen. Potentiell möglich ist Vieles.Ob das wenig informierte Nutzer dazu bringt, Dinge im Kryptobereich besser zu verstehen? Vielleicht, vielleicht auch nicht. Wenn der Wille zum Lernen und Verstehen nicht ausgeprägt ist, dann nützen einem möglicherweise auch die tollsten Visualisierungen nichts, wenn man sie nicht zu interpretieren vermag. Tendenziell sähe oder wünschte ich mir mehr solcher Werkzeuge, die auch aktiv weiterentwickelt werden. Warum sollte man das Feld irgendwelchen \"Black Box\" Firmen oder Regierungen überlassen, mit ihren Voodoo-Analysen, deren Stichhaltigkeit dann kaum einer kritisch überprüfen kann.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mv1986",
      "created_time": "October 08, 2023, 03:18:46 PM",
      "body": "Quote from: Cricktor on October 08, 2023, 02:36:52 PMQuote from: mv1986 on October 08, 2023, 11:41:29 AM...~Ob das wenig informierte Nutzer dazu bringt, Dinge im Kryptobereich besser zu verstehen? Vielleicht, vielleicht auch nicht. Wenn der Wille zum Lernen und Verstehen nicht ausgeprägt ist, dann nützen einem möglicherweise auch die tollsten Visualisierungen nichts, wenn man sie nicht zu interpretieren vermag. Tendenziell sähe oder wünschte ich mir mehr solcher Werkzeuge, die auch aktiv weiterentwickelt werden. Warum sollte man das Feld irgendwelchen \"Black Box\" Firmen oder Regierungen überlassen, mit ihren Voodoo-Analysen, deren Stichhaltigkeit dann kaum einer kritisch überprüfen kann.Naja wie überall im Leben haben verschiedene Leute ein verschiedenes Level an Interesse an bestimmten Dingen, die auch sie selbst betreffen. Ich bin jetzt nicht der Vorsichtigste im Internet, aber gebe mir da wo nötig auch ein bisschen Mühe. Nur oftmals ist das Problem eher nicht, dass die Leute nicht wollen oder sich nicht interessieren, sondern dass sie gar nicht wissen was abgeht. Ich kann es jetzt grad nicht auf die Schnelle finden, aber da hat mal jemand dieses Selbstexperiment gemacht und bei Google alles angefordert was auch über ihn gesammelt wurde. Das war total irre. Da gab es eigentlich nichts mehr was Google nicht über ihn wusste. Und er wusste nie, was Google über ihn weiß. Oder die Firma incogni.com, die im Kundenauftrag ausfindig machen, wo die eigenen Daten hinterlegt sind oder hinverkauft wurden und die \"Besitzer\" dann auffordern, diese Daten zu löschen. Da gibt es Reports von Leuten, die irgendwie den Antrag zur Löschung bei ein paar hundert Firmen in Auftrag geben mussten und das überrascht mich überhaupt nicht. Wenn man ein transparentes Tool hätte, was einem mal vor Augen hält, welche Spuren man auch durch Blockchain-Nutzung und evtl. Social-Engineering hinterlässt, dann könnte es durchaus sein, dass Leute zweimal nachdenken vor der nächsten Handlung. Aber es müsste sehr einfach nachvollziehbar sein, eben geeignet für Leute, die technisch nicht wirklich versiert sind. Aber eins ist klar und das hast Du ja mit der Black-Box erwähnt: Wir sind x-mal besser beraten, wenn ein Start-Up den Schritt wagt und transparent arbeitet, um ein Tool zur Verfügung zu stellen, als wenn wir solche ominösen Geschichten über ein closed-source Tool von Chainalysis lesen müssen, dass noch nie eine unabhängige Partei eingesehen hat, und auf Basis dessen Menschen lebenslang hinter Gitter kommen. Das finde ich echt hardcore. Das Schlimme daran ist, dass die Beweisführung dagegen ja auch kaum möglich ist, weil sich niemand so gründlich mit seinem eigenen Bewegungsmuster auseinandersetzt und das dann auch noch dokumentiert! Das macht kein Mensch logischerweise und plötzlich wird man auf Grundlage dieses Reports von Chainalysis verknackt (als Beispiel). Das ist auch noch anders als bei der Schufa, weil sich da jeder mit seinen eigenen Angelegenheiten auskennt. Die können einem nicht einfach was unterjubeln und man kann es nicht widerlegen. Das ist bei Blockchain-Bewegungen schon deutlich schwerer. Aber Chainalysis hat meines Wissens eine dicke fette Lobby im Rücken und ich meine auch schon Anteile an staatliche Akteure sehr früh verkauft oder? Müsste ich nochmal recherchieren, wenn ich Zeit habe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "October 09, 2023, 08:24:30 PM",
      "body": "Quote from: mv1986 on October 08, 2023, 11:41:29 AMWas gäbe es denn besseres, als ein öffentlich zugängliches open-source Tool, das state of the art ist und mit dem jeder seine eigenen Bewegungen forensisch und bullet-proof nachvollziehen kann? Denn wenn jeder genau das tun kann, dann ist er erst recht in der Lage die zukünftigen Bewegungen mit Hinblick auf Privatsphäre so anzupassen, dass das Tool eben solche Ergebnisse ausspuckt, die für eine erhöhte Privatsphäre sprechen. Schlechter wäre es, wenn ein solches Tool hinter verschlossenen Türen entwickelt wird von den besten in der Industrie und es nicht jeder nutzen kann. Also ich glaube, dass der Markt dafür riesig ist und es sehr viele Leute nutzen würden. Da kann ich mv1986 voll zustimmen. Die Verfügbarkeit einer solchen Anwendung wäre überaus wünschenswert und ich überlege noch, woran das aktuell scheitert. Vielleicht an der Problematik, dass es sehr aufwändig ist, Adressen einer Börse zuordnen zu können und diese Angaben auf einem aktuellen Stand zu halten? Die großen Tauschbörsen dürften ihre Aus- und Einzahlungsadressen regelmäßig wechseln, weshalb mal mindestens ein Mitarbeiter das betreuen und neu in das Programm einpflegen muss oder gibt es hierzu irgendwelche Automatisierungsmöglichkeiten? Selbst, wenn die Zuordnung zu den größten Börsen zu viel Aufwand wäre, sollte zumindest ein Werkzeug, welches einfach nur die Transaktionsströme visualisiert, auch ohne großen Mehraufwand möglich sein mit den Daten, die in der Blockchain für alle Leute öffentlich verfügbar sind. Ähnlich wie das Merit-Dashboard hier im Forum, nur mit Adressen und Bitcoin- (statt Merit-) Transaktionen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mv1986",
      "created_time": "October 09, 2023, 11:50:39 PM",
      "body": "Quote from: 1miau on October 09, 2023, 08:24:30 PMQuote from: mv1986 on October 08, 2023, 11:41:29 AMWas gäbe es denn besseres, als ein öffentlich zugängliches open-source Tool, das state of the art ist und mit dem jeder seine eigenen Bewegungen forensisch und bullet-proof nachvollziehen kann? Denn wenn jeder genau das tun kann, dann ist er erst recht in der Lage die zukünftigen Bewegungen mit Hinblick auf Privatsphäre so anzupassen, dass das Tool eben solche Ergebnisse ausspuckt, die für eine erhöhte Privatsphäre sprechen. Schlechter wäre es, wenn ein solches Tool hinter verschlossenen Türen entwickelt wird von den besten in der Industrie und es nicht jeder nutzen kann. Also ich glaube, dass der Markt dafür riesig ist und es sehr viele Leute nutzen würden. Da kann ich mv1986 voll zustimmen. Die Verfügbarkeit einer solchen Anwendung wäre überaus wünschenswert und ich überlege noch, woran das aktuell scheitert. Vielleicht an der Problematik, dass es sehr aufwändig ist, Adressen einer Börse zuordnen zu können und diese Angaben auf einem aktuellen Stand zu halten? Die großen Tauschbörsen dürften ihre Aus- und Einzahlungsadressen regelmäßig wechseln, weshalb mal mindestens ein Mitarbeiter das betreuen und neu in das Programm einpflegen muss oder gibt es hierzu irgendwelche Automatisierungsmöglichkeiten? Selbst, wenn die Zuordnung zu den größten Börsen zu viel Aufwand wäre, sollte zumindest ein Werkzeug, welches einfach nur die Transaktionsströme visualisiert, auch ohne großen Mehraufwand möglich sein mit den Daten, die in der Blockchain für alle Leute öffentlich verfügbar sind. Ähnlich wie das Merit-Dashboard hier im Forum, nur mit Adressen und Bitcoin- (statt Merit-) Transaktionen.  Tja, ihr kennt bestimmt auch noch diese Navigations-Apps, bei denen man dann manuell noch Blitzer oder neue Straßen eintragen konnte und durch die Masse an Nutzern haben diese Apps durch die regelmäßigen Aktualisierungen es dann tatsächlich geschafft, approximativ 100% genau zu werden auch in Sachen Baustellen und Blitzern (mobile Blitzer inkl., weil sie oft an den gleichen Stellen standen). So einen Community-Effort könnte ich mir bei sowas auch vorstellen. Dass man also die einem selbst bekannten On- und Offramps in eine solche Applikation einspeist. Noch würde es wahrscheinlich schlicht an Datenmasse mangeln, um da in die Nähe von 100% zu kommen. Aber über die Zeit könnte so eine App interessant werden. Das ist übrigens auch einer der Hauptkritikpunkte in dem Report von Cyphertrace zum Thema Sterlingov: die völlig verschwiegene Fehlerquote. Chainalysis hat überhaupt keine Wahrscheinlichkeitsintervalle angegeben für deren Aussagen und es wohl so dargestellt, als sei das halt jetzt so. Da hat Cyphertrace allerdings auch aus eigener Erfahrung mit offenen Karten gespielt und mal einige Fehlerwahrscheinlichkeiten rausgegeben. Das ist ja wohl auch das Mindeste, dass man zu einer Aussage auch die Wahrscheinlichkeit der Richtigkeit der Aussage hinzufügt. Aber es wird vermutet, dass Chainalysis nicht mal dafür interne Testprotokolle angefertigt hat, um sagen zu können bei wie vielen Aussagen in der Vergangenheit sie falsch gelegen haben. Aber ja, eine solche App wäre sicherlich etwas, das die Community langfristig gebrauchen kann. Ich wüsste gar nicht wie ich jetzt einen Report von Chainalysis einordnen sollte, wenn man die Möglichkeit hätte dort gegen Geld als Privatperson einen anzufordern. Dann lieber ein open-source Tool bei dem ich weiß, dass es noch in der Frühphase ist und bei dem ich weiß, dass Experten da auch in den Code hineinschauen können. Closed-source wäre Bitcoin schließlich auch nicht da, wo das System jetzt ist.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lakai01",
      "created_time": "October 10, 2023, 04:20:53 AM",
      "body": "Quote from: mv1986 on October 08, 2023, 11:41:29 AMQuote from: Lakai01 on October 08, 2023, 10:22:26 AMDie Aussage kann ich gut und gerne nachvollziehen. Das Feld der forensischen Analyse und dem damit verbundenen Aufschlüsseln der Daten- und Bitcoin-Ströme ist einfach nicht gerne gesehen bei Leuten, die von sich aus deutlich mehr wert auf Privatsphäre und finanzieller Unabhängigkeit legen als der Durchschnittsbürger. Das wäre genauso wie wenn man sagt, dass man keine Spaghetti mehr herstellen sollte, weil es unter den Nudel-Liebhabern zu viele Leute gibt, die gegen Spaghetti sind und die Penne-Form bevorzugen. Die Blockchain-Forensik ist ein absolut solider und wichtiger Bereich und das erinnert mich auch an diejenigen, die doch die furchtbare Polizei immer durch den Schmutz ziehen, aber wenn es in der dunklen Küche nachts knatscht, dann direkt die ersten sind, die die Polizei zur Hilfe rufen. -snip-Da bin ich ganz bei dir, ja. Ich sehe den Punkt persönlich auch genauso: Die Werkzeuge gibt es ja so oder so am Markt, die Analyse ist also möglich und für eine unbestimmt große Gruppe an Menschen auch möglich, bspw. Mitarbeiter der jeweiligen Firmen. Ich hätte also auch gerne die Möglichkeit meine eigenen Transaktionen und Wallets durch so ein Werkzeug zu jagen und mich mit dem Ergebnis auseinanderzusetzen. Das hilft definitiv auch dann ungemein, wenn es mal zu einem Herkunftsnachweis kommen sollte wo man selbst Probleme hat, die Transaktionen nachzuvollziehen.Andererseits verstehe ich auch die von mir geteilte Aussage sehr gut. Wenn jemand solche Werkzeuge als OpenSource-Alternative zu proprietären Werkzeugen anbietet, so muss dieser höchstwahrscheinlich mit Gegenwind aus der Crytpo-Community rechnen. Wie schnell unliebsame Entwicklungen in einen \"Shitstorm\" ausarten sieht man ja mittlerweile nahezu tagtäglich ... oder braucht einfach nur mal einen Blick in /r/CryptoCurrencies werfen wenn sich die Leute über ein neu vorgestelltes Projekt unterhalten. Hier ist die Community leider doch sehr toxisch.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "October 10, 2023, 11:53:28 PM",
      "body": "Quote from: mv1986 on October 09, 2023, 11:50:39 PMTja, ihr kennt bestimmt auch noch diese Navigations-Apps, bei denen man dann manuell noch Blitzer oder neue Straßen eintragen konnte und durch die Masse an Nutzern haben diese Apps durch die regelmäßigen Aktualisierungen es dann tatsächlich geschafft, approximativ 100% genau zu werden auch in Sachen Baustellen und Blitzern (mobile Blitzer inkl., weil sie oft an den gleichen Stellen standen). So einen Community-Effort könnte ich mir bei sowas auch vorstellen. Dass man also die einem selbst bekannten On- und Offramps in eine solche Applikation einspeist. Noch würde es wahrscheinlich schlicht an Datenmasse mangeln, um da in die Nähe von 100% zu kommen. Aber über die Zeit könnte so eine App interessant werden. Das ist eine wirklich interessante Überlegung eines dezentralen Ansatzes dafür. So wäre man nicht auf eine zentrale Instanz angewiesen (z.B. Entwickler- oder Betreuerteam), welches die Informationen immer wieder auf dem aktuellsten Stand halten müsste. Die Frage ist nur, ob das auch in der Praxis funktionieren würde. Der Vergleich mit dem Blitzer ist gut, jedoch sehe ich das Hauptproblem darin, dass möglicherweise viele ungeprüfte Einträge hinzugefügt werden würden, die sich teilweise gegenseitig widersprechen. Auch bewusster Missbrauch z.B. durch Hackergruppen, die dieses Werkzeug unbrauchbar machen wollen oder um ihre eigenen Spuren zu verschleiern, wäre eine Problematik, die gelöst werden müsste. Wenn man gegen diesen Missbrauch erfolgreich vorgehen könnte, wäre das ein spannender Ansatz. Ein Missbrauchsschutz könnte so ähnlich aufgebaut werden, dass Einträge vertrauenswürdiger Nutzer ein größeres Gewicht hätten (ähnlich wie DT im Bitcointalk) oder Leute, die immer wieder mit ungenauen Einträgen auffallen, würden von der Gewichtung der Einträge herabgestuft. Da gäbe es bestimmt einige Ansätze. Also insgesamt eine gute Idee, die mit dem richtigen Konzept bestimmt umsetzbar wäre.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "October 28, 2023, 04:04:46 PMLast edit: October 28, 2023, 04:24:08 PM by 1miau",
      "body": "Ich habe es nun auch endlich einmal geschafft, mich dort anzumelden.  Aber wie kommt man denn dort hin, dass die Transaktionen nachverfolgbar visualisiert werden?   Quote from: Turbartuluk on October 02, 2023, 11:12:32 PMBei mir sieht das aktuell nicht anders aus, als ein normaler Blockexplorer, bei dem man die Adressen lediglich manuell nachverfolgen kann...Edit: funktioniert nun, irgendwie war das benötigte Menü auf der linken Seite zu Beginn nicht verfügbar...Warum auch immer...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxMueller",
      "created_time": "October 28, 2023, 06:10:51 PM",
      "body": "Quote from: 1miau on October 28, 2023, 04:04:46 PMEdit: funktioniert nun, irgendwie war das benötigte Menü auf der linken Seite zu Beginn nicht verfügbar...Warum auch immer... Kann mich da auch noch dran erinnern, dass im am anfang das Tools Menü auch suchen musste. Wenn ich mich recht erinnere dann ging das nur wenn man sich im blockexplorer eine Transaktion angeschaut hat. Bei btc-adressen gabs das Menü meine ich nicht bzw. es wurde nicht eingeblendet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}