{
  "id": "topic_5434147",
  "title": "bitmover",
  "author": "bitmover",
  "created_time": "January 11, 2023, 12:59:08 PM",
  "content": "QuoteA corretora Crypto.com, uma das mais conhecidas do mercado, informou que vai deslistar a criptomoeda Tether (USDT), para seus clientes que moram no Canadá, após seguir notificações da Ontario Securities Commission (OSC).Em nota ao portal Decrypt, um porta-voz da corretora confirmou que a remoção da maior stablecoin para clientes canadenses segue uma recomendação da comissão de valores do país.https://livecoins.com.br/crypto-com-canada-usdt/Olha que interessante. A comissao de valores mobiliarios do Canada está proibindo (ou não recomendando ) a venda de USDT. Será que isso poderia afetar o preço do USDT, mesmo com lastro, caso acontecesse nos EUA/Europa?Se ninguem puder vender, certamente vai valer mesmo.Nunca tinha pensado nesse risco jurídico, mas ele existe!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434147",
  "comments": [
    {
      "author": "joker_josue",
      "created_time": "January 11, 2023, 05:25:30 PM",
      "body": "Quote from: bitmover on January 11, 2023, 12:59:08 PMOlha que interessante. A comissao de valores mobiliarios do Canada está proibindo (ou não recomendando ) a venda de USDT. Será que isso poderia afetar o preço do USDT, mesmo com lastro, caso acontecesse nos EUA/Europa?Lembro-me que a 1 ou 2 anos atras a Binance teve problemas para operar no Reino Unido, por questões de legalização, o que afetou os clientes UK, não conseguindo sacar/depositar Libras. Este tipo de situações podem ser existir em qualquer coin.Acho que na realidade acaba por não afetar muito o mercado, pode-se sentir algo nos primeiros momentos, mas depois fica tudo igual.No caso de uma stablecoin as coisas podem ser um pouco diferentes, porque estão dependendes de um lastro fiat, onde podem surgir mais imposições legais.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "January 12, 2023, 03:38:15 PM",
      "body": "Quote from: bitmover on January 11, 2023, 12:59:08 PMQuoteA corretora Crypto.com, uma das mais conhecidas do mercado, informou que vai deslistar a criptomoeda Tether (USDT), para seus clientes que moram no Canadá, após seguir notificações da Ontario Securities Commission (OSC).Em nota ao portal Decrypt, um porta-voz da corretora confirmou que a remoção da maior stablecoin para clientes canadenses segue uma recomendação da comissão de valores do país.https://livecoins.com.br/crypto-com-canada-usdt/Olha que interessante. A comissao de valores mobiliarios do Canada está proibindo (ou não recomendando ) a venda de USDT. Será que isso poderia afetar o preço do USDT, mesmo com lastro, caso acontecesse nos EUA/Europa?Se ninguem puder vender, certamente vai valer mesmo.Nunca tinha pensado nesse risco jurídico, mas ele existe!Mas por que será que a restrição está focada no USDT e não em stablecoins como um todo? A matéria cita que as ações estão vinculadas a perspectiva que a comissão de valores canadense tem sobre as stablecoins terem uma  ''aparência de valor mobiliário ou derivativo, ou seja, não podem operar sem autorização''. Então não seria exatamente preocupações com a operação/mecansmos de estabildiade do USDT, mas pela classificação. Então entendo que sob esse argumento, todas deveriam ser proibidas/liberadas no mesmo regime.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "January 12, 2023, 06:31:01 PM",
      "body": "Quote from: Disruptivas on January 12, 2023, 03:38:15 PMMas por que será que a restrição está focada no USDT e não em stablecoins como um todo?Também não entendo. A mesma coisa aconteceu com a USDT em Nova Iorque, onde a stable também foi banida e o motivo dado foi a falta de transparência e mentiras da Tether quanto ao lastro da moeda (todo aquele caso da Bitfinex perdendo o $$). Pode também ter relação com o tamanho dela, considerada a principal stablecoin do mercado (mais volume e marketcap).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "January 12, 2023, 06:45:57 PM",
      "body": "Quote from: Disruptivas on January 12, 2023, 03:38:15 PMMas por que será que a restrição está focada no USDT e não em stablecoins como um todo?Stablecoins são empréstimos. São empresas agindo como bancos, recebendo usd e emitindo Stablecoins em troca.Cada empresa dessa (paxos binance coinbase tether) opera de determinada maneira.A zanga aqui é com a tether, não com as Stablecoins. A usdc tem tudo registrado certinho, assim como a busd.QuoteRegulatedPaxos and BUSD are approved and regulated by the New York State Department of Financial Services, ensuring the utmost of consumer protections.https://paxos.com/busd/QuoteCircle is regulated as a licensed money transmitter under U.S. state law just like PayPal, Stripe, and Apple Pay. Circle’s financial statements are audited annually and subject to review by the SEC.https://www.circle.com/en/usdc#transparencyNão tem nada parecido no site da tether.Não tô falando de reservas,  mas das autorizações dos órgãos americanos",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "January 13, 2023, 08:02:33 PM",
      "body": "Quote from: bitmover on January 12, 2023, 06:45:57 PMA zanga aqui é com a tether, não com as Stablecoins. A usdc tem tudo registrado certinho, assim como a busd.QuoteRegulatedPaxos and BUSD are approved and regulated by the New York State Department of Financial Services, ensuring the utmost of consumer protections.https://paxos.com/busd/QuoteCircle is regulated as a licensed money transmitter under U.S. state law just like PayPal, Stripe, and Apple Pay. Circle’s financial statements are audited annually and subject to review by the SEC.https://www.circle.com/en/usdc#transparencyNão tem nada parecido no site da tether.Não tô falando de reservas,  mas das autorizações dos órgãos americanosEntão, mas se tu ler a publicação que deriva a decisão da crypto.com, não tem nada citando Tether, eles falam de stablecoin apenas. Additionally, as outlined in its business plan , the CSA continues to monitor and assess the presence and role of stablecoins in Canadian capital markets. As a result of this ongoing work, the CSA is of the view that stablecoins, or stablecoin arrangements, may constitute securities and/or derivatives. Crypto trading platforms that are registered or that have entered into a pre-registration undertaking are reminded that they are prohibited from permitting Canadian clients to trade, or obtain exposure to, any crypto asset that is itself a security and/or a derivative. Crypto trading platforms are expected to have established policies and procedures to determine whether each crypto asset they provide exposure to is a security and/or derivative.Eles não dizem que stablecoins não reguladas sobre o U.S State ou qualquer outro orgão do Canadá estão sob esse regimento. Eu tenho um problema bem sério com leis e pessoas que são proibitivas ao invés de prescritivas. Sabe quando tu faz/apresenta alguma ideia e pessoa diz: não gosto. E tu diz: blz, como quer? qual sua sugestão? E não tem. Pra mim é a mesma coisa que esses paranaues. Se dissessem: para operar, voce deve preencher isso aqui... seria muito mais fácil pra todo mundo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "January 13, 2023, 09:41:08 PMLast edit: January 15, 2023, 10:26:27 PM by bitmover",
      "body": "Quote from: Disruptivas on January 13, 2023, 08:02:33 PMEntão, mas se tu ler a publicação que deriva a decisão da crypto.com, não tem nada citando Tether, eles falam de stablecoin apenas. Additionally, as outlined in its business plan , the CSA continues to monitor and assess the presence and role of stablecoins in Canadian capital markets. As a result of this ongoing work, the CSA is of the view that stablecoins, or stablecoin arrangements, may constitute securities and/or derivatives. Crypto trading platforms that are registered or that have entered into a pre-registration undertaking are reminded that they are prohibited from permitting Canadian clients to trade, or obtain exposure to, any crypto asset that is itself a security and/or a derivative. Crypto trading platforms are expected to have established policies and procedures to determine whether each crypto asset they provide exposure to is a security and/or derivative.Eles não dizem que stablecoins não reguladas sobre o U.S State ou qualquer outro orgão do Canadá estão sob esse regimento. Eu tenho um problema bem sério com leis e pessoas que são proibitivas ao invés de prescritivas. Sabe quando tu faz/apresenta alguma ideia e pessoa diz: não gosto. E tu diz: blz, como quer? qual sua sugestão? E não tem. Pra mim é a mesma coisa que esses paranaues. Se dissessem: para operar, voce deve preencher isso aqui... seria muito mais fácil pra todo mundo. Pois é, eu li aqui a decisão que tem esse texto desse site: https://www.osc.ca/en/news-events/news/csa-provides-update-crypto-trading-platforms-operating-canadaO que me chamou a atenção é a frase \"As a result of this ongoing work, the CSA is of the view that stablecoins, or stablecoin arrangements, may constitute securities and/or derivatives .... are prohibited from permitting Canadian clients to trade, or obtain exposure to, any crypto asset that is itself a security and/or a derivative.\"Ou seja, uma stablecoin pode ser considerada security ou derivativo (Não diz que todas sao iguais). Depois ele fala que as corretoras sao proibidas de vender securities/derivativos.A crypto.com deve ter decidido que USDT cabe nisso, ou então recebeu um comunicado diretamente sugerindo que ela tirasse. ? Fica no campo das suposiçÕes...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "January 13, 2023, 10:36:37 PM",
      "body": "Quote from: TryNinja on January 12, 2023, 06:31:01 PMQuote from: Disruptivas on January 12, 2023, 03:38:15 PMMas por que será que a restrição está focada no USDT e não em stablecoins como um todo?Também não entendo. A mesma coisa aconteceu com a USDT em Nova Iorque, onde a stable também foi banida e o motivo dado foi a falta de transparência e mentiras da Tether quanto ao lastro da moeda (todo aquele caso da Bitfinex perdendo o $$). Pode também ter relação com o tamanho dela, considerada a principal stablecoin do mercado (mais volume e marketcap).Também me veio a cabeça a questão da Tether não ter ainda convencido a massa sobre os seus lastros, porém não sei se atacar logo essa \"gigante\" seja um boa estratégia.Se a intenção é a de dar \"um recado\", não seria mais fácil e talvez até faria mais barulho, proibir várias altcoins pequenas que não teriam força para reagir à proibição e nem mesmo equilibrar sua paridade, causando algum efeito cascata no mercado?Creio que a Tether já está muito enraizada, se nem mesmo o escândalo passado sobre aquela auditoria conseguiu derrubá-la, quem diria agora \"algumas corretoras\" banindo-a?Somente um trabalho conjunto faria a Tether quebrar, mas no fundo mesmo, ninguém quer isso.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "January 13, 2023, 11:47:23 PM",
      "body": "Quote from: alegotardo on January 13, 2023, 10:36:37 PMSe a intenção é a de dar \"um recado\", não seria mais fácil e talvez até faria mais barulho, proibir várias altcoins pequenas que não teriam força para reagir à proibição e nem mesmo equilibrar sua paridade, causando algum efeito cascata no mercado?Isso iria machucar os especuladores dessas moedinhas, mas não acho que traria um dano real ao mercado. No final do dia, ninguém se importa se o CumRocket ou ElonInu foi bloqueado. Tirar a Tether e outras moedas grandes de mercados consolidados sim acaba fazendo uma diferença, em minha opinião.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}