{
  "id": "topic_5406164",
  "title": "Yikker",
  "author": "Yikker",
  "created_time": "July 13, 2022, 06:46:22 PM",
  "content": "Good afternoon, everyone, no matter how I tried to find entertainment for myself in this market, I can’t do anything, I even started trading with leverage, etc. I lost a lot of money in such a bear market and I want to calm down a little, I heard that there are options to earn big money on bets in different liquidity pools and staking, I want to know where you can find a platform that will show the best percentages for betting and liquidity. It is desirable that a verified site or platform, otherwise it was enough for me to get into a couple of scam pools and I no longer want to lose my money, if there are options with different percentages I will be glad to see and read thanks",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406164",
  "comments": [
    {
      "author": "MrMeddox",
      "created_time": "July 13, 2022, 06:52:20 PM",
      "body": "Hello, I have been trying to find something between a big income and a stable one for a long time, as we know a stable income is always less than where you can lose your funds, but I found a really cool project, rather than a project, but a branch from the HashEx platform, this is a cool auditor with with a big rating, they made AnalytEx the name of this site where you can see all the pools and staking with different APYs and the most convenient thing for me is that you can put everything in one place, that is, I found 5 good offers on AnalytEx and made staking there or LP and everything is in one place, there are different percentages and large APY and stables can be contributed differently, and whatever you confuse, it’s not AnalytEx that allows you to contribute to their site, but they act as an aggregator that gives you options that are on the market . As for me, everyone benefits from this, you can find yourself the best project in which you will contribute money. Good luck and most importantly, my messages are always my opinion, do your DYOR and good luck will be with you!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "July 13, 2022, 07:33:05 PM",
      "body": "Adding funds to the Liquidity pool is quite risky, especially in a bear market. Traders would out Liquidity and you may get a useless token in return. Staking would help to increase your tones, not token value. So if the market moves up you may have decent money. Bear in mind, that choosing a staking pool is also quite important. Staking at the useless token pool would never raise the token price. So everywhere is at risk. You may choose some potential tokens for staking that have a chance to raise the price again. Be careful mate, it's a financial decision.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dunfida",
      "created_time": "July 13, 2022, 07:45:24 PM",
      "body": "Quote from: Yikker on July 13, 2022, 06:46:22 PMGood afternoon, everyone, no matter how I tried to find entertainment for myself in this market, I can’t do anything, I even started trading with leverage, etc. I lost a lot of money in such a bear market and I want to calm down a little, I heard that there are options to earn big money on bets in different liquidity pools and staking, I want to know where you can find a platform that will show the best percentages for betting and liquidity. It is desirable that a verified site or platform, otherwise it was enough for me to get into a couple of scam pools and I no longer want to lose my money, if there are options with different percentages I will be glad to see and read thanksWhen you are just new into trading world then dont ever tend to touch up leverage or futures trading.It would be good if you do stick with spot and try your best to sustain yourself on that.For staking then APY arent really that good even if we do talk that its better than with bank interest on yearly basis but we know that everything is really unpredictable.You cant really know on what would happen on the coin or project that you've been holding for a year.So better stick with spot and find yourself about the difference but dont expect or treat it out easily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batang_bitcoin",
      "created_time": "July 13, 2022, 08:03:28 PM",
      "body": "In liquidity pools, there is the impermanent loss that you have to take as the collateral of what you'll be adding there. In staking, the risk is also there because the market is volatile and that percentage of APY won't guarantee that you're in profit if the price goes at low. If you're still trying to find some platforms for you to stake, try to pay a visit on mycointainer, they've got several assets that you can choose for you to stake. APY for most are not that much but they're decent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "July 14, 2022, 05:42:26 AM",
      "body": "LPing isn't something where you just leave your money and just wait for the yield. It's going to depend a lot on the coins/tokens you're LPing as well.Based on your description, what you need is discipline. If you get bored and eventually get greedy, you're going to lose money regardless of what industry you're in. And I'm not even against trading, but if you use leverage and blow up your account, then you have a problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tellek Garing",
      "created_time": "July 14, 2022, 06:45:10 AM",
      "body": "Quote from: Yikker on July 13, 2022, 06:46:22 PMGood afternoon, everyone, no matter how I tried to find entertainment for myself in this market, I can’t do anything, I even started trading with leverage, etc. I lost a lot of money in such a bear market and I want to calm down a little, I heard that there are options to earn big money on bets in different liquidity pools and staking, I want to know where you can find a platform that will show the best percentages for betting and liquidity. It is desirable that a verified site or platform, otherwise it was enough for me to get into a couple of scam pools and I no longer want to lose my money, if there are options with different percentages I will be glad to see and read thanksStaking for high APY is deception and more risky than future or margin trading. Staking rewards is like what you get by not selling your tokens so the developer or founder can dump their own. I have loose a lot from Wonderland, drip, bloc, animalfarm and so many of them. The best way to make money from crypto market still remains either buy when the market is at the bottom and sell when it up or buy in the second year to halving like this year and sell in 2025.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rufsilf",
      "created_time": "July 14, 2022, 01:26:23 PM",
      "body": "Quote from: Yikker on July 13, 2022, 06:46:22 PMGood afternoon, everyone, no matter how I tried to find entertainment for myself in this market, I can’t do anything, I even started trading with leverage, etc. I lost a lot of money in such a bear market and I want to calm down a little, I heard that there are options to earn big money on bets in different liquidity pools and staking, I want to know where you can find a platform that will show the best percentages for betting and liquidity. It is desirable that a verified site or platform, otherwise it was enough for me to get into a couple of scam pools and I no longer want to lose my money, if there are options with different percentages I will be glad to see and read thanksWell, based on your experience and losses, it is sad to say that this place isn't for you mate, not really for you. I know your goal is to make money but crypto doesn't give you back despite the thing and adjustments you've did. This will simply tell you that your journey isn't for crypto, you are one of the thousands who have been trying to invest but it fails. You can't blame yourself, not even the market, and of course, nothing. I would say to stop forcing yourselves in here and don't get fooled by these influencers as you can see, you are not making a profit anymore but just losses. Please reconsider moving on and leave crypto as this wasn't meant for you mate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "July 14, 2022, 08:42:33 PM",
      "body": "Staking is the most useless money making technique I have come across in crypto to date. For a person like you, I would advise you to buy good and promising high market cap crypto assets, maybe diversify your portfolio. Send your assets to a secure wallet or hardware wallet, keep it safe and wait until the goes into a bull run. Trust you will make way more money that useless staking APYs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "July 15, 2022, 04:00:51 AM",
      "body": "Where have you been the last 2 months?All these high staking yield projects have all gone bust and many lost their savings. First with Luna, and then the various lending platforms like Celcius.People lost all their savings because they wanted like 10-20% yield.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "July 15, 2022, 07:32:46 AM",
      "body": "Quote from: Yikker on July 13, 2022, 06:46:22 PMGood afternoon, everyone, no matter how I tried to find entertainment for myself in this market, I can’t do anything, I even started trading with leverage, etc. I lost a lot of money in such a bear market and I want to calm down a little, I heard that there are options to earn big money on bets in different liquidity pools and staking, I want to know where you can find a platform that will show the best percentages for betting and liquidity. It is desirable that a verified site or platform, otherwise it was enough for me to get into a couple of scam pools and I no longer want to lose my money, if there are options with different percentages I will be glad to see and read thanksYou just want to introduce this project, not to ask for advice right?No one is safe no one can guarantee that, even when you use a platform that you think is safe for staking you can still lose both the value of the coin you are staking or also lose your investment, especially when the market is bearish all forms of investment become very not safe.And when you introduce that this platform is safe be careful there will be newbies who can get trap with your statement even if you suggest to DYOR",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "July 15, 2022, 08:08:17 AM",
      "body": "Quote from: adaseb on July 15, 2022, 04:00:51 AMWhere have you been the last 2 months?All these high staking yield projects have all gone bust and many lost their savings. First with Luna, and then the various lending platforms like Celcius.People lost all their savings because they wanted like 10-20% yield. To be fair, not literally all yield that can be farmed is necessarily ponzi-like. You can get 'real' yield by providing liquidity on AMM platforms, because fees that traders pay gets distributed to liquidity providers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "July 15, 2022, 09:20:29 PM",
      "body": "Quote from: mk4 on July 15, 2022, 08:08:17 AMYou can get 'real' yield by providing liquidity on AMM platforms, because fees that traders pay gets distributed to liquidity providers.They still could face a problem of impermanent loss when markets dump or get f**ked if the owners of the project they are providing liquidity for decide to pull the rug. Most of those projects usually have very attractive APYsGenerally, the risk is way higher than the reward.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jostorres",
      "created_time": "July 15, 2022, 09:59:53 PM",
      "body": "Quote from: Yikker on July 13, 2022, 06:46:22 PMGood afternoon, everyone, no matter how I tried to find entertainment for myself in this market, I can’t do anything, I even started trading with leverage, etc. I lost a lot of money in such a bear market and I want to calm down a little, I heard that there are options to earn big money on bets in different liquidity pools and staking, I want to know where you can find a platform that will show the best percentages for betting and liquidity. It is desirable that a verified site or platform, otherwise it was enough for me to get into a couple of scam pools and I no longer want to lose my money, if there are options with different percentages I will be glad to see and read thanksIf all you want is pure entertainment then why can't you just head straight on any gambling website? That way, it's okay if you lose because in return of that is you are entertained while if you continue what you are currently doing, all you can get there is stress because you always keeps on losing without getting any benefits.I am not into staking but I heard that staking is not good now, I guess that is because of the current bear that we are facing but if I were you I will just invest on a promising crypto. You can get them cheap nowadays. That is the only thing that I know, that can give you a better success rate in terms of earning a profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahanton",
      "created_time": "July 15, 2022, 10:46:28 PM",
      "body": "Quote from: logfiles on July 15, 2022, 09:20:29 PMQuote from: mk4 on July 15, 2022, 08:08:17 AMYou can get 'real' yield by providing liquidity on AMM platforms, because fees that traders pay gets distributed to liquidity providers.They still could face a problem of impermanent loss when markets dump or get f**ked if the owners of the project they are providing liquidity for decide to pull the rug. Most of those projects usually have very attractive APYsGenerally, the risk is way higher than the reward.If APY's is already on the side of too good to be true then always ask on yourself on how the hell they would really be considering on giving out that percentage considering that market conditions cant really be known?Even on legit projects or long time running doesnt really give out those kind of percentages but for the sake of competition and trying out to best out those current existing ones then they are really increasingthose numbers but we know that it would be still futile or useless for them to do so and to those who are considering staking then better think twice.It is really much more better if you do accumulate on your own with your own wallet and earn percentage gains or profits in a years time but of course its not guaranteed for it to happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "July 16, 2022, 04:12:15 AM",
      "body": "In my opinion the safest way to earn yield is as follows. Keep in mind this only works during bull markets.If you have fiat or tether you basically buy Bitcoin on a spot exchange and you use that Bitcoin as collateral to open up a 1x short of a futures Bitcoin contract.Last May or so (2021) we had something like 60% APY. The contract that is due in 30 days usually had a 3-5% premium. You would short it and cover when it matures and collect the premium. This is much safer than any other method out there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "July 17, 2022, 01:07:42 PM",
      "body": "Even if you find an ideal platform, the market is difficult to predict, and therefore rapid changes in price may make the best platforms in a weak financial position, and any unknown change in the price may lead to losses, so the best now is to try to determine the bottom and buy close to it and start with a long-term investment.Liquidity pools were easy in the past due to the presence of a lot of cash in the hands of citizens and the ease of making a quick profit because the price is in a continuous upward curve.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "teosanru",
      "created_time": "July 17, 2022, 01:19:49 PM",
      "body": "Quote from: Yikker on July 13, 2022, 06:46:22 PMGood afternoon, everyone, no matter how I tried to find entertainment for myself in this market, I can’t do anything, I even started trading with leverage, etc. I lost a lot of money in such a bear market and I want to calm down a little, I heard that there are options to earn big money on bets in different liquidity pools and staking, I want to know where you can find a platform that will show the best percentages for betting and liquidity. It is desirable that a verified site or platform, otherwise it was enough for me to get into a couple of scam pools and I no longer want to lose my money, if there are options with different percentages I will be glad to see and read thanksI think one should go for staking in only the top 20-25 coins. Even though the APY will be lesser, the investment would be safe, and not to mention the price volatility risk would also be lower. Even in top coins, I would suggest splitting up your money into various coins to create a portfolio sort of a thing so that there is one coin like LUNA which dumps like anything, not all your money is gone by this. But yes HODLing becomes even better if you stake your coins and get a good APY. There is nothing like that, only thing is to find the coin at the right price. Just don't be stuck with buying and staking the coins in bull run, instead average out your buys in various sets to ensure you get the optimum price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "July 17, 2022, 01:39:38 PM",
      "body": "Quote from: Yikker on July 13, 2022, 06:46:22 PMGood afternoon, everyone, no matter how I tried to find entertainment for myself in this market, I can’t do anything, I even started trading with leverage, etc. I lost a lot of money in such a bear market and I want to calm down a little, I heard that there are options to earn big money on bets in different liquidity pools and staking, I want to know where you can find a platform that will show the best percentages for betting and liquidity. It is desirable that a verified site or platform, otherwise it was enough for me to get into a couple of scam pools and I no longer want to lose my money, if there are options with different percentages I will be glad to see and read thanksIf you no longer want to lose money then it will be better for you to stay away from betting because you will surely lose money in it.Staking is a safer way to go but then again you have to be really smart on which coin you want to stake.The safest way would be to buy bitcoin or ether and then hold it for a long term.This might be time consuming but at least you won't lose money unless you sell your coins for a loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "July 17, 2022, 09:02:31 PM",
      "body": "Quote from: Mahanton on July 15, 2022, 10:46:28 PMIt is really much more better if you do accumulate on your own with your own wallet and earn percentage gains or profits in a years time but of course its not guaranteed for it to happen.But it's much safer than locking up one's assets in a third party platform all in the name of staking. Bitcoin can make gains of over 10% in a week or month if one buys it at the perfect time.For some reason, people, especially newbies, feel “safe” when they send their assets to a centralized and custodial exchange and have the assets staked for months or years without caring about consequences in case things don't go as planned.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}