{
  "id": "topic_5438007",
  "title": "alevlaslo",
  "author": "alevlaslo",
  "created_time": "February 04, 2023, 09:08:48 AM",
  "content": "А родителей променяли бы на детей которые еще даже не зачаты? А детей которые уже есть променяли бы на внуков которых пока нет? Это важнейшие вопросы о которых люди предпочитают не думать когда им поступает предложение добиться всеобщего отказа от зачатий ради бессмертия и омоложения.Святой дух запретил познание не только добра и зла, но и родов и смерти, для чего наделил женщину девственной плевой и родовым муками в целях напоминания о запрете.Идея построения рая ушла при уходе СССР, зато сейчас появилась идея покруче: восстановление бессмертия и омоложения! Поздравляю, мои дорогие, у вас вновь появился смысл жизни!Рай невозможно построить, его можно только восстановить тем же путем по которому мы от него ушли, развернувшись в обратную сторону.\"Любое стремление к совершенству есть лишь удаление от изначального совершенства\" Ошо.Природа всегда отражает волю большинства, учёные заметили что ядро Земли почти остановило свое вращение и готово вот вот развернуться в обратную сторону.Да здравствует жизнь! Вечная и молодая! Не где-то там и когда-то, а здесь и сейчас!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5438007",
  "comments": [
    {
      "author": "Excimer",
      "created_time": "February 04, 2023, 12:59:28 PM",
      "body": "Модераторы, отправляйте топик в \"Разное\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "February 06, 2023, 09:31:55 AM",
      "body": "Нужно сначала определиться с терминологией \"что такое рай\" - про это место все пишут, но никто никогда не видел. Нет никаких доказательств научных. А я верю только  в научные подтверждения. Типа почему люди летали на луну? А потому что ученые у телескопов в разных странах мира и разных исповеданий религитозных использовали научные методы подтверждения данного факта. Каким образом? А они фиксировали сигналы телепередач точно с луны, а не с голливудских киностудий. Таким образом был доказан факт посещения людьми луны. Еще почти 55 лет назад.А что с раем? Да нет никаких доказательств его существования. И научных обоснований тоже нет. Примите и смиритесь. Сдохнут все - никто в рай не попадет. Увы, это так.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "February 20, 2023, 01:57:55 PM",
      "body": "Есть самый простой совет - не курить и не бухать. Я бухать начал (сначала потихоньку) примерно в 42 года. А до этого был профессиональным трезвенником. А курить до сих пор не курю, разве что может быть кальян в отпуске 1-2 раза в год. Проблема людей в том, что они начинают бухать и курить в самое развивающееся время своего  организма. ТО есть в молодости. Когда надо развиваться, совершенствоваться, учиться и зарабатывать. А люди вместо этого бухают. А потом плачут, почему у них все плохо. Нужно уметь радоваться жизни, пока ты молодой. А уж под старость можно и удариться в во все тажкие - курево, водка и бабы!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}