{
  "id": "topic_5426840",
  "title": "Pierre 2",
  "author": "Pierre 2",
  "created_time": "December 08, 2022, 10:17:05 AM",
  "content": "Cumhurbaşkanı Recep Tayyip Erdoğan, Türkiye 2023 Zirvesi'ne yolladığı video mesajda \"Türkiye olarak son 20 yılda hayata geçirdiğimiz sağlam alt yapıyla birlikte üretimi, istihdamı, ihracatı ve cari fazla yoluyla büyümeyi esas alan ekonomi modelimiz sayesinde hamdolsun bu sıkıntılı dönemi nispeten rahat geçiren ülkelerden biriyiz. Enflasyonun boynunu kıracağız\" dedi.\"...faizleri artırarak enflasyonu düşürme üzerine kurulu klasik yöntem şimdiye kadar beklentileri karşılamadığını görüyoruz. Bu tarz politikalarla enflasyon de dizginlemeye çalışan pek çok ekonomi bugün hayat pahalılığı yanında istihdam kayıplarıyla mücadele ediyor. Türkiye olarak son 20 yılda hayata geçirdiğimiz sağlam alt yapıyla birlikte üretimi, istihdamı, ihracatı ve cari fazla yoluyla büyümeyi esas alan ekonomi modelimiz sayesinde hamdolsun bu sıkıntılı dönemi nispeten rahat geçiren ülkelerden biriyiz. İhracatımız her ay rekor kırarak 300 milyar dolar eşiğine yaklaşıyor. Organize sanayi bölgelerimiz fabrikalarımız imalat tesislerimiz harıl harıl çalışıyor.\"Kaynak: https://www.bloomberght.com/erdogan-enflasyonun-boynunu-kiracagiz-2320723Erdoğan haklı çıkacak mı ne diyorsunuz?Enflasyon mu büyük Türkiye mi?Bence bir ara aramızda futbol maçı düzenleyip enflasyon ile mücadeleyi farklı bir boyuta taşımamız gerekiyor.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5426840",
  "comments": [
    {
      "author": "mandown",
      "created_time": "December 08, 2022, 11:18:12 AM",
      "body": "100 liranız var enflasyon %80 faizler %9 bankada ise mevduat faizi %22lere yaklaşıyor. Enflasyonu bu mantıkla kırabilmenin imkanı varmı? %80'i %40'a düşürdüğünüzde 100 lira 140 lira olmuyor birkere o ürün %80lik enflasyonu yemiş oldu 250 liraya çıkıyor bunu millet algılayamadığı için bu laflara inanıyor. İsterse enflasyon seneye %20 ye düşsün zamların önü kesilemez. Keşke tek sorun enflasyon olsaydı bu anlattığım örnekte hangi yabancı size gelip yatırım yapar. Birde ihracat yapan birisi olsanız mevduatınızın çoğunluğu tl de tutulması gerekiyor. Yani şuan sistematik olarak herkez zarar ediyor. Siyasi ve yasal hiçbir güvence olmayan yerde istersen enflasyonu yarın %0 'a çektim de düşecekmi sanıyorsnuz. Yemez.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "December 08, 2022, 05:35:21 PM",
      "body": "Hiçbir şeyi daha iyi bir hale getirme imkanları yok, sadece yalandan laf peşinde koşuyorlar. Sene sonu geldiği için enflasyonu düşüreceklerini hepimiz biliyoruz, maaşlara olabildiğince az zam getirmek zorundalar. Diğer yandan da seçim yaklaşıyor ve her türlü oyunu döndürüp ekonomiyi çok iyiymiş gibi göstermek zorundalar.İhracatın her ay rekor kırdığını biz göremiyoruz, kendi çevrelerindeki büyük şirketler pastanın payını bölüşüyorken standart vatandaş ay sonunu nasıl görürümün derdine giriyor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "halloweenn666",
      "created_time": "December 08, 2022, 08:53:32 PM",
      "body": "Enflasyon düşüyor. Fed dahil tüm merkez bankaları da bu yolda güzel ilerliyor.Mesele enflasyonsa düşer, herkesi aç sefil yıkık şekilde bırakın tüketim dip yapsın insanlar bir gıdım ekmeğe muhtaç halde olsun tüketim düşsün böylece enflasyon düşsün. Senelerce enflasyon olmuyordu şimdi enflasyon oldu. Olduysa oldu insanlarda bu ortama ayak uydursun o halde.Ama mesele bence bu değil. İşsizlik düşüyor mu insanlarin refahı mutluluğu artıyor mu insanlar rahat bir yaşam sürebiliyor mu  ? Tüm mesele bu. Bunu başarabilen ülkeler zaten ilerliyor gelişiyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "onurgozupek",
      "created_time": "December 09, 2022, 05:22:49 AM",
      "body": "Enflasyonun %85'ten %60'a düşmesi matematiksel olarak düşüş kabul edilebilir ancak tüm dünyada enflasyon ortalaması %10-11 seviyelerindeyken bizdeki enflasyonu başarı olarak göstermek daha büyük bir başarıdır bence...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "W Jr.",
      "created_time": "December 09, 2022, 04:07:46 PM",
      "body": "Quote from: halloweenn666 on December 08, 2022, 08:53:32 PMEnflasyon düşüyor. Fed dahil tüm merkez bankaları da bu yolda güzel ilerliyor.Mesele enflasyonsa düşer, herkesi aç sefil yıkık şekilde bırakın tüketim dip yapsın insanlar bir gıdım ekmeğe muhtaç halde olsun tüketim düşsün böylece enflasyon düşsün. Senelerce enflasyon olmuyordu şimdi enflasyon oldu. Olduysa oldu insanlarda bu ortama ayak uydursun o halde.Ama mesele bence bu değil. İşsizlik düşüyor mu insanlarin refahı mutluluğu artıyor mu insanlar rahat bir yaşam sürebiliyor mu  ? Tüm mesele bu. Bunu başarabilen ülkeler zaten ilerliyor gelişiyor.Olduysa oldu demek kolay bir şey.Olduysa düzeltilecek bu enflasyon düzeltilmeli.Olduysa oldu gibi düşünce ile hareket edilemez.Enflasyon tüm dünyada var ama dünyadaki enflasyon yüzde 3 seviyelerinden 13-15’e yükseldi.Türkiye’de ise enflasyon çok düşük seviyelerden zirveyi gördü.Bizim bir aylık enflasyonumuz bir ülkenin senelik enflasyonu olduğu dönemlerden geçtik.Ne yapıp edilmeli bu sorun çözülmeli.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "December 10, 2022, 03:26:31 PM",
      "body": "kırılan bir boyun varsa maalesef o da benim boynum:))valla ben sıradan bir vatandaşım. aldığım bir ürünü bir ay sonra aynı para alamıyorsam boynu kırılan enflasyon değildir. bir de  bunları ilk günden söyleyip öyle aksiyon almak gerekiyordu ama ne hikmetse bizim ülkemizde hiçbir şey kabul edilmiyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "December 10, 2022, 08:26:39 PM",
      "body": "Enflasyonu canavara benzetmek ve sanki ona önlem almak hükümetlerin görevi değilmiş gibi davranmak son yıllarda iyice moda oldu. Nedir kardeşim bu enflasyon insan mı yaratık mı boynu mu var da kırıyorsun? Sen ekonomi konusunda yapman gereken hiçbir şeyi yapmayıp yapmaman gereken ne varsa onu yaparsan enflasyon da böyle uçar gider. Sonra onu yavaşlatmak için ülke kaynaklarını harcamaya başlarsın bu da etki etmeyince kötü politikalarının sonucu olarak ülkeyi iflasa sürüklersin. Çok büyük enkaz bırakıyorlar çok. Yıllarca düzelemeyecek bu ekonomi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "December 10, 2022, 08:29:38 PM",
      "body": "İnşallah Erdoğan haklıdır da biz yanılıyoruzdur değilse sıkıntı çok büyük olacak net.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "December 11, 2022, 12:15:25 PM",
      "body": "Hala kesin oy verecek %30, %40 ve hatta %50'lik bir grup varken hissedilen enflasyonun %150'den %100'e ya da %70'e düşmesi de başarı olarak anlatılabilir, helal olsun. İnsanlara göre suçlular kılışdar, imamov, bim a101. Valla az bile oy alıyorlar. Hadi diyelim ihracat artmış olsun ve ülke zenginleşiyor olsun. Asgari ücretli ya da beyaz yakalı bunu ne kadar hissetti? Malezyalıdan pakilere, brezilyalılardan balkanlılara herkesin dalga malzemesi olduk. Ailesinden ya da çok önceden parası malı olmayan, sadece maaşla çalışan insanlardan fakirleşmeyen var mı? Şu anda yeni mezun birinin hayat kalitesi nerelerde? Hala 20 yıllık ekonomi modeli deniyor.. Bu forumda 2021 ekim kasımdaki kur yükselişinden önceki yazılanları da hatırlıyorum. Durumu kötüleşmeyen, etkilenmeyen, hadi kişisel olarak etkilenmemişse de ülkeye üzülmeyen insan var mı?(malum aktrol ve yan hesapları dışında) Hala boynunu kıracağız diyorlar ya inanılmaz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "December 11, 2022, 02:00:59 PM",
      "body": "Boynu kırılan varsa enflasyon değil toplumun halkın ta kendisidir. Hala yalakalık yapmaya çalışanlarsa kendilerini kandırdıkları gibi başkalarını da kandırmaya sadece kafa açmaya devam ediyorlar. Bu ekonomi artık öyle bir yere geldi ki yerin dibine girdi hangi siyasi parti gelirse gelsin kendini toplaması yıllar sürecek. Çocuklarımızın çocukları anca refah seviyesine ulaşılabilecekler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jakdanyel",
      "created_time": "December 12, 2022, 04:32:44 PM",
      "body": "Cumhurbaşkanı ilk olarak söylediği yatırım konusunda haklı. Son 20 yılda ülkede büyük değişiklikler ve yenilikler oldu. Yapılan yeni hastaneler, otoyollar, köprüler, ulaşımdaki yenilikleri kimse görmezden gelemez. Ancak bunların ülkenin kalkınmasında ve hazine gelirinde daha fazla etkisi olması gerekirdi. Enflasyon karşısında kazanmak zor bir şey değil. Biraz daha üretmeye yönelik hamleler yapılarak rahat bir şekilde bunun üstesinden gelinebilir. Özellikle gıda sektöründe başka ülkelere bağlı olmazsak, en büyük adımı atmış oluruz. Sadece şu anki hükümet için değil, ülkeyi kim yönetirse yönetsin enflasyonun azalmasında katkıda bulunacak hamleler yapmasını bekliyoruz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "December 13, 2022, 07:01:01 PM",
      "body": "Quote from: SUPERSAIAN on December 11, 2022, 02:00:59 PMBoynu kırılan varsa enflasyon değil toplumun halkın ta kendisidir. Hala yalakalık yapmaya çalışanlarsa kendilerini kandırdıkları gibi başkalarını da kandırmaya sadece kafa açmaya devam ediyorlar. Bu ekonomi artık öyle bir yere geldi ki yerin dibine girdi hangi siyasi parti gelirse gelsin kendini toplaması yıllar sürecek. Çocuklarımızın çocukları anca refah seviyesine ulaşılabilecekler.Ben torunlarımızın feraha ereceğini düşünmüyorum, belki torunlarımızın torunları görebilir, onda da ülke olarak ayakta kalabilirsek ve iyi bir yönetim ile birlikte bu ihtimal daha gerçekçi geliyor, eğer yönetimi o zaman da sıkıntılı süreçler ile savaştırırlarsa onlar da bunu göremez, dünyanın ucuz iş gücü olmaya devam ederiz,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "December 21, 2022, 09:19:10 PM",
      "body": "Şu ana kadar sürdürdükleri ekonomi politikası ile kıracakları tek boyun enflasyon karşısında yarı aç yarı tok yaşamaya çalışan halkımızın boynu. Hangi sağlam altyapı, hangi üretim, nerede istihdam var acaba? Farklı bir ülke de mi yaşıyorum acaba ben. Enflasyonu sadece TÜİK oranları ile oynayarak düşürebilirler gibi geliyor bana.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "January 24, 2023, 07:58:08 AM",
      "body": "Enflasyonun belini kırdı bizim burada ekmek'de gramaj düşürüldü yani gizli zam yapıldı. Fırında kalabalıktı ve tepki gösteriyorlardı ben o esnada insanlar hak edildiği gibi yönetilir dedim howww huuww gibi salak salak tepki sesleri çıktı enflasyonun beli kırılmazmı offff ne kırıldı. Fiyat algımız kalmadığı için enflasyon varmı yokmu belli değil o derece kırıldı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "January 24, 2023, 03:33:02 PM",
      "body": "Yapılan açıklamalar akla zarar yapılan işlemler bilime aykırı bu veriler ışında enflasyonun değil vatandaşın beli kırılır. Sürekli para basılıyor Türk Lirası sürekli değersiz hale getirilmek için uğraşılıyor dahası bir çok üründe fiyatları sabitledik dedikleri halde temel gıda zamlanıyor. Enflasyonun belini kırmak onlar için çok kolay mesela bu ay %90 - (eksi) enflasyon açıklayacaklar ve enflasyonun belini kırmış olacaklar yersen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "January 25, 2023, 05:28:40 AM",
      "body": "Quote from: ZekiBeyy on January 24, 2023, 03:33:02 PMYapılan açıklamalar akla zarar yapılan işlemler bilime aykırı bu veriler ışında enflasyonun değil vatandaşın beli kırılır. Sürekli para basılıyor Türk Lirası sürekli değersiz hale getirilmek için uğraşılıyor dahası bir çok üründe fiyatları sabitledik dedikleri halde temel gıda zamlanıyor. Enflasyonun belini kırmak onlar için çok kolay mesela bu ay %90 - (eksi) enflasyon açıklayacaklar ve enflasyonun belini kırmış olacaklar yersen.Bakalım şubat ayının ilk haftası açıklanacak enflasyon verileri ne diyecek, bende açıklanacak enflasyon oranını merakla bekliyor olacağım, fiyatların sabitlenmesi ise tamamen algı operasyonu, yine değişiklikler yapılıyor, geçen gün a101’e gittiğimde görevli etiket değişikliği yaptıklarını söylemişti, devam ediyor yani değişiklikler hepsi birer oyundan ibaret,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "February 24, 2023, 02:25:15 PM",
      "body": "Quote from: kriminall on January 25, 2023, 05:28:40 AMQuote from: ZekiBeyy on January 24, 2023, 03:33:02 PMYapılan açıklamalar akla zarar yapılan işlemler bilime aykırı bu veriler ışında enflasyonun değil vatandaşın beli kırılır. Sürekli para basılıyor Türk Lirası sürekli değersiz hale getirilmek için uğraşılıyor dahası bir çok üründe fiyatları sabitledik dedikleri halde temel gıda zamlanıyor. Enflasyonun belini kırmak onlar için çok kolay mesela bu ay %90 - (eksi) enflasyon açıklayacaklar ve enflasyonun belini kırmış olacaklar yersen.Bakalım şubat ayının ilk haftası açıklanacak enflasyon verileri ne diyecek, bende açıklanacak enflasyon oranını merakla bekliyor olacağım, fiyatların sabitlenmesi ise tamamen algı operasyonu, yine değişiklikler yapılıyor, geçen gün a101’e gittiğimde görevli etiket değişikliği yaptıklarını söylemişti, devam ediyor yani değişiklikler hepsi birer oyundan ibaret, Boynunu kırdıkları enflasyonu Ocak ayında küçülte küçülte yüzde 6,65 olarak açıklayabildiler. Boynu kırılan enflasyon değil ama enflasyon karşısında ki halk oldu. Sürekli fiyatlara zam geliyor, yetmiyor ürünlerin gramajı düşürülüyor o da yetmiyor kalitesi düşürülüyor. Halk pahalı, gramajı az ve kalitesiz ürünler tüketmek zorunda kalıyor. Enflasyonun boynu kırılmıyor daha çok palazlanıyor gibi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "February 24, 2023, 04:29:14 PM",
      "body": "Quote from: Gencecikmen on February 24, 2023, 02:25:15 PMQuote from: kriminall on January 25, 2023, 05:28:40 AMQuote from: ZekiBeyy on January 24, 2023, 03:33:02 PMYapılan açıklamalar akla zarar yapılan işlemler bilime aykırı bu veriler ışında enflasyonun değil vatandaşın beli kırılır. Sürekli para basılıyor Türk Lirası sürekli değersiz hale getirilmek için uğraşılıyor dahası bir çok üründe fiyatları sabitledik dedikleri halde temel gıda zamlanıyor. Enflasyonun belini kırmak onlar için çok kolay mesela bu ay %90 - (eksi) enflasyon açıklayacaklar ve enflasyonun belini kırmış olacaklar yersen.Bakalım şubat ayının ilk haftası açıklanacak enflasyon verileri ne diyecek, bende açıklanacak enflasyon oranını merakla bekliyor olacağım, fiyatların sabitlenmesi ise tamamen algı operasyonu, yine değişiklikler yapılıyor, geçen gün a101’e gittiğimde görevli etiket değişikliği yaptıklarını söylemişti, devam ediyor yani değişiklikler hepsi birer oyundan ibaret, Boynunu kırdıkları enflasyonu Ocak ayında küçülte küçülte yüzde 6,65 olarak açıklayabildiler. Boynu kırılan enflasyon değil ama enflasyon karşısında ki halk oldu. Sürekli fiyatlara zam geliyor, yetmiyor ürünlerin gramajı düşürülüyor o da yetmiyor kalitesi düşürülüyor. Halk pahalı, gramajı az ve kalitesiz ürünler tüketmek zorunda kalıyor. Enflasyonun boynu kırılmıyor daha çok palazlanıyor gibi.Sırada mart ayı var hocam mart ayında Şubat enflasyonu açıklanacak bir de şöyle düşününce memur zammı için minimum artışlar ve zamlar yapabilmek için en küçük şekilde en az şekilde aradaki farkı gösteriyorlar. Hayat çok pahalı ama gerçeklere yakın olmayan enflasyon oranı ile alım gücü daha düşük oluyor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}