{
  "id": "topic_5449905",
  "title": "Bitcoin_people",
  "author": "Bitcoin_people",
  "created_time": "April 23, 2023, 04:37:53 PM",
  "content": "All of us on the forum need money at one point or another. There are times when money is needed for a special task, but one does not have cash. Then it is not possible to meet that need by trying different ways, but if someone keeps investing in crypto, then it is possible to meet that need by selling some amount from that investment money at the time of special need. Especially since I needed a lot of money a few days ago but there was no money anywhere except crypto funds. Then I bought some bitcoins to meet my needs and I remembered that and I thought that now I have to sell bitcoins to solve my money problem.I needed money so much that I ended up having to sell some bitcoins from my bitcoin investment. Due to the financial crisis, I had to sell Bitcoin without any other option, but I am grateful to Bitcoin. If I didn't have Bitcoin invested today, I might not be able to solve my money problem. If ever we face a financial problem, Bitcoin comes to the side to solve that necessary problem. And I think this is a special kind of support of Bitcoin for crypto investors. So much love for Bitcoin.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449905",
  "comments": [
    {
      "author": "Aikidoka",
      "created_time": "April 23, 2023, 04:49:08 PM",
      "body": "I agree with you, Bitcoin could be a valuable asset to have as a backup option when facing a financial crisis, after you run out from your FIAT money. Obviously many people in this community love Bitcoin, and I'm sure many have profited from it and use it on a daily basis, especially during urgent financial situations.By investing money in Bitcoin, you may not need to cash out for a few months or even longer, and the good thing is that you have the potential to earn a huge profit on your investment if Bitcoin's price increases substantially. I remember investing around 1k in Bitcoin years ago when I was supposed to buy a mid-range PC. Instead, I decided to invest the money and purchase a better PC a few years later using the investment profit. After around 1.5 years, I was able to buy a high-end PC with the profit I earned from that investment, and I'm really happy with my purchase since I couldn't afford it with just the initial 1k$ I had.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "April 23, 2023, 07:50:41 PM",
      "body": "There are some emergencies or special cases that can emerge just as you said, and if you don't have fiat to solve the issues, you can end up selling your Bitcoin. In some cases, it wouldn't matter if you were selling at a loss or profit because you have a very demanding need to solve the issues. But I think while you are investing in Bitcoin, you should also keep some fiat so that in emergencies, you can use it instead of selling your Bitcoin, because if emergencies strikes during the Bitcoin bear market, you would not have any options other than to sell and just take the money.Example: My friend earns $500 every month, invests $150 in Bitcoin every month, and saves $100 in fiat, so he spends $250 every month. In some months, if he has too much need, he can skip his Bitcoin investment just to make sure he settles all his needs and doesn't sell. This guy is good at financial management, and I admire him a lot  . No matter how many emergencies strike him, he always has savings in fiat to utilize.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "April 23, 2023, 08:19:49 PM",
      "body": "Quote from: Bitcoin_people on April 23, 2023, 04:37:53 PMbut if someone keeps investing in crypto, then it is possible to meet that need by selling some amount from that investment money at the time of special need. Especially since I needed a lot of money a few days ago but there was no money anywhere except crypto funds. You should try as much as possible to not need to sell your investment to meet your needs. Investing meaus taking money you do not necessarily need at the time and keeping that in as asset which you expect to appreciate in value over time. If you sell intermittently before the projected timeframe you do not get the projected ROI.Emergencies do come up and our first savings might not be enough to cover that, but do not invest in any asset as a support for rainy days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "April 23, 2023, 08:41:58 PM",
      "body": "I'm totally amazed after reading your post, and I would say that yes Bitcoin is a great invention and it solves all these kind of issues. Anyone who invests his/her money into it will be able to utilize that money when needed. The money that you invest in Bitcoin is secured, and nobody can stop you from accessing it  when you need it. No restrictions or taxes to pay when you invest your money into Bitcoin or to reconvert it into fiat.That's the power of a decentralized p2p finance system, no third party or central body can interfere with your money and the transactions that you make, only you can use that money by converting it digitally into cash or purchase goods with it. That's truly freedom of using your money without any interference from anyone. Nowadays, Bitcoin is accepted by many vendors and in future its adoption will likely increase. I also invest my money in Bitcoin most of the time, and sometimes when I need that money urgently I just p2p trade it. It's very simple these days, and centralized exchanges like Binance has made things even easier for novice people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "April 23, 2023, 09:14:54 PM",
      "body": "Honestly, I don't see how Bitcoin help you.  It is the money that you saved in form of Bitcoin. I believe the same event will happen if you saved your money even if you don't convert it in BTC.  You will have something to pull since you have your savings. I believe this is just sugarcoating to make believe that Bitcoin saves you which in fact your previous action of saving money(regardless if it is in Bitcoin or fiat currency) saves you from your current situation.Anyway, it would be more convincing if you happen to tell us that due to your Bitcoin investment, your capital grow due to the current uptrend of the market and that it saves you from spending your money since you used the profit from these investments to meet your daily needs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "April 23, 2023, 09:18:45 PM",
      "body": "That's okay. Remember why bitcoin was made and created? Because of the financial crisis and that's also a problem.We can see the parity of it why you have to sell it and that's to solve your problem. Then, it's totally fine to sell whenever you want to and that's what it is intended for.For transfers mainly and then as an asset, to be sold for you to make profits with it. This is for everyone, we tend to say that we should HODL but at the same time, don't feel regret or guilty when you're wanting to sell for your important stuff.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "April 23, 2023, 11:17:02 PM",
      "body": "That's part of being a investor, just not in Bitcoin, in any other traditional market as well. We have to sell because there is an emergencies, that we needed some money to cover. And that is why we save Bitcoin, to have that something that we can withdraw in times of crisis.But the thing is that after the emergency, you should try to get it back. What I mean is to re-invest all over again, repeat the cycle and even try to save more than you have withdraw so that you can have or you will have future income. Continue to grow your wealth, that is why Bitcoin become one of the best asset in this generation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "April 23, 2023, 11:23:09 PM",
      "body": "That's okay, try to solve the current problem and then bounce back again. Invest what you can think that can make profit, since the market now is pretty active or i say always active. You can make profit even in the down trend as well as when it increase.Try to diverse your money for savings, emergency and investment if incase anything happens, you wont touch your investment unless its really necessary.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "April 23, 2023, 11:59:52 PM",
      "body": "I spent over 7 bitcoins to fill my needs since 2014, and if you are to convert to today's price, it's far off from the actual figure I've got during those times. I regret it at some point, but I have to do it because I need to survive. Since then I entered jobs and bettered myself, and eventually landed to a position wherein I no longer need to sell my coins and instead, buy more when I feel the need to, or just to safekeep for the future.It's nice that you know your priorities. Better sell your coins than go hungdy, because opportunities will always come knocking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "April 24, 2023, 02:27:47 AM",
      "body": "1st, you don't need to bold and font size your thread because we are here able to read in what your points.So, after this case, what did you learn and what did you get? Yes, management. you must have management money on the future to solve this case if happen again. I ever like your condition in past, I sold my bitcoin investment before ATH, then I regret, and cry when look at price be triple after I sold it. Like you today, I don't know why you don't have cash?, because investing the meaning is not for sale now which I think you was made the wrong way to sold your investment because don't have management cash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "P2PECS",
      "created_time": "April 24, 2023, 04:21:29 AM",
      "body": "Quote from: Bitcoin_people on April 23, 2023, 04:37:53 PMAll of us on the forum need money at one point or another. There are times when money is needed for a special task, but one does not have cash. Then it is not possible to meet that need by trying different ways, but if someone keeps investing in crypto, then it is possible to meet that need by selling some amount from that investment money at the time of special need. Especially since I needed a lot of money a few days ago but there was no money anywhere except crypto funds. Then I bought some bitcoins to meet my needs and I remembered that and I thought that now I have to sell bitcoins to solve my money problem.I needed money so much that I ended up having to sell some bitcoins from my bitcoin investment. Due to the financial crisis, I had to sell Bitcoin without any other option, but I am grateful to Bitcoin. If I didn't have Bitcoin invested today, I might not be able to solve my money problem. If ever we face a financial problem, Bitcoin comes to the side to solve that necessary problem. And I think this is a special kind of support of Bitcoin for crypto investors. So much love for Bitcoin.Well, I am not going to congratulate you as many who have responded have done. In other words, you have no money, you need money and you have to sell the little BTC you have. Well, in this case you are grateful to bitcoin as you could be grateful to anything you could have used to get the money, such as a stamp collection. If selling that stamp collection would have given you the money you needed, you would now be grateful to the stamp collection. Quote from: lionheart78 on April 23, 2023, 09:14:54 PMHonestly, I don't see how Bitcoin help you.  Me neitherQuote from: lionheart78 on April 23, 2023, 09:14:54 PMIt is the money that you saved in form of Bitcoin. I believe the same event will happen if you saved your money even if you don't convert it in BTC.  Exactly. In money, stamps, gold or whatever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "April 24, 2023, 04:29:56 AM",
      "body": "Quote from: PX-Z on April 23, 2023, 11:23:09 PMThat's okay, try to solve the current problem and then bounce back again. Invest what you can think that can make profit, since the market now is pretty active or i say always active. You can make profit even in the down trend as well as when it increase.Try to diverse your money for savings, emergency and investment if incase anything happens, you wont touch your investment unless its really necessary.Yes many people forget the golden rule of investment. You should invest only 30% of your earnings, spend 40% in daily needs and save 40% for emergency funds. If you don’t have emergency funds during emergencies, then you have to discontinue your investment with losses and take out the funds. It’s really sad to hear OP’s story, but that was bound to happen if you don’t have any proper investment plans or emergency funds. Nevertheless OP from your story many of us will learn the importance of savings. You have to also start your second investment innings and join the Bitcoin community again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Litzki1990",
      "created_time": "April 24, 2023, 05:01:02 AM",
      "body": "Investments are our dangerous companions. When you have an investment in Bitcoin you will have a different confidence on the way. This investment will give you courage before doing different things. Because you will get support from this investment if you don't get support from anywhere during times of danger. This is that at the moment of your peril your pocket is empty and you have got no help from anywhere to escape the peril but at last you have saved yourself from your peril by selling your investments. This is a big issue.  So we all should keep some money invested for our daily expenses which should be used only in times of our emergency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "April 25, 2023, 02:51:35 AM",
      "body": "Welcome to Announce your story with Bitcoin, first purchase, sale, business, education ... to make the list of announcements longer and longer with more people announce their completed buying/ selling bitcoin deals, educational initiatives, business initiatives ...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}