{
  "id": "topic_5427179",
  "title": "bitcoindata21",
  "author": "bitcoindata21",
  "created_time": "December 08, 2022, 08:56:15 PM",
  "content": "I've seen a lot of comments about finding signal groups and the like. Well i have something that actually works but isn't a pump and dump get rich quick scheme by some influencer. I'm using these for swing trading to accumulate more bitcoin for myself, but it should work for alts, crypto stocks, even possibly the stock market if the correlation continues to be strong.I created these using onchain data from March 2021 to November 2022. There are 3 models i used together. The first uses eth data, the second btc data, and the third is a momentum/strength model using both eth and btc. For whatever reason eth data is more accurate for trading btc than btc data. Here they are:I know there is alot of distrust in onchain data since 2021 because of poor onchain analysis or incorrect interpretation of analysis. But if you look at the above there is clearly something to work with here. So i backtested some strategies aswell to see what could be gained. For all 3 models i took a strategy of selling/buying 25% or 50% of the portfolio the day after a sell/buy signal (the signal for the 3rd model is when the green or red bars hit the dotted lines - may be hard to see here, essentially means 4 out of a possible 7 metrics are saying to buy/sell). Here are the results valued in both btc (for the purists) and in fiat $ dollar:As you can see the first shows the growth of starting with 1 btc in March 2021 till November 2022. The worst performing strategy still returned 2.8 btc, with the average across all strategies at 4.83 btc.In dollar terms, $1 returned anywhere between $1.06 (+6%) and $2.84 (+184%), with an average of $1.84 (+84%)Compare this to buying and holding assets over this timeframe : S&P500 +7% / GOLD +2% / NASDAQ -7% / BTC -62%I plan on using this going forward, and i believe it has given enough signals in both directions to work well in the future. If anyone is interested they can check out my website that i set up (it is subscription based)https://www.bitcoindata21.com/I will use this alongside other onchain metrics, orderbook analysis, macro, and sometimes technical analysis to derive even better results. This isn't built for day trading though ofcourse. If anyone has any comments, queries, or feedback, i'd be glad to answer.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5427179",
  "comments": [
    {
      "author": "bitcoindata21",
      "created_time": "December 20, 2022, 06:21:57 PM",
      "body": "I've created a youtube channel where i will post updates regarding the model and also for short term trading updates using orderbook analysisHere's a video intro into the models i have created. This is all new for me so apologies if i sound amateur.https://www.youtube.com/watch?v=5b4inEJH5NcI will try to post chart updates here when i get the chance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mega1",
      "created_time": "December 20, 2022, 06:48:22 PM",
      "body": "Trading and selling can be done very easily through Binance Global Apps, a management of the currency.Trading with Binance Global Apps is very easy and profitable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "December 20, 2022, 07:09:50 PM",
      "body": "So there's no way to use the tool without signing up on the site? So, this means it's good for DCA strat, right? I found it interesting and like to know more, will watch the video you just shared in here and see what I can learn from that. Thanks for this!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitcoindata21",
      "created_time": "December 20, 2022, 09:01:10 PM",
      "body": "I will post for free on youtube for the next 6-12 months probably (maybe twice a week i will show the updated charts), so people can see how it works in real time and trust it. It can be helpful for DCA to tell you when the market is over/under heated and there is a high chance of reversal (either bullish or bearish). Combining with other analysis (technical analysis or orderbooks) can give confluence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "December 20, 2022, 10:24:55 PM",
      "body": "Quote from: Mega1 on December 20, 2022, 06:48:22 PMTrading and selling can be done very easily through Binance Global Apps, a management of the currency.Trading with Binance Global Apps is very easy and profitable. Two things are involved in the aspect of locating the preferable place of having invest over trading, so from my understanding, trading is something someone as we have the know through internet tutorial lesson, so it's not only binance to learn impossible functions of trading, i think that particular clause is a misconception of an idea.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "December 21, 2022, 12:17:31 AM",
      "body": "Quote from: bitcoindata21 on December 08, 2022, 08:56:15 PMI've seen a lot of comments about finding signal groups and the like. Well i have something that actually works but isn't a pump and dump get rich quick scheme by some influencer. I'm using these for swing trading to accumulate more bitcoin for myself, but it should work for alts, crypto stocks, even possibly the stock market if the correlation continues to be strong.Likely it might work for alts, but we should not forget that many alts are shit coins and can change the possibility of making profit while trading. While talking about alts, the alt should be well studied before it is used for trading. There are some good alts for trading too, alts like ether, litecoin, qtum, neo, dgb and many others with a good marketcap and following the bull trends with bitcoin, unlike some altcoins that are just shit coins.Quote from: Mega1 on December 20, 2022, 06:48:22 PMTrading and selling can be done very easily through Binance Global Apps, a management of the currency.Trading with Binance Global Apps is very easy and profitable. Trading with Binance app can be very easy for you, but to make money with trading is not about Binance app, it is about how good and experienced you are in trading. Trading is not profitable like you said it, it can even take money just like gambling, leding to losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lixer",
      "created_time": "December 21, 2022, 12:11:21 PM",
      "body": "Quote from: Oshosondy on December 21, 2022, 12:17:31 AMQuote from: bitcoindata21 on December 08, 2022, 08:56:15 PMI've seen a lot of comments about finding signal groups and the like. Well i have something that actually works but isn't a pump and dump get rich quick scheme by some influencer. I'm using these for swing trading to accumulate more bitcoin for myself, but it should work for alts, crypto stocks, even possibly the stock market if the correlation continues to be strong.Likely it might work for alts, but we should not forget that many alts are shit coins and can change the possibility of making profit while trading. While talking about alts, the alt should be well studied before it is used for trading. There are some good alts for trading too, alts like ether, litecoin, qtum, neo, dgb and many others with a good marketcap and following the bull trends with bitcoin, unlike some altcoins that are just shit coins.A signal group can work too as long as they are legit and not a scam. They are helpful for someone who still lacks of experience or knowledge on how to trade a crypto. There are so many cryptos that can be used for trading not just btc. There's also alts, tokens and shitcoins.I know shitcoins are mostly risky if we are about to hodl them for a long time but I think they can still work fine in trading purposes. Binance is a good platform for trading but I think binance has some country restrictions. There are also features whom may not be available for them but are available on other trading exchanges. We need to choose what suits us the most.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "December 21, 2022, 12:18:58 PM",
      "body": "Quote from: Oshosondy on December 21, 2022, 12:17:31 AMQuote from: bitcoindata21 on December 08, 2022, 08:56:15 PMI've seen a lot of comments about finding signal groups and the like. Well i have something that actually works but isn't a pump and dump get rich quick scheme by some influencer. I'm using these for swing trading to accumulate more bitcoin for myself, but it should work for alts, crypto stocks, even possibly the stock market if the correlation continues to be strong.Likely it might work for alts, but we should not forget that many alts are shit coins and can change the possibility of making profit while trading. While talking about alts, the alt should be well studied before it is used for trading. There are some good alts for trading too, alts like ether, litecoin, qtum, neo, dgb and many others with a good marketcap and following the bull trends with bitcoin, unlike some altcoins that are just shit coins.I believe Altcoins with low trading volume and liquidity are the one you are describing on shitcoins which is true that this trading will not work since there’s no enough data for this indicator to use for creating a strategy.I believe even on huge caps is still risky considering the FUD can happened on the specific project with just one allegation in the team like FTT and Luna which obviously can’t be avoided by using this tools.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitcoindata21",
      "created_time": "December 21, 2022, 02:51:30 PM",
      "body": "\"I believe even on huge caps is still risky considering the FUD can happened on the specific project with just one allegation in the team like FTT and Luna which obviously can’t be avoided by using this tools.\"Did you look at the charts i posted above? All of the models had warning or sell signals before the Luna AND Ftx dumps",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitcoindata21",
      "created_time": "December 22, 2022, 05:29:20 PM",
      "body": "Hey guys, heres a quick update on the models, as of end of wednesday 21 december.https://www.youtube.com/watch?v=ZfiIFLpfGOoThe biggest sell sign came during FOMC last week when bitcoin topped at 18.4k. As you can see below the Stack Model had 4 out of 7 metrics signalling sell (the dotted red line - where 4 is the threshold to sell a % of the portfolio using that particular model). Combining with technical or order book analysis would have given confluence aswell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "December 22, 2022, 06:00:20 PM",
      "body": "Quote from: bitcoindata21 on December 08, 2022, 08:56:15 PMI created these using onchain data from March 2021 to November 2022. There are 3 models i used together. The first uses eth data, the second btc data, and the third is a momentum/strength model using both eth and btc. For whatever reason eth data is more accurate for trading btc than btc data. Here they are:If it's working for you in trading BTC and ETH and the results is positive, then good. but I would suggest you develop a strategy not only base on onchain data from march 2021 to 2022 , What about if you try getting or comparing data from precious years, maybe you could get more complete and accurate results from the overall years other than basing your data on this two recent years only.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitcoindata21",
      "created_time": "December 22, 2022, 07:47:46 PM",
      "body": "Quote from: Franctoshi on December 22, 2022, 06:00:20 PMQuote from: bitcoindata21 on December 08, 2022, 08:56:15 PMI created these using onchain data from March 2021 to November 2022. There are 3 models i used together. The first uses eth data, the second btc data, and the third is a momentum/strength model using both eth and btc. For whatever reason eth data is more accurate for trading btc than btc data. Here they are:If it's working for you in trading BTC and ETH and the results is positive, then good. but I would suggest you develop a strategy not only base on onchain data from march 2021 to 2022 , What about if you try getting or comparing data from precious years, maybe you could get more complete and accurate results from the overall years other than basing your data on this two recent years only. The data before 2021 - some metrics do not have data going back further, so i only started from March 2021 as a result. The metrics that have data going further back still work.Also i never said i was using this by itself, infact i even mentioned i was using it alongside other data.Even so, there are enough ups and downs over the last 2 years to show that it is effective on multiple occasions in different scenarios",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}