{
  "id": "topic_5475943",
  "title": "Prosofina_G",
  "author": "Prosofina_G",
  "created_time": "November 29, 2023, 03:00:04 PM",
  "content": "As a newbie who is trying to come up by leaning from the hero members, members and legendaries of Bitcoin forum,  it has been a running thought in my mind how really dose Bitcoin make money?Before attending to this question first,what is Bitcoin: Bitcoin can be seen as the circulations of works control data,  in which no institutions or government that controls it, it is mainly for electronic payment from one party to another.HOW DOES BITCOIN MAKE MONEY?in my own little opinion Bitcoin makes it money through mining process, its data of transactions and rewards computer operators.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475943",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "November 29, 2023, 03:27:33 PM",
      "body": "It is just like saying 'how is gold or a commodity makes money'. People can invest on an appreciative asset to make money, but not that the appreciative asset is making money. It is people that are investing on them that will make money as the price of the asset goes up more than the price they bought it. Bitcoin is a digital asset, but an appreciative one.Miners make money from block reward and transaction fee. Miners are not bitcoin. Bitcoin is the coin, while miners are the ones that are producing the hashrates to secure the blockchain and also mining new blocks and including transactions into the block they mine and earn the transaction fee also with the mining block reward.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Justbillywitt",
      "created_time": "November 29, 2023, 03:55:05 PM",
      "body": "This your question e get as e be. You see bitcoin in is a digital money on it's own, which is used as a means of payment and also use to settle cross border transactions without any centralized authority controlling it. So when you say how does bitcoin makes money, is just like saying how does money makes money. And the answer is this you make more money by doing business or you are a service provider. For example if you invest in rice farming, you will make profit when your rice is in demand in the market. Also if you are a car mechanic you will be paid money for your services when you repair a car for a client. So having this in mind let's take it down to bitcoin as a digital money. Miners are the ones that charge service fees for the services they provide in facilitating bitcoin transaction, that is how they make their own money from bitcoin. While there are daily traders who sell bitcoin to willing buyers on centralized exchanges at a price higher from the amount they bought from, that is how those daily traders makes their own money from bitcoin. Also there are those who are long term investors they don't care about the price of bitcoin at the moment, they just buy and hold it for a longer period of time let's say 4 to 10 years, they buy and keep it in anticipation of a higher price than it is currently. Let's take for example, someone who buy bitcoin at $37k and hold it for 10 years and buy that time the price would have gotten to $100k and above  due to the law of demand and supply. So if the person sell by that time he has made profit from the amount he bought the bitcoin. That is exactly how this set of people makes money from bitcoin. Bitcoin as a digital currency appreciates in value as the demands keeps surging.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odohu",
      "created_time": "November 29, 2023, 04:03:21 PM",
      "body": "Quote from: Prosofina_G on November 29, 2023, 03:00:04 PMAs a newbie who is trying to come up by leaning from the hero members, members and legendaries of Bitcoin forum,  it has been a running thought in my mind how really dose Bitcoin make money?To answer you, Bitcoin does not make money rather is is something of value that can appreciate over time. Under the space that Bitcoin covers which is the internet, Bitcoin have all the attributes of money as it can be used for settlement. Just like every commodity of value, when you invest in Bitcoin, it will give you money or make your capital reduce based on the forces of demand and supply.  With Bitcoin, there is no guarantee that you will make money because nothing is promised.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mayor of ogba",
      "created_time": "November 29, 2023, 04:58:28 PM",
      "body": "Quote from: Prosofina_G on November 29, 2023, 03:00:04 PMAs a newbie who is trying to come up by leaning from the hero members, members and legendaries of Bitcoin forum,  it has been a running thought in my mind how really dose Bitcoin make money?Before attending to this question first,what is Bitcoin: Bitcoin can be seen as the circulations of works control data,  in which no institutions or government that controls it, it is mainly for electronic payment from one party to another.HOW DOES BITCOIN MAKE MONEY?in my own little opinion Bitcoin makes it money through mining process, its data of transactions and rewards computer operators.Satoshi did not create Bitcoin for Bitcoin to make money, but Satoshi deployed Bitcoin to give us total control over our money and a payment system where no middleman will scrutinize our transactions. If you want to make money from Bitcoin it is simple, have a little understanding of Bitcoin and know that Bitcoin is not a get-rich-quick scheme. When you know all these you are good to accumulate your Bitcoin and hold it for 4-10 years for the real profit to come. For instance, let me say you accumulated Bitcoin with the DCA strategy when the Bitcoin price was at $40k, and you held it till the Bitcoin price hit another ATH, at this point you are on profit from your Bitcoin investment. Miners are the people who make money from Bitcoin without holding some quantity of Bitcoin but they are paid a fee in Bitcoin for adding transactions to the blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obim34",
      "created_time": "November 29, 2023, 05:00:35 PM",
      "body": "OP... I do not actually think in any way if Bitcoin makes money, how can that be possible. Maybe you mean asking How can one make money from Bitcoin, if I am right then I think people here can be of great help to tell you how it works.I can see you already have some ideas on what is Bitcoin but I can tell you that there are still more values associated with Bitcoin that you still don't know about and will understand better during your stay in this forum.I can just share my little knowledge on Bitcoin, from my own view Bitcoin is a digital currency(because it can not be held physical), decentralized finance (It is not controlled by anybody nor any institution, unlike the Centralized finance) that is used to make payments either for goods bought or for any transactional purposes. Another thing you should consider now so you can grow with it in your Bitcoin journey is understanding the volatile nature of Bitcoin which is most problems associated with new investors. Bitcoin being Volatile (Either an increase in price [BULL] or decrease in price [DIP]) both are greatly associated with Bitcoin and during the DIP one should avoid selling off his investment due to panic and should hold as your Bitcoin portfolio remains the same even during the DIP all you need to do is to keep holding as for sure your investment will grow and give you profit as long you hold for a long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samlucky O",
      "created_time": "November 29, 2023, 05:25:08 PM",
      "body": "This your questions self person no even know where to start to dey answer am self. \"How does Bitcoin make make ? Bitcoin no be human being my brother. Bitcoin na just digital currency wey we dey use for online transaction or payment. and na from wallet to wallet e dey enter. E no be like normal bank transfer wey we dey do on regular basis. And e dey apriciate in value dey also depreciate. E no dey dey stable, today the price fit be $30k tomorrow e fit be $32k. So people find am more secure because government no dey control am, naim be why Dem say e dey decentralized. Meaning say e no focus anywhere. And e get advantage pass our naira. because if you get am for your wallet for some time you go see say e go add value pass the money you keep for bank.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelward",
      "created_time": "November 29, 2023, 05:26:55 PM",
      "body": "Quote from: Prosofina_G on November 29, 2023, 03:00:04 PMHOW DOES BITCOIN MAKE MONEY?in my own little opinion Bitcoin makes it money through mining process, its data of transactions and rewards computer operators.Bitcoin na currency just like our own currency wey be naira, but di difference between dem be say bitcoin na decentralized digital currency, wey nobody or country own, while naira na Nigerian legal tender and im de centralized, meaning say na our CBN de control am. So every currency weda na bitcoin wey be cryptocurrency or naira wey be fiat currency, dem be means of payment. Bitcoin na valuable asset wey person fit hold as investment, and di price for crypto market de fluctuate, so if di price pump, you go fit sale am and make profit. Oda people de trade bitcoin too, dem de buy and sale am to make profit, sometime dem de lose too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartGold01",
      "created_time": "November 29, 2023, 06:34:35 PM",
      "body": "Quote from: Prosofina_G on November 29, 2023, 03:00:04 PMHOW DOES BITCOIN MAKE MONEY?Bitcoin makes money when there seems to be scarcity of it (Demand & Supply) and there are people who are actively buying it this will cause the price to increase and the more people keep buying it the more the price keeps going higher, at this point those who bought it at very tender or when the prices seems not to be higher then can now start selling back. At this point you have made money from holding bitcoin but doesn't mean that once you buy bitcoin you began to make money instantly No it requires time and patient moreover it's highly volatile you have to be prepared to invest in bitcoin because if you invest your hand earn money and it happens that price goes against you then all your money is gone although that doesn't mean that you totally lost the money but it would come back when the bitcoin price tends to reach your entry points, your fraction doesn't reduce rather what reduces is your dollar equivalents.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Prosofina_G",
      "created_time": "November 29, 2023, 09:59:02 PM",
      "body": "Quote from: SmartGold01 on November 29, 2023, 06:34:35 PMQuote from: Prosofina_G on November 29, 2023, 03:00:04 PMHOW DOES BITCOIN MAKE MONEY?Bitcoin makes money when there seems to be scarcity of it (Demand & Supply) and there are people who are actively buying it this will cause the price to increase and the more people keep buying it the more the price keeps going higher, at this point those who bought it at very tender or when the prices seems not to be higher then can now start selling back. At this point you have made money from holding bitcoin but doesn't mean that once you buy bitcoin you began to make money instantly No it requires time and patient moreover it's highly volatile you have to be prepared to invest in bitcoin because if you invest your hand earn money and it happens that price goes against you then all your money is gone although that doesn't mean that you totally lost the money but it would come back when the bitcoin price tends to reach your entry points, your fraction doesn't reduce rather what reduces is your dollar equivalents. You have really really nailed it, this is a pure definition of what I was actually looking for, I, made this post to know exactly how it works, most of us who are newbies don't actually know how bitcoin works. For those of you saying this  my question e get as e be, my brother e no be anything na you way no understand the question, see as smartGold01 con explain the questions in detail.  SmartGold01 thank you very much I own you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Benedictare",
      "created_time": "November 30, 2023, 10:04:13 PM",
      "body": "You need to understand Bitcoin first before going to how it makes money . Bitcoin is a that does not involve banks or governments, whereas it uses block-chain technology to assist peer-to-peer transactions between users on a decentralized network ,and transactions are real through Bitcoin' proof-of-work consensus way which gives cryptocurency miners prove of transaction.       Bitcoins makes money by forming  new Bitcoin from the bitcoin mining process in which they are given as producing great deal of profit to persons who operate computer system who help to prove transactions, the Bitcoin miners are also known as NODES, the owner of high frequency computers which on its own confirm each transactions, adding a complete,  public and lasting record of every bitcoin  transaction.  Miners are being paid in Bitcoin for work done ,that encourages decentralized network to check on its own each transaction.         The independent network of minners reduces fraud or wrong information to be written down,minners has to check the originality of each block of data before adding to the blockchain in a way known as proof -of-work.     Block chain ÷  Bitcoin is suplied by an open-source known as block chain which developes a shared public origin or transaction arranged into BLOCKS that are CHAINED together ,each person's coins stands for the worth of Bitcoin current price.            Bitcoin mining is away of creating new Bitcoin and being released into circulation, mining is necessary to the operation of Bitcoin and some other cryptocurency since it motivates users to enter detailed information inside the shared wallet that keeps path of transactions and balances below the lying block chain network and the participants struggle for rewards  In form of Bitcoin also check transaction through the mining process which has begin known to confirm that transactions are finished with other past transactions ,which makes you to spend only what you have.      The miners make money from Bitcoin successfully by checking blocks  and being rewarded . You buy Bitcoin when the price is favourable  to you  with what you can afford and invest it in other to  make profit",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "November 30, 2023, 10:23:56 PM",
      "body": "OP, Bitcoin is not a centralized technology like the bank or other centralized financial system; there is no one that is employed to work for Bitcoin; everyone that seems to be working for Bitcoin is mostly self-employed, like the miners you talked about. Miners are not employed by anyone; they are people who, on their own, decide to start earning from Bitcoin as a result of mining the transactions of Bitcoiners in the space. Others who are in the space are investors, who use their money to purchase Bitcoin. When the Bitcoin price appreciates in value, some of those investors sell off and make a profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "promise444c5",
      "created_time": "December 01, 2023, 09:53:17 AM",
      "body": "Quote from: Prosofina_G on November 29, 2023, 03:00:04 PMin my own little opinion Bitcoin makes it money through mining process, its data of transactions and rewards computer operators.Well we can say it's a data of transaction but that should be limited to the Blockchain as transaction need to be verified by the  nodes , after the verification there should be a pending transaction, the purpose of this verification is just to make sure the transaction is valid  . The same pending transaction  can now be pick up by a node miner or group of minners( forming a minning  pool) . After the  the transaction have been  mined then it get broadcasted by the nodes thus, a block is formed and added to the blockchain . This process of minning this particular  block is rewarded to minners and  the data is stored on the block-chain  as the name implies .Maybe u are talking about how bitcoin miners make their money  but if you mean how bitcoiners  make their money , then it should not be limited to  only minning  but also investment  and trading , individual choose  to engage in the one  that profit or understandable by them the most",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "December 02, 2023, 06:29:30 PM",
      "body": "Quote from: Prosofina_G on November 29, 2023, 03:00:04 PMHOW DOES BITCOIN MAKE MONEY?in my own little opinion Bitcoin makes it money through mining process, its data of transactions and rewards computer operators.Your little opinion dey wrong, Bitcoin na money himself so Bitcoin no need to make money. Your question just dey like how Naira dey make money, e make sense to you like dat? Wetin you go talk na how people dey make money with Bitcoin and na when different strategies go come on boards like; People make money from Bitcoin through investing  People make money from Bitcoin through mining  People make money from Bitcoin through trading  People make money from Bitcoin through offering a service relating to Bitcoin. People make money from Bitcoin through lending and other ways wey you fit make money from any currency, assets and so onYou fit devlope your own means of making money from Bitcoin, some people dey wey dey work and get paid in Bitcoin. People dey wey dey combine the plenty ways of making money from Bitcoin, basically Bitcoin go give you money anyway wey naira or any other currency fit make you make money too. Bitcoin na a tools to use make money and the best way to make am na by buying and hodling as e better pass others means but if you be person wey dey very creative, you fit invent your own means and they get your choppings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}