{
  "id": "topic_5471779",
  "title": "digaran",
  "author": "digaran",
  "created_time": "October 26, 2023, 06:54:27 PMLast edit: January 20, 2024, 06:59:12 AM by digaran",
  "content": "🖤",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471779",
  "comments": [
    {
      "author": "Orpichukwu",
      "created_time": "October 26, 2023, 07:23:35 PM",
      "body": "With my little knowledge, I believe the reason for a self-moderated topic is to keep the conversation in line with what's being discussed, and the OP of the topic becomes the judge for the thread and can be the one to decide what's in topic and off topic. It's best to avoid such a thread if you feel that our comment won't be appreciated and will get deleted at the end of the day. I believe the forum always creates room to question anyone's judgement, and if you happen to get to a thread on the reputation board that is self-moderated and someone is being investigated, saying something that is not in any way contributing to the topic will get the comment nullified out. You can always object to a deleted comment by asking why it was deleted if you are convinced that your comment is not against the thread and is not in any way a direct insult to anyone. If the reputation board is considered to be a place that promotes signature spam posts, what will be talked about?  1, I always admire and respect those who spend time on the repetition board, as most of them are good at what they do. I don't go there because I don't even have anything to add to an investigation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "October 26, 2023, 07:49:09 PM",
      "body": "Why I don’t dispute your point but one thing I have with new changes happening to the forum set up is, this things aren’t just easy as it seems some patches or changes could just cause a little problem for the entire forum. Also not everyone goes with one’s opinion, so my suggestion is once you see a self moderated thread and you feel injustice in what happens there, then create your own thread and I think people that share same opinion with you will move over there",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zoomic",
      "created_time": "October 26, 2023, 09:05:09 PM",
      "body": "Quote from: digaran on October 26, 2023, 06:54:27 PMIf this was discussed before, remove it.However when you allow people to create self moderated topics in reputation board, they would try censoring whatever they don't like and you will end up with a thread containing only the posts of your liking.This should not be a problem. If you don't want to be moderated by anyone, simply create your own thread about same subject matter. That solves it.Quote from: digaran on October 26, 2023, 06:54:27 PMDon't know if you have noticed or not, that board has become a safe haven for sig spammers while playing with people's reputation and getting paid for it.Playing with people's reputation is very true. I don't visit that board unless there is serious drama, I'll just go read at my leisure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "October 26, 2023, 09:41:14 PM",
      "body": "Quote from: Orpichukwu on October 26, 2023, 07:23:35 PMWith my little knowledge, I believe the reason for a self-moderated topic is to keep the conversation in line with what's being discussed, and the OP of the topic becomes the judge for the thread and can be the one to decide what's in topic and off topic. It's best to avoid such a thread if you feel that our comment won't be appreciated and will get deleted at the end of the day.If your talking about avoiding making comments on a self moderated thread for the purpose that, it might be censored, deleted or made irrelevant due to the fact that, it isn’t welcomed then, you might as well be doing something wrong yourself.I don’t disagree with the OP on the fact that, self moderation could lead to censorship on a discussion but, in cases where your views or vital points as relevant to the case being discussed isn’t being allowed to exist, you could always create a thread of your own. Knowing that, your deleted post isn’t completely off the forum, you could quote it either from the pm you would receive on post deletion and even from the ninjanistic space as well.It’s not a first time I’m seeing a thread trying to arise self moderation on some threads but I’ll say, certain system has its flaws and the forum remains one that isn’t very susceptible to changes and we might continue to manage what we can still. While, leveraging other means for coexistence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "October 27, 2023, 04:05:54 AM",
      "body": "Wow, another one of those.Quote from: Zoomic on October 26, 2023, 09:05:09 PMQuote from: digaran on October 26, 2023, 06:54:27 PMIf this was discussed before, remove it.However when you allow people to create self moderated topics in reputation board, they would try censoring whatever they don't like and you will end up with a thread containing only the posts of your liking.This should not be a problem. If you don't want to be moderated by anyone, simply create your own thread about same subject matter. That solves it.That's right. I did once not exactly against a self-moderated thread but against a thread in which I could no longer reply. It can be used in the same way.:\"Anti-censorship\" reply to Zilon, lol. Quote from: digaran on October 26, 2023, 06:54:27 PMIMO, if self mod is allowed it should at least not count any posts in such topics toward post count, this way people would ignore such topics over time, and gangs can no longer act as a gang.Don't know if you have noticed or not, that board has become a safe haven for sig spammers while playing with people's reputation and getting paid for it.I, apart from someone called digaran, who writes long posts but that either have little to do with the topic or are straight up spam, have not seen many other spammers in the section.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "October 27, 2023, 04:11:36 AM",
      "body": "I know your post got deleted in Reputation section, but do you think they will not delete your post in the other board/section? it's all up to the Original Poster (OP), I can create a self moderated topic in Bitcoin Discussion and wrote \"Any post from @digaran will be deleted\". Even you reply on topic, I will keep delete your post and if you don't like what I do for you, you can create your own topic.So, it's not about to ban self moderated topic in reputation section, but it's a freedom from any user to have their own rules.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "October 27, 2023, 04:15:50 AM",
      "body": "Quote from: Plaguedeath on October 27, 2023, 04:11:36 AMI know your post got deleted in Reputation section, but do you think they will not delete your post in the other board/section? it's all up to the Original Poster (OP), I can create a self moderated topic in Bitcoin Discussion and wrote \"Any post from @digaran will be deleted\". Even you reply on topic, I will keep delete your post and if you don't like what I do for you, you can create your own topic.Exactly. Let's put in context. Let's see why digaran got one post deleted, just one, while most of what he writes is garbage and he gets paid for it:Quote from: LoyceV on October 26, 2023, 08:03:49 AMQuote from: Poker Player on October 26, 2023, 03:20:59 AMYes, digaran gets paid for generally writing drivel that has little to do with the topic at hand.Good point. He won't get paid for posting in my topic anymore:Quote from: LoyceV on October 25, 2023, 11:33:39 AMI will delete insults from digaran. Even better, I'll delete all his posts here. He's on my ignore list for a reason.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "October 27, 2023, 07:50:43 AM",
      "body": "Quote from: Poker Player on October 27, 2023, 04:15:50 AMExactly. Let's put in context. Let's see why digaran got one post deleted, just one, while most of what he writes is garbage and he gets paid for it:Thanks for posting the link. I had to archive it, because the off-topic insults were added later. And that's why I now delete all his posts from my topic.OP should fill in this form.No surprise, another forum troll started spamming my topic with off-topic complaining too.TL;DR: this is exactly why self-moderated topics exist OP only activated his trolling again to spam a signature shady enough to accept a troll with negative feedback.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "October 27, 2023, 08:09:13 AM",
      "body": "Quote from: Zaguru12 on October 26, 2023, 07:49:09 PMWhy I don’t dispute your point but one thing I have with new changes happening to the forum set up is, this things aren’t just easy as it seems some patches or changes could just cause a little problem for the entire forum. Also not everyone goes with one’s opinion, so my suggestion is once you see a self moderated thread and you feel injustice in what happens there, then create your own thread and I think people that share same opinion with you will move over there I go by what you've said, this one is bringing his own opinion and another his, many people want to be giving reasons why they think their own opinion should be the most considerable one when the forum itself is not making changes like that as often, i think the forum had already done it with justice in giving the right to create a self moderated thread and the reason is well clear to everyone, now if self moderated thread is disabled on reputation, what about other boards, are people not having the same privilege the use in abusing that on other boards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "October 27, 2023, 10:01:30 AM",
      "body": "I agree with this; it would look better if it's not self-moderated. If there's a post or reply that doesn't seem appropriate, it should be reported to the moderators, and they can review whether it should be removed or not. It would be biased if the reporter had control over the replies or feedback of other members who are involved in the complaint or defense. If all sides and opinions are heard, there's the fact-checking and providing of proof to support and verify the claims.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "October 27, 2023, 10:09:04 AM",
      "body": "Quote from: Text on October 27, 2023, 10:01:30 AMI agree with thisThe solution is shown right above each self-moderated topic:Code:If you do not want to be moderated by the person who started this topic, create a new topic.QuoteIf all sides and opinions are heard, there's the fact-checking and providing of proof to support and verify the claims.There's no point in fact-checking or even reading posts from known trolls.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UmerIdrees",
      "created_time": "October 27, 2023, 12:29:41 PM",
      "body": "Quote from: digaran on October 26, 2023, 06:54:27 PMIf this was discussed before, remove it.However when you allow people to create self moderated topics in reputation board, they would try censoring whatever they don't like and you will end up with a thread containing only the posts of your liking.When a gang creates such topics, they would discuss, judge, execute, they also act as jury , they would delete whatever they don't like.IMO, if self mod is allowed it should at least not count any posts in such topics toward post count, this way people would ignore such topics over time, and gangs can no longer act as a gang.Don't know if you have noticed or not, that board has become a safe haven for sig spammers while playing with people's reputation and getting paid for it.Well, while your above point is true that if the thread is self-moderated one, only the favourable replies of the topic starter will remain as the OP will delete all the posts that were written against him, hence you can say he would misuse the self-moderated feature for his own benefit.However, regarding your other point related to the signature spammers, if the thread at the reputation board is self-moderated and the OP see that some people are just posting spam in order to complete their posting quota, it will be easy for him to delete those unwanted spam posts. Here the Self-moderated feature is beneficial instead.Also as per my observation, if we usually see less spam and off-topic posts in threads that are self moderated ones and this applies to all boards and not just reputation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "October 27, 2023, 12:49:09 PM",
      "body": "@OP this is easy to solve, just create your own  non self moderated thread that discuss a same topic and voila you don't have to worry if someone delete your post except the moderator (but the moderation in Reputation board is less than other board).Quote from: UmerIdrees on October 27, 2023, 12:29:41 PMhence you can say he would misuse the self-moderated feature for his own benefit.The @OP talk about @LoyceV, is @LoyceV misuse the self moderated feature and a sig spammer?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UmerIdrees",
      "created_time": "October 27, 2023, 01:37:59 PM",
      "body": "Quote from: Solosanz on October 27, 2023, 12:49:09 PMQuote from: UmerIdrees on October 27, 2023, 12:29:41 PMhence you can say he would misuse the self-moderated feature for his own benefit.The @OP talk about @LoyceV, is @LoyceV misuse the self moderated feature and a sig spammer? I never said that   It is better not to snip the posts and try to present your point of view which was not even talked about. Read again and you will know to whom i have called Signature Spammers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "October 27, 2023, 04:08:28 PM",
      "body": "I think self-moderation is the right of the user who creates the thread and it would be really unfair to take that right from the user even if the thread is in reputation board. The OP who creates the thread often dislike the replies that aren't related to thread and somehow could create more clashes and the better solution is to not reply in such threads where OP has made it self-moderated. I know sometimes the OP who created the thread will remove our posts without any question and he/she has the right to do that because he/she is the moderator of that thread and no-one can do anything against him/her. I'm not sure that why it would affect anyone if someone creates a self-moderated thread in Reputation board and in such threads they can obviously delete the unlikely posts without someone's permission.I think it's far better to create your own thread and present the same issue that the OP of that thread has raised and no-one would be able to delete your posts from that thread. But, it's not worth it to take something into such extremes and I would instead forget about the deleted rather than worrying about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "October 28, 2023, 03:04:39 PM",
      "body": "Seeing things from the perspective op is seeing it, I will sure have to agree, the reputation board being a place where any user's reputation can be judged and decided upon, the board and every thread in it should be as decentralized as it can be or get.But on the other hand, signature spammers may use such an opportunity to post things that are completely off topic and the op won't be able to take any action on such post, meanwhile even after reporting such a post, it may take a while before mod delete the post if at all it will be even noticed.What I do conclude to be a real solution is, if the forum team are going to turn off the ability to make self moderated topics in the reputation board, they should also make it that every post or comment in that board should not add to users post counts, let every posts and comments in that board be a free post, so that only people that are serious can really engage in discussions in that board.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Latviand",
      "created_time": "October 28, 2023, 03:55:40 PM",
      "body": "Quote from: digaran on October 26, 2023, 06:54:27 PMWhen a gang creates such topics, they would discuss, judge, execute, they also act as jury , they would delete whatever they don't like.I understand the sentiment that these can be sometimes the case but if you ask me, their gang really can't do anything but discredit the person that they're talking about and if you're the bigger person in the interaction, wouldn't you try and fight them? People who do this anyway are the kind that can't form any real interaction. The big guy move that you can do is probably just ignore that discussion.Quote from: Text on October 27, 2023, 10:01:30 AMI agree with this; it would look better if it's not self-moderated. If there's a post or reply that doesn't seem appropriate, it should be reported to the moderators, and they can review whether it should be removed or not. It would be biased if the reporter had control over the replies or feedback of other members who are involved in the complaint or defense. If all sides and opinions are heard, there's the fact-checking and providing of proof to support and verify the claims.I think that there shouldn't be any changes in the status quo with the self-moderated topics in Reputation because if we don't allow it anymore there, we're definitely opening a Pandora's Box which I don't think that people that's been in this forum for awhile would like a changes regarding where they can have a self-moderated topic, if we're to allow it, what's stopping us from stopping even bigger things?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nutildah",
      "created_time": "October 28, 2023, 04:48:39 PM",
      "body": "Quote from: digaran on October 28, 2023, 04:20:54 PMSome people REALLY don't understand what they say can and will harm others, emotionally or otherwise, reputation is not something we should play with just because we are getting paid for posting, but if at least signatures are not displayed there, they wouldn't simply bother to \"constructively\" ruin someone's reputation by writing 20 lines of their biased opinions.When you first returned a few months back, you were off to a good start... I was unaware of your previous escapades, but am all for giving people second chances. Then I'm assuming you said something directed toward a couple of DT members and they slapped new red trusts on your account (which is not something I fully agree with, BTW). You seem to have found a campaign that accepted you despite your rating, so if I were you I wouldn't bother expending so much energy into trying to exact some kind of revenge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "October 28, 2023, 10:58:34 PM",
      "body": "Quote from: Zaguru12 on October 26, 2023, 07:49:09 PM so my suggestion is once you see a self moderated thread and you feel injustice in what happens there, then create your own thread and I think people that share same opinion with you will move over there @digaran, If I had made the first or second reply, this would have been my response too, but Zaguru12 beat me to it, and yeah, he is right. If you come across a thread that you feel the OP is filtering out the just comments of non-gange members, drop your own opinion there and watch if it gets deleted. If it does, you can start your own topic (perhaps self-moderated too) with regards to what happened, and you will definitely see people who have the same opinion as yours. If you create a self-moderated topic and you discover that the same gange has come to the thread for defense, you can as well filter out their comment. The essence of a self-moderated topic is to delete off-topic comments and shitcomments; it's not for deleting an accurate comment, just because you don't agree with the person when the person is actually on point. Although I have not really noticed what your saying but I don't think the self-mod topic features should be disabled.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}