{
  "id": "topic_5451737",
  "title": "Question:",
  "author": "JollyGood",
  "created_time": "May 06, 2023, 12:54:32 PM",
  "content": "self-moderated to keep this thread clean from trolls, attention-seekers and signature spammersJoshua BuatsivsPawel Stepien30 year old Joshua Buatsi and 32 year old Pawel Stepien are both unbeaten in their professional careers. Buatsi returns to the ring after a year since his last fight and has unbeaten record with 16 straight wins whereas Stepien has a 19 fight unbeaten record with 18 wins and a draw.It will be a close fight but I put Stepien to win. Take part in the poll and give your views",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451737",
  "comments": [
    {
      "author": "coin-investor",
      "created_time": "May 06, 2023, 02:09:33 PM",
      "body": "This is not a championship fight but it looks like one, we have two impressive knockout artists who are both undefeated I have seen Buatsi fight and he is a hard puncher but Stepien is a polished fighter who is hard to hit and has good timing in his punches I have Stepien winning this fight, his timing and counter punches is so good that Buatsi will have to watch when he attacks Stepien.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "May 06, 2023, 02:47:23 PM",
      "body": "We have the weigh-in now https://www.youtube.com/watch?v=cENrRy4aOt8 oh boy, I have never seen such an intense and long face-off, both fighters do not want to back off, Buatsi is good but Stepien is a good all-around boxer so I'll pick him to win the match via knock out.This is the kind of match worth watching two undefeated and hard-hitting boxers, I will prefer watching this match to watching the Canelo - Ryder, it's going to be a total slugfest between Buatsi and Stepien.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shamm",
      "created_time": "May 06, 2023, 04:10:06 PM",
      "body": "Quote from: coin-investor on May 06, 2023, 02:09:33 PMThis is not a championship fight but it looks like one, we have two impressive knockout artists who are both undefeated I have seen Buatsi fight and he is a hard puncher but Stepien is a polished fighter who is hard to hit and has good timing in his punches I have Stepien winning this fight, his timing and counter punches is so good that Buatsi will have to watch when he attacks Stepien.This is a good matchup between two good boxer/fighter we all know that both fighters has the skills and techniques stepien is very good in defense and also he has the ability to timing a counter puncher like him sis very difficult to fight with. But as we all know that buatsi is a good puncher he can break the strategy of stepien this time. Anyways this fight I'll go for buatsi maybe he has chance to win .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "May 07, 2023, 02:59:04 AM",
      "body": "Quote from: Shamm on May 06, 2023, 04:10:06 PMBut as we all know that buatsi is a good puncher he can break the strategy of stepien this time. Anyways this fight I'll go for buatsi maybe he has chance to win .Buatsi won via unanimous decision over Stepien something we were not expecting, Stepien has a hard time defending against Buatsi those hard punches are connecting, it was a totally different Stepien than we have seen, his punches do not have an effect on Buatsi and he's been defending all throughout the fights.We expect something better, Buatsi proves to be the harder puncher of these two hard punchers I agree Batsi won by decision but there was a judge that scores the fight 100- 90 which is ridiculous Buatsi may have been dominated, but there's no way he could shut out Stepien because there were rounds that Stepien won it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JollyGood",
      "created_time": "May 07, 2023, 08:06:58 AM",
      "body": "The judges scorecards were: 97-94, 98-92 and 100-90. The 98-92 and 100-90 were extremely unfair on Stepien because there was no way the score gap was that big.Buatsi is now in a position where he can fight for the WBA championship as he is their number one contender.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "May 07, 2023, 09:24:56 PM",
      "body": "Quote from: JollyGood on May 07, 2023, 08:06:58 AMThe judges scorecards were: 97-94, 98-92 and 100-90. The 98-92 and 100-90 were extremely unfair on Stepien because there was no way the score gap was that big.There's even a video on Youtube where one TV commentator commented that the judge's scorecard should be investigated that judge must have hate Stepien to give that huge gap to BuatsiQuoteBuatsi is now in a position where he can fight for the WBA championship as he is their number one contender. The WBA champion right now is Bivol who is still undefeated and one of the two boxers that have beaten Canelo and the one that stopped Canelo from conquering the light heavyweight category, this is going to be a good match we'll wait for the announcement of the fight.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "May 07, 2023, 09:36:32 PM",
      "body": "Quote from: JollyGood on May 07, 2023, 08:06:58 AMThe judges scorecards were: 97-94, 98-92 and 100-90. The 98-92 and 100-90 were extremely unfair on Stepien because there was no way the score gap was that big.I’m expecting Stepien to win the match but Buatsi defended most of the punches coming from Stepien, the judges sees the different side and made a unanimous decision, Buatsi won and yes he can now fight for WBA Championship. This match was still a great one, a big congratulations for both of the boxer for fighting all out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JollyGood",
      "created_time": "May 07, 2023, 09:41:50 PM",
      "body": "Buatsi has a lot of belief in his skills and that is why he left Matchroom Boxing and Hearn to go it with another promoter. He felt he was offered a world title fight too early in his career and for that reason refused the fight and subsequently parted ways with Hearn and his promotion company Matchroom Boxing.Dmitry Bivol has already announced plans for a unification fight with Beterbiev (or a money spinner fight with Canelo) to take place at the end of this year therefore Buatsi is not someone that he is thinking of.Quote from: coin-investor on May 07, 2023, 09:24:56 PMThe WBA champion right now is Bivol who is still undefeated and one of the two boxers that have beaten Canelo and the one that stopped Canelo from conquering the light heavyweight category, this is going to be a good match we'll wait for the announcement of the fight.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "May 07, 2023, 10:54:05 PM",
      "body": "Quote from: JollyGood on May 07, 2023, 09:41:50 PMBuatsi has a lot of belief in his skills and that is why he left Matchroom Boxing and Hearn to go it with another promoter. He felt he was offered a world title fight too early in his career and for that reason refused the fight and subsequently parted ways with Hearn and his promotion company Matchroom Boxing.I never expected Buatsi to come very prepared in this fight.  I thought Stepien would have the advantage due to Buatsi having ring rust from not fighting for almost a year.  But it was the other way around.  A good job on Buatsi's camp in preparing and scouting against Stepien's strategy.Quote from: JollyGood on May 07, 2023, 09:41:50 PMQuote from: coin-investor on May 07, 2023, 09:24:56 PMDmitry Bivol has already announced plans for a unification fight with Beterbiev (or a money spinner fight with Canelo) to take place at the end of this year therefore Buatsi is not someone that he is thinking of.The WBA champion right now is Bivol who is still undefeated and one of the two boxers that have beaten Canelo and the one that stopped Canelo from conquering the light heavyweight category, this is going to be a good match we'll wait for the announcement of the fight.Well, obviously Dmitry Bivol will come after the boxer where he can gain the most.  There is no gain in fighting Buatsi at this moment so it is obvious that Bivol will be prioritizing fight deals with  Canelo and Betebiev.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "May 08, 2023, 11:37:24 AM",
      "body": "Quote from: lionheart78 on May 07, 2023, 10:54:05 PMWell, obviously Dmitry Bivol will come after the boxer where he can gain the most.  There is no gain in fighting Buatsi at this moment so it is obvious that Bivol will be prioritizing fight deals with  Canelo and Betebiev.But wait there are reports that Buatsi decline to fight Bivol for £1 million and it was revealed by his former promoter Eddie Hearns, there's speculation that he is not ready to fight Bivol.Quote“We’ve offered him well over £1million to fight Dmitry Bivol, and he turned it down, and that’s disappointing. We want him to fight Callum Smith or Bivol, and he wants to fight Dan Azeez. So we’ll have to see.Source: Joshua Buatsi Rejected £1million+ For Dmitry Bivol Says Eddie Hearn - Boxing News 24 (https://www.boxingnews24.com/2023/03/joshua-buatsi-rejected-1million-for-dmitry-bivol-says-eddie-hearn/)A hungry fighter will not turn down a championship because if he wins a title that will double or triple his fighting price and of course his legacy and value as a boxer, there are s many speculations but we'll see who he will fight next and if he'll going to have good matches under his new promotion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JollyGood",
      "created_time": "May 08, 2023, 04:43:09 PM",
      "body": "I mentioned it before, he turned down the opportunity to have a world title fight and then also moved away from Hearn and his Matchroom Boxing promotions.Commentators said he needed more fights before he took on the challenge of a world championship belt, they were probably right and from what I saw in his performance against Stepien I think he is not ready yet, he still needs a couple of fights before he fights a champion for their belts.Quote from: JollyGood on May 07, 2023, 09:41:50 PMBuatsi has a lot of belief in his skills and that is why he left Matchroom Boxing and Hearn to go it with another promoter. He felt he was offered a world title fight too early in his career and for that reason refused the fight and subsequently parted ways with Hearn and his promotion company Matchroom Boxing.Quote from: coin-investor on May 08, 2023, 11:37:24 AMBut wait there are reports that Buatsi decline to fight Bivol for £1 million and it was revealed by his former promoter Eddie Hearns, there's speculation that he is not ready to fight Bivol.Quote“We’ve offered him well over £1million to fight Dmitry Bivol, and he turned it down, and that’s disappointing. We want him to fight Callum Smith or Bivol, and he wants to fight Dan Azeez. So we’ll have to see.Source: Joshua Buatsi Rejected £1million+ For Dmitry Bivol Says Eddie Hearn - Boxing News 24 (https://www.boxingnews24.com/2023/03/joshua-buatsi-rejected-1million-for-dmitry-bivol-says-eddie-hearn/)A hungry fighter will not turn down a championship because if he wins a title that will double or triple his fighting price and of course his legacy and value as a boxer, there are s many speculations but we'll see who he will fight next and if he'll going to have good matches under his new promotion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}