{
  "id": "topic_5425764",
  "title": "vyliam",
  "author": "vyliam",
  "created_time": "December 04, 2022, 09:54:11 PM",
  "content": "Hi guys, I am looking for developer. I want to develop valuebets finder and bot for placing bets automaticaly. This should contain 4 bookmakers that will compare with pinnacle. How much this could cost?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5425764",
  "comments": [
    {
      "author": "jackg",
      "created_time": "December 04, 2022, 11:42:18 PM",
      "body": "Do you know the specific strategies you want to implement or would you want it more generic (ie placing bets when the gap is 5%+ - that'd likely be something configurable I'm just using it as an example)? The complexity of the algorithm you want to be coded will change how much you would expect to pay (a quick search brought me to Midas).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Techdev",
      "created_time": "December 05, 2022, 04:55:02 AM",
      "body": "Contact me on Telegram: @Web3FuturistYou must be willing to use Escrow, if you're not comfortable with a down payment",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sr22398",
      "created_time": "December 05, 2022, 06:33:03 AM",
      "body": "Hello,I would like to assist you with your requirement.Please reach me at Skype or Email.Skype - cis.sethEmail - seth@cisinlabs.comThanksSeth R",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decentrasoft",
      "created_time": "December 05, 2022, 07:50:27 AM",
      "body": "Greetingss, I am the owner of a software company with 37 programmers. We create desktop, web, mobile apps and different types of websites, we also do design and video animations. We have been dealing with blockchain and cryptocurrencies since 2017. I would be glad if you could give me more information about your project. DM us your telegram for further communication",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}