{
  "id": "topic_5458191",
  "title": "nickrussmvp",
  "author": "nickrussmvp",
  "created_time": "July 01, 2023, 03:53:03 AM",
  "content": "Salut à ceux qui passe par la  je voulais acheter un NFT et l'enchérir, ce que j'ai fait. J'ai donc créé un compte sur la plateforme 'Dapp OpenSky', ce qui m'a coûté 5 000 dollars américains. Ensuite, j'ai acheté un NFT d'une valeur d'environ 6 500 dollars américains et je l'ai mis aux enchères. J'ai réussi à le vendre pour 450 000 USDT (Tether).Maintenant, ces 450 000 USDT sont bloqués sur 'Dapp OpenSky' en attendant le paiement des frais. Les frais s'élèvent à 90 000 USDT et j'ai une limite de 15 jours pour effectuer le paiement, sinon mes \"gains\" seront gelés  Il me reste environ 13 jours à partir du moment où j'écris ceci.Veuillez noter que je ne peux pas utiliser mes \"gains\" pour payer ces frais ; je dois utiliser des fonds externes pour acheter 90 000 USDT et payer les frais.Est-ce que quelqu'un a déjà vécu une situation similaire, de près ou de loin ? Si c'est le cas, quelles étapes devrais-je suivre ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458191",
  "comments": [
    {
      "author": "paid2",
      "created_time": "July 01, 2023, 09:14:45 AM",
      "body": "Quote from: nickrussmvp on July 01, 2023, 03:53:03 AMEst-ce que quelqu'un a déjà vécu une situation similaire, de près ou de loin ? Si c'est le cas, quelles étapes devrais-je suivre ?  Salut, Désolé pour toi, mais c'est à 100% une arnaque.La seule étape que tu devrais suivre, est de ne pas leur donner 1 centime de plus, et de malheureusement faire le deuil de tes 11,500 usd (peut-être que tu peux faire du cashback auprès de ta banque ? Tente, mais ça m'étonnerait que ça passe si tu as fait toi-même la démarche de payer \"Dapp OpenSky\")...Il n'y aura jamais besoin de payer 90k de frais pour retirer 450k. Cela n'existe pas. C'est un schéma d'arnaque très - trop - connu, et c'est un classique du monde des cryptos.Si tu paies les 90k, la plateforme te demandera encore plus de pognon, ou sera hors-ligne rapidement et tu n'auras plus de nouvelles.Surtout ne paie rien de plus. Je suis sincèrement navré pour toi, c'est une grosse somme que tu as perdu. Ça me désespère que ce type d'arnaque existe ; mais c'est une leçon (hors-de-prix certes) pour toi : fais toujours des recherches avant de poser le moindre centime dans quoi que ce soit avec les cryptos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Danydee",
      "created_time": "July 01, 2023, 03:53:43 PM",
      "body": "Quote from: iwantmyhomepaidwithbtc2 on July 01, 2023, 09:14:45 AMEt porter plainte ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "July 01, 2023, 03:58:41 PM",
      "body": "Quote from: Danydee on July 01, 2023, 03:53:43 PMEt porter plainte ?Il pourrait toujours tenter, mais en soi, je ne pense pas qu'ils puissent faire grand chose pour lui...Le mec qui est derrière ce site pourrait être a l'autre bout du monde, c'est comme aller porter plainte contre un brouteur de Cote d'Ivoire, pas certain que ça soit autre chose qu'une perte de temps pour OP...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Danydee",
      "created_time": "July 01, 2023, 04:04:38 PM",
      "body": "Quote from: iwantmyhomepaidwithbtc2 on July 01, 2023, 03:58:41 PMIl pourrait toujours tenter, mais en soi, je ne pense pas qu'ils puissent faire grand chose pour lui...Le mec qui est derrière ce site pourrait être a l'autre bout du monde, c'est comme aller porter plainte contre un brouteur de Cote d'Ivoire, pas certain que ça soit autre chose qu'une perte de temps pour OP...Mais aussi vu les sommes engagées par les victimes.. ça risque aussi de bien faire bouger les services et qui sait toujours si il serait pas dans un pays sujet à coopération policiere !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nickrussmvp",
      "created_time": "July 01, 2023, 05:00:54 PM",
      "body": "merci à vous pour vos réponses! à savoir aussi que le wallet Safepal propose de link avec cet Dapp (OpenSky) frauduleuse, peut être je pourrais déposer une plainte contre Safepal ?qu'en penser vous? d'ailleurs est-ce quelqu'un connait ou utilise ce wallet (Safepal) ?merci encore",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "July 01, 2023, 05:22:13 PM",
      "body": "Quote from: nickrussmvp on July 01, 2023, 05:00:54 PMmerci à vous pour vos réponses! à savoir aussi que le wallet Safepal propose de link avec cet Dapp (OpenSky) frauduleuse, peut être je pourrais déposer une plainte contre Safepal ?qu'en penser vous? d'ailleurs est-ce quelqu'un connait ou utilise ce wallet (Safepal) ?merci encore  Pourrais-tu stp nous donner un lien pour Opensky ? Je trouve des bridges mais pas d'application d'achat-vente de NFT / de marketplace.Je suis curieux de voir ce que c'est exactement.Safepal ? Ils ont mauvaise réputation (en tout cas dans certaines communautes Reddit ils décrivent le wallet comme horrible) mais semblent legit malgré leurs défauts. C'est via ce wallet que tu es tombé sur cette plateforme douteuse ? C'est vraiment étonnant, en effet, tu devrais peut-être les contacter, leur fournir le maximum d'infos : screenshots, txid de tes dépôts USDT etc... et leur demander des comptes.C'est pas gagné mais il y a peut-être quelque chose a négocier avec eux (si tu les menaces de porter plainte) si c'est effectivement eux qui t'ont jeté dans les bras des arnaqueurs",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nickrussmvp",
      "created_time": "July 01, 2023, 06:16:44 PM",
      "body": "@iwantmyhomepaidwithbtc2Merci pour ta réponse! voila pour toi:https://a.linesea.site/#/home oui c'est via ce wallet effectivement, c'est une bonne idée c'est exactement ce que je vais faire!thx a lot",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}