{
  "id": "topic_5456865",
  "title": "Alisha-k",
  "author": "Alisha-k",
  "created_time": "June 19, 2023, 01:12:46 PM",
  "content": "I read somewhere in this forum, I can't particularly place the section but the person said, there's no one in this century who hasn't heard about Bitcoin and who doesn't know the future it holds for us and I was of the opinion that that can't be true.Judging from my immediate family, I could tell my parents may know that there's something called Bitcoin and that's because myself and siblings hold random discussions about it.Going through my Facebook account yesterday, I also discovered a very funny trending hilarious video that support my notion.https://www.facebook.com/kobokocomedian/videos/1312697769656434/?app=fbl😂😂😂",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456865",
  "comments": [
    {
      "author": "Synchronice",
      "created_time": "June 19, 2023, 02:02:25 PM",
      "body": "To be honest, I find their English hard to understand and I wouldn't really take seriously videos like this one because I think most of the time they just pay some money to say this or that in video. It's also curious that most of them time when people are asked with this question, no one asks back what is Bitcoin or what's the price of bitcoin or how can they exchange it, that's why I don't believe in the authenticity of these videos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "June 19, 2023, 02:13:18 PM",
      "body": "And you forgot if nowadays staged videos are everywhere, what are you see on a video isn't actually real.There's a chance someone become dumb on purpose because they don't want to reveal themselves to know about Bitcoin or express themselves are Bitcoin holders.I believe there's someone still never heard of word Bitcoin especially they live in a country where the government is strict e.g. North Korea.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "June 19, 2023, 05:40:00 PM",
      "body": "Quote from: Alisha-k on June 19, 2023, 01:12:46 PMthe person said, there's no one in this century who hasn't heard about Bitcoin and who doesn't know the future it holds for us and I was of the opinion that that can't be true.Bitcoin has gone world wide and the widespread is without boarders, but still yet we cannot derive on the conclusion that no anyone has not been informed about bitcoin all over the world, there are still some people and places that are below the standard and have poor development and are yet to hear about this digital currency, there's still more time needed for bitcoin unified globalization through the nooks and crannies of the world.Quote from: Alisha-k on June 19, 2023, 01:12:46 PMJudging from my immediate family, I could tell my parents may know that there's something called Bitcoin and that's because myself and siblings hold random discussions about it.What about the families that they have none of thier children into bitcoin, should they also be counted among or not and just assume they are yet to adopt bitcoin.Quote from: Alisha-k on June 19, 2023, 01:12:46 PMGoing through my Facebook account yesterday, I also discovered a very funny trending hilarious video that support my notionSeing a set of people on a random discussion about bitcoin doesn't mean that everyone has known about it completely, yet we are still having more adoption and awareness on bitcoin ongoing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Casdinyard",
      "created_time": "June 19, 2023, 05:56:26 PM",
      "body": "It’s the paradox of value at play. You can’t expect these Nigerians to choose bitcoin too since they most likely don’t know about bitcoin in the first place, or the value that it possesses. It could also be that they are in dire need of money and would rather choose the quick cash over compounding value since they need it right now and not for the next bull run. See there’s so many things at play here and we fling ignorance at them not knowing what stuff they are personally going through that pushed them to choose that over bitcoin. Perhaps a little openness and perspective could help you with that? It’s funny cause we know how valuable bitcoin is but if the situations were changed, and you’re someone who doesn’t know bout bitcoin asked on-the-spot if you would choose your local currency over bitcoin, what would you do?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "June 19, 2023, 09:37:29 PM",
      "body": "Quote from: Plaguedeath on June 19, 2023, 02:13:18 PMAnd you forgot if nowadays staged videos are everywhere, what are you see on a video isn't actually real.There's a chance someone become dumb on purpose because they don't want to reveal themselves to know about Bitcoin or express themselves are Bitcoin holders.I believe there's someone still never heard of word Bitcoin especially they live in a country where the government is strict e.g. North Korea.Yeah, most viral videos are probably staged, but I don't think this is the case with this one. When you live in a densely populated city, it's not hard to find a few people willing to be interviewed and then cherry-pick the funniest (or most stupid) answers. And it's probably cheaper too, as with staged videos, the \"actors\" would likely want to have their cut.As for Bitcoin's recognition, there are loads of people who are familiar with its name, but don't know pretty much anything else and are clueless about its value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "June 19, 2023, 10:34:04 PM",
      "body": "The host has no sense, he asking people from street to choose between half bitcoin and 2 million, obviously people going to take 2 million. If I don't google the exchange rate of Nigerian currency I would have 2 million instead of half bitcoin. OP not everyone here is from your country and it is really hard to get the context of your video. Don't be lame like the host of the video you shared.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "June 19, 2023, 10:45:29 PM",
      "body": "The guys is asking random people and it is obvious on the video that people who know about Bitcoin's worth will choose it over the lesser fiat money offered. Just like the first girl on the video, I think the girl knows about Bitcoin and knew that it is really expensive so she chooses Bitcoin since she knows the amount of Bitcoin offered is far greater than the fiat money offered.  I do not know which part is hilarious there since anyone asked that don't know BTC will obviously pick the fiat currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romero121",
      "created_time": "June 19, 2023, 10:53:26 PM",
      "body": "Just because we know about Bitcoin, it looks different for us. With common people whom hadn't known about bitcoin will find the reality in the video. This won't be surprising for them. Another thing, these days more videos were of staged ones. We can't expect the same to have genuinity. The best part of the video, it makes more people watching it go find what is bitcoin. Atleast in this manner the videos are helping in the widespread. Even the technology people aren't aware about bitcoin and its existence, then how things could be in a better position with people who are working on different streams.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bazzu",
      "created_time": "June 20, 2023, 01:44:57 AM",
      "body": "the video is very funny and entertaining.indeed, in this world, of course, there are still many people who don't know bitcoin, and in my area, not all of them know bitcoin, especially if in a country there is no thorough internet or in a country where the government in that country doesn't like bitcoin, so there will definitely be a lot of people who don't know what bitcoin is.but I hope that in the future many people will know about bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "June 20, 2023, 02:56:22 AM",
      "body": "Quote from: Alisha-k on June 19, 2023, 01:12:46 PMI read somewhere in this forum, I can't particularly place the section but the person said, there's no one in this century who hasn't heard about Bitcoin and who doesn't know the future it holds for us and I was of the opinion that that can't be true.Judging from my immediate family, I could tell my parents may know that there's something called Bitcoin and that's because myself and siblings hold random discussions about it.Going through my Facebook account yesterday, I also discovered a very funny trending hilarious video that support my notion.https://www.facebook.com/kobokocomedian/videos/1312697769656434/?app=fbl😂😂😂Lol viral videos ? another personal purpose and to gain attention as they carenothing about bitcoin but themselves .you have been in this market for how many years yet you still buy those kind of tricks?  Quote from: Mahirap on June 19, 2023, 10:34:04 PMThe host has no sense, he asking people from street to choose between half bitcoin and 2 million, obviously people going to take 2 million. If I don't google the exchange rate of Nigerian currency I would have 2 million instead of half bitcoin. OP not everyone here is from your country and it is really hard to get the context of your video. Don't be lame like the host of the video you shared.another stupid videos that seeks attention and what is more stupid? is that OP shared it here when we care nothing about what they stand .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "June 20, 2023, 04:05:41 AM",
      "body": "Quote from: Alisha-k on June 19, 2023, 01:12:46 PMI read somewhere in this forum, I can't particularly place the section but the person said, there's no one in this century who hasn't heard about Bitcoin and who doesn't know the future it holds for us and I was of the opinion that that can't be true.Judging from my immediate family, I could tell my parents may know that there's something called Bitcoin and that's because myself and siblings hold random discussions about it.Going through my Facebook account yesterday, I also discovered a very funny trending hilarious video that support my notion.https://www.facebook.com/kobokocomedian/videos/1312697769656434/?app=fbl😂😂😂To be frank, I watched the video but I couldn't quite follow the topic they were talking about, their English pronunciation was a bit slang. In short, I find it difficult to understand because the letters they say are words that can be eaten.I also don't get the point of the content why they made that video about Bitcoin. What is the catch of that content? to show that many people are still naive to Bitcoin? Is that the purpose of their interview with the public there?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Peanutswar",
      "created_time": "June 20, 2023, 04:16:03 AM",
      "body": "It depends on it that there is a different perspective if the person does not know what's about bitcoin for sure they will chose the other option or the money but if you will make a comparison if the worth of the money to a bitcoin is way profitable better to determine the higher value at the end you can get a bitcoin at least with the amount. Seems like they are just trying to troll which most of the people choose it's the bitcoin over the cash but for me, ill go with the higher value and have an option to buy Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "June 20, 2023, 06:13:51 AM",
      "body": "Quote from: romero121 on June 19, 2023, 10:53:26 PMJust because we know about Bitcoin, it looks different for us. With common people whom hadn't known about bitcoin will find the reality in the video. This won't be surprising for them. Another thing, these days more videos were of staged ones. We can't expect the same to have genuinity.(....)I agree here because these days especially if you are on social media, some videos or any content there are already scripted, and some are only for the views.About Bitcoin, I am very positive that we are still early and that's why there are still large portion in the world that they still don't know what Bitcoin is, so for me, that's why we are gifted, we will be the tools to spread the good things about Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "glendall",
      "created_time": "June 20, 2023, 07:21:25 AM",
      "body": "Why is it considered funny that people don't know what Bitcoin is?I think it's only natural that there are people who don't understand or know what bitcoin is.In my country, there are still people who don't know what bitcoin is.bitcoin is famous among 2000 and above, not below, so don't laugh at people who don't know what bitcoin is because it's normal in my opinionsorry, I'm too sensitive about this video because in my opinion it's too mocking even though there's something he said that I don't understand, but from the look on his face, you can see a smile of ridicule whether it's real or a trick, but it's inappropriate",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "June 20, 2023, 07:45:49 AM",
      "body": "Quote from: Alisha-k on June 19, 2023, 01:12:46 PMI read somewhere in this forum, I can't particularly place the section but the person said, there's no one in this century who hasn't heard about Bitcoin and who doesn't know the future it holds for us and I was of the opinion that that can't be true.Judging from my immediate family, I could tell my parents may know that there's something called Bitcoin and that's because myself and siblings hold random discussions about it.Going through my Facebook account yesterday, I also discovered a very funny trending hilarious video that support my notion.https://www.facebook.com/kobokocomedian/videos/1312697769656434/?app=fbl😂😂😂There is no doubt that Bitcoin awareness is spreading rapidly in many countries especially developing nations. The citizens of the nations are seeking ways of avoiding inflation and the decline in the value of local currencies. Many people have been introduced to Bitcoin to help them fight this inflation and devaluation of the currency of their nation which will make their savings worthless in the future. I know Nigeria has one of the biggest bitcoin markets in Africa because many Nigerians especially the youths are embracing it. But bitcoin awareness is low among those between the ages of 50 and above. Many of them might have heard the word Bitcoin but I can attest that they know little or nothing about the currency. In the rural areas, many people have not even heard the word Bitcoin. As many members have said, most of the content on these social media space is staged to achieve an objective. But no doubt bitcoin awareness is increasing every day even among the elderly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "June 20, 2023, 08:00:20 AM",
      "body": "Not everyone in any part of the world even cares when you try to raise awareness about bitcoin, because everyone's financial critical level can be different in terms of several aspects such as personality, environment, economic condition, etc.Throughout my journey in this space, someone will really welcome the explanation of bitcoin when they really want a financial solution. At this point sometimes they are also more realistic, if you don't look rich then don't expect them to listen to you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "June 20, 2023, 08:02:19 AM",
      "body": "Quote from: Alisha-k on June 19, 2023, 01:12:46 PMI read somewhere in this forum, I can't particularly place the section but the person said, there's no one in this century who hasn't heard about Bitcoin and who doesn't know the future it holds for us and I was of the opinion that that can't be true.Judging from my immediate family, I could tell my parents may know that there's something called Bitcoin and that's because myself and siblings hold random discussions about it.Going through my Facebook account yesterday, I also discovered a very funny trending hilarious video that support my notion.https://www.facebook.com/kobokocomedian/videos/1312697769656434/?app=fbl😂😂😂I have watched the video and it's just a guy asking random people about Bitcoin, and that's totally useless because the people seem technically weak ones and they don't even know how to withdraw money if they accept Bitcoin. They are from Nigeria and they know their currency very well and that's why they are choosing their own fiat currency over Bitcoin. I must say that their English is totally un-understandable, and most of the words just flow over my head. However, the guy was asking about Blockchain and people were saying something really strange because I think they considered blocks + chains and came with conclusion as blockchain which makes sense.After watching the video I found nothing special, but someone who was pranking with innocent people who weren't even aware about Bitcoin. It's understandable that the technology of Bitcoin is not as old or mature as of fiat based currencies and that's why most people don't know how to use it. In many small cities people are so weak in technology that they can't sell anything online because they don't know how to do bank-transfer or receive bank-transfer from the banks own application. Although, the banks are nowadays giving complete control to a user to transfer and receive the funds using their own applications but still users aren't that knowledgeable to take benefits from such services. So, it's not fair to prank with those people who aren't aware about a technology, the better way is to teach them about the technology they are lacking, and promote awareness about it so that they may get interest to learn about it. Teach them what's Bitcoin and how the blockchain and Bitcoin works, that would be a great thing for humanity rather than creating prank videos that show people's lack of knowledge regarding Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "June 20, 2023, 11:21:28 AM",
      "body": "I'll find this video educational if, at the end of the interview, he gives some mini book regarding bitcoins and some freebies to promote it; if it's that the case, then it will be worth sharing. But if it's just some survey proving how ignorant people are regarding bitcoins until now, then it's not that bad. At least we know how far bitcoins reach in this part of the world, and we see how they react when they first hear about it. I want to see the same interview in the next 5-10 years; I wonder if it's the same or if they are improving their Bitcoin knowledge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arwin100",
      "created_time": "June 20, 2023, 11:25:22 AM",
      "body": "Quote from: Alisha-k on June 19, 2023, 01:12:46 PMI read somewhere in this forum, I can't particularly place the section but the person said, there's no one in this century who hasn't heard about Bitcoin and who doesn't know the future it holds for us and I was of the opinion that that can't be true.Judging from my immediate family, I could tell my parents may know that there's something called Bitcoin and that's because myself and siblings hold random discussions about it.Going through my Facebook account yesterday, I also discovered a very funny trending hilarious video that support my notion.https://www.facebook.com/kobokocomedian/videos/1312697769656434/?app=fbl😂😂😂Don't get surprise about ignorance of bitcoin since not all can easily digest this especially if they didn't hear something about it. For sure they became skeptical because they have no idea on how they could use this or even if they can call it legit because no people introduce it yet with correct information.But who knows those ignorance people will adopt it later on once there are more people near them use it and they find them successful so we better not to stress out on this and continue to use bitcoin then continue to earn with it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}