{
  "id": "topic_5446739",
  "title": "gamezal",
  "author": "gamezal",
  "created_time": "March 29, 2023, 07:06:02 AM",
  "content": "Dieser Post ist zu Informationszwecken, das Projekt ist sehr interessant, es gibt eine App für iOS und Android. Der Link zum Original - https://bitcointalk.org/index.php?topic=5441816.0  BountyManager -  irfan_pak10 (https://bitcointalk.org/index.php?action=profile;u=350580)                                             TWITTER          FACEBOOK           REDDIT",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446739",
  "comments": [
    {
      "author": "sam00",
      "created_time": "March 29, 2023, 11:08:47 AM",
      "body": "@gamezal hast du diesen Post selbst übersetzt?An einigen Stellen klingt es nämlich nicht ganz rund. Im originalen Bounty Thread steht zwar nur, dass kein Google Übersetzer genommen werden darf aber ob jetzt ChatGPT oder andere Quellen erlaubt sind, um dir die Arbeit zu erleichtern, weiß ich nicht In anderen Beiträgen schreibst du ja, dass du deutscher Muttersprachler bist, weswegen ich dir hier nicht einfach etwas unterstellen möchte. Kann mich jedenfalls nicht erinnern, mal mit dir hier interagiert zu haben.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gamezal",
      "created_time": "March 29, 2023, 04:14:47 PM",
      "body": "Guten Tag und vielen Dank für Ihre Aufmerksamkeit Die Übersetzung hat einer aus meinem Team gemacht aber natürlich trage ich die Verantwortung dafür. Verstehe was Sie meinen und wen ich dafür Zeit habe, ändere ich das. Wünsche Ihnen einen angenehmen Abend",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hanspeter77",
      "created_time": "April 01, 2023, 08:40:39 AM",
      "body": "gibt es nochmal eine runde oder wie schaut das aus würde gerne bei der sig bounty mit machen",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CoinEraser",
      "created_time": "April 01, 2023, 10:51:47 AM",
      "body": "Quote from: hanspeter77 on April 01, 2023, 08:40:39 AMgibt es nochmal eine runde oder wie schaut das aus würde gerne bei der sig bounty mit machen Die zweite Runde der Kampagne hat gestern angefangen und es wird auch eine dritte Runde geben. Musst einfach mal in den neuen Bountyfaden schauen, dort findest du alle Informationen.  Link: [Bounty] [Stage #2] Second Live | 🚀 01 M $BEAN Tokens 🚀🔥 Stake BEAN earn LIVE",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pabivo3003",
      "created_time": "December 15, 2023, 02:14:11 AM",
      "body": "Quote from: CoinEraser on April 01, 2023, 10:51:47 AMDie zweite Runde der Kampagne hat gestern angefangen und es wird auch eine dritte Runde geben. Musst einfach mal in den neuen Bountyfaden schauen, dort findest du alle Informationen. Quick Draw  Link: [Bounty] [Stage #2] Second Live | 🚀 01 M $BEAN Tokens 🚀🔥 Stake BEAN earn LIVEHello, I wonder when the third round will take place?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}