{
  "id": "topic_5435857",
  "title": "TheNewcomer",
  "author": "TheNewcomer",
  "created_time": "January 18, 2023, 08:15:26 AM",
  "content": "Hallo alle zusammen, ich habe vor kurzem bei einem Gewinnspiel hier im Forum eine 5$ Freiwette bei Betnomi gewonnen. Ich weis nicht ob sie schon gutgeschrieben wurde aber selbst wenn weiß ich nicht wo ich si ein meinem Account finde. Kann mir da vielleicht jemand weiterhelfen?Vielen Dank im vorraus",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5435857",
  "comments": [
    {
      "author": "CoinEraser",
      "created_time": "January 18, 2023, 10:32:07 AM",
      "body": "Ich glaube, die gewonnenen Freiwetten wurden einfach noch nicht gutgeschrieben. Wenn ich mich richtig erinnere, wollte 1miau uns Bescheid geben, wenn es so weit ist. Hab jedenfalls bisher auch nichts auf meinem Benutzerkonto bei Betnomi gefunden. Hatte auch zwei Freiwetten gewonnen und ich sollte noch eine Dritte bekommen, da ich ein Gewinnspiel von Betnomi für eine Ledger Wallet gewonnen hatte. Ich bin mir zwar nicht sicher, aber ich könnte mir vorstellen, uns wird das als Guthaben gut geschrieben.  Vielleicht kann ja 1miau mehr dazu sagen bzw. du kannst auch im Faden von Betnomi direkt mal nachfragen, falls es sehr eilig ist. 🦊 Betnomi.com | Sportsbook & Casino 🎲⚽",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "January 18, 2023, 10:45:17 AM",
      "body": "die besagten freiwetten wurden von 1miau (meines wissens) schon an betnomi weitergeleitet - jeder gewinner sollte demnach auch eine pm bekommen habenda der betnomi ceo weiterhin busy ist und auch nebenbei auch ein normales leben hat, ist es nachvollziehbar dass es mit der gutschrift nicht gleich/direkt klappt (siehe auch unsere betnomi bundesliga pools)ihr könnt euch alle sicher sein, dass eure gutschrift auf jeden fall an euer acc übermittelt wird - geduld ist angesagt",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheNewcomer",
      "created_time": "January 18, 2023, 11:07:24 AM",
      "body": "Ja habe eine pm bekommen. ich hab da auch keinen Stress ich wollte nur nachfragen wie das genau abläuft. Aber danke für die Rückmeldungen",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "January 18, 2023, 11:38:07 PM",
      "body": "Quote from: CoinEraser on January 18, 2023, 10:32:07 AMIch glaube, die gewonnenen Freiwetten wurden einfach noch nicht gutgeschrieben. So ist es. Betnomi war bis 15.01.2023 offenbar in Urlaub und seitdem haben sich bestimmt noch mehr Dinge angesammelt, die zuerst geklärt werden müssen. Freiwetten haben da vermutlich eine eher geringere Priorität. Quote from: CoinEraser on January 18, 2023, 10:32:07 AMWenn ich mich richtig erinnere, wollte 1miau uns Bescheid geben, wenn es so weit ist. Das ist ebenfalls korrekt. Habe die Accountnamen aller Gewinner an Betnomi bereits übermittelt und alle Gewinner haben eine entsprechende PN erhalten, dass die Info bei Betnomi jetzt vorliegt. Ein paar Namen fehlen noch aber die reiche ich nach. Alle, die bereits eine PN erhalten haben, sind bei Betnomi für die Freiwetten gemeldet. Wenn Betnomi die Freiwetten auf euren Accounts gutschreibt, bekommt ihr erneut eine Nachricht von mir und ich werde im jeweiligen Gewinnspiel-Faden die Informationen weitergeben, die ich von Betnomi bekomme. Betnomi meinte letzt, dass solche Dinge wie Ablaufdatum, Anwendbarkeit etc. dann näher erläutert werden. Die Freiwettenfunktion ist neu, daher ist noch nicht ganz klar, wie es genau abläuft. Ihr werdet auf jeden Fall rechtzeitig informiert, wenn ihr täglich hier rein schaut und die beiden Fäden beachtet: [Gesponsort von Betnomi] Gewinnspiel - Betnomi Hardware-Wallet und 0,5 mBTC[Gewinnspiel] Welches ist der letzte Block dieses Jahr? - gesponsort von Betnomi",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheNewcomer",
      "created_time": "January 19, 2023, 07:09:00 AMLast edit: January 19, 2023, 01:52:20 PM by mole0815",
      "body": "Quote from: 1miau on January 18, 2023, 11:38:07 PMQuote from: CoinEraser on January 18, 2023, 10:32:07 AMIch glaube, die gewonnenen Freiwetten wurden einfach noch nicht gutgeschrieben. So ist es. Betnomi war bis 15.01.2023 offenbar in Urlaub und seitdem haben sich bestimmt noch mehr Dinge angesammelt, die zuerst geklärt werden müssen. Freiwetten haben da vermutlich eine eher geringere Priorität. Quote from: CoinEraser on January 18, 2023, 10:32:07 AMWenn ich mich richtig erinnere, wollte 1miau uns Bescheid geben, wenn es so weit ist. Das ist ebenfalls korrekt. Habe die Accountnamen aller Gewinner an Betnomi bereits übermittelt und alle Gewinner haben eine entsprechende PN erhalten, dass die Info bei Betnomi jetzt vorliegt. Ein paar Namen fehlen noch aber die reiche ich nach. Alle, die bereits eine PN erhalten haben, sind bei Betnomi für die Freiwetten gemeldet. Wenn Betnomi die Freiwetten auf euren Accounts gutschreibt, bekommt ihr erneut eine Nachricht von mir und ich werde im jeweiligen Gewinnspiel-Faden die Informationen weitergeben, die ich von Betnomi bekomme. Betnomi meinte letzt, dass solche Dinge wie Ablaufdatum, Anwendbarkeit etc. dann näher erläutert werden. Die Freiwettenfunktion ist neu, daher ist noch nicht ganz klar, wie es genau abläuft. Ihr werdet auf jeden Fall rechtzeitig informiert, wenn ihr täglich hier rein schaut und die beiden Fäden beachtet: [Gesponsort von Betnomi] Gewinnspiel - Betnomi Hardware-Wallet und 0,5 mBTC[Gewinnspiel] Welches ist der letzte Block dieses Jahr? - gesponsort von Betnomi Alles klar danke dir. Mir ging es jetzt wenig darum wann die Wetten ankommen sondern wie das allles Funktioniert. Aber da das neu ist werden wir es ja sehen. Danke 1miau für die Info //edit by mole0815: Zitat korrigiert.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "January 21, 2023, 12:56:01 AM",
      "body": "Quote from: TheNewcomer on January 19, 2023, 07:09:00 AMAlles klar danke dir. Mir ging es jetzt wenig darum wann die Wetten ankommen sondern wie das allles Funktioniert. Aber da das neu ist werden wir es ja sehen. Danke 1miau für die Info //edit by mole0815: Zitat korrigiert.Huhu, schau mal in deinen Betnomi-Account, da müsste was angekommen sein.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheNewcomer",
      "created_time": "January 23, 2023, 07:47:26 AM",
      "body": "Quote from: 1miau on January 21, 2023, 12:56:01 AMHuhu, schau mal in deinen Betnomi-Account, da müsste was angekommen sein.   Jap hab grade nachgeguckt und eine Wette platziert. Lief alles super",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "planingkoala",
      "created_time": "February 08, 2023, 05:00:06 PM",
      "body": "Ich finde es zwar spannend, wenn ein Wettanbieter auf Tauchstation geht, aber ich werde mir gleich einmal Betnomi näher anschauen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}