{
  "id": "topic_5468318",
  "title": "Nalain420",
  "author": "Nalain420",
  "created_time": "September 27, 2023, 03:38:33 PM",
  "content": "السلام عليكم جميعاً يا إخوتيلقد مر وقت طويل منذ آخر لقاء لي بكم جميعًا، وآمل أن يكون الأمر جيدًا بالنسبة لجميع إخوتي. لم أتمكن من المشاركة في هذه المجتمعة خلال الأسابيع الأخيرة بسبب حادث تعرضت له. بسبب تلك الحادثة، لم أتمكن من نشر أي شيء هنا أو أن أكون نشطًا، لكنني كنت ما زلت أقرأ مشاركاتكم خلال تلك الفترة. أود أن أعتذر عن عدم نشاطي، ولكن الآن كل شيء على ما يرام، وأنا ملتزم تمامًا بأن أكون هنا لكم جميعًا ولأعضاء المجتمع.كان لدي بعض الأعمال الغير منتهية، وكنت قد شاركت ملخصًا للمشاركات في أغسطس معكم جميعًا، لكنني لم أشارك تقرير ملخص الجدارة حتى الآن، جزئيًا بسبب عدم نشاطي. لذا، لنبدأ من جديد.في المقام الأول، دعونا نقارن بين الجدارة الشهرية لعام 2023 مع كل شهر. شيء لفت انتباهي هو أن مساهمات الجدارة كانت مرتفعة جدًا في يناير 2023 مقارنة بالأشهر الأخرى. أعتقد أن هناك الكثير من المستخدمين النشطين والمناقشات خلال تلك الفترة، ونتيجة لذلك، كان هناك توزيع أعلى للجدارة، مع العديد من المساهمات تتراوح بين 200 و 300 جدارة. مع إضافة المستخدمين الجدد، كلما زاد عدد الأعضاء، زادت مساهمات الجدارة. بهذه الطريقة، يمكن لمجتمعنا أن يستمر في النمو، ويمكن للأعضاء الجدد تحقيق رتب متنوعة. لقد جمعت هذه المعلومات التوضيحية من لوحة تحكم DdmrDdmrالآن دعونا نرى من قدم كمية الجدارة في مجتمع اللغة العربية. بالإجمال، تم إرسال 269 جدارة في شهر أغسطس. في هذه القائمة، معظم الأعضاء الأسطوريين هم الذين قدموا أكبر عدد من الجدارة، من المبتدئين إلى رتبة الأسطوري. إليكم أفضل المستخدمين في هذه القائمة:hugeblackmikeywithOmegaStarScreamهؤلاء الإخوة الثلاثة الأسطوريين هم الذين يقدمون أكبر عدد من الجدارة ويساعدون المجتمع على النمو، حتى يصبح المزيد والمزيد من المستخدمين نشطين. إسهامات باقي المستخدمين أيضًا مستحقة للتقدير.قائمة الذين قدموا الجدارة:Code:1miau [4]_Hiloveua_ [1]albon [2]bitmover [3]CryptoCuMan [1]DdmDdmr [2]GxSTxV [7]Halab [2]hugeblack [78]Kavelj22 [33]Khaled0111 [7]mikeywith [73]Nalain420 [3]OmegaStarScream [21]SeriouslyGiveaway [2]Trawda [4]Ulven [10]yhiaali3 [16]الآن أريد أن أظهر أي رتبة قد قدمت كم جدارة. الإجمالي هو 269 جدارة، وفي هذا الرسم البياني، يكون الأعضاء الأسطوريين دائمًا في الصدارة.Code:Legendary rank [251]Senior Rank [7]Full member Rank [1]Member Rank [2]Junior Rank [8]الآن دعونا نرى من استلم كم جدارة في شهر أغسطس، من بين 269 جدارة. في هذه القائمة، يكون معظم الأعضاء رتبة أسطورية، وتمت إضافة بعض الأعضاء الجدد أيضًا. في الشهر القادم، نأمل أن نرى ملخصات أفضل لاستلام الجدارة وإرسالها من قبلي ومن زملائي الآخرين.إليكم أعلى 3 مستخدمين استلموا أكبر عدد من الجدارة:mikeywithyhiaali3Kavelj22تهانينا لـ mikeywith لكونه في الصدارة في إرسال واستلام الجدارة. بالإضافة إلى mikeywith، هناك أيضًا آخرون استلموا كمية كبيرة من الجدارة.قائمة الذين استلموا الجدارة:Code:albon [24]CryptoCuMan [1]DIA7 [4]GxSTxV [23]JazzyJester [4]Kavelj22 [34]Khaled0111 [13]mikeywith [50]Nalain420 [22]OmegaStarScream [5]Trawda [11]Ulven [23]yhiaali3 [45]Zwei [10]في الرسم البياني الأخير، يمكنك رؤية أعضاء الرتبة الذين استلموا كمية من الجدارة. في هذا الرسم البياني أيضًا، تكون الرتب الأسطورية دائمًا في الصدارة.Code:Legendary rank [194]Hero Rank [4]Senior Rank [33]Junior Rank [34]Newbie Rank [4]",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468318",
  "comments": [
    {
      "author": "GxSTxV",
      "created_time": "September 27, 2023, 06:35:42 PM",
      "body": "شكرا جزيلا على الموضوع اخي الفاضل ومن الجيد ان نرى متابعة وتلخيص لنقاط الجدارة في قسمنا العربي مثل الاقسام الاجنبية الاخرى.بخصوص النقاط اردت ارسال 2 فقط لكن اضفت 0 بالخطأ وتم ارسال 20 نقطة جدارة",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "September 27, 2023, 08:37:24 PM",
      "body": "عمل رائع تقوم به أخي، أعتقد أن هذا الموضوع يجب أن يتم تحديثه شهريا حتى يتبين للأعضاءالمبتدئين كيف تسير الأمور. ملاحظة بسيطة يجب عليك الإنتباه لها و هي الترتيب يزيد من جمالية الملخص على سبيل المثال القائمة التي خصصتها لمستلمي الجدارة سيكون من الرائع تصنيف القائمة من النقطة الأعلى إلى الأدنى. المرجو تقبل مروري مرة أخرى شكراً على المجهود",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "September 27, 2023, 08:48:25 PM",
      "body": "شكرا اخي على المجهود الذي قمت به لجمع كل هذه البيانات و على تقديمها بشكل سلس و تحليلها.من الجيد رؤية ان النشاط في القسم العربي في تطور مستمر و يتحسن بشكل ملحوظ من سنة لأخرى. لا استبعد ان يصبح القسم العربي منافسات للاقسام المحلية الكبرى الأخرى مثل الروسي و غيره اذا استمر النشاط بالتطور على نفس هذا النسق.شخصيا، لم اساهم كثيرا في الفترة الأخيرة سواءا بالمشاركات او بتوزيع نقاط الجدارة و ذلك لأسباب متعددة اهمها مشاغل الحياة اليومية لكن اعد ان نشاطي سيكون افضل بكثير في القادم، ان شاء الله.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "September 28, 2023, 01:48:03 AM",
      "body": "احسنت على هده الدراسة, طبعا مثل العادة الاخ hugeblack يفوز علي ف عدد النقاط المرسلة, ساحاول الفوز في المستقبل  .اعنقد ان القسم العربي في مستوى جيد من حيث النشاط وتوزيع نقاط الجدارة واعتقد ان الامر سيتحسن اكثر عند توقف بعض الاعضاء عن تخزين نقاط الجدارة بدل من ارسالها, لا اعرف كيف اشرح ذلك ولكن كل ماتشبتت بنقاط الجدارة كلما قلت نقاط الجدارة التي ستحصل عليها.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "September 28, 2023, 02:53:08 AMLast edit: September 28, 2023, 10:07:40 AM by yhiaali3",
      "body": "Quote from: GxSTxV on September 27, 2023, 06:35:42 PMبخصوص النقاط اردت ارسال 2 فقط لكن اضفت 0 بالخطأ وتم ارسال 20 نقطة جدارةهذا من حسن حظ الأخ Nalain420 ، لكنه يستاهل بالطبع لأن الموضوع جيد ومتعوب عليه. أنا منذ بدايتي في المنتدى لم يتجمع لدي 20 sMerit لأنني أنفق الجدارة فورا وأغلبها هنا في القسم العربي. بصراحة الأخوة لم يبخلوا علينا بنقاط الجدارة وخاصة عندما كنا مبتدئين ولذلك من واجبنا نحن ايضا دعم المبتدئين الذين يكتبون مواضيع جيدة. بالتوفيق لك وللجميع أخي.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nalain420",
      "created_time": "September 28, 2023, 10:14:15 AM",
      "body": "شكرًا جزيلًا لكم، إخوتي، على تحفيزكم لي. أبذل قصارى جهدي لمشاركة التفاصيل الكاملة والتحليل معكم حتى يكون كل نقطة واضحة ويمكنكم قراءتها وفهمها بسهولة. أنا أقدر أيضًا ملاحظاتكم يا أخي Ulven. إن شاء الله، سأتبع نصائحكم، وفي المرة القادمة، وفقًا لمراجعاتكم، سأقدم تقريرًا تحليليًا وتقريرًا عن الجدارة. إذا كانت هناك أي أخطاء أو نقائص في التقرير، يرجى تحديثي حتى أتمكن من التحسين والمشاركة بشكل أفضل.إن شاء الله، سأسهم بشكل كامل في الجدارة في القسم العربي. بهذه الطريقة، ستستمر مجتمعنا في النمو، وسينضم أعضاء جدد. إن شاء الله، سيأتي اليوم الذي سنتفوق فيه على الجدار الروسي والجدارات الأخرى.مرة أخرى، شكرًا جزيلًا لكم جميعًا، وشكرًا خاصًا لأخ GxSTxV على 20 نقطة جدارة  سأساهم بالتأكيد بنقاط الجدارة الخاصة بي مع جميع إخوتي قريبًا.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "September 28, 2023, 06:28:13 PM",
      "body": "يعطيك العافية على هذا الموضوع لملخص نقاط الجدارة, مجهود جيد أحسنت وأمل انت تستمر على هذا المنوال, ونجد أعضاء آخرين يشاركوننا كل ما هو جديد  Quote from: Nalain420 on September 27, 2023, 03:38:33 PMإليكم أفضل المستخدمين في هذه القائمة:hugeblackmikeywithOmegaStarScreamلقد توقعت هذا بمشاركتى السابقة بموضوع سابق قبل أن أرى هذا الملخص, صراحة أعضاء نكن لهم كل الاحترام والتقدير, فهم أعمدة هذا القسم الرائع الذى تعلمنا منه الكثير وإكتسبنا منه صداقات كثيرة.نعم أتفق مع الأخ Ulven بأن فى المرة القادمة يرجى ترتيب القوائم لتبقى مرتبة من الأعلى للأسفل وهذا سيسهل عملية القراءةأتمنى التوفيق للجميع فى الإفادة والإستفادة. شكراً لكم",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nalain420",
      "created_time": "October 03, 2023, 12:13:32 PM",
      "body": "Quote from: albon on September 28, 2023, 06:28:13 PMلقد توقعت هذا بمشاركتى السابقة بموضوع سابق قبل أن أرى هذا الملخص, صراحة أعضاء نكن لهم كل الاحترام والتقدير, فهم أعمدة هذا القسم الرائع الذى تعلمنا منه الكثير وإكتسبنا منه صداقات كثيرة.نعم أتفق مع الأخ Ulven بأن فى المرة القادمة يرجى ترتيب القوائم لتبقى مرتبة من الأعلى للأسفل وهذا سيسهل عملية القراءةأتمنى التوفيق للجميع فى الإفادة والإستفادة. شكراً لكمشكرًا، \"albon أخي\" على تقديم الملاحظات. \"Ulven أخي\" قد أرشدني بالفعل حول كيفية إنشاء قائمة بالمستخدمين الذين يرسلون ويستلمون نقاط الجدارة، موضحًا من قام بإرسال كمية معينة إلى من. يجب أن تتم فرز هذه القائمة من الأعلى إلى الأسفل، وأرغب في إنشاء بعض الإحصائيات المفيدة منها. كنت لا أعرف هذا من قبل، وأرى بعض النقائص في ملخص الجدارة الذي أنشأته للمرة الأولى. لقد مر شهر سبتمبر، ولقد بدأت العمل على ذلك. إن شاء الله، سأشارك أنشطتي بعدية وملخص الجدارة المحدث معكم قريبًا. شكرًا لكم جميعًا على دعمكم وتحفيزكم.على أي حال، تهانينا \"albon أخي\" على تحقيق إنجاز جديد بلغ \"1100\" نقطة جدارة. آمل أن نصل قريبًا إلى \"1200\" ونتغلب على الأهداف التالية أيضًا.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Trawda",
      "created_time": "October 04, 2023, 03:04:36 AM",
      "body": "عمل جيد أخي أحسنت. لدي ملاحظة أيضا، لو أمكن إضافة رابط الملف الشخصي لكل عضو في القائمة سيكون أفضل لسهولة الوصول إلى ملفه الشخصي. أيضا لاحظت وجود أسماء غريبة في القائمة لم أجد لهم أي مشاركة في القسم العربي ولا أعرف إن كانوا عرب مثل: Quote from: Nalain420 on September 27, 2023, 03:38:33 PMقائمة الذين استلموا الجدارة:Code:DIA7 [4]JazzyJester [4]لم أطلع على كل مشاركات القسم العربي بالطبع لكنني قرأت الكثير من المواضيع ولم أجد هذه الأسماء في أي مشاركة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nalain420",
      "created_time": "October 04, 2023, 09:45:36 AM",
      "body": "Quote from: Trawda on October 04, 2023, 03:04:36 AMعمل جيد أخي أحسنت. لدي ملاحظة أيضا، لو أمكن إضافة رابط الملف الشخصي لكل عضو في القائمة سيكون أفضل لسهولة الوصول إلى ملفه الشخصي. أيضا لاحظت وجود أسماء غريبة في القائمة لم أجد لهم أي مشاركة في القسم العربي ولا أعرف إن كانوا عرب مثل: Quote from: Nalain420 on September 27, 2023, 03:38:33 PMقائمة الذين استلموا الجدارة:Code:DIA7 [4]JazzyJester [4]لم أطلع على كل مشاركات القسم العربي بالطبع لكنني قرأت الكثير من المواضيع ولم أجد هذه الأسماء في أي مشاركة. شكرًا جزيلاً، Trawda أخي، على تقديم الملاحظات والإرشاد.لقد قدمت لي فكرة جيدة لإضافة رابط ملف تعريف كل مستخدم إلى القائمة، ولكنني لن أحتاج إلى استخدام 'إدراج الكود' لهذا الغرض. في هذا الكود، سيتم عرض أسماء المستخدمين وملفاتهم كنص فقط، دون أن يكونوا روابط قابلة للنقر. سأعمل على إعداد القائمة في أقرب وقت ممكن نظرًا لأن شهر سبتمبر قد مر بالفعل.عندما كنت أعد تقرير شهر أغسطس، قرأت أسماء هذين المستخدمين، ولكنني لم أتحقق من أي من مشاركاتهم. ومع ذلك، عندما تحققت من ملفاتهم الشخصية، اكتشفت أنهم أعضاء قدامى في مجتمعنا العربي ولم يعدوا نشطين هنا، ولكنهم تلقوا مكافآت في شهر أغسطس. سأريك ذلك.آمل أن يوضح ذلك الوضع. إذا كان لديك المزيد من الأسئلة أو تحتاج إلى مساعدة إضافية، فلا تتردد في طرحها.DIA7هذا منشور الأخ DIA7 في القسم العربي الذي تم منحه ميزة عليه:https://bitcointalk.org/index.php?topic=5358708.msg57881285#msg57881285JazzyJesterهذا منشور الأخ JazzyJester في القسم العربي الذي تم منحه ميزة عليه:https://bitcointalk.org/index.php?topic=3542656.msg62391376#msg62391376",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Trawda",
      "created_time": "October 04, 2023, 10:30:17 AM",
      "body": "Quote from: Nalain420 on October 04, 2023, 09:45:36 AM....شكرا لك أخي Nalain420 على التوضيح. بالنسبة للروابط الخاصة بتعريف المستخدمين في قائمة الذين استلموا الجدارة أتوقع أنه لا حاجة لكتابتها في كود يمكنك أن تكتبها مباشرة بهذه الطريقة أسهل، على سبيل المثال:   albon [24] يعني لا أرى حاجة لوضعها في كود ، لكن طبعا في النهاية أنت تفعل ما تراه مناسبا، وبالتوفيق لك على هذا المجهود الطيب.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}