{
  "id": "topic_5474196",
  "title": "SaepulMT",
  "author": "SaepulMT",
  "created_time": "November 15, 2023, 03:40:30 PM",
  "content": "Akhir-akhir ini banyak yang berbicara tentang Boikot produk termasuk Majelis Ulama Indonesia (MUI) .Yang membingungkan (MUI) sama sekali tidak pernah merilis daftar produk itu.Ada 30 negara yang bicara masalah ini . Boikot digadang-gadang menjadi bentuk dukungan nyata masyarakat terhadap para korban dari Palestina dalam krisis Gaza hingga saat ini. Serangan Israel ke Gaza sekarang sudah memasuki 40 hari dan belum menunjukkan tanda-tanda akan mereda. Hal ini mendorong munculnya berbagai aksi gerakan sosial di berbagai belahan dunia sebagai bentuk simpati terhadap para korban. Salah satu bentuk aksi solidaritas itu berupa boikot atau tidak membeli produk-produk dari perusahaan yang diduga berafiliasi terhadap Israel. Sejumlah produk barang dan jasa yang dinilai mendukung kubu Israel menjadi sasaran boikot.Sumber1.Apakah agan-agan semua mendukung gerakan Boikot ini?2.Apa dampak Boikot pada ekonomi Indonesia?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474196",
  "comments": [
    {
      "author": "pusaka",
      "created_time": "November 15, 2023, 06:05:53 PM",
      "body": "Gerakan boikot ini pasti akan menimbulkan pro kontra dikalangan masyarakat, terlebih bagi mereka yang mendukung Israel dalam konflik yang terjadi, karena tidak bisa dipungkiri bahwa akan selalu ada pendukung baik itu Palestina dan Israel.Untuk saya pribadi, saya menilai gerakan ini adalah sebuah gerakan kecil yang bisa dilakukan oleh simpatisan yang membela Palestina. Saya tidak akan mempermasalahkan gerakan ini, pasalnya mengikuti atau tidaknya itu akan dikembalikan pada kita sendiri atau dengan kata lain itu menjadi sepenuhnya hak kita. Namun jangan sampai kita salah mengartikan gerakan ini, seperti merusak dan menggruduk produk atau toko yang di boikot misalnya. Cukup untuk tidak membeli dan memakai saja itu adalah hal yang terbaik jika kita mengikuti gerakan ini.Untuk perekonomian, saya tidak bisa mengatakan dampaknya secara pasti, karena saya yakin tidak semua orang mengikuti gerakan ini, entah itu angkanya lebih besar atau lebih kecil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "topbitcoin",
      "created_time": "November 15, 2023, 07:57:33 PM",
      "body": "Quote from: SaepulMT on November 15, 2023, 03:40:30 PMAkhir-akhir ini banyak yang berbicara tentang Boikot produk termasuk Majelis Ulama Indonesia (MUI) .Yang membingungkan (MUI) sama sekali tidak pernah merilis daftar produk itu.MUI bukan hanya melarang dan menyuarakan boikot terhadap produk Israel, namun MUI juga mengharamkan semua produk asal Israel. Dan satu hal yang menjadi candaan saya kepada MUI, kalau memang MUI mengaharamkan segala produk yang berasal dari Isarel, mengapa tidak mereka mendorong hal ini sampai pada kementriaan Agama dan menyuruh Kementriaan Agama untuk mencabut setifikasi dan lisensi halal terhadap produk-produk yang berasal dari Israel.Quote1.Apakah agan-agan semua mendukung gerakan Boikot ini?2.Apa dampak Boikot pada ekonomi Indonesia?Saya akan menjawab kedua pertanyyan tersebut sekaligus, karena pertanyaan tersebut saling berhungungan.Berbicara Boikot produk Israel, ini merupakan seruan yang kesekian kalinya dan tidak bisa menapikan bahwa dalam seruan boikot ini ada beberapa pihak yang menungganginya. Saya berpendapat demikian, karena produk yang coba dioboikot itu bukan hanya produk asli Israel akan tetapi produk yang dianggap terafiliasi dengan Israel dan pro terhadap Israel juga ikut terboikot. Dan yang menunggangi aksi ini adalah kompotitor atau pesaing bisnis dari produk-produk yang diboikot.Dan tentunya hal ini sedikit besarnya akan merugikan perekonomian Indonesi, selain karena akan semakin betambahnya jumlah pengangguran, akan tetapi pendapatan pajak negara indonesia juga akan berkurang. Dan yang dirugikan juga bukan hanya negara akan tetapi supermarket dan warung-warung kecil juga akan merasakan dampaknya, karena produk yang telah mereka beli tidak laku dipasaran. Untuk sementara waktu Indonesia memang mengalami kerugian, akan tetapi dengan seruan boikot juga dapat memberikan dampak positif bagi perekonomian indonesia untuk kedepanya, karena dengan seruan boikot ini maka masyarakat akan lebih memilih produk lain, termasuk akan lebih memilih produk yang dihasilkan didalam negeri, sehingga hal ini akan mendorong perusahaan-perusahaan  asli indonesia untuk lebih maju dan berkembang lagi. Sebagai contohnya, dengan seruan boikot terhadap KFC, maka hal ini dapat memungkin pelanggan KFC akan beralih dan memilih CFC sebagai penggantinya. Dan perlu kita ketahui juga, bahwa CFC ini merupakan Perusahaan asli Indonesia.Dan saya mendukung hal ini, selain ini sebagai bentuk solidaritas kita terhadap perjuangan masyarakat Palestrina, akan tetapi nantinya hal ini juga dapat mendorong laju perekonomian dalam negeri.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "November 15, 2023, 09:44:42 PM",
      "body": "Quote from: pusaka on November 15, 2023, 06:05:53 PMGerakan boikot ini pasti akan menimbulkan pro kontra dikalangan masyarakat, terlebih bagi mereka yang mendukung Israel dalam konflik yang terjadi, karena tidak bisa dipungkiri bahwa akan selalu ada pendukung baik itu Palestina dan Israel.Untuk saya pribadi, saya menilai gerakan ini adalah sebuah gerakan kecil yang bisa dilakukan oleh simpatisan yang membela Palestina. Saya tidak akan mempermasalahkan gerakan ini, pasalnya mengikuti atau tidaknya itu akan dikembalikan pada kita sendiri atau dengan kata lain itu menjadi sepenuhnya hak kita. Namun jangan sampai kita salah mengartikan gerakan ini, seperti merusak dan menggruduk produk atau toko yang di boikot misalnya. Cukup untuk tidak membeli dan memakai saja itu adalah hal yang terbaik jika kita mengikuti gerakan ini.Untuk perekonomian, saya tidak bisa mengatakan dampaknya secara pasti, karena saya yakin tidak semua orang mengikuti gerakan ini, entah itu angkanya lebih besar atau lebih kecil.sebenarnya MUI perlu mengkaji dampak ekonomi indonesia pada keputusan fatwa haram yang mereka berikan pada produk2 yang terindikasi pendukung israel, jangan sampai fatwa haram yang mereka keluarkan malah menjadi boomerang untuk ekonomi indonesia, apalagi indonesia merupakan salah satu negara dengan pasar terbaik untuk produk yang berasal dari amerika serikat seperti KFC - MCD - Starbuck dna lain sebagainya, jika pemboikotan terus berlangsung dalam waktu lama maka bisa di pastikan akan lebih banyak pekerja yang di PHK dan bakal ada banyak pedagang yang rugi karena produk yang mereka jual tidak laku.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tuturtinular",
      "created_time": "November 15, 2023, 10:11:38 PM",
      "body": "Quote from: SaepulMT on November 15, 2023, 03:40:30 PM1.Apakah agan-agan semua mendukung gerakan Boikot ini?2.Apa dampak Boikot pada ekonomi Indonesia?Kalo saya pribadi mendukung gerakan boikot ini karena jika negara kita memboikot produk dari israel maka mungkin mereka akan di rugikan secara finansial dan hal ini akan mengintimidasi israel dan semoga bisa membuat negara israel kehilangan salah satu sumber devisa mereka. Tanpa logostik yang cukup maka perang akan dihentikanTapi saya tidak tahu seberapa pengaruh bagi israel jika negara kita memboikot produk mereka, sebaiknya kita menganalisanya, jika tidak memiliki pengaruh besar maka gerakan boikot akan sia sia, juga harus menghitung kerugian atau dampak bagi negara kita sendiri. Jangan sampai seperti apa yang terjadi pada eropa saat mereka memboikot minyak rusia, karena malah berdampak negatif bagi negara negara eropa yang menggantungkan pasokan minyak dari rusia",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "November 16, 2023, 04:10:06 AM",
      "body": "Pendapat orang tentang hal ini tentu beragam, ada yang berpendapat bahwa sah-sah saja untuk membeli produk-produk tersebut mengingat bahwa dahulu nabi ketika berperang melawan persia, yahudi, dll, para sahabat dan pengikut masih melakukan perdagangan dengan bangsa-bangsa tersebut. Ada juga yang berpendapat bahwa boikot produk israel itu diperlukan untuk melemahkan ekonomi negara tersebut yang dimana akan berimbas kepada banyak sektor di negara tersebut, khususnya sektor militer.Namun aku pribadi lebih mengikuti pendapat pertama bahwa melakukan pembelian produk-produk buatan Unilever, dll, itu tidak masalah, tapi kalau bisa jumlahnya harus dikurangi, karena kita tidak bisa juga melakukan boikot sepenuhnya karena masih banyak saudara kita yang bekerja di perusahaan tersebut dan kasihan jika mereka terkena PHK. Dan yang paling penting adalah melakukan kecaman terhadap aksi israel dan kalau bisa melakukan donasi melalui Baznas yang dimana merupakan lembaga resmi pemerintah dan mempunyai akses langsung ke Palestina.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "baenschi78",
      "created_time": "November 16, 2023, 04:55:33 AM",
      "body": "Quote from: SaepulMT on November 15, 2023, 03:40:30 PM1.Apakah agan-agan semua mendukung gerakan Boikot ini?Ane support gerakan ini. Kalo dipikir-pikir, boikot ini sebenarnya kesempatan yang bagus buat produk lokal supaya lebih dikenal dan supaya lebih banyak warga yang sadar juga kalo ada banyak produk lokal yang kualitasnya setara dengan produk luar. Kalo bisa ini dibiasakan terus jangan hanya dijadikan trend semata, sampai benar-benar produk lokal menang telak lawan produk luar.Kalo produk lokal naik otomatis lapangan pekerjaan juga jadi terbuka yang di PHK dari produk luar bisa pindah ke punya lokal jadi seharusnya bisa di seimbangkan. Belajar dari perang rusia-ukraina. Ketika brand terkenal seperti makdonal, setarbak, dkk hengkang dari rusia, disitulah lokal masuk buat menguasai dan lebih dikenal masyarakat.Tapi kalo hanya trend sementara ya ga efektif boikot yang digaungkan MUI.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flower12",
      "created_time": "November 16, 2023, 08:56:57 AM",
      "body": "Quote from: topbitcoin on November 15, 2023, 07:57:33 PMQuote from: SaepulMT on November 15, 2023, 03:40:30 PMAkhir-akhir ini banyak yang berbicara tentang Boikot produk termasuk Majelis Ulama Indonesia (MUI) .Yang membingungkan (MUI) sama sekali tidak pernah merilis daftar produk itu.MUI bukan hanya melarang dan menyuarakan boikot terhadap produk Israel, namun MUI juga mengharamkan semua produk asal Israel. Dan satu hal yang menjadi candaan saya kepada MUI, kalau memang MUI mengaharamkan segala produk yang berasal dari Isarel, mengapa tidak mereka mendorong hal ini sampai pada kementriaan Agama dan menyuruh Kementriaan Agama untuk mencabut setifikasi dan lisensi halal terhadap produk-produk yang berasal dari Israel.Sebenarnya bukan berfokus pada produk asal Israelnya, namun berdasarkan produk yang pemiliknya terang terangan mendukung Israel, baik itu mendukung secara dana, makanan atau hal lainnya.Untuk bertindak lebih jauh seperti itu, seperti yang anda katakan mengenai sertifikasi dan lisensi halal itu harus melalui pengkajian yang sangat panjang, terlebih saya yakin ini bersifat sementara. Kebetulan sebelumnya saya menonton podcast dari para tokoh influencer, salah satunya saya tonton yang ada di channel youtube Dr. Reechard dan Deddy C. Di dalam podcast Dr. Reechard dia juga membahas dan bertanya apakah ini bersifat sementara atau selamanya? dan salah satu narasumber yaitu Ustadz Denis Lim menjawab ini bersifat sementara. Jadi untuk mencabut sertifikat dan lisensi itu juga perlu mempertimbangkan dari berbagai aspek.Nah mengenai pemboikotan yang sekarang disuarakan, sebenarnya pihak yang mengeluarkan ini juga mendorong untuk masyarakat menggunakan produk lokal atau produk dalam negeri. Secara tidak langsung itu juga menjadi solusi yang mereka tawarkan dan juga menguntungkan untuk produk dalam lokal juga.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "strunberg",
      "created_time": "November 16, 2023, 09:22:57 AM",
      "body": "Quote from: topbitcoin on November 15, 2023, 07:57:33 PMSaya akan menjawab kedua pertanyyan tersebut sekaligus, karena pertanyaan tersebut saling berhungungan.Berbicara Boikot produk Israel, ini merupakan seruan yang kesekian kalinya dan tidak bisa menapikan bahwa dalam seruan boikot ini ada beberapa pihak yang menungganginya.Kadang niat yang baik bisa saja ditunggangi oleh orang jahat yang sarat akan kepentingan. Hal ini sesuai dengan yang agan@topbitcoin katakan, boikot produk seperti ini bisa ditunggangi oleh mereka yang merupakan kompetitor produk yang sama. Bahkan ada yang sampai jadi korban fitnah bilangnya pro israel padahal mah tidak ada afliasinya dengan perusahaan Israel.Namun terlepas dari itu semua, kembali ke pertanyaan OP bahwa ane juga sangat mendukung gerakan boikot produk israel ini. Tapi ane tidak juga serta merta terlalu naif sampai membuang apa-apa saja yang telah ane beli yang merupakan produk Israel, seperti yang sempat viral beberapa waktu lalu. Boikot yang ane lakukan adalah dengan cara semaksimal mungkin mengurangi penggunaan dan ketergantungan terhadap produk-produk israel. Hal yang paling gampang seperti tidak lagi berbelanja di KFC atau McD. Betul hal ini bakal berdampak bagi teman-teman kita yang sedang bekerja di sana. Tapi mau tidak mau ini harus tetap ane lakukan. Lalu bila ada seseorang yang bilang kayak \"emangnya ngaruh uang kamu yang sedikit itu ke mereka?\". Mungkin tidak bakal berpengaruh. Tapi bagi ane sebuah prinsip dan komitmen itu lebih penting dari apapun. Dan yang lebih penting ini akan menunjukkan di pihak mana ane berpihak,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arufox",
      "created_time": "November 16, 2023, 10:32:35 AM",
      "body": "Kalau menurut saya tergantung produk apa yang mau diboikot. Jika yang diboikot itu berupa produk semi konduktor, dan pesawat serta alutista lainnya itu sangat berpengaruh besar. Karena Amerika dan Israel mendapatkan penghasilan terbanyak didapat dari pengembangan chip semi konduktor beserta pesawat baik untuk pesawat komersil maupun pesawat tempur.Yang jadi masalahnya adalah apakah warga negara kita siap berhenti bepergian menggunakan pesawat berjenis Boeing/Airbus ? Saya rasa tidak mungkin. Karena komponen beserta produk tersebut sangat berpengaruh terhadap aktivitas kita sehari-hari.Solusinya apa ? Ya benar, Boikot yang bisa mereka pakai. Seperti boikot produk makanan olahan, makanan siap saji, dan lain sebagainya. Selain harapannya bisa memutuskan aliran dana ke luar negeri juga menjadi kesempatan pengusaha lokal untuk ujuk gigi agar masyarakat bisa membeli produk makanan dalam negeri sekaligus membuka kesempatan lapangan kerja baru.Tapi apakah boikot terhadap produk-produk makanan luar negeri tersebut dikatakan efektif ? Ya tidak ngaruh banget, karena dari segi pemungutan pajak saja tidak sebesar produk semikonduktor dan pesawat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MiauKitchen",
      "created_time": "November 17, 2023, 07:19:42 AM",
      "body": "Quote from: pusaka on November 15, 2023, 06:05:53 PMGerakan boikot ini pasti akan menimbulkan pro kontra dikalangan masyarakat, terlebih bagi mereka yang mendukung Israel dalam konflik yang terjadi, karena tidak bisa dipungkiri bahwa akan selalu ada pendukung baik itu Palestina dan Israel.Untuk saya pribadi, saya menilai gerakan ini adalah sebuah gerakan kecil yang bisa dilakukan oleh simpatisan yang membela Palestina. Saya tidak akan mempermasalahkan gerakan ini, pasalnya mengikuti atau tidaknya itu akan dikembalikan pada kita sendiri atau dengan kata lain itu menjadi sepenuhnya hak kita. Namun jangan sampai kita salah mengartikan gerakan ini, seperti merusak dan menggruduk produk atau toko yang di boikot misalnya. Cukup untuk tidak membeli dan memakai saja itu adalah hal yang terbaik jika kita mengikuti gerakan ini.Untuk perekonomian, saya tidak bisa mengatakan dampaknya secara pasti, karena saya yakin tidak semua orang mengikuti gerakan ini, entah itu angkanya lebih besar atau lebih kecil.Benar sekali mas saya setuju dengan pendapat mas.Benar-benar pro dan kontra sih,tapi ya itu menurut saya pribadi kita cukup tidak membeli atau memakai produk nya israel.Kalau menurut saya soal perekonomian,jika memang benar adanya produk israel harus di musnahkan menurut ku itu pasti akan berdampak pada perekonomian,soalnya kan Indonesia juga pasti dapat keutungan dari adanya pabrik-pabrik,terus kan yang kerja dipabrik juga pasti yang kerjanya orang Indonesia jika pada d phk kan udah pasti ekonominya terganggu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dewiana",
      "created_time": "November 17, 2023, 03:27:19 PM",
      "body": "Quote from: baenschi78 on November 16, 2023, 04:55:33 AMQuote from: SaepulMT on November 15, 2023, 03:40:30 PM1.Apakah agan-agan semua mendukung gerakan Boikot ini?Ane support gerakan ini. Kalo dipikir-pikir, boikot ini sebenarnya kesempatan yang bagus buat produk lokal supaya lebih dikenal dan supaya lebih banyak warga yang sadar juga kalo ada banyak produk lokal yang kualitasnya setara dengan produk luar. Kalo bisa ini dibiasakan terus jangan hanya dijadikan trend semata, sampai benar-benar produk lokal menang telak lawan produk luar.Kalo produk lokal naik otomatis lapangan pekerjaan juga jadi terbuka yang di PHK dari produk luar bisa pindah ke punya lokal jadi seharusnya bisa di seimbangkan. Belajar dari perang rusia-ukraina. Ketika brand terkenal seperti makdonal, setarbak, dkk hengkang dari rusia, disitulah lokal masuk buat menguasai dan lebih dikenal masyarakat.Tapi kalo hanya trend sementara ya ga efektif boikot yang digaungkan MUI.Secara pribadi saya ane mendukung terhadap pembaikotan produk israel walaupun tidak berdampak secara umum terhadap negara isarel tapi paling tidak kita telah melakukan hal-hal kecil demi membela negara palestina, saat ini konflik dinegara tersbut banyak korban anak-anak kecil yang tidak bersalah. secara global produk-produk israel tergolong bagus dan mewah secara kualitas, termasuk kosmetik dirumah-rumah kecantikan banyak memakai pruduk israel, dengan pembaikotan maka lama-lama masyarakat akan sadar dan terbiasa sehingga nantinya juga akan beralih ke produk lainnya dan tidak ketergantungan lagi dengan produk israel,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Moneyprism",
      "created_time": "November 17, 2023, 09:26:55 PM",
      "body": "memboikot produk2 pendukung israel sebenarnya sudah beberapa kali terjadi namun tentu saja itu tidak akan berjalan efektif karena di negara kita saja contohnya, ada PT yang menjadi penganggung jawab franchise produk luar di sini maka itu boikot yang terjadi tidak akan tepat sasaran.memang dunia saat ini cukup miris dengan kondisi perang israel - palenstina namun lebih baik kita mementingkan para pekerja dari perusahaan2 tersebut yang ada di indonesia ini, ada berapa banyak perut yang harus di kasih makan, terdengar egois sih namun mementingkan warga sendiri ketimbang warga negara lain akan lebih baik.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "November 18, 2023, 12:00:16 AM",
      "body": "Quote from: SaepulMT on November 15, 2023, 03:40:30 PMAkhir-akhir ini banyak yang berbicara tentang Boikot produk termasuk Majelis Ulama Indonesia (MUI) .Yang membingungkan (MUI) sama sekali tidak pernah merilis daftar produk itu.Ane juga pernah denger ini dan bahkan dapat pesan berantai (yang katanya dari MUI) daftar nama produk buatan israel, kabarnya itu Hoax, tapi MUI tetap menyarankan (tanpa list produk) untuk memboikotnya. Masalah boikot produk israel, kalau ane kaji lebih dalam, produk kayak MCD, KFC, Unilever dsb itu produk buatan Amerika, bukan made in israel. Harusnya jika mau bikin himbauan, harus lebih diperjelas kalimatnya semisal; Boikot produk pro israel, justru itu lebih benar, produk amerika, jerman dan negara eropa yang men-support Israel diboikot semua, karena mereka inilah yang menyuplai senjata, dan uang untuk israel dalam menginvasi palestina.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GoldMagic",
      "created_time": "November 18, 2023, 04:15:27 AM",
      "body": "Quote from: Moneyprism on November 17, 2023, 09:26:55 PMmemang dunia saat ini cukup miris dengan kondisi perang israel - palenstina namun lebih baik kita mementingkan para pekerja dari perusahaan2 tersebut yang ada di indonesia ini, ada berapa banyak perut yang harus di kasih makan, terdengar egois sih namun mementingkan warga sendiri ketimbang warga negara lain akan lebih baik.Iya juga sih,simpang siur sih kalau membahas tentang konplik israel-palestina ini,menurut saya percuma sih kalau cuma memboikot produk israel kalau pabriknya masih ada,tapi di sisi lain di pabrik itu juga banyak warga negara Indonesia yang berkerja,jika si pabrik itu ditutup bagai mana nasib para pekerja yang menycari napkah,sedangkan di waktu-waktu saat ini cari kerja itu susah.Saya juga kemarin-kemarin lihat berita di tv ada beberapa negara di arab seperti aljazaira dan lebanon dllnya meminta pemeritah arab untuk menyetop minyak(seperti bahan bakar untuk peledak gituh)tapi pemerintah arab menolak,tentunya soal penolakan itu cukup banyak pertimbangan.(Untuk lebih detail nya boleh google aja,tentang penolakan arab).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "November 18, 2023, 05:06:33 AM",
      "body": "Kalau berbicara dalam konteks perdagangan lintas batas di jaman modern ini, boikot itu sulit diterapkan. Ane kasih contoh misalnya produsen kedelai itu adalah Amerika Serikat. Kedelai yang ada di Indonesia itu kebanyakan impor dari sana. Trus gegara mo boikot agan jadi ga beli tempe, tahu, kecap, dll. ?? Itu malah merugikan diri sendiri dari pada negara tsb. Trus yang pro AS & Israel itu negara-negara yang adalah produsen barang-barang yang penting mulai dari chip elektronik sampai sosmed kek Instagram. Belom lagi pemilik bisnis di negara yang pro AS & Israel belum tentu mendukung serangan Israel ke Gaza... Belom lagi karyawan dan bahan baku produk tsb bisa jadi kebanyakan lokal.Kalau terkait mendukung atau tidak pemboikotan itu kembali ke hak masing-masing. Di sini ane cuma bisa meramalkan kalau \"it doesn't work.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mamesso",
      "created_time": "November 18, 2023, 05:11:31 AM",
      "body": "Quote from: SaepulMT on November 15, 2023, 03:40:30 PM1.Apakah agan-agan semua mendukung gerakan Boikot ini?Saya pribadi sangat mendukung gerakan Boikot ini dalam beberapa aspek.1. Israel telah melakukan pelanggaran HAM berat yang mengakibatkan wanita dan anak-anak Palestina terbunuh akibat agresinya ke Palestina, jelas ini kejahatan perang dan kejahatan terhadap kemanusiaan. 2. Membuka mata Israel bahwa yang mereka lakukan tidak dapat diterima oleh sebagian besar Negara lain yang masih menjunjung tinggi nilai kemanusiaan, gerakan pemboikotan produk Israel mulai berdampak buruk terhadap saham mereka. 3. Rasa kemanusiaan, anak-anak Palestina terpapar peristiwa traumatis akibat perang yang berkepanjangan. Sejumlah besar anak-anak hidup dalam kondisi kekerasan akibat pembunuhan dan pemboman dan penembakan yang melukai dan membunuh anggota keluarga atau orang yang mereka cintai.Tiga aspek ini berdasarkan pandangan saya sendiri terhadap apa yang dialami Rakyat Palestina saat ini, banyak nyawa yang tidak berdosa melayang termasuk wanita dan anak-anak. Jadi, dengan mendukung gerakan Boikot pada produk Israel dan produk yang mendukung Israel sebagai rasa kemanusiaan atas pelanggaran HAM yang terjadi di Palestina.Quote from: SaepulMT on November 15, 2023, 03:40:30 PM2.Apa dampak Boikot pada ekonomi Indonesia?Menurut saya gerakan boikot terhadap produk Israel bisa dijadikan sebagai peluang positif untuk memperkuat industri dalam negeri. Gerakan pemboikotan terhadap produk Israel secara tidak langsung memberi peluang buat produk lokal untuk melebarkan sayapnya, selama ini banyak produk lokal yang kalah bersaing dengan produk Israel akibat (Brand belum cukup dikenal) bisa dijadikan alternatif bagi masyarakat untuk beralih ke produk buatan Indonesia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SaepulMT",
      "created_time": "November 18, 2023, 09:53:01 AM",
      "body": "Quote from: Renampun on November 15, 2023, 09:44:42 PMQuote from: pusaka on November 15, 2023, 06:05:53 PM~snipsebenarnya MUI perlu mengkaji dampak ekonomi indonesia pada keputusan fatwa haram yang mereka berikan pada produk2 yang terindikasi pendukung israel, jangan sampai fatwa haram yang mereka keluarkan malah menjadi boomerang untuk ekonomi indonesia, apalagi indonesia merupakan salah satu negara dengan pasar terbaik untuk produk yang berasal dari amerika serikat seperti KFC - MCD - Starbuck dna lain sebagainya, jika pemboikotan terus berlangsung dalam waktu lama maka bisa di pastikan akan lebih banyak pekerja yang di PHK dan bakal ada banyak pedagang yang rugi karena produk yang mereka jual tidak laku.Ya memang dampaknya akan menjadi luas seperti PHK karyawan yang bekerja di produk tersebut, yang ujung-ujung merugikan warga Indonesia sendiri. Tapi disamping itu harus menentukan sikap bahwak kita ada di pihak Palestina. Indonesia memiliki hutang pada Palestina karena mereka adalah Negara pertama yang mengakui Indonesia merdeka. Saya pikir aksi ini harus dilakukan setidaknys sampai Israel melakukan genjatan senjata di Gaza.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Juse14",
      "created_time": "November 18, 2023, 06:28:27 PM",
      "body": "Quote from: SaepulMT on November 18, 2023, 09:53:01 AMQuote from: Renampun on November 15, 2023, 09:44:42 PMQuote from: pusaka on November 15, 2023, 06:05:53 PM~snipsebenarnya MUI perlu mengkaji dampak ekonomi indonesia pada keputusan fatwa haram yang mereka berikan pada produk2 yang terindikasi pendukung israel, jangan sampai fatwa haram yang mereka keluarkan malah menjadi boomerang untuk ekonomi indonesia, apalagi indonesia merupakan salah satu negara dengan pasar terbaik untuk produk yang berasal dari amerika serikat seperti KFC - MCD - Starbuck dna lain sebagainya, jika pemboikotan terus berlangsung dalam waktu lama maka bisa di pastikan akan lebih banyak pekerja yang di PHK dan bakal ada banyak pedagang yang rugi karena produk yang mereka jual tidak laku.Ya memang dampaknya akan menjadi luas seperti PHK karyawan yang bekerja di produk tersebut, yang ujung-ujung merugikan warga Indonesia sendiri. Tapi disamping itu harus menentukan sikap bahwak kita ada di pihak Palestina. Indonesia memiliki hutang pada Palestina karena mereka adalah Negara pertama yang mengakui Indonesia merdeka. Saya pikir aksi ini harus dilakukan setidaknys sampai Israel melakukan genjatan senjata di Gaza.Kerugian yang dialami hanyalah sementara waktu saja, karena disisi lain juga hal ini memberikan dampak positif untuk jangka panjangnya.Jika boikot produk yang terafiliasi dengan negara Israel ini terus berlanjut dalam jangka yang cukup panjang. Maka disisi lain perusahaan-perusahaan yang ada dalam negeri, yang bersaing dengan produk yang sama akan sangat diuntungkan. Karena perlahan masyarakat Indonesia akan beralih untuk menggunakan, memakai, mengonsumsi dan membeli produk yang diproduksi dalam negeri. Sehingga permintaan barang/produk yang diproduksi di dalam negeri akan mengalami peningkatan dan hal ini dapat memungkinkan produk dalam negeri akan diminati oleh masyarakat. Dan tentunya hal ini akan mendorong perusahaan yang ada dalam negeri akan mengalami pertumbuhan dan kemajuan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nurilham",
      "created_time": "November 18, 2023, 09:30:28 PM",
      "body": "Quote from: SaepulMT on November 15, 2023, 03:40:30 PM1.Apakah agan-agan semua mendukung gerakan Boikot ini?Sebagai umat muslim dan individu yang menentang penjajahan, saya mendukung gerakan boikot. Yang perlu diboikot bukan hanya produk Israel, tapi juga produk Amerika Serikat. Kita tau bahwa Amerika Serikat juga berperan dalam penjajahan Israel di Palestina. Masalah dampaknya seberapa besar, saya kira bukan poin utamanya. Setidaknya kita sudah berusaha untuk melakukan apa yang kita bisa. Saya yakin jika boikot ini dilakukan terus menerus, akan berdampak cukup signifikan untuk jangka panjang.Quote from: SaepulMT on November 15, 2023, 03:40:30 PM2.Apa dampak Boikot pada ekonomi Indonesia?Tidak akan ada masalah dengan ekonomi Indonesia. Yang perlu dipertanyakan yaitu bagaimana dengan perekonomian negara-negara yang produknya diboikot oleh banyak negara di belahan dunia. Karena boikot ini sifatnya masif, mungkin saja ada pengaruh ke perekonomian mereka.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}