{
  "id": "topic_5461111",
  "title": "JamesDaniel90",
  "author": "JamesDaniel90",
  "created_time": "July 26, 2023, 01:55:44 PM",
  "content": "Hi all,There is a lot of hype currently on Youtube around Kaspa and just wondering why?It is pretty new having only been around for just over a year and it has pumped over 110% in the last 3 weeks.Anyone have any opinion on this? I am not going to buy now as it has pumped but may do if it has a pullback.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461111",
  "comments": [
    {
      "author": "_act_",
      "created_time": "July 26, 2023, 02:14:47 PM",
      "body": "It has a marketcap of $785,267,106. It also has a very high trading volume. In marketcap comparison with other coins, it is ranked $57. I think that is impressive.But if bitcoin fall, altcoins too will fall more. But if you have money that you can afford to lose and gamble with it, you can buy the coin because if bitcoin get to $100000, this coin would have increased significantly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JamesDaniel90",
      "created_time": "July 26, 2023, 02:56:49 PM",
      "body": "Quote from: _act_ on July 26, 2023, 02:14:47 PMIt has a marketcap of $785,267,106. It also has a very high trading volume. In marketcap comparison with other coins, it is ranked $57. I think that is impressive.But if bitcoin fall, altcoins too will fall more. But if you have money that you can afford to lose and gamble with it, you can buy the coin because if bitcoin get to $100000, this coin would have increased significantly.I will wait a bit a bit longer before I start buying , maybe another 20% drop from current price. I would rather accumulate what I already have then start buying now as its near its all time high. I am just more curious as to what the hype is all about really.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "July 26, 2023, 04:00:39 PM",
      "body": "This is just my hunch as to the hype but people are probably hoping for this Kaspa to be the next Bitcoin since it seems to have adopted the POW protocol as well. I can't say much about their claim on no pre-mine or no central governance but I think their 1 block per second as a layer-1 is a hard sell. I guess there are people that buy into that.It hasn't been listed on Binance so that's probably something to look forward if you plan on buying this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "July 26, 2023, 04:16:18 PM",
      "body": "Quote from: JamesDaniel90 on July 26, 2023, 01:55:44 PMHi all,There is a lot of hype currently on Youtube around Kaspa and just wondering why?Most likely because it has just recently hit all time high and according to coinmarketcap it has gown +22631.53% in a year. That kind of massive growth can turn heads and peak interest. Not to mention people who have holded it a year are most likely millionaires now and can pay for more hype. Hype creates more hype. It already had a big pullback so growth seems healthy but i still wouldn't recommend buying now. Buying before the hype is smart. Now people are playing you to buy it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VFalcon",
      "created_time": "July 26, 2023, 07:07:16 PM",
      "body": "I've seen the youtube ads too, but I don't really trust it. I'm thinking of participating in fairspin web3quest, getting some money and investing it in the project",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "July 26, 2023, 07:43:23 PM",
      "body": "Quote from: VFalcon on July 26, 2023, 07:07:16 PM-snip-Ads don't matter. It's being published by the project, and your ads showing because you search about them they track your history search. That's why their project showing on your side, don't follow or enter with the price at the time already on the top (FOMO). Never, waiting a little support zone is also dangerous because there has some chance the price on (falling-knife) because people panic the price are getting down are the rally and make the price down more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "July 26, 2023, 08:56:00 PM",
      "body": "Quote from: JamesDaniel90 on July 26, 2023, 01:55:44 PMHi all,There is a lot of hype currently on Youtube around Kaspa and just wondering why?I have no idea about that but if it's being hyped there, you should make yourself secure from being hyped on it as well.Quote from: JamesDaniel90 on July 26, 2023, 01:55:44 PMIt is pretty new having only been around for just over a year and it has pumped over 110% in the last 3 weeks.Anyone have any opinion on this? I am not going to buy now as it has pumped but may do if it has a pullback. I think it's all due to the miners that have been supporting it. I have been seeing about people when asked what to mine, they're suggesting to do it with kaspa.But that's just a thought of mine and I have no idea what's happening around it but, that could be one reason behind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Billo_",
      "created_time": "July 26, 2023, 09:04:11 PM",
      "body": "It's not really good coin because it's just fun coin and we have already enough fun coin. More people will tend to buy Ethereum because of network effect and many new technologies are built on Ethereum, like today, Ethereum is even more advanced compared to Bitcoin already. We have too much coin on Coinmarketcap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "July 26, 2023, 09:33:23 PM",
      "body": "Quote from: Billo_ on July 26, 2023, 09:04:11 PMIt's not really good coin because it's just fun coin and we have already enough fun coin. More people will tend to buy Ethereum because of network effect and many new technologies are built on Ethereum, like today, Ethereum is even more advanced compared to Bitcoin already. We have too much coin on Coinmarketcap. If it is being hyped up, be very careful in touching the coin. Know the reason why they are going up again this time.Checking their site, it seems they are having developmental progress on this project. However, one should do their due diligence before buying one as you may be buying at its peak price.But comparing it with other alts, at least this one seems to be attracting some merchants as listed on their site - https://kaspa.org/all-listings/.As an investor, you need to dig more and not just browse the site. Better check their social media channels what they are up to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JamesDaniel90",
      "created_time": "July 27, 2023, 08:47:02 AM",
      "body": "Quote from: Yogee on July 26, 2023, 04:00:39 PMThis is just my hunch as to the hype but people are probably hoping for this Kaspa to be the next Bitcoin since it seems to have adopted the POW protocol as well. I can't say much about their claim on no pre-mine or no central governance but I think their 1 block per second as a layer-1 is a hard sell. I guess there are people that buy into that.It hasn't been listed on Binance so that's probably something to look forward if you plan on buying this.Yes I have seen a few compare Kaspa to Bitcoin but don't buy it right now.It currently has a $750m market cap and that is too high for me to get involved I will wait till it falls in price or just continue to DCA into those I already hold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "welshhana",
      "created_time": "July 27, 2023, 10:53:09 AM",
      "body": "I agree, there's much hype around the project, but I follow them for really long time and there's nothing that bothers me. Everything is transparent, great communication with audience, they provide any information you ask. I admire them!Comparing to other similar projects, this one is the only one worth attention, in my humble opinion",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SharonC",
      "created_time": "July 27, 2023, 11:39:59 AM",
      "body": "Quote from: welshhana on July 27, 2023, 10:53:09 AMI agree, there's much hype around the project, but I follow them for really long time and there's nothing that bothers me. Everything is transparent, great communication with audience, they provide any information you ask. I admire them!Comparing to other similar projects, this one is the only one worth attention, in my humble opinionTotally agree with you! I was with the founders at blockchain summit, they are great guys and know what they do. Definitely highly recommended!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SharonC",
      "created_time": "July 28, 2023, 08:28:05 AM",
      "body": "Quote from: Billo_ on July 26, 2023, 09:04:11 PMIt's not really good coin because it's just fun coin and we have already enough fun coin. More people will tend to buy Ethereum because of network effect and many new technologies are built on Ethereum, like today, Ethereum is even more advanced compared to Bitcoin already. We have too much coin on Coinmarketcap. Cannot agree with you. They have strong background behind their protocol. Ethereum is just more popular",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "juniperion",
      "created_time": "July 29, 2023, 08:42:12 PM",
      "body": "They claim solved trilemma of blockchain. Kaspa uses GhostDAG protocol and Nakamoto consensus. It has PoW. I wish I had know earlier.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}