{
  "id": "topic_5398489",
  "title": "Robert518",
  "author": "Robert518",
  "created_time": "May 13, 2022, 11:22:02 AM",
  "content": "LUNA went to ZERO, causing inflation. What is going to happen next? Is there any chance it will rise again in the near future?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398489",
  "comments": [
    {
      "author": "kidbounty",
      "created_time": "May 13, 2022, 11:32:53 AM",
      "body": "Quote from: Robert518 on May 13, 2022, 11:22:02 AMLUNA went to ZERO, causing inflation. What is going to happen next? Is there any chance it will rise again in the near future?won't. Everyone's trust has been lost in this project. I doubt if Luna can come back. it's just a matter of time until all exchanges are delisting luna at the same time, and binance already does. maybe next kucoin, huobi, or gate.io, there is definitely no hope for this project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "May 13, 2022, 11:53:02 AM",
      "body": "Quote from: Robert518 on May 13, 2022, 11:22:02 AMLUNA went to ZERO, causing inflation. What is going to happen next? Is there any chance it will rise again in the near future?This project is completely useless now.Due to this project now many people have bankrupt.No one had really seen such a day in their trading history when their asset falls to negative 90%. Really feeling sad for the people, who have invested in the coin and now in huge losses.With this we can say that the time of LUNA has also ended completely, as many exchanges are in a line to unlist the coin.Binance has successfully done it, next other big exchanges are working hard to get the coin out of their trading eco system.BTC's bearish market has really affected the whole altcoin's markets. Wishing for speedy recovery of the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "asriloni",
      "created_time": "May 13, 2022, 11:58:30 AM",
      "body": "I guess that if you can find another thread that was also talking about the same thing like this. There's no chance for luna to go up again. The only chance if luna will be going down even deeper from time to the another time. I think that if you have money that invested in this token in the past and you must let it go. So many people are feeling depressed after they were seeing their money gone to do kwon's wallet.  Do kwon is laughing for anyone who have been loosing in luna",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "May 13, 2022, 12:03:45 PM",
      "body": "Quote from: kidbounty on May 13, 2022, 11:32:53 AMQuote from: Robert518 on May 13, 2022, 11:22:02 AMLUNA went to ZERO, causing inflation. What is going to happen next? Is there any chance it will rise again in the near future?won't. Everyone's trust has been lost in this project. I doubt if Luna can come back. it's just a matter of time until all exchanges are delisting luna at the same time, and binance already does. maybe next kucoin, huobi, or gate.io, there is definitely no hope for this project.This incident caused us a lot of concern from being in the top position they are now in 1078th position in the Coingecko ranking and from having more than 100 exchanges now only traded in 2 exchanges https://www.coingecko.com/en/coins/terra-luna#marketsBut on Coinmarketap there are still a lot of markets for Luna but it will not be for long https://coinmarketcap.com/currencies/terra-luna/markets/If you're still holding Luna or have taken a chance by buying the crashes you're chances of recovery is not good it will be a steep climb back and I doubt if they can regain their position.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "koang",
      "created_time": "May 13, 2022, 01:01:05 PM",
      "body": "Looks like it's gonna be zero sooner.Binance delist LUNA futures pair and suspended spot trading for LUNA and UST.Who's gonna buy that huge supply now? I feel very sorry for them being victims, This shows how fast cryptocurrency can make or break someone. Crypto is very volatile and unpredictable",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rndairdrops",
      "created_time": "May 13, 2022, 01:04:50 PM",
      "body": "i think luna won't. focus on polkadot ecosystem",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fenican",
      "created_time": "May 13, 2022, 01:04:57 PM",
      "body": "It may trade in the Satoshi range for a time but there's no coming back from this. The supply increased to at least 170,000,000,000 coins as they were minted to try to reward UST buyers so there are an ENORMOUS number of LUNA out there to buy. People are buying 300,000 or 1,000,000 as a joke right now. I just picked up 300,000 for less than $10.So nobody who held it prior to the debacle is ever going to be made whole again unless the devs pull an Ethereum and rewrite the blockchain. That would royally piss off everyone who bought the coin recently though, and make the whole \"you'll get rewarded with LUNA for buying UST\" premise absurd.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$crypto$",
      "created_time": "May 13, 2022, 01:42:03 PM",
      "body": "Quote from: Nrcewker on May 13, 2022, 11:53:02 AMQuote from: Robert518 on May 13, 2022, 11:22:02 AMLUNA went to ZERO, causing inflation. What is going to happen next? Is there any chance it will rise again in the near future?This project is completely useless now.Due to this project now many people have bankrupt.No one had really seen such a day in their trading history when their asset falls to negative 90%. Really feeling sad for the people, who have invested in the coin and now in huge losses.With this we can say that the time of LUNA has also ended completely, as many exchanges are in a line to unlist the coin.Binance has successfully done it, next other big exchanges are working hard to get the coin out of their trading eco system.BTC's bearish market has really affected the whole altcoin's markets. Wishing for speedy recovery of the market.I assume the same that LUNA will never recover this has become a 100% decline in a short time, well many people went bankrupt in this coin even the former holders were very disappointed with what happened, the decline was so drastic that I guess all of them did not believe in it LUNA, what's more, astonishing is the current price of $0.00002196 it doesn't reach a penny really really bad.We can conclude from some statements that the Terra Luna project will never recover even though there is BTC support behind it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "May 13, 2022, 02:22:36 PM",
      "body": "Quote from: Robert518 on May 13, 2022, 11:22:02 AMLUNA went to ZERO, causing inflation. What is going to happen next? Is there any chance it will rise again in the near future?None.... or at least we can say that as long as they have no recovery plan that can change the sentiment of investors into this project, LUNA has no chance to recover at all.Every time I see the price of LUNA in Coingecko, I feel terribly sad for those investors who bought at the peak and those who gambled their money when it went down because for sure there are some investors who gamblers their money and tried to buy LUNA as well hoping that it will rebound at some point but it didn't went the way they wanted but it goes down even further.On Coingecko, it has almost 7M total supply and with that huge amount of supply it will be hard for it to go up especially now that there are doubts to the investors if they want to invest into it. On the other hand though, even though I believe that this will not recover anymore I still think that there is still a chance for it to recover (at least around 0.0000000001% chance). I mean anything is possible in crypto right and we've seen unexpected events happening like this one but even though this will recover, I doubt that it will reach 2 digit price again or even a dollar TBH.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "19Nov16",
      "created_time": "May 13, 2022, 02:37:15 PM",
      "body": "Coins that have dropped significantly like Luna will be difficult to get up again, I experienced several coins like Luna and still hold but there was no development, we better forget Luna and focus on investing in other coins that are more promising.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "May 13, 2022, 02:48:20 PM",
      "body": "It's dead, period. I don't think any coin that has dumped THIS much in this short of a period of time could ever recover really. EVEN if we do give them the chance to recover, just the fact that this dump happened (and that it affected a LOT of people immensely), I don't think there'd be a lot of people willing to invest/use the coin anymore. There'd always be that fear that they may be the \"next\" to be fooled and manipulated. That's just the label for the coin, only initially rich people would invest here if they ever want to anymore, I don't think you'd be seeing any more risk takers in the LUNA market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "safari88",
      "created_time": "May 13, 2022, 02:49:26 PM",
      "body": "Considering its current value right now, I don’t think that it will recover. Definitely not this very soon. And more than that, the confidence of the people with LUNA has also been destroyed due to this event, likewise, many exchanges are also removing it to their systems. In this fall, it will be hard for LUNA to get back up again for sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cdog",
      "created_time": "May 13, 2022, 03:00:16 PM",
      "body": "Quote from: LogitechMouse on May 13, 2022, 02:22:36 PMOn Coingecko, it has almost 7M total supply and with that huge amount of supply it will be hard for it to go up especially now that there are doubts to the investors if they want to invest into it. On the other hand though, even though I believe that this will not recover anymore I still think that there is still a chance for it to recover (at least around 0.0000000001% chance). I mean anything is possible in crypto right and we've seen unexpected events happening like this one but even though this will recover, I doubt that it will reach 2 digit price again or even a dollar TBH. You have to look at the order book that was sold on spot binance trades that there are tens of billions being sold now, so that means that the supply of Luna coins has increased, so it's better to avoid investing in Luna coins even though Luna/Busd has not been delisted in spot trading .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeffBrad12",
      "created_time": "May 13, 2022, 03:20:31 PM",
      "body": "It will not recover again. you should try to ask do kwon to dump all of its UST and then put the bitcoin reserved funds to the luna. Do kwon can pump it with billions of money that already acquired by him through dumping bitcoin in a loss. That stupid guy become the most wanted person int he world right now. If you a part of old investors of this token and you will not see your money again. The inflation was too high to be recovered again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MarjorieZimmermanGinger",
      "created_time": "May 13, 2022, 03:31:42 PM",
      "body": "Quote from: Robert518 on May 13, 2022, 11:22:02 AMLUNA went to ZERO, causing inflation. What is going to happen next? Is there any chance it will rise again in the near future?That is what is called a bigger coin affected by hype, this coin strengthens when the market is in a severe correction, then in the near future the luna completely loses its selling value, it is a strange thing for new coins to strengthen so quickly in these conditions, even potential coins like bitcoin actually corrected without pause in market conditions like this, let alone such a coin, I'm not sure luna will strengthen again at high prices, because now it is very difficult for luna to reach its highs",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "May 13, 2022, 03:45:23 PM",
      "body": "Quote from: Robert518 on May 13, 2022, 11:22:02 AMLUNA went to ZERO, causing inflation. What is going to happen next? Is there any chance it will rise again in the near future?Hopefully not. It died because it needed to. Because it was a major ponzi scheme. You don't want it to recover anyway... Trust me, shitcoin like LUNA should stay dead. It is best for everybody in the space. If it somehow gets recovered, then this time it will be a even bigger ponzi scheme and there will be even more victims. Check reddit, there are suicide posts everywhere. This shitcoin should never ever recover.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kurniawan05",
      "created_time": "May 13, 2022, 03:54:17 PM",
      "body": "I think it's almost impossible to happen, people have lost their trust in Luna and UST, besides that the market has started delisting and suspended trading on Luna and UST.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bonenx14",
      "created_time": "May 13, 2022, 03:56:42 PM",
      "body": "Quote from: mindrust on May 13, 2022, 03:45:23 PMHopefully not. It died because it needed to. Because it was a major ponzi scheme. You don't want it to recover anyway... Trust me, shitcoin like LUNA should stay dead. It is best for everybody in the space. If it somehow gets recovered, then this time it will be a even bigger ponzi scheme and there will be even more victims. Check reddit, there are suicide posts everywhere. This shitcoin should never ever recover.I hope that Luna coins should die and cannot be traded on any exchange, because if there is a temporary increase there will be many victims of losses from trading Luna shitcoins, any Luna coins should be removed from any trading list.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "May 13, 2022, 04:12:25 PM",
      "body": "Lately, there have been a lot of threads discussing LUNA, it doesn't stop because this is very crucial where the LUNA project is predicted to become another crypto competitor. But this is how the crypto world can all become untrustworthy if you are not vigilant. We have learned a lot that investing and trading in crypto should be as risky as possible. And from this LUNA incident, maybe in the future traders and investors can be more careful and not save too much money in altcoins in the long term. At least awareness about Bitcoin is a top priority.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}