{
  "id": "topic_5432995",
  "title": "tech30338",
  "author": "tech30338",
  "created_time": "January 04, 2023, 01:40:01 PM",
  "content": "Just make a basic how to get start in cryptocurrency for Trading, Wallet, Exchanges, Airdrops for newbies who always ask what to do, although its better to look and read them one by one on some most detail site, you can also look or read this if you want, I'm gonna give those who are most used if you are just getting started:To get started in TradingWe have pancakeswap and Uniswap these are Decentralized exchangeWhat wallet do you need for these?You will need metamask wallet these are set to your google chrome, or mozilla firefox browser dont forget to backup your Recovery Phrase, just in case then you can now connect to those decentralized exchange, note: for Pancakeswap(pancakeswap you should setup binance network in your metamask(https://metamask.io/)For bitcoin there are lots of wallet like:Hardware wallets like trezor, which i use, it also has wallet for altcoins so don't worry but its a bit expensive. Electrum wallet, Exodus walletFor Exchanges here are some most used exchanges:Binance, MEXC, Poloniex, Coinbase,Houbi, Kucoin, and more you'll need to register and require KYC mostly of the exchanges, once completed you can now do trades and add funds for trading.Airdrops most people do this to earn money without spending, but you need to be careful also you need separate wallet(https://metamask.io) for this to avoid, losing all your funds , because sometimes, wallets get hack by these. note: remember airdrop is not 100% sure that you will gain or get anything from it, sometimes its luck, some airdrops will need to spend money for examples running nodes , trading to their network, this are some of the task required.in crypto How to setup the Wallet, Trading , Exchanges are some of the important things, also knowledge how to identify scam is also important to be learn because it will save you from losing assets.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432995",
  "comments": [
    {
      "author": "pooya87",
      "created_time": "January 04, 2023, 02:01:10 PM",
      "body": "Those who are brand new to this world must never start with any of the altcoins otherwise they will expose themselves to a whole lot of high risk situations that will result it lots of losses too. Just stick to bitcoin, learn how it works and how you should store bitcoin safely and how you should use it for transfer money.Then if you liked this world you have to first study pump and dumps before getting started on altcoins!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "January 04, 2023, 02:01:51 PM",
      "body": "My own 2023 advise comes in this way, I will first advise every newbies to take their time to learn cryptocurrency and get used to the whole thing before they can begin to start investing whereas they can begin with the learning through faucets and creation of demo accounts, i acceot this but know that some rewards you may get can be very little while some only teach and don't give at all, if you're done learning the basics then it's more safer to start your journey with investing on bitcoin for the beginning and avoid other altcoins till you're right and fully prepared for taking their risk considering how shitcoins and projects existed in cryptocurrency aside bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "January 04, 2023, 02:18:40 PM",
      "body": "Starting with decentralized exchange is not good idea in my opinion because the fees are high and not really user friendly so either they can start small amount with centralized exchanges and move funds to their wallet immediately when they have no intention of trading in near future.Poloniex is not really recommended for trading which have many accusations against them and also faced hacks in past and I don't know they really gave any refunds for people who lost their funds so just go with Binance which is better compared to poloniex but keep in mind KYC is mandatory now on almost every centralized exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "January 04, 2023, 02:57:21 PM",
      "body": "Quote from: Findingnemo on January 04, 2023, 02:18:40 PMStarting with decentralized exchange is not good idea in my opinion because the fees are high and not really user friendly so either they can start small amount with centralized exchanges and move funds to their wallet immediately when they have no intention of trading in near future.Maybe Op wanted to lure potential traders into a more decentralized approach first. At least they are gonna be more safe than trusting centralized first. But you got a point, cause the fees on dex are eating a lot than cex. But of course this will depend on how the trader like which either he can prefer to use a lot of helpful indicators.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "January 04, 2023, 05:51:26 PM",
      "body": "For beginners in trading, I never recommend using decentralized platforms because they require technical knowledge and the possibility of making mistakes is very likely, and of course he alone will bear the result of those mistakes.Central platforms can be useful at this stage, especially platforms that give new registrants demo accounts to learn the basics of trading without the need to use real money. It is true that the central platforms require verification procedures, but they are good for beginners, as they provide the necessary support.At an advanced stage, advise them to use trusted decentralized platforms and only use their own wallets for storage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "January 04, 2023, 06:54:47 PM",
      "body": "Quote from: tech30338 on January 04, 2023, 01:40:01 PM... if you are just getting started,If you are just getting started with crypto this new year, know you should have started late but it is good you started still.-Take your security seriously, It will hurt you a lot if your investments gets stolen.-Learn to do your own research and follow less of what you hear people say.-Don't let the bear market discourage you from continuing, it will pass.-DCA-ing (dollar cost averaging) will do you a lot of good.-Bitcoins remain the best to invest in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "January 04, 2023, 09:43:07 PM",
      "body": "Quote from: pooya87 on January 04, 2023, 02:01:10 PMThose who are brand new to this world must never start with any of the altcoins otherwise they will expose themselves to a whole lot of high risk situations that will result it lots of losses too. Just stick to bitcoin, learn how it works and how you should store bitcoin safely and how you should use it for transfer money.Then if you liked this world you have to first study pump and dumps before getting started on altcoins!It's one of the biggest mistakes newbies make. They come into the space, see all those projects listed by market cap and price and get confused. Like why is one project valued at billions but its price is in thousands of dollars and there's another almost as valuable project but its price is 10% of the other ones? Also why is Tether so high on the list and it's priced so low. Why would I buy Bitcoin if it's so expensive compared to other projects? Maybe I'll invest in Tether?Coinbase is paying me to make an account, so maybe it's the best exchange? CZ from Binance says I'll lose money if I hold it on my computer so maybe I should let him keep it?These are just a few of the questions I see newbies ask and I can tell you that it must feel like a death trap at first. Long story short, buy bitcoin and hold it yourself!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "January 04, 2023, 10:24:02 PM",
      "body": "Thank you for providing this information, OP. What I've learned so far about centralized and decentralized exchanges is that your funds are more secure in a decentralized exchange because you hold your private keys and have access to your money at any time, whereas a centralized exchange is more likely to be breached and your funds stolen or lost, as happened recently with FTX. As newcomers to the crypto world, different approaches can be used to determine which will be suitable for their investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "January 04, 2023, 11:41:38 PM",
      "body": "Quote from: Ndabagi01 on January 04, 2023, 10:24:02 PMThank you for providing this information, OP. What I've learned so far about centralized and decentralized exchanges is that your funds are more secure in a decentralized exchange because you hold your private keys and have access to your money at any time, whereas a centralized exchange is more likely to be breached and your funds stolen or lost, as happened recently with FTX. As newcomers to the crypto world, different approaches can be used to determine which will be suitable for their investment.Your coins are not very secure when dealing with a decentralized exchange. Your tokens or coins are stored in your wallet, but in order to carry out a trade (swapping from one token to another), you have to connect your wallet to a DEX, which exposes your assets to a DNS attack.The use of DEX has its own disadvantages. wallet-to-DEX interaction -------> DNS attack -------> resulting in fund losses.CEX also has its risks, like bridging security, which is why it's always advised to keep your funds off a CEX, unless you have something specific you want to use the funds for. Although, when carrying out a trade on a DEX, it is wise to use a hardware wallet because hardware wallets have some additional security and are often offline, which makes them hard to easily bridge.So when dealing with DEX, you also have to trade with caution because wallets like Metamask, Trustewallet, and their likes can cause you to lose your funds when interacting with a DEX and being faced with DNS attack.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "January 05, 2023, 10:43:35 AM",
      "body": "Starting with altcoins is bad but using decentralized exchanges like Uniswap, Pancakeswap as a start with altcoins is more terrible idea.Because on such decentralized exchanges, every one can list their tokens and add liquidity then make a rug pull. I agree that newbies shouldn't begin with altcoins but if they want to try with altcoins. They must choose altcoins which are listed on big centralized exchanges.Check Score and Trust score of exchanges on Coinmarketcap and Coingecko.https://coinmarketcap.com/rankings/exchangeshttps://www.coingecko.com/en/exchanges",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "January 05, 2023, 11:56:06 AM",
      "body": "Quote from: tech30338 on January 04, 2023, 01:40:01 PM How to setup the Wallet, Trading , Exchanges are some of the important things, also knowledge how to identify scam is also important to be learn because it will save you from losing assets.I genuinely think that the risk involved in Crypto trading should also be considered.Furthermore, as a beginner and a brand new person to cryptocurrency trading, Altcoins are not a good place to begin.It is important to understand the effects of altcoins, as well as try and view the effects altcoins caused to the crypto market in 2022.A beginner should start by investing in Bitcoin, especially now that the price is low, then do some research and decide which altcoin to invest in, but always invest in Bitcoin to be on the safe side.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mumang siat",
      "created_time": "January 05, 2023, 12:27:32 PM",
      "body": "Those who are newbies are strongly discouraged from starting with Altcoins, if they do so they are pushing themselves into too many bad situations, this is a bad first step by entering into high risk spaces. if they were rookies at this point, Actually they were among the late ones in joining this world, But we are missing things about it.There are many things that they have to learn and one of them is about strategies in Bitcoin or Altcoins, but it would be better for these beginners to turn their backs on Altcoins and put Bitcoin first when studying it, if it is well mastered, please implement it in the Cryptocurrency market.It is likely that the impact they will get will remain positive with sufficient knowledge that they actually learn.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sakanwa",
      "created_time": "January 06, 2023, 04:35:21 AMLast edit: January 06, 2023, 11:11:02 AM by Mr. Big",
      "body": "Well, I will say that for those who are joining crypto in this year 2023 my advice and opinion to you is that you should first of all know more about the crypto that you have investment inside, that means you have to read more of people discussion and post on here, so you will be 100% sure of the forum you're in and invest thousands of your time, and this should be the greatest forum that you will or always pay attention to, because bitcointalk has brought light into my master life and I am confirming the changed too in my own life too, they're a lot of people that are here since 2001 and they are the legendary with thousands of merits, this are the up leaders that we most go through there pages and read more about them in other to be more successful on here.Crypto has been a popular life changing qualified forum that everyone is expected to make money and leave a good life, I suggest the first thing you do as newbie is for you to always keep to bitcointalk rules and regulations everyday, and do not make mistakes in your post or posting things that we results to your account damage, 2023 is a year of new beginning, and how the year will end is also in your hand too, what really matters is your hard work and time, and this is for your own benefits, and attract your own strategies, to enable you to be a winner with a difference, there are no lost in bitcointalk but a permanent wisdom forever.My own opinion for those who are just starting in crypto this 2023 the effort you apply everyday in the crypto determine the results you earn and get each day, I have been here and being active is the number one rules in life and your coins are also safe and secured in this bitcointalk forum, there were one of my friend that joined this forum last year which was 2022 he took this bitcointalk very serious and now his thanking me for introducing him into this bitcointalk, as a newbie beginner you have to be a smart and reliable person that has patient in all that he do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "January 09, 2023, 04:13:10 AM",
      "body": "Quote from: Hyphen(-) on January 05, 2023, 11:56:06 AMI genuinely think that the risk involved in Crypto trading should also be considered.Furthermore, as a beginner and a brand new person to cryptocurrency trading, Altcoins are not a good place to begin.It is important to understand the effects of altcoins, as well as try and view the effects altcoins caused to the crypto market in 2022.A beginner should start by investing in Bitcoin, especially now that the price is low, then do some research and decide which altcoin to invest in, but always invest in Bitcoin to be on the safe side.A newbie should not start bitcoin trading or crypto trading at all. First observe the crypto market for a while, learn, and then plan to start at the perfect time. A bearish market is always a time to buy bitcoin or other altcoins if anyone wants to trade crypto. Start with a decent amount of bitcoin and then scale up the amount step by step, otherwise anyone can lose their motivation after losing their entire investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ThemePen",
      "created_time": "January 09, 2023, 04:32:58 AM",
      "body": "A newbie should not jump into the Ocean of Crypto world at first. I suggest he should learn first. He should gain knowledge as much as hen can get. And if he is thinking to invest so he shouldn't invest all money first time. He should start with small amount and should take knowledge how to trade or stake or others things which is better for earning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzwaafu11",
      "created_time": "January 09, 2023, 08:50:16 PM",
      "body": "As a newbie you can't just jump into crypto currency just like that without knowing more about cryptocurrency you've to know more about crypto currency you've to know more because you're investing big funds so you if you don't calm down and read and learn more about it you may lose your funds which will affect your business",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UchihaSarada",
      "created_time": "January 15, 2023, 03:52:33 AM",
      "body": "I think newbies in crypto can start with a biggest crypto, Bitcoin.Start with test net coinsStart with testnet of altcoinsPractice to create, recover wallets with testnet networksPractice to make transactions on testnets. Claim testnet coins from Bitcoin, altcoin faucets and use them for transaction practice.On mainnet, mistakes are expensive and you lost real money on main net.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reagansimms",
      "created_time": "January 15, 2023, 04:28:18 AM",
      "body": "Quote from: tech30338 on January 04, 2023, 01:40:01 PMJust make a basic how to get start in cryptocurrency for Trading, Wallet, Exchanges, Airdrops for newbies who always ask what to do, although its better to look and read them one by one on some most detail site, you can also look or read this if you want, I'm gonna give those who are most used if you are just getting started:If you are just starting to dive into Cryptocurrency for trading, the first thing you need to do is maintain the security of the assets in your wallet. Regardless of which exchange you use, never store assets there. You must always remember the message of the seniors here, without a private key it is not your asset. It is also necessary to pay attention to choosing a wallet to store Bitcoin, the case that happened to julerz12 here can be used as a lesson for anyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fadhilz123",
      "created_time": "January 15, 2023, 05:38:22 AM",
      "body": "Quote from: Dzwaafu11 on January 09, 2023, 08:50:16 PMAs a newbie you can't just jump into crypto currency just like that without knowing more about cryptocurrency you've to know more about crypto currency you've to know more because you're investing big funds so you if you don't calm down and read and learn more about it you may lose your funds which will affect your business Giving advice is perfectly acceptable, but try not to scare people who want to try something new in their life. Because basically those who have jumped into cryptocurrencies are sure to find out about things that they don't know at this point even though they haven't fully gotten them. But by continuing to learn and trying through the application of what he has read is very good, because learning without doing your own practice will not yield any results at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}