{
  "id": "topic_5447891",
  "title": "Victony",
  "author": "Victony",
  "created_time": "April 07, 2023, 06:07:26 AM",
  "content": "I recently purchased 0.0045 Bitcoins which is still present in my trust wallet I believe with me owning a fraction of the worlds Bitcoin although a very tiny fraction in practical I am now a crypto currency investor  in essence a Bitcoin investor",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447891",
  "comments": [
    {
      "author": "woez",
      "created_time": "April 07, 2023, 07:07:48 AM",
      "body": "The Fist, Congratulations on your recent Bitcoin purchase! By earning a fraction of Bitcoin, you have taken the step to become a cryptocurrency investor. As you mentioned, even though the amount you own may seem small, it is still part of the world's Bitcoin supply, making you part of the larger Bitcoin community. Becoming a Bitcoin investor requires a solid understanding of the cryptocurrency market, including its volatility, trends, and potential risks and growth opportunities. It is important to stay up to date with industry news and developments and have a clear investment strategy.While owning Bitcoin does not automatically make someone a skilled investor, I think this is a good start by means of continuing to educate yourself and staying informed about the market, you can make informed decisions about how to invest and grow your cryptocurrency portfolio.Good luck on your journey as a Bitcoin investor!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "April 07, 2023, 07:42:32 AM",
      "body": "Sure — but what's the big deal? I can also call myself an Apple investor by owning a fraction of Apple stock and I can also say I'm an investor in the top 500 US companies by holding an S&P500 ETF.Good for you for owning some BTC though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CageMabok",
      "created_time": "April 07, 2023, 08:15:31 AM",
      "body": "Quote from: Victony on April 07, 2023, 06:07:26 AMI recently purchased 0.0045 Bitcoins which is still present in my trust wallet I believe with me owning a fraction of the worlds Bitcoin although a very tiny fraction in practical I am now a crypto currency investor  in essence a Bitcoin investor If you are a person who has just bought Bitcoin and kept it in your own trusted wallet, I will not consider you a Bitcoin investor as long as you don't use Bitcoin or invest it in a certain company. Because if you are only limited to buying and keeping in your wallet, you are not much different from Holders and also from traders who also try to save for a while before they sell it back to the market. So there's no need to consider yourself an investor if your effort is to save before selling again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blurr007",
      "created_time": "April 07, 2023, 08:24:19 AM",
      "body": "Congratulations.This shows that you've been consistent and ready for a life changing opportunity. it's just a matter of time.Just keep update with bitcoin and figure out other trading tactics inorder not to make a loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "April 07, 2023, 08:27:43 AM",
      "body": "Quote from: Victony on April 07, 2023, 06:07:26 AMI recently purchased 0.0045 Bitcoins which is still present in my trust wallet I believe with me owning a fraction of the worlds Bitcoin although a very tiny fraction in practical I am now a crypto currency investor  in essence a Bitcoin investor Congratulations and welcome abroad man. The quantity doesn’t matter at all. Now you can proudly announce everywhere that you own the valuable Bitcoins. Bitcoins are no doubt valuable, as they are limited in numbers and the demand among the people for the coin also increasing. So OP now the main motive of yours should be to hold the coins as long as you can and yield the maximum profit from it. Sell the coins only when no other options are available. I am very much confident that after few years you will see huge profit on your investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.corol",
      "created_time": "April 07, 2023, 09:09:50 AM",
      "body": "You are welcome to invest in Bitcoin. You will hold it for a long time and hopefully get a lot of profit. Even if your investment is small, your investment is welcome. Try to increase your investment amount gradually. Finally I wish you success in your investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lorence.xD",
      "created_time": "April 07, 2023, 10:04:55 AM",
      "body": "Quote from: CageMabok on April 07, 2023, 08:15:31 AMQuote from: Victony on April 07, 2023, 06:07:26 AMI recently purchased 0.0045 Bitcoins which is still present in my trust wallet I believe with me owning a fraction of the worlds Bitcoin although a very tiny fraction in practical I am now a crypto currency investor  in essence a Bitcoin investor If you are a person who has just bought Bitcoin and kept it in your own trusted wallet, I will not consider you a Bitcoin investor as long as you don't use Bitcoin or invest it in a certain company. Because if you are only limited to buying and keeping in your wallet, you are not much different from Holders and also from traders who also try to save for a while before they sell it back to the market. So there's no need to consider yourself an investor if your effort is to save before selling again.The OP is just starting, at least he already own Bitcoin which he can decide where to invest it. If he think it that way but still give a good effects let him be. Let's just educate them. He might become a trader than investor in what suits for him. And what you said is right holders and investor is different, holding Bitcoin and waiting for it to sell just to profit consider as trading. But if you're investing, you put your funds in a company for a long period of time or short for you to gain profits. Still congratulations to OP for taking a step in Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "April 07, 2023, 10:15:13 AM",
      "body": "Quote from: Victony on April 07, 2023, 06:07:26 AMI recently purchased 0.0045 Bitcoins which is still present in my trust wallet I believe with me owning a fraction of the worlds Bitcoin although a very tiny fraction in practical I am now a crypto currency investor  in essence a Bitcoin investor Yes, you're now technically a bitcoin investor while the others are still thinking and only investors through their minds because they haven't taken action yet just as you did.My advice to you is don't get discouraged by any words and if you think that you're going to be a long term investor, just keep it up and continue. No words shall dismay you because you're now part of everyone who's got bitcoin in here. It may just be a fractional for now but don't stop achieving more in the nearest future so DCA.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Minecache",
      "created_time": "April 07, 2023, 10:36:13 AM",
      "body": "Quote from: Lorence.xD on April 07, 2023, 10:04:55 AMQuote from: CageMabok on April 07, 2023, 08:15:31 AMQuote from: Victony on April 07, 2023, 06:07:26 AMI recently purchased 0.0045 Bitcoins which is still present in my trust wallet I believe with me owning a fraction of the worlds Bitcoin although a very tiny fraction in practical I am now a crypto currency investor  in essence a Bitcoin investor If you are a person who has just bought Bitcoin and kept it in your own trusted wallet, I will not consider you a Bitcoin investor as long as you don't use Bitcoin or invest it in a certain company. Because if you are only limited to buying and keeping in your wallet, you are not much different from Holders and also from traders who also try to save for a while before they sell it back to the market. So there's no need to consider yourself an investor if your effort is to save before selling again.The OP is just starting, at least he already own Bitcoin which he can decide where to invest it. If he think it that way but still give a good effects let him be. Let's just educate them. He might become a trader than investor in what suits for him. And what you said is right holders and investor is different, holding Bitcoin and waiting for it to sell just to profit consider as trading. But if you're investing, you put your funds in a company for a long period of time or short for you to gain profits. Still congratulations to OP for taking a step in Bitcoin.We don't have to be too strict with newbies, they still have a lot to learn, they already trusted and bought bitcoin, which is a great start. If we can't help them, don't get too upset with them.OP, congratulations, and welcome aboard with us. I know you are newbies and will have much work to do to make a profit. But what I can ask you to consider before that is about keeping your bitcoins safe. You say you are storing bitcoins on Trust wallet, which is a non-custodial but closed source wallet, which is not good. I'm not saying it's not secure, but you need to have full control over your bitcoins, and that's safety, as well as the difference between bitcoin and a centralized asset. You can learn about Electrum wallet instead of Trust, which is the safest and best software wallet we have available today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "April 07, 2023, 10:57:50 AM",
      "body": "Quote from: Victony on April 07, 2023, 06:07:26 AMI recently purchased 0.0045 Bitcoins which is still present in my trust wallet I believe with me owning a fraction of the worlds Bitcoin although a very tiny fraction in practical I am now a crypto currency investor  in essence a Bitcoin investor I do not want to be frustrated, but investing is not related to the amount of what you have invested, but rather to your investment mentality, meaning your ideas, plans and return on investment.It is good to invest part of your money in Bitcoin, but what is the return on that money? For example, the amount of $ 100 will not make you a fortune unless you die, but reducing your expenses and starting to invest and with the passage of days is what will make you a fortune.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cvetik56",
      "created_time": "April 07, 2023, 11:06:54 AM",
      "body": "Welcome! It took you a long time, but it's still a good time to enter crypto, congrats  What exactly made you buy your first BTC?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "leonair",
      "created_time": "April 07, 2023, 11:11:22 AM",
      "body": "Quote from: Victony on April 07, 2023, 06:07:26 AMI recently purchased 0.0045 Bitcoins which is still present in my trust wallet I believe with me owning a fraction of the worlds Bitcoin although a very tiny fraction in practical I am now a crypto currency investor  in essence a Bitcoin investor 0.0045 is worth of around $125. Which is a good amount for first time investment.  Congratulations on investing in Bitcoin.  I think you invest here by gaining good knowledge about Bitcoin and knowing about its risks. I would suggest you use a noncustodial wallet or a hardware to hold them. These will hold your bitcoins securely. And try to hold your bitcoins for a long time and set a target that you will hold it tightly until bitcoin recovers its ATH price. And if you want to invest more then follow DCA to average your bitcoin profit and loss. and anyway good luck to you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "April 07, 2023, 11:35:54 AM",
      "body": "Quote from: Victony on April 07, 2023, 06:07:26 AMI recently purchased 0.0045 Bitcoins which is still present in my trust wallet I believe with me owning a fraction of the worlds Bitcoin although a very tiny fraction in practical I am now a crypto currency investor  in essence a Bitcoin investor Congratulations on your purchase, You have taken the first most important step of becoming an investor which is first investing, be aware that being an investor in bitcoins is a role that comes with a lot of responsibilities and challenges. It is not an easy ride to profit, you must be prepared for the days when it will feel like your investment is being lost to the market, and an urge to pull out while you still can, prepare for the days where there will be emotional trauma and disturbance, you have to be prepared to commit to keeping and holding your bitcoins, just as you commit to increasing your investment in it, you have to be prepared to be someone who do proper research, reading and following up on the news so you will not be given false second hand information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lillominato89",
      "created_time": "April 07, 2023, 11:42:43 AM",
      "body": "Quote from: Victony on April 07, 2023, 06:07:26 AMI recently purchased 0.0045 Bitcoins which is still present in my trust wallet I believe with me owning a fraction of the worlds Bitcoin although a very tiny fraction in practical I am now a crypto currency investor  in essence a Bitcoin investor welcome to the world of bitcoin, for me it doesn't matter how big or small the investment is, every small investor contributes to mass adoption, the important thing right now is to know the advantages and dangers that can be hidden behind bitcoin, first of all price volatility. I advise you to study bitcoin in all its facets! welcome aboard",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "April 07, 2023, 11:45:02 AM",
      "body": "You should have been applauded if you had accumulated Bitcoin to some degree, like 0.1BTC at the very least? What do you think? Many newbies have the same dream as yours but bear market always ruin that dream.As you accumulate Bitcoin right now, you haven't made it far at all since this is your first purchase, how much further can you go? I don't want you to feel discouraged, but what you are doing right now is accumulating Bitcoin, have you made any progress yet? no, because you are just getting started, it's not going to be a smooth road. Also, I hope you invested money you are not going to be using for a long period. There is no shortcut to making money out of Bitcoin, for now, keep biting and storing Bitcoin, maybe when the numbers are right enough like the example I gave you then you can decide to show off, it's not necessary though, but it could be encouraging for newbies like yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Popkon6",
      "created_time": "April 07, 2023, 11:49:03 AM",
      "body": "Congratulations on your first successful investment. The amount of Bitcoin you invested is equal to the current price of $125. I think you should use a hardware or software wallet instead of keeping the amount of bitcoins you have in a toast wallet. Your money may be at risk in taste wallet so you must collect a strong wallet. and hold the amount of bitcoins you invest for a long period of time. or you are interested in investing more and keep increasing the investment amount. Surely this investment of yours will bring a good profit for your future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coinerer",
      "created_time": "April 07, 2023, 12:06:04 PM",
      "body": "Quote from: Popkon6 on April 07, 2023, 11:49:03 AMCongratulations on your first successful investment. The amount of Bitcoin you invested is equal to the current price of $125. I think you should use a hardware or software wallet instead of keeping the amount of bitcoins you have in a toast wallet. Your money may be at risk in taste wallet so you must collect a strong wallet. and hold the amount of bitcoins you invest for a long period of time. or you are interested in investing more and keep increasing the investment amount. Surely this investment of yours will bring a good profit for your future.What to you mean by software wallet?  I think you mean by software wallet you suggested to the op is a non-custodial wallet. Congratulations to the op.  And his activities are really commendable.  Day by day the popularity of Bitcoin is increasing and the number of new investors in Bitcoin is increasing. So these events indicate that the future of Bitcoin is very bright and Bitcoin is going to be an alternative payment gateway for all sectors.  Because of the increasing usage of Bitcoin and people's interest in Bitcoin, Bitcoin will be a highly promising currency for the future days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iroh",
      "created_time": "April 07, 2023, 12:12:23 PM",
      "body": "Quote from: Victony on April 07, 2023, 06:07:26 AMI recently purchased 0.0045 Bitcoins which is still present in my trust wallet I believe with me owning a fraction of the worlds Bitcoin although a very tiny fraction in practical I am now a crypto currency investor  in essence a Bitcoin investor Congratulations OP on your bitcoin purchase. You didn’t actually say this is your first purchase of bitcoin but as you’re writing with a newbie account, people would automatically assume you’re a newbie that just got bought his first ever bitcoin. I’m glad you agree the amount you purchased is a very tiny fraction. So you would also agree that it’s a bit too early to be proclaiming yourself to be an investor. Bitcoin holder would be more appropriate, don’t you think?Congratulations again on your purchase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "April 07, 2023, 12:43:13 PM",
      "body": "Quote from: Blurr007 on April 07, 2023, 08:24:19 AMJust keep update with bitcoin and figure out other trading tactics inorder not to make a loss.Having trading tactics or strategy does not mean that you will not experience losses. You will still lose but it will be minimized because you know how to analyze the market. That's the reality of the market because if there is a strategy that works 100%, many people will get rich. This does not mean that you will not learn tactics in trading, it is still necessary so that you can maximize your income. That's because you know when to entry and at what price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}