{
  "id": "topic_5464353",
  "title": "Question:",
  "author": "MundoCoin",
  "created_time": "August 24, 2023, 01:38:17 AMLast edit: August 24, 2023, 06:19:16 AM by MundoCoin",
  "content": "Just a little survey, thanks!Sorry for not being clear before.Premise, blockchain decentralisationInstant transaction means:A sends coins to B. B receives these coins directly\"without waiting for a block confirmation\".It just changes the block confirmation method.We're trying to do all this with a new model, a new way of thinking.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464353",
  "comments": [
    {
      "author": "DapanasFruit",
      "created_time": "August 24, 2023, 03:56:37 AM",
      "body": "You mean by instant just like what PayPal is providing where transactions do not go through any block confirmation for them to get through? I am not well-versed in the technicalities of our industry but I think what we have right now can be the best available when we are using the blockchain technology, otherwise we should be looking for something outside of the available cryptocurrency offerings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "August 24, 2023, 04:28:44 AM",
      "body": "Quote from: MundoCoin on August 24, 2023, 01:38:17 AMJust a little survey, thanks!Not really sure what you mean by instant transactions, but maybe you can refer to this table,https://www.makeuseof.com/bitcoin-is-slow-what-is-the-fastest-cryptocurrency/However, take note that we are talking about blockchain technology, so everyone should be written first before the transaction can get through and that is the essence of it. Be immutable and so that there will be no questions about the transaction itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "August 24, 2023, 04:33:17 AM",
      "body": "I chose option number 2 for \"No, i don't\".A blockchain that doesn't have a long enough block confirmation process isn't an ideal public blockchain, it will be a centralized blockchain that is quite dangerous for its users. Even I'm not quite sure about BNB's blockchain because they only have less than 30 validators on their blockchain. Then how can I trust a coin that doesn't even have block confirmation?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "August 24, 2023, 05:14:14 AM",
      "body": "Quote from: MundoCoin on August 24, 2023, 01:38:17 AMJust a little survey, thanks!When a translation doesn't require a block confirmation, there ideally should be no transaction fees either. Also the architecture will not be decentralized like Bitcoin. I think in crypto market, we already have couple of options where are transactions are nearly instant and cheap. But if you have some idea to make it instant and free, pitch your idea to government. They might accept it. before doing that, study the architecture of UPI payment system that are being used in India. That's the only thing you will have to compete to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "August 24, 2023, 05:16:05 AM",
      "body": "Off-chain transaction.That means only for a transaction using (Internal-transaction) on the same service provider. Most of the platform will be always required a confirmation for the transaction, because is to avoid the transaction being reversed.Receive any transaction with (0) confirmation are quite dangerous because the sender can reversed the transaction. Off course people will say (NO), I only accept (0) transaction if the transaction using internal transaction not using (on-chain) transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adzino",
      "created_time": "August 25, 2023, 05:18:17 AM",
      "body": "There are already some coin that are almost near instant. I mean the network confirmation takes only few seconds. Most likely it won't be the same when lots of people start using the coin and the network is congested and under pressure. If there was a coin that was instant, then it would most likely be a \"centralized\" coin and the network security might highly likely be very weak. We don't need a centralized coin. We already have fiat currencies that is fully centralized. So my vote is \"we don't need it\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "August 25, 2023, 06:02:18 AM",
      "body": "Probably can and there are out there. But on chain transaction are also fast its not like super instant cause if the users increase in due time theres a tendency to reduce speed in the end. More users the lesser the speed of the transactions. But if its off chain I think its possible since its run on a centralized server.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "August 25, 2023, 06:20:15 AM",
      "body": "You also have to check where it will come from and that's why Western Union and other money transfer businesses are putting big charges for international transfers. With cryptocurrencies especially the decentralized ones, it won't work. We need someone or something to confirm the transaction first or else it will be chaos. With centralized it can be done but I don't know if that is what you are aiming for. Digital money companies like PayPal can do it because it's as easy as a simple input in their system. Bitcoin could do it with enough payment to make it at the highest priority of transactions but it's still not as instant as you want it to be.Good luck with your project though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "August 25, 2023, 07:58:42 AM",
      "body": "If there's no confirmation time, it's mean the coin is completely 100% centralized and the volume is really small. Of course everyone want an instant transaction, but if you charge a high fee no one will want it since they don't want to lose a lot just for paying the fee. Remember this is a new coin, no one will spend a lot money just to make the fee will not hurt them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MundoCoin",
      "created_time": "August 25, 2023, 08:09:21 AM",
      "body": "Addendum, there is block confirmation, but we will implement instant trading in other ways. (Our goal is a decentralised instantly tradable coin)The implementation method and security are still being validated, and the reason for coming to the survey is also to confirm whether the market needs instantly tradable blockchain coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Godday",
      "created_time": "August 25, 2023, 09:40:49 AM",
      "body": "I choose to hesitate. A blockchain without passing block confirmation at all is not an expected blockchain. I think the existence of blockchain is precisely to make transactions visible and recorded in one long chain. So I'm hesitant because I want instant but it's a blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Heulahee",
      "created_time": "August 25, 2023, 09:43:18 AM",
      "body": "The 2nd option would be good rather, as I can say that the fast transaction depends upon its own blockchain in which we send or receive some coins. For example, Ethereum has its own transaction speed and polygon and thus others, so I think I don't need to make it on my on way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tipstar",
      "created_time": "August 25, 2023, 11:49:56 AM",
      "body": "The problem of such coin is we would have no legitimacy of uniqness of a token. Yes, we might issue a fixed number of unique tokens but the people with wrong intention would misuse the feature of not getting confirmation from the Blockchain to double spend the tokens or replecate the tokens as we would not have confirmation from Blockchain.There's a reason why people accepting crypto waits for a few confirmation before marking the the transactions valid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "August 25, 2023, 02:04:17 PM",
      "body": "Quote from: MundoCoin on August 25, 2023, 08:09:21 AMAddendum, there is block confirmation, but we will implement instant trading in other ways. (Our goal is a decentralised instantly tradable coin)The implementation method and security are still being validated, and the reason for coming to the survey is also to confirm whether the market needs instantly tradable blockchain coins.Decentralized and then instant doesn't sound believable. Can you assure users that there are no point of attack like hosting the network on centralized servers? Security is going to be a huge factor here and you'll probably have to invest a lot on that. Don't pursue this if you don't have huge private backing and are only expecting community support from token sale or whatever public crowdfunding. We are probably at a stage now where \"instant\" is no longer an effective marketing tool and people may no longer buy into that since there are already a plethora of chains offering fast or instant transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AakZaki",
      "created_time": "August 25, 2023, 05:06:15 PM",
      "body": "Quote from: Jating on August 24, 2023, 04:28:44 AMNot really sure what you mean by instant transactions, but maybe you can refer to this table,https://www.makeuseof.com/bitcoin-is-slow-what-is-the-fastest-cryptocurrency/However, take note that we are talking about blockchain technology, so everyone should be written first before the transaction can get through and that is the essence of it. Be immutable and so that there will be no questions about the transaction itself.now that's the point, everyone has to queue to wait for their transactions to be written on the blockchain because the blockchain is a ledger that is the data center for all transactions, without confirming a block it cannot be done. The denser the network, the longer it will take. For example shopping and wanting to pay at the cashier with a long queue. Direct transactions may be possible outside the blockchain, but if you expect crypto like that, then the crypto ecosystem will be useless and the blockchain will not be used.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "August 25, 2023, 06:51:42 PM",
      "body": "If your foundational goal is to preserve decentralisation and yet be able to come up with something new in regard to transaction finality, then you should address and explain how it technically works. Because I believe that decentralization word has become, mainly, a buzzword within altcoin communities. So if you truly have something potential, you better explain it within the technical terms, so anyone can verify its plausibility.The market will find its way if the underlying method has proven to achieve decentralization and has a fast confirmation. Prove the technical fact first, then surely anyone would take an eye into your method.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "August 25, 2023, 08:56:34 PM",
      "body": "I think Nano does that but they lack exposure thus, people don't know that they're the type of project that you're working on. Since I am not updated with this project, I didn't know that they've already made a rebranding and they've got now the ticket symbol of XNO. As for the aim of OP of trying to get into this type of transaction, how can you incentivize the miners? or there's probably none just as the other projects that you have seen doing this thing for themselves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yudhisthir",
      "created_time": "August 26, 2023, 02:49:51 PM",
      "body": "Ways could be divised to check and confirm from Blockchain at a quicker pace. As the previous user mentioned, Nano has a near instant transaction with a minute fee. We need many more of such projects covering every aspects of crypto. Completely offline transactions would not work for a long term. Just like in bank, you could freeze some of your assets to transact small amounts but complete offline way of transacting would bring more problems than solutions. The time ahead would be for instant transacting Blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}