{
  "id": "topic_5407111",
  "title": "re-start",
  "author": "re-start",
  "created_time": "July 21, 2022, 08:27:36 AM",
  "content": "RugPull:In this method, usually, the scammer person (or team) makes a lot of advertisements on social media like Instagram, and through influencers, they expand their project on social medias.Next, they will list the project's tokens on a decentralized exchange and increase the liquidity (to increase the price of the token).Finally, investors are promoted to buy this token. During the peak price, they reduce the liquidity and all investors are left with a worthless scam token!How do recognize these projects?1: That Projects that offer an unbelievable profits to investors2: Anonymous developments team3: No special innovation4: No review on other sites/Platforms5: Holding most of the total tokens by a specific addressDo you know other ways to recognize these projects?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407111",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "July 21, 2022, 08:36:37 AM",
      "body": "Quote from: re-start on July 21, 2022, 08:27:36 AMDo you know other ways to recognize these projects?Don't Fomo into any investment.Many of these scams are relatively easy to spot, but people easily get influenced, and when popular personalities recommend something, they rush into it without doing their own research.• Recognize that 99% of projects are scams or spam repetition of an overused concept,• With this, you would realize that there are very high chances this project you've come across is one of them, so you tend to scrutinize it more,• Do your own research.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "July 21, 2022, 09:08:38 AM",
      "body": "Quote from: re-start on July 21, 2022, 08:27:36 AMDo you know other ways to recognize these projects?Yes, and it's don't invest in projects that do more talk than work. It cuts out a surprisingly large percentage of BS projects from people's radars. This should be a given, but it apparently is not since the space is being drowned by more blatant scams and Ponzis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 21, 2022, 10:14:21 AM",
      "body": "Quote from: re-start on July 21, 2022, 08:27:36 AMRugPull:How do recognize these projects?1: That Projects that offer an unbelievable profits to investors2: Anonymous developments team3: No special innovation4: No review on other sites/Platforms5: Holding most of the total tokens by a specific addressDo you know other ways to recognize these projects?1.a. offering referral/commission to recruit others in   b. offering air drops for free but suggesting future prices before markets even accept it   c. market rate where there is no bases of an underlying value:speculation layer:market rate accumulator to explain the rate2.a. advertised to this forum using a newbie account   b. no github(closed source)3.a. it suggests it fills a niche/need but shows no actual utility in that area.        EG a medical data based project but lists no medical industry affiliation(no medical company involvement)   b. the code is obvious cut/paste script kiddy work of other crypto   c. has no underlying cost/long term value creator in code(not PoW for instance)   d. white paper speaks too much of the future, rather then the current function       EG reads more like a sales advert more than a technical specs document",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "re-start",
      "created_time": "July 21, 2022, 03:03:03 PM",
      "body": "Quote from: Upgrade00 on July 21, 2022, 08:36:37 AMQuote from: re-start on July 21, 2022, 08:27:36 AMDo you know other ways to recognize these projects?Don't Fomo into any investment.Many of these scams are relatively easy to spot, but people easily get influenced, and when popular personalities recommend something, they rush into it without doing their own research.• Recognize that 99% of projects are scams or spam repetition of an overused concept,• With this, you would realize that there are very high chances this project you've come across is one of them, so you tend to scrutinize it more,• Do your own research.Of course, many of these projects are new, and review sites can review scam projects and warn investors after at least one week.As a result, this short time can drown investors like a swamp.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "July 23, 2022, 09:45:50 AM",
      "body": "Quote from: re-start on July 21, 2022, 08:27:36 AM2: Anonymous developments teamWhat about Bitcoin? it's created by anonymous person/team named Satoshi Nakamoto and it's become the first cryptocurrency that's still survive until now for 13 years. Does it's a rug pull project? obviously not and wouldn't happen in the future, it's either huge success or worthless, but not scam.Quote4: No review on other sites/PlatformsDo you think other sites reviews are actually genuine and they have any idea about the project? Nope, they're only audited the smart contract and rewriting same how the coins work without knowing the code, purpose, logical thing why it should be created etc. Moreover it can be paid shill by the project to promote their project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "July 23, 2022, 10:52:30 AM",
      "body": "Quote from: re-start on July 21, 2022, 08:27:36 AMHow do recognize these projects?1: That Projects that offer an unbelievable profits to investorsNot actually. Projects can be launched with less efforts and succeed. If developer team feel satisfied with what they can get and if they have bad  moral behavior, they will exit, rug pullQuote2: Anonymous developments teamNowadays, anon team might not have confidence on their capability to develop their projects so they are fearful that investors will find them. If they are scammers, they might plan rug pull at beginning and want to stay anon.Quote3: No special innovationNot actually. Promise about innovation is on white paper only. You can not know what innovation one project can do if it is a young project.Quote4: No review on other sites/PlatformsNot true. With marketing, review can be paid and what you read can be biased from payment. You must do your own research and not rely on review.Quote5: Holding most of the total tokens by a specific addressCorrect. Check the block explorer, see the top holders, and how much of total supply they are holding. Whether it is only normal wallets or locked by smart contracts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reid",
      "created_time": "July 23, 2022, 11:05:26 AM",
      "body": "Quote from: re-start on July 21, 2022, 08:27:36 AMHow do recognize these projects?1: That Projects that offer an unbelievable profits to investorsThere could be a good strategy here. Make sure you don't spend much, then pull out as fast as possible after ROI. The rest will be profits also being pulled out daily or weekly. After you hit the minimum withdrawal take it.Quote from: re-start on July 21, 2022, 08:27:36 AM2: Anonymous developments teamThere are teams who likes being anonymous trying to be like Satoshi and some of them are doing good even if they are unknown. Their projects are still running. Safety is their reason for being anonymous. Quote from: re-start on July 21, 2022, 08:27:36 AM3: No special innovationOkay. Quote from: re-start on July 21, 2022, 08:27:36 AM4: No review on other sites/PlatformsWell, not all reviews are accurate, maybe they don't want to pay whoever is making the review.Quote from: re-start on July 21, 2022, 08:27:36 AM5: Holding most of the total tokens by a specific addressYes. Be sure they are also locked until the promised time.Quote from: re-start on July 21, 2022, 08:27:36 AMDo you know other ways to recognize these projects?No, a lot of them are good at keeping it a secret. That's why I have my rule to take the ROI out as fast as I can so there won't be regrets in the future. Luckily, I am doing pretty great at it. Only one of ten of my investments in NFT projects was rugpulled early which means I didn't get the ROI.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "X-ray",
      "created_time": "July 23, 2022, 11:36:24 AM",
      "body": "It's hard to say that. I just discovered the new projects which didn't have those criteria can also became scam project. The main thing that must become the main concern must be the token distribution. These days scammers are using the new trick like distributing the unlocked tokens to the various new address that owned by the scammers and then scammers were acting to add the liquidity while he knows that if he will be dumped the liquidity that raised from the investors. This new trick being used by some scam projects like trophy, nody and many more. I just try to the truth if token distribution, token locked must become the main thing to recognize whether that was a scam project or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "July 23, 2022, 12:10:50 PM",
      "body": "It's easy to know if the project is not good but seriously, even if the project made a lot of money from the investors they can still turn into a scam and have this RugPull system, just like what happened in many projects before. Some are just doing business as usual but eventually, they will turn into this kind of nightmare.The good thing is, with the help of the community we can easily see if the project is good or not. With the reviews that you can get from their, and your own analysis investing on those projects can be prevented. Have this list for your basis to know if the site is ok or not, don't just believe on any hype easily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "July 23, 2022, 01:21:35 PM",
      "body": "Quote from: re-start on July 21, 2022, 08:27:36 AMHow do recognize these projects?1: That Projects that offer an unbelievable profits to investorsI became a victim of these on 3 to 4 projects I've learned my lesson if the profit is not sustainable they are just tempting you to invest these scam projects offer as high as 1000% APY Quote2: Anonymous developments teamAll these DeFi's have unknown developers but even if the development team are showing their pictures there's a big chances that these pictures or accounts are all fakesQuote3: No special innovationThis is the first sign and investors should consider this, if there is no usage, it's a pump and dump project.Quote4: No review on other sites/PlatformsThey pay people to give them good reviews usually bounty hunters some projects hows warning signs but scammers are getting better by imitating good projects",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasisog",
      "created_time": "July 23, 2022, 06:02:16 PM",
      "body": "Quote from: X-ray on July 23, 2022, 11:36:24 AMIt's hard to say that. I just discovered the new projects which didn't have those criteria can also became scam project. The main thing that must become the main concern must be the token distribution. These days scammers are using the new trick like distributing the unlocked tokens to the various new address that owned by the scammers and then scammers were acting to add the liquidity while he knows that if he will be dumped the liquidity that raised from the investors. This new trick being used by some scam projects like trophy, nody, and many more. I just try to the truth if token distribution, token locked must become the main thing to recognize whether that was a scam project or not. I've had this kind of experience as well. To be honest, it's really hard to find out easily if a project is a scam or legit unless you'll find enough time to find the red flags. Scammers have a lot of tricks nowadays to make the project looks legit. They're even spending their own funds to make people believe that the project is worth investing in. Yes, once the token is locked, it's something that we have to be suspicious about. Scammers could deceive us in so many ways so we should be smart enough not to fall for their trap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "July 23, 2022, 07:06:21 PM",
      "body": "I have seen projects scammed even with KYC. They do KYC with a third party and rugged investors though they had a solid plan. So it's not an easy task to recognize with scam project. It's better to ignore new projects unless you don't want to gamble with your money. A new project would give you a couple of X returns or vanish from your portfolio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "July 23, 2022, 09:02:14 PM",
      "body": "Quote from: re-start on July 21, 2022, 08:27:36 AMDo you know other ways to recognize these projects?It is quite hard to recognize them because scammers nowadays are great at mimicking legit and potential projects.  There is no other way than to research the team deeply.  Obviously, if the team is anonymous that must raise a red flag since they are asking for fund,s and yet they don't want to reveal themselves.Another thing is the too good to be true offers that is another huge red flag.  But if you really want to avoid this kind of project, never invest in them.  Just focus your funds on the proven cryptocurrency project in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "July 23, 2022, 09:26:08 PM",
      "body": "You can also add to your list the ability to purchase tokens through the website of a project that, moreover, was recently created. It is also worth paying attention to the blockchain when a suspected project suddenly starts growing rapidly within hours or days. If there is no demand for blockchain space, then we are witnessing a suspected scam to attract liquidity from naive investors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DoublerHunter",
      "created_time": "July 23, 2022, 09:27:05 PM",
      "body": "Quote from: re-start on July 21, 2022, 08:27:36 AM~snip~How do recognize these projects?1: That Projects that offer an unbelievable profits to investors2: Anonymous developments team3: No special innovation4: No review on other sites/Platforms5: Holding most of the total tokens by a specific addressDo you know other ways to recognize these projects?^ You have mentioned above and I think that the best way to spot a scam project in addition to what you have said is the project utility.That is right, the utility of the project, if you see that there is no clear use or it could be the idea of the usage was already exist, I think that will give the warning to have further investigations, it is a red flag to a project that does not have real utility, it will most likely will not survive. However, you know at first that most projects now have a rug pull, just simply avoid them all and except, just only investing BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "July 23, 2022, 09:37:24 PM",
      "body": "Quote from: The Cryptovator on July 23, 2022, 07:06:21 PMI have seen projects scammed even with KYC. They do KYC with a third party and rugged investors though they had a solid plan. So it's not an easy task to recognize with scam project. It's better to ignore new projects unless you don't want to gamble with your money. A new project would give you a couple of X returns or vanish from your portfolio. New projects are more prone to this but don’t over confident because the old one can turn into a scam project as well, just like the other projects. There’s a good list with OP already, this can be your guide before investing but honestly, you can’t tell if the project will RugPull until it happen, so make sure you invest money you can afford to lose because there’s no turning back here, once you invested with the wrong project without knowing it, your money is at risk and probably you’ll lose if you don’t know when to sell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dunfida",
      "created_time": "July 23, 2022, 11:58:38 PM",
      "body": "Quote from: re-start on July 21, 2022, 08:27:36 AMDo you know other ways to recognize these projects?Main thing for me to check on.1. Cant see locked up funds  If you do see that they do hold significant percentage of coins in overall supply and it wasnt time locked or something in related intothen i would simply skip out that project and would find for another one.High chances or tendency that they would be rug pulling the project once they do get sufficient value on which and since theyare holding in huge volume or numbers then it is really easy to do such thing for them to dump their market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zonefloor",
      "created_time": "July 24, 2022, 01:09:18 AM",
      "body": "When we look at it in general, we see that there is a serious amount of supply. In addition, as an alternative to this, they often fall into fomo and launch projects that are similar to each other or that are similar to the ones that follow. In addition to this, they suddenly show a very serious rise and disappear in a very short time. The most important thing is that they have stolen whitepapers from others. Most projects don't even have any whitepaper. Even these are indications that such projects will go rugpull.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "July 24, 2022, 04:45:18 AM",
      "body": "Quote from: re-start on July 21, 2022, 08:27:36 AMRugPull:In this method, usually, the scammer person (or team) makes a lot of advertisements on social media like Instagram, and through influencers, they expand their project on social medias.Next, they will list the project's tokens on a decentralized exchange and increase the liquidity (to increase the price of the token).Finally, investors are promoted to buy this token.Every project, whether seemingly genuine or not, has to embark on all that you listed. I don't see anything bad in doing that as it's publicity for the project. Would you rather a project launches and doesn't advertise itself? Adverts and publicity are needed to draw attention of investors to projects and thereby grow them. Without this, no one will know what any project is doing. However, that idiots and fraudulent developers utilize the same method to scam people shouldn't make it a conclusion that all projects doing so are scam and rugpull.For me, I will suspect a project of rugpull if it doesn't have a meaningful presence on social media, especially on Twitter and Reddit. Telegram is a den of scammers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}