{
  "id": "topic_5429029",
  "title": "noormcs5",
  "author": "noormcs5",
  "created_time": "December 15, 2022, 06:37:58 PM",
  "content": "Recently, when people are withdrawing their money to personalized wallets, CZ says that  out of these people 99% of them will lose money, as only 1% of the people are capable of handling the non-custodial wallets.‘99% of People' Will Lose Crypto Storing in Self-Custody: Binance CEO Changpeng ZhaoHe may be right because most people do not understand the risk, if they are not careful they could lose all their crypto.  Some may lose their private keys and others may connect their wallet at scam sites and they will be deprived of their funds.Education and understanding of non-custodial wallets is necessary.  A lot of people have move funds out of binance recently, lets see if they know how to safeguard their bitcoin/ altcoins in these wallets.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5429029",
  "comments": [
    {
      "author": "mk4",
      "created_time": "December 15, 2022, 06:50:12 PM",
      "body": "While he has a slight point, I'm really not a fan of the 99% number, knowing how frequently attacked centralized exchanges are.I think the only case where I'll justify leaving funds on a centralized exchange, is when the holder is a totally technologically-illiterate senior citizen. On the other hand, if the holder is capable of using a smartphone, chances are — he/she is capable of using a Ledger hardware wallet.But yea, you shouldn't lose your funds in self-custody if you aren't utterly careless.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "December 15, 2022, 07:26:34 PM",
      "body": "Quote“And also today, very fundamentally, if a person passes away, they don’t have a way to give to their next of kin. Whereas we have a standard operating procedure [for that].”Quite an outstanding feature, inheriting coins is almost impossible with self custody. Hence offering such a service will open a reason for and reinforce an unending debate in the crypto community; those that promote self custody and those that don't. The opposing sides can backup claims with the binance inheritance features. On the contrary, however, I'm glad the self custody campaign spreading on social media, forums and some blogs is highly effective. CZ himself is not only worried, but surprised that the people control this cryptocurrency world not just some specific individuals running against the will of the bitcoin creator. Satoshi wishes for self custody, and he must have thought about inheriting coins as well, but if a person passes out the whole community will inherit their coins not just his family. What will happen to the cryptocurrency community if someone inherits Satoshi's share of bitcoin?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "December 15, 2022, 07:44:10 PM",
      "body": "I won't say I disagree with his point because he makes an important point in this case. What is the point of storing your funds in a self-custody wallet when the coin is vulnerable to attack and lost by the owner? People have lost their savings in their personal wallet due to illiteracy and lack of sufficient knowledge about self-custodian wallets. A campaign for it is necessary which in my opinion will reduce the effect of it happening. Also, me seeing this as a favorable speech for people to save their money in his Binance exchange wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "foggyb",
      "created_time": "December 15, 2022, 07:48:29 PM",
      "body": "Quote from: mk4 on December 15, 2022, 06:50:12 PMWhile he has a slight point, I'm really not a fan of the 99% number, knowing how frequently attacked centralized exchanges are.I think the only case where I'll justify leaving funds on a centralized exchange, is when the holder is a totally technologically-illiterate senior citizen. On the other hand, if the holder is capable of using a smartphone, chances are — he/she is capable of using a Ledger hardware wallet.But yea, you shouldn't lose your funds in self-custody if you aren't utterly careless.It's actually pretty easy to lose a bitcoin wallet even if you're diligent. All it takes is forgetting your password or failing to discover a corrupted backup, and boom - your coins are gone. There isn't a bullet-proof solution that's going to work 100% of the time. Technology needs to take into account that no one is going to be a perfect custodian--ever. You may get lucky and your mistake won't be a costly one, but user error is basically inevitable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "December 15, 2022, 07:58:43 PM",
      "body": "Quote from: foggyb on December 15, 2022, 07:48:29 PMQuote from: mk4 on December 15, 2022, 06:50:12 PMWhile he has a slight point, I'm really not a fan of the 99% number, knowing how frequently attacked centralized exchanges are.I think the only case where I'll justify leaving funds on a centralized exchange, is when the holder is a totally technologically-illiterate senior citizen. On the other hand, if the holder is capable of using a smartphone, chances are — he/she is capable of using a Ledger hardware wallet.But yea, you shouldn't lose your funds in self-custody if you aren't utterly careless.It's actually pretty easy to lose a bitcoin wallet even if you're diligent. All it takes is forgetting your password or failing to discover a corrupted backup, and boom - your coins are gone. There isn't a bullet-proof solution that's going to work 100% of the time. Technology needs to take into account that no one is going to be a perfect custodian--ever. You may get lucky and your mistake won't be a costly one, but user error is basically inevitable. I think that's the kind of mistake you only make once though.  Early on in my Bitcoin experience I made the mistake of thinking that all my coins were held in my wallet so if I had my private key backed up I would be fine.  Then when my computer crashed I learned about change addresses and coin control.  I still have the crashed hard drive with what I estimate is tens of thousands or possibly hundreds of dollars worth of BTC on it.  Maybe someday I'll try and recover it.  The lesson I learned was far greater though.  I think a lot of people have these sorts of things happen, which is why Bitcoin's actual market cap is probably significantly lower than it appears, and also why so many coins never move...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "December 15, 2022, 08:02:30 PM",
      "body": "This assertion can be translated to: \"Only the 1% of the people in cryptocurrencies are responsible\", which to be honest might be a good approach. Legitimate, crypto bitcoin users are included in that 1%, de facto. So, if by 99%, he means the users who leave shitcoins in his exchange, who buy made-up useless tokens, and who don't know what's the point of cryptocurrencies to begin with? If that's so, I can agree with him.So, no! Instead of educating newcomers about wallet software, let's just accept they're irresponsible, uninformed, and let's just make them leave their coins to somebody else. Sounds rational.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "teosanru",
      "created_time": "December 15, 2022, 08:07:01 PM",
      "body": "Quote from: noormcs5 on December 15, 2022, 06:37:58 PMRecently, when people are withdrawing their money to personalized wallets, CZ says that  out of these people 99% of them will lose money, as only 1% of the people are capable of handling the non-custodial wallets.‘99% of People' Will Lose Crypto Storing in Self-Custody: Binance CEO Changpeng ZhaoHe may be right because most people do not understand the risk, if they are not careful they could lose all their crypto.  Some may lose their private keys and others may connect their wallet at scam sites and they will be deprived of their funds.Education and understanding of non-custodial wallets is necessary.  A lot of people have move funds out of binance recently, lets see if they know how to safeguard their bitcoin/ altcoins in these wallets.Oh C'mon the last person I would like to hear the opinion of on this issue would be Binance CEO, Obviously he would want everyone to still keep money on centralized wallets, truth is that with right education there is just 1% chance you might lose it. And even without education there will still be like only 20-30% of people who would be this foolish to do such a mistake, Obviously the dex wallets should have proper warnings for people and proper instructions in layman languages, I am sure that not 99% of the people are idiot enough to lose their private key in this way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "December 15, 2022, 08:25:03 PM",
      "body": "Quote from: noormcs5 on December 15, 2022, 06:37:58 PMRecently, when people are withdrawing their money to personalized wallets, CZ says that  out of these people 99% of them will lose money, as only 1% of the people are capable of handling the non-custodial wallets.What about you being the person in place of CZ, you would say more than this since that's the means to your survival and no one can seat down to be watching his business getting collapse right in his presence without finding a solution, the more reason why he made this statement, but we cannot runaway from central authorities and still falls in the hands of centralized exchanges, it makes no difference, not your keys not your coins period.Quote from: noormcs5 on December 15, 2022, 06:37:58 PMHe may be right because most people do not understand the risk, if they are not careful they could lose all their crypto.Thesame risk his own exchange has as well even more higher than having a non custodian wallet, since every individuals will be accountable to bear responsibility to his own wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "December 15, 2022, 08:28:52 PM",
      "body": "Quote from: mk4 on December 15, 2022, 06:50:12 PMWhile he has a slight point, I'm really not a fan of the 99% number, knowing how frequently attacked centralized exchanges are.99% is probably a sensationalist remark just to grab people's attention. In reality, that number would be much, much lower. Although, definitely a point to be made there.Quote from: mk4 on December 15, 2022, 06:50:12 PMI think the only case where I'll justify leaving funds on a centralized exchange, is when the holder is a totally technologically-illiterate senior citizen. On the other hand, if the holder is capable of using a smartphone, chances are — he/she is capable of using a Ledger hardware wallet. Honestly, using fiat with a bank is probably the best idea for these types of people. There's nothing wrong with that, I do think banks get criticized a lot around here, and while I would generally agree with that. Certain circumstances they might actually make sense, and I think the senior person who doesn't want to take responsibility for their own money, and have scam/fraud protection built in; makes a lot of sense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DooMAD",
      "created_time": "December 15, 2022, 08:46:03 PM",
      "body": "I guess he's including people who run exchanges in that figure.  After all, they arguably have the largest quantity of bitcoins in \"self-custody\".  If we think broadly about the term, that's exactly what exchanges do.  All funds deposited belong to them (users are just unsecured creditors).  They store the private keys for all those bitcoins.  Exchanges are quite literally doing self-custody.  And they don't have a very good track record.  No wonder he doesn't think ordinary people can do it when all of his contemporaries are clearly so abysmal at it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "December 15, 2022, 08:48:22 PM",
      "body": "Quote from: DooMAD on December 15, 2022, 08:46:03 PMI guess he's including people who run exchanges in that figure.  After all, they arguably have the largest quantity of bitcoins in \"self-custody\".  If we think broadly about the term, that's exactly what exchanges do.  All funds deposited belong to them (users are just unsecured creditors).  They store the private keys for all those bitcoins.  Exchanges are quite literally doing self-custody.  And they don't have a very good track record.  No wonder he doesn't think ordinary people can do it when all of his contemporaries are clearly so abysmal at it.   Try convincing them to store their Bitcoin with another exchange; its not going to happen. Wallets on an exchange should be a thing of the past now. There's been multiple discussions over the years about it, and I'd agree. It just doesn't make sense. Exchanges should be designed in such a way that you can't store anything on their platform. It's very likely that people start moving onto peer to peer exchanges with the constant downfalls of these centralised exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TechnoX_X",
      "created_time": "December 15, 2022, 08:48:48 PM",
      "body": "However I would only trust my personal non-custodial wallet rather than having to keep my funds in a centralized wallet. 99% Centralized wallets are more vulnerable to hacksAnd only a fool could lose the private key in their wallet containing their own funds",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "December 15, 2022, 09:02:56 PM",
      "body": "Quote from: TechnoX_X on December 15, 2022, 08:48:48 PMAnd only a fool could lose the private key in their wallet containing their own fundsI think that's a little unfair. Many people lose passwords, banking details. The only difference is there's a safety net with fiat. I imagine a lot of the Bitcoin that was in wallets in the early days has been lost due to mismanagement of their private key. Especially, before Bitcoin made it into the mainstream spotlight, and didn't balloon in price. I'd like to think that most people now know the importance of safeguarding the private key, but the reality is a lot of people are likely very lapse about it. Just as they're with other things when it comes to the security of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "December 15, 2022, 09:04:33 PM",
      "body": "Yeah, 99% is a bit self-serving, because there's going to be a lot of business in custodial services once they've milked institutional custody (and Quadriga tells us there are still plenty of businesses doing self custody as DooMAD says).Definitely have said so myself that it's not for everyone -- in which case, it's independent money and not so much Bitcoin that's not for everyone. Nothing wrong with that, but people should be able to make that choice, and have the awareness necessary to make that choice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "carlfebz2",
      "created_time": "December 15, 2022, 09:10:50 PM",
      "body": "Quote from: noormcs5 on December 15, 2022, 06:37:58 PMRecently, when people are withdrawing their money to personalized wallets, CZ says that  out of these people 99% of them will lose money, as only 1% of the people are capable of handling the non-custodial wallets.‘99% of People' Will Lose Crypto Storing in Self-Custody: Binance CEO Changpeng ZhaoHe may be right because most people do not understand the risk, if they are not careful they could lose all their crypto.  Some may lose their private keys and others may connect their wallet at scam sites and they will be deprived of their funds.Education and understanding of non-custodial wallets is necessary.  A lot of people have move funds out of binance recently, lets see if they know how to safeguard their bitcoin/ altcoins in these wallets.Wont be surprised that CZ would really be having those words considering that he owns Binance which is a centralized platform which most people been using up and since recently there's a huge pull out of fundsout of these exchangers then it isnt really that surprising that words would be coming out from his mouth but it is really just to exaggerated.He shouldnt really make himself that too obvious that he's bit disappointed on what currently users been doing.Well, he couldnt blame it out considering on what recently happened on FTX which it is really just normal to have those doubts and lost of trust with these platformswhich it is really just normal that they would be freaking out and pulling their funds out of exchangers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gantez",
      "created_time": "December 15, 2022, 09:17:29 PM",
      "body": "If except it is send to a wrong wallet which also is a mistake that can meet anybody whether to send to decentralised, centralised and personal wallet, the mistake can happen. It is better to keep coins in your personal wallet if you have not expose wallet address in public, hackers is what I think can be challenge for personal wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "December 15, 2022, 09:21:35 PM",
      "body": "CZ is promoting centralized exchange for his business benefits.  I don't agree with the 99% statistics.  This is just an exaggeration.  I still think that the number of people who lost money in exchanges is far more than the number of people who lost funds in self-custody.So my take on this is don't believe someone who has an ulterior motive when stating something.  In this case, CZ wants people to believe what he stated just to have people who move out of his exchange to redeposit and trust their funds to exchanges.  Just check how perfectly this statement timing is done to persuade or advise people to just let their funds sit in exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "December 15, 2022, 09:29:55 PM",
      "body": "Quote from: Asiska02 on December 15, 2022, 07:44:10 PMI won't say I disagree with his point because he makes an important point in this case. What is the point of storing your funds in a self-custody wallet when the coin is vulnerable to attack and lost by the owner? Funds in centralized exchanges are also vulnerable to attacks, but not just that, they are vulnerable to hacks, misappropriation, confiscation, inside job, total loss due to govt clampdown on the exchange, etc; CZ knows funds in centralized exchanges aren't safe, but he has said this to convince the unknowledgeable to continue 'banking' with him and Binance.Funds in self custody are safe so long as the owner is responsible enough to protect it, that is the only 'vulnerability' with self custody, you just need to learn how to store your money, no worries about confiscation, inside job, or other things that cause loss of funds in centralized exchanges, so between these two, it is obvious the choice people should go with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "December 15, 2022, 09:43:25 PM",
      "body": "He make sense and we've been telling people that it's best to keep their crypto assets to a non custodial wallet, wherein they have the full control of their funds.He said that personally after knowing that people are withdrawing and sending it to another exchange after the Binance FUD has been spread. Well, we need more CEO that are honest but not only when they're attacked.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}