{
  "id": "topic_5470972",
  "title": "Peter Faith",
  "author": "Peter Faith",
  "created_time": "October 19, 2023, 08:55:31 PM",
  "content": "The continues war and conflict around the world is something to worry about ... human lives is nolonger nothing even innocent children are not speared Properties are destroyed and the economy is getting worst by the day.Will there ever be peace ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470972",
  "comments": [
    {
      "author": "Hispo",
      "created_time": "October 19, 2023, 10:52:48 PM",
      "body": "Since the conflict in the middle east has worsened these days, I have noticed there is more common to see threads like this one, talking about war and conflict all around.Sure, it was bad enough with the senseless attack by Russia against Ukraine, it was an invasion which was a disgust to the world and the people who still believes in peace and love, and now we all got further disgusted by images of terrorists parading limb bodies of innocent concertgoers into Gaza and the suffering of thousands of civilians, because of a conflict they may have nothing to do with. During these dark times, it is easy to believe peace is not possible, but I still try to remain calm and pray when I can, for those who are trapped in the front lines...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "armanda90",
      "created_time": "October 20, 2023, 01:50:16 AM",
      "body": "Conflict interested to get freedom and life without have tragedy with their family and their home have been destroy by the enemy right now, I don't know why many people still blame what happen in Palestine every day thousand hundred people have been pas away. Its talking about religion is not totally true because latest news Christian Hospital become target by Israel and hundred people have been pas away, sadly with children don't know anything become the victim and they loss all their lovely. War have destroy anything but no body can't stop it, have business essential by selling gun machine seems make war as profitable business for some countries and they not try to stop war.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Peter Faith",
      "created_time": "October 20, 2023, 12:36:15 PM",
      "body": "Quote from: Hispo on October 19, 2023, 10:52:48 PMSince the conflict in the middle east has worsened these days, I have noticed there is more common to see threads like this one, talking about war and conflict all around.Sure, it was bad enough with the senseless attack by Russia against Ukraine, it was an invasion which was a disgust to the world and the people who still believes in peace and love, and now we all got further disgusted by images of terrorists parading limb bodies of innocent concertgoers into Gaza and the suffering of thousands of civilians, because of a conflict they may have nothing to do with. During these dark times, it is easy to believe peace is not possible, but I still try to remain calm and pray when I can, for those who are trapped in the front lines... looking at the world today I think everyone should hold tight whatever you believe in",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "October 20, 2023, 09:59:17 PM",
      "body": "Quote from: Peter Faith on October 19, 2023, 08:55:31 PMThe continues war and conflict around the world is something to worry about ... human lives is nolonger nothing even innocent children are not speared Properties are destroyed and the economy is getting worst by the day.Will there ever be peace ?A true peace globally? I think that's still far-fetched and I don't think we already achieve that as well considering the past great wars we can still see conflict and wars on other nations. I think these people are forgetting the lesson of the past wars, this is worrying now that nations upon nations has something up on their sleeves regarding weapon of mass destructions. There will never be peace, conflict will always be present.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "October 21, 2023, 01:27:45 PM",
      "body": "Quote from: Peter Faith on October 19, 2023, 08:55:31 PMThe continues war and conflict around the world is something to worry about ... human lives is nolonger nothing even innocent children are not speared If you're living in peace from where you are and there no any form of communal disputes, environmental challenges or natural disasters and epidemic, then learn to be grateful because all these things we are freely having couldn't be accessible by some people around the world because of the critical condition they have found themselves in.Quote from: Peter Faith on October 19, 2023, 08:55:31 PMProperties are destroyed and the economy is getting worst by the day.Will there ever be peace ?The only peace we should always seek after is the peace of mind, but no one has to give us this than ourselves, we need to care and show love to each other in other to make the world a better place, is there's peace of mind, everywhere will also be at peace with us to enjoy living.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "October 21, 2023, 03:54:19 PM",
      "body": "Quote from: Peter Faith on October 20, 2023, 12:36:15 PMQuote from: Hispo on October 19, 2023, 10:52:48 PMSince the conflict in the middle east has worsened these days, I have noticed there is more common to see threads like this one, talking about war and conflict all around.Sure, it was bad enough with the senseless attack by Russia against Ukraine, it was an invasion which was a disgust to the world and the people who still believes in peace and love, and now we all got further disgusted by images of terrorists parading limb bodies of innocent concertgoers into Gaza and the suffering of thousands of civilians, because of a conflict they may have nothing to do with. During these dark times, it is easy to believe peace is not possible, but I still try to remain calm and pray when I can, for those who are trapped in the front lines... looking at the world today I think everyone should hold tight whatever you believe inYes, of course.If one is a Christian, Jewish or Muslim, it does not matter. We are all supposed to pray for peace, because our personal believes are supposed to be based on it, on the respect of life and human decency.Though, I trust someday we could live through a predios of time when we should not see as many conflicts accumulating one over the other, complete peace may not be possible in out life time, but I just wish to see a little bit of it, so we won't longer talk about war and conflict for a while... May God help us all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "edmundduke",
      "created_time": "October 21, 2023, 05:07:30 PM",
      "body": "Quote from: Peter Faith on October 19, 2023, 08:55:31 PMThe continues war and conflict around the world is something to worry about ... human lives is nolonger nothing even innocent children are not speared Properties are destroyed and the economy is getting worst by the day.Will there ever be peace ?Will there ever be peace ? Maybe. One possibility is that AI and technology evolve to a point where we all become a hivemind. Then it is possible we reach some sort of peace.But in the current system its impossible. Even if we somehow managed to get everyone on the same footing economy wise, there are religions that are not compatable with others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "October 21, 2023, 05:17:35 PM",
      "body": "Quote from: Peter Faith on October 19, 2023, 08:55:31 PMThe continues war and conflict around the world is something to worry about ... human lives is nolonger nothing even innocent children are not speared Properties are destroyed and the economy is getting worst by the day.Will there ever be peace ?The world is filled with too much weapons of war,  now we see countries constantly announcing the nuclear weapons development and the rest of other firearms,  this all have its own reflections on the level of war that we have around the world and that also made me to believe the saying that,  where there are weapons,  there must be war,  and the only time the world will be at peace if ever or will,  is when there is global weapon control and how best to handle the already escalated weapon flooding that the various wars have triggered. Right from the First World War,  the crisis of weapon usage of development and the trade have increased and this has made war to become a thing that any group or country can easily start since they have a weapon available to use.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "October 21, 2023, 10:09:36 PM",
      "body": "Quote from: Peter Faith on October 19, 2023, 08:55:31 PMThe continues war and conflict around the world is something to worry about ... human lives is nolonger nothing even innocent children are not speared Even in the past, there's a bloody history for each country. That's how invaders took lands and now they're the ones living in peace and harmony from its roots and occupation of those lands. But seeing on television how lives are wasted, the innocent ones have been covered by debris of buildings that have been shot by rockets and missiles, it's so devastating and heartbreaking. These kids know nothing about war and this is the collateral damage that's being taken from these invading and bordering wars.Quote from: Peter Faith on October 19, 2023, 08:55:31 PMProperties are destroyed and the economy is getting worst by the day.Will there ever be peace ?IMHO, there's still some hope. We don't know when but I am sure that sometime in the future we'll get it. If most of the countries will just remove their beliefs and politics, I think that we'll all agree on one thing or if there's a disagreement, it can always be talked to. But that's not how it goes, some may see it as an impossible thing but there are still some countries that are living peacefully and have nothing against their nearby countries. These territorial and history of disputes will be passed onto the next generation and that's a sad thing that each other's side has their own stories to believe on and fight for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "October 22, 2023, 01:07:10 AM",
      "body": "Quote from: edmundduke on October 21, 2023, 05:07:30 PMQuote from: Peter Faith on October 19, 2023, 08:55:31 PMThe continues war and conflict around the world is something to worry about ... human lives is nolonger nothing even innocent children are not speared Properties are destroyed and the economy is getting worst by the day.Will there ever be peace ?Will there ever be peace ? Maybe. One possibility is that AI and technology evolve to a point where we all become a hivemind. Then it is possible we reach some sort of peace.But in the current system its impossible. Even if we somehow managed to get everyone on the same footing economy wise, there are religions that are not compatable with others.That is pretty much an apocalyptic sci-fi outcome to humanity, but ironically it is possible to happen thanks to whatever is going on with AI and the development of neuro-link: Elon Musk attempt to break the boundaries between computers and the human brain.Also, most conventional religions are some shared values, for example; most of them respect the human life, embrace peace and encourage people to treat others kindly, etc. I believe a world of peace it is possible to happen, but it won't be something which will happen in the short or midterm, it may not even happen during our lifetimes, but it is worth it for us to work so someday there will be no major conflict on the face of earth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "October 22, 2023, 06:17:24 PM",
      "body": "China just sent 6 warships to the Middle East, it really is getting worse and we may really be seeing an all-out war in the region. tension is running high. If I were from anywhere near that region, I would start moving out early morning tomorrow. Time to get ready I'd probably ride to Tibet. High ground  They chose war this time. The superpowers protecting their interest in that region and the citizens are dying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "October 22, 2023, 07:44:15 PM",
      "body": "Quote from: cabron on October 22, 2023, 06:17:24 PMChina just sent 6 warships to the Middle East, it really is getting worse and we may really be seeing an all-out war in the region. tension is running high. If I were from anywhere near that region, I would start moving out early morning tomorrow. Time to get ready I'd probably ride to Tibet. High ground  They chose war this time. The superpowers protecting their interest in that region and the citizens are dying. From what I read the story of China’s warships is being misreported and the ships have been there for nearly half a year now. The fact we’re sending a warship to seemingly threaten them makes me think that China is ready to make its move to exploit the weak Joe Biden administration. This will (hopefully) be the final disaster of the Biden Presidency and I hope the loss of life is kept at a minimum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uchegod-21",
      "created_time": "October 30, 2023, 07:18:06 PM",
      "body": "Quote from: Peter Faith on October 19, 2023, 08:55:31 PMThe continues war and conflict around the world is something to worry about ... human lives is nolonger nothing even innocent children are not speared Properties are destroyed and the economy is getting worst by the day.Will there ever be peace ?Every year we celebrate world peace day yet we still record wars  and rumours of war around the word, what an irony! As long as individual differences around the world are not recognised and appreciated,  world peace will only remain a fiction. The world is revolving. The interdependence between countries gave rise to a more peaceful coexistence but now, more and more countries are becoming more independent, reducing the bonds that existed between these countries. The activities of humans is having both positive and negative impacts in the world. Every year we hear different stories ranging from outbreak of diseases, natural disasters,  Coups to physical wars. Peace is only temporary, nowhere is safe. We all just need to help ourselves by staying safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Richbased",
      "created_time": "October 30, 2023, 09:12:54 PM",
      "body": "No matter how much dispute or disagreements people have with each other, war or conflict is not the best resolution. War is not something that anyone will wish to encounter as the severe suffering, loss of lives and property it brings is not a good one at all.Let's take a look at the current war now between Israel and Hamas, just look at the untold suffering Hamas has brought to residents in Gaza all because of carelessness and selfish motives, taking decisions without thinking about the circumstances of other people, the tension it's gonna create and all that it is not something anyone will wish to experience at all. Dialogue is what is required during a dispute rather than grievance and agitating for war.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Justbillywitt",
      "created_time": "November 07, 2023, 10:07:54 AM",
      "body": "There will never be a global peace. The best we can have is a regional peace. With the multi believes in the world. Racism and nepotism everywhere, religious intolerance etc. the global will only remain a dream. There has always been war and conflicts from time immemorial and I don’t see an end to this. I have come to conclude that war and conflicts are part of human existence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "November 07, 2023, 03:52:05 PM",
      "body": "Quote from: Peter Faith on October 19, 2023, 08:55:31 PMThe continues war and conflict around the world is something to worry about ... human lives is nolonger nothing even innocent children are not speared Properties are destroyed and the economy is getting worst by the day.Will there ever be peace ?We can only pray this was prophesied but this particular war between Israel and Hamas is very alarming because both sides don't hesitate to target civilians it's very disheartening to see parents carrying their dead children and children wounded asking in their innocent eyes what is happening.I think both sides forgot their human side, and their mindset shifted to wipe out their enemies or kill as many of their enemies as possible.This is worse than Covid I just hope all the other factions or countries will not participate that could lead to more wars in the Middle east.The Middle east is very important to many countries' economies because of the oil if a full war escalates there could be a global recession.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "November 07, 2023, 05:41:17 PM",
      "body": "Quote from: Peter Faith on October 20, 2023, 12:36:15 PMlooking at the world today I think everyone should hold tight whatever you believe inThe war in Gaza was a product of few bloodthirsty terrorists that have attracted death and suffering to innocent and law-abiding people of Palestine. Religious people like me will always pray to God for help, especially in situations that you don't have the power to control. As we keep having faith that these killings will end we should also prepare because we don't know the next country that will suffer from conflicts or natural disasters. This is not a time to struggle too much for money and give less attention to your personal life. Take out time and enjoy yourself with friends and family. Spend quality time on things that give you joy because the people of Turkey, Morocco and Syria never expected that they would experience earthquakes and Libya never knew that floods with kill thousands in a single day. Devastation and death have become a normal occurrence in the world so there is a need to maximize the time you have because nothing is certain anymore in this world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jegileman",
      "created_time": "November 09, 2023, 04:34:14 PM",
      "body": "Quote from: Peter Faith on October 19, 2023, 08:55:31 PMThe continues war and conflict around the world is something to worry about ... human lives is nolonger nothing even innocent children are not speared Properties are destroyed and the economy is getting worst by the day.Will there ever be peace ?For the time being, the war can be controlled, but peace does not appear to be on the horizon. What it takes to be peaceful is not easy, and I doubt the leaders will want it because they benefit the most from all of these battles. When a country is at war, the government has more time to take the country's resources for his own personal gain. War is awful, because it kills many young children's futures, their hopes, and their larger picture of a better future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hewlet",
      "created_time": "November 11, 2023, 09:10:39 PM",
      "body": "Before now, we've read and heard stories of wars that I feel might even be worse off compared to what you are seeing today. If you a religious person or you have ever read the Bible, you will find cases of serious wars that lead to the complete killing of a whole nation including children, woman and pregnant women. There had been cases when some persons received punishment because they refuse to whip up the whole nation but spared some people for reasons best known to them. This goes to show that war is not a new thing but just a continuation of what had existed before we even joined the world.The part that scarce me the most is how the value for human lives has dropped this much that killing has become a normal headline in most of our media outlet and what you see is more of figure with or no emphasises placed on it to indicate that this is actually peoples lives that is being taken away from the mostly what they know nothing about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}