{
  "id": "topic_5526482",
  "title": "TravelMug",
  "author": "TravelMug",
  "created_time": "January 14, 2025, 11:23:27 PM",
  "content": "Probably one of the first, if not the first mainstream media that has covered Bitcoin way back in 2011. And as you can see, the price is just around $3.00 that time and they have interviewed Mike Caldwell of Casascius coin.It's also worth nothing that they mentioned that it's not yet being used to buy a latte, but I think with LN it's possible to make this small transactions already as we have seen it in the last year or so.So this is truly a legendary video for Bitcoin enthusiast.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5526482",
  "comments": [
    {
      "author": "Dave1",
      "created_time": "January 15, 2025, 02:27:39 AM",
      "body": "Nothing has change though, still they put Bitcoin is some kind of bad light.And we have seen worst specially around 2018 wherein the news on Bitcoin was really that bad that we know that those who are writing about it doesn't know Bitcoin one bit and perhaps the publication just approved it without any verification.But for sure, it's nostalgic, as it shows the price around $3.00 and then the infamous Mt. Gox as the only exchanges that time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "January 15, 2025, 02:52:07 AM",
      "body": "Quote from: Dave1 on January 15, 2025, 02:27:39 AMNothing has change though, still they put Bitcoin is some kind of bad light. Will you really expect a mainstream platform to talk about bitcoin greatly before with nothing yet to show for it. Back then it was gaining value but I do not think many actually believed that it could reach to where it is now. Today though, I would say that a lot more people have started believing in bitcoin and more mainstream media can report all the greatness that is happening to bitcoin as it is. Because it is evident and to deny what is happening in front of our faces is delusional.QuoteBut for sure, it's nostalgic, as it shows the price around $3.00 and then the infamous Mt. Gox as the only exchanges that time.It will definitely be something we need to keep and something we have to show to the future generation when we try to recount the history of bitcoin. Any media from years before is important to keep.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AVE5",
      "created_time": "January 15, 2025, 03:33:46 AM",
      "body": "Quote from: Dave1 on January 15, 2025, 02:27:39 AMNothing has change though, still they put Bitcoin is some kind of bad light.And we have seen worst specially around 2018 wherein the news on Bitcoin was really that bad that we know that those who are writing about it doesn't know Bitcoin one bit and perhaps the publication just approved it without any verification.But for sure, it's nostalgic, as it shows the price around $3.00 and then the infamous Mt. Gox as the only exchanges that time.It takes a lot of courage to for reputable entities to stream about the potential values of bitcoin at when the coin hasn't been able to prove itself valuability.This earliest streamer couldn't be be recognized because people don't care about the origin of bitcoin rather than just concerned to how utilizing it'd be to them otherwise this exchange would be one of the most remarkable and recognized institutions that's around the crypto industry.We can imagine today's how exchanges awaits for crypto coins to be masterly plan by it developers down to the markets first be sure of it valuability because they could adopt to it's speculated as worth values while many of the nonsensical coins are being delisted from the exchange latter on if if coin hasn't been able to gain values.An accolade to this genius exchange for standing firm of it publicities of bitcoin even when it values was still seem worthless. Such indeed is a vision institution and Worth remarked as some others which has formally been given famouslism after this public awareness of this exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ancafe",
      "created_time": "January 15, 2025, 09:09:08 AM",
      "body": "Quote from: TravelMug on January 14, 2025, 11:23:27 PMProbably one of the first, if not the first mainstream media that has covered Bitcoin way back in 2011. And as you can see, the price is just around $3.00 that time and they have interviewed Mike Caldwell of Casascius coin. The media is multifaceted and they probably did their part as one of the news providers. The question is how hard did they push bitcoin to become what it is today and weren't they also one of the ones who always said negative things about bitcoin.Quote from: TravelMug on January 14, 2025, 11:23:27 PMIt's also worth nothing that they mentioned that it's not yet being used to buy a latte, but I think with LN it's possible to make this small transactions already as we have seen it in the last year or so.So this is truly a legendary video for Bitcoin enthusiast. These kinds of things happen and even bitcoin grew so fast beyond our imagination at first that it was basically not something that was interesting. Now there are a lot of people talking about bitcoin using their respective online platforms and I think it's much faster than some of the other online media outlets that are affiliated with news providers. Bitcoin can also be used to buy some things that people never thought of before even though it is not common in all countries.Let's just say they have done their little bit to make bitcoin grow like it is now and if there are still many people who can't see the truth then maybe certain people are not affiliated with something that is true based on the facts that have occurred.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "January 15, 2025, 09:55:42 AM",
      "body": "You got to love those early media coverage on Bitcoin though, LOL. So this video is like 14 years ago and still though, it's like it is still very much, and as Mike Caldwell says \"The value of the coin really means nothing compared to the technology!!\".Also mentioned, it is being used as design, sending money to point A to point B. And then it is being used to hide something. Probably this is the reason why early those days, there are a lot of resistant and even today on how government view it as something that criminals is using for it's (pseudo) anonymity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "January 15, 2025, 10:14:25 AM",
      "body": "Back in 2011 almost all media coverage on Bitcoin was ill informed & mostly negative. We have come a long way but even now lots of media coverage is negative. I don’t expect some finance moguls & media talking heads to ever be positive & give Bitcoin the credit it deserves but nothing can stop Bitcoin swallowing up trillions in capital.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fikrett",
      "created_time": "January 15, 2025, 10:17:10 AM",
      "body": "Quote from: Kemarit on January 15, 2025, 09:55:42 AMYou got to love those early media coverage on Bitcoin though, LOL. So this video is like 14 years ago and still though, it's like it is still very much, and as Mike Caldwell says \"The value of the coin really means nothing compared to the technology!!\".Also mentioned, it is being used as design, sending money to point A to point B. And then it is being used to hide something. Probably this is the reason why early those days, there are a lot of resistant and even today on how government view it as something that criminals is using for it's (pseudo) anonymity.Yep. Though honestly speaking, the biggest cloaks are on those who are in the fiat, yet many people out there choose to believe the crypto to be this haven for bad activities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "January 15, 2025, 10:21:57 AM",
      "body": "Quote from: kotajikikox on January 15, 2025, 02:52:07 AMQuote from: Dave1 on January 15, 2025, 02:27:39 AMNothing has change though, still they put Bitcoin is some kind of bad light. Will you really expect a mainstream platform to talk about bitcoin greatly before with nothing yet to show for it. Back then it was gaining value but I do not think many actually believed that it could reach to where it is now. Today though, I would say that a lot more people have started believing in bitcoin and more mainstream media can report all the greatness that is happening to bitcoin as it is. Because it is evident and to deny what is happening in front of our faces is delusional.Nothing to expect with mainstream since somehow their intention is to manipulate people mind and they are protecting those people who can serve their interest, so those people controlling those media is against it so expect that they also release some negative exposure on Bitcoin.But for sure people already know about it that's why even if there's lots of negative information released by these outlets and they link Bitcoin on many scam activities there are still lots of people using it. provably that lots of people know that Bitcoin is great and those outlet is just over exaggerated on their claims without having clear verification on what they are information they are releasing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FortuneFollower",
      "created_time": "January 15, 2025, 10:23:27 AM",
      "body": "Quote from: DeathAngel on January 15, 2025, 10:14:25 AMBack in 2011 almost all media coverage on Bitcoin was ill informed & mostly negative. We have come a long way but even now lots of media coverage is negative. I don’t expect some finance moguls & media talking heads to ever be positive & give Bitcoin the credit it deserves but nothing can stop Bitcoin swallowing up trillions in capital. Haters gonna hate. Always.Even when Bitcoin will be bigger and better than now, it will be this way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "January 15, 2025, 09:36:29 PM",
      "body": "Quote from: FortuneFollower on January 15, 2025, 10:23:27 AMQuote from: DeathAngel on January 15, 2025, 10:14:25 AMBack in 2011 almost all media coverage on Bitcoin was ill informed & mostly negative. We have come a long way but even now lots of media coverage is negative. I don’t expect some finance moguls & media talking heads to ever be positive & give Bitcoin the credit it deserves but nothing can stop Bitcoin swallowing up trillions in capital. Haters gonna hate. Always.Even when Bitcoin will be bigger and better than now, it will be this way.I wouldn't say that they are haters, the only haters that have seen is what we call perma-bears. Those who really wanted to bring Bitcoin down no matter what, and those mainstream media who published other assets like Gold. Not sure if you guys are familiar with Zero Hedge a financial blog and then the pen name \"Tyler Durden\", who was also a big critic of Bitcoin back then. I haven't followed the blog though for five years or so, so I don't know if he chances his stance on Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FruityQuencher",
      "created_time": "January 16, 2025, 06:06:19 AM",
      "body": "Great points, TravelMug! The media’s role in Bitcoin’s journey has definitely been a mixed bag. On one hand, they’ve provided exposure that helped Bitcoin gain recognition. On the other hand, many outlets quickly criticized or dismissed it in the early days, focusing on the negatives like volatility or its association with illegal activities. It’s ironic now that some of those same outlets praise its growth or cover it as a serious asset.You're spot on about Lightning Network (LN). It’s made microtransactions like buying a latte not only possible but practical. Adoption is still growing, but it’s exciting to see more real-world use cases emerge. Videos like the one you mentioned are legendary for showcasing Bitcoin’s potential and inspiring enthusiasts. They remind us how far Bitcoin has come despite skepticism. ReceiptifyUltimately, Bitcoin’s growth has been a combination of grassroots efforts, technological advancements, and yes, even a push (intentional or not) from media coverage. Those who still doubt it might just need more time or exposure to the.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "betswift",
      "created_time": "January 16, 2025, 07:24:39 AM",
      "body": "Quote from: kotajikikox on January 15, 2025, 02:52:07 AMIt will definitely be something we need to keep and something we have to show to the future generation when we try to recount the history of bitcoin. Any media from years before is important to keep.Agreed.And people ahead should not mourn the price we had or the possibility of using it - but to cherish what they would have now, currently under their noses.Because even then - it wouldn't be too late for Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}