{
  "id": "topic_5471456",
  "title": "Schnecke",
  "author": "Schnecke",
  "created_time": "October 24, 2023, 10:17:10 AM",
  "content": "Mahlzeit, ich frage mich gerade, ob ich irgendwas verpasst habe.In meiner Steuererklärung für 2021 habe ich den Verkauf von Bitcoin im Wert von ca 2000€ angegeben. Es ging um zwei Trades, Haltedauer war jeweils über ein Jahr.Sowohl in der Elster-Vorschau als auch in den Online-Bescheiddaten wird der Verkauf voll als zu versteuerndes Einkommen angerechnet, ich soll 430€ nachzahlen. Einen rechtsmittelfähigen Bescheid habe ich noch nicht.Hat sich hier etwas an der Rechtslage geändert, so dass die Haltedauer nicht mehr zählt?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471456",
  "comments": [
    {
      "author": "Milquetoast",
      "created_time": "October 24, 2023, 11:59:57 AM",
      "body": "So weit ich weiß hat sich nichts geändert. Wo hast du den Gewinn in der Steuererklärung angegeben?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "5tift",
      "created_time": "October 24, 2023, 12:31:36 PM",
      "body": "Das wäre mir auch neu das die ein Jahr haltefrisst nicht mehr zählt.Auch hier im Forum unter Bitcoin & die Steuer - FAQ wird das auch noch so kommuniziert.Wenn es da was neues geben sollte wäre ich auch an Neuigkeiten interessiert.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Milquetoast",
      "created_time": "October 24, 2023, 12:51:43 PM",
      "body": "Wenn sich etwas geändert hätte, wäre es groß durch die Medien gegangen. Und dann auch nicht rückwirkend für 2021. Meine Erklärung für 2021 ist schon lange durch, und da galt die Haltefrist. Wahrscheinlich hast du es als \"Einkünfte aus privaten Veräußerungsgeschäften nach § 23 EStG\" angegeben. Dann glaubt das Finanzamt, dass es zu versteuern wäre, und versteuert es halt auch.Ich bin mir auch nicht sicher, ob du es überhaupt angeben musst, da es ja nicht steuerpflichtig ist und somit gar nichts mit Versteuerung zu tun hat. In all diesen Fragen kann dir aber mit Sicherheit der Steuerberater deines Vertrauens weiterhelfen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxMueller",
      "created_time": "October 24, 2023, 02:49:40 PM",
      "body": "Quote from: Milquetoast on October 24, 2023, 12:51:43 PMWenn sich etwas geändert hätte, wäre es groß durch die Medien gegangen. Und dann auch nicht rückwirkend für 2021. Meine Erklärung für 2021 ist schon lange durch, und da galt die Haltefrist. Wahrscheinlich hast du es als \"Einkünfte aus privaten Veräußerungsgeschäften nach § 23 EStG\" angegeben. Dann glaubt das Finanzamt, dass es zu versteuern wäre, und versteuert es halt auch.Ich bin mir auch nicht sicher, ob du es überhaupt angeben musst, da es ja nicht steuerpflichtig ist und somit gar nichts mit Versteuerung zu tun hat. In all diesen Fragen kann dir aber mit Sicherheit der Steuerberater deines Vertrauens weiterhelfen.Denke auch genau das ist der Punkt. Wenn es unterjährig ist wird es angegeben, wenn es überjährig ist dann nicht. Gibst du es an, nimmt das FA an es wäre zu versteuernde Gewinne und versteuert entsprechend. Wenn es noch keinen Bescheid gibt würde ich nochmal einen Nachtrag zur Steuererklärung machen und das klarstellen (wahrscheinlich musst du dann die Transaktionen nachweisen). Wenn der Bescheid kommt geht das wohl nur noch über einen Widerspruch.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Real-Duke",
      "created_time": "October 24, 2023, 03:19:55 PM",
      "body": "Das tut mir beim lesen echt leid für dich @Schnecke. Erst machst Du dir die unnötige Arbeit, diese beiden Transaktionen in der Steuererklärung überhaupt zu erwähnen und dann soll man auch noch dafür bezahlen.Halte Dich einfach an die Tipps meiner Vorposter und weise denen die Transaktionsdaten anhand eines Auszuges der Bitcoin Blockchain nach. Zukünftig würde ich solche überjährigen Veräusserungen einfach nicht mehr angeben und falls es zu einer Nachfrage kommen sollte, einfach wieder den jeweiligen Blockchainauszug als Beweismittel angeben.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Real-Duke",
      "created_time": "October 24, 2023, 08:15:14 PM",
      "body": "Quote from: haloxon on October 24, 2023, 03:52:36 PMdu solltest vorab erwähnen, ob du in Ö, D oder CH steuerpflichtig bist. jeder schreibt/liest hier im \"Deutsch-Bereich\" unter seiner Landesbrille und Flagge - und es gibt doch gravierende Unterschiede im DACH-Bereich (zB hat sich in Ö was bzgl Haltefrist geändert).Ich bin ncht der TE und weiß persönlich gar nicht wirklich ob unsere Nachbarn in Österreich auch Elster für ihre Steuererkläung benutzen? Sorry, da wäre ich gerade überfragt.Aber die Steuer auf Gewinne aus Krypto Geschäften wurde dort erst im Februar 21 eingeführt und dürfte hier nicht relevant sein.Hoffentlich meldet sich der TE hier nochmal und klärt uns auf.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Schnecke",
      "created_time": "October 25, 2023, 10:08:43 AM",
      "body": "Danke erstmal für die Antworten. Ja, es geht um Deutschland.Den Bescheid habe ich heute erhalten und dort wird wie erwartet ebenfalls die Nachzahlung gefordert.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxMueller",
      "created_time": "October 25, 2023, 10:14:57 AM",
      "body": "Quote from: Schnecke on October 25, 2023, 10:08:43 AMDanke erstmal für die Antworten. Ja, es geht um Deutschland.Den Bescheid habe ich heute erhalten und dort wird wie erwartet ebenfalls die Nachzahlung gefordert.Ja, dann Widerspruch einreichen (die Widerspruchsfrist beachten) und dann die Sache erklären. Sprich dass die Gewinne der Coins eigentlich überjährig waren, du die da aber eingetragen hast weil du sie angeben wolltest, aber wahrscheinlich nicht hättes angeben müssen, weil steuerfrei, blabla....Und dann wirste ja sehen ob die das einfach so abändern oder ob die irgendwelche Nachweise haben wollen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Schnecke",
      "created_time": "October 25, 2023, 10:49:57 AM",
      "body": "Habe den Einspruch soeben über Elster eingereicht.Ich habe es tatsächlich nur vorsichtshalber angegeben, weil ich mehrfach gelesen habe, man sollte seine Verkäufe zur Sicherheit immer angeben und das Finanzamt würde dann schon feststellen, ob bzw dass sie tatsächlich steuerfrei sind. Wenn ich mich recht erinne, hat das für 2020 auch so funktioniert.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Real-Duke",
      "created_time": "October 25, 2023, 11:13:44 AM",
      "body": "Quote from: Schnecke on October 25, 2023, 10:49:57 AMHabe den Einspruch soeben über Elster eingereicht.Sehr gut! Jetzt brauchst Du nur abwarten, ob sie von dir noch Beweise zu den Transaktionen einfordern. Aber vielleicht bemerken sie ihren Fehler auch selbst Quote from: Schnecke on October 25, 2023, 10:49:57 AMIch habe es tatsächlich nur vorsichtshalber angegeben, weil ich mehrfach gelesen habe, man sollte seine Verkäufe zur Sicherheit immer angeben und das Finanzamt würde dann schon feststellen, ob bzw dass sie tatsächlich steuerfrei sind. Wenn ich mich recht erinne, hat das für 2020 auch so funktioniert.Als \"vorauseilender Gehorsam\" wurde ein solches Vorgehen hier auch schon im Forum betitelt.Ich werde das persönlich nie machen und falls es zu einer Nachfrage kommt, ist die Blockchain mein Freund und Helfer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mv1986",
      "created_time": "October 25, 2023, 08:04:32 PM",
      "body": "Quote from: Real-Duke on October 25, 2023, 11:13:44 AMQuote from: Schnecke on October 25, 2023, 10:49:57 AMHabe den Einspruch soeben über Elster eingereicht.Sehr gut! Jetzt brauchst Du nur abwarten, ob sie von dir noch Beweise zu den Transaktionen einfordern. Aber vielleicht bemerken sie ihren Fehler auch selbst Quote from: Schnecke on October 25, 2023, 10:49:57 AMIch habe es tatsächlich nur vorsichtshalber angegeben, weil ich mehrfach gelesen habe, man sollte seine Verkäufe zur Sicherheit immer angeben und das Finanzamt würde dann schon feststellen, ob bzw dass sie tatsächlich steuerfrei sind. Wenn ich mich recht erinne, hat das für 2020 auch so funktioniert.Als \"vorauseilender Gehorsam\" wurde ein solches Vorgehen hier auch schon im Forum betitelt.Ich werde das persönlich nie machen und falls es zu einer Nachfrage kommt, ist die Blockchain mein Freund und Helfer.Ich gebe hier Real-Duke grundsätzlich mal Recht und würde jetzt auch wie sinnvoll genannt keinen \"vorauseilenden Gehorsam\" empfehlen, aber sofern das Finanzamt das jetzt ohne große Probleme korrigiert, kann das auch zum Vorteil für @Schnecke laufen. Ich habe nämlich auch mal \"vorauseilenden Gehorsam\" an den Tag gelegt speziell in Sachen Monero und das hat im Endeffekt zu konstruktiven und auch vertrauensvollen Gesprächen geführt mit dem Finanzamt. Danach wurde bei mir nie wieder etwas angezweifelt oder spezielle Nachweisführung verlangt. Insofern will ich auch mal gegen den Strom schwimmen und hier das Positive etwas betonen!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lakai01",
      "created_time": "October 26, 2023, 11:55:59 AM",
      "body": "Quote from: Real-Duke on October 24, 2023, 08:15:14 PMIch bin ncht der TE und weiß persönlich gar nicht wirklich ob unsere Nachbarn in Österreich auch Elster für ihre Steuererkläung benutzen? [...]Nein, wir nutzen das Portal \"FinanzOnline\" des Bundesministeriums für Finanzen. Ich habs schon recht lange im Einsatz, funktioniert eigentlich recht zuverlässig und mittlerweile ist das auch so zugänglich, dass die Befüllung der erforderlichen Daten auch jemand schafft, der da nicht regelmäßig damit zu tun hat, bspw. für Arbeitnehmerveranlagungen (also zurückfordern von zu viel gezahlten Steuern am Jahresende) und co. So sieht das vom Stil her aus:QuelleGrundsätzlich zahlt sich aber durchaus ein Steuerberater bei umfangreicheren Steuererklärungen. Der haftet dann nicht nur im Fehlerfall sondern das FA winkt Steuererklärungen erfahrungsgemäß wesentlich einfacher durch wenn da ein Stempel eines Steuerberaters drunter ist. Quote from: Real-Duke on October 25, 2023, 11:13:44 AMIch werde das persönlich nie machen und falls es zu einer Nachfrage kommt, ist die Blockchain mein Freund und Helfer.Ich habe zumindest die Erfahrung gemacht, dass das für mich zuständige FA komplett planlos ist was Bitcoin und co betrifft. Die Daten bereitet man dann entweder sehr gut auf (was aber sehr viel Zeit kostet) oder gibt einfach einen Steuerbericht von Cointracking ab. Der ist so dermaßen umfangreich, dass keine Rückfragen mehr kommen ... auch wenn ich nicht daran glaube, dass das jemand im Detail nachrechnet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bct_ail",
      "created_time": "October 27, 2023, 01:50:47 PMLast edit: October 27, 2023, 02:12:58 PM by bct_ail",
      "body": "Quote from: Schnecke on October 24, 2023, 10:17:10 AMMahlzeit, ich frage mich gerade, ob ich irgendwas verpasst habe.In meiner Steuererklärung für 2021 habe ich den Verkauf von Bitcoin im Wert von ca 2000€ angegeben. Es ging um zwei Trades, Haltedauer war jeweils über ein Jahr.Sowohl in der Elster-Vorschau als auch in den Online-Bescheiddaten wird der Verkauf voll als zu versteuerndes Einkommen angerechnet, ich soll 430€ nachzahlen. Einen rechtsmittelfähigen Bescheid habe ich noch nicht.Hat sich hier etwas an der Rechtslage geändert, so dass die Haltedauer nicht mehr zählt?Es kommt in die Anlage SO (Sonstige Einkünfte) auf Seite 2 ab Zeile 42 (Andere Wirtschaftsgüter). Wenn du dort den Zeitpunkt der Anschaffung und den Zeitpunkt der Veräußerung richtig eingeben hast sowie den Veräußerungspreis und die Anschaffungskosten sollte die Finanzsoftware automatisch erkennen, wenn die Haltefrist größer als 1 Jahr ist. Den anderen TDabei kann es aber auch zu Fehlern auf beiden Seiten kommen. Wie hast du das denn genau eingetragen (insbesondere in Zeile 47 Gewinn/Verlust)? Vielleicht ist die Software mit den Haltedauern von Trade 1 und Trade 2 durcheinandergekommen. Oder hast du den zweiten Trade in gesonderter Aufstellung aufgelistet?Wie schon einige bemerkten, war es aber nicht notwendig diese Einträge zu machen:QuoteZeilen 41 bis 48In den Zeilen 41 bis 48 sind Veräußerungen von Wirtschaftsgütern zu erklären, die nicht Grundstücke oder grundstücksgleiche Rechte sind und bei denen der Zeitraum zwischen Anschaffung und Veräußerung nicht mehr als ein Jahr beträgt. Quelle: Ausfüllhilfe Anlage SO",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Schnecke",
      "created_time": "November 11, 2023, 11:37:00 AM",
      "body": "Hier wurde ja noch einiges geschrieben, da scheint wohl etwas mit meinen Benachrichtigungen schief zu laufen.Ich habe heute einen geänderten Bescheid vom Finanzamt erhalten, statt 430€ Erstattung und 300€ Verspätungszuschlag erhalte ich jetzt eine Erstattung. Es wurden keine Nachweise oder ähnliches gefordert. Ich hatte im Einspruch geschrieben, dass ich die Verkäufe nur vorsichtshalber angegeben habe und davon ausging, dass anhand der gemachten Angaben die Haltedauer von >1 Jahr ersichtlich wäre, so dass das Finanzamt die Steuerfreiheit auch offiziell feststellen würde.Quote from: mv1986 on October 25, 2023, 08:04:32 PMIch gebe hier Real-Duke grundsätzlich mal Recht und würde jetzt auch wie sinnvoll genannt keinen \"vorauseilenden Gehorsam\" empfehlen, aber sofern das Finanzamt das jetzt ohne große Probleme korrigiert, kann das auch zum Vorteil für @Schnecke laufen. Ich habe nämlich auch mal \"vorauseilenden Gehorsam\" an den Tag gelegt speziell in Sachen Monero und das hat im Endeffekt zu konstruktiven und auch vertrauensvollen Gesprächen geführt mit dem Finanzamt. Danach wurde bei mir nie wieder etwas angezweifelt oder spezielle Nachweisführung verlangt.Ich habe schonmal eine Nacherklärung machen müssen, weil ich in der Anfangszeit relativ viel gehandelt habe und nicht wusste, dass auch das Hin- und Hertauschen zwischen unterschiedlichen Kryptowährungen zu versteuern ist. Der Gewinn war zwar alles andere als weltbewegend, aber das Handelsvolumen war durch das ständige Hin- und Hertauschen von kleinen Beträgen deutlich im fünfstelligen Bereich. Damals hat das alles ein auf Kryptowährungen spezialisierter Steuerberater reibungslos geregelt und das Finanzamt war mit den recht umfangreichen Nachweisen zufrieden.Quote from: bct_ail on October 27, 2023, 01:50:47 PMVielleicht ist die Software mit den Haltedauern von Trade 1 und Trade 2 durcheinandergekommen. Oder hast du den zweiten Trade in gesonderter Aufstellung aufgelistet?Ich habe es in Anlage SO als zwei eigenständige Veräußerungen eingetragen, dabei wurde jeweils getrennt nach dem An- und Verkaufsdatum gefragt. Es hat schon in der Vorschau angezeigt, dass eine Nachzahlung fällig werden würde, aber es stand dabei, dass das nur eine vorläufige Berechnung wäre. Ich ging auch davon aus, dass man es bei der abschließenden Berechnung bemerken und korrigieren müsste.Das mit den Ausfüllhinweisen habe ich glatt übersehen. In Zukunft weiß ich jedenfalls, dass ich solche Verkäufe nicht angeben muss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Real-Duke",
      "created_time": "November 11, 2023, 12:57:07 PM",
      "body": "Quote from: Schnecke on November 11, 2023, 11:37:00 AMIch habe heute einen geänderten Bescheid vom Finanzamt erhalten, statt 430€ Erstattung und 300€ Verspätungszuschlag erhalte ich jetzt eine Erstattung. Es wurden keine Nachweise oder ähnliches gefordert.Hey Glückwunsch dafür:)Quote from: Schnecke on November 11, 2023, 11:37:00 AMIch hatte im Einspruch geschrieben, dass ich die Verkäufe nur vorsichtshalber angegeben habe und davon ausging, dass anhand der gemachten Angaben die Haltedauer von >1 Jahr ersichtlich wäre, so dass das Finanzamt die Steuerfreiheit auch offiziell feststellen würde.Beim Finanzamt arbeiten auch nur Menschen die (teure) Fehler machen können. Wahrscheinlich wurde genau das jetzt bemerkt und deshalb klemmen sie sich auch die Nachfrage zu irgendwelchen Belegen. Zur Not können sie das ja auch dank Blockchain jederzeit selbst einsehen.Ist auf jeden Fall schön, dass wir dir mit unseren Antworten helfen konnten",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bct_ail",
      "created_time": "November 13, 2023, 09:45:21 AM",
      "body": "Quote from: Schnecke on November 11, 2023, 11:37:00 AMIch habe heute einen geänderten Bescheid vom Finanzamt erhalten, statt 430€ Erstattung und 300€ Verspätungszuschlag erhalte ich jetzt eine Erstattung.Das ist doch klasse und zeigt, dass man sich mit dem Bescheid auseinandersetzen sollte. Viele machen das leider nicht (die ich so kenne) und \"vertrauen\" auf die Richtigkeit.Quote from: Schnecke on November 11, 2023, 11:37:00 AMIch habe es in Anlage SO als zwei eigenständige Veräußerungen eingetragen, dabei wurde jeweils getrennt nach dem An- und Verkaufsdatum gefragt. Es hat schon in der Vorschau angezeigt, dass eine Nachzahlung fällig werden würde, aber es stand dabei, dass das nur eine vorläufige Berechnung wäre. Ich ging auch davon aus, dass man es bei der abschließenden Berechnung bemerken und korrigieren müsste.Eingetragen hast du es über das Elster-Portal? Jedenfalls scheint die zugehörige Software mit den Eintragungen nicht ganz klar zu kommen. Umso besser, dass du das selber bemerkt hast.Quote from: Schnecke on November 11, 2023, 11:37:00 AMDas mit den Ausfüllhinweisen habe ich glatt übersehen. In Zukunft weiß ich jedenfalls, dass ich solche Verkäufe nicht angeben muss.Ja, genau. Warum soll man das Finanzamt mit Arbeit \"belästigen\"?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Milquetoast",
      "created_time": "November 13, 2023, 09:56:16 AM",
      "body": "Quote from: Schnecke on November 11, 2023, 11:37:00 AMIch habe heute einen geänderten Bescheid vom Finanzamt erhalten, statt 430€ Erstattung und 300€ Verspätungszuschlag erhalte ich jetzt eine ErstattungIn einem solchen Fall solltest Du über eine kleine Spende an den Betreiber des Forums nachdenken.NEIN, ich bin nicht der Betreiber.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "willi9974",
      "created_time": "November 25, 2023, 08:23:48 AM",
      "body": "Glückwunsch auch von meiner Seite. Ich hatte gerade ein sehr schlechtes Gefühl (also auch für mich als HODLer), als ich den Beitrag gelesen habe. Gottseidank ein kleiner Fehler und alles beim alten, 1 Jahr halten und fertig.Drücke alles HODLer die Daumen auf ein baldiges neues ATH und unkompliziertes auscashen, wer es machen will.Viele GrüßeWilli",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Real-Duke",
      "created_time": "November 25, 2023, 09:52:51 AM",
      "body": "Quote from: Milquetoast on November 13, 2023, 09:56:16 AMIn einem solchen Fall solltest Du über eine kleine Spende an den Betreiber des Forums nachdenken.Bekommt @Schnecke dann auch eine Spendenbescheinigung von theymos ausgestellt, oder übernimmst Du das? Ich denke, dass war nur aus Spaß gemeint. Wäre ja noch schöner, wenn man hier für Hilfe direkt etwas bezahlen müsste. Dann könnte man auch gleich zum Steuerberater gehen.Quote from: willi9974 on November 25, 2023, 08:23:48 AMDrücke alles HODLer die Daumen auf ein baldiges neues ATH und unkompliziertes auscashen, wer es machen will.HODLN macht für uns aus DE das Leben mit dem Finanzamt einfacher, daher volle Zustimmung!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}