{
  "id": "topic_5466829",
  "title": "iBaba",
  "author": "iBaba",
  "created_time": "September 14, 2023, 08:28:15 PM",
  "content": "Niger State where I come from, one of Nigeria's nineteen northern states and known for its vast landmass, is not isolated from the challenges facing the region. According to statistics, the unemployment rate in Nigeria is on the rise as shown in the statistical diagram below. The northern part of Nigeria also contribute to the rate of unemployment and a significant lack of skills among young people.SourceFollowing the 2023 general elections, Niger State formed a new government with a clear agenda and manifesto to promote and support technology hubs across the state. This commitment was later extended to encompass the financial technology (Fintech) sector.SourceSince I joined this forum, I have been encouraged to take the knowledge I have gathered over here and in life to my people especially to my younger ones back home having recognized the global adoption of Bitcoin technology, I took the initiative to propose to the state Governor the introduction of Bitcoin technology into our secondary school system as a core entrepreneurship subject.By introducing Bitcoin technology, it will benefit our students in so many ways. Firstly, it will equips them with essential skills for the future. In an increasingly digital world, understanding cryptocurrencies and blockchain technology is becoming crucial. If the government can implement my initiative of providing this knowledge at the secondary school level, we will empower our students to be more competitive and prepared for the evolving market.Submission of Proposal Letter and My Visit to the Governor's OfficeOn September 12, 2023, at around 11 AM, I submitted my letter of proposal to the Governor and with the help of the Chief of Staff and through our cordial relationship, we were invited to meet with the Governor on September 13, 2023.  The images above shows the written proposed letter, when it was submitted and the final acknowledge copy.The Governor's CommendationYesterday being the September 13, 2023, I had the privilege of meeting with the Governor himself. During my meeting with His Excellency, the Governor expressed keen interest in my innovative idea and commended my efforts. He called it a laudable effort that will bring about a monumental technological advancement to the state.He assured me that he would consider my proposal and pledged to include technological advancements like this in his future policies. As a sign of his support and encouragement, the Governor extended an executive handshake.  Taking Executive handshake with my State GovernorMy plan on how to make this a reality should the governor gives a call back for implementation1. We would organize a retreat with the relevant government and non governmental stakeholdersAim: To enlighten the governor and other stakeholders on the fundamental knowledge they need to know about the Bitcoin technology.Process: We will invite Bitcoin experts within and outside the state to attend this retreat programme as panelists as we pick and discuss the relevant topics.2. Upon the success of the retreat programme, we will organize a Train-the-Trainer bootcamp programme.Aim: From the independent research  I've been able to gather that there are about 500 secondary schools in Niger state. To get at least 2 teachers per school trained on how the Bitcoin technology operate wherein the secondary school teachers captured to carry out the trade subject across various schools will be trained on the basic knowledge of the Bitcoin technology. This is similar to the CISCO Networking Academy Program implemented in various unity schools.Process: Invite resource persons to the state to train the trainers who are in turn the teachers that will go into the classes.These are the plans i have mapped out should the governor gives a call back for implementation. I am open to more suggestions on this forum to commiserates my ideas in actualizing this.In conclusion, my proposal to integrate Bitcoin technology into secondary school education in Niger State has received a positive response from the state government. I am optimistic that this initiative will not only provide valuable skills to our youth but also contribute to the broader goal of promoting technology and entrepreneurship in our region. As I eagerly await further developments, I remain committed to working towards a brighter and more technologically advanced future for my state and my country at large.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466829",
  "comments": [
    {
      "author": "Stepstowealth",
      "created_time": "September 14, 2023, 08:34:30 PM",
      "body": "A child in Secondary school is more than qualified to have some information about bitcoins. It can really help them to make decisions earlier. If the state has a young governor who understands the benefits that the knowledge of bitcoins and cryptocurrency will have on the children of the state will not delay in accepting this proposal to have it introduced to secondary school students. I really like it. When I joined this forum, I was inspired to make promotional stickers for bitcoin, it helped a lot of people, this your initiative and plan will help a lot more people and a good thing is that it is from an early age.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pokapoka124",
      "created_time": "September 14, 2023, 08:43:49 PM",
      "body": "Why cover the face of the Governor if the information is already public knowledge and you’re still going cite the source where you got the photo from? I’m from Nigeria and I know how difficult it is as a constituent to meet with our representatives in government, much more a Governor of a state. It makes me wonder on what capacity did you visit the Governor? Are you also a politician or just a concerned citizen with a vision for the state. If it’s the later, I doubt your story because I know my country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "September 14, 2023, 09:32:10 PM",
      "body": "This is impressive move ops,  pushing for Bitcoin adoption by government is one fight that needs all the encouragement and seeing that you went as far as booking an appointment with the governor is an awesome move. I can see that is easy to access government officials in your region and I encourage you to take out the time to properly educate the governor on the importance of allowing Bitcoin as an alternative.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "September 14, 2023, 09:36:26 PM",
      "body": "That is very cool, iBaba!Your name may have just been written down as a major character in the Nigerian history of Bitcoin. And for quite the impressive feat, as well! Governments usually do not want to hear about Bitcoin or cryptocurrency. They turn it down, out of ignorance. But sooner or later the smarter ones will come out on top and lead their individual countries toward a happy future with Bitcoin as the global money.+5 Merits!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "September 14, 2023, 09:42:04 PM",
      "body": "This is a great initiative OP, going as far as having personal meeting with your governor shows how good and important you take your people to have a knowledge of the evolving technology today that the world is developing into. You have truly contributed your quota to global bitcoin acceptance. I hope your government looks into this further and makes it a reality for his people. Nigeria is renowned for having a high level of interest in bitcoin and cryptocurrency amongst the African countries, this is a fantastic step, and I highly applaud your efforts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "September 14, 2023, 09:43:59 PM",
      "body": "Good work mate, I hope your efforts yields fruit, but we are from the same country and we can both agree that the government are not the keen type to adopt things that would be beneficial for their citizens quick.Here is some fact, you don't actually need the government to make moves although the steps maybe small but it would be productive, keep educating those who are interested about Bitcoin and the benefits it has to offer over the traditional financial system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "September 14, 2023, 09:50:52 PM",
      "body": "There are many misconceptions about the northern part of Nigeria, it’s been stereotyped as a region where education isn’t valued as a priority but your post tells me otherwise. I’m glad to hear that the government was very open to your suggestions. I must commend you for making good use of your influence and connections to help spread awareness of bitcoin and cryptocurrency. It’s important that people get the right information to kickstart their bitcoin journey.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "September 14, 2023, 09:52:58 PM",
      "body": "Great initiative @OP, we need more people like you!  Walking the talk of participating in Bitcoin adoption and promulgation.   It is really a wise move to go to the leader of the city in order to implement Bitcoin learning to schools in your city.  However, I wonder if the governor has the authority to implement changes in the education curriculum since in my country there is a designated office that is responsible for modifying the school curriculum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "September 14, 2023, 09:56:52 PM",
      "body": "Great initiative, mate. You did a very good job taking this bold step to approach the government of a state and propose such a great idea about teaching secondary school students Bitcoin technology. I hope the government implements it soon so that our brothers in secondary schools can learn about Bitcoin.I lack smerits; I could have sent you some, but the only one I have can still show my appreciation for your quality time and engagement towards the development of Bitcoin technology in Niger State. NigeriaQuote from: Pokapoka124 on September 14, 2023, 08:43:49 PMWhy cover the face of the Governor if the information is already public knowledge and you’re still going cite the source where you got the photo from? I’m from Nigeria and I know how difficult it is as a constituent to meet with our representatives in government, much more a Governor of a state. It makes me wonder on what capacity did you visit the Governor? Are you also a politician or just a concerned citizen with a vision for the state. If it’s the later, I doubt your story because I know my country. People do make an effort to make things work in our country. Not only politicians have the chance to see the governors, but I think if you have a good proposal, you will also find your way to see the governor in order to get what you want.The OP’s effort is to try his best and see if the government can look into the proposal he/she makes, and if the government implements it, it will be a very good one, and we will hope our younger ones, once in secondary school, benefit from it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "September 14, 2023, 09:57:20 PM",
      "body": "@OP, You've done well. I like this proposal given the fact that it would go a long way to help young people in the north if it is implemented correctly and effectively.North is one of the areas where people default to mainstream farming rather than technology or fintech. If done right, This proposal could produce more jobs i.e if beneficiaries from the initiative go on to start a firm or a business thar supports bitcoin/crypto and it creates opportunities for others, then it's a win-win.More awareness for Bitcoin + Boundless opportunities for beneficiaries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "September 14, 2023, 10:05:28 PM",
      "body": "What I admire most is you using your position to hint on an initiative that is tried, tested and approved by even countries. Your state government should be proud of such courageous proposal to cater for the rising inflation and cost of living in the state.If more follow up post on how it proceeds arises, please don't fail OP to share with us, so as to encourage us on our Bitcoin journey and campaigns.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "September 14, 2023, 10:29:07 PM",
      "body": "OP you have done well to have met with the governor of your state.  I know what is obtainable and likewise what is involved meeting with the governor but however it is nice you achieved your goal. Taking bitcoin technology to the class room as part of the term curricular is very much impressive and commendable.  I believe there is no law against bitcoin in Nigeria so your proposals would definitely scale through as I see from the looks your governor looks friendly and listens to his people if not I do not think he would have demanded to have an audience with you. You can make good use of this opportunity to climb the lader up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panganib999",
      "created_time": "September 14, 2023, 10:45:28 PM",
      "body": "Quote from: Pokapoka124 on September 14, 2023, 08:43:49 PMWhy cover the face of the Governor if the information is already public knowledge and you’re still going cite the source where you got the photo from? I’m from Nigeria and I know how difficult it is as a constituent to meet with our representatives in government, much more a Governor of a state. It makes me wonder on what capacity did you visit the Governor? Are you also a politician or just a concerned citizen with a vision for the state. If it’s the later, I doubt your story because I know my country.  That's the least of your issues. I think this is legitimate, there's no reason why it shouldn't be after all. Regardless if he has a position in the government, it doesn't make it any less amazing that someone from their country took the initiative to introduce bitcoin and hopefully bring it to the public in a manner that sells it as a helpful aid especially as we transition towards a more digitalized work landscape. This positions Nigeria at the forefront of the change despite not being on the most advanced part of the world. I want to see more updates about this monumental move towards adoption and of course a better life for every Nigerians as we transition to web3.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "September 14, 2023, 11:09:38 PM",
      "body": "Quote from: Pokapoka124 on September 14, 2023, 08:43:49 PMI’m from Nigeria and I know how difficult it is as a constituent to meet with our representatives in government, much more a Governor of a state. It makes me wonder on what capacity did you visit the Governor? Are you also a politician or just a concerned citizen with a vision for the state. If it’s the later, I doubt your story because I know my country. What you had mentioned is none of your or our concern, the fact that the suggestion/proposed letter was forwarded and received by their office is already commendable. In fact it's great initiative of your people no matter how you look at it.About the suggestion, what is the particular matter to be discussed/learned on that subject/program? When you say bitcoin technology, does it mean the technology/programming behind? It's much complicated IMO if there is no basic programming subject teaching there.Or the basics on how bitcoin works, transactions, the financial knowledge, etc? Because if you mean the financial part, better to have a financial literacy subject/program as well on that curriculum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "September 14, 2023, 11:13:35 PM",
      "body": "I must say you are very lucky to have an easy access to your state representative I mean your governor, in Rivers state I don't think we have such privileges to have access to the government house talk less of book an appointment with the governor. Well there's no doubt that the way the northerners operate may not be same with the East so I am not surprised. Then again, I don't think is something your governor should approved without the entire academic system of the country implementing it, meaning this order should come from federal government and if that happens all states can also add it their curriculum and that becomes automatically for secondary schools in our country to start teaching about bitcoin and it's related course to their own level at the main time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "September 14, 2023, 11:21:01 PM",
      "body": "That's a great initiative made by the OP, it seems you're close to the state governor, right?    That's very lucky.As we know Bitcoin also has a negative outcome, your state government will need to carefully consider the risks associated with adopting and holding cryptocurrencies like Bitcoin, it should be balanced on teaching not only the benefits.Waiting for the result of your proposal, and please, update us here on whether it is successful or not.It's encouraging other countries that still prohibit Bitcoin to wrong perception, it seems they need a good representative like OP.That's great and good luck with your proposal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "September 14, 2023, 11:38:22 PM",
      "body": "Quote from: sheenshane on September 14, 2023, 11:21:01 PMThat's a great initiative made by the OP, it seems you're close to the state governor, right?    That's very lucky.As we know Bitcoin also has a negative outcome, your state government will need to carefully consider the risks associated with adopting and holding cryptocurrencies like Bitcoin, it should be balanced on teaching not only the benefits.Waiting for the result of your proposal, and please, update us here on whether it is successful or not.It's encouraging other countries that still prohibit Bitcoin to wrong perception, it seems they need a good representative like OP.That's great and good luck with your proposal.and also, not many crypto enthusiasts will do such initiative. so hopefully, there will be positive outcome on his endeavour. if he will keep up, but in case, the governor may not really push thru on this. at least, they have idea that someone in their country is already in this market. who knows, they will tap the OP to conduct some briefings or lecture on this matter. because a lot are still uninformed on this market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "September 15, 2023, 01:00:48 AM",
      "body": "Quote from: AmoreJaz on September 14, 2023, 11:38:22 PMand also, not many crypto enthusiasts will do such initiative. so hopefully, there will be positive outcome on his endeavour. if he will keep up, but in case, the governor may not really push thru on this. at least, they have idea that someone in their country is already in this market. One of the obvious reasons is that bureaucracy is a tedious process. In my country at least, unless you live near the capital it would be difficult to meet or propose initiatives to the government. Not to mention you still have to wait and if you're not lucky prepare to get disappointed because your representative doesn't have the time to meet you after months of waiting. Fortunately, internet and social media make it easier to raise issues and awareness without any of that. OP's effort might not yield any result, but his documentation could be useful if anyone will bring this issue to the public in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "September 15, 2023, 02:06:40 AM",
      "body": "Amazing OP!I couldn't believe that there's someone that will go this far and will even get the attention of your government and even youre state governor. It seems that everything is organized well and you're doing a good job on this one.Honestly, it's not easy to have some talks and handshakes from these officials when you don't have the grit and you think of them as always busy bees.Well done, really great job.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}