{
  "id": "topic_5451117",
  "title": "Dzigie",
  "author": "Dzigie",
  "created_time": "May 03, 2023, 03:41:19 PM",
  "content": "New York Borsası’nda Türk bayrağını dalgalandırmaya hazırlanan Martı, bu tarihi dönüm noktasında şirketi bugünlere getiren çalışanlarını da unutmadı. Martı'dan yapılan açıklamaya göre, şirket, 4 yıl içinde dünyanın en büyük mobilite şirketlerinden biri olma başarısında en büyük paya sahip olan çalışanlarını New York Borsası’nda halka açılmayla birlikte hissedar yapma kararı aldı.https://www.ekonomist.com.tr/sirketler/marti-calisanlarina-200-milyon-tl-degerinde-hisse-verdi-409071 Mayıs İşçi ve Emekçiler Bayramı ile aynı günlere denk gelmesi harika bir olaya dönüştürmüş bu haberi. Martı CEO'su Oğuz Alper Öktem eski röportajlarında paylaşımcı ekosistemleri öven biri. Yaratmaya çalıştığı sistem de paylaşımcı bir ekosistem. Hayat görüşünü kendi firmasında uygulaması çok harika olmuş. Özü ve sözü bir olan insan gibi davranmış ve düşüncesinin arkasında durduğunu ispat etmiş. Bütün zenginler onun gibi olsa dünya cennet gibi bir yer haline gelir. Hepsi onun gibi olmasa yarısı onun gibi olsa dünya daha güzel bir yer haline gelir. Parayı kazanırken omuz omuza verdikleri insanları parayı harcarken de hatırlasalar keşke.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451117",
  "comments": [
    {
      "author": "ajanwalker",
      "created_time": "May 03, 2023, 04:59:36 PM",
      "body": "Bu martı bizim bildiğimiz pansiyon işi yapan şirket mi yoksa aynı isimde farklı bir şirket mi açıldı?Bundan 9-10 yıl önce dikkatimi ara ara çekerdi ama o zaman spekülasyona açık bir kağıttı. Tabi o hisse ise.Yatırımcısına bu şekilde temettü dağıtan ( bu temettü değil belki ama) hisseler yatırımcıyı cezbeder. Bravo Martı'ya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "May 03, 2023, 05:27:25 PM",
      "body": "Uzun vadeli elde tutulacak bir hisse değil bu şirketlerin geleceği bile meçhul.Avrupa'da olduğu gibi Türkiye'de de bu martı vb. araçların yasaklanması lazım trafiği öyle bir tehlikeye sokuyorlar ki kaza oranları ciddi şekilde arttı. Gördükleri her yere park edip kaldırımı otopark önünü ve bilimum kamusal alanı işgal ediyorlar acilen buna yaptırım gelmesi gerekir. Kamusal düzen tekrar sağlandığında bu yaptıkları gaspların karşılığı cezalar kesilecektir diye umuyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzigie",
      "created_time": "May 03, 2023, 05:39:38 PM",
      "body": "Quote from: ajanwalker on May 03, 2023, 04:59:36 PMBu martı bizim bildiğimiz pansiyon işi yapan şirket mi yoksa aynı isimde farklı bir şirket mi açıldı?Bundan 9-10 yıl önce dikkatimi ara ara çekerdi ama o zaman spekülasyona açık bir kağıttı. Tabi o hisse ise.Yatırımcısına bu şekilde temettü dağıtan ( bu temettü değil belki ama) hisseler yatırımcıyı cezbeder. Bravo Martı'ya.2018 yılında kurulan Türkiye'nin öncü ve tek ölçeklenmiş mobilite şirketi Martı, e-scooter, e-mobilet ve e-mopedlerden oluşan filosuyla kendi IOT altyapısını ve yazılım sistemlerini üretiyor.https://www.marti.tech/about/Bahsettiğiniz şirket ile bir alakası yok. Martı, scooter paylaşım uygulaması. Sahibi Oğuz Alper Öktem genç bir girişimci. Türkiye'nin Elon Musk'ı olabilecek kadar zeki biri. Fakat ben onu girişimci ruhu sebebiyle takip etmiyorum. Paylaşımcı sistemlere olan inancını hem sözleriyle hem de uygulamalarıyla desteklediği için takip ediyorum. Haftada 45-60 saat arası çalışıp arabamızın kredisini ödüyoruz. Sosyalleşmek ve kredi borcunu ödediğimiz aracı kullanmak için haftalık 10 saatimiz bile kalmıyor çoğu zaman. Dünyada 8 milyardan fazla insan var. 8 milyar insan bunu yapsa kredi ve borçlanma maliyetleri ve yaşam kalitesi inanılmaz ölçüde düşer ama en önemlisi dünyadaki 8 milyar insan bunu aynı yapamaz bile.Neden 8 milyar insan olarak araçlarımızı paylaşmıyoruz? Neden özel mülkiyete bu kadar düşkünüz? Özel mülkiyet yerine paylaşım özellikleri daha yüksek ekosistemler geliştiremez miyiz?Quote from: LGD2Business on May 03, 2023, 05:27:25 PMUzun vadeli elde tutulacak bir hisse değil bu şirketlerin geleceği bile meçhul.Avrupa'da olduğu gibi Türkiye'de de bu martı vb. araçların yasaklanması lazım trafiği öyle bir tehlikeye sokuyorlar ki kaza oranları ciddi şekilde arttı. Gördükleri her yere park edip kaldırımı otopark önünü ve bilimum kamusal alanı işgal ediyorlar acilen buna yaptırım gelmesi gerekir. Kamusal düzen tekrar sağlandığında bu yaptıkları gaspların karşılığı cezalar kesilecektir diye umuyorum.Trafik yalnızca dört tekerlekli motorlu araçların alanı değildir. Orada motorsikletlilerin ve bisikletlerin de en az otomobiller kadar bulunma hakkı var. Trafiği tehlikeye sokan da taşıtların türleri değildir. Taşıtların sürücüleridir. Türkiye'de her yıl yüzlerce motorcu trafiğin yalnızca kendisine ait olduğunu zanneden otomobil sürücüleri yüzünden vefat ediyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "onurgozupek",
      "created_time": "May 03, 2023, 06:25:51 PM",
      "body": "Quote from: Dzigie on May 03, 2023, 05:39:38 PMNeden 8 milyar insan olarak araçlarımızı paylaşmıyoruz? Neden özel mülkiyete bu kadar düşkünüz? Özel mülkiyet yerine paylaşım özellikleri daha yüksek ekosistemler geliştiremez miyiz?Çünkü insanlar, istedikleri zaman istedikleri kadar kullanabilmek için araba satın alırlar. Kiralık arabaya ulaşabilmek için 2km yol gideceksem, gece yarısı çocuğumu hastaneye götürmem gerektiğinde civarda 1 tane bile kiralık araç bulamayacaksam, aracı alırken ve bırakırken 10 dakika boyunca fotoğraf çekmek zorunda kalacaksam, neden araç kiralama ile uğraşayım? Taksi çağırırım. Paylaşımlı araçları değil toplu taşıma araçlarını, taksileri artırarak 7/24 çalışır hale getirseler, o araçlara da ihtiyaç olmazdı araba almaya da gerek olmazdı.İnsan gibi ulaşabilmek istiyoruz. Metrobüs denen ucube ile 400 kişiyle kucak kucağa 1,5 saat eziyet çekmek yerine kendi arabasıyla 3 saat trafik çekmeye razı olanlar var. Ama gönül isterdi ki, o yolu 30 hadi bilemedin 60 dakikada gidebilelim. Ama olmuyor. Olmadığı için de araç paylaşımını, toplu taşımayı, taksileri (hatta Bursa'daki gibi \"dolmuş taksi\"leri) yaygınlaştırmak gerek.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "May 03, 2023, 06:27:40 PM",
      "body": "QuoteTürkiye'nin Elon Musk'ı olabilecek kadar zeki biri. yurtdışında olan bir ürünü ülkeye getirmek mi elon musk yapıyor insanı? yapmayın hocam allah aşkına. yapılan harekete gelecek olursak çok güzel. amerika'daki startup firmalarında genelde bunu görüyoruz. hatta tamamen yeni olan firmalar bu şekilde finansmanını çeviriyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "May 03, 2023, 07:00:38 PM",
      "body": "Quote from: Dzigie on May 03, 2023, 05:39:38 PMTrafik yalnızca dört tekerlekli motorlu araçların alanı değildir. Orada motorsikletlilerin ve bisikletlerin de en az otomobiller kadar bulunma hakkı var. Trafiği tehlikeye sokan da taşıtların türleri değildir. Taşıtların sürücüleridir. Türkiye'de her yıl yüzlerce motorcu trafiğin yalnızca kendisine ait olduğunu zanneden otomobil sürücüleri yüzünden vefat ediyor.Trafiğin yalnızca otomobillere ait olduğunu iddia eden yok. Yollarda her aracın gideceği şerit bellidir en soldan yavaş yavaş giden motorlu hıyar da elektrikli scootera 3 kişi birden binen velet de trafiği tehlikeye atar ve caydırıcı cezalarla sayılarının azaltılması gerekir bu da devletin görevidir. Kimsenin kaldırıma scooter park ederek halkın hakkını gasp etmesine izin verilmemelidir bu denetimi kolluk kuvveti yapmalıdır. Kimse özel mülkün önüne scooter bırakıp gidemez otopark girişini dükkan önünü kapatamaz. Bu scooterların zararları saymakla bitmez, Avrupalılar boşuna yasaklamıyor en özgürlükçü ülkelerde bile bunun zararları yararından kat kat fazla olduğu için yasaklanıyor. Böyle geleceği belirsiz şirketlere yatırım yapılmaz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "May 03, 2023, 07:02:53 PM",
      "body": "Martı firması 1 martta yaptığı jestle akıllarda kalıcı bir hamle yapmış. Pazarlama olarak oldukça başarılı buldum artık bu uygulamayı küresel ölçekte çoğu firma bu uygulamayı yapıyor olsa da 1 Mart zamanlaması olayı öne çıkarmış. Oğuz Alper Öktem girişimci, yenilikçi bir genç arkadaşımız takip ettiğim kadarıyla. Gelecekteki hamlelerini merak etsem de hisse yatırımı için çekimserim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzigie",
      "created_time": "May 04, 2023, 12:47:33 PM",
      "body": "Quote from: onurgozupek on May 03, 2023, 06:25:51 PMgece yarısı çocuğumu hastaneye götürmem gerektiğinde civarda 1 tane bile kiralık araç bulamayacaksam,Gece yarısı acil ihtiyaçlar için her bölgede kullanıma ayrılan 5 tane araba olsa ve hastane güzergahları dışında kullanıma sunulmamak kaydıyla kilitlense bu sorun çözülür. Bence çok basit bir çözüme sahip olayı büyük bir sorunmuş gibi lanse etmişsiniz.Quote from: onurgozupek on May 03, 2023, 06:25:51 PMİnsan gibi ulaşabilmek istiyoruz. Onur Bey herkes arabaya ulaşamıyor. Dünyada 8 milyar insan var. Bunların büyük bir kısmı günlük ihtiyaçlarını gidermek için temiz suya bile ulaşamıyor. Paylaşımcı bir ekosistemin yerine zenginliği başka ülkelerden çalan insanların rahat bir yaşam sürdüğü bir sistemde tıkılıp kalmak sizi mutlu edebilir ama bana ağır geliyor. Martı bazı temel ihtiyaçları tabana yayabilecek halkçı bir uygulama.Quote from: LGD2Business on May 03, 2023, 07:00:38 PMen soldan yavaş yavaş giden motorlu hıyar da elektrikli scootera 3 kişi birden binen velet de trafiği tehlikeye atar Zamanında at arabalarının otomobillerden daha güvenli olduğunu söyleyenler de olmuş. 3 tane çocuğun kural dışı olumsuz davranışı paylaşımcı tabana sahip yeni nesil taşımacılık sistemlere engel oluşturmaz. Scooterlar için park yerleri tahsil edilebilir ve kaldırım işgaline çözüm üretilir. Yazdığınız problemlerin hiçbiri çözülemeyecek türden büyük sorunlar değil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "May 04, 2023, 03:44:52 PM",
      "body": "Yapılan hareket güzel, çalışanlarını düşünen ve onlarla büyümeye çalışan firmalara her zaman saygı duymuşumdur. Dağıttıkları hisse miktarı da hiç az değil. Pandemi sonrası inanılmaz bir sektör gelişti, tüm dünyada müthiş bir trend yakalandı fakat artık Avrupa’da birçok bölgede bu araçlar yasaklanmaya başladı.Martı da bunun farkında olacak ki scooter işini geliştirip düşük motor hacmi olan motosikletlere dönüş yaptı. Hatta CEO yaptığı röportajlarda hep ortak kullanıma sahip otomobiller, minibüsler ve hatta deniz araçlarından bahsediyor. Scooter işi bitse de farklı bir alana yönelip işi devam ettireceklerdir",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "May 04, 2023, 05:46:20 PM",
      "body": "Bu martı nın ceosunu zerre kadar sevmem. Sürekli gündemde kalmaya çalışan ters birisi bana göre. Twitter da aylık 20 bin lira verilen tiki bile satın almış düşünün ne kadar sevdiğini. Ama ilk kez klas bir hareket yapmış. Keşke çalışanları da gelip ne kadar pay aldıklarını açıklasalar. İşçilere şirketten pay verme işi git gide norm oluyor. Çok da iyi oluyor. Olması gereken kesinlikle ama kesinlikle bu. Bir işçinin şirketine ortak olması kârını takip etmesini sağlar, aidiyeti arttırır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "onurgozupek",
      "created_time": "May 04, 2023, 05:51:24 PM",
      "body": "Quote from: Dzigie on May 04, 2023, 12:47:33 PMGece yarısı acil ihtiyaçlar için her bölgede kullanıma ayrılan 5 tane araba olsa ve hastane güzergahları dışında kullanıma sunulmamak kaydıyla kilitlense bu sorun çözülür. Bence çok basit bir çözüme sahip olayı büyük bir sorunmuş gibi lanse etmişsiniz.Oradan bakınca, \"her bölgeye 5 araba ayırmak\" basit bir çözüm gibi mi geliyor? Misal istanbul için \"bölge\"den kastınız nedir? İlçe mi? Mahalle mi? Diyelim ki mahalle. Bir ucundan diğer ucuna 1,5-2km mesafe olan mahallede 5 arabayı herkesin basitçe erişebileceği şekilde nasıl konumlandırırsınız?Quote from: Dzigie on May 04, 2023, 12:47:33 PMOnur Bey herkes arabaya ulaşamıyor.Gerçekten mi? Oysa yerli milli Togg alabilecekti herkes? Ne oldu? (İçinde bulunduğumuz ekonomik düzende, araba sahibi olamamanın ne demek olduğunu biliyorum. Bunun konuyla alakası yok!)Quote from: Dzigie on May 04, 2023, 12:47:33 PMDünyada 8 milyar insan var. Bunların büyük bir kısmı günlük ihtiyaçlarını gidermek için temiz suya bile ulaşamıyor.Yav ne alaka? Paylaşımlı araba su mu üretiyo? Paylaşımlı araba kullanınca susuz insanların suya ulaşmasına yardımcı mı oluyosun? Bu konuyla 4 milyardan fazla insanın suya ulaşamamasının (!) ne alakası var? Ayrıca dünya nüfusunun %10'a yakını, bunun da çoğunluğu Afrika ve çöl bölgelerinde temiz su bulmakta zorlanıyor. Kaynak: https://www.worldometers.info/tr/Quote from: Dzigie on May 04, 2023, 12:47:33 PMPaylaşımcı bir ekosistemin yerine zenginliği başka ülkelerden çalan insanların rahat bir yaşam sürdüğü bir sistemde tıkılıp kalmak sizi mutlu edebilir ama bana ağır geliyor.Bu çıkarımı yapmak için cahil olmanız yetmiyor. Aynı zamanda trol filan olmanız lazım. Çünkü sevgili kardeşim, kendi arabasını alan adam, \"zenginliği başka ülkelerden çalan insanların rahat bir yaşam sürdüğü bir sistem\"de yaşarken araba kiralayan vatandaş da aynı sistemde yaşıyor. Çünkü sevgili kardeşim, sana \"paylaşımcı bir ekosistem\" sunan girişimcilerin tamamı şu an \"zenginliği başka ülkelerden çalan insanların rahat bir yaşam sürdüğü bir sistem\"in en tepesinde. Bilmem anlatabiliyor muyum?Quote from: Dzigie on May 04, 2023, 12:47:33 PMMartı bazı temel ihtiyaçları tabana yayabilecek halkçı bir uygulama.Şimdi canım kardeşim, sen muhtemelen henüz paylaşımcı uygulama nedir bilmezken ben Türkiye'de paylaşımlı yolculuk servisi Volt'un ilk sürücülerinden biriydim. Volt 2014'te kuruldu, Martı ise 2018'de... Üstelik Volt, 2019'da Voltlines olarak yeniden yapılandı ve paylaşımlı servis taşımacılığı işini Türkiye'de başlatan girişim oldu. Ayrıca, 2019'da Zorlu, elektrikli araçları mobil uygulama üzerinden kiralamaya başladığında sistemi destekleyenlerden ve geri bildirim paylaşanlardan biriydim.Uzun lafın kısası, Martı'nın iş modeline, Martı benzeri girişimlerin yaygınlaşmasına bir itirazım yok. Hatta her sokakta paylaşımlı araçlar olmasını, bu araçlara kolayca erişebilmeyi ben de isterim. Ancak, Türkiye'de bu iş yurt dışındaki kadar basit değil. Araç pahalı, sigorta pahalı, yedek parça pahalı, insanlar birbirlerine güvenmiyor çünkü kanunlar yetersiz. Müşteri araca bilerek hasar verirse, aracı çalarsa, aracın parçalarını muadilleri ile değiştirirse işleten firma yıllarca uğraşmak zorunda. Aynı şekilde, işleten firma aldığı provizyonu iade etmez, saçma gerekçelerle (yakıt, ekstra HGS, park ücreti vs.) ek ücret tahsil ederse, bu sefer müşteri uğraşıyor. Bu ve benzeri bir sürü nedenle, paylaşımlı araç sistemi Türkiye'de yaygınlaşamıyor.Ben, 8 milyar insan neden aracını paylaşmıyor sorunun gerekçelerini kendimce açıklamaya çalışmıştım. Biraz fazla açıklama yapmak zorunda kaldım. Kusura bakma...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flipme",
      "created_time": "May 04, 2023, 11:30:39 PM",
      "body": "NYSE'ye açılan her şirket ülkemiz adına gurur verici ama kişilere ait şirketlerin başarısı beni çok fazla ilgilendirmiyor. Ancak, kişisel başarısını çalışanları ile paylaşmış bir işveren ne olursa olsun övgüye değerdir benim için. Büyük şirket sahipleri kazandıkları paraları tek başlarına yiyemeyeceklerini anlamalı. Çocuklarına bıraktıkları miras kadar olmasa bile kazandıkları servetleri çalışanlarına bir miktar pay etmeyi akıllarına getirmeliler. Parayı kazanırken beraber olmak kadar parayı yerken de beraber olmayı akıllarına birazcık da olsa getirebilmeliler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "May 05, 2023, 05:23:33 AM",
      "body": "Firmaların çalışanlarına hisse vermesi bir çok firmada olan bir uygulama yani bir bakıma çalışanları firmaya ortak ediyorsunuz bu sebeple aidiyet duygusu oluşabiliyor kişi kendi şirketinde çalışıyormuş hissiyatı kazandırabilir. Bu durumdan hem çalışanlar hemde firmalar kazançlı çıkmış olur Win Win durumu  Bildiğim kadarıyla Apple firmasıda çalışanlarına hisse veren şirketlerden.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzigie",
      "created_time": "May 05, 2023, 02:28:30 PM",
      "body": "Size ne dedim de bu kadar agresif davrandınız bilmiyorum. Asgari müşterekte buluşabileceğimiz ortalama zeka seviyesine sahip biri olma ihtimaliniz nedeniyle size lafın çoğunu anlatmak yerine kıssadan hisse verdim. Cahil ve trol gibi kaba ifadeler kullanmanız hiç hoş olmamış.Quote from: onurgozupek on May 04, 2023, 05:51:24 PMYav ne alaka? Paylaşımlı araba su mu üretiyo?Sahra Altı Afrika ülkelerinde yoksulluk sınırına dahil olan insan sayısı her geçen gün artıyor. Bunun tek nedeni paylaşmayı öncelemek yerine sahip olmayı önceleyen mülkiyet arzusu. Dünya üzerindeki kaynaklar verimli kullanılmazsa dengesizlik her geçen gün büyüyecek.Birleşmiş Milletler (BM) verilerine göre, dünya nüfusunun yarısı, günde 2 dolardan az bir parayla geçinmeye çalışıyor. Dünya üzerinde, 1.2 milyar kişi ise günde 1 dolardan az parayla yaşamlarını sürdürmek için resmen cebelleşiyor. BM, Dünya Sürdürülebilir Kalkınma Zirvesi'nde ele alınan yoksullukve sağlık konularında bir rapor hazırladı.https://www.yenimesaj.com.tr/dunya-nufusunun-yarisi-yoksul-H1077189.htmQuote from: onurgozupek on May 04, 2023, 05:51:24 PMgirişimcilerin tamamı şu an \"zenginliği başka ülkelerden çalan insanların rahat bir yaşam sürdüğü bir sistem\"in en tepesinde. Bilmem anlatabiliyor muyum?Bu durumu zaten değiştirebilme imkanımız yok. Eşitlik anlayışının olduğu tek yer doğa durumuydu. Avcı toplayıcı topluluklardan tarım toplumlarına dönüşmek bile geri dönülmesi mümkün olmayan hatalar zincirine neden oldu. Doğa durumuna geri dönmemiz imkansız. Bu yüzden içine girdiğimiz girdabı iyileştiren çözümleri desteklememiz gerekiyor. Martı uygulaması bu yönüyle insanların alışkanlıklarını değiştirebilecek halkçı bir uygulama. Haftada yalnızca 2 saat kullandığımız herhangi bir ürüne talep oluşturmanın gereksiz olduğunu anlarsak ekonomik anlamda çarkları ellerinde tutan bir avuç elite karşı devrimsel nitelikte bir savunma oluşturabiliriz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Distraction",
      "created_time": "May 05, 2023, 03:45:40 PM",
      "body": "Martı firmasının çalışanlarına hisse verdiği haberini görünce aklıma bunun aynısını yapan Silikon Vadisi firmaları geldi. Böyle bir şey yapmaları tabi ki güzel bir şey ama geleceği ne kadar parlak bu firmanın işte orasını ben de bilemiyorum. Martı CEO'sunun biraz da kendi dünyasında yaşayan bir adam olduğunu düşünmeye başladım. Çünkü inanılmaz orjinal bir fikirle gelmiş gibi konuşuyordu.  Martı'nın bence şu an odaklanması gereken noktalardan birisi Martıların sağa sola rastgele bırakılmasını nasıl engellerim olmalı. Çünkü o kadar çok şikayet geliyor ki bu firmanın imajına kötü bir etki bırakabilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "May 05, 2023, 03:50:20 PMLast edit: May 05, 2023, 04:17:33 PM by mandown",
      "body": "Martı kadar saçma birşey yok sen esnaf olarak kaldırıma ürün koyarsan belediye basar cezayı oturursun aşağı bunlar kaldırıma heryere istedikleri gibi ürünü koyup gidiyor yolda bebek arabası mı denk gelir vs yok engelli olabilirsin hasta olabilirsin bu araçların yeri kaldırım değil ileride eminim siyasi bağlantılar ortaya çıacaktır diğer türlü bu küçücük kaldırımlarda bunları kime kabul ettiremezdi.Bu kaldırımdakiler araçsa kaldırımda ne işi var?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silence Scream",
      "created_time": "May 05, 2023, 04:59:48 PM",
      "body": "Quote from: LGD2Business on May 03, 2023, 05:27:25 PMUzun vadeli elde tutulacak bir hisse değil bu şirketlerin geleceği bile meçhul.Avrupa'da olduğu gibi Türkiye'de de bu martı vb. araçların yasaklanması lazım trafiği öyle bir tehlikeye sokuyorlar ki kaza oranları ciddi şekilde arttı. Gördükleri her yere park edip kaldırımı otopark önünü ve bilimum kamusal alanı işgal ediyorlar acilen buna yaptırım gelmesi gerekir. Kamusal düzen tekrar sağlandığında bu yaptıkları gaspların karşılığı cezalar kesilecektir diye umuyorum.Çok doğru sözler bunlar. Hisseyi geçtim, hizmet uzun süreli görünmüyorken hissesini almak tam bir kumar vakası olur. Ben Martı hissesi almam. Çalışanları da olsaydım hisse gelir gelmez satardım. Bir kaç sene sonra bu şirketler çok büyük ihtimalle yasaklanacaklar. Yasaklandıkları için de şirket alternatif alanlara yönelecek ama yasak geldiği anda hissenin değeri yerle bir olacaktır. Uzun süreli hisseler bunlar değil. BIST30’dan her birinden eşit yapacağın bir sepet bile uzun vadeli olarak sana kazandırabilir. Martı hariç tabi. Bu gibi firmalar büyük risk, büyük kumar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "May 05, 2023, 06:14:47 PM",
      "body": "Quote from: Dzigie on May 04, 2023, 12:47:33 PMZamanında at arabalarının otomobillerden daha güvenli olduğunu söyleyenler de olmuş. 3 tane çocuğun kural dışı olumsuz davranışı paylaşımcı tabana sahip yeni nesil taşımacılık sistemlere engel oluşturmaz. Scooterlar için park yerleri tahsil edilebilir ve kaldırım işgaline çözüm üretilir. Yazdığınız problemlerin hiçbiri çözülemeyecek türden büyük sorunlar değil.Olay 3 tane çocuk olayı değil maalesef genel olarak büyük bir bilinçsizlik hakim bu araçları kullananlar arasında. Bu konuda akademik araştırma yapıldı mı bilmiyorum belki vardır ama tahminim %90 bunu kullananlar 25 yaş altı ve bilinçsiz çıkar daha neden-sonuç ilişkisi bile kurmaktan acizler. Orta yaş olup bunu kullanan insan görmedim çocuklar da bunu eğlence aracı olarak görüyor. Çocuğun aklı ermiyor ki bu otoparktan araç çıkacak buraya bırakmayayım bu kaldırımda görme engelli yolu var önüne koymayayım bu kaldırım dar insanlar rahat yürüyemez diye düşünme yetisine bile sahip değil. Bulduğu direğe ağaca bağlayıp gidiyor. Bunun adı kamusal alana tecavüzdür. Sen devlet olarak vatandaşının hakkını savunuyorsan yazarsın buna izin veren şirketlere cezayı onlar da akıllanır her yere araçlarını bıraktırmazlar uygun park alanları oluşturulur. Trafikte yarattığı tehlike ve yaşanan kazaların maddi boyutu ayrı bir mesele. Kaç tane haber gördük bunlar yüzünden kaza yapan aracı hasar gören. Madem ayrı yolu yok ehliyetsiz trafiğe çıkılmayacak o zaman.Dediğin gibi yazdığım problemlerin hepsi çözülebilecek sorunlar ama bununla ilgili aktif çalışan yasal düzeneğini hazırlayan bir otorite göremiyoruz. Devlet üzerine düşeni yapmazsa bunun gibi özel şirketler dilediğince at koşturur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "May 05, 2023, 06:35:26 PM",
      "body": "Quote from: gospodin on May 03, 2023, 06:27:40 PMQuoteTürkiye'nin Elon Musk'ı olabilecek kadar zeki biri. yurtdışında olan bir ürünü ülkeye getirmek mi elon musk yapıyor insanı? yapmayın hocam allah aşkına. yapılan harekete gelecek olursak çok güzel. amerika'daki startup firmalarında genelde bunu görüyoruz. hatta tamamen yeni olan firmalar bu şekilde finansmanını çeviriyor.Hocam polemiğe girmemek için bunu yazmayayım dedim ama doğru yazmışsınız yani katılmamak elde değil. Elon Musk'a bayıldığımdan değil ama bu adamın onunla alakası yok. Bizim ülkede böyle yeni bir şey yaratmamış, kopyalamış tüccarların yüceltilmesini çok yanlış buluyorum. Adamın kendisi de sanki dünyayı yaratmış gibi konuşuyor, çok işler başarmış da muhteşem bir dahiymiş gibi konuşuyor. Kayınpederi olmasaydı nerede olurdu, tartışılır. Bir de şu açıklamaları tam komedi:QuoteHaftada 45-60 saat arası çalışıp arabamızın kredisini ödüyoruz. Sosyalleşmek ve kredi borcunu ödediğimiz aracı kullanmak için haftalık 10 saatimiz bile kalmıyor çoğu zaman.Dünyada 8 milyardan fazla insan var. 8 milyar insan bunu yapsa kredi ve borçlanma maliyetleri ve yaşam kalitesi inanılmaz ölçüde düşer ama en önemlisi dünyadaki 8 milyar insan bunu aynı yapamaz bile.Neden 8 milyar insan olarak araçlarımızı paylaşmıyoruz? Neden özel mülkiyete bu kadar düşkünüz? Özel mülkiyet yerine paylaşım özellikleri daha yüksek ekosistemler geliştiremez miyiz?Martı ve türevleri konusunda eleştirilere aynen katılıyorum. Hem güvenlik açısından hem de kuralsızlık açısından büyük yanlışlar var. Park edilmesi konusunda da ne saçmalıklar olduğunu ben bile kaç kere gördüm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}