{
  "id": "topic_5459680",
  "title": "tg88",
  "author": "tg88",
  "created_time": "July 13, 2023, 02:01:16 PM",
  "content": "No dia de ontem dia 12/07 dois senadores dos EUA submeteram para votação um projeto de lei chamado de “Lei de Inovação Financeira Responsável” e o objetivo dele é classificar a maioria das criptomoedas como commodities e assim tirar a regulação delas da SEC e passar para a CFTC. Segundo as palavras deles o objetivo deles é impedir que a SEC continue “sufocando a inovação em tecnologias financeiras”.Difícil saber ser esse projeto tem alguma chance de passar ou não, mas é mais um movimento interessante de se acompanhar.Senadores dos EUA criam lei que classifica criptomoedas como commodities",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459680",
  "comments": [
    {
      "author": "bitmover",
      "created_time": "July 13, 2023, 02:29:34 PM",
      "body": "Quote from: tg88 on July 13, 2023, 02:01:16 PMNo dia de ontem dia 12/07 dois senadores dos EUA submeteram para votação um projeto de lei chamado de “Lei de Inovação Financeira Responsável” e o objetivo dele é classificar a maioria das criptomoedas como commodities e assim tirar a regulação delas da SEC e passar para a CFTC. Segundo as palavras deles o objetivo deles é impedir que a SEC continue “sufocando a inovação em tecnologias financeiras”.Difícil saber ser esse projeto tem alguma chance de passar ou não, mas é mais um movimento interessante de se acompanhar.Senadores dos EUA criam lei que classifica criptomoedas como commoditiesNa minha opinião, commodity só o Bitcoin mesmo, ou talvez o LTC tb. Contudo, tirar da regulação da SEC é um ponto bastante positivo. Se nao acredito que em breve somente bancões estarão operando criptomoedas, e as corretoras que conhecemos vao acabar sumindo... Não que elas sejam boas (pelo contrário, a maioria mandou muito mal ao longo dos anos), mas bancos podem ser ainda piores.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 15, 2023, 08:03:40 AM",
      "body": "Talvez o facto do XRP ter tido uma vitoria em tribunal conta a SEC, possa ajudar a que essa lei passe de modo a que o SEC abrande um pouco nessa luta contra o mundo cripto.Eu acho que o SEC começou a esticar um pouco a corda, ao querer atacar tudo de uma vez. O mercado cripto, já não é sou os \"bobos do IT\", já tem muita gente influente e com experiencia em mercado financeiro e politico, para tomar medidas defensivas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}