{
  "id": "topic_5437292",
  "title": "Outhue",
  "author": "Outhue",
  "created_time": "January 30, 2023, 06:36:18 AM",
  "content": "I wish there is a way that I can show families on here how successful I have bring numbers of people into Bitcoin between 2021 - 2023, it's been so great and I am very happy about it, I have fresh newbies at hand right now,  two of them are from the same university 🎓, I have spent 6 weeks with them teaching and answering questions about Bitcoin and wallets, now they decide to purchase their first set of Bitcoin.Here is where I am confused, the present value of Bitcoin is growing, some said it's because of the Chinese New year Holiday aka Year of the Rabbit, since I got mine at 17,000 and 15,000 I feel it's wrong to tell these newbies to buy at 23,000$ Have I done the right thing by telling them to wait for some correction before buying or you famz have a better idea? Because right now I don't see anything thing better than to wait, double bottom is always possible with Bitcoin in bear markets.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437292",
  "comments": [
    {
      "author": "davis196",
      "created_time": "January 30, 2023, 06:48:37 AM",
      "body": "Do not give financial advise to other people, because they will put the blame on you, when they lose money.It's great that you are spreading the word about Bitcoin. Good Job, OP. If I was on your place, I would just explain the basic principles and the core concept of Bitcoin and blockchain technology. I wouldn't tell the noobs when to buy and when to sell. Nobody can predict the market, even the best crypto traders are failing sometimes. Knowing Bitcoin is one thing, learning and practicing crypto trading is a different thing.By the way, I don't think that the main reason for the small price growth from 16K to 23K is the Chinese New Year. Wasn't Bitcoin banned in China?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "January 30, 2023, 06:56:05 AM",
      "body": "You shouldn't really try to find reasons for each and every rise and fall. Also what people say on the internet is always all kinds of crazy. They once say new years lead to people dumping bitcoin because they need money for presents and travels, etc. and another time they say it goes up because of new year.I'm also with @davis196 on this, you shouldn't give financial advice to others so that they can blame you when they lose money specially in a very volatile market. You also shouldn't introduce Bitcoin to others as an investment (which is two birds with one stone), since bitcoin is a currency and people who buy it should want financial sovereignty. Also that way when there is volatility they won't just panic then dump and blame you for the loss since they didn't buy bitcoin primarily to make profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 30, 2023, 07:01:43 AM",
      "body": "in 2021 the non zero bottom value was $10kthe premium in 2021 was $75kthe market swung inside this window by movements between $25-70k|||||||||||||||     ^         ^in 2022 the non zero bottom value was $15kthe premium in 2022 was $95kthe market swung inside this by movements between $16-50k||||||||||||||||||||  ^       ^and in 2023 the current value premium possible window. and bitcoins current price     v||||||||||||||||||||its still very much in the green and close to the (black) non zero bottom valueits not as if you are advising they buy in the amber/red zone",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "January 30, 2023, 07:03:26 AM",
      "body": "You are not wrong, your scepticism is right, and you are being reasonable and keeping them safe. If they invest immediately, they might lose interest easily when the price of the coin is falling, so investing at a time when it has just started a pump would be a very good idea. One would have had a better assurance of the bullish trend if it were at the time that it reached the low of about $15,500 last year. At the price, BTC would always recover, and even if they lose, it will soon recover, unlike this time when it almost hit $24,000.Conclusively, be their guide through chart analysis to know the right time to invest and divest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "January 30, 2023, 07:23:37 AM",
      "body": "Quote from: davis196 on January 30, 2023, 06:48:37 AMDo not give financial advise to other people, because they will put the blame on you, when they lose money.It's great that you are spreading the word about Bitcoin. Good Job, OP. If I was on your place, I would just explain the basic principles and the core concept of Bitcoin and blockchain technology. I wouldn't tell the noobs when to buy and when to sell. Nobody can predict the market, even the best crypto traders are failing sometimes. Knowing Bitcoin is one thing, learning and practicing crypto trading is a different thing.By the way, I don't think that the main reason for the small price growth from 16K to 23K is the Chinese New Year. Wasn't Bitcoin banned in China?Giving people financial advise is what I hate the most, trust me, I have been there and I've seem how ugly things could get, the hate you can easily get when things go wrong, but the people that invested base on my advice are those that already understand the risk involved, they are on their own if anything happens.Buying low is the key, that's all I give them as advice, follow by, invest with little amount that won't hurt even if it failed to go your way",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "January 30, 2023, 07:25:14 AM",
      "body": "I agree with others that giving financial advice is undesirable, as people must learn to make their own choices and do their own research, as well as realize that whether they win or lose  it's solely their own responsibility. If you got yours at $15-17k, you could just honestly tell them that. But nobody knows whether Bitcoin will fall again, and IMO the price is still good as long as a person believes in full recovery of the process and is willing to wait for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "January 30, 2023, 07:33:02 AM",
      "body": "Quote from: davis196 on January 30, 2023, 06:48:37 AMDo not give financial advise to other people, because they will put the blame on you, when they lose money.It's great that you are spreading the word about Bitcoin. Good Job, OP. If I was on your place, I would just explain the basic principles and the core concept of Bitcoin and blockchain technology. I wouldn't tell the noobs when to buy and when to sell. Nobody can predict the market, even the best crypto traders are failing sometimes. Knowing Bitcoin is one thing, learning and practicing crypto trading is a different thing.By the way, I don't think that the main reason for the small price growth from 16K to 23K is the Chinese New Year. Wasn't Bitcoin banned in China?The best advice you can give is that Bitcoin is an investment that is most successful with a target of 4 years. It is economically designed this way. No one has ever failed when hodl'ing for more than 4 years, the charts prove it!Quote from: davis196 on January 30, 2023, 06:48:37 AMWasn't Bitcoin banned in China?According to this article, Bitcoin has been banned by China on 3 occasions. I remember reading another article around the time of the last China ban that the count was in excess of 7 occasions. Yet, many Chinese exchanges and services still operate today. So this tells you how effective these so-called bans really are.Bitcoin Cannot Be Banned!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "January 30, 2023, 07:47:57 AM",
      "body": "Quote from: Outhue on January 30, 2023, 06:36:18 AMHere is where I am confused, the present value of Bitcoin is growing, some said it's because of the Chinese New year Holiday aka Year of the Rabbit, since I got mine at 17,000 and 15,000 I feel it's wrong to tell these newbies to buy at 23,000$ I have heard people say the Chinese New year cause corrections due to large amount of withdrawals made by investors to celebrate the occasion. Goes to show you that attempts to predict the market or give reasons for price actions are usually without any facts.There's nothing wrong in then buying higher than you did, your purchase is around the cheapest range in a long time and the chance of them getting in at that price is not guaranteed.Quote from: Outhue on January 30, 2023, 06:36:18 AMHave I done the right thing by telling them to wait for some correction before buying or you famz have a better idea? Because right now I don't see anything thing better than to wait, double bottom is always possible with Bitcoin in bear markets. What happens if it keeps rising and they feel they would have profited if they had bought at the current price range before any doubling down?Also, if they DCA over several months, it would not matter the different price ranges they bought in at.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "January 30, 2023, 07:49:03 AM",
      "body": "If you have knowledge on technical analysis then go on and pitch your recommendation, but advising them is a risky thing though. You might got blame if there some worse thing that happened on their money.Maybe try to show and let them be educated on how bitcoin works in a simple way including the usage of it and how we can generate utility of it. The trading or investment part should be well explained so that they can grasp how volatile and dangerous investing on bitcoin and other cryptos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "January 30, 2023, 07:49:27 AM",
      "body": "Quote from: BenCodie on January 30, 2023, 07:33:02 AMYet, many Chinese exchanges and services still operate today. So this tells you how effective these so-called bans really are.That actually tells us that there was no bans, at least not the way that is reported by the mainstream media. What Chinese government banned were a bunch of things. First was banning centralized exchanges that had 0 trading fee where the exchange was a front for their money laundering operations. Second was banning ICOs back in 2017-ish which we all know were scams and were actually banned in other places too. And finally was the mining ban where they shut down mining farms inside mainland China.However, as far as I've seen they never banned using bitcoin or trading it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "January 30, 2023, 07:54:39 AM",
      "body": "Quote from: pooya87 on January 30, 2023, 07:49:27 AMQuote from: BenCodie on January 30, 2023, 07:33:02 AMYet, many Chinese exchanges and services still operate today. So this tells you how effective these so-called bans really are.That actually tells us that there was no bans, at least not the way that is reported by the mainstream media. What Chinese government banned were a bunch of things. First was banning centralized exchanges that had 0 trading fee where the exchange was a front for their money laundering operations. Second was banning ICOs back in 2017-ish which we all know were scams and were actually banned in other places too. And finally was the mining ban where they shut down mining farms inside mainland China.However, as far as I've seen they never banned using bitcoin or trading it.Yes, that's right actually. Specific things were banned in most/all scenarios, however every time a ban occurred the mainstream media were quick to go with the catchy phrases that gave the idea that \"Bitcoin is banned\" rather than properly stating the specifics of the bans. Here was one of the campaigns that alluded that using Bitcoin as a whole was banned by China:China declares all crypto-currency transactions illegalI couldn't find any sources in the article that actually validated the contents of what was published, of course",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "January 30, 2023, 07:55:53 AM",
      "body": "Because bitcoin price movements are not easy to predict, it's best not to suggest them to buy and give a basic explanation about bitcoin and wallets, I think that's enough.because buying or wanting to own bitcoins must be based on faith and also analysis after knowing the basics, and suggesting buying bitcoins using additional money gradually and also for the long term. And if you tell or tell bitcoin journey that bitcoin is a very good long term investment I think you and they don't really care about the current price of bitcoin and as long as they believe in the long term they will continue to buy gradually until they feel they have had enough and hold it.and what i mentioned i was suggested to some of my family members that bitcoin is very promising long term investment and also tell my profit when doing long term, and aims to keep them motivated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "January 30, 2023, 08:06:28 AM",
      "body": "Quote from: davis196 on January 30, 2023, 06:48:37 AMDo not give financial advise to other people, because they will put the blame on you, when they lose money.It's great that you are spreading the word about Bitcoin. Good Job, OP. If I was on your place, I would just explain the basic principles and the core concept of Bitcoin and blockchain technology. I wouldn't tell the noobs when to buy and when to sell. Nobody can predict the market, even the best crypto traders are failing sometimes. Knowing Bitcoin is one thing, learning and practicing crypto trading is a different thing.That's right and it's better to clarify everything to them and to free yourself from any blame when things will become worse for them about their investment. It's really better, to be honest, and talk about the volatility first if they are risk takers, they will gonna invest even though the price of bitcoins is currently high and they will not gonna put the blame on you if they messed up as long as you have been clear and honest to them. The way people invite to their ponzi scam investment is different than what we are doing because they are forcing the newbies to invest by luring them with sweet words and lies, while we are being truthful to them and being careful with any information we share with them because it's crucial for the safety of their money and other wealth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "January 30, 2023, 08:07:59 AM",
      "body": "Quote from: Outhue on January 30, 2023, 06:36:18 AMHere is where I am confused, the present value of Bitcoin is growing, some said it's because of the Chinese New year Holiday aka Year of the Rabbit, since I got mine at 17,000 and 15,000 I feel it's wrong to tell these newbies to buy at 23,000$ Bitcoin price is not determined by event like that, if it must be affected then events like halving, mining hash rate are well recommended for that, also about advising them on when to purchase, you need to explain it point blank to them that bitcoin is volatile and they must understand this, now it's left on them to decide if they are investing now considering the current price or wait more, this will help you alot not to receive the blame if the decision comes from them, bitcoin price may go more bearish or bullish after they buy, but since you have already told them the risk at stake they wouldn't blame you, because even you by yourself took that same risk to buy and see where the current price is at your favour, so let them independently take the decision by themselves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "White pawn",
      "created_time": "January 30, 2023, 08:23:27 AM",
      "body": "I don’t think there’s a need for validation of your actions of having brought in and taught newbies all about bitcoin. It’s great you’re doing so.Saw a solid advice and point given by another member on here. You shouldn’t be giving anyone, especially newbies any financial advise. I would like to add that the only advice you should give them is to do their own research. Wouldn’t be hard for someone that’s in the university to appreciate the fact and do their own research on things before venturing into anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "January 30, 2023, 08:44:21 AM",
      "body": "Since you are doubting what you are doing, it's better to know what you are doing and be confident about what you're trying to advise. Generally, it's not a good idea to recommend someone on what to buy because they might haunt you that you've lost them money or give you praise if you made them money. So it's going to be hard, and depending on the level of understanding you have between the two parties, it would depend on it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bakasabo",
      "created_time": "January 30, 2023, 09:09:20 AM",
      "body": "Just dont forget to show the other side of Bitcoin investment. Show them that like Bitcoin price went up, it can quickly go down and be low for a very long period. At least warn them of that. I saw a lot of people only see growth. A lot of people think that if they have bought a Bitcoin, they will be 100% be gain profit or be rich. Warn them that this is not a \"get rich quick\" strategy. They must be patient and cautious.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "January 30, 2023, 09:09:47 AM",
      "body": "Quote from: Outhue on January 30, 2023, 06:36:18 AMHave I done the right thing by telling them to wait for some correction before buying or you famz have a better idea? Because right now I don't see anything thing better than to wait, double bottom is always possible with Bitcoin in bear markets. You cannot expect everyone to buy at the price and enter the market at the same price you purchased your own bitcoins, and you should have let them buy it as their interest was high. I feel telling them to wait is not the best because waiting is dangerous, they can loose interest, or the money that they had and intended to use in buying bitcoins can enter into other expenses. To play the waiting game is dangerous.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "QueenVera",
      "created_time": "January 30, 2023, 09:23:42 AM",
      "body": "Quote from: Outhue on January 30, 2023, 06:36:18 AMHere is where I am confused, the present value of Bitcoin is growing, some said it's because of the Chinese New year Holiday aka Year of the Rabbit, since I got mine at 17,000 and 15,000 I feel it's wrong to tell these newbies to buy at 23,000$ What's the difference between $17k and $23k if you both hold and ride the wave upto $100k or beyond depending on what price Bitcoin has in store for us. It doesn't matter the price you buy your Bitcoin now as in the future we all will be in profit. The only time the price of Bitcoin matters is when you're a trader. If your friends aren't buying Bitcoin for training purposes then I would advise they should get their hands on some bitcoin today. The price might be too high for you today but you can never tell if the price will drop lower than this or not. All they just have to do is not to invest money that'll be needed in the nearest future instead they should invest as much as they can afford to lose then hold unto their investment. As an investor or newbies picking interest in investing, we should note that it isn't always about our entering point but how far is our patience to hold unto our investment for future gains.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}