{
  "id": "topic_5410200",
  "title": "delfastTions",
  "author": "delfastTions",
  "created_time": "August 17, 2022, 09:13:14 AM",
  "content": "По моему коллеги,  уже стоит открыть отдельную тему по части сохранения PoW Ethereum.Новостей по этой теме довольно много и интересных тоже,  как например  про отмену сжигания,   ну и других тоже.Вот например zasad@ нашелhttps://bitcointalk.org/index.php?topic=996518.msg60764435#msg60764435",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410200",
  "comments": [
    {
      "author": "zasad@",
      "created_time": "August 17, 2022, 12:47:37 PM",
      "body": "Не вижу в этом большого оптимизма, но эксперимент по форку огромной экосистемы мне нравится. С их донатами менее 20 тысяч долларов и отсутствием команды и финансирования этот эксперимент по логике должен быстро провалится, но в криптовалюте может  все пойти и не по плану.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "madnessteat",
      "created_time": "August 17, 2022, 08:07:53 PM",
      "body": "Quote from: zasad@ on August 17, 2022, 12:47:37 PM^Мне кажется, что многие просто получат форкнутые монеты и сольют их в пользу ETH или ETC (зачем изобретать велосипед, если он уже давно зарекомендовал себя и по идее является истинным ETH, а его форк переходит на POW). У меня есть немного ETH и я постараюсь получить форк, но лишь с целью немного увеличить капитал.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "delfastTions",
      "created_time": "August 19, 2022, 05:16:39 AM",
      "body": "Quote from: madnessteat on August 17, 2022, 08:07:53 PMQuote from: zasad@ on August 17, 2022, 12:47:37 PM^Мне кажется, что многие просто получат форкнутые монеты и сольют их в пользу ETH или ETC (зачем изобретать велосипед, если он уже давно зарекомендовал себя и по идее является истинным ETH, а его форк переходит на POW). У меня есть немного ETH и я постараюсь получить форк, но лишь с целью немного увеличить капитал.Да,  согласен,  сценарий вполне может реализоваться.Вот ещё  новости:Ethereum Fork ETHW резко падает на 62% за несколько недель до слияния За последние две недели Polo,  Huobi, BitMEX, и - совсем недавно, во вторник Bitrue- начали перечислять финансовые продукты, связанные с ETHW, включая фьючерсы и токены «IOU».ETHW (IOU) в настоящее время не может быть отозван или продан через биржи; но если форк ETHW будет успешен, ETHW (IOU) инвесторов в этот момент будет преобразован в реальный. Если ETHW не материализуется после слияния, оставшаяся ETHW (IOU) будет преобразована в ETH после слияния. ETHW вряд ли когда-либо приблизится к рыночной стоимости или полезности Ethereum. Но, несмотря на это, биржа выразила оптимизм по поводу того, что он может предложить «захватывающую возможность для трейдеров и спекулянтов в краткосрочной и среднесрочной перспективе.».Но за несколько недель до слияния интерес к ETHW, похоже, быстро исчезает. Это плохая новость для сторонников криптовалюты: приток майнеров, пытающихся произвести больше ETHW после слияния, вероятно, только еще больше снизит цену ETHW.«Я ожидаю, что ETHW будет неустойчивым», - сказал ранее основной разработчик Ethereum Престон Ван Лун  «Не хватит покупателей, чтобы поглотить постоянное давление со стороны майнеров, и валюта упадет до нуля.».Не думаю,  что до нуля,  все таки некоторые криптокиты поддержат.  Китайцы прежде всего. А вообще то мне жаль,  если ETHW обломится потому что только это и есть настоящая крипта а не суррогаты  PoS.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "delfastTions",
      "created_time": "August 24, 2022, 07:21:09 AMLast edit: August 24, 2022, 12:17:34 PM by delfastTions",
      "body": "Bitfinex запустила деривативы на PoW-форк EthereumBitfinex запустила производные продукты на базе потенциальных форков Ethereum на алгоритмах консенсуса PoW и PoS.Клиенты могут создавать актив взамен эквивалентной суммы в ETH. Обратная конвертация возможна в любое время. Срок действия продуктов истекает 31 декабря 2022 года.Команда биржи определила следующие возможные сценарии для новых токенов:- если в существующей сети Ethereum (на PoW) не произойдет смены алгоритма консенсуса, срок действия ETHS истечет, а ETHW обменяются на ETH;- при успешном изменении консенсуса на PoS без появления PoW-форка ETH предоставят взамен на ETHS;- при варианте со сменой консенсуса в основной сети и запуском новой цепочки на PoW оба дериватива обменяют на ETH. Ethereum PoW получает чрезвычайно важное обновлениeСогласно официальной странице Ethereum PoW на Github , проект получил второе обновление кода с применением EIP-155. Фундаментальная ценность этого обновления заключается в идентификаторе цепочки, который будет обязательным признаком для всех транзакций в сети. Новое обновление является важным шагом для дополнительной защиты PoW-версии второй по величине криптовалюты на рынке, поскольку оно защитит монету от повторной атаки других форков.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pon4ik",
      "created_time": "August 24, 2022, 05:14:07 PM",
      "body": "покупать монету за 1700 долларов чтобы получить токен за 50 баксов так себе идея",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satcomcom",
      "created_time": "September 05, 2022, 01:50:14 AM",
      "body": "Quote from: delfastTions on August 24, 2022, 07:21:09 AM Ethereum PoW получает чрезвычайно важное обновлениeСогласно официальной странице Ethereum PoW на Github , проект получил второе обновление кода с применением EIP-155. Фундаментальная ценность этого обновления заключается в идентификаторе цепочки, который будет обязательным признаком для всех транзакций в сети. Новое обновление является важным шагом для дополнительной защиты PoW-версии второй по величине криптовалюты на рынке, поскольку оно защитит монету от повторной атаки других форков. Чтобы PoW форк выстрелил по идее нужна поддержка майнеров в первую очередь а тут,за 10 дней до старта почти нет информации по пулам с поддержкой ETHW.  Толку с него если майнить станут три калеки на ноутах?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "delfastTions",
      "created_time": "September 05, 2022, 10:00:41 AM",
      "body": "Quote from: satcomcom on September 05, 2022, 01:50:14 AMQuote from: delfastTions on August 24, 2022, 07:21:09 AM Ethereum PoW получает чрезвычайно важное обновлениeСогласно официальной странице Ethereum PoW на Github , проект получил второе обновление кода с применением EIP-155. Фундаментальная ценность этого обновления заключается в идентификаторе цепочки, который будет обязательным признаком для всех транзакций в сети. Новое обновление является важным шагом для дополнительной защиты PoW-версии второй по величине криптовалюты на рынке, поскольку оно защитит монету от повторной атаки других форков. Чтобы PoW форк выстрелил по идее нужна поддержка майнеров в первую очередь а тут,за 10 дней до старта почти нет информации по пулам с поддержкой ETHW.  Толку с него если майнить станут три калеки на ноутах?Да, возможно ничего толкового из этой идеи не получится, хотя кто ж знает? Мне вот жаль что загубили настоящий эфириум  Главное, если вдруг появятся, сразу же соскочить.  Пока совсем на соскамится.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "madnessteat",
      "created_time": "September 05, 2022, 10:27:57 AM",
      "body": "Quote from: delfastTions on September 05, 2022, 10:00:41 AM^ Я тоже думаю, что POW-форк рано или поздно загнется, а вот к переходу ETH на POS я отношусь вполне нормально. Предполагаю, что Виталик знает немного больше нас о будущем регулирования криптовалют и заранее позаботился о своем детище. Мне вот очень интересно, что будет с NFT на ETH после перехода? Если у кого-то такая информация?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satcomcom",
      "created_time": "September 05, 2022, 12:54:44 PM",
      "body": "Quote from: madnessteat on September 05, 2022, 10:27:57 AMПредполагаю, что Виталик знает немного больше нас **** и заранее позаботился о своем детище.  Например,встал в шорт \"на все деньги\"?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "A-Bolt",
      "created_time": "September 05, 2022, 01:11:20 PM",
      "body": "Quote from: madnessteat on September 05, 2022, 10:27:57 AMМне вот очень интересно, что будет с NFT на ETH после перехода?После Слияния все существующие на этот момент NFT автоматически окажутся и в PoS-цепочке Эфира, и в PoW-цепочке (если последнюю всё-таки будут майнить). Можно ожидать, что NFT в PoW-цепочке не будут поддерживаться торговыми площадками. OpenSea уже сделала по этому поводу соответствующее заявление.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "delfastTions",
      "created_time": "September 05, 2022, 02:20:35 PMLast edit: September 05, 2022, 03:13:17 PM by delfastTions",
      "body": "Quote from: madnessteat on September 05, 2022, 10:27:57 AM Предполагаю, что Виталик знает немного больше нас о будущем регулирования криптовалют и заранее позаботился о своем детище. А я вот думаю, что он как раз нихера не знает.Скорее знают всякие кто судится в Риппле, Гарлингхаус, ещё Сизый, да SBF. И похожие китяры. Да вообще-то при переходе в PoS эфириум превращается в аналог акций с небольшими нюансами, которые вполне могут чуток подрегулировать пендосские законодатели. Лежащие как известно под банковским лобби. Так что он позаботился конечно, точнее о его эфире позаботились те, кто и должен был это сделать. Но сильную свинью подложил настоящим криптанам.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The0ldl_lser",
      "created_time": "September 05, 2022, 05:08:43 PM",
      "body": "Quote from: madnessteat on September 05, 2022, 10:27:57 AM Мне вот очень интересно, что будет с NFT на ETH после перехода? Если у кого-то такая информация?а мне вот лично более интересно что будет с USDT на эфире? или вас такие \"мелочи\" совсем не интересуют и сразу перешли к такой пэрспективной теме как NFT? Ну да действительно доморощенных художников обезьян жалко, и вообще интересно и фсё такое...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "A-Bolt",
      "created_time": "September 05, 2022, 05:20:03 PM",
      "body": "Quote from: The0ldl_lser on September 05, 2022, 05:08:43 PMа мне вот лично более интересно что будет с USDT на эфире? Это уже давно никому не интересно.USD₮ Supports ETH Proof-of-Stake TransitionQuote As the issuer of tether tokens, Tether intends to support only tether tokens on the Ethereum POS chain post-merge and will cease support for Ethereum POW chain post-merge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The0ldl_lser",
      "created_time": "September 05, 2022, 05:59:19 PM",
      "body": "Quote from: A-Bolt on September 05, 2022, 05:20:03 PMQuote from: The0ldl_lser on September 05, 2022, 05:08:43 PMа мне вот лично более интересно что будет с USDT на эфире? Это уже давно никому не интересно.USD₮ Supports ETH Proof-of-Stake TransitionQuote As the issuer of tether tokens, Tether intends to support only tether tokens on the Ethereum POS chain post-merge and will cease support for Ethereum POW chain post-merge.Логично. Выводы делать вам.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "booktiger",
      "created_time": "September 07, 2022, 07:35:54 AM",
      "body": "ETHW еще может сходить куда нибудь на 1-5 долларов, дороже киты не будут аккумулироваться, думаю когда майнинг запустят то цена туда через 3-6 месяцев придет. Так как монета уже на крупных биржах залистена то будущее у нее все таки есть, че бы там скептики не писали.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satcomcom",
      "created_time": "September 07, 2022, 11:23:33 AM",
      "body": "Quote from: booktiger on September 07, 2022, 07:35:54 AMТак как монета уже на крупных биржах залистена то будущее у нее все таки есть, че бы там скептики не писали.Пока никакой монеты нет а токены на бирже имеют срок истечения и если,например,майнинг сдохнет,токены на биржах в лучшем случае превратятся в тыкву а в худшем вплоть до отрицательного ценника.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "delfastTions",
      "created_time": "September 08, 2022, 09:38:59 AM",
      "body": "Uniswap не поддержит потенциальные PoW-форки Ethereum Протоколы Uniswap не поддержат какие-либо форки Ethereum на алгоритме Proof-of-Work (PoW) после The Merge. Об этом заявили в стоящей за проектом организации Uniswap Labs.Ну для них это конечно логично, как и для OpenSea.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "madnessteat",
      "created_time": "September 13, 2022, 07:32:10 AMLast edit: September 13, 2022, 12:18:21 PM by madnessteat",
      "body": "\" Разработчики PoW-форка Ethereum раскрыли детали запуска мейннетаЗапуск основной сети форка Ethereum на алгоритме консенсуса Proof-of-Work (PoW) состоится в течение 24 часов после The Merge. Об этом заявила команда проекта.Точное время разработчики объявят за час до начала работы мейннета и запустят таймер обратного отсчета.После слияния в сети будет выпущено 2048 пустых блоков. Это необходимо, чтобы убедится в успешном переключении идентификатора цепочки.Начальная сложность майнинга в сети ожидается не ниже 220 Т, что соответствует 15 TH/s с точки зрения хешрейта, уточнили представители проекта форка. \"Источник: https://forklog.com/razrabotchiki-pow-forka-ethereum-raskryli-detali-zapuska-mejnneta/\" Шансы на успех ETH PoW. Мнение девелопера, имевшего отношение к запуску ETCИгорь Артамонов ( блокчейн девелопер, фаундер и лид в проекте Emerald) пишет в твиттере:«Как человек, сыгравший определенную роль в запуске Ethereum Classic, я решил посмотреть, что происходит с Ethereum PoW. Что ж, их шансы невелики, и позвольте мне сказать вам, почему:Во-первых, у них есть действительно веские основания для запуска ETH PoW, эти основания лучше, чем у ETC. Технология майнинга общедоступна, все инструменты существуют, многие люди доверяют PoW больше, чем PoS Основным аргументом, который может быть использован «PoW более безопасен\". Но они продвигают идеи ETH PoW под лозунгом \"майнерам нужно зарабатывать деньги\". Это не то, почему люди используют блокчейн. \"Безопасность\" была бы лучшей причиной.Разработчики не заботятся о том, чтобы привлечь к проекту настоящих блокчейн девелоперов. Не похоже, что они раньше использовали Github. В репозитории неразбериха, нет ответов на проблемные запросы. Изменения в коде выглядят не очень хорошо.Например, самым первым изменением, которое они внесли, было введение перевода комиссий за транзакции на их собственный адрес. Это подрывает доверие.Поскольку это переход с PoW на PoS, лучший момент для запуска ETHPOW - за несколько часов до слияния. Это замедлило бы основную цепочку и отвлекло бы все внимание в самый критический момент. Шум был бы на весь твиттер. Они игнорируют такую возможность.Разработчики хотят отложить фактический запуск на несколько дней позже. Это все равно что потерять 90% импульса сразу после запуска. Это существенный косяк для непрерывного блокчейна, который не будет терпеть остановку на несколько дней.У разработчиков было достаточно времени, чтобы подготовить Обозреватель блоков, Кошелек и общедоступный RPC. Это должно существовать в первые часы запуска ETH PoW. Сейчас существует несколько вариантов с открытым исходным кодом, так что использовать их не так уж сложно. Похоже, у них ничего не запланировано.Я предполагаю, что они что-нибудь запустят. Но они не знают, что они делают и как правильно это делать. Сеть может работать в течение короткого периода, но если к ней не присоединится кто-то более профессиональный, она скоро рухнет. Пока что это прекрасная возможность, упущенная из-за плохого исполнения»https://twitter.com/splix/status/1569337177984700417 \"Источник: https://t.me/Defiscamcheck/2812",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satcomcom",
      "created_time": "September 13, 2022, 11:22:33 PM",
      "body": "Quote from: madnessteat on September 13, 2022, 07:32:10 AMИгорь Артамонов ( блокчейн девелопер, фаундер и лид в проекте Emerald) пишет в твиттере:самым первым изменением, которое они внесли, было введение перевода комиссий за транзакции на их собственный адрес. Это подрывает доверие.Если рассматривая условие что официальные источники говорят правду вы видите мир полным хаоса и населённым идиотами а в версии где вам лгут из каждого утюга заметна логика и вполне рабочие схемы бизнеса,очевидно,вам лгут буквально\"из каждого утюга\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}