{
  "id": "topic_5447466",
  "title": "wolwoo",
  "author": "wolwoo",
  "created_time": "April 03, 2023, 10:45:45 PM",
  "content": "bknzhttps://bitcointalk.org/index.php?topic=5445611.msg62029985#msg62029985",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447466",
  "comments": [
    {
      "author": "mandown",
      "created_time": "April 04, 2023, 01:31:46 PM",
      "body": "Hep böyle olmadı mı? Birisi ortaya birşey çıkartıyor birkaç ay içerisinde ortalık onunla dolu oluyor millet sonra satın almaktan kaçınıyor bu yüzden yatırımcıda kaçıyor malesef bu platformun ve ekosistemin en büyük sorunu bu üret token sat devam sonu yok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzigie",
      "created_time": "April 05, 2023, 07:02:26 AM",
      "body": "Quote from: wolwoo on April 03, 2023, 10:45:45 PMbknzhttps://bitcointalk.org/index.php?topic=5445611.msg62029985#msg62029985Dolandırıcıların işi çok kolay. Hangi konu gündem olursa onun dolandırıcılık projesini oluşturuyorlar. Covid 19 virüsü bütün dünyanın gündemine girmişti. Onun hakkında bile coin çıkarmışlardır kesin. Ne olsa aynı şablonlara sahip web siteleri, aynı white paper'lar aynı yol haritaları ve aynı söylemleri anahtar kelimeleri değiştirerek tekrar yayınlıyorlar. Bu işi sonsuza kadar yapabilirler. Dolandırıcılık projeleri hakkında kafa yormalarına bile gerek yok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "April 17, 2023, 03:17:14 PM",
      "body": "QuoteCovid 19 virüsü bütün dünyanın gündemine girmişti. Onun hakkında bile coin çıkarmışlardır kesin.bsc ağında covid19 diye bir token çıkarmışlardıhype neredeyse insanlar da orada biliyorsunuz. shiba popüler olduğu zaman bin tane adında shiba geçen token çıktı ki aynı şekilde doge de öyle oldu. şimdi sıra ai'de olduğu için önüne gelen ai basıyor. kolay yoldan para kazanmak isteyenler birer birer av olup çıkıyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flipme",
      "created_time": "June 22, 2023, 04:24:27 PM",
      "body": "Quote from: gospodin on April 17, 2023, 03:17:14 PMQuoteCovid 19 virüsü bütün dünyanın gündemine girmişti. Onun hakkında bile coin çıkarmışlardır kesin.bsc ağında covid19 diye bir token çıkarmışlardıhype neredeyse insanlar da orada biliyorsunuz. shiba popüler olduğu zaman bin tane adında shiba geçen token çıktı ki aynı şekilde doge de öyle oldu. şimdi sıra ai'de olduğu için önüne gelen ai basıyor. kolay yoldan para kazanmak isteyenler birer birer av olup çıkıyor.Covid19 diye bir token çıkardıklarını ben de hatırlıyorum ama diğerlerini görmesem de yalnızca bir tane çıkarmadıklarına çok eminim.  Kötü düşüncelere sahip insanlar hayatın her alanında var. Onlardan hiçbir zaman kurtulamayacağız. Ancak bana garip gelen kötü niyetli insanlara yem olmak konusunda hiçbir çaba göstermeyen insanlar. Ne yazık ki bazıları scam token olduğunu bile bile bu tokenlere rağbet gösteriyor. Eskiden scam tokenlere karşı aşırı derecede öfkeliydim ama artık onların da bir piyasasının olduğunu düşünmeye başladım. Scam token olduğunu bile bile bu tokenleri alan insanlar var.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}