{
  "id": "topic_5437546",
  "title": "karabiber",
  "author": "karabiber",
  "created_time": "January 31, 2023, 08:12:25 PMLast edit: January 31, 2023, 09:11:06 PM by karabiber",
  "content": "Türkiye'de ortalama bir sıfır aracın 600.000 TL'lere dayandığı bu dönemde asgari ücretle neredeyse 65-70 ayda araba alınabiliyor. Yani asgari ücretle çalışan bir kişi 5 sene yemeden içmeden para biriktirirse diğer değişkenlerde sabit kalırsa otomobil sahibi olabiliyor. Cidden boşa yaşıyoruz gibi geliyor bazen. Bu arada bu alabileceğiniz en boş otomobiller oluyor. Ekstra şeyler de olsun isterseniz fiyatlar uçuyor. İkinci elde de durum farklı değil 20 senelik neredeyse hurdaya ayrılacak araçlar 200.000 TL'den satılıyor. Asgari ücretli biri yemeden içmeden 20 senelik bir aracı bile 2 yılda alabiliyor. Dünya'nın bizden geri kalmış yerleri elbette vardır ancak otomobil gibi ihtiyaç olan bir şeye ulaşabilmek bu kadar zor olmamalı. Anlamsız vergilerin yüklendiği otomobilleri alabilmek için neredeyse hayatımızın önemli bir bölümünü harcamış oluyoruz. ÖTV konusunun başta otomobiller için mutlaka yeniden düzenlenmesi hatta bir daha gelmemek üzere kaldırılması gerekiyor. İnsanların otomobile ulaşımı bu kadar zor olmamalı.Grafikte bizi kıskanan Avrupa ülkelerinde ve Türkiye'de 1000 kişiye düşen otomobil sayısını görüyorsunuz. Grafik kaynak: https://ebsdanismanlik.com.tr",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437546",
  "comments": [
    {
      "author": "RaltcoinsB",
      "created_time": "January 31, 2023, 08:24:58 PM",
      "body": "Bu galericilerde bunlara rağmen hala karaborsa yapma derdinde aç gözlülükte sınır tanımıyoruz hala daha fazlası daha fazlası diyoruz 500 bin lira liste fiyatı olan araba değişeni ve kilometresi olduğu halde 700 bin liraya ilana konuluyor sebep ne sıfır araba yok bahanesi zaten asgari ücretli arabayı bile alda muayenesi vergisi benzini tüpü derken daha çok sıkıntıya girecek Allah hepimizin yardımcısı olsun hocam diyecek bir şey yok",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "emrecemsan",
      "created_time": "January 31, 2023, 08:29:15 PM",
      "body": "ÖTV diye bir verginin ben dünyanın hiçbir yerinde eşi benzeri olduğunu duymadım şahsen. ÖTV zaten ilk çıktığı zamanlarda amacı depreme yönelik kullanılacak olmasıydı. Fakat daha sonra ÖTV'nin alanı iyice genişletildi ve şartları da iyice ağırlaştırıldı. Ekonominin geldiği şu kötü noktada ve üretim anlamında oldukça zayıf bir ülke olduğumuzu da hesaba katınca ÖTV oranları ciddi şekilde artırıldı.Ülkede yapılması gereken bir numaralı atılımlardan birisi de genel anlamda üretime önem vermek. Bu sayede ÖTV'den geçinen bir ülke olmaktan çıkarız ve böylece ÖTV yavaş yavaş kaldırılma noktasına kadar gidebilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "January 31, 2023, 08:39:42 PM",
      "body": "Ne yazık ki ülkemizde araba almak zor olduğu kadar bu vergi zımbırtısı yüzünden birazda mantıksız kalıyor. Örnek veriyorum elin yabancısı arabasıyla geliyor ve herhangi bir ücret vermiyor. Quote17. Soru: Bu işlemler için gümrük idaresine ödeme yapılması gerekiyor mu?Cevap: Bu işlemler için gümrük idaresince herhangi bir ücret alınmamaktadır.Kaynak: Yolcu Beraberi Taşıtlarİşte asıl bunlardan o vergileri almak lazım. Bir zaman bunlar trafik cezası ve Hgs gibi yerlerin cezasını umursamadan yardırıp gidiyorlardı çünkü ortada bu cezalara dair bildiğim kadarıyla başta AB ile herhangi bir mütabakat yoktu da. Yakıt fiyatları, vergiler, sigorta, kasko vs vs vs ile de mantıksız kalıyor kilometrede 1 liradan az yakan araba yok desek neredeyse yeridir. Ama mantıklı olduğu kısım da şu artık milletin alım gücü iyice düştü ve olabildiğince toplu taşımaları kullanıyorlar veya ailevi durumlarda gerçektende ihtiyaç hasıl oluyor. Araban olmadığı zaman cidden zor oluyor. Araba almak mı zor yoksa arabanın kontağını çevirebilir olmaya para yetirmek mi zor valla isveçli bilim adamları bile bu soruya cevap bulamaz  Ancak önemli olan ilk arabayı almak bana göre ilk arabayı aldıktan sonra yavaş yavaş model yükseltilir 3-5 üstüne koya koya ama. Şimdi hiç yokken araba almak istediğinde yandın ki ne yandın...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wolwoo",
      "created_time": "January 31, 2023, 09:04:11 PM",
      "body": "kimileri maybach'a airbusa biner kimi metroya otbüse  ötv olmasa o para nerden gelecek eyyy ....neyse",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "W Jr.",
      "created_time": "January 31, 2023, 11:38:36 PM",
      "body": "Quote from: wolwoo on January 31, 2023, 09:04:11 PMkimileri maybach'a airbusa biner kimi metroya otbüse  ötv olmasa o para nerden gelecek eyyy ....neyseBu arada ÖTV muafiyeti için tutar da %123 değerlenerek 1 milyon lira civarına çıkmış durumda.Şu durumda engelli raporuyla indirimden faydalanabilecek arkadaşlar için ciddi fiyat düşüşleri kendini gösterecek.Onun dışında verilen ÖTV bir araç parası kadar daha olduğu için araba almak hayal olarak kalıp, metrobüs, tramvay ve otobüse kesinlikle devam edilmek zorunda kalınacak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "February 01, 2023, 06:55:46 AM",
      "body": "Birkaç haftadır bir arkadaşımıza araba bakıyoruz. Elinde 2014 civarı manuel vites Ibıza var. Ortalama satış fiyatına 320 bin lira diyorlar, yerine ise benzer özelliklerde otomatik vites bir araba bakıyor. Hemen hemen aynı yıllara ait otomatik vites arabanın fiyatı ise 470-480 bin lira. Sırf araba otomatiğe dönsün diye başka ülkelerde güzel bir araba alacak birimde para fark isteniyor.Tabi bu dönemde ne kendi aracını satabiliyor ne de temiz bir araba bulabiliyor. Galeriler 40 bin lira altına teklif veriyor, alacağı arabanın fiyatı ise her hafta 10 bin lira yükseliyor. Bu ülkede ya galerici olacaksın ya da emlakçı",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "February 01, 2023, 09:44:50 AM",
      "body": "Quote from: xzone on February 01, 2023, 06:55:46 AMBirkaç haftadır bir arkadaşımıza araba bakıyoruz. Elinde 2014 civarı manuel vites Ibıza var. Ortalama satış fiyatına 320 bin lira diyorlar, yerine ise benzer özelliklerde otomatik vites bir araba bakıyor. Hemen hemen aynı yıllara ait otomatik vites arabanın fiyatı ise 470-480 bin lira. Sırf araba otomatiğe dönsün diye başka ülkelerde güzel bir araba alacak birimde para fark isteniyor.Tabi bu dönemde ne kendi aracını satabiliyor ne de temiz bir araba bulabiliyor. Galeriler 40 bin lira altına teklif veriyor, alacağı arabanın fiyatı ise her hafta 10 bin lira yükseliyor. Bu ülkede ya galerici olacaksın ya da emlakçı Gitsin sıfır arabaya sıraya girsin hocam vallaha ondan daha iyidir ikinci el 2014 model otomatik araca 470 bin lira vereceğine i20 tarzı bir araç veya i10 tarzı alabiliyorsa alsın keyfine baksın kaç ayda gelir bilmiyorum ama geldiğinde en azından sıfır araca biner arkadaşınız türkiyede otomatik vites lüks görüldüğü için bu farklar isteniyor ama sıfır arabalarda otomatik vites farkı bile 30-40 bin lira",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "February 01, 2023, 10:28:18 AM",
      "body": "Quote from: RaltcoinsB on February 01, 2023, 09:44:50 AMGitsin sıfır arabaya sıraya girsin hocam vallaha ondan daha iyidir ikinci el 2014 model otomatik araca 470 bin lira vereceğine i20 tarzı bir araç veya i10 tarzı alabiliyorsa alsın keyfine baksın kaç ayda gelir bilmiyorum ama geldiğinde en azından sıfır araca biner arkadaşınız türkiyede otomatik vites lüks görüldüğü için bu farklar isteniyor ama sıfır arabalarda otomatik vites farkı bile 30-40 bin lira Ona da baktılar, markanın birisi için sıraya girdiler ama 4 aydan önce araç gelmez diyorlar. Geldiğinde de fiyatı sabit kalmayacak ve güncel kur/fiyat ile işleme alacaklar. Muhtemelen dediğiniz gibi i20'ye bakmışlardır ama şu anda 550 diye anlaşılan araç 4 ay sonra yaz gelince muhtemelen 600-700'e çıkacaktır. Şu piyasada en mantıklısı temiz temiz sıfır almak ama onda da vergisi insanın canını göz göre gör sıkıyor. Piyasa gerçekten o kadar manasız ki insan anlam vermeye çalışsa da veremiyor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "February 01, 2023, 10:34:45 AM",
      "body": "Hyundai bayona ciddi bir zam gelmiş ancak aracı şubat içinde verebileceğini söyleyen bayiler var öncelik takaslı ticaretmiş ancak illa kalan oluyormus.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "February 01, 2023, 12:47:19 PMLast edit: February 01, 2023, 03:38:28 PM by eightdots",
      "body": "Bazı videolar var sıfır araç alanlar araç içini gösteriyor camlar manuel teyp desen emanet duruyor ekran falan zaten yok. Şimdi bu fiyatlar genelde 500-600 bin arası olan sıfır araçlar. Bu paraları verip hiçbir özelliği olmayan araca sırf sıfır araca binicem diye almak mantıklı mı. 2. eldeki araçların hepsi değerinden yüksek ama en azından bomboş araç almaktan iyidir. Hem sıraya girmek hem de o dönemin kuruyla sürprizle karşılaşma riski de varken neden daha dolu 2. el olan araçlara yönelinmiyor. Şu dönemde belirli sınıf araçlar dışında anlattığım tamamen boş olarak satılan sıfır bir araca bu fiyatları vermek doğru mu bilmiyorum. Söylediğim araçlar boş paket olarak satılan araçlarla ilgili ve verilen sıfır olmasından dolayı yüksek miktarla ilgili. Bu fiyatlara 0 almaktansa daha dolu bir paketin 2. elini almanın daha iyi bir tercih olacağını düşünüyorum. Belirli sınıf araçlar için bakanlar bu durumun dışındalar. Herkese istediği araba nasip olur umarım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "February 02, 2023, 06:58:47 PM",
      "body": "Ötv saçmalığıyla ilgili eminim herkes dolmuştur, sabaha kadar konuşabiliriz ama bana en çok dokunan Bulgaristan ve Romanya gibi ülkelerden bile kötü durumda olmamız. Bu gerçekten kanıma dokunuyor. Bizim ülkede genel olarak bir kalite sorunu var. Her şeyde. Hak ettiğimiz ülkede yaşayamıyoruz. Romanya ve Bulgaristan sanayisi çok az olan, genç nüfusunu ab'nin diğer ülkelerine kaptırmış ve doğu bloğundan neredeyse daha dün çıkmış ülkeler. Onlardan geride olmamız gerçekten skandal. Bence bizim nüfus da gereksiz fazla, bir de üstüne açık kapı politikasıyla kim bilir kaç milyon kaçak var. Araba fiyatları ve ötv konusunda Toyota Türkiye Ceo'sunun başkanı olduğu Otomotiv Distribütörleri Derneği (ODD) bir plan önerdi. Bu plan bana da mantıklı geliyor(https://www.cumhuriyet.com.tr/ekonomi/otomotiv-sektorunden-otvyi-kaldirma-plani-2008343). İlgilenenlerin tam detayına bakmasını öneririm, sitelerinde pdf'i vardı. Onun dışında bir gecede ötv sıfırlamak imkansız maalesef, baştan olmaması gerekiyordu. Ayrıca böyle sorunlarımızı ancak kişi başına düşen geliri 20k - 30k dolar seviyelerine çıkarabilirsek hafifletiriz. Orta vadede ben araba sorununun çözüleceğini hiç sanmıyorum. Bugüne kadar mal edinebilen şanslı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "husdemba",
      "created_time": "February 02, 2023, 07:42:46 PM",
      "body": "Mesleğe başlamamla birlikte 3 yıl para biriktirerek orta halli bir araba aldım daha sonraki 4 yılda ise şu anki orta halli arabaların beşte birini falan ancak alabiliyorum. Bunun gibi milyon tane örnek var ve hepsi zamanında mal edinen edinmişe çıkıyor bu saatten sonra ev almak da araba almak da hiç kolay iş değil..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "W Jr.",
      "created_time": "February 03, 2023, 02:21:32 PM",
      "body": "Quote from: husdemba on February 02, 2023, 07:42:46 PMMesleğe başlamamla birlikte 3 yıl para biriktirerek orta halli bir araba aldım daha sonraki 4 yılda ise şu anki orta halli arabaların beşte birini falan ancak alabiliyorum. Bunun gibi milyon tane örnek var ve hepsi zamanında mal edinen edinmişe çıkıyor bu saatten sonra ev almak da araba almak da hiç kolay iş değil..Artık araba almak için 3 yıl yetmiyor, 3 yılda arabanın %30’u ancak alınabiliyor.Eğer gerçekten mal mülk edineyim derseniz zaman hep aleyhinize işliyor.Şu an ev araba alınacak durumu sağlamak için yatırım olarak iyi bir miktar kripto paralar ile uğraşılmalı bence.İşi biraz da risk almadan olmaz şeklinde düşünmek lazım.Yine de kaybedebileceğinizi düşünerek hareket etmek en doğru hamle olur.Biriktirerek bir şeyler alamıyoruz bu enflasyon ile de alamayız zaten.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "February 04, 2023, 03:39:43 PM",
      "body": "Vergilerden doğrulamıyoruz, önümüzü göremiyoruz araba yüzü görelim. Bu vergi dilimleriyle araba almak beni enayi gibi hissetirir, şuan en ucuz araba xxx diyelim bir demir yığınına o kadar para harcamak yerine o parayı ben gene farklı sektörlerde değerlendirmeye çalışırım risk alırım, kaybetsem de önemli değil fakat arabaya 1m vermem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "February 04, 2023, 03:47:36 PM",
      "body": "20 Yıllık iktidarın başarısıdır. Geldikleri dönem bundan en azından iyiydi şimdi geldiklerinden daha da kötü durumdayız.1.000.000 tl 1 tl olduğunda ekonomik anlamda kimse birşey kaybetmedi ancak şuan öyle değil. 1 tl ile geldiklerinde 0.58 usd alınıyordu şimdi ise 0.05 ancak alıyor eee bu araçların parçalarını biz üretmiyoruz dışarıdan alyıoruz ne olacaktı ya",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "50promil",
      "created_time": "February 05, 2023, 07:41:41 AM",
      "body": "ben 2001 de üniversitedeydim . temel gıdanın bile bu kadar saçma sapan lüks olduğunu,kazık gibi zam saplandığını hatırlamıyorum . \" açlıktan geberecek peynir ekmek yiyor \" derdik. hadi bakalım şimdi yesin peynir ekmek. peynir olmayan yoğurttan bozma süzme peynir bile 100 liraydı en son . en ucuzu da o sanırım zaten . ben günlük 2 kilo ete çalışıyorum mesela... kepazelik .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "February 05, 2023, 09:55:50 AM",
      "body": "geçen sene yaptığım en mantıklı işin araba almak olduğunu bu başlığı okuyunca tekrardan anladım. ben arabayı aldığım zaman dolar 14 liraydı ama arabanın fiyatı şu an neredeyse %70 arttı. bu fiyat da koyduğum anda satılacak olan ölü fiyat ha.türkiye'de ev, araba almak gibi terimleri bir süre unutmak gerekiyor. bilgisayar, telefon, beyaz eşya artık yanına yaklaşılacak bir ürün değil. 20 sene önce evlerde buzdolabı yoktu ama artık alacak para da yok amk:) boktan columbia botu bile 2-3 bin liradan başlıyor. bu ülkenin vatandaşları bunu hakketmiyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}