{
  "id": "topic_5256529",
  "title": "fillippone",
  "author": "fillippone",
  "created_time": "June 18, 2020, 05:58:20 PMLast edit: May 16, 2023, 01:48:59 AM by fillippone",
  "content": "Since the publication of PlanB articles, the Bitcoin value proposition has gained a sort of validation based on a solid model, which proved with rigorous maths the rhetoric of “Bitcoin is valuable because it is scarce”. This made Bitcoin Investment viable for a series of actors, who were ready to embark in a series of legal, regulatory and fiscal hassles to get long exposure to bitcoin. Others will inevitably follow, but those who embarked in this venture earlier gained market shares and profits in a less than competitive market.One of the most discussed amongst these funds is Grayscale. The huge amount of bitcoin they bought has drawn attention from the community. Be it because of a signal of institutional adoption or a measure of scarcity of bitcoin when measured against mined bitcoin. I think many concepts about this fund have been oversimplified, and a few technical details of the inner functioning could better serve a global understanding on how this fund works, how it is used by institutional investors, be it “fiat investors” or whales, and by retail investors. Given the fact Grayscale was very often commented in the news, some insightful reports, and a very good thread in the Italian board, I decided to go with a thread detailing some of the main aspects, going through some finer details, trying share what I have learned in the process. During all this article, I will refer to this spreadsheet, where you can see the details of many of the computation. You can open it and play with it. Thank you to the fellow Italian members who discussed on Grayscale thread by Plutosky on their local board.Table of ContentsGrayscale Company Profile and FaqPrimary MarketSecondary MarketArbitrageIn-Kind BuyingHedging StrategiesConclusions1. Grayscale Company Profile and FaqOn Grayscale Website, we can find a good amount of information about the general company profile and organisation: QuoteGrayscale Investments, LLC (“Grayscale”) is the largest digital currency asset manager. With approximately $3.3B AUM,* Grayscale provides opportunities for investors to gain exposure to the digital currency asset class. Grayscale is the sponsor of Grayscale Bitcoin Trust (BTC), Grayscale Bitcoin Cash Trust (BCH), Grayscale Ethereum Trust (ETH), Grayscale Ethereum Classic Trust (ETC), Grayscale Horizen Trust (ZEN), Grayscale Litecoin Trust (LTC), Grayscale Stellar Lumens Trust (XLM), Grayscale XRP Trust (XRP) and Grayscale Zcash Trust (ZEC), and the manager of Grayscale Digital Large Cap Fund LLC. The trusts and the fund are collectively referred to herein as the “Products”. Any Product currently offering share creations is referred to herein as an “Offered Product”. Grayscale Digital Large Cap Fund is currently not an Offered Product.Grayscale LLC manages a series of Trusts; they are more or less replicas of each other, with very similar mechanisms.QuoteThe Products are privately offered investment vehicles available to institutional and accredited individual investors through their respective private placements. Grayscale’s single-asset Products provide exposure to Bitcoin (BTC), Bitcoin Cash (BCH), Ethereum (ETH), Ethereum Classic (ETC), Horizen (ZEN), Litecoin (LTC), Stellar Lumens (XLM), XRP, and Zcash (ZEC). Grayscale’s diversified Product, Grayscale Digital Large Cap Fund, provides exposure to the top liquid digital assets by market capitalization and currently holds BTC, ETH, XRP, LTC, and BCH. The Grayscale Digital Large Cap Fund private placement is also offered on a periodic basis to accredited investors* only but is currently closed.Each Product’s investment objective is for the value of its shares (based on digital assets per share) to reflect the price performance of such Product’s underlying digital asset(s), fewer fees and expenses. Modelled after popular commodity investment products, each Product was created for investors seeking exposure to digital assets through a traditional investment vehicle. Those products are privately offered investments, available to investors through private placements. The objective of each fund is to passively track the performance of the underlying they are tied to. So Grayscale doesn't seek additional yield through active management, investments or other revenue sources. They are totally passive investors. The Trusts are open-ended, and to this perspective, they are different from the majority of publicly traded futures on any exchange, who are subject to an expiration date, requesting the investor to roll the position over to subsequent contracts (there exist some \"Perpetual futures\", but their scope is actually limited). QuoteAdditionally, Grayscale Bitcoin Trust (OTCQX: GBTC), Grayscale Ethereum Trust, (OTCQX: ETHE), Grayscale Ethereum Classic Trust (OTCQX: ETCG), and Grayscale Digital Large Cap Fund (OTCQX: GDLC) are publicly-quoted on the OTCQX® Best Market, the top tier operated by the OTC Markets Group and available to all individual and institutional investors.Some of those privately offered investments are also publicly quoted on the public market. QuoteExcept for Grayscale Bitcoin Trust, which became an SEC reporting company on January 21, 2020, the Products are not registered with the U.S. Securities and Exchange Commission (the “SEC”) and are not subject to disclosure and certain other requirements mandated by U.S. securities laws. The biggest fund is the Grayscale Bitcoin Trust (BTC), with a little less than 90% of the total AUM of Single assets funds. GBTC is the only fund that is registered with the SEC, so it is the only one to respect all the required rules by the public agency. The minimum investment threshold and the management fees represent a piece of notable information. The minimum threshold at $ 25,000 ($50,000 for GBTC) denotes those products not viable for small retail investors, freeing the Sponsor to a series of disclosure to protect the most inexperienced investors. The management fee is deducted from the theoretical price on a daily accrual basis to cover annual administration and safekeeping fees. All these funds have some common regulatory characteristics: The most notable ones are the Index Provider Tradeblock and Coinbase as custodian.This means all the computations are executed on the back of Tradeblock price computations (more details on this later) and that the assets are held on a cold wallet at Coinbase. On a side note, we note that Grayscale is part of a group: QuoteGrayscale is a subsidiary of Digital Currency Group, Inc. (“DCG”). DCG has interests in multiple digital currency ventures in addition to Grayscale. CoinDesk, the leading digital media, events and information services company for the digital asset and blockchain technology community, is also a subsidiary of DCG. CoinDesk is editorially independent from DCG and Grayscale, and any views or opinions expressed by CoinDesk are not the views or opinions of Grayscale.So, CoinDesk is independent from Grayscale, but they are part of the same group. 2. Primary MarketLet's look at the BTC trust fact sheet. From here it is clear the private trust has the right to issue shares in the primary market following a determined procedure to Accredited Investors (AI), who are the only subject eligible to invest in the Trust. What are the requisites to be an AI? QuoteAny natural person who had an individual income in excess of $200,000 in each of the two most recent years or joint income with that person’s spouse in excess of $300,000 in each of those years and has a reasonable expectation of reaching the same income level in the current year;orAny natural person whose individual net worth, or joint net worth with that person’s spouse, exceeds $1,000,000 (excluding the value of the person’s primary residence and certain indebtedness secured by such person’s primary residence).Of course, banks, partnerships, corporations, nonprofits and trusts (with funds in excess of $ 5 millions) are considered Accredited Investors. The procedure to issue new shares is quite simple.Every day at 4:00 PM the VWAP, a Volume Weighted Averaged Price, of the XBX Index (a volume-weighted average of bitcoin on different exchanges) is computed. This is going to constitute the benchmark index of the fund. QuoteNotably, the official NAV for Bitcoin Investment Trust shares is calculated once daily (on business days at 4pm) by Grayscale, using a weighted average of the XBX Index over the preceding 24-hour period.The funding is then divided by this price to determine the equivalent BTC amount. This amount is then divided by the per-Share Digital Asset Holdings to compute the actual number of Shares. In the attached spreadsheet I provided a live computation: The Bitcoin per shares amount is a number decreasing each day to reflect the accruing of the yearly 2% fee. You have an example of computations in the spreadsheet. This means each share control each day less and less bitcoin, the portion of bitcoins that is not anymore \"controlled\" by the shares is actually the remuneration for GBTC.From here you can also compute the NAV.If you multiply the official Benchmark Price times the Bitcoin per Shares, you get the NAV of each share:According to Grayscale Website: So, while each share has a \"bitcoin per share\" equivalent, the NAV is the US Dollar equivalent of this measure. As per SEC regulations, The Shares are not freely Transferable. We read on the termsheet, and on the fine print we discover that: QuoteEligible for resale in accordance with Rule 144 under the Securities Act after a one-year holding period. Pursuant to Rule 144, once the Product has been subject to the reporting requirements of Section 13 under the Exchange Act for a period of 90 days, the minimum holding period will be shortened from one year to six months. We cannot assure you that a secondary market will develop.So the subscriber of such shares exposes herself to a 6 month holding window. At the end of this window, she will be free to sell the shares in the open market. Provided that there is one, as Grayscale is not involved in such. Also, Grayscale is not accepting those shares back, as buyback agreements are not guaranteed: QuoteGrayscale Bitcoin Trust does not currently operate a redemption program and may halt creations from time to time. There can be no assurance that the value of the shares will approximate the value of the Bitcoin held by the Trust and the shares may trade at a substantial premium over or discount to the value of the Trust's Bitcoin. The Trust may, but will not be required to, seek regulatory approval to operate a redemption program.So, when you invest in Grayscale shares, you are actually locked into that, and the only way to get rid of those is on the secondary market, after a minimum of six months. I wrote a post on the thread regarding the restricted shares. Have a look here3. Secondary MarketAs stated on the Grayscale website, eligible shares of Grayscale Bitcoin Trust are quoted on OTCQX® under the symbol: GBTC, making it possible to buy or sell shares continuously through the trading day at prices established by the market.Some information is pretty outdated (market Shares). This image has been taken before the market open, hence the lack of some information (volume, range, etc.).The market has no relationship with Grayscale, and it is operated independently. There are no market making obligations whatsoever, so price can fluctuate freely according to bid-offer pressures. This is the graph of the last 12 months, together with volumes. There is an average of 4.75 millions of shares trading on a daily basis, equivalent to more or less 4,500BTC. 4. ArbitrageWe have seen from previous sections that NAV and Quote prices differ quite a lot.Buying a quote of GBTC in the secondary market you are actually buying bitcoin at a 20% premium, or you are paying more than 11,350 USD per BTC.This is not uncommon, being actually a feature of the GBTC.  Premium is now close to historical minimum level, but has been above 100% during certain periods.Buying a quote of GBTC you are actually buying bitcoin at a 20% premium. Why is that? Well, the first reason is you probably cannot buy GBTC shares in the primary market. In the past the issue of shares has been closed from time to time. And it wasn't always possible to buy shares in the primary market, this of course increased demand for quotes in the secondary market pushing the prices and the premium higher.Secondly many institutional investors cannot trade restricted financial instruments. So they simply cannot buy GBTC shares because they are not freely tradable for the first six months and there is no buying agreement with the issuer.  Lastly there are a lot of investors who would like to buy bitcoins, but simply cannot do that. So they have to buy quotes paying the premium to have an object traded on a regulated exchange, with obvious fiscal, regulatory and legal benefit. Think about a family office who has a mandate to trade only listed products. This would put physical bitcoins out of scope, obliging the money manager to divert to GBTC to get exposure to bitcoins.  These market frictions justify a premium of secondary market quotes versus the NAV of the trust. This premium has been quite volatile in the past, but contrary to popular belief it hasn't been correlated with \"market sentiment\" so I guess the driver was outside public information, and has been simply related to offering policies: Correlation with price level is non-existent, and actually slightly negative.Pretty weak correlation also with \"market sentiment\" expressed as historical performance over 10 trading days.I cannot forecast how the net premium will evolve in the future, but I am quite skeptical on the premium steadily rising again in the near future, at least for a few reasons: Selling restriction has been recently reduced from one year to six months. This greatly reduces the friction between the two markets and hence the premium.Arbitrage activity from AI. As we will detail in the following section, there is a constant \"arbitrage activity\" between the two markets, hence the premium is facing a downward pressure. Competition from other funds or products. As more and more products become available to the general public, the demand for BTC price exposure will direct toward the cheaper offer, thus compressing artificially created premiums.Share offering policies. In the past Graycale closed the new share offering, leaving prospective clients the obligation to go buy those stocks on the market, pushing premiums higher. Today the offering policy is more transparent and audited, so demand should be more easily absorbed by primary market. 5. In-Kind BuyingAs per GBTC termsheet, you can enter the primary market paying USD to buy shares OR contributing your digital asset of the same kind of the fund. This is called \"in-kind\" purchase.Directly from Grayscale F.A.Q.QuoteCan I Purchase shares in the Products with digital assets I already own?Existing and prospective investors may contribute coins in-kind for shares of Grayscale’s single-asset Products. Assuming that each Product is treated as a grantor trust for U.S. federal income tax purposes, such contributions should be a non-taxable event. All investors should discuss the tax consequences of an investment in Grayscale’s family of Products with their tax advisors and review the section entitled “Certain U.S. Federal Income Tax Consequences” in each Offered Product’s Private Placement Memorandum or each Product’s annual and quarterly reports, as applicable, before investing in a Grayscale single-asset Product or considering an in-kind contribution of coins to a Product.So you can transfer your Digital assets against the sale of GBTC shares (in a non taxable event). As this mechanism was little known, it has been hugely overlooked when computing the amount of Grayscale Buying. Only recently a study by Messari shed some light on the mechanism.One of the most common rhetoric has been the quite \"naive\" story of:QuoteGrayscale is buying X% of freshly mined bitcoins. Also, you might have seen spreadsheets like this. Of course, the idea they are buying only freshly minted bitcoins is oversimplifying reality, as it is quite obvious they are buying also \"old\" bitcoin, but actually in-kind sales change the picture quite a bit. The percentage of those in-kind purchases is not well disclosed. The only data we have is from the 2019Q3 report. Given the fact that the in-kind percentage has been quite stable, we can think of it continuing being flat until today, notwithstanding the skyrocketing amounts of bitcoin contributed to the fund.Messari did a few computations about real net Grayscale buying: Numbers are still quite huge, but we see that the actual buying from \"new entrants\" in the market is actually much lower than initially thought. Grayscale actually bought only the 8.2% of newly mined bitcoin YTD, and 31% since halving. Incredible numbers still, but quite different from what has been thought until now. 6. Hedging StrategiesThis explains us the vast majority of GrayScale subscribers are actually institutional investors trying to play the game in the difference between the primary market shares and those freely transferable. Contributing their coins to the trust, they are allowed into primary market share. After 6 months they are allowed to sell on the open market, cashing in a substantial premium, as we have seen above. It's difficult to unsee this skew once you understand how the plan is coming together.There is actually a risk in the process. In case of bitcoin dropping during six month more than the premium we are able to cash-in at the end of the trade, the whole operation incurs in a loss.During the months where the stocks are not transferable the investor is locked in the stock and cannot exit. Also on the upside, he cannot sell the stocks, in case he gets a satisfactory P&L (think about a FOMO induced squeeze). In addition to that we have to understand that the premium here is the realised one, in other words the premium cashed in at the end of the trade. This means that when initiating the trade the investor not only doesn't know the amount of the P&L, but cannot even determine the trading break-even (he can of course estimate it, but it is not predefined). So a risk neutral investor, and arbitrageur, need to hedge his risk in order to cash in a certain profit. There are a few ways of doing so. 6.1 Hedging through short selling GBTC stocksThe first one is the one actually described in the enlightening article GBTC: Arbitraging Regulators and Retail Investors Since 2015. Here all these concepts are described in a very effective way. Even if back then the length of the holding period was longer (one year), little has changed. Basically the idea is to buy the shares in the primary market, possibly with an in-kind purchase. Then borrow the share on the secondary market to short it. In this way the premium is locked, and independently from the final realised premium, the investor has gained a fixed remuneration. We can directly observe this effect not only looking at the compressed premium we have seen recently on the market, but also indirectly noticing how many shares are actually borrowed to short sellers: [/quote]We can actually see how the dynamic of the two quantities is closely related, with the borrowed shares number stagnating or even decreasing when no new shares are issued. 6.2 Hedging through short selling futures Another strategy would be to short-listed futures instead of stocks. This hedge wouldn't be perfect, as the one detailed above, but would also have a few significant advantages. PROCost: shorting a future on an exchange has considerably less cost involved than an OTC lending transaction. The funding rate is market-determined, while GBTC can be considered an oligopoly at best.Liquidity of the market is way higher than GBTC products, so covering a big position is not a problem.CONSHedge is not perfect. We are still exposed to the variations on the margins. If shares in GBTC rise less than BTC (the premium decreases) we are actually exposed to this variation. To recap, we hedged out the directional risk in BTC movements, but we are exposed to premium variation. If premium goes to zero, we have a flat P&L.Time exposure. Listed futures have predefined expiries on exchanges, so there could be a mismatch of expiries between our 6 months deadline and future expiry. This could also mean we have to buy back the future at the expiration of the trade and also probably roll the position between futures. One potential way of avoiding such problems is the use of a perpetual future. The reduction of the holding period to 6 months reduced this problem anyway.6.3 Hedging through optionsA little bit more fancy way of hedging is using options. With option the buyer gains the possibility to buy an insurance ticket to protect herself against unfavorable events. IF you want to learn more, have a read on my thread: Everything you wanted to know about BTC options but were afraid to ask!Basically the idea is this one. The investor wants to take a directional risk, but also doesn't want to incur a loss. To insure against this adversarial scenario, the investor Is ready to give up some margin on the profit side. So, the first thing to do is look at the unhedged P&L, we see that the trade becomes negative at around 8,000 USD. Looking at this, one idea it would be to buy an insurance against this scenario. So let's open Deribit, and we look for downside protection on a 6m trade at a price level of around 8,000 USD.The instrument we want to buy is a Put, strike level of 8,000 USD expiring in December. I see the OFFER price for such a put is 0.124 BTC. The investor wants to finance this buy selling a call. Looking at the call side, we see the highest call with a price above 0.124 (I want to trade the options with the minimum possible positive total price) is the 12,000 Call with a BID price of 0.132. So Buying the 8,000 put and selling the 12,000 I can protect my trade and cash in 0.008 BTC.The final payoff is the thick red line in the following graph:We are exposed to price fluctuations between 8,000 USD and 12,000. We are covered on the downside at 8,000 locking in a tiny payoff. We gain up to 12,000.Above 12,000 we sell the BTC through the call, from that level we are flat again. Warning, the premium we are able to cash in is the one we observe at the end of the trade, not at the beginning. If the premium changes, the total graph is shifted up or down in a parallel manner. 7. Conclusions Hope this post clarifies a little bit the mechanism of such an apparently simple fund. A lot of the details are very difficult to grasp at first read, and, as usual, I also learnt a lot researching for this. Please let me know in the post below which topics you want me to cover more or which details you want me to dig up!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5256529",
  "comments": [
    {
      "author": "coinycoiny",
      "created_time": "June 18, 2020, 06:45:26 PM",
      "body": "Looks like another scam to get hold of peoples money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "June 19, 2020, 01:59:37 PM",
      "body": "It is a due interesting and informative topic. There are so many information that I can not understand but I will try to learn new things. Everyday starts with learning in crypto.The topic has some images that are displayed not well. Could fillippone spend some minutes to edit image displays, please - with the width option in img blocks).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "June 19, 2020, 03:14:50 PM",
      "body": "Quote from: OcTradism on June 19, 2020, 01:59:37 PM<...>The topic has some images that are displayed not well. Could fillippone spend some minutes to edit image displays, please - with the width option in img blocks).Should be fixed now. It's not the image attribute, it's a well known table formatting bug I forgot to properly fix. Thank you for pointing out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Skorillo",
      "created_time": "June 26, 2020, 11:00:05 AM",
      "body": "Grayscale - major player?https://cointelegraph.com/news/at-this-rate-grayscale-will-own-34-of-all-bitcoin-by-january",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "June 26, 2020, 11:28:20 AM",
      "body": "Quote from: Skorillo on June 26, 2020, 11:00:05 AMGrayscale - major player?https://cointelegraph.com/news/at-this-rate-grayscale-will-own-34-of-all-bitcoin-by-januaryI am really skeptical about this treng going on for so long. People are buying GrayScale stocks in the primary market because of the 20%, tax free, premium on NAV they can cash-in once they are able to seell on the secondary market. My guess is that in the long term this premium will have a downward trend, hence reducing the inflow of capital in the primary market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zx9r_",
      "created_time": "June 26, 2020, 01:01:43 PM",
      "body": "Thank you for this interesting post.Another conclusion that I get is that this is a way for the fund to aquire free BTC just printing paper (shares) with no value other for the buyer than being sold in the secondary market. At the end the fund managers get their 2% fees plus the aquired BTC out of nothing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitcoin_paypal",
      "created_time": "June 26, 2020, 01:40:23 PM",
      "body": "Why is this trust so popular with 50k minimum amount?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zx9r_",
      "created_time": "June 26, 2020, 06:29:11 PM",
      "body": "Quote from: bitcoin_paypal on June 26, 2020, 01:40:23 PMWhy is this trust so popular with 50k minimum amount?Because they are buying A LOT of BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "June 29, 2020, 09:48:23 PMLast edit: May 16, 2023, 01:43:05 AM by fillippone",
      "body": "On a side note: what happens when a ETC start strading with the share price  that is constantly within 1% of the NAV? Hopefully one of such instruments has just launched. Who's is a fund servicing? Rich AI using retail to cash in a free 20%, or the retail itself, willing to get exposire to bitcoin paying ony a fair fee?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "June 30, 2020, 03:10:01 AM",
      "body": "Interesting information.I took a look at your post, didn't read all, because one thing really doesn't make any sense to me and made me completely lost my interest about it:2% sponsor fee.Why would someone pay 2% for a third party to hold their bitcoins? This is a ridiculously high fee for a passive fund that have 1 asset.You can see passive funds like IWDA  that have 0.2% fee and manage more than a thousand assets. Or EIMI  which holds nearly 3000 assets and just 0.18% sponsor's fee.Edit: I know it holds bitcoin unlikely traditional funds, but this is a very expensive product. In 10 years you will give them nearly 20% of your total investment (2% per year)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "June 30, 2020, 06:41:51 AM",
      "body": "Quote from: bitmover on June 30, 2020, 03:10:01 AMEdit: I know it holds bitcoin unlikely traditional funds, but this is a very expensive product. In 10 years you will give them nearly 20% of your total investment (2% per year)Long story short: competition.Are you a private investor, willing to be a first class bitcoin citizen, investing time on how to securely manage your private key? Buy real Bitcoin.Are you a private investor, willing to pay someone else to be sure no big mishap will happen to your funds?  Buy GrayScale shares (in the primary market, if possible).Are you an institutional investor, who is obliged to comply to fiscal, regulatory, compliance rules? You HAVE to buy GrayScale shares (in the primary market, if possible).As we saw in my last message another product allowing investors getting rid of the absurd 20% premium has just been launched. In the coming months, or years, competitive pressure for sure will lead to a reduction of the management fee. Other issuers will join the arena, driving prices down. Bear in mind custody (one of the most prominent costs to be repaid by the 2%) is still absurdly dear , when compared to traditional asset finance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "July 01, 2020, 02:37:38 PMLast edit: May 16, 2023, 01:42:47 AM by fillippone",
      "body": "Interesting fact. If you visit the Grayscale website you are warned that the issuance of shares in the primary market are currently closed: If you go to the spreadshseet, you see that the number of outsanding shares has stopped growing since the 24th of June. Reducing the supply of GBTC shares should help the premium to go up again.I think it's too early to call if this has been successful, but I can tell you I don't like it: Grayscale is artificially trying to keep the premium elevated, in order to benefit insiders at the expenses of newly entrant. I greatly prefer more \"fair\" instruments, like the ETP recently launched on Deutsche Boerse.Grayscale halted the sale also in the ETH fund, where the premium has swinged even more vividly during the last weeks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "July 15, 2020, 01:46:35 PM",
      "body": "Grayscale just released their quarterly report.You can download here.Basically their Bitcoin Trust bough 54% of total new mined bitcoin in the last quarter. I updated the spreadsheet with relevant figures.One passage it is worth reading in this respect:QuoteGrayscale Bitcoin Trust Inflows Exceeded Magnitude of Newly-Mined Bitcoin:After Bitcoin’s halving in May, 2Q20 inflows into Grayscale Bitcoin Trust surpassed the number of newly-mined Bitcoin over the same period. With so much inflowto Grayscale Bitcoin Trust relative to newly-mined Bitcoin, there is a significant reduction in supply-side pressure, which may be a positive sign for Bitcoin price appreciation. However, these comparisons are simply to illustrate supply and demand in the market. They do not provide insight into the destination of any mined Bitcoin during the measured period.Basically they said that after the halving the inflow surpassed the amount of newly mined Bitcoin, even if they were fair enough to recognise (it would be absurd otherwise) that the flows, as we have seen in this thread, wasn’t actually buying “new” bitcoins, rather than bitcoins from whales.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DoubleEdgeEX",
      "created_time": "July 15, 2020, 05:44:55 PM",
      "body": "I wonder if they will continue like that, I mean I believe in BTC and ETH but what does that mean for the whole of the market? It´s a high stakes gamble they currently working on, if it ends up positive, it will be the profit of the decade if not, a lot of people will be seriously mad. Beside all that, I´m not sure if I enjoy they idea of a company that is clearly out for profit is slowly becoming a super whale, with the accompanig influence on the blockchains",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "July 16, 2020, 02:58:33 PM",
      "body": "Quote from: DoubleEdgeEX on July 15, 2020, 05:44:55 PM<...>I'm not sure If I enjoy the idea of a company that is clearly out for profit is slowly becoming a super whale, with the accompanig influence on the blockchainsWell, I might agree with you, but what is a better alternative? I believe in markets: profits are there to be made and someone must pick them up. If profits are too big, for sure new players will enter the market reducing those profits (thus benefiting the users). It's a long but inevitable self-regulating process.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "August 05, 2020, 10:00:06 AMLast edit: May 16, 2023, 01:36:22 AM by fillippone",
      "body": "I updated the spreadsheet with latest results from SQUARE: Pretty impressive, of course saying that Grayscale and Square together bought 135% of mined bitcoins is naive, but gives the idea of the buying pressure it is going to hit BTC markets soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "August 05, 2020, 02:14:14 PM",
      "body": "Quote from: fillippone on August 05, 2020, 10:00:06 AMPretty impressive, of course saying that Grayscale and Square together bought 135% of mined bitcoins is naive, but gives the idea of the buying pressure it is going to hit BTC markets soon. Can we then say with at least some certainty that it is Grayscale that is responsible for the price increase that occurs after halving? I somehow lived in the belief that they buy BTC through OTC and that it does not affect the price too much - is it possible that even the OTC market can not withstand such buying pressure, so we now see effects in the open market?On the other hand, are there perhaps other similar funds that do the same as Grayscale, in the sense that they buy some significant quantities of BTC and perhaps are not so exposed in the media? I'm not sure if I've already asked that question in another thread, but how long do you think Grayscale can put this kind of pressure on the BTC market, can we expect even higher percentages in Q3/Q4?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "August 05, 2020, 02:29:49 PM",
      "body": "Quote from: Lucius on August 05, 2020, 02:14:14 PMQuote from: fillippone on August 05, 2020, 10:00:06 AMPretty impressive, of course saying that Grayscale and Square together bought 135% of mined bitcoins is naive, but gives the idea of the buying pressure it is going to hit BTC markets soon. Can we then say with at least some certainty that it is Grayscale that is responsible for the price increase that occurs after halving? I somehow lived in the belief that they buy BTC through OTC and that it does not affect the price too much - is it possible that even the OTC market can not withstand such buying pressure, so we now see effects in the open market?On the other hand, are there perhaps other similar funds that do the same as Grayscale, in the sense that they buy some significant quantities of BTC and perhaps are not so exposed in the media? I'm not sure if I've already asked that question in another thread, but how long do you think Grayscale can put this kind of pressure on the BTC market, can we expect even higher percentages in Q3/Q4?As far as I know, Grayscale is by far the biggest player in the BTC ecosystem. As per the attached spreadsheet they now control more than 2% of the entire BCT supply. Square is getting bigger, and other competitors just started taking steps in this direction, given the huge amount of money to be made. Yet, the pressure is not against the newly mined bitcoin, but against the total supply. So a lot has to be done. But nonetheless, I expect this business growing steadily over the next quarters. Remember that bitcoin is still tiny. The entire market cap of Bitcoin is equal to the market cap that Amazon raised in the month of July only(more or less 220 billions).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "August 12, 2020, 03:40:56 PMLast edit: May 16, 2023, 01:33:56 AM by fillippone",
      "body": "We can talk shit about greyscale about the way they are treating their customers, but for sure thy know how to market their funds. First, they released a new ad. Very nice campaign, less impact than #dropgold, but still a it is goinf to be of a certain impact. Special mention for the Ramones Sountrack, very cool.Secondly they released a Digital Currency Toolkit for Financial Advisor:QuoteIn the ToolkitWhen you download the Digital Currency Toolkit for Financial Advisors, you can expect to learn more about:  The Bitcoin Investment ThesisQualities of BitcoinPortfolio Simulations With and Without Digital Currencies Growing Mainstream Acceptance for Blockchain and BitcoinA Snapshot of the Average U.S. Bitcoin InvestorMillennial Appeal & The Next Generation of InvestorsInvesting in BitcoinFrequently Asked QuestionsQuoteWe know that digital currencies may not be a fit for everyone, but having an objective understanding of the asset class is increasingly important. By providing financial advisors with what they need to stay informed, you can have thoughtful conversations with your clients about digital currencies. As the market evolves, so will this page, as we are committed to providing you with the most up-to-date intelligence to best guide your clients.Pity they didn't include my equivalent: 5 Resources to teach Average Joe about Bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}