{
  "id": "topic_5460702",
  "title": "joker_josue",
  "author": "joker_josue",
  "created_time": "July 22, 2023, 04:11:37 PMLast edit: July 22, 2023, 10:34:13 PM by joker_josue",
  "content": "Eu não sou muito \"fanático\" com essas ideias de privacidade. Mas, reconheço que devemos cada vez mais lidar com cautela com o nosso BTC, pois isso pode facilmente nos identificar.Nesse sentido, estava a pensar como se poderia fazer um pagamento de forma a ter a maior privacidade possivel.O modelo seguia o seguinte:- Enviar BTC para um mix- O mix devolver o BTC para uma nova carteira- Na nova carteira fazer o pagamento desejado- Enviar o troco para o mix- O mix devolve o BTC para a nossa carteira principalAcho que este procedimento era viável, para reduzir  aumentar a nossa privacidade?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460702",
  "comments": [
    {
      "author": "darkv0rt3x",
      "created_time": "July 22, 2023, 06:57:03 PM",
      "body": "Quote from: joker_josue on July 22, 2023, 04:11:37 PMEu não sou muito \"fanático\" com essas ideias de privacidade. Mas, reconheço que devemos cada vez mais lidar com cautela com o nosso BTC, pois isso pode facilmente nos identificar.Nesse sentido, estava a pensar como se poderia fazer um pagamento de forma a ter a maior privacidade possivel.O modelo seguia o seguinte:- Enviar BTC para um mix- O mix devolver o BTC para uma nova carteira- Na nova carteira fazer o pagamento desejado- Enviar o troco para o mix- O mix devolve o BTC para a nossa carteira principalAcho que este procedimento era viável, para reduzir a nossa privacidade?Acho que o querias dizer, era \"aumentar a nossa privacidade\", certo?O procedimento que descreves podia ser adoptado caso os Bitcoins que ias comprar viessem por exemplo de exchanges que não te quisesses relacionar.No entanto, os coinjoins não garantem total limpeza dos Bitcoins. Não foi há muito tempo que tive uma conversa com alguém mais entendido que me disse que por exemplo, quando há Bitcoins marcados como os do Silk Road e outros Bitcoins associados a crime, coinjoin não os limpa por completo. Ajuda, mas não limpa a 100%.Eu acho que em termos de privacidade é mais os IPs dos nossos dispositivos que se ligam à internet para proceder a essas operações. É a gente evitar expôr as PKs das nossas addresses à internet, é o não andarmos com um logotipo de Bitcoin na testa sempre que saímos à rua. São alguns pequenos cuidados que ajudam muito. É também, como costumo ver com frequência, não andar a dizer na net \"I'm a whole Bitcoiner\" e cenas parecidas!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 22, 2023, 10:35:22 PM",
      "body": "Quote from: darkv0rt3x on July 22, 2023, 06:57:03 PMAcho que o querias dizer, era \"aumentar a nossa privacidade\", certo?Pois era! Obrigado pelo o alerta.Então, na tua opinião, achas que não compensa gastar dinheiro em taxas nessas movimentações. Antes, proteger o \"nosso IP\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "July 23, 2023, 01:44:16 AM",
      "body": "Quote from: joker_josue on July 22, 2023, 04:11:37 PMNesse sentido, estava a pensar como se poderia fazer um pagamento de forma a ter a maior privacidade possivel.Envia para uma corretora e pede o saque para outra(s) carteira(s).. Kraken tem limite de US$ 5.000 por dia sem KYC, taxa de 0,0002 BTC/saque.. pela LN é de graça, espero que a adoção aumente.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "July 23, 2023, 02:15:35 AM",
      "body": "Quote from: sabotag3x on July 23, 2023, 01:44:16 AMEnvia para uma corretora e pede o saque para outra(s) carteira(s).. Kraken tem limite de US$ 5.000 por dia sem KYC, taxa de 0,0002 BTC/saque.. pela LN é de graça, espero que a adoção aumente.Eu não sabia que a Kraken ainda não estava pedindo KYC  Ainda mais com a LN, é uma ótima opção agora que a Kucoin começou a exigir KYC dia 15 de JulhoVou fazer meu cadastro lá, é uma corretora que até hoje não tinha feito",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RickDeckard",
      "created_time": "July 23, 2023, 10:55:04 AM",
      "body": "Quote from: joker_josue on July 22, 2023, 04:11:37 PMO modelo seguia o seguinte:- Enviar BTC para um mix- O mix devolver o BTC para uma nova carteira- Na nova carteira fazer o pagamento desejado- Enviar o troco para o mix- O mix devolve o BTC para a nossa carteira principalAinda antes do 1º passo diria que tens também de ter cuidado na forma como compras bitcoin. Se estamos a falar de anonimato total, a melhor forma seria comprares bitcoin através de uma troca com dinheiro real para não haver ligações a ti. Como reconheço que isso poderá ser difícil de fazer, a segunda melhor alternativa é utilizares um mercado P2P. Para aumentar a privacidade das tuas movimentações na blockchain também recomendo que tenhas uma node tua e acedas a ela para fazer qualquer tipo de operação. A razão é simples: Cada vez que pedes para pesquisar um endereço no Blockchair (por exemplo), o serviço está a registar o teu IP e quando pediste essa informação - e possivelmenete outros dados que não me estou a lembrar agora. Da mesma foram, quando te ligas a um node remoto para enviar a tua transacção, não sabes se o \"dono\" desse node está a registar a informação de quem se ligou (IP) e quando.Aliando as acções anteriores ao uso de um mix sempre vais conseguir gerar mais entropia nas tuas movimentações na blockchain do que não usar um. Sei,contudo, que alguns serviços podem rejeitar o teu bitcoin se vier de um mixer[1], mas não tenho visto muitos casos assim. A nível de pagamento de serviço não me lembro de nenhum que tenha rejeitado bitcoin devido a isso. Para evitar isto podes sempre passar bitcoin entre vários endereços controlados por ti (geralmente a Coinbase só vai até uma certa profundidade de trocas).[1]https://cointelegraph.com/news/what-are-bitcoin-mixers-and-why-do-exchanges-ban-them",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "July 23, 2023, 12:12:47 PM",
      "body": "Quote from: rdluffy on July 23, 2023, 02:15:35 AMQuote from: sabotag3x on July 23, 2023, 01:44:16 AMEnvia para uma corretora e pede o saque para outra(s) carteira(s).. Kraken tem limite de US$ 5.000 por dia sem KYC, taxa de 0,0002 BTC/saque.. pela LN é de graça, espero que a adoção aumente.Eu não sabia que a Kraken ainda não estava pedindo KYC  Ainda mais com a LN, é uma ótima opção agora que a Kucoin começou a exigir KYC dia 15 de JulhoVou fazer meu cadastro lá, é uma corretora que até hoje não tinha feitoE eles não são como a Coinbase que inibem o cadastro de brasileiros? eu também não fazia ideia e nem cogitava negociar com ela pois achava que era altamente regulada, se depois puderem compartilhar a experiência. Recentemente vi como opção a exchange BingX que parece aceitar deposito ou saques via pix e ainda não exige KYC (ainda não testei), vejo criptomaniacos fazendo publicidade então quem sabe fica ai uma opção após o inicio das exigencias da Kucoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "July 23, 2023, 02:50:30 PM",
      "body": "Quote from: tg88 on July 23, 2023, 12:12:47 PME eles não são como a Coinbase que inibem o cadastro de brasileiros? eu também não fazia ideia e nem cogitava negociar com ela pois achava que era altamente regulada, se depois puderem compartilhar a experiência. Recentemente vi como opção a exchange BingX que parece aceitar deposito ou saques via pix e ainda não exige KYC (ainda não testei), vejo criptomaniacos fazendo publicidade então quem sabe fica ai uma opção após o inicio das exigencias da Kucoin.De forma alguma… uso a Kraken como exchange principal para sacar meus Euros que utilizo em viagens (pelo banco alemão N26). Tudo registrado com KYC brasileiro, exatamente zero empecilho.E Coinbase também não entendi qual inibição com os brs. Tenho conta lá faz tempo, mas claro que sem mercado e pares para nós ela acaba não servindo de nada.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "July 23, 2023, 03:22:01 PM",
      "body": "Quote from: tg88 on July 23, 2023, 12:12:47 PME eles não são como a Coinbase que inibem o cadastro de brasileiros?A Coinbase sempre me envia e-mail em português pedindo para eu completar o KYC.. então devem aceitar brasileiros..Eu usava bastante na época que os saques da Nicehash pra Coinbase eram de graça, mas nunca verifiquei minha conta.Como o @TryNinja falou, o grande problema da Coinbase e Kraken é que não possuem BRL.. você fica limitado a cripto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "July 23, 2023, 09:10:48 PM",
      "body": "Quote from: joker_josue on July 22, 2023, 10:35:22 PMQuote from: darkv0rt3x on July 22, 2023, 06:57:03 PMAcho que o querias dizer, era \"aumentar a nossa privacidade\", certo?Pois era! Obrigado pelo o alerta.Então, na tua opinião, achas que não compensa gastar dinheiro em taxas nessas movimentações. Antes, proteger o \"nosso IP\".Se escolheres fazer tu essa gestão manual, eu diria que sim. Um PC bem protegido e conhecimentos de internet, são meio caminho andado para um bom OpSec.Usar redes públicas e talz. Ter cuidado com o software que se instala no PC, não usar esse PC onde fazes essa gestão para uso diário. E tantas outras coisas que podemos ter em conta para aumentarmos a nossa privacidade.Há VPNs, há redes públicas, há firewalls, etc. Muito por onde explorar!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "July 23, 2023, 09:29:06 PM",
      "body": "Quote from: tg88 on July 23, 2023, 12:12:47 PME eles não são como a Coinbase que inibem o cadastro de brasileiros? eu também não fazia ideia e nem cogitava negociar com ela pois achava que era altamente regulada, se depois puderem compartilhar a experiência. Recentemente vi como opção a exchange BingX que parece aceitar deposito ou saques via pix e ainda não exige KYC (ainda não testei), vejo criptomaniacos fazendo publicidade então quem sabe fica ai uma opção após o inicio das exigencias da Kucoin.Pois é, não sou só eu então que pensava que a Kraken não era aberta para brasileiros, e nem sei de onde eu achei isso, mas só sei que faz muito tempo que eu achava que era igual a Coinbase.Pode ser que é determinada época não aceitava ou eu vi alguém falando e desencaneiBom saber, vou criar um cadastro láQuote from: sabotag3x on July 23, 2023, 03:22:01 PMComo o @TryNinja falou, o grande problema da Coinbase e Kraken é que não possuem BRL.. você fica limitado a cripto.Entendi, se tem pelo menos USDT já dá pra utilizar em algumas situações",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RickDeckard",
      "created_time": "July 23, 2023, 10:23:59 PM",
      "body": "@joker_josue: Como complemento à minha resposta, e se estiveres interessado em seguir algumas recomendações, recomendo que faças uma leitura atenta neste tópico[1]. É uma conversa bastante interessante relativamente à privacidade do bitcoin - que creio ir de encontro à tua pergunta - e com excelentes intervenções (quer do OP - apogio, quer do o_e_e_l_o).[1]https://bitcointalk.org/index.php?topic=5459335",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 24, 2023, 06:46:40 AM",
      "body": "Como disse, eu não sou nenhum \"paranoico\" nessa questão.Mas, claro, a pessoa pensa no assuno e analisa vários cenários e dai tentar perceber que medidas vão sendo aplicadas.Alem disso, acho que tudo depende que nível de privacidade a pessoa colocou no inicio. A partir dai consegue-se ir mais a fundo ou não nessa questão.Porque se a pessoa coloca um baixo nível de privacidade no inicio, fica difícil ampliar esse nível mais tarde.Em relação ao node, é possível usar por exemplo o Electrum, com um node montado com o Bitcoin Core, certo?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "July 24, 2023, 03:50:58 PM",
      "body": "Quote from: joker_josue on July 24, 2023, 06:46:40 AMComo disse, eu não sou nenhum \"paranoico\" nessa questão.Mas, claro, a pessoa pensa no assuno e analisa vários cenários e dai tentar perceber que medidas vão sendo aplicadas.Alem disso, acho que tudo depende que nível de privacidade a pessoa colocou no inicio. A partir dai consegue-se ir mais a fundo ou não nessa questão.Porque se a pessoa coloca um baixo nível de privacidade no inicio, fica difícil ampliar esse nível mais tarde.Em relação ao node, é possível usar por exemplo o Electrum, com um node montado com o Bitcoin Core, certo?Sim, o nível de privacidade que escolhemos no início acho que vai influenciar o futuro para sempre. Eu falo relativamente ao que nós começámos a espalhar pela internet quando começámos a usar os Hi5 e outras redes sociais do género. Eu por exemplo, tenho usado diferentes nicks em diferentes \"zonas\" da internet. E mesmo assim, deve ser relativamente fácil, alguém chegar até mim, porque usei apenas um email durante muitos anos.Agora uso também vários, dependendo do que pretendo fazer com eles. Tenho um pessoal para cenas de família e assuntos mais sérios.Tenho pelo menos dois para o mundo do Bitcoin e tenho pelo menos mais um para toda a restante merda. Coisas que é na boa usar e deitar fora! Sites que um gajo usa uma vez na vida e assim.Mas isto é no campo da nossa informação que eventualmente andará pela net.Quanto ao nosso PC se manter minimament seguro e anónimo, acho que é mais a questão dos IPs, redes públicas que usamos e software que instalamos e usamos!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "July 24, 2023, 04:58:22 PM",
      "body": "Quote from: joker_josue on July 22, 2023, 04:11:37 PMO modelo seguia o seguinte:- Enviar BTC para um mix- O mix devolver o BTC para uma nova carteira- Na nova carteira fazer o pagamento desejado- Enviar o troco para o mix- O mix devolve o BTC para a nossa carteira principalAcho que este procedimento era viável, para reduzir  aumentar a nossa privacidade?Esse procedimento é meio caro e lento, então acho que devemos usar mixers quando precisamos de fato o anonimato.E lembrando que não adianta nada usar mixers se voce misturar inputs indevidamente antes. Quando voce saca de uma corretora na qual voce fez KYC, e depois misturou esse input com outro que voce utilizou em outro lugar (como no forum) na hora de enviar para o mixer, você está potencialmente vazando sua identidade. Ficar atento aos inputs é essencial para cuidar da sua privacidadeQuote from: sabotag3x on July 23, 2023, 01:44:16 AMQuote from: joker_josue on July 22, 2023, 04:11:37 PMNesse sentido, estava a pensar como se poderia fazer um pagamento de forma a ter a maior privacidade possivel.Envia para uma corretora e pede o saque para outra(s) carteira(s).. Kraken tem limite de US$ 5.000 por dia sem KYC, taxa de 0,0002 BTC/saque.. pela LN é de graça, espero que a adoção aumente.Acho que isso pode ser ruim pois as corretoras hoje em dia exigem KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RickDeckard",
      "created_time": "July 24, 2023, 06:01:22 PM",
      "body": "Quote from: bitmover on July 24, 2023, 04:58:22 PME lembrando que não adianta nada usar mixers se voce misturar inputs indevidamente antes. Quando voce saca de uma corretora na qual voce fez KYC, e depois misturou esse input com outro que voce utilizou em outro lugar (como no forum) na hora de enviar para o mixer, você está potencialmente vazando sua identidade. Ficar atento aos inputs é essencial para cuidar da sua privacidadeCorrecto, faltou ainda falar sobre todo esse espectro de privacidade no que diz respeito a boas práticas de manuseamento dos nossos fundos. Diria que seria um tema bastante complexo e que mereceria uma thread só sua porque existem sempre prós e contras com cada metodologia. Tendecialmente o quão mais anónimo/privado for a metodologia, mais custos irão estar associados...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "July 24, 2023, 06:06:51 PM",
      "body": "Quote from: RickDeckard on July 24, 2023, 06:01:22 PMQuote from: bitmover on July 24, 2023, 04:58:22 PME lembrando que não adianta nada usar mixers se voce misturar inputs indevidamente antes. Quando voce saca de uma corretora na qual voce fez KYC, e depois misturou esse input com outro que voce utilizou em outro lugar (como no forum) na hora de enviar para o mixer, você está potencialmente vazando sua identidade. Ficar atento aos inputs é essencial para cuidar da sua privacidadeCorrecto, faltou ainda falar sobre todo esse espectro de privacidade no que diz respeito a boas práticas de manuseamento dos nossos fundos. Diria que seria um tema bastante complexo e que mereceria uma thread só sua porque existem sempre prós e contras com cada metodologia. Tendecialmente o quão mais anónimo/privado for a metodologia, mais custos irão estar associados...É muito importante estar atento aos inputs e realmente, vale uma thread só pra isso.Mas os custos não aumentam ao voce ficar atento a eles (talvez uma transação adicional, mas nada demais, aumenta centavos de dólar).Dá é um trabalho adicional.Uma dica boa para quem não quer pensar muito, é ter uma carteira para cada identidade. Por exemplo, tenha uma carteira para usar as coisas do bitcointalk, outra pra usar as da binance, outra carteira para o dia a dia.. etc Assim voce nunca corre o risco de misturar inputs na mesma transação.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 24, 2023, 06:37:03 PM",
      "body": "Quote from: bitmover on July 24, 2023, 06:06:51 PMUma dica boa para quem não quer pensar muito, é ter uma carteira para cada identidade. Por exemplo, tenha uma carteira para usar as coisas do bitcointalk, outra pra usar as da binance, outra carteira para o dia a dia.. etc Assim voce nunca corre o risco de misturar inputs na mesma transação.Esse ponto é interessante, porque se realmente se souber a origem do input e para quem é, será mais fácil seguir o caminho do mesmo.A ideia de varias carteiras, para varias atividades é interessante, e até pode ser útil para gerir melhor os gastos.Mas, pegando do seu exemplo (carteira A para Bitcointalk; carteira B para o dia a dia). Você recebe o dinheiro das campanhas, numa carteira, como leva o dinheiro da carteira A para a carteira B, sem se saber que a B também é sua?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "July 24, 2023, 07:05:00 PM",
      "body": "Quote from: joker_josue on July 24, 2023, 06:37:03 PMMas, pegando do seu exemplo (carteira A para Bitcointalk; carteira B para o dia a dia). Você recebe o dinheiro das campanhas, numa carteira, como leva o dinheiro da carteira A para a carteira B, sem se saber que a B também é sua?Aí vc usa um mixer. Em vez de usar pra cada transação...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 24, 2023, 07:47:54 PM",
      "body": "Quote from: bitmover on July 24, 2023, 07:05:00 PMAí vc usa um mixer. Em vez de usar pra cada transação...E dividias o valor por vários endereços, dentro da mesma carteira, ou movias tudo para o mesmo endereço?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}