{
  "id": "topic_5469940",
  "title": "tetaeridanus",
  "author": "tetaeridanus",
  "created_time": "October 10, 2023, 11:18:30 PM",
  "content": "Selamlar dostlar ve arkadalar;Benim bu foruma ilk kat覺ld覺覺mdaki postlar覺m覺 g繹renler olmutur.Bu yaz覺 belki foruma g繹z gezdiren birisine veya aran覺zdaki trader dostlar覺m覺za bir ders olur diye payla覺yorum.ncelikle haz覺ms覺z ve ya kumarbaz iseniz kald覺ra癟tan kesinlikle ve kesinlikle uzak durun. Beni belki nick'imden stake.com'da hat覺rlayanlar olur 100$ g羹nde 5 kere rain atard覺m. Konumay覺 癟ok severdim chatte ve high rollerd覺m. Finansal durumum Allah'a 羹k羹r bi yere kadar kompanse ediyordu y羹ksek oynad覺覺m rakamlar覺. Spor bahis癟isiydim ve stake.com'a 繹nceki 3 hesapta toplamda 60.000$ BTC b覺rakm覺覺md覺r. 4. hesab覺mda yani bu nicke sahip olan bi o kadar daha batt覺m ve sonunda bir kazanma streak'ine ulat覺m. 繹yle diyeyim 繹nceki kaybettiklerimin 1.5x ini kazand覺m. 6 haneli dolar BUSD'm vard覺. O zamanlar arweave ile ilgileniyordum bilen bilir filecoin t羹revi bir coin ve kald覺ra癟 durumuna bakt覺m. 5x e 250.000 lik ilem a癟覺yordu. 5 dolardan Arweave Long Position a癟t覺m ve arweave bu s羹rede 2x oldu, hatta 14 dolar覺 g繹rd羹. Bi bakt覺m c羹zdan覺mda 20 BTC var o zaman覺n paras覺yla. Hayal ettiim arabay覺 hatta hayal ettiim 癟ou eyi alabiliyordum; bu kadar b羹y羹k bir nakite hi癟 sahip olmam覺t覺m.襤lemi kapad覺m ve bi s羹re paray覺 beklettim dolar art覺yordu, ve sonra ETH/BTC yar覺 yar覺ya ilem a癟t覺m 癟羹nk羹 neden? Bende bilmiyorum haz覺ms覺zl覺k ite, kendini hereyi biliyor g繹rmek, tepede g繹rmek; hemde 29000 civarlar覺. Ne oldu tabi ki? D羹t羹 ve stoplar覺m patlad覺. Noldu? Tekrar ilem a癟t覺m bu sefer daha da b羹y羹k; 癟羹nk羹 bir g羹nde 200.000$ zarar etmitim, geri kurtarmam laz覺md覺; 癟羹nk羹 kumarbazd覺m. Ne oldu sonunda? C羹zdan覺m s覺f覺r, cebimden 350.000$ zarar; ve pimanl覺klar dolu bir yaam. Bu arada dedemi kaybettim; ve bu h覺rs覺n ve hayallerin ne kadar bo olduunu 繹rendim.Bu camiada ne varsa h覺rs覺m y羹z羹nden kaybettim yoksa en az 4-5M$ k璽r覺m olurdu BNB hakk覺nda bir yaz覺 yazm覺t覺m okuyabilirsiniz; 癟ok y羹kl羹 bnbm vard覺 gittim kumar oynad覺m, 癟ok y羹kl羹 chainlinkim vard覺 gittim kumar oynad覺m. Neden, 癟羹nk羹 hemen kazanma ihtiyac覺m vard覺, hemen istiyordum; vaktim yoktu adeta. imdi ge癟mie bak覺yorum, kendime k覺z覺yorum ancak d羹zeltemeyeceimide biliyorum, bor癟lar覺 繹dedim bitirmek 羹zereyim d羹zl羹e 癟覺kaca覺m ancak d羹zl羹k ne onu bile bilmiyorum art覺k. Bu yolun sonu pimanl覺k, sak覺n ama sak覺n kald覺ra癟 hele ki 2x-3x dahil diyorum, eer iyi bilmiyorsan覺z yapmay覺n. ansa b羹y羹k bir kazan癟 hayat覺n覺z覺n en b羹y羹k hatas覺 olur. Ben yaad覺m 72 saat uyumad覺m, d羹nyadan soyutland覺m; ancak bir ekilde geri kalkt覺m ve yoluma devam ediyorum Allah'覺ma bin 羹k羹r. Herkes bu kadar ansl覺 olmayabilir, bilin ki bu kumar h覺rs覺n覺n, h覺zl覺 para kazanma h覺rs覺n覺n sonu bu. Evinizden araban覺zdan gen癟liinizden olursunuz ama ve ama en 繹nemlisi mutluluunuzdan olursunuz.Ne derler;Haramda Huzur arayana Huzur Haram olur.Umar覺m Kriptoya yeni girenler denk gelir ve okur.Teekk羹rler.Sayg覺yla;Tetaeridanus.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469940",
  "comments": [
    {
      "author": "wolwoo",
      "created_time": "October 11, 2023, 12:52:36 AM",
      "body": "iyi para kaybetmisin hocam ama kazanabilirdin de d羹羹nsene kazanm覺覺z 1k BTC eziyoruz paray覺 羹z羹lme ben de kaybettim baya hala da bor癟 繹d羹yorum birg羹n kazanaca覺z ya da fakir halde 繹l羹p gideceztek hayalim var iki cihanda sultan olmak yani sultan derken y繹netici anlam覺nda deil para babas覺 kodaman 繹zg羹r h羹r elini 覺klat覺p istedii hayat覺 yaamak...not: \"hakk覺nda hay覺rl覺s覺\" z覺rvalar覺yla yorum yapmay覺n please  o ya覺 癟oktaaaaan ge癟tim",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tetaeridanus",
      "created_time": "October 11, 2023, 01:02:23 AM",
      "body": "Quote from: wolwoo on October 11, 2023, 12:52:36 AMiyi para kaybetmisin hocam ama kazanabilirdin de d羹羹nsene kazanm覺覺z 1k BTC eziyoruz paray覺 羹z羹lme ben de kaybettim baya hala da bor癟 繹d羹yorum birg羹n kazanaca覺z ya da fakir halde 繹l羹p gideceztek hayalim var iki cihanda sultan olmak yani sultan derken y繹netici anlam覺nda deil para babas覺 kodaman 繹zg羹r h羹r elini 覺klat覺p istedii hayat覺 yaamak...not: \"hakk覺nda hay覺rl覺s覺\" z覺rvalar覺yla yorum yapmay覺n please  o ya覺 癟oktaaaaan ge癟timHakl覺s覺n hocam  sizede ge癟mi olsun, ziyaret癟i dostlara iin k繹t羹 taraflar覺n覺 g繹stermek istedim.Finansal geri d繹n羹 plan覺n覺z nedir? Kriptoda takip ettiiniz projeler varm覺?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wolwoo",
      "created_time": "October 11, 2023, 01:06:56 AM",
      "body": "Quote from: tetaeridanus on October 11, 2023, 01:02:23 AMQuote from: wolwoo on October 11, 2023, 12:52:36 AMiyi para kaybetmisin hocam ama kazanabilirdin de d羹羹nsene kazanm覺覺z 1k BTC eziyoruz paray覺 羹z羹lme ben de kaybettim baya hala da bor癟 繹d羹yorum birg羹n kazanaca覺z ya da fakir halde 繹l羹p gideceztek hayalim var iki cihanda sultan olmak yani sultan derken y繹netici anlam覺nda deil para babas覺 kodaman 繹zg羹r h羹r elini 覺klat覺p istedii hayat覺 yaamak...not: \"hakk覺nda hay覺rl覺s覺\" z覺rvalar覺yla yorum yapmay覺n please  o ya覺 癟oktaaaaan ge癟timHakl覺s覺n hocam  sizede ge癟mi olsun, ziyaret癟i dostlara iin k繹t羹 taraflar覺n覺 g繹stermek istedim.Finansal geri d繹n羹 plan覺n覺z nedir? Kriptoda takip ettiiniz projeler varm覺?hocam maalesef beyin 繹l羹m羹 ger癟ekleti  u an survivor pozisyonunda g覺m覺ldamadan duruyorum plan falan yok BAM BAM BAM bakal覺m HAKKIMIZDA HAYIRLISI   btc cake chz al覺rd覺m y羹kl羹 param olsa...ytd",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "October 11, 2023, 11:09:57 AM",
      "body": "@Tetaeridanus yaad覺覺n覺z eyler kald覺ra癟l覺 ilem yapmakta 覺srar eden herkesin yaad覺覺 eyler. Ne kadar iyi olursan覺z olun duygular覺n覺z olduu s羹rece kald覺ra癟l覺 ilemlerde kazanma ihtimaliniz yok. Bir s羹reliine kazanm覺 g繹r羹nseniz dahi kolay para kazanmaya al覺m覺 b羹nye tekrar dener ve eninde sonunda patlar. Forumda s羹rekli olarak kald覺ra癟l覺 ilemlerin asl覺nda kriptolarla ilgisinin olmad覺覺n覺 dorudan bir kumar 癟eidi olduunu yazd覺m. Her yaz覺覺mda beni kendim kazanamad覺覺m i癟in k繹t羹lemekle su癟layanlar v.b. oldu. Bug羹n acemilerin bulunduu twitter yada trade gruplar覺na girin ayn覺 eyi yaz覺n ayn覺 sonucu yine al覺rs覺n覺z.Kald覺ra癟l覺 ilem yapanlar yazd覺klar覺m覺 umursamayacak olsa dahi iki 繹rnek olay da ben vereyim. Forumda 癟ou kii projelere erken yat覺r覺m yapan bir gruba dahil olduumu biliyor uzun s羹redir. Hayat覺m覺z覺 deitirebilecek 癟ok iyi paralar kazand覺k. 襤lki dorudan kendi i yapt覺覺m arkadalar覺mdan birisinin ba覺na geldi. Kald覺ra癟l覺 ilemlerden ge癟tiimiz boa d繹neminde 癟ok iyi para kazanm覺t覺. Bir ka癟 bin dolar zararda olan bir ilemi kurtarmak i癟in g繹m羹ld羹k癟e g繹m羹ld羹 ve 900k $ civar覺nda para kaybetti. Y覺llarca 癟al覺arak elde ettii parayd覺. Neyseki 癟eitli 羹lkelerden evler, arabalar v.b. fiziki al覺mlar ger癟ekletirmi olduu i癟in onlar覺 da ilemlerine dahil edemedi ve g羹n羹n sonunda hala tutunacak dal覺 olduu i癟in kald覺ra癟l覺 ilemleri tamamen b覺rakt覺. Ki emin olabilirsiniz bu arkada kald覺ra癟l覺 ilem yapan yada trade eden 癟ou kiiden 癟ok daha geni bilgi a覺na ve tecr羹beye sahip olmas覺na ramen bunu yaad覺. Sadece bir anl覺k duygusal boluk belki de hereyini kaybetmesine yol a癟acakt覺. B覺rakmak tabi ki 癟ok kolay olmuyor. Bu s羹re癟te bir ka癟 kere bizden bor癟 istedi ve bor癟 gibi bir kavram覺n bizim aram覺zda laf覺 olmamas覺na ramen durumundan dolay覺 vermediimizde ilk 繹nce bize k覺zd覺. Daha sonra olaydan uzakla覺p doru yakla覺m a癟覺s覺yla olaylara yeniden bakabildiinde o g羹n o borcu ona vermediimiz i癟in bize teekk羹r etti. Dier olay ise 癟ok daha k繹t羹. ok k羹癟羹k b羹t癟e ile balay覺p kald覺ra癟l覺 ilemlerle milyon dolara ulaan bir hikaye. Yine boa etkisiyle a癟t覺覺 癟ou ilem y羹ksek kar b覺rakan bir arkada kazand覺覺 paran覺n bir k覺sm覺n覺 realize ederek kendisine ev, annesine araba v.b. al覺yor. Muhtemelen ge癟en boan覺n en ansl覺 isimlerinden birisiydi. Sonras覺nda ise yine k羹癟羹k bir ilemi kurtarmak i癟in peine d羹羹yor. nce borsalardaki t羹m varl覺覺n覺 kaybediyor. Ald覺klar覺n覺 sat覺yor, kaybediyor ve sonras覺 bor癟 bata覺. Benzeri mutlaka 癟evrenizden birilerinin ba覺na gelmitir.Yapt覺m tekrar yapar覺m hissiyat覺, kaybetmeyi kabullenmeme v.b. v.b. bir 癟ok duygusal s羹re癟, beynin kendi i癟erisindeki 癟at覺malar覺 derken normal d羹羹nme yetisi kaybediliyor. En iyisi bu d繹ng羹ye hi癟 dahil olmamak.Ge癟en boada SOL dola覺m miktar覺n覺n bir saniyede 10 kat覺na 癟覺kaca覺 vesting biti g羹n羹nde Sam'in binlerce insan覺 yok ettiine eminim. Hi癟 kimsenin girmeyecei bir bahis oluturdu ve o bahse kazand覺rd覺. Sonu癟ta herkesi sildi 3$ fiyattan 200'lere g繹t羹rd羹 繹yle bir ortamda. Kim bilebilir yada d覺ar覺dan bak覺nca 癟ok kolay bir bahis deil mi ?Bunlar d覺覺nda da ge癟mite bu forumdan 癟eitli shit projelerde, kald覺ra癟l覺 ilemlerde y羹zlerce BTC kaybetmi insanlar tan覺yorum. Velhas覺l belirli bir stratejiniz yada i plan覺n覺z yok ise bu piyasada para kazanmak d覺ar覺dan g繹r羹nd羹羹 kadar kolay deil. En kolay覺, en az risklisi HODL.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "October 11, 2023, 12:27:24 PM",
      "body": "2.000 Dolar civar覺覺ndaki bir parayla kriptoda kald覺rac覺 繹rendim, 繹reneceim derken hi癟 ettim. Kazansan覺zda k覺sa d繹nemde kazanaca覺m h覺rs覺z y羹z羹nden ne var neyok kaybediyorsunuz. %50 kay覺pla paray覺 hi癟 etmitim. O para benim kald覺rac覺 yapamad覺覺m覺 g繹steren g羹zel bir 繹rnek oldu birka癟 arkada覺m ... coin 癟覺kabilir diyorlar a癟 kald覺rac覺 diyorlar a癟mam %100 癟覺kaca覺n覺 bilsem a癟mam. Bazen inansanlar deneyimlemeli ama abartmamal覺. Twitter'da takip ettiim birka癟 eleman var bu elemanlardan biri hemen hemen her ilemde ciddi para kazand覺覺n覺 g繹steriyordu son bir projede ne kadar kaybettiini s繹yleyemedi san覺r覺m 20k usd ile 40k usd aras覺 bir paray覺 kald覺ra癟da yedi kripto dediin yerin tepesi ve dibi yok g羹n i癟erisinde basit birka癟 haber 羹r羹n羹n fiyat覺n覺 her y繹ne inan覺lmaz rakamlarda hareket ettirebilir.Kald覺ra癟 yerine @bthd'nin de yapt覺覺 gibi projelere yat覺r覺m yaparak kazan癟 elde etmek daha iyi. Ha ondada ka癟an g繹癟en oluyor yeri geliyor 2 y覺l bekliyorsun ama insan覺 ciddi anlamda zengin edebiliyor en az覺ndan kaybettiniz tutarlar s覺n覺rl覺 oluyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tetaeridanus",
      "created_time": "October 11, 2023, 12:42:15 PM",
      "body": "Quote from: Bthd on October 11, 2023, 11:09:57 AM@Tetaeridanus yaad覺覺n覺z eyler kald覺ra癟l覺 ilem yapmakta 覺srar eden herkesin yaad覺覺 eyler. Ne kadar iyi olursan覺z olun duygular覺n覺z olduu s羹rece kald覺ra癟l覺 ilemlerde kazanma ihtimaliniz yok. Bir s羹reliine kazanm覺 g繹r羹nseniz dahi kolay para kazanmaya al覺m覺 b羹nye tekrar dener ve eninde sonunda patlar. Forumda s羹rekli olarak kald覺ra癟l覺 ilemlerin asl覺nda kriptolarla ilgisinin olmad覺覺n覺 dorudan bir kumar 癟eidi olduunu yazd覺m. Her yaz覺覺mda beni kendim kazanamad覺覺m i癟in k繹t羹lemekle su癟layanlar v.b. oldu. Bug羹n acemilerin bulunduu twitter yada trade gruplar覺na girin ayn覺 eyi yaz覺n ayn覺 sonucu yine al覺rs覺n覺z.Kald覺ra癟l覺 ilem yapanlar yazd覺klar覺m覺 umursamayacak olsa dahi iki 繹rnek olay da ben vereyim. Forumda 癟ou kii projelere erken yat覺r覺m yapan bir gruba dahil olduumu biliyor uzun s羹redir. Hayat覺m覺z覺 deitirebilecek 癟ok iyi paralar kazand覺k. 襤lki dorudan kendi i yapt覺覺m arkadalar覺mdan birisinin ba覺na geldi. Kald覺ra癟l覺 ilemlerden ge癟tiimiz boa d繹neminde 癟ok iyi para kazanm覺t覺. Bir ka癟 bin dolar zararda olan bir ilemi kurtarmak i癟in g繹m羹ld羹k癟e g繹m羹ld羹 ve 900k $ civar覺nda para kaybetti. Y覺llarca 癟al覺arak elde ettii parayd覺. Neyseki 癟eitli 羹lkelerden evler, arabalar v.b. fiziki al覺mlar ger癟ekletirmi olduu i癟in onlar覺 da ilemlerine dahil edemedi ve g羹n羹n sonunda hala tutunacak dal覺 olduu i癟in kald覺ra癟l覺 ilemleri tamamen b覺rakt覺. Ki emin olabilirsiniz bu arkada kald覺ra癟l覺 ilem yapan yada trade eden 癟ou kiiden 癟ok daha geni bilgi a覺na ve tecr羹beye sahip olmas覺na ramen bunu yaad覺. Sadece bir anl覺k duygusal boluk belki de hereyini kaybetmesine yol a癟acakt覺. B覺rakmak tabi ki 癟ok kolay olmuyor. Bu s羹re癟te bir ka癟 kere bizden bor癟 istedi ve bor癟 gibi bir kavram覺n bizim aram覺zda laf覺 olmamas覺na ramen durumundan dolay覺 vermediimizde ilk 繹nce bize k覺zd覺. Daha sonra olaydan uzakla覺p doru yakla覺m a癟覺s覺yla olaylara yeniden bakabildiinde o g羹n o borcu ona vermediimiz i癟in bize teekk羹r etti. Dier olay ise 癟ok daha k繹t羹. ok k羹癟羹k b羹t癟e ile balay覺p kald覺ra癟l覺 ilemlerle milyon dolara ulaan bir hikaye. Yine boa etkisiyle a癟t覺覺 癟ou ilem y羹ksek kar b覺rakan bir arkada kazand覺覺 paran覺n bir k覺sm覺n覺 realize ederek kendisine ev, annesine araba v.b. al覺yor. Muhtemelen ge癟en boan覺n en ansl覺 isimlerinden birisiydi. Sonras覺nda ise yine k羹癟羹k bir ilemi kurtarmak i癟in peine d羹羹yor. nce borsalardaki t羹m varl覺覺n覺 kaybediyor. Ald覺klar覺n覺 sat覺yor, kaybediyor ve sonras覺 bor癟 bata覺. Benzeri mutlaka 癟evrenizden birilerinin ba覺na gelmitir.Yapt覺m tekrar yapar覺m hissiyat覺, kaybetmeyi kabullenmeme v.b. v.b. bir 癟ok duygusal s羹re癟, beynin kendi i癟erisindeki 癟at覺malar覺 derken normal d羹羹nme yetisi kaybediliyor. En iyisi bu d繹ng羹ye hi癟 dahil olmamak.Ge癟en boada SOL dola覺m miktar覺n覺n bir saniyede 10 kat覺na 癟覺kaca覺 vesting biti g羹n羹nde Sam'in binlerce insan覺 yok ettiine eminim. Hi癟 kimsenin girmeyecei bir bahis oluturdu ve o bahse kazand覺rd覺. Sonu癟ta herkesi sildi 3$ fiyattan 200'lere g繹t羹rd羹 繹yle bir ortamda. Kim bilebilir yada d覺ar覺dan bak覺nca 癟ok kolay bir bahis deil mi ?Bunlar d覺覺nda da ge癟mite bu forumdan 癟eitli shit projelerde, kald覺ra癟l覺 ilemlerde y羹zlerce BTC kaybetmi insanlar tan覺yorum. Velhas覺l belirli bir stratejiniz yada i plan覺n覺z yok ise bu piyasada para kazanmak d覺ar覺dan g繹r羹nd羹羹 kadar kolay deil. En kolay覺, en az risklisi HODL.Yazd覺klar覺n覺z i癟in teekk羹r ederim hocam; kald覺ra癟tan b羹y羹k paralar kazanmak bir insan覺n ba覺na gelebilicek en b羹y羹k belad覺r. 襤nsan覺 a癟 g繹zl羹 yapar; tekrar olucak dedirtir ve hereyi kaybetmesine yol a癟ar iin sonunda. Bende b羹y羹k bataa girdim Allah'a 羹k羹r kurtuluyorum. Tabii kide baz覺 insanlar okusa da yapmaya devam edicek ancak gezen insanlara yararl覺 bir i癟erik olsun diye yazmak istedim.Sayg覺lar覺mla",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "October 11, 2023, 03:43:07 PM",
      "body": "Quote from: mandown on October 11, 2023, 12:27:24 PM2.000 Dolar civar覺覺ndaki bir parayla kriptoda kald覺rac覺 繹rendim, 繹reneceim derken hi癟 ettim. Kazansan覺zda k覺sa d繹nemde kazanaca覺m h覺rs覺z y羹z羹nden ne var neyok kaybediyorsunuz. %50 kay覺pla paray覺 hi癟 etmitim. O para benim kald覺rac覺 yapamad覺覺m覺 g繹steren g羹zel bir 繹rnek oldu birka癟 arkada覺m ... coin 癟覺kabilir diyorlar a癟 kald覺rac覺 diyorlar a癟mam %100 癟覺kaca覺n覺 bilsem a癟mam. Bazen inansanlar deneyimlemeli ama abartmamal覺. Twitter'da takip ettiim birka癟 eleman var bu elemanlardan biri hemen hemen her ilemde ciddi para kazand覺覺n覺 g繹steriyordu son bir projede ne kadar kaybettiini s繹yleyemedi san覺r覺m 20k usd ile 40k usd aras覺 bir paray覺 kald覺ra癟da yedi kripto dediin yerin tepesi ve dibi yok g羹n i癟erisinde basit birka癟 haber 羹r羹n羹n fiyat覺n覺 her y繹ne inan覺lmaz rakamlarda hareket ettirebilir.Kald覺ra癟 yerine @bthd'nin de yapt覺覺 gibi projelere yat覺r覺m yaparak kazan癟 elde etmek daha iyi. Ha ondada ka癟an g繹癟en oluyor yeri geliyor 2 y覺l bekliyorsun ama insan覺 ciddi anlamda zengin edebiliyor en az覺ndan kaybettiniz tutarlar s覺n覺rl覺 oluyor. Borsalardaki bu t羹r ilevlerin benim i癟in maksimum yarad覺覺 i hedgeleyebilmek. rnein A borsas覺 X mal覺n覺n 繹n sat覺覺 i癟in A token tutmay覺 zorunlu tutuyorsa 1000 tane A al覺yorsam 1000 A deerinde de 1x short ilem a癟arak USD bazl覺 kendimi temize 癟ekmeye 癟al覺覺yorum. Tabi ki borsan覺n manip羹latif hareketleri yoksa ve pozisyon ta覺ma 羹creti 癟ok fazla deilse. Onun d覺覺nda x coin d羹ecek, y 癟覺kacak tarz覺 bir durumu %100 kestirmenin ve buna misli ile bahis yapman覺n mant覺覺 benim a癟覺mdan yok. Haber takip etme olay覺 da 1.01 orandan ma癟a bahis yapmak gibi oluyor. 99 kere baar覺p 100. denemede t羹m paray覺 kaybediyorsunuz. Arada hi癟 bir fark yok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tetaeridanus",
      "created_time": "October 11, 2023, 08:20:48 PM",
      "body": "Quote from: mandown on October 11, 2023, 12:27:24 PM2.000 Dolar civar覺覺ndaki bir parayla kriptoda kald覺rac覺 繹rendim, 繹reneceim derken hi癟 ettim. Kazansan覺zda k覺sa d繹nemde kazanaca覺m h覺rs覺z y羹z羹nden ne var neyok kaybediyorsunuz. %50 kay覺pla paray覺 hi癟 etmitim. O para benim kald覺rac覺 yapamad覺覺m覺 g繹steren g羹zel bir 繹rnek oldu birka癟 arkada覺m ... coin 癟覺kabilir diyorlar a癟 kald覺rac覺 diyorlar a癟mam %100 癟覺kaca覺n覺 bilsem a癟mam. Bazen inansanlar deneyimlemeli ama abartmamal覺. Twitter'da takip ettiim birka癟 eleman var bu elemanlardan biri hemen hemen her ilemde ciddi para kazand覺覺n覺 g繹steriyordu son bir projede ne kadar kaybettiini s繹yleyemedi san覺r覺m 20k usd ile 40k usd aras覺 bir paray覺 kald覺ra癟da yedi kripto dediin yerin tepesi ve dibi yok g羹n i癟erisinde basit birka癟 haber 羹r羹n羹n fiyat覺n覺 her y繹ne inan覺lmaz rakamlarda hareket ettirebilir.Kald覺ra癟 yerine @bthd'nin de yapt覺覺 gibi projelere yat覺r覺m yaparak kazan癟 elde etmek daha iyi. Ha ondada ka癟an g繹癟en oluyor yeri geliyor 2 y覺l bekliyorsun ama insan覺 ciddi anlamda zengin edebiliyor en az覺ndan kaybettiniz tutarlar s覺n覺rl覺 oluyor. Hocam selamlar,Ayn覺 ekilde ayn覺s覺n覺 d羹羹n羹yorum para kazan覺ca覺m覺 biliyim 2x mi 3x mi 1000x mi kald覺ra癟a elimi s羹rmem bidaha hayat覺m boyunca, zaten dediklerimizi g羹lenler er yada ge癟 ak覺llan覺caklar, 繹yle kazan覺lan para ile alt覺na araba ev al覺rs覺n bi ters ilemde hepsini tekrar borsaya yat覺r覺p hereyini kaybedersin.Been there, done that.襤nallah yazd覺klar覺m覺zdan birileri ak覺llan覺r ders olur diye yazd覺m.Sayg覺lar覺mla.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "October 12, 2023, 11:06:01 AM",
      "body": "Hocam 癟ok g羹zel bal覺k a癟m覺s覺n ellerine sal覺k. ncelikle ben kesinlikle u d羹羹nceye kat覺l覺yorum: Eer elinize 癟al覺arak elde edemeyeceini d羹羹nd羹羹n羹z kadar nakit ak覺覺 olduysa bir k覺sm覺n覺 piyasadan 癟ekip reele 癟evirmek laz覺m. Bu ev olur b羹y羹k 繹l癟羹de. 1 milyon dolar覺 10 milyon dolar yapmaya 癟al覺mak yerine 500 bin dolar覺 ev araba vs 癟evirerek geri kalan 500 bin dolar覺 belki 癟ok para kazanmak ad覺na kullanabilirsiniz 繹rnein. Ben bu mant覺kla bor癟 har癟 olmadan iyi bir trader olup rahat yaan覺l覺r d羹羹ncesi ta覺yorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vispilio",
      "created_time": "October 16, 2023, 01:15:04 AMLast edit: October 16, 2023, 03:02:22 PM by Vispilio",
      "body": "ok enteresan an覺lar dinliyoruz, @tetaeridanus farkl覺 bir renk getirdi foruma samimiyeti ve damardan hikayelerle, ge癟mi olsun ve teekk羹rler payla覺mlar i癟in. Para konular覺na belki de T羹rkiye gibi ekonomik iflastan ge癟en 羹lkenin 癟ok ihtiyac覺 olan felsefi bir bak覺 atabiliriz, \"generational wealth\" yani kuaktan kuaa ge癟en servetle ilgili bat覺da ayr覺nt覺l覺 癟al覺malar yap覺l覺yor ve g繹r羹l羹yor ki zengin ailelerin 70%'i iki kuakta 90%'覺ndan fazlas覺ysa maksimum 3 kuakta aile servetini s覺f覺rl覺yorlar... https://www.nasdaq.com/articles/generational-wealth%3A-why-do-70-of-families-lose-their-wealth-in-the-2nd-generation-2018-10#:~:text=It%20is%20estimated%20that%2070,not%20to%20talk%20about%20moneyD羹nyadaki ekonomik aktivitenin ve paran覺n doas覺 bu, g繹receli olmak ve 癟ok 癟abuk el deitirmek 羹zerine tasarlanm覺 bir finansal sistem var, tarih boyunca b繹yle oldu, kimisi \"uzayl覺lar b繹yle istedi\" bile diyor, ger癟ekten  ...Demek ki hedef koyarken para ve servetin 繹tesine ge癟mek daha g羹zel olabilir, bir arkeolog vard覺 program覺 bulabilirsem eklerim, \"ne sultanlar krallar geldi ge癟ti ama bu topraklarda 30,000 sene 繹nce bu seramii yapan k繹yl羹 hepsinden daha b羹y羹k iz b覺rakt覺\" diyordu 癟ok antik d繹nemden bulunmu bir tarihi eserin g羹zelliinden bahsederken... Bu yorum beni baya etkilemiti...Sabaha kar覺 felsefi mesajlar覺 癟ok uzatmamaya 癟al覺覺yorum, devam ederiz ",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tetaeridanus",
      "created_time": "October 16, 2023, 01:48:01 PM",
      "body": "Quote from: Vispilio on October 16, 2023, 01:15:04 AMok enteresan an覺lar dinliyoruz, @tetaeridanus farkl覺 bir renk getirdi foruma samimiyeti ve damardan hikayelerle, ge癟mi olsun ve teekk羹rler payla覺mlar i癟in. Para konular覺na belki de T羹rkiye gibi ekonomik iflastan ge癟en 羹lkenin 癟ok ihtiyac覺 olan felsefi bir bak覺 atabiliriz, \"generational wealth\" yani kuaktan kuaa ge癟en servetle ilgili bat覺da ayr覺nt覺l覺 癟al覺malar yap覺l覺yor ve g繹r羹l羹yor ki zengin ailelerin 70%'i iki kuakta 90%'覺ndan fazlas覺yla maksimum 3 kuakta aile servetini s覺f覺rl覺yorlar... https://www.nasdaq.com/articles/generational-wealth%3A-why-do-70-of-families-lose-their-wealth-in-the-2nd-generation-2018-10#:~:text=It%20is%20estimated%20that%2070,not%20to%20talk%20about%20moneyD羹nyadaki ekonomik aktivitenin ve paran覺n doas覺 bu, g繹receli olmak ve 癟ok 癟abuk el deitirmek 羹zerine tasarlanm覺 bir finansal sistem var, tarih boyunca b繹yle oldu, kimisi \"uzayl覺lar b繹yle istedi\" bile diyor, ger癟ekten  ...Demek ki hedef koyarken para ve servetin 繹tesine ge癟mek daha g羹zel olabilir, bir arkeolog vard覺 program覺 bulabilirsem eklerim, \"ne sultanlar krallar geldi ge癟ti ama bu topraklarda 30,000 sene 繹nce bu seramii yapan k繹yl羹 hepsinden daha b羹y羹k iz b覺rakt覺\" diyordu 癟ok antik d繹nemden bulunmu bir tarihi eserin g羹zelliinden bahsederken... Bu yorum beni baya etkilemiti...Sabaha kar覺 felsefi mesajlar覺 癟ok uzatmamaya 癟al覺覺yorum, devam ederiz Hocam selamlar,ncelikle g羹zel s繹zleriniz i癟in 癟ok teekk羹r ederim, sizden ve forumdan b繹yle g羹zel yorumlar g繹rmek iyi ki y覺llar sonra buraya kay覺t olup bu toplulua ait oldum dedirtiyor bana. Bir 癟ok an覺m var ve elimden geldiince size aktarmaya 癟al覺覺yorum. Rank'ime bakmay覺n uzun y覺llard覺r ayn覺 yolun yolcusuyuz, 2016 senesi zamanlar覺 gen癟liimden ve trading bilmemem dolay覺s覺yla bir 癟ok hata yapt覺m ilerisinde de pimanl覺k kumara y繹nlendirdi; yabanc覺 forumlarda ald覺覺m yorumlar覺 g繹r羹yorsunuz. Flag a癟t覺m hatta Stake.com'un kapal覺 olmas覺 gereken hesab覺m覺 a癟覺p oyun oynamama dolayl覺 yoldan neden olmas覺 dolay覺s覺yla; forumda bir 癟ok kendini bilmez insanda dolu ancak bu ondan fazla da 癟ok iyi insanlar var sizin ve 繹zellikle TR forumundakiler gibi. Ben elimden geldiince yazmaya ve contribute etmeye devam edeceim.Dediiniz eye gelirsek de hocam, sonuna kadar kat覺l覺yorum; para sistemi 癟ok 癟abuk el deitirilebilicek bir sistem birisi fakir olurken bakas覺 zengin oluyor, hedef hi癟 bir zaman tamamen para olmamal覺; 繹zellikle ben yaz覺lar覺mdan okuduysan覺z Satoshi'nin vizyonuna hayran birisiyim ve cidden bu sekt繹rde bir eye 繹nc羹l羹k etmek 癟ok isterim, eminim burda 癟ok insan vard覺r b繹yle. Ama癟 繹nc羹l羹k ve vizyon, para olmamal覺. Belki de dier threadde sorduum gibi 'Neden T羹rkiye'den Hi癟 Crypto Projesi 覺kmad覺?' sorusunun cevab覺 bu dediklerimizde yatmaktad覺r. Bu 羹lkede bir 癟ok insan覺n amac覺 aynen de bu, h覺zl覺 para kazanmak; bu y羹zden bir 癟ok doland覺r覺c覺 ve piramit proje 癟覺kt覺 bu 羹lkeden daha da fazlas覺 癟覺kmad覺;100-200 hatta 1 milyon dolar likiditeyi buldu vakumlad覺 ve ka癟t覺. 襤te tamda sorun bu belkide aralar覺nda g羹zel projelerde vard覺r ancak para, paraya doymam覺 insan覺 癟ok kolay deitirir ne yaz覺k ki. Ben hatalar覺ma gen癟lik dedim ; hata dedim ve bu psikolojik olarak cehennem bir d繹nemi atlatt覺m ve her zamankinden daha g羹癟l羹 olduuma inan覺yorum. Bazen hayatta k繹t羹 eyler yaamadan iyi eyler baaram覺yor insan ,cidden 繹yle. ou irkette art覺k 'Fuck up' sempozyumlar覺 oluyor, baar覺l覺 insanlar batma an覺lar覺n覺 anlat覺yorlar. Baarmak 癟羹nk羹 cidden kolay bir ey deil. Ancak kolay olmad覺覺 i癟in denememek de yanl覺. Bu forumdan bir topluluk olur, biz oluruz, bakalar覺 olur; ancak bir g羹n bu 羹lkeden bir ey 癟覺kaca覺na 癟ok eminim; 繹nc羹lerinden biri olmak da beni 癟ok mutlu eder.uanl覺k bu kadar yazabildim.Sayg覺lar覺mla;Tetaeridanus.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logileno",
      "created_time": "October 18, 2023, 01:36:49 PM",
      "body": "Quote from: Pierre 2 on October 12, 2023, 11:06:01 AMHocam 癟ok g羹zel bal覺k a癟m覺s覺n ellerine sal覺k. ncelikle ben kesinlikle u d羹羹nceye kat覺l覺yorum: Eer elinize 癟al覺arak elde edemeyeceini d羹羹nd羹羹n羹z kadar nakit ak覺覺 olduysa bir k覺sm覺n覺 piyasadan 癟ekip reele 癟evirmek laz覺m. Bu ev olur b羹y羹k 繹l癟羹de. 1 milyon dolar覺 10 milyon dolar yapmaya 癟al覺mak yerine 500 bin dolar覺 ev araba vs 癟evirerek geri kalan 500 bin dolar覺 belki 癟ok para kazanmak ad覺na kullanabilirsiniz 繹rnein. Ben bu mant覺kla bor癟 har癟 olmadan iyi bir trader olup rahat yaan覺l覺r d羹羹ncesi ta覺yorum.Kriptoda duran varl覺覺n覺z覺n sizi zenginletirebilmesinin tek 1 yolu var o da elde edilen paray覺 realize etmektir.T羹m finansal kazan癟lar i癟in bile ge癟erli olabilir.2021 boas覺nda elde edilen kar yeterli gelmedii i癟in 750 bin $'覺 hi癟 etmitim. Bazen daha da y羹ksekten satma h覺rs覺n覺n da 繹n羹ne ge癟ip kazanma itah覺na dur demek laz覺m. Doam覺z gerei d羹rt羹lerimize yenik d羹meye yatk覺n canl覺lar覺z.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinTurk",
      "created_time": "October 18, 2023, 06:00:53 PM",
      "body": "Daha 繹nce hem kumarda hem de y羹ksek kald覺ra癟 kullanarak ciddi miktarda zarar etmi birisi olarak ben de yorum yapmak istiyorum. ncelikle, benim kaybettiim tutar konu sahibi arkada覺n kaybettii tutar覺n yan覺nda pek y羹ksek bir ey deil fakat bahsettiim bu durumu 18-20 ya aral覺覺nda yaad覺覺m覺 hesaba katmak gerekirse benim i癟in olduk癟a iyi ve kaybetmemem durumunda 癟ok daha iyi bir gen癟lie sahip olabileceim kadard覺. Kumar, zaten bal覺 ba覺na para kaybetmemiz i癟in kurulmu bir 癟eit pahal覺 hobi ve tuzakt覺r. Bu sebeple, kumar i癟in herhangi bir inanca sahip olmayan birisinin bile kumara uzak durulmas覺 gereken bir ey olarak bakmas覺 gerektiini d羹羹n羹yorum. Kald覺ra癟 ise, daha 繹nce hi癟 deneyimlememi veya 癟ok az deneyimi bulunan kiiler taraf覺ndan maksimum 2x belki 3x olacak ekilde kullan覺lmas覺 gereken ve kesinlikle oran覺n artt覺r覺lmamas覺 gereken bir eydir. Kald覺ra癟, asl覺nda kumar olmad覺覺n覺 ve tecr羹be ile para kazanman覺n m羹mk羹n olduunu belirttiimiz finansal piyasalar覺 da bir 癟eit kumara 癟evirmektedir. stelik, kald覺ra癟 ile para kazan覺lmas覺 durumunda kii anlams覺z bir duygu ile neden daha fazlas覺n覺 kazanmayay覺m psikolojisine kap覺lmaktad覺r. Madalyonun dier y羹z羹 olan kay覺p durumunda ise t覺pk覺 konu sahibi arkada覺n da belirttii gibi mevcut zarar覺n kolayca yeniden kazan覺laca覺 ihtimaline de kap覺lmaya sebep olmaktad覺r.Bu sebeple, siz siz olun hi癟bir zaman a癟g繹zl羹l羹k ile ne y羹ksek kald覺ra癟 kullanarak finansal piyasalarda ilemler yap覺n ne de kumarda daha fazla kazanmak i癟in bahis tutar覺n覺z覺 art覺rmay覺n. A癟g繹zl羹l羹k ve para kazanma h覺rs覺n覺n devam etmesi durumunda bir g羹n siz de kendinizi bu ekilde 繹yk羹n羹z羹 anlat覺rken veya benim yapt覺覺m gibi bir 繹yk羹n羹n alt覺na yaad覺覺n覺z ac覺 dolu tecr羹belerinizi m羹mk羹n olan en iyi ekilde ifade etmeye 癟al覺覺rken bulabilirsiniz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tetaeridanus",
      "created_time": "October 18, 2023, 06:27:35 PM",
      "body": "Quote from: BitcoinTurk on October 18, 2023, 06:00:53 PMDaha 繹nce hem kumarda hem de y羹ksek kald覺ra癟 kullanarak ciddi miktarda zarar etmi birisi olarak ben de yorum yapmak istiyorum. ncelikle, benim kaybettiim tutar konu sahibi arkada覺n kaybettii tutar覺n yan覺nda pek y羹ksek bir ey deil fakat bahsettiim bu durumu 18-20 ya aral覺覺nda yaad覺覺m覺 hesaba katmak gerekirse benim i癟in olduk癟a iyi ve kaybetmemem durumunda 癟ok daha iyi bir gen癟lie sahip olabileceim kadard覺. Kumar, zaten bal覺 ba覺na para kaybetmemiz i癟in kurulmu bir 癟eit pahal覺 hobi ve tuzakt覺r. Bu sebeple, kumar i癟in herhangi bir inanca sahip olmayan birisinin bile kumara uzak durulmas覺 gereken bir ey olarak bakmas覺 gerektiini d羹羹n羹yorum. Kald覺ra癟 ise, daha 繹nce hi癟 deneyimlememi veya 癟ok az deneyimi bulunan kiiler taraf覺ndan maksimum 2x belki 3x olacak ekilde kullan覺lmas覺 gereken ve kesinlikle oran覺n artt覺r覺lmamas覺 gereken bir eydir. Kald覺ra癟, asl覺nda kumar olmad覺覺n覺 ve tecr羹be ile para kazanman覺n m羹mk羹n olduunu belirttiimiz finansal piyasalar覺 da bir 癟eit kumara 癟evirmektedir. stelik, kald覺ra癟 ile para kazan覺lmas覺 durumunda kii anlams覺z bir duygu ile neden daha fazlas覺n覺 kazanmayay覺m psikolojisine kap覺lmaktad覺r. Madalyonun dier y羹z羹 olan kay覺p durumunda ise t覺pk覺 konu sahibi arkada覺n da belirttii gibi mevcut zarar覺n kolayca yeniden kazan覺laca覺 ihtimaline de kap覺lmaya sebep olmaktad覺r.Bu sebeple, siz siz olun hi癟bir zaman a癟g繹zl羹l羹k ile ne y羹ksek kald覺ra癟 kullanarak finansal piyasalarda ilemler yap覺n ne de kumarda daha fazla kazanmak i癟in bahis tutar覺n覺z覺 art覺rmay覺n. A癟g繹zl羹l羹k ve para kazanma h覺rs覺n覺n devam etmesi durumunda bir g羹n siz de kendinizi bu ekilde 繹yk羹n羹z羹 anlat覺rken veya benim yapt覺覺m gibi bir 繹yk羹n羹n alt覺na yaad覺覺n覺z ac覺 dolu tecr羹belerinizi m羹mk羹n olan en iyi ekilde ifade etmeye 癟al覺覺rken bulabilirsiniz.Yorumunuz i癟in 癟ok teekk羹r ederim, ancak bunu ayn覺 yoldan ge癟enler anlar; ben trade ve gen癟lik hatalar覺m olmasa 癟ok rahat 28 BTC'me hala sahip, hemde daha da fazlas覺n覺 sab覺r ile kazanm覺t覺m. Ne yaz覺k ki zor yoldan 繹rendik, bakalar覺 da 繹yle 繹renmesin belki bir yarar覺m覺z dokunur gezen ziyaret癟i ve ya bu ie yeni girenlere diye bu 繹yk羹y羹 paylamak istemitim. Bu iten kazananlar bu yaz覺ya g羹l羹yordur ancak g羹n gelir devran d繹ner bu s繹zlerin k覺ymetini anlarlar buna ne yaz覺k ki doa kanunlar覺 deniyor.Meritlicektim; ancak sMerit'im kalmad覺覺m i癟in Meritleyemedim; ac覺n覺z覺 bende payla覺yorum; hep ileri bakmak d覺覺nda baka bir 癟aremiz yok ne yaz覺k ki. Ge癟mii hat覺rlarsak o h覺rsa tekrar kap覺l覺r覺z ancak siz siz olun;K覺r覺k vazoyu birletirmeye 癟al覺覺rken baka vazolar k覺rmay覺n.Sal覺klar ve g羹zel geceler dilerim.Tetaeridanus.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinTurk",
      "created_time": "October 23, 2023, 08:50:44 AM",
      "body": "Quote from: tetaeridanus on October 18, 2023, 06:27:35 PMYorumunuz i癟in 癟ok teekk羹r ederim, ancak bunu ayn覺 yoldan ge癟enler anlar; ben trade ve gen癟lik hatalar覺m olmasa 癟ok rahat 28 BTC'me hala sahip, hemde daha da fazlas覺n覺 sab覺r ile kazanm覺t覺m. Ne yaz覺k ki zor yoldan 繹rendik, bakalar覺 da 繹yle 繹renmesin belki bir yarar覺m覺z dokunur gezen ziyaret癟i ve ya bu ie yeni girenlere diye bu 繹yk羹y羹 paylamak istemitim. Bu iten kazananlar bu yaz覺ya g羹l羹yordur ancak g羹n gelir devran d繹ner bu s繹zlerin k覺ymetini anlarlar buna ne yaz覺k ki doa kanunlar覺 deniyor.Meritlicektim; ancak sMerit'im kalmad覺覺m i癟in Meritleyemedim; ac覺n覺z覺 bende payla覺yorum; hep ileri bakmak d覺覺nda baka bir 癟aremiz yok ne yaz覺k ki. Ge癟mii hat覺rlarsak o h覺rsa tekrar kap覺l覺r覺z ancak siz siz olun;K覺r覺k vazoyu birletirmeye 癟al覺覺rken baka vazolar k覺rmay覺n.Sal覺klar ve g羹zel geceler dilerim.Tetaeridanus.Kesinlikle kat覺l覺yorum, yaam覺 olduumuz bu durumu ancak benzer ekilde olay yaam覺 birisi tam anlam覺 ile anlayabilir. Maalesef ki gen癟lik hatalar覺m覺z覺n u an bizler i癟in 癟ok ciddi olumsuz etkileri olduunu hatta bu etkiler sebebi ile g羹n羹m羹zde de i癟imizde k羹癟羹k de olsa bir pimanl覺k olduunu g繹rmek a癟覺k癟as覺 biraz 羹z羹c羹 bir durum. Umuyorum ki yaad覺覺m覺z bu tecr羹beler bir bakalar覺 i癟in faydal覺 olur ve mesajlar覺m覺z覺 g繹ren kimse bizimle benzer hatalar yaparak bu pimanl覺覺 yaamaz. Merit konusunda ise can覺n sa olsun dostum, u an bir 羹st r羹tbeden uzak olmam sebebi ile benim i癟in a覺r覺 bir anlam覺 bulunmuyor gibi fakat elbette damlaya damlaya da g繹l olur. B繹yle d羹羹nerek bir 羹st r羹tbeye ulama hedefinden uzaklaarak bir de bu konuda pimanl覺k yaamak istemiyorum a癟覺k癟as覺.K覺r覺k vazo 繹rneine gelmek gerekirse, kesinlikle kat覺laca覺m bir 繹rneklendirme olmu. Genellikle tutar fark etmeksizin bir iin k繹t羹 yola sapmas覺na sebep olan durum ile yine o iin daha k繹t羹 olaca覺 ihtimalini hi癟e sayarak ayn覺 ekilde zarar覺 癟覺karmaya 癟al覺mak maalesef hi癟bir zaman 癟繹z羹m olamad覺 ve olmayacakt覺r.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "October 23, 2023, 01:40:12 PM",
      "body": "Cointelegraph manip羹lesi konusunda da g繹rebileceiniz 羹zere b羹y羹k oyuncu deilseniz her t羹rl羹 elinizdeki mal覺 al覺yorlar ge癟enlerde fenomen bir adresin her iki y繹net yak覺n aral覺klarla a癟t覺覺 short ve long ilemi vard覺 adam hemde milyon dolarl覺k ilem a癟覺yordu adam覺 bu btc y羹kseliinde hem long'unu yediler hemde shortunu. Kald覺ra癟 resmen kumar kumardan farks覺z altcoinlerde asl覺nda kald覺ra癟 say覺l覺r btc alaca覺n覺za altlar覺 al覺yorsunuz 50-x 100x yapmas覺n覺 bekliyorsunuz.Kasa her t羹rl羹 kzand覺覺 bir yap覺da birde masan覺n ba覺ndaki adam覺n hereyi g繹rd羹羹 bir yerde size kimse ekmek yedirmez.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wolwoo",
      "created_time": "October 23, 2023, 05:46:08 PM",
      "body": "son 繹deme tarihi bug羹n olan kredi kart覺na yat覺raca覺m paray覺 biraz deerlendireyim dedim, ay覺n 16's覺nda yollad覺m binance'a future girdim, 5 saat sonra paran覺n y羹zde 80'i stop loss oldu  1 haftad覺r al sat al sat anan aa baban yuhar覺 demin y羹zde 6 karla zor 癟覺kt覺m. madem 4x yapacan erimeden yapsayd覺n ya",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "October 23, 2023, 06:02:52 PM",
      "body": "Quote from: wolwoo on October 23, 2023, 05:46:08 PMson 繹deme tarihi bug羹n olan kredi kart覺na yat覺raca覺m paray覺 biraz deerlendireyim dedim, ay覺n 16's覺nda yollad覺m binance'a future girdim, 5 saat sonra paran覺n y羹zde 80'i stop loss oldu  1 haftad覺r al sat al sat anan aa baban yuhar覺 demin y羹zde 6 karla zor 癟覺kt覺m. madem 4x yapacan erimeden yapsayd覺n ya Hocam seni airdroplara alal覺m bu taraf覺 bover.  En az覺ndan zarar覺n yok.Scroll. zksync bu a覺 kullanan kullan覺c覺lara belirli kriterleri kar覺larsa airdrop olarak token alacak bak valla bouna kald覺ra癟la urama.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wolwoo",
      "created_time": "October 23, 2023, 06:04:57 PM",
      "body": "Quote from: mandown on October 23, 2023, 06:02:52 PMQuote from: wolwoo on October 23, 2023, 05:46:08 PMson 繹deme tarihi bug羹n olan kredi kart覺na yat覺raca覺m paray覺 biraz deerlendireyim dedim, ay覺n 16's覺nda yollad覺m binance'a future girdim, 5 saat sonra paran覺n y羹zde 80'i stop loss oldu  1 haftad覺r al sat al sat anan aa baban yuhar覺 demin y羹zde 6 karla zor 癟覺kt覺m. madem 4x yapacan erimeden yapsayd覺n ya Hocam seni airdroplara alal覺m bu taraf覺 bover.  En az覺ndan zarar覺n yok.Scroll. zksync bu a覺 kullanan kullan覺c覺lara belirli kriterleri kar覺larsa airdrop olarak token alacak bak valla bouna kald覺ra癟la urama.羹stad anlam覺yorum ki nas覺l yap覺l覺r edilir bilmiyorum yine de teekk羹r ederim ilgin i癟in",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}