{
  "id": "topic_5460578",
  "title": "icopress",
  "author": "icopress",
  "created_time": "July 21, 2023, 03:48:39 PMLast edit: August 24, 2023, 01:05:53 PM by icopress",
  "content": "QuoteI'm posting this because it's impossible to become a merit source without an app. To be honest, I'm not sure what I should mention other than posting 10 unmerited posts, so I'll be as brief as possible, and I will not tell about myself, because I perceive point number 1 as a formality that Theymos published in order to limit the flow of applications. In case my assumption is wrong, anyone can visit my BPIP or Loyce.Club profile.Quote from: theymos on January 24, 2018, 11:00:11 PM1. Be a somewhat established member.2. Collect TEN posts written in the last couple of months by other people that have not received nearly enough merit for how good they are, [...].Submitted posts have not received any merits.The submitted posts are written by 10 different users of different ranks.Might be worth mentioning (which is directly related to the topic) is that I sent over 2500 merits without being a merit source.I spent quite a lot of time here in the walls of the forum to understand what's what, (total time logged in: 195 days, 43 minutes).SUBJECTSTORYBitcoin DiscussionQuote from: DooMAD on July 15, 2023, 12:23:06 PMOnce all the mindless speculation stops and things are built correctly, using something efficient, like Taproot Assets, I'm still fairly confident there is genuine utility to be found.  The only reason people are writing it off is because it's currently poorly implemented and because unscrupulous people are using it for blatant profiteering to sell the digital equivalent of magic beans to gullible suckers.  I don't see Ordinals as \"lucrative\" (as per OP) in any way, unless you're the type of person (not you personally, nutildah, but in general) who somehow still sleeps at night knowing they've taken advantage of someone.  If they are used properly as a tool to represent real-world assets like financial documents, deeds, wills, etc, then that would be a world in which I can accept Ordinals.  Until then, however, it's a sleazy, underhanded crap-fest, much like ICOs, forkcoins and other the other speculative-bubble-abuses that have occurred previously.  I want no part of that.Technical SupportQuote from: PawGo on May 04, 2023, 07:51:27 AMAll what was written about fees is correct, but just for record (and maybe for novice users):Blocks are \"mined\" by miners which do some calculations based on the given difficulty set for some period of time. Difficulty is adjusted every 2000 blocks, just to have the average performance 1 block every 10 minutes. But, it is average speed, it does not mean transaction will be processed in max 10 minutes. Unfortunately we cannot tell when next block will be mined. For example in the current \"evaluation period\" we are statistically 20 blocks late and soon difficulty will be decreased by +- 1%.As a consequence, you should be aware that it is possible to wait a long time for block and fee does not change anything. The risk is that if block is very late (it happens that we have 30, 40 minutes or 1h without block), fee which was sufficient 1 h ago, is not sufficient now, as your transaction will be removed from the 1st expected block as other users prepared lot of transactions with much higher fee. I skip talking about low-fee transactions purged from mempool as we talk about high fees.Wallet softwareQuote from: Cricktor on July 16, 2023, 01:01:23 PMAn interesting Electrum server is also Fulcrum which has been discussed in some other thread(s) here on this forum, e.g. here https://bitcointalk.org/index.php?topic=5441463 and also compared with other Electrum server implementations e.g. here https://www.sparrowwallet.com/docs/server-performance.html.I use Fulcrum on my RaspiBlitz node as replacement for electrs because I got tired of the issues that electrs has sometimes with addresses that have a huge transaction history. For my personal Electrum wallets I don't need Fulcrum, electrs would be fine. When I do sometimes a bit of blockchain digging I've run into such issues from time to time with electrs. Fulcrum is easier to configure to server huge address histories and it's refreshingly fast with data retrieval compared to electrs.Linux and Windows executables are available from the Github, MacOS executables are announced but not yet there. You can always check the code and compile your executable yourself. I don't mind that the main dev appears to be in the BCH camp, the project is open-source and works very well for Bitcoin.Trading DiscussionQuote from: Yamane_Keto on July 18, 2023, 04:14:19 PMAlmost all CEXs use trading bots to create liquidity, maintain it and for many other things. Therefore, the use of bots in this field is old, and artificial intelligence may come to improve results or speed up the execution of tasks. Since you are looking for a bot that works with AI, all you need is that be AI prediction mechanism.This is an open source code with which you can get price forecasts of bitcoin prices using AI https://github.com/albert-espin/bitcoin-predictionwhat you have to do now is link these outputs to any of the traditional trading bots, and you will have a fully automated AI trading bot. As I mentioned, the role of artificial intelligence here is to predict Bitcoin prices only. You will find more projects here https://github.com/topics/bitcoin-predictionTechnical DiscussionQuote from: vjudeu on July 05, 2023, 05:29:22 AMSpam will always be an issue. No matter what limit will be set, block creators will always reach it. Set 1 MB as Satoshi did, and it will be reached. Set 4 MB as Segwit creators did, and you will also see fully filled blocks.If you are a block creator, then you have an incentive to create the biggest possible block. Why? Because then, you can pick some simple, deterministic algorithm, and generate terabytes of always valid transactions on-the-fly, then let your miners work on that header, and send mined block to other nodes. Then, you can start producing some next block, on top of what you created, while other block creators will try to validate what you submitted.Instead of thinking about block size alone, think about verification time. If blocks are produced every 10 minutes, but your blocks are so complex, that it takes 5 minutes to verify them, then guess what: other block creators have 5 minutes of \"guessing time\": you already know, if your block is valid or not. But others don't, and they have to decide, if they want to create the next block on top of not-yet-checked-block.Technical DiscussionQuote from: larry_vw_1955 on June 10, 2023, 10:24:57 PMThere's only one way to fully validate the current utxo set and that is by downloading the entire blockchain from the genesis block. if someone wants to trust some third party then  i guess that's up to them but internet speeds and storage space seem like they will able to support blockchain growth perhaps indefinitely since technology is always improving and we already have 20+TB drives.That's about a 40:1 ratio of unused to used space. You can bet that's going to get bigger in the future. people can already have a 1Gbps internet speed. That should be sufficient far into the future for downloading the blockchain. Blockchain grows at 0.1TB per year max, it takes how many years to fill up a 20TB HDD? In 100 years the blockchain will be at most about 10TB. On a 1Gbps connection you can download that in just over 1 day. In 100 years, 1Gbps probably will be something everyone has. No one is still on dialup. The day when you can't download and fully validate the blockchain from the genesys block if you so desire is the day that bitcoin becomes meaningless. Because you won't know if it goes all the way back to satoshi or not.Technical SupportQuote from: garlonicon on May 30, 2023, 03:36:11 PMYes, you cannot do \"public key recovery\", because:1. The way how signatures are made, makes it hard to do it in the same way as for pre-Taproot addresses. If you have some output with a script \"<signature> OP_SWAP OP_CHECKSIG\", it works for pre-Taproot public keys, but it cannot be done for Schnorr signatures.2. You don't need to recover any key, because Taproot address is used to encode your compressed public key directly, and it is automatically assumed that it has \"02\" prefix.3. If you have more than one party, then after aggregation you only know the public key for the combined signature, you don't know which public keys are used in the middle, because if you know that the result is \"10\", then you don't know if it was \"2+8\" or maybe \"3+7\", or even \"2+3+5\".Technical DiscussionQuote from: n0nce on May 03, 2023, 06:32:42 PMIt is not possible to actually 'seal a private key'. First of all, it is basically impossible to safely create pre-funded collectibles (safe as in: the creator has no access to the private key). The method Leo mentioned, allows you to make user-funded collectibles safely, but that kills the coin's collectible value, as now the user who funded it, can scam a future owner of the physical coin.In my opinion, for substantial amounts and as technology advances / gets cheaper, hardware-wallet-inspired collectibles should be considered. For instance, it is today possible to build a device which uses an open-source 'avalanche' circuit to generate entropy and private keys and store them in a secure chip, which even the creator cannot extract, although he has hardware access to the device. The device would be able to display a Bitcoin address, though, and destruction would be necessary to spend the funds. This is all possible and mostly how a hardware wallet works (only really changing the way the secure element grants you signing access), but those aren't exactly cheap, so this is the one drawback.Altcoin DiscussionQuote from: d5000 on July 09, 2023, 08:28:05 PMThe \"developer tax\" (a mandatory fee which is either taken from transaction fees or from block rewards, and goes to the developers) you mention is implemented in various altcoins already, also in some which were initially not premined (for example PIVX).Such a developer tax, if it's mandatory, can however lead to problems which impact in the competitive situation:- If it's taken from transaction fees, then adoption can be harmed, because the coin would then be more expensive to transact than competitors.- If it's taken from block rewards, then it's simply additional inflation, which does not bring more security (like increased mining or staking rewards would do) but only dilutes the coin supply.There are however also models which don't have these problems. For example, in Signum (originally Burst), some big pools agreed to pay regularly a small fee to fund development activities and nodes which are always online. As this is completely voluntary, it's similar to a donation and thus does not impact decentralization at all. If problems for the competitive situation arise, the \"tax\" can simply be reduced or eliminated completely.Mining DiscussionQuote from: NotFuzzyWarm on March 15, 2023, 12:36:18 AMAnd thanks to Al Gore and his financial cronies, said coal power plant no doubt purchases carbon credits so on paper they are 'low CO2 emissions'.  That particular setup is also an outlier. Mines are setup where there is:a. Abundant low cost power.b. Friendly local governments.Regarding 'a', the massive amounts of power the largest farms use is there because there is not enough local loads to run the power plants at maximum efficiency and it cannot be economically be sent across 'the grid(s)' to be used elsewhere. The farms that were once located in the Pacific Northwest existed because of the large hydroelectric dams that were built to power several massive aluminum refining plants all mostly owned by Alcoa. When those plants were shut down during the 90's & early 2k's the utilities needed a huge 'local' load to justify operations. When miners and data farms moved in everyone was happy. Finally around 2013 Canada established a high-tension link between the Northwest and their grid to buy power from the dams who now had a market willing to pay more for that power. That more than anything is what drove PUC to all but shut down large mining farms... In that case, also 'b' was not present.These days the same supply/demand economics apply. Yes Texas has massive wind farms and guess what - they produce far more power than is usually needed to feed the all but isolated Texas power grid ran by ERCOT. It has only 2 ties to the rest of the national grid system and they are pretty limited in how much power can be sent through them. Now in their case the overcapacity was purposely built to accommodate local weather conditions and the amount of power produced & needed in the local areas. When there are poor winds in one area odds are they are good in enough other areas to cover it. That said, the end result is usually far more power than Texas can use.Enter mining farms. Most folks have at least heard of the deals that ERCOT and the mega farms in Texas have: The farms get to soak up the excess power at reasonable rates but with 1 caveat - whenever circumstances require it (most often weather) the farms have to throttle back their power usage and even stop running entirely until things change. So much for 'the power usage harming other users'...Yes ERCOT pays the farms a stipend for not running but it is a fraction of what the mines would earn if running plus that diverted power is still being used/bought. Still, given how easy it is to switch a mine on & off vs any other type of mega power hungry industry to free up that power to be sent where it is needed more, not a bad deal. ERCOT gets to build up their safety net of over-capacity knowing they have a line of buyers waiting to get some of that (conditional) excess power. Win-win for all involved.____________________",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460578",
  "comments": [
    {
      "author": "icopress",
      "created_time": "July 21, 2023, 03:49:57 PM",
      "body": "If someone wants to speak up, don't be shy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "July 21, 2023, 03:56:56 PMLast edit: July 21, 2023, 05:34:08 PM by Rikafip",
      "body": "Quote from: icopress on July 21, 2023, 03:48:39 PMI'm posting this because it's impossible to become a merit source without an app. Even though it is (very) rare, that's tehnically not correct as few members got merit source status 2 years ago when theymos did merit \"readjustement\" without applying to be a merit source. Beside that, what to say other than you would be an excellent merit source so good luck with your application!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "July 21, 2023, 03:59:00 PM",
      "body": "You have good application I hope theymos will make you a merit source. There have been some people that have applied for merit source more than a year ago and many months ago, I hope theymos will make everyone of them to be come a merit source too because they all have good applications.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "July 21, 2023, 04:47:00 PM",
      "body": "icopress is really a good member of the community and I would love to see him as a merit source because the guy can help the community a lot by sending merits to the posts that deserve those merits. I'm quite sure that anyone would love to have a member like @icopress as a merit source because we all know that the user has been doing great on the forum, and could be a very valuable asset for the current merits sources as well as the other members of the forum who give their best to create informative and useful posts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "July 21, 2023, 05:31:31 PM",
      "body": "I'm happy to see this, and what can I say than to wish you very good luck with your application.If there are no lapses reason, I believe you might not have put it upon yourself to apply. I only ask you to do things differently than most others, a different style might spread it better as you desire.Good luck!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "July 21, 2023, 05:59:21 PM",
      "body": "Icopresssssssssss!!!!! Kodus mhannn! I least expected that from you at the time - not in a bad way... I mean, you've got a decent merit ratio which - without even looking up to confirm on bpip - I can tell you've sent that amount considering your 5k merit stat... I hope big daddy T See's this? - and sure, why won't he? Afterall chymist cried his whole life, begging on a grant...took sometime buh the end was worth the while... I dunno if he's got plans to validate anymore persons, BUT YES, I SUPPORT YOU AND THAT'S WHAT MATTERS.Sandra 🧑‍🦰",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 21, 2023, 06:43:12 PM",
      "body": "From what I know of you, I think you'd be a good source of merit. So I hope that when this situation is reviewed, you can be one of the chosen ones.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "skarais",
      "created_time": "July 21, 2023, 07:02:03 PM",
      "body": "icopress, I will support your merit source app. But anyway, so far I don't see the admin has accepted some of the apps and made them the latest merit source. But there is nothing wrong to try and keep updating your app with some best deserving posts on regular basis, it will definitely help you to get high probability to be made as a merit source.Good luck, icopress.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "July 21, 2023, 07:06:30 PM",
      "body": "I can't remember who and when was the last time theymos did add new merit source. I think it's already months or even a year already. I wonder if he will be ready add new ones. Since almost all the previous merit source applications are all qualified imo to be part of that cicrcle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "July 21, 2023, 08:16:27 PM",
      "body": "Quote from: Rikafip on July 21, 2023, 03:56:56 PMQuote from: icopress on July 21, 2023, 03:48:39 PMI'm posting this because it's impossible to become a merit source without an app. Even though it is (very) rare, that's tehnically not correct as few members got merit source status 2 years ago when theymos did merit \"readjustement\" without applying to be a merit source. Wasn't that 4 years ago?  I recall it being 2019 when Theymos told me I was now a merit source and to go forth and prosper.  Lol.  Either way, it's practically impossible to become a merit source right now without creating an application thread, and if icopress didn't do it isn't likely Theymos would even know he was interested in the job.  But I guess I'm nitpicking.I support your application, icopress.  I also think we probably need more merit sources in general, though it's hard to tell since there's a lack of data about which ones are still active, how active they are, and so forth.  All we've got is merit data and a Meta thread dedicated to members who've recently ranked up.  In any case, you know which posts deserve merits and which don't so good luck catching Theymos's attention, and if he happens to see this I'm hoping he'll tap you to be a merit source.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "July 21, 2023, 08:32:01 PM",
      "body": "Well, I have known you to be one of the respected old members of this forum, and I know that your application is not just a blaffle, but like you said, you have reported 10 good posts that were not merited. Yea, that's what it is, to really see some good posts but lack Smerit to appreciate the OP. I know we have a few merit sources here who are already trying their best in the way they have chosen to distribute their merit, but it seems a lot of good posts still remain unmerited, so all the available merit sources cannot really see every post at once, so if merit sources are more than the number they are now, there will be more chance for good posts to receive merit. I support your motion, @Icopress, and hope that theymos approves it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "July 21, 2023, 08:36:12 PM",
      "body": "Quote from: The Sceptical Chymist on July 21, 2023, 08:16:27 PMQuote from: Rikafip on July 21, 2023, 03:56:56 PMQuote from: icopress on July 21, 2023, 03:48:39 PMI'm posting this because it's impossible to become a merit source without an app. Even though it is (very) rare, that's tehnically not correct as few members got merit source status 2 years ago when theymos did merit \"readjustement\" without applying to be a merit source. Wasn't that 4 years ago?  I recall it being 2019 when Theymos told me I was now a merit source and to go forth and prosper.  Lol. Well, maybe it happened then as well (it was probably before my time here) but it also happened in summer of 2021 (which was the last time theymos introduced new merit sources) as one of our local board member got a merit source status without ever applying for one. So yeah, it is possible but it's definitely better to apply than wait for a miracle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "July 21, 2023, 08:54:54 PM",
      "body": "I never knew you were not a merit source. All my time here on the forum, I came across posts that were merited, and when it was talked about merit sources, I always considered you one, as I always came across posts that were merited by you, even in places where posts barely earned merits.I don't know which and what qualifies a member for being a merit source, but based on what I observed in how you distribute merit, you are qualified to be on that list. If it's something that requires some kind of voting, I'm sure you will definitely get all the votes and support you need to get there. But it's all in the hands of the admin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "July 21, 2023, 09:12:23 PM",
      "body": "Well, I am sure that icopress will be a good merit source. There are some posters who aren't getting enough merits no matter how good they are compared to other posts that doesn't seem very good or some will say it is okay yet they more merits. I think more merit sources are needed as I see other posts that are good aren't get merited and there are lots of good posters or in short, merit sources need more hands to do the job. Like what fillippone is doing where some are still waiting to get merited except those who are only abusing the generosity of fillippone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EFS",
      "created_time": "July 21, 2023, 09:17:25 PM",
      "body": "I support this application. You would be a good addition to merit sources as most sources burned out and stopped using merit system. I hope theymos will consider changes in sources soon as the system is almost dying.For the merit system to continue as planned, active sources and members who distribute smerits they earn are needed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RickDeckard",
      "created_time": "July 21, 2023, 09:23:42 PM",
      "body": "Every single interaction that I had with you was positive icopress, and I believe that will continue for as long as both of us are here. Considering what you (and your family) went throug, you were still able to provide good content to the forum[1][2] alongside GazetaBitcoin. I couldn't think of a better merit source and I fully support it.[1]https://bitcointalk.org/index.php?topic=5390008.msg59545797#msg59545797[2]https://bitcointalk.org/index.php?topic=5437673.msg61693236#msg61693236",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "July 21, 2023, 09:53:10 PM",
      "body": "Wow, with the kind of contribution and reputation Icopress has given and earned on this forum, I've always thought that he or she(I know its a He though) was one of those merit sources. I am kind of surprised to find your merit source application here to be honest..Well, no fretting, with your level contribution to both the development and growth of this forum in your own little way, I am more than convinced that you will be approved as a merit source soon, there is no need asking if I support the application or not, you will make a good source, Icopress will make a good merit source no doubt about that.Wishing you the best of luck bud.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "July 21, 2023, 09:54:16 PM",
      "body": "Quote from: icopress on July 21, 2023, 03:48:39 PM~ It is well deserved and merited application. You have contributed enough to the development of the forum, you have sponsored programmes, contest, campaigns, quiz, and others. There will be no comma, or but in your application. Your Merit Source Application is overdue. I pray that Boss Theymos grant your application without objection. Though we had disagreement in sometime but I still respect you and recommend you to be accepted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "July 21, 2023, 09:55:55 PM",
      "body": "I definitely support your merit source application. We need more of these folks as members come and go. I believe there are a handful of merit sources that are no longer active after a couple of years. So, a member who is still very active like you would be a good addition.Theymos usually take long to add new merits sources, but I hope he does it as soon as he can.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}