{
  "id": "topic_5424077",
  "title": "SmartGold01",
  "author": "SmartGold01",
  "created_time": "November 29, 2022, 01:16:01 PM",
  "content": "Sorry to say from my title i decided to know if there is any modalities, methods or best way to attract and seek attention out there to let people know about bitcoin without going to speak with them Face 2 Face (F2F) discussion reason because they act to be too busy to pay attention whenever i seems to approach to them.From my little understanding I have nothing much to support to the community rather preaching about bitcoin and it's adoption to my localities and I believe if I does many would hear it and pick interest towards it and if one picks interest then there is every possibilities they could also convince their friends to pay attention by so doing I would achieve lot of things by helping to spread the max adoption.From my understanding, I never hold any bitcoin or something else but I love it from the very onset I began to know about it which I picked interest upon myself to evangelize to the world.Please keep in mind this post wasn't created for merits purpose but as a way to gear up the acceptability and adoption of bitcoin.Thank you as we discuss the ways, maybe it would be very easier for me to carry out my mission and vision.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5424077",
  "comments": [
    {
      "author": "Zaguru12",
      "created_time": "November 29, 2022, 01:44:17 PM",
      "body": "You are yet to invest in bitcoin, so how do you explain to people how it is purchased, security and why it save to use than fiat. All these can be preached or thought to someone when you have a personal experience. So you first need to invest before spreading its adoption. Let it start with you.Then you could go on and preach to them about the experience you have gotten from it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "November 29, 2022, 01:52:12 PM",
      "body": "Quote from: SmartGold01 on November 29, 2022, 01:16:01 PMif there is any modalities, methods or best way to attract and seek attention out thereYep, with any method of spreading the word other than F2F, sharing your own experiences is most important.Quote from: SmartGold01 on November 29, 2022, 01:16:01 PMI never hold any bitcoin or something else but I love itWondering what something else is, including never having made any transactions? meaning never at least feel the benefits of bitcoin. How do you spread the word that bitcoin is useful?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "November 29, 2022, 02:21:54 PM",
      "body": "Quote from: SmartGold01 on November 29, 2022, 01:16:01 PMPlease keep in mind this post wasn't created for merits purpose but as a way to gear up the acceptability and adoption of bitcoin.Currently, the easiest way to do this is through social media. we know now most people use social media every day. we can use it to tell more people about bitcoin. maybe it can affect adoption in the market, but the goal is for people who don't know to get to know first.however, I would prefer f2f that some crypto exchange companies do through some of the events they do. the most important thing is not more adoption, but their understanding regarding crypto assets and Bitcoin first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Getmon",
      "created_time": "November 29, 2022, 03:04:12 PM",
      "body": "It starts within yourself. Because why would I believe in you when you yourself do not own a bitcoin? It doesn't make sense when you have the urge to convince people about bitcoin. Are you planning to collect fees when preaching to them about bitcoin? Here is my simple advice.- Focus on yourself first before thinking about others.- Buy bitcoin first before carrying out your vision and mission of evangelizing the world about bitcoin.- If you don't have money to buy bitcoin, you need to get a job first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "November 29, 2022, 03:14:43 PM",
      "body": "Just casually mention Bitcoin, then explain it thoroughly but briefly if they actually asked and was curious about it. You don't need to shove Bitcoin down people's throats.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "isaac_clarke22",
      "created_time": "November 29, 2022, 03:23:54 PM",
      "body": "Quote from: SmartGold01 on November 29, 2022, 02:22:41 PMLike to buy and hold which I meant, but have been using it for transactions although I have been involved with trading before but I m not a whale who hold dozens of bitcoin.Well that is already a start, OP. You are still in the point where you are still learning.Expect a lot of questions from people when you are trying to get their \"interest\" to Bitcoin. Since you mentioned that you have been involved with trading before, are you ready to answer some people's question like \"what is txid\", \"what are trading signals and how can I use them\", \"how do you buy/sell\", etc. ? Since you also mentioned that you are not going to do F2F discussions, you might need resources (YT vids, books, etc) or/and maybe virtual discussions to answer some questions from your community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "November 29, 2022, 03:24:33 PM",
      "body": "Quote from: SmartGold01 on November 29, 2022, 01:16:01 PMbest way to attract and seek attention out there to let people know about bitcoinThere's no best way. Usually people talk about their own experience, or, when the price is growing and Bitcoin reaches the news, then those news can be taken into discussions.But if you have no experience in Bitcoin, you may get to be perceived as somebody who want to earn from others' work (eg referrals) and maybe that's why you're approaching them.Also bitcoin is not the best investment for everybody and if you talk about bitcoin as investment you may be perceived in a bad light. Even more, if you convince people buy bitcoin and then they panic sell at a loss, they may try to hold you responsible. It's not an easy task.On the other hand, the technical parts of bitcoin are superb for the tech inclined. Or Bitcoin can be a very easy way to pay or be paid or simply send money abroad. If you go for technical details or for bitcoin-as-currency and mostly warn about the risks of bitcoin-as-investment, you may have better chances.Or, you can simply pay with bitcoin for this or that jobs, so people do start finding it useful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ayebabara",
      "created_time": "November 29, 2022, 03:29:58 PM",
      "body": "Base on your subject, why do you want to seek people's attention on bitcoin? Do you need to advertise your country's money to people before they will aware that such currency existing. When I knew bitcoin nobody called my attention, I saw the advertisement n social media and radio broadcast, then I browse it to know more and later my uncle who is a bitcoiner asked me to join here to know more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "November 29, 2022, 04:02:44 PM",
      "body": "Quote from: SmartGold01 on November 29, 2022, 01:16:01 PMFrom my understanding, I never hold any bitcoin or something else but I love it from the very onset I began to know about it which I picked interest upon myself to evangelize to the world.Firstly, own some Bitcoin then you'll realized it doesn't need people's attention instead people need it. Anyone who wants to change their finances status in this modern day is constantly looking for ways to do such, therefore they'll definitely come across investing in Bitcoin and cryptocurency in general. Bitcoin does has the capacity to sell itself and we have big third party service providers doing the advertisement for it just to get users on their own platforms. What you should be focus on is how to educate yourself properly so you can passed down that information when the chances present themselves.The problem the industry is facing, Isn't about people not coming into the industry but the information they're receiving, that'll the area we're lacking behind and thankfully we have a forum like this that isn't censored yet to fit the narrative of centralization by the government. Therefore you should focus your energy on giving out the correct information to already existing users before thinking of bringing in new users and there's no better way of doing that than owning some bitcoin yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Awaklara",
      "created_time": "November 29, 2022, 05:34:47 PM",
      "body": "Quote from: SmartGold01 on November 29, 2022, 01:16:01 PMSorry to say from my title i decided to know if there is any modalities, methods or best way to attract and seek attention out there to let people know about bitcoin without going to speak with them Face 2 Face (F2F) discussion reason because they act to be too busy to pay attention whenever i seems to approach to them.I'm not sure right now, whether Bitcoin needs such a way to catch the market's attention. what some people with large followings are doing right now is also an attempt to create increased adoption or just to move the direction of market trading.perhaps the situation will be different for the new altcoin market. projects that of course need more marketing to increase trading and adoption of their tokens.if you want to share something with your friends or the people around you. then give something right. this is related to knowledge or maybe wrong and true news regarding the development of bitcoin information in the community. if you don't like F2F, maybe you can use your social media accounts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "November 29, 2022, 05:46:49 PM",
      "body": "Bitcoin, OP, is a technology you should learn first before witnessing to people about it. When that is done, they're multiple means of reaching out to people about bitcoin. People want to understand better what bitcoin is about. And its not hard to get their attention. First, you can walk up to some people in a long ATM queue waiting to withdraw cash, transfer, or make payments; these are people who are frustrated by the banking system, talk to them about a sweet alternative which is bitcoin. Since they're in a queue they'd have no other option than to listen. You'd be surprised to see more ears listening to your conversation. Second, talk to friends about your new discovery, bitcoin, how it works and its importance to the future of money in our society. You can as well take things to social media and create some awareness there. The benefit of this is that the more you share your knowledge the more it increases. Don't stop at what you think should be done.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "November 29, 2022, 06:00:39 PM",
      "body": "There are many ways to evangelize Bitcoin to people without face 2 face discussion and I believe use wearing BTC merch is one of them but I believe the major reason why you couldn't attract people's attention is that you don't understand the beauty of the BTC technology yourself since you don't hold or buy any fraction of it.How would you evangelize something you know nothing about? The number key in cryptocurrency is knowledge develop your knowledge first and then proceed with spreading the word about Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pillsike",
      "created_time": "November 29, 2022, 07:00:50 PMLast edit: November 29, 2022, 11:12:50 PM by Pillsike",
      "body": "You're into Bitcoin right?, You know the benefits you've enjoyed since you started your crypto journey. You could start by telling them that. But honestly based on my personal experience I think people are more likely to be more attracted to what you're saying if you talk to them face to face.Most of these online stuff are very hard to believe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Issa56",
      "created_time": "November 29, 2022, 09:51:29 PM",
      "body": "Quote from: SmartGold01 on November 29, 2022, 01:16:01 PMFrom my understanding, I never hold any bitcoin or something else but I love it from the very onset I began to know about it which I picked interest upon myself to evangelize to the world.You have never hold bitcon before and you are telling people about bitcoin, I think you should practice it first before you start encouraging people to join. I don't know if you really know anything about bitcoin, because if you know anything about it, you will definitely have been holding bitcoin even if it's small. I don't know how you are encouraging people to invest in bitcoin that you are not also holding, am not saying what you are doing is bad, but I think it's better you get yourself bitcoin so that you won't end up regretting why you didn't invest in bitcoin when you were preaching it to people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "November 29, 2022, 10:32:35 PM",
      "body": "Start by having it so that you'll know what it feels like to have it. And from there, you can start with what you're thinking about spreading the word.Because when you still don't own any of it even the tiniest satoshis then you go out there and start to share the word of knowledge about bitcoin and then suddenly, someone asks you to show how much you've got. You're in the right to decline to answer the question but that for sure will hit you when you're asked to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "November 29, 2022, 10:35:03 PM",
      "body": "OP, the best way to get people to pay attention to something is to first start paying attention to it yourself. If you yourself are not already invested in bitcoin, then maybe you should take a far look at it before telling other people how they should be investing in bitcoin. It will give you credibility with those that you speak with, and what's more, this method might even introduce you to the concept of blockchain technology, which is moving toward being the newest revolution in the world of finance. You should have a complete understanding of why you are using bitcoin in the first place. You need to educate yourself thoroughly, on the cause why bitcoin was created, and why there is such a demand for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "November 29, 2022, 11:09:16 PM",
      "body": "Quote from: SmartGold01 on November 29, 2022, 01:16:01 PMSorry to say from my title i decided to know if there is any modalities, methods or best way to attract and seek attention out there to let people know about bitcoin without going to speak with them Face 2 Face (F2F) discussion reason because they act to be too busy to pay attention whenever i seems to approach to them.1> I don't even think it's necessary to force People to listen or learn about something they don't want. We're in a digitalized world where the Internet could vividly explain, currupt or enlighten anyone so they could -- as well get the knowledge anywhere. My point here is: almost 90% of people allover the world (If it's a continental stats) are using cell phones, palm tops, PCs ....what have you? So they could definitely learn themselves up.2>  Bitcoin has a logical operation pattern which is entirely DIGITALIZED so it won't make any sense if you begin to explain these things to an average person who's already apathetic about the nets and doesn't even have any clue on how to operate the least outdated model of cellphones -how much more putting 'em through some logical illustrations?QuoteI never hold any bitcoin or something else but I love it from the very onset I began to know about it which I picked interest upon myself to evangelize to the world.What made you pick an interest in something you don't even understand? whenever you're out for your EVANGELISM, how do you explain things to the people you meet out there?What exactly are you always asking them peeps to do? Buy and HODL Bitcoin that you haven't? Hehe...QuotePlease keep in mind this post wasn't created for merits purpose but as a way to gear up the acceptability and adoption of bitcoin.You're an old crock Bud'.... you got registered since 21 and you've got only 2? I don't even think this post deserves any bruv, sorry.QuoteThank you as we discuss the ways, maybe it would be very easier for me to carry out my mission and vision.Listen, YOU DON'T HAVE ANY VISION.Sandra 🧑",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Razmirraz",
      "created_time": "November 30, 2022, 02:15:16 AM",
      "body": "Quote from: SmartGold01 on November 29, 2022, 02:22:41 PMLike to buy and hold which I meant, but have been using it for transactions although I have been involved with trading before but I m not a whale who hold dozens of bitcoin.At least you already understand how to send, buy and sell Bitcoin. No need to push yourself too hard in Bitcoin trading, with a little capital you can already make Bitcoin transactions. The development of Bitcoin has pushed those who previously did not know or had never even heard of Bitcoin to start studying Bitcoin little by little. News published in electronic and print media has made Bitcoin known worldwide. You don't need to be tired of introducing Bitcoin to people out there, when people around you are getting interested in Bitcoin, they will come to you to ask how to buy and store it safely.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "November 30, 2022, 02:28:00 AM",
      "body": "The best way to seek people attention on Bitcoin is you need to give them free Bitcoin that worth at least $10, of course no one will reject it lol. Seriously, I won't seek people attention to know if I'm a Bitcoin enthusiast because I'm a privacy oriented person.Quote from: Razmirraz on November 30, 2022, 02:15:16 AMwhen people around you are getting interested in Bitcoin, they will come to you to ask how to buy and store it safely.No one will know if @OP is a Bitcoin Enthusiast, so how possible those people will come to @OP and ask how to buy Bitcoin while they can easily type \"how to buy Bitcoin\" in google to know the step by step to buy Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}