{
  "id": "topic_5523950",
  "title": "Synchronice",
  "author": "Synchronice",
  "created_time": "December 23, 2024, 08:19:47 PM",
  "content": "I couldn't believe what I read but it's true. In Japan, if you sell a crypto, you have to pay 55% any gain you make from it but that's not the end of nightmare, that's the start and a true nightmare starts when you receive a crypto inheritance. An inheritance tax is maxed out at 55%, so, if we combine inheritance tax, income tax and local resident tax, the person who got crypto as an inheritance will pay up to 110% taxes, which means that you pay 10% more than what you got.Recently, Italy increased tax on crypto from 26% to 42%, Denmark also has up to 52% tax on crypto gains as far as I know. The world is going crazy, especially the government which thinks that we don't have a right to make profit, they want us to be enslaved to monthly salaries.Here is the source: https://www.mitrade.com/insights/news/live-news/article-3-529523-20241218",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5523950",
  "comments": [
    {
      "author": "apogio",
      "created_time": "December 23, 2024, 08:28:09 PM",
      "body": "We had a similar discussion today with LoyceV in another thread.When governments set such huge tax percentages, they lead citizens to tax evasion. They know it and they willingly try to earn as much as they can from the lawful citizens, whereas they allow the rest to enjoy huge profits.Life is life...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ziskinberg",
      "created_time": "December 23, 2024, 08:31:14 PM",
      "body": "Hmmm, interesting... since they can’t outright ban it, they slap huge taxes on it to discourage people from using it. It’s like a sin tax, similar to those on things the government considers \"not beneficial\" to us. This feels like the centralized government’s way of trying to undermine Bitcoin (decentralized) by using taxes as a tool.But do we get upset about it? Not really, because we always find ways to navigate around these taxes, knowing they’re not exactly fair.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stadus",
      "created_time": "December 23, 2024, 08:39:49 PM",
      "body": "Quote from: apogio on December 23, 2024, 08:28:09 PMWhen governments set such huge tax percentages, they lead citizens to tax evasion. And that's our way of expressing our disagreement with the injustice they’re committing. A 110% tax is completely unreasonable as it feels like they don’t want us to benefit from the profits of holding Bitcoin. Some governments even impose what they call \"unrealized gains\" taxes, requiring investors to pay taxes just for holding Bitcoin as long as the price goes up. That kind of tax is absurd and does nothing to encourage adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "December 23, 2024, 08:42:55 PM",
      "body": "Quote from: stadus on December 23, 2024, 08:39:49 PMAnd that's our way of expressing our disagreement with the injustice they’re committing. A 110% tax is completely unreasonable as it feels like they don’t want us to benefit from the profits of holding Bitcoin. Some governments even impose what they call \"unrealized gains\" taxes, requiring investors to pay taxes just for holding Bitcoin as long as the price goes up. That kind of tax is absurd and does nothing to encourage adoption.Until today, their ways to fight Bitcoin have been:1. ETFs only2. KYC exchanges only3. High taxes4. \"Tainted\" coins narrativeLet's see what else they 'll do.The good thing, is that they 've realised they can't control bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "December 23, 2024, 08:47:35 PM",
      "body": "Quote from: Synchronice on December 23, 2024, 08:19:47 PMI couldn't believe what I read but it's true. In Japan, if you sell a crypto, you have to pay 55% any gain you make from it but that's not the end of nightmare, that's the start and a true nightmare starts when you receive a crypto inheritance.Well, what can I say. This is greed and short-sightedness on the part of governments in some countries. Or is it discrimination? To scare the population from investing in crypto. If citizens of a country become richer, this makes the country richer. Isn't that so?A (hypothetical) solution suggests itself for residents of Japan: indicate the minimum period of purchase and sale of crypto and show the minimum yield, with which the minimum increase in profit (in percent). And from this minimum profit, say 1-5%, pay 55% in taxes (will amount to a conditional 1.5-7% of the total investment). I'm not sure that this will be easy to implement in terms of tax reporting, but what else can you do if the regulator invents inadequate taxes.Or you can do it differently - move to a country with 0% taxation of profits from cryptocurrencies. This is exactly how it should be done, so that countries greedy for cryptocurrency taxes get nothing.Quote from: Synchronice on December 23, 2024, 08:19:47 PMAn inheritance tax is maxed out at 55%, so, if we combine inheritance tax, income tax and local resident tax, the person who got crypto as an inheritance will pay up to 110% taxes, which means that you pay 10% more than what you got.The more the regulator makes life difficult for bitcoiners, the more ways bitcoiners will find to simplify life. These are not the people you can simply milk, because it is now easy to change your country of residence. And this will create capital outflow.Quote from: Synchronice on December 23, 2024, 08:19:47 PMRecently, Italy increased tax on crypto from 26% to 42%, Denmark also has up to 52% tax on crypto gains as far as I know. The world is going crazy, especially the government which thinks that we don't have a right to make profit, they want us to be enslaved to monthly salaries.In such cases, I have a question: if governments want our taxes, are they ready to compensate for the losses incurred when investing in crypto? I lost some money on shitcoins. Regulator, when will you give me tax deductions for these losses?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "December 23, 2024, 09:25:05 PM",
      "body": "Quote from: Synchronice on December 23, 2024, 08:19:47 PMAn inheritance tax is maxed out at 55%, so, if we combine inheritance tax, income tax and local resident tax, the person who got crypto as an inheritance will pay up to 110% taxes, which means that you pay 10% more than what you got.It shouldn't be this way. I don't live in Japan, but here in the EU you don't add income tax to inheritance tax because inheritance is not income. You pay only one of them depending on the situation. Let's say someone in your family gives you bitcoin, you have to pay income tax, but if that person dies and leaves you bitcoin in his last will, you only pay inheritance tax. Maybe you're wrong about that interpretation? I've never heard of anyone ever having to pay income tax after already paying inheritance tax. Also, in most countries inheritance from your closest family like parents and siblings is taxed at the lowest possible rate.Also, it's worth mentioning that 55% is paid only if you inherit over 600 million JPY, which is close to 4m USD. Most of us will never see such money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "headingnorth",
      "created_time": "December 23, 2024, 09:28:31 PMLast edit: December 23, 2024, 11:06:04 PM by headingnorth",
      "body": "Bitcoin taxes in Japan is 15% to 55% depending on your tax bracket. 55% applies only to the highest tax bracket.So the average Japanese would be paying more like 20 to 30%. In Italy they are still paying 26% because the 42% proposal did not pass.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "December 23, 2024, 09:34:53 PM",
      "body": "Quote from: Synchronice on December 23, 2024, 08:19:47 PMI couldn't believe what I read but it's true. In Japan, if you sell a crypto, you have to pay 55% any gain you make from it but that's not the end of nightmare, that's the start and a true nightmare starts when you receive a crypto inheritance. An inheritance tax is maxed out at 55%, so, if we combine inheritance tax, income tax and local resident tax, the person who got crypto as an inheritance will pay up to 110% taxes, which means that you pay 10% more than what you got.Recently, Italy increased tax on crypto from 26% to 42%, Denmark also has up to 52% tax on crypto gains as far as I know. The world is going crazy, especially the government which thinks that we don't have a right to make profit, they want us to be enslaved to monthly salaries.Here is the source: https://www.mitrade.com/insights/news/live-news/article-3-529523-20241218Being for the sake of first time, they would have started from a very low percentage rate than where they took it from, tis is going to be frustrating on some of the users, because one of the reason they are considering the use of bitcoin is because of the decentralization advantage in it, while this kind of implementation of tax payment and the rate involved could be heart broken by many, this is too much and people are going to find it difficult to use, using centralized exchange could be more dangerous for p2p in Japan, except they make use of other means for p2p without involving a centralized exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 23, 2024, 09:45:17 PM",
      "body": "throwing bitcoin into high tax is the game of promoting investors to use tax efficient investments.. yep ETF's actually lobby and sponsor both gov politics and bitcoin dev politics to make using bitcoin itself harder to use, so that people move to investing into etf's via their tax efficient pension plans",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "December 23, 2024, 10:42:28 PM",
      "body": "Quote from: Synchronice on December 23, 2024, 08:19:47 PMI couldn't believe what I read but it's true. In Japan, if you sell a crypto, you have to pay 55% any gain you make from it but that's not the end of nightmare, that's the start and a true nightmare starts when you receive a crypto inheritance. An inheritance tax is maxed out at 55%, so, if we combine inheritance tax, income tax and local resident tax, the person who got crypto as an inheritance will pay up to 110% taxes, which means that you pay 10% more than what you got.Recently, Italy increased tax on crypto from 26% to 42%, Denmark also has up to 52% tax on crypto gains as far as I know. The world is going crazy, especially the government which thinks that we don't have a right to make profit, they want us to be enslaved to monthly salaries.Here is the source: https://www.mitrade.com/insights/news/live-news/article-3-529523-20241218While other countries are doing everything possible including zero crypto tax laws, Japan is doing the opposite. This tax is simply a way of discouraging citizens from investing in cryptocurrencies. This kind of stringent laws would encourage people to avoid or even invade tax thereby reducing the income the government would have gotten if the tax was moderate. No wonder many investors and businesses are moving to the United Arab Emirates. The Emirate has some of the most flexible tax laws that can make businesses flourish.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alani123",
      "created_time": "December 23, 2024, 10:52:57 PM",
      "body": "This has to be clickbait in my opinion. I've never seen a tax code where it can be justifiably asserted that taxes end up being more than 100%. If you inherit something in terms of real estate property or cash, you get taxed on its value. But if it's something exchanged at capital markets it doesn't mean it's the same as property. This is why many wealthy families hoard wealth in the form of stock. They're the ones who have written the rules. So I think you don't have to lay both but only one. Either capital gains or inheritence but not both. Because if you inherit something and get taxed, then this is your acquisition price. Anyway. Japan is free to set its tax rates as it wants. If the people of the country owning crypto ad very much against this then let them vote for a different government. Or at least they should find ways to keep their earnings with crypto underground",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Catenaccio",
      "created_time": "December 24, 2024, 01:06:42 AM",
      "body": "Quote from: Synchronice on December 23, 2024, 08:19:47 PMI couldn't believe what I read but it's true. In Japan, if you sell a crypto, you have to pay 55% any gain you make from it but that's not the end of nightmare, that's the start and a true nightmare starts when you receive a crypto inheritance. An inheritance tax is maxed out at 55%, so, if we combine inheritance tax, income tax and local resident tax, the person who got crypto as an inheritance will pay up to 110% taxes, which means that you pay 10% more than what you got.You can not mix it up.If it is capital gain tax, it is it. If it is inheritance tax, it is another one. Different countries have different tax policies on different things like capital gain, inheritance.Highest and Lowest cryptocurrency tax countries.RankCountryTax rate1JapanUp to 55%2BelgiumUp to 50%3CanadaUp to 33%4United States0% - 37%5United KingdomUp to 45%6SpainUp to 47%7DenmarkUp to 52.1%8NetherlandsUp to 49.5%9South AfricaUp to 45%10IrelandUp to 40%11IsraelUp to 53%12AustriaUp to 55%13ItalyUp to 43%14NorwayUp to 22%15India30% flat tax on crypto assets + 4% cess + surcharges + 1% TDS16FranceUp to 45%",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EFS",
      "created_time": "December 24, 2024, 03:25:25 AM",
      "body": "This seems to me more like disabling something and making it practically useless, rather than banning it altogether. When you look at it, it's not forbidden to sell Bitcoin and make a profit, but the tax is so high that nobody will want to do it in that country and they will do it in different ways. In our country, the customs law has changed many times this year. Currently, when any cargo arrives from abroad, it's not possible to pass it through customs if the value of the product is over €30 including the shipping fee. In fact, they didn't completely ban shopping from abroad, but they put such an absurd limitation that this regulation is practically no different from a ban. What Japan is doing is similar to this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "December 24, 2024, 06:59:12 AM",
      "body": "Quote from: Synchronice on December 23, 2024, 08:19:47 PMI couldn't believe what I read but it's true. In Japan, if you sell a crypto, you have to pay 55% any gain you make from it but that's not the end of nightmare, that's the start and a true nightmare starts when you receive a crypto inheritance. An inheritance tax is maxed out at 55%, so, if we combine inheritance tax, income tax and local resident tax, the person who got crypto as an inheritance will pay up to 110% taxes, which means that you pay 10% more than what you got.Recently, Italy increased tax on crypto from 26% to 42%, Denmark also has up to 52% tax on crypto gains as far as I know. The world is going crazy, especially the government which thinks that we don't have a right to make profit, they want us to be enslaved to monthly salaries.Here is the source: https://www.mitrade.com/insights/news/live-news/article-3-529523-20241218Japan used to be a pro-crypto country back in 2017-2018. Now they have turned 100% anti-crypto. I hate taxes, but such high tax levels should be applied only to the rich people. Imagine having only several thousands dollars(or yen) worth of crypto and having to pay 55% or 110% over such small amount. The people with less crypto savings should pay less taxes, while the ultra-rich should pay big inheritance and capital gains taxes. I guess that the Japanese government simply wants to discourage people from owning crypto. The situation in some European countries is pretty much the same. I'm glad that I live in a European country, that isn't anti-crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fikrett",
      "created_time": "December 24, 2024, 09:11:30 AM",
      "body": "Quote from: Ziskinberg on December 23, 2024, 08:31:14 PMHmmm, interesting... since they can’t outright ban it, they slap huge taxes on it to discourage people from using it. It’s like a sin tax, similar to those on things the government considers \"not beneficial\" to us. This feels like the centralized government’s way of trying to undermine Bitcoin (decentralized) by using taxes as a tool.But do we get upset about it? Not really, because we always find ways to navigate around these taxes, knowing they’re not exactly fair. Yep.Limits are there to go through them eventually.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "December 24, 2024, 05:34:16 PM",
      "body": "Quote from: Synchronice on December 23, 2024, 08:19:47 PMI couldn't believe what I read but it's true. In Japan, if you sell a crypto, you have to pay 55% any gain you make from it but that's not the end of nightmare, that's the start and a true nightmare starts when you receive a crypto inheritance. An inheritance tax is maxed out at 55%, so, if we combine inheritance tax, income tax and local resident tax, the person who got crypto as an inheritance will pay up to 110% taxes, which means that you pay 10% more than what you got.Recently, Italy increased tax on crypto from 26% to 42%, Denmark also has up to 52% tax on crypto gains as far as I know. The world is going crazy, especially the government which thinks that we don't have a right to make profit, they want us to be enslaved to monthly salaries.Here is the source: https://www.mitrade.com/insights/news/live-news/article-3-529523-20241218Lol! That's nonsense! paying 110% tax makes no sense! It will encourage people to find ways to evade tax. As simple as that! Japan was the first country in the world to legalize cryptocurrency but it never made any impact probably because of such high taxes. Japan is known for their innovative mindset but when it comes to crypto, they have shown regressive mentality. It's hilarious and obnoxious at the same time. That's why we have never heard of any innovative ideas coming out of Japan in the field of cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitterguy28",
      "created_time": "December 24, 2024, 05:40:07 PM",
      "body": "Quote from: Synchronice on December 23, 2024, 08:19:47 PMRecently, Italy increased tax on crypto from 26% to 42%, Denmark also has up to 52% tax on crypto gains as far as I know. The world is going crazy, especially the government which thinks that we don't have a right to make profit, they want us to be enslaved to monthly salaries.they know that crypto is allowing us to make profit which is why they are taking advantage and raising the taxes as much as they could this is really crazy what reason do they even present to justify this? this is why many hide the fact that they are into crypto due to taxes this high",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "December 24, 2024, 05:53:53 PM",
      "body": "Quote from: apogio on December 23, 2024, 08:28:09 PMWhen governments set such huge tax percentages, they lead citizens to tax evasion. They know it and they willingly try to earn as much as they can from the lawful citizens, whereas they allow the rest to enjoy huge profits.It is a world wide trend it appears.  I do not know what it is that they are trying to do but it almost looks like they want to support and increase Money Laundering and Tax Evasion.  Because I would be simply stupid to even contemplate receiving -10 percent of my inheritance.  Pay the Government to receive nothing!  It is a Scam no matter how you look at it.It is obvious families will try their best to hide the inheritance or find ways to avoid the Tax.  But this seems to happen with every thing around us.  When everybody thought of Bitcoiners as Criminals, some fellow programmers put together foundations of ways to improve and have Privacy with Bitcoin.  This only led to more people hiding if anything.When they started to introduce back doors into communication software, they created an opportunity for the most private communication software to be created and released to the public.When they became so keen on supervising all and every Bank Account transfer and Card payment as if each and every one of us were born Criminals, they launched an opportunity for more people to Withdraw Cash and use it Anonymously.  This made more people hide from their system.I agree the number of people opposing the new rules and supervision is way too low however.  They probably do not care much about the few of us who care.  Numbers speak and they are likely more happy to have control over more people while a few others escape out of the radar than have little control over almost everybody.Governments are almost never there for us.  They only lie well enough for most people to think that way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "December 24, 2024, 06:02:41 PM",
      "body": "Quote from: Synchronice on December 23, 2024, 08:19:47 PMI couldn't believe what I read but it's true. In Japan, if you sell a crypto, you have to pay 55% any gain you make from it but that's not the end of nightmare, that's the start and a true nightmare starts when you receive a crypto inheritance. An inheritance tax is maxed out at 55%, so, if we combine inheritance tax, income tax and local resident tax, the person who got crypto as an inheritance will pay up to 110% taxes, which means that you pay 10% more than what you got.that's fucked up, they are basically pushing their citizens to avoid crypto. As a country that was known to be progressive towards crypto(at least as far as I know) they sure have a fucked up tax system for crypto which could deter Japanese citizens from ever trying out cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}