{
  "id": "topic_5403713",
  "title": "cryptoaddictchie",
  "author": "cryptoaddictchie",
  "created_time": "June 23, 2022, 04:50:06 AM",
  "content": "Just recently Avalanche announced their new product core wallet. Wherein users or holders of native btc can nridge their holdings to avax defi and let them experience defi ecosystem on avalanche platform.It seems the first one Ive heard on altcoin to produce something like this. Whats your thought on this? https://twitter.com/avalancheavax/status/1539639648758255617?t=LaAVinR-ErTCc_mkZICruQ&s=19",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403713",
  "comments": [
    {
      "author": "mk4",
      "created_time": "June 23, 2022, 05:13:39 AM",
      "body": "It's really no different from wallets with multi-coin support such as Exodus and Trust wallet, no? The only difference is that the Avalanche bridge is integrated in the plugin instead of manually going to the URL of the Avalanche bridge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "June 23, 2022, 06:20:13 AM",
      "body": "They are not the first altcoin DeFi project to build products around Bitcoin.Sovryn project used to reach $36 but it drops to under $1 already. The bloodbath in DeFi has yet ended and it will continue until all over leveraged DeFi projects die.Avalanche is better because they are founder of an Avax ecosystem and DeFi on Avax is one part of their ecosystem. If DeFi die (they will not because best and strongest DeFi projects will not die), Avalanche will still be fine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "June 23, 2022, 06:43:20 AM",
      "body": "Quote from: cryptoaddictchie on June 23, 2022, 04:50:06 AMWherein users or holders of native btc can nridge their holdings to avax defi and let them experience defi ecosystem on avalanche platform.~ Whats your thought on this? Instantly thought of :Is TERRA/Luna kickstarting a new Bitcoin Standard?Let's see how long this has before it goes down.Quote This enables Bitcoin holders to directly access extensive earning and yield opportunities on top DeFi protocols, while still maintaining BTC on their portfolio.Aham- extensive earnings- yield opportunities- top Defi protocols- portfolio, not control!Quote from: tranthidung on June 23, 2022, 06:20:13 AMAvalanche is better because they are founder of an Avax ecosystem and DeFi on Avax is one part of their ecosystem. If DeFi die (they will not because best and strongest DeFi projects will not die), Avalanche will still be fine.We're talking about the same coin with the same features as others that just like many others has lost 90% in 7 months, right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "June 23, 2022, 07:03:59 AM",
      "body": "Quote from: mk4 on June 23, 2022, 05:13:39 AMIt's really no different from wallets with multi-coin support such as Exodus and Trust wallet, no? The only difference is that the Avalanche bridge is integrated in the plugin instead of manually going to the URL of the Avalanche bridge.Those are wallets and their purpose is to support a lot of multichain. I guess avalanche would like to tap users from btc who wanted to explore defi using their native coin directly to an L1 project like them.Quote from: tranthidung on June 23, 2022, 06:20:13 AMThey are not the first altcoin DeFi project to build products around Bitcoin.Sovryn project used to reach $36 but it drops to under $1 already. The bloodbath in DeFi has yet ended and it will continue until all over leveraged DeFi projects die.Yes but Ive never heard of it actually. People tends to trust those established project in the top markets.Quote from: Eternad on June 23, 2022, 06:31:57 AMMaybe this is a huge step of avalanche Bitcoin holder but this is not new at all because there is no way a native Bitcoin directly interact on different blockchain without wrapping it.From what Ive heard though I havent tried it out yet. They said native bitcoin, means its not wrapped bitcoin. How cant? They already rolled it.Quote from: stompix on June 23, 2022, 06:43:20 AM- extensive earnings- yield opportunities- top Defi protocols- portfolio, not control!Thats right. Some people who owns btc are probably looking for a good project where they can park their holdings while waiting and clearly defi is the place for that. Yes its not perfect and quite risky, but at least this are giving true earning which isnt bad at all. As an altcoin maxi, Id rather used those parked coin to earn something in staking or defi that has a good privileges. Avax isnt bad considering its one of those top defi project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "June 23, 2022, 08:12:13 AM",
      "body": "Personally, I see that trying to drag Bitcoin to POS and get about 7% of the profits without making any effort are attempts that will harm Bitcoin and society as a whole,What happens with these people? Aren't bitcoin's fluctuations severe and enough to make a good profit if you can get in and out at the right time?In general, whatever their model is, you will find that it is central to a point, so I hope that it is not defective or carries a loophole that is easy to discover.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "June 23, 2022, 10:44:49 AM",
      "body": "Quote from: cryptoaddictchie on June 23, 2022, 07:03:59 AM-snip-They said native bitcoin, means its not wrapped bitcoin. How cant? They already rolled it.No, it's a wrapped token. Maybe what they mean is that only native bitcoins can be bridged (not other wrapped bitcoin tokens).The only real Bitcoins are those that run on the bitcoin blockchain, while they clearly say embed the Intel SGX app (a kind of \"cross-chain\" bridge app)Quote from: https://medium.com/avalancheavax/avalanche-bridge-adds-native-bitcoin-support-6306236fb506With this new BTC Bridge, there is also a new Intel SGX (Software Guard Extension) application designed to support cross-chain Bitcoin transfers,and in their video it's clear that there is a swapping process into bitcoin wrapped (on avalanche network and then it's called \"BTC.b\").",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "June 23, 2022, 11:34:52 AM",
      "body": "I watched the video, but did not understand who is the guarantor of the exchange of BTC.b for bitcoin back?Where are the statistics of burning wrapped bitcoins and the number of bitcoins that are locked in the defi avalanche ecosystem? Who will compensate for the losses if BTC.b costs less than Bitcoin?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "June 23, 2022, 01:15:00 PM",
      "body": "Quote from: Eternad on June 23, 2022, 01:10:55 PMCan you give the exact details proving that they don't have the wrapping process? This will be really interesting.From what I understand on their process is that anyone can send their native bitcoin on the bridge, hence making it btc.b which of course changed it to avax supported chain, but the equivalent of the btc.b is equally on the native bitcoin. Not sure if its called wrapping since eth that being wrapped is called weth, but they run on the same network, but for this one is like you are migrating it on the avalanche network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "June 23, 2022, 02:19:31 PM",
      "body": "Quote from: zasad@ on June 23, 2022, 11:34:52 AMI watched the video, but did not understand who is the guarantor of the exchange of BTC.b for bitcoin back?Where are the statistics of burning wrapped bitcoins and the number of bitcoins that are locked in the defi avalanche ecosystem?It seems the whole bridge was developed by Ava Labs, and the main Core Extension wallet also developed by them. So, surely they have the full control.Quote from: zasad@ on June 23, 2022, 11:34:52 AMWhere are the statistics of burning wrapped bitcoins and the number of bitcoins that are locked in the defi avalanche ecosystem?I neither couldn't find any. I guess they haven't made it up yet? If you take a look at the Avax support page, the only information that listed is their Bitcoin and Avalanche bridge addresses.Quote from: https://support.avax.network/en/articles/6325230-btc-avalanche-bridge-ab-faqWhat is the Bridge's address on Bitcoin and Avalanche?​Bridge Addresses:    Bitcoin:bc1q2f0tczgrukdxjrhhadpft2fehzpcrwrz549u90    Avalanche:0xF5163f69F97B221d50347Dd79382F11c6401f1a1",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "June 23, 2022, 04:41:21 PM",
      "body": "Avalance sure knows how to time its market.  Currently, with the announcement, the market of Avalanche goes up to 7.4% article from Coindest says.  Indeed it looks promising but I am still concerned about the funds deposited on that DEFI.   We all know that DEFI had security issues that causes other DEFI to lose millions of dollars due to hacking incidents.  I wonder how to prepare the Avalanche team on preventing this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "June 24, 2022, 03:20:54 AM",
      "body": "Quote from: serjent05 on June 23, 2022, 04:41:21 PMIndeed it looks promising but I am still concerned about the funds deposited on that DEFI.   We all know that DEFI had security issues that causes other DEFI to lose millions of dollars due to hacking incidents.  I wonder how to prepare the Avalanche team on preventing this. Surely everyone are worried especially investors. But as far as I knew, avalanche never had any record of hacked or compromised network due to illegal hackers and thieves, such as what happened to elrond, solana, matic and recently harmony.Defi has its own cons but surely ava labs are prepared for this or else they will just crumble like other platform such as Luna.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}