{
  "id": "topic_5458947",
  "title": "CryptoHFs",
  "author": "CryptoHFs",
  "created_time": "July 07, 2023, 09:54:31 AM",
  "content": "قبل فتره ليست بالبعيده كنت أبحث عن طريقه التوقيع من عنوان بيتكوين عبر الهاتف ولم أجد اي شروحات واضحه علي الانترنت حتي ارغمت علي كشف الكلمات الاثن عشر علي بعض مواقع الانترنت لترجمتها لبرايفت كي ثم استخدامه بموقع ويب ايضا للتوقيع وفشل الأمر ويأست ان اتمكن من التوقيع عبر الهاتف وبعد النشر هنا بالانجليزيه أخبرني احد الاعضاء عن محفظه bluewallet وبالفعل قمت بتحميل المحفظه وإدخال الاثن عشر كلمه بها لتفعيل محفظه قديمه من تراست والت وبالفعل تمكنت المحفظه من إيجاد عنواني ثم اضغط نقره طويله علي العنوان المراد التوقيع منه ستجد اختيار التوقيع او تأكيد توقيع قم بالضغط وتمم العمليه.. لذلك ارشح لكم محفظه بلو والت للتوقيع من الهاتف ومن مميزاتها أيضا ان يوجد بها multi sig و lightenspeed.. مشكله المحفظه انها بطيئه نوعا ما ولكن خدماتها قويهشكرا",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458947",
  "comments": [
    {
      "author": "yhiaali3",
      "created_time": "July 07, 2023, 03:50:35 PM",
      "body": "شكرا لك أخي. لم استخدم محفظة bluewallet على الموبايل للتوقيع لكنني استخدمتها لتجربة شبكة البرق. محفظة bluewallet من المحفظات الجميلة و القديمة نوعا وقد كانت من أوائل المحفظة  التي تدعم شبكة البرق على ما أعتقد وقد قمت بكتابة شرح عنها منذ عدة سنوات في القسم العربي هذا هو الرابط: https://bitcointalk.org/index.php?topic=5203294.0لكن الآن حسبما سمعت مؤخرا أنها تخلت عن دعم شبكة البرق.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHFs",
      "created_time": "July 07, 2023, 03:52:51 PM",
      "body": "Quote from: yhiaali3 on July 07, 2023, 03:50:35 PMشكرا لك أخي. لم استخدم محفظة bluewallet على الموبايل للتوقيع لكنني استخدمتها لتجربة شبكة البرق. محفظة bluewallet من المحفظات الجميلة و القديمة نوعا وقد كانت من أوائل المحفظة  التي تدعم شبكة البرق على ما أعتقد وقد قمت بكتابة شرح عنها منذ عدة سنوات في القسم العربي هذا هو الرابط: https://bitcointalk.org/index.php?topic=5203294.0لكن الآن حسبما سمعت مؤخرا أنها تخلت عن دعم شبكة البرق. عند تحميل الابلكيشن اجد bitcoin, lightening speed, vault لم اجرب شبكه البرق عليها لكنها مازالت بالتطبيق",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "July 07, 2023, 03:57:48 PM",
      "body": "Quote from: CryptoHFs on July 07, 2023, 03:52:51 PMعند تحميل الابلكيشن اجد bitcoin, lightening speed, vault لم اجرب شبكه البرق عليها لكنها مازالت بالتطبيقصراحة أنا لم استخدمها منذ زمن، لكن سمعت أنهم بصدد إيقاف خدمات شبكة البرق لا أذكر أين سمعت الخبر بالضبط ربما هنا في المنتدى أو في مكان آخر. سأحاول العثور على رابط الخبر، لكن بكل الأحوال إن كانوا لايزالون يدعمون شبكة البرق فهذا جيد جدا لأن المحفظة موثوقة جدا وسهلة الاستخدام وفيها ميزات كثيرة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "July 07, 2023, 07:30:28 PM",
      "body": "Quote from: yhiaali3 on July 07, 2023, 03:57:48 PMصراحة أنا لم استخدمها منذ زمن، لكن سمعت أنهم بصدد إيقاف خدمات شبكة البرق لا أذكر أين سمعت الخبر بالضبط ربما هنا في المنتدى أو في مكان آخر. نعم أخي يحيي كنت قد قمت بانشاء موضوع في السابق حول هذا الموضوع، شبكة البرق مازالت مدعومة لكن أصبحت non-custodial علا عكس ما كانت عليه من قبل[1]أعتقد أن محفظة Wallet of Satoshi هي بديل جيد لها (لمن يريد لا يريد الخوض في التفاصيل التقنية)[1] https://bitcointalk.org/index.php?topic=5441146.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHFs",
      "created_time": "July 07, 2023, 07:40:44 PM",
      "body": "Quote from: OmegaStarScream on July 07, 2023, 07:30:28 PMQuote from: yhiaali3 on July 07, 2023, 03:57:48 PMصراحة أنا لم استخدمها منذ زمن، لكن سمعت أنهم بصدد إيقاف خدمات شبكة البرق لا أذكر أين سمعت الخبر بالضبط ربما هنا في المنتدى أو في مكان آخر. نعم أخي يحيي كنت قد قمت بانشاء موضوع في السابق حول هذا الموضوع، شبكة البرق مازالت مدعومة لكن أصبحت non-custodial علا عكس ما كانت عليه من قبل[1]أعتقد أن محفظة Wallet of Satoshi هي بديل جيد لها (لمن يريد لا يريد الخوض في التفاصيل التقنية)[1] https://bitcointalk.org/index.php?topic=5441146.0من الواضح أن هنالك مواضيع كثيره تخص البلووالت بالقسم العربي لكني لم ابحث جيدااعتقد ان الnon cus افضل لان لا يكون لهم تحكم عليها صحيح ؟وهل ما تقصد انهم يستطيعون التحكم بارصده bitcoin + vault?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}