{
  "id": "topic_5413562",
  "title": "l3pox",
  "author": "l3pox",
  "created_time": "September 14, 2022, 02:46:03 PM",
  "content": "Quadratic funding parece nome de seita, né?Mas não éé uma forma de financiamento de bens públicos em que ao doar para uma área, várias recebemimagine que você escolhe uma ONG social para fazer uma doação e aí sua doação entra numa pool que contempla não só a ONG social mas uma relacionada ao meio-ambiente, outra à educação e outra ao meio-ambienteo gitcoin opera por aí e já movimentou milhões de dólares em doaçõesO site é aberto e qualquer pessoa pode listar seu projeto para receber doações também (não sei exatamente como o processo funciona mas algumas vezes além de instituições maiores também vemos podcasts e criadores de conteúdo no gitcoin)Eu nunca tinha pensado na infraestrutura pública online como um bem público, mas o google maps por exemplo, apesar de ser de uma empresa privada e de toda a questão de coleta de dados, é uma infraestrutura pública absurda, e completamente online.O que me abriu os olhos para entender sites e projetos open source (não o google maps) como bens públicos foi a Nouns Prop house mais especificamente a proposal 105 no Nouns DaoAcho que isso vale um tópico por si só além disso também dá pra usar esse modelo para votaçõesmas acho que isso também é um assunto legal para outro tópico hahahaLançando aqui pq talvez essa seja a maior esperança para um futuro Solarpunk.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413562",
  "comments": [
    {
      "author": "TryNinja",
      "created_time": "September 14, 2022, 04:25:12 PM",
      "body": "Gosto muito da Gitcoin por conta do matching de doações que esse QF (Quadratic Funding) causa, acho que faltou evidenciar como isso acontece na prática.Por exemplo: o pessoal que desenvolve a Vyper, uma linguagem de programação parecida com o Python que é utilizada em smartcontracts, tem um grant que recebeu $311 de 52 contribuidores na atual rodada de doações... e esses $311 se ransformaram em outros $3963 através do QF ($311 -> $4274 ... 13x de matchin): https://gitcoin.co/grants/200/vyper-smart-contract-languageIsso é algo parecido com aquela ideia que certas empresas fazem no ramo da filantropia onde \"para cada $1 doado, nós doaremos outro $1\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 14, 2022, 10:05:54 PM",
      "body": "Então isso quer dizer que com o financiamento QF, se eu doar para o 100$ para um projeto, esse valor é devido percentualmente entre outros projetos ativos para financiamento?  Ou entendi mal?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "September 14, 2022, 10:59:08 PM",
      "body": "Quote from: joker_josue on September 14, 2022, 10:05:54 PMEntão isso quer dizer que com o financiamento QF, se eu doar para o 100$ para um projeto, esse valor é devido percentualmente entre outros projetos ativos para financiamento?  Ou entendi mal?1 usuário doa $100 para o projeto X (total de $100)10 usuários doam $10 para o projeto Y (total de $100)No final do round, o projeto X consegue $10 em matching e o projeto Y recebe $190 em matching.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "September 15, 2022, 01:14:19 AM",
      "body": "Quote from: TryNinja on September 14, 2022, 10:59:08 PMQuote from: joker_josue on September 14, 2022, 10:05:54 PMEntão isso quer dizer que com o financiamento QF, se eu doar para o 100$ para um projeto, esse valor é devido percentualmente entre outros projetos ativos para financiamento?  Ou entendi mal?1 usuário doa $100 para o projeto X (total de $100)10 usuários doam $10 para o projeto Y (total de $100)No final do round, o projeto X consegue $10 em matching e o projeto Y recebe $190 em matching.A ideia é bacana, pois muitas vezes vemos ONGs/Projetos recebendo muito dinheiro enquanto outros tão bons acabam não conseguindo o mínimo para se sustentarem.Eu só acho que essa distribuição deveria ser feita dentro de áreas pré-determinadas, tipo... eu quero doar dinheiro para uma causa ambiental e mais da metade dele acaba indo para a pesquisa espacial, ou sei lá o que. Mas caso já tenha algo nesse sentido, ent!ao esquece o que eu escrevi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 15, 2022, 08:37:27 AM",
      "body": "Quote from: TryNinja on September 14, 2022, 10:59:08 PMNo final do round, o projeto X consegue $10 em matching e o projeto Y recebe $190 em matching.Quote from: alegotardo on September 15, 2022, 01:14:19 AMEu só acho que essa distribuição deveria ser feita dentro de áreas pré-determinadas, tipo... eu quero doar dinheiro para uma causa ambiental e mais da metade dele acaba indo para a pesquisa espacial, ou sei lá o que. Mas caso já tenha algo nesse sentido, ent!ao esquece o que eu escrevi.Pois é! Eu posso gostar de ajudar um determinado projeto/área, e não querer que o meu dinheiro seja usado noutra área.Outro problema que vejo aqui, é o facto de eu pegar em 100$ e fazer 20 transações anonimas para o meu projeto e depois com esse tipo de distribuição receber 10x mais. Ou seja, consigo influenciar o resultado.Agora, caso já existe algo para evitar isso... sigo o @alegotardo, esquece o que eu esrevi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "September 15, 2022, 06:01:41 PM",
      "body": "Aproveito o post pra deixar aqui o link/ descrição de alguns projetos brasileiros que sei que estão nesse round do Gitcoin, pra caso vocês tenham curiosidade em conhecer e apoiar.BlackLeadersDAO - incentivo a nova geração de líderes negros na web3https://gitcoin.co/grants/6546/blackleadersdao-advancing-the-next-generation-of-AgroforestDAOhttps://gitcoin.co/grants/5510/agroforestdaoEthercast Brasil - Hub Latam de conteúdo focado exclusivamente ao ecossistema do Ethereumhttps://gitcoin.co/grants/7125/ethercast-brasil-the-first-and-only-media-hub-in- Cambiatus- organização focada no treinado de empreendedores em diversos países e diversos setoreshttps://gitcoin.co/grants/7379/cambiatus-new-organizations-for-the-planet-regeneImpacta FinanceHub para soluções de impacto na web3https://gitcoin.co/grants/7338/impacta-finance-scaling-web3-impact-initiatives",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "September 15, 2022, 06:06:50 PM",
      "body": "Quote from: joker_josue on September 15, 2022, 08:37:27 AMOutro problema que vejo aqui, é o facto de eu pegar em 100$ e fazer 20 transações anonimas para o meu projeto e depois com esse tipo de distribuição receber 10x mais. Ou seja, consigo influenciar o resultado.Veja a seção de vetores de ataque: How to Attack and Defend Quadratic Fundingi.e:QuoteTo mitigate the sybil attack vector, which is about creating fake accounts to fish matching grants, Gitcoin does currently uses Sybil detection algorithms (assigning users a Sybil Score), as well as incentivizing user identity verification on a number of different platforms (notably including BrightID, POAP, and 3box), offering increased grant matching for each layer added.QuoteWhile creating fake accounts to attract matching funds can be prevented by sybil resistant design, colluders can easily up their game by coordinating a group of real accounts to “mine Gitcoin matching funds” and split the “interest” among the group.o mitigate the collusion attack vector, Gitcoin adopted a new ‘Pairwise Funding’ mechanism, as proposed by Vitalik. The basic idea is to reduce matching for grants that seem highly coordinated in contributors donating to the same pool of grants. If two donors (a pair) donate to a set of similar grants, then the matching fund for that grant will be discounted by a certain amount.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 15, 2022, 11:39:18 PM",
      "body": "Quote from: TryNinja on September 15, 2022, 06:06:50 PMVeja a seção de vetores de ataque: How to Attack and Defend Quadratic FundingSão medidas interessantes, que podem minimizar situações que eu mencionei.Mesmo assim, acho que é um modelo fácil de manipular, no sentido que posso conseguir obter muitas doações pequenas e no final obter um grande valor doado. Em detrimento de outro projeto que teve grandes doações, mas menos gente apoiar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "September 16, 2022, 12:22:51 AM",
      "body": "Quote from: joker_josue on September 15, 2022, 11:39:18 PMMesmo assim, acho que é um modelo fácil de manipular, no sentido que posso conseguir obter muitas doações pequenas e no final obter um grande valor doado. Em detrimento de outro projeto que teve grandes doações, mas menos gente apoiar.Mas esse é o sentido do modelo... Se mais pessoas preferem doar a um projeto, isso teoricamente significa que ele tem mais importancia e merece receber mais do que quem ganha o mesmo valor de uma só pessoa. Eu mesmo não conhecia bem o modelo, mas entendo a sua existência que foca em um modelo mais democrático.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "September 16, 2022, 10:37:28 AM",
      "body": "Quote from: joker_josue on September 15, 2022, 11:39:18 PMQuote from: TryNinja on September 15, 2022, 06:06:50 PMVeja a seção de vetores de ataque: How to Attack and Defend Quadratic FundingSão medidas interessantes, que podem minimizar situações que eu mencionei.Mesmo assim, acho que é um modelo fácil de manipular, no sentido que posso conseguir obter muitas doações pequenas e no final obter um grande valor doado. Em detrimento de outro projeto que teve grandes doações, mas menos gente apoiar.Na prática, a \"manipulação\" que eu vi em outros rounds é na verdade uma união entre os empreendedores que estão no round. É bem comum eles trocarem o $1. Tipo, me envia que eu te envio  outro em troca e nós dois nos beneficiamos disso. Não sei se você considera isso uma manipulação ou não e ruim ou não. Mas na prática, foi a única coisa que eu vi rolar nos últimos rounds. Mas claro que é uma experiências única e específica.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 16, 2022, 02:12:13 PM",
      "body": "Quote from: TryNinja on September 16, 2022, 12:22:51 AMMas esse é o sentido do modelo... Se mais pessoas preferem doar a um projeto, isso teoricamente significa que ele tem mais importancia e merece receber mais do que quem ganha o mesmo valor de uma só pessoa. Eu mesmo não conhecia bem o modelo, mas entendo a sua existência que foca em um modelo mais democrático.Quote from: Disruptivas on September 16, 2022, 10:37:28 AMNa prática, a \"manipulação\" que eu vi em outros rounds é na verdade uma união entre os empreendedores que estão no round. É bem comum eles trocarem o $1. Tipo, me envia que eu te envio  outro em troca e nós dois nos beneficiamos disso. Não sei se você considera isso uma manipulação ou não e ruim ou não. Mas na prática, foi a única coisa que eu vi rolar nos últimos rounds. Mas claro que é uma experiências única e específica. Esse é um tipo de \"manipulação\" até saudável, em que todos se ajudam uns aos outros.Mas, imagina:Eu criou um projeto, que até pode não ser nada de especial. Mas chegou aqui a comunidade, e proponho dar 2$ a quem oferecer 1$ ao meu projeto. Vão lá 10 ou 20 ou 100 pessoas doar 1$. Eu gasto 200$ e depois ganho 500$ de financiamento, para um projeto que não é nada de especial. E isso pode motivar a retirada de investimento a projetos realmente bons.Se calhar até estou a ser muito básico no esquema, mas existe malta com grandes esquemas ainda melhores do que este.Como a plataforma consegue controlar isto?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "September 16, 2022, 11:59:45 PM",
      "body": "Quote from: joker_josue on September 16, 2022, 02:12:13 PMMas, imagina:Eu criou um projeto, que até pode não ser nada de especial. Mas chegou aqui a comunidade, e proponho dar 2$ a quem oferecer 1$ ao meu projeto. Vão lá 10 ou 20 ou 100 pessoas doar 1$. Eu gasto 200$ e depois ganho 500$ de financiamento, para um projeto que não é nada de especial. E isso pode motivar a retirada de investimento a projetos realmente bons.Se calhar até estou a ser muito básico no esquema, mas existe malta com grandes esquemas ainda melhores do que este.Como a plataforma consegue controlar isto?Realmente não sei se isso acontece e se é um problema. Fico imaginando se alguém faria isso, sabe? A recompensa não seria nem tão grande pelo esforço. E é quase como se a pessoa que fizer 100 pessoas realmente doar 1$, está atingindo o objetivo da plataforma. Por que pensa comigo, quem JÁ conhece, imagino que tenha mais incentivo pra usar correto, doar para as iniciativas sérias do que seguir esse esquema. E convencer 100 pessoas a usar o mecanismo é um puta trablho, de forma que se esse usuário ''malangro'' conseguiu o onbording dessas pessoas, ele já merece ganhar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 17, 2022, 12:01:24 PM",
      "body": "Quote from: Disruptivas on September 16, 2022, 11:59:45 PMRealmente não sei se isso acontece e se é um problema. Fico imaginando se alguém faria isso, sabe? A recompensa não seria nem tão grande pelo esforço. E é quase como se a pessoa que fizer 100 pessoas realmente doar 1$, está atingindo o objetivo da plataforma. Por que pensa comigo, quem JÁ conhece, imagino que tenha mais incentivo pra usar correto, doar para as iniciativas sérias do que seguir esse esquema. E convencer 100 pessoas a usar o mecanismo é um puta trablho, de forma que se esse usuário ''malangro'' conseguiu o onbording dessas pessoas, ele já merece ganhar. Eu diria que nem é assim tão difícil assim, em alguns cenários.Malta com muitos seguidores nas redes sociais, conseguia isso com facilidade. E essas pessoas nem estava realmente onbording no projeto, só \"doavam\" porque recebiam algo em troca.Não estou a dizer que isto já aconteceu ou que vai acontecer, nem que seja algo compensatório. Apenas, eu que não sou uma pessoa desses esquemas manhosos, consigo criar um plano para obter vantagem, acredito que existe por ai muita malta que conseguiria abusar do sistema.Agora, talvez o sistema tenha ferramentas de combate a este tipo de situação, que eu desconheço por nunca ter usado.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "September 17, 2022, 03:21:52 PM",
      "body": "Quote from: joker_josue on September 17, 2022, 12:01:24 PMEu diria que nem é assim tão difícil assim, em alguns cenários.Malta com muitos seguidores nas redes sociais, conseguia isso com facilidade. E essas pessoas nem estava realmente onbording no projeto, só \"doavam\" porque recebiam algo em troca.Não estou a dizer que isto já aconteceu ou que vai acontecer, nem que seja algo compensatório. Apenas, eu que não sou uma pessoa desses esquemas manhosos, consigo criar um plano para obter vantagem, acredito que existe por ai muita malta que conseguiria abusar do sistema.Agora, talvez o sistema tenha ferramentas de combate a este tipo de situação, que eu desconheço por nunca ter usado.Vamos elaborando os cenários! Imagina que você tenha muitos seguidores e facilmente conseguiria manipulá-los. Como disse essa semana uma amiga que é dona de uma agencia de marketing de influencers pra web3, ''os influencers são os ativos do futuro''. Se você tem uma base super grande, que sem dúvida construiu com trabalho, muitas horas dedicadas e isso é o seu job full time, você comprometeria sua base, chamando-a pra um ''esquema'' de ganho fácil? No final, a reputação dos influencers é algo super caro e que eles precisam preservar de um jeito do outro, não acho que eles usem os 'influenciados'' dessa forma, porque no longo prazo eles perdem muito mais do que ganham.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 17, 2022, 04:24:02 PM",
      "body": "Quote from: Disruptivas on September 17, 2022, 03:21:52 PMVamos elaborando os cenários! Imagina que você tenha muitos seguidores e facilmente conseguiria manipulá-los. Como disse essa semana uma amiga que é dona de uma agencia de marketing de influencers pra web3, ''os influencers são os ativos do futuro''. Se você tem uma base super grande, que sem dúvida construiu com trabalho, muitas horas dedicadas e isso é o seu job full time, você comprometeria sua base, chamando-a pra um ''esquema'' de ganho fácil? Eu não estou a dizer que é esquema para ganho fácil. E claro que estamos só a montar cenários.Imagina o youtuber pedir para a comunidade contribuir com 1$, para conseguir comprar um Tesla, prometendo fazer vários vídeos sobre o carro. De repente ele tem 5k ou 10k pessoas a doar. Entretanto noutros projetos, realmente relevantes para a sociedade, tens apenas umas dezenas de pessoas a darem 1k ou 2k para o projeto. No final, o youtuber consegue ganhar muito mais dinheiro, do que esses projetos relevantes.Acho a @Disruptivas, daria 1k para um projeto de instalar painéis solares em aldeias em Africa. Mas não iria gostar, de que desses 1k, 200 iriam para um youtuber andar a passear de carro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "September 17, 2022, 06:32:23 PM",
      "body": "Quote from: joker_josue on September 17, 2022, 04:24:02 PMImagina o youtuber pedir para a comunidade contribuir com 1$, para conseguir comprar um Tesla, prometendo fazer vários vídeos sobre o carro. De repente ele tem 5k ou 10k pessoas a doar. Entretanto noutros projetos, realmente relevantes para a sociedade, tens apenas umas dezenas de pessoas a darem 1k ou 2k para o projeto. No final, o youtuber consegue ganhar muito mais dinheiro, do que esses projetos relevantes.Nesse caso eu não vejo sentido em se utilizar o Quadratic Funding. Os grants do gitcoin utilizam o QF porque faz sentido. Eles todos focam no desenvolvimento do web3 e tem seus méritos, tanto que o último round tem categorias bem definidas: soluções climaticas, eth infra, aurora (chain), polygon (chain), ens, zk tech, etc...Quote from: joker_josue on September 17, 2022, 04:24:02 PMAcho a @Disruptivas, daria 1k para um projeto de instalar painéis solares em aldeias em Africa. Mas não iria gostar, de que desses 1k, 200 iriam para um youtuber andar a passear de carro.   Acho que você não entendeu. Os $1k ficam para o projeto original. O que muda é o valor do matching.https://en.wikipedia.org/wiki/Matching_fundsA @Disruptivas doa $1k para o projeto de paineis sólares e um fundo do gitcoin contribui para o mesmo projeto com o matching relativo ao resultado do QF.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 18, 2022, 07:25:36 AM",
      "body": "Quote from: TryNinja on September 17, 2022, 06:32:23 PMAcho que você não entendeu. Os $1k ficam para o projeto original. O que muda é o valor do matching.https://en.wikipedia.org/wiki/Matching_fundsA @Disruptivas doa $1k para o projeto de paineis sólares e um fundo do gitcoin contribui para o mesmo projeto com o matching relativo ao resultado do QF.AH!Pois essa parte não tinha entendido, e dai analise que estava a ter.Portanto, o dinheiro é que dividido pelos projetos é o dinheiro do fundo e não o dinheiro que é doado diretamente pelas pessoas. Assim já faz mais sentido.O dinheiro desse fundo veem da onde? Donativos para a gitcoin? Investidores?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "September 20, 2022, 10:17:54 AM",
      "body": "Quote from: Lucasgabd on September 14, 2022, 02:46:03 PMEu nunca tinha pensado na infraestrutura pública online como um bem público, mas o google maps por exemplo, apesar de ser de uma empresa privada e de toda a questão de coleta de dados, é uma infraestrutura pública absurda, e completamente online.O que me abriu os olhos para entender sites e projetos open source (não o google maps) como bens públicos foi a Nouns Prop house mais especificamente a proposal 105 no Nouns DaoAcho que isso vale um tópico por si só O Google mapas realmente é algo muito próximo de um bem público. Infelizmente é privado. Apesar do Google mapas ter sido construído com dados de milhões de pessoas, esse dado é todo privado hoje em dia. Triste. Espero q um dia isso se torne público. Eu acho q nesse caso uma regulamentação pode ser necessária m breve.  Quem consegue viajar hoje sem um Google mapas?Agora  o bitcoin é de fato um bem público, não vejo uma definição melhor. Ngm é dono , e toda a infraestrutura foi construída e é mantida por todos. Vou te faalr que hoje mesmo o bitcoin me salvou numa viagem. O sistema bancário me deixou uns 3 dias na mão com prazos loucos em dias úteis, e consegui pegar o dinheiro em menos de 1h com o bitcoin. Vendendo uma exchange gringa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "September 20, 2022, 05:01:24 PM",
      "body": "Quote from: joker_josue on September 18, 2022, 07:25:36 AMO dinheiro desse fundo veem da onde? Donativos para a gitcoin? Investidores?Sim.Individuais: https://gitcoin.co/grants/12/gitcoin-grants-official-matching-pool-fundE empresas/projetos que querem incentivar o desenvolvimento, principalmente focado no seu ecossistema (i.e pessoal do Polygon dando $100k DAI em um round para projetos relacionados ao seu ecossistema): https://gitcoin.notion.site/GR15-Gitcoin-Grant-Eligibility-Briefs-7949392eb2684ea6ae9072cad7fff277QuoteEcosystem Rounds -> Polygon[...] The Grant must be in support of, or directly advancing, the Polygon ecosystem",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}