{
  "id": "topic_5434478",
  "title": "Marykeller",
  "author": "Marykeller",
  "created_time": "January 12, 2023, 02:04:41 PM",
  "content": "In recent years, it has become increasingly popular among the world's billionaires to use their enormous money to fund their quest for immortality. These millionaires are dedicated to finding a method to live forever and are investing in cutting-edge biotech firms and sponsoring cryonics and life extension research.Elon Musk, a tech magnate and businessman, is one of the most prominent individuals in this movement. Musk has publicly expressed his wish to live forever and has made significant investments in businesses conducting longevity research, including a $10 million investment in Unity Biotechnology, a biotech company focused on extending life. Additionally, he has made it known that he thinks technology, such as brain-computer interfacing, holds the key to immortality.Link to information: https://www.dailystar.co.uk/news/latest-news/experts-fear-billionaires-like-elon-28895939?utm_source=facebook.com&utm_medium=social&utm_campaign=star_main Do you agree with these efforts by the richest persons in the world to become immortal? What are the benefits and drawbacks of it if it actually occurs, given that the richest men in the world are currently making more efforts to have it happen? Elon Musk, Jeff Bezos, Larry Page, and Sergey Brin,",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434478",
  "comments": [
    {
      "author": "BADecker",
      "created_time": "January 12, 2023, 02:53:26 PM",
      "body": "Won't work. Requirements for everlasting life are too complex. After all, science has barely begun to accept the idea that there is a soul and spirit. Even if the physical body has been kept alive forever, will the connection between it and the soul/spirit always remain, as well? We are far from understanding things like this, and they may not even be something we can understand.Besides, when the connections are weakened, there are evil spirits that want to get in and take over both body and soul, right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "January 12, 2023, 04:27:34 PM",
      "body": "Quote from: Marykeller on January 12, 2023, 02:04:41 PM-cut-Do you agree with these efforts by the richest persons in the world to become immortal? What are the benefits and drawbacks of it if it actually occurs, given that the richest men in the world are currently making more efforts to have it happen? Elon Musk, Jeff Bezos, Larry Page, and Sergey Brin,I don't have to form opinion about it. Of course they are going to try to lengthen their life cycle. I would too. I am just doing it by eating healthy taking care of my mental and physical health. Benefits of immorality would include not dying, and if you get nasty diseases that would be also the drawback of it along watching all your loved ones die.Quote from: BADecker on January 12, 2023, 02:53:26 PM-cut-After all, science has barely begun to accept the idea that there is a soul and spirit. Even if the physical body has been kept alive forever, will the connection between it and the soul/spirit always remain, as well? We are far from understanding things like this, and they may not even be something we can understand.Besides, when the connections are weakened, there are evil spirits that want to get in and take over both body and soul, right?Wrong. Science doesn't acknowledge the existence of soul or spirit. Even the religious circles can debate on the definition of the concept and everyone in those circles seem to have their own views. Maybe some mentally deranged scientists do believe on that but their research on proving something so vague wouldn't hold any water.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "January 12, 2023, 05:02:49 PM",
      "body": "Quote from: o48o on January 12, 2023, 04:27:34 PM...Quote from: BADecker on January 12, 2023, 02:53:26 PM-cut-After all, science has barely begun to accept the idea that there is a soul and spirit. Even if the physical body has been kept alive forever, will the connection between it and the soul/spirit always remain, as well? We are far from understanding things like this, and they may not even be something we can understand.Besides, when the connections are weakened, there are evil spirits that want to get in and take over both body and soul, right?Wrong. Science doesn't acknowledge the existence of soul or spirit. Even the religious circles can debate on the definition of the concept and everyone in those circles seem to have their own views. Maybe some mentally deranged scientists do believe on that but their research on proving something so vague wouldn't hold any water.Much of what you say is based on your own wishes rather than scientific experimentation. That being said, since it's very difficult to scrutinize the unscrutable, there isn't very much factual info, yet... except for the very fact of personal identity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "January 12, 2023, 05:16:31 PM",
      "body": "Quote from: Marykeller on January 12, 2023, 02:04:41 PMDo you agree with these efforts by the richest persons in the world to become immortal? What are the benefits and drawbacks of it if it actually occurs, given that the richest men in the world are currently making more efforts to have it happen? Elon Musk, Jeff Bezos, Larry Page, and Sergey Brin,You would not blame them for trying, if you had as much money, resources and influence as they do, you may also fancy the idea of immortality. I wish that these billionaires can have another look at what immortality really means. Apart from what we know that it means never dying, someone can also be immortalized by their creations, innovations and brilliant life changing ideas, and some of these billionaires have already done that. If you look at Elon Musk for instance, due to his creations, he will be talked about for a very long time even after his death, just like we still hear the names of some other great men who have lived in the past.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "January 12, 2023, 05:44:15 PM",
      "body": "Quote from: Queentoshi on January 12, 2023, 05:16:31 PMQuote from: Marykeller on January 12, 2023, 02:04:41 PMDo you agree with these efforts by the richest persons in the world to become immortal? What are the benefits and drawbacks of it if it actually occurs, given that the richest men in the world are currently making more efforts to have it happen? Elon Musk, Jeff Bezos, Larry Page, and Sergey Brin,You would not blame them for trying, if you had as much money, resources and influence as they do, you may also fancy the idea of immortality. I wish that these billionaires can have another look at what immortality really means. Apart from what we know that it means never dying, someone can also be immortalized by their creations, innovations and brilliant life changing ideas, and some of these billionaires have already done that. If you look at Elon Musk for instance, due to his creations, he will be talked about for a very long time even after his death, just like we still hear the names of some other great men who have lived in the past.Of course, if he is smart, he will find a way to stay alive for hundreds of years. He won't tell anyone, but will simply fade out of public life, making it look like he died somewhere along the line.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "January 12, 2023, 07:44:04 PM",
      "body": "Who would want to be immortal? That’s some dumb shit young people would think is cool. Wait til you start aging and see all the pains and shit you have to deal with. It’s the folks who die young before they are forced to compromise who they are to conform to society that are the ones we should be jealous of. Imagine how awful life would be at 120 years old. No thanks…",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "January 12, 2023, 10:31:25 PM",
      "body": "Quote from: BADecker on January 12, 2023, 02:53:26 PMWon't work. Requirements for everlasting life are too complex. After all, science has barely begun to accept the idea that there is a soul and spirit. Even if the physical body has been kept alive forever, will the connection between it and the soul/spirit always remain, as well? We are far from understanding things like this, and they may not even be something we can understand.Besides, when the connections are weakened, there are evil spirits that want to get in and take over both body and soul, right?They might try to keep thier bodies immortal but it would be difficult to keep the brain and soul alive. Each time science try to make advancement that would make them equal with God, they keep on facing some unsurmountable obstacles that points them to the fact that there is a Creator. One of the advantages of this quest for immortality is that it would advance the frontier of the scientific and health field because these billionaires would invest money to fund researches. And these discoveries would not only benefit them, but the common men on the streets would also benefit from it. I don't think anyone would achive the feat of unveiling the mystery of life and death.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "January 12, 2023, 10:42:28 PM",
      "body": "Quote from: Zlantann on January 12, 2023, 10:31:25 PMQuote from: BADecker on January 12, 2023, 02:53:26 PMWon't work. Requirements for everlasting life are too complex. After all, science has barely begun to accept the idea that there is a soul and spirit. Even if the physical body has been kept alive forever, will the connection between it and the soul/spirit always remain, as well? We are far from understanding things like this, and they may not even be something we can understand.Besides, when the connections are weakened, there are evil spirits that want to get in and take over both body and soul, right?They might try to keep thier bodies immortal but it would be difficult to keep the brain and soul alive. Each time science try to make advancement that would make them equal with God, they keep on facing some unsurmountable obstacles that points them to the fact that there is a Creator. One of the advantages of this quest for immortality is that it would advance the frontier of the scientific and health field because these billionaires would invest money to fund researches. And these discoveries would not only benefit them, but the common men on the streets would also benefit from it. I don't think anyone would achive the feat of unveiling the mystery of life and death.Good point. However, the machinery of the universe works for both, the good and the bad.The American white tail deer lives 10 years to 20 (20 in captivity sometimes). The point is that people can use wisdom and science to extend their lives on average.Probably there are some plants in the jungles of South America that, if they were consumed, would extend life by many years. Grocery stores, and farmers' fields only have a limited variety of plants. And many of them are not used to their full capacity for extending life.But what can one expect when the leading members of the medical - the people with the money - are always looking for ways to keep us sick so they can make money off us?If some phytonutrients of some plants could keep me bouncy and fresh as a 26-y-o, I would probably want to keep on living. Maybe some billionaires are working on this right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "January 12, 2023, 11:16:30 PM",
      "body": "A lot of biotech firms are looking into stem cell therapies because stem cells are the closest humans will ever get to being immortal. And interestingly enough, we already see immortal organisms that exist: https://www.sciencedaily.com/releases/2012/02/120227152612.htmPlanarian worms can literally regenerate itself despite being cut into a 1/279 piece of itself. Imagine this sort of stem cell technology being applied to humans who might be able to regenerate limbs or dead neural cells? This sort of tech isn't just limited to billionaires. Humans have the opportunity to transcend nature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "January 12, 2023, 11:19:59 PM",
      "body": "Quote from: Gyfts on January 12, 2023, 11:16:30 PMA lot of biotech firms are looking into stem cell therapies because stem cells are the closest humans will ever get to being immortal. And interestingly enough, we already see immortal organisms that exist: https://www.sciencedaily.com/releases/2012/02/120227152612.htmPlanarian worms can literally regenerate itself despite being cut into a 1/279 piece of itself. Imagine this sort of stem cell technology being applied to humans who might be able to regenerate limbs or dead neural cells? This sort of tech isn't just limited to billionaires. Humans have the opportunity to transcend nature.Right now, one of the biggest studies for extending life, is to lengthen telomeres system-wide. If this could be done in a person's whole body at the same time, life could be extended indefinitely. Later on, new findings could be applied to make things work even better.Quote from: https://www.genome.gov/genetics-glossary/TelomereTelomere. A chromosome is essentially a long, long piece of DNA that has really wrapped up and compacted on itself until it looks like the structure you probably picture when I say chromosome. The problem is that the long piece of DNA has two ends, and they're just hanging out there loose. A lot of things could go wrong if those ends aren't protected. They could get cut off, or they could join onto other loose DNA ends, which would be a problem for the cell. Telomeres are how cells protect chromosome ends. The telomere itself is a long stretch of a specific short DNA sequence repeated over and over hundreds of times. At the very end of the telomere is a sort of knot not called the \"T-loop,\" which keeps the chromosome ends from all sticking together. Every time a cell divides, some of those telomere repeats get cut off. So in certain cell types that divide a lot, an enzyme called \"telomerase\" adds those repeats back so the telomere doesn't get too short.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "January 13, 2023, 05:04:07 PM",
      "body": "Quote from: BADecker on January 12, 2023, 11:19:59 PMQuote from: Gyfts on January 12, 2023, 11:16:30 PMA lot of biotech firms are looking into stem cell therapies because stem cells are the closest humans will ever get to being immortal. And interestingly enough, we already see immortal organisms that exist: https://www.sciencedaily.com/releases/2012/02/120227152612.htmPlanarian worms can literally regenerate itself despite being cut into a 1/279 piece of itself. Imagine this sort of stem cell technology being applied to humans who might be able to regenerate limbs or dead neural cells? This sort of tech isn't just limited to billionaires. Humans have the opportunity to transcend nature.Right now, one of the biggest studies for extending life, is to lengthen telomeres system-wide. If this could be done in a person's whole body at the same time, life could be extended indefinitely. Later on, new findings could be applied to make things work even better.Quote from: https://www.genome.gov/genetics-glossary/TelomereTelomere. A chromosome is essentially a long, long piece of DNA that has really wrapped up and compacted on itself until it looks like the structure you probably picture when I say chromosome. The problem is that the long piece of DNA has two ends, and they're just hanging out there loose. A lot of things could go wrong if those ends aren't protected. They could get cut off, or they could join onto other loose DNA ends, which would be a problem for the cell. Telomeres are how cells protect chromosome ends. The telomere itself is a long stretch of a specific short DNA sequence repeated over and over hundreds of times. At the very end of the telomere is a sort of knot not called the \"T-loop,\" which keeps the chromosome ends from all sticking together. Every time a cell divides, some of those telomere repeats get cut off. So in certain cell types that divide a lot, an enzyme called \"telomerase\" adds those repeats back so the telomere doesn't get too short.Telomere lengthening is promising as well. Seems like that technology is a few generations ahead of us. I've kept up with stem cell research and some countries with less medical oversight are already experimenting with stem cell injections to treat pain with some level of success. Europe and North America are a bit behind but you can travel to South America to stem cell clinics that will give out robust treatment.Only downside are that some of the stem cells are sourced from embryos/fetal tissue. There aren't many other options for undifferentiated stem cells unfortunately -- extracting stem cells from adults comes with some level of differentiation which make them less useful for treatment, whereas embryos have less differentiation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cmg777",
      "created_time": "January 13, 2023, 05:58:19 PM",
      "body": "Quote from: Marykeller on January 12, 2023, 02:04:41 PMIn recent years, it has become increasingly popular among the world's billionaires to use their enormous money to fund their quest for immortality. These millionaires are dedicated to finding a method to live forever and are investing in cutting-edge biotech firms and sponsoring cryonics and life extension research.Elon Musk, a tech magnate and businessman, is one of the most prominent individuals in this movement. Musk has publicly expressed his wish to live forever and has made significant investments in businesses conducting longevity research, including a $10 million investment in Unity Biotechnology, a biotech company focused on extending life. Additionally, he has made it known that he thinks technology, such as brain-computer interfacing, holds the key to immortality.Link to information: https://www.dailystar.co.uk/news/latest-news/experts-fear-billionaires-like-elon-28895939?utm_source=facebook.com&utm_medium=social&utm_campaign=star_main Do you agree with these efforts by the richest persons in the world to become immortal? What are the benefits and drawbacks of it if it actually occurs, given that the richest men in the world are currently making more efforts to have it happen? Elon Musk, Jeff Bezos, Larry Page, and Sergey Brin,I agree the only way to become immortal is through merging man with machine. The worlds richest men would need to merge their physical organic bodies and eventually their brain into machine where even the organic brain can be made obsolete as it can be absorbed into the machine's hard drives/CPU/advanced AI/computational apparatus. The only problem after the merger would be the billionaire's continued contempt for humanity and their lust for control over all life cycles.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "January 13, 2023, 06:56:27 PM",
      "body": "Quote from: BADecker on January 12, 2023, 05:02:49 PMMuch of what you say is based on your own wishes rather than scientific experimentation. Well that sounds like psychological projection. Where did i wished something? You are The one wishing for eternal lifeQuote from: BADecker on January 12, 2023, 05:02:49 PMThat being said, since it's very difficult to scrutinize the unscrutable, there isn't very much factual info, yet... except for the very fact of personal identity.Personal identity isn't proof for anything other then feeling of personal identity. There's nothing magical about that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "January 13, 2023, 08:45:43 PM",
      "body": "Quote from: o48o on January 13, 2023, 06:56:27 PMQuote from: BADecker on January 12, 2023, 05:02:49 PMMuch of what you say is based on your own wishes rather than scientific experimentation. Well that sounds like psychological projection. Where did i wished something? You are The one wishing for eternal lifeQuote from: BADecker on January 12, 2023, 05:02:49 PMThat being said, since it's very difficult to scrutinize the unscrutable, there isn't very much factual info, yet... except for the very fact of personal identity.Personal identity isn't proof for anything other then feeling of personal identity. There's nothing magical about that.The fact that you wished for something is born out by the fact that you posted. Even if your post doesn't bear out what you wished for, it probably comes close.Even the animals have personal identity. How can you tell? There are no two of them that are exactly alike or exist in exactly the same space. However, if you mean soul or spirit, that is something that even science is proving. You are going against the grain of history and recent science if you say there is no soul or spirit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "January 14, 2023, 03:46:53 PM",
      "body": "It's getting to the point where it isn't only for billionaires. Some age-reversing processes are working in experiments on mice. However, the problem of delivery to every cell of the body almost simultaneously is still a big problem. Much of what is being done is work on \"epigenetics\" of the body.The most interesting thing is that our bodies have a backup system, a backup of what they originally were. The problem is properly activating it.Old mice grow young again in study. Can people do the same?https://edition.cnn.com/2023/01/12/health/reversing-aging-scn-wellness/index.htmlThe experiments show aging is a reversible process, capable of being driven \"forwards and backwards at will,\" said anti-aging expert David Sinclair, a professor of genetics in the Blavatnik Institute at Harvard Medical School and codirector of the Paul F. Glenn Center for Biology of Aging Research.Our bodies hold a backup copy of our youth that can be triggered to regenerate, said Sinclair, the senior author of a new paper showcasing the work of his lab and international scientists.The combined experiments, published for the first time Thursday in the journal Cell, challenge the scientific belief aging is the result of genetic mutations that undermine our DNA, creating a junkyard of damaged cellular tissue that can lead to deterioration, disease and death.\"It's not junk, it's not damage that causes us to get old,\" said Sinclair, who described the work last year at Life Itself, a health and wellness event presented in partnership with CNN....Today, Sinclair’s team is trying to find a way to deliver the genetic switch evenly to each cell, thus rejuvenating the entire mouse at once....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "January 14, 2023, 05:47:02 PM",
      "body": "Quote from: BADecker on January 13, 2023, 08:45:43 PMThe fact that you wished for something is born out by the fact that you posted. Even if your post doesn't bear out what you wished for, it probably comes close.Even the animals have personal identity. How can you tell? There are no two of them that are exactly alike or exist in exactly the same space. However, if you mean soul or spirit, that is something that even science is proving. You are going against the grain of history and recent science if you say there is no soul or spirit.As usual, you are not making any sense. What does personal identity has to do with made up concepts like soul or spirit?And you obviously aren't following any scientific research if you think there has been any sort of proof for those vague concepts. Claiming that i am going against history is just weird nonsense. If you are saying i don't hold much value on belief systems people used to have, that's true. As history is full of weird belief systems that don't make any sense. They were used to understand cause and effect, and not they have been mostly replaced by scientific method.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "January 14, 2023, 06:47:50 PMLast edit: January 14, 2023, 07:09:47 PM by BADecker",
      "body": "Quote from: o48o on January 14, 2023, 05:47:02 PMQuote from: BADecker on January 13, 2023, 08:45:43 PMThe fact that you wished for something is born out by the fact that you posted. Even if your post doesn't bear out what you wished for, it probably comes close.Even the animals have personal identity. How can you tell? There are no two of them that are exactly alike or exist in exactly the same space. However, if you mean soul or spirit, that is something that even science is proving. You are going against the grain of history and recent science if you say there is no soul or spirit.As usual, you are not making any sense. What does personal identity has to do with made up concepts like soul or spirit?And you obviously aren't following any scientific research if you think there has been any sort of proof for those vague concepts. Claiming that i am going against history is just weird nonsense. If you are saying i don't hold much value on belief systems people used to have, that's true. As history is full of weird belief systems that don't make any sense. They were used to understand cause and effect, and not they have been mostly replaced by scientific method. The point being shown in parallel universes.How many times has God gone back to Cause and Effect and tweaked it at the beginning so that present results are different... all because somebody wished it now? So, he got his wish, and doesn't even realize it, because he doesn't remember the way it was, that memory never having been formed in him (in this universe).We can find starts of proof for soul/spirit right in parallel universe theory. But personal identity wouldn't exist, where one says 'I am', without touching on soul/spirit.However, there is plenty of research going on, and some of it seems to be producing results.EDIT: Listen to some of Nassim Haramein's video - https://www.youtube.com/@NassimHaramein/videos.Also, https://nassimharamein.com/wp-content/uploads/2021/09/Unified-Spacememory-Network.pdf.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "January 14, 2023, 08:46:58 PM",
      "body": "Quote from: BADecker on January 14, 2023, 06:47:50 PM-cut-But personal identity wouldn't exist, where one says 'I am', without touching on soul/spirit.-cut-This just isn't true. There's no connection of being self aware and your vague concept of immortal soul. I am not even sure why do i have to point it out as it's obvious and most of the things you say are not true either.Maybe you should research those concepts like \"parallel universe\" you are throwing around, because you are either blatantly lying or don't understand what you are talking about.Just because you talk about a god, it doesn't make any of the gods that people believe in any more real.What you linked is pseudoscience that you would immediately see if you understood something about the concepts you are talking about. And i won't be using my time to debunk Nassim Haramein's nonsense when others have done it already",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "January 14, 2023, 08:59:14 PM",
      "body": "Quote from: o48o on January 14, 2023, 08:46:58 PMQuote from: BADecker on January 14, 2023, 06:47:50 PM-cut-But personal identity wouldn't exist, where one says 'I am', without touching on soul/spirit.-cut-This just isn't true. There's no connection of being self aware and your vague concept of immortal soul. I am not even sure why do i have to point it out as it's obvious and most of the things you say are not true either.Maybe you should research those concepts like \"parallel universe\" you are throwing around, because you are either blatantly lying or don't understand what you are talking about.Just because you talk about a god, it doesn't make any of the gods that people believe in any more real.What you linked is pseudoscience that you would immediately see if you understood something about the concepts you are talking about. And i won't be using my time to debunk Nassim Haramein's nonsense when others have done it alreadyGood work! Your soul and/or spirit have successfully used your mind to hide themselves from it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}