{
  "id": "topic_5462810",
  "title": "Jocuserious",
  "author": "Jocuserious",
  "created_time": "August 10, 2023, 04:47:05 PM",
  "content": "Bank investors have more certainty because there capital is completely safe but they give 8-10% annual profits to the investors of per year. But it is comparatively less in terms of profits.On the other hand you will get constant profits from crypto as if you are experienced in trading then daily profits is possible. Otherwise you can get profits by investing. However crypto investment puts your capital at greater risk (main point).",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462810",
  "comments": [
    {
      "author": "abel1337",
      "created_time": "August 10, 2023, 05:26:23 PM",
      "body": "Quote from: Jocuserious on August 10, 2023, 04:47:05 PMBank investors have more certainty because there capital is completely safe but they give 8-10% annual profits to the investors of per year. But it is comparatively less in terms of profits.On the other hand you will get constant profits from crypto as if you are experienced in trading then daily profits is possible. Otherwise you can get profits by investing. However crypto investment puts your capital at greater risk (main point).It is a subjected choice depending on what type of financial guy you are. Stable but less or higher reward but higher risk, it's your choice. Though I'm pretty sure that majority of us here would choose crypto investment, we are on a bitcoin forum aren't we? I also think that banks don't really give that much annual profit to their customers as in our country we can only recieve I think maximum 5% on physical banks. Both has risks but putting your money on crypto will grant you risks but yeah, I would personally put my money on crypto as I've been doing it for years. I'm just tired of the banks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "August 10, 2023, 05:38:30 PM",
      "body": "Quote from: Jocuserious on August 10, 2023, 04:47:05 PMBank investors have more certainty because there capital is completely safe but they give 8-10% annual profits to the investors of per year. But it is comparatively less in terms of profits.On the other hand you will get constant profits from crypto as if you are experienced in trading then daily profits is possible. Otherwise you can get profits by investing. However crypto investment puts your capital at greater risk (main point).Both are different and should not be compared. Cryptos have higher risk so the reward should be higher. The risk with banks is lower so it will give lower return. But the structure of both investments are different. Trading of any kind is gambling and it comes with a huge risk. Daily profit is possible in both cases but that's not guaranteed. So  let's not compare these two very different investment choices. But cryptos have the power to make someone rich or bankrupt overnight.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "August 10, 2023, 05:44:08 PM",
      "body": "Remember Inflation?In-bank you are holding fiat, meanwhile the value of your asset being held is decreased as well. Rather than fiat, better gold (in-case you want to asset other than crypto). Off-course it's better crypto.As you know, fiat are always inflaction every year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "August 10, 2023, 05:56:22 PM",
      "body": "Quote from: Jocuserious on August 10, 2023, 04:47:05 PMBank investors have more certainty because there capital is completely safe but they give 8-10% annual profits to the investors of per year. But it is comparatively less in terms of profits.On the other hand you will get constant profits from crypto as if you are experienced in trading then daily profits is possible. Otherwise you can get profits by investing. However crypto investment puts your capital at greater risk (main point).If we are going to put Bitcoin aside from the table then I will definitely go with the Banks and related investments. If we are going to compare this against the altcoins then I have better options with higher returns and fewer risks. For example, I can simply rely on Mutual funds, Recurring deposits, and Fixed Deposits and have as high as 8.15% to 22% returns on various investment instruments. I am not saying altcoins are that bad, but they are worst sometimes and they could make you broken fast. The only problem is their short life span, ability to lose the clients and their trust, and most importantly they go bankrupt or spammy in a very short period of time. These are the few points I never understood about the Altcoins that make it the worst investment for us. I am not blaming the entire altcoin ecosystem but this is the case with most of them and hence its worrisome.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "August 10, 2023, 08:26:36 PM",
      "body": "You can rely on crypto investment if you are making profit from it but if you are not I think bank is preferable because in bank deposit you can only witness inflation which may be present when you get your money back or you may not witness inflation depending on what is happening in your economy. In terms of cryptocurrency especially if you are trading it, you run the risk of losing all your money if the trade is against your position and while hodling it also, some things can happen like if it is a shit coin the exchange may delist it. If the coin is only in one exchange and it is delisted, that means the coin and your cash is gone. Hodling to profit is only more reliable with bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "August 10, 2023, 08:28:54 PM",
      "body": "Comparatively they are both good because another means of profits that shows reliability of one's investment, sometimes while most people do love bank is that it gives peace of mind like to say, you won't panic over anything or to sell off their holding like crypto, In crypto especially newbie investors doesn't have this patient to watch over their investment to lose 10 percent to 40 percent they will panic and sell but in bank there is no lost because your investment are being secured and guaranteed by the bank but your profits may not come as rapidly as crypto investment imo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Victorik",
      "created_time": "August 10, 2023, 08:38:34 PM",
      "body": "Quote from: Jocuserious on August 10, 2023, 04:47:05 PMBank investors have more certainty because there capital is completely safe but they give 8-10% annual profits to the investors of per year. But it is comparatively less in terms of profits.On the other hand you will get constant profits from crypto as if you are experienced in trading then daily profits is possible. Otherwise you can get profits by investing. However crypto investment puts your capital at greater risk (main point).Bank investment are less riskier, but the return on investment is very low, except you are investing a huge amount and compounding. But in crypto, you can make a lot from just an investment of $50, and could also lose everything within a twinkle of an eye. So, it's up to you to choose your demon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "milewilda",
      "created_time": "August 10, 2023, 09:16:09 PM",
      "body": "Quote from: Jocuserious on August 10, 2023, 04:47:05 PMBank investors have more certainty because there capital is completely safe but they give 8-10% annual profits to the investors of per year. But it is comparatively less in terms of profits.On the other hand you will get constant profits from crypto as if you are experienced in trading then daily profits is possible. Otherwise you can get profits by investing. However crypto investment puts your capital at greater risk (main point).8-10% annually? Which place you are living? Here in my country does only offer 2-3% per annum which it do really sucks. Knowing that banks is doing up some business with your stored funds then it isnt really that justifiable and this is why other people would be thinking on pulling out those funds and making up some investment on which this is really just a normal approach on which it is really just that the risks is really high compared when you are just simply putting your funds at the bank but of course it wont really be that increasing or would really be that huge interest even on storing it for a long time which it is would really be just that right or sensible for you to do so on having that kind of investment action or dealing despite of the risks but at least you do know that potential gains and profits would really be that much more bigger than let those funds sitting those at the bank in idle. In overall, it would really be just depending on the certain individual since not all would really be that sensible in towards their money and wants really to play safe and dont want to touch up risky things and this is why options and selections would really vary.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "August 10, 2023, 10:58:18 PM",
      "body": "It's true that some Altcoins can really earn someone a huge profit, and a trader who is able to study the market can earn more profit as well with altcoins, but it can be very risky compared to bank investment because for someone who is unlucky, he or she can end up buying some shitcoins, thinking it's a potential coin. But if you Invest in a bank, although the profit can be small and inflation might have also taken its toll, but you will still secure your capital and profit.But in Altcoins, if peradventure you invest in a coin during its ATH and it drips to a new level of ATL, then you probably would have more loss on your asset. Well, anyone who is going into any of the investments should compare the risks and decide for themselves which one they really wish to go for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "August 10, 2023, 11:11:11 PM",
      "body": "Quote from: Jocuserious on August 10, 2023, 04:47:05 PMBank investors have more certainty because there capital is completely safe but they give 8-10% annual profits to the investors of per year. But it is comparatively less in terms of profits.And with the inflation, the profit might not be enough to defeat it.Quote from: Jocuserious on August 10, 2023, 04:47:05 PMOn the other hand you will get constant profits from crypto as if you are experienced in trading then daily profits is possible. Otherwise you can get profits by investing. However crypto investment puts your capital at greater risk (main point).Traders might earn some and lose some. It's not always like that as if it's easy to say that they can earn quickly and do that without having problems. In fact, many traders are problematic in day to day basis because instead of making profits, they are incurring losses. It sounds nice and chill when someone talks about traders and the market, wherein reality things are too complicated and hard to do if we'll check out the facts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "August 11, 2023, 12:43:48 PM",
      "body": "You're talking about trading using shitcoin and lose by investing in fiat.The 8-10% APY you earn will not worth if the inflation in your local currency is higher than the interest rate and don't forget with the monthly fees you need to pay, in the end you will not earn that much, but the bank make more money using your money.Not everyone can trade, especially with shitcoin where the price can suddenly drop or increase in short time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fmz89",
      "created_time": "August 11, 2023, 02:12:06 PM",
      "body": "Quote from: Jocuserious on August 10, 2023, 04:47:05 PMBank investors have more certainty because there capital is completely safe but they give 8-10% annual profits to the investors of per year. But it is comparatively less in terms of profits.On the other hand you will get constant profits from crypto as if you are experienced in trading then daily profits is possible. Otherwise you can get profits by investing. However crypto investment puts your capital at greater risk (main point).8-10% from where deposito? or what, never heard that high interest from bank these day, even many u.s pension chose blockfi as 7% interest and got burnedthere is no such things 10% interes on banks, it never happen",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FahriZah",
      "created_time": "August 11, 2023, 03:31:52 PM",
      "body": "Bank and crypto currency totally different systems because who want to deposit money to bank than need to go bank and waiting for big serial and deposit than already 2 hours passed for the deposite but if anyone want to deposit alts than just sent & received very faster and easy process also within a minutes It's really fantastic to deposit alts for best benefit and alts is always best for good profit just keep remained.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VFalcon",
      "created_time": "August 11, 2023, 03:51:30 PM",
      "body": "Banks are not always stable, while the income you get is not as big as in crypto, although it's more about luck, but there are stable tokens, like TFS. But before investing in any token, it is worth doing your research",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tsaroz",
      "created_time": "August 11, 2023, 03:54:32 PM",
      "body": "Quote from: Jocuserious on August 10, 2023, 04:47:05 PMBank investors have more certainty because there capital is completely safe but they give 8-10% annual profits to the investors of per year. But it is comparatively less in terms of profits.On the other hand you will get constant profits from crypto as if you are experienced in trading then daily profits is possible. Otherwise you can get profits by investing. However crypto investment puts your capital at greater risk (main point).Bank rates are also nearer to the inflation. There might be years where in some countries the FD rate goes above 10% but than at those times, inflation is also high. Still 8-10% is a generous rate. There are less risks involved on saving on modern banks and the yield is also lower. Even at the rate of 12% compounded, your money would double in 6 years. Another good investment available around the world are stocks, choosing a better one is easier and their returns are mostly better than banks.And there's altcoins, with most of us are hoping for x2 or x3 in a couple of years and some adventurous of us x10 or x100.The best strategy would be to diversify your investment between banks, stocks, real estates and crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "X-ray",
      "created_time": "August 11, 2023, 04:12:33 PM",
      "body": "Quote from: Jocuserious on August 10, 2023, 04:47:05 PMBank investors have more certainty because there capital is completely safe but they give 8-10% annual profits to the investors of per year. But it is comparatively less in terms of profits.You just compare apple to the orange which doesn't make sense. [/quote]You shall compare annual profit given by the bank to the inflation. The inflation rate was able going even higher compared with the annual profit offered by the bank. that means if you will be also losing your value. Crypto is different thing as it's a high risk investment since it was being introduced to the market. Quote from: Jocuserious on August 10, 2023, 04:47:05 PMOn the other hand you will get constant profits from crypto as if you are experienced in trading then daily profits is possible. Otherwise you can get profits by investing. However crypto investment puts your capital at greater risk (main point).How big your profit gonna be depend on how big your risk. No pain and no gain. You must remember that. Daily profit is possible while you can also suffer the lose in a few seconds after starting your trade. Look at how many people being liquidated anytime. The choice is yours. you want earn big profit and you must deal with big risk as the consequence to get the big profit from your investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "I_RodimusPrime",
      "created_time": "August 11, 2023, 06:00:56 PM",
      "body": "Yooo man this is a hell of compare. Altcoins may give you 1000$ in one min but that also can work on another hand like losing all your invested money in one min. Banks profits may be lower but your money will be there safely no matter whether interest lower or higher.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "August 11, 2023, 06:08:04 PM",
      "body": "Bigger profit would basically go with the more volatile one, but ofcourse there would be a bigger risk. Stocking up your money in bank is not a bad thing to do but manage your expectations; its value would increase over buy below 5%. Its advantage is being a secured storage of wealth. So the answer is sinply depending on your preference as an individual; it is security over profitability or vice versa. Quote from: I_RodimusPrime on August 11, 2023, 06:00:56 PMYooo man this is a hell of compare. Altcoins may give you 1000$ in one min but that also can work on another hand like losing all your invested money in one min. Banks profits may be lower but your money will be there safely no matter whether interest lower or higher.You could also lose $1000 in one minute of trading altcoins. Keep in mind how volatile altcoin's market value is. Prices tend to change from time to time. One wrong technical analysis would yield to aa huge loss especially if risks won't be managed at first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AakZaki",
      "created_time": "August 11, 2023, 06:12:04 PM",
      "body": "Quote from: VFalcon on August 11, 2023, 03:51:30 PMBanks are not always stable, while the income you get is not as big as in crypto, although it's more about luck, but there are stable tokens, like TFS. But before investing in any token, it is worth doing your researchYou look at the two of them superficially, not going deep into each other's strengths.Crypto doesn't always have big income, there are times when crypto won't produce anything. and it's not about luck because it's not gambling. Stable tokens are not TFS, but stablecoins like USDT, USDC etc. Altcoins and banks both have their advantages and cannot be compared as a whole.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}