{
  "id": "topic_5422502",
  "title": "GxSTxV",
  "author": "GxSTxV",
  "created_time": "November 21, 2022, 07:26:16 PM",
  "content": "I have been playing online live blackjack on casinos long time ago and had so many crazy games and moments, i never doubted that the casino will ever try to manipulate things out since we all know that with the long run the dealer has more chances to win. But since i saw this video on tiktok were it shows an obvious cheating from a casino which i don't know or even accuse since maybe the video is made up. But it's also making me think of all the games i lost for example happened to me getting 21 not as a blackjack pair. The dealer have like a 4 then gets also a 21 in a very weird way and for multiple times in one session.All i want to say is maybe many casinos did cheat in this way that are shown in the video before, i want you to share your thoughts about this and also if you ever catched a casino cheat in blackjack games?I uploaded the video to YouTube: https://youtu.be/OWCXhcJoaF0",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5422502",
  "comments": [
    {
      "author": "GxSTxV",
      "created_time": "November 21, 2022, 07:44:30 PM",
      "body": "Quote from: Sirait on November 21, 2022, 07:35:44 PMyou are wrong to make a post like this in this thread. please move your topic to the correct thread [Scam Accusations], of course with strong evidence that you can show.Here we go again with 1xbit shit posters! You didn't even read or understand my topic how could you reply to my topic. Beside this is a thread or a topic not a post while Scam Accusations is a section. I didn't accuse anyone i just want to talk about what i saw in the video and if there's people that ever felt that sometimes blackjack games are being manipulated",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "November 21, 2022, 08:08:12 PM",
      "body": "Well, honestly, to catch an online casino cheating their customer(s) in a blackjack game will require a great amount of attention to details from the player, and you will agree with me that one of the virtues gamblers lack is patience and time, a gambler hardly have the patience or time required to monitor the game closely for possible cheats.I personally have never caught any casino cheating on blackjack, but this is not to say that i trust all the casinos I've played blackjack on not to cheat, if they cheated, I wouldn't know, because as I explained above, i usually just play without paying much attention to the details of the game, what I know I mostly do is that, if a play on a casino for a while or a period of time and didn't win, and that seems odd to me, I move to another casino, for me, its as simple as that. Quote from: Sirait on November 21, 2022, 07:35:44 PMyou are wrong to make a post like this in this thread. please move your topic to the correct thread [Scam Accusations], of course with strong evidence that you can show.Try to read posts before posting comments, this comment of yours really shows you didn't even read the OP but just went ahead to comment based on the subject of the topic, OP isn't accusing any casino in particular of scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "November 21, 2022, 10:40:17 PM",
      "body": "Quote from: GxSTxV on November 21, 2022, 07:26:16 PMI have been playing online live blackjack on casinos long time ago and had so many crazy games and moments, i never doubted that the casino will ever try to manipulate things out since we all know that with the long run the dealer has more chances to win. But since i saw this video on tiktok were it shows an obvious cheating from a casino which i don't know or even accuse since maybe the video is made up. But it's also making me think of all the games i lost for example happened to me getting 21 not as a blackjack pair. The dealer have like a 4 then gets also a 21 in a very weird way and for multiple times in one session.All i want to say is maybe many casinos did cheat in this way that are shown in the video before, i want you to share your thoughts about this and also if you ever catched a casino cheat in blackjack games?I uploaded the video to YouTube: https://youtu.be/OWCXhcJoaF0Not the first time in a live black jack game that the dealer or the casinos have been caught cheating.Not sure if it is prevalent, but some casinos have been caught red handed. Maybe they try to stay away from cheating their customers. But there could still be casinos out there that is going to pull this stunt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "November 21, 2022, 10:40:35 PM",
      "body": "Quote from: Fivestar4everMVP on November 21, 2022, 08:08:12 PMWell, honestly, to catch an online casino cheating their customer(s) in a blackjack game will require a great amount of attention to details from the player, and you will agree with me that one of the virtues gamblers lack is patience and time, a gambler hardly have the patience or time required to monitor the game closely for possible cheats.I personally have never caught any casino cheating on blackjack, but this is not to say that i trust all the casinos I've played blackjack on not to cheat, if they cheated, I wouldn't know, because as I explained above, i usually just play without paying much attention to the details of the game, what I know I mostly do is that, if a play on a casino for a while or a period of time and didn't win, and that seems odd to me, I move to another casino, for me, its as simple as that. I agree with you most of us we play to spend some good time and chill so the important thing we focus on is our card numbers only, that’s why i said i have been playing long time ago but i never even thought about that casinos can do such things because they have those smart kind of tables where more cards can appear just beside the cards pot where there dealers meant to pull the cards. I searched more about this method of cheating casinos are using and found more evidence about it where they also hunt players with big amount of money. It’s sad since you can’t even do anything when you get manipulated.I hope it’s will be also a warning if someone spotted such casinos doing that better to boycott that casino",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "agustina2",
      "created_time": "November 21, 2022, 10:51:14 PM",
      "body": "It might possible but I believed that's not always the case at most gambling platforms.To minimize being fucked up with that situation you are so worried about, just try to limit your circle of options to those reputable and popular casinos that offer live online blackjack with the support of popular game providers. These game providers that are partnered with gambling sites should be supposed to be fair.It's hard to determine whether they are manipulating things but at least it's worth taking a risk if you will just play online blackjack at reputable gambling casinos as I'm sure their game providers won't ruin their reputation that was being built for long as that might affect their business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "November 21, 2022, 10:57:15 PM",
      "body": "Quote from: Baofeng on November 21, 2022, 10:40:17 PMNot the first time in a live black jack game that the dealer or the casinos have been caught cheating.Not sure if it is prevalent, but some casinos have been caught red handed. Maybe they try to stay away from cheating their customers. But there could still be casinos out there that is going to pull this stunt.When playing a card we are fully concentrated on our card that we give little attention to small details like hand gestures, if we have doubts about the casino where we are playing it's better to have someone look at the dealer's hands or a screen recorder to record the shuffling of the card, an ounce of prevention is better once you establish if the casino you're playing is cheating on you then its better to move in a better casino but you should catch them as early as possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "November 21, 2022, 11:15:43 PM",
      "body": "These live platforms are often audited so I guess there aren't that much platforms that are cheating against their players. It will be the start of suspicion and the start of them losing players little by little. A single hint of them not being trustworthy is enough for a lot of players to bail out and go somewhere else. Perhaps that incident you mentioned is just a coincidence, but if you have a valid proof that these guys are cheating you, then head over to Scam Accusations board and post a formal complaint alongside any proofs you may have there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chaser15",
      "created_time": "November 21, 2022, 11:37:17 PM",
      "body": "Nothing you can do about it as in the first place, we can't even detect or realized that there's something wrong happening in the live game.You have 2 choices:- Play at famous gambling sites that you think won't do something unusual to manipulate the live games- Play at physical casinos and see to yourself the actual doings of the dealerOr if you don't like these choices, stop playing online blackjack for good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "November 21, 2022, 11:44:44 PM",
      "body": "Quote from: chaser15 on November 21, 2022, 11:37:17 PMNothing you can do about it as in the first place, we can't even detect or realized that there's something wrong happening in the live game.You have 2 choices:- Play at famous gambling sites that you think won't do something unusual to manipulate the live games- Play at physical casinos and see to yourself the actual doings of the dealerOr if you don't like these choices, stop playing online blackjack for good.that is very correct. because if a known or reputable casino is doing such kind of cheating, someone will always notice it or complain about it. so do you think the casino is willing to ruin their image by this simple cheating from their live games? because for sure, someone will publish the anomaly especially if the player has lost big time. and if you are in doubt and you're not happy, as you said, don't play the game. because at the back of your mind, you are always cheated by the casino even if it is not, and you won't have peace of mind thinking about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ThemePen",
      "created_time": "November 21, 2022, 11:44:52 PM",
      "body": "Online casinos can do this. And I think not only blackjack the others can also do this. But there are many others casinos and you can choose anyone. If you think that it has scammed and you think it can do this again with you so honestly you can go out and can choose another. Because there are many others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "November 21, 2022, 11:45:28 PM",
      "body": "I want to see the full video, I don't think to take a conclusion with the edited video. It's better to show up the video from dealing the card to end of the game without any editing as well.Quote from: Baofeng on November 21, 2022, 10:40:17 PM-snip-For this case, the people who are playing on this table/casino is stupid. You want to know why?- Random/Uknown Casino- Shitty scanner - Bad mic & video- Huge card? what the f*ck is that.If you think is weird getting 21 just because dealers has 4, everything can happen on gambling. There always has some chance bro, go search video from XPOSED playing blackjack: https://youtu.be/SZRjUKrvBkI?t=1246 watch hereHe got a miss click hitting 20, guess what? AS came out and make it 21. From that scenario, everything can happen. If dealer always get 20,21,21 and go on that's mean the table is on dealer side. Why you keep playing on that table? set the limit lose or change the table.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "November 22, 2022, 01:12:17 AM",
      "body": "I have seen a lot of those videos, but i haven't see one of the most common providers, you know, the tables that we can see in sites like Stake or Roobet. I think some of them cheat and some others doesn't do it. Its about the game provider.But i feel like you, is really weird to see how the dealer keeps getting 20's and 21's while we bust all the way. Sometimes i feel that just i have a terrible luck, but other times it makes me feel like I'm paying in a rigged game.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "November 22, 2022, 08:32:24 AM",
      "body": "Quote from: seoincorporation on November 22, 2022, 01:12:17 AM-snip- There has some reason, why the deck is on \"dealer side\".Everythings is normal, however sometime the player playing with you is stupid they don't know to play with Basic Strategy & most the time scared to not play optimal. What is optimal? is playing by the book. Example like, Dealer have 10 and some player have 12-16 he stand against 10 not hitting. In long term, is gonna give us really bad deck (Even, If we lose playing with basic strategy & optimal are not gonna to make other people mad).Casino don't need to cheat deal the card, they already cheated and make sure they're in winning because \"House edge\". That's always how the casino win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Daltonik",
      "created_time": "November 22, 2022, 09:41:59 AM",
      "body": "Well, a great trick on the part of the casino dealer, which is called watch your hands, it's a pity that the author of the video does not specify the name of the online casino, perhaps because the video is also fake, to attract subscribers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "November 22, 2022, 10:06:25 AM",
      "body": "But you have to show proof if you are really that decided and if you're sure that they are really cheating. Bottomline is, we are in online platform so that would be hard unless they made a mistake which showed their 'trick'. Some people will even say that you just cannot accept losing. Well it is a part of the game but you'd know if there is really something wrong from the game. My take on this is leaving from a specific gambling site but if same things would happen over different gambling platforms, maybe it is not just your day or the game itself is not for you. Choose something that you would enjoy playing. Or even try playing other games if you are having a feeling of being cheated to somehow ease your mood. With regards to the video, but given that no names were dropped, they won't be able to defend themselves if they are really caught, so it is hard to validate that one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "November 22, 2022, 10:06:39 AM",
      "body": "I don’t understand the cheat in the video you provided, can you explain what he did? The video the @Baofeng shared is the one popular cheat by the dealer which is switching cards because they knew exactly what’s the card on the shoe due to the chip connected on the cards. Only mediocre software provider do this because popular live games provider is very careful when it comes to dealing with cards.I have some experience on this kind of shady outcome on blackjack from evolution gaming. On classic table, I always encounter a random player joining my table when I’m on win streak then do crazy decision making such as hitting at 19 or splitting pair of 20 then the result is dealer always get 21 just because of this dumb action of random player. I think sometimes casino injecting bot player just to destroy the flow pf the cards in case players is on win streak base on the current card arrangement on shoe deck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "November 22, 2022, 10:17:26 AM",
      "body": "Quote from: Beparanf on November 22, 2022, 10:06:39 AMI have some experience on this kind of shady outcome on blackjack from evolution gaming. On classic table, I always encounter a random player joining my table when I’m on win streak then do crazy decision making such as hitting at 19 or splitting pair of 20 then the result is dealer always get 21 just because of this dumb action of random player. I think sometimes casino injecting bot player just to destroy the flow pf the cards in case players is on win streak base on the current card arrangement on shoe deck.Yes, if I'm not mistaken, one casino here has been accused of them, colluding in some tables, specially in poker or blackjack.But it's just accusation and I don't know what happen to that case, but here, hard to see in the video, maybe the dealer has switch the card or some other trick that we are not aware of. In any case, we should always be careful and be attentive, just like in that video wherein it was clear as daylight that there was switch done by the dealer and you can see his reaction before he pull that stunt live.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wiss19",
      "created_time": "November 22, 2022, 10:51:52 AM",
      "body": "Quote from: ThemePen on November 21, 2022, 11:44:52 PMOnline casinos can do this. And I think not only blackjack the others can also do this. But there are many others casinos and you can choose anyone. If you think that it has scammed and you think it can do this again with you so honestly you can go out and can choose another. Because there are many others.I think that's because they think it was online and no one can see them closely but they didn't know that some people still caught their modus. All gambling games can possibly be cheated if the casino is not honest. That is why it's important to be picky and always check the reputation of the casino that we want to play.Maybe the op should tell the name of the casino that he is playing with, so that people here can start avoiding it in case some of us are playing there and we don't suspect them because we think constant losses are still normal but there's also casino who are only selectively scamming their players like for example 1xbit/1xbet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "November 22, 2022, 11:02:11 AM",
      "body": "I doubt they will make it too obvious for their customers to know they are cheating. And, you won't even win if you try to retaliate about what you saw or whatever you feel is happening. (cheating) Their customer support will always just shrug it off and will ask for proof first. Although I know the rules of blackjack I never really played it but I played the high or low game and I always felt like the system is trying to cheat. The winning chance is too low, maybe 2 of 10. Example like the last card was a Queen so the next one has a higher chance to be a lower card, but to my surprise, the next card will be King.  But, I never went to customer support just to say that. All I did was stop playing it and find another game that would make me think it is fairer than the first one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}