{
  "id": "topic_5454509",
  "title": "anachorette_python",
  "author": "anachorette_python",
  "created_time": "May 30, 2023, 11:39:11 AMLast edit: June 25, 2023, 09:28:40 AM by anachorette_python",
  "content": "Hey everyoneFirstly, I'm not here to sell you any dreams or throw a bunch of tech buzzwords your way. Let's talk facts.We're developing a marketplace at TradeLink. It's not just any marketplace but one carefully curated with selected algorithmic strategies. These strategies have demonstrated track records and open statistics, which we've vetted using our independent platform for performance confirmation.Now, the burning question: Does copy-trading work? Well, everyone knows that anyone you auto-follow might eventually have a downturn. But here's where our platform differs: we offer a unique diversification mechanism through joint auto-following of multiple algorithms.Sounds intriguing, right? That's where you come in.We need beta testers for a month. The commitment? A few minutes a week of your time to check the demo statistics and copy-trading results, and to note any inconsistencies. We're looking for folks who have a Binance Futures account. A Telegram account would be a plus, but not necessary.Now, I know your time is valuable. So, in exchange for your feedback, we're offering a year's exemption from success fees when the platform goes live.If you're interested, please sign up via this Google form https://forms.gle/DqU3d3iEwhkdan379If you're interested to join our Algo Traders network please submit this Google form: https://forms.gle/pECodGkN6GZ1BKtF8Lastly, you're not signing up blind. You can already check out the marketplace and stats of our algorithmic strategies right now, although you need to contact us so we will whitelist you for using our service immediately .https://tradelink.pro/marketplaceStraight enough? Let me know your thoughts below.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454509",
  "comments": [
    {
      "author": "348Judah",
      "created_time": "May 30, 2023, 11:58:19 AM",
      "body": "Why worry on yourself in taking much effort to search through what you could have just sitted to learn and do all by yourself, those channels we are interested in to always give us updates are doing so for their own benefits and not yours because bwhen you engaged them, they will have the opportunity to receive money incentives from you, if you're looking for the best way to learn then i think this trading board discussion has all it takes for your best leaning indicators provided you're active to learn from experiences on this boards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "anachorette_python",
      "created_time": "May 30, 2023, 12:09:34 PM",
      "body": "Quote from: 348Judah on May 30, 2023, 11:58:19 AMWhy worry on yourself in taking much effort to search through what you could have just sitted to learn and do all by yourself, those channels we are interested in to always give us updates are doing so for their own benefits and not yours because bwhen you engaged them, they will have the opportunity to receive money incentives from you, if you're looking for the best way to learn then i think this trading board discussion has all it takes for your best leaning indicators provided you're active to learn from experiences on this boards. Totally get where you're coming from. Nothing beats the school of hard knocks, right? That's how we all learn and improve.Our thing at TradeLink is a bit different though. We're not saying \"follow this and forget about learning\". No, not at all. We're all about giving folks more options - more ways to mix things up in their trading game.And yep, there's a bit of a reward for those who bring their strategies to the table. But for our beta testers, we're giving them a year off from the success fee. We reckon that's a decent thank-you for their help in fine-tuning the platform.Thanks for weighing in. Always cool to hear different viewpoints. Let me know if you've got any other thoughts or questions. Cheers!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "May 31, 2023, 09:43:28 PM",
      "body": "Just wondering.Does the testing process involve testers connecting their exchange API keys to the platform?I haven't very well understood how the platform works, any detailed documentation you can provide about the platform, Even a link would be helpfulI would also like to know how old the platform has been.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "anachorette_python",
      "created_time": "June 01, 2023, 09:18:07 AMLast edit: June 01, 2023, 04:51:06 PM by anachorette_python",
      "body": "Quote from: logfiles on May 31, 2023, 09:43:28 PMJust wondering.Does testing involve testers connecting their exchange API keys to the platform?I haven't very well understood how the platform works; any detailed documentation you can provide about the platform, Even a link, would be helpful.I would also like to know how old the platform has been.Testers will have to connect their exchange API keys to the platform to connect to strategies and perform auto-following. But we acknowledge that some people might not want to share it or don't want to halt their trading on the test period, so we also could provide a sub-account as a registered Binance broker.The platform's performance tracking/analytics side is working since October 2020. Sorry, but documentation is for internal use and constantly updating, but it basically works as the following: User connects the API key to the platform > We extract all his transactions, orders, liquidations, etc., directly from the exchange > To see the analytics user creates a portfolio, sets up a start date as a beginning of return calculation, privacy settings, visibility in rating, writes a description > after portfolio was made the user is free to share the link on his portfolio hosted by TradeLink, or create a widget to embed it into his website, it will also appear in the rating table if the user has chosen it to be this way.Users can also enhance their profile with information about themselves, add telegram, YT, Twitter, parse posts from their telegram channel, etc. Here is the example of a public portfolio that is also visible in the rating: https://tradelink.pro/portfolio/bb343404-ce4b-4555-b637-f6e319165ca9?startDate=2022-02-10&endDate=2023-05-31Over two years, many traders have come to our platform, and using our tools made it easy to distinguish amateurs from professionals. We've made many contacts with mostly Algo traders and algotrading teams. So we've decided that a curated platform offering connection to various algo strategies would be a nice and fresh idea for the crypto market. Throughout development, we've met with technology, allowing us to jointly execute more than one algo strategy on a single account, somewhat resembling a multi-manager/multi-strategy approach that hedge funds use. Still, in our case, we make it available for individuals without transferring your funds to someone's custody.The marketplace side of the platform works(will work) as the following: user adds API keys with trade permissions to our platform > select the desired amount of listed trading strategies, or chooses to follow our pre-selected and managed preset of trading strategies > user is free to set up weights of each strategy selected > he saves his preset and now able to launch the auto-following. In the future, we want to give users the functionality to edit the composition and weights of their launched preset and allow other users to follow their presets for mutual benefit. We expect this will foster rising of individual strategy managers in the community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "anachorette_python",
      "created_time": "June 24, 2023, 03:37:28 PMLast edit: June 24, 2023, 08:26:18 PM by anachorette_python",
      "body": "Hello there! Here is a little update on how the test is going and for bumping the post (sorry). We are surprised at how smoothly it's going, maybe thanks to the huge upside of the market in the last few days. We apply all who wish to participate have 100 bucks on their Binance futures accountshttps://i.imgur.com/OhPUPYY.png",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "June 24, 2023, 07:14:12 PM",
      "body": "Well, nice presentation. I would like to know if there is going to be any form of KYC verification needed incase you guys go live?Would there be any benefits for those who newly join and give thier best to see that this idea becomes a success, even on telegram?If you haven't answered this questions and already provided the answer then you have alot of work to do .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "anachorette_python",
      "created_time": "June 24, 2023, 08:24:39 PM",
      "body": "Quote from: Bananington on June 24, 2023, 07:14:12 PMWell, nice presentation. I would like to know if there is going to be any form of KYC verification needed incase you guys go live?Would there be any benefits for those who newly join and give thier best to see that this idea becomes a success, even on telegram?If you haven't answered this questions and already provided the answer then you have alot of work to do .Hello, thank you for your appreciation.Q. Do we planning to have any form of KYC verification needed in case you guys go live?A. No, we are not planning to implement KYC. It's unnecessary in our case because, technically, we are a trading bot that works via API with crypto exchanges. Atm we support Binance, which has its own KYCQ. Would there be any benefits for those who newly join?A. Early birds will benefit substantially when the platform goes live. First, they will not be obligated to pay a profit-sharing fee for a year after the platform goes live, plus they are not obliged to pay that fee during a test. Second, they'll receive unique badges and profiles on our platform. It will help them establish themselves more easily when we drop the feature for following active index managers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "June 25, 2023, 10:10:13 AM",
      "body": "Quote from: anachorette_python on June 24, 2023, 08:24:39 PM...Q. Would there be any benefits for those who newly join?A. Early birds will benefit substantially when the platform goes live. First, they will not be obligated to pay a profit-sharing fee for a year after the platform goes live, plus they are not obliged to pay that fee during a test. Second, they'll receive unique badges and profiles on our platform. It will help them establish themselves more easily when we drop the feature for following active index managers.Testing is always fraught with risks. In this case, there is a high probability that the tester will lose his money for the sake of illusory benefits in the future. The ideal solution would be to allocate a deposit for testing to testers who would be selected by you for this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "anachorette_python",
      "created_time": "June 25, 2023, 10:45:11 AM",
      "body": "Quote from: tvplus006 on June 25, 2023, 10:10:13 AMQuote from: anachorette_python on June 24, 2023, 08:24:39 PM...Q. Would there be any benefits for those who newly join?A. Early birds will benefit substantially when the platform goes live. First, they will not be obligated to pay a profit-sharing fee for a year after the platform goes live, plus they are not obliged to pay that fee during a test. Second, they'll receive unique badges and profiles on our platform. It will help them establish themselves more easily when we drop the feature for following active index managers.Testing is always fraught with risks. In this case, there is a high probability that the tester will lose his money for the sake of illusory benefits in the future. The ideal solution would be to allocate a deposit for testing to testers who would be selected by you for this.This is an ideal solution only on the tester's side. We are not a charity fund to give away a minimum of 100$ for each early adopter of our product. Wanna make yourself an early adopter of our product, obviously there will be some risks involved. Go ahead, and check out our platform, because at this stage platform needs feedback for enhancing user experience more than AUM. Only early users of our product can deliver such value to us, so we will able to make a viable product and win the investing rounds",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "June 25, 2023, 01:28:27 PM",
      "body": "Quote from: Bananington on June 24, 2023, 07:14:12 PMWell, nice presentation. I would like to know if there is going to be any form of KYC verification needed incase you guys go live?Would there be any benefits for those who newly join and give thier best to see that this idea becomes a success, even on telegram?If you haven't answered this questions and already provided the answer then you have alot of work to do .This is still a risk on testers whether benefit or not. To give out your KYC information in a phase as such that you can't verify yet on the real outcome of the project, looks like testing to what you can't guarantee. If the project go live then it can be followed but at the moment I will be skeptical even though it has given some information about it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "anachorette_python",
      "created_time": "June 25, 2023, 01:39:00 PM",
      "body": "Quote from: palle11 on June 25, 2023, 01:28:27 PMQuote from: Bananington on June 24, 2023, 07:14:12 PMWell, nice presentation. I would like to know if there is going to be any form of KYC verification needed incase you guys go live?Would there be any benefits for those who newly join and give thier best to see that this idea becomes a success, even on telegram?If you haven't answered this questions and already provided the answer then you have alot of work to do .This is still a risk on testers whether benefit or not. To give out your KYC information in a phase as such that you can't verify yet on the real outcome of the project, looks like testing to what you can't guarantee. If the project go live then it can be followed but at the moment I will be skeptical even though it has given some information about it Could you clarify, what means \"go live\" for you? Currently, we've established the platform \"as is\" for users to decide on its further development, so gathering feedback is essential for us. We want to make the development go in the right way, so we are not just simply copying other social trading platforms, but learning to build such platforms from scratch. https://tradelink.pro/marketplace - provide feedback please",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "June 25, 2023, 04:21:56 PM",
      "body": "Quote from: anachorette_python on June 25, 2023, 10:45:11 AMQuote from: tvplus006 on June 25, 2023, 10:10:13 AMQuote from: anachorette_python on June 24, 2023, 08:24:39 PM...Q. Would there be any benefits for those who newly join?A. Early birds will benefit substantially when the platform goes live. First, they will not be obligated to pay a profit-sharing fee for a year after the platform goes live, plus they are not obliged to pay that fee during a test. Second, they'll receive unique badges and profiles on our platform. It will help them establish themselves more easily when we drop the feature for following active index managers.Testing is always fraught with risks. In this case, there is a high probability that the tester will lose his money for the sake of illusory benefits in the future. The ideal solution would be to allocate a deposit for testing to testers who would be selected by you for this.This is an ideal solution only on the tester's side. We are not a charity fund to give away a minimum of 100$ for each early adopter of our product...You want testers to spend their time for free, as if there is no other job for them anymore. But I'm not ready to spend my time testing your platform for free, besides, it involves the risk of losing money. I think that others think the same and, accordingly, you will not find free testers for yourself here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "anachorette_python",
      "created_time": "June 25, 2023, 04:26:15 PM",
      "body": "Quote from: tvplus006 on June 25, 2023, 04:21:56 PMQuote from: anachorette_python on June 25, 2023, 10:45:11 AMQuote from: tvplus006 on June 25, 2023, 10:10:13 AMQuote from: anachorette_python on June 24, 2023, 08:24:39 PM...Q. Would there be any benefits for those who newly join?A. Early birds will benefit substantially when the platform goes live. First, they will not be obligated to pay a profit-sharing fee for a year after the platform goes live, plus they are not obliged to pay that fee during a test. Second, they'll receive unique badges and profiles on our platform. It will help them establish themselves more easily when we drop the feature for following active index managers.Testing is always fraught with risks. In this case, there is a high probability that the tester will lose his money for the sake of illusory benefits in the future. The ideal solution would be to allocate a deposit for testing to testers who would be selected by you for this.This is an ideal solution only on the tester's side. We are not a charity fund to give away a minimum of 100$ for each early adopter of our product...You want testers to spend their time for free, as if there is no other job for them anymore. But I'm not ready to spend my time testing your platform for free, besides, it involves the risk of losing money. I think that others think the same and, accordingly, you will not find free testers for yourself here.I understand your feelings and thank you for voicing your concerns. However, there seems to be a bit of a misunderstanding here. We are not looking for testers, but rather early adopters who would find value in our platform. We aim to create a transparent, trustable, and fair ecosystem for traders and investors. We believe that traders who are confident in their trading strategies will find value in our platform to showcase their trading skills backed by hard data. Similarly, investors who are looking for a curated selection of proven trading strategies will also find our platform beneficial. We're inviting people to use our platform as it is intended to be used: as a tool to promote transparency in trading and to make the trading market more accessible for everyone. The intention is not to have people \"test\" for us but rather to create a community of users who genuinely benefit from our services. I hope this clears up any confusion. If you have any further questions or concerns, please do not hesitate to reach out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "June 25, 2023, 09:04:37 PM",
      "body": "Quote from: anachorette_python on June 25, 2023, 04:26:15 PM...We are not looking for testers, but rather early adopters who would find value in our platform. ..You are trying to get out during the dialogue. Your first message, which has already been edited, states: \"We need beta testers for a month. The commitment? A few minutes a week of your time to check the demo statistics and copy-trading results, and to note any inconsistencies. We're looking for folks who have a Binance Futures account.\"In addition, here you are also talking about testers and a specific task for them:Quote from: anachorette_python on June 01, 2023, 09:18:07 AMTesters will have to connect their exchange API keys to the platform to connect to strategies and perform auto-following. ..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "anachorette_python",
      "created_time": "June 25, 2023, 10:07:45 PM",
      "body": "Quote from: tvplus006 on June 25, 2023, 09:04:37 PMQuote from: anachorette_python on June 25, 2023, 04:26:15 PM...We are not looking for testers, but rather early adopters who would find value in our platform. ..You are trying to get out during the dialogue. Your first message, which has already been edited, states: \"We need beta testers for a month. The commitment? A few minutes a week of your time to check the demo statistics and copy-trading results, and to note any inconsistencies. We're looking for folks who have a Binance Futures account.\"In addition, here you are also talking about testers and a specific task for them:Quote from: anachorette_python on June 01, 2023, 09:18:07 AMTesters will have to connect their exchange API keys to the platform to connect to strategies and perform auto-following. ..So, these \"specific tasks,\" \"check demo statistics,\" \"note any inconsistencies\" requirements can be simply described as using the product normally. if you are interested, you use it. If not, well go your way. Testers and early adopters are interchangeable concepts in our context",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "June 26, 2023, 10:13:36 AM",
      "body": "Quote from: anachorette_python on June 25, 2023, 10:07:45 PMSo, these \"specific tasks,\" \"check demo statistics,\" \"note any inconsistencies\" requirements can be simply described as using the product normally. if you are interested, you use it. If not, well go your way. Testers and early adopters are interchangeable concepts in our contextSince you changed the name of the thread to \"Looking for early birds...\", this confirms the fact that there is still a difference between testers and early adopters, which you deny. Well, I went my own way with the hope that those who had some desire to stay here would follow me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "anachorette_python",
      "created_time": "June 26, 2023, 10:29:10 AM",
      "body": "Quote from: tvplus006 on June 26, 2023, 10:13:36 AMQuote from: anachorette_python on June 25, 2023, 10:07:45 PMSo, these \"specific tasks,\" \"check demo statistics,\" \"note any inconsistencies\" requirements can be simply described as using the product normally. if you are interested, you use it. If not, well go your way. Testers and early adopters are interchangeable concepts in our contextSince you changed the name of the thread to \"Looking for early birds...\", this confirms the fact that there is still a difference between testers and early adopters, which you deny. Well, I went my own way with the hope that those who had some desire to stay here would follow me.Inherently yes, this was my mistake in changing the topic name. I've overlooked that some people will consider my presentation as an unfair tradeoff where we HIRING people for a test for free. We have our own Q&A team, so the new topic name now truly aligns with our intention to bring early adopters to our product",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptocurencyKing",
      "created_time": "June 26, 2023, 11:18:04 AM",
      "body": "Quote from: anachorette_python on May 30, 2023, 11:39:11 AMNow, the burning question: Does copy-trading work? Well, everyone knows that anyone you auto-follow might eventually have a downturn. But here's where our platform differs: we offer a unique diversification mechanism through joint auto-following of multiple algorithms.Not trying to throw us a bunch of Buzz tech words! Some how, I find that in these… lol.Anyway, it’s okay but in all that, you might as well not distinguish your program from having a down time. It’s real and happens no matter how professional or the algorithm your program works on.Still, copy trading isn’t my thing, I’ve got reasons not to go into that and they are good enough for me. Still, I wish you guys luck in what your building and it would be great to have people succeed off the plans you’ve got laid out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}