{
  "id": "topic_5475644",
  "title": "mixoftix",
  "author": "mixoftix",
  "created_time": "November 27, 2023, 08:41:17 AM",
  "content": "hi there..you all know very well how NFT stemmed from blockchain for managing digital assets, but I'm curious to know how NFT could enrich back blockchains and bring added value to their main function in return?based on description of NFT from Wikipedia [1] we have \"A non-fungible token (NFT) is a unique digital identifier that is recorded on a blockchain, and is used to certify ownership and authenticity.\" and Forbes [2] we know \"An NFT is a digital asset that represents real-world objects like art, music, in-game items and videos.\", therefore certifying and clarifying the ownership of something in real-world is the most capability of NFT.so why we do not convert a specified amount of e.g. 3.698521 BTC into an NFT asset and store on the same blockchain, that never again could break apart into its original fungible nature and fully assign and belong to an entity (person / AI / organization) in real-world? then no body could steal and sale it without serious consequences but also buyers could feel free when pay for it at KYC level. this is what I call it \"Bitwise NFT\".obviously there are some sort of possible advantages in \"Bitwise NFT\" feature on blockchains, but this is still a raw idea for more discussion and evaluation before implementation. thanks for reading and any feedback welcome.-- shahiN[1] https://en.wikipedia.org/wiki/Non-fungible_token[2] https://www.forbes.com/advisor/investing/cryptocurrency/nft-non-fungible-token/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475644",
  "comments": [
    {
      "author": "Who is John Galt?",
      "created_time": "November 27, 2023, 09:03:21 AM",
      "body": "Are you proposing to change the nature of Bitcoin from a peer-to-peer payment system to a museum of unique Bitcoin amounts? For what? So that it becomes impossible to actually pay them?There are so many different altcoins that you can experiment with as much as you like. Some blockchains have wrapped Bitcoins. Want to do an experiment? Invite users to convert their wrapped Bitcoins into NFTs on one of these blockchains and see what happens. And let's leave the main Bitcoin blockchain fully functional for full use as an electronic cash system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mixoftix",
      "created_time": "November 27, 2023, 09:09:38 AM",
      "body": "Quote from: Who is John Galt? on November 27, 2023, 09:03:21 AMAre you proposing to change the nature of Bitcoin from a peer-to-peer payment system to a museum of unique Bitcoin amounts? For what? So that it becomes impossible to actually pay them?of course no..this has nothing to do with peer-to-peer nature of Bitcoin / any other crypto system. and you can still pay them. just an optional feature in case of request - mostly by enterprise entities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Who is John Galt?",
      "created_time": "November 27, 2023, 09:15:21 AM",
      "body": "Quote from: mixoftix on November 27, 2023, 09:09:38 AMQuote from: Who is John Galt? on November 27, 2023, 09:03:21 AMAre you proposing to change the nature of Bitcoin from a peer-to-peer payment system to a museum of unique Bitcoin amounts? For what? So that it becomes impossible to actually pay them?of course no..this has nothing to do with peer-to-peer nature of Bitcoin / any other crypto system. and you can still pay them. just an optional feature in case of request - mostly by enterprise entities.The number of bitcoins is limited, there will not be more than 21 million. Therefore, any option to irreversibly convert any part of bitcoins into NFTs will reduce the overall supply. If this becomes popular, then over time the number of bitcoins frozen in NFTs would become too large for the blockchain to continue to function fully. Therefore, Bitcoins should remain freely fungible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "November 27, 2023, 10:03:37 AM",
      "body": "Quote from: mixoftix on November 27, 2023, 08:41:17 AMyou all know very well how NFT stemmed from blockchain for managing digital assets,How would you define an asset? Do you think this post I made here is an asset? Can I sell it to you for a million dollars?! That's what NFTs are. Nonsense being sold to people for a lot of money. They can't be called assets, and they are not unique. Anybody can make countless number of the same exact thing.Quotebased on description of NFT from Wikipedia [1] we have \"A non-fungible token (NFT) is a unique digital identifier that is recorded on a blockchain, and is used to certify ownership and authenticity.\"They are neither one of those things.Imagine the \"art NFTs\". Right now I can create some digital picture, turn it into hundreds of NFTs and sell the exact same thing to hundreds of people. None of those NFTs would be unique nor would they certify those who bought them because that digital image is on the internet for anybody to acquire and even to create an NFT of their own and sell it to more people!Quote\"An NFT is a digital asset that represents real-world objects like art, music, in-game items and videos.\", therefore certifying and clarifying the ownership of something in real-world is the most capability of NFT.Can I make an NFT of the Mona Lisa? Yes.Can I make another NFT of the same Mona Lisa and sell it again? Yes.How is that unique? And hos in the world does that clarify ownership of the Mona Lisa?!!! Quoteso why we do not convert a specified amount of e.g. 3.698521 BTC into an NFT asset and store on the same blockchain,For a very simple reason that interestingly enough has nothing to do with what I said so far:Bitcoin is a payment system not a token platform.To put simply, for the same reason why you don't eat your soup with a fork.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mixoftix",
      "created_time": "November 27, 2023, 11:09:06 AM",
      "body": "Quote from: Who is John Galt? on November 27, 2023, 09:15:21 AMIf this becomes popular, then over time the number of bitcoins frozen in NFTs would become too large for the blockchain to continue to function fully.this may consider a new kind of FORK that could happen anytime in any blockchain system. if a feature become popular, this means there was a valuable function in it, isn't it?and why you call it \"frozen\" bitcoins / alt-coins? they just do not merge into other coins, so lower / higher amount of fees related to the block size may be needed to get processed. market will find its way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mixoftix",
      "created_time": "November 27, 2023, 11:18:44 AMLast edit: November 27, 2023, 11:55:29 AM by mixoftix",
      "body": "Quote from: pooya87 on November 27, 2023, 10:03:37 AMRight now I can create some digital picture, turn it into hundreds of NFTs and sell the exact same thing to hundreds of people.this is exactly the point.I am with you in weaknesses of NFT, but this is also the same reason that also NFT could enrich back the blockchain technology as a feature. Quote from: pooya87 on November 27, 2023, 10:03:37 AMBitcoin is a payment system not a token platform.absolutely disagree.with such deduction, we will lose the value that we save over blockchain and this is a harmful approach to what we know as \"BitGoldLayer\" to evaluate BTC. preserving and circulating of value takes place at the same time, Pooya. this is what we have and know about whitepaper [1]:\"The steady addition of a constant of amount of new coins is analogous to gold miners expending resources to add gold to circulation\"[1] https://bitcoin.org/bitcoin.pdf",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Who is John Galt?",
      "created_time": "November 27, 2023, 11:25:39 AM",
      "body": "Quote from: mixoftix on November 27, 2023, 11:09:06 AMand why you call it \"frozen\" bitcoins / alt-coins? they just do not merge into other coins, so lower / higher amount of fees related to the block size may be needed to get processed. market will find its way.If I want to buy something for a hundred satoshis, and I only have an indivisible note for 1.358154 bitcoins, and the seller only has indivisible 3.5784565 bitcoins for change, then our bitcoins are frozen and we will not be able to complete the transaction, while normal bitcoins could always be used to pay.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mixoftix",
      "created_time": "November 27, 2023, 11:34:12 AM",
      "body": "Quote from: ETFbitcoin on November 27, 2023, 10:14:07 AMOnly if other party recognize usage of specific NFT as valid or legal ownership.Totally true.financial institutions who wish to invest heavily on crypto currencies will embrace it. if cryptocurrency needs to provide wholesale procedures with trusted B2B interactions, then such a feature may need to get considered. this is not suitable for household level savings.Quote from: ETFbitcoin on November 27, 2023, 10:14:07 AMBased on the goal, why don't we just sign address with specific message and let authority or other party know about it?the problem is not about introducing an address as a pre-process solution.just imagine a pool-address with almost 1000 BTCs in it and cyber criminals steal 0.5 BTC from a victim and send into that pool, then vanish the track of the BTC by extracting three separated 0.1, 0.15 and 0.25 BTC on-chain to 3 new different addresses, so nothing remains traceable with this specific 0.5 BTC, any more. but if you convert it into 0.5 \"Bitwise NFT\", the post-process nature of the solution guarantees the foot print of those specific 0.5 BTCs to any destination..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mixoftix",
      "created_time": "November 27, 2023, 11:40:16 AMLast edit: November 27, 2023, 11:54:35 AM by mixoftix",
      "body": "Quote from: Who is John Galt? on November 27, 2023, 11:25:39 AMIf I want to buy something for a hundred satoshis, and I only have an indivisible note for 1.358154 bitcoins, and the seller only has indivisible 3.5784565 bitcoins for change, then our bitcoins are frozen and we will not be able to complete the transaction, while normal bitcoins could always be used to pay.totally true,but exchanges (with strong KYC that offer) are there to solve it for you - pretty easy. just give your indivisible 3.5784565 bitcoins to an exchange and ask for different amount of BTCs (e.g. 2 BTCs as others Bitwise NFT + 1.5784565 classic bitcoins).no body hates the fees to provide such services..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "January 08, 2024, 11:47:02 AM",
      "body": "I am sure some people will find this idea interesting however investors might not find this as interesting… A lot of investors of bitcoin anticipates the time where bitcoin is being used for everyday transactions but we still have a long way to go for that to actually happen and I think basically freezing up coins will not be helping in achieving that everyday usefulness we are trying to achieve",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tsaroz",
      "created_time": "January 08, 2024, 02:54:35 PM",
      "body": "This could be achieved but it would have no obvious advantage than just storing your coins safely. And unlike coin, you won't be able to break this NFT and if sold, should be sold as such and if there's a demand, at a higher price. It would be similar to any other NFT with its lower price determined by frozen coins.NFT too are digital so are coins, associating coins with a known NFT would destroy any privacy related to it and would be a taxable asset every-time the transaction is made.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}