{
  "id": "topic_5452124",
  "title": "Abiky",
  "author": "Abiky",
  "created_time": "May 09, 2023, 04:30:19 PM",
  "content": "All of the NFTs you know and love today, have their data stored their on centralized servers (images, video, etc). What is only stored on the Blockchain is just the properties of the NFT itself. While you're basically the \"owner\" of the NFT, you could lose technically lose it if the centralized server hosting the content of the NFT goes down. So, what's the point of investing in NFTs if they can disappear in an instant? Unless all of the content is stored on the Blockchain itself, I don't see how NFTs will be able to last forever. Are there already solutions in the works that I'm not aware of? Please enlighten me on this. Your input will be greatly appreciated. Thank you.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452124",
  "comments": [
    {
      "author": "fvb",
      "created_time": "May 09, 2023, 05:00:08 PM",
      "body": "Firstly, I personally have never invested in NFTs. Because I consider it an unpromising business to buy, as I call them, ordinary pictures. I have a few and they got me as a reward for various types of work. All this, in my opinion, will soon go into oblivion and something new will appear, because technology does not stand still and develops, tomorrow there will be something else",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "May 09, 2023, 06:13:51 PM",
      "body": "Take a printscreen of the images and record the videos somehow, lol! As we can see, these NFTs' categories don't even have a reason to exist... And I fear the ones which have a practical usage will always depend on a centralized platform where they can be used to exist. Like a NFT which is a virtual game's item. You need the game platform to use your item (which is a centralized one). But if someday that game is gone, your NFT will be gone as well, since you won't be able to use it anymore in other games.Maybe if we were talking about a decentralized, open sourced game things could work slight better... But this concept still needs improvement from the industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "www.Gambler.Casino",
      "created_time": "May 09, 2023, 06:31:31 PM",
      "body": "In general, I see all NFTs as a scam   I have never bought and probably will not buy NFT!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MIner1448",
      "created_time": "May 09, 2023, 07:40:55 PM",
      "body": "You are right that NFT content is usually stored on centralized servers, and if those servers go down, the content can be lost. However, thanks to blockchain technology, NFTs have a number of advantages over other forms of digital assets.First, the blockchain is a decentralized and trusted technology that guarantees the safety of NFT properties such as ownership, authorship, and transaction history. This means that even if the centralized content server is lost, you can still prove your NFT ownership and sell it to other buyers.Secondly, there are various projects and platforms that are working to solve the NFT content storage problem. Some of them use decentralized storage networks such as IPFS (InterPlanetary File System) or Arweave to store NFT content. These technologies make it possible to distribute copies of content across multiple nodes in a network, which ensures a higher level of content preservation.Finally, many NFT creators also take care of the safety of their creations and provide access to original content or copies of it for NFT buyers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "May 09, 2023, 08:03:33 PM",
      "body": "They can last for a very, very long time. Nobody can promise you that they’ll be worth anything other than dust in decades to come though. In my opinion they are just a passing phase, a bit of a fad. I don’t think they will return to highs we saw in the last bull run. That was mostly wash trading imo. So yeah, they can last for a long tike but will people be paying big money for monkey JPEGS in 2060? I am not so sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "May 09, 2023, 09:05:47 PM",
      "body": "Quote from: Abiky on May 09, 2023, 04:30:19 PMAll of the NFTs you know and love today, have their data stored their on centralized servers (images, video, etc). What is only stored on the Blockchain is just the properties of the NFT itself. While you're basically the \"owner\" of the NFT, you could lose technically lose it if the centralized server hosting the content of the NFT goes down. So, what's the point of investing in NFTs if they can disappear in an instant? Unless all of the content is stored on the Blockchain itself, I don't see how NFTs will be able to last forever. Are there already solutions in the works that I'm not aware of? Please enlighten me on this. Your input will be greatly appreciated. Thank you. It will still stay on your wallet I guess. I think that one way of losing it is just by losing your own wallet. Shutting down a domain doesn't mean you lose your NFT as it is inside your wallet and the website you are using are just a gateway in viewing you NFT. I'm no expert in NFT but I think NFT's are stored in blockchain since there are no same NFT hashes. If it's just a NFT that is stored in a website on a centralized account that can't be transferred on a non-custodial wallet, I don't think that it is considered as NFT, It will just be a regular artwork or jpeg/gif.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "May 09, 2023, 09:25:28 PM",
      "body": "Quote from: abel1337 on May 09, 2023, 09:05:47 PMQuote from: Abiky on May 09, 2023, 04:30:19 PMAll of the NFTs you know and love today, have their data stored their on centralized servers (images, video, etc). What is only stored on the Blockchain is just the properties of the NFT itself. While you're basically the \"owner\" of the NFT, you could lose technically lose it if the centralized server hosting the content of the NFT goes down. So, what's the point of investing in NFTs if they can disappear in an instant? Unless all of the content is stored on the Blockchain itself, I don't see how NFTs will be able to last forever. Are there already solutions in the works that I'm not aware of? Please enlighten me on this. Your input will be greatly appreciated. Thank you. It will still stay on your wallet I guess. I think that one way of losing it is just by losing your own wallet. Shutting down a domain doesn't mean you lose your NFT as it is inside your wallet and the website you are using are just a gateway in viewing you NFT. I'm no expert in NFT but I think NFT's are stored in blockchain since there are no same NFT hashes. If it's just a NFT that is stored in a website on a centralized account that can't be transferred on a non-custodial wallet, I don't think that it is considered as NFT, It will just be a regular artwork or jpeg/gif. You nailed it, bro. This is not far from how we understand altcoins with soft or hard wallets. They can be stored in a safe place meaning you can keep them for a very long time. But that's not actually the main worry upon storing an NFT. It's the decreasing value every day, month, or year that makes investors anxious if they really want to support the said platform. Personally, I don't buy NFT because I am not into arts but there are different usages for this project like in the gaming industry where it could shine the brightestIn most games before (MMO), you only have the log-in and password of your account, what if you can store the avatar itself to an NFT, keep it, and sell it whenever you like without jeopardizing the account itself meaning you can just pull out the avatar to be sold as an NFT but you can keep the account. But no games last forever. Nothing last forever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ultrloa",
      "created_time": "May 09, 2023, 09:38:57 PM",
      "body": "Quote from: Abiky on May 09, 2023, 04:30:19 PMAll of the NFTs you know and love today, have their data stored their on centralized servers (images, video, etc). What is only stored on the Blockchain is just the properties of the NFT itself. While you're basically the \"owner\" of the NFT, you could lose technically lose it if the centralized server hosting the content of the NFT goes down. So, what's the point of investing in NFTs if they can disappear in an instant? Unless all of the content is stored on the Blockchain itself, I don't see how NFTs will be able to last forever. Are there already solutions in the works that I'm not aware of? Please enlighten me on this. Your input will be greatly appreciated. Thank you. Actually NFT is just the same with other category where it gain popularity and over the time it fades out. We can see the effects now where NFT is losing popularity and many people is starting to avoid to buy some art piece or even those NFT games assets since the value of almost all of them drop so bad. Provably in next following months investors will not buy any NFT as many might think the new one came out are just scams.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "May 09, 2023, 10:23:28 PM",
      "body": "If we've got some old videos that are stored on the internet like the first ever video on YouTube, then these NFTs can also stay longer as long as it's on the blockchain and the platform used for keeping them won't be gone. But the thing here is that the demand will be lower in the upcoming years having new trends that shall be followed by many. The interest that has gotten with the NFTs will also lie low and that's why I've got no more enthusiasm with them as I've just born losses with it and those that have made a lot of profit from there, they did a good job for taking advantage of the situation and selling at the right time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "May 09, 2023, 10:45:47 PM",
      "body": "Quote from: Abiky on May 09, 2023, 04:30:19 PMAll of the NFTs you know and love today, have their data stored their on centralized servers (images, video, etc). What is only stored on the Blockchain is just the properties of the NFT itself. While you're basically the \"owner\" of the NFT, you could lose technically lose it if the centralized server hosting the content of the NFT goes down. So, what's the point of investing in NFTs if they can disappear in an instant? Unless all of the content is stored on the Blockchain itself, I don't see how NFTs will be able to last forever. Are there already solutions in the works that I'm not aware of? Please enlighten me on this. Your input will be greatly appreciated. Thank you. You have understood correctly but when you are starting from the point that they should last forever, you have to adjust your expectations. Storing content in blockchain itself would be highly impractical, that's why people are buying data that can point to url etc. IPFS is pretty good solution to store the data.Nothing lasts forever, especially not altcoins or tokens, nfts are no different from this. People are buying skins to games, those are only going to be valuable as long the game has players. Same goes with nfts, there is always a centralized element in crypto when you think about it, and that's the community. At any point they can just leave. That is true with every crypto currency out there. That point it doesn't matter where your picture or what ever is stored in. There never has been any guarantees in this space. But if you pick a right community and right nfts you can be pretty sure that they last more than most altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittick",
      "created_time": "May 09, 2023, 11:28:08 PM",
      "body": "one could always backup their NFT locally, i don't see any reason why they don't if the NFT worth some money but I generally always consider NFT not as investing, it doesn't even have that much liquidity for investing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Psynthax",
      "created_time": "May 09, 2023, 11:45:11 PM",
      "body": "I think that's the disadvantage with NFT, I agree it's pointless investing in NFT like you said, moreover there are too many duplication being done by scammer to the point that I think investing in nft complete waste of money.i wonder why some nft could be worth so much, maybe because fomo but the prospective isn't there, it's just some worthless piece of investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "axxo",
      "created_time": "May 10, 2023, 12:53:16 AM",
      "body": "Quote from: Abiky on May 09, 2023, 04:30:19 PMAll of the NFTs you know and love today, have their data stored their on centralized servers (images, video, etc). What is only stored on the Blockchain is just the properties of the NFT itself. While you're basically the \"owner\" of the NFT, you could lose technically lose it if the centralized server hosting the content of the NFT goes down. So, what's the point of investing in NFTs if they can disappear in an instant? Unless all of the content is stored on the Blockchain itself, I don't see how NFTs will be able to last forever. Are there already solutions in the works that I'm not aware of? Please enlighten me on this. Your input will be greatly appreciated. Thank you. You have a good point. Currently most of NFT's have their content stored on centralized servers, which can be vulnerable to failure or shutdown. I think there are some solutions in the works to address it. The use of decentralized storage network which aim to provide more secure and decentralized way to store content. Another one is to use the block chain based content delivery network which aims to provide more efficient and decentralized way to stream video content.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abiky",
      "created_time": "May 10, 2023, 11:20:00 PM",
      "body": "Quote from: o48o on May 09, 2023, 10:45:47 PMYou have understood correctly but when you are starting from the point that they should last forever, you have to adjust your expectations. Storing content in blockchain itself would be highly impractical, that's why people are buying data that can point to url etc. IPFS is pretty good solution to store the data.Nothing lasts forever, especially not altcoins or tokens, nfts are no different from this. People are buying skins to games, those are only going to be valuable as long the game has players. Same goes with nfts, there is always a centralized element in crypto when you think about it, and that's the community. At any point they can just leave. That is true with every crypto currency out there. That point it doesn't matter where your picture or what ever is stored in. There never has been any guarantees in this space. But if you pick a right community and right nfts you can be pretty sure that they last more than most altcoins.IPFS, Sia, and Storj would be the only solutions to help preserve the content of NFTs \"forever\". Most developers/NFT creators are often focused on making money with NFTs, so this would be the least priority for them. I see NFTs as something temporary that are only meant to \"test\" the Blockchain's capabilities. The next big thing would be Soulbound Tokens (SBT) which are merits, karma, and certifications/diplomas earned by a person stored completely on the Blockchain. Another trend that will take off would be the digitalization of real world assets. Everything from Gold to Diamonds and Real Estate would be \"tokenized\" on the Blockchain. These will eventually replace NFTs as the next big thing in crypto. But if their content will be stored on centralized servers too, then we'll be getting nowhere. The future is widely unpredictable, so we can only hope for the best. Just my thoughts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitkanu",
      "created_time": "May 10, 2023, 11:26:32 PM",
      "body": "most aren't even concerned with these things, what most know is that some nft is just a mean to earn some money. heck even there are many nft that was only used for airdrops claiming and then get done with it like it doesn't exist. so I think in this regard, many are just don't care.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "May 10, 2023, 11:34:03 PM",
      "body": "Quote from: Abiky on May 09, 2023, 04:30:19 PMAll of the NFTs you know and love today, have their data stored their on centralized servers (images, video, etc). What is only stored on the Blockchain is just the properties of the NFT itself. While you're basically the \"owner\" of the NFT, you could lose technically lose it if the centralized server hosting the content of the NFT goes down. So, what's the point of investing in NFTs if they can disappear in an instant? Unless all of the content is stored on the Blockchain itself, I don't see how NFTs will be able to last forever. Are there already solutions in the works that I'm not aware of? Please enlighten me on this. Your input will be greatly appreciated. Thank you. NFTs would exist as long as the investor keeps it on his wallet address. As far as I remember, once an NFT is sold, the owner will no longer have the possession over it. However, if it is its value which is being discussed to last forever, it is more likely not to happen. First thing is that, the market price of an NFT is determined by demand and supply as well. These factors are highly being affected which could trigger sudden changes withthe market prices. But if it is just total appearance to one's wallet, as long as the platform is there, the artwork would be able there.If it is investing to NFTs, that would depend on your preference . If you are after easy money then think of all the possibilities. Not all NFTs are working fine as it supposed to. So think of whether it is something worthy of risking your money with?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeffBrad12",
      "created_time": "May 10, 2023, 11:39:06 PM",
      "body": "Quote from: Yatsan on May 10, 2023, 11:34:03 PMQuote from: Abiky on May 09, 2023, 04:30:19 PMAll of the NFTs you know and love today, have their data stored their on centralized servers (images, video, etc). What is only stored on the Blockchain is just the properties of the NFT itself. While you're basically the \"owner\" of the NFT, you could lose technically lose it if the centralized server hosting the content of the NFT goes down. So, what's the point of investing in NFTs if they can disappear in an instant? Unless all of the content is stored on the Blockchain itself, I don't see how NFTs will be able to last forever. Are there already solutions in the works that I'm not aware of? Please enlighten me on this. Your input will be greatly appreciated. Thank you. NFTs would exist as long as the investor keeps it on his wallet address. As far as I remember, once an NFT is sold, the owner will no longer have the possession over it. However, if it is its value which is being discussed to last forever, it is more likely not to happen. First thing is that, the market price of an NFT is determined by demand and supply as well. These factors are highly being affected which could trigger sudden changes withthe market prices. But if it is just total appearance to one's wallet, as long as the platform is there, the artwork would be able there.If it is investing to NFTs, that would depend on your preference . If you are after easy money then think of all the possibilities. Not all NFTs are working fine as it supposed to. So think of whether it is something worthy of risking your money with?I think thats not exactly the point here, if it's in regard of value, there are most certainly so many factors out there influencing it but the thing is, whether the NFT content could be retained forever, it's most likely no, why such NFT content be retained without the fee charged, I think each NFT owner should have the responsibility of taking care their own NFT for long term but then again I don't even think the trend of NFT could even outlives the content of the NFT itself as most of them are quite short living, eventually NFT trend will fades, it's just matter of time, even majority of NFT that was popular already forgotten, i'm sure NFT owner don't even know they formerly have some of their NFT, right now NFT doesn't seem like real investment it's just basically a game. nothing more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "poodle63",
      "created_time": "May 10, 2023, 11:39:46 PM",
      "body": "NFT will be last forever but the hype for the NFT gonna be last for shortterm. As you can see that how many NFT being created in the past during the hype of opensea and these NFT's value have been dropping so hard till now. NFT will always exist caused by it used token as identification but it will have no value anymore as the hype will be gone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "May 11, 2023, 03:16:12 AM",
      "body": "Quote from: Abiky on May 09, 2023, 04:30:19 PM(...)So, what's the point of investing in NFTs if they can disappear in an instant? Unless all of the content is stored on the Blockchain itself, I don't see how NFTs will be able to last forever. Are there already solutions in the works that I'm not aware of? Please enlighten me on this. Your input will be greatly appreciated. Thank you. If we want to talk about the trend, maybe the trend will always change like what's the current hype now, we saw before the peak of NFT which always have its peak and low, that's how the trend works.But if we want to talk about NFT itself that they are intended for permanent, immutable blockchain storage. As long as blockchain lives, NFT will be there also.The lifespan of an NFT can be affected by a number of variables, including the durability of the blockchain, how the NFT is stored and maintained, and the state of the digital asset it stands for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}