{
  "id": "topic_5460270",
  "title": "resitdev",
  "author": "resitdev",
  "created_time": "July 19, 2023, 01:11:22 AMLast edit: August 08, 2023, 10:24:18 AM by resitdev",
  "content": "I need a loan$1,000 USDT",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460270",
  "comments": [
    {
      "author": "Jocuserious",
      "created_time": "July 19, 2023, 01:23:14 AM",
      "body": "Brand new account is very dangerous and you can run away with money anytime so no one will trust you.Here no one will give you loan so try in your real life and accept it from your country bank.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Timelord2067",
      "created_time": "July 19, 2023, 05:01:36 AM",
      "body": "That's interesting.Six years ago, the website dealt in English literature. Now it's another shady looking swap site.http://web.archive.org/web/20160111190451/https://englishact.com/https://archive.md/EDueiI'd say your loan application is little more than a thinly disguised advertisement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "resitdev",
      "created_time": "July 19, 2023, 05:15:24 AM",
      "body": "I am trying to get loan for my recently openedBusiness. I am operating this website andThis business is quite economical and I am quite capable of repaying 1000 + 100= 1100 USDTI am here not to hide.Also, I have altered my adsenceWebsite to crypto exchange",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CYBER_COWBOY",
      "created_time": "July 19, 2023, 05:56:54 AM",
      "body": "Whatever reason you have for being in need of money, open a business, need to pay rent or buy food or repair your car or pay your moms hospital bill, whatever it is nobody and I mean nobody will lend you money here at this stage, and I am pretty sure that also you wouldn't lend out money to a totally stranger. This is a forum and not a charity website.Lock the topic, explore other boards here, because believe me, this forum is amazing! And I promise you will have a fun time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "July 19, 2023, 06:23:26 AM",
      "body": "Quote from: resitdev on July 19, 2023, 05:15:24 AM~~~ Sorry to disappoint but you won't get a single dime from anyone here in this forum and no matter what you want to use the funds for no one is willing to just handout their money to a random user who just created an account in a forum and made his first post in the lending board. If accounts that have managed to rank up to a reasonable rank can still default loan what then should we expect from a brand new account that is asking for loan without any collateral but his words that he will pay. We have seen a lot of accounts come and make such claims. Even if you are sincere about repaying back just know that the risk is too much, and you should probably look for other means to get the required money to find your project. You should also try your bank or any Physical loaning service in your country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "July 19, 2023, 06:45:10 AM",
      "body": "Quote from: Timelord2067 on July 19, 2023, 05:01:36 AM-snip-Six years ago, the website dealt in English literature. Now it's another shady looking swap site.According to similarweb archive, this site was even still themed English Literature a month ago, which was later sold. This substantive change I think hasn't been over a month, and yes one shouldn't believe that op's business is even able to raise $100 a month to pay interest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "resitdev",
      "created_time": "July 19, 2023, 08:02:41 AM",
      "body": "I am generating consistent profit exchanging crypto. If you give me the loan I will definitely pay you timely. I am taking 2% profit in each transaction. There is no way of loosing money. Mail me, or Whatsapp me I will show you full process with proof.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "resitdev",
      "created_time": "July 19, 2023, 11:17:55 AM",
      "body": "But I need some urgent crypto loan. Is there any way to get it. I am not spam or fake. I am going to establish real business. If there is any ligit way, please suggest me. One thing to be mentioned, I will be a prfect client of a real lender. Someone has already taken 106 USDT as fee from me for giving me a loan.But unfortunately they did not give me. Frinkly I am looking for a real lender. Plase help me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Timelord2067",
      "created_time": "July 19, 2023, 12:22:23 PM",
      "body": "Quote from: resitdev on July 19, 2023, 11:17:55 AMBut I need some urgent crypto loan. Is there any way to get it. I am not spam or fake. I am going to establish real business. If there is any ligit way, please suggest me. One thing to be mentioned, I will be a prfect client of a real lender. Someone has already taken 106 USDT as fee from me for giving me a loan.But unfortunately they did not give me. Frinkly I am looking for a real lender. Plase help me.Perhaps if you had kept the English language site the way it was, your grammar and spelling wouldn't be as appalling as they are now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CYBER_COWBOY",
      "created_time": "July 19, 2023, 12:38:10 PM",
      "body": "Quote from: resitdev on July 19, 2023, 11:17:55 AMBut I need some urgent crypto loan. Is there any way to get it. I am not spam or fake. I am going to establish real business. If there is any ligit way, please suggest me. One thing to be mentioned, I will be a prfect client of a real lender. Someone has already taken 106 USDT as fee from me for giving me a loan.But unfortunately they did not give me. Frinkly I am looking for a real lender. Plase help me.Wait, who did take 106 USDT from you?! Somebody here on the forum?  I would recommend you to ask familiy/friends then buy the crypto yourself, if they don't want to lend out money to you, no one else will sadly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "July 20, 2023, 05:53:28 AM",
      "body": "So which one is right?Here you say you make 2% profit (business goes on), Quote from: resitdev on July 19, 2023, 08:02:41 AMI am generating consistent profit exchanging crypto. If you give me the loan I will definitely pay you timely. I am taking 2% profit in each transaction. There is no way of loosing money. while a few hours later you say you're just going to start.Quote from: resitdev on July 19, 2023, 11:17:55 AMBut I need some urgent crypto loan. Is there any way to get it. I am not spam or fake. I am going to establish real business. Quote from: resitdev on July 19, 2023, 11:17:55 AM-snip-If there is any ligit way, please suggest me.Yes sure, read this. Requests for legitimacy must come from 2 parties. If you agree with the forum lending terms, let us know. We have several recommended lenders that are quite trusted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "July 20, 2023, 06:11:43 AM",
      "body": "Quote from: resitdev on July 19, 2023, 08:02:41 AMI am generating consistent profit exchanging crypto. If you give me the loan I will definitely pay you timely. I am taking 2% profit in each transaction. There is no way of loosing money. You're generating s****! Not with your script that is so poorly configurated it shows stuff like this:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "July 21, 2023, 01:45:02 PM",
      "body": "Quote from: resitdev on July 19, 2023, 08:02:41 AMI am generating consistent profit exchanging crypto. If you give me the loan I will definitely pay you timely. I am taking 2% profit in each transaction. There is no way of loosing money. Mail me, or Whatsapp me I will show you full process with proof.Are you serious, you start a crypto exchange service without $1000 in your pocket? If you can earn $1100 in a month on this site of yours, then there is no need to look for a loan. I really doubt the situation, someone must be an idiot to use your site for exchange.Otherwise, your site looks like children were playing and made their first web page.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "July 22, 2023, 10:43:22 PM",
      "body": "Quote from: resitdev on July 19, 2023, 08:02:41 AMI am generating consistent profit exchanging crypto. If you give me the loan I will definitely pay you timely. I am taking 2% profit in each transaction. There is no way of loosing money. Mail me, or Whatsapp me I will show you full process with proof.Then perhaps you should rely on your website to make for you the necessary money instead of looking for a loan from strangers with no valid collateral or guarantee to pay it back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "July 24, 2023, 10:08:45 AM",
      "body": "Like everyone said you won't get any loan from lenders of the forum without a valid collateral, and your account is very new that's why you aren't eligible for non-colleterial loans that a few lenders provide to the Sr members or above rank members of the forum who of course are active on forum and using it on daily or weekly basis. I recommend you to either provide a valid collateral if you have or find another website or an offline lender that would be willing to lend you money. Your chances of getting a loan on this forum are very low and that's why you should go search for a loan somewhere else. The lenders have already made the mistake of trusting newbies in past and they won't be repeating the mistake again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "July 24, 2023, 05:00:02 PM",
      "body": "I'm surprised the OP hasn't been tagged yet for asking for a non-collateral loan. Although that's not the only thing that looks fishy on his part in this thread.  I am in a cooling off tagging period, but he looks like a candidate to have justified tags in his profile.Other than that:Quote from: CYBER_COWBOY on July 19, 2023, 12:38:10 PMWait, who did take 106 USDT from you?! Somebody here on the forum?  If that was on the forum, OP should say who, although it seems that he has not logged in for a few days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}