{
  "id": "topic_5443811",
  "title": "bitmover",
  "author": "bitmover",
  "created_time": "March 06, 2023, 10:30:50 PM",
  "content": "Vocês viram isso?Decolar vai liberar pagamento com bitcoin na Argentina, onde é chamado de despegar.Quotehttps://livecoins.com.br/despegar-libera-pagamentos-de-passagens-aereas-com-bitcoin-e-criptomoedas/Decolar libera pagamentos de passagens aéreas com bitcoin e criptomoedasNo Brasil, empresa opera com o nome Decolar, mas opção de criptomoedas ainda não chega no país. Contudo, Despegar quer liberar opção em todos os países que atua em breve, sinalizando que brasileiros poderão pagar com bitcoin.Deve chegar em breve ao Brasil. !Na Argentina isso deve ser mais necessário,  onde a moeda é muit instável. Espero q não cheguemos nessa situação",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5443811",
  "comments": [
    {
      "author": "Disruptivas",
      "created_time": "March 07, 2023, 11:07:55 AM",
      "body": "Eu fico bem animada com essas notícias. Quanto mais lugares aceitando e menos dependencia do sistema fiduciário, sem dúvida alguma, muito melhor!! E é bom que agora lugares/serviços ''mais caros''aceitem. A unica coisa que fico pensando é que é comum que as pessoas paguem esse tipo de serviço em várias parcelas né, e isso não da com cripto e talvez dificultaria a adoção para tais pessoas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 07, 2023, 10:03:45 PM",
      "body": "Tendo em conta a condição financeira da Argentina, essa pode ser uma boa opção para a empresa conseguir manter um bom numero de clientes.Certamente, muitos deverão estar a converter fiat por BTC, então agora pode ser uma boa altura de usar esse BTC para fazer alguma viagem.Esperemos agora, que a medida tenha realmente adesão de modo a continuar ativa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "March 08, 2023, 01:39:05 PM",
      "body": "Legal, mais um serviço bem conhecido que ajuda a propagar o pagamento com criptosQuote from: joker_josue on March 07, 2023, 10:03:45 PMEsperemos agora, que a medida tenha realmente adesão de modo a continuar ativa.Isso é o que sempre espero também, torço pra que o pessoal use cada vez mais e se torne popular para mais lugares aceitarem as criptos.Confesso que eu mesmo fico com dó de gastar minhas criptos e acabo só adquirindo e holdando  Talvez esse seja um grande problema, pois muita gente deve ser assim",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l3pox",
      "created_time": "March 08, 2023, 04:14:00 PM",
      "body": "Quote from: Disruptivas on March 07, 2023, 11:07:55 AMEu fico bem animada com essas notícias. Quanto mais lugares aceitando e menos dependencia do sistema fiduciário, sem dúvida alguma, muito melhor!! E é bom que agora lugares/serviços ''mais caros''aceitem. A unica coisa que fico pensando é que é comum que as pessoas paguem esse tipo de serviço em várias parcelas né, e isso não da com cripto e talvez dificultaria a adoção para tais pessoas. também sempre vejo com bons olhos mais adoção por parte de empresas.a parte do pagamento parcelado poderia ser resolvida com smart contracts na ethereumacho que é só questão de tempo inclusive",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "March 08, 2023, 04:16:40 PM",
      "body": "Quote from: Lucasgabd on March 08, 2023, 04:14:00 PMa parte do pagamento parcelado poderia ser resolvida com smart contracts na ethereumacho que é só questão de tempo inclusiveDepende né. Se tiver que pagar 20 dólares pra rodar o smartcontract, tô fora  E o serviço já inclui confiança na decolar mesmo, que uma super reputação.  Então não teria muitos ganhos..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 08, 2023, 05:10:04 PM",
      "body": "Quote from: rdluffy on March 08, 2023, 01:39:05 PMConfesso que eu mesmo fico com dó de gastar minhas criptos e acabo só adquirindo e holdando  Talvez esse seja um grande problema, pois muita gente deve ser assimPois, esse é realmente o problema.No inicio, a malta ainda tinha a \"coragem\" de gastar, só temos de lembrar do Pizza Day. Mas, a uns 10 anos para cá, que essa disponibilidade em utilizar o Bitcoin como moeda de troca, diminuiu bastante.Agora as coisas possam estar a mudar um pouco, porque as ultimas estatísticas indicam um aumento no consumo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "March 08, 2023, 05:17:47 PM",
      "body": "Quote from: rdluffy on March 08, 2023, 01:39:05 PMConfesso que eu mesmo fico com dó de gastar minhas criptos e acabo só adquirindo e holdando  Talvez esse seja um grande problema, pois muita gente deve ser assimSempre falo isso, o segredo é você gastar e já repor ele. Quer comprar uma pizza de R$ 50,00 e eles aceitam Bitcoin? Compre a pizza com o Bitcoin e logo depois reponha sua carteira comprando outros R$ 50 em satoshis. Você mostrou para o comercio que se importa com o BTC e é um cliente, movimentou a rede, gerou volume, etc... tudo em uma tacada só.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 08, 2023, 07:03:31 PM",
      "body": "Quote from: TryNinja on March 08, 2023, 05:17:47 PMSempre falo isso, o segredo é você gastar e já repor ele. Quer comprar uma pizza de R$ 50,00 e eles aceitam Bitcoin? Compre a pizza com o Bitcoin e logo depois reponha sua carteira comprando outros R$ 50 em satoshis. Você mostrou para o comercio que se importa com o BTC e é um cliente, movimentou a rede, gerou volume, etc... tudo em uma tacada só.Boa estratégia, nunca tinha pensado nisso dessa maneira.Mas, dessa forma você esta a fazer circular a moeda e isso é bom para a rede e para a sua adoção.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "March 09, 2023, 01:04:24 PM",
      "body": "Quote from: TryNinja on March 08, 2023, 05:17:47 PMSempre falo isso, o segredo é você gastar e já repor ele. Quer comprar uma pizza de R$ 50,00 e eles aceitam Bitcoin? Compre a pizza com o Bitcoin e logo depois reponha sua carteira comprando outros R$ 50 em satoshis. Você mostrou para o comercio que se importa com o BTC e é um cliente, movimentou a rede, gerou volume, etc... tudo em uma tacada só.Também nunca havia pensado dessa forma. Mas eu sempre gostei de pagar em Bitcoin, mesmo em momento de altas taxas, é algo que sempre me interessei bastante porque acho que o objetivo final é esse, substituir o sistema financeiro fiduciário e só vai dar pra fazer isso quando todos usarmos no dia a dia. Mas ter esse pensamento seu ajuda em casos que tenhamos dó de gastar para altas quantias .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "March 09, 2023, 02:37:51 PM",
      "body": "Quote from: Disruptivas on March 09, 2023, 01:04:24 PMTambém nunca havia pensado dessa forma. Mas eu sempre gostei de pagar em Bitcoin, mesmo em momento de altas taxas, é algo que sempre me interessei bastante porque acho que o objetivo final é esse, substituir o sistema financeiro fiduciário e só vai dar pra fazer isso quando todos usarmos no dia a dia. Mas ter esse pensamento seu ajuda em casos que tenhamos dó de gastar para altas quantias .A maior vantagem q eu vejo no bitcoin é para pagar ou receber em outros países.Vc quer transferir dinheiro para alguém no Uruguai, em Portugal ou nos EUA? Não tem jeito mais fácil e rápido do que o bitcoin.Até cartão de crédito é difícil essas horas, pq tem muitas taxas",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "March 09, 2023, 03:45:25 PM",
      "body": "Quote from: TryNinja on March 08, 2023, 05:17:47 PMSempre falo isso, o segredo é você gastar e já repor ele. Quer comprar uma pizza de R$ 50,00 e eles aceitam Bitcoin? Compre a pizza com o Bitcoin e logo depois reponha sua carteira comprando outros R$ 50 em satoshis. Você mostrou para o comercio que se importa com o BTC e é um cliente, movimentou a rede, gerou volume, etc... tudo em uma tacada só.É uma ótima ideia mesmo, gostei, quando eu tiver a oportunidade de gastar em BTC, irei faze-lo e postarei aqui quando der certo  Quote from: bitmover on March 09, 2023, 02:37:51 PMA maior vantagem q eu vejo no bitcoin é para pagar ou receber em outros países.Vc quer transferir dinheiro para alguém no Uruguai, em Portugal ou nos EUA? Não tem jeito mais fácil e rápido do que o bitcoin.Até cartão de crédito é difícil essas horas, pq tem muitas taxas Concordo também, e acrescento que seria muito bom você poder viajar e não precisar ficar convertendo moeda, mesmo com os cartões de hoje em dia igual Nomad, que tem taxas menores do que o câmbio em espécie, seria bom poder gastar em outros países só levando Bitcoin no seu celular. Sem conversão, sem muita conta pra não sobrar ou faltar dinheiro...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "March 09, 2023, 04:22:02 PM",
      "body": "Quote from: rdluffy on March 09, 2023, 03:45:25 PMConcordo também, e acrescento que seria muito bom você poder viajar e não precisar ficar convertendo moeda, mesmo com os cartões de hoje em dia igual Nomad, que tem taxas menores do que o câmbio em espécie, seria bom poder gastar em outros países só levando Bitcoin no seu celular. Sem conversão, sem muita conta pra não sobrar ou faltar dinheiro...Recentemente o BTC me salvou numa viagem.Eu sempre deixo uns trocados numa carteira no celular.Eu estava no exterior, e a transferência XP > N26 estava demorando demais, passaram dias e nada (ainda tudo é contado em dias úteis).Um dia perdi a paciência, fiz o KYC na Bitstamp de noite pq estava desatualizado.De manhã transferi o Bitcoin do celular para a Bitstamp e saquei. O processo todo demorou menos de 20minutos para cair na minha conta do N26.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 09, 2023, 07:19:37 PM",
      "body": "Quote from: bitmover on March 09, 2023, 02:37:51 PMA maior vantagem q eu vejo no bitcoin é para pagar ou receber em outros países.Sim, isso também é bom.Mas, para funcionar bem era preciso haver mais comerciantes aceitarem BTC.Agora, muitas vezes fico com a sensação que o comerciante até esta disposto em aceitar, mas como muito poucas pessoas utilizam acaba por cair no esquecimento de deixam de usar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l3pox",
      "created_time": "March 12, 2023, 02:04:40 PM",
      "body": "Quote from: bitmover on March 08, 2023, 04:16:40 PMQuote from: Lucasgabd on March 08, 2023, 04:14:00 PMa parte do pagamento parcelado poderia ser resolvida com smart contracts na ethereumacho que é só questão de tempo inclusiveDepende né. Se tiver que pagar 20 dólares pra rodar o smartcontract, tô fora  E o serviço já inclui confiança na decolar mesmo, que uma super reputação.  Então não teria muitos ganhos..poderia ser numa L2 como a polygon (ou qualquer outra com tecnologia EVM), a taxa seria irrisória, mas a tecnologia seria da ethereumSó uma sugestão para pagar com crypto parcelado, inclusive ainda não vi muita coisa nesse sentido mas já deve existirQuote from: bitmover on March 09, 2023, 02:37:51 PMQuote from: Disruptivas on March 09, 2023, 01:04:24 PMTambém nunca havia pensado dessa forma. Mas eu sempre gostei de pagar em Bitcoin, mesmo em momento de altas taxas, é algo que sempre me interessei bastante porque acho que o objetivo final é esse, substituir o sistema financeiro fiduciário e só vai dar pra fazer isso quando todos usarmos no dia a dia. Mas ter esse pensamento seu ajuda em casos que tenhamos dó de gastar para altas quantias .A maior vantagem q eu vejo no bitcoin é para pagar ou receber em outros países.Vc quer transferir dinheiro para alguém no Uruguai, em Portugal ou nos EUA? Não tem jeito mais fácil e rápido do que o bitcoin.Até cartão de crédito é difícil essas horas, pq tem muitas taxas sem nem falar em Paypal, transferwise, etc... cobram taxas percentuais que sempre costumam ser altas.o Paypal cobra mais de 7% para receber pagamentos internacionais no Brasil, acho muito absurdoQuote from: bitmover on March 09, 2023, 04:22:02 PMQuote from: rdluffy on March 09, 2023, 03:45:25 PMConcordo também, e acrescento que seria muito bom você poder viajar e não precisar ficar convertendo moeda, mesmo com os cartões de hoje em dia igual Nomad, que tem taxas menores do que o câmbio em espécie, seria bom poder gastar em outros países só levando Bitcoin no seu celular. Sem conversão, sem muita conta pra não sobrar ou faltar dinheiro...Recentemente o BTC me salvou numa viagem.Eu sempre deixo uns trocados numa carteira no celular.Eu estava no exterior, e a transferência XP > N26 estava demorando demais, passaram dias e nada (ainda tudo é contado em dias úteis).Um dia perdi a paciência, fiz o KYC na Bitstamp de noite pq estava desatualizado.De manhã transferi o Bitcoin do celular para a Bitstamp e saquei. O processo todo demorou menos de 20minutos para cair na minha conta do N26.que legal! em qual país? foi tranquilo abrir a N26 apenas com cpf brasileiro ou vc tem cidadania em outros lugares e docs internacionais? Lembro que abri um N26 uma vez mas não conseguia usar pq não tinha o número de identificação europeu",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "March 13, 2023, 12:11:44 AM",
      "body": "Quote from: Lucasgabd on March 12, 2023, 02:04:40 PMque legal! em qual país? foi tranquilo abrir a N26 apenas com cpf brasileiro ou vc tem cidadania em outros lugares e docs internacionais? Lembro que abri um N26 uma vez mas não conseguia usar pq não tinha o número de identificação europeuFoi na Grécia.A conta do n26 eu abri fazem muitos anos e na época não precisava de cidadania. Eu aluguei uma caixa postal.Um colega abriu recentemente com cidadania e endereço fora, mas acredito que basta um endereço (no seu nome) no exterior.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l3pox",
      "created_time": "March 17, 2023, 01:46:53 PM",
      "body": "Quote from: bitmover on March 13, 2023, 12:11:44 AMQuote from: Lucasgabd on March 12, 2023, 02:04:40 PM<...>Foi na Grécia.A conta do n26 eu abri fazem muitos anos e na época não precisava de cidadania. Eu aluguei uma caixa postal.Um colega abriu recentemente com cidadania e endereço fora, mas acredito que basta um endereço (no seu nome) no exterior.o amigo do sobrinho da ex-noiva do meu primo abriu uma em Portugal usando só um endereço (ele é Brasileiro) e na hora de tentar usar a conta pediram um número de identificação tipo CPF europeu, então não funcionavamas talvez o sistema tenha mudadovocês sabem se a N26 disponibiliza investimento com rendimento em conta estilo nubank, algo como um tesouro direto europeu?um outro amigo que mora em Portugal estava curioso sobre isso",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "March 17, 2023, 02:02:54 PM",
      "body": "Quote from: Lucasgabd on March 17, 2023, 01:46:53 PMvocês sabem se a N26 disponibiliza investimento com rendimento em conta estilo nubank, algo como um tesouro direto europeu?um outro amigo que mora em Portugal estava curioso sobre issoTem opções melhores.Recomendo a degiro.ieFácil e barata, deve ser a melhor corretora low cost na Europa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "March 17, 2023, 05:16:14 PM",
      "body": "Quote from: Lucasgabd on March 17, 2023, 01:46:53 PMo amigo do sobrinho da ex-noiva do meu primo abriu uma em Portugal usando só um endereço (ele é Brasileiro) e na hora de tentar usar a conta pediram um número de identificação tipo CPF europeu, então não funcionavaAqui não pediu nenhum documento europeu.Quote from: Lucasgabd on March 17, 2023, 01:46:53 PMvocês sabem se a N26 disponibiliza investimento com rendimento em conta estilo nubank, algo como um tesouro direto europeu?um outro amigo que mora em Portugal estava curioso sobre issoNão achei nada disso no app, então acho que a resposta é não.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 18, 2023, 12:46:12 AM",
      "body": "Quote from: TryNinja on March 17, 2023, 05:16:14 PMQuote from: Lucasgabd on March 17, 2023, 01:46:53 PMo amigo do sobrinho da ex-noiva do meu primo abriu uma em Portugal usando só um endereço (ele é Brasileiro) e na hora de tentar usar a conta pediram um número de identificação tipo CPF europeu, então não funcionavaAqui não pediu nenhum documento europeu.As regras alteram a coisa de 1 ano, e agora praticamente todos esses bancos digitais, são obrigados a solicitar o numero fiscal do titular.Se ainda não pediram, é porque já la tem essa informação (se será a correta ou não, é outra questão), caso contrario ainda deverão vir a pedir.Normalmente existe um prazo bem alargado para essa informação ser apresentada.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}