{
  "id": "topic_5483489",
  "title": "Ravichnadra",
  "author": "Ravichnadra",
  "created_time": "January 30, 2024, 10:04:17 AM",
  "content": "Hello everyone a very good day you all. So, let’s talk about this interesting duo: cryptocurrency and traditional banking. Some say traditional banks are threatened by crypto’s rise, while others think they’re starting to see the potential and hopping on the bandwagon. Either way, it’s a fascinating dynamic to watch unfold. What do you think? Are they destined for a happily ever after or is this just a temporary fling? Let me know your thoughts on this.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5483489",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "January 30, 2024, 10:19:30 AM",
      "body": "Cryptocurrencies are not threats to traditional banks. Many countries banned bitcoin and all other cryptocurrencies in the past but after some of them are knowing about what cryptocurrencies are, they unban them. Since today, all countries that accept cryptocurrencies and the ones that are very friendly with them have no problem, there banking sector has no problem. You can even see in those countries that some banks are allowed to hold coins and tokens for their customers. Banks can even embrace cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "January 30, 2024, 10:28:30 AM",
      "body": "Quote from: Ravichnadra on January 30, 2024, 10:04:17 AMHello everyone a very good day you all. So, let’s talk about this interesting duo: cryptocurrency and traditional banking. Some say traditional banks are threatened by crypto’s rise, while others think they’re starting to see the potential and hopping on the bandwagon. Either way, it’s a fascinating dynamic to watch unfold. What do you think? Are they destined for a happily ever after or is this just a temporary fling? Let me know your thoughts on this. When you talk about cryptocurrency, the first coin that comes in mind is Bitcoin. Without doubt bitcoin is the king of cryptocurrency and bitcoin was created by satoshi. In bitcoin whitepaper, Satoshi stated the reasons he created bitcoin and the problems that bitcoin will solve. He didn't in anyway mention that he was creating something that will displace the traditional fiat system, rather he created an alternative to the failing and highly centralized fiat system. It started like a joke but today bitcoin is a strong voice in the financial system.But one thing is obtainable in every new technology and that is evolvement. Satoshi didn't anticipate the way Bitcoin went and when the government saw the potential of bitcoin, they rose against it on the reason of high energy consumption. The allegations could not hinder bitcoin but more and more industries were adopting bitcoin. When the government truly understood the power of decentralization and blockchain, they decided to join the bandwagon. Now different countries have their CBDCs and you cannot own a CBDC as a country and still fight against cryptocurrency. It will be a gross contradiction. So, the relationship we seek between cryptocurrency and the traditional banking system is co-existence and nothing more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Natsuu",
      "created_time": "January 30, 2024, 10:45:14 AM",
      "body": "More like frenemies? Some banks are checking out the cool stuff crypto offers, hoping to lower costs and speed things up. But the whole regulatory uncertainty and crypto's wild nature make some banks a bit wary. Whether they end up partners or keep it casual depends on how they handle the balancing act between old-school rules and the crypto wave. It's a bit like a modern financial system and we still have a lot to learn",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "January 30, 2024, 10:47:23 AM",
      "body": "Quote from: Ravichnadra on January 30, 2024, 10:04:17 AM Some say traditional banks are threatened by crypto’s riseLet me know your thoughts on this. Well, these individuals with this mindset are those that are threatened by control adopting Bitcoin rids them of. Imagine when you are in control of the finance of many and all of a sudden, there comes a different and better way by which these monies can be stored, I'm sure you'd oppose it. What's there to feel threatened about, if it's privacy you seek while doing transactions, Bitcoin is the best bet but the government don't want that cause you have brushed the power they have over you to the curb and this is why they spread do much FUD to chase people away. In life, there's always going to be choices and Satoshi by introducing Bitcoin presented an alternative way to store money but there's still going to be those who'd prefer the devil they know to the angel they don't.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "January 30, 2024, 10:52:01 AM",
      "body": "Quote from: Ravichnadra on January 30, 2024, 10:04:17 AMHello everyone a very good day you all. So, let’s talk about this interesting duo: cryptocurrency and traditional banking. Some say traditional banks are threatened by crypto’s rise, while others think they’re starting to see the potential and hopping on the bandwagon. Either way, it’s a fascinating dynamic to watch unfold. What do you think? Are they destined for a happily ever after or is this just a temporary fling? Let me know your thoughts on this. Well, I will honestly say that crypto currencies and traditional banking are destined for a happily ever after, this is because  I personally believe that crypto and banks can easily co-exist, I do not think that bitcoin or crypto currencies are standing in the way of the banks, no no, banks believing this is simply out of fear and jealousy.It's like you opening a ceramics shop at one side of the road and serving customers who are interested in ceramics, and then, like 50 years later, some one else out of the blue comes around and opens another ceramics shop directly opposite yours, you will try to fight that person, because to you, he or she is a threat because he or she take customers from you.But if you look at it properly, you did discover that he or she is only there to make ceramics even more accessible to people who need it, so, seeing that he has alot of new ceramics design that you don't have, and you don't even know where to get such designs, instead of fighting, it will be better to walk up to him and see how you both can collaborate and become partners in business - this is what I think banks need to do with cryptocurrency, they can partner with Bitcoin rather than fighting it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "January 30, 2024, 11:16:31 AM",
      "body": "Quote from: Fivestar4everMVP on January 30, 2024, 10:52:01 AMWell, I will honestly say that crypto currencies and traditional banking are destined for a happily ever after, this is because  I personally believe that crypto and banks can easily co-exist, I do not think that bitcoin or crypto currencies are standing in the way of the banks, no no, banks believing this is simply out of fear and jealousy.If you have gold, you can take it to bank for save keeping. Other small valuable assets can be taken to bank. Why is cryptocurrencies different to banks? They are assets too and banks should look for ways to make it a business and to use it for profit-making purposes. We should not be!comparing cryptocurrencies and banks because exchanges is what that should be compared with banks while cryptocurrencies should only be compared with fiat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "January 30, 2024, 11:38:05 AM",
      "body": "Quote from: Ravichnadra on January 30, 2024, 10:04:17 AMSo, let’s talk about this interesting duo: cryptocurrency and traditional banking. Some say traditional banks are threatened by crypto’s rise, while others think they’re starting to see the potential and hopping on the bandwagon. Either way, it’s a fascinating dynamic to watch unfold. What do you think? Are they destined for a happily ever after or is this just a temporary fling? Crypto is acceptable to institutions. However, they refuse to accept Bitcoin or even get strong rejection from institutions in many countries.In a broad scope, when people generally hear the name cryptocurrency, the first thing that comes to mind is Bitcoin because there are quite a lot of types of crypto that come after Bitcoin. People in general think that they cannot be blamed even though Bitcoin is very different from the many types of crypto in circulation.I think the power of Bitcoin will go hand in hand with traditional banks to the extent that some of them will not accept Bitcoin.People who know how the traditional banking system works with the Bitcoin system work, they will choose to prioritize Bitcoin, but because they live in a country that still prohibits Bitcoin, maybe they will understand it and secretly also use Bitcoin according to its use.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HeRetiK",
      "created_time": "January 30, 2024, 11:40:35 AM",
      "body": "Quote from: Ravichnadra on January 30, 2024, 10:04:17 AMSo, let’s talk about this interesting duo: cryptocurrency and traditional banking. Some say traditional banks are threatened by crypto’s rise, while others think they’re starting to see the potential and hopping on the bandwagon. Either way, it’s a fascinating dynamic to watch unfold. What do you think? Are they destined for a happily ever after or is this just a temporary fling?I don't think neither crypto nor traditional banking will ever manage to kill the other, though they will keep trying whenever the opportunity arises.In the meantime I'd say it's an uneasy alliance of sorts, that will continue existing as long as they can profit off one another -- crypto by using traditional banking infrastructure for fiat off- and on-ramps; traditional banking by having new products to sell. That's a state of things that I don't see changing anytime soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "January 30, 2024, 12:55:39 PM",
      "body": "Cryptocurrency aka altcoins doesn't threating banks because both of them are centralized, the creator can froze the coins whenever the government, banks or any centralized entity ask them to freeze a specific address.But if we talk Bitcoin, surely it could threating banks because if every people are educated and choose Bitcoin over fiat, it would make banks can't make money and force them to print money which lead to inflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "January 30, 2024, 02:15:16 PM",
      "body": "The two are fundamentally different, banks are centralized controlled by some entities to be censored and has an inflationary growth while bitcoin is decentralized without any controlling body thus censorship resistant and has a deflationary growth.Both are complementing each other at this stage because you cannot completely live on crypto even today and you will need fiat or the help of the traditional banking system. Hence the two are not at war but working together.Banks have seen the potential in blockchain technology and are involving it in their infrastructure too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "January 30, 2024, 03:10:17 PM",
      "body": "Quote from: Ravichnadra on January 30, 2024, 10:04:17 AMSo, let’s talk about this interesting duo: cryptocurrency and traditional banking. Some say traditional banks are threatened by crypto’s rise, while others think they’re starting to see the potential and hopping on the bandwagon.One thing that needs to be clarified concerning bitcoin and the traditional fiat system is that they both have their differences and the people realized about what they needed to have with bitcoin after several years of being tired of using fiat currency, our privacy have long time being taken, the trust in the financial system was not achieved because they can easily manipulate reasons for making deductions on our accounts without any official permission or access, no profitability in fiat, while you can choose to invest on bitcoin and hold for a time making profits instead of loosing value in fiat due to inflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tread93",
      "created_time": "January 30, 2024, 06:07:02 PM",
      "body": "Quote from: Ravichnadra on January 30, 2024, 10:04:17 AMHello everyone a very good day you all. So, let’s talk about this interesting duo: cryptocurrency and traditional banking. Some say traditional banks are threatened by crypto’s rise, while others think they’re starting to see the potential and hopping on the bandwagon. Either way, it’s a fascinating dynamic to watch unfold. What do you think? Are they destined for a happily ever after or is this just a temporary fling? Let me know your thoughts on this. Traditional banking one day will eventually embrace the blockchain fully if they end up switching everything to a CBDC, which is looming and also a bit of a scary potential future for citizens, but this is where Bitcoin comes in handy. The one thing I always say is that of the US government pulls another rug pull on Bitcoin like they did with gold in the 1930s, I don't see that happening because there would be revolt plus it would be a completely exhausting regulatory process and getting people to comply and verify their actual holdings is too problematic",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "redsun114",
      "created_time": "January 30, 2024, 08:19:02 PM",
      "body": "It depends on how a certain region's system foresees cryptocurrencies. A lot of countries don't want Bitcoin or cryptocurrencies to be available to the general public because they feel threatened since they know Bitcoin and many other cryptocurrencies promote decentralization and financial privacy and they can't let that happen, they want to have control over the finances and financial activities of their people which won't be possible if people are using Bitcoin or some other cryptocurrencies.However, some countries and governments don't think this way and they care more about the well-being of their country and its future than personal agendas and power, and those are the countries that are welcoming the innovation and are doing their best to make it a part of their economy as they know it can be beneficial for them in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KennyR",
      "created_time": "January 30, 2024, 08:30:24 PM",
      "body": "Traditional banks lose their revenue not to the cryptocurrency but to third parties. What they say is different from reality. Most often, we see banks revealing revenue differences between two financial years and that the decrease in revenue is due to the growth of cryptocurrencies, which is a false statement. Traditional banks never go down if they're well managed. When advancement is incorporated with traditional banking, the growth will automatically be high. Some banks have begun to follow it with the addition of cryptocurrency-related services. This is a kind of mutual growth that benefits the common people who use the same platform for all their needs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "January 30, 2024, 08:32:12 PM",
      "body": "I guess it's the former that both of them will end with a happy ending. The adoption is rising and before, the talk was always about the taking over of Bitcoin, crypto over the banks.But we get to see the whole situation now and it's about the matter of adoption and banks having their own thoughts about having services related to cryptocurrencies.Before, they're like the mortal enemies but we're going to see the bandwagon or we actually seeing it since countries are having their CBDCs which is inspired by crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "January 30, 2024, 08:46:12 PM",
      "body": "The financial ecosystems are connected to each other, and fiat is ruling the world right now. Controlling the traditional banking system is mandatory, and without it, we can't live a life. We can't ignore the fact that cryptocurrency is a threat to traditional banking systems. Because if we can use cryptocurrency like fiat, then who and why will use the traditional banking system? Why do we need to trust banks if we don't need to use fiat? Since fiat is mandatory, we need to use traditional banks. . So traditional banking system dare to cryptocurrency always.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "January 30, 2024, 09:02:15 PM",
      "body": "Traditional Banks and Bitcoin share no relationship.One is centralized and another is decentralized. One operates on controlled and finite supply, another can be printed at will.Banks can hold Bitcoin just as the would any valuable asset like gold, but this does not mean that both have anything in common.I'm talking about Bitcoin specifically cause most other altcoins are not centralized and more importantly would not interest the banks when they can simply get their own by creating a CBDC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "January 30, 2024, 11:06:41 PM",
      "body": "Traditional banking system is already introducing Bitcoin and other cryptos to their platforms. They adopted cryptocurrencies, like all of us did, so there is a strong relationship between them, because the traditional banking system wants to take advantage of the profitability factor of crypto. They are just adapting themselves to the current circumstances of the world, so they don't become obsolete and overcome by common crypto investors.Here in my banking app, there are many offers of crypto investments to start, from about 0,20$ on, which you can buy and sell at anytime, although you aren't allowed to move your coins or tokens to anywhere. It means you can just buy and sell them for fiat, inside the banking platform. How convenient it is for the traditional banking system to offer this to their customers... In fact, by investing in crypto through these banks we don't actually own our funds, as it remains on their hands during the whole process of holding.Thankfully it's still possible to invest in crypto by ourselves, without relying on any middlemen services to keep our money. So, even though banking system is already into crypto, it doesn't mean you should make use of them when investing in cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "January 30, 2024, 11:36:57 PM",
      "body": "Banks are not threatened by crypto payments because so few people actually pay with crypto and the total transaction volume is just a tiny drop compared to global fiat payments. But the competition in the field of investment is more likely to happen - if people would buy Bitcoin instead of opening bank deposits, that could force banks to act. The first thing banks could easily do is to disconnect all crypto exchanges from their system, and that would kill a large share of crypto market liquidity. If that would be not enough, they could start lobbying the government to impose more restrictions on crypto activities. But so far we have seen nothing like that happening on a large scale.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}