{
  "id": "topic_5491654",
  "title": "VanKushFamily.com",
  "author": "VanKushFamily.com",
  "created_time": "April 04, 2024, 10:12:46 PM",
  "content": "I was around when Bitcoin was $5, and $30, and I Bought my First Bitcoin at $30, I then Sold at $1,000. And I was Earning 7 Bitcoins a Month for a few Months, and Cashing that out for $7,000. I Remember when it First hit $1,000 and we were Talking about Satoshis and saying \"One Day we will need to have a kind of Penny for Cryptocurrency\" and we were all Talking about how One day in the Future there would be a Need to use Satoshis as a Unit of Measurement, and Satoshis are Actually a Good Place to Start. If Each Satoshi was 1 Penny (there are 100,000,000 Satoshi in 1 Bitcoin) then Bitcoin would be a Much Higher Price. And in Order to get to that Place, we need more People to be Holding Bitcoins, more People to take Bitcoins off the Market, even People Collecting Satoshis so that they have a Stake in the Price. And the More and more people that have \"Skin in the Game\" the Higher the Price will go.And that gets to something I Talked about on this Website here:https://www.altcoinstalks.com/index.php?topic=137352.msg1335551#msg1335551First, People will need to Invest in Cloud Mining and Mining Bitcoin. That will be Part of the Price going up. There will have to be People that are Constantly involved in Mining and getting more Bitcoins, but mostly Holding them for the Future with Plans to Sell them for a Higher Price. And we want People to have Mining Machines that they can use for Other Currencies, we will always want there to be People Mining. And very Soon, we will be Helping People to use their Old Machines and Things by Creating New Currencies in the Van Kush Family Network, but that is beside the Point. But the Point is that we will always want People to be Mining, with Laptops, with ASICs, all of that will be Happening.Then, there will be an Element of Generations and Cold Storage. Maybe instead of Buying Your Friend some Bitcoins for Christmas, Buy them a Cloud Mining Hashrate. If You were going to Spend $1,000, Spend $1,000 Still, and Find the Best Hashrate for the $1,000. Some Places Offer Free Workers and Things, and that is something You will want to Learn about. But Cloud Mining is Pretty Straightforward and Easy to Learn.And on the Flip Side, more People need to get into the Cloud Mining Sales Market, there need to be Cheaper and Cheaper Cloud Mining Systems that don't go out of Business. This will involve having Other Projects with Money Coming in, such as a Currency of Your Own that is Part of the Mining Pool, as You also Create a Cloud Mining User Interface Platform. You could have Staking of Tokens You made, and Token A being Bought could be used to Mine Token B, and Token B could be Accepted at it's USD Value for Cloud Mining Services. Or Token B could be used in a Game that is Created.But there just needs to be more Cloud Mining Services.And then also, People Creating Mining Farms in Places where there is Natural Cold Year Round, and near Hydrdoelectric Dams, or with Solar Power in Places where the Sun Shines Year Round. Solar Mining will be maybe the Next most important Thing. As all of this Develops and there is a Focus on Cloud Mining, the Next Focus is Solar Mining, which is Photovoltaics.And there used to be a lot of Discussion about Raspberry Pi Machines and Solar Panels, that used to be kind of a Big Deal in the Cryptocurrency Community but many People have forgotten.And I Remember when People were saying \"Bitcoin will Never be $1,000\" then it was.Then after it was $1,000 it went to about $600-$700 and kept moving around there for maybe 2 Years, and Everyone said \"It will never be $1,000 again\" and I said Both Times that it would be $1,000. Then I said it would be $10,000 and People said that was Crazy. Then it went to $18,000 one Christmas.Then it went to $50,000, and Down to $20,000 and when it was $20,000 Everyone said \"Bitcoin is DEAD!\".Now it is almost $70,000.So once all this Other Stuff Happens, what Happens Next is Cold Storage. For example, You could have a Cold Storage Wallet (Basically a Password), that is engraved on the Inside of a Ring on Your Finger, or Hidden Printed on some Other Piece of Metal. It could be a Sword Imbued with Bitcoin. But this kind of Thing is what is going to Raise the Price of Bitcoin once we get Past the Mining Education.And now, there is a Big Mining Infrastructure, and it's not going away. So that will Grow, and Everyone will Start getting more and more invested, as a Species that is. And Eventually the Price will Reach $100,000 and $1,000,000, it just might Take 100 Years. But $100,000 Probably isn't 100 Years away.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5491654",
  "comments": [
    {
      "author": "simons_js",
      "created_time": "April 04, 2024, 10:22:13 PM",
      "body": "$100k is a logical price for now. But for $1 million? I have nothing to say. It will probably take at least another 15 years and we can talk about 1 btc = $1M",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VanKushFamily.com",
      "created_time": "April 05, 2024, 01:21:33 AM",
      "body": "Quote from: simons_js on April 04, 2024, 10:22:13 PM$100k is a logical price for now. But for $1 million? I have nothing to say. It will probably take at least another 15 years and we can talk about 1 btc = $1MIt might go to $20,000 again First (Unlikely), but it will get to $1,000,000 at some Point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SilverCryptoBullet",
      "created_time": "April 05, 2024, 01:38:24 AM",
      "body": "Quote from: VanKushFamily.com on April 04, 2024, 10:12:46 PMI was around when Bitcoin was $5, and $30, and I Bought my First Bitcoin at $30, I then Sold at $1,000. And I was Earning 7 Bitcoins a Month for a few Months, and Cashing that out for $7,000.You only created your account on January 01, 2024 and shared this story.If you were here when Bitcoin was about $5, it is about middle of 2011, many years ago.https://bitcoin.zorinaq.com/price/It is very strange that you were not in bitcointalk forum in 2011 or 2012 and only joined it this year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SickDayIn",
      "created_time": "April 05, 2024, 01:57:16 AM",
      "body": "Quote from: SilverCryptoBullet on April 05, 2024, 01:38:24 AMQuote from: VanKushFamily.com on April 04, 2024, 10:12:46 PMI was around when Bitcoin was $5, and $30, and I Bought my First Bitcoin at $30, I then Sold at $1,000. And I was Earning 7 Bitcoins a Month for a few Months, and Cashing that out for $7,000.You only created your account on January 01, 2024 and shared this story.If you were here when Bitcoin was about $5, it is about middle of 2011, many years ago.https://bitcoin.zorinaq.com/price/It is very strange that you were not in bitcointalk forum in 2011 or 2012 and only joined it this year.I understand the intent of this comment, however many people have signed up accounts here 5-10 years ago and then lost access as they lost access to their email account. I am an example of someone who only got lucky recovering my old bitcointalk account.However, back to the main topic - I certainly believe Bitcoin will hit $1m one day. It has already hit $100k for some first world currencies, besides the USD, but I don't believe this is because the value of Bitcoin has increased. Whilst CPI is only ~5% in some countries, real inflation is much higher, so the currency has been debased significantly over the past few years. Bitcoin rapidly rising is just an indicator that our paper currencies are \"trash\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "spandamoto",
      "created_time": "April 05, 2024, 02:36:51 AM",
      "body": "That's my story. Been around since 2012. Lost access to everything multiple times when laptops randomly decided to kick the bucket.$1M BTC is certainly possible. I remember when it hit $1000 and was thanking my lucky stars I could convert my Second Life Linden Dollars into BTC. It hit $20K and I thought this train was only getting started. $100K seems all but guaranteed. Probably will see $200K this bull run, maybe even $250K. $1M may require another cycle or two, so 4-8 years, but it can get there, especially if the fiat currency system implodes at the end of the 4th Turning and into the new 1st Turning. It seems like a no-brainer to open up a 5x leveraged position, with enough dry powder on the side for a 50-60% drop just in case, and ride it to $1M if you trust the exchange and aren't selling the farm to do it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odolvlobo",
      "created_time": "April 05, 2024, 04:20:13 AM",
      "body": "Quote from: VanKushFamily.com on April 04, 2024, 10:12:46 PMFirst, People will need to Invest in Cloud Mining and Mining Bitcoin. Cloud mining is an old scam. Only the newbies fall for it now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "April 05, 2024, 05:41:06 AM",
      "body": "Quote from: VanKushFamily.com on April 04, 2024, 10:12:46 PMFirst, People will need to Invest in Cloud Mining and Mining Bitcoin. That will be Part of the Price going up. There will have to be People that are Constantly involved in Mining and getting more Bitcoins,Cloud mining achieves none of these. People won't be mining, they won't be getting bitcoins (not for long anyway), it won't contribute to the price rising.The reason is simple, any cloud mining is either purely a scam Ponzi scheme or will turn into one sooner or later.Quotebut mostly Holding them for the Future with Plans to Sell them for a Higher Price.We don't want that either. From day one Satoshi didn't create bitcoin so that people can buy it, hold it and become rich! It was created to give people financial sovereignty and that can only be achieved when people use bitcoin not hold it. QuoteHelping People to use their Old Machines and Things by Creating New Currencies in the Van Kush Family Network,Was this an ad? In any case, it is not a good plan. When hardware improves (for example when ASICs come alone) you can no longer define smaller coins with the same algorithm because they will be 51% attacked due to having low hashrate. That means if you think you can get people who were mining Bitcoin with GPUs or even first gen ASICs to mine a shitcoin with the same algorithm using the same hardware you should know that anybody with better hardware can attack that shitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "April 05, 2024, 05:46:38 AM",
      "body": "QuoteFirst, People will need to Invest in Cloud Mining and Mining Bitcoin. That will be Part of the Price going up. There will have to be People that are Constantly involved in Mining and getting more Bitcoins, but mostly Holding them for the Future with Plans to Sell them for a Higher Price. And we want People to have Mining Machines that they can use for Other Currencies, we will always want there to be People Mining. And very Soon, we will be Helping People to use their Old Machines and Things by Creating New Currencies in the Van Kush Family Network, but that is beside the Point. But the Point is that we will always want People to be Mining, with Laptops, with ASICs, all of that will be Happening.1.I stopped reading after OP mentioned the cloud mining BS. Why should the people invest in cloud mining scams? Why should they invest in BTC mining? BTC mining is currently done in big mining farms with expensive equipment on an industrial scale. You can't mine BTC on your PC anymore.Why would investing in BTC mining boost the Bitcoin price? Buying actual Bitcoins can help in boosting the BTC price, not investing in mining.2.What the hell is this \"Van Kush Family Network\"? Another shitcoin?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "April 05, 2024, 06:17:37 AM",
      "body": "Quote from: odolvlobo on April 05, 2024, 04:20:13 AMCloud mining is an old scam. Only the newbies fall for it now.Quote from: pooya87 on April 05, 2024, 05:41:06 AMCloud mining achieves none of these. People won't be mining, they won't be getting bitcoins (not for long anyway), it won't contribute to the price rising.The reason is simple, any cloud mining is either purely a scam Ponzi scheme or will turn into one sooner or later.They build Ponzi scheme on Cloud in particular Cloud mining.There is a guide for newbies to avoid Cloud mining scam but it's sad to see the author account turns to be a scammer with a Ponzi too.▁ ▂ ▄ ▅ ▆ Cloudmining 101 (ponzi risk assessment) ▆ ▅ ▄ ▂ ▁",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CODE200",
      "created_time": "April 05, 2024, 06:25:33 AM",
      "body": "Good luck finding a cloud mining service that's not a scam, I'm pretty sure that you're not going to find any because it's a scam. I don't even think that you're telling us the truth here OP, ain't no way that you've been in bitcoin for a long time and you didn't know about this forum. That seems a bit suspicious if you ask me because at that time with bitcoin having little to no recognition from a lot of people, there's a high chance that this forum will pop up when you search for bitcoin. I think you're trying to promote some form of scam because why would you mention cloud mining? I don't think that you've lived in a rock so I think you've got the news of a lot of these cloud mining services that have stolen a lot of money from a lot of people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kryss191",
      "created_time": "April 05, 2024, 08:45:45 PM",
      "body": "Cloud mining isnt the right way mate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "April 05, 2024, 10:54:04 PM",
      "body": "100k USD is almost tangible.It is almost within our reach. We might see it happen this year, in fact. I even expect it to go beyond 100k USD just for a few thousand dollars. Before bitcoin reach 1M of course it would have to go at 500k usd first which I think would still take quite a long time. So no need to get your hopes up too much by thinking about 1M when it has not even reached 100k yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2Pizza410000BTC",
      "created_time": "April 05, 2024, 10:54:14 PM",
      "body": "Quote from: simons_js on April 04, 2024, 10:22:13 PM$100k is a logical price for now. But for $1 million? I have nothing to say. It will probably take at least another 15 years and we can talk about 1 btc = $1MBitcoin price reaching $100k seems very logical to me. Because we've already reached an all-time high of $74,000. Only if we raise $25k to $26k, will we reach $100k. So our next target is $100K which we are looking at achieving in 2024. But I think it will take a long time for bitcoin price to reach $1M. But surely bitcoin price will be $1M though need long time. But the main objective may be to increase the investment those who have invested will increase the investment and those who have not invested yet will invest and wait for the next new ATH.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rabbitqt",
      "created_time": "April 05, 2024, 10:59:36 PM",
      "body": "There is no doubt it will reach $100k this run. Besides being a very strong psychological level, it's barely halfway through the bull run, so we have plenty of room to move. As for $1 million, this will come with time but not for a while.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "April 05, 2024, 11:05:40 PM",
      "body": "Quote from: VanKushFamily.com on April 04, 2024, 10:12:46 PMFirst, People will need to Invest in Cloud Mining and Mining Bitcoin. Mate you have been in the cryptocurrency field for so long so you must know that almost all if not every single cloud mining services are scams or just straight up inefficient. A lot of these services are said to be ineffective and are always malfunctioning thus should not really be recommended. Maybe it would help if you had provided some examples of good cloud mining services.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "April 05, 2024, 11:24:20 PM",
      "body": "Saying that people were wrong in the past so those who make a similar argument today are also wrong is not an argument. The price is driven by objective factor, so the only good analysis is the one that studies those factors - supply and demand. Any argument that says that the price was growing in the past so it must grow in the future too should be ignored, because nothing can go up and up forever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "oktana",
      "created_time": "April 05, 2024, 11:50:03 PM",
      "body": "With the ATH that we have today, $100k is realistic though it may not be happening immediately. As for $1M, it going to take a long while, and I am not sure if right now I can speculate how long it’ll take.Quote from: VanKushFamily.com on April 04, 2024, 10:12:46 PMI Bought my First Bitcoin at $30, I then Sold at $1,000.I tell people that it is almost impossible to hold Bitcoin from the onset and have access to it but intentionally decide not to sell. Who wouldn’t want to sell something they bought for $30 when the new value is about 30x gain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cr1776",
      "created_time": "April 06, 2024, 01:06:44 AM",
      "body": "Quote from: oktana on April 05, 2024, 11:50:03 PMWith the ATH that we have today, $100k is realistic though it may not be happening immediately. As for $1M, it going to take a long while, and I am not sure if right now I can speculate how long it’ll take.Quote from: VanKushFamily.com on April 04, 2024, 10:12:46 PMI Bought my First Bitcoin at $30, I then Sold at $1,000.I tell people that it is almost impossible to hold Bitcoin from the onset and have access to it but intentionally decide not to sell. Who wouldn’t want to sell something they bought for $30 when the new value is about 30x gain. I am glad you said \"almost\".  Compounding can really pay off when you have patience.  Think about this:  I read that Warren Buffett had about $1.5 billion in his mid-50s.  Respectable for sure, but if he had died at 60, few people would've known his name.  With 120 billion now, he's made most of his money from 60-93.  It is similar with bitcoin.  Sure, going from $30 to $1000 is great, but going from $0.10 to $70000 is even better.  With the US ETFs, halving, Hong Kong ETFs, layer 2s, insane spending ($1 trillion in new debt every 100 days for the US) etc, the future looks bright for usage and eventually fiat price reflects that.As far as price goes, an order of magnitude or two (perhaps even 2.5-3) is easily possible over time if demand continues, new supply is halved, and less supply is coming on the market (e.g. from GBTC related sales for all the reasons that have been discussed elsewhere - fees in GBTC, FTX etc nonsense etc).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Essential10",
      "created_time": "April 06, 2024, 01:16:54 AM",
      "body": "Quote from: simons_js on April 04, 2024, 10:22:13 PM$100k is a logical price for now. But for $1 million? I have nothing to say. It will probably take at least another 15 years and we can talk about 1 btc = $1MAs Bitcoin reached its peak before the halving. With such a rise in Bitcoin, I am only hearing noises from all sides that Bitcoin will reach $100k soon. I also think Bitcoin will hit $100k after the halving, possibly when the bull season begins. There is no guarantee that it will go over $100k this year, maybe next year. I don't think bitcoin will reach one million in such a short time. Even if we calculate growth of $100k every four years, we still have to wait 35-40 years. Bitcoin is far from a million, for now I'm counting time on Bitcoin reaching $100k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}