{
  "id": "topic_5534361",
  "title": "d5000",
  "author": "d5000",
  "created_time": "March 06, 2025, 02:59:13 AM",
  "content": "Every time we presence a hack, theft or a ransomware wave, attacks on Bitcoin's fungibility increase. Chain analysis by exchanges and other services has already been rampant for several years, but the policies still seem to get tighter and tighter, and we have reached the point where coins are already suspicious because they come from certain exchanges or service providers (not even mixers).The question is: can the Bitcoin community do something to prevent Bitcoin's fungibility being undermined?Some ideas may be:- Read the terms of service of exchanges and service providers, and if they have unacceptable terms regarding the acceptance of \"tainted\" coins, then avoid them. (On https://kycnot.me, there are summaries of many non-KYC exchanges/services' ToS.) For me it's still acceptable if they reject some coins but then return them to the origin address.- Use CoinJoins and \"manual privacy\" measures (e.g. randomly transferring coins from addresses to another)- Avoid exchanges who have delisted privacy coins as an act of self-censorship.- Avoid offers of explicitly non-tainted coins on P2P exchanges (\"virgin coins\" and similar), to avoid the market for these \"special\" Bitcoins to become too strong, which further undermines Bitcoin's fungibility.- Search and propose alternative ways to deal with crypto heists not putting fungibility in danger, for example simply returning high-risk coins (see above) and ad hoc logging of suspicious deposits/mixing activities/exchanges.Any more ideas?I think this is a crucial topic, because the attacks on fungibility are in reality an attack of one of Bitcoin's central qualities, censorship resistance. This means that a part of Bitcoin's intrinsic value is in danger if fungibility becomes progressively undermined.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5534361",
  "comments": [
    {
      "author": "Catenaccio",
      "created_time": "March 06, 2025, 03:26:49 AM",
      "body": "Quote from: d5000 on March 06, 2025, 02:59:13 AM- Read the terms of service of exchanges and service providers, and if they have unacceptable terms regarding the acceptance of \"tainted\" coins, then avoid them. (On https://kycnot.me, there are summaries of many non-KYC exchanges/services' ToS.) For me it's still acceptable if they reject some coins but then return them to the origin address.- Use CoinJoins and \"manual privacy\" measures (e.g. randomly transferring coins from addresses to another)Bitcoin Q&A: Blacklists, Taint, and Wallet Fingerprinting.Centralized exchanges possibly won't do too deep analysis to detect tainted coins and if you want to have privacy, you can do several on-chain transactions after \"manual privacy\" measures like using Coinjoins, before making your deposits. It will cost more on chain transaction fees so it depends on your stance on it, like whether it's worth to pay that cost for better privacy as well as better safety of your fund.Quote- Avoid exchanges who have delisted privacy coins as an act of self-censorship.I agree.Quote- Avoid offers of explicitly non-tainted coins on P2P exchanges (\"virgin coins\" and similar), to avoid the market for these \"special\" Bitcoins to become too strong, which further undermines Bitcoin's fungibility.P2P exchanges are most favorite places for money laundering and \"tainted coins\" are more frequently appear on P2P exchanges.Many resources are in Bitcoin privacy information and Bitcoin privacy guide. Perhaps you can find some ideas from them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "March 06, 2025, 04:44:19 AM",
      "body": "Quote from: Catenaccio on March 06, 2025, 03:26:49 AMMany resources are in Bitcoin privacy information and Bitcoin privacy guide. Perhaps you can find some ideas from them.Thanks, these are excellent guides and link lists!I just want to clarify that the ideas I have in mind are of basically three groups:1) Keep your own coins fungible and private - that's where these privacy guides are an excellent resource. The nice side effect is that users following these principles potentially also help other users' coins -- for example: the more CoinJoins exist, the larger the amount of fungible Bitcoins.2) Try to incentive centralized service providers to accept and preserve Bitcoin's fungibility. Of couse some regulations apply, but in most (or all?) areas regulated exchanges are relatively free to decide how they deal with high-risk coins as long as they don't simply ignore them. So the option to return them to the origin is probably always legal.The idea is of course that well-behaving service providers get a competitive edge while fungibility-endangering entities are \"boycotted\". This may be achieved through education of other users, but also through self-examining your own \"consumption\" of these services. Unfortunately it's an area not many guides cover, so it's one of the points I like to emphasize a bit 3) and my last point above, to explore possibilities to deal with criminal activity without harming fungibility. This may be the hardest point, but as already written there are examples for best practices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "March 06, 2025, 05:08:14 AMLast edit: March 06, 2025, 06:39:45 AM by mindrust",
      "body": "Bitcoin is not fungible. Even Andreas called it and he has probably more knowledge on bitcoin than many people in this forum. The faster we accept this truth, the more realistic solutions we will come up with. The moment we name coins “tainted” and “clean”, we accepted it anyway. Some people insist on saying that all bitcoins are same but they live in their own dream world as the reality is very different. Some people tried to use mixers to make bitcoin fungible but guess what, it didn’t work either because the exchanges could see that your coins were coming from a mixer address and they know what kind of people mainly use mixers…Monero is truly fungible if you want that but the sad part is, the gov killed it already, it has zero adoption. If bitcoin becomes fungible one day, they will do the same thing to bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitJannik",
      "created_time": "March 06, 2025, 05:43:47 AM",
      "body": "I really think Bitcoin's fungibility is what keeps it valuable and free from control and I feel like we've got to step up to protect it. Try to stick with non KYC exchanges whenever I can and back platforms that actually care about privacy. Using stuff like conjoin and keeping my coins in my own wallet makes it tougher for those chain analysis folks to tag some bitcoin as 'dirty'. I steer clear of services that ditch privacy coins or push this 'virgin' bitcoin nonsense, it is just creating a messed up two tier vibe that could ruin what makes bitcoin work. Honestly I'd rather see exchanges send flagged coins back to the sender instead of snagging them, it's only fair.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fikrett",
      "created_time": "March 06, 2025, 07:25:59 AM",
      "body": "Quote from: BitJannik on March 06, 2025, 05:43:47 AMI really think Bitcoin's fungibility is what keeps it valuable and free from control and I feel like we've got to step up to protect it. Try to stick with non KYC exchanges whenever I can and back platforms that actually care about privacy. Using stuff like conjoin and keeping my coins in my own wallet makes it tougher for those chain analysis folks to tag some bitcoin as 'dirty'. I steer clear of services that ditch privacy coins or push this 'virgin' bitcoin nonsense, it is just creating a messed up two tier vibe that could ruin what makes bitcoin work. Honestly I'd rather see exchanges send flagged coins back to the sender instead of snagging them, it's only fair.And to lose the possibility of freezing said assets and giving the consequences to all the parties, right or wrong?Nah",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "March 06, 2025, 07:59:54 AM",
      "body": "Perhaps we need to return to the basics. We stick to non-custodial wallets to maintain control. We stick to peer-to-peer transactions to avoid third parties. We avoid platforms that can decide on our funds. This is, after all, the primary reason why there's Bitcoin. As a community, there's not much we can do as to the rules and regulations and policies. We can spread awareness, convince others that Bitcoin is fungible, perhaps lobby and coordinate with lawmakers. But, at the end of the day, policymaking is beyond our control. And, whether we like it or not, there are indeed funds that are proceeds from crimes. Wherever they end up, they should be flagged and seized, albeit returned to circulation later on. Even those who strongly advocate for Bitcoin's fungibility must take it upon themselves to help victims of hacks and robberies and theft recover their money should the opportunity arise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fikrett",
      "created_time": "March 06, 2025, 08:01:48 AM",
      "body": "Quote from: Darker45 on March 06, 2025, 07:59:54 AMPerhaps we need to return to the basics. We stick to non-custodial wallets to maintain control. We stick to peer-to-peer transactions to avoid third parties. We avoid platforms that can decide on our funds. This is, after all, the primary reason why there's Bitcoin. As a community, there's not much we can do as to the rules and regulations and policies. We can spread awareness, convince others that Bitcoin is fungible, perhaps lobby and coordinate with lawmakers. But, at the end of the day, policymaking is beyond our control. And, whether we like it or not, there are indeed funds that are proceeds from crimes. Wherever they end up, they should be flagged and seized, albeit returned to circulation later on. Even those who strongly advocate for Bitcoin's fungibility must take it upon themselves to help victims of hacks and robberies and theft recover their money should the opportunity arise. Spreading information and awareness is about right in this case.It's pretty hard to get something tangible in that field and regard due to.. regulations and policies, as you said.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "March 06, 2025, 08:11:09 AM",
      "body": "Quote from: Darker45 on March 06, 2025, 07:59:54 AMPerhaps we need to return to the basics. We stick to non-custodial wallets to maintain control. We stick to peer-to-peer transactions to avoid third parties. We avoid platforms that can decide on our funds. This is, after all, the primary reason why there's Bitcoin. opportunity arise. It's all fine until you want to cash out your coins, yeah we can use No KYC P2P to exchange Bitcoin to fiat, but the liquidity is low. I think people who use USD or EUR will not have any problem, there's always someone who willing to trade even the rates is terrible.However, people who use other currencies almost have no liquidity, you will not able to find someone who want to trade with you.And, the bigger/often you trade, the higher chance your banks will investigate your account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hero_the_bossman",
      "created_time": "March 06, 2025, 08:13:11 AM",
      "body": "Quote from: Despairo on March 06, 2025, 08:11:09 AMQuote from: Darker45 on March 06, 2025, 07:59:54 AMPerhaps we need to return to the basics. We stick to non-custodial wallets to maintain control. We stick to peer-to-peer transactions to avoid third parties. We avoid platforms that can decide on our funds. This is, after all, the primary reason why there's Bitcoin. opportunity arise. It's all fine until you want to cash out your coins, yeah we can use No KYC P2P to exchange Bitcoin to fiat, but the liquidity is low. I think people who use USD or EUR will not have any problem, there's always someone who willing to trade even the rates is terrible.However, people who use other currencies almost have no liquidity, you will not able to find someone who want to trade with you.And, the bigger/often you trade, the higher chance your banks will investigate your account.If the volume is high enough too.They will start to make notice only if there is something big / shady or both going for these deposits onto your account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "March 06, 2025, 01:12:56 PMLast edit: March 06, 2025, 01:42:33 PM by franky1",
      "body": "part of learning about fungibility EG criminality/illegal links of any currency unit/note.. is that fungibility of someones deposit is not a yes/no 2 optionpeople need to realise the analysis is a % risk tolerance. they actually rate deposits based on a risk percentage and they have thresholds whereby when certain risk tolerances break a threshold, a different level of investigation is triggered by the servicepeople need to realise what actually raises the risk%many dont realise that by actually using privacy tricks and tools actually adds more risk to those coins. which leads to more investigation and possibly the user being frozen from trading and being asked give more KYC and explanation of coin origins and purpose to regain access to trade or to remove their coin and be banned from the service, or worse having the investigation forwarded to authorities which could lead to court action..for instance imagine you are a clean user personally, but you used a privacy tool to swap your coin in a mixer. and the coin you get out was directly last used in some dodgy illicit service. (illicit porn or identity theft trading site, etc) suddenly your coins are classed as high risk to a high 9X% and you are investigated to a high level including having to give more KYC if you want to regain enough access to the service, whilst secretly they are informing on you to the authoritieswhere as if you just deposited your normal coin(unmixed) to the exchange. you wont be investigated and so you are just part of the minutiae of millions of other deposits they receive and dont have time to look twice at...what i find soo obvious is that illicit people want innocent people to fear things, simply to advertise that innocent people should(fake need) go though extra processes.. but this is purely so that the illicit people can get their hands on innocent peoples coins, lowering the illicit persons deposit risk.. whilst leaving the innocent person holding the coins linked to illicit services and left with the headache",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "March 06, 2025, 02:48:22 PM",
      "body": "Quote from: mindrust on March 06, 2025, 05:08:14 AMBitcoin is not fungible. Even Andreas called it and he has probably more knowledge on bitcoin than many people in this forum. The faster we accept this truth, the more realistic solutions we will come up with. The moment we name coins “tainted” and “clean”, we accepted it anyway.This kind of \"fatalism\" is exactly why chain analysis companies have had that much success in establishing concepts like \"tainted\" or \"high risk\" coins.I would like to hear about the \"realistic\" solutions you have in mind, if they are based on the notion that Bitcoin is not fungible. IMO this would imply to accept that \"non-tainted\" liquidity is becoming smaller and smaller, and that Bitcoin never could become a real P2P currency, but perhaps you have some good ideas or links. Quote from: mindrust on March 06, 2025, 05:08:14 AMMonero is truly fungible if you want that but the sad part is, the gov killed it already, it has zero adoption. If bitcoin becomes fungible one day, they will do the same thing to bitcoin.I'm not so sure about the \"killed\" part. Monero may not be listed on many big exchanges anymore, but the demand and value seems to grow currently. It more than doubled in comparison to the price after the Binance delisting when it fell down to $100 ($220-230 currently).I also think that democratic (republican/liberal, not Democratic in the partisan sense  ) governments should eventually become aware of the value of privacy coins to spread freedom ideas through the world, which could more than counter the small damage due to criminal funds which went through privacy coins.Quote from: Darker45 on March 06, 2025, 07:59:54 AMPerhaps we need to return to the basics. [...]As a community, there's not much we can do as to the rules and regulations and policies. We can spread awareness, convince others that Bitcoin is fungible, perhaps lobby and coordinate with lawmakers. But, at the end of the day, policymaking is beyond our control.With 10% of the population in many countries already having used cryptocurrencies, I think our power as a community is bigger than some think. With intelligent lobbyism, without ignoring problems related to crime, I think there could be some influence on policymaking. Not in all countries, but in the more liberal/democratic/republican ones. But even in autocracies like China the government can't completely ignore the sector anymore.The problem, I think, is instead the \"conformism\" in part of the community. Some only care that they can buy and sell Bitcoin to ride the speculation waves, and if their government permits that they're fine. But they ignore that this erodes the core USPs and values of Bitcoin (censorship resistance).Quote from: Darker45 on March 06, 2025, 07:59:54 AMAnd, whether we like it or not, there are indeed funds that are proceeds from crimes. Wherever they end up, they should be flagged and seized, albeit returned to circulation later on.The details on \"how\" the funds are flagged and seized are important for me. Seizing should only occur in cases where a direct connection to a heist can be made, or if the criminals are caught via other ways. In all other cases, e.g. when a mixer was related to a transaction, a return to the origin together with flagging is imo the correct way to proceed.@Despairo is also correct that the liquidity problem in many currencies unfortunately makes it difficult to \"return to the basics\" in many countries. However, the more people adding their coins to P2P exchanges, the more liquidity will form, so those who can afford the time and risk can contribute to an improvement. There is also often the possibility to buy goods (up to \"neutral valuables\" like gold) with Bitcoin instead of cashing out.@franky1: what you describe is in my eyes part of the problem, not the solution. Flagging coins because they used a CoinJoin for example should be an absolute no-go and should be rejected energically by the community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "March 06, 2025, 03:52:19 PMLast edit: March 06, 2025, 05:13:01 PM by franky1",
      "body": "Quote from: d5000 on March 06, 2025, 02:48:22 PM@franky1: what you describe is in my eyes part of the problem, not the solution. Flagging coins because they used a CoinJoin for example should be an absolute no-go and should be rejected energically by the community.but why would you need or want to use coinjoin?? ?? ?? ?? ?? ?? ?? ??your perceived need to want to hide something is the very reason you would gain a few %% on the risk levelput it this way..if you are walking down the street in public where you know you 'could' be watched.. which is the better path to make yourself not be noticed:a. walk like everyone else and just be normalb. take a couple steps and change clothes behind a bush and then take another few steps and do it again..you are going to make yourself more noticeable by actually trying to hide more.. people will start to get suspicious and want to follow you and work out what you are doing by hiding. even if the reason to hide is legal. EG its not a crime to just not want any of your friends/neighbours or wife to know you were on a certain street.. however to anyone looking for real crimes may see you acting suspicious and want to know more about your weird activity....i personally love the fact that i can preserve a wall between my birth certified name | vs | forum registered username | vs | bitcoin stash addresseshowever i dont need mixers or coinjoins.. and i certainly dont want the risks of using some swap tool where i can end up with some criminals ill gotten gains, leaving me to have to explain stuff im not involved in while the criminal makes a clean getaway..once people realise they can just walk down a sidewalk normally and not get noticed. they learn they dont need to change clothes behind a bush every 5 yardsonce people realise they can just deposit funds into a bank, rather then swap stash suitcases with a shady guy they never met before. they soon learn these privacy things do the opposite to remaining privateso please dont try promoting that everyone should change clothes behind bushes when in public and swapping their cash stash suitcase with shady people before making a bank deposit. because your not helping peoplenow with that said. i see no need for exchanges to need to know peoples income levels. as part of KYCi see no need for exchanges to need to know alot of personal info just to use their serviceall they need to do is:a. set up a legacy keypair for login ID where by the user has the private key, service logs the public key to verify..  and user makes signatures of unique messages the service displays to prove they are the authorised user (like a unique password per login, but proves its the same person)b. set up a fiat deposits/withdrawal to a specific fixed bank accountthat way $$ FIAT funds cant be hacked and moved to other places. and if investigations need to escalate to authorities. then the authorities can investigate and get your personal info from your bank account provider. (no need of exchange to have it)obviously if you are cashing out alot of money, then your bank will see it and report it to the IRS as its then realised gains(you cant buy chewing gum using an exchanges USD balance, you can only buy chewing gum with FIAT)so any IRS stuff should be at true realised gains of getting fiat back in your pocket(from the bank)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "March 06, 2025, 04:29:27 PM",
      "body": "Doesn't blind usage with everything work better than avoiding certain uses? Sure, you can boycott some services that mark or consider linked entities as tainted (I've experienced this already in Europe, they flag coins that come from certain places) but isn't that just another form of complexity to the user?Let people learn to use their own wallets as the barrier (or double, multiple barriers) betwixt the taint and the service, and you solve this anyway without adding the burden of watchfulness on the mainstream user, or inadvertently setting up your own censorship filters. We want mainstream use, then it's just the basics of always controlling your own coins, at least, whenever sending them onward.P.S. Might be an unpopular side to take but I think the regulations should be allowed to run, for regulators to see the folly of their ways. Organic understanding that censorship is pointless for people, or forces them to stay a step ahead, with same end result of resources consumed to cause inconvenience.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "March 06, 2025, 04:47:26 PM",
      "body": "Quote from: d5000 on March 06, 2025, 02:59:13 AMThe question is: can the Bitcoin community do something to prevent Bitcoin's fungibility being undermined?I want to believe that people have their own rights and they can also choose to make their voices heard, this is bitcoin community, we have a common goal been hear all, to discuss about bitcoin and provide way forward to make every enjoy the benefit of using this cryptocurrency.That been said, bitcoin fungibility cannot be undermined by anyone, it they would have developed the ability of doing nso, this could have been achieved a long time ago, but once the bitcoin network remain secured, it's value increasing and people adopting, then we have more power already than the institutions and government being a community, because now, Bitcoin is seen as an established digital currency which is beyond any form of attack regardless of where it's coming from.To proof more on this, consider the following.1. Bitcoin ETF approval because of Bitcoin and it's community.2. Censorship resistance and increase in adoption over the years.3. Acceptance of bitcoin as legal tender and means of making payments.We can still keep on counting the more, but let use this few on why they can't acheive any person ambition that is against the intention for creating bitcoin, we still remember the way we all fight back against Craig Wright and won as a community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "March 06, 2025, 07:02:26 PM",
      "body": "Quote from: franky1 on March 06, 2025, 03:52:19 PMbut why would you need or want to use coinjoin?? ?? ?? ?? ?? ?? ?? ??Just because you, as a normal Bitcoin user, above all as a merchant but also as an user of P2P exchanges for example, are always exposed to coins which some chain analysis company could have \"tainted\", even UTXOs flagged with \"medium risk\" could get you into problems with some exchanges. Should every small merchant have to conduct chain analysis to avoid getting those coins?I prefer a widely fungible Bitcoin where no flagging exist except for funds which were stolen recently.Quote from: buwaytress on March 06, 2025, 04:29:27 PMDoesn't blind usage with everything work better than avoiding certain uses? Sure, you can boycott some services that mark or consider linked entities as tainted (I've experienced this already in Europe, they flag coins that come from certain places) but isn't that just another form of complexity to the user?This is a valid argument for me. Of course not everybody should be forced to use techniques like CoinJoins. Boycotting certain services however could help to establish \"community-approved\" practices for service providers. Basically it's like with every product you buy, you buy a brand because you like the quality and characteristics of the product/service. Once the market has cleaned out those entities not respecting these best practices, it becomes easier for the customers again.Quote from: buwaytress on March 06, 2025, 04:29:27 PMLet people learn to use their own wallets as the barrier (or double, multiple barriers) betwixt the taint and the service, and you solve this anyway without adding the burden of watchfulness on the mainstream user, or inadvertently setting up your own censorship filters. I don't fully get what you mean here. Simply using self-hosted wallets isn't enough to protect yourself from problems which could arise due to tainted coins. Can you explain?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "March 06, 2025, 07:08:47 PM",
      "body": "Well, I think the Bitcoin community should have worked together and make sure that the Bitcoin features which are meant to protect genuine and honest users from abuses or attacks are not aiding abusers/attackers.Bitcoiners should have done something about the abuse and misuse than wait for people who could add more to the issue to help solve it. The is bound to happen though as humans don't usually ignore their problems otherwise they could grow too big to handle. However, I expected the solutions to come from the community in Bitcoin-friendly manner rather than outsiders who wouldn't care much about the ideals of Bitcoin. So, the right approach would be to stop or prevent the spread of crime coins without violating the censorship resistant features of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "March 07, 2025, 06:36:49 AM",
      "body": "The ultimate solution is to stop using anything centralized with [decentralized] bitcoin, that includes replacing CEX with DEX. But that is not happening for some reasons. So here is another approach...We have to see what's happening as war and in war we need to hit back! If we are stuck with centralized exchanges, it is impossible to avoid those that blacklist certain coins with the fake concept of \"taint\" as suggested in OP because sooner or later they all do the same thing. And that's an attack on Bitcoin's basic principles. So we need to hit them back where it hurts.Imagine if for example next time a CEX like Coinbase or Binance blocked someone's deposit calling it \"tainted\" a large number of their users withdrew their funds from these exchanges. If people did that, first thing that these exchanges would face is a crisis of running out of coins to cover all these withdrawals which would raise the concerns about their insolvency and increase the number of withdrawals which would increase the pressure on these services.Considering that at the end of the day, these are all businesses that are looking to maximize their profitability, so if they lose a considerable amount of revenue they will be forced to change policies. Next thing you know they willingly remove that taint nonsense from their ToS on their own.The problem is that people are not coordinated and they always think that the problem has happened to someone else and it won't happen to them so they don't care until it also happens to them. Then they become an individual who complains a bit on the internet and is soon forgotten...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "March 07, 2025, 01:21:00 PM",
      "body": "Quote from: d5000 on March 06, 2025, 02:48:22 PMQuote from: Darker45 on March 06, 2025, 07:59:54 AM~snip~With 10% of the population in many countries already having used cryptocurrencies, I think our power as a community is bigger than some think. With intelligent lobbyism, without ignoring problems related to crime, I think there could be some influence on policymaking. Not in all countries, but in the more liberal/democratic/republican ones. But even in autocracies like China the government can't completely ignore the sector anymore.The problem, I think, is instead the \"conformism\" in part of the community. Some only care that they can buy and sell Bitcoin to ride the speculation waves, and if their government permits that they're fine. But they ignore that this erodes the core USPs and values of Bitcoin (censorship resistance).Exactly. Only a small part of the population is into Bitcoin. Of that, an even smaller group is into it because of the technology and not the price. Of that smaller group, there might only be a handful who go the extra mile and try to fight for fair Bitcoin-related policies. And if they're not rich and powerful and influential, it's likely that their suggestions would fall on deaf ears. If it's hard to convince a fellow Bitcoiner, it must be a lot harder to convince a non-coiner. It's sad that popular or even central figures in the Bitcoin community like Brian Armstrong or CZ are too business-minded to even stand for Bitcoin's fundamental principles like fungibility. QuoteQuote from: Darker45 on March 06, 2025, 07:59:54 AM~snip~The details on \"how\" the funds are flagged and seized are important for me. Seizing should only occur in cases where a direct connection to a heist can be made, or if the criminals are caught via other ways. In all other cases, e.g. when a mixer was related to a transaction, a return to the origin together with flagging is imo the correct way to proceed.I wonder if it's possible for the government to work that way. I doubt. They act not only on the basis of certainty but also on the basis of suspicion. To be fair, in their line of work, that's probably the optimal approach. However, they oftentimes overdo things-- blanket bans, extremely tight restrictions, generalizations, and the like. Perhaps it's a combination of incompetence, laziness, and the lack of more efficient ways.Quote from: pooya87 on March 07, 2025, 06:36:49 AMConsidering that at the end of the day, these are all businesses that are looking to maximize their profitability, so if they lose a considerable amount of revenue they will be forced to change policies. Next thing you know they willingly remove that taint nonsense from their ToS on their own.I highly doubt it. Their choice is not either a small profit or a big profit. Their choice is to either toe the line or close up shop. What's indicated in their ToS aren't necessarily what they prefer. Some of it are there because they're required to, ordered to, include them. It isn't their choice that prevails; it's the regulations and policies that they're bound to comply with. If these exchanges have their way, greedy as they are, they will certainly accept all kinds of funds wherever they come from, remove hassles like KYC that discourage users, offer services to everybody regardless of jurisdictions, and so on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "March 07, 2025, 02:58:56 PM",
      "body": "Quote from: d5000 on March 06, 2025, 02:59:13 AMEvery time we presence a hack, theft or a ransomware wave, attacks on Bitcoin's fungibility increase. This also leads me to reference on one of your old threads which already addressed a partial solution on this regard https://bitcointalk.org/index.php?topic=5415910.msg61060388#msg61060388 which I believe you have long time ago been considering the danger related things may cause us from using bitcoin, the incidence of altcoins and centralized are a big problem which we all can come together and fight the challenge, because by them all where all this censorship resistance and fungibility issues are erupting if we check well from every other comment regarding this same discussion, government cannot help than to come from those channels in crypto against bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}