{
  "id": "topic_5431181",
  "title": "Marcellin9",
  "author": "Marcellin9",
  "created_time": "December 24, 2022, 06:45:01 AM",
  "content": "FUD(Fear, uncertainty and doubt) can be seen everywhere in our society and many places in the world now. Whether you are a businessman, a government official/politican or even a school teacher, FUD is more than a propaganda tactic, it has become some essential tool or weapon to attack or manipulate people to do things at their will. It is a fact that the world is ever-changing and uncertain but what happens to our inner peace ? What makes FUD become so crazy to destroy our inner peaceful life ? What are the reasons ? And how do we deal with the problem ? Please let me know.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5431181",
  "comments": [
    {
      "author": "Majestic-milf",
      "created_time": "December 24, 2022, 10:59:29 AM",
      "body": "Fear is a very strong tool that can be deadly if not properly checked. In some instances, it could make a normal scenario seem so scary and push one into not just depressing acts but as far as death. Sometimes, situations we have faced also play a role in making one experience FUD. Take a failed business plan that would have amounted to something worthwhile for instance.FUD becomes powerful to destroy our inner peace and calm only when we let it in. How to deal with the problem?   Getting the opinions of trusted and experienced peeps around  can help one not become a victim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helena Yu",
      "created_time": "December 24, 2022, 11:02:03 AM",
      "body": "It depends on your personality and how you handle those problem.You need to stay away against those people and do your own research about it, then think the possibility of the chance it will happen. Also you need to be prepare if it's happen, so you can reduce the risk.The another thing you can go to a doctor or professional if it's really hurt your mental.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "December 24, 2022, 06:07:11 PM",
      "body": "Quote from: Marcellin9 on December 24, 2022, 06:45:01 AMFUD(Fear, uncertainty and doubt) can be seen everywhere in our society and many places in the world now. Whether you are a businessman, a government official/politican or even a school teacher, FUD is more than a propaganda tactic, it has become some essential tool or weapon to attack or manipulate people to do things at their will. It is a fact that the world is ever-changing and uncertain but what happens to our inner peace ? What makes FUD become so crazy to destroy our inner peaceful life ? What are the reasons ? And how do we deal with the problem ? Please let me know. The world is filled with uncertainties that have led to people developing a fear of the unknown. Nobody is sure of his job, the value of currency, peace, or even life. In my location, one cannot travel without fear of kidnappers and armed robbers. The economy is going down every day and our currency is losing value. International, the war in Ukraine has caused so many uncertainties. The price of power and foodstuffs are going high every day because of this conflict. The constant fall of centralized exchanges has affected the crypto space negatively and is also a source of concern.I have decided to do my best and make decisions that I think are best for me. I would try to change or influence my immediate environment to get the best out of every situation. For other uncontrollable environmental factors, I have decided to hold my peace and surrender to fate. If I cannot change the situation, I have learned not to worry about them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}