{
  "id": "topic_5401999",
  "title": "Ondekinecakabilirim",
  "author": "Ondekinecakabilirim",
  "created_time": "June 09, 2022, 09:19:16 PM",
  "content": "Nobel Ödülü sahibi olması ile meşhur ekonomist Paul Krugman’ın Bitcoin düşmanlığı bitmek bilmiyor. Krugman, New York Times’ta yazdığı köşesinde yine Bitcoine saldırdı.6 Haziran Pazartesi çıkan yazısında Krugman, “Big Short” filmine atıf yaparak Bitcoin’i 2008 Konut Balonu’na benzetti. Ünlü ekonomist, Kasım’da toplam piyasa değeri 3 trilyon $’a ulaşan kriptovarlıkların aslında hiçbir işlevi ve değeri olmadığını iddia etti. Luna Krizi’nin de bu görüşünü doğruladığını öne süren Krugman yazısını şöyle bitirdi:“… ‘Konut Balonu’nu ve ‘Subprime Krizi’ni hatırlıyorum. Ve bana sorarsınız ‘Big Short’tan, ‘Big Scam’e (Büyük Dolandırıcılık’a) geldik.”https://tr.cryptonews.com/exclusives/nobelli-ekonomistin-bitcoin-ile-imtihani.htmProfesörler, merkez bankası başkanları, IMF yetkilileri balon demişti daha önceden. Şimdi Nobelli ekonomist Bitcoin'e balon demiş. Daha üst seviye insandan Bitcoin'e saldırı görmemiştim. Daha üst seviyedeki biri Satoshi'nin kendisi olur. Ama Luna krizi algoritma kriziydi. Bitcoin, Ethereum algoritmayla yaratılmış stablecoinler değil. Nobel ödüllü ekonomist Krugman balon demeden önce biraz araştırsaymış görürmüş algoritmaya bağlı stablecoin olmadığını.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401999",
  "comments": [
    {
      "author": "trendcoin",
      "created_time": "June 10, 2022, 03:54:26 AM",
      "body": "hiç dizi ya da film vs. izlemem ama big short neredeyse külte dönüşmüş bir başyapıt olduğu için amaçlanan benzetmeyi anlayabiliyorum. hani, bu benzetmeyi sıradan biri yapmış olsa \"salla geç\" derdim ama nobel ödüllü bir zatın böyle bir açıklaması yapması gerçekten ilginç olmuş. 13 küsur yıldır aralıksız ve sorunsuz olarak -üçüncü kişilere ihtiyaç duymadan- eşten eşe para transferi imkanı sağlamış ve sağlamaya devam eden bir varlığın dolandırıcılık olması hayatın olağan akışına uygun değil be kardeşim! bitcoin'e karşı olan nefretlerini artık anlayamıyorum; yerine güçlü bir alternatif koy, hep beraber biz de vazgeçelim bu sevdadan; karşılıksız sevmiyoruzsafasfasdfasdgasgsdgsasag.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}