{
  "id": "topic_5463703",
  "title": "zap4610",
  "author": "zap4610",
  "created_time": "August 18, 2023, 02:14:54 PM",
  "content": "Hey everyone.  I'm interested in selling 50% of the worldwide distribution profits for my feature length movie.  This movie has already been selected by four film festivals.  It has 93% positive critical reviews.  Let me know if you have any questions.  https://opensea.io/assets/ethereum/0x495f947276749ce646f68ac8c248420045cb7b5e/104682925624682884185656168519301974983263174756632261604381927167181851721729",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463703",
  "comments": [
    {
      "author": "owlcatz",
      "created_time": "August 19, 2023, 01:55:44 AM",
      "body": "Wow... So much detailed info about it, I am not sure if I am interested.  FFS, dude... You really expect anybody with a brain to fall for this nonsense?Holy scammer post...  PS - where is the proof this has been accepted anywhere but your mum's bum?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "August 19, 2023, 02:09:53 AM",
      "body": "Your price in Bitcoin is much higher than the price of Ethereum, as 6 Ethereum equals .38 Bitcoin.I tried to see what is in the opensea link, and I only found a picture of the Oscars. There are no details about the movie, any links to positive critical reviews, and the names of the four film festivals. You did not even try to mention the name of the movie or information about you.If this isn't scam, then what?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "August 22, 2023, 06:44:12 AM",
      "body": "I'm curious how you came to determine this figure for 50% rights.Why 0.40 btc and not 0.50 or 0.30?Moreover...besides the possibility of participating in festivals, do you have agreements for distribution?93% Positive Critics... who are these critics? if you're going to sell and you're here without the idea of ripping anyone off, you need to provide much more information, otherwise it's unthinkable you'll be taken seriously.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Latviand",
      "created_time": "August 26, 2023, 01:27:01 AM",
      "body": "No title for the film was even presented so how do we even know that it's the real deal and I am sure that that's not how you sell film rights, doesn't it involve legal processes? And shouldn't the buyer be able to at the least read the script or something like that to see if it's worth buying the rights?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "August 27, 2023, 08:29:15 AM",
      "body": "Quote from: Latviand on August 26, 2023, 01:27:01 AMNo title for the film was even presented so how do we even know that it's the real deal and I am sure that that's not how you sell film rights, doesn't it involve legal processes? And shouldn't the buyer be able to at the least read the script or something like that to see if it's worth buying the rights? He was online and didn't answer a lot of questions, so we can assume that what he's saying is a troll.You can buy bitcoin legally in many countries, so instead of selling in bitcoin, you can sell with cash or bank accounts and buy bitcoin later.If you try to sell something that is not related to Bitcoin at such a price here, it will be very difficult.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}