{
  "id": "topic_5408208",
  "title": "fortebettor",
  "author": "fortebettor",
  "created_time": "July 31, 2022, 08:09:44 AMLast edit: July 31, 2022, 08:28:02 AM by fortebettor",
  "content": "dex aggregator 1inch  is a scammer. I've been waiting for 10 days for a reason why I didn't get a refund and they can't give it. they explain that the script they wrote works that way and that's it.They have not continued to give a single reason why I have not been refunded for the swaps to which I am entitled from their gas refund program for staking 1inch They didn't pass it and can't pass it because they don't have it! Their rules are simple. You can not carry out transactions automatically or act in such a way as to exceed the limit you are entitled to. All transactions without exception I carry out on my account manually. There are several aggrieved persons who also did not break any rules.You can see with the naked eye accounts that do swaps 24 hours a day and that they are bots. But so accounts that in no way broke the rules and also got nothing. More than 90% of those who were supposed to get the most were excluded. Coincidence - don't think so?1inch is looking for money and they did it to cheat users. Very good that they are fighting bots by the way they robbed users who acted 100% in accordance with the rules.Support on the website and on Telegram ignores the issue. Does not write back for a week. Other people on the new time write back something like that they can not do anything because the script was written well and certainly excludes good accounts.Serious warning because 1inch is a giant in the world of cryptocurrencies. Since such practices are starting to happen there really think about what happened to LUNA, CELCIUS, 3AC ETC and now that such 1inch for me is already crossed out !",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5408208",
  "comments": [
    {
      "author": "BitcoinGirl.Club",
      "created_time": "July 31, 2022, 08:52:45 PM",
      "body": "Quote from: fortebettor on July 31, 2022, 08:09:44 AMSerious warning because 1inch is a giant in the world of cryptocurrencies. Since such practices are starting to happen there really think about what happened to LUNA, CELCIUS, 3AC ETC and now that such 1inch for me is already crossed out !It's hard to have faith in non-established crypto startup. Many people lost their hard earned money but it's also true that many people made life changing money from crypto. It's always is to do your due diligence before involving in any crypto startup.You did not provide any proof for your words. It will be more credible if you add some form of evidence (blockchain transactions itself should be a good start)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "July 31, 2022, 09:12:19 PM",
      "body": "Quote from: fortebettor on July 31, 2022, 08:09:44 AMdex aggregator 1inch  is a scammer. I've been waiting for 10 days for a reason why I didn't get a refund and they can't give it. they explain that the script they wrote works that way and that's it.~OP, I am having trouble figuring out what exactly happened in your case and what exactly you accuse 1inch of. Could you please be a little more specific?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "July 31, 2022, 09:36:51 PM",
      "body": "Your scam accusation is vague. You might want to add a few more details like blockchain proof, screenshots of chats between you and the 1inch team, and please try to show us precise what exactly happened.What did they promise? And where did they write it?What led to the losses? Etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}