{
  "id": "topic_5404888",
  "title": "SquirrelJulietGarden",
  "author": "SquirrelJulietGarden",
  "created_time": "July 02, 2022, 06:07:01 AMLast edit: July 04, 2022, 03:26:32 AM by SquirrelJulietGarden",
  "content": "I introduced three websites to check withdrawal fees from exchanges for cryptocurrencies and transaction fees on some blockchain networks.Withdrawalfees.comBlockchair.comCointool.appCoinmarketfees.comCryptofeesaver.comTransactionfee.infoWithdrawalfees.comYou can search by coin or by exchange. Get list of withdrawal fee over available coins on one exchange or withdrawal fee of a coin over exchanges. You can compare them and pick a good one with cheapest transaction fee.This is a third party site so information can be inaccurate. You should compare given info on withdrawalfees.com with official websites of exchanges.Blockchair.com's Compare blockchainsChoose coins to compare from average time between blocks, volume, average transaction fees, hashrates and much more.Having hashrate comparison is good because if you are considering two blockchains with similar transaction fees, a blockchain with higher hashrate should be your choise. It's safer. The safest is Bitcoin blockchain.Cointool.appCompare transaction fee, gas price between many blockchains.coinmarketfees.comThis website has a summary table with lot of exchanges. In addition, you can pick two exchanges and compare them.CryptoFeeSaver.comThis site help you to browse crypto exchange fees by cryptocurrency. They have many cryptocurrencies available for comparison.Transactionfee.infoGet on-chain charts of transactions by using Nested or Native SegWit or Taproot address and how much fee you can save with it.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404888",
  "comments": [
    {
      "author": "NeuroticFish",
      "created_time": "July 02, 2022, 07:08:46 AM",
      "body": "I think that the bitcointalk topic on exchange fees worth a mention here. While the first website on your list is better than I first expected, I still like our topic more. See Crypto exchanges comparison [trade fee + listing fee + age + mobile app + more!]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "July 02, 2022, 07:11:05 AM",
      "body": "Quote from: NeuroticFish on July 02, 2022, 07:08:46 AMI think that the bitcointalk topic on exchange fees worth a mention here. While the first website on your list is better than I first expected, I still like our topic more. See Crypto exchanges comparison [trade fee + listing fee + age + mobile app + more!]That site updates automatically with API I think so and it is better than a thread you shared must be updated manually. Radja_MBZ is still actively in forum but if the user turns to inactively, that thread will not be updated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "July 02, 2022, 07:26:50 AM",
      "body": "Quote from: SquirrelJulietGarden on July 02, 2022, 06:07:01 AMI introduced three websites to check withdrawal fees from exchanges for cryptocurrencies and transaction fees on some blockchain networks.<...>I think you should remove CryptoFees from your list since they haven't updated their site for a very long time.Although I wouldn't mind if these prices were correct, I think it's still wrong to mock us in this way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "July 02, 2022, 10:08:20 AM",
      "body": "Found a couple more alternatives on Google that also have exchange withdrawal fees:coinmarketfees.com- It has the option to show which network you want to see the fees for exchanges that offer certain cryptocurrencies on multiple networks.CryptoFeeSaver.com- You can see the filtered results by \"cryptocurrencies\" and \"exchanges\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "July 02, 2022, 10:31:19 AM",
      "body": "I have been looking for something like this for a while, and it has been easy to use because of the summarized thing per coin, but that's all there is to it. People would probably use this as a comparison of what cheapest rate per exchange you will withdraw in. Like comparing the withdrawal fee that you will incur with BTC to a coin like ADA, it's cheaper than some rates. I hope the exchanges you are in should have a summarized list like this. https://www.binance.com/en/fee/cryptoFeeThat way, it would be easy. I don't think it's a significant factor in comparing the different exchanges' withdrawal fees when choosing the exchange you will be in. But it's a summary of how much an exchange wants from you,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "July 17, 2022, 05:24:52 AM",
      "body": "Quote from: crwth on July 02, 2022, 10:31:19 AMI hope the exchanges you are in should have a summarized list like this. https://www.binance.com/en/fee/cryptoFeeThat way, it would be easy. I don't think it's a significant factor in comparing the different exchanges' withdrawal fees when choosing the exchange you will be in. But it's a summary of how much an exchange wants from you,It is summarized fee on Binance for Binancians.What I try to summarize in this topic is withdrawal fee on different exchanges when you want to have withdrawal in a coin, and transaction fee to use and save it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "July 17, 2022, 05:39:16 AM",
      "body": "Quote from: SquirrelJulietGarden on July 17, 2022, 05:24:52 AMIt is summarized fee on Binance for Binancians.I know. What I'm saying is that you can somehow emulate it or something. I'm not saying that it's for all but it's obviously for Binance. Maybe you can use their type of presentation or format with how they summarized it and make it easier to see. Maybe rearranging coins as well would be beneficial or the withdrawal fee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "April 05, 2023, 10:58:09 AM",
      "body": "bump",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}