{
  "id": "topic_5445657",
  "title": "JamesDaniel90",
  "author": "JamesDaniel90",
  "created_time": "March 20, 2023, 10:54:17 AM",
  "content": "Have been in crypto just over a year now so have yet to experience a bull market and up till now I have just bought and held. Currently my portfolio is 10% down and am not planning on selling any until I 2x at least. Bitcoin takes up 30% of my portfolio with the rest in altcoins. What is everyone expecting in 2024/25 bull run? Is a 10x a good return or should we be hoping for more?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445657",
  "comments": [
    {
      "author": "drwhobox",
      "created_time": "March 20, 2023, 11:23:17 AM",
      "body": "Quote from: JamesDaniel90 on March 20, 2023, 10:54:17 AMWhat is everyone expecting in 2024/25 bull run? Is a 10x a good return or should we be hoping for more? I assume you have a plan for holding your bitcoin for a long time. You can make more than 2x of your initial investment if you have the patience of holding your assets, but also this is not guaranteed. You can probably taste the bull run in 2024, after bitcoin halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "March 20, 2023, 11:47:51 AM",
      "body": "Quote from: JamesDaniel90 on March 20, 2023, 10:54:17 AMBitcoin takes up 30% of my portfolio with the rest in altcoins. That is 70% in altcoins that have no actual utility, you might want to reconsider that. Anyway i can't speak confidently for the other 70% of your portfolio, because yes many altcoins really pump during the bull run, but you have to be lucky to be hodling the one that's going to pump, and you also have to be very fast to sell, because a dump might follow afterwards.Having said that, we cannot predict how much Bitcoin would appreciate in the next bull run/next halving, many predictions has been coming out of late, but they are basically just speculations, just accumulate as much as you can and we'd see, at least you are rest assured that your funds are safe in Bitcoin if you do your due diligence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "salad daging",
      "created_time": "March 20, 2023, 11:52:28 AM",
      "body": "I think it's more appropriate to move it to the speculation board.Now is not the time to sell or take profits even though the price is a little bullish but this is not an increase to go up to 2x because the journey is still long if you can hold it for a certain time it will be a winner as a holder.I am not brave enough to buy any altcoin but the only bitcoin in my portfolio, but that is your decision and wait until the price really goes up.We don't know what happens in 2024/25 but I will wait for the halving moment in 2024 and after that I will wait to see the next bullish.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JamesDaniel90",
      "created_time": "March 20, 2023, 11:58:02 AMLast edit: March 20, 2023, 04:09:17 PM by hilariousandco",
      "body": "Quote from: Mahirap on March 20, 2023, 11:23:17 AMQuote from: JamesDaniel90 on March 20, 2023, 10:54:17 AMWhat is everyone expecting in 2024/25 bull run? Is a 10x a good return or should we be hoping for more? I assume you have a plan for holding your bitcoin for a long time. You can make more than 2x of your initial investment if you have the patience of holding your assets, but also this is not guaranteed. You can probably taste the bull run in 2024, after bitcoin halving.I am not selling my Bitcoin I will hold that till 2028 bull run at least when it is around $250,000. The altcoins I hold I am hoping for a 5-10x, some may go higher and some may go to zero I understand the risk but also reward is a lot higher than Bitcoin. Quote from: Coyster on March 20, 2023, 11:47:51 AMQuote from: JamesDaniel90 on March 20, 2023, 10:54:17 AMBitcoin takes up 30% of my portfolio with the rest in altcoins. That is 70% in altcoins that have no actual utility, you might want to reconsider that. Anyway i can't speak confidently for the other 70% of your portfolio, because yes many altcoins really pump during the bull run, but you have to be lucky to be hodling the one that's going to pump, and you also have to be very fast to sell, because a dump might follow afterwards.Having said that, we cannot predict how much Bitcoin would appreciate in the next bull run/next halving, many predictions has been coming out of late, but they are basically just speculations, just accumulate as much as you can and we'd see, at least you are rest assured that your funds are safe in Bitcoin if you do your due diligence.50% of my altcoins are in the current top 15 with the remaining 20% being more gamble's which I feel can at least 20x next bull run. I plan to put a lot of my altcoin profits into Bitcoin once they start pumping.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Peanutswar",
      "created_time": "March 20, 2023, 12:23:03 PM",
      "body": "For the next coming year of 2024 there's an event will happen is the halving and there's a chance that we might experience again with the bitcoin price movement of the new ATH, for me its better to accumulate a lot of coins as long as you can because for the Bullrun of course that's the time all of your holdings become worth it. If you will take a look with the previous price ATH its always break the ATH so for the upcoming pump still no one knows, but the chance is still there. Source: https://www.blockchaincenter.net/en/bitcoin-rainbow-chart/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "March 20, 2023, 12:55:12 PM",
      "body": "I suggest you make a selling plan depending on the increase of your portfolio. For example, if your portfolio return is more than 10%, sell 20% of your coins, and so on. The calculation will obviously depends on your overall investment and the coins you own, there is no way to generalize it. If you do this, at least you can avoid a condition where you're too afraid to sell your coins because you keep hoping it will hit 2x but the market says otherwise. Even if it turns out that your calculation is not exactly right (it keeps pumping and you can potentially earn 3x if you hold all the way), there's no harm in doing that since you can always DCA again. Quote from: JamesDaniel90 on March 20, 2023, 12:02:09 PM50% of my altcoins are in the current top 15 with the remaining 20% being more gamble's which I feel can at least 20x next bull run. I plan to put a lot of my altcoin profits into Bitcoin once they start pumping. Don't be too confident with that, altcoins top ten list has changed drastically over the last few years. Just take a look at the previous bull run, you'll see different names and those who got kicked out are not doing well right now. If anything, you want to gamble and bet on 20x profits, you should probably look at coins/tokens with medium to small marketcap. Anyway, as long as you can afford the risk and prepare for the worst, I wish you good luck with that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OpenCEX",
      "created_time": "March 20, 2023, 01:20:01 PM",
      "body": "Here are a couple of predictions for 2024. These are the low/high prices in $:AMBcrypto: 23,152 / 34,728DigitalCoinPrice: 60,744 / 72,972The difference is substantial, so it will be hard to rely on one of them. But you can derive an average price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Razmirraz",
      "created_time": "March 20, 2023, 02:36:06 PM",
      "body": "Buy at a low price and then sell at a high price. I still use this strategy even though the market is in a bullish condition, still with the main objective. Long-term investments expect more returns, your money will be stuck there for a long time until the expected returns come.I prefer to make short term investments, there is no benchmark return, I will release all assets when returns are seen. In investing I don't want to be too greedy, what I get today is a decent return for me because tomorrow it's not certain that the price will continue to rise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "S3300",
      "created_time": "March 20, 2023, 02:54:23 PM",
      "body": "If all you want is a 2x from your crypto portfolio then that's not a long-term plan, this is considered a short-term investment plan, and it is very doable, I don't plan on selling a penny until Bitcoin makes a new all time high than the last all time high of 67k, maybe, hopefully, we will see Bitcoin over 100k in the next bull season.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "March 20, 2023, 03:15:58 PM",
      "body": "The US is injecting money into circulation. This is going to create huge inflation, maybe hyperinflation. If that's going to happen, we may see more money coming into circulation in the coming months which will pump the BTC price. Have you seen the recent bet from the Former coinbase CTO? He had a bet with a Twitter user worth $1 million where he told that we are going to see $1 million per BTC within the next 90 days which means within June of this year lol. This will only be true if you see hyperinflation in the US.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "March 20, 2023, 04:07:08 PM",
      "body": "Quote from: JamesDaniel90 on March 20, 2023, 10:54:17 AMHave been in crypto just over a year now so have yet to experience a bull market and up till now I have just bought and held. I was wondering when your next topic that starts with \"have been in crypto just over x days, months...\" will appear. Given that you always ask similar questions, the conclusion is that no one gave you a good enough answer or you did not understand what we were answering.Quote from: JamesDaniel90 on March 20, 2023, 10:54:17 AMCurrently my portfolio is 10% down and am not planning on selling any until I 2x at least. Bitcoin takes up 30% of my portfolio with the rest in altcoins. Only 10% considering that you invested 70% in altcoins? Consider yourself lucky that this percentage is not even higher, because most altcoins are completely meaningless and lose value even when the price of BTC rises. Don't get me wrong, I'm not saying that you should invest 100% in Bitcoin, but that you are taking a much greater risk by investing in altcoins.Quote from: JamesDaniel90 on March 20, 2023, 10:54:17 AMWhat is everyone expecting in 2024/25 bull run? Is a 10x a good return or should we be hoping for more? x10 to today's BTC price? I won't say it's impossible, but that would mean 1 BTC would be worth $280 000, and the last big bull run only pushed the price up about x3.5 from the previous ATH ($20 000 - 2017). I personally don't expect the price to go that high, but that's just my opinion and it doesn't have to be correct at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JamesDaniel90",
      "created_time": "March 20, 2023, 05:00:34 PM",
      "body": "Quote from: Lucius on March 20, 2023, 04:07:08 PMQuote from: JamesDaniel90 on March 20, 2023, 10:54:17 AMHave been in crypto just over a year now so have yet to experience a bull market and up till now I have just bought and held. I was wondering when your next topic that starts with \"have been in crypto just over x days, months...\" will appear. Given that you always ask similar questions, the conclusion is that no one gave you a good enough answer or you did not understand what we were answering.Quote from: JamesDaniel90 on March 20, 2023, 10:54:17 AMCurrently my portfolio is 10% down and am not planning on selling any until I 2x at least. Bitcoin takes up 30% of my portfolio with the rest in altcoins. Only 10% considering that you invested 70% in altcoins? Consider yourself lucky that this percentage is not even higher, because most altcoins are completely meaningless and lose value even when the price of BTC rises. Don't get me wrong, I'm not saying that you should invest 100% in Bitcoin, but that you are taking a much greater risk by investing in altcoins.Quote from: JamesDaniel90 on March 20, 2023, 10:54:17 AMWhat is everyone expecting in 2024/25 bull run? Is a 10x a good return or should we be hoping for more? x10 to today's BTC price? I won't say it's impossible, but that would mean 1 BTC would be worth $280 000, and the last big bull run only pushed the price up about x3.5 from the previous ATH ($20 000 - 2017). I personally don't expect the price to go that high, but that's just my opinion and it doesn't have to be correct at all.       10x on my portfolio not Bitcoin price. Bitcoin will only hit max $150k next bull run which is only a 5x which is why you need altcoins in your portfolio. Some altcoins pumped 10-20x last month alone, Bitcoin does that is 5-10 years",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "March 20, 2023, 05:19:28 PM",
      "body": "Quote from: JamesDaniel90 on March 20, 2023, 11:58:02 AMI am not selling my Bitcoin I will hold that till 2028 bull run at least when it is around $250,000. The altcoins I hold I am hoping for a 5-10x, some may go higher and some may go to zero I understand the risk but also reward is a lot higher than Bitcoin. No guarantee we would have a bullrun in 2028. It being a halving year increases the possibility but does not assure it.The risk to reward is not proportional and if you gamble with many altcoins, chances of getting burned is very high.Quote from: JamesDaniel90 on March 20, 2023, 11:58:02 AM50% of my altcoins are in the current top 15 with the remaining 20% being more gamble's which I feel can at least 20x next bull run. I plan to put a lot of my altcoin profits into Bitcoin once they start pumping. The last plan is good, but the chances of having funds to swap into bitcoin are low at the end, top 15 or not. Wish you goodluck anyway, we are only a bunch of Bitcoin Maximalists.Quote from: JamesDaniel90 on March 20, 2023, 05:00:34 PMSome altcoins pumped 10-20x last month alone, Bitcoin does that is 5-10 years  Fact check: Ten years ago, Bitcoin was sold at just over $100, its all time high now is $68,000, how much return on investment is that?Shorten it to 6 years and it still is way higher then 20×.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "March 20, 2023, 05:32:18 PM",
      "body": "Quote from: Peanutswar on March 20, 2023, 12:23:03 PMFor the next coming year of 2024 there's an event will happen is the halving and there's a chance that we might experience again with the bitcoin price movement of the new ATH, for me its better to accumulate a lot of coins as long as you can because for the Bullrun of course that's the time all of your holdings become worth it. If you will take a look with the previous price ATH its always break the ATH so for the upcoming pump still no one knows, but the chance is still there.Now is the best time to buy and accumulate as much bitcoin as they can afford. If only the rainbow chart continues, then ATH can certainly be expected to become reality in the coming year.I don't know why some people are still unsure about the future potential of bitcoin, maybe they are new to it or maybe because they have been too busy with altcoin so far. Bitcoin is the best performing asset as a long term investment, it is supported by a lot of data in its history so far.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "March 20, 2023, 07:02:39 PM",
      "body": "Quote from: JamesDaniel90 on March 20, 2023, 05:00:34 PM10x on my portfolio not Bitcoin price. Bitcoin will only hit max $150k next bull run which is only a 5x which is why you need altcoins in your portfolio. Some altcoins pumped 10-20x last month alone, Bitcoin does that is 5-10 years  It is your strategy, thus if you believe in it you should stick to it. But if i am somewhat sure of a x5 of Bitcoin's price in the next bull run/after the next halving, then i'd take it, you believe you need altcoins in your portfolio because it can go way higher than that, maybe a x20 or x30, but which of them are you putting your money on to go that high? Or you'd just guess/gamble with quite a lot of them and hope to hit the jackpot, what if you are unlucky on all your guesses and most of them are just bagholding coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "March 20, 2023, 07:41:18 PM",
      "body": "Quote from: JamesDaniel90 on March 20, 2023, 10:54:17 AMHave been in crypto just over a year now so have yet to experience a bull market and up till now I have just bought and held. Currently my portfolio is 10% down and am not planning on selling any until I 2x at least. Bitcoin takes up 30% of my portfolio with the rest in altcoins. What is everyone expecting in 2024/25 bull run? Is a 10x a good return or should we be hoping for more? It determined on what you have in mind, if you are into short term investment, its obvious that you have make some reasonable profit depending on the fraction you invested,  but long term investors want the increment to continue to accelerate so that they can make more profits,  so what long term investors concentrate is to ensure we have continuity acceleration of market so that mega profits can be realised. The decision is determined by you if you are running for long-term or short-term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "March 20, 2023, 08:23:16 PM",
      "body": "Quote from: Mahirap on March 20, 2023, 11:23:17 AMQuote from: JamesDaniel90 on March 20, 2023, 10:54:17 AMWhat is everyone expecting in 2024/25 bull run? Is a 10x a good return or should we be hoping for more? I assume you have a plan for holding your bitcoin for a long time. You can make more than 2x of your initial investment if you have the patience of holding your assets, but also this is not guaranteed. If weinvest to day and sell on ATH of 2025, assuming that the price of Bitcoin will double its current ATH then it is more likely, ($140,000/27500 = 5) 5x of the investment.  A 500% increase of investment after 2 years isn't bad at all.  That is like 20% interest monthly not compounded though.Quote from: Mahirap on March 20, 2023, 11:23:17 AMYou can probably taste the bull run in 2024, after bitcoin halving.I think the market will shift to Bull market months before the halving, hype build up before the halving happens, so I expect that the market will transition to bull market before the Bitcoin halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "March 20, 2023, 08:32:07 PMLast edit: March 20, 2023, 08:46:23 PM by aoluain",
      "body": "Quote from: un_rank on March 20, 2023, 05:19:28 PMQuote from: JamesDaniel90 on March 20, 2023, 11:58:02 AMI am not selling my Bitcoin I will hold that till 2028 bull run at least when it is around $250,000. The altcoins I hold I am hoping for a 5-10x, some may go higher and some may go to zero I understand the risk but also reward is a lot higher than Bitcoin. No guarantee we would have a bullrun in 2028. It being a halving year increases the possibility but does not assure it.The risk to reward is not proportional and if you gamble with many altcoins, chances of getting burned is very high.Quote from: JamesDaniel90 on March 20, 2023, 11:58:02 AM50% of my altcoins are in the current top 15 with the remaining 20% being more gamble's which I feel can at least 20x next bull run. I plan to put a lot of my altcoin profits into Bitcoin once they start pumping. The last plan is good, but the chances of having funds to swap into bitcoin are low at the end, top 15 or not. Wish you goodluck anyway, we are only a bunch of Bitcoin Maximalists.Quote from: JamesDaniel90 on March 20, 2023, 05:00:34 PMSome altcoins pumped 10-20x last month alone, Bitcoin does that is 5-10 years  Fact check: Ten years ago, Bitcoin was sold at just over $100, its all time high now is $68,000, how much return on investment is that?Shorten it to 6 years and it still is way higher then 20×.- Jay -Yea I agree with your synopsis un_rank, Altcoins are a gamble whereas Bitcoin is nota gamble. I converted all my altcoins to Bitcoin a few years ago, I no longer have tohope and pray that they will give me a return.Quote from: JamesDaniel90 on March 20, 2023, 10:54:17 AMBitcoin takes up 30% of my portfolio with the rest in altcoins. What is everyone expecting in 2024/25 bull run? Is a 10x a good return or should we be hoping for more? Only 30% in Bitcoin, Bitcoin could be your best performer and I have read online that$250,000 is \"expected\" after the coming halving ~2024 thats 10x.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NdaMk",
      "created_time": "March 20, 2023, 08:48:11 PM",
      "body": "Quote from: JamesDaniel90 on March 20, 2023, 10:54:17 AMHave been in crypto just over a year now so have yet to experience a bull market and up till now I have just bought and held. Currently my portfolio is 10% down and am not planning on selling any until I 2x at least. Bitcoin takes up 30% of my portfolio with the rest in altcoins. What is everyone expecting in 2024/25 bull run? Is a 10x a good return or should we be hoping for more? It’s going to be a different kind of bull run this time around, recession lurking, FED’s growing and much more. Although I expect close to 4x return, I don’t see bitcoin moving to 10x. Only Alticoins mostly meme coins could grow into that. I see you have filled up your portfolio with Alticoins and it clearly shows that your are looking at getting a huge return this bull run. My advice is only put in money you can’t afford to lose in this Altcoins and don’t take them as investment assets because some could even collapse before the bull run comes",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}