{
  "id": "topic_5459536",
  "title": "Maestro75",
  "author": "Maestro75",
  "created_time": "July 12, 2023, 12:19:29 PMLast edit: July 12, 2023, 04:11:34 PM by Maestro75",
  "content": "People online, analysts have said so many good things to expect as they think there is going to be great price movement for bitcoin soon. Some think the bull has started already and that the rest of the market will be in uptrend from now on. It is true that when bitcoin price increases it also affects the growth of other tokens positively. It makes us happy to see our tokens increase in price. Most tokens that are worthless will become valuable and increases in price during bull. It makes everyone excited and happy.My question here is if airdrops and bounties are still good means of getting good tokens for free that can worth something some day as we wait for the bull. In the past bounties and airdrops used to be profitable and alot of people rushed them. Am not referring to bounties as in signature bounties that we have here. Am talking about websites outside this forum that give minor social media tasks and then pay in tokens. If anyone knows any credible sources where to get airdrops should please drop links. Maybe new members who are not in campaigns can help themselves with them and try their luck. We are approaching bull season and this can be helpful for people to make money from them.Please drop links if you have them.NOTE — Please I only need those who have links to share to post here and not spammers who want to meet up count for their campaigns.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459536",
  "comments": [
    {
      "author": "Nwada001",
      "created_time": "July 12, 2023, 01:49:01 PM",
      "body": "The bull run is around the corner, and we all should be prepared in whatever way that we can, gather what we can, and wait for that time. But we should not cast all our hope in one basket, as it's not always healthy. About airdrops and bounty, I guess you already know of the bounty section where you can get a few airdrops and bounty from. I don't know how effective those are, but I guess it's still rewarding their hunters; if not, people won't be doing it, so I guess you can use those places to participate in a few that you fit in, and probably you will be paid those tokens at the end of the campaign. But it's always a 50/50 thing, as most of them might end up not being worth the work and stress. You can check out: airdropalert   dappradar  I no longer do airdrops, so I have not tried them myself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "July 12, 2023, 02:16:39 PM",
      "body": "I won't even encouraged anyone dear to me to start hunting for an airdrop as it's not a guaranteed way to earn free tokens. Although don't quote me wrongly because we have witnessed lot of things within the crypto sphere about what airdrops has done to many of us here, I had an ugly encountered with airdrops back then that made me not to relatively channel and focuses my efforts to earn a free token with just simply tasks.Always learn to look above those peanuts otherwise you could get your whole wallet compromised whereby you will have to lose your valuable in the wallet. So avoid free token from airdrops, and if you must insist of doing then check the altcoin bounty sections I think there are some airdrop currently running.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "July 12, 2023, 02:24:04 PM",
      "body": "Why this thread is posted in Economy section? what's the relation between shitcoins and general Economy?There are no legit airdrop or bounties anymore, they were already death since 2018. Bitcoin bull run might affect those shitcoins price went up, but it doesn't make the project will want to distribute the reward for bounty hunters. After all the project team will earn almost of the money they make while the bounty hunters only work for free.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BD Crypto",
      "created_time": "July 12, 2023, 02:28:05 PM",
      "body": "Quote from: Maestro75 on July 12, 2023, 12:19:29 PMMy question here is if airdrops and bounties are still good means of getting good tokens for free that can worth something some day as we wait for the bull. In the past bounties and airdrops used to be profitable and alot of people rushed them.In my opinion it's much worthy than doing microjobs or claiming faucets. We still can see many airdrop campaigns are being launched by many promising projects and also from many exchanges. Beside it retroactive, testnet airdrops are much better than any other airdrops. We can have a look at APT, Matter, ARB, Optimism and many more. So some airdrop can change your future if your luck support you. Bounties are also an effective way for a passive income. But I who can join Article or Video campaign they can earn even more. Always we should join potential airdrops and bounties as all are not going to pay you and all will not be successful. Quote from: Maestro75 on July 12, 2023, 12:19:29 PMIf anyone knows any credible sources where to get airdrops should please drop links. Maybe new members who are not in campaigns can help themselves with them and try their luck. We are approaching bull season and this can be helpful for people to make money from them.Please drop links if you have them.We should not actually follow a particular website to get airdrops as there may have some promoted projects which is time wasting. Some will be fake to gather personal information from users to scam in future. So you will not find there potential airdrops easily as they have a big list. You can follow some well known YouTube channels, telegram channels to get latest potential airdrops. Anyway I visited a website which contains latest airdrops. You can check here https://airdrops.io Do your own research before joining any Airdrops or Bounties",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "July 12, 2023, 02:49:17 PM",
      "body": "The problem is that you cannot get something good and profitable for free. Most of the successful airdrops required conditions from the users, for example, you have used the exchange at a certain time, or to deposit and withdraw with a certain balance. Therefore, the idea of getting free money from an airdrop and having a future value is an excluded idea.Therefore, search for a good token, even if there are some conditions for it, as long as the platform or the entity issuing it will have value in the future.You can also benefit from these links[1][2].[1] https://icomarks.com/airdrops[2] https://airdrops.io/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "July 12, 2023, 03:16:05 PM",
      "body": "Quote from: Maestro75 on July 12, 2023, 12:19:29 PMMy question here is if airdrops and bounties are still good means of getting good tokens for free that can worth something some day as we wait for the bull. I think working on airdrops doesn't always get good tokens and they can't even be sold at all. So don't get your hopes up with airdrops, but if you really want to spell it out, that's okay as long as you don't spend time just focusing on airdrops. It's just free money, side jobs whose nature doesn't guarantee 100% payout. I don't need to give you any groups, links because airdop channels are easy to find especially on telegram and twitter.Quote from: Adbitco on July 12, 2023, 02:16:39 PMI won't even encouraged anyone dear to me to start hunting for an airdrop as it's not a guaranteed way to earn free tokens. Although don't quote me wrongly because we have witnessed lot of things within the crypto sphere about what airdrops has done to many of us here, I had an ugly encountered with airdrops back then that made me not to relatively channel and focuses my efforts to earn a free token with just simply tasks.Always learn to look above those peanuts otherwise you could get your whole wallet compromised whereby you will have to lose your valuable in the wallet. So avoid free token from airdrops, and if you must insist of doing then check the altcoin bounty sections I think there are some airdrop currently running.If only referring to rewards, I will never recommend anyone to do an Airdrop. But in the end there's nothing wrong with an airdrop, don't pretend it's bad even though most of the free coins that are generated don't live up to expectations or end up being scams. I don't forbid those closest to me if they want to get to know crypto and the easiest way to lure is to do an airdrop, at least they get a lesson that nothing in this world is really instant to make money in any case everything needs struggle, process, hope and even disappointment in order to form a strong mentality.Quote from: Solosanz on July 12, 2023, 02:24:04 PMThere are no legit airdrop or bounties anymore, they were already death since 2018.You are right, but not completely right. Maybe people think the same since 2018 changed the paradigm about airdrops. But new projects keep popping up, building on and trying to dispel skepticism even though the end result is 50:50.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "July 12, 2023, 03:30:48 PM",
      "body": "Bull run or not, once you find a good project that is running a campaign for free tokens for your services you should participate.It is not always easy to have money to invest, sometimes you can be lucky to participate in a good project that will eventually become valuable. However, it is individual choices. Airdrops despite the negative view on them has change many people's financial situation. If you have the means, you can go ahead and invest your money. But doing both airdrop or bounty won't cost you much except few minutes or an hour of your time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "July 12, 2023, 03:54:38 PM",
      "body": "There is no doubt that when the bull run arrives, as the price of Bitcoin moves, the price of practically all crypto tokens and coins will rise, and that is when new projects will emerge, some of which will profit from the Bitcoin market trend.Quote from: Maestro75 on July 12, 2023, 12:19:29 PMMy question here is if airdrops and bounties are still good means of getting good tokens for free that can worth something some day as we wait for the bull. In the past bounties and airdrops used to be profitable and alot of people rushed them. Am not referring to bounties as in signature bounties that we have here. Am talking about websites outside this forum that give minor social media tasks and then pay in tokens. Many users have testified that bounties and airdrops were very good and profitable back then because they did earn a lot of money through bounty participation, but nowadays, almost all of the projects listed in bounty sections are not worthy of people's attention because they are mostly scam projects.QuoteIf anyone knows any credible sources where to get airdrops should please drop links. Maybe new members who are not in campaigns can help themselves with them and try their luck. We are approaching bull season and this can be helpful for people to make money from them.Did you still believe in airdrops?I think scammers have already taken advantage of airdrops as a means of getting people scammed by gaining the necessary information about their wallets and then hacking into the wallets to swap or withdraw almost all the valuable coins in the wallets.Nevertheless,  The Bounties (Altcoins) section is there for users that might be interested in participating in any bounties, but to me it is a waste of time, unless, as we are approaching the bull run, maybe one or two lucky projects might be lunched.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maestro75",
      "created_time": "July 12, 2023, 04:08:59 PM",
      "body": "Thank you to all who are sending links, that helps. For those who are only posting here to increase their signature counts, that is not what I asked for. I will edit the op to include that. I need links that can help those who are going to need them, and not hunters spamming this thread to meet up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "July 12, 2023, 04:27:03 PM",
      "body": "Bah, first of all why would you want tokens earned through bounties that are probably going to be worthless when, if you're a decent writer and have been around long enough to have ranked up, you could join a signature campaign and earn the real deal?  Sure, when the price of bitcoin rises a lot of other coins do as well, but that's not true across the board.  Especially not with some of the crappy-ass tokens offered by bounties.Second, I don't know if bounties still work the way they used to, but during the ICO mania sometimes bounty hunters were lucky to get paid anything at all, because they'd have to wait until the launch of the project until they were to be paid and by then some of the shady project devs suspiciously didn't feel like paying for all the advertising that was done.  And man, I had to take a look at bitcoin's price chart just now.  It seems like it's been frozen at $25-30k for a while now, but after the crash of last year it does look like another bull market might be near--but charts can and do lie, so I'm not advising anyone to adopt TA as an investment/trading strategy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "July 12, 2023, 04:32:22 PM",
      "body": "Quote from: naira on July 12, 2023, 03:16:05 PMQuote from: Adbitco on July 12, 2023, 02:16:39 PMSnipIf only referring to rewards, I will never recommend anyone to do an Airdrop. But in the end there's nothing wrong with an airdrop, don't pretend it's bad even though most of the free coins that are generated don't live up to expectations or end up being scams. I don't forbid those closest to me if they want to get to know crypto and the easiest way to lure is to do an airdrop, at least they get a lesson that nothing in this world is really instant to make money in any case everything needs struggle, process, hope and even disappointment in order to form a strong mentality.Don't quote me wrongly I never said airdrop is bad but I am only emphasising on the security aspect because people get swiped off just because of airdrop and yet lot of people are unaware on how to run and manage their wallet to participate in airdrops rewards. Lot project sees it as a way of boosting their pages and channels whereby people would end up doing those task without any results as means of compensation or even end ups received worthless tokens. Before airdrops where beneficial but not now again maybe if there real airdrop it could be rear to find them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maestro75",
      "created_time": "July 12, 2023, 04:59:39 PM",
      "body": "Quote from: The Sceptical Chymist on July 12, 2023, 04:27:03 PMBah, first of all why would you want tokens earned through bounties that are probably going to be worthless when, if you're a decent writer and have been around long enough to have ranked up, you could join a signature campaign and earn the real deal?  Sure, when the price of bitcoin rises a lot of other coins do as well, but that's not true across the board.  Especially not with some of the crappy-ass tokens offered by bounties.Am not asking for signature bounties or airdrops here. Am asking for something outside here. It will not be a crime to have more avenues of legitimate earning, earn here and also outside. Although am not asking for myself alone but for others who are not asking here. You mentioned bitcoin, I have read something here in the past where people were thrown bitcoin at for free just for simple tasks. Some people got bitcoin then for just indicating interest that they needed it. That was when bitcoin was believed not to be anything and those holding it were mocked for wasting their time like we do now. Maybe today's worthless tokens will become useful tomorrow also like bitcoin is today. No one can know all that now. Taking risk is all we do in all, both with bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "July 12, 2023, 05:06:39 PM",
      "body": "I read this post and I just start laughing, I have history with tokens and I can show hou screenshot of over 25 different tokens in my wallet from 2018 that are all dead today, they don't have any value or they are already abandoned. Most tokens that are already worthless will never pump anymore, even the most popular altcoins might not reach their old all time high again, we have seen this happened over and over again.Money will move from those old projects into new promising projects, I am just trying to help, if you are into altcoins you should look into new narratives in the space, Aptos, Sui, Arbitrum, Aleph Zero and many more will do very well in next bull season, Focus on such fundamental instead. Airdrops can make you lose your crypto assets, make sure you use a separate wallet for airdrops if you have an interest in them, download metamask and use only for airdrops, do not store valuable asset on the wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ololajulo",
      "created_time": "July 12, 2023, 05:15:13 PM",
      "body": "I have a different perspective on the market's observation regarding bounties. If altcoins are capable of raising funds independently, without relying on exchanges and prominent venture capitalists, it has the potential to trigger a substantial bull run similar to the one witnessed in 2017. However, this also opens the door for a significant increase in scams, reminiscent of the ICO era. Additionally, the demand for high-quality projects from exchanges(IEO)may  I believe that an early altcoin bull run can facilitate the movement of funds, with the exception of the vesting period. one critical concern arises: How can we control the actions of altcoin teams who hold a significant amount of coins post-crowdfunding and prevent them from causing a market dump?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MainIbem",
      "created_time": "July 12, 2023, 05:33:09 PM",
      "body": "Everyone has their own experience with airdrops because is no longer helpful anymore. How do you think the bull market will make those shitcoin yield good amount in wallet after earning, I have actually had a news of people make cool money from airdrop but doesn't always come at all time. But do not put more energy in searching for airdrop rather look for a decent way to start earning either by joining some content campaign or signature campaign since your account already Sr member.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "July 12, 2023, 06:50:35 PM",
      "body": "If you are not referring to the airdrops and bounties shared here on BTT then you are seeking from outside sources. If thats the case then there are many airdrop hunter and influencers that will lead you to some good projects. I have been following below 2 indian Youtubers from a long time. And i spent some time in joining there provided Airdrops and Bounties that would help me to earn extra money. Genuine Airdrop  Airdrop King AADI fully trust aforementioned 2 Airdrop providers but let me tell you that, most of the airdrop will be of zero value so you have to careful and selective and even when you wanted to follow them.I also had another suggestions for you but tbh i just get to know about them and i didn't joined any of there provided airdrops so i cannot assure you to trust them. As i said before you have to dyor and be selective because not every airdrop or task will award you money. Quote@HomerSigma  @KashKysh  @rektfencer  @Moomsxxx @leshka_eth  @the_smart_ape @cryptocrushmia  @AlphaFrog13  @zucl1ck  @MacnBTC  @0xFinish  @wacy_time1 @belizardd  @Faycy_crypto  @splinter0n @CryptoShiro_These are some usernames of influencer on twitter who consistently share new airdrops and bounties that you could try. If you find difficulty in finding each user then visit this post for direct access to their profiles. https://twitter.com/Aieee0x/status/1677346774476783617I am not asking and forcing you to follow them. You have to dyor before following there leads and provided information about upcoming or new Airdrops and Bounties.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maestro75",
      "created_time": "July 13, 2023, 07:45:16 AM",
      "body": "Am grateful to everyone who is posting useful links here. Keep posting more. I will collect all later and edit the op with that and reference those who send them. Thank you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AicecreaME",
      "created_time": "July 13, 2023, 07:58:33 AM",
      "body": "Quote from: Adbitco on July 12, 2023, 02:16:39 PMI won't even encouraged anyone dear to me to start hunting for an airdrop as it's not a guaranteed way to earn free tokens. Although don't quote me wrongly because we have witnessed lot of things within the crypto sphere about what airdrops has done to many of us here, I had an ugly encountered with airdrops back then that made me not to relatively channel and focuses my efforts to earn a free token with just simply tasks.Always learn to look above those peanuts otherwise you could get your whole wallet compromised whereby you will have to lose your valuable in the wallet. So avoid free token from airdrops, and if you must insist of doing then check the altcoin bounty sections I think there are some airdrop currently running.I definitely agree.Hunting airdrops now compare to the past like way back 2017 is not the same anymore. Lot of airdrops these days are just shitcoins and some are scams that will just steal your funds in a certain wallet. That's why it is important to make a new wallet if joining to an airdrop even bounties, since mostly they requires ERC20 wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "July 13, 2023, 10:35:58 AM",
      "body": "Quote from: AicecreaME on July 13, 2023, 07:58:33 AMQuote from: Adbitco on July 12, 2023, 02:16:39 PMI won't even encouraged anyone dear to me to start hunting for an airdrop as it's not a guaranteed way to earn free tokens. Although don't quote me wrongly because we have witnessed lot of things within the crypto sphere about what airdrops has done to many of us here, I had an ugly encountered with airdrops back then that made me not to relatively channel and focuses my efforts to earn a free token with just simply tasks.Always learn to look above those peanuts otherwise you could get your whole wallet compromised whereby you will have to lose your valuable in the wallet. So avoid free token from airdrops, and if you must insist of doing then check the altcoin bounty sections I think there are some airdrop currently running.I definitely agree.Hunting airdrops now compare to the past like way back 2017 is not the same anymore. Lot of airdrops these days are just shitcoins and some are scams that will just steal your funds in a certain wallet. That's why it is important to make a new wallet if joining to an airdrop even bounties, since mostly they requires ERC20 wallets. The worst airdrop one would join are those ones that requires connecting of wallet to claim token, I think whenever you come encounter with this type of airdrops do not use your main wallet to connect with the airdrop site otherwise all your funds might got swipe off. There are still legit airdrops but it comes with those holding some certain tokens in their wallet it would be a privilege for them claim their rewards just as Uniswap did. I think such airdrop are really beneficial to participants.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}