{
  "id": "topic_5454812",
  "title": "marcopalmieri",
  "author": "marcopalmieri",
  "created_time": "June 02, 2023, 01:34:13 AM",
  "content": "Ciao a tutti,ho letto diversi post sul forum e mi sono venuti parecchi dubbi sul rischio di riciclaggio tradando in P2P che credevo essere sicuramente una cosa legale, ora meno.La questione è il KYC. Se faccio compravendita di criptovaluta con altri utenti di Binance devo essere io a preoccuparmi dell'identità della persona con cui sto effettuando un trade,cosa a mio avviso improponibile o è sufficiente che lo faccia Binance e io posso tradare tranquillamente senza preoccuparmi della questione?Grazie a chi vorrà chiarire questo dubbio.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454812",
  "comments": [
    {
      "author": "duesoldi",
      "created_time": "June 02, 2023, 07:54:31 PM",
      "body": "A quale normativa fai riferimento di preciso ?Va beh che le normative in questo settore sono spesso campate per aria (tanto per non essere volgari) ma comunque ogni tanto il legislatore ha previsto alcune esclusioni, ad esempio per gli attori coinvolti (es. privati) o quando il contesto non avrebbe consentito di raccogliere le info necessarie (il p2p mi sembra esempio calzante).Se riesci a specificare qualche dettaglio sulla normativa cui ti riferisci magari possiamo commentare meglio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "marcopalmieri",
      "created_time": "June 04, 2023, 12:00:59 PM",
      "body": "Faccio riferimento alla normativa KYC e ci si può fare un'idea di cosa sia qui https://www.intesa.it/che-cose-il-kyc-e-perche-adottarlo/Il trading P2P comporta che io come trader acquisti e venda cryptovaluta ad un altro trader e la compravendita può avvenire anche regolarizzando il trade con valuta FIAT pertanto volevo capire fino a che punto io sono costretto dalla suddetta normativa a richiedere informazioni alla mia controparte.Questo per evitare come succede che le banche poi ti chiudano il tuo conto senza troppi convenevoli rischiando la violazione delle normative antiriciclaggio quando capiscono che fai trading P2P utilizzando quel conto bancario.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "duesoldi",
      "created_time": "June 04, 2023, 01:55:51 PM",
      "body": "Cosa sia il KYC lo so ma nel link che hai messo non vedo alcun riferimento al trading p2p.Sono tenuti a farlo i prestatori di servizi di valuta virtuale, ma una piattaforma p2p non è un prestatore di servizi, no ?Per quello chiedevo a quale normativa ti riferissi di preciso.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "marcopalmieri",
      "created_time": "June 06, 2023, 08:47:46 AM",
      "body": "Un exchange quale Binance o tutte gli exchange di crypto offrono un servizio di trading P2P ovvero fanno da garante a scambi di cryptovaluta/FIAT tra trader privati.Gli scambi di valute avvengono tutte sotto il controllo dell'exchange, nel mio caso Binance.Ma non so fino a che punto sia responsabile io quale trader privato o l'exchange che offre il sevizio di verifica del KYC, da qui nasce il mio quesito..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HedgeFx",
      "created_time": "June 06, 2023, 11:07:31 AM",
      "body": "In generale quando fai trading p2P ti esponi come controparte con altri utenti di cui solitamente non sai praticamente nulla. Se questi sono in qualche modo coinvolti in attività illecite, potresti in teoria (ma sovente anche in pratica) ritrovati impelagato in situazioni poco gradevoli in quanto tu potresti essere ritenuto dalle FFOO un associato di questi sodalizi criminali. Ecco, vuoi un consiglio? Stai alla larga dal tradin P2P Quote from: marcopalmieri on June 02, 2023, 01:34:13 AMCiao a tutti,ho letto diversi post sul forum e mi sono venuti parecchi dubbi sul rischio di riciclaggio tradando in P2P che credevo essere sicuramente una cosa legale, ora meno.La questione è il KYC. Se faccio compravendita di criptovaluta con altri utenti di Binance devo essere io a preoccuparmi dell'identità della persona con cui sto effettuando un trade,cosa a mio avviso improponibile o è sufficiente che lo faccia Binance e io posso tradare tranquillamente senza preoccuparmi della questione?Grazie a chi vorrà chiarire questo dubbio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "duesoldi",
      "created_time": "June 06, 2023, 06:43:21 PM",
      "body": "Quote from: marcopalmieri on June 06, 2023, 08:47:46 AMUn exchange quale Binance o tutte gli exchange di crypto offrono un servizio di trading P2P ovvero fanno da garante a scambi di cryptovaluta/FIAT tra trader privati.Gli scambi di valute avvengono tutte sotto il controllo dell'exchange, nel mio caso Binance.Ma non so fino a che punto sia responsabile io quale trader privato o l'exchange che offre il sevizio di verifica del KYC, da qui nasce il mio quesito..Con trading p2p si intende il trading su piattaforme decentralizzate, non su cex come lo è Binance.Quando fai trading su Binance (o un qualsiasi cex) sei stato soggetto a KYC da parte di Binance, stessa cosa è successa alla controparte/i:; anche loro sono tutti clienti del cex e quindi stati oggetto di kyc.Quindi nel casso di un cex è il cex che assolve ai requisiti previsti dalla normativa.Del resto - scusa - se tu compri azioni in banca ti devi preoccupare di sapere chi te le vende ? no di certo.....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "marcopalmieri",
      "created_time": "June 06, 2023, 07:46:31 PM",
      "body": "Grazie per le risposte. Anche se i dubbi di prima mi sono rimasti.. in teoria dovrei stare tranquillo perchè dato che Binance è un exchange centralizzato non devo preoccuparmi io di verificare le controparti.D'altro canto come giustamente dice HedgeFx non vorrei rischiare di trovarmi delle grane inconsapevolmente per reati che non ho commesso. Il problema è che si riesce a guadagnare bene con il trading P2P ma se devo poi passarmi giornate a giustificarmi per cose di cui non c'entro nulla e soprattutto non conosco perchè non sono sotto il mio controllo mi viene davvero voglia di lasciar perdere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "duesoldi",
      "created_time": "June 07, 2023, 08:05:50 PM",
      "body": "Quote from: marcopalmieri on June 06, 2023, 07:46:31 PM....D'altro canto come giustamente dice HedgeFx non vorrei rischiare di trovarmi delle grane inconsapevolmente per reati che non ho commesso. ...Credo che HedgeFx nella sua risposta si riferisse a quanto avviene nei sistemi p2p, non al trading via cex. Tu però parli di Binance e quello è un cex, non un sistema p2p.Lascio comunque confermare l'interpretazione a HedgeFx.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HedgeFx",
      "created_time": "June 08, 2023, 12:22:37 PM",
      "body": "Confermo.Ma mi sorge un dubbio: posto che lo scambio avviene da address Utente A ad address Utente B , se A o B hanno problemi chi mi dice che la controparte non si trovi comunque impegata.Esempio pratico:- A è un malfattore e vende porcherie illegali- B, in buona fede acquista / vende tramite P2P binance le sue crypro ad A- A  va sotto indagine per quello che ha fatto- B molto probabilmente avrà aanche i suoi casini in quanto a cascata si troverà a dover dimostrare di non avere rapporti con A.Come ne usciamo indenni? Certamente B avrà le sue belle grane. Quindi lasciamo perdere ogni scambio P2P (mia opinione personale)Quote from: duesoldi on June 07, 2023, 08:05:50 PMQuote from: marcopalmieri on June 06, 2023, 07:46:31 PM....D'altro canto come giustamente dice HedgeFx non vorrei rischiare di trovarmi delle grane inconsapevolmente per reati che non ho commesso. ...Credo che HedgeFx nella sua risposta si riferisse a quanto avviene nei sistemi p2p, non al trading via cex. Tu però parli di Binance e quello è un cex, non un sistema p2p.Lascio comunque confermare l'interpretazione a HedgeFx.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "duesoldi",
      "created_time": "June 08, 2023, 07:55:47 PM",
      "body": "Devo parzialmente correggere quel che ho scritto sopra perché non conoscevo la funzionalità P2P di Binance che ho scoperto solo ora proprio a partire dalla risposta di HedgeFx.Link alla pagina di info:https://www.binance.com/en/blog/p2p/binance-p2p-newbie-guide-7428324997079645557Quindi effettivamente sul P2P Binance una tx avviene tra due utenti singoli senza passare dal book come invece credevo. Ok, errore mio: chiedo venia e mi cospargo il capo di cenere!Tornando però alle domande iniziali direi che restano valide le risposte che stavo cercando di dare perché:1) tutti gli utenti sono comunque costretti a fare KYC  (vedere punto 3. del paragrafo \"How do I get started with Binance P2P?\")2) se non capisco male, la tx avviene comunque passando da wallet che sono gestiti da Binance, quindi con address loro (questo lo deduco dalla necessità di spostare fondi tra i P2P wallets e funding wallets)In sintesi - quindi - penso che la conclusione sia la stessa che  indicavo prima: puoi stare tranquillo circa il fatto che nessuno possa accusarti di fare affari con persone \"non gradite\".Quote from: HedgeFx on June 08, 2023, 12:22:37 PM....Come ne usciamo indenni? Certamente B avrà le sue belle grane. Quindi lasciamo perdere ogni scambio P2P (mia opinione personale)....Secondo me no perché passi da wallet sotto il controllo di Binance - vedi sopra - quindi sono loro a dover fare kyc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bastisisca",
      "created_time": "June 17, 2023, 07:28:13 AM",
      "body": "Quote from: HedgeFx on June 08, 2023, 12:22:37 PMConfermo.Ma mi sorge un dubbio: posto che lo scambio avviene da address Utente A ad address Utente B , se A o B hanno problemi chi mi dice che la controparte non si trovi comunque impegata.Esempio pratico:- A è un malfattore e vende porcherie illegali- B, in buona fede acquista / vende tramite P2P binance le sue crypro ad A- A  va sotto indagine per quello che ha fatto- B molto probabilmente avrà aanche i suoi casini in quanto a cascata si troverà a dover dimostrare di non avere rapporti con A.Come ne usciamo indenni? Certamente B avrà le sue belle grane. Quindi lasciamo perdere ogni scambio P2P (mia opinione personale)Quote from: duesoldi on June 07, 2023, 08:05:50 PMQuote from: marcopalmieri on June 06, 2023, 07:46:31 PM....D'altro canto come giustamente dice HedgeFx non vorrei rischiare di trovarmi delle grane inconsapevolmente per reati che non ho commesso. ...Credo che HedgeFx nella sua risposta si riferisse a quanto avviene nei sistemi p2p, non al trading via cex. Tu però parli di Binance e quello è un cex, non un sistema p2p.Lascio comunque confermare l'interpretazione a HedgeFx.Putroppo la legge non ammette scappatoie, ma mettendoci nei loro panni possiamo capire che serve anche a loro per capire la rete di eventuali illeciti.Scambi p2p no con gente che non conosci oppure deve essere p2p solo con cryptovalute. In quel caso se non esci in EURO nessuno mai fa associazione te/qualcuno.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}