{
  "id": "topic_5416498",
  "title": "Crypt0Gore",
  "author": "Crypt0Gore",
  "created_time": "October 09, 2022, 12:54:11 PM",
  "content": "To all my fellow newbies out there, you must have come across some advice saying that you lose nothing if you hold your coins, that's not 100% true, you only lose nothing if you buy Bitcoin, some people bought BTC at 19000$ in 2017 ATH and they held, BTC later hit 60,000+ but that's because its BTC, do not try this with Altcoins, many Altcoins will die and many won't ever reach their ATH again.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416498",
  "comments": [
    {
      "author": "Cointxz",
      "created_time": "October 09, 2022, 01:02:06 PM",
      "body": "Quote from: Crypt0Gore on October 09, 2022, 12:54:11 PMTo all my fellow newbies out there, you must have come across some advice saying that you lose nothing if you hold your coins, that's not 100% true, you only lose nothing if you buy Bitcoin, some people bought BTC at 19000$ in 2017 ATH and they held, BTC later hit 60,000+ but that's because its BTC, do not try this with Altcoins, many Altcoins will die and many won't ever reach their ATH again.Some Altcoin moves like Bitcoin especially those on the top marketcap like Ethereum. You are generalizing Altcoin as shitcoin while there are still a lot of them that has price history like Bitcoin. Maybe you should change it to Shitcoins because that's what really you are trying to express on your statement.Besides, Paper loss is still a loss since you are missing the opportunity to use your money in different investment to have profit since you are forced to hold just to recover your loss. But I agree with you that Bitcoin is the only best coun for holding because this coin is the safest investment on crypto space since its the first mover on crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "October 09, 2022, 01:57:24 PM",
      "body": "Saying \"you only lose nothing if you buy Bitcoin\" is sort of implying that there isn't any risk associated with bitcoin as an investment — which is definitely not the case. And while I'm saying this as someone who's long-term bullish, the chances of bitcoin being successful for the long term is definitely not 100%.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "October 09, 2022, 02:54:49 PM",
      "body": "Quote from: Crypt0Gore on October 09, 2022, 12:54:11 PMyou only lose nothing if you buy Bitcoin, some people bought BTC at 19000$ in 2017 ATH and they held, BTC later hit 60,000+ but that's because its BTCSome IFsIt's Bitcoin BTCIt is holding, not trading, not gamblingIf you hold Bitcoin long enough with your own money for investmentYou store your Bitcoin in non custodial wallet so that you won't be scammed by exchanges (scam exit, hack exit, etc.)Quotedo not try this with Altcoins, many Altcoins will die and many won't ever reach their ATH again.Most of altcoins die in bear market. They lose values in bear market but the worst is their developers abandon their projects. They will create new projects in next bull runs.There are some altcoins don't die in bear market but they usually lose 90% to 99% of their values from all time highs in bull market. Most of them can not reclaim all time high even Bitcoin has a next bull run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "IIrik11",
      "created_time": "October 09, 2022, 02:58:08 PM",
      "body": "u only lose nothing if u invest what u can afford to lose.i'd say this instead, simple, honest, truth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "October 09, 2022, 03:12:54 PM",
      "body": "Quote from: Crypt0Gore on October 09, 2022, 12:54:11 PMyou only lose nothing if you buy Bitcoin...That's not entirely true. If you bought BTC at 60k, you currently lost the opportunity to buy three times more for the same amount of money. Of course, bitcoin can go back to its old ways and reach new heights, but it is wrong to say that you have lost nothing. We don't know the future, and it's possible that bitcoin will be the singularity of currency and worth 100x what it is today. But we also have to consider the cold, hard truth: if you spent $ on bitcoin and didn't sell at a higher price, you lost money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "isaac_clarke22",
      "created_time": "October 09, 2022, 04:42:45 PM",
      "body": "Quote from: mk4 on October 09, 2022, 01:57:24 PM......the chances of bitcoin being successful for the long term is definitely not 100%.Yeah this is the realistic view anyway. I am optimistic about Bitcoin being successful and would have a lot of users in the future, but not everyone is the same anyway. We had seen plenty of hates already with Bitcoin and that might or might not affect other people's view on cryptocurrency depending on them.People should still know what they're about to be involved with when they're into crypto. It is not your \"walk in the park\" kind of activity if you were even trading stocks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "October 09, 2022, 04:43:50 PM",
      "body": "Altcoin is a shitcoin that never regained its value after going down badly even I'm not sure shitcoin will rise even though there is a lot of speculation about the coin.Bitcoin will not lose if you hold it for a long time instead the value will be higher, for example if you buy now $19,000 and hold for some time but I'm sure it will definitely return to high prices because the previous cycle also repeats the old history that makes me more believe in Bitcoin and leave all shitcoins.Shitcoins will not develop until whenever they tend to decrease in value by more than 80% after listing on the exchange, well they take advantage of FOMO, HYPE situations to increase prices.Save Bitcoin it became the best way for us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "October 09, 2022, 11:17:13 PMLast edit: October 09, 2022, 11:31:13 PM by sheenshane",
      "body": "Many people still prefer altcoins which is a wrong mindset because they want a quick profit, especially in memecoins.It seems they like to gamble their money in a short period of time, we know Bitcoin takes a long time before you'll see profit but at least it's sure that you'll have it.Bitcoin has been known that potentially can make a profit upon storing the value as your long time investment if you have an amount that can afford to wait and lock in a long-term period of time, choose Bitcoin rather than put it into a centralized organization or bank.If you hold 1 Bitcoin it will remain 1 Bitcoin whatever the market condition.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "October 09, 2022, 11:31:24 PM",
      "body": "It's a fallacy to think that unrealized losses don't matter, regardless if you talk about Bitcoin or altcoins. There's absolutely no guarantee that if you wait long enough, you will break even. You are right that altcoins have way worse chances of recovering than Bitcoin. But nobody should put all their money into Bitcoin and think that it's a risk-free strategy to get rich.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "October 09, 2022, 11:35:05 PM",
      "body": "You cannot blame the people who have invested in bitcoin and have seen the prices volatility, and some people cannot handle that changes in that because they always see what they lost and that day or maybe a week. People need to understand how difficult it is to not see the short-term but focus only on the long-term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptocurencyKing",
      "created_time": "October 09, 2022, 11:59:29 PM",
      "body": "Quote from: crwth on October 09, 2022, 11:35:05 PMYou cannot blame the people who have invested in bitcoin and have seen the prices volatility, and some people cannot handle that changes in that because they always see what they lost and that day or maybe a week. People need to understand how difficult it is to not see the short-term but focus only on the long-term. No one invests with believes that they could lose one day but, that's the sad reality as loses are a vital part of business. It's in loses that some other person might gain although, that's not always the case as there are sme typical win win situations.When you make investments, you get to realise tht there is the possibility of a lose but the good news in this as per price volatility is, you have have chance to mitigate that. By using time as a life line to stay on until you can actually gain. Selling becomes the way to loose and so you hold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "October 10, 2022, 03:54:19 AM",
      "body": "It's an unrealized losses as long as you're not sold your coins. Bitcoin is already accepted as a legal tender on El Salvador and Central African Republic, technically any change with Bitcoin price isn't matter for those countries since 1BTC = 1BTC. But AFAIK those countries still convert their Bitcoin to USD equivalent, which mean they're more trust USD than BTC price.It's still hard to say you're lose nothing when everyone still rely on USD equivalent, so it's make sense for many people are worried if Bitcoin price decrease more than 10%. Diversify to other assets is needed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "October 10, 2022, 11:04:06 AM",
      "body": "Quote from: Crypt0Gore on October 09, 2022, 12:54:11 PMTo all my fellow newbies out there, you must have come across some advice saying that you lose nothing if you hold your coins, that's not 100% true, you only lose nothing if you buy Bitcoin, some people bought BTC at 19000$ in 2017 ATH and they held, BTC later hit 60,000+ but that's because its BTC, do not try this with Altcoins, many Altcoins will die and many won't ever reach their ATH again.The unrealized losses can be frustrating, I noticed this when I was losing. But if you can be very patient and wait, bitcoin would hit all-time-high, but just that it can be long, some people may only want to invest within short time period. But of investing in bitcoin for long time period, the unrealized losses would become profit.Quote from: Despairo on October 10, 2022, 03:54:19 AMIt's an unrealized losses as long as you're not sold your coins.Yes, it is unrealized loss if you did not sell your bitcoin, but that is not true for altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "October 10, 2022, 12:45:42 PM",
      "body": "Thats a bold statement. Even bitcoin could experience a 3k 5k or 10k level again if it deemed to happen. No one can exactly predict the future cryptocurrency. Some say it could reach 200k to million but what do they knew? Prediction isnt guarantee and the reverse could happen anyway. What I truly think is dont ever invest with money you cant afford to lose so you dont have any regrets even its not in our favor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "October 11, 2022, 11:13:10 AM",
      "body": "Quote from: Crypt0Gore on October 09, 2022, 12:54:11 PMTo all my fellow newbies out there, you must have come across some advice saying that you lose nothing if you hold your coins, that's not 100% true, you only lose nothing if you buy Bitcoin, some people bought BTC at 19000$ in 2017 ATH and they held, BTC later hit 60,000+ but that's because its BTC, do not try this with Altcoins, many Altcoins will die and many won't ever reach their ATH again.Of course, there is a minimum goal for some to save their funds, but when investing, the goals should be higher: not just to save their funds, but to multiply them. Accordingly, those who bought bitcoins for 17 thousand dollars and did not sell for 60 thousand, they did not lose anything, but also did not get a profit, as they continue to hold their BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "October 11, 2022, 01:57:22 PM",
      "body": "Quote from: Crypt0Gore on October 09, 2022, 12:54:11 PMTo all my fellow newbies out there, you must have come across some advice saying that you lose nothing if you hold your coins, that's not 100% true, you only lose nothing if you buy Bitcoin, some people bought BTC at 19000$ in 2017 ATH and they held, BTC later hit 60,000+ but that's because its BTC, do not try this with Altcoins, many Altcoins will die and many won't ever reach their ATH again.And you only lose after holding bitcoin by selling at loss. That's all you need to do until you see the price goes up and then it's on the matter of how long you can achieve that time of selling at profit.Well, bitcoin is known to be on that scene at most times every after the bear market so, you only have to hold it as you've said. For some altcoins, the loss is greater if you're an altcoin lover and keeps on being hyped by it. Whilst for bitcoin, it's the most desired crypto to have and unlikely to end up like those altcoins you think of.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "October 11, 2022, 02:10:04 PM",
      "body": "Quote from: IIrik11 on October 09, 2022, 02:58:08 PMu only lose nothing if u invest what u can afford to lose.i'd say this instead, simple, honest, truth.Good luck with that, I only said what I said because Bitcoin is a better store of value than every other crypto projects in crypto space right now, even if BTC loses value it won't be the same on the long run, this is for the long term holders, even if you invest only what you can afford to lose its still money, how about you lose nothing if you invest nothing? .lol",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "October 11, 2022, 02:14:59 PM",
      "body": "Quote from: Crypt0Gore on October 09, 2022, 12:54:11 PMsome people bought BTC at 19000$ in 2017 ATH and they held, BTC later hit 60,000+ but that's because its BTC, do not try this with Altcoins, many Altcoins will die and many won't ever reach their ATH again.Many investors are still hodling on to some altcoins that they missed selling and that is a lesson either they profit from it or they finally kiss them good bye. Hodling of altcoins is very risky like you have said because it is not same as bitcoin. Bitcoin is the most guarantee crypto that has the tendency to go back to ATH of the previous but not altcoins do that rather they remain stagnant or die out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AakZaki",
      "created_time": "October 11, 2022, 07:22:34 PM",
      "body": "holding is not always profitable, but it is also influenced by how you target the price you will aim to take profit. if it's just holding on and continuing to hold from 2017 to now without ever taking a profit, that's a mistake that needs to be fixed. Should take a little profit to maintain the main capital. As long as the strategy used is correct by entering and exiting at the right time, then there is nothing to lose when it comes to holding BTC. Nowadays everyone believes in bitcoin and can reach its latest ATH, but with some altcoins it is still very risky and a tremendous decline. so don't hold on to altcoins too long.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}