{
  "id": "topic_5398938",
  "title": "Len Saldua",
  "author": "Len Saldua",
  "created_time": "May 16, 2022, 09:02:12 PM",
  "content": "We're nowhere near the bottom for Bitcoin for this cycle, and already some of my favourite projects like LABS ( Tokenized Real Estate ), Star Atlas ( play to earn ) , Blocktopia ( Metaverse ) and many others are approaching negative 99 %. How far down can they go ? Could some of these great projects be on the verge of getting wiped out ? The three I mentioned are absolutely top-notch projects, which could easily fit well into the top 100 in the next bull run. Would projects this good get wiped out ? Or could they keep falling lower and lower... maybe to negative 99.99999999999 % ?Incidentally, Terra LUNA is giving us a good example of this crazy situation... a few days ago the token went from 0.000001 to 0001 or something like that, made a few people crazy 20X gains even though the token was technically at zero ( or negative 99.99999 % )",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398938",
  "comments": [
    {
      "author": "keyscore44",
      "created_time": "May 16, 2022, 09:52:38 PM",
      "body": "Quote from: Len Saldua on May 16, 2022, 09:02:12 PMWe're nowhere near the bottom for Bitcoin for this cycle, and already some of my favourite projects like LABS ( Tokenized Real Estate ), Star Atlas ( play to earn ) , Blocktopia ( Metaverse ) and many others are approaching negative 99 %. How far down can they go ? Could some of these great projects be on the verge of getting wiped out ? The three I mentioned are absolutely top-notch projects, which could easily fit well into the top 100 in the next bull run. Would projects this good get wiped out ? Or could they keep falling lower and lower... maybe to negative 99.99999999999 % ?Incidentally, Terra LUNA is giving us a good example of this crazy situation... a few days ago the token went from 0.000001 to 0001 or something like that, made a few people crazy 20X gains even though the token was technically at zero ( or negative 99.99999 % )Unfortunately, the cryptocurrency market is brutal even for good projects. Of course, any project can drop by 99.99%, but that doesn't mean it's the end of it. Investors on classic exchanges say that if the fundamental analysis of a project is done right, it will always defend itself. So if the project is good and the developers want to develop it, there is always a chance for x1000 growth. Bitcoin has died dozens of times and is still doing well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "May 16, 2022, 10:06:39 PM",
      "body": "That's the sad reality of the market.If it's bull run, they're all promising and good projects that have the potential. But when the bear market comes, they're being tested and the majority of the altcoins are the ones suffering.Bitcoin is still good and normal when the bear comes although it's also decreasing, that's normal. If you've been in the market for a few years now and have experienced pumps and dumps. You'll get to realize that you should be patient even if your portfolio is probably going to be down as much as 99%. It's also based on your choice of investment with alts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Desmong",
      "created_time": "May 16, 2022, 10:17:12 PM",
      "body": "We don't know what could be the end of these coins but I am very sure that this dip can not wipe them out. I have seen countless of project that being launched in this dip and they are still struggling to get a bull  move when the market is in a big red. All these project will survive even though bitcoin goes as down as $20K next month. All we are going to see is more zeros added to the price and that will not make the project falls entirely, unless the team decided to abandon it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "May 16, 2022, 10:45:18 PM",
      "body": "Quote from: Len Saldua on May 16, 2022, 09:02:12 PM..... The three I mentioned are absolutely top-notch projects, which could easily fit well into the top 100 in the next bull run.So why worry about a -99% if you think they are that good? Altcoins at -90% is a normal sighting on a bear market so an additional drop of 9% is probably not that big of a deal. QuoteWould projects this good get wiped out ? Or could they keep falling lower and lower... maybe to negative 99.99999999999 % ?I don't know these projects but only the market could tell. Just set your app to notify you if you're planning to catch the floor price and make huge profits like what others did in the case of LUNA.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "May 16, 2022, 11:33:32 PM",
      "body": "Quote from: Len Saldua on May 16, 2022, 09:02:12 PMWe're nowhere near the bottom for Bitcoin for this cycle, and already some of my favourite projects like LABS ( Tokenized Real Estate ), Star Atlas ( play to earn ) , Blocktopia ( Metaverse ) and many others are approaching negative 99 %. Because they are Pump and dump shitcoins made to make the owners rich while you the common guys get ripped off. It seems you are still new in the same, but things already started when this year was beginningQuoteHow far down can they go ? Until they are worthless. Perhaps even $0By the time most of you wake up, the owners will have already abandoned the project and already moving onto the next one in preparation for the next bull run and cycle continues.QuoteCould some of these great projects be on the verge of getting wiped out ? Who told you shitcoins can be great?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WalkerIVIV",
      "created_time": "May 16, 2022, 11:52:18 PM",
      "body": "if a project has value near to zero I think it’s pretty much done for and gonna gets delisted ASAP.however there is definitely a chance for making instant gain like the ones you mentioned in the case of LUNA but it’s just some very few people that made gains compared with majority that losing their millions.if these great projects that you mentioned and proclaimed could somehow keep their market solid and not getting abandoned by the masses surely it’s just matter of time until they get back up again but projects that purely relying in the hype alone could easily vanish into void.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "makishart",
      "created_time": "May 16, 2022, 11:58:05 PM",
      "body": "yeah but those scalpers are also betting in their money. The price already dumped so hard and i think the fork for the new blockchain. I would not be surprised if the terra luna token got so many scalpers. Scalpers have become a winner in this project. You must take a look at the reserved funds of luna. This is also going down so hard. I think that in this situation so many people are feeling so hard to face the reality when luna goes down and everything got eaten by luna.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}