{
  "id": "topic_5444161",
  "title": "Alik Bahshi",
  "author": "Alik Bahshi",
  "created_time": "March 09, 2023, 08:21:54 PM",
  "content": "Alik BakhshiKatyn as a symbol of Russian crimes         The crime of Russia discovered by the Germans, known as the Katyn massacre (1), which the Russians refused for 50 years, found its continuation in another crime, the death in 2010 of a Polish government delegation as a result of a plane crash while entering Smolensk airport. Planes never fall from the sky. Officially, the investigation conducted by the Russian commission came to the conclusion that the wrong actions of the crew were to blame for the disaster. This conclusion of the commission is doubtful, so Poland turned to Russia with a request to issue the wreckage of the aircraft, which was refused. It is quite possible that the reason for the refusal to extradite the aircraft wreckage is the presence of traces of explosives in them, which can be detected by modern analytical methods. Revealing the truth is unacceptable for Putin, as it will point to his direct guilt in the planned murder of members of the government delegation and concealment of an insidious crime.      It is possible that Putin, as a very vengeful person, hated President Kaczynski for his intention to visit the Katyn memorial, which is a symbol of Russia's shameful past.1. Katyn, before and after. https://alikbahshi.livejournal.com/6809.html     07/22/2021",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444161",
  "comments": [
    {
      "author": "paxmao",
      "created_time": "March 09, 2023, 09:16:51 PM",
      "body": "The RF has so much to deny, not only old history, but even during the last year there is appalling evidence of mass murdering and mass graving, attacks to civilian infrastructure and terror tactics by the RF army. The fact that there is even a denial of this being a \"war\" is a clear sign of how far are they willing to go into the path of divergent reality.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "March 09, 2023, 09:26:43 PM",
      "body": "Quote from: paxmao on March 09, 2023, 09:16:51 PMThe RF has so much to deny, not only old history, but even during the last year there is appalling evidence of mass murdering and mass graving, attacks to civilian infrastructure and terror tactics by the RF army. The fact that there is even a denial of this being a \"war\" is a clear sign of how far are they willing to go into the path of divergent reality.  Russia is the Empire of Lies. During the years of Communism, the Russian people got used to living in a lie and continues to live in this state.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "March 09, 2023, 10:12:43 PM",
      "body": "Quote from: Alik Bahshi on March 09, 2023, 08:21:54 PMPlanes never fall from the sky.They sometimes do. QuoteOfficially, the investigation conducted by the Russian commission came to the conclusion that the wrong actions of the crew were to blame for the disaster. This was in fact a sign of corruption within the government, because the decision was made against NATO guidelines, which stated that if there's a crash of a NATO member's military aircraft, NATO countries have to be allowed to investigate it. USA offered help but it was denied by Polish government. No NATO country was allowed to secure the crash site, it was all done by Russians and it was done so well, that soon withdrawals from dead passenger's bank accounts started to be made and their phones begun to turn on. According to the Russian side, the soldiers dispatched to secure the crash site stole private items that belonged to the passengers, but nobody knew about it until the families of the deceased filed complaints. Makes you wonder how much cash and secret documents got lost.QuoteThis conclusion of the commission is doubtful, so Poland turned to Russia with a request to issue the wreckage of the aircraft, which was refused. It is quite possible that the reason for the refusal to extradite the aircraft wreckage is the presence of traces of explosives in them, which can be detected by modern analytical methods. More likely the wreckage got looted. It was reported that it wasn't secured at all and local people and soldiers were stealing parts for scrap. If they ever had to give it back they would found out that there's barely any copper and electronics left in the plane. The most probable reason for the crash was weather and lack of lights on the airport's runway. There were reports from very early interviews with the locals, who said that a day after the crash they were replacing runway lights at the nearby airport. In the former Soviet Union nothing works. You get a plane with 3 engines but only 2 work, you get to the runway but can use only 80% of it because the rest is full of holes, the landing beacon doesn't work and only half of the runway lights have power. IMO Russians didn't directly cause the crash, but they were pleased that it happened, uncooperative and incompetent with their investigation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "March 10, 2023, 04:32:10 AM",
      "body": "Quote from: coolcoinz on March 09, 2023, 10:12:43 PMMore likely the wreckage got looted. It was reported that it wasn't secured at all and local people and soldiers were stealing parts for scrap. If they ever had to give it back they would found out that there's barely any copper and electronics left in the plane. The most probable reason for the crash was weather and lack of lights on the airport's runway. There were reports from very early interviews with the locals, who said that a day after the crash they were replacing runway lights at the nearby airport. In the former Soviet Union nothing works. You get a plane with 3 engines but only 2 work, you get to the runway but can use only 80% of it because the rest is full of holes, the landing beacon doesn't work and only half of the runway lights have power. IMO Russians didn't directly cause the crash, but they were pleased that it happened, uncooperative and incompetent with their investigation. If the wreckage was looted, I don't think all of them were stolen. The ideal thing to do is to grant NATO or Poland access to the crashed plane and the site. Even with just a piece of the wreckage, the cause of the crash can be determined through proper investigation. It might be true that Russia is not the cause of the crash but to clear their conscience, access would have been granted to these investigators. Russia's refusal to grant investigators access or extradite the wreckage to Poland is what is giving birth to the suspicion that Russia is behind the crash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "March 11, 2023, 03:57:14 AM",
      "body": "Quote from: Die_empty on March 10, 2023, 04:32:10 AMQuote from: coolcoinz on March 09, 2023, 10:12:43 PMMore likely the wreckage got looted. It was reported that it wasn't secured at all and local people and soldiers were stealing parts for scrap. If they ever had to give it back they would found out that there's barely any copper and electronics left in the plane. The most probable reason for the crash was weather and lack of lights on the airport's runway. There were reports from very early interviews with the locals, who said that a day after the crash they were replacing runway lights at the nearby airport. In the former Soviet Union nothing works. You get a plane with 3 engines but only 2 work, you get to the runway but can use only 80% of it because the rest is full of holes, the landing beacon doesn't work and only half of the runway lights have power. IMO Russians didn't directly cause the crash, but they were pleased that it happened, uncooperative and incompetent with their investigation. If the wreckage was looted, I don't think all of them were stolen. The ideal thing to do is to grant NATO or Poland access to the crashed plane and the site. Even with just a piece of the wreckage, the cause of the crash can be determined through proper investigation. It might be true that Russia is not the cause of the crash but to clear their conscience, access would have been granted to these investigators. Russia's refusal to grant investigators access or extradite the wreckage to Poland is what is giving birth to the suspicion that Russia is behind the crash. Modern methods of analysis allow us to find traces of explosives, so the Russians do not give the wreckage of the aircraft to the Poles.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "March 12, 2023, 09:10:23 PM",
      "body": "Quote from: Die_empty on March 10, 2023, 04:32:10 AMIf the wreckage was looted, I don't think all of them were stolen. The ideal thing to do is to grant NATO or Poland access to the crashed plane and the site. Even with just a piece of the wreckage, the cause of the crash can be determined through proper investigation. It might be true that Russia is not the cause of the crash but to clear their conscience, access would have been granted to these investigators. Russia's refusal to grant investigators access or extradite the wreckage to Poland is what is giving birth to the suspicion that Russia is behind the crash. Not all of it was looted of course, but probably as much as 30% was missing.Also Russians acted very suspiciously by putting concrete slabs over the crash site. There was no need for that because the crash site was in a remote field, where there was completely no danger to the public whatsoever, but Russians came with bulldozers, leveled the field and covered it with concrete to make digging impossible. Why would they do that if not to hide evidence? They also did not give Polish doctors access to the bodies. They put the bodies in sealed metal coffins and shipped to Poland, where against the orders of Russians the coffins were unsealed and it was found that body parts were completely mixed and people were lying with arms and legs belonging to other victims.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "March 18, 2023, 04:54:19 PM",
      "body": "Shut down the present Ukrainian government and military. Move Russia out. Give Ukraine back to the Ukrainians who fled from their country in the war. Let them decide their own fate.The current Ukrainian regime has too much US and Nato influence within it, especially in election manipulation. Get the US and Nato out of there.Doing the above will get rid of the crimes, both Russian and Ukrainian.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "March 19, 2023, 10:29:11 PM",
      "body": "Quote from: coolcoinz on March 12, 2023, 09:10:23 PMQuote from: Die_empty on March 10, 2023, 04:32:10 AMIf the wreckage was looted, I don't think all of them were stolen. The ideal thing to do is to grant NATO or Poland access to the crashed plane and the site. Even with just a piece of the wreckage, the cause of the crash can be determined through proper investigation. It might be true that Russia is not the cause of the crash but to clear their conscience, access would have been granted to these investigators. Russia's refusal to grant investigators access or extradite the wreckage to Poland is what is giving birth to the suspicion that Russia is behind the crash. Not all of it was looted of course, but probably as much as 30% was missing.Also Russians acted very suspiciously by putting concrete slabs over the crash site. There was no need for that because the crash site was in a remote field, where there was completely no danger to the public whatsoever, but Russians came with bulldozers, leveled the field and covered it with concrete to make digging impossible. Why would they do that if not to hide evidence? They also did not give Polish doctors access to the bodies. They put the bodies in sealed metal coffins and shipped to Poland, where against the orders of Russians the coffins were unsealed and it was found that body parts were completely mixed and people were lying with arms and legs belonging to other victims. Yes, all the actions of the Russians were aimed at eliminating the possibility of discovering the true cause of the disaster.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}