{
  "id": "topic_5401930",
  "title": "chokegoes1337",
  "author": "chokegoes1337",
  "created_time": "June 09, 2022, 11:50:13 AM",
  "content": "Hallo,die Cloudminingplattform shamining.com ist seit ein paar Tagen down.Allen anschein nach handelt es sich bei der Plattform um SCAM.Meine Frage hier in das Forum.Hat jemand von euch bereits in der Vergangenheit Erfahrungen damit gemacht in solchen Betrugsfällen?Gibt es Möglichkeiten an das investierte Geld zurück zukommen?Wie sieht es mit Rechtswegen aus?Meine Vermutungen ahnen böses. Jedoch würden mich hier mal andere Erfahrungen interessieren.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401930",
  "comments": [
    {
      "author": "mole0815",
      "created_time": "June 09, 2022, 12:42:11 PM",
      "body": "Quote from: chokegoes1337 on June 09, 2022, 11:50:13 AMMeine Vermutungen ahnen böses. Jedoch würden mich hier mal andere Erfahrungen interessieren.Herzlich willkommen chokegoes1337,sieht nicht gut aus.Hier ist eine schön aufbereitete Einschätzung dieses Anbieters zu finden: https://www.cloudmininginfo.com/post/shamining-reviewAuszug davon:QuoteShamining.com is a scam project that has nothing to do with bitcoin cloud mining. They don't even know how to lie to you more convincingly, they make stupid mistakes in contract descriptions. I will not comment on reviews and ratings on the Trustpilot. I have just become disillusioned with this site and will trust it much less.//edit: Hier noch ein anderer Beitrag zu dem Thema: Cloud mining with Shamining Und noch ein paar nette Einträge: https://at.trustpilot.com/review/shamining.com",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bullrun2024bro",
      "created_time": "June 10, 2022, 02:20:48 PM",
      "body": "Ein Blick in die Bewertungen bei Trustpilot sagt eigentlich alles. Ganz klares Finger weg! Die Chance, dass du dein Geld nie wieder siehst, ist wohl extrem hoch. Quelle: https://de.trustpilot.com/review/shamining.comGenerell gilt es bei Couldmining-Anbietern extrem vorsichtig zu sein! In der Regel handelt es sich um Scams. Mir persönlich würde zumindest kein seriöser Anbieter einfallen. Darum aufmerksam bleiben und sein Geld nicht an Betrüger verteilen! Viel Erfolg!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "June 10, 2022, 11:11:00 PM",
      "body": "Quote from: chokegoes1337 on June 09, 2022, 11:50:13 AMHallo,die Cloudminingplattform shamining.com ist seit ein paar Tagen down.Allen anschein nach handelt es sich bei der Plattform um SCAM.Hatte der Anbieter glaubwürdige Fotos und Videos von den eigenen Mining-Operationen veröffentlicht? Falls nein, war es mit hoher Wahrscheinlichkeit ein Exit Scam, bei dem lediglich Einzahlungen neuer Teilnehmer an bestehende Teilnehmer umverteilt wurden und die Betrüger irgendwann abgehauen sind, als sie genug Geld von neuen Einzahlungen erhalten haben. Siehe auch: ▁ ▂ ▄ ▅ ▆ Cloudmining 101 (ponzi risk assessment) ▆ ▅ ▄ ▂ ▁Quote from: chokegoes1337 on June 09, 2022, 11:50:13 AMGibt es Möglichkeiten an das investierte Geld zurück zukommen?Wie sieht es mit Rechtswegen aus?Leider nein, leider garnicht...Quote from: bullrun2020bro on June 10, 2022, 02:20:48 PMMir persönlich würde zumindest kein seriöser Anbieter einfallen. Seriöse Anbieter wären lediglich Hashnest (offizieller Service von Bitmain) und Genesis Mining. Hut8 aus Texas ist auch seriös, bietet aber soweit ich weiß derzeit kein Cloudmining an. Aber ob die auch profitabel sind? Im Zweifel immer lieber direkt HODLn",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "willi9974",
      "created_time": "June 11, 2022, 10:18:54 AM",
      "body": "Schade das es immer wieder passiert, dass Kunden über den Tisch gezogen werden. Wenn ein Angebot zu gut erscheint sollten die Alarmglocken Leuten und vor einem invest genauer nachgeschaut werden, gerne auch immer im forum vor dem invest fragen.Danach ist meistens zu spät…",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "-doubleU-",
      "created_time": "June 11, 2022, 09:38:43 PM",
      "body": "Quote from: 1miau on June 10, 2022, 11:11:00 PMSeriöse Anbieter wären lediglich Hashnest (offizieller Service von Bitmain) und Genesis Mining. Hut8 aus Texas ist auch seriös, bietet aber soweit ich weiß derzeit kein Cloudmining an. Aber ob die auch profitabel sind? Im Zweifel immer lieber direkt HODLn   Seriös hat ja erstmal nichts mit profitabel zu tun Ich würde auch jedem empfehlen zu hodlen statt sich mit Cloud Mining die Finger zu verbrennen. Gerade in dem derzeitigen Markt werden wohl wieder viele kleinere Verträge als nicht mehr kostendeckend ausgelaufen sein, da die tägliche Strom/Service Pauschale höher war als der Mining Reward. Bei einem eigenen Miner kann man da noch etwas flexibler agieren und solche Durststrecke aussitzen,  aber der Cloudmining Anbieter hat sein Geld vom Kunden für die gebuchte Hashrate bekommen und wenn sich das mining nicht mehr trägt ist eben Schluss, egal ob der ROI erreicht ist.Klar gibt es Szenarien wo man auch mal den ROI bei einem der genannten Anbieter erreicht aber eigentlich ist es Glücksspiel.Coins kaufen und Hodln ist da die sichere Strategie.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "June 12, 2022, 11:33:17 PM",
      "body": "Quote from: -doubleU- on June 11, 2022, 09:38:43 PMQuote from: 1miau on June 10, 2022, 11:11:00 PMSeriöse Anbieter wären lediglich Hashnest (offizieller Service von Bitmain) und Genesis Mining. Hut8 aus Texas ist auch seriös, bietet aber soweit ich weiß derzeit kein Cloudmining an. Aber ob die auch profitabel sind? Im Zweifel immer lieber direkt HODLn   Seriös hat ja erstmal nichts mit profitabel zu tun Tatsache.  Aber es ist mir nur ein geringer Trost, wenn der Laden zwar legitim ist aber am Ende trotzdem ein Verlust steht. Klar, rein vertrauenstechnisch, wie man das auch im Forum handhaben würde, wäre ein unseriöser Anbieter, der kein Mining betreibt, negativer Trust und ein seriöser aber dennoch unprofitabler Miner wäre bloß ärgerlicher Verlust.  Quote from: -doubleU- on June 11, 2022, 09:38:43 PMIch würde auch jedem empfehlen zu hodlen statt sich mit Cloud Mining die Finger zu verbrennen. +1Das sowieso. Gegen des Anstieg der Mining-Schwierigkeit zu wetten, war bisher nie eine gute Idee, vor allem, wenn man nicht Zugriff auf sehr billigen / überschüssigen Strom hat...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}