{
  "id": "topic_5469549",
  "title": "BictoinPro",
  "author": "BictoinPro",
  "created_time": "October 07, 2023, 02:20:32 PM",
  "content": "Hi,I have transferred my GFAL from Mexc to my ledger and although it shows the number of coins transferred on ledger live, it doesn't give a $ value like with my other coins.I can't find much info on the net regarding this, all I'm concerned with is knowing that the GFAL are on the ledger and I don't need to do anything else?  I'm awaiting delivery of a Tangem wallet and then I'll transfer the GFAL to that i just wanted to make sure I've not made an error anywhere?Any advice is greatly appreciated.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469549",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "October 07, 2023, 02:23:23 PM",
      "body": "That's not a problem. If you can see the funds, and you can transfer them you should be fine. Have you tried linking your Ledger to MetaMask to see if the price displays there? Could be something related to the Ledger live app or maybe whatever source they're using to pull the price doesn't have that coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "October 07, 2023, 02:32:35 PM",
      "body": "I don't think it's an issue. Ledger mentioned that it may refer to a countervalue error in which your particular coins do not have a trading pair with ETH/TRX/BNB. But overall, you're fine.Alternatively, you can try linking your Metamask to your Ledger device and see if it shows any value. Just don't forget to add the BSC network and the token's contract details.- https://support.ledger.com/hc/en-us/articles/4402577950225-Wrong-portfolio-or-asset-value-in-Ledger-Live?support=true",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "October 09, 2023, 04:08:30 PM",
      "body": "Quote from: BictoinPro on October 07, 2023, 02:20:32 PMI have transferred my GFAL from Mexc to my ledger and although it shows the number of coins transferred on ledger live, it doesn't give a $ value like with my other coins.I don't even know what GFAL is, but I guess it's just another shitcoin.Someone said that keeping shitcoins on harrdware wallet is the same like keeping bananas in safe deposit, they will soon be rotten and bad.Quote from: BictoinPro on October 07, 2023, 02:20:32 PMI can't find much info on the net regarding this, all I'm concerned with is knowing that the GFAL are on the ledger and I don't need to do anything else?  I'm awaiting delivery of a Tangem wallet and then I'll transfer the GFAL to that i just wanted to make sure I've not made an error anywhere?You should first double check in explorer if your address is correct and what is the balance.Getting new hardware wallet won't solve anything if you sent tokens to wrong address or if you made some other mistake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BictoinPro",
      "created_time": "October 14, 2023, 07:22:32 AM",
      "body": "Thanks for the replies all.The balance is now showing on the ledger. FYI I keep all my bananas in a safe",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "October 14, 2023, 09:43:15 AM",
      "body": "Quote from: BictoinPro on October 14, 2023, 07:22:32 AMThanks for the replies all.The balance is now showing on the ledger. FYI I keep all my bananas in a safe   I'm not sure about Ledger, but my Trezor doesn't always have accurate value information when it comes to certain tokens. Especially those who are being treated on Defi platforms, and not at any of the reputable CEX. For such, you always have to check the current value and trading volume in order to be sure how much what you have in your wallet is worth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Moghul007",
      "created_time": "March 11, 2024, 11:03:14 PM",
      "body": "How do I store my GFAL on my ledger?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "March 13, 2024, 12:30:16 PM",
      "body": "Quote from: BictoinPro on October 07, 2023, 02:20:32 PMI have transferred my GFAL from Mexc to my ledger and although it shows the number of coins transferred on ledger live, it doesn't give a $ value like with my other coins.All you just needed to do is to make the confirmation of your holdings in actual values in USD, just follow the advise given by OmegaStarScream by importing your wallet on meta mask and try to see if such is displayed or not, i don't think its something to worry about as long as your security is not compromised or you're not under any security threat that can lead to loss of funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "March 13, 2024, 06:29:05 PM",
      "body": "Quote from: dkbit98 on October 09, 2023, 04:08:30 PMQuote from: BictoinPro on October 07, 2023, 02:20:32 PMI have transferred my GFAL from Mexc to my ledger and although it shows the number of coins transferred on ledger live, it doesn't give a $ value like with my other coins.I don't even know what GFAL is, but I guess it's just another shitcoin.Someone said that keeping shitcoins on harrdware wallet is the same like keeping bananas in safe deposit, they will soon be rotten and bad.Quote from: BictoinPro on October 07, 2023, 02:20:32 PMI can't find much info on the net regarding this, all I'm concerned with is knowing that the GFAL are on the ledger and I don't need to do anything else?  I'm awaiting delivery of a Tangem wallet and then I'll transfer the GFAL to that i just wanted to make sure I've not made an error anywhere?You should first double check in explorer if your address is correct and what is the balance.Getting new hardware wallet won't solve anything if you sent tokens to wrong address or if you made some other mistake.Yeah right, can you please look into the project before trash talking about it? Because this Gfal ( Games for a Living) is from the former CEO of EA games, the teams are from big gaming companies, unlike Gala games, it's a very good project and yes all altcoins will dump after every bull market but the ROI will be insane anyway. If OP is smart enough, he will take his profits, this same GFal turned my few hundreds of dollars into 8k already, when the Bitcoin dominance starts falling I will start taking profits, I could remember in 2020, many people trash talked about gala games too, until it get to almost a dollar, millionaires are printed. OP if you are reading this, you got the right GEM, don't let anyone deceive you, the difference in becoming a successful investor is knowing when to buy and when to sell, GFAL was $0.004 a year ago, and it made a ATH of $0.05 before correction, you will have good story to share very soon, hold tight and don't marry the bag, once money starts flowing into altcoins you should start taking profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}