{
  "id": "topic_5430906",
  "title": "wallterfall",
  "author": "wallterfall",
  "created_time": "December 21, 2022, 07:01:19 PM",
  "content": "we are developing pretty big project, and we don't have the funding for advertisement,if you are interested to sponsor project/invest or advertise it please PM me.you will get a nice cut since you are from first being involved in the project.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5430906",
  "comments": [
    {
      "author": "hugeblack",
      "created_time": "December 22, 2022, 10:46:37 AM",
      "body": "The two phrases are contradictory. If the project is big, then it will be well planned, or at least there will be enough money to start advertising, and vice versa.The lack of any budget for advertising is a good indication of the extent of poor planning and management, and thus the failure of the project.In any case, without introducing the project, no one will provide you with a service for free, and if you want to pay in bitcoins, move your topic to --> https://bitcointalk.org/index.php?board=52.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "December 22, 2022, 11:56:16 AM",
      "body": "No you don't. You're lying. You don't develop a \"pretty big project\" without the necessary funding, for if you did, you'd have tried to approach us in a little more detailing way perhaps? Who's going to have a conversation with a newbie about investing in a project they themselves feel not confident enough to describe publicly?You just want a quick buck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BigBos",
      "created_time": "December 22, 2022, 04:06:58 PM",
      "body": "Right, you should explain in detail and logically the project that you are currently or will be developing, I personally don't know what you are developing, this is too strange, are you going to cheat?Obviously, the question will be thrown at you, let alone if you are a newbie in this forum.Of course, we personally will not turn around with what you are trying to offer.You should learn first if you want to cheat, don't just give stupid statements like that.There is no clarity then you are a fraud.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wallterfall",
      "created_time": "December 22, 2022, 05:25:25 PM",
      "body": "Hello guys, i appreciate all comments. The details can be sent in Privatewe are developers who are developing the project ourselves  without hiring other people.we lack experience on many things. Like advertising or maybe project management( just in case things are going to be simple)I am not asking anyone to send money... everything can be done in a way no one fool no one..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qzl9899",
      "created_time": "December 23, 2022, 08:06:49 AM",
      "body": "First of all, you should explain your project to the community in detail. What type does it belong to? What needs does it address? And what kind of help do you need?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maikrothaman",
      "created_time": "December 23, 2022, 02:01:54 PM",
      "body": "Quote from: wallterfall on December 22, 2022, 05:25:25 PMHello guys, i appreciate all comments. The details can be sent in Privatewe are developers who are developing the project ourselves  without hiring other people.we lack experience on many things. Like advertising or maybe project management( just in case things are going to be simple)I am not asking anyone to send money... everything can be done in a way no one fool no one..Previously, I invested for some partners in venture capital. I currently only invest personally in a select few tech startups. However, I can connect you with Series A if you want. You can send me information about your startup in a private message, including the idea, the team, their qualifications, and the amount you hope to raise. I'm going to assess it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "December 23, 2022, 02:41:06 PM",
      "body": "Quote from: wallterfall on December 22, 2022, 05:25:25 PMHello guys, i appreciate all comments. The details can be sent in PrivateWhat's the matter? We are all strangers here. What would be the difference if you sent some little details in private or revealed them in public? I don't ask you to reveal us who you are (nor should you in private, because again we're strangers), but a little about the project would seem rational. Quote from: wallterfall on December 22, 2022, 05:25:25 PMI am not asking anyone to send money... everything can be done in a way no one fool no one..So what do you want? If you want to advertise your service, it makes a lot of sense to reveal it. Does it have to do with this Pandora Cash?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "December 24, 2022, 07:51:53 PM",
      "body": "Quote from: BlackHatCoiner on December 23, 2022, 02:41:06 PMQuote from: wallterfall on December 22, 2022, 05:25:25 PMHello guys, i appreciate all comments. The details can be sent in PrivateWhat's the matter? We are all strangers here. What would be the difference if you sent some little details in private or revealed them in public? I don't ask you to reveal us who you are (nor should you in private, because again we're strangers), but a little about the project would seem rational. I'm in the same boat as BlackHatCoiner, how do you want to get investors if you don't really tell us what's the project about, how it works, and what % of the share you offer? To talk about business you need to be clear because in other ways it's not attractive. From my personal point of view feels like a waste of time to write you by PM just to know more about the project, and I'm sure a lot of users feel the same. But good luck with your project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "December 25, 2022, 01:50:02 PM",
      "body": "You better write a one-pager with a short idea about what's the project, how will it work, and why you think it's going to be a big project. If some investors find the idea is solid and there's a chance of flourishing the project in the future, they may decide to invest. It's not something they will reach you for just because you said it's going tom be a huge project. This is not how people look for investors of course. Bring the details to the table, I'm sure, you with an interesting ideas, will be able to reach the right guy. Otherwise, you will not be able to attract a single investor I think.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasog",
      "created_time": "December 25, 2022, 06:08:18 PM",
      "body": "Quote from: Little Mouse on December 25, 2022, 01:50:02 PMYou better write a one-pager with a short idea about what's the project, how will it work, and why you think it's going to be a big project. If some investors find the idea is solid and there's a chance of flourishing the project in the future, they may decide to invest. It's not something they will reach you for just because you said it's going tom be a huge project. This is not how people look for investors of course. Bring the details to the table, I'm sure, you with an interesting ideas, will be able to reach the right guy. Otherwise, you will not be able to attract a single investor I think.It is a big project because it will attract a big donation as it has been posted on the Project Development section of bitcointalk, which itself is big for a project   I don't understand the mentality of the people who think that people are so dumb and will give money to the OP on his two-liners telling everyone that he is developing something big (in dreams ).I would call it a big project to get a big investment to scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maikrothaman",
      "created_time": "December 25, 2022, 07:13:14 PM",
      "body": "Quote from: virasog on December 25, 2022, 06:08:18 PMQuote from: Little Mouse on December 25, 2022, 01:50:02 PMYou better write a one-pager with a short idea about what's the project, how will it work, and why you think it's going to be a big project. If some investors find the idea is solid and there's a chance of flourishing the project in the future, they may decide to invest. It's not something they will reach you for just because you said it's going tom be a huge project. This is not how people look for investors of course. Bring the details to the table, I'm sure, you with an interesting ideas, will be able to reach the right guy. Otherwise, you will not be able to attract a single investor I think.I would call it a big project to get a big investment to scam. Projects aren't always scams. Some people create robust startups. I'm still waiting for his private message containing some specifics.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}