{
  "id": "topic_5420370",
  "title": "Alex077",
  "author": "Alex077",
  "created_time": "November 10, 2022, 11:01:54 AM",
  "content": "Джастин Сан намекает на потенциальное партнерство с FTXПосле того, как Binance объявила, что не будет продолжать сделку по приобретению проблемной криптовалютной биржи FTX, Джастин Сан, основатель криптовалютной сети Tron и посол Гренады во Всемирной торговой организации, поздно вечером в среду написал в Твиттере, что он и его команда «готовят совместное решение» с компанией....https://crypto.kg/threads/dzhastin-san-namekaet-na-potencialnoe-partnerstvo-s-ftx.23173/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420370",
  "comments": [
    {
      "author": "bakasabo",
      "created_time": "November 10, 2022, 11:56:03 AM",
      "body": "Стандартное \"анонс анонса\". Но по моему ничего Джастин Сан не сделает. Он уже как-то отошел от мира криптовалюты, когда покинул Трон, и стал, так сказать, со стороны лишь как-то напоминать о себе. После того как Бинанса решила выйти из сделки, цена на криптовалюту знатно пошла вниз. Умеющие люди на этом заработают большие деньги. Я думаю что Сан сделает аналогичное - сделает анонс, потом отменит все, крипта опять пойдет вниз, и люди закупятся по дешевке, а в будущем перепродадут.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alex077",
      "created_time": "November 10, 2022, 12:25:56 PM",
      "body": "Quote from: bakasabo on November 10, 2022, 11:56:03 AMСтандартное \"анонс анонса\". Но по моему ничего Джастин Сан не сделает. Он уже как-то отошел от мира криптовалюты, когда покинул Трон, и стал, так сказать, со стороны лишь как-то напоминать о себе. После того как Бинанса решила выйти из сделки, цена на криптовалюту знатно пошла вниз. Умеющие люди на этом заработают большие деньги. Я думаю что Сан сделает аналогичное - сделает анонс, потом отменит все, крипта опять пойдет вниз, и люди закупятся по дешевке, а в будущем перепродадут. Да понятно, что он это делает с большой выгодой для себя. Но Сэму Фриду некуда деваться, сейчас его могут купить за копейки, там все было заложено под токен биржи FTT который не был ничем обеспечен,...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}