{
  "id": "topic_5456487",
  "title": "vallncia",
  "author": "vallncia",
  "created_time": "June 15, 2023, 09:04:40 PM",
  "content": "Hello .First of all sorry for my bad english so here is the problem i live in iraq and all crypro site not supported iraq country due KYCsecond problem my country not allow us to use card more than 750$ per day that's why i have more than 10 visa and master cards i need someone to sell me USDT without the stupid KYC and i will pay with my card i hav bussnis and i will buy every day more than 7000 usdti will send every ID you want to ask from me even selfe with cards and all that my telegram : vallnciamy discord : jnz0",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456487",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "June 16, 2023, 11:14:34 PM",
      "body": "Why not use a P2P exchange that doesn't require KYC? You can easily find someone there who sells USDT without giving ID and a selfie.Check this tool below- https://kycnot.me/Or if you looking for a well-known P2P exchange where you can buy USDT you can check https://bisq.network/Optional if you also want to buy BTC or XMR you can use Agora Desk check their official thread here AgoraDesk.com | Buy ♻️ Sell Bitcoins Anonymously!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "June 17, 2023, 01:33:17 AM",
      "body": "Are you saying that you need to buy $7,500 Bitcoin daily? This is an amount higher than the average wage in that country and is approximately equal to 225,000 per month. It is difficult to find someone willing to pay you monthly with this amount or even several people.Even $22,500 seems high according to the average wages there, using peer-to-peer platforms is fine but you will need to verify identity with these large sums. It is better to hire a lawyer because of money laundering procedures (AML)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "www.Gambler.Casino",
      "created_time": "June 18, 2023, 10:10:24 PM",
      "body": "It is very risky to exchange money on social networks! I do not recommend",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "June 19, 2023, 04:45:32 AM",
      "body": "Quote from: vallncia on June 15, 2023, 09:04:40 PMHello .First of all sorry for my bad english so here is the problem i live in iraq and all crypro site not supported iraq country due KYCsecond problem my country not allow us to use card more than 750$ per day that's why i have more than 10 visa and master cards i need someone to sell me USDT without the stupid KYC and i will pay with my card i hav bussnis and i will buy every day more than 7000 usdti will send every ID you want to ask from me even selfe with cards and all that my telegram : vallnciamy discord : jnz0I don't think it's necessary to contact you on your telegram and discord channel, if you can go directly to these exchanges,- KuCoin- CoinEx- Bisq- Hodl Hodl- Local Crypto- Local Moneros- BlockDXSource: https://koinly.io/blog/top-no-kyc-crypto-exchanges/Then I also have a question, do you mean that every day you buy crypto around 7000$? Are you a long-term investor?and it looks like you're okay with the transaction too, still be careful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "June 19, 2023, 03:21:26 PM",
      "body": "Quote from: vallncia on June 15, 2023, 09:04:40 PMso here is the problem i live in iraq and all crypro site not supported iraq country due KYCsecond problem my country not allow us to use card more than 750$ per day that's why i have more than 10 visa and master cardsi need someone to sell me USDT without the stupid KYC and i will pay with my card i hav bussnis and i will buy every day more than 7000 usdti will send every ID you want to ask from me even selfe with cards and all that my telegram : vallnciamy discord : jnz0[/center] Op if you are worried about the KYC then you can check any of this no KYC exchanges https://kycnot.me/ and use any of them to buy your bitcoins or the best option is, you can use p2p service to accumulate the number of bitcoins you want to buy. But one thing I am not sure of is your amount to buy bitcoin daily. You want to buy bitcoin of USDT7000  daily. Which work are doing to buy bitcoin coin like that? Is your work pays daily? Op I don't think this is a true story. Mostly the purchasing part of the story looked fabricated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "June 19, 2023, 04:32:16 PM",
      "body": "Quote from: Husires on June 17, 2023, 01:33:17 AMAre you saying that you need to buy $7,500 Bitcoin daily? This is an amount higher than the average wage in that country and is approximately equal to 225,000 per month. These numbers are also interesting to me, $7,500 a day is serious money in the most developed countries, not only in Pakistan. I believe that with so much income OP can go to any part of the world, somewhere that is more liberal for crypto transactions and that he does not struggle with government restrictions.OP, you have a list of exchangers here, some of them usually don't require KYC, but definitely do your research first.https://www.bestchange.com/visa-mastercard-usd-to-tether-trc20.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "June 20, 2023, 01:29:00 AM",
      "body": "There is bunch out there also you can direct buy with trustwallet as far that I know but the wallet is closed source so after successful buy you can move it to another wallet. Question, you have 10 visa and mastercard where you did get that is that combined between physical and virtual card.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "June 21, 2023, 03:10:46 AM",
      "body": "Quote from: bettercrypto on June 19, 2023, 04:45:32 AM- KuCoin- LocalCryptosSource: https://koinly.io/blog/top-no-kyc-crypto-exchanges/KuCoin requires users to verify identity but when you reach a certain withdrawal level, this level can change according to regulatory procedures or at least your account may be closed if any suspicions are found about your account or your IP.LocalCryptos has closed https://localcryptos.com/QuoteLocalCryptos has closedAfter five successful years, LocalCryptos announced its closure in October 2022. We would like to extend a massive thank you to our users. We greatly appreciate the feedback and support many of you have given us over the yearsIt seems that the link to the article you mentioned is out of date.Quote from: examplens on June 19, 2023, 04:32:16 PMThese numbers are also interesting to me, $7,500 a day is serious money in the most developed countries, not only in Pakistan.I don't think someone willing to pay $7,500 a day would try to get tips here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "June 21, 2023, 12:29:00 PM",
      "body": "Go with the platforms suggested by bitmaxz. I think having that much money, you can go on a holiday and go to nearby countries where exchanges aren't strict and you can buy crypto that you want based on their policies. Dealing with this trade on the forum will not encourage escrow because knowing that it's a card transaction, it's reversible and both the escrow and the seller could be in problem and you just go away with any amount you get from this transaction. I'm not accusing you but this is the reality with c.card transactions and even if you use an escrow and even if you send a bunch of identifications.Quote from: dansus021 on June 20, 2023, 01:29:00 AMThere is bunch out there also you can direct buy with trustwallet as far that I know but the wallet is closed source so after successful buy you can move it to another wallet. He can still be subjected to KYC even if it will happen in a Trust wallet. Usually these wallets that has integrated exchange can still do what usual exchange require users to comply.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}