{
  "id": "topic_5458202",
  "title": "_act_",
  "author": "_act_",
  "created_time": "July 01, 2023, 08:38:22 AM",
  "content": "After the SEC did not want to approve bitcoin spot ETF, bitcoin fall from $31000 back to $30400 as of today price. Bitcoin has been staying between $29400 and $31250 since many days. The support as been at $30000 while the resistance as been at $31000. The market is difficulty to know which position to take. What are you people predicting that bitcoin price would be? Is bitcoin breaking the resistance and increase above $31000 which could take the price to $35000, or bitcoin price is getting back to $25000 again?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458202",
  "comments": [
    {
      "author": "CageMabok",
      "created_time": "July 01, 2023, 10:37:08 AM",
      "body": "Quote from: _act_ on July 01, 2023, 08:38:22 AMAfter the SEC did not want to approve bitcoin spot ETF, bitcoin fall from $31000 back to $30400 as of today price. Bitcoin has been staying between $29400 and $31250 since many days. The support as been at $30000 while the resistance as been at $31000. The market is difficulty to know which position to take. What are you people predicting that bitcoin price would be? Is bitcoin breaking the resistance and increase above $31000 which could take the price to $35000, or bitcoin price is getting back to $25000 again?After looking at the level of resistance that has occurred in the last month in Bitcoin and now that the price is starting to go sideways with no move up or down, I'm still thinking about the next bull run which would be through $31K and up to $35K. However I don't think that price measure is imminent anytime soon, as the difficulty of breaking through $31K is still very visible on Bitcoin so it will definitely take more time to see $35K within this year. And I don't think about a drop back to $25K any time soon although the drop in price is also unstoppable at this point except with a little more support in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ancafe",
      "created_time": "July 01, 2023, 11:08:11 AM",
      "body": "Quote from: _act_ on July 01, 2023, 08:38:22 AMAfter the SEC did not want to approve bitcoin spot ETF, bitcoin fall from $31000 back to $30400 as of today price. Bitcoin has been staying between $29400 and $31250 since many days. The support as been at $30000 while the resistance as been at $31000. The market is difficulty to know which position to take. What are you people predicting that bitcoin price would be? Is bitcoin breaking the resistance and increase above $31000 which could take the price to $35000, or bitcoin price is getting back to $25000 again? That seems easy to judge and the past few weeks we have seen bitcoin corrected due to the SEC suing binance and a few days ago back at support price at $30k. I estimate that bitcoin will be corrected again and for the next month I don't know what price it will be for sure, but my assumption is that bitcoin will hold on to support $30k and will not be corrected to $25k again. For the next month I think bitcoin will be sideways and will not break the resistance point above $35k.Predictions are not always correct and may be affected by some problems that can bring bitcoin to correct or strengthen again. But I personally hope that bitcoin will touch the price of $35k for the next month, so that the next support is at $33k and provide a higher accumulation point for further.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khiholangkang",
      "created_time": "July 01, 2023, 11:41:53 AM",
      "body": "Quote from: _act_ on July 01, 2023, 08:38:22 AMAfter the SEC did not want to approve bitcoin spot ETF, bitcoin fall from $31000 back to $30400 as of today price. Bitcoin has been staying between $29400 and $31250 since many days. The support as been at $30000 while the resistance as been at $31000. The market is difficulty to know which position to take. What are you people predicting that bitcoin price would be? Is bitcoin breaking the resistance and increase above $31000 which could take the price to $35000, or bitcoin price is getting back to $25000 again?Usually after the increase we will experience a correction first, the potential is stronger in my opinion compared to Bitcoin to continue to survive the sideway in the support area and or continue the increase, maybe we will be in the price range of $ 28k- $ 29k again, and even then if there is no more FUD or positive sentiment about the development of ETF Bitcoin trade.The situation is confusing that occurs if you see the potential of the opposite two directions, such as correction or continuing the increase, there are some hopes that are immediately achieved, namely the price level at $ 35k, but it seems very difficult to penetrate",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "July 01, 2023, 12:23:39 PM",
      "body": "Quote from: _act_ on July 01, 2023, 08:38:22 AMAfter the SEC did not want to approve bitcoin spot ETF, bitcoin fall from $31000 back to $30400 as of today price. Bitcoin has been staying between $29400 and $31250 since many days. The support as been at $30000 while the resistance as been at $31000. The market is difficulty to know which position to take. What are you people predicting that bitcoin price would be? Is bitcoin breaking the resistance and increase above $31000 which could take the price to $35000, or bitcoin price is getting back to $25000 again?I guess it's really hard to say where the price will go.But to be fair, SEC says that bitcoin spot ETF needs more substance, and so it didn't mean that they have rejected it right away. And with that, the price is not even affected by it, as it goes to $31k then back to $30k again and most likely we will stay here and the support is going to be strong.https://www.wsj.com/articles/sec-says-spot-bitcoin-etf-filings-are-inadequate-390336e8Not unless there will be another big news, that will push it to $35k this month of July. So we will see what will be the price action for this month.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "July 01, 2023, 12:55:31 PM",
      "body": "Yes the SEC did really harm the growth of the Bitcoins in the recent few weeks. Nevertheless we can see the effort from the side of Bitcoins, but sadly it’s unable to break the resistance and hence it’s struggling in the same price segment for more than a week now. This July month will definitely play a crucial role in telling us the future price of the coin for this year. If we increase the demand to accumulate the Bitcoins, then definitely we can see a rapid growth in the price, else Bitcoins in this price segment will continue for few more weeks. Let’s hope for the best.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "July 01, 2023, 12:59:33 PM",
      "body": "Quote from: _act_ on July 01, 2023, 08:38:22 AMAfter the SEC did not want to approve bitcoin spot ETF, bitcoin fall from $31000 back to $30400 as of today price. Bitcoin has been staying between $29400 and $31250 since many days. The support as been at $30000 while the resistance as been at $31000. The market is difficulty to know which position to take. What are you people predicting that bitcoin price would be? Is bitcoin breaking the resistance and increase above $31000 which could take the price to $35000, or bitcoin price is getting back to $25000 again?We just entered the new month July and very difficult to say which path the price action is going to take as we proceed. The bitcoin price breaking above the resistance depends on how strong the support level is going to look like for the next days to come. Although am optimistic for bitcoin price to break above the resistance level of #31k this July but before such action could take place we might  experience different intervals of retesting at the support level, at least twice of that before a bull run of $35k thereabout can occur. Let's just keep our fingers cross for the coming weeks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "July 01, 2023, 01:00:40 PM",
      "body": "Quote from: _act_ on July 01, 2023, 08:38:22 AMAfter the SEC did not want to approve bitcoin spot ETF, bitcoin fall from $31000 back to $30400 as of today price. Bitcoin has been staying between $29400 and $31250 since many days. The support as been at $30000 while the resistance as been at $31000. The market is difficulty to know which position to take. What are you people predicting that bitcoin price would be? Is bitcoin breaking the resistance and increase above $31000 which could take the price to $35000, or bitcoin price is getting back to $25000 again?The chance of rise is high compared to falling since the price is already stable above the recent strong resistance which is the 30K mark. Bitcoin will already dip if the current price is temporary since this is new territory price for Bitcoin after the long dump from ATH. I’m confident that the price will keep increasing while 30K will be the strong support now. The price might move blow 30K like 29K something but price will quickly recover during this dip scenario. We might see 31K above on the following weeks since we are already on accumulating phase after we break the 30K resistance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "July 01, 2023, 01:26:03 PM",
      "body": "Quote from: _act_ on July 01, 2023, 08:38:22 AMAfter the SEC did not want to approve bitcoin spot ETF, bitcoin fall from $31000 back to $30400 as of today price. Bitcoin actually dipped to $29,500 when the SEC comments about the current ETF applications came out. The price has recovered well, it seems to be reacting well to FUD at the moment. I think the only thing that can really stop bitcoin doing really well over the next 2.5 years is if there is a world war or even really bad recession/depression worldwide. I think the usual 4 year cycle will play out though & we will start to go up soon as we get close to the halving in 2024.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "July 01, 2023, 02:47:24 PM",
      "body": "Regardless of the news related to the SEC, which does not seem related to the price from my point of view, Bitcoin is testing the resistance point at $31.4K, and since the price has failed to break it several times, this means that we will return to test the resistance point at $26K if trading volume getting down from current levels. Trading volume is still good, and therefore I expect that we will test the $31.4k for two more times before we either go all the way to $35k and consider that we may not see the price below $30k again, or retest $26k and bounce from it.If we don't get 35K before the next Fed meeting, we'll go back to +26k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oneandpure",
      "created_time": "July 01, 2023, 04:11:38 PM",
      "body": "Quote from: _act_ on July 01, 2023, 08:38:22 AMAfter the SEC did not want to approve bitcoin spot ETF, bitcoin fall from $31000 back to $30400 as of today price. Bitcoin has been staying between $29400 and $31250 since many days. The support as been at $30000 while the resistance as been at $31000. The market is difficulty to know which position to take. What are you people predicting that bitcoin price would be? Is bitcoin breaking the resistance and increase above $31000 which could take the price to $35000, or bitcoin price is getting back to $25000 again?Looks in this time SEC Commission announcement not want to approve bitcoin spot ETF not bring impact yet although bitcoin price dump but success reach up to higher price again. Have been one days after SEC denied with Bitcoin spot ETF and looks bitcoin keep stable around $30,500 current price, current highest price from bitcoin around last several days on $31,000 and seems difficult reach until $35000 but not close yet chance for bitcoin back to higher price again. Waiting few weeks later has bad news publishing by SEC Commission or not because they have power how to make many investor panic for selling bitcoin and price drastically drop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "July 01, 2023, 04:29:29 PM",
      "body": "Quote from: Oneandpure on July 01, 2023, 04:11:38 PMQuote from: _act_ on July 01, 2023, 08:38:22 AMAfter the SEC did not want to approve bitcoin spot ETF, bitcoin fall from $31000 back to $30400 as of today price. Bitcoin has been staying between $29400 and $31250 since many days. The support as been at $30000 while the resistance as been at $31000. The market is difficulty to know which position to take. What are you people predicting that bitcoin price would be? Is bitcoin breaking the resistance and increase above $31000 which could take the price to $35000, or bitcoin price is getting back to $25000 again?Looks in this time SEC Commission announcement not want to approve bitcoin spot ETF not bring impact yet although bitcoin price dump but success reach up to higher price again. Have been one days after SEC denied with Bitcoin spot ETF and looks bitcoin keep stable around $30,500 current price, current highest price from bitcoin around last several days on $31,000 and seems difficult reach until $35000 but not close yet chance for bitcoin back to higher price again. Waiting few weeks later has bad news publishing by SEC Commission or not because they have power how to make many investor panic for selling bitcoin and price drastically drop.Gensler will approve it soon which will push the prices up breaking the resistance. for now, the price will just be floating in that range until the short squeeze take effect. a lot of institutions i suppose are also expecting the SEC approval since it's BlackRock who is applying. they wouldn't apply for it if there is no chance. besides $31250 is not yet the peak of the price. this is if you look at the TA base on rsi alone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Weawant",
      "created_time": "July 01, 2023, 04:35:58 PM",
      "body": "Quote from: _act_ on July 01, 2023, 08:38:22 AMAfter the SEC did not want to approve bitcoin spot ETF, bitcoin fall from $31000 back to $30400 as of today price. Bitcoin has been staying between $29400 and $31250 since many days. The support as been at $30000 while the resistance as been at $31000. The market is difficulty to know which position to take. What are you people predicting that bitcoin price would be? Is bitcoin breaking the resistance and increase above $31000 which could take the price to $35000, or bitcoin price is getting back to $25000 again?I didn't know Bitcoin dipped but the quick corrections took Bitcoin price to $29,500 and Bitcoin has recovered and the price is back up to 30,560. This time around I know where I'll be placing my bet and that's for $31,000 to be brokens before the first week of the month is passed. The resistance at $31,000 won't hold up long, the resistance that we'll have at $35,000 that's where we should have more worries because if there's not much buy pressure we can't cross that price but if Bitcoin pass that price and stays above it we're in good hands then. The market handled the rejection news quite well because it didn't affect the market that much and that means we're having less investors that wants to sell their Bitcoin and it could be because investors are now interested only in accumulating instead of selling due to fud.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "July 01, 2023, 06:27:43 PM",
      "body": "Quote from: Jating on July 01, 2023, 12:23:39 PMBut to be fair, SEC says that bitcoin spot ETF needs more substance, and so it didn't mean that they have rejected it right away. And with that, the price is not even affected by it, as it goes to $31k then back to $30k again and most likely we will stay here and the support is going to be strong.Yes that was what the SEC means but the market downturn was because of it. It is just a blessing for some people to buy at lower price because if bitcoin spot ETF is approved, the bitcoin market would be full of bulls. Let us see what would happen. Even when the price drop happened yesterday, bitcoin went up above $30000 again which indicates $30000 support to be strong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ScamViruS",
      "created_time": "July 01, 2023, 06:58:12 PM",
      "body": "Bitcoin suddenly fell due to the news effect, which is normal for Bitcoin. We have seen this type of reaction in Bitcoin in the past. But the $31000 resistance is really tough for Bitcoin to break, as we have gone downtrend from here in the past as well. But it is true that when Bitcoin can break this resistance at full strength then we will see another huge uptrend in the Bitcoin market. There is no doubt that if the SEC had approved the Bitcoin ETF, bull would have taken complete control of the Bitcoin market. But we are now in a downtrend as we get negative news. Let's hope Bitcoin builds momentum from here and prepares for the next breakout.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "imamusma",
      "created_time": "July 01, 2023, 07:41:26 PM",
      "body": "Quote from: _act_ on July 01, 2023, 08:38:22 AMWhat are you people predicting that bitcoin price would be? Is bitcoin breaking the resistance and increase above $31000 which could take the price to $35000, or bitcoin price is getting back to $25000 again?Prices are likely to indicate a possible downside in July, but I'm hesitant to say so. Somehow the SEC and FED may still impact the price, but bitcoin managed to close June above $30k. But whatever happens, then you have to stick to your plan. Don't panic, do Averaging as this will help you stick to the plan. Even if the bitcoin price goes down, it will only go up again after some time and this kind of thing should be considered normal.But if you are a day trader, then don't forget you have to set a stop loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "July 01, 2023, 09:00:35 PM",
      "body": "Not sure expectation of the SEC is ever bullish, I hope there are better reasons for recovery in the price or I might never be bullish on gaining from here.  30k could be the final price no further upwards, I dont find it too negatively personally.We broke a declining trend on daily bars, gained well after that.  Found the 50 da average which is now moving upwards not in decline as it was previous.  Thats all good, now ideally we do beat that area of pricing last seen in Feb of this year.  This also relates to price action further out and with more volume.  Thats really the question in balance, to beat this area or spend further time circling the point deciding as much but at a later date.  It might we wait till Autumn, I expect a higher amount of volume at that time and can easily equate to movement.   We can be stagnant over this summer, not sure yet.      Its not fair to label things seasonally like this, half the world is nearly the peak of 'winter' right now.  But anyhow that schedule is fairly familiar, a known phenomena and imo valid parallel or tempo estimate to how we progress.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "July 01, 2023, 10:03:43 PM",
      "body": "Perhaps it is too fast to be establishing $30k as support, having had the 6 months that we have had, without going very far we were at 16k only in January ($16,521(1)), April was the only month that we managed to be above $30k for a few days, If something is clear, it is that this year 2023 the support can be marked at +$20k, there is enthusiasm but that does not consolidate positions. I think maybe the last third of this year we could be talking about a +$30k base.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "July 01, 2023, 10:20:52 PM",
      "body": "Quote from: Nrcewker on July 01, 2023, 12:55:31 PMYes the SEC did really harm the growth of the Bitcoins in the recent few weeks. Nevertheless we can see the effort from the side of Bitcoins, but sadly it’s unable to break the resistance and hence it’s struggling in the same price segment for more than a week now. This July month will definitely play a crucial role in telling us the future price of the coin for this year. If we increase the demand to accumulate the Bitcoins, then definitely we can see a rapid growth in the price, else Bitcoins in this price segment will continue for few more weeks. Let’s hope for the best.Well not too much to be honest, it hasn't dropped significantly, bullrun is just happening slower with few more corrections. I don't really believe in significance of months especially when there are no tax days or anything like that close. I think that halving just keeps us from dropping more and creates confidence that we have seen the bottom already. This may not be as good month as before but i am betting we aren't dropping a lot either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "July 01, 2023, 10:56:33 PM",
      "body": "I'd say a rise is more likely because Bitcoin defended the previous support levels for many times recently, and halvening is getting closer and closer, so some of the traders already start buying, and now there are bullish news like the ETF filing. But I wouldn't expect any big movements, maybe $35k and then correction again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}