{
  "id": "topic_5467417",
  "title": "cafter",
  "author": "cafter",
  "created_time": "September 20, 2023, 05:48:50 AMLast edit: September 20, 2023, 06:32:37 AM by cafter",
  "content": "I was reading this thread: https://bitcointalk.org/index.php?topic=5467196.0in which i saw a error in sorting I was seeing replies on first page which are like this. Yesterday-Yesterday-Today.and on secong page the the replies was sorted like this Yesterday-Today-Today.which is not sorted like this Yesterday-Yesterday-Yesterday-Today-Today-Today. which is right kind of sorting without any error.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467417",
  "comments": [
    {
      "author": "PX-Z",
      "created_time": "September 20, 2023, 05:52:51 AM",
      "body": "Yes, you must have checked the \"Show most recent posts at the top\" in your profile. You can disable it by unchecking that option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cafter",
      "created_time": "September 20, 2023, 06:02:32 AM",
      "body": "Quote from: PX-Z on September 20, 2023, 05:52:51 AMYes, you must have checked the \"Show most recent posts at the top\" in your profile. You can disable it by unchecking that option.no, my all settings are on default settings, is it a normal error? which happened many times with other users too?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "September 20, 2023, 06:16:55 AM",
      "body": "That's messed up. Can you check other threads if they have the same sorting issue? Now, If it's nothing about the option of most recent posts, it could be of changing the setting time, else i don't know anymore lol, haven't faced it yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "September 20, 2023, 06:37:19 AM",
      "body": "What PX-Z poined out is only possible reason, I cannot think of other reasons for this mess.Weeks ago a user discussed about that option. So did you mess it up since that day?Be careful messing around with default settings",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "September 20, 2023, 08:44:55 AM",
      "body": "Posts are sorted correctly. It's the time displayed on your image that is wrong. For example, NotATether's post has been made on September 19, 2023, 10:45:22 AM (UTC), not Today at 10:45:22 AM.Check the first page of thread once again and if the times are not shown correctly, do a hard refresh (CTRL+F5). It seems that you are seeing an old version of the webpage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "September 20, 2023, 09:11:59 AM",
      "body": "Quote from: cafter on September 20, 2023, 05:48:50 AMI was reading this thread: https://bitcointalk.org/index.php?topic=5467196.0in which i saw a error in sorting I was seeing replies on first page which are like this. Yesterday-Yesterday-Today.and on secong page the the replies was sorted like this Yesterday-Today-Today.which is not sorted like this Yesterday-Yesterday-Yesterday-Today-Today-Today. which is right kind of sorting without any error.I also go through the link provided to see but I couldn't get on anything new or strange about what you pointed out, which means there might not be any new developments on that, because i tried other threads as well this morning and see nothing newly introduced  as well, it's more likely to be from the button you must have checked in as pointed out above which you may not be aware of doing so, in this regard, you're likely going to be the only one to experience such and not everyone except you unchecked the function from the button.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "September 20, 2023, 10:05:05 AM",
      "body": "I expect you captured the screen on the first page before the page refreshed and when you moved to the next page the time became refreshed and that's it.This is not a technical problem. This may happen sometimes due to the page not being refreshed or an error in the timing of the computer or mobile.Most of the time I leave the forum page open in the browser and close the computer and when I later turn on the browser the old page appears with the previous time when I close. I have to refresh the page to get the correct updated page.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}