{
  "id": "topic_5456913",
  "title": "Lida93",
  "author": "Lida93",
  "created_time": "June 19, 2023, 09:46:33 PM",
  "content": "Gambling if not checked cam lead to a devastating condition for a gambler's life. As a gambler when you allow yourself to be controlled by gambling instinct instead of having control over it, it repercussions doesn't particularly affects only you but goes beyond just you to those around you.A woman was giving an account of how her gambling husband has been problematic to her with his gambling attitude. She gave an instance of how her husband had to steal her jewelry and sold it to get money to carry on his gambling enterprise. And unsuspecting of her husband the woman accused their come-and-go house-cleaner of making away with her jewelry when the cleaner must have come to the house for her cleaning services that very faithful day. She got the cleaner arrested, but then, investigations where carried out which it was uncovered that the woman's husband was the one who stole her jewelry for gambling and not the cleaner. It is difficult to grasp or imagined the level of humiliation the innocent cleaner must have faced for an act she knows nothing about.A question that bothers me concerning this issue is; 1. Do gambling addicts ever take a second thought on what the consequences of their actions can be not just to them but on those close to them?  2. Do they in reality genuinely feel any remorse about  how those affected by their actions might be feeling?  3. Or, are they a dispassionate victim of their own uncontrollable addictive gambling lifestyle?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456913",
  "comments": [
    {
      "author": "Wiwo",
      "created_time": "June 19, 2023, 10:00:21 PM",
      "body": "Quote from: Lida93 on June 19, 2023, 09:46:33 PMA question that bothers me concerning this issue is; 1. Do gambling addicts ever take a second thought on what the consequences of their actions can be not just to them but on those close to them?  If the take second thought of the consequences of their actions,  it then mean they are no longer addicts and won't want to go that way by having to do despicable things just to gamble,  the thing is that at that point their conscience is already death and their won't even have any second thought before carrying out such act. Quote from: Lida93 on June 19, 2023, 09:46:33 PM2. Do they in reality genuinely feel any remorse about  how those affected by their actions might be feeling? The have zero remorse just like someone that have a mental problem,  they are no longer in control but rather their addiction controls them. Quote from: Lida93 on June 19, 2023, 09:46:33 PM3. Or, are they a dispassionate victim of their own uncontrollable addictive gambling lifestyle?Yes that is what it is,  the addictions have made them become a monster looking for every possible means and ways just to feed they desires,  and gambling addicts is even worst of since they aim is to use whatever valuable to gamble and this is something that pushes them to use even things that have more value to that their stake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "June 19, 2023, 10:13:27 PM",
      "body": "Quote from: Wiwo on June 19, 2023, 10:00:21 PMQuote from: Lida93 on June 19, 2023, 09:46:33 PMA question that bothers me concerning this issue is; 1. Do gambling addicts ever take a second thought on what the consequences of their actions can be not just to them but on those close to them?  If the take second thought of the consequences of their actions,  it then mean they are no longer addicts and won't want to go that way by having to do despicable things just to gamble,  the thing is that at that point their conscience is already death and their won't even have any second thought before carrying out such act. Quote from: Lida93 on June 19, 2023, 09:46:33 PM2. Do they in reality genuinely feel any remorse about  how those affected by their actions might be feeling? The have zero remorse just like someone that have a mental problem,  they are no longer in control but rather their addiction controls them. Quote from: Lida93 on June 19, 2023, 09:46:33 PM3. Or, are they a dispassionate victim of their own uncontrollable addictive gambling lifestyle?Yes that is what it is,  the addictions have made them become a monster looking for every possible means and ways just to feed they desires,  and gambling addicts is even worst of since they aim is to use whatever valuable to gamble and this is something that pushes them to use even things that have more value to that their stake. well, we have another thread related to gambling addiction here.   but yeah, if the person is already addicted to gambling just like any addiction, they usually have no concept of dignity, thus, resorting to actions that would ruin their or their family's reputation. this is why if someone is already at this stage, professional help is already needed to intervene in this situation. they will only feel guilty when something life-changing is already happening to them like getting divorced or his kids don't want to see him anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0ne",
      "created_time": "June 19, 2023, 10:19:21 PM",
      "body": "1. The gambler will think of the second thought after losing or encountering some problems soon after busting the money. This happens with most of the gamblers. Maybe if they had gone through the second thought they might have not gambled.2. Surely the person will feel guilt at some point. Maybe at the beginning the thoughts were we couldn't have caught. Later surely the person will feel guilt for the act as the loss will surely pain him.3. The reality, they're in an uncontrollable state. For some reason they've got into gambling, and keep running with the hope and never thinks of from where the money will come. They'll try to manage on the go and end up with similar incidents. Finally at some point they'll understand it is really hard and loss is the end result. Even at that time their mind doesn't wants to stop, but it gets adopted to it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "June 19, 2023, 10:44:22 PM",
      "body": "Quote from: Lida93 on June 19, 2023, 09:46:33 PMA question that bothers me concerning this issue is; 1. Do gambling addicts ever take a second thought on what the consequences of their actions can be not just to them but on those close to them?here's my assumption, they probably do think about what the consequence could be but the urge of wanting to gamble is too much so they do it anyway, and they most likely justify their action just to clear their conscience.Quote from: Lida93 on June 19, 2023, 09:46:33 PM2. Do they in reality genuinely feel any remorse about  how those affected by their actions might be feeling? some probably do and some probably won't. As I said before, they try to justify their actions in their own twisted way, but some probably will realize just how badly their action affected someone and feels remorseful for what they have done.Quote from: Lida93 on June 19, 2023, 09:46:33 PM3. Or, are they a dispassionate victim of their own uncontrollable addictive gambling lifestyle?they are, but not all of them.btw, it is my first time hearing the phrase \"dispassionate victim\". I am still confused about what it means but from what I understand, it basically means \"someone who shows no emotion despite being a victim or affected by something\", am I right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "June 19, 2023, 10:50:15 PM",
      "body": "If you meet an addict that thinks about other people more than their pleasures or activities, you are a very rare person. I've never met an addict that feels remorseful over their actions and indulgences after they finished gambling. They might feel upset, but never remorseful. No matter how much it affects the people around them, all they think of is how can they satiate their hunger for gambling or where can they get more money to extend their sessions. There are some addicts that can feel something for a short time, though, but it immediately fades once they have the money to fill their addiction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Docnaster",
      "created_time": "June 19, 2023, 10:52:02 PM",
      "body": "Quote from: Wiwo on June 19, 2023, 10:00:21 PMQuote from: Lida93 on June 19, 2023, 09:46:33 PMA question that bothers me concerning this issue is; 1. Do gambling addicts ever take a second thought on what the consequences of their actions can be not just to them but on those close to them?  If the take second thought of the consequences of their actions,  it then mean they are no longer addicts and won't want to go that way by having to do despicable things just to gamble,  the thing is that at that point their conscience is already death and their won't even have any second thought before carrying out such act. Wiwo I saw you opened a post that there are much of gambling addiction posts and here you are freely commenting to it   We cannot actually stop it. You can choose to add this to the list you made.Meanwhile to Op, not all addicts actually know they are addicted. Only a few that knows they are addicted seek for help. Most addicts don't actually know they are addicted. They simply see it as a way of life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "June 19, 2023, 10:57:06 PM",
      "body": "How did you hear about this? If it is from a news, please include the link so that we can read it on the news too directly. I am just tired of bringing up gambling addiction stories that are not true.Quote from: Lida93 on June 19, 2023, 09:46:33 PMA question that bothers me concerning this issue is; 1. Do gambling addicts ever take a second thought on what the consequences of their actions can be not just to them but on those close to them?  2. Do they in reality genuinely feel any remorse about  how those affected by their actions might be feeling?  Gambling addicts do not think about the consequences of losing a bet, all they think about is that they can win and win. They are thinking that gambling will make their life better as they will find a strategies to always win, but otherwise are always the case as they continue to lose. Until losses occur before they can be remorseful about gambling. Quote from: Lida93 on June 19, 2023, 09:46:33 PM3. Or, are they a dispassionate victim of their own uncontrollable addictive gambling lifestyle?Yes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "June 19, 2023, 10:59:47 PM",
      "body": "Well, most gambling addicts don't even know they are addicted, and that is where the whole problem lies, how can someone who doesnt know that he or she committed a crime feel remorseful or any form of regret for what they have done or how what they've done affected any body or those around them?It is always said that solving a problem required two steps, and theFirst step is the come to the realization and acceptance that the problem is there, once a person can agree to the presence of the problem and accept it's a problem indeed, then such problem is 50% solved already, thenThe second step will be to look for the solution to the problem.Most gambling addict I know will never agree they are addicted, they will just tell you that they are just a regular gambler like anybody else who loves gambling frequently.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "June 19, 2023, 11:23:27 PM",
      "body": "Quote1. Do gambling addicts ever take a second thought on what the consequences of their actions can be not just to them but on those close to them?  I think gambling addicts sometimes think and reflect about their action but they are already addicted to gambling so they continue with their gambling activity despite they have thought that they are doing wrong.Quote2. Do they in reality genuinely feel any remorse about  how those affected by their actions might be feeling?  Human feature is to feel remorse whenever he done something wrong.  In case of a gambling addict, I thnk they also feel remorse but as I stated gambling addiction is too strong that they keep on gambling the moment they have the chance.Quote3. Or, are they a dispassionate victim of their own uncontrollable addictive gambling lifestyle?They are victim obviously.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "June 19, 2023, 11:49:29 PM",
      "body": "No, I would say that gambling addicts do not know or cannot tell right from Wrong when comes to their gambling habits. Actually, not being able to tell right from wrong while gambling is one of the main characteristics of a problem gambling victim, and hence the inability to stop wagering money. If someone still can feel remorse or have second thoughts, then It is not too late for that person to get intervention and straighten their life and save up their money for more important things than entertainment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "June 20, 2023, 06:13:31 AM",
      "body": "I feel like if you need to steal from someone you love just to gamble puts you into pathologic addict status. I wouldn't call it bad habit at that point - it would be sickness that should be treated by professionals. I think gambling addicts are humans so they definitely feel bad about it I am sure. But they probably can't help themselves and stop. They should not exactly be blamed. It should be considered disorder probably. I would offer professional help if my relatives have similar issues.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oasisman",
      "created_time": "June 20, 2023, 06:27:24 AM",
      "body": "Quote from: Lida93 on June 19, 2023, 09:46:33 PMA question that bothers me concerning this issue is; 1. Do gambling addicts ever take a second thought on what the consequences of their actions can be not just to them but on those close to them?  2. Do they in reality genuinely feel any remorse about  how those affected by their actions might be feeling?  3. Or, are they a dispassionate victim of their own uncontrollable addictive gambling lifestyle?Ok here we go with another episode of the \"gambling addicts\". Well, to answer these questions, in my opinion it's a big NO to all three of that. They are not even aware that they are a gambling addict, same goes with the people who got addicted with cigarettes and alcohol, they only feel like it's part of their daily routine and their system. Do they have a thought on the consequences of their actions? \"NO\", why? because they think they could take back all what they've lost once they hit a jackpot when reality is they won't gonna take it back. Does that husband felt guilt or remorse on what happened to their cleaner? \"NO\" cause if he does, he have admitted it in the first place when the authorities took their cleaner away as a primary suspect for the ongoing investigation. Though that husband might felt it on the latter. Are they a victim of their own lifestyle? again, NO they chose that path and so they are the only one who could fix it on their own. Again, we can't do much to cure gambling addiction, but we can somehow spread awareness to prevent one from becoming so, but I think we have enough of an awareness in this section LOL.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "June 20, 2023, 06:30:43 AM",
      "body": "Quote from: acroman08 on June 19, 2023, 10:44:22 PMQuote from: Lida93 on June 19, 2023, 09:46:33 PM3. Or, are they a dispassionate victim of their own uncontrollable addictive gambling lifestyle?they are, but not all of them.btw, it is my first time hearing the phrase \"dispassionate victim\". I am still confused about what it means but from what I understand, it basically means \"someone who shows no emotion despite being a victim or affected by something\", am I right?You are not far from the meaning, mate. The word  dispassionate  is an ambiguous word with several meanings, and in this context \"dispassionate victim\", could be said to be someone who finds himself under a circumstance that is overwhelming and beyond their control.  Within their inner part they don't feel like doing it but they do it anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Josefjix",
      "created_time": "June 20, 2023, 06:39:05 AM",
      "body": "Quote from: Hispo on June 19, 2023, 11:49:29 PMNo, I would say that gambling addicts do not know or cannot tell right from Wrong when comes to their gambling habits. Actually, not being able to tell right from wrong while gambling is one of the main characteristics of a problem gambling victim, and hence the inability to stop wagering money. If someone still can feel remorse or have second thoughts, then It is not too late for that person to get intervention and straighten their life and save up their money for more important things than entertainment.Everyone understands what is right and wrong, it is only ignorance that prevents most people from doing the right thing; purportedly, we had opportunities to right our wrongs, but some people would not take a single step to do so, instead choosing to engage in gambling activities. Gambling is never an alternative or a method to generating secure finances; it is unreliable and completely a risk. It instills so many destructive negative thoughts in the brains of addicted gamblers that they are willing to engage in any extreme behavior without regard for the consequences of their conduct. gaming addicts do feel sorrow for their desperation for gaming.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "June 20, 2023, 07:00:17 AM",
      "body": "Quote from: Lida93 on June 19, 2023, 09:46:33 PM1. Do gambling addicts ever take a second thought on what the consequences of their actions can be not just to them but on those close to them? Only few make this consideration whilebthe majority overlooked this aspect and believed there's nothing too much to give, loose or expect than for them to enjoy their own life as they could, so gambling i such manners is their own perfect way of being satisfied with lots of fun to enjoy their life each day they are gambling.Quote from: Lida93 on June 19, 2023, 09:46:33 PM2. Do they in reality genuinely feel any remorse about  how those affected by their actions might be feeling? Someone who never think about the gambling addiction affecting him negatively will never mind how you also feels about him since those kind of people that are addicted to gambling dont considers some things as serious as when needed because their life itself is not taken with all seriousness, why should they be concerned about how you feels about them.Quote from: Lida93 on June 19, 2023, 09:46:33 PM3. Or, are they a dispassionate victim of their own uncontrollable addictive gambling lifestyle?Maybe, as you can see from those well addicted in gambling, they never see anything wrong in it, they reap the reward for their addiction from the consequences they get afterwards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iroh",
      "created_time": "June 20, 2023, 07:12:53 AM",
      "body": "Quote from: Lida93 on June 19, 2023, 09:46:33 PMA question that bothers me concerning this issue is; 1. Do gambling addicts ever take a second thought on what the consequences of their actions can be not just to them but on those close to them?  2. Do they in reality genuinely feel any remorse about  how those affected by their actions might be feeling?  3. Or, are they a dispassionate victim of their own uncontrollable addictive gambling lifestyle?I think an individual going through an addiction and wants to drop the habit to better himself needs all the love and support he can get. It’s not an easy task for someone with an addiction to drop it. It’s extremely difficult. I know that for a fact. Regarding your questions, this is what I think..1. I think some addicts do think their actions through and the repercussions that could come later on that would hurt and affect himself and others around him. But in most cases, the addiction usually would prevail; damn the consequences.2. Yes, I think some may actually feel remorse and ashamed of how their actions may have negatively affected themselves and their family but that feeling of guilt and shame does not last long and would quickly evaporate when hearing out to gamble again.3. I think a whole lot could be said to be victims of their own habit that has spiraled out of their control. And that’s why I mentioned that an individual going through an addiction and has made up his mind to stop should be supported and loved.Mistakes could likely happen and the person may fall back into the habit. Support, love and encouragement from family and people around him would go a long way in the fight towards dropping the addiction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "June 20, 2023, 07:16:10 AM",
      "body": "Based on my experience here in our community, they no longer have any kind of shyness because they ask people for money without feeling guilty, and some steal others' properties to support their addictions. I remember when I woke up in the middle of the night when someone asked our neighbor for some money to play because he used to give that guy some money whenever he lost, and the guy seemed to lose his mind as well, waking up my neighbor to fund him some money to play more. Man! That was something you wouldn't believe, but it happens, and I can't believe they went up that far because of their addiction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "June 20, 2023, 07:26:52 AM",
      "body": "I have friends like this that's why gamblers who have become heavy addicts are always abandoned by their families or leave their families, everything is almost the same as that, for example stealing or selling what belongs to his wife or children, that's why they never think about the future of their family let alone think about the consequences their actions. they won't care about that. believe meMy friend always follows a lifestyle, usually the environment exerts influence and pressure on him so he continues to play gambling without caring about anything around him or hurting his family's feelings, that's why I advised him but he never wanted to hear it, maybe one day at his saturation point he will think for himself about his behavior had gone too far. I'm sure it will come and he regrets it. so never advise addicts because it will be useless, my advice is let him be aware starting from himself. seeing the story above it is almost very similar to my gambling friend, seeing him made me realize that gambling must be wise and controlled",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "June 20, 2023, 07:36:41 AM",
      "body": "Sometimes in extreme conditions they do.It is a personal case to me as I was badly addicted in 2019 and in the early 2020,one time I lost so much money that I could not afford to lose that my level of regret and sadness was at the highest.I laid down to think cold headed and started thinking of what I had just done,this led me to carefully think ahead and I decided to never again gambling more than I could afford to lose,since then with the passing of time I developed a really strong self will and managed to never do that horrible thing again.So bottom line,gambling addicts sometimes do think and correct the consequences caused by their behavior.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}