{
  "id": "topic_5437927",
  "title": "famososMuertos",
  "author": "famososMuertos",
  "created_time": "February 03, 2023, 01:05:10 PMLast edit: February 03, 2023, 01:18:28 PM by famososMuertos",
  "content": "Tiene días sonando está noticia, entré cuentas bloqueadas en binance por sospechas asociadas, según la fuente arrestaron a la cúpula completita.\"La Guardia Civil desarticula 'Bitzlato', uno de los principales exchange internacionales de criptodivisas, que tuvo transacciones de de más de 2.000 millones de dólares\"ir: https://www.antena3.com/noticias/sociedad/cae-cupula-plataformas-criptomonedas-mas-utilizadas-cibercrimen_2023020263dbb671308cc00001d1b1f3.htmlQuoteOverall results5 individuals arrested so far (1 in Cyprus, 3 in Spain and 1 in the US);1 individual questioned in Portugal;The main administrator arrested in the US;CEO, Financial director and Marketing director arrested in Spain;8 house searches (4 in Spain, 1 in Cyprus, 2 in Portugal, 1 in US);Takedown of the digital infrastructure of the service, enabling further analysis and investigation;Seizures include crypto wallets worth about EUR 18 million in cryptocurrency at the time of writing, vehicles and electronic equipment;100+ accounts at other crypto exchange frozen, involving a total of EUR 50 million.Europol",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437927",
  "comments": [
    {
      "author": "Don Pedro Dinero",
      "created_time": "February 03, 2023, 04:23:54 PM",
      "body": "Sin tener más datos, no podemos decir más. Me he leído la nota de prensa y dice que el 46% de los activos que pasaron por la plataforma estaba ligado a actividades criminales, pero no tengo claro como lo puedan saber, pues me da que pensar que o bien los criminales son tontos y no han pasado antes los activos por mixers o casinos sin wagering requirements para que se perdiera la pista, o bien que el análisis que les da ese 46% no es muy preciso.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "February 04, 2023, 08:00:30 AM",
      "body": "En cuanto al cómo \"evadir\" o el proceso de lavado, bien está explicado en la imagen de la Europol, ellos mismos alertan \"sabemos\" como lo hacen, entonces el \"ero\" no se les olvidó, solo que todas las Txs conducen a Roma, en este caso Bitzlato.En cuánto a la precisión del dinero involucrado, siempre me da que como las demandas piquen por arriba, luego veremos.En todo caso he revisadochainalysis.com/ y en su blog hay un reporte específico de dónde proceden tanto el dinero como los emisores.Aunque eso debería ser \"supuesto\" dado que seguramente algunos movimientos serán difíciles de relacionar con los implicados \"individuos\" pero no con el Exchange.La imágen corresponde a la fuente https://blog.chainalysis.com/reports/us-authorities-shut-down-high-risk-exchange-bitzlato/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "February 04, 2023, 09:32:20 AM",
      "body": "Quote from: famososMuertos on February 04, 2023, 08:00:30 AMEn cuanto al cómo \"evadir\" o el proceso de lavado, bien está explicado en la imagen de la Europol, ellos mismos alertan \"sabemos\" como lo hacen, entonces el \"ero\" no se les olvidó, solo que todas las Txs conducen a Roma, en este caso Bitzlato.Lo del \"ero\" no se lo que quieres decir, lo que creo es que si la policía tiene pruebas de esos orígenes la cúpula criminal no tomó las medidas necesarias.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "February 04, 2023, 02:02:41 PM",
      "body": "No había oído nunca hablar de este Exchange, aunque viendo el ámbito geográfico principal en el cual operaba, y el perfil supuesto de la mayor parte de sus clientes, no es de extrañar.He visto en varios artículos al respecto donde ponían en el eje central la carencia de KYC, facilitando el lavado de dinero de manera anónima. Ya parecen lejanos aquellos tiempos en los cuales los grandes Exchanges de hoy en día iban sin KYC, algo cada vez más remoto.En todo caso, de alguna manera hay una relajación en el lado fiat de todo el operativo. El Exchange puede haber actuado a modo de macro mezclador, pero las salidas fiat hacia cuentas de cliente, salvo importes pequeños, difícilmente no iba a hacer saltar las alertas en Europa o EEUU.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "February 04, 2023, 03:02:19 PM",
      "body": "Quote from: DdmrDdmr on February 04, 2023, 02:02:41 PMEl Exchange puede haber actuado a modo de macro mezclador, pero las salidas fiat hacia cuentas de cliente, salvo importes pequeños, difícilmente no iba a hacer saltar las alertas en Europa o EEUU.Esa es una duda que tengo yo. En los ToS de muchos casinos online hay una cláusula explícita en contra de usarlos como mixers. Por ejemplo, en los ToS de Livecasino.io:Quote5.6. We reserve the right to apply a wagering requirement of at least 5 (five) times the deposit amount if we suspect the player is using our service as a mixer. It is strictly forbidden to use our service for any other purpose than entertainmentEn los casinos que no tienen esta cláusula, pocos a día de hoy, y que además no suelen pedir KYC, se puede usar el casino como mixer porque la dirección donde tú depositas no suele estar ligada con la que te envía el retiro. Me imagino que si el exchange operaba así, tal vez los delincuentes confiaron en esto como una forma de que se perdiera la pista sin haber pasado los bitcoins por mezcladores previos. Esto hablando de bitcoin, otras criptomonedas no se cómo funcionan.Y si el sistema era depositar criptomonedas de delitos y retirar grandes cantidades de fiat vía transferencia bancaria sería muy lol. Es una pena que no sepamos más detalles y solo podamos especular.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "February 05, 2023, 02:02:03 AM",
      "body": "El tema de que los chicos malos se agarraran Bitzlato como lavandería creo que fue lo mejor y lo peor que le pudo haber pasado a esa casa de cambio. Por un lado es lo mejor por que el volumen de transacciones seguro fue grande, dejando un buen impuesto por cada cambio de divisas. Pero al final dar esta libertad a los chicos malos les costó el negocio. No me extrañaría si nos enteramos en un futuro que esta casa de cambio había sido creada con la intención de lavar dinero, no sería la primera vez que alguien hace esto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "December 08, 2023, 02:49:47 PM",
      "body": "Hoy hay un artículo en Criptonoticias donde se refleja como el cofundador del Exchange Bizlato se ha declarado culpable de operar un negocio de transmisión de dinero sin licencia y sin KYC, facilitando el lavado de dinero. De hecho, el artículo refleja que sus mandamases conocían plenamente de que (algunos de) sus clientes podían estar moviendo dinero negro, e incluso usurpando identidades al abrir cuentas en la plataforma.Parece que el foco de todo está ahora en las batidoras de frutas, pero si levantamos la mira, los Exchanges parece que son los peces de mayor peso bajo la lupa.Ver:https://www.criptonoticias.com/judicial/ceo-exchange-bitcoin-bizlato-culpable-lavado-dinero-binance/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "December 08, 2023, 03:40:19 PM",
      "body": "Quote from: DdmrDdmr on December 08, 2023, 02:49:47 PMHoy hay un artículo en Criptonoticias donde se refleja como el cofundador del Exchange Bizlato se ha declarado culpable de operar un negocio de transmisión de dinero sin licencia y sin KYC, facilitando el lavado de dinero. De hecho, el artículo refleja que sus mandamases conocían plenamente de que (algunos de) sus clientes podían estar moviendo dinero negro, e incluso usurpando identidades al abrir cuentas en la plataforma.Parece que el foco de todo está ahora en las batidoras de frutas, pero si levantamos la mira, los Exchanges parece que son los peces de mayor peso bajo la lupa.Ver:https://www.criptonoticias.com/judicial/ceo-exchange-bitcoin-bizlato-culpable-lavado-dinero-binance/Lo que sucede es que los reguladores están al tanto de que el dúo de las batidoras de frutas y los exchanges de criptomomedas son parte de un binomio que se presta bastante para cosas ilegales. Uno drinda el deshacerse de la trazabilidad y el otro da la liquidez para poder hacer los swaps o los retiros. El duplo obviamente se simplifica aún más cuando el exchange no hace uso de las típicas herramientas de identificación de los clientes y los que tienen mala intención se limitan a depositar y retirar luego de un tiempo preventivo. Por cierto, me gustaría algo de contexto sobre cuál era el papel de esos mandamanses de los que se habla, si el sujeto en si era el cofundador de la plataforma, entonces no debería tener nadie sobre su posición (asumiendo que el también fuese el CEO en el momento de la puesta de los cargos en su contra).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "December 08, 2023, 04:32:39 PM",
      "body": "Quote from: Hispo on December 08, 2023, 03:40:19 PM<…>Es probable que el foco esté sobre ambos tipos de servicios como dices, sólo que los Exchanges tienen mayor visibilidad, usuarios, y volumen de negocio, mientras que las batidoras de frutas son un tanto más modestas (entiendo yo) en los citados parámetros. Los primeros son, en general más propensos a ponerse en solfa hoy en día, con posibilidades de sobrevivir a los pecados que se les atribuye como hemos visto en el caso de CZ (y menos mal), y pasar de grises a blancos. Los segundos desaparecen (y si acaso reflotan con otra identidad), y son menos los casos donde veamos que la persona detrás del negocio es pillada. Los segundos con KYC no tienen sentido.En cuanto a la estructura de bitzlato, las imágenes archivadas de principios de año no tienen apartado informativo alguno, algo que uno echa de menos encontrar. El tal Anatoly Legkodymov era CEO y confundador del Exchange, con participación mayoritaria. Ahora desde luego no es fácil encontrar mucha información acerca del resto de la cúpula (ni siquiera el nombre del otro cofundador).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "December 09, 2023, 02:34:21 AM",
      "body": "Quote from: DdmrDdmr on December 08, 2023, 04:32:39 PMQuote from: Hispo on December 08, 2023, 03:40:19 PM<…>Es probable que el foco esté sobre ambos tipos de servicios como dices, sólo que los Exchanges tienen mayor visibilidad, usuarios, y volumen de negocio, mientras que las batidoras de frutas son un tanto más modestas (entiendo yo) en los citados parámetros. Los primeros son, en general más propensos a ponerse en solfa hoy en día, con posibilidades de sobrevivir a los pecados que se les atribuye como hemos visto en el caso de CZ (y menos mal), y pasar de grises a blancos. Los segundos desaparecen (y si acaso reflotan con otra identidad), y son menos los casos donde veamos que la persona detrás del negocio es pillada. Los segundos con KYC no tienen sentido.En cuanto a la estructura de bitzlato, las imágenes archivadas de principios de año no tienen apartado informativo alguno, algo que uno echa de menos encontrar. El tal Anatoly Legkodymov era CEO y confundador del Exchange, con participación mayoritaria. Ahora desde luego no es fácil encontrar mucha información acerca del resto de la cúpula (ni siquiera el nombre del otro cofundador).Sin querer parecer una persona prejuiciosa ni nada parecido, al juzgar por el nombre del cofundador y el hecho de que no pedían documentos de sus clientes, quizá las autoridades le dieron prioridad al caso de ese intercambio de monedas por posiblemente estar ligado a movimiento y lavado de capitales procedentes de Europa oriental y de los aliados de Rusia, como Irán y los grupos armados que se ven beneficiados del apoyo económico del país Islámico. Mi predicción personal es que con el paso del tiempo puede que el Coinjoin y soluciones decentralizadas se impongan sobre las batidoras centralizadas. No creo que a un desarrollador no se le ocurra utilizar contratos inteligentes en una red como Ethereum que ofusque la trazabilidad de los Wei. Viendo cómo van las cosas y como la política y los términos en general van deviniendon en cosas que antes nosotros ubiesemos considerado de ciencia ficción (Pornografía hecha por inteligencia artificial, Youtubers virtuales, lectores de huellas en los teléfonos), quizá no pase mucho tiempo hasta que aparezcan personas que le vean sentido a las batidoras con KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}