{
  "id": "topic_5450138",
  "title": "cafter",
  "author": "cafter",
  "created_time": "April 25, 2023, 04:01:21 PMLast edit: April 25, 2023, 04:47:41 PM by cafter",
  "content": "can we track our forum activity, like there is 14days and how to know that i gained one activity at that day or not?i didn't found it anywhere.i read all things but nothing found about, how to know activity history.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450138",
  "comments": [
    {
      "author": "knowngunman",
      "created_time": "April 25, 2023, 04:12:01 PM",
      "body": "Quote from: cafter on April 25, 2023, 04:01:21 PMcan we track our forum activity, like there is 14days and how to know that i gained one activity at that day or not?i didn't found it anywhere.Frequent posts and active is what determines your activity increment in the forum I think. I maybe wrong thou. However, you can track activity through Telegram using this bot Bitcoin talk notifier. Follow the instructions and you'll be able to track the activities here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lucifur",
      "created_time": "April 25, 2023, 04:15:50 PM",
      "body": "Quote from: cafter on April 25, 2023, 04:01:21 PMcan we track our forum activity, like there is 14days and how to know that i gained one activity at that day or not?i didn't found it anywhere.Saw a somewhat similar question here; Check this : https://bitcointalk.org/index.php?topic=4576767.0It was posted a long time ago so...Not sure if it works.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "April 25, 2023, 04:33:38 PM",
      "body": "Quote from: cafter on April 25, 2023, 04:01:21 PMcan we track our forum activity, like there is 14days and how to know that i gained one activity at that day or not?i didn't found it anywhere.Used this spreadsheet: https://docs.google.com/spreadsheets/d/12saLhlUoqIdairxzuSPu6EYGrt7FN2lOstO1yDjCEbAOriginally posted in this thread: TIL Activity does not work on precisely 2 week intervals + interval timings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "April 25, 2023, 04:45:13 PM",
      "body": "Here: https://bitcointalk.org/index.php?topic=2766177.0That thread explains what you need to know about the forum activity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "April 25, 2023, 05:14:56 PM",
      "body": "Quote from: cafter on April 25, 2023, 04:01:21 PMcan we track our forum activity, like there is 14days and how to know that i gained one activity at that day or not?i didn't found it anywhere.The activity does not correspond to the days, only that you can get 14 activities max in a 2 week period. To know if you get an activity in a day it would reflect on your profile except you have gotten the maximum activity for that period.If you make more than 14 posts in a 2 week period only 14 would count towards that activity week.Also note that you only one post is enough to potentially claim the activities for that period. For example; if I make one post in the first two weeks and 2 in the next two weeks, I potentially have 28 activities to claim if I make 25 more posts in a short period of time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "April 25, 2023, 05:52:00 PMLast edit: April 25, 2023, 06:03:57 PM by Fiatless",
      "body": "Quote from: Dr.Bitcoin_Strange on April 25, 2023, 04:45:13 PMHere: https://bitcointalk.org/index.php?topic=2766177.0That thread explains what you need to know about the forum activity.That thread by @hilariousandco is a comprehensive manual on forum activities. But I have observed that you get 14 activities in two weeks and the activity is usually updated on Wednesday, I might be wrong. And you need to post in the current week to be able to get the fourteen activities if your post exceeds your activities. And you lose the fourteen activities if you don't do any posts within the activity period. I am guessing that the next activity period will begin on the 3rd of May .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "April 25, 2023, 06:07:43 PM",
      "body": "Quote from: Fiatless on April 25, 2023, 05:52:00 PMI am guessing that the next activity period will begin on the 3rd of May .You are pretty much right about everything you posted and you don't have to guess which day is the next for the activity period, you can check the spreadsheet already posted in this thread; https://docs.google.com/spreadsheets/d/12saLhlUoqIdairxzuSPu6EYGrt7FN2lOstO1yDjCEbAIt shows the cutoff date and time for the next activity period.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "April 25, 2023, 07:38:02 PM",
      "body": "Quote from: cafter on April 25, 2023, 04:01:21 PMcan we track our forum activity, like there is 14days and how to know that i gained one activity at that day or not?Well, i don't think so we can track each activity and see the history of all our previous activities, but we can track our future activity by using the telegram Bot --> @BTTSuperNotifier_bot by TryNinja. But this bot is like a notification bot like if you get the message, or you want to track boards, topics, persons, etc. But i think the only manual way to track activity is to observe the profile.Every 2 weeks, your activity will automatically be added according to the dates on this spreadsheet. But why do you need to track your activity? Maybe i pick your question wrong but as you asked to check whether we get activity or not, it will reflect on your profile after 2 weeks and the quantity is fixed for 2 weeks which is 14 activities, thread rules are already shared with you above to check the activity related questions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "April 25, 2023, 07:56:46 PM",
      "body": "Quote from: cafter on April 25, 2023, 04:01:21 PMcan we track our forum activity, like there is 14days and how to know that i gained one activity at that day or not?i didn't found it anywhere.You can actually track your activity after every 14 days through the spreadsheet provided by @Baofeng here.I notice that the activity does change on Wednesdays.Note that you are only entitled to 14 activities within 14 days which means each day has 1 activity, if you drop 14 posts in one day, your 14 activities will be activated that same day and therefore before you have additional activity it will be after 14 days if another one is activated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "April 25, 2023, 08:29:04 PM",
      "body": "Quote from: cafter on April 25, 2023, 04:01:21 PMcan we track our forum activity, like there is 14days and how to know that i gained one activity at that day or not?i didn't found it anywhere.In this vain you can only know your activity rotation when you are active, because from my observation a Jr member doesn't have activity of two weeks rotation, the Jr member activity comes with its daily or constant posting until it reached to sixty post before the activity starts to be counting within two week's time before increment. Everyone have known that activity is something we know quite right that occurs on its own after two weeks it will reflect.For the aspect of knowing the mathematical indices or statistics of how many activity we should have per day from the fourteen (14) activities generated or received in Everyone account per day and weekly is something that I cannot explain, I will tell you that it's derived by programming or the system of forum, in other hands if we should divide 14 activities in two week's, we should at least have seven (7) activities per week, and the seven should divide into seven, and we have one (1) activity in one day, so if the explanation is not sort to you via your question you can make inquiry if I'm not mistaken.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "April 25, 2023, 09:06:26 PM",
      "body": "Quote from: GeorgeJohn on April 25, 2023, 08:29:04 PMbecause from my observation a Jr member doesn't have activity of two weeks rotation, the Jr member activity comes with its daily or constant posting until it reached to sixty post before the activity starts to be counting within two week's time before increment.Wrong.Activity equals to min(14*number of two-week actvity periods in which you have been active, your post count) and that's the same for all users. It's not that actvity is calculated in a different way for some ranks. If you see your activity changes every 14 days, that's because number of your posts is greater than 14*number of two-week actvity periods in which you have been active. That's not due to your rank.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "April 25, 2023, 09:56:24 PM",
      "body": "Quote from: hosseinimr93 on April 25, 2023, 09:06:26 PMQuote from: GeorgeJohn on April 25, 2023, 08:29:04 PMbecause from my observation a Jr member doesn't have activity of two weeks rotation, the Jr member activity comes with its daily or constant posting until it reached to sixty post before the activity starts to be counting within two week's time before increment.Wrong.Activity equals to min(14*number of two-week actvity periods in which you have been active, your post count) and that's the same for all users. It's not that actvity is calculated in a different way for some ranks. If you see your activity changes every 14 days, that's because number of your posts is greater than 14*number of two-week actvity periods in which you have been active. That's not due to your rank.I'm not arguing the fact that activity is applicable to every user, the situation of someone who is a jr member newly, the activity don't really come like someone who is a member, because once someone who is jr member drop a post it count with the activity within some minutes, until it reaches member before it will be having 14 activity every two weeks, so the activity of member user is applicable to any position. So if their is any mistake from my explanation I stand to be corrected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}