{
  "id": "topic_5465947",
  "title": "landheer",
  "author": "landheer",
  "created_time": "September 07, 2023, 06:52:16 AM",
  "content": "Saya rasa pasti banyak orang yang berada di forum ini berinvestasi di btc, namun tentunya berinvestasi di btc tidak terlepas dari yang namanya resiko, dan kadang dalam berinvestasi di btc apalagi dengan modal yang besar yang tentunya resikonya juga sangat tinggi dan saya pikir kalau punya tujuan kita harus mengambil tindakan dan jangan takut dengan resiko, dan saya ingin bertanya kepada teman semua, apakah keberanian mengambil resiko adalah tindakan yang bagus dalam investasi di btc dan juga bisnis lainnya?  Saya ingin mendengarnya dari anda?.....tapi menurut saya berani mengambil resiko berinvestasi di btc adalah hal yang bagus selama kita menggunakan uang menganggur.Selamat siang teman teman lokal?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465947",
  "comments": [
    {
      "author": "reagansimms",
      "created_time": "September 07, 2023, 09:10:21 AM",
      "body": "Mengambil resiko terkadang perlu dilakukan untuk mengetahui hal-hal baru dan mendapatkan pengalaman baru seperti berinvestasi dalam Bitcoin, namun anda harus mengetahui risiko investasi Bitcoin agar tidak berakhir dengan kerugian. Bitcoin dinilai sebagai salah satu investasi yang memiliki imbal balik menjanjikan, tidak heran kenapa peminat Bitcoin terus-menerus meningkat setiap harinya.Salah satu risiko yang harus diketahui investor baru adalah volatilitas Bitcoin yang sangat cepat sehingga harganya bisa berubah-ubah dalam hitungan detik. Jadi jangan hanya berani mengambil resiko saja, anda harus mempelajari cara menghindari risiko dalam investasi Bitcoin seperti memahami supply dan demand di pasar yang dapat mempengaruhi harga Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MarjorieZimmermanGinger",
      "created_time": "September 07, 2023, 10:02:46 AM",
      "body": "Quote from: landheer on September 07, 2023, 06:52:16 AMSaya rasa pasti banyak orang yang berada di forum ini berinvestasi di btc, namun tentunya berinvestasi di btc tidak terlepas dari yang namanya resiko, dan kadang dalam berinvestasi di btc apalagi dengan modal yang besar yang tentunya resikonya juga sangat tinggi dan saya pikir kalau punya tujuan kita harus mengambil tindakan dan jangan takut dengan resiko, dan saya ingin bertanya kepada teman semua, apakah keberanian mengambil resiko adalah tindakan yang bagus dalam investasi di btc dan juga bisnis lainnya?  Dan saya juga yakin ada banyak orang yang terlibat di altcoin meskipun saya sendiri tidak terlibat lagi sejauh ini. Orang sukses selalu menempatkan resiko dalam segala kegiatan yang mereka jalani, hanya saja mereka tidak bertindak secara gegabah sebelum mengkaji tahapan yang diperlukan. Sebagian orang lainnya menempatkan resiko dengan ketidak seimbangan, artinya mereka melakukan sesuatu bukan karena dasar pengetahuan melainkan karena melihat orang lain sukses pada investasi tersebut. Bagus berani mengambil resiko dibitcoin selama kita mampu bertanggung jawab dengan kebutuhan lain, misalnya jika kita sudah menikah maka penyesuaian uang harus dapat dipenuhi pada kebutuhan dasar terlebih dahulu sehingga sisanya bisa ditempatkan dibitcoin, apalagi jika uang menganggur yang di gunakan untuk investasi dibitcoin dan itu akan jauh lebih produktif.Bitcoin tidak akan beresiko ketika seseorang menjalaninya dengan benar, katakanlah jika hari ini bitcoin mengalami penurunan tajam dalam waktu yang lama anda hanya perlu menunggu proses pemulihan. Berisiko yang dimaksud ketika seseorang tidak memahami proses perjalanan bitcoin dan mereka tidak pernah menganalisis siklus, sehingga pada saat bitcoin mengalami penurunan tajam berusaha memotong kerugian dan menjual bitcoinnya. Di sinilah letak kesalahan jika investasi tidak dibarengi dengan pengetahuan yang sebenarnya dan saya berani mengatakan jika resiko yang di ambil dibitcoin akan sebanding jika dilakukan secara benar.Quote from: landheer on September 07, 2023, 06:52:16 AMSaya ingin mendengarnya dari anda?.....tapi menurut saya berani mengambil resiko berinvestasi di btc adalah hal yang bagus selama kita menggunakan uang menganggur.Saya hanya punya satu pandangan bahwa mengambil resiko harus sepadan dengan kemampuan untuk bertanggung jawab. Jadi tidak akan menjadi beban psikologis yang mungkin dapat mempengaruhi kesehatan atau mental kita. Tanggung jawab harus sepadan dengan pemahaman dan pengetahuan seseorang terhadap investasi yang dijalani dan setelah itu baru diputuskan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "masulum",
      "created_time": "September 07, 2023, 01:42:43 PM",
      "body": "Quote from: landheer on September 07, 2023, 06:52:16 AM-snip-apakah keberanian mengambil resiko adalah tindakan yang bagus dalam investasi di btc dan juga bisnis lainnya?  Saya ingin mendengarnya dari anda?.....tapi menurut saya berani mengambil resiko berinvestasi di btc adalah hal yang bagus selama kita menggunakan uang menganggur.Selamat siang teman teman lokal?Mengambil risiko, tapi harus ada perhitungan yang matang. Semua orang bisa mengambil risiko, tapi tidak semua orang bisa memanage risiko dengan baik. Misalnya, kita memang sudah menggunakan uang bebas, mau loss sekalipun, kita tidak akan mengalami masalah apapun. Cuma, ketika kita benar-benar dihadapkan pada kondisi rugi, pada akhirnya kita merasa \"wah bahaya ini, kok semakin rugi\", kemudian mulailah merasa panik, cut loss. kemudian naik, lalu FOMO dan ini kemudian dialami berulang-ulang. Akhirnya, keberaniannya dalam mengambil risiko tidak sesuai dengan konsep manajemen risiko. Meskipun kita sudah siap dengan risiko, kita harus memiliki plan, tidak melulu langsung masuk aja, \"loss doll, gass poll\". Jika ada plan, kita akan lebih siap dengan setiap risiko. Kemudian, strategi, ini juga perlu diperhatikan. karena bagaimanapun, kita tetap butuh strategi untuk mengantisipasi sebuah kemungkinan. Dalam kripto, keputusan untuk hold, take profit, cutloss adalah bagian dari strategi yang perlu dipakai. Itu sih menurut saya, jadi tidak ngasal ambil risiko, terus hasilnya bagus. tidak demikian.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tuturtinular",
      "created_time": "September 07, 2023, 02:48:42 PM",
      "body": "Quote from: landheer on September 07, 2023, 06:52:16 AMSaya rasa pasti banyak orang yang berada di forum ini berinvestasi di btc, namun tentunya berinvestasi di btc tidak terlepas dari yang namanya resiko, dan kadang dalam berinvestasi di btc apalagi dengan modal yang besar yang tentunya resikonya juga sangat tinggi dan saya pikir kalau punya tujuan kita harus mengambil tindakan dan jangan takut dengan resiko, dan saya ingin bertanya kepada teman semua, apakah keberanian mengambil resiko adalah tindakan yang bagus dalam investasi di btc dan juga bisnis lainnya?  Saya ingin mendengarnya dari anda?.....tapi menurut saya berani mengambil resiko berinvestasi di btc adalah hal yang bagus selama kita menggunakan uang menganggur.Selamat siang teman teman lokal?Berani mengambil resiko adalah hal yang perlu dan sudah biasa kita lakukan. Membeli bitcoin, atau membeli emas, atau menyimpan uang anda di bank, semuanya memiliki resiko, hanya masalah besar dan kecilnya sebuah resiko. Jadi untuk meminimalisir resiko agan bisa membuat analisa pergerankan harga bitcoin sebelum mencoba berinvestasi padanya. Selain itu, mungkin agan juga perlu untuk menyiapkan uang untuk kebutuhan sehar-hari, dan juga kebutuhan darurat sehingga agan tidak perlu terburu-buru menjual bitcoin ketika ada kebutuhan darurat seperti kebutuhan medisJadi, berani berinvastasi di bitcoin atau tidak, saya kembalikan ke kondisi keuangan agan. Jika agan sudah memiliki analisa dan siap mental, tidak ada salahnya mencoba. Tetapi jika belum, jangan coba-coba soalnya berat gan.. Terutama godaan panic sell  . Sedikit tips untuk memulai berinvestasi bitcoin adalah dengan membeli secara bertahap, jadi saat harga bitcoin turun agan bisa membeli lagi, turun lagi beli lagi, jadi bisa sampe mendapatkan harga terbawah",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jcojci",
      "created_time": "September 07, 2023, 03:18:08 PM",
      "body": "Quote from: landheer on September 07, 2023, 06:52:16 AMSaya rasa pasti banyak orang yang berada di forum ini berinvestasi di btc, namun tentunya berinvestasi di btc tidak terlepas dari yang namanya resiko, dan kadang dalam berinvestasi di btc apalagi dengan modal yang besar yang tentunya resikonya juga sangat tinggi dan saya pikir kalau punya tujuan kita harus mengambil tindakan dan jangan takut dengan resiko, dan saya ingin bertanya kepada teman semua, apakah keberanian mengambil resiko adalah tindakan yang bagus dalam investasi di btc dan juga bisnis lainnya?  Saya ingin mendengarnya dari anda?.....tapi menurut saya berani mengambil resiko berinvestasi di btc adalah hal yang bagus selama kita menggunakan uang menganggur.Selamat siang teman teman lokal?Tentu saja keberanian mengambil resiko adalah tindakan yang bagus dalam investasi di bitcoin. Tapi rata-rata orang-orang yang baru mulai berinvestasi di bitcoin tidak akan memikirkan resikonya. Mereka hanya berpikir saya bisa memulai berinvestasi di bitcoin. Nah, mindset ini yang perlu diubah karena jika mereka tidak paham dengan resikonya, mereka bisa membeli di harga pucuk dan ini sering terjadi walaupun kondisi bitcoin sedang tidak dalam bull run. Kemarin waktu harga bitcoin berada di harga $28k, beberapa teman saya memberanikan diri untuk membelinya. Saya sudah menyarankan untuk tunggu dulu, jangan langsung membeli atau kalau mau membeli, pasang di harga $27k. Tapi mereka nekad sambil bilang ga apa-apa mas, ini saya juga mau nyoba beli. Oh, ya sudah kalau gitu. Akhirnya ya, sampai sekarang mereka nyangkut di harga tersebut. Mereka sempat tanya, mas ini enaknya gimana ya? Saya jual atau tetap di tahan? Saya bilang, kalo mas e jual sekarang, ya jelas rugi dunk, tapi kalo di tahan, mas e masih punya kesempatan untuk balik modal dan malah bisa dapat untung. Tapi itu tergantung dari kesabaran mas e. Akhirnya mereka tetap menahannya sampai sekarang dan saya sudah menyarankan untuk membeli lagi di harga $25k sekian. Ga tau sih, mereka jadi beli atau ngga soale saya belum tanya lagi.Nah dari cerita singkat itu, om nya harus pahami dulu resiko seperti nyangkut di harga tinggi atau ga sempat jual di saat harganya mulai naik dll. Kalau sudah paham dan bisa menerima risikonya, lanjutkan pak ekooo eeehh mas eeee",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gaza13",
      "created_time": "September 07, 2023, 06:13:56 PM",
      "body": "Quote from: landheer on September 07, 2023, 06:52:16 AMSaya rasa pasti banyak orang yang berada di forum ini berinvestasi di btc, namun tentunya berinvestasi di btc tidak terlepas dari yang namanya resiko, dan kadang dalam berinvestasi di btc apalagi dengan modal yang besar yang tentunya resikonya juga sangat tinggi dan saya pikir kalau punya tujuan kita harus mengambil tindakan dan jangan takut dengan resiko, dan saya ingin bertanya kepada teman semua, apakah keberanian mengambil resiko adalah tindakan yang bagus dalam investasi di btc dan juga bisnis lainnya?  Saya ingin mendengarnya dari anda?.....tapi menurut saya berani mengambil resiko berinvestasi di btc adalah hal yang bagus selama kita menggunakan uang menganggur.Selamat siang teman teman lokal?Hidup ini seperti permainan judi, ada pepatah yang mengatakan \" Hidup yang tidak di pertaruhankan tidak akan pernah di menangkan\". Misalnya agan mau berbisnis dalam hal apapun agan harus berani menghadapi namanya kegagalan, kegagalan itu adalah Guru yang terbaik dari kehidupan dari situ kita bisa belajar dan terus melakukan inovasi atau perubahan step by step apa yang kurang dari diri kita dan usaha bisnis kita terus lah berproses, pasti suatu saat nanti kesuksesan itu pasti menghampiri orang yang berusaha keras. Ingat Hasil tidak akan pernah mengkhianati kalau orang tersebut berusaha dengan giat atau bekerja keras.Quote from: jcojci on September 07, 2023, 03:18:08 PMTapi rata-rata orang-orang yang baru mulai berinvestasi di bitcoin tidak akan memikirkan resikonya. Mereka hanya berpikir saya bisa memulai berinvestasi di bitcoin. Nah, mindset ini yang perlu diubah karena jika mereka tidak paham dengan resikonya, mereka bisa membeli di harga pucuk dan ini sering terjadi walaupun kondisi bitcoin sedang tidak dalam bull run.Biasanya orang yang mau membeli sesuatu atau berinvestasi pasti sudah harus mengenal atau memahami sesuatu atau dampak yang di beli nya. Kalau hanya memulai tanpa melihat dari segala sesuatu nya (resiko) atau skill dan pengetahuan yang cukup atau dampak kerugian nya, itu hanya dogeng semata om, Pasti Orang tersebut pasti tidak akan berinvestasi om.Saya ingat betul waktu kawan saya mengenal kan crypto ke saya, dia memberitahu atau mengedukasi ke saya bahwa ada investasi yang bisa membuat uang bertambah dengan resikonya cukup tinggi, bisa untung, bisa buntung. Dengan rasa penasaran yang tinggi saya coba mengambil resiko tersebut dengan modal todak terlalu banyak.Mungkin ini sedikit history saya mengenal crypto: https://bitcointalk.org/index.php?topic=5394208.msg61686568#msg61686568Quote from: jcojci on September 07, 2023, 03:18:08 PMKemarin waktu harga bitcoin berada di harga $28k, beberapa teman saya memberanikan diri untuk membelinya. Saya sudah menyarankan untuk tunggu dulu, jangan langsung membeli atau kalau mau membeli, pasang di harga $27kKita tidak pernah tahu secara pasti kapan bitcoin itu akan turun dengan harga sesuai keinginan kita, semua hanya spekulasi dari seseorang dan itu semua tidak 💯 persen akurat . Mungkin yang sudah mengenal bitcoin sejak lama pasti tahu , dimana bitcoin ada face 4 tahunan terjadi, di mana masa bearish datang. Mungkin tahun ini tahun yang tepat untuk menyerok bitcoin sebanyak mungkin (sesuai kantong masing-masing) dan hold sampai halving tiba, terus lah Dca setiap bulannya mau mahal atau murah terus beli dan cara ini kita akan mendapatkan harga yang terbaik. Pada saat halving tiba yang mau menikmati hasil nya monggo,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BITCOIN4X",
      "created_time": "September 07, 2023, 08:16:02 PM",
      "body": "Quote from: landheer on September 07, 2023, 06:52:16 AMapakah keberanian mengambil resiko adalah tindakan yang bagus dalam investasi di btc dan juga bisnis lainnya?Ketika anda memutuskan untuk berinvestasi pada bitcoin, maka pada dasarnya anda telah mengambil resiko. Masalahnya sekarang adalah bagaimana anda bisa meminimalisir resiko yang ditimbulkan karena pada dasarnya resiko itu tidak akan bisa dihilang.Pada investasi yang memiliki volatilitas tinggi seperti bitcoin tentu saja anda harus sadar bahwa ini memiliki resiko yang tinggi. Anda perlu memiliki rencana dan batasan anggaran yang bilamana jika harga aset yang anda investasikan tidak sesuai dengan apa yang anda harapkan, maka anda siap dengan konsekuensinya. Namun anda juga harus menyadari bahwa resiko investasi bitcoin tidak hanya tentang volatilitas harga, tetapi anda hal lain yang perlu anda ketahui seperti resiko keamanan. Ane bisa mengatakan bahwa keuntungan yang dihasilkan dari investasi bitcoin sangat sepadan dengan resikonya, tetapi bijaksanalah dengan cara dan strategi investasi anda.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arimamib",
      "created_time": "September 07, 2023, 11:58:39 PM",
      "body": "Quote from: landheer on September 07, 2023, 06:52:16 AMSaya rasa pasti banyak orang yang berada di forum ini berinvestasi di btc, namun tentunya berinvestasi di btc tidak terlepas dari yang namanya resiko, dan kadang dalam berinvestasi di btc apalagi dengan modal yang besar yang tentunya resikonya juga sangat tinggi dan saya pikir kalau punya tujuan kita harus mengambil tindakan dan jangan takut dengan resiko, dan saya ingin bertanya kepada teman semua, apakah keberanian mengambil resiko adalah tindakan yang bagus dalam investasi di btc dan juga bisnis lainnya?  Saya ingin mendengarnya dari anda?.....tapi menurut saya berani mengambil resiko berinvestasi di btc adalah hal yang bagus selama kita menggunakan uang menganggur.Selamat siang teman teman lokal?Pada tahap ini lakukan pembelian secara bertahap untuk setiap pembelian yang anda lakukan. Investasi di bitcoin memang sangat beresiko dan pastinya anda sudah memikirkan lebih awal. Saya pikir jika anda memiliki modal besar maka lakukan secara dca seperti yang di lakukan kebanyakan orang dari pada membeli secara instan. Namun semua keputusan ada di tangan anda dan saya lebih suka menerapkan secara dca untuk investasi jangka panjang.Apalagi anda menggunakan uang menganggur atau uang dingin tentu menjadi poin besar bagi anda akan siap menghadapi segala bentuk resiko yang akan ada jumpai selama proses jalannya investasi di bitcoin yang akan anda lakukan. Artinya dalam tahap ini anda benar benar sudah berpikir matang karena uang tersebut tidak akan anda gunakan untuk keperluan lainnya karena katakan lah setelah anda membeli dan harganya turun pastinya anda harus menahan hingga pembalikan terjadi misalnya keuntungan sudah menghampiri anda dan jangan mengambil kesimpulan untuk melakukan penjualan yang bisa di sebabkan oleh beban pikiran disaat harganya terus menurun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Uruhara",
      "created_time": "September 08, 2023, 12:05:50 AM",
      "body": "Pada dasarnya memang tidak ada ruang investasi yang tanpa melibatkan resiko. karena semuanya pasti memiliki resikonya masing-masing. Hanya saja setiap jenis investasi memang memiliki tingkatakan resikonya masing-masing. Ada yang resiko rendah dan ada yang resiko tinggi. Biasanya jenis investasi yang beresiko rendah memang selalu memiliki potensial keuntungan yang tidak terlalu besar dalam jangka pendek tapi akan cukup besar dalam jangka panjang (lebih dari 10 tahun). Contohnya seperti Real Estate, Properti dan semacamnya. Jenis investasi yang beresiko tinggi biasanya memiliki tingkat potensi keuntungan yang juga tinggi dalam jangka waktu yang tidak terlalu lama. Jika di altcoin maka bisa lebih cepat. Tapi karena ini tentang bitcoin maka biasanya keuntungan bisa diperolah mengikuti alur halving bitcoin yang terjadi setiap 5 tahun sekali. Nah berani mengambil resiko memang sangat baik. Apabila didasari dengan wawasan yang mumpuni, tujuan yang pasti dan perencanaan yang matang. Dan setelah itu jika resiko yang diambil memang cukup tinggi maka kita memang harus menggunakan uang dingin yang memang harus siap jika dihadapkan dengan kerugian. Dan keputusan berinvestasi harus berdasarkan pada keyakinan diri sendiri bukan karena terpengaruh oleh ajakan orang lain. Artinya harus berdasarkan penilitan sendiri. Tidak boleh masuk hanya karena terbawa hype berita dan semacamnya  (impulsif).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Afnan_faizah",
      "created_time": "September 08, 2023, 12:28:45 AM",
      "body": "untuk menjadi sukses, berani mengambil resiko saja tidak cukup, harus juga disertai dengan perhitungan yang tepat. dalam investasi bitcoin ada beberapa resiko, baik yang berkaitan dengan nilai investasi maupun  keamanan. soal keamanan yang perlu diperhatikan adalah bagaimana kita menjaga data-data untuk mengakses wallet kita, sangat disarankan untuk tidak menyimpan data-data tersebut dalam PC, mengirimkannya melalui internet ataupun memprintnya pada kertas karena mungkin printer yang digunakan juga menyimpan data-data dalam cache maka dari itu sebaiknya di tulis saja. untuk soal resiko yang berkaitan dengan nilai investasi, sangat di sarankan untuk mempelajari terlebih dahulu tehnik-tehnik dalam pembelian BTC, metode DCA sangat populer dan cukup aman untuk pemula sedangkan bagi yang sudah mampu membaca tren pasar maka saya sangat menyarankan untuk menggunakan metode lump sum.tidak semua investasi yang beresiko tinggi juga menjanjikan keuntungan yang besar, alangkah baiknya kita sebagai investor memilih investasi yang memberikan probabilitas keuntungan besar yang tinggi dan resiko yang rendah. contohnya, dalam berinvestasi pada altcoin resiko yang kita tanggung akan lebih besar sebab masa depan altcoin sangat tidak pasti, oleh sebab itu saya menyarankan jika ingin membeli altcoin maka pilihlah altcoin dengan tingkat kepopuleran tinggi, market cap tinggi, volume trading tinggi, harga tinggi, sudah lama digunakan sesuai peruntukannya dan tren harga yang bagus. saya tidak menyarankan untuk menyimpan altcoin dalam waktu lama, lebih baik digunakan untuk trading karena biasanya presentase perubahan harganya lebih tinggi dari pada bitcoin sehingga lebih memberi kesempatan untuk mendapatkan keuntungan. demikian pendapat dari saya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "September 08, 2023, 01:05:32 AM",
      "body": "Quote from: landheer on September 07, 2023, 06:52:16 AMdan saya ingin bertanya kepada teman semua, apakah keberanian mengambil resiko adalah tindakan yang bagus dalam investasi di btc dan juga bisnis lainnya?  Saya ingin mendengarnya dari anda?.....tapi menurut saya berani mengambil resiko berinvestasi di btc adalah hal yang bagus selama kita menggunakan uang menganggur.Keberanian mengambil resiko itu menurut ane tidak bagus jika dilakukan dengan membabi buta. Apa lagi jika ente tidak paham sama sekali atas apa yang ente beli. Pernah ane punya temen yang hanya ikutan investasi bitcoin, tapi dianya malah gak tahu sama sekali apa itu bitcoin, sehingga bukannya untung malah buntung kena scam. Resiko itu, jika semakin besar maka akan semakin besar pula profitnya, begitu juga sebaliknya, tapi bagi pemula yang baru mau masuk, baiknya tidak asal comot saja, mentang-mentang berani lalu main invest saja, ternyata kedepannya, ketika harga dump malah nangis dan nyalahin kita.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "landheer",
      "created_time": "September 08, 2023, 07:57:18 AM",
      "body": "Quote from: masulum on September 07, 2023, 01:42:43 PMQuote from: landheer on September 07, 2023, 06:52:16 AM-snip-apakah keberanian mengambil resiko adalah tindakan yang bagus dalam investasi di btc dan juga bisnis lainnya?  Saya ingin mendengarnya dari anda?.....tapi menurut saya berani mengambil resiko berinvestasi di btc adalah hal yang bagus selama kita menggunakan uang menganggur.Selamat siang teman teman lokal?Mengambil risiko, tapi harus ada perhitungan yang matang. Semua orang bisa mengambil risiko, tapi tidak semua orang bisa memanage risiko dengan baik. Misalnya, kita memang sudah menggunakan uang bebas, mau loss sekalipun, kita tidak akan mengalami masalah apapun. Cuma, ketika kita benar-benar dihadapkan pada kondisi rugi, pada akhirnya kita merasa \"wah bahaya ini, kok semakin rugi\", kemudian mulailah merasa panik, cut loss. kemudian naik, lalu FOMO dan ini kemudian dialami berulang-ulang. Akhirnya, keberaniannya dalam mengambil risiko tidak sesuai dengan konsep manajemen risiko. Meskipun kita sudah siap dengan risiko, kita harus memiliki plan, tidak melulu langsung masuk aja, \"loss doll, gass poll\". Jika ada plan, kita akan lebih siap dengan setiap risiko. Kemudian, strategi, ini juga perlu diperhatikan. karena bagaimanapun, kita tetap butuh strategi untuk mengantisipasi sebuah kemungkinan. Dalam kripto, keputusan untuk hold, take profit, cutloss adalah bagian dari strategi yang perlu dipakai. Itu sih menurut saya, jadi tidak ngasal ambil risiko, terus hasilnya bagus. tidak demikian. Oh, iya gan saya setuju dengan penjelasan anda, memang kita harus benar benar bisa me management dalam hal risiko,  saya setuju dengan pendapat anda bahwa me management adalah harus di utamakan, tapi jujur kadang ada kalanya merasa malas me management alasannya misalnya karena kita berinvestasi di crypto menggunakan uang yang siap hilang padahal itulah yang sangat di perlukan, yaitu management.Wah saya jadi dapat ilmu baru dari agan dan agan agan semuanya bahwa management adalah sesuatu yang sangat diperlukan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "skarais",
      "created_time": "September 08, 2023, 09:36:50 AM",
      "body": "Quote from: landheer on September 08, 2023, 07:57:18 AMQuote from: masulum on September 07, 2023, 01:42:43 PM~~~Oh, iya gan saya setuju dengan penjelasan anda, memang kita harus benar benar bisa me management dalam hal risiko,  saya setuju dengan pendapat anda bahwa me management adalah harus di utamakan, tapi jujur kadang ada kalanya merasa malas me management alasannya misalnya karena kita berinvestasi di crypto menggunakan uang yang siap hilang padahal itulah yang sangat di perlukan, yaitu management.Wah saya jadi dapat ilmu baru dari agan dan agan agan semuanya bahwa management adalah sesuatu yang sangat diperlukan.Ya memang seperti itu gan. Selain persiapan yang matang maka management resiko itu adalah hal yang tidak boleh dilupakan. Tidak hanya itu tapi, management anggaran juga diperlukan supaya rencana investasi yang agan bangun dari awal harus gagal hanya karena management anggarannya tidak ada.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "September 08, 2023, 11:22:56 AM",
      "body": "Quote from: landheer on September 07, 2023, 06:52:16 AMapakah keberanian mengambil resiko adalah tindakan yang bagus dalam investasi di btc dan juga bisnis lainnya?Kalau untuk berinvestasi di Bitcoin (BTC) mengambil risiko lebih adalah tindakan yang bagus selama investor-nya masih bisa makan dan berkecukupan dari berbagai aspek, kenapa begitu? karena seperti yang kita tahu bahwa Bitcoin (BTC) memiliki nilai inflasi yang terukur walau terdapat volatilitas yang tinggi di dalamnya. Bahkan hingga hari ini saja saya masih menganggap kalau kita masih berada di level adopsi awal, jadi seiring waktu berjalan investasi Bitcoin (BTC) yang dilakukan akan berbuah manis.Untuk di bisnis lainnya saya tidak memiliki pandangan apapun karena saya juga masih belum berada di level itu untuk menjawab, mungkin @mu_enrico bisa bantu jawab",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kaliandra",
      "created_time": "September 08, 2023, 11:56:45 AM",
      "body": "Saya rasa tindakan untuk mengambil resiko memang di perlukan, karena kalau kita tidak punya nyali maka kita tidak akan berpotensi sukses, (mendapatkan keuntungan)Misalnya seseorang tidak berani berinvestasi di btc padahal dia mempunyai uang yang siap hilang ( uang menganggur) maka dia tidak akan mendapatkan keuntungan karena dia tidak punya nyali untuk berinvestasi di btc. Jadi memang benar berani mengambil resiko adalah tindakan yang bagus namun tentunya jangan hanya mengandalkan keberanian karena dalam bisnis apapun termasuk investasi di btc bahwa pengetahuan yang harus di utamakan dan juga harus bisa ilmu management segala hal, karena tentunya walaupun berinvestasi di btc dengan uang menganggur tetap saja kita sebagai orang yang mencari keuntungan jangan sampai kita mendapatkan kerugian.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jcojci",
      "created_time": "September 08, 2023, 01:21:18 PM",
      "body": "Quote from: Gaza13 on September 07, 2023, 06:13:56 PMBiasanya orang yang mau membeli sesuatu atau berinvestasi pasti sudah harus mengenal atau memahami sesuatu atau dampak yang di beli nya. Kalau hanya memulai tanpa melihat dari segala sesuatu nya (resiko) atau skill dan pengetahuan yang cukup atau dampak kerugian nya, itu hanya dogeng semata om, Pasti Orang tersebut pasti tidak akan berinvestasi om.Saya ingat betul waktu kawan saya mengenal kan crypto ke saya, dia memberitahu atau mengedukasi ke saya bahwa ada investasi yang bisa membuat uang bertambah dengan resikonya cukup tinggi, bisa untung, bisa buntung. Dengan rasa penasaran yang tinggi saya coba mengambil resiko tersebut dengan modal todak terlalu banyak.Mungkin ini sedikit history saya mengenal crypto: https://bitcointalk.org/index.php?topic=5394208.msg61686568#msg61686568Belum tentu om karena kalau yang mengenalkan temannya, ada kemungkinan dia akan lebih mengikuti saran dari temannya daripada mencari informasi sendiri. Tapi itu memang tidak semuanya seperti itu. Ada juga yang mau mencari informasi sendiri atau bahkan ngga mau ikut gabung dan itu sudah banyak.Coba kalau om perhatikan yang ada di grup-grup trading di tele atau wa, banyak yang cuma menunggu info dari orang lain dan ga mau belajar menganalisa. Ini juga sama dengan mereka yang mengenal bitcoin dari temannya. Mereka yang dikenalkan dari temannya hanya melihat apa yang sudah mereka dapatkan dari bitcoin sehingga mereka jadi kepingin mencobanya tapi mereka ngga belajar banyak tentang apa itu investasi bitcoin.Tapi jika mereka bisa mengubah mindset nya untuk mau meluangkan waktunya untuk belajar berinvestasi di bitcoin, saya yakin mereka pasti bisa mendapatkan keuntungan karena sudah tahu kapan masuk ke pasarnya.Quote from: Gaza13 on September 07, 2023, 06:13:56 PMQuote from: jcojci on September 07, 2023, 03:18:08 PMKemarin waktu harga bitcoin berada di harga $28k, beberapa teman saya memberanikan diri untuk membelinya. Saya sudah menyarankan untuk tunggu dulu, jangan langsung membeli atau kalau mau membeli, pasang di harga $27kKita tidak pernah tahu secara pasti kapan bitcoin itu akan turun dengan harga sesuai keinginan kita, semua hanya spekulasi dari seseorang dan itu semua tidak 💯 persen akurat . Mungkin yang sudah mengenal bitcoin sejak lama pasti tahu , dimana bitcoin ada face 4 tahunan terjadi, di mana masa bearish datang. Mungkin tahun ini tahun yang tepat untuk menyerok bitcoin sebanyak mungkin (sesuai kantong masing-masing) dan hold sampai halving tiba, terus lah Dca setiap bulannya mau mahal atau murah terus beli dan cara ini kita akan mendapatkan harga yang terbaik. Pada saat halving tiba yang mau menikmati hasil nya monggo, Itu benar sekali om. Yang penting adalah kita mau menganalisa dulu, terus menentukan kita mau berdagang atau berinvestasi, baru action. Jika tujuan kita berinvestasi dengan DCA, ya kita tidak perlu terlalu mantengin harganya dan tetap melakukan DCA setiap minggu atau bulan sesuai dengan dana yang sudah kita siapkan dan interval waktu yang mau kita gunakan, misalnya 1 tahun atau 2 tahun baru dijual bitcoinnya atau menjual bitcoin di saat harganya tinggi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "September 08, 2023, 03:14:25 PM",
      "body": "Quote from: MAAManda on September 08, 2023, 11:22:56 AMKalau untuk berinvestasi di Bitcoin (BTC) mengambil risiko lebih adalah tindakan yang bagus selama investor-nya masih bisa makan dan berkecukupan dari berbagai aspek, kenapa begitu? karena seperti yang kita tahu bahwa Bitcoin (BTC) memiliki nilai inflasi yang terukur walau terdapat volatilitas yang tinggi di dalamnya. Bahkan hingga hari ini saja saya masih menganggap kalau kita masih berada di level adopsi awal, jadi seiring waktu berjalan investasi Bitcoin (BTC) yang dilakukan akan berbuah manis.Untuk di bisnis lainnya saya tidak memiliki pandangan apapun karena saya juga masih belum berada di level itu untuk menjawab, mungkin @mu_enrico bisa bantu jawab Ya apapun kalau mau cuan ya pasti ada risikonya, entah itu besar ataupun kecil, makanya ada kalimat \"risk vs return.\"Masalahnya risikonya itu worth it tidak dengan return yang akan didapat... Kalau worth it ya gas, kalo ga worth it ya jangan. Itu aja sih masalahnya karena penilaian masing-masing atas suatu risiko itu bisa berbeda makanya ada yang berani dan ada yang tidak.Jadi ya jawabannya apakah berani mengambil risiko itu bagus, ya tergantung kemampuan agan menilai suatu risiko itu akurat atau tidak. Kalau ga bisa menilai risiko, yang artinya agan mengambil keputusan yang risk vs return-nya ga worth it, dalam jangka panjang agan bakal bangkrut.Sebagai contoh ada kisah seorang pengusaha yang \"gila\" kalo investasi, tapi kebetulan penilaian dia itu selalu akurat jadi selalu cuan kalo inves yang bikin dia jadi Sultan. Eh, dia punya anak yang juga \"gila\" investasi. Tapi sayangnya si anak tidak sehoki bapaknya, jadinya si anak bangkrut.  Jadi ya modal berani aja ga cukup, harus ada kemampuan menilai risiko dan tentunya HOKI.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "masulum",
      "created_time": "September 08, 2023, 03:25:05 PM",
      "body": "Quote from: mu_enrico on September 08, 2023, 03:14:25 PMSebagai contoh ada kisah seorang pengusaha yang \"gila\" kalo investasi, tapi kebetulan penilaian dia itu selalu akurat jadi selalu cuan kalo inves yang bikin dia jadi Sultan. Eh, dia punya anak yang juga \"gila\" investasi. Tapi sayangnya si anak tidak sehoki bapaknya, jadinya si anak bangkrut.  Jadi ya modal berani aja ga cukup, harus ada kemampuan menilai risiko dan tentunya HOKI.Ada istilah yang sangat sering saya dengar dari ayah saya dan banyak juga sih yang mengucapkan hal serupa \"Kita bisa meniru pekerjaan orang lain, hobi orang lain atau apapun, tapi soal rejeki, itu sudah ada jalannya masing-masing, tinggal bagaimana mengaturnya\". Seperti yang mas katakan, orang tua bisa cuan, anak tidak. Itu adalah faktor X dalam mencari rejeki tersebut yang tidak sama. Dipaksa pun kadang tidak bisa memberikan apapun, ujung-ujungnya, yang penting cukup untuk dimakan sehari-hari.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "topbitcoin",
      "created_time": "September 08, 2023, 06:56:40 PM",
      "body": "Quote from: landheer on September 07, 2023, 06:52:16 AMSaya rasa pasti banyak orang yang berada di forum ini berinvestasi di btc, namun tentunya berinvestasi di btc tidak terlepas dari yang namanya resiko, dan kadang dalam berinvestasi di btc apalagi dengan modal yang besar yang tentunya resikonya juga sangat tinggi dan saya pikir kalau punya tujuan kita harus mengambil tindakan dan jangan takut dengan resiko, dan saya ingin bertanya kepada teman semua, apakah keberanian mengambil resiko adalah tindakan yang bagus dalam investasi di btc dan juga bisnis lainnya?  Saya ingin mendengarnya dari anda?.....tapi menurut saya berani mengambil resiko berinvestasi di btc adalah hal yang bagus selama kita menggunakan uang menganggur.Selamat siang teman teman lokal?Mengambil resiko adalah sebuah langkah yang berani untuk selangkah lebih maju menuju kesuksesan. Akan tetapi hal ini juga harus di barengi dengan pengetahuan dan kemampuan yang baik. Jangan sampai kita beprilaku ceroboh hanya dengan modal nekat karena mempunyai \"uang yang memanganggur\" dan tiba-tiba melakukan investasi dalam btc karena melihat orang lain banyak mendapatkan keuntungan besar dari sana. Orang lain bisa mendapatkan keuntungan karena mereka mempunyai kemampuan yang baik dalam melakukan analisa dan juga dalam menyerap informasi terbaru untuk melihat kemungkinan-kemungkinan yang akan terjadi dalam pasar saham. Uang yang menganggur adalah sebuah bukti bahwa kita belum mempunyai pemahaman, kemampuan dan pengetahuan yang baik. Karena jika kita mepunyai pemahaman, kemampuan dan pengetahuan yang baik, maka tidak akan ada uang yang menganggur kecuali tabungan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}