{
  "id": "topic_5474087",
  "title": "alani123",
  "author": "alani123",
  "created_time": "November 14, 2023, 09:07:10 PM",
  "content": "I just wanted to make a short post about the differing opinions that there exist about bitcoin's future. Some people seem to believe that it's bitcoin's fate to have high fees. That the limited block space along with increasing demand will combine to replace block rewards, continuing to provide miner incentives to keep the network secure. Well, for one, we're far from bitcoin having block rewards that are near zero. So saying that bitcoin having high fees is already meeting its destiny is at the very least a misrepresentation of what's happening. The thing is, bitcoin's fees are currently up due to NFT and tokens unrelated to BTC trying to be included in the blockchain. So it's not like bitcoin is facing an unavoidable destiny right now. There ARE ways that could potentially help with the spam that's causing the blockchain bloat. To name a few:1. Disincentivizing on-chain NFTs and tokens creations by removing their fee discounts wherever possible. 2. Increasing fees for using certain features. 3. Transaction filtering to invalidate transactions that are with certainty used for putting tokens on-chain. 4. Making block space bigger. Some of these, or even a combination of the above could easy the strain on the blockchain caused by transactions that aren't actually done to transact value with BTC. And to address potential concerns about increasing the space for transactions in blocks, one must understand economics. More transaction space resulting in lower fees doesn't mean that there will be no incentive to protect the network. Lower fees will result to more demand to create transactions which will in turn balance out to total transaction fees potentially even being higher after an equilibrium is reached.  Source: https://en.wikipedia.org/wiki/Economic_equilibriumQuoteCompetitive Equilibrium: Price equates supply and demand.    P – price    Q – quantity demanded and supplied    S – supply curve    D – demand curve    P0 – equilibrium price    A – excess demand – when P<P0    B – excess supply – when P>P0",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474087",
  "comments": [
    {
      "author": "BenCodie",
      "created_time": "November 14, 2023, 09:12:53 PM",
      "body": "Before I address the rest of the topic, let me start by addressing:Quote from: alani123 on November 14, 2023, 09:07:10 PMThere ARE ways that could potentially help with the spam that's causing the blockchain bloat. To name a few:Quote from: alani123 on November 14, 2023, 09:07:10 PM1. Disincentivizing on-chain NFTs and tokens creations by removing their fee discounts wherever possible. The disincentive already exists, the fee to mint ordinals are already much higher than that of a standard Bitcoin transaction.Quote from: alani123 on November 14, 2023, 09:07:10 PM2. Increasing fees for using certain features. The fees already adjust appropriately based on the byte size of a transaction.  Quote from: alani123 on November 14, 2023, 09:07:10 PM3. Transaction filtering to invalidate transactions that are with certainty used for putting tokens on-chain. Miners already have the option to opt out of including ordinals/nfts in blocks if they'd like to. Quote from: alani123 on November 14, 2023, 09:07:10 PM4. Making block space bigger. This argument has already been made before hence BCH and the other spin offs of BTC. There's no need to revive this debate.Quote from: alani123 on November 14, 2023, 09:07:10 PMI just wanted to make a short post about the differing opinions that there exist about bitcoin's future. Some people seem to believe that it's bitcoin's fate to have high fees. That the limited block space along with increasing demand will combine to replace block rewards, continuing to provide miner incentives to keep the network secure. Well, for one, we're far from bitcoin having block rewards that are near zero. So saying that bitcoin having high fees is already meeting its destiny is at the very least a misrepresentation of what's happening. The thing is, bitcoin's fees are currently up due to NFT and tokens unrelated to BTC trying to be included in the blockchain. So it's not like bitcoin is facing an unavoidable destiny right now. The way Bitcoin is heading is the intersection of Block Rewards with Fees. Before it was less about fees and more about the price vs. Block reward...but as we've travelled, fees have become more of a factor. If the Bitcoin network is not active enough to make up the difference in the block reward halving every 4 years, miners won't find it profitable and will stop mining.This halving is the first one where:- Miners do not have enough control of the market to help push toward profitable blocks post-halving.- The reward halving is less, and network fees will be more of a determinant of mining profitability than before.Does it mean fees will increase? Maybe. As at the end of the day, more network activity means higher pressure on the network, meaning higher fees. However you are right about one thing, ordinals are putting a lot of pressure on the network. I have a feeling that this is intentional though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alani123",
      "created_time": "November 14, 2023, 09:16:05 PM",
      "body": "Quote from: BenCodie on November 14, 2023, 09:12:53 PMBefore I address the rest of the topic, let me start by addressing:Quote from: alani123 on November 14, 2023, 09:07:10 PMThere ARE ways that could potentially help with the spam that's causing the blockchain bloat. To name a few:Quote from: alani123 on November 14, 2023, 09:07:10 PM1. Disincentivizing on-chain NFTs and tokens creations by removing their fee discounts wherever possible. The disincentive already exists, the fee to mint ordinals are already much higher than that of a standard Bitcoin transaction.This is not true. Ordinal inscriptions have a comparative advantage to other types of transactions. For the amount of space they take on-chain, they pay less actual sats/vByte. This is very easy to demonstrate. For instance, this following transaction should have paid ~300 USD in fees but instead was given a 75% discount due to exploiting certain Taproot and SegWit features that are overutilized to make ordinal transactions much cheaper comparatively to normal transactions. https://mempool.space/tx/77e996de08c48ed282a7b8bc88ca199712a15fa68babb10a0b3ee760674cf21bIf it weren't for these discounts we'd certainly be having much less spam from Ordinal NFTs and BRC-20 tokens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "November 14, 2023, 09:20:40 PMLast edit: November 15, 2023, 08:47:30 PM by BenCodie",
      "body": "Quote from: alani123 on November 14, 2023, 09:16:05 PMQuote from: BenCodie on November 14, 2023, 09:12:53 PMBefore I address the rest of the topic, let me start by addressing:Quote from: alani123 on November 14, 2023, 09:07:10 PMThere ARE ways that could potentially help with the spam that's causing the blockchain bloat. To name a few:Quote from: alani123 on November 14, 2023, 09:07:10 PM1. Disincentivizing on-chain NFTs and tokens creations by removing their fee discounts wherever possible. The disincentive already exists, the fee to mint ordinals are already much higher than that of a standard Bitcoin transaction.This is not true. Ordinal inscriptions have a comparative advantage to other types of transactions. For the amount of space they take on-chain, they pay less actual sats/vByte. This is very easy to demonstrate. For instance, this following transaction should have paid ~300 USD in fees but instead was given a 75% discount due to exploiting certain Taproot and SegWit features that are overutilized to make ordinal transactions much cheaper comparatively to normal transactions. https://mempool.space/tx/77e996de08c48ed282a7b8bc88ca199712a15fa68babb10a0b3ee760674cf21bIf it weren't for these discounts we'd certainly be having much less spam from Ordinal NFTs and BRC-20 tokens. At the moment they do. Ordinals are still new, and new conditions surrounding them (like miner opt in/out of confirming those transactions) could still be made. Similarly, miners could eventually decide it is best to exclude then for the sake of network activity.To directly address the discount, they still pay a higher fee overall. Even though sats per vbyte is actually lower, the transaction size itself in bytes is higher, so they are still paying more. We should remember that as time goes by.I don't think this a permanent issue in any case...I personally think ordinals are just a way for miners to:- Maximize fees over the short to mid term- Benchmark the network's revenue generating capability conservatively with these transactions over normal transactions.Side note kind of relating to the above, I think it's also quite convenient that the ordinal spam started around this positive sentiment, and the positive sentiment on the rise at the start of the year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitDane",
      "created_time": "November 14, 2023, 09:32:41 PM",
      "body": "To solve the network congestion and address the high transaction fee issue, the only solution is for the Bitcoin network to scale.  There are also some solution that uses layer 2 protocol such as lightning network.The development of Bitcoin is yet final, since it is a technology, the developer will find way to solve the scalability problem of Bitcoin.  I am also one of those that believe that it is not destiny of Bitcoin to have high transaction fee.  It counters the goal of Bitcoin to be adopted by people and use as cheaper alternative  method of payment.I think this ordinal spam can be taken as a challenge for developers to solve the scalability issue of Bitcoin.  We might take this as the possible occurrence in the future when the adoption of Bitcoin is high enough that the volume of transaction is 10x to 100x larger than the current normal volume of transaction.Regardless whether these ordinal have a discounted tx fee or not, the main issue is that the current setup of Bitcoin network scalability is not ready for ordinals spam when the taproot upgrade is implemented.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "November 14, 2023, 11:38:57 PM",
      "body": "Quote from: alani123 on November 14, 2023, 09:07:10 PMWell, for one, we're far from bitcoin having block rewards that are near zero. So saying that bitcoin having high fees is already meeting its destiny is at the very least a misrepresentation of what's happening. We aren't that far from really low rewards, like 0.4 BTC per block. Will the price be 8 times higher by that time? It's easy to say \"yes\" if you extrapolate the past performance, but extrapolating the past performance is wrong, there is no asset in this world that grows at the same rate forever. Sooner or later Bitcoin's growth will slow down and will stop compensating for the halvenings. So the effect of lower block reward on mining will happen in our lifetime. The reward will be zero in 2140 but it will become very low way before that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "November 15, 2023, 02:08:42 AM",
      "body": "@OP, so using ordinal cheat code makes our transactions cheaper? I wonder why aren't we using the same trick and insert our ACTUAL BITCOINS inside the ordinal \"cheating space\" as a trojan horse and fool the scammers miners to include our transactions faster? If you check the last 500 blocks you can see how these scammers are sliding dust amounts with normal and even low fees in bulk into the blocks. They are so desperate at scamming the community that they don't even care about the date and time of other transactions to include older TXs first instead of adding 2000 dust trash with the same fee rate as the old TXs waiting in mempool.But they haven't realized that if there are no users, their attempt at \"keeping the network safe\" is futile, IMO we need something in place to keep us safe from miners, wait...... I have an idea! How about we ask everyone we see randomly on the streets to come and help us by making a \"development team\"? That way we can be assured someone at least has our interest in mind which we can then depend on them for anything coming our way. Oh wait someone is passing by, lemme ask him if he is willing to be a dev,...... well it was a burglar trying to empty the neighbor's house, which now when I think about it, he is more decent and eligible to represent us, since he stabs from behind and in the dark, while cough some people cough, are looking us right in the eyes smiling with their knives being on display online for the world to see. 😅",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "November 15, 2023, 03:30:11 AM",
      "body": "I see that the positive side of Ordinal NFTs is that they have given us a practical idea of the problems that the Bitcoin network will suffer in the event of global adoption, and this will push the Bitcoin community to search for solutions that must be developed to eliminate this highly likely problem in the future.The Bitcoin network is still in its infancy, and as global adoption expands in the future, we will certainly face these problems, so it is best to look for solutions to these potential problems now.Another good aspect is that miners will no longer have to fear for the future of mining due to rewards being halved every four years. They now see that this problem can be solved by increasing transactions on the network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "November 15, 2023, 06:18:27 AM",
      "body": "Quote from: alani123 on November 14, 2023, 09:07:10 PMMore transaction space resulting in lower fees doesn't mean that there will be no incentive to protect the network. Lower fees will result to more demand to create transactions which will in turn balance out to total transaction fees potentially even being higher after an equilibrium is reached.  But the maximum of Bitcoin TPS is only 7, so if the block size is increased, it will not change anything. People are still forced to pay higher fees, if not their transactions will stuck in limbo.I feel like ordinals spam should be discussed with miners as they're oppositions against the users. Quote from: yhiaali3 on November 15, 2023, 03:30:11 AMI see that the positive side of Ordinal NFTs is that they have given us a practical idea of the problems that the Bitcoin network will suffer in the event of global adoption, and this will push the Bitcoin community to search for solutions that must be developed to eliminate this highly likely problem in the future.Why the developers need to spend their time for unnecessary problem, if Ordinals isn't exist in the first place, many developers will no need to think about this and find the solution.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "November 15, 2023, 06:37:05 AM",
      "body": "The Bitcoin miners don't mind the Ordinals, because they make bigger profits from higher transaction fees.If there wasn't any Ordinals, another feature might be introduced and it will congest the BTC blockchain with transactions that will be viewed as unnecessary by most Bitcoiners. We have to face the truth, that the Bitcoin Core blockchain simply cannot handle massive amounts of transactions without getting congested. This is one of the problems that will always stop the mass adoption of Bitcoin. Making the block size bigger doesn't solve the problem and BCH is a living proof. Bitcoin isn't perfect. Bitcoin isn't a financial panacea for all problems.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "November 15, 2023, 08:00:27 AM",
      "body": "Quote from: yhiaali3 on November 15, 2023, 03:30:11 AMI see that the positive side of Ordinal NFTs is that they have given us a practical idea of the problems that the Bitcoin network will suffer in the event of global adoption, and this will push the Bitcoin community to search for solutions that must be developed to eliminate this highly likely problem in the future.The Bitcoin network is still in its infancy, and as global adoption expands in the future, we will certainly face these problems, so it is best to look for solutions to these potential problems now.Another good aspect is that miners will no longer have to fear for the future of mining due to rewards being halved every four years. They now see that this problem can be solved by increasing transactions on the network.This makes the miners winner overall, they are the only one enjoying the high transaction fee on Bitcoin network now, at least when there is no more Bitcoin to mine miners won't have to quit their mining farm, they will make money from transactions on the network but for daily usage of Bitcoin it's going to be a problem, I hope a solution will come after or else people will look for alternatives. I believe that Bitcoin is a gold more than a payment solution, I won't be using Bitcoin for any payment from now on, I am used to accepting Bitcoin payment from few numbers of customers but now it's near impossible because they aren't ready to pay that much to send me my money, I might look for other option or just halt Bitcoin payment from now on. Ordinals is why the transaction fee is this high and I watched a video online about why people believe that Ordinals on the Bitcoin network will make miners stay in the mining business but what about people accepting Bitcoin as payment?  Using $4 to send Bitcoin is a lot, this $4 in my local currency is enough to buy and sew a cloth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "November 15, 2023, 08:05:06 AM",
      "body": "Quote from: hatshepsut93 on November 14, 2023, 11:38:57 PMWe aren't that far from really low rewards, like 0.4 BTC per block. Will the price be 8 times higher by that time? It's easy to say \"yes\" if you extrapolate the past performance, but extrapolating the past performance is wrong, there is no asset in this world that grows at the same rate forever. Sooner or later Bitcoin's growth will slow down and will stop compensating for the halvenings. So the effect of lower block reward on mining will happen in our lifetime. The reward will be zero in 2140 but it will become very low way before that.We are definitely not too far from the the 0.4 Btc per block reward, in fact the 7th bitcoin halving which is bound to happen in 2036 will get us there, that’s approximately 12-13 years from now, same time span from the first halving to the fourth in 2024. And we have seen in this approximately 15 years of bitcoin existence how the the volatility of the price has drastically reduce, for the past six months the price as just be in the region of $25k to $37k. If you ask anybody wether the next halving will do a 3x from the all time high many will say no because it clear that the volatility rate is reducing so yeah I agree that the price increase wouldn’t be as the early days as we go on",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "November 15, 2023, 08:13:46 AM",
      "body": "Quote from: davis196 on November 15, 2023, 06:37:05 AMThe Bitcoin miners don't mind the Ordinals, because they make bigger profits from higher transaction fees.If there wasn't any Ordinals, another feature might be introduced and it will congest the BTC blockchain with transactions that will be viewed as unnecessary by most Bitcoiners. We have to face the truth, that the Bitcoin Core blockchain simply cannot handle massive amounts of transactions without getting congested. This is one of the problems that will always stop the mass adoption of Bitcoin. Making the block size bigger doesn't solve the problem and BCH is a living proof. Bitcoin isn't perfect. Bitcoin isn't a financial panacea for all problems.You are right, the reason for the current problem is miners. They are the ones who are dusting the blockchain to increase the fee because they are the ones who will get most of the benefit out of it, and they should stop this on their own. People (miners) are only after money; they don't care about the BTC empire, and the purpose of it is to kill the hen laying golden eggs while they can get the golden eggs without killing it. They should not become greedy; otherwise, a mechanism will be placed by the developers, and that is for sure to hurt the miners. Just like the listing of ORDI on Binance has also made them money as they are also miners of BTC, they will earn profit from the listing of ORDI on Binance too. They are trying to fill their bags with both hands, which is so immoral.BTC is really not a financial panacea for all scalability problems, but it can become one if the developers give it more time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "November 15, 2023, 09:09:33 AM",
      "body": "Paying for block space will always need to be a thing for Bitcoin to survive long term. The cost of that space will likely depend on the value provided. During times of calamity, I could see Bitcoin becoming very expensive to use. Maybe $100 for a transaction. Other times when block space may not be as valuable, it will cost less. This supply and demand bidding will be more and more important as block rewards are reduced.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "November 15, 2023, 09:22:33 AM",
      "body": "Quote from: Jawhead999 on November 15, 2023, 06:18:27 AMBut the maximum of Bitcoin TPS is only 7, so if the block size is increased, it will not change anything.Bitcoin's TPS  is 7 because of the blocksize, not the other way around!Quote from: Faisal2202 on November 15, 2023, 08:13:46 AMYou are right, the reason for the current problem is miners. No, the reason for the problem is ignorants who accuse others of everything without realizing they are just leechers who want everything for free, too lazy to actually understand how things work, and just shout incompressible garbage when they stop getting everything they have taken for granted.Quote from: Faisal2202 on November 15, 2023, 08:13:46 AMPeople (miners) are only after money; And what are you here for?Show me proof you're not for money, ask Theymos to disable your signature!How about something else, all you people who accuse miners of being greedy and so on, you start your own decentralized pool you pay everything out of your pocket just for the sake of decentralization, and you bankrupt all the evil minersBut that would mean you would have to pay for a service you take now for granted, wow!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odohu",
      "created_time": "November 15, 2023, 09:40:50 AM",
      "body": "Quote from: hatshepsut93 on November 14, 2023, 11:38:57 PMQuote from: alani123 on November 14, 2023, 09:07:10 PMWell, for one, we're far from bitcoin having block rewards that are near zero. So saying that bitcoin having high fees is already meeting its destiny is at the very least a misrepresentation of what's happening. We aren't that far from really low rewards, like 0.4 BTC per block. Will the price be 8 times higher by that time? It's easy to say \"yes\" if you extrapolate the past performance, but extrapolating the past performance is wrong, there is no asset in this world that grows at the same rate forever. Sooner or later Bitcoin's growth will slow down and will stop compensating for the halvenings. So the effect of lower block reward on mining will happen in our lifetime. The reward will be zero in 2140 but it will become very low way before that.Are you then confirming that the fate of Bitcoin is high fees? My answer is yes, not immediately but it will eventually get their. Mining is a business and all businesses thrive on profits. When block reward hits zero, miners must find a way to remain in profits as without them there will be chaos. I don't know if this was set out ab initio by Satoshi himself, and if that be the case, it makes the whole thing complex. How do we push for mainstream adoption of Bitcoin when the fees sending a Bitcoin transaction is triple that of conventional payment system? How do one opt for Bitcoin transaction when it takes days to settle payments if the high fees are not paid? There are many things that are not so clear about the future of Bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "November 15, 2023, 10:14:06 AM",
      "body": "Quote from: stompix on November 15, 2023, 09:22:33 AMBitcoin's TPS  is 7 because of the blocksize, not the other way around!But most of Bitcoin's block which have been mined are around 1MB-2MB, if TPS isn't the reason, then why the miner didn't fill up the block?I read theoretically the maximum of Bitcoin's TPS is 27 because the block size is increased to 4MB, that's why I thought like that.Quote from: https://www.technologyreview.com/2016/02/16/162258/technical-roadblock-might-shatter-bitcoin-dreams/The researchers estimate that Bitcoin’s current design could bear at most only about 27 transactions per second, using a block size of four megabytes, without forcing a significant cut in the number of computers powering the currency, making it more centralized. There is general agreement in the Bitcoin community that the system must remain decentralized to prevent the possibility of any company or government controlling the currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "November 15, 2023, 10:18:13 AM",
      "body": "Quote from: OgNasty on November 15, 2023, 09:09:33 AMPaying for block space will always need to be a thing for Bitcoin to survive long term. The cost of that space will likely depend on the value provided. During times of calamity, I could see Bitcoin becoming very expensive to use. Maybe $100 for a transaction. Other times when block space may not be as valuable, it will cost less. This supply and demand bidding will be more and more important as block rewards are reduced. It is a speculative game for investor, trader, miner and user. It is a beauty of Bitcoin that makes it attractive and unpredictable. A market is volatile and it needs unpredictable things to continue volatile in future.Hash rate shocks, difficulty shocks, mempool congestion, spike in transaction fees and certainly we will have many news around it. It gives a space for news to play its role in this market and if a user has patience, he can enjoy better fee rates than users who don't have patience, knowledge and plan for transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "November 15, 2023, 10:31:10 AM",
      "body": "Quote from: Jawhead999 on November 15, 2023, 10:14:06 AMQuote from: stompix on November 15, 2023, 09:22:33 AMBitcoin's TPS  is 7 because of the blocksize, not the other way around!But most of Bitcoin's block which have been mined are around 1MB-2MB, if TPS isn't the reason, then why the miner didn't fill up the block?I read theoretically the maximum of Bitcoin's TPS is 27 because the block size is increased to 4MB, that's why I thought like that.Maximum refers to an ideal scenario, with every single tx being as small as possible, if every single of tx in the mempool would be 1 input 1 output we would clear the entire mempool in a day or two. TPS is a metric that derives from the block size, as I said not the other way around, as simple as it can be is:TPS = (block size/ transaction size) / block time. Increase the block size 10 times you increase the TPS 10 times, decrease the block time 10 times you increase the TPS 10 times, increase the transaction size by 100 as ordinals do you decrease the TPS by 100.The old notion of 7 TPS just means 1 MB block ~226b tx, 600 seconds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ThemePen",
      "created_time": "November 15, 2023, 11:33:28 AM",
      "body": "I appreciates your post about different opinion on what will happen with bitcoin in future. Some people think that high fees are not avoidable for bitcoin and some others people disagree.Right now at this time bitcoin still has block rewards that are not near to zero so it is not correct to say that high fee is already the destiny of bitcoin.You made a good point about the current increase in bitcoin fee influenc by NFTs and tokens that have nothing to do with bitcoin.This mean that bitcoin may not to deal with high fee in future.When it come to concern about increasing transaction space in block it is important to understand the economics involving.  Low fee can lead to more people want to make transactions which can balance things out and maybe even result in high total transaction fee in the end.By the way there are many factors to considers when talking about bitcoin future and the issue of high fee. It is important to think about the current block reward the no value transactions and possible solution deal with blockchain bloat. With looking all these factors we can get  better idea of what will happen with bitcoin in future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}