{
  "id": "topic_5445077",
  "title": "joker_josue",
  "author": "joker_josue",
  "created_time": "March 16, 2023, 12:40:29 AM",
  "content": "Hoje (15/03/2023) começou a surgir as noticias que o banco Credit Suisse está numa fase muito critica. A situação do banco já tem sido um pouco instavel a coisa de um ano, mas agora tudo esta pior, porque o maior acionsita disse que não iriam injetar mais capital no banco:Quote from: https://www.publico.pt/2023/03/15/economia/noticia/credit-suisse-derrapa-20-arrasta-banca-europeia-2042498Depois de o maior accionista do Credit Suisse ter afastado a possibilidade de injectar mais dinheiro na instituição, agravando receios quanto à sua solidez, a banca europeia está a derrapar em bolsa.Entretanto o economista Nouriel Roubin, que prévio a crise de 2008, alertou que pode ser muito difícil este banco ser resgatado.Quote from: https://www.jornaldenegocios.pt/empresas/banca---financas/detalhe/credit-suisse-pode-ser-demasiado-grande-para-ser-salvo-alerta-roubiniCredit Suisse pode ser \"demasiado grande para ser salvo\", alerta Roubini.O economista adverte que, a cair, o banco suíço poderá protagonizar um novo \"momento Lehman Brothers\".E apesar de todos os analistas, dizerem que a situação com o Credit Suisse é bem diferente do que esta acontecer com alguns bancos nos EUA, o banco pode estar a sentir os efeitos colaterais dessa situação:Quote from: https://visao.sapo.pt/exame/2023-03-15-afinal-o-que-se-passa-com-o-credit-suisse/O Credit Suisse estava “à hora errada no lugar errado”, ou seja, os seus problemas não estão relacionados com as recentes falências nos Estados Unidos mas a reação pública foi exacerbada porque os investidores estão num momento particularmente sensível e de aversão ao risco no que toca ao setor financeiro. Sendo a origem dos problemas diferente, em comum existe o facto de – para responder a grandes saídas de recursos de clientes – os bancos poderem ser forçados a desfazer investimentos próprios, eventualmente assumindo perdas.Vocês acham, que se o Credit Suisse realmente abrir falência, tudo o sistema financeiro a nível mundial vai começar a colapsar?Que impacto isso poderá ter no Bitcoin?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445077",
  "comments": [
    {
      "author": "alegotardo",
      "created_time": "March 16, 2023, 01:10:05 AM",
      "body": "Quote from: joker_josue on March 16, 2023, 12:40:29 AMVocês acham, que se o Credit Suisse realmente abrir falência, tudo o sistema financeiro a nível mundial vai começar a colapsar?Que impacto isso poderá ter no Bitcoin?Tudo oque mexe com os bancos acaba afetando  as criptos onde o Bitcoin é o que mais sofre... negativamente é claro.Em um primeiro momento, nesses \"baques\" que ocorrem tudo acaba caindo e o Bitcoin não fica para trás.Mas a longo prazo, me parece que o Bitcoin ainda é um bom refúgio para essas inseguranças dos bancos \"tradicionais\".Credit Suisse pode cair (tomara que não  ) , mas quanto ao Bitcoin tenho certeza que ele continuará firme por mais uns 10 anos (e além) e muito mais forte do que é hoje.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 16, 2023, 08:05:36 AM",
      "body": "Quote from: alegotardo on March 16, 2023, 01:10:05 AMCredit Suisse pode cair (tomara que não  ) , mas quanto ao Bitcoin tenho certeza que ele continuará firme por mais uns 10 anos (e além) e muito mais forte do que é hoje.Sinceramente, quando vejo muitos a políticos e analistas a dizer, que não vai cair, é quando eles vão cair.Vamos esperar para ver até sexta-feira. Normalmente essas noticias bombásticas só ocorrem a sexta.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "March 17, 2023, 12:19:46 PM",
      "body": "Essa noite eu sonhei que o Bitcoin ia a $7k e o pessoal da Paradigma dizia que não acreditava mais no Bitcoin. Eu fiquei realmente desesperada e pensando é isso, acabou. Vai arrumar outra coisa pra fazer. Mas ai acordei desesperada e fui ver o preço do Bitcoin e tinha subido. Essas últimas notícias tem me deixado bem aflita. Mas na última queda ai pro $20K eu estava muito puta com as stablecoins e tomei boas decisões",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 18, 2023, 12:15:10 AM",
      "body": "Quote from: Disruptivas on March 17, 2023, 12:19:46 PMMas ai acordei desesperada e fui ver o preço do Bitcoin e tinha subido. Essas últimas notícias tem me deixado bem aflita. Jovem, tens de tentar evitar ficar nesse estado. Isso não é bom.Organiza a tua vida ao máximo, para evitar ficar nesse estado de ansiedade caso coisas mais dramáticas venham a ocorrer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "March 18, 2023, 03:37:29 PM",
      "body": "Quote from: joker_josue on March 18, 2023, 12:15:10 AMJovem, tens de tentar evitar ficar nesse estado. Isso não é bom.Organiza a tua vida ao máximo, para evitar ficar nesse estado de ansiedade caso coisas mais dramáticas venham a ocorrer.Acho que minha vida está bem organizada até. Mas como além de investir em cripto, eu trabalho com o setor. Se um dia eu acordasse o Bitcoin estivesse valendo muito pouco e ninguém mais acreditasse, eu não estaria na sarjeta hahaha mas precisaria sem dúvida alguma, me reinventar um pouco. Como atualmente estou lidando bastante com a interseção de cripto com questões ambientais, sociais. Até é uma vertente de escape. Mas acho que minha escolha de me dedicar profissionalmente a cripto - e minha profissão oficial de Antropologa- acaba tendo alguns riscos mesmo. Se tu acordasse e o Bitcoin estivesse valendo $5K e ninguem mais acreditasse, não teria impacto pra ti?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 18, 2023, 04:45:05 PM",
      "body": "Quote from: Disruptivas on March 18, 2023, 03:37:29 PMSe tu acordasse e o Bitcoin estivesse valendo $5K e ninguem mais acreditasse, não teria impacto pra ti? Claro que sim... teria de ir comprar mais.  Eu não estou com esse nível de envolvimento nas cripto, então entendo perfeitamente a sua situação. Mas, por outro lado, você até melhor do que eu, sabe que existe muita coisa acontecendo, em que dificilmente seria num dia para o outro algo do género acontecer.Depois, é olhar para o que você sabe hoje. Apesar de a possibilidade de você ver todo o seu trabalho na sarjeta por der assustar, você também pode olhar para os aspeto do conhecimento que tem irá ajudar a se reinventar de uma forma muito mais rápida e positiva.Risco existe em todo o lado, mas acho que devemos evitar viver com o \"medo/receio\" que esses riscos venham acontecer.Lembra-te que mais de metade das coisas que imaginamos que venham acontecer, na realidade nunca vão acontecer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "March 18, 2023, 08:09:28 PM",
      "body": "Estou preocupado. Será que vão pegar meu dinheiro depositado em Bancos Suíços ? Lembrei daquele Meme onde o dono de um Corsa 1995 está preocupado com a taxação de grandes fortunas. Não me venham com efeito Borboleta e nem também com efeito dominó. Isso já está mais do que batido.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 18, 2023, 11:38:02 PM",
      "body": "Quote from: Paredao on March 18, 2023, 08:09:28 PMNão me venham com efeito Borboleta e nem também com efeito dominó. Isso já está mais do que batido.Nada disso, a banca esta toda pendorada por um fio, qualquer coisa vai fazer eles caírem. Uns tem mais fios e vão se aguentado, outros tem menos e vão caindo.Faz lembrar um serie/concurso coreana no Netflix: \"Physical: 100\". O primeiro jogo era os jogadores segurarem umas barras e ficarem suspensos, o ultimo a cair ganhava.A banca esta a fazer o mesmo, só estão a ver quem será o ultimo a cair.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "March 19, 2023, 01:00:05 PM",
      "body": "Fico feliz que vocês estejam tão despreocupados e gostaria que vocês estivessem certos. Há algumas analises que falam sobre a situação dos bancos brasileiros serem melhores do que a situação dos bancos americanos - exemplo é aqui pelo menos nós termos o índice de Brasileia, enquanto lá podem alavancar quanto querem- mas acho que as economias são sim bem dependentes e vivemos um momento de fragilidade por vários lados. E não acho que efeito cascata - talvez melhor aqui do que o borboleta - seja desprezivel nesse cenário. Mas, se vocês estiverem certos, fico feliz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 19, 2023, 02:06:33 PM",
      "body": "Quote from: Disruptivas on March 19, 2023, 01:00:05 PMMas, se vocês estiverem certos, fico feliz. A questão é que neste momento ninguém quer que algo parecido ao que aconteceu em 2008 volte acontecer.Se surgirem sinais reais que algo parecido esteja perto de acontecer, os governos e os bancos centrais iriam criar algum tipo de medida para conter a situação.Com a Russia em guerra com a Ucrânia, a Europa e os EUA nunca irão querer entrar numa crise profunda, pois isso só iria dificultar o seu apoio a Ucrânia.De certeza que eles tem alguma ficha guardada, para o caso de algo do género ameasse acontecer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "March 19, 2023, 11:47:19 PM",
      "body": "O UBS anunciou a compra do Credit Suisse, vem acontecendo muita coisa no setor bancário mesmo aos domingos. Todos felizes por enquanto, espero que o UBS não passe de comprador para banco em apuros daqui uns tempos pois isso vem acontecendo bastante ultimamente.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "March 20, 2023, 01:55:10 AM",
      "body": "É aquela famosa frase: \"Privatizar o Lucro e Socializar o prejuízo\": Governo da Suíça garante US$ 9,7 bi para cobertura de perdas após compra do Credit pelo UBS",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 20, 2023, 07:46:18 AM",
      "body": "Quote from: Paredao on March 20, 2023, 01:55:10 AMÉ aquela famosa frase: \"Privatizar o Lucro e Socializar o prejuízo\": Governo da Suíça garante US$ 9,7 bi para cobertura de perdas após compra do Credit pelo UBSÉ isso mesmo. E nota-se claramente atitude diferente que existe nos EUA e na Europa.Nos EUA o governo não querem saber se o banco privado cai, na Europa soam logo os sinais vermelhos e saem a correr para resolver o buraco.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "March 23, 2023, 12:40:33 PM",
      "body": "Quote from: joker_josue on March 20, 2023, 07:46:18 AMÉ isso mesmo. E nota-se claramente atitude diferente que existe nos EUA e na Europa.Nos EUA o governo não querem saber se o banco privado cai, na Europa soam logo os sinais vermelhos e saem a correr para resolver o buraco.Não tinha reparado nessa diferença nas duas situações. No final, o resgate acontece dos dois lado, né? Mas acho que como o EUA está fazendo me parece mais 'inteligente'. Em uma das situações, ocorre a proteção dos clientes, mas a instituição que deu ruim, é desligada. É obrigada a encerrar as operações. Na outra situação, uma instituição que se provou ineficiente é resgatada e outro player assume a bronca. Particularmente, acho que desligar um player ineficiente parece mais efetivo no longo prazo, pra que de fato possamos tirar aqueles que tendem a prejudicar o sistema.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "March 23, 2023, 12:56:30 PM",
      "body": "Quote from: joker_josue on March 20, 2023, 07:46:18 AMQuote from: Paredao on March 20, 2023, 01:55:10 AMÉ aquela famosa frase: \"Privatizar o Lucro e Socializar o prejuízo\": Governo da Suíça garante US$ 9,7 bi para cobertura de perdas após compra do Credit pelo UBSÉ isso mesmo. E nota-se claramente atitude diferente que existe nos EUA e na Europa.Nos EUA o governo não querem saber se o banco privado cai, na Europa soam logo os sinais vermelhos e saem a correr para resolver o buraco.Os EUA já falaram estar estudando garantir todos os depósitos bancários nos EUA. Estão literalmente socorrendo todos os bancos do país. Não achei o link sobre a notícia desse tipo mas ouvi em podcast confiável que isso já está em estudo.mas aqui já dá pra ter uma ideiahttps://istoe.com.br/tesouro-dos-eua-fed-e-fdic-garantem-acesso-integral-a-depositos-no-svb-2/A suíca já está dando bilhões e bilhões para garantir a estabilidade da UBS:QuoteO negócio é garantido por várias medidas: o UBS responde por possíveis perdas de até 5 bilhões de francos suíços; o Estado deu uma garantia de perda de 9 bilhões de francos suíços. O banco central suíço dá garantias de liquidez no valor de até 200 bilhões de francos suíços.https://www.istoedinheiro.com.br/fusao-credit-suisse-ubs-solucao-ou-agravamento/#:~:text=O%20neg%C3%B3cio%20%C3%A9%20garantido%20por%20v%C3%A1rias%20medidas%3A%20o,francos%20su%C3%AD%C3%A7os.%20Outras%20autoridades%20monet%C3%A1rias%20saudaram%20as%20medidas.Vai ser uma confusão viu! A que custo que estão salvando a economia global. Não é a toa que o bitcoin está subindo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 23, 2023, 05:37:12 PM",
      "body": "Quote from: Disruptivas on March 23, 2023, 12:40:33 PMNão tinha reparado nessa diferença nas duas situações. No final, o resgate acontece dos dois lado, né? Mas acho que como o EUA está fazendo me parece mais 'inteligente'. Em uma das situações, ocorre a proteção dos clientes, mas a instituição que deu ruim, é desligada. É obrigada a encerrar as operações. Na outra situação, uma instituição que se provou ineficiente é resgatada e outro player assume a bronca. Particularmente, acho que desligar um player ineficiente parece mais efetivo no longo prazo, pra que de fato possamos tirar aqueles que tendem a prejudicar o sistema. Nisso concordo que a ideia os EUA estão a seguir será melhor, visto que corta logo o mal pela raiz e assegura os depósitos dos contribuintes. Em relação aos investidores, tem de arcar com as perdas, porque todos os investimentos acarreta riscos, e o Estado não tem de assegurar esses riscos.Quote from: bitmover on March 23, 2023, 12:56:30 PMOs EUA já falaram estar estudando garantir todos os depósitos bancários nos EUA. Estão literalmente socorrendo todos os bancos do país. Não achei o link sobre a notícia desse tipo mas ouvi em podcast confiável que isso já está em estudo.~~Vai ser uma confusão viu! A que custo que estão salvando a economia global. Não é a toa que o bitcoin está subindo.Pois, isso é a coisa nova que os EUA estão a fazer. É indicativo que as coisas estão bem piores do que parece.Se as taxas de juro continuam aumentar como estão, não sei não se a economia não cai.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}