{
  "id": "topic_5437363",
  "title": "UmerIdrees",
  "author": "UmerIdrees",
  "created_time": "January 30, 2023, 03:59:45 PMLast edit: January 30, 2023, 04:49:13 PM by UmerIdrees",
  "content": "The account D.Bronte posted this on our local board where he offered to work for cryptocurrency exchange and will be paid a good commission.Quote from: D.Bronte on January 27, 2023, 12:04:47 PMI am a representative of a company in the field of online payments.We are looking for people in Pakistan who know how to exchange cryptocurrency and have easypaisa and Jazzcash wallets. We consider long-term relationships with our partners and can offer work for you. If you are interested and want to know details, feel free to message me in telegram: @DBronte1I contacted him on telegram to see what he offers and found that he is operating some betting websites and he needs our JazzCash And Easypaisa accounts (these are sorts of accounts which are made after KYC and people can send and receive money on them). People will deposit money in those accounts from gambling brokers on some unknown sites and they will pay us a commission of 1% of every deposit and convert those deposits to USDT using Binance.The risk here is that they are using our KYC accounts both EasyPaisa and Binance to perform all the transactions and we would be held accountable by the court of law if anything goes wrong.I had a polite conversation with him to gather as much knowledge as possible and save my local community. Here is the complete conversation.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437363",
  "comments": [
    {
      "author": "NeuroticFish",
      "created_time": "January 30, 2023, 04:19:37 PM",
      "body": "1. Please learn how to make your images smaller. Plus, you can put them one next to another if you use spaces instead of new line.2. This is not a new scam per se. There are now and then \"job offers\" for people who don't understand that giving out KYC and basically becoming \"money mule\" can easily end up with high taxes to pay, fines and even jail time.The forum is full of signs to be careful about the KYC data. Some will read, some will always ignore...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "January 30, 2023, 04:38:25 PM",
      "body": "Quote from: UmerIdrees on January 30, 2023, 03:59:45 PMThe account D.Bronte posted this on our local board where he offered to work for cryptocurrency exchange and will be paid a good commission.This is a scammer and his picture on Telegram is a stock image taken from the internet and not his real picture.Quote from: UmerIdrees on January 30, 2023, 03:59:45 PMThe risk here is that they are using our KYC accounts both EasyPaisa and Binance to perform all the transactions and we would be held accountable by the court of law if anything goes wrong.Yes, this is a great risk, as you expose your accounts on these platforms to ban and expose yourself to legal accountability, as what I also know about the terms of use of Binance is not to trade with countries and individuals subject to sanctions, and if they discover something, they will terminate your relationship with them immediately. You must check the source of the money first, and what I see is that 1% is not worth this risk. in addition to that, as you mentioned, gambling is illegal in Pakistan, so it is good that you warned the community about him.[1] https://www.binance.com/en/terms",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "January 30, 2023, 04:58:13 PM",
      "body": "Quote from: UmerIdrees on January 30, 2023, 03:59:45 PMThe account D.Bronte posted this on our local board where he offered to work for cryptocurrency exchange and will be paid a good commission.Quote from: D.Bronte on January 27, 2023, 12:04:47 PMI am a representative of a company in the field of online payments.We are looking for people in Pakistan who know how to exchange cryptocurrency and have easypaisa and Jazzcash wallets. We consider long-term relationships with our partners and can offer work for you. If you are interested and want to know details, feel free to message me in telegram: @DBronte1I contacted him on telegram to see what he offers and found that he is operating some betting websites and he needs our JazzCash And Easypaisa accounts (these are sorts of accounts which are made after KYC and people can send and receive money on them). People will deposit money in those accounts from gambling brokers on some unknown sites and they will pay us a commission of 1% of every deposit and convert those deposits to USDT using Binance.The risk here is that they are using our KYC accounts both EasyPaisa and Binance to perform all the transactions and we would be held accountable by the court of law if anything goes wrong.I had a polite conversation with him to gather as much knowledge as possible and save my local community. Here is the complete conversation.  I smell potential money laundering as what I have understood. This reminds me several years ago when someone had a similar offer for me in using my verified Paypal for this kind of scheme, but I rejected that offer knowing that it would cause a huge risk to my name especially when it comes to legal accountability.We have to take care of our integrity especially in Binance. Once you got terminated, you can never register another account with Binance again or in any other reputable exchanges. P.S. This is my first post after taking a brief hiatus for almost a month.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "January 30, 2023, 05:19:48 PM",
      "body": "It's very suspicious because If the job is real then why use someone else accounts?I have no idea about how they operate but because JazzCash And Easypaisa transactions can be reversed, you might lose your account with tremendous debt. If you agree to these terms, it is you who will be revealed to the authorities and this might be the case of laundering like cheezcarls is saying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "January 31, 2023, 12:41:22 PM",
      "body": "They are trying to acquire verified or KYCed account is an indirect way. As far as I know, buying verified accounts is banned in this forum, so there are using a more tricky way of advertising by telling members that there is a business opportunity.Regardless, who hands over their verified account to an internet stranger is nothing more than someone stupid and greedy and may end up getting in trouble with the law.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AnonBitCoiner",
      "created_time": "January 31, 2023, 03:39:15 PM",
      "body": "Quote from: bittraffic on January 30, 2023, 05:19:48 PMIt's very suspicious because If the job is real then why use someone else accounts?I have no idea about how they operate but because JazzCash And Easypaisa transactions can be reversed, you might lose your account with tremendous debt. If you agree to these terms, it is you who will be revealed to the authorities and this might be the case of laundering like cheezcarls is saying.Yes actually any kind of gambling and direct cryptocurrency related transaction are prohibited in Pakistan. This scammers will definitely misuse this kyc verified account for gambling related transactio. There will be direct approach to you from Police because he used fake profile picture and there is no way to find who is real person because we have only Bitcointalk and Telegram Username Which are difficult to detect real person.  I also contacted this person via Telegram and he offer me 3% of all transactions he get via my account. He need account with high daily and monthly limit, minimum 1 million monthly. I ask about any other services other than Gambling, he told about Binance and other forex transaction too. He deleted all chat history after I told that I am not interested. Overall This person is not trusted and should not be fool for little gain with high risk from Authority.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasog",
      "created_time": "February 05, 2023, 01:49:20 AM",
      "body": "Quote from: UmerIdrees on January 30, 2023, 03:59:45 PMI had a polite conversation with him to gather as much knowledge as possible and save my local community. Here is the complete conversation.Good that you have taken the screenshot of the whole conversation. Usually when the scammers see that they are unsuccessful in convincing us, they would delete the chat , so it can't be presented as a proof to help others, as you did here.Quote from: bittraffic on January 30, 2023, 05:19:48 PMIt's very suspicious because If the job is real then why use someone else accounts?I have no idea about how they operate but because JazzCash And Easypaisa transactions can be reversed, you might lose your account with tremendous debt. If you agree to these terms, it is you who will be revealed to the authorities and this might be the case of laundering like cheezcarls is saying.I would blame people who will take this so called \"opportunity\" to earn the money by risking their accounts and identity. If you see, you only have to give your KYC accounts and the money inflow will start automatically and you will be paid commission. You have to work for anything like bring clients etc and hence when people see easy money coming, they risk and opt to do such type of work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "February 05, 2023, 08:18:23 AM",
      "body": "Quote from: virasog on February 05, 2023, 01:49:20 AMGood that you have taken the screenshot of the whole conversation. Usually when the scammers see that they are unsuccessful in convincing us, they would delete the chat , so it can't be presented as a proof to help others, as you did here. This is not a traditional scam and you aren't investing or using your money. That's probably why the user doesn't bother to delete anything. He might even even pay you those 3% commission fees every single time. But you are the one taking all the risks. It's your name that is connected to the accounts and the money, not that of your \"partner\".Every time a deposit, withdrawal, or exchange for fiat happens, it's you who did it in the eyes of the law. Taxable events, money laundering, using illegal services (betting in Pakistan) are just some of the things you are guilty of. You take all the risk, while your \"partner\" goes home with 97% of the money. These types of offers should be avoided unless you don't care about your future at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "February 05, 2023, 09:36:40 AM",
      "body": "Just 1%? I had some people contacting in the past to convert their cash into BTC for cash and you know they are ready to offer upto 20% commission the amount we are talking about is huge so if I accepted their offer I could make few hundred thousand by simply trading for them but it's not too hard to smell what they are doing is money laundering so I refused with no further convo cause sooner you will face a law suit and probably end up in prison too so anyone never lured by attractive offers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noormcs5",
      "created_time": "February 05, 2023, 10:09:16 AM",
      "body": "Quote from: Pmalek on February 05, 2023, 08:18:23 AMEvery time a deposit, withdrawal, or exchange for fiat happens, it's you who did it in the eyes of the law. Taxable events, money laundering, using illegal services (betting in Pakistan) are just some of the things you are guilty of. You take all the risk, while your \"partner\" goes home with 97% of the money. These types of offers should be avoided unless you don't care about your future at all. Also when we see the conversation, the service provider is saying that he is not scamming but offering this work and if the OP is not interested he may leave and don't waste the time. Sadly there are many people in the world who want to earn money and they may take this risk of their accounts.Quote from: Findingnemo on February 05, 2023, 09:36:40 AMJust 1%? I had some people contacting in the past to convert their cash into BTC for cash and you know they are ready to offer upto 20% commission the amount we are talking about is huge so if I accepted their offer I could make few hundred thousand by simply trading for them but it's not too hard to smell what they are doing is money laundering so I refused with no further convo cause sooner you will face a law suit and probably end up in prison too so anyone never lured by attractive offers.We are talking about betting here and usually the betting black market consist of rich people who have a lot of money to spend and bet. Even 1% may turn out to be a good income in this case. Anyways, its a risky business and everyone is responsible for whatever they do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "February 05, 2023, 12:03:02 PM",
      "body": "Quote from: noormcs5 on February 05, 2023, 10:09:16 AMAlso when we see the conversation, the service provider is saying that he is not scamming but offering this work and if the OP is not interested he may leave and don't waste the time. That is exactly right. No scam has take place (yet). One may or may not take place. What we as a community can do is the same as what OP has done, warn people of the consequences of getting involved with something like that. If you carry something illegally across international borders and get caught, then you are guilty of smuggling. YOU are the one that's guilty because YOU did it. Someone maybe paid you or put you up to it, but you will be accountable for those actions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "February 05, 2023, 11:42:55 PM",
      "body": "This service offer is not new, it's existing anywhere online. Sure it's illegal but some take the risks just to get the commissions.Some in my locals online will be eager to accept that offer coz it has \"money\" in it. That's why online victims scams are rampant here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "February 07, 2023, 05:59:42 AM",
      "body": "Quote from: Findingnemo on February 05, 2023, 09:36:40 AMJust 1%? I had some people contacting in the past to convert their cash into BTC for cash and you know they are ready to offer upto 20% commission the amount we are talking about is huge so if I accepted their offer I could make few hundred thousand by simply trading for them but it's not too hard to smell what they are doing is money laundering so I refused with no further convo cause sooner you will face a law suit and probably end up in prison too so anyone never lured by attractive offers.In countries like Pakistan wages are low, may be that's why they start with such low commission. Some may even consider this to be an easy money without realising the pitfalls of giving up documents.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UmerIdrees",
      "created_time": "February 08, 2023, 08:07:36 AM",
      "body": "Quote from: libert19 on February 07, 2023, 05:59:42 AMQuote from: Findingnemo on February 05, 2023, 09:36:40 AMJust 1%? I had some people contacting in the past to convert their cash into BTC for cash and you know they are ready to offer upto 20% commission the amount we are talking about is huge so if I accepted their offer I could make few hundred thousand by simply trading for them but it's not too hard to smell what they are doing is money laundering so I refused with no further convo cause sooner you will face a law suit and probably end up in prison too so anyone never lured by attractive offers.In countries like Pakistan wages are low, may be that's why they start with such low commission. Some may even consider this to be an easy money without realising the pitfalls of giving up documents.Yes, Pakistan's per capita income was $1,798 in 2022 which is on the low side. With Inflation at its top and companies lowering their manpower, offer like these seem attractive. Since people do not have any other good source of income, they tend to accept these offers even knowing the consequences of such acts.Yes, we can only warn people not to accept these offers but in the long run, if we want these activities to be eliminated forever, the government should provide enough job opportunities to the people so that the public doesn't look for unfair means to earn money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}