{
  "id": "topic_5471288",
  "title": "Samlucky O",
  "author": "Samlucky O",
  "created_time": "October 23, 2023, 02:28:26 AMLast edit: October 23, 2023, 05:32:23 AM by Samlucky O",
  "content": "Good morning my people. From my discovery I dey always see plenty coin from different exchanges, wey get Bitcoin logo but different names and thesame price and some also dey less cheaper. the real Bitcoin supposed to dey different from others. Both in price and logo, Because some people ft no spot the difference. You fit go copy wrong Bitcoin address give person to send you Bitcoin only for you to discover later say na another Bitcoin address you copy. You ft dey invest for the wrong Bitcoin if care is not taken. Even etherium related coin also get that futures. Another thing also na prices in different exchanges. Bitcoin price for trust wallet and binance no be the same. Even if na thesame for USD, when you change your preference from USD to NGN the price go drop compeard to the normal exchange current price why? Shear you're expirence for this matter and wetting dey cause am?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471288",
  "comments": [
    {
      "author": "Hatchy",
      "created_time": "October 23, 2023, 03:34:43 AM",
      "body": "Quote from: Samlucky O on October 23, 2023, 02:28:26 AM You fit go copy wrong Bitcoin address give person to send you Bitcoin only for you to discover later say na another Bitcoin address you copy. You ft dey invest for the wrong Bitcoin if care is not taken. Even etherium related coin also get that futures. Op, we have just 4 different types of Bitcoin address which comes with various specific features ranging from increased privacy,speed and cheaper transaction.Bitcoin has the Taproot(bc1p) (increased privacy)Segwit or Bech32 address(bc1q) (lower transaction fee)Pay-toscript-Hash(p2SH)Legacy Address or p2pkH(higher transaction fee)Quote from: BitDane on June 25, 2023, 07:14:17 PMOne important thing to know is that one can send Bitcoin across the different Bitcoin address type since Bitcoin address are cross-compatible to any Bitcoin address type.  Knowing this we must not worry if some how we send our Bitcoin from Legacy address to Taproot address, and can't see the balance appear on the wallet, there is no need to panic because we just need to update or upgrade our wallet to a Taproot compatible wallet in order to see the balance correctly.  Besides we can always check the transaction on the blockchain if the transaction is successful Quote from: Samlucky O on October 23, 2023, 02:28:26 AM From my discovery I dey always see plenty coin from different exchanges, wey get Bitcoin logo but different names and thesame price and some also dey less cheaper. say the real Bitcoin supposed to dey different from others. Both in price and logo, Because some people ft no spot the difference. I believe you're talking about these. I've also come across them, but they're not actually Bitcoin. These are known as Bitcoin Futures or Bitcoin Contracts for Difference (CFDs). Even though they share a similar logo, they're not the same as Bitcoin their value is based on the price of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "October 23, 2023, 03:44:39 AM",
      "body": "Quote from: Samlucky O on October 23, 2023, 02:28:26 AMGood morning my people. From my discovery I dey always see plenty coin from different exchanges, wey get Bitcoin logo but different names and thesame price and some also dey less cheaper. say the real Bitcoin supposed to dey different from others. Both in price and logo, Because some people ft no spot the difference. You fit go copy wrong Bitcoin address give person to send you Bitcoin only for you to discover later say na another Bitcoin address you copy. You ft dey invest for the wrong Bitcoin if care is not taken. Even etherium related coin also get that futures. I no really understand watin you actually mean by saying coins get same or similar logo with Bitcoin and this part nai really get me confused @ \"the same price\", because as far I know since wen I don dey sell and trade crypto I never actually come across any coin wey get the price or even similar price with Bitcoin and more over there's always a distinction in all exchange with Bitcoin and other crypto assets, because you dey always see am at the forefront because it's simply unique in price difference and the closet to it nai be Ethereum which for sure get very clear difference for logo identify so this your observation me no too get am because the closet of coin wey I don come across sef wey fit fall into this category nai ne wrapedBitcoin which is different too from the original Bitcoin QuoteAnother thing also na prices in different exchanges. Bitcoin price for trust wallet and binance no be the same. Even if na thesame for USD, when you change your preference from USD to NGN the price go drop compeard to the normal exchange current price why? Shear you're expirence for this matter and wetting dey cause am?For the price difference this observation na true because all exchange get their market price cap for different coins at large so binance, bitbuy, kucoins and so many other exchange price for crypto dey different especially when if na sell you wan sell for these exchange dem through P2P because the vendor all have their price at which they are willing to trade their coins, na for you now to choose the right exchange and vendor suitable for your trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samlucky O",
      "created_time": "October 23, 2023, 04:44:18 AM",
      "body": "Quote from: DaNNy001 on October 23, 2023, 03:44:39 AMI no really understand watin you actually mean by saying coins get same or similar logo with Bitcoin and this part nai really get me confused @ \"the same price\", because as far I know since wen I don dey sell and trade crypto I never actually come across any coin wey get the price or even similar price with Bitcoin and more over there's always a distinction in all exchange with Bitcoin and other crypto assets, because you dey always see am at the forefront because it's simply unique in price difference and the closet to it nai be Ethereum which for sure get very clear difference for logo identify so this your observation me no too get am because the closet of coin wey I don come across sef wey fit fall into this category nai ne wrapedBitcoin which is different too from the original Bitcoin QuoteWetting I mean for example in trust wallet these Bitcoins them get exact Bitcoin logo like Satoshi Bitcoin but not the real Bitcoin examples are:Bbtc erc 20Wbtc ERC 20 pbtc ERC 20 btcb bep 20Btc fantom Wetting I dey talk be say if person mistakenly copy any of these bitcoin address give person to send you coin, e fit drop for your wallet? Example instead of sending Bitcoin to BTC address you go send am to Wbtc ERC 20 or Btcb BEP20 address e go come?.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "October 23, 2023, 05:03:03 AMLast edit: October 23, 2023, 05:15:26 AM by Hatchy",
      "body": "Quoteauthor=Samlucky O link=topic=5471288.msg63039218#msg63039218 date=1698036258]Wetting I dey talk be say if person mistakenly copy any of these bitcoin address give person to send you coin, e fit drop for your wallet? Example instead of sending Bitcoin to BTC address you go send am to Wbtc ERC 20 or Btcb BEP20 address e go come?.No bross, e no go work. I remember say one time like dat, I reply one thread wey resemble ur question so for forum.Quote from: Cantsay on September 14, 2023, 09:18:42 PMIf you insert a Usdt address (erc20 Or Bep20) it should show error or wrong address since they both start with “0x0”  and that of trc20 starts with “T” and bitcoin addresses are either “1”, “3”, or “bc1” so how the heck did the lady send the coin to a Usdt address?? and d tin be say all dis difrent coins dem(e.g., BTC, WBTC, BTCB) dey operate 4 different blockchains wey get e own address pattern. So if u put am instead of Bitcoin wallet address, one kind error message go pop come out.Quote from: Hatchy on September 14, 2023, 09:34:28 PMBtc to Btc address Btc to USDT address",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samlucky O",
      "created_time": "October 23, 2023, 05:48:13 AMLast edit: October 23, 2023, 05:59:55 AM by Samlucky O",
      "body": "Quote from: Hatchy on October 23, 2023, 05:03:03 AMIf you insert a Usdt address (erc20 Or Bep20) it should show error or wrong address since they both start with “0x0”  and that of trc20 starts with “T” and bitcoin addresses are either “1”, “3”, or “bc1” so how the heck did the lady send the coin to a Usdt address??This matter don happen to me before. although most of this wallet no get this address error identifier like this one wey you shear. I do same mistake on roqque. I transferred Tron from roqque to Tron address on trust wallet but never received it. Later I come confirm say the blockchaim are different something like from bep 20 to ERC 20 and I lost $9 up till today.So one need to be careful with all this things. Sometimes something you see as minor can make you loose a furtune.  lets take for example you are expecting a huge some of dollars and slight mistake you send to a wrong address and you can never get it back. If there is a way to get back coin sent to a wrong address, I will be happy if someone enlighten me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "October 23, 2023, 06:33:31 AM",
      "body": "Quote from: Samlucky O on October 23, 2023, 05:48:13 AMThis matter don happen to me before. although most of this wallet no get this address error identifier like this one wey you shear. I do same mistake on roqque. I transferred Tron from roqque to Tron address on trust wallet but never received it. Later I come confirm say the blockchaim are different something like from bep 20 to ERC 20 and I lost $9 up till today.Tron is TRC20 and its address start from T. If you want to use ERC20 or BSC network to send it but using Tron address, the address can not be valid and you will not be able to send the coin.But if you mistakenly send Tron on BSC network instead of ERC20, or you mistakenly send Tron ERC20 instead of Tron on BSC network, trust wallet support both network and you will still be able to see your coin irrespective of the blockchain that you used to send it. Although I agree with the part that you should send to the right network and to also make sure that the address you are sending to is correct.As Hatchy mentioned already, any address that is not starting from 1, 3, and bc1 are not bitcoin addresses. Bitcoin addresses start from 1, 3 or bc1.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zigabel",
      "created_time": "October 23, 2023, 03:27:44 PM",
      "body": "Quote from: Samlucky O on October 23, 2023, 02:28:26 AMdey different from others. Both in price and logo, Because some people ft no spot the difference. You fit go copy wrong Bitcoin address give person to send you Bitcoin only for you to discover later say na another Bitcoin address you copy. You ft dey invest for the wrong Bitcoin if care is not taken. Even etherium related coin also get that futures. For all this difference mata I go suggest say firstly make you dey use better exchange dem, because all the better exchange go make you understand say difference dey, from the address sef you go see the difference between d main Bitcoin and other fake once, and if na better exchange you put in a wrong address wey no b Bitcoin address dem go let you know say you don put wrong address.All this tinz na to dey dey careful when you dey do am no dey rush or hurry make you no go troway better money say na mistake because this wallet stuff no dey get name if e go once e don loss u no fit get am back except you know d owner of  d wallet so dey try dey careful and dey use only legit exchange or wallet wey dey trusted and many pipo know about dem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "October 24, 2023, 12:46:45 PM",
      "body": "Quote from: Samlucky O on October 23, 2023, 02:28:26 AMGood morning my people. From my discovery I dey always see plenty coin from different exchanges, wey get Bitcoin logo but different names and thesame price Na true wey you talk about the btc logo wey dem dey duplicate but that name own I no agree. Yes dem fit call am bitcoin but e still get wetin dem dey use take differentiate them from btc because no coin name be the same. I remember far back wey I do bounty e get coin wey dem take pay us den , the coin na btc2 dem dey call am and na $2 then. So coins dey wey carry btc name but numbers still join am at the end and their prices no be the same with btc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}