{
  "id": "topic_5438134",
  "title": "Don Pedro Dinero",
  "author": "Don Pedro Dinero",
  "created_time": "February 05, 2023, 10:12:18 AM",
  "content": "En la cola del Banco de España: “Esto sí que es bueno y no los bitcoins”En España ha habido una avalancha de gente con ahorros dispuesta a invertir en Letras del Tesoro, que dan una rentabilidad del 3%. Los inversores son principalmente mayor con ahorros, que hasta ahora los tenían en una cuenta de ahorro sin remuneración o con una remuneración menor al 1%.QuoteLa parte más animada de la cola la compone un corrillo formado por Alicia, jubilada, y otros coetáneos que deciden identificarse ante La Vanguardia como “Grupo de espera de las letras del Tesoro”. Esta facción espontánea de activistas de la deuda pública ha decidido que es buena mañana para demostrarle a los jóvenes lo que es bueno: “No queremos arriesgar los sudores de toda una vida”. “A nosotros ya no nos meten más goles”. “Esto sí que es bueno, y no los bitcoins”. “Las últimas letras del Tesoro las compré en pesetas”.Viniendo de una generación que vivió las estafas de Forum Filatélico o Nueva Rumasa, se entiende, pues el bitcoin les debe sonar parecido. Pero las Letras no son una buena inversión principalmente porque la inflación en España, medida mediante el IPC que es un indicador hecho con criterios a posta a la baja,  cerró en 2022 con un dato del 5,7%. La inflación real podemos suponer tranquilamente que es como mínimo del doble. Para los próximos años podemos tener claro que va ser superior a ese 3% que da el Tesoro. Dentro de una cartera de inversión diversificada no está mal tener una parte en letra, dando poco rentabilidad a cambio de seguridad (aunque habría que ver qué pasa si España suspende pagos), junto con otros activos como acciones de buenas empresas o bitcoin.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5438134",
  "comments": [
    {
      "author": "DdmrDdmr",
      "created_time": "February 05, 2023, 11:33:47 AM",
      "body": "Había visto el titular en algún diario, pero no me detuve en ver el detalle. La frase puede ser real o inventada, que para el caso tampoco es que sea relevante. En el fondo, bitcoin es otro tipo de producto, con componente práctica y componente de inversión en la mayoría de los casos, sabiendo que es de gran riesgo (sobre todo en el corto plazo) en lo relativo a su valor.La alta demanda de las Letras del Tesoro denotan el pauperismo en el cual están asentados los depósitos bancarios, y suelen ser algo destinado a gente muy conservadora con sus ahorros, obteniendo un importe fijo con poco riesgo. Es un perfil distinto al que juega con inversiones en bitcoin, aunque no incompatible dentro de un espectro de cartera híbrida. Por cierto, que las Letras del Tesoro no están garantizadas por el Fondo de Garantía Español. Aunque viene a ser el mismo garante realmente, no tengo claro el proceder en caso de quiebra/ simpa del estado con parte de su deuda. Dado este hipotético, el Fondo de Garantía de los Depósitos tampoco creo que llegase a ser muy solvente en situación de cataclismo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "February 06, 2023, 12:13:04 AM",
      "body": "No se pueden subestimar lo que son las diferencias generacionales, en especial en temas como lo son las finanzas,el entretenimiento e incluso la política.Yo no sabía que se podían adquirir bonos en España, pensé que era un sistema principalmente establecido de los Estados Unidos, con su sistema de deuda. Aquí en Venezuela el sistema diferente: las personas se retiran con migajas y dependen de los hijos y nietos en edades productivas. No me molestaría tener algunos dineros en bonos del tesoro para diversificar, pero mi nacionalidad, ubicación geográfica y la centralización para el reclamo de los beneficios no me hacen gracia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "February 06, 2023, 09:06:15 AM",
      "body": "El perfil de la gente haciendo cola en el Banco de España para comprar Letras del Tesoro, que se ve en los videos y noticias estos días, es más bien de jubilado, aunque a buen seguro existen perfiles más jóvenes que recurren a la contratación online (digamos que las imágenes tienen probablemente cierto sesgo generacional). Las Letras del Tesoro creo que se han de pedir en múltiplos de 1K €, algo que dista de lo que parece que hacen muchos de los jóvenes que se adentran en el ámbito de las criptomonedas, con cantidades de base netamente inferiores, y posiblemente debido a eso, siendo más amantes del riesgo en busca de mayores retornos rápidos. Supongo que también hay diferencias de decisión en base a aspectos de cultura generacional.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "February 06, 2023, 09:13:07 AM",
      "body": "LOL:QuoteComprar letras del Tesoro es lo más emocionante que se puede hacer un día de diario en Madrid a las 7 de la mañana.       Teniendo en cuenta la inflación galopante que estamos sufriendo desde el año pasado, lo que es de extrañar es que más gente que tiene sus ahorros parados en el banco y ha visto cómo le acaban de robar más de un 10% no haga nada. Porque es (casi) lo mismo que tus billetes del Monopoly sean los mismos y que las calles valgan más, a que las calles valgan lo mismo pero tus billetes valgan menos.Al final, el que gasta, porque gasta, y el que ahorra, porque sus ahorros valen menos, la acumulación de riqueza en este país cada vez va más a contracorriente. Ni qué decir a mis compadres sudamericanos, que ya deben estar desafortunadamente acostumbrados.A estas buenas personas, con tanta experiencia y conocimiento de causa, que recuerdan comprar sus primeros bonos con pesetas en los tiempos de Matusalén cuando el interés rondaba el 12%, parece que se les olvida que los cisnes negros existen, y que hace no mucho casi tuvimos que ser rescatados. Es por esta razón que, aunque repito, comprar Bonos puede que sea la manera convencional de reaccionar ante la inflación y puede que sea mejor que no hacer nada, yo no afirmaría tan categóricamente que \"Las Letras sí que son buenas y no los Bitcoins\". Aunque qué diré yo: cada uno defiende su \"rollo\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "February 06, 2023, 03:24:15 PM",
      "body": "Quote from: Porfirii on February 06, 2023, 09:13:07 AMTeniendo en cuenta la inflación galopante que estamos sufriendo desde el año pasado, lo que es de extrañar es que más gente que tiene sus ahorros parados en el banco y ha visto cómo le acaban de robar más de un 10% no haga nada.Esque este es el factor determinante, la infación...Mientrar que la inflación sea mayor que la ganancia anual que nos ofrecen estas herramientas de inversión entonces nuesta inversion representará pérdida, aun que los numeros se vean mas grandes el echo de que nos alcance para comprar menos es en donde se ve reflejada la péridad.Y si hay algo que siempre he odiado de los bancos es el echo de que si nosotros les damos nuestro dinero ellos nos ofrecen una ganancia de 3%-5% anual, pero si nosotros les pedimos dinero ellos quieres un 80% anual, así que nos la dejan caer \"doblada, con bolas y sin vacelina\"... es simplemente un abuso brutal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "February 07, 2023, 04:51:55 PM",
      "body": "Quote from: DdmrDdmr on February 06, 2023, 09:06:15 AM-snip-Es que me imagino dentro de 50 años, personas mayores atendiendo a eventos de Bitcoin y hablando de como Bitcoin les ayuda con su portafolio de jubilación, mientras que los jovenes de ese futuro imaginario ven a Bitcoin como una inversión demasiado de abuelos y ellos prefieren arriesgarse un poco más con el nuevo Boom del momento en forma de commodity: tradear esperma de cetáceos y plumas de pavo real mediante internet.Así mas o menos asumo que ven los ciudadanos en sus años dorados a Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}