{
  "id": "topic_5477055",
  "title": "Xiwick",
  "author": "Xiwick",
  "created_time": "December 08, 2023, 02:38:54 PM",
  "content": "I have btc on Electrum mobile wallet.I want to buy a hat using crypto from an online vendor.Vendor accepts several crypto currencies. It's a one time purchase. I don't want to spent more than 20 cents in transaction fees. I want the transaction confirmed within a couple of hours.What are my options?I thought of Lightning but that is still going to cost me a lot in transaction fees when opening a channel. And since this is a one time purchase, it defeats its purpose because, well, might as well just directly purchase using btc.So...what can I do?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477055",
  "comments": [
    {
      "author": "mocacinno",
      "created_time": "December 08, 2023, 02:41:28 PM",
      "body": "Nothing i'm afraid... If you don't have an already open lightning channel and you don't have any altcoins you can use, the only \"real\" sollution is to pay the large fee.But if you do pay the fee, it might be a good idear to use it to make a swap to some altcoins or to invest in opening a lightning channel, so at least the next time you can enjoy a cheap fee (by paying with a sidechain or altcoin). Bitcoin isn't economical to make small purchases at the moment, the people moving/investing in ordinals are spamming us with transactions paying larger fees, and we have to outbid them in order to get our transactions in a block.The only other thing you could do is use a free tx accelerator, but those are severely limited and offer no guarantee whatsoever. ViaBTC offers a free service, but your tx can have a maximum size of 500 bytes, a minimum fee of 10 sat/byte, cannot have unconfirmed parents,... Only 100 free accelerations/hour are accepted, and there's no guarantee whatsoever.That's the only 'trick' i know to get a cheaper transaction. There are no other shortcuts or special tricks. Miners optimze their income by selecting transactions with the highest fee per vbyte of transaction data. Mining is a business, and there's little to nothing you can do to make a miner put a suboptimal transaction (feewise) in the block they're trying to solve.There are tricks to get unconfirmed transactions confirmed, but they're allmost allways more expensive than paying the expensive fee in the first place, so they're not applicable to your case at the moment i'm afraid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LesterD",
      "created_time": "December 08, 2023, 02:46:43 PM",
      "body": "You can't avoid paying transaction fees. It's already part of the technology. What you can only do is to wait for the right time. Timing your transaction and wait for off-peak hours. This way, you will have a lower fee compared to having transactions during peak hours and editing the transaction fee to the lowest fee which will take longer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "December 08, 2023, 02:52:51 PM",
      "body": "If you really needed to avoid making high transaction fees then try and follow these few steps and advise to spend less on your transactions.1. Make weekend transactions often2. Always check the mempool congestion and the transaction fee for each category of priority.3. Make use of a wallet like electrum which support RBF in case you need to pump your fee.4. Use viabtc mining pool to boost your transaction Remember when you're making use of the mempool, it gives you the accurate rate you will be charged as transaction fee before making anyone, if it's ok by you, then you can proceed or keep the track on till you finds it less busy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "December 08, 2023, 02:56:58 PM",
      "body": "Quote from: Xiwick on December 08, 2023, 02:38:54 PMI have btc on Electrum mobile wallet.I want to buy a hat using crypto from an online vendor.Vendor accepts several crypto currencies. ~What are my options?~So...what can I do? 1) Just how you bought your bitcoins, you buy doge or ltc or usdt or whatever that shops accepts and you're paying with it.2) You wait till the fees are down, but maybe the hat will be out of stockOther than that it's the option mocacinno advised, try to make a tx was small as possible so best use one input with coin control, pay over 10sat/b so double it for sat/vb to be safe, and try to get it into Viabtc accelerator , there are 66 spots left as I speak so no rush to be in the first minute after xx:00.Theoretically ViaBtc should mine a block every two hours so it matches your other condition.Quote from: LesterD on December 08, 2023, 02:46:43 PMYou can't avoid paying transaction fees. It's already part of the technology. What you can only do is to wait for the right time. Timing your transaction and wait for off-peak hours. This way, you will have a lower fee compared to having transactions during peak hours and editing the transaction fee to the lowest fee which will take longer.Now imagine everyone would take this advice, how will things end?  Quote from: Dunamisx on December 08, 2023, 02:52:51 PMIf you really needed to avoid making high transaction fees then try and follow these few steps and advise to spend less on your transactions.1. Make weekend transactions often2. Always check the mempool congestion and the transaction fee for each category of priority.3. Make use of a wallet like electrum which support RBF in case you need to pump your fee.None of these works if there is a wave of high paying incoming transactions, none!Using RBF doesn't make you pay less money, it helps you pay the minimum required, but if that is 300sat/b what's the point of calling it cheaper?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "December 08, 2023, 03:01:35 PM",
      "body": "It is something you can not avoid. Currently transaction fee is on the high side and would take a little time to be stable. It would not be making any sense to be paying a high transaction fee for a little amount so therefore it would be nice you look into the time when the fee would be minimal to transact. Like my friend told me that he noticed that at midnight, in his country transaction fees are basically at the minimum so that is when he does transfer to make the fee very cheap for him to pay immediately and convert to stable coin. That is how he does his transaction to escape the high fee charges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "December 08, 2023, 03:07:51 PM",
      "body": "Quote from: Xiwick on December 08, 2023, 02:38:54 PMI don't want to spent more than 20 cents in transaction fees. I want the transaction confirmed within a couple of hours.It's not possible considering the current mempool situation, you may still consider the ViaBTC free transaction method but its still going to cost you around $1+ for one input and one output transaction.You can consider paying in an altcoin or need to wait for the things to be back to normal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "December 08, 2023, 03:08:12 PM",
      "body": "Quote from: Xiwick on December 08, 2023, 02:38:54 PMWhat are my options?Not many choices here, I'm afraid.  You can just send the bitcoin straight from your wallet to the seller's address.  That's the most basic option, but might not be the fastest or most affordable.  Bitcoin transaction fees can vary depending on the current network congestion, but generally youre looking at a few bucks at least and  or you might want to try some other cryptocoins that are faster and less expensive than bitcoin like litecoin, dogecoin or stablecoins like USDT.  But then you'd have to get your hands on those first, so that's not really doable unless you just happen to have some funds already parked in a crypto exchange account (and that comes with its own problems if you leave money there long-term).Quote from: Xiwick on December 08, 2023, 02:38:54 PMI thought of Lightning but that is still going to cost me a lot in transaction fees when opening a channel. And since this is a one time purchase, it defeats its purpose because, well, might as well just directly purchase using btc.That's right. For a single transaction, just paying directly with BTC is cheaper than using Lightning.  LN is better if you're gonna make a bunch of little payments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "December 08, 2023, 03:11:42 PM",
      "body": "Don't make it complicated, Bitcoin is simple, if you find a good thing or advantage in Bitcoin, use it, if not then why you need force yourself to use? it's not like fiat where every citizen must to use fiat to pay anything in their country.Since you have an option, you can use shitcoins because most of them have a cheap fees, some of them even free.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "December 08, 2023, 03:17:37 PM",
      "body": "Quote from: stompix on December 08, 2023, 02:56:58 PMQuote from: Dunamisx on December 08, 2023, 02:52:51 PMIf you really needed to avoid making high transaction fees then try and follow these few steps and advise to spend less on your transactions.1. Make weekend transactions often2. Always check the mempool congestion and the transaction fee for each category of priority.3. Make use of a wallet like electrum which support RBF in case you need to pump your fee.None of these works if there is a wave of high paying incoming transactions, none!Using RBF doesn't make you pay less money, it helps you pay the minimum required, but if that is 300sat/b what's the point of calling it cheaper?You're actually right, but when things like this happens, what should then now be the fate of every bitcoiners intending to make transactions, are we to conclude on no remedy than to embrace the fate or there is any other means to circumvent this huge pill up on transactions fee, you can remember it's getting more worse than expected and same also it's getting to last longer than expected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "December 08, 2023, 03:18:14 PM",
      "body": "Quote from: Xiwick on December 08, 2023, 02:38:54 PMI thought of Lightning but that is still going to cost me a lot in transaction fees when opening a channel. And since this is a one time purchase, it defeats its purpose because, well, might as well just directly purchase using btc.So...what can I do? Well first of all, I think you have the wrong mindset. Is it really going to be the first, last and only time that you will be using Bitcoin for a transaction? Bitcoin is the future and the BTC adoption will continue growing. So if you want to make a long term decision then you should reconsider lightning. It will save you money in the future if you continue using it. Otherwise I do not see any other option (other than perhaps sending Bitcoin between CEX accounts since crypto exchanges have a different internal system and on many exchanges it costs nothing to send Bitcoin to another account.But trusting a third party with your money is not really the purpose of Bitcoin. And since you said its on your Electrum wallet, I see no other choice than to pay the high fee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arufox",
      "created_time": "December 08, 2023, 03:20:15 PM",
      "body": "There is no way to avoid paying transaction fees because it has become a technological system. Transaction fees always change at any time, even within minutes. The only thing you can do to avoid transaction fees is wait and monitor until the transaction fees are low. High or low transaction fees are part of the technology and cannot be changed manually by you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "December 08, 2023, 03:29:05 PM",
      "body": "Quote from: Xiwick on December 08, 2023, 02:38:54 PMI have btc on Electrum mobile wallet.I want to buy a hat using crypto from an online vendor.Vendor accepts several crypto currencies. It's a one time purchase. I don't want to spent more than 20 cents in transaction fees. I want the transaction confirmed within a couple of hours.What are my options?I thought of Lightning but that is still going to cost me a lot in transaction fees when opening a channel. And since this is a one time purchase, it defeats its purpose because, well, might as well just directly purchase using btc.So...what can I do? Sad to say that these transaction fees are way out of your control depending on the network that you are using. In BTC from segwit to segwit, expect that the fees are not that cheap even if you set it to low but longer waiting times. However, if you are in a rush, then you have no choice but to pay the higher gas. Some networks that have lower transaction fees are XRP, TRX, MATIC, etc., which are probably your best bet to save in terms of gas fees. For BTC? No can do especially about expecting the confirmation in a couple of hours.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "December 08, 2023, 04:03:40 PM",
      "body": "Going by what the first comment has said, you have different options, which is either to pay the high fee, create a channel on the Lightening Network, or wait for the transaction fee to drop. But I have a suggestion for you, and before then, there's a question you have to answer. Is the bitcoin in your wallet the only fund you have in your name right now? Don't you have some cash at hand—in your safe or in the bank? If you have some money on you, then you can as well convert some fiat into any cryptocurrency that the shop is accepting apart from Bitcoin. For example, if the online shop is accepting doge coins, convert some of your local currency to doge, then go ahead and buy your hat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "December 08, 2023, 04:20:32 PM",
      "body": "Quote from: goldkingcoiner on December 08, 2023, 03:18:14 PMOtherwise I do not see any other option (other than perhaps sending Bitcoin between CEX accounts since crypto exchanges have a different internal system and on many exchanges it costs nothing to send Bitcoin to another account.But trusting a third party with your money is not really the purpose of Bitcoin. And since you said its on your Electrum wallet, I see no other choice than to pay the high fee.The exchange option you’re suggesting would also not be a right idea, it can only work if the seller or buyer actually uses that same exchange with each other than the sender can do an internal transfer which doesn’t attract any fee. But if the recipient is not using that same exchange which is mostly common since merchants do not use exchanges to receive payment then on chain transaction is required which is mostly expensive on exchanges due to their fix charges. Quote from: Dunamisx on December 08, 2023, 02:52:51 PM1. Make weekend transactions oftenLast weekend I tried to wait till Saturday midnight to see maybe there will be changes but there wasn’t, so I think this particular option is no longer viable again. Quote from: Dr.Bitcoin_Strange on December 08, 2023, 04:03:40 PM If you have some money on you, then you can as well convert some fiat into any cryptocurrency that the shop is accepting apart from Bitcoin. For example, if the online shop is accepting doge coins, convert some of your local currency to doge, then go ahead and buy your hat.A good idea but it will just be best if he pays the shop in their legal tender direct except if they do not accept fiat payment which is rare, spending in fiat will be better than going in circle of buying this Altcoins",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xiwick",
      "created_time": "December 08, 2023, 04:27:39 PM",
      "body": "Quote from: mocacinno on December 08, 2023, 02:41:28 PMNothing i'm afraid... If you don't have an already open lightning channel and you don't have any altcoins you can use, the only \"real\" sollution is to pay the large fee.Does Ethereum have the same transaction fees? Is there a mempool.space type of site to check the current trend on Ethereum ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xiwick",
      "created_time": "December 08, 2023, 04:42:05 PM",
      "body": "Quote from: Dr.Bitcoin_Strange on December 08, 2023, 04:03:40 PMGoing by what the first comment has said, you have different options, which is either to pay the high fee, create a channel on the Lightening Network, or wait for the transaction fee to drop. But I have a suggestion for you, and before then, there's a question you have to answer. Is the bitcoin in your wallet the only fund you have in your name right now? Don't you have some cash at hand?in your safe or in the bank? If you have some money on you, then you can as well convert some fiat into any cryptocurrency that the shop is accepting apart from Bitcoin. For example, if the online shop is accepting doge coins, convert some of your local currency to doge, then go ahead and buy your hat.Buying new coins is a bigger headache than purchasing the hat. If it was as simple as going to the convenience store and buying whatever coins you want as simple as it is buying gift cards (marked up reasonably) then this post wouldn't have existed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "December 08, 2023, 04:46:00 PM",
      "body": "Quote from: Xiwick on December 08, 2023, 04:27:39 PMDoes Ethereum have the same transaction fees? Is there a mempool.space type of site to check the current trend on Ethereum ?No Ethereum has its fees and it is called gas fee, the Ethereum network is the most expensive network In terms of fees, so if you’re going to consider that network I will advice you not use it because it is expensive than even bitcoin. If you’re considering using Altcoins then I will say you should go for tron network it is fast and cheap.Ethereum has its own block explorer as etherescan",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Huppercase",
      "created_time": "December 08, 2023, 04:55:44 PM",
      "body": "Quote from: Xiwick on December 08, 2023, 02:38:54 PMI have btc on Electrum mobile wallet.I want to buy a hat using crypto from an online vendor.Vendor accepts several crypto currencies. It's a one time purchase. I don't want to spent more than 20 cents in transaction fees. I want the transaction confirmed within a couple of hours.What are my options?I thought of Lightning but that is still going to cost me a lot in transaction fees when opening a channel. And since this is a one time purchase, it defeats its purpose because, well, might as well just directly purchase using btc.So...what can I do? There is no alternative to this right now than to pay the fees because the bitcoin network has become high even in weekends due to the FOMO and the ETF anticipations of speculators, but if you want to forgone decentralization and privacy, then here are some options that I know you can use to purchase an item from online vendors:Most vendors that I know used Binance pay or internal transaction to received bitcoin transaction, so I think you can ask him if he want the payment through that route, simply request for his Binance Pay ID and move your coins from spot wallet to funding and send him the bitcoin and then you can share him the transaction ID which is always an internal transaction and it cost zero fees but you have to make sure you are dealing with a legit and trust worthy vendor, if you don't trust and can't verify then don't send. Other exchanges has this features, Kucoin is there as well to use.You can also request if the vendor accept other coins, many of them accept stable coin such as USDT, you can swap your BTC to stablecoin and utilized tron blockchain for the time being because this are the only alternatives that you can use for now and if you insist on bitcoin for such, then you have to be ready to pay the fees to get your transaction to the vendor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "December 08, 2023, 04:58:24 PM",
      "body": "Quote from: Zaguru12 on December 08, 2023, 04:20:32 PMA good idea but it will just be best if he pays the shop in their legal tender direct except if they do not accept fiat payment which is rare, spending in fiat will be better than going in circle of buying this Altcoins Based on preference, it seems OP just wants to make payments in cryptocurrency, which is not necessary if the shop accepts fiat payments. Perhaps if I happen to be in OPs situation and I have two options of payment, even if Bitcoin is my most preferred means of payment, I will rather consider paying with fiat since the transaction fee for Bitcoin is too high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}