{
  "id": "topic_5453156",
  "title": "ftopikit",
  "author": "ftopikit",
  "created_time": "May 18, 2023, 05:42:38 AM",
  "content": "Сейчас во многие страны лететь проблематично. Куда поехать отдыхать , какие ваши планы на лето? Безопасно ли посещать привычные нам курорты, или у вас есть альтернативные варианты. Куда вы сами планируете этим летом?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453156",
  "comments": [
    {
      "author": "durop77",
      "created_time": "May 19, 2023, 05:31:36 AM",
      "body": "Лететь куда угодно можно, вопрос в финансах. Если вы готовы потратить иного выбор не стоит, можно и В Дубай и куда еще. Также можно и где ближе, сейчас огромный выбор отелей и сервисов на любой вкус.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ftopikit",
      "created_time": "May 19, 2023, 05:34:38 AM",
      "body": "Quote from: durop77 on May 19, 2023, 05:31:36 AMЛететь куда угодно можно, вопрос в финансах. Если вы готовы потратить иного выбор не стоит, можно и В Дубай и куда еще. Также можно и где ближе, сейчас огромный выбор отелей и сервисов на любой вкус. Да бюджет не большой, иначе не вел диалог. Хочется не потратиться и хорошо отдохнуть. В Дубай пишут там сильно жарко в такое время, смогу ли там прожить неделю не ясно. Поскольку климат для меня непривычен.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "May 19, 2023, 09:38:52 AM",
      "body": "Я тут случайно пару недель назад попал в Калининрад. Не был там ни разу до этого. Хотя всю остальную прибалтику изколесил конкретно. Мне очень понравилось. Вообщем, по сути, та же Литва-Латвия-Эстония, только по ценам Москва+20%. Авиабилеты из Москвы, если брать за несколько часов - около 5000 рублей на человека на неделю. Если брать ЗА неделю, то цена примерно в 2 раза выше. Планирую в течении примерно месяца еще раз туда сгонять, уже конкретно по музеям на неделю. На самолете. Если не рухнет в течении полета, конечно.. кто знает..,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "durop77",
      "created_time": "May 22, 2023, 05:17:12 AM",
      "body": "Quote from: bonfire66 on May 19, 2023, 09:38:52 AMЯ тут случайно пару недель назад попал в Калининрад. Не был там ни разу до этого. Хотя всю остальную прибалтику изколесил конкретно. Мне очень понравилось. Вообщем, по сути, та же Литва-Латвия-Эстония, только по ценам Москва+20%. Авиабилеты из Москвы, если брать за несколько часов - около 5000 рублей на человека на неделю. Если брать ЗА неделю, то цена примерно в 2 раза выше. Планирую в течении примерно месяца еще раз туда сгонять, уже конкретно по музеям на неделю. На самолете. Если не рухнет в течении полета, конечно.. кто знает.., Там чисто музеи, прогулки? Или что там можно посмотреть? Туда еще лететь наверное очень долго, и климат холоднее чем в Москве. Мне кажется в таких отдаленых городах мало развита туристическая ветка.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "May 22, 2023, 09:05:53 AM",
      "body": "Проще нагуглить, что там можно посмотреть. Я сам лично еще не гуглил. Как соберусь - буду думать конкретно. Лететь из Москвы вроде бы 2.5 часа. Цена билетов, если брать сегодня и на  неделю - 5000 рублей примерно. На завтра - 6 тыс. На \"через неделю\" - 10-12 тыс. По 10-12 рейсов в день. Думаю, борта летят полупустые. Климат, ИМХО, там лучше чем в Москве, потому что ближе к Европе - а Европа - это Гольфстрим. Так что кратко так. Остальное описывать слишком долго и лениво.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ftopikit",
      "created_time": "May 23, 2023, 05:56:27 AM",
      "body": "Quote from: durop77 on May 22, 2023, 05:17:12 AMQuote from: bonfire66 on May 19, 2023, 09:38:52 AMЯ тут случайно пару недель назад попал в Калининрад. Не был там ни разу до этого. Хотя всю остальную прибалтику изколесил конкретно. Мне очень понравилось. Вообщем, по сути, та же Литва-Латвия-Эстония, только по ценам Москва+20%. Авиабилеты из Москвы, если брать за несколько часов - около 5000 рублей на человека на неделю. Если брать ЗА неделю, то цена примерно в 2 раза выше. Планирую в течении примерно месяца еще раз туда сгонять, уже конкретно по музеям на неделю. На самолете. Если не рухнет в течении полета, конечно.. кто знает.., Там чисто музеи, прогулки? Или что там можно посмотреть? Туда еще лететь наверное очень долго, и климат холоднее чем в Москве. Мне кажется в таких отдаленых городах мало развита туристическая ветка.Калининград чисто походить побродить наверное, а вот море покупать это ближе Краснодарский край.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "May 24, 2023, 10:05:37 AM",
      "body": "В Турцию слетать всегда может быть бюджетно, особенно если ловить горячие предложения. Лично я в Турции суммарно за последнее время наверное уже год прожил. Как зимой, так и весной или летом или осенью. Там всегда хорошо.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "niko053",
      "created_time": "May 25, 2023, 10:47:12 AM",
      "body": "Самое оптимальное Турция, можно уложиться в 150 и неплохо отдохнуть. Если сильно далеко не хочеться, то есть и собственное Черное море. Тут бюджет разный, можно и в супер отел а можно и не сильно потратиться и в целом неплохо отдохнуть.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "May 26, 2023, 08:56:40 AM",
      "body": "150 это на какой срок? На какое число людей?  Мне кажется, что это цена на весьма шикарный отдых. Хотя за последними ценами на отельный отдых в Турции не слежу. Последний раз останавливался там в отеле лет 6 назад.А вот еще есть интересная тема. Я очень про нее подумываю. Ливан. Через Турцию. Как я понял - там все дико дешево. И малоисследовано. Лететь через Стамбул, например... вот серьезно подумываю туда сгонять этим летом-осенью...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "antiark",
      "created_time": "January 10, 2024, 10:01:52 AM",
      "body": "А я к другу на Кипр съездил с женой, он там работает с началом войны. Хорошо отдохнули, накупались, хайкингом позанимались в горах, супер!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GlacierBIT",
      "created_time": "January 19, 2024, 08:56:28 PM",
      "body": "Если еще не были на Кавказе, вам стоит туда съездить, не пожалеете. Да это не привичный отдых на югах, но в этом месте можно отлично отдохнуть и подлечиться в санаториях минеральных вод. Отличные виды на горы, свежий воздух, спокойный отдых в наше время просто необходим.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yelzin",
      "created_time": "January 22, 2024, 08:06:00 AM",
      "body": "Говоря о санатория, был лет 5 назад в Киргии в горах в таком санатории, теплые источники, супер просто!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spitogatos",
      "created_time": "January 23, 2024, 08:01:08 AM",
      "body": "А сколько сейчас Турция стоит? Реклама рекламой, а хочется услышать о реальных ценах из первых уст)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotmolodec",
      "created_time": "January 24, 2024, 09:44:47 AM",
      "body": "По возможности рвану в США на отдых, а пока деньги копятся, мечту надо воплощать",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "malayacheremsha",
      "created_time": "January 25, 2024, 07:27:37 AM",
      "body": "Куда посоветуете по России покататься? Люблю лес и горы!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}