{
  "id": "topic_5477026",
  "title": "alminor",
  "author": "alminor",
  "created_time": "December 08, 2023, 10:20:29 AM",
  "content": "When I try to pay I get message Not enough funds. You need to set a lower fee. But I have enough money on balance to send to receiver and to pay mining fee. The balance was 0.379 mbts. I had to pay 0.22. The mining fee was approximately 0.9 mbts. I wanted to pay using ETA.  Please write me, how to solve the problem when paying by ETA or static. If I do not want to pay with mempool.Regards, Alex",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477026",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "December 08, 2023, 10:33:48 AM",
      "body": "Are you sure you're using the correct unit when sending? mBtc vs BTC? If you're certain, take a look at this article, it might be due to some other reason:https://bitcoinelectrum.com/frequently-asked-questions/#why-am-i-being-told-that-i-have-insufficient-funds",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "December 08, 2023, 10:37:17 AM",
      "body": "Do you want to send 0.22 BTC or 0.22 mBTC?Even if you want to make a transaction sending 0.22 mBTC, the error message is still true. 0.379 mBTC is equal to 0.000379 BTC and assuming you want to send 0.22 mBTC, the remaining fund is only 0.000159 BTC which is not enough for paying 0.9 mBTC (or 0.0009 BTC) as transaction fee. Have you received the fund in several transactions? That's probably why you have to pay that high transaction fee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "December 08, 2023, 11:32:48 AM",
      "body": "Quote from: alminor on December 08, 2023, 10:20:29 AMWhen I try to pay I get message Not enough funds. You need to set a lower fee. But I have enough money on balance to send to receiver and to pay mining fee. The balance was 0.379 mbts. I had to pay 0.22. The mining fee was approximately 0.9 mbts. I wanted to pay using ETA.  Please write me, how to solve the problem when paying by ETA or static. If I do not want to pay with mempool.It means you don't have funds to cover the fee required that you are trying to set.You can't be sure that you have enough funds to send your 0.22mbtc even with your 0.379mbtc balance because the fee depends on the number of inputs and the number of outputs.Click the preview button in your electrum wallet which will show you the number of inputs, output, size, etc, and post the image of that to give you more explanation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "December 08, 2023, 11:42:13 AM",
      "body": "Quote from: alminor on December 08, 2023, 10:20:29 AMThe balance was 0.379 mbts. I had to pay 0.22. The mining fee was approximately 0.9 mbts. Something doesn't add up and seems there's an inconsistency with the balances and fees.  If you only had 0. 379 mbtc before sending, that wouldn't cover a 0.9 mbtc transaction fee. You should look into why Electrum is suggesting such a high fee for your transaction.  How many inputs are being used? That can sometimes drive fees up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "December 08, 2023, 11:56:22 AM",
      "body": "Quote from: alminor on December 08, 2023, 10:20:29 AMThe balance was 0.379 mbts. I had to pay 0.22. The mining fee was approximately 0.9 mbts.A transaction of 1 input and 1 output will only take 110 vbyte, and with 114 sat/vbyte as fee rate, and bitcoin at 43500, the fee should not be more than $5.45. if it is with legacy address, the fee can not be more than $10.0.9 mBTC is equal to $39.15 if bitcoin is $43500. That is too high. What can likely case in if if you have many inputs or outputs in that transaction.If you are having many UTXK count, which will lead to high inputs if you want to make transaction (like consolidation), the transaction fee will be very high. The best is to wait for the mempool to become less congested before making such transaction. Like  if you are lucky and the mempool go less congested that 1 to 2 sat/v ye transactions can get confirmed again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "December 08, 2023, 04:35:44 PM",
      "body": "Quote from: alminor on December 08, 2023, 10:20:29 AMI wanted to pay using ETA.  Please write me, how to solve the problem when paying by ETA or static. If I do not want to pay with mempool.Regards, AlexThe network is still congested it's not worth it to make a transaction today you will receive a warning like not enough funds when you set it to eta then within 10 blocks or so. If you set it to static you can pay 1 sat/vbyte but the problem is the transaction can get stuck on the mempool.So the only solution here is to wait for the network to become less congested as suggested above.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "December 08, 2023, 04:57:10 PM",
      "body": "Quote from: BitMaxz on December 08, 2023, 04:35:44 PMIf you set it to static you can pay 1 sat/vbyte but the problem is the transaction can get stuck on the mempool.Currently, the purging fee rate is more than 10 sat/vbyte for any node with default mempool size. This means that you can't broadcast a transaction with the fee rate of 1 sat/vbyte at all. Even you run your own node or you can connect to a server which allows you to broadcast such a transaction, it will likely rejected by other nodes and it can't be propagated to the network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "igor72",
      "created_time": "December 09, 2023, 10:21:39 AM",
      "body": "Quote from: alminor on December 08, 2023, 10:20:29 AMWhen I try to pay I get message Not enough funds. You need to set a lower fee. But I have enough money on balance to send to receiver and to pay mining fee. The balance was 0.379 mbts. I had to pay 0.22. The mining fee was approximately 0.9 mbts. I wanted to pay using ETA.  Please write me, how to solve the problem when paying by ETA or static. If I do not want to pay with mempool.Regards, AlexI think you are using 2fa wallet. If so, you will not be able to send funds without paying for the service. And the service costs 0.5 mbtc, so you should just disable 2fa and send your coins.To disable 2fa you need to select the corresponding option when restoring your wallet from the seed phrase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "December 09, 2023, 10:44:20 AM",
      "body": "Quote from: igor72 on December 09, 2023, 10:21:39 AMI think you are using 2fa wallet. If so, you will not be able to send funds without paying for the service. To disable 2fa you need to select the corresponding option when restoring your wallet from the seed phrase.Did you see that the amount of fee to be paid is more than the amount of bitcoin that OP want to send? So high fee like that can not be because Trustedcoin. Indo not think it is a noncustodial 2FA wallet but because of high inputs will likely be the reason.Quote from: igor72 on December 09, 2023, 10:21:39 AMAnd the service costs 0.5 mbtc, so you should just disable 2fa and send your coins.The fees are:             Batch size                     Per transaction price               Batch pricePay every 20 transactions:             0.000025 BTC/tx          0.0005 BTC totalPay every 100 transactions:     0.0000125 BTC/tx         0.00125 BTC totalhttps://trustedcoin.com/#/faq#fees",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "igor72",
      "created_time": "December 09, 2023, 11:16:29 AM",
      "body": "Quote from: Charles-Tim on December 09, 2023, 10:44:20 AMDid you see that the amount of fee to be paid is more than the amount of bitcoin that OP want to send?Yeah, my bad, I didn't pay attention to the payment amount. Thanks. I've just seen many times that users create a 2fa wallet and then don't understand why they don't have enough money.QuoteQuote from: igor72 on December 09, 2023, 10:21:39 AMAnd the service costs 0.5 mbtc, so you should just disable 2fa and send your coins.The fees are:             Batch size                     Per transaction price               Batch pricePay every 20 transactions:             0.000025 BTC/tx          0.0005 BTC totalPay every 100 transactions:     0.0000125 BTC/tx         0.00125 BTC totalhttps://trustedcoin.com/#/faq#feesI wasn't wrong here, 0.5 mBTC = 0.0005 BTC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "December 09, 2023, 08:22:20 PM",
      "body": "I believe this is the error message you got:I tried to produce the error and it seems this message appears when you want to send an amount but your total balance is not enough to cover the sent amount plus the fees. My first advice is to stop using ETA as a fee estimator option. Instead, use mempool since it's more accurate. Just make sure the \"Target\" is bellow 1 MB from tip for a fast confirmation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "December 10, 2023, 12:53:06 PM",
      "body": "Quote from: khaled0111 on December 09, 2023, 08:22:20 PMI believe this is the error message you got:I tried to produce the error and it seems this message appears when you want to send an amount but your total balance is not enough to cover the sent amount plus the fees. I guess OP got the error when he tried to bump (increase) fee.Electrum has two Method options when increase fee: Preserve payment or Decrease payment. To have automatic math for a transaction fee and avoid the error, choose Decrease payment. The option will decrease an amount of your payment and add more satoshi to transaction fee. The first option will keep your initial sending amount, but will need more satoshi from your wallet for transaction fee. If your wallet does  not have enough bitcoin, it will trigger the error.My bitcoin transaction is not confirming. What can I do?QuoteMy first advice is to stop using ETA as a fee estimator option. Instead, use mempool since it's more accurate. Just make sure the \"Target\" is bellow 1 MB from tip for a fast confirmation. Some tips on 3 options in Electrum wallet in my topic.Minimize your transaction fee with Electrum wallet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "December 11, 2023, 06:24:21 AM",
      "body": "Quote from: tranthidung on December 10, 2023, 12:53:06 PMQuote from: khaled0111 on December 09, 2023, 08:22:20 PMI tried to produce the error and it seems this message appears when you want to send an amount but your total balance is not enough to cover the sent amount plus the fees. I guess OP got the error when he tried to bump (increase) fee.khaled0111 is correct, it's just that he used the Android version which shows a quite different message.For reference, here's how it looks like in desktop version:And here's what it looks like if you've set a excessive fee in \"increase fee\" window:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "December 11, 2023, 07:53:16 AM",
      "body": "Quote from: khaled0111 on December 09, 2023, 08:22:20 PMMy first advice is to stop using ETA as a fee estimator option. Instead, use mempool since it's more accurate. Just make sure the \"Target\" is bellow 1 MB from tip for a fast confirmation. If this does not work, the error may be due to trying to spend from inputs that have not been confirmed. Open Tools, then Preferences, and make sure that this option is not activated “Spend only confirmed coins”.Then create a new transaction with a higher fee than the previous transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "December 11, 2023, 08:39:18 AM",
      "body": "Quote from: Yamane_Keto on December 11, 2023, 07:53:16 AMIf this does not work, the error may be due to trying to spend from inputs that have not been confirmed. Open Tools, then Preferences, and make sure that this option is not activated “Spend only confirmed coins”.Since the version 4.4.0, there is no \"Spend only confirmed coins\" option in preferences.Now we have that option in the window that pops up after clicking on \"Pay\" button. In the case of using the android version of electrum, we have \"Spend unconfirmed\" option in preferences.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "December 11, 2023, 09:20:20 AM",
      "body": "Quote from: hosseinimr93 on December 08, 2023, 10:37:17 AM0.379 mBTC is equal to 0.000379 BTCOP's probably already got everything he needs as far as an answer, but I don't think it's too far off topic to mention that the above statement (no fault to you, hosseinimr93) proves why mBTC is a stupid unit to express an amount of bitcoin in.  It's worse than Roman numerals IMO as it forces your mind to do unnecessary calculations when it's so much clearer to use either BTC or sats.And by the way, the network fees!  I'm wondering when all the bitcoin accelerator threads are going to start popping up like they did a few years ago when the network was congested as all hell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "December 12, 2023, 01:15:41 AM",
      "body": "Quote from: The Sceptical Chymist on December 11, 2023, 09:20:20 AMOP's probably already got everything he needs as far as an answer, but I don't think it's too far off topic to mention that the above statement (no fault to you, hosseinimr93) proves why mBTC is a stupid unit to express an amount of bitcoin in.  It's worse than Roman numerals IMO as it forces your mind to do unnecessary calculations when it's so much clearer to use either BTC or sats.Ye and that brings too much confusion on new electrum users, like people ask if they can receive BTC to their \"mBTC electrum wallet\"[1], asking like it's another kind of Bitcoin without knowing it's just the same just smaller unit.  Sometimes i get confused it too and will use some online converter to know that what i said is correct.[1] https://www.reddit.com/r/BitcoinBeginners/comments/kqt2zz/can_i_receive_btc_in_my_mbtc_electrum_wallet/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "December 12, 2023, 01:20:38 AM",
      "body": "Quote from: PX-Z on December 12, 2023, 01:15:41 AMYe and that brings too much confusion on new electrum users, like people ask if they can receive BTC to their \"mBTC electrum wallet\"[1], asking like it's another kind of Bitcoin without knowing it's just the same just smaller unit.  Sometimes i get confused it too and will use some online converter to know that what i said is correctNewbies must learn about Bitcoin units.[Did you know?] Bitcoin Table of UnitsUnit converters can help but I would like to use BTC, satoshi and if only one more unit, it is mBTChttps://bitcoindata.science/bitcoin-units-converterhttps://www.btcsatoshi.com/Scammers can abuse Bitcoin units to scam newbies",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "December 12, 2023, 08:52:21 AM",
      "body": "So if you're trying to pay 0.22 mbtc (= 0.00022 BTC) and your wallet balance is 0.379 mbtc (= 0.000379 BTC), then you're going to have to set the lowest possible fee which is 1 sat/byte, in order to be able to cover the transaction fee.Then try increasing the fee by 1 sat/byte after that, and do it repeatedly until you run out of funds in the wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}