{
  "id": "topic_5436851",
  "title": "Synchronice",
  "author": "Synchronice",
  "created_time": "January 26, 2023, 10:00:46 AM",
  "content": "I don't know if you know about this but there is one great open-source project that helps people to become web developers for free and it's way better than any paid bootcamp.I think that if anyone is interested into it, should visit the following link => https://www.theodinproject.com/aboutSo, why did I create this thread?Blockchain development, bitcoin and cryptocurrencies are a very popular things today. There are a lot of people who want to build career into it. Some wants to become a developer, some wants to accept it as a means of payment and so on.As far as I see, this forum has some reserves.I think it will benefit the whole society if this forum spends tiny amount of money to support the development and management of the project similar to TOP (The Odin Project) that will focus on bitcoin, blockchain and cryptocurrencies and that will help people to have basics that will help them to land a job and build career.Also, the forum where 21th century's financial revolution has begun and the forum where the most innovative and gamechanger currencies were created, shouldn't look like the 90's web page. Blame me if you want but this is the truth. Theymos shouldn't let this forum down!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436851",
  "comments": [
    {
      "author": "Saisher",
      "created_time": "January 26, 2023, 12:54:23 PM",
      "body": "Quote from: Synchronice on January 26, 2023, 10:00:46 AMAlso, the forum where 21th century's financial revolution has begun and the forum where the most innovative and gamechanger currencies were created, shouldn't look like the 90's web page. Blame me if you want but this is the truth. Theymos shouldn't let this forum down!What forum software do you want bitcointalk to have the SMF software that Bitcointalk is using was created in 2002 its not a 90's kind of webpage QuoteSimple Machines Forum (SMF) is an open-source forum script used to build powerful online communities. It was created in 2002 I believe the developers choose SMF because of its compatibility with software and create additional functionalities like what we have right now, its just your opinion I'mok with SMF and very comfortable using it than any other forum softwareQuoteSimple Machines Forum (SMF) is an open-source forum script used to build powerful online communities. It was created in 2002 by a team of volunteers as a fork of the popular YaBB bulletin board software. Since then, SMF has become one of the most popular forum software solutions available, used by hundreds of thousands of websites around the world.SMF is designed to be easy to use and manage. It has a powerful WYSIWYG editor that makes it simple to create and edit posts, along with a range of other features that make it easy to manage a forum. The software also makes it easy to customize the look and feel of the forum with a wide range of themes, templates and plugins.SMF is also highly secure. All data is stored in a secure database and the software is regularly updated with the latest security patches. It also uses an advanced user authentication system to ensure only authorized users can access the forum.The software is also very flexible. It supports a range of different languages, allowing users to create a multilingual forum. It also features a range of powerful features, including support for BBCode, custom themes, user polls, calendar events, and more.SMF is also very extensible. It supports a range of third-party plugins and themes, allowing users to customize the functionality of their forum. It also has a powerful API that makes it easy to integrate SMF into existing websites and applications.Overall, SMF is a powerful and easy-to-use forum script. It is highly extensible, secure, and feature-rich, making it an ideal choice for creating and managing online communities. If you’re looking for a powerful and flexible forum script, SMF is definitely worth considering.Pros:1. Easy to use and install2. Highly customizable3. Versatile and feature-rich4. Highly secure5. Optimized for SEO6. Support for multiple languages7. Integrates with other softwarehttps://www.gigarocket.net/blog/the-top-5-best-free-php-forum-scripts/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "January 26, 2023, 02:01:49 PM",
      "body": "theymos has toyed with the idea of some sort of Bitcoin related course before, which would tie in with the forum potentially via badges if I remember correctly. Whether or not that's actually planned or was just theymos spitballing ideas, remains to be seen. Although, it would probably take a whole lot of effort to actually get that off the ground, and if you wanted a open source approach that would have to be managed fairly closely, and the right piece of software to get that off the ground.  It'd probably be a good idea, but ultimately it's up to theymos on whether that's something they want to implement themselves or get an external company to implement that. I can't imagine it would get implemented into SMF version of this forum though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "January 26, 2023, 08:30:46 PM",
      "body": "I do not know, but this forum should be a place for discussion about Bitcoin and to help in the development of society, and from here I do not see that the role of the forum is other than to be a place where people interested in Bitcoin meet, it is not a care home for Bitcoin nor a wealth fund for them.Bitcoin started as an ambitious project without financial support and continued to compete with companies without that support until the first developer no longer existed from the early days, and this means that if you want to make a change, start now even if there is not enough support, or even people to help you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "January 26, 2023, 08:39:36 PM",
      "body": "People who are interested in programming will find this useful but I think there are a lot of platforms to learn to program for free or with a little amount of money.Quote from: Synchronice on January 26, 2023, 10:00:46 AMAlso, the forum where 21th century's financial revolution has begun and the forum where the most innovative and gamechanger currencies were created, shouldn't look like the 90's web page. Blame me if you want but this is the truth. Theymos shouldn't let this forum down! So, using old forum software is a bad thing to do? There is no question this forum system is all good, it just needed some tweaks or two.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "January 26, 2023, 08:58:49 PM",
      "body": "Quote from: Welsh on January 26, 2023, 02:01:49 PMtheymos has toyed with the idea of some sort of Bitcoin related course before, which would tie in with the forum potentially via badges if I remember correctly.If this could implemented, it would be a great addition to the forum. Bitcoin knowledge is all over the place, but what I learn from this forum is better content than I find in most online courses and articles and it operates in a decentralized manner where each user has a voice and can use that.A structured course organized by the forum and maybe run with supporting information from the members here would be a great addition.#- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "January 26, 2023, 10:07:33 PM",
      "body": "Quote from: un_rank on January 26, 2023, 08:58:49 PMIf this could implemented, it would be a great addition to the forum. Bitcoin knowledge is all over the place, but what I learn from this forum is better content than I find in most online courses and articles and it operates in a decentralized manner where each user has a voice and can use that.What you can find on this forum is good, however it's anything, but structured. I was in support of the courses idea, and think if it's executed well, it would be brilliant. I've always said that Bitcoin's stumbling block really is its ease of use. Whether or not the forum is the best place for that is another thing. I imagine, it would need specific software for it, and would have to be hosted on a subdomain to keep it separate from the SMF installation. That's the only way I se that working. Tying in with badges if they do get implemented would also encourage existing users, as well as new to complete the course.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seek3r",
      "created_time": "January 26, 2023, 10:16:54 PM",
      "body": "Quote from: Welsh on January 26, 2023, 10:07:33 PMQuote from: un_rank on January 26, 2023, 08:58:49 PMIf this could implemented, it would be a great addition to the forum. Bitcoin knowledge is all over the place, but what I learn from this forum is better content than I find in most online courses and articles and it operates in a decentralized manner where each user has a voice and can use that.What you can find on this forum is good, however it's anything, but structured. I was in support of the courses idea, and think if it's executed well, it would be brilliant. I've always said that Bitcoin's stumbling block really is its ease of use. Whether or not the forum is the best place for that is another thing. I imagine, it would need specific software for it, and would have to be hosted on a subdomain to keep it separate from the SMF installation. That's the only way I se that working. Tying in with badges if they do get implemented would also encourage existing users, as well as new to complete the course. But is that really necessary? All real Bitcoiners who are really interested in Bitcoin already meet in the right subboards like Discussion, Technical & Development, .. ? I'm just afraid that people will get lost and post stuff there just because of the badges.  That would be comparable to the Gambling section, which mainly consists of spammers for the Bounty signatures.Maybe my thought is too exaggerated but it would be nice if the quality of the posts in the above mentioned subboards does not suffer from the introduction of the batches. Have any comments been made about the implementation of this course?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "January 26, 2023, 10:20:51 PM",
      "body": "Quote from: seek3r on January 26, 2023, 10:16:54 PMBut is that really necessary? All real Bitcoiners who are really interested in Bitcoin already meet in the right subboards like Discussion, Technical & Development, .. ? I'm just afraid that people will get lost and post stuff there just because of the badges.  That would be comparable to the Gambling section, which mainly consists of spammers for the Bounty signatures.Maybe my thought is too exaggerated but it would be nice if the quality of the posts in the above mentioned subboards does not suffer from the introduction of the batches. Is it necessary? Probably not. However, we'd probably have a dedicated section for disucssion related to the courses, and would be subject to the same moderation as other sections. Maybe, not a dedicated moderator, but potentially users who have put the courses together maybe. I don't know, most of this is speculation on my behalf. There hasn't been much said about it for a while now, and not a whole lot of detail was included. It was simply an idea. Badges would likely only be given for completing a course. So, it wouldn't rely on posting or anything like that. Therefore, it shouldn't create too much of a problem in terms of spam issues. Quote from: seek3r on January 26, 2023, 10:16:54 PMHave any comments been made about the implementation of this course?You can read about it here: https://bitcointalk.org/index.php?topic=4609442.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seek3r",
      "created_time": "January 26, 2023, 10:30:29 PM",
      "body": "Quote from: Welsh on January 26, 2023, 10:20:51 PMIs it necessary? Probably not. However, we'd probably have a dedicated section for disucssion related to the courses, and would be subject to the same moderation as other sections. Maybe, not a dedicated moderator, but potentially users who have put the courses together maybe. I don't know, most of this is speculation on my behalf. There hasn't been much said about it for a while now, and not a whole lot of detail was included. It was simply an idea. Badges would likely only be given for completing a course. So, it wouldn't rely on posting or anything like that. Therefore, it shouldn't create too much of a problem in terms of spam issues. This are good points. An extra area would make sense for follow-up questions or the like.Of course, that one would not necessarily have to write posts for the courses makes sense to me. My mistake, that was not very thoughtful.  Quote from: Welsh on January 26, 2023, 10:20:51 PMYou can read about it here: https://bitcointalk.org/index.php?topic=4609442.0Thanks for that. I think I didn't find this thread because it's even older than my account here, but after a first quick look there it seems to me anyway that the idea has already been discarded.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "January 26, 2023, 10:33:57 PM",
      "body": "Quote from: seek3r on January 26, 2023, 10:30:29 PMThanks for that. I think I didn't find this thread because it's even older than my account here, but after a first quick look there it seems to me anyway that the idea has already been discarded.  Yeah, it was a long time ago when it was first brought up. There's been some discussion about it here, and there since then though. It could potentially be implemented in the future, who knows. theymos seems to have a todo list, that is established based on a priority based system. So, who knows. It'll probably require a lot of work though, and ideally it wouldn't be just theymos contributing to it. I don't know how many users would be interested in contributing either, at least to the standard it would need to be. Potentially, that's why the badges would be a good idea. Something like; \"Course Instructor\", but the courses would have to be reviewed before being made public, and therefore the badge also only granted when it's deemed good enough for public consumption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seek3r",
      "created_time": "January 26, 2023, 10:41:46 PM",
      "body": "Quote from: Welsh on January 26, 2023, 10:33:57 PMYeah, it was a long time ago when it was first brought up. There's been some discussion about it here, and there since then though. It could potentially be implemented in the future, who knows. theymos seems to have a todo list, that is established based on a priority based system. So, who knows. It'll probably require a lot of work though, and ideally it wouldn't be just theymos contributing to it. I don't know how many users would be interested in contributing either, at least to the standard it would need to be. Potentially, that's why the badges would be a good idea. Something like; \"Course Instructor\", but the courses would have to be reviewed before being made public, and therefore the badge also only granted when it's deemed good enough for public consumption. As I said, the idea is really good, but if I'm honest, I don't believe it will be implemented.You have already mentioned the points - there is a lot of hard work involved. Searching for material for courses, writing courses and then having them reviewed/controlled by 3rd parties.There are surely other and especially smaller things that could be done by theymos with much less effort. But the past has shown that changes are reduced to the minimum.  I would still be happy about such courses under the right conditions. Let's see...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bullrun2024bro",
      "created_time": "January 26, 2023, 10:56:22 PM",
      "body": "Quote from: Synchronice on January 26, 2023, 10:00:46 AM~The forum already has a long-term project that won't be finished any time soon. I honestly really doubt we need another one.Quote from: seek3r on January 26, 2023, 10:41:46 PMYou have already mentioned the points - there is a lot of hard work involved. Searching for material for courses, writing courses and then having them reviewed/controlled by 3rd parties.There are surely other and especially smaller things that could be done by theymos with much less effort. But the past has shown that changes are reduced to the minimum.  I would still be happy about such courses under the right conditions. Let's see...Agree. Before looking for a new project that consumes additional resources, time and money one should perhaps first focus on more urgent points if one want to improve Bitcointalk. I mean there are plenty of points on the table... just thinking of the new forum software or a mobile version that lets you create posts on the go.Or maybe a new local board to start off easy?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "January 27, 2023, 07:07:09 PM",
      "body": "Quote from: Mahirap on January 26, 2023, 08:39:36 PMSo, using old forum software is a bad thing to do? There is no question this forum system is all good, it just needed some tweaks or two. I empathized the visual part but of course old software is not good, it needs to be updated but I don't say to change SMF, leave it if it's no problem to keep high security and gives possibility to integrate what you wish.Quote from: bullrun2020bro on January 26, 2023, 10:56:22 PMThe forum already has a long-term project that won't be finished any time soon. I honestly really doubt we need another one.What's the long-term project? Do you mean new forum software? Please don't tell me that the aim is to widespread the message of bitcoin because what I say is directly in touch with that.This forum has a lot of intelligent members, great history and resources. We can do it open source like The Odin Project.QuoteThis website and the curriculum it hosts are completely open source. That means anyone can work on new features or fix existing bugs on the website. This also extends to the curriculum itself, anyone can work on new lessons, add new resources and improve existing lessons.The Odin project would not be possible without the hard work of contributors from all across the world. If you're interested in helping us make Odin better please find out how to contribute.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "January 27, 2023, 07:21:20 PM",
      "body": "If you consider the forum well, you will doscover that it was purposely on targeted on bitcoin and how it could engage others across the world, I don't think introducing another implementation aside the forum software that has been in place will be a good idea in considering the blockchain technology and the cryptocurrency network in all, bitcoin will always be as it has been and if there should be an improvement then not about the forum here, there have been bip's already in place to the bitcoin itself but the forum here should be left as it is for now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomiles1",
      "created_time": "January 27, 2023, 07:51:08 PM",
      "body": "Quote from: Doan9269 on January 27, 2023, 07:21:20 PMIf you consider the forum well, you will doscover that it was purposely on targeted on bitcoin and how it could engage others across the world, I don't think introducing another implementation aside the forum software that has been in place will be a good idea in considering the blockchain technology and the cryptocurrency network in all, bitcoin will always be as it has been and if there should be an improvement then not about the forum here, there have been bip's already in place to the bitcoin itself but the forum here should be left as it is for now. Yeah you made some point though, but there is what they called diversity, despite the its purpose for bitcoin (cryptocurrencies) and blockchain at large that doesn't mean it should be limited to only bitcoin rather trying extend and buy more technicalities and implements variety of happenings around world. This forum has been known for a greater place and for that should be open for discoveries, and to further expand and educate people in all areas of life rather than just focusing on bitcoin, blockchain development and discussion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "January 29, 2023, 03:24:11 AM",
      "body": "I find bitcointalk's basicness unique. I remember surfing this forum on Nokia keypad phone, it worked well. Modern look requires much resources, whether it be from development view or from consumers pov. Most members here are privacy centric. You could disable js, bitcointalk will work as if nothing happened. Modern looks don't. Quote from: Synchronice on January 26, 2023, 10:00:46 AMAlso, the forum where 21th century's financial revolution has begun and the forum where the most innovative and gamechanger currencies were created, shouldn't look like the 90's web page. Blame me if you want but this is the truth. Theymos shouldn't let this forum down!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "January 29, 2023, 07:45:15 AM",
      "body": "Quote from: Cryptomiles1 on January 27, 2023, 07:51:08 PMYeah you made some point though, but there is what they called diversity, despite the its purpose for bitcoin (cryptocurrencies) and blockchain at large that doesn't mean it should be limited to only bitcoin rather trying extend and buy more technicalities and implements variety of happenings around world. This forum has been known for a greater place and for that should be open for discoveries, and to further expand and educate people in all areas of life rather than just focusing on bitcoin, blockchain development and discussion.So far, this forum's diversification has extended far beyond bitcoin (cryptocurrencies) and blockchain. There are many projects and discussions in this forum that discuss other aspects of life, especially in other boards, and I believe this is what keeps the majority of people active here despite the fact that they have little knowledge of blockchain technology and are only here to trade. To keep their account active and interactive in this forum, they participate in other discussions while paying attention to trading-related discussions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tread93",
      "created_time": "January 31, 2023, 04:15:46 PM",
      "body": "Quote from: Synchronice on January 26, 2023, 10:00:46 AMI don't know if you know about this but there is one great open-source project that helps people to become web developers for free and it's way better than any paid bootcamp.I think that if anyone is interested into it, should visit the following link => https://www.theodinproject.com/aboutSo, why did I create this thread?Blockchain development, bitcoin and cryptocurrencies are a very popular things today. There are a lot of people who want to build career into it. Some wants to become a developer, some wants to accept it as a means of payment and so on.As far as I see, this forum has some reserves.I think it will benefit the whole society if this forum spends tiny amount of money to support the development and management of the project similar to TOP (The Odin Project) that will focus on bitcoin, blockchain and cryptocurrencies and that will help people to have basics that will help them to land a job and build career.Also, the forum where 21th century's financial revolution has begun and the forum where the most innovative and gamechanger currencies were created, shouldn't look like the 90's web page. Blame me if you want but this is the truth. Theymos shouldn't let this forum down!The forum has a considerable amount of Bitcoin Under Management (BUM) I wonder what else Theymos has planned - right now it pays the salaries of the administration (Mods, etc.) at least I think its a paid position might not be salary but they get some sort of stipend or the likes of that. It would be EPIC to see some larger investment from the forum into something that would make bitcoin stronger and benefit strictly bitcoin, or its users. I'm sure they're working on a lot of things.....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}