{
  "id": "topic_5402118",
  "title": "uchegod-21",
  "author": "uchegod-21",
  "created_time": "June 10, 2022, 07:17:03 PM",
  "content": "Since my coming to this forum, I have joined 3 campaigns in this order; Gamdom managed by yahoo62278, Duelbits and Roobet managed by Hhampuz. I have seen that there are different rules of campaigns according to different managers. Then I have these questions to ask, who knows, the answers might be helpful to many who may become campaign managers in the future. Question OneWho decides the amount to pay participants according to ranks?The company or the manager. Because some campaigns pay a certain rank higher and some pay same rank lower even if they have almost same budget. Question TwoWho decides the ranks to hire,  and why such decisions?I ask because I have seen managers like yahoo62278 and Royse777 hire member ranks. Could  the reason for the decision be to encourage low rank members or they discovered that low rank members have more zeal to work. Question Three How do the companies that launch campaigns here make money? Is there any kind of SEO embedded in the signature that indexes their sites in search engines? Question Four Having 10 quality posters making a total of 100 quality posts a week and having 20 shit posters making 500 shit posts per week, which one produces more result for the company. I ask because I have seen company like Fortunejack paying members $100 to make 20 posts, ChipMixer paying members $300 to make 50 posts. But a company like Stake.com will have to make a user post like 80 to 90 posts to get $100. (I do not mean that stake members posts shits). Just to buttress my question. Question FiveSome managers do not require number of merits earned in applying in their campaign while many require.Is merit no longer the measure for quality? Question sixIs it a crime in the forum that after applying for a campaign, the user sends the campaign manager pm to give the manager more reasons to hire him. Which he cannot do in the application thread in order not to destruct the application process. Question seven Post Bursting!If user A makes 3 posts per day for 7 days, that will be 21 posts. User B makes 10 posts per day for the last 3 days of the week, making it 30 posts. Who among them is beneficial to the company they promote and why? Question eightIs there a rule that says a user must wait for such amount of time after making a post in order to make another. If yes, why? Question nineAre there boards that gives more result to companies and are there boards that doesn't give results at all.I ask because;Best_Change doest like posts in gambling.Yahoo62278 doesn't like posts in Beginners and Help board. Some campaigns don't want posts in local board. Some doesn't like Altcoin boards.Some doesn't accept Politics and society. Why this discrepancy? I wasn't sure of the board to post this, but I believed it's forum related and as such Meta fits better. Thanks all!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402118",
  "comments": [
    {
      "author": "SatoPrincess",
      "created_time": "June 10, 2022, 07:28:34 PM",
      "body": "Quote from: uchegod-21 on June 10, 2022, 07:17:03 PMSince my coming to this forum, I have joined 3 campaigns in this order; Gamdom managed by yahoo62278, Duelbits and Roobet managed by Hhampuz. I have seen that there are different rules of campaigns according to different managers. Then I have these questions to ask, who knows, the answers might be helpful to many who may become campaign managers in the future. Question OneWho decides the amount to pay participants according to ranks?The company or the manager. Because some campaigns pay a certain rank higher and some pay same rank lower even if they have almost same budget. I think the manager decides how much to pay the different ranks in his campaign according to the money allocated to him by the company.  Quote from: uchegod-21 on June 10, 2022, 07:17:03 PM Question TwoWho decides the ranks to hire,  and why such decisions?I ask because I have seen managers like yahoo62278 and Royse777 hire member ranks. Could  the reason for the decision be to encourage low rank members or they discovered that low rank members have more zeal to work. The campaign manager decides the ranks to hire, I think. Like you said yahoo62278 and Royse777 create opportunities for member ranks to participate in their campaigns. I think member ranks are not popular in signature campaigns because they can’t wear avatar. Plus managers are careful of who represent the company",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "June 10, 2022, 07:40:57 PM",
      "body": "Move it to Service Discussion. It has nothing to do with \"META\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "June 10, 2022, 08:48:33 PM",
      "body": "Quote from: uchegod-21 on June 10, 2022, 07:17:03 PMSince my coming to this forum, I have joined 3 campaigns in this order; Gamdom managed by yahoo62278, Duelbits and Roobet managed by Hhampuz. I have seen that there are different rules of campaigns according to different managers. Then I have these questions to ask, who knows, the answers might be helpful to many who may become campaign managers in the future. I believe the answer to almost all of your questions is basically the same: Who is paying decides what kind of advertisement he wants.Some of them trust the manager to make the decision for them. But i will try to answer one by one:Quote from: uchegod-21 on June 10, 2022, 07:17:03 PMQuestion OneWho decides the amount to pay participants according to ranks?...Question TwoWho decides the ranks to hire,  and why such decisions?The budget is limited. They may prefer to have less quality posts or less complex signature for less money, but more SEO as the signature is carried by many low rank for the price of one high rank member.QuoteQuestion Three How do the companies that launch campaigns here make money? Is there any kind of SEO embedded in the signature that indexes their sites in search engines? Mostly SEO. Also, many of the services here advertised cannot be adversities in google or facebook, because casinos/mixers are banned from advertising there.QuoteQuestion Four Having 10 quality posters making a total of 100 quality posts a week and having 20 shit posters making 500 shit posts per week, which one produces more result for the company. Obviously, a high quality post will give more visibility, as they have more views. Good posts are often clicked in google searches, for example.QuoteQuestion FiveSome managers do not require number of merits earned in applying in their campaign while many require.Of course it is. Not 100% and not infalible, but a member who earned 1 merit in 3 months is most likely a shitposter.QuoteQuestion sixIs it a crime in the forum that after applying for a campaign, the user sends the campaign manager pm to give the manager more reasons to hire him. Which he cannot do in the application thread in order not to destruct the application process. Question seven Post Bursting!If user A makes 3 posts per day for 7 days, that will be 21 posts. User B makes 10 posts per day for the last 3 days of the week, making it 30 posts. Who among them is beneficial to the company they promote and why? Question eightIs there a rule that says a user must wait for such amount of time after making a post in order to make another. If yes, why? all those rules try to prevent shitposting. QuoteQuestion nine[/bAre there boards that gives more result to companies and are there boards that doesn't give results at all.Mostly SEO. a casino certainly prefer his ads in a Gambling discussion than in an economics board.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "June 10, 2022, 09:21:00 PM",
      "body": "Signature campaigns are effective, as with any advertisement. For example, name me the services that have signature campaigns right now. I bet the highest paying ones came into your mind first, and you know exactly what service they offer. That's effective marketing. I've received messages of newer users asking about the service I've advertised in my signature. It works. I mean, I could probably name you all the obsolete signatures over the last five years, so even if they aren't still operating, they've imprinted themselves into my brain. Even if a user hasn't registered the advertisement consciously, next time they need that type of service, it'll likely get pinged in their mind. That's the beauty of marketing. You'll also see signature campaigns have a trial period, and a lot of them maybe even the majority of them continue longer than that initial period, that probably tells you all you need to know on how it's effecting their numbers.As for the other questions, I mean they're hiring you for a job, they know their target audience, and they pick who, and where their advertisement gets seen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "June 11, 2022, 04:46:39 AM",
      "body": "Quote from: uchegod-21 on June 10, 2022, 07:17:03 PMQuestion OneQuestion TwoThe final decision must be coming from the company. But the manager must have a lot of input in the discussion knowing that he/she has more knowledge in terms of how campaigns in the forum usually run.QuoteQuestion Three Signature campaigns are marketing campaigns. The companies are promoting their business in the signatures. Their business makes money. QuoteQuestion Four The former I suppose, but visibility probably matters a lot as well, especially if it's sustained for a long period of time.QuoteQuestion FiveIt hasn't been the measure of quality. There are myriads of reasons why a post is merited. Quality is just one of them.QuoteQuestion sixA crime, not. Extremely annoying and therefore frowned upon, most probably. QuoteQuestion seven It highly depends on the quality of posts, but 7-day posting must be giving more visibility for the company than 3-day posting.QuoteQuestion eightI don't think there is, but spamming could also mean making a number of posts with very short intervals. Not to mention that responding to a discussion oftentimes presupposes that OP as well as the other replies are properly read and well-taken into account, and an amount of research is done. Normally, a well-thought of and reviewed response can't be made in a matter of seconds. QuoteQuestion nineBest_Change doest like posts in gambling.I don't know where you got this other than the fact that gambling threads are normally mega threads and BestChange doesn't want posts to be made beyond the 5th page, which they already consider as spam. Anyway, a casino probably gains a lot lesser by being exposed in political discussions than in gambling discussions. So that's probably why boards and sections matter. N.B.: I've never been a campaign manager. These are all opinions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "June 11, 2022, 05:58:29 AMLast edit: June 11, 2022, 06:09:33 AM by yahoo62278",
      "body": "QuoteQuestion OneWho decides the amount to pay participants according to ranks?The company or the manager. Because some campaigns pay a certain rank higher and some pay same rank lower even if they have almost same budget. The decision on how much to pay is up to the company, but most let the manager make the rates according to the weekly budget. It also depends on how many users the company wants to hire. 1 company may be ok with 20 users and a $2000 weekly budget whereas another company wants more exposure on the forum and they want 50 users with a $2000 weekly budget. That's why you see a difference in pay per rank.QuoteQuestion TwoWho decides the ranks to hire,  and why such decisions?I ask because I have seen managers like yahoo62278 and Royse777 hire member ranks. Could  the reason for the decision be to encourage low rank members or they discovered that low rank members have more zeal to work. The company and manager discuss the advantages of which ranks to hire. I like to let companies get a few extra users for cheap even though they cannot wear an avatar. At the same time it makes users not feel like its gonna be 100 years before they reach full member rank. Since the introduction of the merit system, users feel like it takes forever to earn enough merits for the full member rank(which is not true if you're a decent poster). QuoteQuestion Three How do the companies that launch campaigns here make money? Is there any kind of SEO embedded in the signature that indexes their sites in search engines? Think about it man.QuoteQuestion Four Having 10 quality posters making a total of 100 quality posts a week and having 20 shit posters making 500 shit posts per week, which one produces more result for the company. I ask because I have seen company like Fortunejack paying members $100 to make 20 posts, ChipMixer paying members $300 to make 50 posts. But a company like Stake.com will have to make a user post like 80 to 90 posts to get $100. (I do not mean that stake members posts shits). Just to buttress my question. The definition of \"shit post\" varies from manager to manager. Even users in chipmixer are shitposters at times.(yea I said that) Some people believe that the more a companies name is seen, the better it is for the company. Some believe the more well known names a company hires the better it is for said company. Some just want their name to be seen some on the forum but cannot afford thousands per week for months. I personally feel like asking for 80-90 posts per week is a bit much. Even 50 is a bit much. Companies should be happy with 20-25. Allowing more then that just invites users to post spam to get more pay. Seems like when a company wants a large quota, people suddenly have an opinion about everything. Lower the quota they're allowed and magically most who had opinions on everything chill out. It's also worth it to mention that these companies that allow a user to post a large amount of posts weekly, do not force a user to max out. They hope that users post like normal and offer quality, but cannot do anything but remove a spammer if they deem a user is spamming for pay.QuoteQuestion FiveSome managers do not require number of merits earned in applying in their campaign while many require.Is merit no longer the measure for quality? Getting merit IMO means nothing. You can buy that shit if you look hard enough.(I have never bought a merit for the record) Some managers like to use it  as a requirement to stay in the campaign, maybe they feel it makes them look better or users are good posters. I think NOT.QuoteQuestion sixIs it a crime in the forum that after applying for a campaign, the user sends the campaign manager pm to give the manager more reasons to hire him. Which he cannot do in the application thread in order not to destruct the application process. You pm me asking for a slot and i'll use that as my reason to not hire you, unless you are someone well known on the forum. You apply like everyone else and wait to see if you got in. Managers all have a different opinion on this. QuoteQuestion seven Post Bursting!If user A makes 3 posts per day for 7 days, that will be 21 posts. User B makes 10 posts per day for the last 3 days of the week, making it 30 posts. Who among them is beneficial to the company they promote and why? Burstposting!!!!!!  If you are a user that makes 3 posts a day for 7 days and make those 3 posts in 1 minute per day, depending on the content i'll likely allow it. You might be a user in a shit area with spotty internet or some other restriction, so I try to sympathize. Now, if you are a fucking shithead who makes their quota in 2 days spamming the discussion boards 5 minutes a day with 25 posts, i'll remove you from a campaign in a heartbeat and pay you 0.It's obvious who burstposts trying to get paid, or has multiple accounts with quotas to meet each week. I'm sorry if you have shitty life circumstances, but this forum is not your bank where you need 20 accounts in a sig campaign each week.QuoteQuestion eightIs there a rule that says a user must wait for such amount of time after making a post in order to make another. If yes, why? There is no written rule, but most managers like to see a gap in posting. (This ties in with burstposting as well) If you are in a campaign and you make all your posts in 1 day(lets say everyone made all their posts in the 1st day of the week), what happens to the advertisement you are wearing? The answer is IT DISAPPEARS TO PAGE 5 IN 1 DAY, because all these other companies have users replying in the same threads you posted in and noone will see that ad til the next week. Basically the company just wasted their money for 1 day of advertising and 6 days of dead time.QuoteQuestion nineAre there boards that gives more result to companies and are there boards that doesn't give results at all.I ask because;Best_Change doest like posts in gambling.Yahoo62278 doesn't like posts in Beginners and Help board. Some campaigns don't want posts in local board. Some doesn't like Altcoin boards.Some doesn't accept Politics and society. Why this discrepancy? This is solely at the managers discretion. Companies make some rules and some companies just trust the manager. I should probably remove the beginners and help restriction because that board is bitcoiners helping other bitcoiners. I have seriously considered banning the trading discussion board, bitcoin discussion board, gambling discussion board, and altcoin boards as I fell that's where most of your spammers are located, but I will not be that strict.Hopefully this answers most of your questions. If my responses pissed anyone off, shit happens. I gave what I think are honest answers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "June 11, 2022, 06:06:26 AM",
      "body": "Quote from: uchegod-21 on June 10, 2022, 07:17:03 PMQuestion Three How do the companies that launch campaigns here make money? Is there any kind of SEO embedded in the signature that indexes their sites in search engines?I don't have any involvement in managing SEO-related jobs, but I believe a signature campaign can help a brand acquire traction with the public. To back this up, other users with SEO experience often agree that having their website or business shown as a signature counts as a \"backlink\"[1]. Therefore, it increases traffic, which may lead to a potential player/user who will pay for the services.Quote from: uchegod-21 on June 10, 2022, 07:17:03 PMQuestion Four Having 10 quality posters making a total of 100 quality posts a week and having 20 shit posters making 500 shit posts per week, which one produces more result for the companyBoth can yield results. However, quality posts are strongly encouraged in any forum or community, which can obviously generate a buzz that, perhaps, because this person positively contributes to the growth of the community, everything posted or linked with this person is trustworthy.On the contrary, spreading the brand throughout the forum, regardless of quality, may have favorable benefits because it is exposed to a larger audience. I'm not sure, but I have a gut sense that gamblers who visit bitcointalk don't usually care about quality; as long as the brand is exposed, people will sign up for it.Quote from: uchegod-21 on June 10, 2022, 07:17:03 PMQuestion FiveSome managers do not require number of merits earned in applying in their campaign while many require.Is merit no longer the measure for quality? It is still one factor that determines a good poster. From what I've seen, campaigns that don't require merit may be some pointless ICO bounties or a campaign that considers a quality post that isn't constrained only to merit in which some of the sig. camps you see here fall into.Quote from: uchegod-21 on June 10, 2022, 07:17:03 PMQuestion sixIs it a crime in the forum that after applying for a campaign, the user sends the campaign manager pm to give the manager more reasons to hire him. Which he cannot do in the application thread in order not to destruct the application process.It isn't, but in a business/professional setting, soliciting the hiring manager for application approval is considered unethical. And this applies to signature campaigns as well. Really, if you are not a shitposter, then the quality of your post should automatically reflect in your post history, pm'ing the manager would most likely cause a nuisance in proving yourself especially if the aspects of so-called \"quality\" isn't reflected.I did not answer other questions because they are self-explanatory, and some of them require a campaign manager for an accurate answer.[1] Signature campaigns and some discussion about seo",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "June 11, 2022, 11:12:32 AM",
      "body": "Quote from: uchegod-21 on June 10, 2022, 07:17:03 PMSince my coming to this forum, I have joined 3 campaigns in this order; Gamdom managed by yahoo62278, Duelbits and Roobet managed by Hhampuz. I have seen that there are different rules of campaigns according to different managers. Then I have these questions to ask, who knows, the answers might be helpful to many who may become campaign managers in the future. Question OneWho decides the amount to pay participants according to ranks?The company or the manager. Because some campaigns pay a certain rank higher and some pay same rank lower even if they have almost same budget. Question TwoWho decides the ranks to hire,  and why such decisions?I ask because I have seen managers like yahoo62278 and Royse777 hire member ranks. Could  the reason for the decision be to encourage low rank members or they discovered that low rank members have more zeal to work. Question Three How do the companies that launch campaigns here make money? Is there any kind of SEO embedded in the signature that indexes their sites in search engines? Question Four Having 10 quality posters making a total of 100 quality posts a week and having 20 shit posters making 500 shit posts per week, which one produces more result for the company. I ask because I have seen company like Fortunejack paying members $100 to make 20 posts, ChipMixer paying members $300 to make 50 posts. But a company like Stake.com will have to make a user post like 80 to 90 posts to get $100. (I do not mean that stake members posts shits). Just to buttress my question. Question FiveSome managers do not require number of merits earned in applying in their campaign while many require.Is merit no longer the measure for quality? Question sixIs it a crime in the forum that after applying for a campaign, the user sends the campaign manager pm to give the manager more reasons to hire him. Which he cannot do in the application thread in order not to destruct the application process. Question seven Post Bursting!If user A makes 3 posts per day for 7 days, that will be 21 posts. User B makes 10 posts per day for the last 3 days of the week, making it 30 posts. Who among them is beneficial to the company they promote and why? Question eightIs there a rule that says a user must wait for such amount of time after making a post in order to make another. If yes, why? Question nineAre there boards that gives more result to companies and are there boards that doesn't give results at all.I ask because;Best_Change doest like posts in gambling.Yahoo62278 doesn't like posts in Beginners and Help board. Some campaigns don't want posts in local board. Some doesn't like Altcoin boards.Some doesn't accept Politics and society. Why this discrepancy? I wasn't sure of the board to post this, but I believed it's forum related and as such Meta fits better. Thanks all!1. Literally the manager as far as I have seen but it varies depends on the budget allocated by the company.2. The same as above, 3. Some signature embed the codes in it to see the results and decide whether they want to continue the promotion or try other ways.4. Quality is better than quantity.5. Merit is not only the measure of a quality poster in my opinion.6. Yes, because its kind of taking a shortcut but it won't help in anyway while backfire to most of the cases.7. No manager encourages post bursting bit making more number of posts in short time can't be considered as post bursting as well if the post is quality enough, when someone intentionally doing it to meet the post requirement to get paid maybe removed after few warnings m8. No, but you can't typically make post which make sense in very short time gap.9. It depends on what kind of service the campaign is promoting, if its related to gambling then obviously they give more prefer post in gambling section but its not mandatory unless its mentioned in the rules but it doesn't stop you from posting from those boards, it simply won't counted for payments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "June 11, 2022, 07:07:56 PM",
      "body": "I believe yahoo62278 already gave you the best answer that you need to know. So yea, everything is similar to most campaigns. Everything decides by the company and manager. Sometimes a company has some requirements that the manager has to follow. Sometimes manager provides the best option for the companies and they mix it with their requirements. Every manager wants to give their best so they have a few rules to make the campaign effective. Doesn't necessary all manager's rules will be the same. Some decisions come in real-time, and always doesn't have an explanation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uchegod-21",
      "created_time": "June 11, 2022, 10:40:11 PM",
      "body": "Thank you everyone that contributed and answered my questions. Especially yahoo62278 for answering base on your managerial experience. Also Welsh, for making me know the real concept of signature campaign. I must confession I learnt alot from this thread.Thanks to Little Mouse for letting me know that this is the appropriate board for this post. I have not posted here before.Thanks to the moderator that moved the topic to this board.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "June 11, 2022, 10:51:44 PM",
      "body": "Quote from: uchegod-21 on June 10, 2022, 07:17:03 PMSince my coming to this forum, I have joined 3 campaigns in this order; Gamdom managed by yahoo62278, Duelbits and Roobet managed by Hhampuz. I have seen that there are different rules of campaigns according to different managers. Then I have these questions to ask, who knows, the answers might be helpful to many who may become campaign managers in the future. Question FiveSome managers do not require number of merits earned in applying in their campaign while many require.Is merit no longer the measure for quality? It is still but there are quality posts that I have seen that do not have merits attached to those posts and it is in the wisdom of managers based on your posting behavior why they will hire youQuoteQuestion sixIs it a crime in the forum that after applying for a campaign, the user sends the campaign manager pm to give the manager more reasons to hire him. Which he cannot do in the application thread in order not to destruct the application process. I don't see any reason why it is and why you should not send a message to the bounty manager,  if the bounty manager is accommodating and did not state in his bounty thread that bounty applicants should not message him you can send him a message you can start by congratulating him and request that you be included, in my case I message some managers but Sujonali for me is one very accommodating manager.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "June 12, 2022, 03:15:48 PM",
      "body": "Quote from: yahoo62278 on June 11, 2022, 05:58:29 AMThe definition of \"shit post\" varies from manager to manager. Even users in chipmixer are shitposters at times.(yea I said that)I would not agree that any of the participants (current) in the CM campaign are shitposters because in that case they would be removed (as was the case in the past), and it would be easy to replace them with new members given the number of interested whenever 1 or 2 spots open. In addition, any post that does not meet the criteria of a good/quality/meaningful post in the opinion of the manager will not be paid in the end.What is true is that not all managers have the same criteria when it comes to shitposts, but still these criteria are at the highest possible level when it comes to CM, although I leave everyone the right to have their own opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uchegod-21",
      "created_time": "June 12, 2022, 06:57:39 PM",
      "body": "Quote from: Lucius on June 12, 2022, 03:15:48 PMQuote from: yahoo62278 on June 11, 2022, 05:58:29 AMThe definition of \"shit post\" varies from manager to manager. Even users in chipmixer are shitposters at times.(yea I said that)I would not agree that any of the participants (current) in the CM campaign are shitposters because in that case they would be removed (as was the case in the past), and it would be easy to replace them with new members given the number of interested whenever 1 or 2 spots open.The shit posting in this context isn't habitual as I understand. Some circumstances might make someone become a shit poster for a week, a day or even on a few number of posts. That quality isn't expected to be there always, especially when someone has nothing to contribute but is obliged to complete post quota.It is not easy to be saying almost same thing for years, it's either you are bored or have nothing new to add. But this cannot be said of anyone with skills and deep knowledge of bitcoin and other cryptocurrencies. Then, at some points, everyone's post would be below standard.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LTU_btc",
      "created_time": "June 12, 2022, 08:31:17 PM",
      "body": "I won't be able to answer you better than manager of campaigns did, but I'll try to give my point of view:1. It's agreement between company and manager. Before launching campaign they discuss rates according to budget and length of campaign.2. Again, it's agreement between manager and company. Users with Member rank is hired more rarely because their signature is less visible because of limitations and they can't wear avatar.3. They don't make money here, they trying to attract new customers. Some campaigns put tracking tags in signatures, there is some SEO things, like backlinks. Also, they attract users indirectly, similar like ads on TV or billboards in the streets. Maybe user won't click on signature, but if he will see that ad every day, it will stuck in his mind and maybe one day he will try that service.4. In terms visibility you go with shitposts. But such campaign won't be such effective. Personally, I doubt that I will click on signature which is promoted by complete shitposters. Without prejudice, which signature is more likely to get click: post made by 1xbit shitposter or proper post made by Chipmixer participant?5. Merit is just one of criteria. Manager can judge about quality of posts without looking how much merit user had earned.6. Not a crime, but not advised. It won't increase your chances to get accepted, it can work only in negative way. You shouldn't do more than asked in form of application.7. It depends on content of posts, but in general, if you post less, but for whole week, rather than reaching quota in 3 days, camapign will get more visibility.8. Don't forget that forum have time gap restriction between poss for different rank. If we don't talk about burstposting, gaps between posts should be reasonable long enough for best visibility.9. First, it's about target audience. For example, BestChange isn't related with gambling, so, why they would need posts in gabling board. Local boards is ignored because it's more complicated for manager to check quality of posts without knowing language. And some local boards isn't active enough, so, it wouldn't be cost effective to pay for posts there without getting much visibility. Boards like Altcoins or Politics and society is ignored because low quality of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uchegod-21",
      "created_time": "June 14, 2022, 09:50:34 PM",
      "body": "Quote from: LTU_btc on June 12, 2022, 08:31:17 PM3. They don't make money here, they trying to attract new customers. Some campaigns put tracking tags in signatures, there is some SEO things, like backlinks. Also, they attract users indirectly, similar like ads on TV or billboards in the streets. Maybe user won't click on signature, but if he will see that ad every day, it will stuck in his mind and maybe one day he will try that service.This is great. I have thought about this for long, how they are able to generate money to pay weekly. I already got the idea of some SEO things. But your example of TV or billboards adverts explained it all. There's nothing so special than exposure and publicity. Quote from: LTU_btc on June 12, 2022, 08:31:17 PMWithout prejudice, which signature is more likely to get click: post made by 1xbit shitposter or proper post made by Chipmixer participant?The more reason I was kind of confused. I am very sure that if the companies make their money from only clicks from this forum, 1xbit won't be having customers and must have gone bankrupt by now. It it obvious that they don't make their money from members of this forum.Quote from: LTU_btc on June 12, 2022, 08:31:17 PM8. Don't forget that forum have time gap restriction between poss for different rank.I can relate because when I was a newbie, I got caught up by this time wait period. I believe it has been extended for me as my rank grew.Quote from: LTU_btc on June 12, 2022, 08:31:17 PMLocal boards is ignored because it's more complicated for manager to check quality of posts without knowing language. Cool good point here. Thanks for these great answers. Quote from: LTU_btc on June 12, 2022, 08:31:17 PMI won't be able to answer you better than manager of campaigns did, but I'll try to give my point of view:You have already done noble. Thanks so much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "June 15, 2022, 03:02:05 AM",
      "body": "Quote from: uchegod-21 on June 14, 2022, 09:50:34 PMI have thought about this for long, how they are able to generate money to pay weekly.Why, what was your idea of advertising or marketing, that it will directly generate revenue? In a business' financial book, advertisements, promotions, and other marketing activities and events mean expenses rather than income. Signature spaces are rented as ads spaces in a signature campaign. The company that is renting signature spaces from users here incur costs. But that's part of their overall expenses because they want their business to be known, to be popular; they need to attract users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "June 17, 2022, 08:11:45 AM",
      "body": "Signature campaigns are a marketing activity and therefore those who want to advertise will calculate some account movement analyzes before starting to send money to the people who advertise.Chipmixer campaign focuses on mixing bitcoins, so you will find that they do not care about active members of the altcoins section.Some gambling campaigns favor active members in gambling boards.Crypto exchanges/ NFT/ Defi want more posts in altcoins.As for the payments, the campaigns pay them in exchange for obtaining members with high-quality posts.Those high-quality posts force the average user to stop and read it, which makes him see the signature and then may decide to click on it or use it in the future if he needs such a service.Assignment of ranks is always linked to campaign continuity. Campaigns with more money will prefer more members with higher ranks, and those with less money. Instead of paying $200 to one account, you can get 20 lower-ranked accounts.Merit is not considered a measure, but it is a filter to identify members with low quality posts, meaningFewer merits means a higher probability that your posts will be of lower quality. The opposite is not true.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "June 17, 2022, 10:25:08 AM",
      "body": "Quote from: Maus0728 on June 11, 2022, 06:06:26 AMQuote from: uchegod-21 on June 10, 2022, 07:17:03 PMQuestion Three How do the companies that launch campaigns here make money? Is there any kind of SEO embedded in the signature that indexes their sites in search engines?I don't have any involvement in managing SEO-related jobs, but I believe a signature campaign can help a brand acquire traction with the public. To back this up, other users with SEO experience often agree that having their website or business shown as a signature counts as a \"backlink\"[1]. Therefore, it increases traffic, which may lead to a potential player/user who will pay for the services.the signature ads' impact on SEO is good, but it doesn’t have to be the main target.I would like to emphasize here more the help of signature campaigns in creating a brand and awareness of it. all of us who come to the forum every day and read various discussions, cannot \"hide\" from the eye many signature advertisements. after some time, it becomes very recognizable.An obvious example is a Chipmixer campaign and promotion. as far as I know, they are promoted only on this forum, their .com domain is removed from Google, so any backlink or SEO building does not mean much. but mostly all forum users know about them and what they do. if we were to ask users, which mixer comes to mind first, I have no doubt it would be Chipmixer.in the end, they set aside the largest amount for signatures over the years, they certainly wouldn't do it without making a profit from the business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DarkStar_",
      "created_time": "June 18, 2022, 05:00:02 AM",
      "body": "Quote from: Lucius on June 12, 2022, 03:15:48 PMQuote from: yahoo62278 on June 11, 2022, 05:58:29 AMThe definition of \"shit post\" varies from manager to manager. Even users in chipmixer are shitposters at times.(yea I said that)I would not agree that any of the participants (current) in the CM campaign are shitposters because in that case they would be removed (as was the case in the past), and it would be easy to replace them with new members given the number of interested whenever 1 or 2 spots open. In addition, any post that does not meet the criteria of a good/quality/meaningful post in the opinion of the manager will not be paid in the end.What is true is that not all managers have the same criteria when it comes to shitposts, but still these criteria are at the highest possible level when it comes to CM, although I leave everyone the right to have their own opinion.There are definitely people who make bad posts at times in every campaign (including CM), both intentionally or unintentionally. People aren't perfect - maybe someone is lazy one week but really wants to fill their post quota, so they make some bad posts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}