{
  "id": "topic_5401853",
  "title": "johhnyUA",
  "author": "johhnyUA",
  "created_time": "June 08, 2022, 07:42:59 PMLast edit: June 17, 2022, 06:00:45 PM by johhnyUA",
  "content": "Hello guys! If you're watching news, you know that Russia had invaded my country (Ukraine). Most of what I'm doing now is to buy high-tech military equipment, like Night Vision Devices or Thermal monoculars for our military. There no big problem with Thermal vision, it's don't need any license to export. Couldn't say the same about NVD devices, because they're highly regulated item (it's enough funny fact, tho). In USA, for example: \"Basic rule here is “DO NOT”. Everything regarding export or even testing on US soil is prohibited. As a foreigner even looking through a Gen 3 device is not allowed. Export of Gen 3 is only allowed to Mil/LE with export license and even then there’s an FOM limit to these export IITs\" source: https://actinblack.com/us/laws-and-regulation/Even 2+ gen NVD is hard to export, this is ITAR controlled item, you need to obtain export license. But i've found that in Canada is much more easier to buy such things (2+ gen is easy exportable). I could order such nvd device to my friends in EU, but here is one small problem : I don't want to pay EU VAT The reason is that NVD device costs around 2500-3000 dollars and 20 % vat will result in additional 500-600 dollars, which can't be spent on some other equipment, like a full loaded plate carrier for a soldier. As you see, this is not the problem of my greediness, more like i want to spent limited recources with the biggest efficiency.  So, closer to biz: I need someone, who will buy this item in Canada for me, will obtain permit to export in the Export Controls Division of Foreign Affairs, Trade, and Development Canada and will send this device to my friends in EU country (for obvious reasons i will not tell it here). In this case such device is VAT free (gift). How we could do this: If you're trusted community member, i can send all needed amount of money directly to you. If not - we will use the escrow, i ll cover escrow interest fee. I'm not propose money, it's like voluenteer job, to help ukrainian soldiers.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401853",
  "comments": [
    {
      "author": "coolcoinz",
      "created_time": "June 08, 2022, 10:52:31 PM",
      "body": "Quote from: johhnyUA on June 08, 2022, 07:42:59 PMsend this device to my friends in EU country Why don't you send them the money and they can buy an NV scope in the EU? It took me like 10s to find a used gen 3 NV (PVS-18) for sale at a local online marketplace. Why go for all that trouble trying to buy it yourself and export it when you can get a cheaper used one and make it get to whoever needs it faster, safer and for a comparable price to a new one from Canada + shipping? It's an expensive piece. Would be a shame if it got returned by customs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beerwizzard",
      "created_time": "June 09, 2022, 05:21:10 AMLast edit: June 09, 2022, 05:34:04 AM by Beerwizzard",
      "body": "Just kind reminder that people need to consider OP's trust history before dealing with him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotwica666",
      "created_time": "June 09, 2022, 05:46:03 AM",
      "body": "Quote from: Beerwizzard on June 09, 2022, 05:21:10 AMJust kind reminder that people need to consider OP's trust history before dealing with him.Thanks Sherlock. OP also wrote that escrow could be used to secure the transaction. Unless you don't know what that means ..However, I myself would like to know why Canada and not a country in the EU?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "icopress",
      "created_time": "June 09, 2022, 05:52:19 AM",
      "body": "Quote from: Beerwizzard on June 09, 2022, 05:21:10 AMJust kind reminder that people need to consider OP's trust history before dealing with him.I can vouch for him in this case, or act as an escrow (with zero commission). I mean, the red tags of this user are not entirely true, since I played poker at the same time with \"Kvanko\" and \"johhnyUA\" and I can say with confidence that these are two different people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "johhnyUA",
      "created_time": "June 09, 2022, 06:17:52 AM",
      "body": "Quote from: coolcoinz on June 08, 2022, 10:52:31 PMWhy don't you send them the money and they can buy an NV scope in the EU? It took me like 10s to find a used gen 3 NV (PVS-18) for sale at a local online marketplace. Compare prices in EU and in Canada, please. Both EU and Canada manufacturers use for their devices tubes from Photonis. But in Canada the same device would cost 2000-2300 usd and in EU - 2600 or more. And it's much more harder to avoid VAT in EU zone. And yeah, except some expensive devices, both EU manufactured NVD has worse IP rating. Ordinary Canadian tube has a rating of IPX6 or IP67 and in EU it's like IPX5 or IP65. Quote from: coolcoinz on June 08, 2022, 10:52:31 PMWhy go for all that trouble trying to buy it yourself and export it when you can get a cheaper used oneI'm not sure about quality of used devices. NVD has a limited lifetime and it's hard to count for how much exactly it was used. And yeah, main reason: used ones are regulated in the same way as new. Quote from: coolcoinz on June 08, 2022, 10:52:31 PMWould be a shame if it got returned by customs.Yep, this is my main fear. But i hope i choosed proper EU country which allows import of gen2+ devices with no problem Quote from: Beerwizzard on June 09, 2022, 05:21:10 AMJust kind reminder that people need to consider OP's trust history before dealing with him.Do you see in my trust any feedback related to biz and deals with other people?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}