{
  "id": "topic_5461016",
  "title": "Fivestar4everMVP",
  "author": "Fivestar4everMVP",
  "created_time": "July 25, 2023, 02:14:34 PM",
  "content": "Hi everyone..So some how, i discovered that there are some forum members who are periodically deleting tens of hundreds of their previous posts/comments, supposedly for no other reason other than to keep their post count low, probably to match the number of merits they have earned, or keep their post count at a little bit higher average, what ever their main motive for doing this is, I don't know specifically, but my guess is that, they may think or consider it that other forum users, or maybe campaign managers, may consider them spammers if they have a lot of posts, maybe in the tens of thousands and not many merits earned to back that number of posts up, this is true ?I know of two or three accounts that have engaged in this act of deleting their own previous post, I've thought about why they do this and nothing else comes to mind except that which I've expressed above, i am not going to mention their usernames since this thread is not about them, but me personally asking if this is an ideal thing to do, i know there is no rule restricting users from deleting their previous posts when they feel like it, but I don't know why I feel doing such is a cheating on other honest forum members, as well as campaign managers who might believe you to be a quality poster based on your low posts count and merit earned, not knowing that you are just an average poster like most users of the forum, that deleting previous post is what has kept your post counts down..What do you guys think or make of this?, its an honest enquiry please..",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461016",
  "comments": [
    {
      "author": "Little Mouse",
      "created_time": "July 25, 2023, 02:22:35 PM",
      "body": "Managers don't blindly trust the earned merit vs post, they manually check the post quality before accepting participants. So, I don't think this is something which would benefit them. And the answer of your question is in the thread, there's no such rules so they can delete their previous posts. There's nothing wrong with that.The only reason for which someone wants to delete their post history is to cover their stupid mistakes, wants privacy etc though that's not possible due to some of the archival services.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "July 25, 2023, 02:25:48 PM",
      "body": "What if it is one of the moderators or some moderators that is deleting it. Some posts are reported and got deleted. You can see some posts that are reported to be many and belonging to one user and moderators keep deleting the reported posts.If someone is intentionally deleting his post, go to the person posting history and see if he is a bounty hunter. He may want to change and get merit to get a signature campaign. You can check if the person's account password change or email changed, which means the account has been bought and looking for a way to join a signature campaign.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "July 25, 2023, 02:28:49 PM",
      "body": "Quote from: Fivestar4everMVP on July 25, 2023, 02:14:34 PMSo some how, i discovered that there are some forum members who are periodically deleting tens of hundreds of their previous posts/comments, supposedly for no other reason other than to keep their post count low, probably to match the number of merits they have earned, or keep their post count at a little bit higher average, what ever their main motive for doing this is, I don't know specifically, but my guess is that, they may think or consider it that other forum users, or maybe campaign managers, may consider them spammers if they have a lot of posts, maybe in the tens of thousands and not many merits earned to back that number of posts up, this is true ?I know you said you don't want to do it, but you better name names and let's see if they are really people who delete their own posts for certain reasons or if they are surely deleted by the moderators. The question so in abstract does not give for much, but the idea that you carry I think we are goin to tell you that it is wrong, as those of us who commented already did.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "July 25, 2023, 02:34:00 PM",
      "body": "Is there any manager use merit/post ratio to select their participants? AFAIK no.What I know is: total merit earned in 120 days, posting habit, the frequent section, total merit earned, top recognized rank, trust rating, and some privilege e.g. staff, moderator, foxup merit cycling, phenomenal etc.I think the higher total post, the higher chance people will see his signature because it's spread to many places.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "July 25, 2023, 02:42:50 PM",
      "body": "Quote from: Fivestar4everMVP on July 25, 2023, 02:14:34 PMSo some how, i discovered that there are some forum members who are periodically deleting tens of hundreds of their previous posts/comments, supposedly for no other reason other than to keep their post count low, probably to match the number of merits they have earned, or keep their post count at a little bit higher average, what ever their main motive for doing this is, I don't know specifically, but my guess is that, they may think or consider it that other forum users, or maybe campaign managers, may consider them spammers if they have a lot of posts, maybe in the tens of thousands and not many merits earned to back that number of posts up, this is true ?Campaign managers will look at these following twosTotal meritsReceived merits in the last 120 days (4 months)Your total merits can give an early impression but campaign managers will look deeper to see your received merits in last 120 days. It is to see your post quality is maintaining at high quality or drop last for months. Deleting your old posts can not help you to pass through the manager checking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "July 25, 2023, 02:47:42 PM",
      "body": "Quote from: _act_ on July 25, 2023, 02:25:48 PMWhat if it is one of the moderators or some moderators that is deleting it. Some posts are reported and got deleted. You can see some posts that are reported to be many and belonging to one user and moderators keep deleting the reported posts.A moderator cant possibly delete over 200 posts from one user in one week, that's not possible even if the user is posting shit, he will surely get a temp ban even before the 20th post is deleted, so surely, what i am seeing here is not any user reporting another user's post and mod deleting them, its the owner of the account him or her self deleting his or her posts.Quote from: Poker Player on July 25, 2023, 02:28:49 PMQuote from: Fivestar4everMVP on July 25, 2023, 02:14:34 PM/snipI know you said you don't want to do it, but you better name names and let's see if they are really people who delete their own posts for certain reasons or if they are surely deleted by the moderators. The question so in abstract does not give for much, but the idea that you carry I think we are goin to tell you that it is wrong, as those of us who commented already did.I understand the urge bud, I feel like posting the account name(s) too, if not for anything, to prove that what I am asking about is not just an idea born out of my own mind, but like I noted, I sincerely don't want to get anybody involved in this, what they are doing is not a crime and is not against the forum rules, so i honestly dont want to bother them, and more importantly, i dont want anybody seeing me as an enemy, so, lets just leave it the way it is.You are free to do your research and find out who and who yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "July 25, 2023, 02:52:43 PM",
      "body": "Quote from: Fivestar4everMVP on July 25, 2023, 02:14:34 PMWhat do you guys think or make of this?, its an honest enquiry please..I think it's okay to delete some posts that you deem to be of low quality or bad quality - you and anyone can delete them as long as your post is still deletable and doesn't violate anything. But what's the point of deleting if any of us can easily find the post history via the magic tools ninjastic.space and loyce.club?If the deleted post was their way of destroying evidence - then surely some of us have the right to suspect it. But so far I haven't thought about much - ignore it as long as it's not something too important to take up much of your attention.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "July 25, 2023, 03:16:17 PM",
      "body": "Quote from: Fivestar4everMVP on July 25, 2023, 02:14:34 PMi know there is no rule restricting users from deleting their previous posts when they feel like it, but I don't know why I feel doing such is a cheating on other honest forum members, as well as campaign managers who might believe you to be a quality poster based on your low posts count and merit earned, not knowing that you are just an average poster like most users of the forum, that deleting previous post is what has kept your post counts down..To be honest, I don't think that they are fooling anyone other than themselves if they think by deleting posts and having better merit/post ratio will get them into better paid signature campaigns. Likewise, any manager that can get fooled by that is not a good manager at all and is not checking post history properly.Another reason why some members might do that is because they could be embarassed by their early posts when they just joined the forum but its hard to say without you sharing the names of those members wo we can see type of posts they were deleting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "July 25, 2023, 03:19:32 PM",
      "body": "Quote from: Fivestar4everMVP on July 25, 2023, 02:14:34 PMSo some how, i discovered that there are some forum members who are periodically deleting tens of hundreds of their previous posts/comments, supposedly for no other reason other than to keep their post count low, probably to match the number of merits they have earned, or keep their post count at a little bit higher average, what ever their main motive for doing this is, That's really insane if truly some users were found in this kind of mess, which could also indicate many things such a user should be suspected of aside the reason you gave here from your perspective, what i see that might have led to this kind of action or when a user is trying to engage on phishy or dirty acts personal to him and use that to serve as cover for such nasty behavior, maybe when the user bought an account which posting styles strongly indicate a change of hands or the user has been spamming the account with useless posts and want to be serious about it, but either of the ways, it's a bad idea to delete post one has already made over time except for suspecting reasons from any user.Quote from: Fivestar4everMVP on July 25, 2023, 02:14:34 PMWhat do you guys think or make of this?, its an honest enquiry please..Best known to them any of the reasons which i think none is valid enough for taking such behavior, i cant build a profile with my deliberate consciousness and think about deleting them, there's no reason for any justification on that for me, if i see a user that does such, I'd rather be careful and avoid such.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "July 25, 2023, 03:30:26 PM",
      "body": "It is possible that people grow over time and their post quality might improve as a result of their growing as a person/forum user. I say it's possible, but obviously there are other scenarios that might be in play here. 1. Account sold. New owner trying to cover up old posts maybe because old owner was a regular poster in Nigeria local, new owner Indonesia or whatever different locals. 2. account hacked, and hacker is trying to clean up the account for resale 3. former spammer trying to make the account look better to join a sig campaignI'm sure there may be other reasons, but these are what come to my mind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "July 25, 2023, 03:32:37 PM",
      "body": "Quote from: Fivestar4everMVP on July 25, 2023, 02:14:34 PMBut me personally asking if this is an ideal thing to do, i know there is no rule restricting users from deleting their previous posts when they feel like it, but I don't know why I feel doing such is a cheating on other honest forum members, as well as campaign managers who might believe you to be a quality poster based on your low posts count and merit earned, not knowing that you are just an average poster like most users of the forum, that deleting previous post is what has kept your post counts down..What do you guys think or make of this?, its an honest enquiry please..I'm not going to talk about the campaign manager aspect since I have no idea on how they (the campaign managers ) select those that will participate in any campaign that's being managed by them. If you take a good look at the forum, I see it as a historical place where you have several topics, discussion on different subject matter and sometimes when a newbie comes to the forum they are always advised to go through previous threads to learn more om certain issues or topics, but if you as a forum member that's supposed to contribute to the already existing knowledge or opinion in the forum decides that you don't what to instead you want to delete your posts (that could have helped a newbie or someone in search of such knowledge in the future) just so that your account stats can look cool and admirable, you're not only cheating yourself but also the potential of the forum. Sometimes we go back to our account post history just keep scanning through them to see the growth that we have been able to achieve since the time we came to the forum. Another reason could be that they are deleting some posts they feel are spam maybe during their early days or due to the amount of knowledge they had during the time they made that post. But if they are doing it to cheat their way into a campaign and you're very sure of it, then you can simply notify the campaign manager of it and if they find it unethical they can remove them from their campaign but if they're cool with it then we all move on with it. Just my 2 cents.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "July 25, 2023, 03:41:53 PM",
      "body": "I did notice some people getting their post count lower, but I didn't overthink it. I encountered it when I read many posts referencing a specific position, and it bounced back toward the topic, but the particular reference was gone. After that, I noticed some of the referenced posts the user had were also gone. It's probably the manager's discretion to see or consider that. Making it look like you have more constructive posts would make you a good forum member and contributor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "icalical",
      "created_time": "July 25, 2023, 03:50:54 PM",
      "body": "Quote from: yahoo62278 on July 25, 2023, 03:30:26 PM3. former spammer trying to make the account look better to join a sig campaignNow, I am curious regarding to what OP said on the main postQuote from: Fivestar4everMVP on July 25, 2023, 02:14:34 PMI don't know specifically, but my guess is that, they may think or consider it that other forum users, or maybe campaign managers, may consider them spammers if they have a lot of posts, maybe in the tens of thousands and not many merits earned to back that number of posts up, this is true ?From a campaign manager point of view do you (Yahoo) take post to merit ratio as one of consideration to accept a member into your campaign. I mean what if the person recently make a better posts and got many merits recently, but their previous 500+ posts rarely get merit (ignoring whether they make good or bad post, they just rarely get any merit)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "July 25, 2023, 03:52:52 PM",
      "body": "I think that deleting posts as well as writing them is a personal matter of each member, the same as what they will do with their merits or how active they will be on the forum. I understand that the OP has some \"concerns\" about how this can affect the overall impression when it comes to signature campaigns, but in the last 4-5 years (I'm not sure, maybe more) all posts are saved and exist regardless of whether someone deleted them on the forum (owner or moderator). I believe that no manager digs so deep into the past when deciding who to choose to participate in his campaign.I remember one case in which a member deleted thousands of posts, and it seems to me that this is one of the most extreme cases of deleting posts on the forum.This member has weird stats.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "July 25, 2023, 04:29:58 PM",
      "body": "Quote from: Fivestar4everMVP on July 25, 2023, 02:14:34 PMWhat do you guys think or make of this?, its an honest enquiry please..There are many reasons why people delete their post, I was asked to clean my post history during my transition stage (from a spammer to a quality poster) and I deleted closed to 500 posts, I don't know what the reasons are for those you observed deleting their posts but we can't just assumed they're trying to cheat the system and also there's nothing they gain from campaign campaign managers when they delete their post. It doesn't increase their merit or post quality so I don't see why this is cause for concern. They're actuator doing the forum a good thing because it's less work for moderators to start deleting their posts when they get reported. When they delete their posts it equals to less work for spam busters so they're actually doing the forum more help than harm but as they're deleting, their next posts should have better qualities. You should be less concerned about this as managers don't look at  how many posts you have instead they look at the quality of your posts, and to some extend having high quality number of posts could get you into campaign when your merits isn't high as others. Managers will prefer posters that can make more posts than those making just the minimum needed to be paid weekly.  More post means more promotion but obviously they have to be quality posts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "July 25, 2023, 05:56:25 PM",
      "body": "Everyone has different reasons for deleting posts, but if I can recall correctly, I don't think I have done that before. A few of my posts have been deleted in the past by moderators, either because they were off-topic or because the thread was entirely deleted. I happened to have a F2F conversations someone from my local and something of this nature was discussed, their were plenty of points given which I could only lay my hands on few; which is, most people deleted their post not because they are aiming to equal it with their number of merit or number of activities, but few do that base on the kind of post they have made in the past, where they have to revisit those threads where the comments are shared and realized it was all off-topic, most times wrong information passed, while some being filled with bounty authentication post, but when they have familiarize them self well with the forum the happen to wipe those post which makes them appear real stupid. But to me, if I ever have to delete some of my posts today, the reasons will be:If there has been any project or site that I have recommended to others in a comment that later turns out to be a scam, if I am aware of such, I will definitely wipe it out so as not to mislead the public.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "July 25, 2023, 06:07:01 PM",
      "body": "Quote from: Fivestar4everMVP on July 25, 2023, 02:14:34 PMWhat do you guys think or make of this?, its an honest enquiry please..Some people want to show that they are better with something like a higher merit ratio per post which should not be appreciated but since it has no bad effect on the forum then it's okay to clean up their own mess without loading the work for mods.I am interested in knowing what the community thinks about it, I feel a pool about this will tell about it exactly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GiftedMAN",
      "created_time": "July 25, 2023, 09:19:15 PM",
      "body": "Quote from: Little Mouse on July 25, 2023, 02:22:35 PMThe only reason for which someone wants to delete their post history is to cover their stupid mistakes, wants privacy etc though that's not possible due to some of the archival services.I think you are right. A user may have made some multiple mistakes several times which may be caused by the user being new to the forum, typographical error, wrong information, wrong date etc and once the user is able to get the knowledge of the past mistakes he or she has made in the past that person can decide to delete it but deleting a post doesn't really mean the information is out completely as you earlier said the post can be found in the archival services but looking at the information contained in the post of the op, I think there is more to some users just deleting their posts than what we are thinking about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "July 26, 2023, 12:08:05 AM",
      "body": "I think there are only few members who do that and that's their right so no one can stop them from doing that. I don't think that deleting one's posts and making post to merit ratio higher would give someone edge over others when it comes to signature campaigns. A campaign manager often tries to select those members in his/her campaign that can write well constructed content which can help a campaign to get more attention of the forum users. For example a user having 1000+ merits having only 700 posts which are well constructed while another user having 1000+ merits having more than 15k+ unconstructed posts. In this case the one with 1000+ merits and 700 posts would get high priority to be accepted in a campaign than the one with 15k+ unconstructed posts. The mangers often look for those participants that can be valuable for a campaign, and they try to avoid the fact that how many merits they have earned unless the funder of the campaign demands the members with higher merits only. I don't think that a campaign manager cares a lot about number of posts of a user when selecting him/her in a campaign because most of the campaign managers want those users who can produce good quality posts during the running time of a campaign, and there isn't any issue with their previous posts because most of the previous posts can be considered dead if they aren't in a active thread anymore.That's my own opinion, however the managers might consider other factors as well. I'm quite sure that each manager who wants to run a successful campaign may give priority to those posters who try to make well constructed posts that can help solve the issues of the other users. And, yes if a user who makes constructed posts can post more than the requirements of the campaign then that's a plus point, and most of the campaign managers appreciate such users with bonuses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}