{
  "id": "topic_5410587",
  "title": "cryptofalva",
  "author": "cryptofalva",
  "created_time": "August 20, 2022, 01:11:48 PM",
  "content": "Monero (XMR) to Bitcoin (BTC) without KYCIf you want to exchange Monero for Bitcoin or other currencies without KYC, you are in the right place.I will send you a PDF file with informations.Price: 0,1 XMR",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410587",
  "comments": [
    {
      "author": "sunsilk",
      "created_time": "August 20, 2022, 09:10:14 PM",
      "body": "I'll just be frank to you OP, if ever you'll have the rule of you're not gonna be first, no one will do the same. I advise you and anyone that you do with the exchange to use an escrow from the forum.For everyone's reference: Recommended bitcointalk escrow servicesThere's a certain fee but that's not much if both of you are secured with the deal you're gonna do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "saxydev",
      "created_time": "August 22, 2022, 04:48:34 AM",
      "body": "Quote from: cryptofalva on August 20, 2022, 01:11:48 PMMonero (XMR) to Bitcoin (BTC) without KYCIf you want to exchange Monero for Bitcoin or other currencies without KYC, you are in the right place.I will send you a PDF file with informations.Price: 0,1 XMRThere is cake wallet powered by monero, it has xmr to btc exchange built in. So thanks for nothing!?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "August 27, 2022, 06:36:13 PM",
      "body": "Quote from: cryptofalva on August 20, 2022, 01:11:48 PMI will send you a PDF file with informations.Price: 0,1 XMRI don't know where you got this ambition from, but is this information so secret that someone needs to pay to know it? What is the guarantee that the person will not publish the data publicly once they know it from you or share the file here?In general, you can sell the file, but don't expect someone to pay for information that can be obtained for free.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "August 27, 2022, 11:38:48 PM",
      "body": "Quote from: cryptofalva on August 20, 2022, 01:11:48 PMI will send you a PDF file with informations.Price: 0,1 XMRAny member considering this offer should think twice about this. Besides having a chance of getting scammed, there is also a likely hood of one getting their device infected but malware through the PDF files sent to them",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "August 29, 2022, 02:46:17 PM",
      "body": "Quote from: hugeblack on August 27, 2022, 06:36:13 PM...In general, you can sell the file, but don't expect someone to pay for information that can be obtained for free.That's right, anyone can go to a swap service for free and make the exchange, a good example for this is the next site:https://altquick.com/swap/I have used their service in the past and worked fine for me. I feel like there is no reason to pay 0.1 to op and get a pdf file that could contain a malware, the risk of getting scammed or exploited doesn't worth it.I remember in the past it was possible with Atomic wallet, but if i'm not wrong they remove that coin from their swap service.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}