{
  "id": "topic_5477181",
  "title": "tech30338",
  "author": "tech30338",
  "created_time": "December 09, 2023, 02:41:57 PM",
  "content": "Yes guys isang milyong dolyar iyan ang dapat mong bayaran para maging citizen ka ng el salvador, sinasabi nila na ito ay isang investment, wala naman inilagay kung anu ang mga prebelihiyo neto, isa sa partner din ng Elsalvador sa project na ito ay tether, kung ikaw ang tatanungin magiinvest kaba ng isang milyong dolyar in bitcoin para mging citizen nila? good investment ba ito or isang malaking risk?pakilagay ang inyong mga dahilan.Narito ang link ng balita:https://news.bitcoin.com/el-salvador-introduces-exclusive-citizenship-through-1-million-crypto-investment/Baka gusto ninyo kumuha ng visa ito ang link:https://adoptingelsalvador.gob.sv/welcome",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477181",
  "comments": [
    {
      "author": "rhomelmabini",
      "created_time": "December 09, 2023, 09:09:42 PM",
      "body": "Quote from: tech30338 on December 09, 2023, 02:41:57 PMYes guys isang milyong dolyar iyan ang dapat mong bayaran para maging citizen ka ng el salvador, sinasabi nila na ito ay isang investment, wala naman inilagay kung anu ang mga prebelihiyo neto, isa sa partner din ng Elsalvador sa project na ito ay tether, kung ikaw ang tatanungin magiinvest kaba ng isang milyong dolyar in bitcoin para mging citizen nila? good investment ba ito or isang malaking risk?pakilagay ang inyong mga dahilan.Sa tingin ko isang gastos lang ito lalo na sa mga simpleng mamamayan lamang, para sa mga mayayaman lang ang ganitong URI ng investment. Sa tingin  ko sa ngayon isa itong risks consider na wala pa namang pagkakakilanlan sa ROI mo rito. Mas gugustuhin ko pa atang bumili nalang ng bitcoin o iba pang mga cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "December 09, 2023, 09:39:16 PM",
      "body": "If you want a more powerful passport, I suggest to look for other option kase may mga bansa na need mo lang mag invest ng around P10M or less just to get their passport and become a citizen, so $1M is too much for me. If sawa kana sa Pilipinas and have the capacity to do this, then why not diba? If you’re into crypto and think that El Salvador is better than Philippines, then do it basta kailangan buo lang ang desisyon mo kase for me, iba paren ang saya maging isang Pinoy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "December 09, 2023, 09:53:23 PM",
      "body": "Meron namang ibang way para maging citizen ng El Salvador, bakit pa ako gagastos ng 1 million dollar in Bitcoin.  So kahit na meron akong 1m in Bitcoin, hindi ko igagrab ang opportunity na ito at kung gusto kong maging naturalized citizen nila, iyong normal na proseso na lang ang gagamitin ko dahil iyong 1m dollar na gagastusin ko is enough na para makapagestablish ako ng magandang pagkakakitaan saan man ako magpunta.Isa itong magandang initiative ng El Salvador para ipromote ang Bitcoin and at the same time mapabilis ang pag-aapply ng citizenship ng mga taong gustong maging mamamayan nila.  Pero napaka hindi practical ang ganitong proseso para sa akin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arwin100",
      "created_time": "December 09, 2023, 10:35:35 PM",
      "body": "May topic na nito sa Global board kabayan https://bitcointalk.org/index.php?topic=5477151.msg63295389#msg63295389 Pero maganda din naman pagusapan to sa local since ibang language naman tayo.Pero sa tanong na yan ang sagot ko ay di ako magbabayad. Marami na tayong magagawa sa perang yan at kung e convert mo yang one milyon dollar to peso ay 55 milyon pesos na yan kaya marami kanang magagawang bagay at investment dyan.Mainam pa siguro kung e invest mo nalang yan sa maraming paupahang bahay at commercial spaces o di kaya invest mo nalang sa bitcoin at ang ibang matitira ipang travel mo dun mas worth it pa yang pera mo kaysa magbayad ka ng halagang yan para sa citizenship lang.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "December 09, 2023, 11:42:11 PM",
      "body": "Nasagot ko na yan sa English version, at ang sagot ko ay hindi ako kakagat kasi hirap na nga ako sa english ko pero mas hirap ako magsalita ng latin o Spanish kaya malaking problema ang communication dito, bukod doon mas preferable ko na ilagak ang $1 million dollar dito sa bansa ko sa Pilipinas kasi mas ok dito dahil sa magagandang beach at mga tourist attraction at bukod pa doon ang mura ng mga bilihin dito $25 lang budget pang mayaman na yan.At mas mataas ang value ng 7 ranggo ang ating passport kaysa passport ng El Salvador, kaya mas comfortable ako na dito na lang sa Pinas tutal Bitcoin friendly din naman ang bansang Pinas wala ring pinag iba.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeilLostBitCoin",
      "created_time": "December 10, 2023, 12:04:25 AM",
      "body": "Hindi kabayan dahil sa perang ito madami na tayong mabibiling mas magandang investment. Malaking risks ito dahil hindi naman natin alam kung ano ang mapapala natin sa pagbabayad na ganitong kalaki citizenship lamang ang sinabi. Ngunit kung sila ay magpapaairdrop sa mga gagawa nito siguro depende nalang ito kung nasa magkano ang makukuha nila. Pero napaka liit ng chance at sobrang laki ng risks para lang sa ganitong citizenship.Kadaming mas mainam na investment gaya ng apartment, bumili ng farmlot at taniman ito. Siguro ang gagawa nalang nitong investment na isang dolyar ay yung nakikinabang sa rules ng bansang ito kung isa siyang citizen dito. Diba iba ang tax ng ibang bansa, baka isa yun sa factor kaya naglagay sila ng ganun kalaking fee para masulit din nila ang gumagamit ng citizenship nila.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "December 10, 2023, 12:51:56 AM",
      "body": "Ang programang ito ay naglalayong maattract ang mga mayayamang crypto and property investors na gusto ma enjoy ang mga benepisyo sa pagiging citizen ng El Salvador, gaya ng visa-free o visa-on-arrival access sa 150 na bansa kasama ang EU, ang U.K., lahat ng Latin America and most of Eastern Europe.Hindi lang ito simpleng financial investment, isang napakalaking desisyon na magbibigay sayo ng bagongg kinabuksan. Pero napaka risky nga ito, alam naman nating given na ang volatility ng crypto at hindi natin masasabi kung ano mga maaaring magbago in the future.Kung ako nabibilang isa sa mga mayayaman na yan, hindi ko pa rin pipilin na sumali sa programang yan, papalawakin ko na alng ang aking kasalukuyang negosyo para mabigyan ng trabaho ang ilan nating mga mamamayan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adreman23",
      "created_time": "December 10, 2023, 06:31:30 AM",
      "body": "Tingin ko yung kakagat dito ay yung mga bitcoin whale na ban ang bitcoin sa bansa nila. Napakalaki ng 1million$ almost 56 million ang value nyan dito sa pinas kung meron kang ganyan kalaking halaga ng bitcoin aba bakit kapa mag papa citizenship sa El Salvador eh hindi naman pinagbabawal ang bitcoin dito sa pinas maka cash out mo pa naman yan dito. Pwera na lang kung halimbawa may  isang bitcoin whale dito sa pinas at pinapangarap nya talagang manirahan sa El Salvador siguro ay mag aavail sya nyan. Pero may isa pang problema dahil malalantad yung identity nya sa gobyerno ng  bansang iyon at malalaman na meron syang mga bitcoin diba parang delikado kung magka ganon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LesterD",
      "created_time": "December 10, 2023, 10:47:22 AM",
      "body": "Quote from: tech30338 on December 09, 2023, 02:41:57 PMkung ikaw ang tatanungin magiinvest kaba ng isang milyong dolyar in bitcoin para mging citizen nila? good investment ba ito or isang malaking risk?pakilagay ang inyong mga dahilan.Kung mayroon man akong investment o pang invest sa Bitcoin ng ganyan kalaki, bakit hindi. Ang 1 million dollar na investment sa Bitcoin ay mananatili bilang personal investment mo. Hindi naman siya ibabayad sa gobyerno ng El salvador para maging citizen ka. Nag ooffer lang sila ng opportunity sa mga milyonaryo na doon na manirahan dahil gusto nila na dumami pa ang naninirahan na milyonaryo sa bansa nila.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ben Barubal",
      "created_time": "December 10, 2023, 12:44:03 PM",
      "body": "Hindi yan praktikal sa mga tulad nating mga pinoy sa totoo lang. Saka if ever man na magkaroon ako ng pagkakataon na mag-aaply ng citizenship ay hindi ko parin gagawin, at kung meron man ako ng ganyang halaga na 1M$ hindi ko rin gagamitin yan para sa citizenship.   Napakalaking halaga nyan para sa akin, kahit 500k$ lang nga iallocate ko sa bitcoin at ibang mga alternative coin na cryrptocurrency sigurado akong yang 500k$ na yan ay posibleng maging x10 up to x100 or more pa nga depende sa mangyayari sa bull run o bago dumating ang bitcoin halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "December 10, 2023, 02:57:45 PM",
      "body": "Quote from: Ben Barubal on December 10, 2023, 12:44:03 PM  Hindi yan praktikal sa mga tulad nating mga pinoy sa totoo lang. Saka if ever man na magkaroon ako ng pagkakataon na mag-aaply ng citizenship ay hindi ko parin gagawin, at kung meron man ako ng ganyang halaga na 1M$ hindi ko rin gagamitin yan para sa citizenship. Totoo, hindi talaga praktikal ang ganyan. Alam natin na sa lahat ng investment ay kailangan magtake ng risk pero kailangan din nating unawaing mabuti kung talagang worth it ba talaga at suriin ng mabuti ang ating sarili kung emosyon lang ba ang may dala lalong-lalo na kung hindi natin afford na mawala ito.Kung marami ka talagang pera, bakit hindi? Kasi mag-iinvest ka lang naman sa Bitcoin o Tether upang maging Salvadoran Citizen. Malaking advantage ito sa mga investors na matagal ng may holdings sa Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "December 10, 2023, 07:56:35 PM",
      "body": "Hindi yan praktikal, hindi din naman first world yang El Salvador pero siyempre gusto natin ginagawa ng presidente nila para sa Bitcoin dahil inadopt na nila yan bilang legal tender. Kung may ganyang pera na ako, okay na ako sa buhay ko dito sa Pinas. Kahit na Philippine passport ang meron ako, magta-travel nalang ako abroad o sa ibang bansa para magbakasyon o di kaya sa El Salvador para man lang may ambag ako sa ekonomiya nila pero yang halaga na pera na yan, mas sulit yan kung dito mo nalang gastusin sa bansa natin. Dahil sobrang daming puwede paggamitan niyan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lienfaye",
      "created_time": "December 11, 2023, 12:57:30 AM",
      "body": "Quote from: tech30338 on December 09, 2023, 02:41:57 PMkung ikaw ang tatanungin magiinvest kaba ng isang milyong dolyar in bitcoin para mging citizen nila? good investment ba ito or isang malaking risk?pakilagay ang inyong mga dahilan.Para sa katulad nating nasa third world country worth it ba mag spend ng ganyan kalaking halaga para lang maging citizen ng El Salvador? Regardless sa kung anong prebilehiyo ang makukuha mo para sa akin hindi sya wise gawin. Dahil kung talagang gusto mong maging citizen nila, pwede itong magawa sa tamang proseso at hindi dahil nagbayad ka.Isa pa, maraming bansa ang mas maganda at maraming opportunity at open rin naman sa pag gamit ng crypto. So para sakin kung sakali mang mayaman ako at afford magbayad, hindi ko parin kakagatin ang ganitong offer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "December 11, 2023, 04:16:04 AM",
      "body": "Instant citizenship ba to? kasi kahit sa malalaking bansa hindi nirerequired ang malaking gastos instead kailangan mo lang patunayan na worth it ka maging citizen , at patunayan mo na gusto mo talaga at dedicated ka hindi lang para gastosan ang gobyerno nila kasi paano kung Masamang tao ka na gusto lang magtago sa bansa nila? at dahil sobrang yaman mo eh magagawa mo na maging citizen instantly?parang may hindi  maganda sa motive nitong paraan ng El Salvador .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bhadz",
      "created_time": "December 11, 2023, 09:29:25 AM",
      "body": "Quote from: kotajikikox on December 11, 2023, 04:16:04 AMInstant citizenship ba to? Oo, kasi magkakaroon ka ng ambag sa ekonomiya nila kaya parang incentive ito sa mga foreign investors nila. Isa yan sa paraan para magkaroon ng passport nila.Quote from: kotajikikox on December 11, 2023, 04:16:04 AMkasi kahit sa malalaking bansa hindi nirerequired ang malaking gastos instead kailangan mo lang patunayan na worth it ka maging citizen Required pa rin ang malaking gastos kung hindi ka dadaan sa tamang proseso, ang tawad dun ay 'golden visa programs'. Madaming ganyan sa iba't ibang bansa, hindi ka na dadaan sa required na dapat ay 2+ to 10+ years ka na dapat nagstay o nag work ka sa bansa na yun kaya shortcut yan para maging citizen. May mga bansa naman na required ka bumili ng property sa kanila worth $100k+. Kaya kung doon ka sa path na hindi gagastos ng malaki, ang puhunan mo naman ay oras.Quote from: kotajikikox on December 11, 2023, 04:16:04 AMat patunayan mo na gusto mo talaga at dedicated ka hindi lang para gastosan ang gobyerno nila kasi paano kung Masamang tao ka na gusto lang magtago sa bansa nila? at dahil sobrang yaman mo eh magagawa mo na maging citizen instantly?parang may hindi  maganda sa motive nitong paraan ng El Salvador .Ganyan talaga, sabi nga nila. \"Money makes the world go round\", at hindi na yan bago sa mga procedures kasi kahit nga dito sa bansa natin talamak ang ganitong shortcut para maging citizen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Natsuu",
      "created_time": "December 11, 2023, 09:47:29 AM",
      "body": "Kung meron akong isang milyon, bakit hindi. Pero di lang siguro isang milyon ilalaan ko. Magtatabi rin ako ng mas marami pang pera para sa mahal na cost of living doon.  Siguro trip lang ng iba na subukan ang El Salvador para sa mas magandang governance o bagong environment o mas magagandang opportunities. Kung may chance at may pera, igrab ko rin iyon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kingvirtus09",
      "created_time": "December 11, 2023, 01:57:06 PM",
      "body": "Quote from: Natsuu on December 11, 2023, 09:47:29 AMKung meron akong isang milyon, bakit hindi. Pero di lang siguro isang milyon ilalaan ko. Magtatabi rin ako ng mas marami pang pera para sa mahal na cost of living doon.  Siguro trip lang ng iba na subukan ang El Salvador para sa mas magandang governance o bagong environment o mas magagandang opportunities. Kung may chance at may pera, igrab ko rin iyon. Yang condition nilang yan ay pangmayaman talaga at hindi yan pang-middle class type na uri ng tao yan. Sa ating mga pinoy na katulad natin walang kakagat dyan unless kung mayaman kang tao at gusto mong maging citizens sa bansang El Salvador. Pero para sa akin mas gugustuhin ko parin dito sa pinas dahil mas maganda parin ang bansang pinas sa totoo lang kumpara sa bansang El Salvador, kita mo nga may mga dayuhan pa na na gusto maging pinoy sa kabila ng pagiging dugong dayuhan nila dito sa ating bansa, that means alam nilang magandang mamuhay dito sa bansa natin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peter0425",
      "created_time": "December 12, 2023, 07:25:31 AM",
      "body": "Masaya na ako bilang Pinoy at mananatiling Pinoy habang buhay .1 million dollars? sapat ng buhayin nyan ang kahit dalawang salinlahi ko    at kung mapagbubuti ko ang pagpapalago eh kahit ka apo apohan ko eh mabubuhay na sa halagang yan so wag na.siguro  mga Bilyonaryong Kriminal na may tinatakasan ang papatol dyan , kasi kung normal process naman eh pwede ka maging citizen di lang instant dba.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "0t3p0t",
      "created_time": "December 12, 2023, 11:42:31 AM",
      "body": "$1M is for me just a waste of money para mag-avail sa nasabing investment kung citizenship lang naman ang pag-uusapan. If ever man na mag-avail ako ay bakit sa El Salvador pa kung meron namang Europe, Canada, Australia at iba pang mga first world countries na mas maganda tirhan? If given a chance then why not diba pero syempre marami pwede pagpilian. $1M dito sa Pilipinas ay sobrang laki na at magkakaroon na ako nun ng financial freedom kung mangyari mang magkaroon ako ng ganyan kalaking pera. 😁",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}