{
  "id": "topic_5461448",
  "title": "_act_",
  "author": "_act_",
  "created_time": "July 30, 2023, 04:56:16 AM",
  "content": "I do not like to see people using P2P for centralized exchanges. The centralized exchanges has been confusing people about it. P2P means the exchange should be without any intermediary but the exchanges are the intermediary which make them not to have P2P but another thing entirely. P2P are:exchanging bitcoin directly with another person like on this forumthe use of decentralized exchangesIf we want to call centralized exchange P2P, what should it be called? We need a name on this forum to be calling them. The centralized exchanges have stolen what P2P is. Even many people on this forum are calling them P2P.What about CEP2P? It means centralized exchange P2P.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461448",
  "comments": [
    {
      "author": "Faisal2202",
      "created_time": "July 30, 2023, 05:00:41 AM",
      "body": "You are right, but we can not just make any metaphoric words in place of P2P trading which we could use all over the place. Because to do that that word should be agreed upon by all universe. (It should be in universal set if unit hehe) just kidding. I think CEXs p2p and DEXs p2p is enough for now to differentiate between them.Otherwise we and newbies all know that there p2p is not only p2p there is third person involved too to manage the funds. So they must not be confused instead they must be aware of such thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "July 30, 2023, 05:07:18 AM",
      "body": "Weren't they called centralized P2P exchanges to start with already? Technically they're still somewhat P2P anyway, it's just that the centralized exchanges acts as the escrow for the transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "July 30, 2023, 05:49:08 AM",
      "body": "P2C2P Quote from: mk4 on July 30, 2023, 05:07:18 AMTechnically they're still somewhat P2P anyway, it's just that the centralized exchanges acts as the escrow for the transaction.To be peer-to-peer network the whole network should consist of \"peers\" which means participants or nodes that are at equal level with equal privileges. If any part of the network has more privilege than others (eg. the server that everyone relies on) that stops being P2P.Otherwise if we start bending the definition we start calling a lot of other things P2P that aren't P2P for example CEX like Coinbase since you are technically trading with other people not with the company!!!https://en.wikipedia.org/wiki/Peer-to-peer",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blckhawk",
      "created_time": "July 30, 2023, 06:03:14 AM",
      "body": "Quote from: _act_ on July 30, 2023, 04:56:16 AMP2P means the exchange should be without any intermediary but the exchanges are the intermediary which make them not to have P2P but another thing entirely. As much as like the idea that there's no intermediary when it comes to P2P, I don't want to be a victim of a scam or anything malicious like that because when it's a raw P2P trade, the possibility that the other party won't commit to their agreed trade gets much higher and they don't have to crafty about it unlike having a middle-man/intermediary where they need to fake some confirmation to even pull off shit like that. Also, I don't get how it's confusing, you're just using the exchange as a platform to conduct a P2P trade, it's not like they actively meddle in the trades itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "July 30, 2023, 06:36:04 AM",
      "body": "Quote from: blckhawk on July 30, 2023, 06:03:14 AMAs much as like the idea that there's no intermediary when it comes to P2P, I don't want to be a victim of a scam or anything malicious like that because when it's a raw P2P trade, the possibility that the other party won't commit to their agreed trade gets much higher and they don't have to crafty about it unlike having a middle-man/intermediary where they need to fake some confirmation to even pull off shit like that.The main problem in certain local p2p transactions is the fear of being cheated by anyone claiming to be an intermediary because the possibilities of being defrauded are quite high. I've had a similar experience, even though it was in a Telegram group or channel where they claimed to be actual p2p and I was duped by them. That is why I prefer utilizing CEX p2p to avoid such scams, even though they are not completely reliable due to centralization, but they have a reputation.Quote Also, I don't get how it's confusing, you're just using the exchange as a platform to conduct a P2P trade, it's not like they actively meddle in the trades itself.It is straight-forward, and you have nothing to fear since the exchange will be the middleman in the transaction; you have to receive your money before you release crypto for the buyer, which is a bit safe.I don’t find anything bad in doing this with any exchange; all I always avoid is leaving my coin in their custody. I only send funds to the exchange when I am ready to convert them to FIAT.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "July 30, 2023, 07:01:33 AM",
      "body": "Quote from: Hyphen(-) on July 30, 2023, 06:36:04 AMThe main problem in certain local p2p transactions is the fear of being cheated by anyone claiming to be an intermediary because the possibilities of being defrauded are quite high. I've had a similar experience, even though it was in a Telegram group or channel where they claimed to be actual p2p and I was duped by them. That is why I prefer utilizing CEX p2p to avoid such scams, even though they are not completely reliable due to centralization, but they have a reputation.Trading peer to peer is risky and you must understand how that Peer-to-Peer trading platform works from create your offer, open a trade, communicate with your trade partner, how and when you should release your coin. As well as how to differentiate between real moderators and impersonators, how to file a dispute with solid evidence for your trade. Many things but initially, don't let the high margin of profit attracts you because such too good to to be true offer should come from scammers.Trade Peer-to-Peer via marketplaces, trading platforms will help you avoid risk with Escrow from a single person you know in life. He can scam you and your trade partner too so don't trust any middle man as an Escrow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "icalical",
      "created_time": "July 30, 2023, 07:16:49 AM",
      "body": "Quote from: mk4 on July 30, 2023, 05:07:18 AMWeren't they called centralized P2P exchanges to start with already? Technically they're still somewhat P2P anyway, it's just that the centralized exchanges acts as the escrow for the transaction.Agreed, based on sources of the fund, the transaction is still P2P. Both fund came only from the parties involved, so it still peer-to-peer, not like exchange when the fund is pooled into market before someone bought them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "knowngunman",
      "created_time": "July 30, 2023, 07:20:13 AM",
      "body": "Quote from: _act_ on July 30, 2023, 04:56:16 AMI do not like to see people using P2P for centralized exchanges. The centralized exchanges has been confusing people about it. P2P means the exchange should be without any intermediary but the exchanges are the intermediary which make them not to have P2P but another thing entirely. Just because you don't like it make it less P2P, it's your opinion. But it's still a P2P transaction since the exchange has no say over your transaction. They however has control over your coin in case of deviancy and that's a measure to minimize scam during P2P transaction. That intermediary is very necessary to ensure smooth and secure transaction and does not completely make the transaction less of P2P. You can decide to call it another thing but you should know that it will hardly impact what's already established and people already use and familiar with. Sometimes we should just let go of some things that have little or no impact to the reality.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "July 30, 2023, 07:32:48 AM",
      "body": "Let's rename all the abbreviations we don't like. Since this topic is in the newbies section, if we use our own invented language on the forum, the newbies will get even more confused.P2P will remain what it is, but you always have the right to use it on which exchange. It's good to be skeptical, but it's always better to use simple things that have been invented for a long time without racking your brains over names.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "July 30, 2023, 08:01:48 AM",
      "body": "Quote from: blckhawk on July 30, 2023, 06:03:14 AMAs much as like the idea that there's no intermediary when it comes to P2P, I don't want to be a victim of a scam or anything malicious like that because when it's a raw P2P trade, the possibility that the other party won't commit to their agreed trade gets much higher and they don't have to crafty about it unlike having a middle-man/intermediary where they need to fake some confirmation to even pull off shit like that. Also, I don't get how it's confusing, you're just using the exchange as a platform to conduct a P2P trade, it's not like they actively meddle in the trades itself.Bitcoin is decentralized. Having your coins on centralized exchanges is the opposite of what bitcoin is. The centralized exchanges have more control and they are the middle man because you have your coins with them and they have the complete control to your coins. That is not P2P. No intermediary in P2P. Quote from: Hyphen(-) on July 30, 2023, 06:36:04 AMThe main problem in certain local p2p transactions is the fear of being cheated by anyone claiming to be an intermediary because the possibilities of being defrauded are quite high. I've had a similar experience, even though it was in a Telegram group or channel where they claimed to be actual p2p and I was duped by them. That is why I prefer utilizing CEX p2p to avoid such scams, even though they are not completely reliable due to centralization, but they have a reputation.I agree, but we are not talking about how trading are on centralized exchanges, we are talking about the name we should called them. Quote from: lovesmayfamilis on July 30, 2023, 07:32:48 AMLet's rename all the abbreviations we don't like. Since this topic is in the newbies section, if we use our own invented language on the forum, the newbies will get even more confused.P2P will remain what it is, but you always have the right to use it on which exchange. It's good to be skeptical, but it's always better to use simple things that have been invented for a long time without racking your brains over names.Everything is simple, newbies are here to learn just like I was here to learn when I came. People that do not learn will not move forward. I will start using some words in addition to differentiate them from P2P.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "July 30, 2023, 08:11:04 AM",
      "body": "The concept of Peer-to-Peer can confuse newcomers in the industry. This is because they can be deceived to believe that what is done in centralized exchanges is P2P. Hence there is a need to always emphasize and educate newbies that the main workings of P2p is to facilitate Bitcoin transactions without any intermediary or middleman. It should be you dealing with another person directly which nobody in the middle coordinating or facilitating the transaction. Any centralized platform that brandishes a service as p2p is just offering centralized p2p. Quote from: _act_ on July 30, 2023, 04:56:16 AMWhat about CEP2P? It means centralized exchange P2P.Then DEP2P should also mean decentralized exchange P2P.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "July 30, 2023, 08:40:18 AM",
      "body": "I think doesnt matter what its called or what. If you are referring to idea of P2P on cex like what Binance did, the purpose is still the same. Binance did only was set up the place or a hub for people to conduct transactions on which people are relax to know that they are dealing with some legit people. P2p is also good not using cex if you trusted someone your dealing with but isnt it take time to deal with someone first without knowing him but with the Binance set up which require users to be liable when they scam is something good isnt it?Anyway Id did both and theres really an advantage of cex p2p to dex p2p for me since the money can be encash easily on your remittance app if you dont like bank transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "20kevin20",
      "created_time": "July 30, 2023, 10:24:39 AM",
      "body": "Peer to Peer. It’s self explanatory. If you go to a shop and tell the cashier you wanna buy the next person a drink, it’s not from you to them. You give the cashier the money, the cashier gives the next guy a drink.pooya’s term is closest to this. P2C2P, although do we need it really? It’s much easier to say centralized exchanges aren’t peer to peer which is common sense too, because, well, they’re quite.. centralized??",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "July 30, 2023, 10:25:06 AM",
      "body": "Quote from: lovesmayfamilis on July 30, 2023, 07:32:48 AMif we use our own invented language on the forum, the newbies will get even more confused.P2P will remain what it is, but you always have the right to use it on which exchange. It's good to be skeptical, but it's always better to use simple things that have been invented for a long time without racking your brains over names.This is exactly what I was thinking, too. I know what I went through to get used to some popular words here in this forum before I became familiar with them, and I can now easily flow with them when I come across them being used to make a comment, which shows that I have been learning and adopting. P2P is an already-known word, and it's been used for years now to represent transactions that concern two parties exchanging goods or products, irrespective of which platform is being used.To someone who knows the true purpose and meaning of decentralization, You know what your own definition of P2P should be; using the name for both exchanges, P2P, does not change your beliefs. We can give those P2P exchanges a personal name that best describes how we view them, but making it a thing of being generally accepted or suddenly replaced over night is what I don't see happening.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yudhisthir",
      "created_time": "July 30, 2023, 10:35:39 AM",
      "body": "Quote from: _act_ on July 30, 2023, 04:56:16 AMI do not like to see people using P2P for centralized exchanges. The centralized exchanges has been confusing people about it. P2P means the exchange should be without any intermediary but the exchanges are the intermediary which make them not to have P2P but another thing entirely. P2P are:exchanging bitcoin directly with another person like on this forumthe use of decentralized exchangesIf we want to call centralized exchange P2P, what should it be called? We need a name on this forum to be calling them. The centralized exchanges have stolen what P2P is. Even many people on this forum are calling them P2P.What about CEP2P? It means centralized exchange P2P.If anyone advertises P2P when it's not, it should be illegal. I have no idea what type of P2P you are talking about but most of the centralized exchanges I know does a P2P keeping itself as a escrow system. Having a escrow in P2P don't make than non-P2P.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "20kevin20",
      "created_time": "July 30, 2023, 11:29:02 AM",
      "body": "Quote from: Yudhisthir on July 30, 2023, 10:35:39 AMIf anyone advertises P2P when it's not, it should be illegal. I have no idea what type of P2P you are talking about but most of the centralized exchanges I know does a P2P keeping itself as a escrow system. Having a escrow in P2P don't make than non-P2P.Doesn’t escrow make the transaction non-p2p? Here you got me confused, I thought p2p means from me directly to you?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "royalfestus",
      "created_time": "July 30, 2023, 11:50:44 AM",
      "body": "The centralized exchange plays a crucial role as an escrow service, securely holding both cryptocurrency and fiat currency from both parties to facilitate trustworthy transactions. In contrast, decentralized exchanges face challenges, particularly in peer-to-peer transactions involving fiat from banks. Nevertheless, the centralized exchange fulfills its purpose effectively, and I am satisfied with its performance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "July 30, 2023, 01:59:50 PM",
      "body": "OP, I think you are right, but when generalising it, you call it all P2P, but if you want to be specific, then you can specify which one you are really talking about. like CEX-P2P, DEX-P2P, and normal P2P, which doesn't even involve any intermediaries. Like, for example, If you find any real person in your location who wants to sell their Bitcoin for USDt, and perhaps you are interested, you can just pay him the dollar value of his asset, and he will transfer it to you. That's the real P2P you mean. Generally, all are P2P, just that anyone you are involved with, you should know the type of P2P it is without being told.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "July 30, 2023, 02:08:07 PM",
      "body": "Quote from: Yudhisthir on July 30, 2023, 10:35:39 AMIf anyone advertises P2P when it's not, it should be illegal. I have no idea what type of P2P you are talking about but most of the centralized exchanges I know does a P2P keeping itself as a escrow system. Having a escrow in P2P don't make than non-P2P.P2P meaning already expand just like staking which is originally to pledge your token to help for blockchain delegation which is now also use on DeFi as staking meaning holding your tokens on a smart contract address in exchange for profit yield. The currency P2P that being use by the exchange is what many average joe crypto people understand its meaning and not the real peer to peer network like the Bitcoin transactions. Exchange use P2P concept because trader directly trade to each other without interference of exchange. This is the centralized P2P like staking on DeFi. We can't control what will be the definition of a P2P because there's no copyright on this word.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}