{
  "id": "topic_5418811",
  "title": "PawGo",
  "author": "PawGo",
  "created_time": "October 30, 2022, 10:26:45 AM",
  "content": "Macie jakieś opinie na temat ALGO? A może więcej niż opinie, wskazówki, porady, ostrzeżenia?Temat jest interesujący, wpadł mi w oko i myśle czy nie przyjąć pozycji (long rzecz jasna). Oficjalne papiery trzeba pewnie brać jak zwykle z przymrużeniem oka i dzielić na 2, ale kto wie co z tego wyjdzie. A sezon na alty może znów nadejdzie.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418811",
  "comments": [
    {
      "author": "wwzsocki",
      "created_time": "October 31, 2022, 09:36:19 PM",
      "body": "Quote from: PawGo on October 30, 2022, 10:26:45 AMMacie jakieś opinie na temat ALGO?...projekt bardzo ciekawy i interesowałem sie nim na samym początku, jak zawsze, pózniej straciłem go z oczuna pewno ALGO jest warte uwagi, jezeli sezon na alty sie zacznie, cena powinna rosnąćzgadzam sie ze jezeli kupowac ALGO to właśnie chyba teraz kiedy lezy na łopatkach",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PawGo",
      "created_time": "November 01, 2022, 02:29:18 PM",
      "body": "Quote from: wwzsocki on October 31, 2022, 09:36:19 PMzgadzam sie ze jezeli kupowac ALGO to właśnie chyba teraz kiedy lezy na łopatkachTeż tak myślę. Może zaryzykuję i przestawię swoje DCA w większym stopniu właśnie na ALGO. No ale zmienność jest, świeczki 4h wielkie jak wieżowce.Poczekamy zobaczymy, zainteresował mnie projekt, kusiło mnie od dłuższego czasu żeby zejść z głównego nurtu i pomyślałem że jeśli alt to własnie ten.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "November 02, 2022, 12:28:57 PMLast edit: November 02, 2022, 05:33:50 PM by Tytanowy Janusz",
      "body": "1- dlaczego akurat algo2- jakie przewagi ma Algo ponad konkurencją 3- jakie są szanse na to, że kunkurencja nadrobi czyli jak trwałe są te przewagi4- jaką część rynku krypto posiada algo (nie pod względem kapitalizacji a zasięgów, liczby użytkowników, wpływ na otoczenie)5- czy przewagi Algo uzasadniają kapitalizację rzędu 2.5 mld$?6- jaka jest inflacja monetarna na projekcie? Moim zdaniem odpowiedzenie sobie na te pytania to minimum przed inwestycją. Jak będziesz to robił dla siebie to podziel sie z nami proszę",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PawGo",
      "created_time": "November 06, 2022, 03:25:49 PM",
      "body": "Myślę że pompa która jest od kilku(nastu) dni to granie pod World Cup i jakaś próba zmonetyzowania umowy którą mają z FIFA. Kiedy można puszczać NFT i inne tego typu obrazki jeżeli nie na największej imprezie?  Po grudniu (albo i w trakcie) zapewne czeka nas spadek, niewykluczone że proporcjonalny do niespełnionych oczekiwań.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wwzsocki",
      "created_time": "November 07, 2022, 04:42:28 AM",
      "body": "Quote from: PawGo on November 06, 2022, 03:25:49 PMMyślę że pompa która jest od kilku(nastu) dni to granie pod World Cup i jakaś próba zmonetyzowania umowy którą mają z FIFA...jestes pewien ze to chodzi o projekt ALGO a nie  Socios na łancuchu Chillz, lub jeden z tokenów klubowych jak JUV (Juventus Fan Token)? ALGO maja jakas umowę z Fifa?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PawGo",
      "created_time": "November 07, 2022, 07:42:10 AM",
      "body": "Quote from: wwzsocki on November 07, 2022, 04:42:28 AMALGO maja jakas umowę z Fifa? No wyglada na to że mają, i że to nie tylko kawałek papieru. Ale cóż - dopóki nie zobaczę ich reklam w czasie meczu to nie uwierzę ;-)https://www.fifa.com/about-fifa/commercial/media-releases/fifa-to-launch-fifa-collectQuoteFIFA+ Collect is powered by Algorand, the official blockchain platform of FIFA and the technology of choice for over 2,000 global organisations, governments and digital-native decentralised finance applications. It is a low-cost, carbon neutral blockchain accessible via multiple currencies and payment methods.  “FIFA’s platform – via a truly decentralised and scalable public blockchain – is the first tangible representation of the technical partnership recently announced between FIFA and Algorand,” said W. Sean Ford, interim CEO of Algorand.  “The commitment FIFA has made to bridge to Web3 enabled by Algorand, is a testament to their innovative spirit and desire to directly and seamlessly engage with football fans around the world.”",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wwzsocki",
      "created_time": "November 07, 2022, 06:53:41 PM",
      "body": "Quote from: PawGo on November 07, 2022, 07:42:10 AMNo wyglada na to że mają...https://www.fifa.com/about-fifa/commercial/media-releases/fifa-to-launch-fifa-collectDzięki za te informacje. No popatrz, popatrz i to jest oficjalne, potwierdzone przez FIFA:https://www.fifa.com/about-fifa/president/media-releases/fifa-announces-partnership-with-blockchain-innovator-algorand",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dwminer1",
      "created_time": "November 11, 2022, 04:58:35 PM",
      "body": "Quote from: PawGo on November 06, 2022, 03:25:49 PMMyślę że pompa która jest od kilku(nastu) dni to granie pod World Cup i jakaś próba zmonetyzowania umowy którą mają z FIFA. Kiedy można puszczać NFT i inne tego typu obrazki jeżeli nie na największej imprezie?  Po grudniu (albo i w trakcie) zapewne czeka nas spadek, niewykluczone że proporcjonalny do niespełnionych oczekiwań.Śledzę kurs ALGO od jakiegoś czasu i zwykle na koniec każdego kwartału widzimy wzrosty, co zapewne jest spowodowane zbliżającą się możliwością dołączenia do stakingu. Staking ALGO daje 10-14% APY i odbywa się w 3-miesięcznych cyklach. Więcej na ten temat tutaj: https://governance.algorand.foundation/governance-period-5  Generalnie to ciekawy projekt i myślę, że w longterm może przynieść zyski. Promocja poprzez MŚ z pewnością będzie miała pozytywny efekt na rozpoznawalność projektu. Co ciekawe to nie jedyny duży projekt z branży krypto, który jest sponsorem imprezy. Jednym ze sponsorów jest również Crypto.com (https://www.fifa.com/tournaments/mens/worldcup/qatar2022/media-releases/crypto-com-unveiled-as-fifa-world-cup-qatar-2022-tm-official-sponsor), ale akurat ta giełda chętnie angażuje się w sport, jest np. sponsorem tytularnym hali Crypto.com Arena w Los Angeles, gdzie na co dzień grają zespoły NBA, Lakers i Clippers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}