{
  "id": "topic_5468533",
  "title": "ZeeshanTrade",
  "author": "ZeeshanTrade",
  "created_time": "September 29, 2023, 10:03:24 AM",
  "content": "I read this in one of the campaign threads and am curious to know how to check post bursting through this site ?Quote from: icopress on September 27, 2023, 07:40:35 AM➥ Post bursting is not allowed, moreover it is easy to check with ninjastic.space.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468533",
  "comments": [
    {
      "author": "Cantsay",
      "created_time": "September 29, 2023, 10:04:44 AM",
      "body": "Quote from: ZeeshanTrade on September 29, 2023, 10:03:24 AMI read this in one of the campaign threads and am curious to know how to check post bursting through this site ?Quote from: icopress on September 27, 2023, 07:40:35 AM➥ Post bursting is not allowed, moreover it is easy to check with ninjastic.space.I guess you can use the time difference between when the posts were made. With ninjastic.space you can easily see when users made all their posts within a selected time so if a campaign manager checks and see that an user just comes to the forum drops all his/her post for that day between 30 minutes they spent on the forum and if they continue with it they’ll mostly be removed from the campaign because posts like that don’t actually give the exposure that the campaign manager is looking for the company that’s been promoted.Although, I haven’t checked for burst posting before so I’m not sure if it actually shows an indicator for a bursted post so the answer I gave is the way I’d check if there’s no automatic indicator.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "September 29, 2023, 10:50:13 AM",
      "body": "Quote from: ZeeshanTrade on September 29, 2023, 10:03:24 AMI read this in one of the campaign threads and am curious to know how to check post bursting through this site ?Quote from: icopress on September 27, 2023, 07:40:35 AM➥ Post bursting is not allowed, moreover it is easy to check with ninjastic.space.On https://ninjastic.space/, you will see the menu at the left upper side. If you click on the menu, you can enter the username of the person after you click on username. If you enter the username and you search for it, you will see the boards the person is posting more. You can click on the boards and you will see the posts easily and the time each post are made.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "September 29, 2023, 12:48:22 PM",
      "body": "You don't actually need to use ninjastic for burst posting, but it becomes easier there. And in my thought, you are confused about the rule that icopress has wrote. If you wanted to avoid that, then don't make burst posts --> which means, don't make 30 or 50 posts in just 1 hour. Because that is almost impossible and the value it contains will also be lower. So the best practise is to, add value in your posts because adding value will ultimately avoid you from burst posting. You should check this thread out for the Definition of Burstposting To be honest, I didn't consider a valuable post which is made just after another and another. But I consider a post burst posting when there is no value in it. Many might not agree with me but coming back to your query. You just have to avoid making post after one another. But still, you should ask the manager because they might have different definition of burst posting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "September 29, 2023, 01:53:29 PM",
      "body": "Quote from: ZeeshanTrade on September 29, 2023, 10:03:24 AMI read this in one of the campaign threads and am curious to know how to check post bursting through this site ?I believe that the warning is for those users who try to create so many posts in short duration in order to complete their minimum posts. The users who do post bursting are those users who don't give proper time for writing of the posts and they just want to complete their minimum number of posts in order to get their weekly signature payments. Let's say a user makes so many posts of 250 characters in a short span of time in order to meet the requirements of a campaign but none of those posts are constructive and are made in a way to fulfil their campaign requirements only. Quote from: Faisal2202 on September 29, 2023, 12:48:22 PMYou don't actually need to use ninjastic for burst posting, but it becomes easier there. And in my thought, you are confused about the rule that icopress has wrote. If you wanted to avoid that, then don't make burst posts --> which means, don't make 30 or 50 posts in just 1 hour. Because that is almost impossible and the value it contains will also be lower. I think it is not possible for someone to make 30 or 50 posts in an hour. A better example of post bursting should be around 10-15 posts per hour which is also going to be a hard thing for many users. I believe that Icopress warns those users who just want to complete their 25 posts limit as soon as possible and some users may post more than 10 to 15 posts per hour in order to complete their weekly minimum posts for a campaign. I believe that Icopress can explain that better than us and if he takes part in this thread then that will be very helpful for @OP and all those members who don't really understand that warning fully.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "September 29, 2023, 02:20:31 PM",
      "body": "I don’t have the time to check my posts out.But I am a posting mother fucker.I do 10 to 20 posts a day for 11 years and 2 months.I recently needed a bit more income for my projects and took on a signature.So for last 3 weeks I did very close to 400 posts. which is way more than i needed to get max payout .Only 120 posts were needed.I know I am a bit unusual as I am the post leader on the site. But I wonder if it would look like I am burst posting.I just finish eating breakfast 🍳 and plan to be on this site reading and posting for about an hour.I would be interested if it would look like I burst posted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "September 29, 2023, 03:45:08 PM",
      "body": "Ninjastic displays all your post archives on one page (plus some custom filtration settings), that's all I know to draw conclusion about burstposting behavior faster. I think campaign manager has more variety to detect your post habits with this tool.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "skarais",
      "created_time": "September 29, 2023, 04:00:13 PM",
      "body": "The main characteristic of bursting or bursposting is the distance between one post and another, but the distance between posts is not always the benchmark for why you are said to be breaking this rule. The quality of posts may be something that differentiates you and other people even though they post at the same distance.The way it works is quite easy, you just need to enter the username of the user you want to track and track their posts. But it is the manager's responsibility to decide whether participants violate or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "September 29, 2023, 04:37:21 PM",
      "body": "Quote from: SamReomo on September 29, 2023, 01:53:29 PMI believe that Icopress can explain that better than us and if he takes part in this thread then that will be very helpful for @OP and all those members who don't really understand that warning fully.I don't think that particular statement needs any extra explanation, it is pretty straightforward and easy to understand for the campaign participants that it may concern, just don't make too many posts in such a short space of time, it then becomes worse when the posts are of very low quality. CM's would definitely prefer posts that are spread out, but they wouldn't mind users making many high quality posts in quick succession, especially when the participant makes posts above the number the campaign pays for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "September 29, 2023, 04:51:49 PM",
      "body": "Quote from: skarais on September 29, 2023, 04:00:13 PMThe main characteristic of bursting or bursposting is the distance between one post and another, but the distance between posts is not always the benchmark for why you are said to be breaking this rule. The quality of posts may be something that differentiates you and other people even though they post at the same distance.I fully agree with this. If someone writes in short intervals of time, you have to look at the quality of what they write to judge whether it is authentic burst posting or not. Obviously if they are too short, like on average 3 minutes for days and weeks, it's going to be burst posting.Other things to look at would be the lenght and the page they are posting on. I've sometimes posted in short time intervals but because the threads I've replied to weren't even more than a page long, so if I post in a thread that only has the OP, another that has the OP and two short replies and a third similar thread I'm likely to use less time than if I want to reply on page 3.It can also happen that if someone in a short interval writes relatively long posts, surely they have been looking at the forum when they were not logged in and already had a good part of the answer in their head. But this usually happens on an ad hoc basis. Nobody regularly writes long posts in short intervals of time and with quality. By they way, did I actually burst post between here and here?Quote from: philipma1957 on September 29, 2023, 02:20:31 PMI recently needed a bit more income for my projects and took on a signature.So for last 3 weeks I did very close to 400 posts. which is way more than i needed to get max payout .Only 120 posts were needed.I know I am a bit unusual as I am the post leader on the site.I am sure you campaign manager (which is my manager too but on another campaign) is very happy about that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "September 29, 2023, 06:05:22 PM",
      "body": "You should check the time difference between the posts. Let's say I posted here in the forum where the time is e.g. 2:30:20 and then I posted again at 2:35:15 and again at 2:40:30. As you can see, there are 3 posts within 10 mins which it is already considered as posts bursting. You will need to get the user's user ID to check it on ninjastic.space. You may also check the user's post history if you don't want to use the site yet or you may use both at the same time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sexylizzy2813",
      "created_time": "September 29, 2023, 06:52:57 PM",
      "body": "Quote from: Faisal2202 on September 29, 2023, 12:48:22 PMYou don't actually need to use ninjastic for burst posting, but it becomes easier there. And in my thought, you are confused about the rule that icopress has wrote. If you wanted to avoid that, then don't make burst posts --> which means, don't make 30 or 50 posts in just 1 hour. Because that is almost impossible and the value it contains will also be lower.Some people do drop more than 30 post in less than 2-3 hrs. And I ask how do they do that, is it that they use some kind of robot to accomplish that?  Too fast for my liking.Well from Icopress rules you don't have to do things outside the box and when you're in a campaign and when you haven't joined any campaign are two different things all together in terms posting. The way and manner you post when you haven't joined any campaign would be different from when you're in a campaign. Because you post without following any rules when you haven't joined a campaign but when you're in a campaign you must follow the rules of the campaign manager, where and where not to post, so you just have to keep track of those rules of any campaign.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "September 29, 2023, 07:27:58 PM",
      "body": "Quote from: philipma1957 on September 29, 2023, 02:20:31 PMI don’t have the time to check my posts out.But I am a posting mother fucker.I do 10 to 20 posts a day for 11 years and 2 months.I recently needed a bit more income for my projects and took on a signature.So for last 3 weeks I did very close to 400 posts. which is way more than i needed to get max payout .Only 120 posts were needed.I know I am a bit unusual as I am the post leader on the site. But I wonder if it would look like I am burst posting.I just finish eating breakfast 🍳 and plan to be on this site reading and posting for about an hour.I would be interested if it would look like I burst posted.Burst posting is looked at on a case by case basis. You can tell who is posting strictly to get paid and who is posting because they are generally interested in the topic being discussed. Usually burst posters are also doing their posts in 1-2 days and stopping as well for the week. You obviously wouldn't fit into the category as a burst posting spammer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "September 29, 2023, 07:28:01 PM",
      "body": "Quote from: SamReomo on September 29, 2023, 01:53:29 PMI think it is not possible for someone to make 30 or 50 posts in an hour.Why not - you just need to prepare 50 posts in notepad and post them every 15 seconds, 30 seconds, or 1 minute between posts on the thread you want. If you really do it - then I'm sure you can probably post 50 posts in less than 1 hour. Such posting patterns may be rare - but burst posts are always possible among spammers who don't care about quality.Burst posts are about the interval between posts - but if all the posts created are quality posts, then I don't agree that they are considered burst posts. I don't focus on the interval between posts as long as the posts are meaningful - so I tend not to check who is doing it other than reporting low quality posts if I find them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "September 29, 2023, 07:28:11 PM",
      "body": "Quote from: Sexylizzy2813 on September 29, 2023, 06:52:57 PMSome people do drop more than 30 post in less than 2-3 hrs. And I ask how do they do that, is it that they use some kind of robot to accomplish that?  Too fast for my liking.Hmm, are you serious like its just 2-3 hours, I used to regularly read and post and take around 2-3 days to make 30 posts.. Yes there's a condition if they have any discussion locally this target can be achieved much faster but still, it will take 2 days at least. A maximum in that conversation as well you are going to be able to cover a maximum of 10 posts.In my view, Brust Posting is a kind of activity that can be directly defined as a person trying to cover 5 to 6 posts for his signature Quota in a short time period of 1 hour or a maximum of 1 hour and 20 minutes. A natural poster at least spends around 2 hours a day on the forum this is what I think if he does track his mentions and posts regularly. A person who spends around 1 hour filling out the post quota, for the signature campaign is absolutely abusing the campaign rules.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "September 29, 2023, 07:39:31 PM",
      "body": "Quote from: skarais on September 29, 2023, 04:00:13 PMThe main characteristic of bursting or bursposting is the distance between one post and another, Quote from: nakamura12 on September 29, 2023, 06:05:22 PMYou should check the time difference between the posts.The time between the posts is not the only thing that defines post bursting it can also be how much the posts are spaced out. Some users don't log in for 5 days then come online 2 days to the end of the week and make 25 posts or whatever amount is the maximum in their campaign.Ninjastic space helps to check all these, but it can be seen easily on the latest post page.The most important factor for me should be the quality of the posts being made and how habitually the user burst posts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "September 29, 2023, 07:59:29 PM",
      "body": "Quote from: _BlackStar on September 29, 2023, 07:28:01 PMQuote from: SamReomo on September 29, 2023, 01:53:29 PMI think it is not possible for someone to make 30 or 50 posts in an hour.Why not - you just need to prepare 50 posts in notepad and post them every 15 seconds, 30 seconds, or 1 minute between posts on the thread you want. If you really do it - then I'm sure you can probably post 50 posts in less than 1 hour. Such posting patterns may be rare - but burst posts are always possible among spammers who don't care about quality.Well, that's a valid concern but I don't think that anyone will prepare 50 posts in notepad and post them every 15 seconds as that really don't make sense at all in real life but yes as a theory you're right it can happen. The participants in signature campaigns will never do something like that and that's somewhat impossible for them. Most of the participants spend time on forum rather than giving time to notepad in order to write those posts altogether.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "September 29, 2023, 08:01:52 PM",
      "body": "Quote from: nakamura12 on September 29, 2023, 06:05:22 PMYou should check the time difference between the posts. Let's say I posted here in the forum where the time is e.g. 2:30:20 and then I posted again at 2:35:15 and again at 2:40:30. As you can see, there are 3 posts within 10 mins which it is already considered as posts bursting. You will need to get the user's user ID to check it on ninjastic.space. You may also check the user's post history if you don't want to use the site yet or you may use both at the same time.Yeah I am thinking that this does not count in my case. As I may do that 4 times in a day and 35 days in a row.Also my campaign needs 40 posts a week for max payment and last week I posted 122 times.I did not think it was manual and that it tries to auto detect the posts.Now I see it may just show 3 in ten and then the campaign guy looks at it. Makes a decision if there are enough good posts made.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oilacris",
      "created_time": "September 29, 2023, 08:17:37 PM",
      "body": "Quote from: Upgrade00 on September 29, 2023, 07:39:31 PMQuote from: skarais on September 29, 2023, 04:00:13 PMThe main characteristic of bursting or bursposting is the distance between one post and another, Quote from: nakamura12 on September 29, 2023, 06:05:22 PMYou should check the time difference between the posts.The time between the posts is not the only thing that defines post bursting it can also be how much the posts are spaced out. Some users don't log in for 5 days then come online 2 days to the end of the week and make 25 posts or whatever amount is the maximum in their campaign.Ninjastic space helps to check all these, but it can be seen easily on the latest post page.The most important factor for me should be the quality of the posts being made and how habitually the user burst posts.Most of campaign managers arent really that too much in concern about those post burst unless if they are really that trying to cope up with signature count or requirement on last dayand this is why they do set out a specific number of days which you would really be needing to post or having that maximum post per day to avoid such coping behavior on which it would really be that resulting into post burst specially if you are really that a short time.There are also managers who dont really care that much as long those post are really that relevant or something that constructive. Totally situational and in speaking about on OP question on how to check it out, then it wont really be that necessary on making use of ninjastic.space because you could directly check out users profile and see for yourself on how much time gaps that they are really that doing in every post they made.It is really just that impossible that you couldbe only be able to make constructive post on having 3-5 minutes timeframe difference on which i have some seen users to be like this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "September 29, 2023, 08:32:04 PM",
      "body": "Quote from: SamReomo on September 29, 2023, 07:59:29 PMQuote from: _BlackStar on September 29, 2023, 07:28:01 PM-snip-Well, that's a valid concern but I don't think that anyone will prepare 50 posts in notepad and post them every 15 seconds as that really don't make sense at all in real life but yes as a theory you're right it can happen. The participants in signature campaigns will never do something like that and that's somewhat impossible for them. Most of the participants spend time on forum rather than giving time to notepad in order to write those posts altogether.LOL - of course, I wouldn't say it's a make sense to do but that's something that occurred to me about how someone would make burst post up to 50 post in 1 hour.I would actually say it's crazy if someone ever did it - but it's always possible to create a natural posting rate of 50 - 100 posts per week if they spend more time on forum than in the real world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}