{
  "id": "topic_5422968",
  "title": "Elena_Rodriguez",
  "author": "Elena_Rodriguez",
  "created_time": "November 24, 2022, 11:14:18 AM",
  "content": "A huge Bitcoin movement in Bearish marketA big Whale exchange of nearly 10,000BTC was recorded recently which has been now linked to the failed BTC exchange, Mt.GOX.Mt.Gox has moved 10K BTC to two different addresses. Whale transfers are not uncommon, but current bearish market conditions at the moment are very diverse. The cryptos are falling because of the bearish market and one report about any company going bankrupt or firm being insolvent makes who crypto market and prices go low.News Source: CoinpediaWhat's your comment on these Failed Bitcoin Exchange?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5422968",
  "comments": [
    {
      "author": "janggernaut",
      "created_time": "November 24, 2022, 02:23:20 PM",
      "body": "My first comment is, why you posted on scam accusation thread about that 10k bitcoins moving? Nothing we can avoid, even that whale just dump all of his bitcoin, we can only do 2 things, just keep Hodl or buying the dip when he dumped his bitcoins. No need reason to sell as well when he dumped.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "November 26, 2022, 05:30:35 AM",
      "body": "Even though 10K was moved they only transferred I think like 20 BTC to hit BTC and the rest was change. The input was 10K and 20btc went to hit BTC and rest was the change, so the entire amount didn’t move.Which makes you wonder why sell it now when you could have when Bitcoin was $50K. Makes it seem like someone got out of jail recently and moving his stolen funds around.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "November 26, 2022, 10:08:56 AM",
      "body": "What will 10,000 bitcoins do to the price in a day or future prediction? It is equal to 30% daily trading amounts, and whenLUNA was sold 50,000 bitcoins, all that panic occurred. not 10KMt.Gox case and all its consequences are in court, and therefore the sequence of the process will be slow, and we may need additional years to solve this problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "November 26, 2022, 03:36:41 PM",
      "body": "Quote from: hugeblack on November 26, 2022, 10:08:56 AMMt.Gox case and all its consequences are in court, and therefore the sequence of the process will be slow, and we may need additional years to solve this problem.Maybe it will take them many more years to compensate everyone who officially requested it, but the investigations and the courts ended a long time ago and now the whole thing is in its final phase. Fortunately, the whole thing happened in a country like Japan, known for its great efficiency and high level of justice - imagine if Mt.Gox had its headquarters in Russia or China Quote from: https://newsbtc.com/news/bitcoin/will-mt-gox-release-the-140k-btc-on-january-2023-repayment-methods-revealed/Will the Mt. Gox class prove to be holders or will they sell it all as soon as they get it? That’s a question for another day, since the Mt. Gox class has until January 10th, 2023, to complete registration and select their preferred payment method.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "November 27, 2022, 05:44:12 AM",
      "body": "Quote from: hugeblack on November 26, 2022, 10:08:56 AMWhat will 10,000 bitcoins do to the price in a day or future prediction? It is equal to 30% daily trading amounts, and whenLUNA was sold 50,000 bitcoins, all that panic occurred. not 10KMt.Gox case and all its consequences are in court, and therefore the sequence of the process will be slow, and we may need additional years to solve this problem.Even if this was 100K bitcoin, the market is not going to respond in a negative way because these are stolen funds and they can't easily be sold. The coins are flagged and whereever they get sent they will most likely get frozen.Many exchanges have blacklists and if there are tainted coins depositted into it then they are frozen. Even if they don't have this address blacklisted, many people who track the coins onchain will email the exchange and tell them to do so. They will have no choice, they won't allow them to be transacted with at the exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "November 28, 2022, 06:53:28 AM",
      "body": "Quote from: Elena_Rodriguez on November 24, 2022, 11:14:18 AMNews Source: CoinpediaKindly edit and use a url link so that those who are interested in the story can follow up more on it. It's not enough to just put a site name. Quote from: adaseb on November 27, 2022, 05:44:12 AMThe coins are flagged and whereever they get sent they will most likely get frozen.Many exchanges have blacklists and if there are tainted coins depositted into it then they are frozen.This part gladdens my heart. At least it keeps criminals at distance and enforces them to think deep. It's not going to be an easy route like just hack and sell off, leaving investors in sorrow and huge loss. I will be happy if that is meticulously applied and executed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Edwardard",
      "created_time": "November 28, 2022, 07:11:11 AM",
      "body": "Quote from: Mpamaegbu on November 28, 2022, 06:53:28 AMKindly edit and use a url link so that those who are interested in the story can follow up more on it. It's not enough to just put a site name.True, btw I just found the link on google for the OP and others to make it easier, https://coinpedia.org/news/10k-btc-linked-to-mt-gox-moved-what-is-the-failed-bitcoin-exchange-doing/Quote from: Mpamaegbu on November 28, 2022, 06:53:28 AMThis part gladdens my heart. At least it keeps criminals at distance and enforces them to think deep. It's not going to be an easy route like just hack and sell off, leaving investors in sorrow and huge loss. I will be happy if that is meticulously applied and executed.Yea, thats one of the advantages of having cexs' in the crypto space. However we have seen recently how one ftx hacker drained his eth using bridges, swapping it for renBTC causing a crash in the eth price (although the crash wasnt that significant) Source: Coinpedia, So, the point is hacker can use dexes to manipulate the price if they cant sell on cex?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "November 28, 2022, 08:29:48 AM",
      "body": "Quote from: Edwardard on November 28, 2022, 07:11:11 AMQuote from: Mpamaegbu on November 28, 2022, 06:53:28 AM~snipped~However we have seen recently how one ftx hacker drained his eth using bridges, swapping it for renBTC causing a crash in the eth priceThat's a serious level of sophistication in there. I've always been of the opinion that most exchange hacks are executed by in-house staff. The way these scammers move the stolen coins around shows they aren't noobs in the crypto space. Talking about coins been able to get tracked and frozen on Cexs if found to be tainted, citing the FTX case; why wasn't it stopped? The hacker was able to move funds freely. Why wasn't it frozen immediately the hack was discovered?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "November 28, 2022, 08:47:14 AM",
      "body": "As you've said, whales moving a lot of bitcoin are no longer uncommon. Whether it's from Mt.Gox or any exchange, there will always be transfers that will happen.Having that much bitcoins that should be refunded to the affected users of it is hard to be dumped at all once and whoever who has it now, knows that fact.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ryker1",
      "created_time": "November 28, 2022, 09:33:25 AM",
      "body": "Well right, there will be more transfers that happen --I have commented previously that there is $1.5 billion worth of bitcoin on coinbase. How many exhcnage will experience like this because of the FUD that was brought by CZ? People now have panicked and I don't know if that is individual investors or a big whale trying to move out their bitcoin. Perhaps the hacker of Mt.Gox thinks that it is now the right way to move your bitcoin because there is a lot of traffic in the network and P2P exchanges now have high liquidity due to the massive transfer of bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "November 28, 2022, 01:33:07 PM",
      "body": "Quote from: janggernaut on November 24, 2022, 02:23:20 PMNothing we can avoid, even that whale just dump all of his bitcoin, we can only do 2 things, just keep Hodl or buying the dip when he dumped his bitcoins. No need reason to sell as well when he dumped.You are right, some of our people does not comprehend the investment of Bitcoin during the bearish market and bullish season, in actual sense for people who have known the genesis of cryptocurrency investment, they do not invest in shitcoins during the period of bullish market, i believe that keeping your coin when the market is on bullish is the best method of investment, some people do panic and sell out their Bitcoin when market is going more dip, the only way we can make profit via cryptocurrency investment is through long hold of Bitcoin and buying addition of Bitcoin for investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "November 28, 2022, 02:56:50 PM",
      "body": "Quote from: GeorgeJohn on November 28, 2022, 01:33:07 PMQuote from: janggernaut on November 24, 2022, 02:23:20 PMNothing we can avoid, even that whale just dump all of his bitcoin, we can only do 2 things, just keep Hodl or buying the dip when he dumped his bitcoins. No need reason to sell as well when he dumped.You are right, some of our people does not comprehend the investment of Bitcoin during the bearish market and bullish season, in actual sense for people who have known the genesis of cryptocurrency investment, they do not invest in shitcoins during the period of bullish market, i believe that keeping your coin when the market is on bullish is the best method of investment, some people do panic and sell out their Bitcoin when market is going more dip, the only way we can make profit via cryptocurrency investment is through long hold of Bitcoin and buying addition of Bitcoin for investment.The line that I bolded above made me confused. Because usually when I see that my profit was there when there's a bull trend market, I cut it off so that I already have my profit and the rest just keep it again for an investment for a long period of time.  Quote from: livingfree on November 28, 2022, 08:47:14 AMAs you've said, whales moving a lot of bitcoin are no longer uncommon. Whether it's from Mt.Gox or any exchange, there will always be transfers that will happen.Having that much bitcoins that should be refunded to the affected users of it is hard to be dumped at all once and whoever who has it now, knows that fact.AFAIK, there's a going investigation about the Mt.Gox scam and I think if this is not a whale, it's a scammer trying to move away his Bitcoin holding. The big question here is no one will really know, once that address owner will use the mixing service, it will surely disappear and no one can trace where that transaction is. Another reason why the market can't quickly recover.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "November 28, 2022, 04:08:48 PM",
      "body": "Quote from: adaseb on November 27, 2022, 05:44:12 AMQuote from: hugeblack on November 26, 2022, 10:08:56 AMWhat will 10,000 bitcoins do to the price in a day or future prediction? It is equal to 30% daily trading amounts, and whenLUNA was sold 50,000 bitcoins, all that panic occurred. not 10KMt.Gox case and all its consequences are in court, and therefore the sequence of the process will be slow, and we may need additional years to solve this problem.Even if this was 100K bitcoin, the market is not going to respond in a negative way because these are stolen funds and they can't easily be sold. The coins are flagged and whereever they get sent they will most likely get frozen.Many exchanges have blacklists and if there are tainted coins depositted into it then they are frozen. Even if they don't have this address blacklisted, many people who track the coins onchain will email the exchange and tell them to do so. They will have no choice, they won't allow them to be transacted with at the exchange.So what the OP is worried about is that even this move has happened many times which we have seen as well as Mt.gox moving 10k bitcoins for me indeed it will not affect the market and will not just fall because the market will remain in the same situation.Obviously I can assure you that if it was stolen funds transferred by Mt.gox, the funds would have been frozen on the stock exchange, some people would have reported that if it was true that the funds had been moved for sale, so I was not surprised and not the least bit worried because the bitcoin market reaction won't be that negative.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahanton",
      "created_time": "November 28, 2022, 05:28:57 PM",
      "body": "Quote from: ajiz138 on November 28, 2022, 04:08:48 PMQuote from: adaseb on November 27, 2022, 05:44:12 AMQuote from: hugeblack on November 26, 2022, 10:08:56 AMWhat will 10,000 bitcoins do to the price in a day or future prediction? It is equal to 30% daily trading amounts, and whenLUNA was sold 50,000 bitcoins, all that panic occurred. not 10KMt.Gox case and all its consequences are in court, and therefore the sequence of the process will be slow, and we may need additional years to solve this problem.Even if this was 100K bitcoin, the market is not going to respond in a negative way because these are stolen funds and they can't easily be sold. The coins are flagged and whereever they get sent they will most likely get frozen.Many exchanges have blacklists and if there are tainted coins depositted into it then they are frozen. Even if they don't have this address blacklisted, many people who track the coins onchain will email the exchange and tell them to do so. They will have no choice, they won't allow them to be transacted with at the exchange.So what the OP is worried about is that even this move has happened many times which we have seen as well as Mt.gox moving 10k bitcoins for me indeed it will not affect the market and will not just fall because the market will remain in the same situation.Obviously I can assure you that if it was stolen funds transferred by Mt.gox, the funds would have been frozen on the stock exchange, some people would have reported that if it was true that the funds had been moved for sale, so I was not surprised and not the least bit worried because the bitcoin market reaction won't be that negative.10k Bitcoins might not be much but if we do really mind off about on the emotional aspect which could possibly affect the market as a whole which yes i do mean about FUD.When this thing is on the move then this market turns out to be easily be fucked up and would slide down or make some snowball effect.Its true that it isnt really that surprising thatstolen funds would really be moved out considering that someone who do stole it then it is just typical that it would be having that full control and able to see if they wanted to.Its true that once those stolen funds moved out on an known exchange then tendency that those would be locked up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cozytrade",
      "created_time": "November 28, 2022, 06:23:10 PM",
      "body": "I haven't tracked the recent event about Mt.Gox case. Investors get their funds back from that exchange? Isn't they suppose to get their funds back in September 2022? If that fund has been distributed, it's normal to see some volatility. Old investors are still in big profits, so many of them might want to sell off some of their holdings. I am more interested in Genesis right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "November 28, 2022, 09:18:32 PM",
      "body": "Honestly these type of news always happen and talked about, and yet I have never seen anything bad come out of it. Nobody really cares, what the market cares about is superficial idiotic things, not the real movements and that's a bit sad. 10K bitcoins moved and nobody cares about it, watch how Elon could ruin or increase the market tomorrow if he decided to do it. That is a sad reality but he can, with just a single tweet for example. This is a proof that people care about what they can't control, and do not care about the tangible real things that they can see. I would personally be scared more of this than a tweet, but I am no longer like that, because of the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "November 28, 2022, 10:02:03 PM",
      "body": "Quote from: cozytrade on November 28, 2022, 06:23:10 PMI haven't tracked the recent event about Mt.Gox case. Investors get their funds back from that exchange? Isn't they suppose to get their funds back in September 2022? If that fund has been distributed, it's normal to see some volatility. Old investors are still in big profits, so many of them might want to sell off some of their holdings. I am more interested in Genesis right now.The last time I read about the Mt Gox Bitcoin rehab planned on sending the estimated Bitcoin to the 2014 exchange hacked victims. They have already approved the plan but the day for the distribution is not authorized or provided.However, if the distribution will happen I believe some powerful people will be the first to receive their share which could be the reason why we see 10K BTC link to the  Mt Gox 141,686 Bitcoins on the move.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "November 28, 2022, 10:14:28 PM",
      "body": "Quote from: sheenshane on November 28, 2022, 02:56:50 PMQuote from: livingfree on November 28, 2022, 08:47:14 AMAs you've said, whales moving a lot of bitcoin are no longer uncommon. Whether it's from Mt.Gox or any exchange, there will always be transfers that will happen.Having that much bitcoins that should be refunded to the affected users of it is hard to be dumped at all once and whoever who has it now, knows that fact.AFAIK, there's a going investigation about the Mt.Gox scam and I think if this is not a whale, it's a scammer trying to move away his Bitcoin holding. The big question here is no one will really know, once that address owner will use the mixing service, it will surely disappear and no one can trace where that transaction is. Another reason why the market can't quickly recover. That's the sad part.When the guy uses mixing service, it's going to be harder for the funds to get tracked. I don't blame the market being down for moves like this, it's just transfers and there's nothing to look about.But when it touches the exchanges, whoever owns that might dump it and that's where the market shall be moved. In return, we think that it's harder to look at the market to recover but eventually, it's going to come.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kawetsriyanto",
      "created_time": "November 28, 2022, 11:53:36 PM",
      "body": "Quote from: Elena_Rodriguez on November 24, 2022, 11:14:18 AMA big Whale exchange of nearly 10,000BTC was recorded recently which has been now linked to the failed BTC exchange, Mt.GOX.Mt.Gox has moved 10K BTC to two different addresses.Are you talking about this news https://cointelegraph.com/news/10-000-btc-moves-off-crypto-wallet-linked-to-mt-gox-hack?That 10k BTC is suspected as the Bitcoin was stolen in Mt. Gox hack case several years ago. I prefer to call him a hacker or thief than call him a whale. Quote from: Elena_Rodriguez on November 24, 2022, 11:14:18 AMWhat's your comment on these Failed Bitcoin Exchange? I don't think we are discussing a failed exchange, it is about the movement of a big number of BTC related to Mt. Gox hack case.Quote from: Elena_Rodriguez on November 24, 2022, 11:14:18 AMNews Source: CoinpediaPlease enclose a clear source. Don't only write the site link, write the article link!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}