{
  "id": "topic_5444208",
  "title": "UmerIdrees",
  "author": "UmerIdrees",
  "created_time": "March 10, 2023, 05:52:10 AM",
  "content": "These days bitcoin and the crypto market is very much dependent on the news and on economic events like CPI data, Initial Claims, Unemployment Rate and more.Being a crypto lover, we are always in search of these events' dates and the numbers. I am sharing with you one site which you can bookmark and get all the details of such events in one place.https://finviz.com/calendar.ashxBy the way, if you have another good site for this data, do share it here for everyone's benefit.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444208",
  "comments": [
    {
      "author": "EarnOnVictor",
      "created_time": "March 10, 2023, 07:59:21 AMLast edit: March 10, 2023, 01:42:06 PM by EarnOnVictor",
      "body": "People often disregard it when I tell them that the US economic data has both short and long-term effects on the price of Bitcoin, I'm glad that I am beginning to see others showing interest as well.We can't deny the fact, since there is a market called BTC/USD, and the USD is a powerful currency in the world, all the important news of the US will certainly have a direct and indirect impact on Bitcoin.As per your request, sites like https://forexfactory.com, https://actionforex.com and https://investing.com among many others are good places to get economic calendar news.In addition, people should also note that some important US news (NFP, Unemployment rate and Average hourly earnings) that might further affect BTC this week would be released today at 1:30 PM GMT.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gayong88",
      "created_time": "March 10, 2023, 08:29:48 AM",
      "body": "Bitcoin and cryptocurrencies depend on various events to increase their value and it is therefore a good idea to bookmark any website that provides all the data useful to crypto traders. Very interesting information OP, It easily gets all the details of various economic events and in turn one can make a plan accordingly. it will also help to get an idea of what is going on in the crypto world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "March 14, 2023, 07:18:41 AM",
      "body": "Given recent events, the US debt ceiling will become a major issue in 2023. US state programs will be funded until june - july 2023. At which time, representatives may opt to raise the debt ceiling. There are many options and negotiations on the table. Some are proposing a selective process of paying some budgetary obligations while ignoring others. Politicians are up in arms over this. I'm suprised there isn't more discussion on the topic. Given the potential consequences and impact it could have upon americans standard of living.April 2023 could also be a big month. Some have claimed russia could default on its bonds around that timeframe.The US Presidential race being around the corner in 2024. It has become standard policy for most key presidential candidates to begin campaigning roughly 1.5 years before the elections occur. We're nearing that timeframe now. Which could make things interesting. As far as economic and financial policy go. I for one am hoping politicians will get soft on crypto proposals to pander to voters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "March 14, 2023, 08:44:24 PM",
      "body": "Quote from: EarnOnVictor on March 10, 2023, 07:59:21 AMPeople often disregard it when I tell them that the US economic data has both short and long-term effects on the price of Bitcoin, I'm glad that I am beginning to see others showing interest as well.Actually, i believe that, Because things that happen in front of eyes are not ignorable like the effect of inflation, lower GDP, and less employment which will discourage the crypto users to take risk of investing their savings in the market as they are already bearing the bad economic conditions. As of today, one friend told me about selling his property to buy 1 BTC, he asked (consulted) with his father as his father has also good knowledge of the crypto industry. And his father replied, \"Economy of our country is not in our favor and we can not sell our like savings (property value) on BTC and who knows if we buy it and it comes down and we have to face an emergency due to economic or any other natural events that require immediate money then we have to withdraw it in loss and i do not think we can bear the loss\" so after hearing his words i agreed with him and there is also no doubt in his theory. As an accountant, his father measures all the possibilities and takes early precautions. No doubt, they may make money out of it but they are not willing to think about it ( why?) if someone spends 10 years of savings and invest in property and then sales the property to buy risky assets (it's not that risky but economy makes it harder) than obviously, nobody will give it a try. Quote from: EarnOnVictor on March 10, 2023, 07:59:21 AMAs per your request, sites like https://forexfactory.com, https://actionforex.com and https://investing.com among many others are good places to get economic calendar news.Add these websites too, CoinMarketCal, i think for better and quick infor about economic events can easily be get from  country based calendars like Trading Economics US Calendar, FXStreet US Calendar, and Econoday US Calendar. Quote from: UmerIdrees on March 10, 2023, 05:52:10 AMsnipI must say my whole journey was a lie. because I never came to know about these websites like never think that they have economic Calendars. after reading your post i do a little research and i admit that its my laziness to not look for it. these are really good sites with valuable datasets. No doubt News cycle has a great impact on the crypto industry and now i will observe the accuracy of these Economic Calendar websites too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UdtaParinda1",
      "created_time": "March 15, 2023, 07:18:19 PM",
      "body": "Quote from: Faisal2202 on March 14, 2023, 08:44:24 PMI must say my whole journey was a lie. because I never came to know about these websites like never think that they have economic Calendars. after reading your post i do a little research and i admit that its my laziness to not look for it. these are really good sites with valuable datasets. No doubt News cycle has a great impact on the crypto industry and now i will observe the accuracy of these Economic Calendar websites too.  I am wondering that \"No doubt News cycle has a great impact \" you are saying this as even being so long with crypto never you realized that tweets and media reports and On chain analysis etc etc .. always manipulate the market especially in the critical times even from long time US inflation and CPI reports are impacting the bitcoin rally greatly.In financial world whenever a big company try to over look their greed to make money they lose and they cause a major panic in market i have some historical such moves in market and some recent ones worth mentioning as LUNA and SVB.In Luna case in greed of their spreading market dominance they signed about $1B UST minting deal with some central authority i am not sure about the name here and that central authority or organization played their trump card to make money from their $3B market and it cause about $40B to $60B instant wipeout from single project and whole crypto market faced instant $300B+ market capital loss figures are estimated but that not wrong at all. That was monopoly LUNA signed deal they dumped UST and it got DE pegged and then the team made last mistake which worked as the Fire in head from own Gun selling the reserve BTCs which completely F\"\" Up their projectand now they are no more....Moving on to the recent incident with the SVB they got maximum of their reserves in fixed APY 5 years + long run mature bonds and then Interest rate on the Bonds o new Bonds issued increased from 1.2% to 3% and 4% which directly affected the SVB bond demand in market then they tried to sell their old bonds in $1B to $3B loss which created more fud in market to buy new high APY bonds and now rest of the story you know which caused USDC to de-pegged  another fud and market drop below $20k even USDC was secure they were holding just $3B bonds in SVB which created a panic in USDC holder and boom another stable coin gone..Things goes on as you know this is how crypto continues it cycle after the very most day market pumped to 22K then 26K and now enjoy...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "March 19, 2023, 08:58:05 PM",
      "body": "Quote from: UdtaParinda1 on March 15, 2023, 07:18:19 PMI am wondering that \"No doubt News cycle has a great impact \" you are saying this as even being so long with crypto never you realized that tweets and media reports and On chain analysis etc etc .. always manipulate the market especially in the critical times even from long time US inflation and CPI reports are impacting the bitcoin rally greatly.Yeah, the context of my reply was the same as what you try to say here, Maybe I said it wrong, but let me clear myself up by agreeing with you. I do realize that News cycles are one of the many factors in the fundamental analysis of BTC and it does impact the price of BTC, you should check my this post (because whether I wrote the whole idea again the same context is posted so), Actually, I was trying to say, I never came to know of these Economic Event Calendars which could tell you about most of the economic events that could impact (agreed) the Crypto market, likewise, you mentioned the history of SVB and FTX no doubt this is the result of corruption and mismanagement but there is a more upcoming economic event to that could impact the price of BTC such as 180+ banks are in danger of being declared as default once the USA print that 2 trillion dollars than things can not be reversed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "March 20, 2023, 04:33:02 AM",
      "body": "The most important events are the CPI and the FOMC days. Usually FOMC is usually never a surprise but it’s the conference they have right after that might discuss how dovish or hawkish they will be.Another one that you should start to follow is the unemployment numbers at the beginning of the month. Generally when employment is strong the market should be strong but it’s opposite now. We want higher unemployment so the CPI is less so the FOMC report will cut rates.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}