{
  "id": "topic_5405024",
  "title": "Fivestar4everMVP",
  "author": "Fivestar4everMVP",
  "created_time": "July 03, 2022, 02:54:44 PM",
  "content": "Yes its a genuine question really, and forgive me if this topic have been discussed on any part of this forum before, i probably missed it and like i always do before posting any new topic, i tried searching the forum to see if something like this have been discussed before, but i guess the forum's search engine is faulty so no result came up...check this thread for details on this, thank you .So, I came across this thread by Lauda, and I was really touched after reading his/her goodbye message to the community, I began to wonder what really would be the reason why any of us here would decide to leave this forum forever aside death or maybe health issues?For me, I've not been able to think of anything that would make me leave this forum forever aside death or maybe (God forbid) i have a serious health challenge that made it impossible for me to access or browse the internet, for me, the forum is Till death do us part .what I know I can do is take some time off if I the need arises, and come back when my leave is over, it doesnt matter how long am off, what is important is that i will always come back.So what about you, what really is that reason why you would decide to leave this forum forever and never come back even when you are alive and very healthy ?I have some suggestions/ideas/reasons why a member could possibly decide to leave the community..(Death and Health issues excluded)1. Hit a jackpot which turned you into a millionaire or Billionaire. 2. You became a CEO to a very big company.3. Your (maybe new) day job no longer gives you time.4. Found another forum which to you, is better than Bitcointalk.5. Unresolved conflict(s) with other member(s) of this forum.6. Undeserved red trust (reputation damage) from other member(s) with higher rank than yours, and more popular than you are (you feel intimidated).7. (stagnation) You try so hard to make quality post(s), but you are still unable to earn merits in order to join signature campaigns and also rank up.8. signature campaigns are scrapped from the forum and all means of earning money from the forum banned.9. Deserved red trust (reputation damage2) for committing a crime, (like cheating in bounty campaign) or breaking a rule (like plagiarizing) and you appealed but appeal was not granted.10. You have Alt accounts, meaning you didn't actually leave the forum but decided to operate under another username.11. None 12. Other (please mention it)The discussion is open to every member of this great community, let us know what exactly will make you, one day, decide to say a permanent good bye to this forum even while alive and living very healthy.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405024",
  "comments": [
    {
      "author": "Rikafip",
      "created_time": "July 03, 2022, 03:33:12 PM",
      "body": "Quote from: Fivestar4everMVP on July 03, 2022, 02:54:44 PMYes its a genuine question really, and forgive me if this topic have been discussed on any part of this forum before, i probably missed it and like i always do before posting any new topic, i tried searching the forum to see if something like this have been discussed before, but i guess the forum's search engine is faulty so no result came up...check this thread for details on this, thank you .This has been discussed before, more specifically Pmalek opened a  What Would Be Your Reason to Leave Bitcointalk?  topic so probably the best to continue conversation there.Regarding the forum search engine, better use Google or https://ninjastic.space/, forum search engine is rubbish,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "July 03, 2022, 03:44:11 PM",
      "body": "What would be your reason to leave forumYou have a post there too- https://bitcointalk.org/index.php?topic=5338254.msg58399947#msg58399947If I got banned.Apart from this, I don't think I'm going to leave the forum forever. Maybe I will take a break for days/months/years but I will definitely come back whenever I feel I need to know something about crypto lol and when I feel I should know what my friends (which I made here) doing. So, no, I'm not going to leave the forum forever as long as I'm not dead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "July 03, 2022, 04:28:08 PM",
      "body": "Quote from: Fivestar4everMVP on July 03, 2022, 02:54:44 PMThe discussion is open to every member of this great community, let us know what exactly will make you, one day, decide to say a permanent good bye to this forum even while alive and living very healthy. Wel, here have thousands of minds and thousands of different people around the world and countries, many reasons why someone leaves the forum for a long time or a short time.for example:*Sickness and death or death without illness, accident and so on.*Family factors and age/old factors.*Tired, bored or looking for a new life outside of forums, real business etc.*Already rich, such as: Topic: The richest users on the bitcoin forum. or like this guy: Topic: Bitcoin TOP-500 Richest.And many other issues, someone left this Forum, which for sure is all in their own mind, choice, best for themselves, the same thing with you, if one day you leave this forum, of course you are the one who knows better than us, thank you so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "July 03, 2022, 08:53:15 PM",
      "body": "As a member who joined in 2014 and has quit two times already, I'll explain why I abandoned the forum twice. The first one was somewhere in 2015, I was mostly a lurker and quite young back then and quickly lost interest. The second time, however, I was an established user, had joined a signature campaign and was active in the forum. All things took a major turn after 2018's crash, in which I got completely disappointed and abandoned everything altogether. Thus, the main reason for quitting was Bitcoin's crash, would that make me leave forever though? I guess only if it zeroed out, which is highly unlikely. Only extreme lack of time or sickness would now prevent me from being active in the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}