{
  "id": "topic_5436189",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "January 20, 2023, 11:32:15 PM",
  "content": "QuoteThe Department of Agriculture (USDA) updated its regulations on organic food labels, as part of an effort to close loopholes and increase confidence in the agency’s organic seal.\"This update to the USDA organic regulations strengthens oversight and enforcement of the production, handling, and sale of organic products.\" the agency said in a statement on Thursday.The USDA shared that the new rules, which will be \"biggest update to organic regulations\" since 1990, hopes to provide, \"a significant increase in oversight and enforcement authority to reinforce the trust of consumers, farmers, and those transitioning to organic production.\"Previously, the USDA had a strict definition of \"certified organic,\" allowing the label to be used only for products that meet certain standards for soil quality, animal-raising practices, pest and weed control, and use of additives. The new rules will tighten the certification requirements along the organic food supply chain, require certificates for imported goods and beef up inspection protocols. Under the new requirements, non-retail containers will be required to sport organic labeling to \"reduce the mishandling of organic products\" and \"support traceability.\" \"Protecting and growing the organic sector and the trusted USDA organic seal is a key part of the USDA Food Systems Transformation initiative,\" Under Secretary for Marketing and Regulatory Programs Jenny Lester Moffitt said. The Organic Trade Association praised the new rules, saying the policy \"will have significant and far-reaching impacts on the organic sector and will do much to deter and detect organic fraud and protect organic integrity throughout the supply chain.\"In a Federal Register notice, the USDA sited examples of organic food fraud in recent months.This week, two Minnesota farmers were charged for allegedly planning to sell more than $46 million worth of chemically treated crops as organic between 2014 and 2021.In another case prosecuted in Iowa in 2019, the defendant sold some $142 million in non-organic grain over seven years, claiming inaccurately the grain was organically grown in Nebraska and Missouri. Four individuals were sentenced to prison in the case.\"This rule includes more robust traceability and verification practices that would have helped identify and stop this type of fraud earlier, preventing further sale of the fraudulent products and reducing the impact of the fraud,\" the USDA said in the notice.https://www.foxbusiness.com/lifestyle/biden-administration-announces-move-fight-organic-fraud....If I remember correctly, food products in the USA need only be 75% organic to be branded with an organic label. In which case, its acceptable for organic labeled products in the country to be 75% organic and can still be as much as 25% GMO. The way food products are defined are based on percentages of the ingredients it contains.Unfortunately, this article does not do much to elaborate upon specifically which changes are being made. I would guess we should have more details coming in the future.While brand labels like whole foods were known for being organic in the past. That may also have changed as ownership of whole foods was sold to amazon in 2017.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436189",
  "comments": [
    {
      "author": "Gyfts",
      "created_time": "January 21, 2023, 01:52:37 AM",
      "body": "I'm not against these sort of regulations but I only caution that the general trend is more regulations equals higher costs. Americans are already grappling with inflation and if food companies increase their operating costs in order to comply with regulations, consumers bear the cost. And the government regulates \"upwards\" meaning they only get more stringent once guidelines are in place.I suppose informing consumers whether their food is drenched with poison is worth the price to pay. U.S. is pretty liberal with the pesticides they allow compared to other places.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "January 21, 2023, 03:02:37 AM",
      "body": "Quote from: Gyfts on January 21, 2023, 01:52:37 AMI'm not against these sort of regulations but I only caution that the general trend is more regulations equals higher costs. Americans are already grappling with inflation and if food companies increase their operating costs to comply with regulations, consumers bear the cost. And the government regulates \"upwards\" meaning they only get more stringent once guidelines are in place.I suppose informing consumers whether their food is drenched with poison is worth the price to pay. The U.S. is pretty liberal with the pesticides they allow compared to other places.I think bearing the cost would be far better than dying of poisonous chemicals. People have lost the virtues of integrity and compassion that they don't care if people die because of their greed. The agriculture sector is so important that strict supervision and monitoring are needed because failure to do that would lead to mass sickness or even death. I have never been a fan of artificial seeds but GMOs indeed increase food production and they claim that it has no health implications. But I am beginning to suspect that just as we have low-standard products in other sectors, there might be substandard agricultural products, and the government regulating agencies must monitor this sector to avoid food poisoning. People need to be sure of what they are buying because some of them might be buying this product based on medical prescriptions, therefore buying the wrong product might lead to health consequences.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "January 21, 2023, 05:35:29 AM",
      "body": "The organics' fairy tale is a marketing strategy for people who live in the big centers and have never planted a vegetable on their lives. We live in a modern world and modern techniques are used to raise crops. I believe you can't really expect to produce food in large quantities, with a pretty visual aspect, without using any kind of \"chemicals\" or fertilizers from animals who ingest \"chemicals\" or have \"chemicals\" on their bodies, due to vaccines and medicines in general.Of course there must be a control of how much \"chemicals\" are being used, because some farmers highly abuse on its usage, but to say something is organic nowadays I believe it's kinda of innocence.And there isn't anything like 10%, 50% or 75% organic. Or it is, or it isn't. It's like saying someone is half man, half woman...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "January 21, 2023, 05:56:50 AM",
      "body": "This coincides with what an agronomist told me. According to what he told me in his final year work, he was dedicated to analyze organic fields and saw as a result that a not insignificant percentage (I do not remember exactly because he told me some time ago) did not meet the standards to be qualified as organic.In many cases it was not so much because they actively used chemicals that were not allowed, but because the surrounding non-organic crops did use them and these ended up contaminating the organic ones. Or in the case of GMOs, if you have an organic crop but there is a GMO three kilometers away you can't avoid cross-pollination. Eventually, 100% organic farming will become impossible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vishnu.Reang",
      "created_time": "May 15, 2023, 06:00:36 AM",
      "body": "The USDA shared that the new rules, which will be \"biggest update to organic regulations\" since 1990, hopes to provide, \"a significant increase in oversight and enforcement authority to reinforce the trust of consumers, farmers, and those transitioning to organic production.\" Announcing a new plan to crack down on fraud. People who always buy USDA organic, hope they really make a difference, they don't want to spend more money for no reason.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "May 15, 2023, 06:57:33 AM",
      "body": "Quote from: Poker Player on January 21, 2023, 05:56:50 AMEventually, 100% organic farming will become impossible.In some parts of the world. Genetically modified agriculture is not a global issue as yet as there are many countries with enough arable land to feed their population. I've visited many places where they do not have to state that the food sold are organic cause that's the only ones available.In contrast these countries are either developing or underdeveloped, as infrastructure and innovation are not yet close to it's highest standards it leaves enough room for agricultural produce to be grown.With years these places could have a demand for GMOs but they are many decades away from going 100% inorganic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "May 15, 2023, 09:17:12 AM",
      "body": "Quote from: Hydrogen on January 20, 2023, 11:32:15 PM....If I remember correctly, food products in the USA need only be 75% organic to be branded with an organic label. In which case, its acceptable for organic labeled products in the country to be 75% organic and can still be as much as 25% GMO. The way food products are defined are based on percentages of the ingredients it contains.Unfortunately, this article does not do much to elaborate upon specifically which changes are being made. I would guess we should have more details coming in the future.While brand labels like whole foods were known for being organic in the past. That may also have changed as ownership of whole foods was sold to amazon in 2017.In the wake of the hype with organic products, given the greater complexity of growing them and, accordingly, the higher price, scammers have appeared, ready to \"warm their hands\" in this market. I think such processes do not arise on their own, probably there is already an accumulated base of methods to \"bypass\" the restrictions, and get higher earnings on cheaper products that are only remotely related to this technology.On the other hand, about GMOs. Organic products are agricultural and food industry products made without the use (or with less use) of synthetic pesticides, synthetic mineral fertilizers, growth regulators, and artificial food additives. There is no mention of GMOs here at all, because. genetic material is obviously not synthetic, but is of natural origin. But its origin must also be organic",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}