{
  "id": "topic_5469543",
  "title": "DubemIfedigbo001",
  "author": "DubemIfedigbo001",
  "created_time": "October 07, 2023, 01:23:13 PM",
  "content": "I have decided to continue my involvement with investment in Bitcoin. My conviction in the importance and positive tendencies of bitcoin cannot be complete if I continue to just discuss and learn about its existence. I believe that a practical approach to learning is the best approach, hence my decision to invest in bitcoin with the  little funds I have at the moment. I also believe that little drops of water makes the mighty ocean and I'll continue my investments when  funds present itself. I wish to take my journey to another level of involvement, hence my decision. I hope and know that in the nearest future, I will be proud of the decision I am taking now. I intend Hodling my coins for a long time to avoid a repeat of my  former tragedy.Here are proofs to backup my claims.reference: 20543928429965520896",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469543",
  "comments": [
    {
      "author": "Odohu",
      "created_time": "October 07, 2023, 01:30:25 PM",
      "body": "This might seems small amount to start with but if you do this consistently every week, by this time next year you should have about 0.183 Bitcoin which is around $5k using today's price. I will encourage you to keep it up because you are buying at the right time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayu7adi",
      "created_time": "October 07, 2023, 01:32:57 PM",
      "body": "I understand what you're feeling, and this is the next step after studying Bitcoin for a while. Acquiring these rare coins can indeed be a bit adrenaline-inducing, but with time, you'll grow accustomed to making peace with the tense moments.Keep accumulating purchases if you intend to make BTC a long-term investment. And don't forget that typically (although it's not guaranteed), during each halving cycle, there's the potential for a BTC price pump. I hope you'll be one of those who can join the party when that time comes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Albad12",
      "created_time": "October 07, 2023, 01:35:19 PM",
      "body": "Quote from: DubemIfedigbo001 on October 07, 2023, 01:23:13 PMI have decided to continue my involvement with investment in Bitcoin. My conviction in the importance and positive tendencies of bitcoin cannot be complete if I continue to just discuss and learn about its existence. I believe that a practical approach to learning is the best approach, hence my decision to invest in bitcoin with the  little funds I have at the moment. I also believe that little drops of water makes the mighty ocean and I'll continue my investments when  funds present itself. I wish to take my journey to another level of involvement, hence my decision. I hope and know that in the nearest future, I will be proud of the decision I am taking now. I intend Hodling my coins for a long time to avoid a repeat of my  former tragedy.Here are proofs to backup my claims.reference: 20543928429965520896https://www.talkimg.com/images/2023/10/07/RXX82.png                   This is actually a great time to get in into bitcoin. The price is relatively cheap and the bull run is right around the corner",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "October 07, 2023, 01:37:42 PM",
      "body": "Congratulations on joining the bitcoin family! It's nice that you have the courage to buy and accumulate with the little income that you have at your disposal. It's good to start small, as it's a sign of how much love you have for the currency, and you don't want little financial help to be a hindrance. I was also among many others who bought bitcoin, added more to my portfolio, and celebrated it here. I know the feelings; the amount might seem small to you, but protect it with the maximum security that you can afford. If you know that you want to hold it for a long time and still have plans to buy more in a little time, then I will advise you to get a little higher amount, get a self-custodial wallet, and move them to a place where you will have full control over your bitcoin. Blue Wallet and Electrum are among the best recommended; you can choose one of them and set it up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "snowpega",
      "created_time": "October 07, 2023, 01:41:32 PM",
      "body": "hi therehope you doing well buddy first of all i feels good for you as you really take a good decision. We all know that world becoming digital day by day so there no doubt you will be able to feel proud of this decision well buddy if you are new in this field of cryptocurrency i would like to suggest some strategies which will help you in this field to overcome of your problem and you will be able to take your decision easily by Reading themA Guide for Cryptocurrency Newbies for Overcoming FOMOBuy the DIP, and HODL!   by reading these threads you will be able to learn more. These threads are full of seniors where they shared their experiences and well defined strategies for the accumulation of Bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BigBos",
      "created_time": "October 07, 2023, 01:42:12 PM",
      "body": "Quote from: DubemIfedigbo001 on October 07, 2023, 01:23:13 PMI have decided to continue my involvement with investment in Bitcoin. My conviction in the importance and positive tendencies of bitcoin cannot be complete if I continue to just discuss and learn about its existence. I believe that a practical approach to learning is the best approach, hence my decision to invest in bitcoin with the  little funds I have at the moment. I also believe that little drops of water makes the mighty ocean and I'll continue my investments when  funds present itself. I wish to take my journey to another level of involvement, hence my decision. I hope and know that in the nearest future, I will be proud of the decision I am taking now. I intend Hodling my coins for a long time to avoid a repeat of my  former tragedy.              You are off to a good start and there is a basic basis for deciding to invest. but try to have a plan after purchasing on a centralized exchange make a withdrawal to a really safe cold wallet. Don't keep it too long on a centralized exchange. Maybe you can do it once a month. This means that if you buy 10K Naira every week then in a month you will withdraw 4x purchases at the end of the month to your wallet. So by having a structured plan like that you can enjoy the investment process much more. Of course, this must be supported by stable finances, so you just need to adapt your own version of investment according to your abilities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "October 07, 2023, 01:43:13 PM",
      "body": "Congratulations on buying the world leading cryptocurrency BITCOIN. Learning without practice might seem easy, but it's not a waste of knowledge. Your choice to physically handle Bitcoin sets a good example for those wanting to understand it. Now, the most important thing is to learn how to keep your money safe from hackers. Investing in BITCOIN now, can help you gain more experience as you journey through the world of cryptocurrency but always remember to do your research, know your risk, and only invest what you can afford to lose because Bitcoin can be unpredictable. Many people have made money by holding onto their coins for a long time. So I will also advice you to hodl and stay updated with lastest market info.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "October 07, 2023, 01:47:09 PM",
      "body": "Quote from: DubemIfedigbo001 on October 07, 2023, 01:23:13 PMI have decided to continue my involvement with investment in Bitcoin. My conviction in the importance and positive tendencies of bitcoin cannot be complete if I continue to just discuss and learn about its existence. I believe that a practical approach to learning is the best approach, hence my decision to invest in bitcoin with the  little funds I have at the moment. I also believe that little drops of water makes the mighty ocean and I'll continue my investments when  funds present itself. I wish to take my journey to another level of involvement, hence my decision. I hope and know that in the nearest future, I will be proud of the decision I am taking now. I intend Hodling my coins for a long time to avoid a repeat of my  former tragedy.Here are proofs to backup my claims.reference: 20543928429965520896                   You have just taken the first step towards your Bitcoin journey. This is a great move and I commend you for that. You can continue acquiring more coins using DCA and keeping them safe in a safe wallet. You will be surprised that in a few years, you will have acquired a reasonable sum. You can consider using an Electrum wallet since your fund is not large enough to warrant the purchase of a hardware wallet. But you can consider buying a trusted open-sourced hardware wallet like Passport or Bitbox in the future. You should also learn how to keep your wallet safe to avoid losing your money to hackers. I know you are excited to buy bitcoin but you don't need to announce what you have done. We should learn to keep our lives off the public, that is why we are bitcoiners.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "October 07, 2023, 01:52:22 PM",
      "body": "Don't worry too much about the price if you are going to HODL it in the long term and you are going to be dependent on the times you are going to buy instead of the price you are going to buy. It's best if you are able to have that motivation and make sure that you are doing the right things for your assets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "October 07, 2023, 01:57:17 PM",
      "body": "It's already a good step and you've invested in Bitcoin even though your initial investment looks small, but if you do it consistently you will have a large and growing investment.I'm also doing the same, setting aside some of the earnings from the Signature campaign for the long term. $10-$50 per week is the amount I invest every week at any price. This has been consistent since a few months ago. Price fluctuations are normal, just need to be patient and wait for the main target to be reached. Don't waste this rare opportunity, we don't know if we'll still be able to buy at low prices or not, because this is still a good opportunity for retail buyers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "October 07, 2023, 02:04:07 PM",
      "body": "Good luck to you OP. I have full respect for every single person who decides to change their lives for the better by buying bitcoin. No matter how big or small, every cent taken out of the breaking fiat system & invested into bitcoin is good. Just keep buying bitcoin regularly, you can’t go wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "October 07, 2023, 02:15:55 PM",
      "body": "Congratulations on your decision to continue investing in Bitcoin. You can continue to have more Bitcoin, especially since the price of Bitcoin has not yet risen any higher. It's okay if you can only use a little money to invest in Bitcoin because it can give a profit for you in the future.And everything starts with small things before we can start with bigger things. And this applies to investing in Bitcoin. I also started with little funds because I had to allocate my budget to each expense that I had for each month. And if you can buy Bitcoin regularly, you can have more Bitcoin.The important thing is that you continue to do DCA when buying Bitcoin and don't think too much about price movements. You need to focus on investing in Bitcoin to continue the DCA. Use this time to collect more Bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "October 07, 2023, 02:18:08 PM",
      "body": "Quote from: DubemIfedigbo001 on October 07, 2023, 01:23:13 PMI have decided to continue my involvement with investment in Bitcoin. My conviction in the importance and positive tendencies of bitcoin cannot be complete if I continue to just discuss and learn about its existence. I believe that a practical approach to learning is the best approach, hence my decision to invest in bitcoin with the  little funds I have at the moment. I also believe that little drops of water makes the mighty ocean and I'll continue my investments when  funds present itself. I wish to take my journey to another level of involvement, hence my decision. I hope and know that in the nearest future, I will be proud of the decision I am taking now. I intend Hodling my coins for a long time to avoid a repeat of my  former tragedy.Here are proofs to backup my claims.reference: 20543928429965520896                   so 0.00035334 is a good start. it is about  10 US dollarsIn many parts of the world 10 US dollars is an affordable amount.May I ask do you plan to buy 10 USD a week or two Weeks or a Month? For the next year then reassess your next move?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "October 07, 2023, 02:18:25 PM",
      "body": "Quote from: DubemIfedigbo001 on October 07, 2023, 01:23:13 PMI have decided to continue my involvement with investment in Bitcoin. My conviction in the importance and positive tendencies of bitcoin cannot be complete if I continue to just discuss and learn about its existence. I believe that a practical approach to learning is the best approach, hence my decision to invest in bitcoin with the  little funds I have at the moment. I also believe that little drops of water makes the mighty ocean and I'll continue my investments when  funds present itself. I wish to take my journey to another level of involvement, hence my decision. I hope and know that in the nearest future, I will be proud of the decision I am taking now. I intend Hodling my coins for a long time to avoid a repeat of my  former tragedy.snip        You just have to get started no matter what the amount is and then there is no limit for more opportunities.You are right when you say small drops make a mighty ocean because that's how I have done it and hold a decent portfolio today.Although its not huge but over time I am sure I will make it good. Congratulations on being a part of the community and keep holding strong.You will face many ups and downs but you have to keep holding strong and that's how you will achieve your dream.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "October 07, 2023, 02:22:04 PM",
      "body": "Quote from: pawanjain on October 07, 2023, 02:18:25 PMQuote from: DubemIfedigbo001 on October 07, 2023, 01:23:13 PMI have decided to continue my involvement with investment in Bitcoin. My conviction in the importance and positive tendencies of bitcoin cannot be complete if I continue to just discuss and learn about its existence. I believe that a practical approach to learning is the best approach, hence my decision to invest in bitcoin with the  little funds I have at the moment. I also believe that little drops of water makes the mighty ocean and I'll continue my investments when  funds present itself. I wish to take my journey to another level of involvement, hence my decision. I hope and know that in the nearest future, I will be proud of the decision I am taking now. I intend Hodling my coins for a long time to avoid a repeat of my  former tragedy.snip        You just have to get started no matter what the amount is and then there is no limit for more opportunities.You are right when you say small drops make a mighty ocean because that's how I have done it and hold a decent portfolio today.Although its not huge but over time I am sure I will make it good. Congratulations on being a part of the community and keep holding strong.You will face many ups and downs but you have to keep holding strong and that's how you will achieve your dream.Yep he or she is on the way. I hope that he is doing an affordable amount and will be doing a type of dca for a year or more.  People do not realize 10 dollar a week adds up over time.Also BTC will hopefully continue an upwards journey at a pace that is better than inflation making his investment worth while.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "October 07, 2023, 02:26:02 PM",
      "body": "What can I say, other than congratulate you for taking the bold step to invest in bitcoin, Bitcoin like we know is the head and the pillar that hold the entire cryptocurrency ecosystem, Bitcoin is the only genuine crypto coin we  have in the cryptocurrency market, i wont say that investments in bitcoin is risk free, but its one with the lowest risk, and it can actually be risk free, it all depends on when and at what price you are buying, and depends on what price you are ready to sell it and how long you are ready and willing to hold your coins.And again, the amount you invested is quite small, that amount is around $10 going by todays exchange rate, but then, still very much better than nothing, just use DCA strategy to buy more bitcoins and hold in preparation for the very much anticipated bull run, you will not regret as long as its bitcoin you are investing in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "October 07, 2023, 02:36:26 PM",
      "body": "Congratulations on your first purchase! Even though it's a small amount of BTC, it's great that you actually went ahead and went through with your first purchase. Some never actually go ahead because they're too hesitant about it and keep postponing it. This is a good start and a stepping stone to your Bitcoin journey, and the time isn't too bad; we're less than a year from the upcoming halving and a potential bull market within the next two years. Thus, your investment's potential is quite decent, provided that you're able to keep investing until the halving cycle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "October 07, 2023, 02:42:02 PM",
      "body": "Coingrats!  Your journey to financial freedom begins with 10.000 NairaBack in the days 0.05BTC was something people just bet in one sports match. Now they couldn't afford to spend it for the whole month. They have regrets every time they login to their account and see their betting history.  0.00035334 BTC will also be higher in value when time comes and you will be happy to see the little BTC you got today turns out to be your greatest investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "angrybirdy",
      "created_time": "October 07, 2023, 02:46:00 PM",
      "body": "You have really made a good decision. This start of your journey will bring you to a good destination in the future. Just continue to invest, and do DCA even if it's just a little, in the future, you will see the fruit of your investment. A lot of people are doing that, it is a good start because the price of bitcoin is still low compared to its all-time high. If it goes back to the ATH price or even higher, your money will be multiplied.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}