{
  "id": "topic_5437473",
  "title": "FirsterNano",
  "author": "FirsterNano",
  "created_time": "January 31, 2023, 01:17:58 PM",
  "content": "I apologize for the stupid question. I have always used bitcoin.org to download new versions. I am currently using version 22.00 downloaded from bitcoin.orgAnd now I find out about version 24.0 on bitcoincore.orgx what should I do. be updated? Do I need to recreate wallet.dat and transfer bitcoins? Or can you use the old one?  I'm very concerned about the security of my bitcoins right now.  Sorry for stupid question.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437473",
  "comments": [
    {
      "author": "BenCodie",
      "created_time": "January 31, 2023, 01:38:15 PM",
      "body": "Bitcoin Core is the official website of the bitcoin wallet that is maintained by developers so it would be most up-to-date. BItcoin.org is a website detailing more than just the Bitcoin Core wallet and has a lot more references surrounding the Bitcoin ecosystem. Who manages it, I'm not sure...it does seem that you are right in that the link to the bitcoin core client download is outdated by a few versions there at 22.0.You should be able to import/export the wallet just fine between the two clients anyway, that is if you need to do that at all. I am sure that they would be working from the same directories so your wallet should still be there no matter which one you use. Your client should still be synced as well. This would make most sense as it is the same software (just different version), though I could be wrong if there is something more to do with the difference between Bitcoin.org or Bitcoincore.org.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "January 31, 2023, 01:43:46 PM",
      "body": "There is no such thing as \"official\" bitcoin website, and both are ran by different people. Both are pretty reputable websites though, so you're going to be fine with either. The bitcoin.org website seems to be pretty outdated though. Just use BitcoinCore.org: https://bitcoincore.org/en/download/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceMobile",
      "created_time": "January 31, 2023, 02:02:23 PM",
      "body": "Click Help > About: it shows bitcoincore.org.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "January 31, 2023, 02:49:45 PM",
      "body": "Domain name updateSince April 2020, bitcoin.org is fully controlled by Cøbra and we don't know what will happen with either Cøbra and that site. Cøbra can sell it to someone else and what will happen if the buyer is Roger Ver or any Faketoshi?They will use it to shill their Bitcoin Cash or Bitcoin SV or other Bitcoin forks.So let's go to Bitcoincore.org and remember to verify what you download. At its download page, you see verification guide.At top left corner of forum page, you can see\"News: Latest Bitcoin Core release: 24.0.1 [Torrent]\" with a link to bitcoincore.org.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "January 31, 2023, 02:54:03 PM",
      "body": "To my knowledge, Bitcoincore.org was established in 2013 and serves as the official website for the Bitcoin Core software. Prior to this, the software was hosted on Bitcoin.org, which was registered by the pseudonym Satoshi Nakamoto, the founder of Bitcoin. Currently, the domain bitcoin.org is owned by Cøbra, and the website operates as an independent, open-source project with contributions from a diverse group of individuals globally.[1][1] - https://bitcoin.org/en/about-us#ownersQuote from: FirsterNano on January 31, 2023, 01:17:58 PMSorry for stupid question.There are no stupid questions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "February 01, 2023, 02:29:13 AM",
      "body": "Quote from: tranthidung on January 31, 2023, 02:49:45 PMSince April 2020, bitcoin.org is fully controlled by Cøbra and we don't know what will happen with either Cøbra and that site. Cøbra can sell it to someone else and what will happen if the buyer is Roger Ver or any Faketoshi?They will use it to shill their Bitcoin Cash or Bitcoin SV or other Bitcoin forks.Hence why people should stop calling either website the \"official website\" of anything. Though unlikely, ownership and control could be passed. A lot of people have been calling bitcoin.org the \"official\" website of Bitcoin for a while now that if ownership gets passed over to a malicious entity, a lot of damage would be made.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "February 01, 2023, 11:16:35 AM",
      "body": "When someone asks about the official site, the bank or the CEO of Bitcoin, then we know that he has not understood what decentralization actually means in the context of Bitcoin. However, it is good for people to ask, because not only will they learn, but they will surely pass that knowledge on and enlighten someone else who may be asking the same question or living in a delusion.However, I would warn all those who do not know to avoid bitcoin with the extension .com, because of its policy of spreading disinformation to the detriment of Bitcoin - it is not only a fake site, but also a malicious one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "February 01, 2023, 11:29:13 AM",
      "body": "Quote from: mk4 on February 01, 2023, 02:29:13 AMHence why people should stop calling either website the \"official website\" of anything. Though unlikely, ownership and control could be passed. A lot of people have been calling bitcoin.org the \"official\" website of Bitcoin for a while now that if ownership gets passed over to a malicious entity, a lot of damage would be made.No official website because it is a community-led project after Satoshi Nakamoto abandoned it and left the community.If not Bitcoincore.org, there will be another website but key is verify PGP keys of developers, don't trust. Bitcoincore.org has guides to verify wallets too.The BCT PGP/GPG Public Key Database: Stake Your PGP Key Here. The topic to stake your PGP public key for forum members, including veteran members.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "February 02, 2023, 04:50:00 AM",
      "body": "Since the \"official\" things have already been addressed, to put up simply, Bitcoin Core (bitcoincore.org) is a site about the software/wallet, while bitcoin(bitcoin.org) is about the cryptocurrency. For Bitcoin Core related applications, you should use bitcoincore.org.Also, if we take a look at the about page of each site, we can distinguish the differences, and know what it is all about.Quote from: https://bitcoincore.org/en/about/Bitcoin Core is an open source project which maintains and releases Bitcoin client software called “Bitcoin Core”.Quote from: https://bitcoin.org/en/about-us#owntxt-titleBitcoin.org is dedicated to help Bitcoin to develop in a sustainable way.Bitcoin.org is not Bitcoin's official website. Just like nobody owns the email technology, nobody owns the Bitcoin network. As such, nobody can speak with authority in the name of Bitcoin.This differentiation was also addressed here in other thread by achow101:Quote from: achow101 on May 01, 2022, 12:51:57 AMBitcoincore.org is Bitcoin Core's official website. As part of separating Bitcoin Core from Bitcoin.org (presumably as part of efforts to distinguish between Bitcoin Core the software and Bitcoin the cryptocurrency), the maintainers no longer post Bitcoin Core releases to Bitcoin.org. However the maintainers of Bitcoin.org can choose to mirror the binaries on their website and do so as they wish. You should direct people to bitcoincore.org as it is the project's actual website.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "February 02, 2023, 04:52:09 AM",
      "body": "Quote from: FirsterNano on January 31, 2023, 01:17:58 PMAnd now I find out about version 24.0 on bitcoincore.orgx what should I do. be updated? Do I need to recreate wallet.dat and transfer bitcoins? Or can you use the old one?  I'm very concerned about the security of my bitcoins right now.  Unless there is a very serious and important security advisory  at is published, which immediately threatens the safety of your wallet, you are not required to continue updating Bitcoin Core every time a new version comes out, although it is recommended to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "February 03, 2023, 03:30:05 AM",
      "body": "Quote from: Lucius on February 01, 2023, 11:16:35 AMHowever, I would warn all those who do not know to avoid bitcoin with the extension .com, because of its policy of spreading disinformation to the detriment of Bitcoin - it is not only a fake site, but also a malicious one.Haven't checked this scammy website in a while so I decided to take a look. Apparently they've now started a DEX for multi-chain swaps lmao. What the heck was Roger Ver thinking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}