{
  "id": "topic_5475306",
  "title": "Shideman",
  "author": "Shideman",
  "created_time": "November 24, 2023, 09:08:28 AM",
  "content": "23 ноября газета The Wall Street Journal сообщила свежую информацию об условиях жизни в тюрьме соучредителя и бывшего генерального директора компании FTX Сэма Бэнкмана-Фрида.По данным издания, СБФ разместили в общежитии бывшего президента Гондураса Хуана Орландо Эрнандеса, который ожидает суда за получение взяток от наркоторговцев. Судя по всему, эти два человека находятся в хороших отношениях: адвокат Эрнандеса заявил, что между двумя заключенными состоялась \"сердечная беседа\".The Wall Street Journal добавляет, что трудности SBF с получением веганской диеты и лекарств от СДВГ во время пребывания в тюрьме были решены.В статье отмечается, что SBF разрешено раз в неделю встречаться с посетителями, не являющимися юристами. Ему также разрешено пользоваться специальным ноутбуком для изучения юридических документов, хотя его работа с компьютером ограничена специальной комнатой с перегороженным столом.Марк Ботник, представитель SBF, отметил, что бывший руководитель FTX \"делает все возможное в сложившихся обстоятельствах\".Выход SBF на рынок тюремной экономикиWall Street Journal также утверждает, что SBF торгует упаковками скумбрии с другими заключенными в обмен на услуги. По имеющимся данным, до суда в ноябре он обменял нераскрытое количество макрели на стрижку.Пачки скумбрии (стоимостью около 1,30 долл. США каждая) стали де-факто тюремной валютой после того, как федеральный запрет на курение исключил сигареты из числа возможных альтернатив. (Кстати, другой бывший криптовалютный преступник, Чарли Шрем, ранее уже комментировал экономику тюремной торговли скумбрией).По словам источника Wall Street Journal, пожелавшего остаться неизвестным, SBF также консультировала охранников по вопросам криптовалютных инвестиций.SBF будет переведен после вынесения приговораВ настоящее время SBF содержится в Бруклинском городском центре содержания под стражей, который известен своими плохими условиями содержания. Для отбывания наказания он будет переведен в федеральную тюрьму. По словам консультанта тюрьмы, цитируемого Wall Street Journal, там он будет иметь большую свободу передвижения, лучшие образовательные и развлекательные возможности, а также будет находиться в тюрьме с менее агрессивным контингентом.SBF был осужден за свою роль в деле о мошенничестве FTX, но приговор ему еще не вынесен. Вынесение приговора назначено на 28 марта 2024 г., и в ходе второго судебного процесса будут рассмотрены обвинения в мошенничестве с финансированием избирательных кампаний и подкупе китайских чиновников.Максимальный срок заключения SBF в настоящее время составляет 115 лет, хотя некоторые эксперты полагают, что он будет приговорен к 25 годам или меньше.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475306",
  "comments": [
    {
      "author": "LilliPutten",
      "created_time": "November 24, 2023, 09:47:23 AM",
      "body": "Фига себе, на 115 присесть, а остаток куда девается потом после смерти?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xandry",
      "created_time": "November 24, 2023, 01:45:58 PM",
      "body": "https://medium.com/@clarksoncarolyn682 ваш блог?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}