{
  "id": "topic_5452761",
  "title": "LSDadventure",
  "author": "LSDadventure",
  "created_time": "May 15, 2023, 03:21:56 AM",
  "content": "Some times I read articles that write about very old bitcoins like come from 2010, 2011 years. They woke up and were moved in on chain transactions in 2023.I read some discussions that those old bitcoin movements can create fear on the market. People think those old bitcoins can be dumped on the market and will cause a price fall.I don't think those old bitcoins are enough to dump the market. Those coins and movements only cause uncertainty and affect people with weak mentality.Please share your opinion.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452761",
  "comments": [
    {
      "author": "Don Pedro Dinero",
      "created_time": "May 15, 2023, 03:30:42 AM",
      "body": "Quote from: LSDadventure on May 15, 2023, 03:21:56 AMI don't think those old bitcoins are enough to dump the market. It is relative and depends on the amount, although bitcoins from that time in wallets are usually large amounts now, because back then they were worth much less and could be mined from your computer. The ones that could cause panic if they move are the ones attributed to Satoshi, although I think it is likely that he destroyed the keys to them as a donation to the community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "May 15, 2023, 04:48:21 AM",
      "body": "Moving old Bitcoins doesn't affect anything, the news media just exaggerates the narrative to create panic.Market capital includes all bitcoins in circulation that exist. After all, if the owners of a large number of old bitcoins want to get a good price, they shouldn't dump them into the spot market. But the move could be critical, especially for security reasons.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "May 15, 2023, 06:29:35 AM",
      "body": "Quote from: LSDadventure on May 15, 2023, 03:21:56 AMI read some discussions that those old bitcoin movements can create fear on the market. People think those old bitcoins can be dumped on the market and will cause a price fall.News outlets try to sell their articles by making them as sensational as possible, this involves creating links and backstories which would be a bit more attractive to the average reader along with a click bait headline.Bitcoins being moved from one wallet to the other, from wallet to exchange or the other way around should not be a topic of discussion, but the media would use a headline which highlights that a long term holder has finally lost faith in bitccoin and is ready to sell their bags, with maybe a question if we would see Satoshi's stash move anytime soon.Quote from: LSDadventure on May 15, 2023, 03:21:56 AMI don't think those old bitcoins are enough to dump the market. Those coins and movements only cause uncertainty and affect people with weak mentality.They don't even cause uncertainty, such discussions only last for a few hours or at most a day before it's no longer a topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "May 15, 2023, 06:37:17 AM",
      "body": "Quote from: LSDadventure on May 15, 2023, 03:21:56 AMI read some discussions that those old bitcoin movements can create fear on the market. People think those old bitcoins can be dumped on the market and will cause a price fall.Actually it is. Imagine someone hybernate for a long time and a massive bitcoin amount is suddenly will be send to an exchange like 10k bitcoin, of course this will make everyone worried. Somehow those old bitcoin users are probably selling it especially if they are just a normal people and dont associated with trading itself. They can also talk to exchanges for otc deals instead to avoid being dumped on instead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "May 15, 2023, 07:04:00 AM",
      "body": "Quote from: LSDadventure on May 15, 2023, 03:21:56 AMSome times I read articles that write about very old bitcoins like come from 2010, 2011 years. They woke up and were moved in on chain transactions in 2023.I read some discussions that those old bitcoin movements can create fear on the market. People think those old bitcoins can be dumped on the market and will cause a price fall.I don't think those old bitcoins are enough to dump the market. Those coins and movements only cause uncertainty and affect people with weak mentality.Please share your opinion.Not sure if it will create fear to everyone, at least for those who have been here for a long time, there are many reasons why the coins suddenly move,a. maybe the owners wanted it to be more secure and so they move to a new addressb. they might have intentions to sell - and this could be where the fear monger wanted to bring out.c. or it has been hack or that old address private key or mnemonic phrase has been cracked.But I don't that those old coins will suddenly dump into the market, they can even do OTC sell if they want to not create panic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Onset",
      "created_time": "May 16, 2023, 01:29:35 AM",
      "body": "Quote from: cryptoaddictchie on May 15, 2023, 06:37:17 AMActually it is. Imagine someone hybernate for a long time and a massive bitcoin amount is suddenly will be send to an exchange like 10k bitcoin, of course this will make everyone worried. Somehow those old bitcoin users are probably selling it especially if they are just a normal people and dont associated with trading itself. They can also talk to exchanges for otc deals instead to avoid being dumped on instead.They can only be worried if they’re scared of a dump. I mean come on, it’s not like Bitcoin’s falling to the floor because somebody woke up and thought they should sell their coins.. I get it when people worry about someone selling $1B worth of Google stocks but not when someone drops some Bitcoin off. plus they’d be fools if they dumped significant amounts on markets unless they did it intentionally to manipulate. OTC brings them too many advantages to refuse it at that point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "May 16, 2023, 09:24:54 PM",
      "body": "Quote from: LSDadventure on May 15, 2023, 03:21:56 AMI read some discussions that those old bitcoin movements can create fear on the market. People think those old bitcoins can be dumped on the market and will cause a price fall.Why should people spending or moving their Bitcoins make you fear/panic, even if the owners decide to liquidate their funds, there is nothing you can do about it. If you pay attention to fud, you might also sell your coins because you think the worst is going to happen, but the funny part of it all is people who sell like this more often than not start to buy immediately when an appreciation starts, just because of the fear of missing out. I'd advice you not to pay too much attention when people move their coins, even if it hasn't moved for a long time and is worth so much, it is their coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "May 17, 2023, 07:21:58 AM",
      "body": "Quote from: LSDadventure on May 15, 2023, 03:21:56 AMI don't think those old bitcoins are enough to dump the market. Those coins and movements only cause uncertainty and affect people with weak mentality.Please share your opinion.We are not sure since there are some big holders from old wallets and these are probably due for a dump since their considerable profits are so immense. Yes these movement could really affect the community or panic due to the possible dump but whatever the case, it can happened and we should be ready. But bitcoin is the largest coin out there and theres a lot of volume so even with dump market I think it can be nothing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "May 17, 2023, 08:24:27 AM",
      "body": "The transfer of thousands of bitcoins from the year 2011 or 2010 has not been reported.All old bitcoins you heard about in articles are from individuals and will not affect the market.The oldest that has been heard is the coins that were hacked from Mt. Gox which was not fully distributed.Do not listen to all these FUD related to this news, it is for ads clicks views and most of the analyzes are based on meaningless hypotheses.its importance will return to individuals who will either become rich or increase their spending rate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "May 17, 2023, 11:02:56 AM",
      "body": "Quote from: LSDadventure on May 15, 2023, 03:21:56 AMSome times I read articles that write about very old bitcoins like come from 2010, 2011 years. They woke up and were moved in on chain transactions in 2023.I read some discussions that those old bitcoin movements can create fear on the market. People think those old bitcoins can be dumped on the market and will cause a price fall.I don't think those old bitcoins are enough to dump the market. Those coins and movements only cause uncertainty and affect people with weak mentality.Please share your opinion.Most times such articles are built up to exert fears and tension among traders in the market, panicking to sell out based on what they have read. Some of these article company's have lost audience as it were and  therefore making up a subject as this to cause FUD among unsophisticated investors in bitcoin could attract a traffic wave for them among crypto enthusiasts . If anyone with such decades old bitcoin decides to sell, it's possible that such person or persons has got a dire need to deal with money and that doesn't mean it's going to have a devastating effect on the market. The market doesn't always have to be rosy anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "May 18, 2023, 02:46:40 AM",
      "body": "Quote from: Lida93 on May 17, 2023, 11:02:56 AMMost times such articles are built up to exert fears and tension among traders in the market, panicking to sell out based on what they have read. Some of these article company's have lost audience as it were and  therefore making up a subject as this to cause FUD among unsophisticated investors in bitcoin could attract a traffic wave for them among crypto enthusiasts .No, most of them are click me for selling ads articles. FUD affects the price when there is a strange movement in the price, such as a 10% decrease. Here, the user will search for the reason for this decrease, and then he will see these articles, and he believes that it is the reason and sells, so the snowball begins to grow.news like this at such random times is just to get views.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "May 18, 2023, 02:56:32 AM",
      "body": "Quote from: LSDadventure on May 15, 2023, 03:21:56 AMSome times I read articles that write about very old bitcoins like come from 2010, 2011 years. They woke up and were moved in on chain transactions in 2023.I read some discussions that those old bitcoin movements can create fear on the market. People think those old bitcoins can be dumped on the market and will cause a price fall.I don't think those old bitcoins are enough to dump the market. Those coins and movements only cause uncertainty and affect people with weak mentality.Please share your opinion.Please can you elaborate more on this, because you are kind of getting us confused with the word \"old Bitcoin\" because Bitcoin is Bitcoin and there is nothing like old or new Bitcoin. But there are people who happened to have bought bitcoin large amount of Bitcoin very cheap during it's early stage (i.e 1000 & above BTC) and those people are always referred to as \"whales\", whereby when such people tend to sell their coins it always has a great influence on the market due to it's large amount. So is that what you meant? @ O.P",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bounty _BOX",
      "created_time": "May 18, 2023, 05:06:52 AM",
      "body": "Quote from: LSDadventure on May 15, 2023, 03:21:56 AMSome times I read articles that write about very old bitcoins like come from 2010, 2011 years. They woke up and were moved in on chain transactions in 2023.I read some discussions that those old bitcoin movements can create fear on the market. People think those old bitcoins can be dumped on the market and will cause a price fall.I don't think those old bitcoins are enough to dump the market. Those coins and movements only cause uncertainty and affect people with weak mentality.Please share your opinion.Among the very old coins from 2010, 2011 are now surviving in the Bitcoin market. In 2010, 2011 many coins came in the market but could not survive only Bitcoin survived. The current price of Bitcoin is 27k dollars.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}