{
  "id": "topic_5470838",
  "title": "Forever101",
  "author": "Forever101",
  "created_time": "October 18, 2023, 08:00:22 PM",
  "content": "I create this post after I see say, a post wey Dem create about this board as e wan turn to market place where them dey drop anything them like. E good make we tell ourself truth. D way wey some people dey accuse others for the forum don dey too much, abeg. If you don grow your account or you don stay for long no mean say anybody with lower rank na trash be their post. Many newbie go definitely do mistake, that one no means say make we dey tired of them, even you wey dey blame others, I believe you know how many times you do mistake before you con Sabi. Since we no get moderator yet, anybody wey overdo pass in self make Dem let an know with love. I no dey like make person dey address others with hash words just because your rank pass others. I respect all the senior men for the board wey dey show love. Before some of the newbie no the forum, Dem dey live life, even without the forum , Dem go live life. Na hustle everybody dey as the country situation dey hard every day. Make anybody no frustrate another person for here. As presido talk, let the newbie breadth. Make we allow them breadth before them go give up for the forum. This thread suppose be reply for the thread wey I read but them don lock am. I know dey happy with all this accusation and the rest. No be everyday person go dey see something talk about bitcoins, so make we know make the board look like burial ground. Rank aside, everybody deserve respect, make we dey talk with love.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470838",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "October 18, 2023, 08:29:59 PMLast edit: October 19, 2023, 06:17:33 AM by Charles-Tim",
      "body": "In life, people are not the same. People are not kind the same way. The manner someone can approach you can be very different. But if a newbie is corrected which might be harsh, I will advice the newbie to see it as a constructive criticism if the correction is right.If you see when I started on this forum, I was corrected uncountable number of times and sometimes I do not like it. But I amended and there become a time that I see corrections as what should be posted on a forum because why are we on Bitcointalk if we can not correct ourselves and learn from each other.Part of the better ways that I am posting today is because of the corrections I accepted in the past. I like the English boards for that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Forever101",
      "created_time": "October 18, 2023, 08:52:12 PM",
      "body": "Quote from: Charles-Tim on October 18, 2023, 08:29:59 PMIn life, people are not the same. People are not kind the same way. The manner someone can approach you can be very different. But if a newbie is corrected which might be harsh, I will advice the newbie to see it as a constructive criticism if the correction is right.If you see when I started on this forum, I was corrected uncountable number of times and sometimes I do not like it. But I amend and it become a time that I see corrections as what should be posted on a forum because why are we on Bitcointalk if we can not correct ourselves.Part of the wiay I am posting today is because of the corrections I accepted in the past. I like the English boards for that.No be lie senior man. That your talk legit, na true say make them see am as constructive criticism. I be dey guess say u be English teacher before. Sharp sharp u don give am the right word. Lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Promocodeudo",
      "created_time": "October 18, 2023, 08:53:26 PM",
      "body": "Mistake is inevitable in life, nobody is exempted when it comes to mistake, op I agree with you in this aspect, it is better to correct someone instead of lashing him or her.Is just that people differ, op your message is straight and I agree with you, but you should know that forum is a community where you are opportune to get different ideas and criticism is part of the process, so newbies including me should grow a thick skin to absorb criticism here but the major thing is, learn from the criticism if eventually you are getting it wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Richbased",
      "created_time": "October 18, 2023, 09:23:39 PM",
      "body": "Quote from: Promocodeudo on October 18, 2023, 08:53:26 PMMistake is inevitable in life, nobody is exempted when it comes to mistake, op I agree with you in this aspect, it is better to correct someone instead of lashing him or her.Is just that people differ, op your message is straight and I agree with you, but you should know that forum is a community where you are opportune to get different ideas and criticism is part of the process, so newbies including me should grow a thick skin to absorb criticism here but the major thing is, learn from the criticism if eventually you are getting it wrong. Yes no body is an island of knowledge as sometimes we are likely to make mistakes as without mistakes there won't be corrections. This is our local board where we can treat each other with love and care and also help people develop on this platform.It is very bad how some of us just condemn others when they make mistakes instead of correcting them politely they start either insulting the person or demeaning them. Everyone is not perfect when we go to a new environment they ask questions, make mistakes before they learn about things concerning their environment, so it is here, everyone cannot share same idea or view things from same perspective but we should learn not to underrate anyone is this life as sometimes table do turn and the forum needs one another to grow",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Egii Nna",
      "created_time": "October 18, 2023, 09:27:37 PM",
      "body": "I believe in you, brother. In life, no be to they see person for small rank na him go show you say you don pass am, because I believe in this forum we even have many accounts that you will see their ranks are high actually, but when it comes to the authenticity and quality of post you will discover someone with member rank or jr member have more quality and qualified post than some of them that have high rank.Additionally, I want you to understand that in life, if you are at the top today, you might not be at the top tomorrow, and someone who did good will see it; likewise, those who did bad will also see it. I will just encourage our high-ranking members to give adequate support to newcomers and other members that are ready to learn because you can’t help someone who is not ready to learn, and I am urging newcomers and other members to engage in research to avoid embarrassment and also improve their knowledge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "October 18, 2023, 09:33:51 PM",
      "body": "Quote from: Forever101 on October 18, 2023, 08:00:22 PMAs presido talk, let the newbie breadth. Make we allow them breadth before them go give up for the forum. This thread suppose be reply for the thread wey I read but them don lock am. I know dey happy with all this accusation and the rest. No be everyday person go dey see something talk about bitcoins, so make we know make the board look like burial ground. Rank aside, everybody deserve respect, make we dey talk with love. I understand your plight and were your talk is actually heading to but here na public forum, your communication or words to use when expressing yourself here is not moderated and everyone for here come from different background even though na d same country we still dey share. If you overlook all dos kind talks, critics or unpleasant talks from people, believe me, na you go be the most respected and freely person for here. If na by wetin people dey tell you for the forum you wan continue your journey for here, you no go last long and you go miss out on your primary aim wey carry you come dis forum in d first place. Many members in the past have faced more of this lashes in the past and dey came out stronger and continue their journey here without been retard by any of those words. So make you emulate from others, na the best thing to do now be that. If you wan begin sit down say you wan correct everybody on the way dem go communicate with each other for the forum, you go just waste your precious time wey you go use do other useful things for here. We all come from different places and we think, talk and interact differently. If a person word hurts you, just try and ignore or avoid the person next time in the forum. Nothing is hard here unless the way you view am and wan react to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "October 18, 2023, 09:57:21 PM",
      "body": "Quote from: Forever101 on October 18, 2023, 08:00:22 PMI create this post after I see say, a post wey Dem create about this board as e wan turn to market place where them dey drop anything them like. E good make we tell ourself truth. D way wey some people dey accuse others for the forum don dey too much, abeg. If you don grow your account or you don stay for long no mean say anybody with lower rank na trash be their post. Many newbie go definitely do mistake, that one no means say make we dey tired of them, even you wey dey blame others, I believe you know how many times you do mistake before you con Sabi. Since we no get moderator yet, anybody wey overdo pass in self make Dem let an know with love. I no dey like make person dey address others with hash words just because your rank pass others. I respect all the senior men for the board wey dey show love. Before some of the newbie no the forum, Dem dey live life, even without the forum , Dem go live life. Na hustle everybody dey as the country situation dey hard every day. Make anybody no frustrate another person for here. As presido talk, let the newbie breadth. Make we allow them breadth before them go give up for the forum. This thread suppose be reply for the thread wey I read but them don lock am. I know dey happy with all this accusation and the rest. No be everyday person go dey see something talk about bitcoins, so make we know make the board look like burial ground. Rank aside, everybody deserve respect, make we dey talk with love. OP you don't expect everybody to react the same, some people can be moderate in their response others can be harsh as well. One thing you should understand is that, Human beings are sometimes stubborn, some of us no dey hear word. Wen senior members tell you say no do this thing, na that time them wan do that thing way them ask them not to do. So sometimes the harsh response dey help reset their brain to normalcy, because as this forum be, if you're not properly guided or handled, you go commit one crime unknowingly, and you go chop suspension or a ban.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.suevie",
      "created_time": "October 18, 2023, 11:06:15 PM",
      "body": "Quote from: Charles-Tim on October 18, 2023, 08:29:59 PMIn life, people are not the same. People are not kind the same way. The manner someone can approach you can be very different. But if a newbie is corrected which might be harsh, I will advice the newbie to see it as a constructive criticism if the correction is right.If you see when I started on this forum, I was corrected uncountable number of times and sometimes I do not like it. But I amend and it become a time that I see corrections as what should be posted on a forum because why are we on Bitcointalk if we can not correct ourselves.Part of the wiay I am posting today is because of the corrections I accepted in the past. I like the English boards for that.Well said big man, and to add to your reply, this community is actually a public place and everyone know how public place dey be, sometimes these so called harsh correction na watin the users really need because if I know anything sef, I know say correction no dey kill person and me sef go still count myself a learner here and just like what Charles Tim said everyone don actually get the blast especially for this forum because correction is actually the base to why this forum has survive and having so many users who are knowledgeable by fire and by force because only the strong survive so as a newbie watin I go advice na to just adhere to the correction if e dey on point and ignore if the person just wan splash and rain insults because na just the highest wey the person fit do be that, you, your own na to just continue working hard and stick to all the possible correction given and before you go know you sef don dey correct other newbies as I currently dey do now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Forever101",
      "created_time": "October 19, 2023, 03:53:12 AM",
      "body": "Quote from: Spaceman1000$ on October 18, 2023, 09:57:21 PMOP you don't expect everybody to react the same, some people can be moderate in their response others can be harsh as well. One thing you should understand is that, Human beings are sometimes stubborn, some of us no dey hear word. Wen senior members tell you say no do this thing, na that time them wan do that thing way them ask them not to do. So sometimes the harsh response dey help reset their brain to normalcy, because as this forum be, if you're not properly guided or handled, you go commit one crime unknowingly, and you go chop suspension or a ban.Your talk carry weight even though e dey very funny, na true you talk u yan so, why I even bring the matter b say, the thing don dey create argument and e don dey too much. QuoteMany members in the past have faced more of this lashes in the past and dey came out stronger and continue their journey here without been retard by any of those words. So make you emulate from others, na the best thing to do now be that. If you wan begin sit down say you wan correct everybody on the way dem go communicate with each other for the forum, you go just waste your precious time wey you go use do other useful things for here. We all come from different places and we think, talk and interact differently. If a person word hurts you, just try and ignore or avoid the person next time in the forum. Nothing is hard here unless the way you view am and wan react to themNo be for my sake oo, I b dey see say newbie for here dey somehow frustrated and the thing no go well at all. True true, some dey misbehave but make we try respect each other irrespective of rank.The hunger wey dey this country even rish to make person misbehave.  Anybody wey bring newbie make e also try enlight am . Like me, person wey introduce me na bounty ihn dey do even till now, na my Waka Waka make me Waka go other board con see wetin dey sup for there. Since then I Waka comot for bounty side come settle for other board. E really take me time b4 I adjust.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "October 19, 2023, 05:40:04 AM",
      "body": "Quote from: Forever101 on October 19, 2023, 03:53:12 AMNo be for my sake oo, I b dey see say newbie for here dey somehow frustrated and the thing no go well at all. True true, some dey misbehave but make we try respect each other irrespective of rank.Wetting you talk generally no bad at all, na very good observation you made about what is happening in this local board which all were as a result of too many unnecessary threads that is been created recently wey come be like say them they spam the board, but na true you talk say everybody deserve some respects which I think it is been consider just be say some people too they take things personal; but e get some corrections wey suppose be a motivation for us because we are all here to learn.We come from different background, locations, ethnicity and we have different manners of approach, but we are one and this wonderful forum unites us more. Therefore, lets all learn and forget all these kind discussions; learning about Bitcoin and we go earn and be free from government stress and others na im we they find, so make we they respect ourselves and at the same time be overlooking somethings so that we can all move and grow together,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DubemIfedigbo001",
      "created_time": "October 19, 2023, 06:12:49 AM",
      "body": "Quote from: Charles-Tim on October 18, 2023, 08:29:59 PMIn life, people are not the same. People are not kind the same way. The manner someone can approach you can be very different. But if a newbie is corrected which might be harsh, I will advice the newbie to see it as a constructive criticism if the correction is right.I agree with you on the matter of different personalities and manner of doing things, I also support OP for his view on this matter. But the issue of trying to see a harsh approach as a homely one is not accepted by me cos that will mean me lying to myself. The tone at which the senior men in the forum sometimes correct the inexperienced one here is very much emotionally draining. Sometimes I feel they have just forgotten so quick that they were once like us and that they felt the pain of growing gradually up till their present level. There was one response I got from my early days post that made me wish I could meet the guy one on one to put am for em body woto-woto.The truth is that most of their correction are not constructive at all, but destructive. You can imagine the emotional trauma these newbies whom are being attacked vigorously for simple mistakes are facing. most of them might end up feeling rejected in a forum where everybody should be welcomed to learn and grow in the knowledge of bitcoin and other important related topics. I strongly think the high ranked people should be sensitized on the importance of treating and educating the lower ranked with love and respect to enable them thrive in the forum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Igebotz",
      "created_time": "October 19, 2023, 07:14:19 AM",
      "body": "You made some valid points, but as much as we want to encourage newbies to make mistakes, we also want them to care about the board more. We encourage them to make fewer topics and communicate more, but the new set of newbies we have are not following this advice because they barely read and contribute to their own topics. They only want to spam, fish for merit, and join the signature campaign, and some of them never return to the board after joining the signature campaign. We welcome our newbies with open arms and criticise them when required; if that isn't enough, I'm not sure what else we can do. TBH, I have dozens of newbies from this board on my ignore list; the only reason I haven't sent their names to the G.Moderator to nuke them for spamming is that I believe in second chances, and nobody handed us gold on a silver platter when we were new. Op I only unignored you to see what you have to say since you've been on my ignore list for a long time and I'm tired of seeing duplicates and off-topic topics every week. We want you to write fewer topics and read more. This year, I have less than 5 topics, not because I don't have any, but because I prefer to read.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uche6215",
      "created_time": "October 19, 2023, 07:18:57 AM",
      "body": "Normally those harsh comments and attacks pain someone but we have to take them as corrections an move on, but newbies dey abuse di board any how with all the news in Nigeria. Op do even know di real purpose of this forum? Many Newbies are not ready to learn. Ok. Op how many questions have you asked in the Local Board? And how many questions has any other newbies have asked here. Newbies wey dey come here, he no dey gree learn again but busy posting local news to upgrade their ranks and dat becomes difficult 4 dem den dem con dey accused higher rank members for not doing well. Those who are here to learn ask questions on cryptocurrency related matters and learn from there but u people r only busy with newspapers. In dis forum need thick skin to scale through because dis one na only local board nai you dey complain, wen u go face di matter for general boards, you no go complain again. As dem dey attack u for local board na help dem dey help u if u no Kno, because it will make strong to face the general boards attacks. Op so don't complain take it as corrections and face di reality.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samlucky O",
      "created_time": "October 19, 2023, 08:12:40 AM",
      "body": "Op every thing you talk for here naso e be. Me personally na victim of that thread but when I reason wetting I post say e no make sense I wan delete but no way rather I lock the thread. As we all dey here we dey learn everyday. If you check the group we dey coordinate ourselves even say moderator no Dey. For example if you post already existing thread and somebody comment say the thread Dey active or say na off topic you go see say that person go lock the thread that is a sign of say we dey take correction.If you check the forum now you go see say many Facebook topic don reduce after that thread. And any post wey no make sense people no dey comment am again. If you post no body comment on am, you already done know say wetting you post no make sense. Most of the Bitcoin topics wey don past before, people don dey go comment on am and in go come out for top Post. And people go emphasis am. Just like the way ona talk every body no be the same we from different places and so our atitudes dey show for our body. But make we take that as an advantage to correct ourselves. Sometimes people no dey no wetting Dem dey do until you tell them. But I believe with everything wet I talk for here say people don dey change.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Timmzzy",
      "created_time": "October 19, 2023, 04:45:25 PM",
      "body": "My brother you don talk your mind, me self like this no dey even wan try to impress anyone or oppressed anyone for here, Las Las we no know ourselves na here bring us together me I see no sense say harsh words ni dem dey use address person and I dey see am say na high rank members do am pass. E dey pain but them no go understand, and some dey carry their family or life matter dey come here come carry am put for person head which e no supposed be so. Abeg make I follow beg make Una allow US the upcoming BREATH... ABEG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartCharpa",
      "created_time": "October 19, 2023, 07:20:19 PM",
      "body": "Quote from: Forever101 on October 18, 2023, 08:00:22 PMI create this post after I see say, a post wey Dem create about this board as e wan turn to market place where them dey drop anything them like. E good make we tell ourself truth. D way wey some people dey accuse others for the forum don dey too much, abeg. If you don grow your account or you don stay for long no mean say anybody with lower rank na trash be their post. Many newbie go definitely do mistake, that one no means say make we dey tired of them, even you wey dey blame others, I believe you know how many times you do mistake before you con Sabi. Since we no get moderator yet, anybody wey overdo pass in self make Dem let an know with love. I no dey like make person dey address others with hash words just because your rank pass others. I respect all the senior men for the board wey dey show love. Before some of the newbie no the forum, Dem dey live life, even without the forum , Dem go live life. Na hustle everybody dey as the country situation dey hard every day. Make anybody no frustrate another person for here. As presido talk, let the newbie breadth. Make we allow them breadth before them go give up for the forum. This thread suppose be reply for the thread wey I read but them don lock am. I know dey happy with all this accusation and the rest. No be everyday person go dey see something talk about bitcoins, so make we know make the board look like burial ground. Rank aside, everybody deserve respect, make we dey talk with love. As things be for this life we know how to talk pass each other, for this forum we still dey different kind we are not the same, some people be say it depend on how dey sabi talk, e fit be say the questions wey newbie dey ask, the high ranker may be talking to him in a proper way but the newbie see it so harshly but that is the way the person dey talk as usual. We all deserve to be treated equally but you should know that we do not have the same head and manner in this forum, some people find it very difficult to be corrected,some high rank know waiting dey face when dem dey rank up in this forum.Each newbie should understand that any place that you wanted to learn we must learn from good and bad, all we have to dey think be say na just time e be one day we'll be at the level too without giving up, because i can see that for this board we dey try enough to encourage each other not discourage anyone, nobody is left behind because that is all we are here to do. Op you are right but anytime we made a mistake and be corrected either harsh or normal talk we just to put it in mind that is all time and improve the next time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silver005",
      "created_time": "October 20, 2023, 10:42:00 PM",
      "body": "Yes my dear, I like your advice here, because this your topic is an advice to everyone,been you higher ranker or lower ranker,we are equally in the sight of God just as the bible said it,so please you been a high ranker does not necessarily mean your an the best English speaking person ok,it is because you start before the person you are harassing, just because you were introduce it this forum before the other person and that doesn't make the newbie senseless person ok,In this forum i think it will be of a good behavior when you see someone who is beginner and you guide him or her through, I think good deed has it rewards in heaven,and it's part of being your brother's keeper, in this earth we are not equal,we have have Big and small,we must not be in the same level at a time,so please it will be more helpful when you guide new beginner that insulting him or her whenever he or she made a mistake ok..And again as a newbie, not every insult you see you take it so serious instead of moving forward,so can just insult you just to got your attention and discourage you, and maybe along the lines you will quit just because of what someone said about you,do you know someone who doesn't want you to progress can never correct you in your mistake instead he or she will be discouraging you,by insulting your,..Please do not be discouraged by the insult giving to you by the higher ranker because of your mistake, remember that we learn through by our mistake ok..Please let's be our brother's keeper, remember no body is above mistake,you may be good in this field what about other fields and remember it may be your turn today tomorrow it may be another man's turn ok..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Forever101",
      "created_time": "October 21, 2023, 03:36:25 AM",
      "body": "As part of wetin person dey to talk, this poster na naija in be . Make we check the post and the reply wey people dey give am https://bitcointalk.org/index.php?topic=5455740.msg62374254#msg62374254This guy topic be like e dey too authoritative and kind of rude , na so people begin nack am from right and left.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Forever101",
      "created_time": "October 22, 2023, 12:03:39 PM",
      "body": "Quote from: Igebotz on October 19, 2023, 07:14:19 AMOp I only unignored you to see what you have to say since you've been on my ignore list for a long time and I'm tired of seeing duplicates and off-topic topics every week. We want you to write fewer topics and read more. This year, I have less than 5 topics, not because I don't have any, but because I prefer to read. You ignored me when I was new and full of excitement of discovering this board. Then I knew I made a lot of errors and was corrected. You can check my posting habit now, you will notice the great change, please go through and give me a feedback if am inline or am out of place. Thanks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}