{
  "id": "topic_5471074",
  "title": "Mia Chloe",
  "author": "Mia Chloe",
  "created_time": "October 20, 2023, 05:09:56 PMLast edit: October 27, 2023, 08:38:22 AM by Mia Chloe",
  "content": "This forum in general has some buttons and functions or tweaks that may  seem hidden to some forum members.most of these buttons help do some important things that we need especially when creating posts or even getting some threads.However forum members tend to master these buttons, functions and tweaks over time.But I am creating this thread with the aim of assisting forum members in getting to know them easily.Note!!; this thread may not carry all \"hidden\" functions or buttons therefore any additional information would be appreciated.RECENT THREADSThe button above is used to show recent threads/posts in a particular board. Using the button gives you a list of recent post with the space of about 24hrs - 36hrs arranging them in order of most recent to least recentTHREAD ORDER OR SORTINGBy OPWhen in a particular board,this button is used to arrange posts/ threads in order of user names of original posters (OP) alphabetically.By subjectThis button on the other hand is used to arrange or sort all threads in a particular board alphabetically based on their subjects,topic or title.By replyThis button sorts all posts in a particular board starting from those with the least number of replies to those with the most replies or starting with those of most replies to those of least reply.By views This button is used to sort posts in a particular board in term of views.single clicking sorts post from least viewed to most viewed ,while double clicking sorts posts from  most viewed to least viewed.By order of replies in a thread This button sorts posts /replies in a thread from oldest to most recent and also from most recent to oldest depending on your preference.THREAD MARKING These check boxes can be used to mark posts by single clicking them.These marked post  can then be;Marked as readLocked Or moved.By using the Function above, selecting your desired choice  and hitting \"Go!\"  Jumping to boards and important threads/sectionsThis button is used to Jump to. A particular board, thread ,post or section.it also displays the current board you are surfing.HIDING AND UNHIDING BOARDSThis button can be used to hide or unhide boards grouped under a particular section.USING POSTING TOOLSThese tools are used to organize and improve post creations. You can  know their functions by toggling over them with your cursor or if you are using chrome on  a mobile phone you can hold a particular icon this would give you a summary of it's function like in the image below.Checking your S meritsTo do this you can go over to your profile, click the \"Merit\" button, click the url and clear the digits that end the url then hit enter.The result!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471074",
  "comments": [
    {
      "author": "Cantsay",
      "created_time": "October 20, 2023, 05:15:21 PM",
      "body": "Can we start by you reducing the size of your image? I believe 80% of the things in this thread can be found here: https://bitcointalk.org/index.php?action=help;page=indexFor newbies that are interested in the forum they might be able to get the info themselves but those that are lazy and want to be spoon fed with all information then this thread will help them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "October 21, 2023, 05:15:35 AM",
      "body": "I remembered myself in the first days of visiting the forum. This happened through trial and error. Some functions of the forum were important to me, in particular how to navigate to a topic that interests me and how to write a post. No more. In the future, everything was mastered according to free time and interests. Although I must admit that I have never used the forum on a mobile device. This is probably why it is more convenient to understand and see how simple everything is on the big screen, but I believe that every person is capable of understanding these issues. To those who visit forums on a regular basis, the design of this forum seems quite simple to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goxcraft",
      "created_time": "October 21, 2023, 07:46:59 PM",
      "body": "It's very easy. At first, it may seem a bit confusing, but as you get used to the forum and explore more, you'll see that it's not that hard. Bitcointalk has a lot of hidden features, but most of them are not needed for regula based use. Like some hidden emojis. Some users even struggle to write a proper reply. It's only a matter of time and practice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "October 22, 2023, 09:37:04 PM",
      "body": "Thanks for this tips, but I think we have more in this threads:Hidden pages/ features on the forumBitCoinTalk hidden pages - undocumented featuresWe also have this tools called: https://bpip.org/You can check your merit status information there, like how many merits you earn in the last x days and others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "knowngunman",
      "created_time": "October 23, 2023, 12:31:39 PM",
      "body": "Quote from: Cantsay on October 20, 2023, 05:15:21 PMCan we start by you reducing the size of your image? I believe 80% of the things in this thread can be found here: https://bitcointalk.org/index.php?action=help;page=indexFor newbies that are interested in the forum they might be able to get the info themselves but those that are lazy and want to be spoon fed with all information then this thread will help them. You put it right. Every single thing about the forum has been explain in one thread or another. Although some explanation may seems complicated to newbies that they may need additional explanation while some are well explained in a layman language. From the stage of registration and creation of account, Forum navigation, rules, merits system, trust, messages and lot more but as you said, laziness will not allow us to read about these features and get familiar with them. However, I must commend the op for taking his time on this and for the image illustration for easier understanding. In the aspect of typing, the symbol are well self explanatory unless someone is new to using ms word.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "October 23, 2023, 01:58:43 PM",
      "body": "Quote from: Cantsay on October 20, 2023, 05:15:21 PMCan we start by you reducing the size of your image? I believe 80% of the things in this thread can be found here: https://bitcointalk.org/index.php?action=help;page=indexFor newbies that are interested in the forum they might be able to get the info themselves but those that are lazy and want to be spoon fed with all information then this thread will help them. Aside this, all that have been also mentioned by OP are things that are not hidden, they are what anyone can vividly see while navigating the forum or press to see what their function is, this are several buttons customized with various functions that are not hard to learn or know about, am not saying that OP is not making his own point from his view but am seing all he did as needless efforts because they are there for everyone to see learn and use.Do anyone need to explain to me the use of hime button, messages or profile when everything is there, we may not know everything at once at the same time but this are areas that we can probably discover by ourselves without being told if we are that versatile with the use of the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "October 23, 2023, 03:25:10 PM",
      "body": "Quote from: 348Judah on October 23, 2023, 01:58:43 PMQuote from: Cantsay on October 20, 2023, 05:15:21 PMCan we start by you reducing the size of your image? I believe 80% of the things in this thread can be found here: https://bitcointalk.org/index.php?action=help;page=indexFor newbies that are interested in the forum they might be able to get the info themselves but those that are lazy and want to be spoon fed with all information then this thread will help them. Aside this, all that have been also mentioned by OP are things that are not hidden, they are what anyone can vividly see while navigating the forum or press to see what their function is, this are several buttons customized with various functions that are not hard to learn or know about, am not saying that OP is not making his own point from his view but am seing all he did as needless efforts because they are there for everyone to see learn and use.Do anyone need to explain to me the use of hime button, messages or profile when everything is there, we may not know everything at once at the same time but this are areas that we can probably discover by ourselves without being told if we are that versatile with the use of the forum.  Anyone is entitled to his opinion on this hinged on how they their contact with the forum in their initial stage as a member was. What could seem to be very easy for X might be difficult for Y to, the learning pace and understanding especially in self-learning can never be similar for everyone.I can remember many mistakes I was making in my first stage navigating and making use of the functions in the forum which I would have mentioned some but not to embarrass myself I'll like to keep it blind as it is. Op has done his own part in assisting newbies learn a thing or two if they're interested and if for some reasons it seems like a needless effort to you it could be of benefit to an anonymous fellow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Broadanbig",
      "created_time": "October 23, 2023, 05:54:04 PM",
      "body": "OP you have done well to have taken out time to put up this information here for us to see. I believe it does not only bothers newbies alone but every one member of this platform. This virtuals is more appropriate for new beginners to easily get acquainted up with. I had to take my time to read through, although most of what OP has done here is a replica of can't say has already revealed to us to see but it is still good OP came up with this idea so that people would see also learn. Weldone OP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "October 23, 2023, 06:23:20 PM",
      "body": "Is it just me that doesn’t see the checkboxes on the right hand side of the screen as shown in one of the  OP's images under \"Thread Marking\", or is it a general thing. I’ve looked over the forum settings to see if there’s an entry to configure viewing the column, but haven’t managed to find it. I’ve tried it with different browsers but still I can’t get to see the said column. Not that I’d probably use it, but I’m wondering why I can’t see the darn column.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "October 23, 2023, 06:28:09 PM",
      "body": "Quote from: Mia Chloe on October 20, 2023, 05:09:56 PMNote!!; this thread may not carry all \"hidden\" functions or buttons therefore any additional information would be appreciated.We cannot describe them as “hidden” functions or buttons, but they are unused or difficult to notice.Some of these features I know for the first time, such as https://bitcointalk.org/index.php?action=unread;board=1.0Find out the latest post by adding #new to the end of the link.Modifying the image code to this code gives better results on the screen I use.Code:[center][img width=350]Image_Here[/img][/center]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "October 23, 2023, 11:56:44 PM",
      "body": "Quote from: DdmrDdmr on October 23, 2023, 06:23:20 PMIs it just me that doesn’t see the checkboxes on the right hand side of the screen as shown in one of the  OP's images under \"Thread Marking\", or is it a general thing. I’ve looked over the forum settings to see if there’s an entry to configure viewing the column, but haven’t managed to find it. I’ve tried it with different browsers but still I can’t get to see the said column. Not that I’d probably use it, but I’m wondering why I can’t see the darn column.OP probably set up his account that wayYou can also set it by heading over to Profile ---> Look and Layout Preferences ---> Show quick-moderation on message index as \"checkboxes\" right at the bottom. The default is \"don't show\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "October 24, 2023, 11:55:00 PM",
      "body": "Quote from: Cantsay on October 20, 2023, 05:15:21 PMCan we start by you reducing the size of your image? I believe 80% of the things in this thread can be found here: https://bitcointalk.org/index.php?action=help;page=indexFor newbies that are interested in the forum they might be able to get the info themselves but those that are lazy and want to be spoon fed with all information then this thread will help them. If this is the first forum of a newbie this post is worth reading, good tutorial with images although the screenshots are not properly configured he could have cropped it properly and only screenshot the highlights like the one below.But still a good tutorial.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ronsbit",
      "created_time": "October 25, 2023, 02:05:33 AM",
      "body": "I have not been too constant here but upon stumbling on this I knew OP did a whole lots of findings to assist those who knows not this features here. I had no knowledge of this until now and I can say that these are the little things that matters as well as to keep more futures unfolding here. I think this tutorial video would be of much help to newbies who are just coming in. If they are willing to learn, they could utilize the opportunity to learn this futures about the platform very well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "October 25, 2023, 02:57:03 AM",
      "body": "Quote from: DdmrDdmr on October 23, 2023, 06:23:20 PMIs it just me that doesn’t see the checkboxes on the right hand side of the screen as shown in one of the  OP's images under \"Thread Marking\", or is it a general thing. I’ve looked over the forum settings to see if there’s an entry to configure viewing the column, but haven’t managed to find it. I’ve tried it with different browsers but still I can’t get to see the said column. Not that I’d probably use it, but I’m wondering why I can’t see the darn column.Same here, that particular feature isn't also part of my current setting. I assume many of us are not really changing much of the default settings. Even the time format, I kept it as is. So there's going to be a real time and a forum time.  I remember I was already ranked hero or even legendary when I learned that I can actually change the settings so that the signatures and/or avatars of users won't show, or that users can reply to threads while changing the title/subject, like what I'm doing right now. It's fun to discover old features on this forum after many years of being active.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "October 25, 2023, 07:39:07 AM",
      "body": "Quote from: DdmrDdmr on October 23, 2023, 06:23:20 PMIs it just me that doesn’t see the checkboxes on the right hand side of the screen as shown in one of the  OP's images under \"Thread Marking\", or is it a general thing. I’ve looked over the forum settings to see if there’s an entry to configure viewing the column, but haven’t managed to find it. I’ve tried it with different browsers but still I can’t get to see the said column. Not that I’d probably use it, but I’m wondering why I can’t see the darn column.To set this up, navigate to your Profile, then go to Look and Layout Preferences. Look for the option labeled \"Show quick-moderation on message index as\" (should be the last in the list) and set this to \"checkboxes\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "October 25, 2023, 04:31:58 PM",
      "body": "Great idea to create a thread on something unique, rather than making a similar topic of \"BitcoinTalk Rules\" and I am sick of those topics to be very honest. Kudos on finding something unique to earn some Merits. One thing you could have improved is the title of this whole post.Buttons and tools doesn't give me a feeling of it being a helpful guide or a tutorial.How about -> [Guide] Buttons and Tools on BitcointalkSomething like that would have made more sense, what do u all think?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "October 26, 2023, 01:17:54 PM",
      "body": "Hmm, A decent step-by-step guide buddy, keep it up you are doing really well, Newbies ask many repetitive questions, and most of the time they also ask the questions covered in the topic by the OP. In the same topic, Op can even cover the profile-created settings well, and it would be great if he did so as many of the time users aks abut removing these signatures below every post, and other like setting up Avtar etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mia Chloe",
      "created_time": "October 26, 2023, 02:03:26 PM",
      "body": "Quote from: Hamza2424 on October 26, 2023, 01:17:54 PMHmm, A decent step-by-step guide buddy, keep it up you are doing really well, Newbies ask many repetitive questions, and most of the time they also ask the questions covered in the topic by the OP. In the same topic, Op can even cover the profile-created settings well, and it would be great if he did so as many of the time users aks abut removing these signatures below every post, and other like setting up Avtar etc.I will see to creating other guided steps to the things you mentioned @Hamza2424. I have been quite busy lately however I will make out time to create some other guides.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}