{
  "id": "topic_5522308",
  "title": "ukaddict",
  "author": "ukaddict",
  "created_time": "December 10, 2024, 03:55:43 PM",
  "content": "So I got thinking today about the private key, is it naive to assume a very very very advanced computer could guess one’s private key?The private key is what 30 characters? And the wallet address is another 30 characters, surely someone could be working on this as we speak and steal our wealth?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5522308",
  "comments": [
    {
      "author": "BitcoinBarrel",
      "created_time": "December 10, 2024, 04:04:15 PM",
      "body": "It's been discussed before, but it would be much much easier to solve a block than it would be to crack a wallet with a balance.You could have a super computer attempting to crack a private key, and it would take thousands of years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "December 10, 2024, 04:04:35 PM",
      "body": "A bitcoin private key provides 2128 bits of security and that's secure enough. Quote from: ukaddict on December 10, 2024, 03:55:43 PMThe private key is what 30 characters? And the wallet address is another 30 characters, surely someone could be working on this as we speak and steal our wealth?30 characeters? You should be referring to mini private keys that are not common at all. The most common format of a bitcoin private key is WIF and that includes 51-52 characters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ukaddict",
      "created_time": "December 10, 2024, 04:20:03 PM",
      "body": "So what is the difference between and private and public key?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ukaddict",
      "created_time": "December 10, 2024, 04:26:28 PM",
      "body": "Quote from: hosseinimr93 on December 10, 2024, 04:04:35 PMA bitcoin private key provides 2128 bits of security and that's secure enough. Quote from: ukaddict on December 10, 2024, 03:55:43 PMThe private key is what 30 characters? And the wallet address is another 30 characters, surely someone could be working on this as we speak and steal our wealth?30 characeters? You should be referring to mini private keys that are not common at all. The most common format of a bitcoin private key is WIF and that includes 51-52 characters. I guess my point is then in say 10 years time there’s a chance a computer could crack my code and break in and steal my stuff, plus, how would we know, who’s going to report on it?Plus I am using electrum which I downloaded from their website, does this app not connect to their database, like what’s stopping someone from gaining access to electrum database and changing the security so it can view the user’s’ apps data.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "December 10, 2024, 04:35:54 PM",
      "body": "Quote from: ukaddict on December 10, 2024, 04:20:03 PMSo what is the difference between and private and public key?https://learnmeabitcoin.com/beginners/guide/keys-addresses/https://learnmeabitcoin.com/beginners/keys/private-key/https://learnmeabitcoin.com/beginners/guide/public-keys/Above are enough for your reading to understand about Bitcoin private key, public key and public address.Mastering Bitcoin book, with a free version on Github, can useful for you. Read Chapter 4, Keys and Addresses.https://github.com/bitcoinbook/bitcoinbook/blob/develop/ch04_keys.adoc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "December 10, 2024, 04:43:45 PM",
      "body": "Quote from: ukaddict on December 10, 2024, 04:20:03 PMSo what is the difference between and private and public key?Whenever you want to receive bitcoin from someone, you give them your address which represents a locking script and is a function of your public key. Whenever you want to spend your bitcoin, you use your private key for creating the unlocking script and signing the transaction. Quote from: ukaddict on December 10, 2024, 04:26:28 PMPlus I am using electrum which I downloaded from their website, does this app not connect to their database, like what’s stopping someone from gaining access to electrum database and changing the security so it can view the user’s’ apps data.Electrum is open-source and there's nothing hidden from the users. There is no database and your keys are generated locally on your own device.Just note that any online device is always prone to hacking and if you are online, there's always the possibility that your device is infected with a malware and you get hacked.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jon_Hodl",
      "created_time": "December 10, 2024, 06:20:15 PM",
      "body": "Yes. It's a piece of cake for any computer with access to more energy than the sun and where time doesn't matter. Otherwise, it's impossible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Munish_Gaurav",
      "created_time": "December 10, 2024, 06:38:12 PM",
      "body": "Hello Buddy, bitcoin private key is very much secure.. no one can guess others private key,. and even cracking any random bitcoin address's private key is not feasible with current technology or even with near future technology..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "December 10, 2024, 06:56:17 PM",
      "body": "Quote from: ukaddict on December 10, 2024, 03:55:43 PMSo I got thinking today about the private key, is it naive to assume a very very very advanced computer could guess one’s private key?Yes, theoretically it's possible but practically it has never happened and that's why I suggest you to not worry about such things. Everything is possible in theory but as long as it hasn't been done practically then it's just a theory not reality.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MoneyEnthusiast",
      "created_time": "December 10, 2024, 07:19:33 PM",
      "body": "Quote from: ukaddict on December 10, 2024, 03:55:43 PMSo I got thinking today about the private key, is it naive to assume a very very very advanced computer could guess one’s private key?The private key is what 30 characters? And the wallet address is another 30 characters, surely someone could be working on this as we speak and steal our wealth?Maybe see my thread:https://bitcointalk.org/index.php?topic=5522325.0Firstly, my estimation of just 312 qubits required to implement the algorithm for the search space of 62^52 is based on the fact that the algorithm requires a register of n qubits to search a space of size 2^n. Get it? Using a calculator, we can estimate that n ≈ 312, which means that we would need at least 312 qubits to implement the algorithm for this search space.Critics (and I was once one) may argue that this estimation is bogus and wrong, but it's essential to understand that the calculation is based on the fundamental principles of quantum computing and the algorithm's requirements. The estimation may not be exact, but it provides a reasonable approximation of the number of qubits required.Moreover, it's crucial to consider the context of the estimation. The algorithm is designed to search for a pair-key in a sorted set and something more, which is a specific problem that can be solved more efficiently using quantum computing. The estimation of 312 qubits is not meant to be a general solution for all cryptographic problems, but rather a specific solution for this particular problem.Regarding the criticism that the estimation is too low, it's essential to consider the practical considerations of implementing the algorithm. Error correction and noise reduction are crucial aspects of quantum computing, and they may require additional qubits to implement. However, these considerations do not significantly impact the estimation of 312 qubits.It's also worth noting that building a hybrid access table to extract pub/priv key out would require a significant amount of quantum memory, which is a challenging task without my secret sauce. However, this does not invalidate the estimation of 312 qubits required to implement the algorithm.In conclusion, the estimation of 312 qubits required to implement the algorithm for the search space of 62^52 and more is a reasonable approximation based on the fundamental principles of quantum computing and the problem. While critics may argue that the estimation is too low, it's essential to consider the context and practical considerations of implementing the algorithm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "December 10, 2024, 08:24:30 PMLast edit: December 10, 2024, 08:36:16 PM by apogio",
      "body": "Quote from: ukaddict on December 10, 2024, 03:55:43 PMSo I got thinking today about the private key, is it naive to assume a very very very advanced computer could guess one’s private key?To avoid any confusion, I'll try to help you grasp the difficulty of breaking 128 bits with brute-force.Quote from: BitcoinBarrel on December 10, 2024, 04:04:15 PMYou could have a super computer attempting to crack a private key, and it would take thousands of years.The actual time needed to brute force 128 bits, which is the security of a bitcoin private key is orders of magnitude larger than thousand years.Let's calculate... (let's get nerdy!)Assuming that we used 1,000 times all the power of the miners that work today to generate bitcoins (a.k.a the total bitcoin's hashrate), we could do approximately 800 EH/s * 1,000.800 EH/s * 1,000 = 8 * 1,000,000,000,000,000,000 H/s * 1,000 = 8 * 10^21 H/sLet's convert the number to the power of 2.ln(8*10^21)/ln(2) ~= 73 bits.So, if we used 1,000 times the whole bitcoin network, we would have the power to calculate 73 bits per second.We would, therefore, need 2^128 / 2^73 = 2^55 seconds to be able to calculate the whole 128 bits.I am using an online tool to tell me that 2^55 seconds is approximately 1.15 * 10^9 years, which is approximately 1.15 billion years.Now, the good news is that according to NASA, the sun will explode in approximately 5 billion years, which means that we still have enough time to do it!  Good luck!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MoneyEnthusiast",
      "created_time": "December 10, 2024, 08:26:18 PM",
      "body": "Let's add more wild-characters to our existing 52-bit private key, and watch how it proportionally increases the number of qubits required!52 bits: 312 qubits (given) 128 bits: 1500 qubits 256 bits: 6000 qubits - We could have done this, and it's awesome that we have the option! 512 bits: approximately 24,000 qubits 1024 bits: approximately 96,000 qubits 2048 bits: approximately 384,000 qubitsWe're not chasing the dragon; we're riding the wave of innovation! With every smart protocol change, we're making it more challenging, but that's what makes it exciting! Better now than never, and we're making progress!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "headingnorth",
      "created_time": "December 10, 2024, 10:07:57 PM",
      "body": "The best thing to do is to follow best practices when storing and moving your bitcoin. For example, never use the same bitcoin address more than once. By following this one simple practice, it is likely quantum computing will never be able to compromise your funds. If your funds are currently in an address that has been used more than once, what you can do is simply move them to a brand new fresh address, and don't ever use that address again. To make it even more difficult if not impossible to compromise, use a passphrase (also known as a hidden wallet) and send most or all of your funds to the hidden wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "December 10, 2024, 11:07:06 PM",
      "body": "Quote from: ukaddict on December 10, 2024, 03:55:43 PMSo I got thinking today about the private key, is it naive to assume a very very very advanced computer could guess one’s private key?The private key is what 30 characters? And the wallet address is another 30 characters, surely someone could be working on this as we speak and steal our wealth?No technology can guess anyone's private key as of the moment. What happened to every possible hack is due to users's device were hack/malware then those sensitive data were collected or user use a fake/phishing site. Protecting your private key is one thing but protecting your device is another.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Najmul779",
      "created_time": "December 11, 2024, 12:40:58 PM",
      "body": "The number of possible combinations for these keys is astronomically large, making brute-force attacks impractical. Even with the most powerful computers, it would take an incredibly long time to exhaust all possibilities.My opinion to Use hardware wallets or robust software wallets with strong security features. or Use the latest versions of your wallet software and operating system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 11, 2024, 05:48:17 PM",
      "body": "its alot quicker for a hacker to:get to know you, ask you to download a file he pretends is something of interest, but in actual fact is a tool that allows him access to your computerget to know you, tempt you into using their website as a exchange and persuade you to deposit funds(to an address of the hacker/phisher)get to know you, learn your home location, arrive at your house and steal your deviceor they can brute force all possible combinations and make it a project their children, grandchildren and descendants of thousands of years to work onor they can brute force all possible combinations and randomly come across someone else keypair first and give up finding yours specifically",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HajiBagi",
      "created_time": "December 11, 2024, 05:53:04 PM",
      "body": "Quote from: Munish_Gaurav on December 10, 2024, 06:38:12 PMHello Buddy, bitcoin private key is very much secure.. no one can guess others private key,. and even cracking any random bitcoin address's private key is not feasible with current technology or even with near future technology..It will be very difficult for a person to guess and create some private key, I don't think that can even be possible, we are talking about 30 characters written up here, and creating that can never happen even if anyone creates it will never because the wallet is created by technology that no one will never know much about it, I don't think that will never happen.Before creating 30 characters that will be able to match someone's address it will be very difficult because there will be many mistakes, I don't think we need to talk about a person creating someone's private key and using it to scam people, who can never happen even in the future it will never work, before creating wallet they have created how to secure a wallet but public and private key.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JiiBs",
      "created_time": "December 11, 2024, 06:19:12 PM",
      "body": "Quote from: ukaddict on December 10, 2024, 04:20:03 PMSo what is the difference between and private and public key?Will it be okay to say,One is for private use while,The other could given to the public.That’s it literally but again,Your private key as it entails is the keys to your Bitcoin volt, which ever wallet you might be using. Anyone who shares this key with you is a co-owner of your Bitcoin.Public key is the address you give out for Bitcoin deposit, scanning for transactions and transaction details and more. It really doesn’t matter who you give it to if you don’t mind having just anyone to know of your Bitcoin activities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odusko",
      "created_time": "December 11, 2024, 06:20:17 PM",
      "body": "Quote from: ukaddict on December 10, 2024, 03:55:43 PMSo I got thinking today about the private key, is it naive to assume a very very very advanced computer could guess one’s private key?The private key is what 30 characters? And the wallet address is another 30 characters, surely someone could be working on this as we speak and steal our wealth? don't share your private keys online keep it private because it's your private property and keep it save far away from third party, as long as you can ensure that you observe all of the above mentioned security caution as regards to your private keys, you are safe and guaranteed Bitcoin, if you observe all that I mentioned above to protect your Bitcoin wallet private keys you can have 💯 security above any computer or softwares developer or hackers no matter how advanced their are, they won't be able to bypass you into having access to your private keys, so for that we have to bear self safety in mind all the time, most of the time that our Bitcoin wallet or other cryptocurrency wallets get hacked it's not about the smartness of the hackers or level of advancement of the computer but about our individual responsibility letting the other backend having access to our important datas online unknown to us.Guessing our private keys by third party is impossible, so it as much secured to the extent that we expose and let it out when interacting with others, Bitcoin network is most secured and decetlntalised and at that having security issues is far from Bitcoin or other decetlntalised coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}