{
  "id": "topic_5469494",
  "title": "elevates",
  "author": "elevates",
  "created_time": "October 07, 2023, 05:01:59 AM",
  "content": "I found this exciting news coming from an Indian exchange. KoinBX one of the Indian cryptocurrency exchanges is now ranked under the top 100 spot exchanges on CoinMarketCap. Other Indian exchanges have been struggling with low volume and liquidity issues after the 30% tax slab was announced. KoinBX started onboarding new users not only from India but from 50+ major countries across the globe. They are operating in Asia, Africa, and Europe. The current spot trading volume of KoinBX is BTC3,395 as per CMC.What do you guys think? Will other Indian cryptocurrency exchanges follow the path of KoinBX?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469494",
  "comments": [
    {
      "author": "pakhitheboss",
      "created_time": "October 07, 2023, 06:43:35 AM",
      "body": "Without raising any funds for investment if they are performing so good then it is commendable. I expected those unicorn exchanges to be in that position. It means that the other Indian exchanges can make them profitable if they diversify thier user base. I don't think others will follow them as they are waiting for the next bull run. They are only concentrating on Indian users. Whereas Indian users are moving to International exchanges. Congratulations to KoinBX team in achieving the 94th position.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bureau",
      "created_time": "October 07, 2023, 12:08:16 PM",
      "body": "In this bear market, an Indian exchange reporting high volume and getting ranked on the list of 100 is admirable. I do not know how this Chennai-based exchange got into that league I certainly believe they are getting users from other countries. They might have pairs that most exchanges in India do not have. I have never registered or tried using KoinBX, this is the first time I have heard about it. I only knew a few Indian exchanges like Zebpay and Wazirx. I was surprised to read that they started their exchange way back in 2018, the same year when Wazirx started.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "October 07, 2023, 04:50:22 PM",
      "body": "I am waiting for the day when the Indian exchanges come under the top 50 list there.With growing crypto demand in India and increasing adoption we are supposed to rocket forward too, but the thing stopping us is the 30% tax slab and people are trying to avoid this by reducing their crypto use or bypassing it by different means/under reporting tax capital gains.Things will take time to develop in this space, in India it will take even longer. As soon as this tax wall breaks down, there will be a huge boom in trading volume.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin Smith",
      "created_time": "October 07, 2023, 04:55:41 PM",
      "body": "I don't have an account there but watched the videos from the founder of this exchange but its surprising to see the numbers are higher than the wazirx. Available on 160 countries? Seriously, if that is true then why they didn't try to bring their exchange to next level, surely they can reach bigger heights if they promote their brand to the actual user base and who knows they maybe even capable of top 20 in a year or two in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cafter",
      "created_time": "October 08, 2023, 04:16:30 AMLast edit: October 13, 2023, 02:53:30 AM by cafter",
      "body": "Nice to see, A New(edit: this is not new this was launched in 2018) Indian exchange achieved 94th position on the global exchanges list, Even beating the leading Indian exchanges Wazirx and CoinDCX.Their Trading Fee are very low compared to other Indian exchanges which gives them a advantage to gain more user. The website is clean and easy to use, Definitely would tried it if not registered on other global exchanges.I heard their name first time they need to do some promotions now, to bring new crypto users on their platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "October 10, 2023, 02:56:08 AM",
      "body": "Would have tried it if it didn't require kyc, and wasn't already registered on other exchanges, which are servicing needs just fine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitnote",
      "created_time": "October 12, 2023, 12:06:09 PM",
      "body": "I only have one crypto exchange account which is on Wazirx. I will make another account on other exchanges because Wazirx isn’t doing well right now. KoinBX is a new crypto exchange. Can be trusted?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "October 12, 2023, 03:57:37 PM",
      "body": "Good to see an Indian exchange in top 100 exchanges but I wonder how come I never heard of it before.It's the first time I am hearing about KoinBX. I guess they are really saving up on advertisements which is good by the way.I just hope this one doesn't turn out to be a rug pull.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "October 13, 2023, 02:22:33 AM",
      "body": "Quote from: pawanjain on October 12, 2023, 03:57:37 PMGood to see an Indian exchange in top 100 exchanges but I wonder how come I never heard of it before.It's the first time I am hearing about KoinBX. I guess they are really saving up on advertisements which is good by the way.I just hope this one doesn't turn out to be a rug pull.I was reading about them on CMC, they launched their platform in 2018. This was the same time when WazirX was launched and few other Indian exchanges. Their focus has always been global than local. That might be the reason why they are ranked within the top 100 exchanges globally. Other exchanges were basically focusing on getting Indian users on board. They spent a good chunk of their earnings on advertising in India. They never new that the government of India would destroy their ambition with the tax slab.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "October 13, 2023, 05:37:57 AM",
      "body": "Quote from: pakhitheboss on October 13, 2023, 02:22:33 AMQuote from: pawanjain on October 12, 2023, 03:57:37 PMGood to see an Indian exchange in top 100 exchanges but I wonder how come I never heard of it before.It's the first time I am hearing about KoinBX. I guess they are really saving up on advertisements which is good by the way.I just hope this one doesn't turn out to be a rug pull.I was reading about them on CMC, they launched their platform in 2018. This was the same time when WazirX was launched and few other Indian exchanges. Their focus has always been global than local. That might be the reason why they are ranked within the top 100 exchanges globally. Other exchanges were basically focusing on getting Indian users on board. They spent a good chunk of their earnings on advertising in India. They never new that the government of India would destroy their ambition with the tax slab. Have you tried their platform? Or if there's anyone else who is actively using KoinBX can they share their review of the exchange.I wanted to know how they are providing deposits and withdrawals in INR and if it's reliable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "October 13, 2023, 05:41:12 AM",
      "body": "Quote from: pawanjain on October 13, 2023, 05:37:57 AMQuote from: pakhitheboss on October 13, 2023, 02:22:33 AMQuote from: pawanjain on October 12, 2023, 03:57:37 PMGood to see an Indian exchange in top 100 exchanges but I wonder how come I never heard of it before.It's the first time I am hearing about KoinBX. I guess they are really saving up on advertisements which is good by the way.I just hope this one doesn't turn out to be a rug pull.I was reading about them on CMC, they launched their platform in 2018. This was the same time when WazirX was launched and few other Indian exchanges. Their focus has always been global than local. That might be the reason why they are ranked within the top 100 exchanges globally. Other exchanges were basically focusing on getting Indian users on board. They spent a good chunk of their earnings on advertising in India. They never new that the government of India would destroy their ambition with the tax slab. Have you tried their platform? Or if there's anyone else who is actively using KoinBX can they share their review of the exchange.I wanted to know how they are providing deposits and withdrawals in INR and if it's reliable.I came to know about this exchange only after this thread was created. I was also clueless that they existed. I did some research about them and that too only using CMC data. They look legit to me, I haven't heard or read anything wrong about them. I haven't used the exchange and don't plan to as you need to pass KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "October 13, 2023, 07:50:48 AM",
      "body": "Quote from: pakhitheboss on October 13, 2023, 05:41:12 AMI came to know about this exchange only after this thread was created. I was also clueless that they existed. I did some research about them and that too only using CMC data. They look legit to me, I haven't heard or read anything wrong about them. I haven't used the exchange and don't plan to as you need to pass KYC.  Possible that they have not been marketing their product unlike CoinDCX has. I remember in the year of COVID, their names were plastered all over the Indian Business news channels and they had their own crypto related segment in the daily telecast. Point to note that I was looking forward to them continuing this program but they have slowed down as far as I remember.At least some traction in the media for crypto should be present, in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitnote",
      "created_time": "October 13, 2023, 09:25:18 AM",
      "body": "Quote from: bitnote on October 12, 2023, 12:06:09 PMI only have one crypto exchange account which is on Wazirx. I will make another account on other exchanges because Wazirx isn’t doing well right now. KoinBX is a new crypto exchange. Can be trusted?I learned a new lesson always answer after researching about the OP,here I am Talking about KoinBX a new exchange but they are launched in 2019 according to linkedin profile of KoinBX",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}