{
  "id": "topic_5425798",
  "title": "mandown",
  "author": "mandown",
  "created_time": "December 05, 2022, 06:58:07 AM",
  "content": "Arkadaşlar hoo exchange bir anda web sitesini kapatıp kepenk indirmişler sanırım web sitesi içeriklerini komple silmişler. içeride birçok yatırımcının malı kalmış Bir rugpull daha.https://coinmarketcap.com/exchanges/hoo/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5425798",
  "comments": [
    {
      "author": "Cacabey_40",
      "created_time": "December 05, 2022, 05:30:47 PM",
      "body": "Borsaların kapanması, hacklenmesi, iflas etmesi moda oldu. 2022 ve 2023 yılı bu furya ile devam edecek gibi görünüyor.Bu tip borsalarda üyelikleri olan var mıdır bilmiyorum ama umarım varlıklarını tutanlar ve böylesi dandik borsalara güvenenler yoktur. Yerel borsalara ihtiyaç duyulduğunda işlem yapar yapmaz hemen borsaya el sallamak en doğru karardır.Onlarca borsada hesabım var. Bu borsayada üyeliğim vardı diye hatırlıyorum. Son yaşanan kötü olaylardan dolayı borsalarda bir kuruş bile bırakmadım. Hepsini cüzdanlara çektim. Uzak doğu borsalarına güvenim sıfır denecek kadar az. Dragonex borsasının direkt kepenk indirme olayı da buna benziyor. Yüz binlerce insanı mağdur ettiler. Bu olay ilk değildi ve son da olmayacak. 2017 boğasında kara hesapların döndüğü ve vurgunculuğun en büyük yaşandığı bitgrail borsa da en iyi ibret alınacak olaydır. Halen davası devam ediyor. Keza Luna ve FTX olayı kriptoya olan güveni baltaladı. 2023 sanırım kriptolarda çözülme yılı olacak. Yaşanan olumsuz gelişmeler, kripto ekosisteminin kontrolsüz bir şekilde büyümesi ve dolandırıcılık konularının tavan yapması doğal seleksiyonu gerekli kılıyor. İşe yaramaz ve vurgun üzerine kurulan ve güven vermeyen projelerin (altcoinlerin) ve borsaların elimine olacağını düşünüyorum. Böyle bir temizlik kriptoya can suyu verecektir. Umarım öyle olur. Bir müddet borsalarda para tutmama kararım bu yüzden...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "December 05, 2022, 09:56:54 PM",
      "body": "Haklarında yüzlerce ödeme problemi geri bildirimi olan borsaya güvenerek kullanmaya devam eden insanlar dolandırılmayı kendi ayaklarına çağırmış demektir. Hoo olayı FTX olayından sonuç itibariyle farklı olmasa da gelişimsel açıdan oldukça farklı. FTX son anlarına kadar herkes tarafından güvenilir zannedilirken oldukça düzgün bir profil çizmişti. Hoo ise her zaman sıkıntılı bir borsaydı. Bu nedenle hiç bir zaman geniş bir kitleye ulaşmadı. Sadece çok acemi kullanıcıların yatırımlarını kaybettiğini düşünüyorum. Ekosistemi biraz bilen hiç kimse Hoo borsasında elinde bedavadan geçen ve başka satış seçeneği olmayan shitcoinleri satmak dışında bu tip borsalara bulaşmaz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "December 06, 2022, 08:13:06 AM",
      "body": "Ben Hoo borsasını duymadım bile. Türkiye’deki borsaları bilinmedik buluyordum böyle bir borsa olduğunu battığı haberleri alınca öğrendim. Hong Kong’da ne kadar başarılı olabilirlerdi ki acaba? Zaten Bthd hocamın söylediğine göre geçmişlerinde de sıklıkla problemler yaşamışlar buna rağmen kullanan varsa dolandırılmayı göze alarak kullanmıştır zaten.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "December 06, 2022, 08:16:30 AM",
      "body": "Quote from: Phoenix Anka on December 06, 2022, 08:13:06 AMBen Hoo borsasını duymadım bile. Türkiye’deki borsaları bilinmedik buluyordum böyle bir borsa olduğunu battığı haberleri alınca öğrendim. Hong Kong’da ne kadar başarılı olabilirlerdi ki acaba? Zaten Bthd hocamın söylediğine göre geçmişlerinde de sıklıkla problemler yaşamışlar buna rağmen kullanan varsa dolandırılmayı göze alarak kullanmıştır zaten.Bunu gibi nice borsalar kullandım shitleri satabilmek için. Her borsa shit listelemiyor doğal olarak satacak birkaç kaynak oluyor onları değerlendiriyoruz. Yakında çok daha fazlası gelir gibi duruyor. Borsalardan sadece okex ve binance de birşeyler kaldı onlarıda yavaş yavaş çekicem.Zamanında crpto bilmemne diye bir borsada birdünya mal kalmıştı. İster istemez arada bizde patlıyoruz",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bobita",
      "created_time": "December 09, 2022, 09:46:16 PM",
      "body": "İşin acı tarafı şu, bu gümleyenlerin çoğunluğu zaten bir gün yaşanacağını biliyorlardı, temel prensip belli, \"gittiği yere kadar ticari kazanç, patladığı noktada çalabildiğin kadar çal\".Şimdilerde masum, mağdur saftirik ayaklarına yatan o tokatçı şerefsiz kıvırcığın yediği haltların belki tek olumlu etkisi bir kısım çürük elmanın sepetten çok zarar veremeden atılması olacak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}