{
  "id": "topic_5476817",
  "title": "DrBeer",
  "author": "DrBeer",
  "created_time": "December 06, 2023, 08:25:39 PM",
  "content": "Just some news from a little over a week ago: - An \"undiagnosed respiratory disease\" that causes pneumonia in children is spreading widely in China. Large queues are gathering at hospitals across the country, The Telegraph wrote on Thursday, November 23.https://www.telegraph.co.uk/global-health/science-and-disease/china-disease-latest-who-covid-infection-children/ - The World Health Organization has requested all available information from China about pockets of pneumonia of unknown origin that has reportedly started spreading among children in the north of the country.According to Chinese non-state media, pediatric hospitals in some parts of the country are overflowing with sick children.Chinese authorities attribute the spike in flu cases this season to the lifting of anti-vaccine measures.WHO urges Chinese residents to take measures to reduce the risk of spreading the infection.- The Chinese social network Weibo publishes videos of long queues at hospitals in Xi'an, Beijing and other major cities. Medics are warning parents to expect treatment for up to 13 hours, and about 700 people may be waiting to see a doctor.Two issues:1. The world economy and population has not yet everywhere moved away from the covid and events of 2022, and ... a new global pandemic awaits us ?  Your opinion - what and how to prepare for ? 2. Can anyone from China confirm or deny this news ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476817",
  "comments": [
    {
      "author": "dothebeats",
      "created_time": "December 06, 2023, 10:46:22 PM",
      "body": "Seems like fear-mongering to me. COVID has been swept under the rag for a year now and people have seem to move on from this issue. I guess, this will be sensationalized once the authenticity of this reports get validated. People will then move to panicking phase and might even cause a lot of panic to other people. That will start a domino effect that will soon translate to the economy, or worse, another set of lockdowns.Hopefully though it isn't real. I'll never want to be locked inside of my house ever again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "December 06, 2023, 11:12:38 PM",
      "body": "here we go again, why does it have to come from China for all kinds of deadly diseases, hopefully it doesn't become a new pandemic because it's really miserable being at home without the opportunity to work to earn money, I'm becoming increasingly suspicious that the diseases that have the potential to be caused by this pandemic will continue to be released in once every 4 or 5 years, we as citizens will of course continue to lose, we are injected with fluids that we don't know whether they are good for our bodies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "December 07, 2023, 12:00:16 AM",
      "body": "Quote from: DrBeer on December 06, 2023, 08:25:39 PM1. The world economy and population has not yet everywhere moved away from the covid and events of 2022, and ... a new global pandemic awaits us ?  Your opinion - what and how to prepare for ? Another new pandemic will be very terrible, It will not only affect  how can we prepare for it? Number one is to stay healthy because from observation of the last pandemic, the people who were healthy had an advantage over others who were more susceptible with respiratory diseases and others. If it is possible for you, you can start planning for a secluded settlement away from people and then buy and keep safe food items, health items, and some other survival supplies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "milewilda",
      "created_time": "December 07, 2023, 01:22:28 AM",
      "body": "Quote from: DrBeer on December 06, 2023, 08:25:39 PMTwo issues:1. The world economy and population has not yet everywhere moved away from the covid and events of 2022, and ... a new global pandemic awaits us ?  Your opinion - what and how to prepare for ? 2. Can anyone from China confirm or deny this news ? 1. Looking back again on that pandemic, it was truly devasting and now we are possibly be able to get another one? How to get prepared?Health protocol would be surely be strictly be followed just like on what happened on that Covid pandemic in the past. We dont know if this currentpneumonic illness would be more severe or would be lesser but lets hope that it would really be just mild.2. Im not really that shocked whenever we do have something new illness or whatever sickness do really comes from China. It isnt some sort of criticizing but it seemsthey do really love on spreading disease which it could possibly came from on what they do eat or what.For now there's no confirmation whether this one would really be that becoming again to be a pandemic(hopefully not). We've been recovering into that previous covid situation even up to now, if it turns out that there would be another one then we should really be needing to be prepared.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "December 07, 2023, 01:56:22 AM",
      "body": "I am not surprised about the news of Covid 19 still making a bearing in the society despite the fact that vaccines has been effected to combat its spread.China is one of the host countries to have occasioned its spread among other viruses of such and it's just so sad that it has now adapter itself to affect kids without as much body immunity against it. The economy is changing on a steady basis as reported by various news outlets and as such I wouldn't be surprised the amount of nations, including mine, willing to join the BRICS countries to adopt a currency devoid of dollar manipulation or inflation in the nearest future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "December 07, 2023, 04:05:29 AM",
      "body": "Quote from: DrBeer on December 06, 2023, 08:25:39 PM The world economy and population has not yet everywhere moved away from the covid and events of 2022, and ... a new global pandemic awaits us ?  Your opinion - what and how to prepare for ? Although I don't have accurate information about this new epidemic, I think the media is exaggerating this issue. Maybe we're past the fear of what's happened, and now a certain sign can make everyone confused, but honestly I feel like what we just went through gives us hope and enough experience to cope with challenges. But anyway, I am waiting for clear information on this issue, but I think maybe things are calming down now. Since the news started to spread until now, it seems like everything is under control, and there is not much relevant information about the severity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "December 07, 2023, 04:49:50 AM",
      "body": "Let us hope that this is not the case and that it does not end up becoming a new COVID, a new epidemic that affects the whole world and we go back to the restrictions and all the measures that were in place. Quote from: DrBeer on December 06, 2023, 08:25:39 PM - An \"undiagnosed respiratory disease\" that causes pneumonia in children is spreading widely in China....According to Chinese non-state media, pediatric hospitals in some parts of the country are overflowing with sick children.Chinese authorities attribute the spike in flu cases this season to the lifting of anti-vaccine measures.Hopefully, if this is the cause, normal vaccination will be resumed and cases will be reduced.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YUriy1991",
      "created_time": "December 07, 2023, 05:36:17 AM",
      "body": "Quote from: bluebit25 on December 07, 2023, 04:05:29 AMQuote from: DrBeer on December 06, 2023, 08:25:39 PM The world economy and population has not yet everywhere moved away from the covid and events of 2022, and ... a new global pandemic awaits us ?  Your opinion - what and how to prepare for ? Although I don't have accurate information about this new epidemic, I think the media is exaggerating this issue. Maybe we're past the fear of what's happened, and now a certain sign can make everyone confused, but honestly I feel like what we just went through gives us hope and enough experience to cope with challenges. But anyway, I am waiting for clear information on this issue, but I think maybe things are calming down now. Since the news started to spread until now, it seems like everything is under control, and there is not much relevant information about the severity.Mitigation against future threats must exist and be prepared early because whatever it is, it requires preparation. However, I think the possibility of another new pandemic as big as COVID-19 is still uncertain and transparency is the key.The issue that is before our eyes is a food crisis that must be prepared for so that people do not experience hunger and are vulnerable to attacks from various diseases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "December 07, 2023, 07:08:33 AM",
      "body": "Quote from: dothebeats on December 06, 2023, 10:46:22 PMSeems like fear-mongering to me. COVID has been swept under the rag for a year now and people have seem to move on from this issue. I guess, this will be sensationalized once the authenticity of this reports get validated. People will then move to panicking phase and might even cause a lot of panic to other people. That will start a domino effect that will soon translate to the economy, or worse, another set of lockdowns.Hopefully though it isn't real. I'll never want to be locked inside of my house ever again.The problem is that Covid has been hushed up for a long time, pretending that \"it's no big deal\" and the world didn't prepare for a pandemic. We know the results, they are very sad.... At that time, the main affected audience (the highest mortality rate) was the elderly. Here, in the current situation, I was very confused that now the audience is children, and China again pretends that it is not a problem, does not involve anyone in its solution, already having the past negative experience. I do not want to repeat what happened in the world under Covid.....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "December 07, 2023, 08:01:55 AM",
      "body": "The world hasn't fully recovered yet and we've got some of this news? Not to blame China but isn't this season should really be where everyone needs to take precautionary measures as diseases can easily fly on the air and contain, many air-borne diseases are there.But if it gets worse and it's making people fall in line in hospitals, we still need to know if those hospitals have got enough staff and doctors as that could be a factor of the line.Anyway, whether this is true or not. I'm able to read some news that this December season should make everyone take more care to themselves and be healthier because viruses these days are stronger than the past ones. I'll get it straight that the world can no longer afford to have another pandemic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "December 07, 2023, 08:47:34 AM",
      "body": "Quote from: dothebeats on December 06, 2023, 10:46:22 PMSeems like fear-mongering to me. The same to me, I remember the old news that we've got these \"new strains\" of the COVID-19 virus that have given me more anxiety if this is going to stop or will continue. And that's why all of those time, I'm afraid to get out because I don't think that I'll ever be safe when I go to public but then, everything seems to calm down and back to normal again and even with such news about these new strains, everyone seems to not care at all anymore.Quote from: dothebeats on December 06, 2023, 10:46:22 PM COVID has been swept under the rag for a year now and people have seem to move on from this issue. I guess, this will be sensationalized once the authenticity of this reports get validated. People will then move to panicking phase and might even cause a lot of panic to other people. That will start a domino effect that will soon translate to the economy, or worse, another set of lockdowns.Hopefully though it isn't real. I'll never want to be locked inside of my house ever again.That's true, whenever there's another report from the WHO that will be made public, then all of the government units are going to be wary and alert again. What's just sad is that there have been politicians that takes advantage of these situations, even if they're doing what's good for the health awareness but in terms of budget releases, of course what's on my mind can also be thought of those that have been looking into these politicians and monitors what they do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "December 07, 2023, 08:51:20 AM",
      "body": "Quote from: DrBeer on December 06, 2023, 08:25:39 PM1. The world economy and population has not yet everywhere moved away from the covid and events of 2022, and ... a new global pandemic awaits us ?  Your opinion - what and how to prepare for ? 2. Can anyone from China confirm or deny this news ? After the rapid disappearance of covid-19 pandemic and the economic and social problems witnessed by the quarantine, I find it difficult for countries to take the same measures of lockdown and working from home, especially since I know some friends who believe in the conspiracy theory and that they did not receive vaccines and yet were not infected with the pandemic. It will be convincing these people will be more difficult.News coming from China needs to be reviewed by independent sources because some media outlets either try to downplay its importance or there is a false exaggeration of the statement that China is a failed state.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "December 07, 2023, 09:13:58 AM",
      "body": "Quote from: passwordnow on December 07, 2023, 08:47:34 AM-snip-That's true, whenever there's another report from the WHO that will be made public, then all of the government units are going to be wary and alert again. What's just sad is that there have been politicians that takes advantage of these situations, even if they're doing what's good for the health awareness but in terms of budget releases, of course what's on my mind can also be thought of those that have been looking into these politicians and monitors what they do.They will take the opportunity to start harvesting money back with various kinds of drug purchase recommendations or something. And the most predictable thing is that supporting tools for preventing covid such as hand sanitizers and masks will start to soar again in price, this will be a very profitable business for them. But, even if the WHO makes announcements of new variants or something like that, people will respond to it like the Common Flu and not like in the early days of the pandemic.I don't think much about that either, I've also had 3 covid vaccinations and when I have to get vaccinated again see how the world reacts to it.It's like a game that starts again, but the participants don't want to play anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "December 07, 2023, 09:55:43 AM",
      "body": "It's not surprising China always become the first country that found a new virus or disease since they're willing to eat disgusting foods.Although the whole economy already recovered and there are a lot flows in investment, but it's not yet stable and the number of total unemployment is still high. If there's a new virus or new Covid wave, it will be a chaos since the world isn't ready yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AicecreaME",
      "created_time": "December 07, 2023, 11:59:12 AM",
      "body": "Nope, this is just another diversion for sure to cover up something or to alter the public's attention to this kind of made up story. After COVID-19, there's a lot of stories about new spreading diseases that might be another pandemic but didn't last long enough in the news or in social media. Though, prevention is better than cure, it's much better to be safe than sorry. However, when conflicts are happening around the world, maybe this is just indeed to alter public's attention for them not to panic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "December 07, 2023, 12:52:10 PM",
      "body": "I would not believe anything coming out from China through the recognised media channels. What you see, might be very different than the reality. So if you are seeing long use in front of pediatric hospitals, the actual situation might be 10 times more worse. You never know if the World awaits another epidemic. But the economy is still recovering. So if the world goes into another phase of lockdown, then it might take way longer to recover from another low point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DabsPoorVersion",
      "created_time": "December 07, 2023, 01:16:27 PM",
      "body": "Quote from: AicecreaME on December 07, 2023, 11:59:12 AMNope, this is just another diversion for sure to cover up something or to alter the public's attention to this kind of made up story. After COVID-19, there's a lot of stories about new spreading diseases that might be another pandemic but didn't last long enough in the news or in social media. Though, prevention is better than cure, it's much better to be safe than sorry. However, when conflicts are happening around the world, maybe this is just indeed to alter public's attention for them not to panic. We don't know if this is one of their schemes to alter the public's attention to hide something, but this seems to be alerting. There's a photograph of kids in a hospital trying to cure themselves. This news might be a made-up story, or what they are up to. But everyone must be careful so what happened in the previous pandemic will not happen again. The pandemic affected the whole world, and we are still in the process of recovering. We should stay alert at all times in case there are some cases like this, and we should act fast by following the guidelines from the government.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Juse14",
      "created_time": "December 07, 2023, 01:32:03 PM",
      "body": "There have been rumors everywhere, both on social media and in the mass media, saying that there will be a re-emergence of an outbreak and potentially the next pandemic. At first I was a little skeptical, but after I found out that there were some scientists who backed up the argument, I became a little worried that the world was in danger. And to be honest, the impact of the covid-19 outbreak is still unfinished and still lingering today. Where the economy has not yet stabilized and trade is still hampered. And if the next outbreak of the disease is worse than yesterday, then the economy and trade will never fully recover.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "December 07, 2023, 02:37:56 PM",
      "body": "Hopefully, there will be no new global pandemic that will attack us like the Covid pandemic. It will attack many countries once again and I am not sure that any of them will be able to survive because there are still many countries that have not been able to recover their economies. That would be a heavy blow to those countries.We can only strengthen our body's immune system by taking supplements that can help maintain the body's resistance to attacks by various viruses. After the Covid pandemic ends, we are advised to always live healthily by consuming healthy food. Of course, if a pandemic attacks globally, pharmaceutical companies will get maximum profits like last Covid.We'll see what happens next. We can only hope that the news is not true and only scares people. But whatever it is, we must maintain our stamina and endurance. That's all we can do to be prepared for any virus attack.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}