{
  "id": "topic_5397980",
  "title": "YellowSwap",
  "author": "YellowSwap",
  "created_time": "May 10, 2022, 06:36:33 AM",
  "content": "Bitcoin respected its last strong resistance of 29,000$ now its recovered back to 31,000$ and it looks like its not done yet, pro traders out there where do you think this is heading? Is the free fall over or this level won't hold for long either?.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5397980",
  "comments": [
    {
      "author": "Bttzed03",
      "created_time": "May 10, 2022, 07:06:11 AM",
      "body": "Quote from: YellowSwap on May 10, 2022, 06:36:33 AMBitcoin respected its last strong resistance of 29,000$ now its recovered back to 31,000$ and it looks like its not done yet, pro traders out there where do you think this is heading? Is the free fall over or this level won't hold for long either?.*strong support of $29K*As usual, there are mixed predictions on bitcoin. Some charts I've seen predicts BTC bouncing back to $36K before dropping to the 2022 bottom at $22K (falling wedge). There are no exact months before that pattern is completed but 2023 will probably be the next recovery phase until the next bullrun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shinratensei_",
      "created_time": "May 10, 2022, 07:15:34 AM",
      "body": "Quote from: YellowSwap on May 10, 2022, 06:36:33 AMBitcoin respected its last strong resistance of 29,000$ now its recovered back to 31,000$ and it looks like its not done yet, pro traders out there where do you think this is heading? Probably a recovery or yeah another bulltrap was coming again. I remember when bitcoin is only recovering a little bit but it was dumping so hard again. Im sure that bearish trend will come again soon. This recovery was just temporary. If there will be another massive sell again and we are in another disaster. Quote from: YellowSwap on May 10, 2022, 06:36:33 AMIs the free fall over or this level won't hold for long either?.It's not over yet. This may recover slowly but i doubt that if that has become the bottom for this dump. People are still in the extreme fear. Terra luna was making it even worst",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nivia1st",
      "created_time": "May 10, 2022, 07:22:57 AM",
      "body": "Quote from: YellowSwap on May 10, 2022, 06:36:33 AMBitcoin respected its last strong resistance of 29,000$ now its recovered back to 31,000$ and it looks like its not done yet, pro traders out there where do you think this is heading? Is the free fall over or this level won't hold for long either?.looking at last year's situation, bitcoin should have fallen to 28k before the pump. so there is still one more resistance point, and the bearish trend is still very strong. most likely there will be a repeat like last year. and if this resistance point is broken, the market situation may be worse than last year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aprilnot",
      "created_time": "May 10, 2022, 07:28:01 AM",
      "body": "Quote from: YellowSwap on May 10, 2022, 06:36:33 AM Is the free fall over or this level won't hold for long either?.all the analyzes I made concluded that the bear trend is still not over. I see not only the crypto market, but gold, forex, and stocks are also experiencing a decline. this is what made me think that bitcoin could get worse. as long as the global economic situation has not improved, it will be very difficult for the entire market to recover.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wildan88",
      "created_time": "May 10, 2022, 07:33:27 AM",
      "body": "I am not pro but I am here to speculate only but if I am going to ask I think there will be another retest to the last support that you said. I didn't managed to watch the prices these previous months and didn't convert my Bitcoins to USD so I think I am really down at the moment and I have no plans in selling at this point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "royalfestus",
      "created_time": "May 10, 2022, 07:38:21 AMLast edit: May 10, 2022, 07:56:38 AM by royalfestus",
      "body": "Quote from: Nivia1st on May 10, 2022, 07:22:57 AMlooking at last year's situation, bitcoin should have fallen to 28k before the pump. so there is still one more resistance point, and the bearish trend is still very strong. most likely there will be a repeat like last year. and if this resistance point is broken, the market situation may be worse than last year.We are still early in the bear market and traders are still active. Many bitcoin and altcoins on exchanges which show a long bear but it does not mean there might not be difference in previous.  Out of the 10 stages of bear market we till in anxiety",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ItsNotSean",
      "created_time": "May 10, 2022, 07:42:30 AM",
      "body": "Unless the Fed suddenly reverses the upcoming rate hikes it just announced last week, or some unimagined bailout is revealed (e.g., $3,000 stimulus checks), the global economy is dead.BTC will fall below $10K, and the stock markets will drop another 50% from where we are now. The amount of leveraged long bets in this system is literally beyond calculation, and those liquidations will amplify the depth of this market crash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TopT3ns",
      "created_time": "May 10, 2022, 08:02:30 AM",
      "body": "Quote from: YellowSwap on May 10, 2022, 06:36:33 AMBitcoin respected its last strong resistance of 29,000$ now its recovered back to 31,000$ and it looks like its not done yet, pro traders out there where do you think this is heading? Is the free fall over or this level won't hold for long either?.I think the current bitcoin price movement will remain stable at a price between $30,000 - $35,000 because of the down trend and bad news often circulates that can make bitcoin price movements weaker and do not have the strength to make more price increases, hopefully there will be good news could trigger a return to rising bitcoin prices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "May 10, 2022, 08:46:11 AM",
      "body": "Quote from: YellowSwap on May 10, 2022, 06:36:33 AMBitcoin respected its last strong resistance of 29,000$ now its recovered back to 31,000$ and it looks like its not done yet, pro traders out there where do you think this is heading? Is the free fall over or this level won't hold for long either?.Probably it will hang around 31K - 33K if the market stables and now there is nothing about the free fall or huge rise but there are chances for price to drop further if influencers made the people to click the panic button.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reid",
      "created_time": "May 10, 2022, 08:46:41 AM",
      "body": "This may be it. I am not 100 percent sure but this is too bad there should be nothing left to be dumped. Honestly, I didn't expect it but thankfully I got a hold of myself to buy at $35k. I was there, near purchasing it until it went down at the last minute. I am half glad and half worried about what is happening but at an optimistic view this is a big opportunity. I won't let this one pass anymore to avoid regretting it later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zackgeno96",
      "created_time": "May 10, 2022, 08:51:24 AM",
      "body": "I was really surprised that most of the coins crash more than 10% and I really panicked but I remember that this happen almost more than 100x already and I know that it will recover soon and will just need some time to recover, it's just a cycle after all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ANSEL_2.0",
      "created_time": "May 10, 2022, 09:00:38 AM",
      "body": "There has never been where BTC just perform a massive fall continuously without any fake recovery events, my own advice is never to trust any recoveries at this point in time, the only way in coming weeks is bear market, strong support or not I doubt it will hold for long, the path in the front is downward.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fzkto",
      "created_time": "May 10, 2022, 09:01:54 AM",
      "body": "Yesterday bitcoin took a big fall, there was panic and a sell-off in the market, with many altcoins reaching a new low compared to 2021. I think there should be a correction or a bounce in the market in the near future and then it is likely to continue to fall. I would not expect cryptocurrency to rise this year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Innerpumper",
      "created_time": "May 10, 2022, 09:07:25 AM",
      "body": "I'm sure support at $29k isn't strong yet, but seeing cryptocurrencies develop so well this year puts me at 50:50 they will at least be able to last a few days at $31k before dropping further, or we'll enter a fake bear pass, nothing know. Many people get bear market info confirmed, but cryptocurrencies always surprise everyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GEMIN_M4",
      "created_time": "May 10, 2022, 09:23:53 AM",
      "body": "Something is wrong with UST from Luna, I guess this is also a part why BTC is falling, I heard that the CEO used BTC as back up fund for UST stable coin when its supposed to be backed by Dollar, now he has no choice but to dump the whole BTC to avoid the massive correction that's currently going on but in this process this move will hurt Luna and UST as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FairUser",
      "created_time": "May 10, 2022, 09:24:09 AM",
      "body": "Quote from: YellowSwap on May 10, 2022, 06:36:33 AMBitcoin respected its last strong resistance of 29,000$ now its recovered back to 31,000$ and it looks like its not done yet, pro traders out there where do you think this is heading? Is the free fall over or this level won't hold for long either?.If you can buy and hold it for the long term, don't worry too much about current or past developments, because we all see opportunities in the future for you to be happy with I see the problem people see when it comes to using technical analysis to apply it, but overdoing it and not being able to keep up with the short-term changes. Honestly, even though BTC is falling right now, I still see opportunities for losers to find a little something to keep from getting too deep into debt, I'm pretty optimistic after many years in this market. The price is just deceiving how you think to invest. Let's look at the facts 1BTC = 1BTC, don't just see successes with prices via fiat or life tools.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nimogsm",
      "created_time": "May 10, 2022, 10:02:03 AM",
      "body": "The forecast, as we know, is not a noble thing, and even more so now.But I think the fall will not continue for a long time in general, there is no strong panic and users of exchanges do not sell their assets for distillation.If it falls even lower, there will be a great chance to buy cheaper.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "May 10, 2022, 10:05:33 AM",
      "body": "Quote from: YellowSwap on May 10, 2022, 06:36:33 AMBitcoin respected its last strong resistance of 29,000$ now its recovered back to 31,000$ and it looks like its not done yet, pro traders out there where do you think this is heading? Is the free fall over or this level won't hold for long either?.I'm not a pro trader, but I would say that the down ward trend is not yet over because of:1. there is still the looming war behind2. the market is in the bear market3. the FED rate hike will have it's effectSo I guess everyone should be very careful of  their trading strategy. Or if you are here for the long term, better buy cheap bitcoin or any other altcoin and hold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "makishart",
      "created_time": "May 10, 2022, 10:27:55 AM",
      "body": "It's not over. The possible scenario is when bitcoin will be going to the another deep other than the current rate. No one know the accurate prediction about that but i do believe when you are seeing the market and then it seem the chart is not so bullish to be able to rebound right now. The next move must be bounce but when this is not happening next days and i believe we will see another dip to come. The more pressure will happen and the price of bitcoin can't defend 30k rate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}