{
  "id": "topic_5470663",
  "title": "joeperry",
  "author": "joeperry",
  "created_time": "October 17, 2023, 10:26:34 AM",
  "content": "Hi guys, Utopia P2P and I are inviting you to join the first round of the Utopia P2P - Local Android Review Campaign, which can be found here: https://bitcointalk.org/index.php?topic=5470661. If the results are good then we would have another round but participants can only join the campaign once and cannot join in other rounds.Please let me know if I posted the bounty to the right section and I would appreciate if you can share it to your fellow Indian friends or colleagues. You can easily sell the CRP reward to BTC or USDT in crp.is/ if you have questions or concern please leave it here or reach me directly via PM or via Telegram @jperryc",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470663",
  "comments": [
    {
      "author": "pawanjain",
      "created_time": "October 18, 2023, 03:07:44 PM",
      "body": "Hi @joeperry I think you have posted the thread in the right section. When did Utopia launch the Android app ?I wonder how how Utopia is available on playstore since it is a P2P platform. Is google allowing P2P apps ?I have reviewed the desktop app earlier in the review campaign and will try out the Android app over the weekend.You know what, I tried mining CRP on cloud as mentioned in the official website and forgot to turn off the cloud instance at the end of month.Later, I started getting notifications about getting billed for $38",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "October 19, 2023, 12:16:20 PM",
      "body": "Quote from: pawanjain on October 18, 2023, 03:07:44 PMWhen did Utopia launch the Android app ? I wonder how how Utopia is available on playstore since it is a P2P platform. Is google allowing P2P apps ?Why should Google have trouble with p2p apps? Where did you hear it does not allow them? Regarding launch date I'm quite dumbfounded cause you could see it on play store itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "October 19, 2023, 03:03:02 PM",
      "body": "Quote from: libert19 on October 19, 2023, 12:16:20 PMQuote from: pawanjain on October 18, 2023, 03:07:44 PMWhen did Utopia launch the Android app ? I wonder how how Utopia is available on playstore since it is a P2P platform. Is google allowing P2P apps ?Why should Google have trouble with p2p apps? Where did you hear it does not allow them? Regarding launch date I'm quite dumbfounded cause you could see it on play store itself. I didn't hear it anywhere @libert19 I was just guessing it but it's my fault. I remember installing Tor browser on my phone as well so I should have figured it out.I did know about finding app details but never looked at the release date   Thanks for letting me know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pravarasenaraj26",
      "created_time": "October 27, 2023, 06:44:11 AM",
      "body": "Quote from: joeperry on October 17, 2023, 10:26:34 AMHi guys, Utopia P2P and I are inviting you to join the first round of the Utopia P2P - Local Android Review Campaign, which can be found here: https://bitcointalk.org/index.php?topic=5470661. If the results are good then we would have another round but participants can only join the campaign once and cannot join in other rounds.Please let me know if I posted the bounty to the right section and I would appreciate if you can share it to your fellow Indian friends or colleagues. You can easily sell the CRP reward to BTC or USDT in crp.is/ if you have questions or concern please it here or reach me directly via PM or via Telegram @jperrycWhy paying rewards took so long?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}