{
  "id": "topic_5502446",
  "title": "flatfly",
  "author": "flatfly",
  "created_time": "July 09, 2024, 07:02:39 AM",
  "content": "Just wondering, does this make any sense at all? https://twitter.com/Justin_Bons/status/1810357305390616839Quote1/38) BTC's security model is brokenIt has to double in price every 4 years for a century or sustain extremely high fees!Just to maintain the present level of security...Which is impossible, as it would exceed global GDP within decadesTherefore, BTC security is doomed!2/38) Each halvening exponentially lowers the security budget; until it is gone!These halvenings continue after exceeding global GDP for atleast 70 years before running out completelyIf you understand exponentials & economics, you should know that this is entirely impossible!3/38) Fees will also never reach sustained extremes due to the ratcheting effect of the fee marketPaying hundreds of dollars for a single TX is not realistic in a competitive free marketWhen fees spike, users leave, all due to the unnecessary addition of the block size limit!4/38) This all means that BTC's long-term security is unsustainable without extremely high TX fees in the future!The security of BTC will inevitably continue to decrease until it becomes profitable to attackI predict this will happen in 4-12 years from now! (1-3 halvenings)5/38) Hashrate does not equal security; bitcoiners like @saylor do not understand PoWThis chart of miner revenue proves that BTC's security is actually lower now than it was 3 years ago!... (full thread on X)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5502446",
  "comments": [
    {
      "author": "franky1",
      "created_time": "July 09, 2024, 08:48:31 AMLast edit: July 09, 2024, 09:08:11 AM by franky1",
      "body": "wrongbitcoins market cap is not a reserve of fiat...calculating a fiat amount against the market cap is false and badcomparing market cap to GDP is a false assumption and false narrative to followagain the market cap is a meaningless number and not based on real fiat reserves or funds available. concentrate on the per coin cost of the real market. not some math multiplying stat(cap) that has no linkage to any real fiat changing handsdo not try to assume a market cap has any relevance to the block rewarddont try to associate market cap with a GDP when the actual economics is based on PER BTC PRICE of the rewards/mining incomethe mining income/rewards are not based on a 21m total. so the amount of income a mining pool gets is not as massive as OP suggestsbased on lets say a market spot this cycle of between $70k and $140k(2x of recent ATH)the amount of coins mined this cycle would come out as $42b-$92b.. no where close to the 21m market capno where close to any GDP globally or of any meaningful large countryalso for a pool to attack the network they need to have 50% of hashrate to mess around with re-organising blocks to double spendso when the network is operating at over $40billion of hardware costs and electric. it can safely operate at those levelsyep it can level off far before reaching trillions of market cap, far before the per btc price of the rewards reaches billionshashrate does not need to 2x or increase continually. infact if hashrate went too high against the mining rewards. miners would drop out as the sats per hashrate (due to competition) would result in not getting very many sats per block if there were too many miners on one pool/working on each blockthe network does not need to get to $1-$100trillion worth of hardware/electric to operate in 100 yearsheres the real economics to think aboutif a block only has 3.125 reward ($437k per block at $140k) AND the blocks transactions are only $10-$10m transfered in a transaction then if someone wants to undo their transaction they wont be spending $20billion(50% of $42bill current level) on hardware to undo a $10m transactionas they wont break even by getting $437k reward and $10m tx set to them.. it would require them to double spend and re-org thousands of blocks to break even. by which time other pools and methods can fight against a malicious mining pool that tries for that length of time..many mining pools know being malicious might seem effective short term but would get undone/punished later and so they dont act maliciously even if they had the 50%+ hashpower to do so.mining maliciously might be highly UNECONOMICAL short term but effective.. but ineffective longterm thus still also uneconomical long termthus not really worth doing.when the network reaches a point of security that no individual can afford to be malicious there is no need to continue to increase security.so again there is no need to get hashrate costs to be trillions. when blocks only handle transfers of millions/billions per tx/block and only handle thousands-millions per reward",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HeRetiK",
      "created_time": "July 09, 2024, 08:49:31 AM",
      "body": "That guy says very little with many words.1&2) Implies that the money spent on Bitcoin mining needs to remain the same or grow to uphold security, which is a false oversimplification. The only thing required is an equilibrium of incentives which will remain the same regardless of Bitcoin's security budget, as long as Bitcoin remains the largest cryptocurrency using SHA256 for its PoW.3&4) Hold a kernel of truth, in that the future of fee economics is still uncharted territory. Consolidating transaction fees by means of second layer solutions such as LN seem to be part of the solution, though so far adoption has been rather whelming. I have strong doubts though that Bitcoin will become profitable to attack via mining within our lifetime.5) The same argument as 1&2) just dressed with a nice graph to look prettier.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odolvlobo",
      "created_time": "July 09, 2024, 08:19:05 PM",
      "body": "Quote from: flatfly on July 09, 2024, 07:02:39 AMJust wondering, does this make any sense at all? Without reading the whole thing, it appears that his arguments all boil down to this:QuoteIt has to double in price every 4 years for a century or sustain extremely high fees!Just to maintain the present level of security...1. \"extremely high fees\". The cost of the fees depend on the economic value of the transactions. Block space is limited, so only the most economically valuable transactions will be included. The fees paid for those transactions will be reasonable because transactions requiring unreasonable fees will not use Bitcoin. In simple terms, if you think the transaction fees are too high for what you want to do, then Bitcoin is not for you. None of this means that Bitcoin will fail. It will just fail for you.2. \"maintain the present level of security\". It is assumed that the present level of security is the minimum necessary level of security. That may or may not be true. I have yet to see someone determine the minimum necessary security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "July 09, 2024, 08:33:12 PM",
      "body": "QuoteIt has to double in price every 4 years for a century or sustain extremely high fees!Just to maintain the present level of security...Yes! Fairly Obvious!QuoteWhich is impossible, as it would exceed global GDP within decadesWorld GDP is 100 trillion, so yeah doubling every 4 years would indeed go over in \"decades\"QuoteEach halvening exponentially lowers the security budget; until it is gone!Not exponentially, but is indeed halving wihout a price increase!QuoteThese halvenings continue after exceeding global GDP for atleast 70 years before running out completelyToo bored to do the math!QuoteFees will also never reach sustained extremes due to the ratcheting effect of the fee marketWith current blocks no, with just 10-20 times the block size yes!QuotePaying hundreds of dollars for a single TX is not realistic in a competitive free marketYup!QuoteWhen fees spike, users leave, all due to the unnecessary addition of the block size limit!Flase, if users would leave fees would go down!QuoteThis all means that BTC's long-term security is unsustainable without extremely high TX fees in the future!Nope, you just need more fees!QuoteThe security of BTC will inevitably continue to decrease until it becomes profitable to attackNope, an attack won't be profitable!QuoteHashrate does not equal security; bitcoiners like @saylor do not understand PoWPartially true, hashrate without cost per said hash rate is meaningless! At the same time false, hashrate is a measure of security!QuoteThis chart of miner revenue proves that BTC's security is actually lower now than it was 3 years ago!Without quantifying security to cost in $ for an attack, no idea!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "July 09, 2024, 09:54:57 PM",
      "body": "Quote from: flatfly on July 09, 2024, 07:02:39 AMJust wondering, does this make any sense at all? https://twitter.com/Justin_Bons/status/1810357305390616839Right off the bat I would say that his premise that Bitcoin is secure now is flawed. As we discussed extensively in another thread here, Bitcoin is absolutely vulnerable to a 51% attack and it wouldn't be difficult to a large nation-state player, or possibly even a smaller one. Bitcoin has a systemic security risk, always has, and always will.He is right that thinning margins for miners could very well increase security risks for Bitcoin (\"reducing security\" not a correct way to say it).He's wrong that increasing transaction fees will make any difference in the sustainability of Bitcoin since, at $50 per transaction, the price is already uncompetitive with almost any form of money transfer today. But Bitcoin isn't used as a money transfer mechanism today, it's simply an investment instrument. In other words, if shares of Berkshire Hathaway cost $1000 to transact in, would people stop buying these $400k shares? Of course not. Almost all buyers of \"Bitcoin\" these days do so through broker of some kind that isolates end-users and spreads the transaction cost across thousands of end-user requests.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}