{
  "id": "topic_5468859",
  "title": "ultrloa",
  "author": "ultrloa",
  "created_time": "October 02, 2023, 07:59:52 AM",
  "content": "There's a rumors spreading that Pacquiao vs Mayweather 2 rematch will set to happen on May 2024 https://asianmma.com/manny-pacquiao-rumoured-to-be-rematching-floyd-mayweather-in-2024/Pacquaio is always ready to fight Mayweather is so evasive for past couple of years. Do you think that this match up would really happen?If this deal will be set and there's official contract that this fight would happen on speculated date for sure many boxing fans will get hype for seeing this two legendary will set another big match in boxing history.I want this fight to happen and hope no other elements will stop this or Mayweather will agree to this deal so that we can see if Pacquaio could get a revenge or Mayweather can seal the long time discussion about who is the best boxer between him and Pacquaio.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468859",
  "comments": [
    {
      "author": "cryptomaniac_xxx",
      "created_time": "October 02, 2023, 10:00:25 AM",
      "body": "I'm not sure if the source is reputable or not. And it depends if this is just going to be a exhibition match or boxing match. So really hard to say right now what will be the outcome as both are obviously out of their primes and probably just fighting for the money again? Who knows.And even in their first fight, both are already on the sunset of their career, although Manny continue to fight and won the WBC belt against Thurman but eventually lost it to Ugas and then he call it quits.Of course it will still the hype for their fans, but I'm not sure if they can go and break their PPV records from the first fight.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "October 02, 2023, 11:00:47 AM",
      "body": "Quote from: ultrloa on October 02, 2023, 07:59:52 AMDo you think that this match up would really happen?I have a feeling it won't and the information posted is fake and its only purpose is to garner attention from the fans of Pacquiao and Mayweather. also, it's kind of weird that a rumour like this would go unnoticed by other boxing news platforms. As much as I love to see these two boxers fight again, I won't get my hopes up until someone from either team actually confirms that they are talking about a possible Pacquaio vs. Mayweather rematch. what's interesting though is finding out that Pacquiao has an Illegitimate son who is a boxer and has fought as an undercard that is promoted by Pacquiao, I wonder how far he can go in the boxing industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kasabus",
      "created_time": "October 02, 2023, 11:06:39 AM",
      "body": "Although it's just an exhibition fight, I still find it very interesting to watch.The first fight seemed like a robbery to some, as Mayweather's style dictated the fight, resulting in a rather boring bout. However, here's an interesting fact: Manny hasn't lost twice in his career against a tough defender; he has always won in a rematch. So, let's see if that trend will continue now that he has retired already.If that were to happen, I'm sure the trilogy would be even more interesting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bisdak40",
      "created_time": "October 02, 2023, 11:07:48 AM",
      "body": "Quote from: ultrloa on October 02, 2023, 07:59:52 AMPacquaio is always ready to fight Mayweather is so evasive for past couple of years. Do you think that this match up would really happen?Personally, i don't think that this fight will happen because Mayweather doesn't want to tarnish that zero lose that he had in his career. Though this is only an exhibition game but there will be a lot of pride at stake once the contract will be signed because for Pacman, he want to have his revenge and he want it even in an exhibition match and for Money, he can't afford to lose so that's the reason why this fight will not come into fruition as Mayweather is very beatable by Manny on his current age.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BabyBandit",
      "created_time": "October 02, 2023, 11:50:51 AM",
      "body": "Quote from: bisdak40 on October 02, 2023, 11:07:48 AMQuote from: ultrloa on October 02, 2023, 07:59:52 AMPacquaio is always ready to fight Mayweather is so evasive for past couple of years. Do you think that this match up would really happen?Personally, i don't think that this fight will happen because Mayweather doesn't want to tarnish that zero lose that he had in his career. Though this is only an exhibition game but there will be a lot of pride at stake once the contract will be signed because for Pacman, he want to have his revenge and he want it even in an exhibition match and for Money, he can't afford to lose so that's the reason why this fight will not come into fruition as Mayweather is very beatable by Manny on his current age.I agree. It would be stupid of Mayweather to accept a fight against a semi-active Pacquaio, I think it's to big of a risk to lose that zero.In the same time Mayweather is 46 years old and Pacquaio 45 years soon, so I don't think it would be wise to go a real fight in that age. Better to just let it be, and let people speculate.  But I hope it happen, would be fun to watch. But these exhibition fights is extremely boring and if they accept to fight a exhibition fight I would for sure not watch it! Just waste of money and time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ultrloa",
      "created_time": "October 02, 2023, 12:26:30 PM",
      "body": "Quote from: bisdak40 on October 02, 2023, 11:07:48 AMQuote from: ultrloa on October 02, 2023, 07:59:52 AMPacquaio is always ready to fight Mayweather is so evasive for past couple of years. Do you think that this match up would really happen?Personally, i don't think that this fight will happen because Mayweather doesn't want to tarnish that zero lose that he had in his career. Though this is only an exhibition game but there will be a lot of pride at stake once the contract will be signed because for Pacman, he want to have his revenge and he want it even in an exhibition match and for Money, he can't afford to lose so that's the reason why this fight will not come into fruition as Mayweather is very beatable by Manny on his current age.That's the only problem there since Mayweather is always protecting that zero lose record and Its like he is the one who will have a problem to make this match not to happen. Pacquaio is so prepared and I guess the only one he wait is a contract to make this exhibition fight to happen, but since there are rumors release regarding on this possible match up maybe there's ongoing negotiation happen so maybe its good to watch for more updates between there potential match. Who knows maybe money can work to make this fight to happen and if Mayweather could possibly receive a lot of money on Pacquio's fight maybe this can change his decision.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avp2306",
      "created_time": "October 02, 2023, 12:39:22 PM",
      "body": "Quote from: BabyBandit on October 02, 2023, 11:50:51 AMQuote from: bisdak40 on October 02, 2023, 11:07:48 AMQuote from: ultrloa on October 02, 2023, 07:59:52 AMPacquaio is always ready to fight Mayweather is so evasive for past couple of years. Do you think that this match up would really happen?Personally, i don't think that this fight will happen because Mayweather doesn't want to tarnish that zero lose that he had in his career. Though this is only an exhibition game but there will be a lot of pride at stake once the contract will be signed because for Pacman, he want to have his revenge and he want it even in an exhibition match and for Money, he can't afford to lose so that's the reason why this fight will not come into fruition as Mayweather is very beatable by Manny on his current age.I agree. It would be stupid of Mayweather to accept a fight against a semi-active Pacquaio, I think it's to big of a risk to lose that zero.In the same time Mayweather is 46 years old and Pacquaio 45 years soon, so I don't think it would be wise to go a real fight in that age. Better to just let it be, and let people speculate.  But I hope it happen, would be fun to watch. But these exhibition fights is extremely boring and if they accept to fight a exhibition fight I would for sure not watch it! Just waste of money and time.If record wise well yes its so stupid decision for Mayweather for accepting this fight since he already defeated Pacquaio in a professional fight. There's nothing to prove anymore and its better to protect that zero boxing record since this is hard to achieve by any professional boxers. But since boxing is business maybe he might agree for more bigger share, but most like Mayweather is not for the money now since he's so damn rich and enjoying his life outside boxing now. Maybe their rumored fight will not happen since to many circumstances needed to consider since Mayweather's camp most likely will not agree to make a deal regarding on this match.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "October 02, 2023, 12:50:37 PM",
      "body": "I highly doubt this could happen. If it did, it's just a money-making machine. And of course, Mayweather would not like to stain his record so I bet the contract will add that he will win the fight and Pac-Man will not be hurt badly. It's all just for show and who enjoys that in boxing? I don't. I love Manny Pacquiao without any doubts when he was fighting for his life in the boxing ring but it's different now. I would believe this more if Manny were going to Marquez but that dude is 50 years old now and Manny is just 44 so it won't be a good match. Who will promote this fight will be a big question. They know people might not watch it because it's just an exhibition match so profits will be a problem. Sure, there are still many fans of both sides but imagine how much money will be spent just to for PPV to watch a \"maybe\" scripted fight.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "October 02, 2023, 12:53:09 PM",
      "body": "Even if it's an exhibition match Mayweather will think twice about facing Pacquiao, but Mayweather is a money man, and if the price is right both fighters might go for it, there is no certainty OP provided in the article, it's 50/50 it depends on the promoters who can push this, both fighters are still not retiring on fighting in the ring although its only for exhibition, there's a big possibility that they will agree to fight if both fighters need money, Pacquiao who run and loss on election spend a lot of money so he needs a big fight, Mayweather is spending a lot and he has a lot of people to give salary.We'll see if there's development but right now its all speculation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Viscore",
      "created_time": "October 02, 2023, 01:11:25 PM",
      "body": "Quote from: coin-investor on October 02, 2023, 12:53:09 PMEven if it's an exhibition match Mayweather will think twice about facing Pacquiao, but Mayweather is a money man, and if the price is right both fighters might go for it, there is no certainty OP provided in the article, it's 50/50 it depends on the promoters who can push this, both fighters are still not retiring on fighting in the ring although its only for exhibition, there's a big possibility that they will agree to fight if both fighters need money, Pacquiao who run and loss on election spend a lot of money so he needs a big fight, Mayweather is spending a lot and he has a lot of people to give salary.We'll see if there's development but right now its all speculation.Pacquiao needs to train harder this time, as in their last face-off, it was Mayweather who dominated the fight, resulting in a unanimous decision win for him. While this upcoming fight may be just an exhibition, I'm very certain that the potential revenue generated from it could surpass that of many professional fights today. It's entirely possible that both fighters could make $10 million or more easily.Consider this: the Paul Brothers, who aren't as legitimate boxers as Pacquiao and Mayweather, have generated massive amounts of money in their boxing careers. Given the fanbase and reputation of Pacquiao and Mayweather, it's likely that this exhibition will be a financial success, potentially surpassing than any big professional fights in boxing this year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Westinhome",
      "created_time": "October 02, 2023, 01:37:21 PM",
      "body": "Quote from: coin-investor on October 02, 2023, 12:53:09 PMEven if it's an exhibition match Mayweather will think twice about facing Pacquiao, but Mayweather is a money man, and if the price is right both fighters might go for it, there is no certainty OP provided in the article, it's 50/50 it depends on the promoters who can push this, both fighters are still not retiring on fighting in the ring although its only for exhibition, there's a big possibility that they will agree to fight if both fighters need money, Pacquiao who run and loss on election spend a lot of money so he needs a big fight, Mayweather is spending a lot and he has a lot of people to give salary.We'll see if there's development but right now its all speculation.Both the player already in the way to get retire from the ring,So untill the players need of money.This fight is not the possible one,the promotors may push the fight for the money.If both of them need of money to their future we can expect this match.The sad bad this player was Pacquaio need of big money,because he is almost doesn’t have any money for the survive now.But the Mayweather doesn’t need any money for the survive,but only he want some money for their worker salary.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "October 02, 2023, 01:41:36 PM",
      "body": "Quote from: ultrloa on October 02, 2023, 07:59:52 AMDo you think that this match up would really happen?Even if it will be just an exhibition match, I don't think that Mayweather will agree to the terms even if it's going to be in favor of him.It's just going to put a possible stint to his record and even too many fans all over the world wanting to see this match happens, the chance is very low for it to happen. But let's say that the split will be truly favorable to Mayweather since he's a world champ and has a zero loss record, it's like he's the one to give mercy to this deal if this should happen or not. That means to say, Pacquiao and his camp is like to beg Mayweather to make it happen which doesn't sound good when both of them are in their retirement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "October 02, 2023, 02:11:30 PM",
      "body": "Quote from: ultrloa on October 02, 2023, 07:59:52 AMI want this fight to happen and hope no other elements will stop this or Mayweather will agree to this deal so that we can see if Pacquaio could get a revenge or Mayweather can seal the long time discussion about who is the best boxer between him and Pacquaio.I dunno, They are both past of their prime and I doubt that this match can prove anything or benefit both of them since they are retired. The only advantage this fighter can get on this match is pure money and fans is not that hype anymore on this 2 fight unless they will show some explosive fight which is not expected on Mayweather fighting style.The first fight is actually boring and not live on the hype. I’m more on interested to watch matches between top fighters on their prime compared to this 2. No disrespect to this 2 legend but I don’t like the fighting style of Mayweather even before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "October 02, 2023, 02:13:06 PM",
      "body": "This kind of rumor is easy to believe because it can be true since we all know when those two boxers get inside the ring, they won't just get there to fight, they get there to make some huge money. I think they will somehow make it happen next year since both fighters are still active in exhibition fights. it could be best for them to make it happen since their popularity is still there and people won't gonna accuse it scripted when they fight inside the ring. they need to settle it once more and more likely for me, the result is still the same because Manny is now slower than before and Mayweather needs to do is strengthen his defense which is not really a big problem for him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stadus",
      "created_time": "October 02, 2023, 02:15:52 PM",
      "body": "The biggest exhibition fight in year 2024, if this rumor were to become true.Manny had a slight excuse when he lost to Mayweather; his camp said that he was suffering a shoulder injury at the time, and yet he still chose to continue the fight to not disappoint the fans. It's some sort of saying that he was not 100% during the fight. So, this exhibition fight or part 2 of their rivalry, hopefully, there will be no more excuses, as it's not vital anymore since they have cemented their achievements during their pro careers. The outcome of this fight is already \"off the record.\"Hey, OP! Would you mind putting up a voting poll? Let's see if the majority would still choose Pacman as the winner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "October 02, 2023, 03:06:52 PM",
      "body": "The two have been friends already, if this has to happen Money trash talk again to hype the game.Much respect for the 2 but if they ever do this like it's their last hurrah. Both should promise to never go inside any ring for the rest of their lives because if they still fight YouTubers after this rematch, we really are about to reach the peak. Let's not check out the crashing economy but look over there, two popular guys fighting. We weren't successful in dragging Elon and Zucker fighting in the cage so they now want the two again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "October 02, 2023, 03:16:32 PM",
      "body": "Quote from: stadus on October 02, 2023, 02:15:52 PMThe biggest exhibition fight in year 2024, if this rumor were to become true.It will be if the two fighters agreed to fight both fighters could still make a lot of money they are still competitiveQuoteManny had a slight excuse when he lost to Mayweather; his camp said that he was suffering a shoulder injury at the time, and yet he still chose to continue the fight to not disappoint the fans. It's some sort of saying that he was not 100% during the fight. So, this exhibition fight or part 2 of their rivalry, hopefully, there will be no more excuses, as it's not vital anymore since they have cemented their achievements during their pro careers. The outcome of this fight is already \"off the record.\"There's no disclosure on the first fight because of Pacquiao's injury maybe in this second fight we'll know who really is a better fighter, if one of them suffers injury during their preparation they can still withdraw since its an exhition.QuoteHey, OP! Would you mind putting up a voting poll? Let's see if the majority would still choose Pacman as the winner.Yes I agree a healthy Pacquiao can beat Mayweather, eventhough both fighters are retire they can their bodies in tip top shape.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "edmundduke",
      "created_time": "October 02, 2023, 03:22:40 PM",
      "body": "Quote from: ultrloa on October 02, 2023, 07:59:52 AMThere's a rumors spreading that Pacquiao vs Mayweather 2 rematch will set to happen on May 2024 https://asianmma.com/manny-pacquiao-rumoured-to-be-rematching-floyd-mayweather-in-2024/Pacquaio is always ready to fight Mayweather is so evasive for past couple of years. Do you think that this match up would really happen?If this deal will be set and there's official contract that this fight would happen on speculated date for sure many boxing fans will get hype for seeing this two legendary will set another big match in boxing history.I want this fight to happen and hope no other elements will stop this or Mayweather will agree to this deal so that we can see if Pacquaio could get a revenge or Mayweather can seal the long time discussion about who is the best boxer between him and Pacquaio.Could be coming for sure. I bet both them would not mind a payday again. Personally hope it will happen and maybe it would be best if Mayweather looses (tho this would be unlikely as he is damn good) so we could get a triology. But in all honesty, the other matches coming up with Fury n so are way more exciting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "October 02, 2023, 04:21:56 PM",
      "body": "Quote from: ultrloa on October 02, 2023, 07:59:52 AMThere's a rumors spreading that Pacquiao vs Mayweather 2 rematch will set to happen on May 2024 https://asianmma.com/manny-pacquiao-rumoured-to-be-rematching-floyd-mayweather-in-2024/That rumor has been going on for years I wonder when will this stop, if there are talks then we can take this rumor seriously, both fighters can still attract ticket sales and PPV because there's no disclosure on the first fight because of Pacquiao's broken arm that hampers his power and movement and because of this the boxing community is divided if Pacquiao can beat Mayweather and if Mayweather can beat a healthy Pacquiao.This is going to be a big money maker much bigger than what the Pauls' did in their exhibition, Manny will agree to fight definitely but Mayweather doesn't want to risk his unbeaten record, and besides he has long been absent from serious boxing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}