{
  "id": "topic_5426958",
  "title": "GAWPROJECT",
  "author": "GAWPROJECT",
  "created_time": "December 08, 2022, 02:16:31 PMLast edit: December 29, 2023, 02:11:34 PM by GAWPROJECT",
  "content": "https://i.postimg.cc/76g1Gfvk/gaw-gamers-around-the-world-0xdd43d4578056b96-C79-D86-DAB8547-A79295a540-F5-bsc-bnb-1.pngBUY = 3%       SELL = 3%GAW Token is creating a marketplace for gamers to buy, sell, and design unique “non-fungible” in-game items.Unique items, such as rare skins, are powered by the Binance smart chain standard, giving them their own unique digital signature and ownership history. They are issued in limited quantities. E.g. 1000 limited edition legendary skins in honor of an esports champion or popular Twitch streamer.GTX, the transactional currency for the users of the GAW ecosystem, is based on the Bep20 standard. It will also be used as a reward mechanism for gamers’ achievements. The democratic staking mechanism will also allow users to crowdfund item designs and invest in the game market. With GAW app, many people can make a profit with minimal effort. Integrating unique items is made easy for game developers via a universal API that offers multiple endpoints for game developers to seamlessly mint and integrate blockchain based items in their games. Developers can also choose to communicate with the API directly or integrate one of our upcoming SDKs.TeamMatthias David Reimer (@MatthiasGAW) https://t.me/Matthias_David_Reimerhttps://twitter.com/MatthiasDavidR?t=9vQCjDxP6o2F3NIw8NK6hg&s=09https://www.facebook.com/profile.php?id=100087591364248Joscha Malve (@JoschaMalve) https://x.com/JoschaMalve?t=KiwEKav6DbSCdKbDmtPbYA&s=09https://t.me/JoschaMalveSzirm Francu (@ZirmFrancu) https://x.com/SzirmFrancu?t=-dZrh9aICtyvyBAw3D6XiQ&s=09https://t.me/ZirmFrancuhomepagewww.gamegaw.com official mail´scontact@gamegaw.comsupport@gamegaw.comcontract0x80a254964b724c8738639Ae3C5d120CdC7c6b2fbexplorerhttps://bscscan.com/address/0x80a254964b724c8738639Ae3C5d120CdC7c6b2fbsourcecodehttps://github.com/gawgamers/code/blob/main/sourceWhitepaperhttps://github.com/gawgamers/Whitepapaper/blob/main/whitepaper-gaw-V1.1.2%20(1).pdfAudithttps://blocksafu.com/audit/0x80a254964b724c8738639Ae3C5d120CdC7c6b2fbTokenomicshttps://github.com/gawgamers/tokenomics/blob/main/Tokenomics-gaw-gamers-around-the-world-0x80a254964b724c8738639Ae3C5d120CdC7c6b2fb.pngRoadmaphttps://github.com/gawgamers/Roadmap/blob/main/Roadmap-V.1.1.2-GAW-animated.docxsocial´stelegramhttps://t.me/game_gawtwitterhttps://x.com/Game_GAW?t=K7qwWGZCEfU1-YUpiEDkzg&s=35githubhttps://github.com/gawgamersReddithttps://www.reddit.com/r/GAW_gaimers/utube:https://www.youtube.com/channel/UC8tNhKcWt5aUK7JREdkYktQFacebook:https://www.facebook.com/profile.php?id=100087289277881discord:https://discord.gg/YjuSKZqtSYmedium:https://medium.com/@gawgamersaroundtheworldBitcointalkhttps://bitcointalk.org/index.php?action=profile;u=3521273;sa=showPostsPhase 0Pre-launch PhaseResearch, Requirements and Concept of GamerTokenGamigo Group PartnershipDefinition, Ruleset and Logic of the GamerToken MechanicsLegal Counsel and Security PoliciesFoundation, Key Building Blocks and Basic SetupToken Generation Event PreparationPhase 0.1Prototype DevelopmentSetup and ConfigurationSmart Contracts ProgrammingRule Test, Verification and AdaptationsPhase 0.2Minimum viable ProductOnline Fantasy MMO Integration of GAWWallet and API DevelopmentWorking Marketplace DemoBsc Bep20 Non-Fungible Item ImplementationGTX Reward SystemPhase 0.3LaunchPublic AnnouncementItem Rental Feature PlanningScaling Solution ResearchDemo Updates: Live Testing of Rental Feature Transparent Fees Item Filtering Inventory PagesPresale & Fair Lounch Add Liquidty to contract PankaceswapLock LQ for one Year by DX sale AppPhase 1.0DevelopmentProof of Concept for Sidechain Scaling SolutionUniversal API DevelopmentEsports Team PartnershipsCommunity Building RoadshowsGitHub Smart Contract ReleaseBurn all Dev TokenRenounce OwnershipSmart Contract AuditProduction Sidechain DeploymentPublic ReleaseListing on Coingecko & coinmarketcapPhase 2.0Release and ExpansionToken Generation EventNew Game IntegrationsBlockchain Explorer DevelopmentGame SDKsItem Auction FunctionDesigner's CornerCertik AuditPhase 3.0Token Generation EventListing on major CEXNew Game IntegrationsBlockchain Explorer DevelopmentGame SDKsItem Auction FunctionDesigner's Cornerhttps://i.postimg.cc/WzB4kd30/esports-hotel-header.jpg",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5426958",
  "comments": []
}