{
  "id": "topic_5422889",
  "title": "Ludmilla_rose1995",
  "author": "Ludmilla_rose1995",
  "created_time": "November 23, 2022, 09:05:51 PMLast edit: December 06, 2022, 01:05:08 AM by Ludmilla_rose1995",
  "content": "Quote'From the 15th of November, Santander mobile and online banking customers were restricted to a £1,000 limit for individual cryptocurrency transactions and a £3,000 cap on transactions in a rolling 30-day period. Payments sent to cryptocurrency exchange Binance will continue to be blocked, while payments from cryptocurrency exchanges, including Binance, will still be permitted.47% of UK banks don’t allow customers to interact with crypto exchanges, according to personal finance comparison site finder.com.A Starling Bank spokesperson said: “Starling has had restrictions of varying degrees on crypto transactions for some time, like many other banks. We recently tightened restrictions on inbound and outbound transactions by card and bank transfer.“Today’s message was to make sure that customers who have made such transactions in the past, but not recently, are aware of this.“The innovative technology, and thinking, behind cryptocurrencies, have great potential advantages, however, right now, they are high risk and heavily used for criminal purposes and, as such, we no longer support them.”➥ https://www.standard.co.uk/business/starling-bank-bans-bitcoin-transactions-as-part-of-crypto-clampdown-b1041868.htmlThis is the second time, Starling Banks bans crypto transactions from their bank to the exchange and vice versa,, what is even more surprising is that this policy carried out by starling bank occurred when the British parliament was discussing whether cryptocurrencies deserved to be a part of financial regulation. I wonder if the UK parliament will intervene in this matter?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5422889",
  "comments": [
    {
      "author": "Kakmakr",
      "created_time": "November 24, 2022, 05:36:29 AM",
      "body": "A lot of Australian Banks have also tried to \"block\" Bitcoin transactions in the past and the Australian citizens took them on. It was found that those Banks colluded to \"block\" Bitcoin transactions and it was deemed as anti-competitive actions. The big Crypto exchanges are making a lot of profit and this type of actions are hurting their business, so I will suggest that they stand together to report this. ( general.enquiries@cma.gov.uk )  Anti-competitive agreements are covered by Chapter I of the 1998 Act in UK law and Article 101 of EU law. UK and EU law prohibit agreements, arrangements and concerted business practices which appreciably prevent, restrict or distort competition, or where this is the intended result. Source : https://harperjames.co.uk/article/competition-law-an-overview/https://www.legislation.gov.uk/ukpga/1998/41/contents",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "November 24, 2022, 10:17:04 AM",
      "body": "QuoteStarling Bank bans Bitcoin transactions Don't be funny, how can a bank ban Bitcoin transactions when Bitcoin is decentralized and enables transactions in a way that avoids banks? The bank only introduced a restriction on individual deposits, and that is an amount that I don't think is too problematic for ordinary users, because I doubt that £3000 pounds per month is an amount that the majority exceeds.Furthermore, you quote a source that claims that even 47% of banks in the UK have similar restrictions, so why would parliament or anyone else intervene in this case?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "royalfestus",
      "created_time": "November 24, 2022, 10:29:59 AM",
      "body": "Quote from: Lucius on November 24, 2022, 10:17:04 AMQuoteStarling Bank bans Bitcoin transactions Don't be funny, how can a bank ban Bitcoin transactions when Bitcoin is decentralized and enables transactions in a way that avoids banks? The bank only introduced a restriction on individual deposits, and that is an amount that I don't think is too problematic for ordinary users, because I doubt that £3000 pounds per month is an amount that the majority exceeds.Furthermore, you quote a source that claims that even 47% of banks in the UK have similar restrictions, so why would parliament or anyone else intervene in this case?I would like to know how the ban works. The majority of bitcoin transactions do not happen at banks, so are they also banning peer-to-peer transactions? Is there a way to identify P2P transactions that involve cryptocurrency if the parties don't mention it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "November 24, 2022, 10:58:07 AM",
      "body": "@royalfestus, read a little better, it's not a ban in the literal sense of the word, but a limitation of deposits to centralized crypto exchanges - this is about fiat transactions. If someone trades through DEX (decentralized crypto exchange), then the bank cannot know that it is a transaction in which cryptocurrency is included, for the reason that it is a transaction between two people without a centralized party.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "November 24, 2022, 02:22:51 PM",
      "body": "Is this Starling Bank somehow related to Santander? Because iirc Santander is blocking for some while the fiat transfers that are related to bitcoin trading.I guess that they are afraid. I guess that they see bitcoin taking over \"market share\". They don't understand that their actions (ie forbid users do what they want with their own money) is actually the best advertising for bitcoin and against banks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ludmilla_rose1995",
      "created_time": "November 24, 2022, 06:53:12 PM",
      "body": "Quote from: Lucius on November 24, 2022, 10:17:04 AMQuoteStarling Bank bans Bitcoin transactions Don't be funny, how can a bank ban Bitcoin transactions when Bitcoin is decentralized and enables transactions in a way that avoids banks? The bank only introduced a restriction on individual deposits, and that is an amount that I don't think is too problematic for ordinary users, because I doubt that £3000 pounds per month is an amount that the majority exceeds.sorry, I just copied the title of the news, maybe the title looks confusing Quote from: Lucius on November 24, 2022, 10:17:04 AMFurthermore, you quote a source that claims that even 47% of banks in the UK have similar restrictions, so why would parliament or anyone else intervene in this case?I'm just curious as to whether the policies implemented by Starling Bank will have any effect on what is currently being discussed in the British parliament.[2022-10-26] UK Votes in Favor of Recognizing Crypto as Regulated Financial InstQuote from: NeuroticFish on November 24, 2022, 02:22:51 PMIs this Starling Bank somehow related to Santander? Because iirc Santander is blocking for some while the fiat transfers that are related to bitcoin trading.I guess that they are afraid. I guess that they see bitcoin taking over \"market share\". They don't understand that their actions (ie forbid users do what they want with their own money) is actually the best advertising for bitcoin and against banks.it is possible that they are connected or it is possible that this is a domino effect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "November 25, 2022, 02:13:18 AM",
      "body": "Quote from: Lucius on November 24, 2022, 10:17:04 AMQuoteStarling Bank bans Bitcoin transactions Don't be funny, how can a bank ban Bitcoin transactions when Bitcoin is decentralized and enables transactions in a way that avoids banks? The bank only introduced a restriction on individual deposits, and that is an amount that I don't think is too problematic for ordinary users, because I doubt that £3000 pounds per month is an amount that the majority exceeds.Furthermore, you quote a source that claims that even 47% of banks in the UK have similar restrictions, so why would parliament or anyone else intervene in this case?It appears the title is clickbait. What the article is saying is the Starling bank are presently beginning to ban transactions going in and out of bitcoin services like exchanges. What these traditional financial services are doing is blocking liquidity which might only increase when other banks in other jurisdictions also start doing this. I reckon this might prevent investors from entering the cryptospace for the next bull market and cause the next bull market to be not as powerful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maestro75",
      "created_time": "January 25, 2023, 11:22:30 AM",
      "body": "Is it Starling Bank, according to your spelling or Sterling Bank? The difference being letter a and e. I asked this because there is a Sterling Bank in my country. I do not know if it is related to the bank you mentioned here. For a long time in my country banks have been mandated by the central bank to prevent their customers from making transactions that are cryptocurrency related. There is a ban on bank to crypto transactions in my country. So when I read that there are countries allowing cryptocurrency transactions in banks I envy them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "January 25, 2023, 11:31:57 AM",
      "body": "Quote from: Maestro75 on January 25, 2023, 11:22:30 AMIs it Starling Bank, according to your spelling or Sterling Bank?If you would have been paying attention at least to the linked article you would have known that it's an article from UK talking about Starling Bank from UK (and the situation of crypto in UK), not Sterling Bank (Nigeria)...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maestro75",
      "created_time": "January 25, 2023, 05:53:18 PM",
      "body": "Quote from: NeuroticFish on January 25, 2023, 11:31:57 AMQuote from: Maestro75 on January 25, 2023, 11:22:30 AMIs it Starling Bank, according to your spelling or Sterling Bank?If you would have been paying attention at least to the linked article you would have known that it's an article from UK talking about Starling Bank from UK (and the situation of crypto in UK), not Sterling Bank (Nigeria)...I read the article but was only trying to double check on the spelling. Yes both banks are in different countries but we also know that banks do have international branches and offices. For example, there are many banks in Nigeria with offices overseas. Am not trying to drag your comment with this post, I have no problem now with it. Thank you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FUCKBSVFUCK",
      "created_time": "May 01, 2023, 12:50:17 PM",
      "body": "It is a matter of time before the UK government comes into the public's mind and takes a decision on the matter.    In my opinion, the UK government is going to do everything in their power to try to make it easier for people to use cryptocurrency as a means of payment.    They don't want to be left behind, they want to be able to pay for it without any third party involvement.    So, as long as the UK government is not acting in a way that is contrary to the wishes of the people, it is going to be a hard decision to make.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "June 03, 2023, 02:43:16 PM",
      "body": "Quote from: FUCKBSVFUCK on May 01, 2023, 12:50:17 PMIn my opinion, the UK government is going to do everything in their power to try to make it easier for people to use cryptocurrency as a means of payment.1. This is a rather old topic.2. You are not wrong, they don't want to fall behind. Still, they won't do much, your expectations from the politicians are way too high. I think that they might copy this or that from US, which may actually be in the bad/wrong direction in the near future. Later on.. we'll see...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}