{
  "id": "topic_5432163",
  "title": "Fullbear2222",
  "author": "Fullbear2222",
  "created_time": "December 28, 2022, 03:09:13 PM",
  "content": "Try to dca dont try to predict lows.Becouse Fed might make surprise everthing IS low now and whales got a lot assets for the bull run.Yes we have Crisis but what Will you say If Fed Will do secret money printing ? One day you wake up and btc went night time other 10-20k up while you was sleeping.Also maybe all this situation all around the world IS just fud and Will be forgetten like covid 19 you see nobody dont remember covid anymore.And after few months nobody maybe dont talk about war anymore.The Fed might be tricky there is no guarantees that Fed dont push down secretly money printer turn on.So maybe Powell should give Outh to traders and crypto holders \" i guarantee that you guys can sleep well and i wount start bull run without few weeks notice so all you guys can be prepared for the bull run \" Until Fed Has no announced guarantees to us maybe they might Do bull run while we sleeping.Since bankers not trusted so we never know their tricks on the sleeves If they don't give guarantees then we need to be cautious 24/7 watching btc price and hope we dont miss the bull run.And Fed can send btc to 60 k again so we need to be cautious we never know they might check If we all sleep then they suddenly Will pmpup the stocks and crypto",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432163",
  "comments": [
    {
      "author": "EarnOnVictor",
      "created_time": "December 28, 2022, 03:46:06 PM",
      "body": "Investments could be done at any time, all that matters are the right speculations and planning. And I would have loved it if you left the FED out of this, they are doing their thing and it would always be for the safety and betterment of the US and the global economy at large. Printing could happen at any time, but the effect will certainly be minimal on Bitcoin this time that inflation and more uncertainty in the global economy are plaguing.And as for whales and others, let me be clear, the time that a few sets of people would be controlling Bitcoin and crypto space is over. It's now being majorly controlled by institutions, and they are the biggest stakeholders these days. Unless there would be other major events that would check the world or be directly related to crypto itself, I do not see any immediate foreseeable impacts in the crypto space whether good or bad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "inthelongrun",
      "created_time": "December 28, 2022, 05:31:17 PM",
      "body": "So are you saying that we should not go to sleep because the Fed might turn on its money printer and then pump bitcoin? You must be a robot if you can monitor the bitcoin price 24/7. Also, even if you are awake, how do we know the Fed is not overprinting paper money? Did you visit and see their machine every day? Do you really believe that bitcoin from $16k will suddenly rise to $60k overnight? You have a very colorful mind mate, from giving advice on trading and considering Putin as Satoshi Nakamoto to telling us that sleep may endanger our bitcoin investment. Thought DCA is the key so we can sleep well and stop thinking about bitcoin up and down movements.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "December 30, 2022, 10:33:01 AM",
      "body": "No one knows when the bottom will be in, thats why we DCA when the market value is very low, forget the FED and just buy from time to time, most projects, altcoins for example have lost 95% of their value compare to their ATH.. There is no point including the FED here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "December 30, 2022, 10:42:50 AM",
      "body": "I think this might be the challenge for some, try to see if they can predict the bottom or even the highest price in all time high. So still individual preference, but for those who are \"smart\", yeah DCA could be a good thing and this is a foul proof strategy in my opinion.As for the FED's statement, yes their data and CPI are really very important to us, I mean it could mean a short pump or another incoming dump specially if the pivot turns out to be very negative not just for crypto but it has a impact to traditional markets too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "December 30, 2022, 11:06:38 AM",
      "body": "If you don't know when a low is coming, you don't need to analyze it but try to buy at a very low. Thus, it will not be too difficult for you because your task is only to buy bitcoins when the price can decrease. Also, no one knows when the lowest price will come, so you must have a strategy to know when you can buy bitcoins.You could set up an alarm on your cellphone to buy it directly through a purchase order when your lowest price target is reached. And by using the DCA strategy, you can buy bitcoins at the lowest prices to increase the amount of bitcoins you have.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "South Park",
      "created_time": "December 30, 2022, 07:40:29 PM",
      "body": "Quote from: Outhue on December 30, 2022, 10:33:01 AMNo one knows when the bottom will be in, thats why we DCA when the market value is very low, forget the FED and just buy from time to time, most projects, altcoins for example have lost 95% of their value compare to their ATH.. There is no point including the FED here. Exactly, if someone actually knew when the bottom will happen then they will just concentrate all their efforts on identifying when this will happen and make a single purchase of bitcoin at that moment, but since we cannot do this then a compromise needs to be reached and performing a dollar cost averaging strategy is a good enough compromise, as we are buying bitcoin when its price is very far away from its ATH and reducing the price at which we bought our coins as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HmmMAA",
      "created_time": "January 01, 2023, 10:50:20 AM",
      "body": "Quote from: Fullbear2222 on December 28, 2022, 03:09:13 PMTry to dca dont try to predict lows.I believe that simply using the DCA strategy without considering other factors isnt a sufficient investment approach . It is important to identify key support levels where it may be appropriate to use DCA . In a bear market it may not be wise to invest at all , and it may be more advisable to wait for a more bullish market . Having patience and understanding how to analyze market trends can help an investor achieve profitable positions .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "January 01, 2023, 12:01:21 PM",
      "body": "Other than the first line of your topic, the rest was related to theories, not facts that could be built upon.Unfortunately, trying to predict the bottom specifically to buy in huge quantities is considered a non-judgmental policy*, as buying at 10k or 16k will not make a difference if you are a long-term investor, but predictions can be used to enhance the DCA, as when predictions are more likely to invest in DCA in a lower amount, and vice versa.In short, we are close to the bottom, so do not stop buying as long as you have extra money, you are not afraid of losing it and you do not know where to invest it with your desire to invest for the long term.* It's like trying to go full speed by waiting for all the green lights to come your way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}