{
  "id": "topic_5450780",
  "title": "jerry0",
  "author": "jerry0",
  "created_time": "May 01, 2023, 03:24:29 AM",
  "content": "On ledger site when making order, it ask for your email address.  A while back years ago i did order and use email and plan to use same email for this order.  Any issue with that?  As of now i still get those ledger emails.Also below it shows there is option to check in boldLedger collects and processes your personal data to manage your orderI consent to receiving emails from Ledger about products, updates, and industry news.Do I check that or not?  My email already gets those ledger emails.  I must have checked it last time years ago when i bought a nano device?  So the part above the bold is for everyone but the bold part is your option?  However, i'm already subscribed to ledger emails.Seems like check or no check order would probably go through?  Suppose to leave it unchecked or checked?  Want to make sure the order goes through.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450780",
  "comments": [
    {
      "author": "Free Market Capitalist",
      "created_time": "May 01, 2023, 03:59:28 AM",
      "body": "Quote from: jerry0 on May 01, 2023, 03:24:29 AMOn ledger site when making order, it ask for your email address.  A while back years ago i did order and use email and plan to use same email for this order.  Any issue with that?  As of now i still get those ledger emails.Wasn't it exposed in the Ledger database hack? Mine was and since then I receive a lot of spam but apparently no more data was leaked.Quote from: jerry0 on May 01, 2023, 03:24:29 AMI consent to receiving emails from Ledger about products, updates, and industry news.Do I check that or not?  I never check it.Quote from: jerry0 on May 01, 2023, 03:24:29 AMMy email already gets those ledger emails.  I must have checked it last time years ago when i bought a nano device?  So the part above the bold is for everyone but the bold part is your option?  However, i'm already subscribed to ledger emails.Then I don't know why you are asking. If what you want to do is to stop receiving them what you have to do is uncheck and then in the last promotional email you received from them go to the unsubscribe option.Quote from: jerry0 on May 01, 2023, 03:24:29 AMWant to make sure the order goes through. It doesn't affect the order. I always leave that option unchecked for orders and get them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jerry0",
      "created_time": "May 01, 2023, 04:10:18 AM",
      "body": "Quote from: Poker Player on May 01, 2023, 03:59:28 AMQuote from: jerry0 on May 01, 2023, 03:24:29 AMOn ledger site when making order, it ask for your email address.  A while back years ago i did order and use email and plan to use same email for this order.  Any issue with that?  As of now i still get those ledger emails.Wasn't it exposed in the Ledger database hack? Mine was and since then I receive a lot of spam but apparently no more data was leaked.Quote from: jerry0 on May 01, 2023, 03:24:29 AMI consent to receiving emails from Ledger about products, updates, and industry news.Do I check that or not?  I never check it.Quote from: jerry0 on May 01, 2023, 03:24:29 AMMy email already gets those ledger emails.  I must have checked it last time years ago when i bought a nano device?  So the part above the bold is for everyone but the bold part is your option?  However, i'm already subscribed to ledger emails.Then I don't know why you are asking. If what you want to do is to stop receiving them what you have to do is uncheck and then in the last promotional email you received from them go to the unsubscribe option.Quote from: jerry0 on May 01, 2023, 03:24:29 AMWant to make sure the order goes through. It doesn't affect the order. I always leave that option unchecked for orders and get them.Thanks.  So you have ordered from them more than once then?  This is my second time.  If so, you used same email or that shouldn't matter?Also when trying to make the order, you have to put your phone number right?  Also... it seems there is option for Fedex or DHL?  That normal?  Thought they only ship DHL to the US",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "May 01, 2023, 04:42:36 AM",
      "body": "Quote from: jerry0 on May 01, 2023, 04:10:18 AMThanks.  So you have ordered from them more than once then?  Of course I haven't ordered from that crappy company more than once. Once and no more. Quote from: jerry0 on May 01, 2023, 04:10:18 AMThis is my second time.  If so, you used same email or that shouldn't matter?The second time works like when you order a second time from another company in general, if you use the same email address you will still receive the promotional emails that you already received, if you put another one you will receive those emails to your two different email addresses but for the purpose of the order going through there is no difference. Quote from: jerry0 on May 01, 2023, 04:10:18 AMAlso when trying to make the order, you have to put your phone number right?  Yes, usually for the courier, just in case.Quote from: jerry0 on May 01, 2023, 04:10:18 AMAlso... it seems there is option for Fedex or DHL?  That normal?  Thought they only ship DHL to the USI don't know about that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jerry0",
      "created_time": "May 01, 2023, 04:49:53 AM",
      "body": "What was the reason?  The device went bad fast or was it the data leak?Well i thought not checking it might not make order go through because the sentence before that.  Anyone else can confirm this?Okay so you only bought from ledger once.  Want to know from others who bought from ledger at least twice because it doesn't even list fedex as a carrier and only dhl.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "May 01, 2023, 04:55:17 AM",
      "body": "Quote from: jerry0 on May 01, 2023, 04:49:53 AMWhat was the reason?  The device went bad fast or was it the data leak?The data leak. At least that we know of it happened twice.Ledger data leak: A ‘simple mistake’ exposed 270K crypto wallet buyers Ledger owners report chilling threats after 20K more records leaked",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "May 01, 2023, 05:39:03 AM",
      "body": "You can purchase as much as you want with the same email and there wouldn't be a problem — same with 99.9% of legit online stores. In the first place, it would be really bad UX and wouldn't make sense in general if you could use your email just once lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "May 01, 2023, 07:23:17 AM",
      "body": "You can reuse your email address and choose to either receive or not to get any promotional emails, this does not in anyway affect the order you are making nor does it provide more privacy. Your email is already logged when you use it to make an order, unchecking the promotional email option works to prevent spamming your email or clogging if spamming is a heavy word.Quote from: jerry0 on May 01, 2023, 04:49:53 AMWell i thought not checking it might not make order go through because the sentence before that.  Anyone else can confirm this?No it does not affect the order, just a marketing strategy.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "May 01, 2023, 08:15:46 AM",
      "body": "Quote from: jerry0 on May 01, 2023, 03:24:29 AMOn ledger site when making order, it ask for your email address.  A while back years ago i did order and use email and plan to use same email for this order.  Any issue with that?  As of now i still get those ledger emails.The reason we go for any hardware wallet is for privacy and i see no reason to why we have to complete a kyc form before being attended to while securing a hardware wallet, if they demand for your email, you may decided not to give out your major email address that you use, this is a private affairs and should be treated as it is.Quote from: jerry0 on May 01, 2023, 03:24:29 AMLedger collects and processes your personal data to manage your orderI consent to receiving emails from Ledger about products, updates, and industry news.I think that issue of delivery with kyc option is part of their own policy, i will suggest a try on other hardware wallets and check if they may request same or not before making your delivery, there should be more decentralized ways they can adopt in selling out their products without involving kyc before delivery.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "May 01, 2023, 10:45:27 AM",
      "body": "Does the company policy say that you can only purchase one device? The company needs customers, and its goal is to sell as much as possible for its business. You don't need to tell them why you needed one and now another wallet. Also, by providing your old email address, you look like a regular customer and are free to ask for a discount.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jerry0",
      "created_time": "May 01, 2023, 05:16:23 PM",
      "body": "Thanks.Anyone here know if they ship to the US with fedex as well?  Surprised they had that showing as i thought only dhl?  When they start fedex to the us?  Also signature required?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "May 01, 2023, 05:32:16 PM",
      "body": "Quote from: jerry0 on May 01, 2023, 05:16:23 PMAnyone here know if they ship to the US with fedex as well?  Surprised they had that showing as i thought only dhl?  When they start fedex to the us?  Also signature required?Not from the US so I can't really answer.If you really need the answer though, go ask on Reddit r/ledgerwallet, or directly message Ledger on Twitter.https://www.reddit.com/r/ledgerwallet/https://twitter.com/Ledger",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "May 01, 2023, 10:18:13 PM",
      "body": "What matters to these companies are your order, name/address and payment. That's it, emails are just for the purpose of putting the slip and sending it back to you so, whether you use old or new email, that don't really matter all. Quote from: jerry0 on May 01, 2023, 05:16:23 PMThanks.Anyone here know if they ship to the US with fedex as well?  Surprised they had that showing as i thought only dhl?  When they start fedex to the us?  Also signature required?I'm not from there but if you're from the US, just check their authorized resellers there so that you won't have any problem with shipping. They've got 7 resellers and that includes Target and Walmart based on their website: https://www.ledger.com/reseller",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "May 01, 2023, 11:04:55 PM",
      "body": "I think all your questions were already answered above. If you're still uncertain, you can reach out to Ledger's customer support for further clarification because most people here will share only their experience. Here are the links where you can reach them out.Ledger support centerLedger's TwitterEmail supportLive ChatJust make sure you purchase from the legitimate resellers showed the link above.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}