{
  "id": "topic_5417864",
  "title": "luckya3",
  "author": "luckya3",
  "created_time": "October 21, 2022, 08:02:06 AM",
  "content": "Hallo,ich besitze ein paar alte Bitcoin Wallets in denen ab und an noch Transaktionen eingehen. Ich möchte gerne dass diese 'alten' Wallets nach einem BTC Eingang, alles automatisch an mein 'Hauptwallet' weitersenden. Wie könnte ich das technisch am Einfachsten umsetzten?Vielen Dank!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417864",
  "comments": [
    {
      "author": "mole0815",
      "created_time": "October 21, 2022, 08:23:22 AM",
      "body": "Herzlich willkommen luckya3!Diese Fragen haben sich schon mehrere Leute gestellt z.B. hier: https://bitcoin.stackexchange.com/questions/1495/is-there-a-way-to-automatically-send-bitcoins-from-one-wallet-to-another oder hier: https://www.quora.com/How-can-one-automate-the-payment-of-bitcoin-from-a-specific-wallet-through-codeDie Frage wäre zuerst wie du das machen möchtest. Benötigst du Programm (UI)? Bist du Linux fit? Fragen über Fragen aber es sollte sich lösen lassen Es gibt viele Wege und hängt von den Fähigkeiten ab diese auch umzusetzen: https://stackoverflow.com/questions/37126710/automatically-send-wallet-balance-to-another-wallet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "luckya3",
      "created_time": "October 21, 2022, 08:28:37 AM",
      "body": "Vielen Dank mole0815 für Deine schnelle Antwort!Da stellt sich mir wieder heraus wer die Suchfunktion nutzen kann ist klar im Vorteil!  Sorry dafür!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "October 21, 2022, 09:59:54 AM",
      "body": "Quote from: luckya3 on October 21, 2022, 08:28:37 AMDa stellt sich mir wieder heraus wer die Suchfunktion nutzen kann ist klar im Vorteil!  Kein Problem und mach dir keinen Kopf. Ich bin das Thema per google angegangen und habe zuerst auch nicht im Forum gesucht Aber auch hier (im englischen Teil) gab es schon Beiträge zu dem Thema. z.B. hier: Auto Bitcoin Forwarder oder sogar noch besser hier denn z.B. HeRetiK könnte sogar in unserer Sprache helfen.Also wenn du etwas Zeit und Arbeit investierst wird es sicher eine passende Lösung geben.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}