{
  "id": "topic_5468668",
  "title": "1miau",
  "author": "1miau",
  "created_time": "September 30, 2023, 03:47:34 PMLast edit: January 20, 2024, 11:36:47 PM by 1miau",
  "content": "Anyone who has ever heard of Bitcoin may have heard of HODL as well. Because HODL is a very famous strategy to speculate on long-term price gains of Bitcoin, whereby \"long term\" is not defined in detail, how long it really is. HODL dates back to a Bitcointalk post from 2013, where it was advised not to sell one's own Bitcoins despite losses, but to wait patiently until it rises again. However, it is indeed essential to wait, because most common errors from HODL are: - Sold all BTC too early to realize (small) profits - Sold all BTC too early to minimize losses in case of decreasing prices Additional mistakes can be dangerous coin storage practices, for example on a file-sharing platform, which is increasing risks of getting hacked. But in my post and for advanced Bitcoin HODLers it is assumed our coins are stored properly, which HODL also invites us to do, because HODL only required to transfer our coins on very rare occasions (if at all), which minimizes transferring or storage errors. As a conclusion we should keep in mind: most common mistakes of HODL are quick sales of our valuable BTC. So, we have to be aware and know that HODL is purely a mental challenge. A good HODLer can resist any temptation to make (small) profits prematurely and a good HODLer keeps his Bitcoin. A good HODLer stays cool even in case of losses. Best we can do is to move our valuable Bitcoin somewhere where it has a high resistance of being sold. And we shouldn't store it on file-sharing networks anyways and also not on centralized exchanges because we don't have our private key on such platforms (not your key, not your coins).After all, it's a very important lesson to know that HODL is purely a mental challenge. If you want to HODL correctly, you should know and pay attention to all points mentioned above.  Translations: Languagetranslated byTitle_______________________________________________________________________________________________________________________Nigeria (Naija)ChilwellHODL na purely a mental challengePakistan (Urdu)Publictalk792هوڈل واقع ہی ایک ذہنی چیلنج ہےReserving new translations is currently not available.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468668",
  "comments": [
    {
      "author": "pixie85",
      "created_time": "September 30, 2023, 04:22:14 PM",
      "body": "Quote from: 1miau on September 30, 2023, 03:47:34 PMHODL dates back to a Bitcointalk post from 2015, where it was advised not to sell one's own Bitcoins despite losses, but to wait patiently until it rises again. *2013It's a shame the author isn't around anymore. Would love to hear his story. QuoteA good HODLer stays cool even in case of losses. Best we can do is to move our valuable Bitcoin somewhere where it has a high resistance of being sold. This has a lot in common with religion, cults, and similar things. Even though I'm a hodler myself, every time I read something like this makes me think of how crazy this sounds to an average person, especially people who trade stocks or currencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "September 30, 2023, 04:41:41 PM",
      "body": "Quote from: pixie85 on September 30, 2023, 04:22:14 PMQuote from: 1miau on September 30, 2023, 03:47:34 PMHODL dates back to a Bitcointalk post from 2015, where it was advised not to sell one's own Bitcoins despite losses, but to wait patiently until it rises again. *2013You are right, somehow I've missed it, that it's been that early.  I've edited my post.  Quote from: pixie85 on September 30, 2023, 04:22:14 PMIt's a shame the author isn't around anymore. Would love to hear his story. Yes, despite logging it and even writing posts a few times, GameKyuubi isn’t actively participating in a discussion here. Maybe he doesn’t want to cause any attention because he’s somewhat famous already.  Quote from: pixie85 on September 30, 2023, 04:22:14 PMQuoteA good HODLer stays cool even in case of losses. Best we can do is to move our valuable Bitcoin somewhere where it has a high resistance of being sold. This has a lot in common with religion, cults, and similar things. Even though I'm a hodler myself, every time I read something like this makes me think of how crazy this sounds to an average person, especially people who trade stocks or currencies.I wouldn’t call it \"cult\", just a nice and promising strategy suited for Bitcoin. Because compared to stocks or (fiat) currencies, Bitcoin is quite different. I would compare Bitcoin and gold to each other. And for gold, it's also common that people are collecting coins or bars, while hoping for price increases or by simply collecting them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "komisariatku",
      "created_time": "September 30, 2023, 04:49:39 PM",
      "body": "HODL is all about mental, I totally agree.The temptation to HODL bitcoin when the price is falling is whether we will continue to hold it and wait for the price to rise again? How long? or do we cut lose?The temptation to HODL Bitcoin when the price goes up, do we keep holding it until the price is even higher? or will it go down again? we are confused about what price to sell, too early we will regret it, too long the price can drop againSo HODLing bitcoin is about mental strength, long-term goals and good financial condition. Without it, I doubt I would be able to HODL",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Y3shot",
      "created_time": "September 30, 2023, 04:54:47 PM",
      "body": "Quote from: 1miau on September 30, 2023, 03:47:34 PM A good HODLer stays cool even in case of losses. Best we can do is to move our valuable Bitcoin somewhere where it has a high resistance of being sold. A good HODLer believes even if the price of bitcoin drops their is no permanent loss in his investment because the price of bitcoin will come up even if it goes down.  A true HODLer does not get intimidated by volatility of the market no matter how the price falls their will still be increase by the time he waits for the market volatility to increase again.  Real hodler are not scared of losses, they do not panic of volatility, so patiently waiting for the bull market,  they always succeed because they throughly understand bitcoin market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "September 30, 2023, 05:04:42 PM",
      "body": "In my humble opinion, as a self-proclaimed Bitcoiner, HODL means \"no return back\". When you HODL, you expect that the rest of the populace will follow on a Bitcoin standard, sooner or later. HODLing isn't to merely keep a bitcoin for a couple of years, just to sell it back for fiat (which is considered long-term for many). I don't want to be called a toxic maxi, but it's just the way it is. If you don't think the people will treat Bitcoin seriously, then you don't either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "September 30, 2023, 05:09:14 PM",
      "body": "Quote from: 1miau on September 30, 2023, 03:47:34 PM...After all, it's a very important lesson to know that HODL is purely a mental challenge. If you want to HODL correctly, you should know and pay attention to all points mentioned above.  If you are a Hodler, have you determined the price for yourself when you will sell your Bitcoins, or does hodl not involve selling coins at all? And from my experience, I can add that Bitcoins are most often lost when you try to increase their number with the help of trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Liliana1304",
      "created_time": "September 30, 2023, 05:25:31 PM",
      "body": "It takes a lot of courage to hodl in the face of Bitcoin price going up and down and I won't blame those who cave in when things get hard because as the Op clearly stated, there's just so much the mind can take, but I feel it's more blessed and rewarding to hodl than to sell . The expectations most bitcoiners have of the event of the Bitcoin halving is to me enough reason to continue hodling.The prices of Bitcoin and other cryptocurrencies are very volatile but the best approach to raking in more profits is when you don't panic and sell just because you feel the market is crashing. To me panic sell defeats the purpose of hodling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "September 30, 2023, 05:40:17 PM",
      "body": "Quote from: 1miau on September 30, 2023, 03:47:34 PMHODL only required to transfer our coins on very rare occasions (if at all), which minimizes transferring or storage errors. You are right, but HODLers are also very careful with their recovery seeds cause if we don't use it more often then chances of losing it also high so it is important to keep the recovery seeds in physical form and somewhere secure. Quote from: 1miau on September 30, 2023, 03:47:34 PMA good HODLer can resist any temptation to make (small) profits prematurely and a good HODLer keeps his Bitcoin. A good HODLer stays cool even in case of losses. Best we can do is to move our valuable Bitcoin somewhere where it has a high resistance of being sold.We didn't lose anything until we sold the assets which may be really hard to understand for someone who is new to the investment but once they get used to it I mean at least a cycle then they will realize what they can potentially make at the bear run if they are prepared to accumulate more coins at the highest possible discounted price.Quote from: 1miau on September 30, 2023, 03:47:34 PMAfter all, it's a very important lesson to know that HODL is purely a mental challenge. If you want to HODL correctly, you should know and pay attention to all points mentioned above.  Anything related to money is just a game of our emotions so one who knows how to control it when the market goes other ways will succeed more than those who will react to everything and fall for the traps of whale's traps.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "September 30, 2023, 05:43:32 PM",
      "body": "Quote from: 1miau on September 30, 2023, 03:47:34 PMAfter all, it's a very important lesson to know that HODL is purely a mental challenge.It is a strong mental challenge where a holder who is not mentally strong will fail to keep holding because there always will be temptations or fears that can make a holder stop holding. Investors in bitcoins with poor mental strength will have to work hard to improve their mental strength if they have the plan to hold their bitcoins for long. But what I need to ask is, how long should I keep holding to show my mental strength? It should be until I get to my target right? or do we just keep holding and holding? because of not wanting to sell early to make better profit. Bitcoin value will keep increasing, so when is the right time?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odohu",
      "created_time": "September 30, 2023, 06:14:33 PM",
      "body": "Quote from: komisariatku on September 30, 2023, 04:49:39 PMHODL is all about mental, I totally agree.The temptation to HODL bitcoin when the price is falling is whether we will continue to hold it and wait for the price to rise again? How long? or do we cut lose?The temptation to HODL Bitcoin when the price goes up, do we keep holding it until the price is even higher? or will it go down again? we are confused about what price to sell, too early we will regret it, too long the price can drop againI think the temptation to HODL when price is rising is far higher than when price is falling. I don't know if others experience that as well but personally, seeing my portfolio in profits of multiple of my investment could be so tempting to sell and take profits. It takes a great deal of courage and faith to hodl and not sell at this point. On the other hand when is falling, people rarely sell except some panic sellers or big playings that will dump the price so they buy cheaper. There is even this popular saying that  \"you only loose when you sell\"Quote from: komisariatku on September 30, 2023, 04:49:39 PMSo HODLing bitcoin is about mental strength, long-term goals and good financial condition. Without it, I doubt I would be able to HODLIndeed a great deal of mental preparedness is needed to HODL Bitcoin in both bull and bear market but in all, the level of faith and believe in Bitcoin is what will guide our decision.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woodie",
      "created_time": "September 30, 2023, 06:45:57 PM",
      "body": "Honestly hodling was so much easy for the first generation investors as it was easy to buy  a whole Bitcoin for say $10, $50 or $200 or perhaps anything less than $1000 without having a mental challenge to forget about these coins for a while...But with prices playing around 27,000 dollar's today, tbh you can't just buy such an asset and choose to forget about it because this will always be in your back of your head reminding you to always check and see if you can take any small profits and walk away ...otherwise to hodl=big boy/whale's games atm(mental challenge), better yet holding is for the financially disciplined Quote from: Odohu on September 30, 2023, 06:14:33 PMQuote from: komisariatku on September 30, 2023, 04:49:39 PMSo HODLing bitcoin is about mental strength, long-term goals and good financial condition. Without it, I doubt I would be able to HODLIndeed a great deal of mental preparedness is needed to HODL Bitcoin in both bull and bear market but in all, the level of faith and believe in Bitcoin is what will guide our decision.  mental strength comes easy when you are also financially stable not having to think about your stash..or coins you hodling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "September 30, 2023, 06:55:49 PM",
      "body": "Investing in itself is a mental challenge. Like, even the best stock/asset picker can perform really badly when he/she's not mentally ready for actual 'investing' a.k.a. long-term holding. Like, even me myself — I'd be far better off financial today if I just held everything and never sold since the first time I held BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "September 30, 2023, 07:16:12 PM",
      "body": "Most of us made some mistakes with bitcoin. Over the years I've learned that we grow into hodling. It's very rare for someone to be a hodler from the start as most people come here get either hit by early euphoria or fear, depending on what part of the cycle they face right after buying their first bitcoin. In my case we were in a post GOX bear market with bitcoin at -70% from its ATH, so obviously I thought bitcoin was cheap ($400) and it was a great idea to buy some. Next thing, it was down 40% and I was literally sick. Yea, I couldn't sleep, was waking up early in the morning every day to see the charts and seeing the price was making me depressed. I didn't sell. I felt so bad that I told myself - go ahead kill me now. If my investment's destiny is to keep going to 0, so be it. A year later it was at $500 and I was up on my money, which is when I became more relaxed about all of it, but it did not stop me from taking profit all the way up to 20k, which I now regret, but it was different times. Good luck with HODLing!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goxcraft",
      "created_time": "September 30, 2023, 07:24:51 PM",
      "body": "It's not only a mental challenge but also a fight with yourself. It takes so much patience to HOLD. I have seen many give up in the middle or sell BTC for small profits, sometimes to avoid loosing all fund. I knew a person who had a lot of assets in different crypto currency, mostly BTC. He was doing well, everything seemed fine. Then suddenly, one day the whole market crashed. (I don't remember the year). He also lost 70% of his whole funds. You know how BTC works! When BTC goes down it takes others with it. As a result, all the other cryoto he had or holding or investing also went from green to red. It was the worst year for him. Later he cashed out the remaining 30% of his fund, in fear of loosing everything. For me, I think we shouldn't just focus in one place when finance is involved. Rather our investments should be wide spreaded like in real state, property, stocks, crypto etc. That way the risk of loosing everything at a same time decreases rapidly. Of course, you have to knowledgable in these sectors or you won't able to survive. When it comes to BTC, it's not like any other shitcoins which comes for some months and then disappeares. But still I would consider plan B, plan C... That way I won't have to rely on only one person.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "September 30, 2023, 07:33:31 PM",
      "body": "Quote from: BlackHatCoiner on September 30, 2023, 05:04:42 PMIn my humble opinion, as a self-proclaimed Bitcoiner, HODL means \"no return back\". When you HODL, you expect that the rest of the populace will follow on a Bitcoin standard, sooner or later. HODLing isn't to merely keep a bitcoin for a couple of years, just to sell it back for fiat (which is considered long-term for many). I don't want to be called a toxic maxi, but it's just the way it is. If you don't think the people will treat Bitcoin seriously, then you don't either. Hmm, do agree with it that it's a one-way, believe it or not. 80% of the Bitcoiners who really consider themselves as Bitcoin Hodlers are just money seekers who are waiting for a good exit, whenever the circumstances suit them they will, all the way to that exit point they will show others that they hate fiat, they want to get rid of this system they want freedom and blah blah they don't care because they want to approach some of their luxuries with a shortcut ride on the BTC.I also consider myself in this same category but I do agree that I'm with the constant vision I can be a good Hodler, I do realize that my experiences will push me to be a good Hodler. Trying to get over my emotions (Short tempered Greed).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "September 30, 2023, 07:53:43 PM",
      "body": "Quote from: 1miau on September 30, 2023, 03:47:34 PMAfter all, it's a very important lesson to know that HODL is purely a mental challenge. If you want to HODL correctly, you should know and pay attention to all points mentioned above.  I believe almost every aspect of the Bitcoin investment is purely a mental challenge and the last time I checked 95% of all BTC investors and holders barely have enough sleep ever since they joined the market.One of the ways to resist selling early for a small profit or in the case of emergency financial need as a good HODLER is to lock the BTC way for some years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bobrox",
      "created_time": "September 30, 2023, 08:13:33 PM",
      "body": "Have difference spell or meaning between HOLD or HODL? which one both words are trues, I don't think about mentality challenge when holding inside bitcoin or another coins assets depend with how urgent for taking profit and less get risk if later price drop drastically. I don't agree with holding is about mentality challenge because taking profit early how to make maximize for losing in the future, can't make stable on higher price always and moment for dump is waiting for us and take profit early than prefer for holding is not true all mental challenge. More technical and manage less risk when taking profit early although in the next time have possibility with price will up or down.Not bad ideas with holding and good luck for all holder.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "September 30, 2023, 08:48:30 PM",
      "body": "Quote from: Bobrox on September 30, 2023, 08:13:33 PMHave difference spell or meaning between HOLD or HODL? Not sure though if you are aware of the origin of that word? If not then here is it, I AM HODLINGQuote from: 1miau on September 30, 2023, 03:47:34 PMAfter all, it's a very important lesson to know that HODL is purely a mental challenge. If you want to HODL correctly, you should know and pay attention to all points mentioned above.  True, and I will say that the pandemic really thought me a lesson about holding. I mean you are just alone and can't get out, so that's already a mental challenge. But then again, you have a lot of time to think about your bitcoin investment and so with the pandemic, I was able to hold for so months or even years and accumulate decent to good amount of BTC. So it's very hard if you look at it on paper, but I can attest that anyone can do it and HODL for a long time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "September 30, 2023, 08:52:08 PM",
      "body": "Quote from: tvplus006 on September 30, 2023, 05:09:14 PMQuote from: 1miau on September 30, 2023, 03:47:34 PM...After all, it's a very important lesson to know that HODL is purely a mental challenge. If you want to HODL correctly, you should know and pay attention to all points mentioned above.  If you are a Hodler, have you determined the price for yourself when you will sell your Bitcoins, or does hodl not involve selling coins at all? It's a difficult question but I wouldn't say HODL involves selling coins necessarily. Some people buy Bitcoins for HODL and don't sell, some people sell after some time. I believe, HODL doesn't has any fixed amount of time. But maybe at least 4 years for each halving cycle? It's up to every HODLer. HODLer's just sell (or don't sell) after an undefined amount of time. Quote from: Stepstowealth on September 30, 2023, 05:43:32 PMQuote from: 1miau on September 30, 2023, 03:47:34 PMAfter all, it's a very important lesson to know that HODL is purely a mental challenge.But what I need to ask is, how long should I keep holding to show my mental strength? It should be until I get to my target right? or do we just keep holding and holding? because of not wanting to sell early to make better profit. Bitcoin value will keep increasing, so when is the right time?You can HODL as long as you want to HODL. And about a certain target: it depends on every HODLer. Personally, I don't have any target for HODL, just a veeery long time. But to consider it \"HODL\" I would say, a HODLer needs to hold at least 4 years, which is 1 halving cycle.  It's up to every HODLer.  Quote from: Bobrox on September 30, 2023, 08:13:33 PMHave difference spell or meaning between HOLD or HODL? HODL is based on a Bitcointalk post, where OP misspelled HOLD: https://bitcointalk.org/index.php?topic=375643.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}