{
  "id": "topic_5477185",
  "title": "BitcoinTay",
  "author": "BitcoinTay",
  "created_time": "December 09, 2023, 03:49:45 PM",
  "content": "Hi bitcointalk, I have been trying to send my bitcoins from my trust wallet but I keep getting an error message. Something about dust UXTO error. This is the first time I'm encountering this problem. I suspected it had something to do with the hike in fees so I reduced the amount but I still get the same result. How do you fix this? Has my wallet been compromised?https://ibb.co/nCrHv03",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477185",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "December 09, 2023, 03:50:37 PM",
      "body": "No, your wallet hasn't been compromised. It depends on what you're trying to do, but I usually just decrease the amount I'm trying to send by a little bit, and it goes through just fine. There are multiple reasons on why you're seeing the error though:https://community.trustwallet.com/t/unable-to-send-due-to-dust-error/1188",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Orpichukwu",
      "created_time": "December 09, 2023, 03:54:31 PM",
      "body": "To start with, trust wallet is not a safe wallet to use. Second, secondly this is the issue that trust wallet users have been complaining about, which I have come across a few times now in this forum, and one of my friends was also affected. The issue could be as a result of you either using a low transaction fee to send out your funds to another wallet, or the transaction can still be unconfirmed in the blockchain. I will advise you to move your wallet to a more friendly one, like BlueWallet or Ethereum. You might be exposing your seed phrase to two different wallets, but you're better off. Just try importing your wallet to BlueWallet or Electrum and making your transaction through any of those wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Churchillvv",
      "created_time": "December 09, 2023, 04:00:47 PM",
      "body": "It could also be as a result of sending the maximum amount in your wallet while using the default transaction fee. Which can't go through because the transaction fee is higher than what is left in the wallet so it will show error when the transaction fee can't be afforded due to low balance. Or sometimes you can be sending small amount with the default transaction fee which is still very high hence probably impossible to send. You can read through the link provided by @OmegaStarScream it will be more clear to you with image description in that link. Mind you it's a frequent case in trust wallet you're not compromised.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "December 09, 2023, 04:13:19 PM",
      "body": "Quote from: Orpichukwu on December 09, 2023, 03:54:31 PM The issue could be as a result of you either using a low transaction fee to send out your funds to another wallet, or the transaction can still be unconfirmed in the blockchain. I will advise you to move your wallet to a more friendly one, like BlueWallet or Ethereum. You might be exposing your seed phrase to two different wallets, but you're better off.This is not entirely true, because trustwallet it self gives you the highest priority fees and as such it can’t be a as a result of low fees paid if not this won’t be the error. The error is as a result of the transaction fee + the amount he intended to send been more than the total amount in the wallet. He has more than a single UTXOs and the amount left after his intended amount to send wouldn’t be enough to cover for the fees. He should recalculate the total the fees and then reduce the amount to send to cover for the transaction fees",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "December 09, 2023, 04:19:29 PM",
      "body": "Import your seed phrase on Electum tomseldn your coins.If you are not still able to spend your coins. Click on view -> check ✔️ coins. On the GUI, click on coins -> right click and freeze the UTXOs that are very small to spend from before making transaction. Or select to spend on the UTXOs which are not dust and use them to make a transaction.If you are using a mobile phone. Download Bluewallet. Import the sed phrase. Click on the wallet which is in blue, click on send -> the three dots at the upper right corner -> coin control. You can select UTXOs which are not dust to spend from.If you want to be using open source wallet and leave close source Trustwallet, better to generate another seed phrase , keys and addresses on the open source wallet instead of using the imported seed phrase which is generated on a close source wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "December 09, 2023, 04:46:14 PM",
      "body": "Quote from: BitcoinTay on December 09, 2023, 03:49:45 PMHow do you fix this? Has my wallet been compromised?https://ibb.co/nCrHv03You can use the coin control feature by importing the wallet into Electrum desktop or blue wallet for smartphone but if you want a fix without importing the wallet then here it is.Send what is possible using Max Amount, with default fee setting. This will leave the small UTXOs, but send out the non-dust ones.Unable to Send due to Dust ErrorIf you still, can't then your wallet balance is only filled with dust UTXOs that can't be sent at the current fee rate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinTay",
      "created_time": "December 09, 2023, 05:42:26 PM",
      "body": "Quote from: OmegaStarScream on December 09, 2023, 03:50:37 PMNo, your wallet hasn't been compromised. It depends on what you're trying to do, but I usually just decrease the amount I'm trying to send by a little bit, and it goes through just fine. There are multiple reasons on why you're seeing the error though:https://community.trustwallet.com/t/unable-to-send-due-to-dust-error/1188Thank God it hasn't. I have other cryptos in that wallet, it would be devastating if it was compromised. I quoted this part of the article you provided, from what I understand here it's possible that the bitcoins I have in my custody may just be impossible to spend. QuoteWith Bitcoin (BTC) 5.0k and other so-called UTXO-based coins, small amounts of UTXOs can accumulate (as the result of change from earlier sent payments), which, combined with higher fees, may result in a portion of balance impossible to spend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Orpichukwu",
      "created_time": "December 09, 2023, 07:21:45 PM",
      "body": "Quote from: Zaguru12 on December 09, 2023, 04:13:19 PMThis is not entirely true, because trustwallet it self gives you the highest priority fees and as such it can’t be a as a result of low fees paid if not this won’t be the error. The error is as a result of the transaction fee + the amount he intended to send been more than the total amount in the wallet. He has more than a single UTXOs and the amount left after his intended amount to send wouldn’t be enough to cover for the fees. He should recalculate the total the fees and then reduce the amount to send to cover for the transaction fees If this is the case, trust wallet won't even allow you to proceed to the sending page, as they will warn you of being low in balance, and the send page won't even be clickable. This UTXO error usually shows when the user has already clicked on send, which is when the error is now displayed.Quote from: BitcoinTay on December 09, 2023, 05:42:26 PMfrom what I understand here it's possible that the bitcoins I have in my custody may just be impossible to spend. From what I understand from what was said by the first member who commented, you can still spend those bitcoins you have there, but all you need to do is reduce the amount that you are trying to send all at once. Just reduce it and try it out again until it finally goes through. Instead of using the maximum, try using custom and reducing the value you add.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "December 09, 2023, 08:16:53 PMLast edit: December 09, 2023, 11:07:09 PM by hosseinimr93",
      "body": "Quote from: BitcoinTay on December 09, 2023, 05:42:26 PMI quoted this part of the article you provided, from what I understand here it's possible that the bitcoins I have in my custody may just be impossible to spend. What said in that article is wrong.Any UTXO you have is spendable, however sometimes it's not worth it to spend them.If trustwallet doesn't allow you to spend a UTXO, it doesn't mean that's not spendable. You can import your key to another wallet and spend them.Assume that you have received two bitcoin transactions. In one of them you received 0.01 BTC and in the other one you received 0.00001 BTC.Now you have two UTXOs. UTXO A is worth 0.01 BTC and UTXO B is worth 0.00001. You are going to make a bitcoin transaction with the fee rate of 50 sat/vbyte sending the fund to a single address. If you make a transaction using UTXO A and without using UTXO B, your transaction fee would be around 5600 satoshi.If you add UTXO B to your transaction, the fee would increase to around 8900 satoshi. This means that if you add UTXO B to your transaction, you increase the fee by 3300 satoshi, while UTXO B is worth only 1000 satoshi. So, it's not worth it to spend UTXO B now and for spending that, you should wait until fees decrease. This doesn't mean you can't spend UTXO B now.You should get dust error when your transaction creates an output worth less than the dust limit.The dust limit is 546 satoshi for legacy addresses and 294 satoshi for native segwit addresses.Don't use turstwallet and go for a trustworthy open-source wallet that supports coin control.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinTay",
      "created_time": "December 10, 2023, 12:26:07 AM",
      "body": "Quote from: hosseinimr93 on December 09, 2023, 08:16:53 PMWhat said in that article is wrong.Any UTXO you have is spendable, however sometimes it's not worth it to spend them.If trustwallet doesn't allow you to spend a UTXO, it doesn't mean that's not spendable. You can import your key to another wallet and spend them.Assume that you have received two bitcoin transactions. In one of them you received 0.01 BTC and in the other one you received 0.00001 BTC.Now you have two UTXOs. UTXO A is worth 0.01 BTC and UTXO B is worth 0.00001. You are going to make a bitcoin transaction with the fee rate of 50 sat/vbyte sending the fund to a single address. If you make a transaction using UTXO A and without using UTXO B, your transaction fee would be around 5600 satoshi.If you add UTXO B to your transaction, the fee would increase to around 8900 satoshi. This means that if you add UTXO B to your transaction, you increase the fee by 3300 satoshi, while UTXO B is worth only 1000 satoshi. So, it's not worth it to spend UTXO B now and for spending that, you should wait until fees decrease. This doesn't mean you can't spend UTXO B now.You should get dust error when your transaction creates an output worth less than the dust limit.The dust limit is 546 satoshi for legacy addresses and 294 satoshi for native segwit addresses.Don't use turstwallet and go for a trustworthy open-source wallet that supports coin control. Thanks for taking the time to break it down for me to understand. I'm going to import the wallet to my Electrum wallet now and see if that works. From what I have learned today, I think tbe best course of action is to wait till the fees stabilize before making any transaction.If trust wallet isn't the best wallet, which do you recommend for storing Bitcoin and also altcoins?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "December 10, 2023, 01:11:43 AM",
      "body": "Quote from: BitcoinTay on December 10, 2023, 12:26:07 AMI'm going to import the wallet to my Electrum wallet now and see if that works. With importing your wallet into electrum, you will be able to use Coin control feature. Electrum also flag transactions as RBF and that would be helpful if you have an unconfirmed transaction and you want to increase its fee. But with importing your wallet into electrum, you won't really make your wallet more secure, because you would still use the wallet that has been generated by trustwallet. Trustwallet is close-source and there is no way to know how the keys are generated.I recommend you to create a new wallet in electrum and send your fund to your new wallet. You can wait until the fees drop and then do that. Given the error you got in trustwallet, you may have several small UTXOs.If that's the case, I also recommend you to use coin control to avoid paying excessive fee and consolidate your inputs when fees are not high.The topic created by LoyceV may be helpful to you. [Dec 2023] Fees are high, wait for opportunity to Consolidate your small inputsQuote from: BitcoinTay on December 10, 2023, 12:26:07 AMIf trust wallet isn't the best wallet, which do you recommend for storing Bitcoin and also altcoins?For bitcoin, electrum is surely a good option.I am not much familiar with altcoins wallets, but I think unstoppable wallet should be a good option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "December 10, 2023, 06:01:14 AM",
      "body": "Quote from: BitcoinTay on December 09, 2023, 05:42:26 PMThank God it hasn't. I have other cryptos in that wallet, it would be devastating if it was compromised. I quoted this part of the article you provided, from what I understand here it's possible that the bitcoins I have in my custody may just be impossible to spend. QuoteWith Bitcoin (BTC) 5.0k and other so-called UTXO-based coins, small amounts of UTXOs can accumulate (as the result of change from earlier sent payments), which, combined with higher fees, may result in a portion of balance impossible to spend.Trust wallet does not contain a coin control option, which means that if you want to send from that wallet with dust error, you must go to your previous transaction history and perform a new transaction whose total inputs are equal to one of the previous transactions. For example, if in a previous transaction you received $100, you must send a new transaction that is for that amount or less.It's a useless thing, especially with the current fees, so importing your wallet into Electrum will solve this problem with more efficiently and easily (I advise you to stop using that seed after that and create a new one from your Electrum wallet).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kryptowerk",
      "created_time": "December 11, 2023, 09:51:44 AMLast edit: December 12, 2023, 03:58:36 AM by Kryptowerk",
      "body": "Quote from: Orpichukwu on December 09, 2023, 03:54:31 PMTo start with, trust wallet is not a safe wallet to use. Second, secondly this is the issue that trust wallet users have been complaining about, which I have come across a few times now in this forum, and one of my friends was also affected. The issue could be as a result of you either using a low transaction fee to send out your funds to another wallet, or the transaction can still be unconfirmed in the blockchain. I will advise you to move your wallet to a more friendly one, like BlueWallet or Ethereum. You might be exposing your seed phrase to two different wallets, but you're better off. Just try importing your wallet to BlueWallet or Electrum and making your transaction through any of those wallets.It was already stated, but I want to emphasize this, trust wallet is closed source and imho risky to use, especially for larger amounts.Not ideal but much better to store alt-coins and tokens on a trusted hardware wallet instead.And while we are at it, is there a better alternative to trust wallet? What I mean is an app for android that is ideally open-source and can handle tokens and shitcoins and all that jazz. I remember there was unstoppable wallet which turned out to be scammy, too. which seems like a good alternative (I thought there was something going on, but must have been an other non-open source wallet).See: https://walletscrutiny.com/android/io.horizontalsystems.bankwallet/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "December 11, 2023, 10:22:18 PM",
      "body": "Quote from: Kryptowerk on December 11, 2023, 09:51:44 AMAnd while we are at it, is there a better alternative to trust wallet? What I mean is an app for android that is ideally open-source and can handle tokens and shitcoins and all that jazz. I remember there was unstoppable wallet which turned out to be scammy, too.Unstoppable wallet is a better alternative to trust wallet, because it is open source and you can also extend your seed phrase with a passphrase when you use unstoppable wallet. I don't know where you got that information from, but the wallet isn't a scam, except if someone downloads a fake or phishing version of the wallet. The only downside with Unstoppable wallet is that it does not support as many coins as trust wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "December 12, 2023, 02:47:19 AM",
      "body": "Quote from: Kryptowerk on December 11, 2023, 09:51:44 AMI remember there was unstoppable wallet which turned out to be scammy, too.The only thread I can find about scammy Unstoppable wallet is from Reddit years ago, where a scammer hacked their Telegram account or whatnot. So it is not even about the app. Are you sure it is Unstoppable wallet and not another multi-currency wallet app? There are tons of them nowadays.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kryptowerk",
      "created_time": "December 12, 2023, 04:01:09 AM",
      "body": "Quote from: Z-tight on December 11, 2023, 10:22:18 PMQuote from: Kryptowerk on December 11, 2023, 09:51:44 AMAnd while we are at it, is there a better alternative to trust wallet? What I mean is an app for android that is ideally open-source and can handle tokens and shitcoins and all that jazz. I remember there was unstoppable wallet which turned out to be scammy, too.Unstoppable wallet is a better alternative to trust wallet, because it is open source and you can also extend your seed phrase with a passphrase when you use unstoppable wallet. I don't know where you got that information from, but the wallet isn't a scam, except if someone downloads a fake or phishing version of the wallet. The only downside with Unstoppable wallet is that it does not support as many coins as trust wallet.True, I just checked wallet scrutiny and it is listed as a very solid and secure one there.I was thinking about another one that stole customer funds, can't remember which one that was right now, about 10 months or so ago. But quite likely it was closed-source, not like unstoppable wallet, which is open-source.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "December 12, 2023, 12:44:58 PM",
      "body": "Quote from: Kryptowerk on December 12, 2023, 04:01:09 AMI was thinking about another one that stole customer funds, can't remember which one that was right now, about 10 months or so ago. But quite likely it was closed-source, not like unstoppable wallet, which is open-source.I am sure you are talking about Atomic wallet, am i right? Yeah, Atomic wallet was compromised many months ago and so many of their customers lost their funds, they are also a closed source wallet and so is not recommended because we cannot verify how customer's keys is generated. The wallets of so many of their customers was compromised around June this year, but Atomic wallet is yet to provide a reason or explanation as to what happened, people should stay away from Atomic wallet and other closed source wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kryptowerk",
      "created_time": "December 12, 2023, 01:20:50 PM",
      "body": "Quote from: Z-tight on December 12, 2023, 12:44:58 PMQuote from: Kryptowerk on December 12, 2023, 04:01:09 AMI was thinking about another one that stole customer funds, can't remember which one that was right now, about 10 months or so ago. But quite likely it was closed-source, not like unstoppable wallet, which is open-source.I am sure you are talking about Atomic wallet, am i right? Yeah, Atomic wallet was compromised many months ago and so many of their customers lost their funds, they are also a closed source wallet and so is not recommended because we cannot verify how customer's keys is generated. The wallets of so many of their customers was compromised around June this year, but Atomic wallet is yet to provide a reason or explanation as to what happened, people should stay away from Atomic wallet and other closed source wallets.Ahhh, yes indeed, that was Atomic! Unstoppable, Trust, Atomic! So many buzzwords but I tend to mix them up.As you correctly stated, a closed source wallet is generally speaking to be avoided. Nobody can verify (look inside) what is actually happening, so it's just a massive possible attack vector for potentially stealing user funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinTay",
      "created_time": "December 12, 2023, 05:15:30 PM",
      "body": "Quote from: hugeblack on December 10, 2023, 06:01:14 AM(I advise you to stop using that seed after that and create a new one from your Electrum wallet).Thanks for the advice, I would like to move all my bitcoins to Electrum, problem is I still have altcoins in that trust wallet. I'm looking for a good wallet for storing altcoins. Thanks OmegaStarScream, hugeblack, Charles-Tim and everyone who took the time to help. I imported the wallet into Electrum and was able to regulate the gas fee (fees were still high though) and send the coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}