{
  "id": "topic_5455641",
  "title": "PytagoraZ",
  "author": "PytagoraZ",
  "created_time": "June 07, 2023, 03:13:02 PM",
  "content": "Is there a dedicated thread for beginners to learn how to use this forum and how to test post?As a beginner, it seems I need a special place, such as:1. Test creating a post2. Test make a post with special characters like (quote, color, insert code, font, etc)2. Test make a quote in the comments3. Test make multi quote in the comments4. OthersOr Archival is a theard dedicated to test posting?edit: Sorry, I misplaced this thread. I think I made on a beginner's board.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455641",
  "comments": [
    {
      "author": "Little Mouse",
      "created_time": "June 07, 2023, 03:18:33 PM",
      "body": "I can't remember if I have ever seen such a thread here. Well, I don't think it's necessary a lot because SMF was one of the easiest forum software to my knowledge. However, Steam Tyme created a video long ago and that's the only guideline I found which can help you- https://www.youtube.com/watch?v=nT5HPhO2MA8You will find some very basic guidelines there which might help you with the above queries.Edit-Here you go with Post Formatting- https://www.youtube.com/watch?v=7NHfaViknzMTrust system- https://www.youtube.com/watch?v=6tmiIYkCfs0Though I'm not sure if the trust system is old one or new one.Quote from: PytagoraZ on June 07, 2023, 03:13:02 PMOr Archival is a theard dedicated to test posting? Yeah, you can use that board for test purpose.Quoteedit: Sorry, I misplaced this thread. I think I made on a beginner's board.You can move the thread by looking at the lower left of the thread however, it's fine in Meta I think.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "June 07, 2023, 03:29:01 PM",
      "body": "Bitcointalk posting etiquetteTooic title style guideMake your topic title, post more atractiveThey are basics but you can find some more topics, guides in the first topic.Draft page is useful too : Drafts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "June 07, 2023, 04:08:20 PM",
      "body": "But why do you need a special thread or board for testing when you already have the \"Preview\" button down below which also does the same work for testing and enables you to see how the post may likely look like if eventually posted live onto the forum. Because those videos given by \"Little Mouse\" will teach you how to navigate the forum, but if you want to test, I think the \"Preview\" feature should be enough to do that if you don't mind. Thank you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "June 07, 2023, 04:10:04 PM",
      "body": "You have few thread links which can guide you well in posting related things on forum and to add on I also created one such thread long ago to help newbies who face problems.You can check it out and see how you can utilise different functions to create good topics :  Posting techniques for newbies .So hope it helps you in some ways.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "June 07, 2023, 04:20:12 PM",
      "body": "Quote from: PytagoraZ on June 07, 2023, 03:13:02 PM1. Test creating a post You just did. Not only this post, but a total of 12 posts on Bitcointalk.Quote from: PytagoraZ on June 07, 2023, 03:13:02 PM2. Test make a post with special characters like (quote, color, insert code, font, etc) It doesn't require any special knowledge. Just highlight a character, word, sentence, or complete post and click the button you want (quote, code, bold, etc.). Changing fonts and colors is not something you really need to do. Posting in multiple colors shouldn't be done in a normal forum conversation. The process is the same for everything else you used. The 'Preview' button shows you exactly how your post will look like once you hit the 'Post' button. It's also a good way to doublecheck your spelling, typos, etc. before posting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "June 07, 2023, 09:05:13 PM",
      "body": "Quote from: PytagoraZ on June 07, 2023, 03:13:02 PMOr Archival is a theard dedicated to test posting?Dear Op, i did not know that was happening in Archival Board, because i think i never opened it, just opened it and read many topics created by the title of Test, etc. So far from what i have observed, i think you are right about one thing. But i have no knowledge of that board as i said never opened it before so before posting there for testing DYOR. But i encourage you to take part in your local community because there no one will make fun of your posts, in fact, they might help you to understand things. Like when i was new to this posting mechanism (especially to quoting and multi-quoting then i stuck a lot) and my local member helped me a lot and i can see on a monthly basis when a newbie comes to this platform and make a mistake in multi-quoting (in our local thread), many members try to help him/her, so in that way, you will be contributing to your community too and getting someplace in your community while learning too about how to make all the aforementioned posts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "June 07, 2023, 09:22:39 PM",
      "body": "Op, you should read the threads that are pinned and there's an encyclopedia created by Ratimov. The thread I mentioned contains different links to a thread with different topics. Just keep doing some research until you will learn how this forum works, how to make bigh quality posts and what are the ways to contribute in the forum. You'll surely become knowledgeable in the future if you continue learning. Here's the link of the Encyclopedia     Beginners & Help Encyclopedia",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "June 07, 2023, 10:09:07 PM",
      "body": "Quote from: PytagoraZ on June 07, 2023, 03:13:02 PMIs there a dedicated thread for beginners to learn how to use this forum and how to test post?As a beginner, it seems I need a special place, such as:1. Test creating a post2. Test make a post with special characters like (quote, color, insert code, font, etc)2. Test make a quote in the comments3. Test make multi quote in the comments4. OthersThere are quite good number of threads that can navigate you with ease through the forum. Looking above I can see a few helpful threads giving out by other members for OP. But I'll like to add this two to  those already giving above. Bitcointalk posting etiquette by tranthidunghttps://bitcointalk.org/index.php?topic=5184741.msg52459430#msg52459430  just as the word etiquette implies,you can get some tips on how to behave in the forum as a member for the public good and that of yours.[Tips] Posting technique by Steamtymehttps://bitcointalk.org/index.php?topic=4667594.msg42124427#msg42124427  this second thread covers all the questions you have as you get to navigate to other threads that would be of interest to you with just a click.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uchegod-21",
      "created_time": "June 07, 2023, 11:38:04 PM",
      "body": "Quote from: PytagoraZ on June 07, 2023, 03:13:02 PMIs there a dedicated thread for beginners to learn how to use this forum and how to test post?As a beginner, it seems I need a special place, such as:1. Test creating a post2. Test make a post with special characters like (quote, color, insert code, font, etc)2. Test make a quote in the comments3. Test make multi quote in the comments4. OthersOr Archival is a theard dedicated to test posting?edit: Sorry, I misplaced this thread. I think I made on a beginner's board.If I should say, there is no problems here. If Op can figure out how to create a topic without being taught, they can figure out how to do every other things just by reading posts in the forum.This is a discussion forum and not social media. Even in social media like facobok, no one creates special place to tell you how to use facebook. It will rather be fun if you discover these things yourself without being spoon fed. That is the joy of it and evidence that you are a newbie.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PytagoraZ",
      "created_time": "June 08, 2023, 01:19:47 AM",
      "body": "Thank you to all of you. I've read some of the threads you recommended. I moved this thread to beginner & help and lock thread",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}