{
  "id": "topic_5401736",
  "title": "au122",
  "author": "au122",
  "created_time": "June 07, 2022, 09:13:29 PMLast edit: June 08, 2022, 09:19:41 AM by au122",
  "content": "I placed a 40,000 TRX bet on Kosovo to win against Cyprus in the UEFA Nations League (the bet was made three days before the match). This bet won and after that they don't want to pay me the money.Screenshot of bet history:https://imgur.com/hxg1VQgScreenshots of correspondence with the support:https://imgur.com/43nbvNRhttps://imgur.com/fW6JC1thttps://imgur.com/5uwLyVoScam website: https://www.wink.org",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401736",
  "comments": [
    {
      "author": "JeromeTash",
      "created_time": "June 07, 2022, 09:39:04 PMLast edit: May 14, 2023, 03:50:56 PM by JeromeTash",
      "body": "What is wrong with the screenshots you just posted? I am not seeing any single imageThis is all I seeUse image hosting site like imgur and post some proofs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "June 07, 2022, 09:58:18 PM",
      "body": "yes, do use  imgur  to host your images.@OP, are you a long time player of this casino? the problem here is that they don't have thread in the forum as far as i know. so asking help would be hard. but this will be a warning to possible players that will use this site.it is a new site based from the details on their webpage but they have curacao license. don't know if that's legit. next time, better use known and reputable casinos, with respective threads you can find in the forum. you can very well try the casino that im wearing. i don't think you will have problem with your withdrawals here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "au122",
      "created_time": "June 08, 2022, 09:22:11 AM",
      "body": "I have changed the links to the images.I didn't play at this casino for long, let this thread be a warning to new players.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "June 08, 2022, 06:07:20 PM",
      "body": "why not try and contact Betby? sure it might be frustrating that they are redirecting you to other people but it wouldn't hurt to try if it meant having a chance of being whitelisted and being able to withdraw your 91k TRX. anyway, just curious, how did you come across that gambling site? it is my first time hearing about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "June 11, 2022, 09:59:11 PM",
      "body": "This is why I hate some of these casinos. They don't even specify which terms and conditions someone violated. They should be able to give you information about that and at what time it happened.I have seen a couple of unresolved complaints about them in the forum on carrying out a search. It's looks like it's their habit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "June 11, 2022, 11:48:29 PM",
      "body": "What I don't understand is why wink.org support agent asked him to contact betby as they are the one who blacklisted his account, then in the next email they told him that it's them (wink.org) who blocked the account and their decision is final!I think it was betby which detected the fraudulent activity and informed Wink about it.btw, it looks like betby is the sportsbook provider fork Wink.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "June 12, 2022, 02:31:13 PM",
      "body": "I have seen several users complaining about the WINK.ORG gambling site, you may be the umpteenth user who has had problems with wink.org.For example: Scammed by wink.org! Proofs here.Quote from: Easteregg69 on August 07, 2020, 06:12:12 AMRigged mafia ponzi scam. Users struck by Stockholms Syndrome.It looks like your 91,000 TRX win was in vain, it is very likely that your victory was just a myth, along with the proliferation of gambling sites lately, for that if you want to play gambling, especially sites that have ads on this forum, please check their reputation first, to prevent things that are not wanted, information before registering and playing on gambling sites in my opinion is very important at this time, because many scam sites are currently operating on the internet.Op, for the future, search and choose a responsible gambling site, if you want to bet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "au122",
      "created_time": "June 16, 2022, 09:57:21 AM",
      "body": "I tried to contact BetBy about a week ago but didn't get any response.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "June 16, 2022, 08:35:42 PMLast edit: May 14, 2023, 03:49:25 PM by JeromeTash",
      "body": "Quote from: au122 on June 16, 2022, 09:57:21 AMI tried to contact BetBy about a week ago but didn't get any response.Have you checked the response they made on your trustpilot review?They claim you were multi accounting, but you can try disputing the claim through their support? What's your say on this?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "June 16, 2022, 09:57:30 PM",
      "body": "Quote from: JeromeTash on June 16, 2022, 08:35:42 PMHave you checked the response they made on your trustpilot review?They claim you were multi accounting, but you can try disputing the claim through their support? When did they post this reply on trustpilot? Am asking because, according to screenshots on OP, In the email they sent to him more than ten days ago, they said they will not process his withdrawal and that their decision is final. So, why are they asking him to raise a dispute now?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "June 16, 2022, 10:42:35 PM",
      "body": "Quote from: khaled0111 on June 16, 2022, 09:57:30 PMWhen did they post this reply on trustpilot? Am asking because, according to screenshots on OP, In the email they sent to him more than ten days ago, they said they will not process his withdrawal and that their decision is final. So, why are they asking him to raise a dispute now? The response was made 16 hours ago at the time I took the screenshot. It's now showing 19 hours ago.It's also possible the person in charge of responding to Trustpilot reviews is not aware that they made a \"final decision\", perhaps that's why they are asking for the ticket number",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "June 16, 2022, 11:54:31 PM",
      "body": "Quote from: JeromeTash on June 16, 2022, 10:42:35 PMThe response was made 16 hours ago at the time I took the screenshot. It's now showing 19 hours ago.It's also possible the person in charge of responding to Trustpilot reviews is not aware that they made a \"final decision\", perhaps that's why they are asking for the ticket numberThank you for the information, it kinda confirms my suspicion. The support agent knows that the accuser's account was flagged by the sportsbook provider \"betby\" and knows the exact reason behind the flag \"multi accounting\". So, it's obvious that he is well aware of all the details of this case.My assumption is that they are trying to look friendly and willing to help since this accusation is posted publicly on a well know reviews website. Not saying they are scammers and OP didn't indeed break their ToS, though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}