{
  "id": "topic_5418904",
  "title": "dbc23",
  "author": "dbc23",
  "created_time": "October 31, 2022, 07:13:19 AMLast edit: October 31, 2022, 01:49:56 PM by dbc23",
  "content": "The era where buyers accumulated like thieves   , When price was very much affordable, I mean the era where Bitcoin was a gift from friends and well wishers. Those who bought from 2009 - 2018 are millionaires in currencies below USD for those who were patient enough to hold.  Kristoffer Koch happen to be a lucky  Norwegian student who bought 5000 bitcoins in 2009 for 27 dollars and the date his holding was announced Bitcoin price was around 2519 dollars per one coin. link hereDo we believe Bitcoin will ever make more millionaires in other currencies beside the USD even if not in the present generation maybe in a long time probably when we all have been reduced to dust and and only our good works live on. Because those who were able to eat the good days of Bitcoin were those who bought when the idea was still fresh and hot and now every single authority is standing in the way can those good old days replay for holders to have a share of what happened in the past.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418904",
  "comments": [
    {
      "author": "348Judah",
      "created_time": "October 31, 2022, 10:24:48 AM",
      "body": "What's now the actual point here, is the conclusion on early investors are lucky birds to soar high at this present dispensation or what? But know that even at this time of dip, it's never too late to start an investment since bitcoin serves both a currency and profitable investment over a time, new investors can also take this as an opportunity to buy the dip and hold, bit never expect the same price from when it started to come at this stage before tou could buy and invest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "October 31, 2022, 11:14:25 AM",
      "body": "I believe that the happiest investors are those who bought early and forgot about them or for any reason did not have access to the wallet. someone who bought a lot of bitcoin for $2 I don't believe he kept them and waited for the $60k. I'm sure that much earlier it looked like a great opportunity for cashout.therefore, I believe that the majority are from zero to hero bitcoin millionaires they actually became that by accident because they couldn't spend earlier.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "October 31, 2022, 01:01:37 PM",
      "body": "I do wonder along with this if there's going to be another one of these to come out that we'll see in the future with equally poor adoption rates to start with but an ecosystem that grows like bitcoin did - or if there's been one since. There's a chance for the opposite too and that's happened where a community has grown too big too fast and imploded either because of that or because it was planned to.I'd agree with examplens too quite a bit, for someone to hold that many coins and not look at them probably couldn't spend them for a while for some reason and probably also forgot about them. I don't know if you'd consider them crypto enthusiasts either if they bought bitcoin, forgot about them until they came back up in the news, held and then sold,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "October 31, 2022, 01:31:28 PM",
      "body": "OP you are right those who bought bitcoin at 2009 and sold at 2021, they are millionaires now. If you are buying bitcoin because of its bull market,I guess you might be disappointed because it might not just go the way you expected it. If you asked those that are millionaires through bitcoin, i.e those that bought early,they might tell you that they don't even know bitcoin price will hit $60k. Bitcoin purpose is designed at created for a decentralized system and for easy transactions between borders. People are not seeing these purpose instead they are after making profit. Bitcoin price will hit the bull market again and if you are patient with your Bitcoin Holdings,you will also might be a millionaire. People are still making profit from Bitcoin even though,it is at the bear market today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "October 31, 2022, 01:57:40 PM",
      "body": "If you are looking at it from ROI, speculation and investment, then the people that either mined BTC or bought it a few years after Satoshi mined the genesis block had the best of the network if they had the foresight and patience to wait and hold it till the latest all time high.But if you look at the network generally and the developments and implementations or additions that have been made since the genesis block till date, then you can say the network is growing and has even become better than it was in the past as many issues have been addressed, and there are even more people mining BTC now, with a higher hash rate= higher security wall.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odusko",
      "created_time": "October 31, 2022, 02:00:18 PM",
      "body": "The early birds have the juiciest one out of Bitcoin, most especially the Satoshi era forks you first discovered Bitcoin when Bitcoin was very cheap.Bitcoin has, and Bitcoin is still making many billionaires in different currencies, some traders are still getting lucky to make huge profits from trading Bitcoin since the price is very high now and less volatile, and investors are not making much compared to traders who leverage on the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "October 31, 2022, 02:25:53 PM",
      "body": "Quote from: Odusko on October 31, 2022, 02:00:18 PMThe early birds have the juiciest one out of Bitcoin, most especially the Satoshi era forks you first discovered Bitcoin when Bitcoin was very cheap.Well, what if we are also early birds? We don't know how high will bitcoin get in 10 or 15 years from now, but I would expect people will also envy then those who stacked sats in 2022 crypto winter.Pretty much similar was back then too. Just back then 1 BTC meant not much, exactly like today a couple of satoshi.Of course, the earlier one got coins, the more he got for the same fiat or effort, but that doesn't mean we can't still try to get the most of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "November 01, 2022, 11:28:09 AM",
      "body": "Quote from: dbc23 on October 31, 2022, 07:13:19 AMThose who bought from 2009 - 2018 are millionaires in currencies below USD for those who were patient enough to hold.It is not very logical to compare 2009 with the years after 2016, considering the price of Bitcoin at the very beginning, and the fact that at the end of 2016, 1 BTC was worth around $1000. The man you mention bought 5000 BTC, although I find information that mentions 5600 BTC for about $27 and of course he got rich that way, but all those who invested 5 years ago are in no better position than those who are doing it today.Quote from: dbc23 on October 31, 2022, 07:13:19 AMDo we believe Bitcoin will ever make more millionaires in other currencies beside the USD even if not in the present generation maybe in a long time probably when we all have been reduced to dust and and only our good works live on. They say that there are 61 million people in the world who are millionaires in $, and there will be even more, considering that their number is constantly increasing. Some will surely become millionaires thanks to the investment in Bitcoin they made in the past, because it is not realistic to expect that the price of BTC in the next 10 years will be x100 higher than today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woodie",
      "created_time": "November 01, 2022, 11:54:53 AM",
      "body": "Quote from: dbc23 on October 31, 2022, 07:13:19 AM Those who bought from 2009 - 2018 are millionaires in currencies below USD for those who were patient enough to hold.  The happy millionaires of bitcoin are those that bought bitcoin not as an investment but more less as a joke and could afford to buy the coins and forget about them, without the edge to check on performance of this asset on the chart. Hard to believe but for anybody buying with an intention to get profits from bitcoin, chances are high that they will be constantly checking on price and any small price gains many would have cashed out and wouldn't get anywhere near 100X ROI!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "November 01, 2022, 12:59:27 PM",
      "body": "Quote from: dbc23 on October 31, 2022, 07:13:19 AMBecause those who were able to eat the good days of Bitcoin were those who bought when the idea was still fresh and hot and now every single authority is standing in the way can those good old days replay for holders to have a share of what happened in the past.not the past to be repeated. but make a new history for the new generations to talk about in the future.Don't you also think, how will people who sold their bitcoins in 2018 and 2019, see the new ATH being earned in the Bitcoin market?I always believe, in every period there are good times and bad. no need to regret why we missed opportunities in the past. believe that the future will also be brighter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Laurendaldin",
      "created_time": "November 11, 2022, 08:27:19 PM",
      "body": "At all times, those who were the first to believe and invest money in the project, as a result, have great dividends if they are patient and do not lose trust. But no one can really say when these \"firsts\" will end. Yes, bitcoin already has considerable weight in the world of cryptocurrencies, but who knows what awaits us next? Perhaps, people will one day talk about us as the first ones.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Igebotz",
      "created_time": "November 11, 2022, 10:04:42 PM",
      "body": "Quote from: examplens on October 31, 2022, 11:14:25 AMI believe that the happiest investors are those who bought early and forgot about them or for any reason did not have access to the wallet. someone who bought a lot of bitcoin for $2 I don't believe he kept them and waited for the $60k. I'm sure that much earlier it looked like a great opportunity for cashout.therefore, I believe that the majority are from zero to hero bitcoin millionaires they actually became that by accident because they couldn't spend earlier.you are correct Those who hodl for too long have a story of lost access, which they later recovered after so many years and found theirselves in fortunes. I'm sure those who bought at $21 would be tempted to sell at a profit of $200 or $500, but only a few people who bought in large quantities and understood how the blockchain worked were able to keep some for a long time. Those who invested $2000 @65k a year ago are still down -80%, with little hope of recovering. The only time I made x700 was on an airdrop coin in 2017, after I luckily discovered my missing ether keys while going through old books. 90% crypto millionaires made it through missing key or one story",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "November 12, 2022, 01:50:35 PM",
      "body": "Quote from: igehhh on November 11, 2022, 10:04:42 PMThose who invested $2000 @65k a year ago are still down -80%, with little hope of recovering.I remember being tempted to buy some fraction at that time where every coin was in green and I felt it was already at the high with the experience of 2017. However those that bought at $65k only have to be patient, their order will full on day  Quote from: igehhh on November 11, 2022, 10:04:42 PM The only time I made x700 was on an airdrop coin in 2017, after I luckily discovered my missing ether keys while going through old books. 90% crypto millionaires made it through missing key or one story Seriously I agree with you in saying that a hodler will be tempted to sell at those high price if seeing the margin of profit but because they have lost the keys or couldn't find it at the time. I have had the same experience like you. So I don't really believe that there are original hodlers of bitcoin from the bizza age of bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Laurendaldin",
      "created_time": "November 21, 2022, 09:26:09 AM",
      "body": "Quote from: igehhh on November 11, 2022, 10:04:42 PMQuote from: examplens on October 31, 2022, 11:14:25 AMI believe that the happiest investors are those who bought early and forgot about them or for any reason did not have access to the wallet. someone who bought a lot of bitcoin for $2 I don't believe he kept them and waited for the $60k. I'm sure that much earlier it looked like a great opportunity for cashout.therefore, I believe that the majority are from zero to hero bitcoin millionaires they actually became that by accident because they couldn't spend earlier.you are correct Those who hodl for too long have a story of lost access, which they later recovered after so many years and found theirselves in fortunes. I'm sure those who bought at $21 would be tempted to sell at a profit of $200 or $500, but only a few people who bought in large quantities and understood how the blockchain worked were able to keep some for a long time. Those who invested $2000 @65k a year ago are still down -80%, with little hope of recovering. The only time I made x700 was on an airdrop coin in 2017, after I luckily discovered my missing ether keys while going through old books. 90% crypto millionaires made it through missing key or one story And what is it like for those who have not restored access to their wallets? I can't even imagine what it's like to realize that somewhere out there you have a fortune. Money that will cover all your needs will change your life... But there is no chance of getting them. A modern nightmare.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Igebotz",
      "created_time": "November 21, 2022, 09:39:59 AM",
      "body": "Quote from: Laurendaldin on November 21, 2022, 09:26:09 AMQuote from: igehhh on November 11, 2022, 10:04:42 PMyou are correct Those who hodl for too long have a story of lost access, which they later recovered after so many years and found theirselves in fortunes. I'm sure those who bought at $21 would be tempted to sell at a profit of $200 or $500, but only a few people who bought in large quantities and understood how the blockchain worked were able to keep some for a long time. Those who invested $2000 @65k a year ago are still down -80%, with little hope of recovering. The only time I made x700 was on an airdrop coin in 2017, after I luckily discovered my missing ether keys while going through old books. 90% crypto millionaires made it through missing key or one story And what is it like for those who have not restored access to their wallets? I can't even imagine what it's like to realize that somewhere out there you have a fortune. Money that will cover all your needs will change your life... But there is no chance of getting them. A modern nightmare.A story about British James Howell, who threw away his hard drive containing 7500 BTC in 2013 and has since used every possible means to search for the hard drive, including using robot dogs and human robots. He has spent millions of dollars on the endeavor. James Howell is a perfect example of a modern nightmare.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "November 21, 2022, 02:04:19 PM",
      "body": "Quote from: igehhh on November 21, 2022, 09:39:59 AMA story about British James Howell, who threw away his hard drive containing 7500 BTC in 2013 and has since used every possible means to search for the hard drive, including using robot dogs and human robots. He has spent millions of dollars on the endeavor. James Howell is a perfect example of a modern nightmare.What this guy is doing is crazy. But to believe that your money is somewhere out there is sadomasochism. He dug through a bunch of garbage, but he was left with nothing. I think he should have just felt sorry for his mental health.Many of us have probably lost something in our lives that we deeply regret. It all depends on the person; someone will say \"to hell with him\" and live on, and someone else will spend their money on searching, getting into an even bigger ass.By the way, everyone who wants to grieve can also start crying, since the knowledge that you could buy bitcoin at the very beginning is tantamount to losing James Howells.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Igebotz",
      "created_time": "November 21, 2022, 02:40:41 PM",
      "body": "Quote from: lovesmayfamilis on November 21, 2022, 02:04:19 PMQuote from: igehhh on November 21, 2022, 09:39:59 AMA story about British James Howell, who threw away his hard drive containing 7500 BTC in 2013 and has since used every possible means to search for the hard drive, including using robot dogs and human robots. He has spent millions of dollars on the endeavor. James Howell is a perfect example of a modern nightmare.What this guy is doing is crazy. But to believe that your money is somewhere out there is sadomasochism. He dug through a bunch of garbage, but he was left with nothing. I think he should have just felt sorry for his mental health.Many of us have probably lost something in our lives that we deeply regret. It all depends on the person; someone will say \"to hell with him\" and live on, and someone else will spend their money on searching, getting into an even bigger ass.By the way, everyone who wants to grieve can also start crying, since the knowledge that you could buy bitcoin at the very beginning is tantamount to losing James Howells.This may sound crazy to anyone, but knowing you have $181m worth of BTC in some gabarge out there would drive anyone insane. However, James' case is quite different because he's fairly wealthy and could have simply moved on, but at this point I'm not sure he's after the money; instead, he's made it a life quest to keep himself occupied. He has already begun a $11 million search campaign.Is it possible to recover this hard drive if he finds it? Or he'll spend millions more looking for engineers to make it work. What a man",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "November 21, 2022, 04:18:37 PM",
      "body": "Quote from: NeuroticFish on October 31, 2022, 02:25:53 PMWell, what if we are also early birds? We don't know how high will bitcoin get in 10 or 15 years from now, but I would expect people will also envy then those who stacked sats in 2022 crypto winter.Pretty much similar was back then too. Just back then 1 BTC meant not much, exactly like today a couple of satoshi.Of course, the earlier one got coins, the more he got for the same fiat or effort, but that doesn't mean we can't still try to get the most of it.Do not forget, millions of people are already in the Cryptocurrency area, many of them are holding on to dear life with their Altcoin holdings and there are only 21 million Bitcoin that will ever get to exist.Once everyone understands Bitcoin is what they should be actually holding and we get a lot more people to buy it, imagine how much the price has to be for all 21 million Bitcoin to be distributed among dozens of millions of people.  It is very true, we are most likely still early birds.Quote from: igehhh on November 21, 2022, 02:40:41 PMIs it possible to recover this hard drive if he finds it? Or he'll spend millions more looking for engineers to make it work. What a manThis is a very big issue indeed.  You get to 'hold' on to so many Bitcoins for so long and you are looking for the Hard Drive that, chances are, either is not there anymore or is malfunctioning.  I am sure there are a few ways to recover files from even a defect Hard Drive, experts can do this even if the HDD does not work anymore as far as I know but it has been sitting for so many years already and has likely been put under insane amount of weight that might make it useless once found.Now imagine he finds his disk and the Bitcoin file is password protected.  He is spending so much money on possibly nothing, I mean he might actually have better chances winning at the lottery than finding a drive that works, is recoverable and does not have the necessary file encrypted.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "November 21, 2022, 11:41:11 PM",
      "body": "Bitcoin is as affordable today as it was in early days, because you can own tiny fractions of a coin. Which means the barrier of entry is non-existent, you can invest $5 and watch it grow into $20 during the next bull run. This is not the case with other assets like stocks, bonds, real estate, savings account, where you usually need to have at least an equivalent of thousands of dollars to make the smallest possible investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}