{
  "id": "topic_5419900",
  "title": "alertoriole",
  "author": "alertoriole",
  "created_time": "November 08, 2022, 06:18:58 AMLast edit: February 20, 2023, 05:02:59 PM by alertoriole",
  "content": "Hi, probably very unlikely to get any traction here as it seems to just be a bunch of people arguing. I am a large p2p seller and trade in cash for usdt and btc around europe and latin america, mostly mexico and colombia. If you have a history on p2p I would entertain table top deals.Generally speaking these trades would be for 50k and above. Canada is also an option, specifically toronto.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5419900",
  "comments": [
    {
      "author": "PX-Z",
      "created_time": "November 08, 2022, 06:29:31 AM",
      "body": "It's good to say that you're running a service but this is most probably suit currency exchange board[1]. You can move this thread, controls are in the lower left of this thread \"move topic\".[1] https://bitcointalk.org/index.php?board=53.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "November 08, 2022, 08:40:44 AM",
      "body": "I assume you could prove the LocalBitcoins account is yours if people asked you to, right? I am only asking about that one since it's been around for over 5 years and your account on LocalCoinSwap is relatively new.How does this work exactly? Are you and your team travelling the world wherever a deal needs to be made, or do both parties have to meet in one of a few locations you operate out of? What I am asking is could I ask your team to deal with me in Zagreb, for example, and someone would be there to meet me, or do I have to come to you?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "usdt2021x",
      "created_time": "November 11, 2022, 11:56:40 AM",
      "body": "Quote from: CardSellerN1 on November 11, 2022, 11:30:49 AMrefusing escrow = scamno need to say more.excuses for refusing escrow is pure redflagare you blind hé clear Say hé accepté localbitcoin escroW or isnt a good escroW for you?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jamespersen78",
      "created_time": "November 13, 2022, 04:07:05 PM",
      "body": "what is your commission? if you take cash and give crypto what is your commission?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MSZCoin",
      "created_time": "November 15, 2022, 04:58:19 PM",
      "body": "This guy has kalashnikov photos everywhere on his profile and accusing people of stealing money even tho he never did business with.Avoid this guy for sure another scammer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hitcher786",
      "created_time": "July 03, 2023, 09:32:57 AM",
      "body": "Quote from: alertoriole on November 08, 2022, 06:18:58 AMHi, probably very unlikely to get any traction here as it seems to just be a bunch of people arguing. I am a large p2p seller and trade in cash for usdt and btc around europe and latin america, mostly mexico and colombia. If you have a history on p2p I would entertain table top deals.Generally speaking these trades would be for 50k and above. Canada is also an option, specifically toronto.Hey bro can you check your pm please I am trying to get a hold of you on other platforms but lost you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}