{
  "id": "topic_5440469",
  "title": "JamesBorn",
  "author": "JamesBorn",
  "created_time": "February 19, 2023, 07:23:37 PM",
  "content": "Can someone throw more light on this mining of coins! I don't see result as aspected and I mostly end up with wrong mining sites. What are the necessary tools one can apply to support mining experience? Where can I get satisfying sites for mining? What and what do I need to do! Pleases assist I need fervent knowledge on mining bitcoin and a good recommended site where I can mined bitcoin.Anything to support my understanding and the necessary things involved. Please shared your good knowledge with me.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440469",
  "comments": [
    {
      "author": "decodx",
      "created_time": "February 19, 2023, 10:00:17 PM",
      "body": "Quote from: JamesBorn on February 19, 2023, 07:23:37 PMWhere can I get satisfying sites for mining? There are no legit bitcoin mining sites, particularly those that claim to offer \"cloud mining.\" Any site that does make such a claim is either a scam or not worth your time and effort.As for your other questions, I suggest you start reading and learning the basics. Did you read the sticky thread in this board?Topic: BITCOIN MINING INTRO & RULES OF THIS SUBFORUM - READ BEFORE POSTINGQuoteTL/DR Summary: - You CANNOT meaningfully mine bitcoin with your PC or laptop no matter how powerful it is. - You CANNOT meaningfully mine bitcoin with your tablet or phone no matter how powerful it is. - Mining apps for your phone or tablet that claim to mine bitcoin are almost certainly scams. - You CANNOT find software here to mine bitcoin with your PC by itself. - You MIGHT be able to do one of the above with altcoins, but such discussion goes into the altcoin mining section. - You CANNOT find or post software here to mine on other peoples' PC without their permission.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "February 19, 2023, 11:26:20 PM",
      "body": "If you search through Google the keyword \"mining of coins\" it won't tell you the right way but it will bring you to GPU mining. If you want to mine Bitcoin you just need an ASIC machine that supports SHA256 Algo and this machine doesn't need programming knowledge it is plugNplay connect it the router/internet and setup the pool config then it is ready to mine. If you are planning to mine Bitcoin this won't work on countries with high Electricity rate unless you are living on the country that has very cheap electricity rate.Please read this \"First time/Small miner reference for getting started.\" Hope this would help.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "April 21, 2023, 08:29:10 PM",
      "body": "Op people have given you some of the answers to your important question, and if you follow them you will do well. Mining is one of the area in the crypto currency ecosystem that needs a proper tutor and coaching like trading. But since you are asking about the equipment, methods and the skills. A single strike on the google would give you the answer you wanted. And the instrument needed would appear on the screen for you. So learn how to use the internet. It is not for fancy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God Of Thunder",
      "created_time": "April 26, 2023, 05:44:34 AM",
      "body": "As far as I know, you are a shit poster and you never look back at your threads. You never looked for mining and you do not have any interest to start Bitcoin mining or whatever mining. People already answered and I believe you haven't checked any of them. Still, I would answer from my knowledge. You cannot mine Bitcoin on any website. Most of the websites are scams except mining pools. To start Bitcoin Mining, You need an ASIC miner that can mine SHA-256 Algorithm. You need a computer and an internet connection to start mining. If you have all of those, you are ready to go.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "April 26, 2023, 01:50:15 PM",
      "body": "Quote from: JamesBorn on February 19, 2023, 07:23:37 PMCan someone throw more light on this mining of coins! I don't see result as aspected and I mostly end up with wrong mining sites. What are the necessary tools one can apply to support mining experience? Where can I get satisfying sites for mining? What and what do I need to do! Pleases assist I need fervent knowledge on mining bitcoin and a good recommended site where I can mined bitcoin.Anything to support my understanding and the necessary things involved. Please shared your good knowledge with me.Bitcoin mining is no longer home mining. Explore Nicehash https://www.nicehash.com/ and mining with GPUs and CPUs, although I prefer GPUs only.You will receive a reward in bitcoins or other coins that you prefer. Youtube has a lot of up-to-date information about Nicehash.This is bad advice for a beginner in the sense that beginners get used to Nicehash and do not want to think and look for more profitable mining opportunities, and only use a limited set of features of this service. But if you did not find information with its huge abundance, then this service is for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "April 26, 2023, 02:49:55 PM",
      "body": "Quote from: JamesBorn on February 19, 2023, 07:23:37 PMCan someone throw more light on this mining of coins! I don't see result as aspected and I mostly end up with wrong mining sites. What are the necessary tools one can apply to support mining experience? Where can I get satisfying sites for mining? What and what do I need to do! Pleases assist I need fervent knowledge on mining bitcoin and a good recommended site where I can mined bitcoin.Anything to support my understanding and the necessary things involved. Please shared your good knowledge with me.Mining Bitcoin is easy and simple only if you know the proper step procedure for this matter, but if you don't know and no idea on this, I am pretty sure your plan to invest on this thing will go into nothing. But like what I said if you know the guidelines I could say that you can earn bitcoin easily.        However, about your question in site for mining for mining in bitcoin, perhaps you are talking about cloudmining, well at this moment there is no legit cloudmining that can give you a profit to have bitcoin, all of them now are just a scam. So be careful",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aikidoka",
      "created_time": "April 26, 2023, 05:16:37 PM",
      "body": "Quote from: bettercrypto on April 26, 2023, 02:49:55 PMQuote from: JamesBorn on February 19, 2023, 07:23:37 PMCan someone throw more light on this mining of coins! I don't see result as aspected and I mostly end up with wrong mining sites. What are the necessary tools one can apply to support mining experience? Where can I get satisfying sites for mining? What and what do I need to do! Pleases assist I need fervent knowledge on mining bitcoin and a good recommended site where I can mined bitcoin.Anything to support my understanding and the necessary things involved. Please shared your good knowledge with me.~snip~However, about your question in site for mining for mining in bitcoin, perhaps you are talking about cloudmining, well at this moment there is no legit cloudmining that can give you a profit to have bitcoin, all of them now are just a scam. So be careful I believe that cloud mining sites are bunch scams and I wouldn't recommend investing even $1 in them. In my opinion, there are \"no legitimate\" cloud mining sites out there. They usually end up closing down or scamming their users, so I advise anyone considering investing in cloud mining to stay away from it for the love of God.If you want to mine on your own, it's possible, but mining Bitcoin is challenging with the current high difficulty which is increasing by time. You might need expensive hardware such as Antminers, and if you have access to free electricity or you don't pay much for it, it might be worth considering. Personally, I would rather buy Bitcoin with my money than invest in mining, especially for the past few years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wahyuagung26",
      "created_time": "April 27, 2023, 06:55:53 AM",
      "body": "Quote from: FP91G on April 26, 2023, 01:50:15 PMBitcoin mining is no longer home mining. Explore Nicehash https://www.nicehash.com/ and mining with GPUs and CPUs, although I prefer GPUs only.You will receive a reward in bitcoins or other coins that you prefer. Youtube has a lot of up-to-date information about Nicehash.This is bad advice for a beginner in the sense that beginners get used to Nicehash and do not want to think and look for more profitable mining opportunities, and only use a limited set of features of this service. But if you did not find information with its huge abundance, then this service is for you.Basically not all websites can be used as bitcoin mining sites, most of them are fraudulent, maybe so far the website that I think is good and has sufficient rating is Nicehash, and we recommend that website. CPU/GPU play a full role in the Nicehash mining website, but most people prefer to use ASIC rather than GPU or CPU.This ASIC is very different from the use of the CPU or GPU in our opinion, judging from the performance and producing ASIC that is superior, we think, and ASIC requires commensurate power, so because of this you have to pay attention to power and electricity costs, but it's different from the CPU or GPU, where they perform with computers or Rig Mining as well as the mining industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "April 27, 2023, 07:34:21 AM",
      "body": "Quote from: JamesBorn on February 19, 2023, 07:23:37 PMCan someone throw more light on this mining of coins! I don't see result as aspected and I mostly end up with wrong mining sites. What are the necessary tools one can apply to support mining experience? Where can I get satisfying sites for mining? What and what do I need to do! Pleases assist I need fervent knowledge on mining bitcoin and a good recommended site where I can mined bitcoin.Anything to support my understanding and the necessary things involved. Please shared your good knowledge with me.All you need to know is there : https://en.bitcoin.it/wiki/MiningOr you could just have a look on the mining section you are posting in ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "April 27, 2023, 12:07:53 PM",
      "body": "Quote from: wahyuagung26 on April 27, 2023, 06:55:53 AMQuote from: FP91G on April 26, 2023, 01:50:15 PMBitcoin mining is no longer home mining. Explore Nicehash https://www.nicehash.com/ and mining with GPUs and CPUs, although I prefer GPUs only.You will receive a reward in bitcoins or other coins that you prefer. Youtube has a lot of up-to-date information about Nicehash.This is bad advice for a beginner in the sense that beginners get used to Nicehash and do not want to think and look for more profitable mining opportunities, and only use a limited set of features of this service. But if you did not find information with its huge abundance, then this service is for you.Basically not all websites can be used as bitcoin mining sites, most of them are fraudulent, maybe so far the website that I think is good and has sufficient rating is Nicehash, and we recommend that website. CPU/GPU play a full role in the Nicehash mining website, but most people prefer to use ASIC rather than GPU or CPU.This ASIC is very different from the use of the CPU or GPU in our opinion, judging from the performance and producing ASIC that is superior, we think, and ASIC requires commensurate power, so because of this you have to pay attention to power and electricity costs, but it's different from the CPU or GPU, where they perform with computers or Rig Mining as well as the mining industry.Nicehash has been operating since 2014 and it is not a scam. I'm not afraid to link to such sites.Asics can not be used everywhere for mining due to noise and high power consumption. ASICs can be more profitable than video cards if you bought at the manufacturer’s price, but if the ASIC breaks down, it’s not a fact that it will be more profitable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panganib999",
      "created_time": "April 27, 2023, 05:27:26 PM",
      "body": "Rule of thumb, never fall for sites that promise the notion of mining bitcoins for you while you wait and do nothing, only to be charged with an apparent transaction fee once you decide that you want to cash your \"earnings\". Those sites are scams and will steal out of you, so stay away from them. That is not to say that there are no legitimate pooling sites on the internet because there are, although those will require you to contribute a computing power back to the system to help other miners earn money with you. With that being said, you need something that could compute, I recommend the dedicated ASIC miners, as those are designed to mine bitcoin solely. You can resort to GPU or CPU mining but those aren't as profitable as ASIC miners unfortunately.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "April 27, 2023, 06:13:52 PM",
      "body": "I'm actually doing lotery mining using an ESP32 an a version of NerdMiner. There is a newer version wich is NerdMinerV2 ut I couldn't compile it to run in the ESP32 I have.LinksThis is the code I'm running in my ESP32https://github.com/BitMaker-hub/ESP32_NerdMinerThe newer version is this one:https://github.com/BitMaker-hub/NerdMiner_v2",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "April 28, 2023, 03:51:59 AM",
      "body": "Well, other members already has said already, if you are still confused with the thread on here you can check youtube there is dozen of helpful videos out there. Mining machine nowadays is crazy expensive so if you want to try How mining work and setup hardware you can mine altcoin first by using your cpu/gpu so you can familiarize yourself first. 'Or buy used bitcoin mining on ebay like USB or third generation Antminer.and piece of advice stay away from cloud mining on the internet usually they are Ponzi scheme and scam in couple of weeks hahaha",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "devil2man",
      "created_time": "May 02, 2023, 06:41:01 AM",
      "body": "I mine with my pc which has a vega 11 integrated video card and a 1030 and a 1650 for now i mine bitcoins via zergpool, I'm thinking of making a rig with 4 cards but they are very expensive",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aikidoka",
      "created_time": "May 02, 2023, 02:28:39 PM",
      "body": "Quote from: devil2man on May 02, 2023, 06:41:01 AMI mine with my pc which has a vega 11 integrated video card and a 1030 and a 1650 for now i mine bitcoins via zergpool, I'm thinking of making a rig with 4 cards but they are very expensiveDo you mine BTC with those graphics cards? I'm wondering if you make any profit, because as far as I know mining BTC with those graphics cards wouldn't be profitable at all, especially since the Bitcoin network has become increasingly difficult to mine. In my opinion, mining altcoins would be more profitable for you than Bitcoin and If you want really to mine bitcoin consider getting ASIC miners would be the best option.GPUs are better suited for mining other crypto such as Ethereum, which is still profitable to mine with GPUs.Quote from: devil2man on May 02, 2023, 06:41:01 AMI'm thinking of making a rig with 4 cards but they are very expensiveIf you'll be able to get your own rig, make sure to have a decent cooling equipment in your rig so you'll keep your GPUs safe from overheating and you wouldn't harm them.good luck for mining!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "May 03, 2023, 05:47:43 AM",
      "body": "Quote from: Aikidoka on April 26, 2023, 05:16:37 PMQuote from: bettercrypto on April 26, 2023, 02:49:55 PMQuote from: JamesBorn on February 19, 2023, 07:23:37 PMCan someone throw more light on this mining of coins! I don't see result as aspected and I mostly end up with wrong mining sites. What are the necessary tools one can apply to support mining experience? Where can I get satisfying sites for mining? What and what do I need to do! Pleases assist I need fervent knowledge on mining bitcoin and a good recommended site where I can mined bitcoin.Anything to support my understanding and the necessary things involved. Please shared your good knowledge with me.~snip~However, about your question in site for mining for mining in bitcoin, perhaps you are talking about cloudmining, well at this moment there is no legit cloudmining that can give you a profit to have bitcoin, all of them now are just a scam. So be careful I believe that cloud mining sites are bunch scams and I wouldn't recommend investing even $1 in them. In my opinion, there are \"no legitimate\" cloud mining sites out there. They usually end up closing down or scamming their users, so I advise anyone considering investing in cloud mining to stay away from it for the love of God.If you want to mine on your own, it's possible, but mining Bitcoin is challenging with the current high difficulty which is increasing by time. You might need expensive hardware such as Antminers, and if you have access to free electricity or you don't pay much for it, it might be worth considering. Personally, I would rather buy Bitcoin with my money than invest in mining, especially for the past few years.I like what you said, because we all know here in the crypto industry that all communities want to have their own mining rigs, but most of them don't have the capability to avail a mining rig because of its high price.        So why should we force ourselves to do bitcoin mining if we can't afford it, but if there are other options for us to earn Bitcoin,we can buy it on the exchange and do the trading depending on us whether long term or day trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}