{
  "id": "topic_5403617",
  "title": "Myntist",
  "author": "Myntist",
  "created_time": "June 22, 2022, 12:14:26 PM",
  "content": "What is myntist?Myntist is a human-centered experience that will transform how you perceive old-school online platforms selling digital and physical goods. We want to free individuals and businesses of their financial shackles by showing you how to create wealth from the comfort of your own home, using tools you already possess. Let’s move away from the simplistic into the visionary. Myntist is the future. Our complex dcommerce marketplace allows for crytpo investments, the transfer of physical goods, non-fungible tokens (NFTs) and decentralized finance (DeFi) and we’re accessible globally! For the hustlers, entrepreneurs, flippers, fintech nerds, creatives, collectors, anyone willing to put in the work to level up to the next tier, we welcome you to financial freedom on your own terms.Who needs to know?We want to free individuals and businesses of their financial shackles by showing them how to create wealth from the comfort of their own home, using tools they already possess. For the crypto and collectibles crowd, pissed off with Amazon and Ebay, and looking for an easy to access, equitable ecosystem for their side hustle Myntist was made for you. We have an open door policy. From the entrepreneurs trying to kick start ecomm businesses, to growth-mindset retailers wanting more traction on their products, fintech nerds and anyone willing to put in the work and learning to level up to the next tier - we welcome you all to financial freedom on your own terms.WHY DO WE EXIST?The world we live in today, sometimes it feels like the system is working against you, not for you. The psychological temperature of our fast evolving economy is causing an extreme amount of stress - the cost of living is going up, overwhelm is going up, traditional education is less valuable, wages are stagnant and people are wondering how on earth they can leverage what they possess to make more money. We provide hope to people seeking new ways to generate wealth. Myntist provides an innovative, digital marketplace that gives people opportunities to make money in many interesting ways. We want to transform how people look at the assets they already have, using the selling and buying behaviours they already engage in, to leverage the digital economy and transform those items into a self-perpetuating source of passive income. Re-shaping how value is perceived our ecosystem is reliable, simple and designed with optimism and care so our users can experience true financial autonomy.Why should they care?The question is not why should they care, but why would they not care!? Myntist unlocks the potential value of the items around you, turning anything into an asset. What this means is that you’ll be able to sell something once, but continue to profit off passive income from continual kickbacks as the item circulates in the marketplace. Myntist revolutionizes the buying and selling of everyday objects, giving EVERYBODY the chance to build wealth, conquering traditional barriers of access, networks, capital, class and education. Giving freedom to everyday people to transform their financial circumstances",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403617",
  "comments": []
}