{
  "id": "topic_5465372",
  "title": "Outhue",
  "author": "Outhue",
  "created_time": "September 02, 2023, 08:49:12 AM",
  "content": "Unfortunately, the word DEFI is more like a complete joke in crypto space today, there are things I am seeing that I am not linking about crypto and the funny thing is these people think we are stupid.The most important part of crypto and blockchain to me are -Defi- P2P- PrivacyYes I don't really like anything CeFi and Centralized, but it seems these people are calling us stupid, why?How can a centralized platform that have build up its name and reputation in crypto space claim they have a decentralized feature to offer people? If they are already well known how can they successfully run decentralization? You want examples? Here we go Coinbase for example now have a swap exchange that they claimed its true decentralized, running on base, a project layer 2 from the coinbase team.Binance, another centralized exchange, offering a peer to peer service, something that should happened between two people only, even if because of successful transaction to be carried out, why centralized entity involvement? I mean if Binance was decentralized right from day one, wouldn't this be cool? This is why I think decentralization is a complete joke in crypto today, any parties can just come out and they say they offer both.It's annoying and this is why Bitcoin is different, I think nothing can really be decentralized as Bitcoin again.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465372",
  "comments": [
    {
      "author": "Solosanz",
      "created_time": "September 02, 2023, 09:15:03 AM",
      "body": "You're comparing an apple with an orange, it's not make sense.Since you talk about P2P and centralized exchange, you need to compare with decentralized exchange which is Bisq, this exchange is completely decentralized.Non custodial wallet that run full node is can be included as decentralized too.Bitcoin is obviously a decentralized cryptocurrency, it should be compared to other crypto e.g. USDT, XRP, and any other centralized cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "September 02, 2023, 09:15:18 AM",
      "body": "In just August, DeFi was exploited and resulted to over $16 million losses. What I used to read before was annually, but DeFI exploits are like almost daily and it is now monthly report  Another DEFI was known in August 27. Nearly $900000 was stolen.: https://cointelegraph.com/news/balancer-protocol-exploited-for-900k-as-defi-hacks-mount-finance-redefinedDo not worry, another DeFi exploits are coming this month. DeFi which was not even decentralized was created for hackers to enjoy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "September 02, 2023, 09:27:13 AM",
      "body": "Quote from: Outhue on September 02, 2023, 08:49:12 AMUnfortunately, the word DEFI is more like a complete joke in crypto space today, Crypto is for many a way to make money, and preferably easy money.Like many other things (I remember ICO), DEFI was used as buzz word by many, the term DEFI was misused willingly or not...(But without DEFI buzz word who would buy this or that shitcoin?)Don't go by buzz words. Take a close look and use services that really deserve your attention. And when you see the first signs of lies or fake advertising, turn away from that.Yes, it's difficult. Yes, you'll make mistakes too since there's no manual on what to do. This is how experience is gained.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "September 02, 2023, 11:21:47 AM",
      "body": "I've been saying this for years OP:Quote from: o_e_l_e_o on September 02, 2021, 07:43:28 AMDEX is a buzzword that most people don't understand. People still call LocalBitcoins a DEX just because it is peer to peer despite being completely centralized, requiring you to deposit coins to their wallets, demanding KYC, and frequently locking accounts. The exchange IDEX has DEX in the name and market themselves as the \"fastest and most secure DEX\", and yet require KYC, have control over your account, have control over the smart contracts they run, have control over which coins they list, etc.They'll market themselves as a DEX, people will lap it up and not understand the difference.This space is full of buzzwords. ICO, NFTs, DeFi, decentralized, the list goes on. There are countless exchanges out there which call themselves DEXs, call themselves decentralized, call themselves peer to peer, when they are nothing of the sort. The same holds true for shitcoins. Lots of people don't bother to check if the claims are true, and even more people don't even understand the difference, falsely believing that things like Binance P2P are either peer to peer or decentralized, when they are neither of those things. Centralized exchanges use these buzzwords for cheap marketing because there is nothing stopping them and they know people will be attracted by those buzzwords, even though they are outright lies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hopenotlate",
      "created_time": "September 02, 2023, 11:33:09 AM",
      "body": "Centralized decentralized finance (CEDEFI : wonder if should I patent this definition lol) is the correct definition for these shitty feature centralized entities provide nowadays : as already someone else said it's just marketing marketing and marketing to attract more people to their business and more money into their bottomless pockets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "September 02, 2023, 11:51:28 AM",
      "body": "If we talk about DeFi, we must mention Cryptocurrency Bridges that are very vulnerable to exploitation. Many hacks on cryptocurrency bridges and value of stolen cryptocurrencies is very big.Crypto bridge hacks: types and causesLatest, the Multichain, one of most famous crypto bridge was exploited.Multichain Protocol Experiences Mysterious Withdrawals, Suggesting Multi-Million Dollar Hack or Rug PullMultichain hacks and its consequences",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "September 02, 2023, 12:18:20 PM",
      "body": "The reason for the success of DEFI is not that it is decentralized, but rather at the time of its appearance. It appeared in a time when it was easy to get a loan and you could invest in those emerging projects that were paying good APY, and the reason that they were able to pay is that we are in up trend market, so you will find that during 2021 To 2023, lending and “de-centralized” services flourished, which for many means anonymity.They always try to promote Decentralization= \"no KYC\" which is not true.Quote from: Outhue on September 02, 2023, 08:49:12 AM-Defi- P2P- Privacyyou forgot AI coinsQuote from: Outhue on September 02, 2023, 08:49:12 AMBinance, another centralized exchange, offering a peer to peer service, something that should happened between two people only, even if because of successful transaction to be carried out, why centralized entity involvement? Binance presented itself as ALL IN ONE crypto exchange. It is looking for competitors and trying to imitate or buy them, the mistake of depositors who leave their coins there to give Binance more power.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "September 02, 2023, 12:30:16 PM",
      "body": "Here's the thing. Decentralized doesn't automatically mean it's censorship resistant and could survive a heavy nation-state attack like Bitcoin, rather, decentralized can simply just mean that there isn't one single entity controlling it — it could be multiple entities. Decentralization is not binary; it's a spectrum.When people mention \"decentralized\", people always automatically compare it to Bitcoin — which doesn't make sense because of course nothing is more decentralized than Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "September 02, 2023, 02:04:45 PM",
      "body": "Bitcoin is highly decentralized but it isn't private and with mandatory KYC on every crypto platform like exchanges, casinos etc means it is more possible to trace back the origin/owner of the address unless they took the complete way of keeping their anonymity as their priority too.About the centralized exchanges using DeFi are simply due to the market behind the hype so all they want is to make more money in anyway as possible for them its more like a clickbait title we see on the YouTube videos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "September 02, 2023, 02:15:34 PM",
      "body": "Quote from: Outhue on September 02, 2023, 08:49:12 AMBinance, another centralized exchange, offering a peer to peer service, something that should happened between two people only, even if because of successful transaction to be carried out, why centralized entity involvement? I mean if Binance was decentralized right from day one, wouldn't this be cool? This is why I think decentralization is a complete joke in crypto today, any parties can just come out and they say they offer both. This did bug me previously but then I thought that it is actually good that the P2P trades are happening under the supervision of Binance.This is because in case of disputes, Binance is there to help and the P2P experience is better when it is present on a trusted platform.I know it is not decentralized because Binance does have intervention somewhere but at least things are running smoothly that way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "internetional",
      "created_time": "September 02, 2023, 02:32:26 PM",
      "body": "In 2020, one of my friends who knew that I was interested in cryptocurrency asked me about my attitude to DeFi. I knew that DeFi stands for decentralised finances, and I was acquainted with only two such systems: Bitcoin itself and Lightning Network. I was surprised that many people don't even consider them as DeFi projects.I still think Bitcoin and Lightning are true DeFi. Bitcoin stores money, Lightning transfers it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "September 03, 2023, 09:12:55 AM",
      "body": "Quote from: _act_ on September 02, 2023, 09:15:18 AMIn just August, DeFi was exploited and resulted to over $16 million losses. What I used to read before was annually, but DeFI exploits are like almost daily and it is now monthly report  Another DEFI was known in August 27. Nearly $900000 was stolen.: https://cointelegraph.com/news/balancer-protocol-exploited-for-900k-as-defi-hacks-mount-finance-redefinedDo not worry, another DeFi exploits are coming this month. DeFi which was not even decentralized was created for hackers to enjoy.I am not protecting defi projects, the majority of them are scam, I do believe that Bitcoin is more reliable than other decentralized practitioners, they are all liars and that's why hacks are happening with DeFi, they can't be caught and they can do all they want, that's why my topic said that Bitcoin is the only true decentralized project that stands on its lane. Bitcoin protects it's investors, there is never a hack on bitcoin blockchain, but because many projects are ready to deceive the masses in the name of DeFI and Decentralization that's why some people believe them.We all want decentralization on crypto space to be more than just Bitcoin only, but the truth is I believe there won't be another.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "September 03, 2023, 11:30:44 AM",
      "body": "Quote from: Outhue on September 03, 2023, 09:12:55 AMWe all want decentralization on crypto space to be more than just Bitcoin only, but the truth is I believe there won't be another.The reason why the first thing that come in mind, mentioning cryptocurrency, is bitcoin. It provides what investors see as true decentralization. It only gets worse for any decentralized project, once centralized bodies begin to fit in the process and use it to make money. Centralized exchanges have brought multiple bad publicity on bitcoin, similar to what you're explaining about centralized bodies launching defi projects. These guys do the most marketing, and attract multiple people, who don't know much of bitcoin, to invest and they'll end up losing money to hackers. The blame goes to bitcoin, not the centralized bodies. If only the masses understand how bitcoin works, a lot of scam project will be minimized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbamoni",
      "created_time": "September 03, 2023, 12:31:43 PM",
      "body": "Quote from: Outhue on September 02, 2023, 08:49:12 AMIt's annoying and this is why Bitcoin is different, I think nothing can really be decentralized as Bitcoin again. Bitcoin had an advantage when it was just starting out. Not many people took cryptocurrencies seriously, and hardly anyone knew it even existed. This meant that Bitcoin could grow on its own, without a central authority, using a system called \"proof of work, and not having other coin in mind at that moment. No company created and launched Bitcoin unlike many altcoins, this why it will remain fully decentralized forever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Who is John Galt?",
      "created_time": "September 03, 2023, 02:47:34 PM",
      "body": "Quote from: o_e_l_e_o on September 02, 2023, 11:21:47 AMI've been saying this for years OP:Quote from: o_e_l_e_o on September 02, 2021, 07:43:28 AMDEX is a buzzword that most people don't understand. People still call LocalBitcoins a DEX just because it is peer to peer despite being completely centralized, requiring you to deposit coins to their wallets, demanding KYC, and frequently locking accounts. The exchange IDEX has DEX in the name and market themselves as the \"fastest and most secure DEX\", and yet require KYC, have control over your account, have control over the smart contracts they run, have control over which coins they list, etc.They'll market themselves as a DEX, people will lap it up and not understand the difference.This space is full of buzzwords. ICO, NFTs, DeFi, decentralized, the list goes on. There are countless exchanges out there which call themselves DEXs, call themselves decentralized, call themselves peer to peer, when they are nothing of the sort. The same holds true for shitcoins. Lots of people don't bother to check if the claims are true, and even more people don't even understand the difference, falsely believing that things like Binance P2P are either peer to peer or decentralized, when they are neither of those things. Centralized exchanges use these buzzwords for cheap marketing because there is nothing stopping them and they know people will be attracted by those buzzwords, even though they are outright lies.How to check? How to understand that some service is truly decentralized? With Bitcoin, it is clear that everyone can connect to the network and mine just like everyone else. And with other projects it is more difficult to understand. It is clear that if there is a website that offers a certain service through its own forms and databases, including the organization of p2p transactions, in fact it is still a centralized service. A decentralized project should probably work through some kind of smart contract. But how can a person who is not yet very well versed in all this understand whether he is dealing with a decentralized project or is it all disguised centralized projects?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "September 03, 2023, 02:54:10 PM",
      "body": "No way you think Coinbase is decenteralized just because it's now providing DeFi services. Coinbase allows you to connect your exchange account with your wallet and which makes it share the data of your DeFi wallet with Coinbase which completely removes any privacy or anonymity you had earlier. I prefer to use Metamask If I really want to go deep in DeFi or DApps. I would never use any wallet built by an exchange, similarly Binance has their own Trust Wallet. They named it Trust. That's a complete joke.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "September 04, 2023, 05:39:45 AM",
      "body": "Quote from: Who is John Galt? on September 03, 2023, 02:47:34 PMHow to check?Truly decentralized services are easy to identify. Instead of using the service via a centralized website like any centralized exchange, you run the service locally and connect directly to other users. Bitcoin, Bisq, and JoinMarket are some great examples.For seeing if something is centralized, the bottom line is this - is there a single point of failure? If the website or server went offline, could I still use the service? Is the code maintained by a single person or company, and if they changed the code to something malicious, could I do anything about it? Can some person, company, or entity, prevent me from using the service?Quote from: Who is John Galt? on September 03, 2023, 02:47:34 PMBut how can a person who is not yet very well versed in all this understand whether he is dealing with a decentralized project or is it all disguised centralized projects?I would ask what fake decentralized projects you have been dealing with already? Some DeFi scam or yield scam? Why? What's wrong with just buying bitcoin and ignoring these scamming shitcoins and their scamming platforms?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tech30338",
      "created_time": "September 04, 2023, 06:20:58 AM",
      "body": "Could be the reason for the fail of other defi projects are less testing's, and security setups for the developers? finding bugs and other exploit are the developers responsibility, releasing projects early without proper testing and looking for bugs, is one way of telling these hackers that take the money its okay, a rush project is like a trash, i mean im sure there are security features that can be implement for security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "September 04, 2023, 07:17:49 AM",
      "body": "Quote from: hugeblack on September 02, 2023, 12:18:20 PM-snip-They always try to promote Decentralization= \"no KYC\" which is not true.Well, that's it.They should know that Non-KYC is a non-guaranteed proposition if they examine the business concept, and decentralization is not only about privacy.Unfortunately users of centralized services on average behave compulsively and assume all services with these offers are truly decentralized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}