{
  "id": "topic_5519794",
  "title": "Crypto Library",
  "author": "Crypto Library",
  "created_time": "November 18, 2024, 04:35:02 PM",
  "content": "Image by AII had invested some funds for the long term in Bitcoin and wanted to hold it for more cycles.But now I thought one thing if I sell my bitcoin fund for 100k then I will get 65.55% profit. And I think that was enough for this season And if I buy some land somewhere in my area with that whole invested+profit amount and later when the bear season comes, then I will sell the purchased land and make a bitcoin investment again with the funds. And I will keep the Buy target around 30k on next bear season.Now let me share a pros points of taking this strategy-If I buy the land and guess the next bear season on 2026 or 2027 then in the meantime the value of my total assets will must be an increase so that my investment amount will also be increasedAnd the cons is-The land-selling process in my country takes also a good time sometimes it takes more than 4 to 5 monthsWhat do you think will it gonna work or Failed?So what's your opinion on this strategy? Or should I buy a gold bar? However, if I buy gold bars, I might get into legal issues because my source of income is cryptocurrency, which is currently not legalized in our country.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5519794",
  "comments": [
    {
      "author": "Findingnemo",
      "created_time": "November 18, 2024, 04:40:41 PM",
      "body": "Quote from: Crypto Library on November 18, 2024, 04:35:02 PMWhat do you think will it gonna work or Failed?So what's your opinion on this strategy? Or should I buy a gold bar? However, if I buy gold bars, I might get into legal issues because my source of income is cryptocurrency, which is currently not legalized in our country.Land value doesn't appreciate that quickly unless it's in prime area or some development infrastructure is coming nearby the property along with that selling difficulty there's a fair amount of money need to be spent on property like, registration, documents, clearance and property tax depends on your country taxation. So I'll not suggest this idea at all.Investing on gold bar seems reasonable but while buying and selling gold you may also need to pay taxes or atleast in my country that may take upto 5to6% as tax from the total amount.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Churchillvv",
      "created_time": "November 18, 2024, 04:51:16 PM",
      "body": "Of course the idea is not totally bad but from a relative point of view you can guess that landed property or land itself if most likely a long term investment such as bitcoin. For a land to appreciate in value you need at least 5 years or more a good increase. I might be bais in my opinion based on my residence but it's quite relatively correct so if you chose to sell you bitcoin and buy land it would be nice if you do that in a long term investment target. With 2025-26-27 which is your target the price of the land might only maintain its original price or it's increase would not be much. At this point I'm only being convinced that your profit which you must have taken from bitcoin not adding much value in this period rather it will either maintain its value or increase with little to no differences. With the time it takes to sell a land, I'm not also convinced that your targeted entry price or time will be met because of bitcoin hits 30kish price during the bear market it wouldn't stay down for much long as 4-5 months just as you said.Hence I would say it's not a totally failed plan but if you have the mindset of much increase in value I would advise you change such mindset about the land rather see it as a store of value in the long/short period. For Gold, I don't think I have enough knowledge on Gold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "November 18, 2024, 04:55:24 PM",
      "body": "Quote from: Crypto Library on November 18, 2024, 04:35:02 PMSo what's your opinion on this strategy?Its just another variation of \"sell high buy low\" tactic which in many cases ends up as \"sell low buy high\", with even higher chances of failure as you plan to include buying and selling land to protect the value. Quote from: Crypto Library on November 18, 2024, 04:35:02 PMOr should I buy a gold barIf I were you, I would just keep hodling bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "November 18, 2024, 05:04:06 PM",
      "body": "If you believe your strategy will work, then you have every right to go for it. I would not do something similar, if i wanted to go into real estate, i will, but not with the plan of selling it and investing the returns into BTC. You can sell some of your coins and diversify into real estate, it is a good investment for the long term.My opinion is that you should hold your BTC and sell some of it if you find other viable investments, that way you are diversifying, while still holding BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stablexcoin",
      "created_time": "November 18, 2024, 05:08:36 PM",
      "body": "I believe it is going to work as planned. The increase of land is exponential in my country. You can buy a land of 20 million in my local currency in one or two year interval you can sell it for 30 million or more and if huge development comes within that varsinity then you are likely to sell that land 3x of you got it. Having a $100k dollars to spend on landed property will get a a cool land in a well suitable area. Don't think about the cons, there more to gain than to lose. If you ask me i will say there is noting to lose with this strategy. Land is less volatile unlike Bitcoin. It can take you two or more cycle to get a 100% profit from Bitcoin but with land one cycle is enough.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "November 18, 2024, 05:14:13 PM",
      "body": "You should also consider the unforseen challenges that might arise during the process of you buying land with bitcoin and vice versa because it will cost you some money. Also consider that what if when you plan to sell the land to buy bitcoin back, you didn't see a buyer at that specific time, and bitcoin price keeps increasing. Note that leaving your coins like that will cost you nothing and it will definitely grow higher in value in the next bull run. If you must diversify to land because you feel that you have too much bitcoin, it's better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "November 18, 2024, 05:34:16 PM",
      "body": "So OP how are you confident that Bitcoin price will come down to 30k in the next bear season? There's a problem in this plan. Land parcels are illiquid in nature. Unless you buy in a strategically placed location, it's very very difficult to sell it off at a good price. You may loose a good time before you can find a buyer. Also what about the maintenance of the land and the demarcation costs? Land parcels are prone to issues like encroachments. How do you plan to deal with it?I think the best plan is to stick to Bitcoin only for profits. If you want recurring income, then buy apartments using the profit which you can immediately rent out. This will ensure a steady return on your investment as well as give you capital appreciation. Also it is easier to sell out an apartment than a land parcel.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "November 18, 2024, 05:45:46 PM",
      "body": "Quote from: Crypto Library on November 18, 2024, 04:35:02 PMI had invested some funds for the long term in Bitcoin and wanted to hold it for more cycles.But now I thought one thing if I sell my bitcoin fund for 100k then I will get 65.55% profit. And I think that was enough for this season And if I buy some land somewhere in my area with that whole invested+profit amount and later when the bear season comes, then I will sell the purchased land and make a bitcoin investment again with the funds. And I will keep the Buy target around 30k on next bear season.Now let me share a pros points of taking this strategy-If I buy the land and guess the next bear season on 2026 or 2027 then in the meantime the value of my total assets will must be an increase so that my investment amount will also be increasedAnd the cons is-The land-selling process in my country takes also a good time sometimes it takes more than 4 to 5 monthsWhat do you think will it gonna work or Failed?So what's your opinion on this strategy? Or should I buy a gold bar? However, if I buy gold bars, I might get into legal issues because my source of income is cryptocurrency, which is currently not legalized in our country.It is up to you, the strategy could work but there is no guarantee that it will, since every single decision that we take carries a risk, in your case the risk is not only that the property you buy does not appreciate in value and instead it goes down, but you are also taking the risk of not buying bitcoin for a good price, after all you are assuming there will be a bear market, since one has appeared after each bull run, however this bull run is slower than the previous ones, what if bitcoin keeps this slow and upward movement for years and the four year cycle disappears? In that case your strategy will fail completely.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "November 18, 2024, 05:50:11 PM",
      "body": "Well, it is a great idea that you are planning for the future and taking advantage of the markets' ups and downs. I do hope that you will be able to sell it at the right price. The hedging that you are thinking about may be suitable. It’s just that it’s hard to liquidate if you need it. Maybe you could find another currency or stick with fiat in the meantime.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinBarrel",
      "created_time": "November 18, 2024, 06:16:46 PM",
      "body": "Quote from: Findingnemo on November 18, 2024, 04:40:41 PMQuote from: Crypto Library on November 18, 2024, 04:35:02 PMWhat do you think will it gonna work or Failed?So what's your opinion on this strategy? Or should I buy a gold bar? However, if I buy gold bars, I might get into legal issues because my source of income is cryptocurrency, which is currently not legalized in our country.Land value doesn't appreciate that quickly unless it's in prime area or some development infrastructure is coming nearby the property along with that selling difficulty there's a fair amount of money need to be spent on property like, registration, documents, clearance and property tax depends on your country taxation. So I'll not suggest this idea at all.Investing on gold bar seems reasonable but while buying and selling gold you may also need to pay taxes or atleast in my country that may take upto 5to6% as tax from the total amount.This right here, land is a slow appreciating asset.Plus every time you sell you have to pay fees and taxes. It's better to just HODL.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "November 18, 2024, 06:19:33 PM",
      "body": "In my opinion, this strategy may not lead you to the desired result. You think that you can accurately determine the highs and lows of the Bitcoin price. However, how can you be sure that you can do this? Past events do not necessarily repeat themselves in the future. Bitcoin's four-year cycles are not an axiom or the Holy Grail for investors. Imagine, for example, that the price of Bitcoin will grow over the next 10 years (with periodic 30% corrections). This will hinder the implementation of your plans, since you will buy a plot of land and will not be able to buy back your Bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "November 18, 2024, 06:34:04 PM",
      "body": "Quote from: Crypto Library on November 18, 2024, 04:35:02 PMAnd the cons is-The land-selling process in my country takes also a good time sometimes it takes more than 4 to 5 monthsNot only that, there will be a harder time to find someone interested in buying the property. Even if you're in a prime location but then your price isn't what others are thinking of, they'll just have to move on and forget about buying your property. You cannot liquidate that on an instant compared to holding any other crypto assets.Quote from: Crypto Library on November 18, 2024, 04:35:02 PMWhat do you think will it gonna work or Failed?So what's your opinion on this strategy? Or should I buy a gold bar? However, if I buy gold bars, I might get into legal issues because my source of income is cryptocurrency, which is currently not legalized in our country.I'm not sure if that's going to fail but I know that it will work but it will take time. Are you being asked for your source whenever you purchase gold bars? I didn't know about that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2Pizza410000BTC",
      "created_time": "November 18, 2024, 06:48:34 PM",
      "body": "Quote from: Crypto Library on November 18, 2024, 04:35:02 PM Image by AII had invested some funds for the long term in Bitcoin and wanted to hold it for more cycles.But now I thought one thing if I sell my bitcoin fund for 100k then I will get 65.55% profit. And I think that was enough for this season And if I buy some land somewhere in my area with that whole invested+profit amount and later when the bear season comes, then I will sell the purchased land and make a bitcoin investment again with the funds. And I will keep the Buy target around 30k on next bear season.Now let me share a pros points of taking this strategy-If I buy the land and guess the next bear season on 2026 or 2027 then in the meantime the value of my total assets will must be an increase so that my investment amount will also be increasedAnd the cons is-The land-selling process in my country takes also a good time sometimes it takes more than 4 to 5 monthsWhat do you think will it gonna work or Failed?So what's your opinion on this strategy? Or should I buy a gold bar? However, if I buy gold bars, I might get into legal issues because my source of income is cryptocurrency, which is currently not legalized in our country.You have 65.55% profit on your bitcoin investment and if you feel good to sell you can sell because you have a lot of profit on your investment. However, the decision to sell your bitcoin investment and buy land with a share of the profits is not a bad decision, it is a very good decision. Maybe your country and my country are the same. I know that in our country, the price of land is very good. Also a good land is very necessary for a good residence. You can buy land if you want, but I will tell you to avoid buying gold right now because the price of gold will slowly go down. If you buy gold, you may face many losses in future. So I can support you to buy land in a good position but don't buy land in a position where later you have to go door to door to sell land.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "November 18, 2024, 06:52:16 PM",
      "body": "If you want to make money during bear market, you can open short instead. But you know that if the price of the coin you chose is increasing, your money is at risk. You should learn very well about risky management before you make such decisions.Land is not easily increasing in value. If you buy land, make sure you do not sell it for many years. If possible you can make it a property that your children will inherit, it is better. Land always increase in price and value. I can not buy land and just sell it in a short period of time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "November 18, 2024, 06:57:06 PM",
      "body": "Quote from: Crypto Library on November 18, 2024, 04:35:02 PMWhat do you think will it gonna work or Failed?So what's your opinion on this strategy? Or should I buy a gold bar? However, if I buy gold bars, I might get into legal issues because my source of income is cryptocurrency, which is currently not legalized in our country.It's a good strategy, and I guess most Bitcoin holder already has been using this though not similar to yours. The truth is that some investors keeps asking about the word hodl, and if they keep holding when is the right time to sell your coins. We the answer is simple. I use same method. For now Bitcoin just broke new ATH level and we are expecting two things to happen from here. First, it either gets to $100k or begins to retrace down to a lower level. Never the less, the goal is to sell off your coin when price reaches a new level and wait for a dip to buy back, potentially making your more profitable in the market.. that is you get to sell off your profit ps from the bulls and wait for a beat season so you can buy more coins and wait for another bull. It's an endless cycle for people who understands how to do it.. so yea your plan is good but make sure you know what to actually buy with your profits or just rather keep the money and wait for the bear.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jegileman",
      "created_time": "November 18, 2024, 10:33:49 PM",
      "body": "Quote from: Crypto Library on November 18, 2024, 04:35:02 PMWhat do you think will it gonna work or Failed?So what's your opinion on this strategy? Or should I buy a gold bar? However, if I buy gold bars, I might get into legal issues because my source of income is cryptocurrency, which is currently not legalized in our country.A cycle of bitcoin is in a four years time and that’s a long time from now if you sell your bitcoin to buy a land. I know land are good assets that never fall in value but keeps appreciating every year. This sounds great to me but what if the expected price you want bitcoin ti fall to during bearish season was never reached again, what if you got to see bitcoin dump to that price and you didn’t get a buyer for the land? You’ll only be prompted to sell the land at a cheap price in order not to miss out at getting into the market again at that time. Every step and strategy you’ll employ looks good but when you’re able to weigh the advantage and disadvantages, you’ll only get a more open forum to chose the one that’ll be more beneficial to you. I’m sure people have been selling and buying bitcoin at every cycle and they time themselves well to buy at the bearish cycle and sell at the bullish time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ever-young",
      "created_time": "November 18, 2024, 11:36:18 PM",
      "body": "You already have a good plan mapped out, but what makes you think that Bitcoin will have a strong dump in the next bearish season that will drop it down to $30k, and what is the plan B for you if the price doesn't drop down to that?  Well, real estate investment is also a good one considering the location of the land; there are places where you can acquire a property whose value can appreciate almost 2X in just a space of 1 year based on the kind of attention it's getting. If you are lucky enough to buy land from such an area, then this plan will be a good one, as there will be enough profit from the land to use and restock your holdings. Even if prices don't drop down to $30k, you will still be at an advantage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "November 19, 2024, 03:33:24 AM",
      "body": "Real estate is no longer a good investment now, the price is too high and the gain isn't as high as before. Moreover your purpose to buy real estate is to buy Bitcoin at bear season, real estate isn't liquid except you want to sell below market value.Since you can't buy gold bar, for me the best investment would be staking stablecoins.No maintenance, less stress, low inflation, stable return and the most important thing is liquid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "November 19, 2024, 04:01:33 AM",
      "body": "Quote from: Crypto Library on November 18, 2024, 04:35:02 PMWhat do you think will it gonna work or Failed?It's going to work and fail at the same time because I don't think that we'll see Bitcoin once again at $30k even if the next bear market go crazy. The simple reason behind saying that is because firms like Micro strategy, and other ETF companies won't let it dip to such levels.Even if you purchase land by taking profit from Bitcoin and then when it comes to selling that land with profit, you'll still have to wait for some time before you get a buyer and who knows what's going to be the rate of Bitcoin at that time when your land gets sold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}