{
  "id": "topic_5432352",
  "title": "Cecilia Joytwin",
  "author": "Cecilia Joytwin",
  "created_time": "December 30, 2022, 07:14:12 AM",
  "content": "What are the things needed to know here as a newbie?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432352",
  "comments": [
    {
      "author": "Cantsay",
      "created_time": "December 30, 2022, 07:27:55 AM",
      "body": "As per the forum the first thing to do is to familiarize your self with the forum's rules and regulations so as not to make any error that might affect your account in the long run. Here's the link: https://bitcointalk.org/index.php?topic=703657.0And also if you intend on learning about Bitcoin and cryptocurrency then you can use the following link:Beginners & Help Encyclopediahttps://www.bitcoin.com/get-startedhttps://coindesk.com/learnhttps://github.com/bitcoinbook/bitcoinbook#chaptershttps://theinternetofmoney.infoBy the way welcome to BTCtalk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "December 30, 2022, 07:35:26 AM",
      "body": "This would be a short and good advice for newbie:1. Don't plagiarism and always write the original source.2. Choose Bitcoin and avoid the rest coins including ETH, BNB, etc.2. Buy a hardware wallet e.g. Trezor or ledger, write down your seed phrase.4. Never expose your identity and your wealth.5. Use decentralized exchange e.g. Bisq and avoid any centralized exchanges e.g. Binance, Kucoin, Coinbase etc.6. Never do this: lend your coins, stake your coins and send to ponzi scheme site.I believe you will never get scammed and your coins will always safe in your side, also you will survive in this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "December 30, 2022, 07:38:02 AM",
      "body": "Don't spam and don't plagiarize. Remember those two, then you're pretty much good.But most importantly, know the industry.* If you like reading articles: https://coindesk.com/learn* If you like reading books: https://theinternetofmoney.info/* If you like watching videos: https://www.youtube.com/playlist?list=PLPQwGV1aLnTuN6kdNWlElfr2tzigB9NnjSecurity related:* https://cryptosec.info* https://www.lopp.net/bitcoin-information/security.htmlIf you want to get more technical* https://github.com/bitcoinbook/bitcoinbook#chapters* https://github.com/ethereumbook/ethereumbook#chapters",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "December 30, 2022, 07:52:10 AM",
      "body": "All the things you need to know as a newbie has already been posted, you just need the guidance to find it and the patience and interest to actually read them.All the threads suggested above (and those still to come below) would be useless to you if you do not read them. Making the effort to read and learn would set you apart from almost 95% of newbies here.Use the Search option effectively to find posts/replies relevant to what you want to know.Also, avoid information overload. You can not go through the tens of threads in a day or two. Pace yourself, and learn at your convenience.This is a fun forum; Enjoy it!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "December 30, 2022, 08:11:06 AM",
      "body": "Many links have been given you, but let me add, make sure you go beyond this forum, read news and crypto related articles too. Do not fear to bring discussion up on this forum, if you do not understand something very well, ask memebers on this forum that will have idea. Be careful of altcoins, some are good but most are bad, the coin that you can have trust in is bitcoin because it is decentralized. Do not save coin on exchanges, go for self custody, cold wallet is safest. Do not rush, take it easy and learn.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "December 30, 2022, 12:40:41 PM",
      "body": "Quote from: Cecilia Joytwin on December 30, 2022, 07:14:12 AMWhat are the things needed to know here as a newbie?I am happy to Welcome you here OP. Apart from the regular advice, I'd add that you should not be under any form of pressure to impress, just be yourself, be original and constructive, so we can benefit from the originality that you will bring in terms of your perspective, opinions and views.Engage in discussions and conversations that you are comfortable with, not all discussions need your input.Try to exhaustive in expressing yourself, this is a forum to learn and everyone leans better with key details than summary.Mark the day you joined on your calendar, develop consistency here (be more consistent here than you are on social media platforms), and in no time, you will be amazed at your growth in terms of your knowledge.I hope to see you grow in rank.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shamm",
      "created_time": "December 30, 2022, 01:41:11 PM",
      "body": "Quote from: Cecilia Joytwin on December 30, 2022, 07:14:12 AMWhat are the things needed to know here as a newbie?Good day OP, you are very much welcome here in our community,  as this is an open forum you can freely do what you want to do but make sure that is not against the rules and regulation here in forum. And also OP as you are newbie here in our community the best thing to do for now is that you will read and gathered more useful thread and reply by our forumate for sure you will learn a lot. last but not the least READ MORE AND USE THE SEARCH ENGINE BEFORE POSTING.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "December 30, 2022, 01:59:10 PM",
      "body": "OP, welcome to the forum. You have been given a lot of good advice as well as links for review. But first, as everywhere else, when you arrive at a new place, you just need to look around. Don't be too quick with information; we've all been in your position as newbies. Be sedate, read, and ask questions you might not understand. You are in a very friendly community that is always ready to help.If you are really interested in Bitcoin, do not give up, here, like nowhere else on the Internet, you can get a lot of information, in a language that is understandable to you. So just be curious.I wish you good luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DiMarxist",
      "created_time": "December 30, 2022, 05:12:55 PM",
      "body": "Quote from: Cecilia Joytwin on December 30, 2022, 07:14:12 AMWhat are the things needed to know here as a newbie?OP, though I am also newbie but I still welcome you to the forum. I have learned 0.1% of the forum and bitcoin, though I can't judge myself, there are many things to learn here. Today I have learned how to create this line👇Learning continues. Based on your question, you have to read  more and asked questions as it is said to me as well which I am currently doing. If you are good in reading, you can mingle with the followings.https://bitcointalk.org/index.php?topic=1689727.0https://bitcointalk.org/index.php?topic=703657.0Take reading as your hobby",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "December 30, 2022, 06:30:08 PM",
      "body": "Simple but effective advice to get on well here & have longevity is some quite simple things. Just be polite, treat others how you would like to be treated. If you don’t have anything nice to say then don’t say anything at all.The forum is a very helpful place for all people interested in crypto, not just newbies.Don’t be nervous to ask questions, most people here are good & will give you free advice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "December 30, 2022, 06:38:32 PM",
      "body": "Quote from: Cecilia Joytwin on December 30, 2022, 07:14:12 AMWhat are the things needed to know here as a newbie?That depends on what your purpose and interest for joining the forum entails. The forum has a lot to offer to you being a newbie even we the older members here are still learning daily as learning in the forum never ends we do get to know about new things continuously here.I may not have much to tell you as things you need to know in the forum owing to how much of rich informations other users have laid down for you but to add to them all, I will say always try to do your own research on things you come across in the forum, don't be shy to keep asking questions on areas you seem confused about and lastly, stay away from spamming, plagiarism and don't easily trust anyone easily, do your verification  extensively before engat trust.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "December 30, 2022, 07:29:31 PM",
      "body": "Quote from: Cecilia Joytwin on December 30, 2022, 07:14:12 AMWhat are the things needed to know here as a newbie?Hey there newbie. Welcome to the forum!  Here are a few things that, in my opinion, are important to keep in mind:Make sure to read up on the forum's rules and guidelines to avoid any mishaps or issues. Unofficial list of (official) Bitcointalk.org rules, guidelines, FAQBefore posting a new question, check to see if it is already been addressed. This can save you time and help you find the information you need more quickly.[Guide] Searching effectivelyAvoid spamming and plagiarizing on the forum. Instead, try to contribute meaningful and unique content to the conversation. As with any online community, it's important to be kind and respectful towards others. This means using appropriate language and avoiding aggressive or confrontational behavior.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "December 30, 2022, 08:03:05 PM",
      "body": "Quote from: Cecilia Joytwin on December 30, 2022, 07:14:12 AMWhat are the things needed to know here as a newbie?As a newbie, you need to calm down and learn and this start with knowing the forum's rules and regulations that guides every activities conducted here, after doing that you have to get familiar with the different boards and their point of discussions in other to avoid off topic or deleted post by moderators, you also need to be active online in learning from experienced members discussions on post, most importantly is the rule that says don't plagiarize, yet some newbies will still find it difficult to abide after been told, they will still do it and got banned, dont spam and dont post shits and garbages that are unacceptable according to the forum's standard.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "December 30, 2022, 08:35:35 PM",
      "body": "You don't need to be in a haste to click any link sent to you through your email or whichever platform, you need to scrutinize very well before you click because some sent are not secured, they are phishing sites and as soon as you click on it you have exposed your data. So you have to be careful and you know it that the internet is not for you to trust immediately like you are in a relationship with a family member.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "December 30, 2022, 09:34:48 PM",
      "body": "Quote from: Cecilia Joytwin on December 30, 2022, 07:14:12 AMWhat are the things needed to know here as a newbie?Know your purpose to this forum and follow it.While the forum teaches us many things, it also provides some opportunities to earn money. While your account is still a newbie, this is the opportunity to learn as much as you can.If you want to earn now, you may end up destroying your account and earn even lesser than you could if you had been patient and learn your way up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romeitaly",
      "created_time": "January 06, 2023, 07:38:13 AM",
      "body": "Quote from: Solosanz on December 30, 2022, 07:35:26 AMThis would be a short and good advice for newbie:1. Don't plagiarism and always write the original source.2. Choose Bitcoin and avoid the rest coins including ETH, BNB, etc.2. Buy a hardware wallet e.g. Trezor or ledger, write down your seed phrase.4. Never expose your identity and your wealth.5. Use decentralized exchange e.g. Bisq and avoid any centralized exchanges e.g. Binance, Kucoin, Coinbase etc.6. Never do this: lend your coins, stake your coins and send to ponzi scheme site.I believe you will never get scammed and your coins will always safe in your side, also you will survive in this forum.Thank you for this! This will help especially the newbies like me. We really make sure that our post is good quality content so that the forum also can grow more effective and efficient to learners about cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tech30338",
      "created_time": "January 06, 2023, 08:28:10 AM",
      "body": "Quote from: Cecilia Joytwin on December 30, 2022, 07:14:12 AMWhat are the things needed to know here as a newbie?here is my tips:Read topics in this forum, depends on what you want to learnDecide on things you want like: mining, tradingwhen you decided what you want like for example trading, read all about trading don't just trade, learning first is an advantageinteract with the members discussion and like your post, you can gain info by asking in this forum, and we are happy to give suggestionsGood luck and welcome to the forum, you will learn a lot here, enjoy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "January 06, 2023, 08:29:52 PM",
      "body": "Quote from: Cecilia Joytwin on December 30, 2022, 07:14:12 AMWhat are the things needed to know here as a newbie?My advice to newbies is that everything in life is a gradual process, because for them to be \"Newbie\" today, it's a clear indication that they were ones \"Brand New\" yesterday, and same can they become \"Member\" tomorrow only if they can tighten their bet and work hard on the forum, as literally, success is never full with bed of roses, but that of hard work and determination to succeed.Because if Mr. A can do it, it's a sign both Mr. B and C can also achieve the same result",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "January 06, 2023, 10:10:17 PM",
      "body": "Quote from: romeitaly on January 06, 2023, 07:38:13 AMThank you for this! This will help especially the newbies like me. We really make sure that our post is good quality content so that the forum also can grow more effective and efficient to learners about cryptocurrency.Newbies like you? Buddy, you are a Full Member registered 5 years ago, you are hardly a Newbie. Or maybe you actually wanted to write this with one of your alt accounts but you forgot to switch it?   @OP others already shared you some good advice, but I would like to add one more: don't pretend to know more than you do as that can get you into trouble (plagiarism=getting banned). Asking the right question can be more valuable to this forum that creating a topic with some generic advice, like many new members do around here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}