{
  "id": "topic_5475853",
  "title": "Fullbear2222",
  "author": "Fullbear2222",
  "created_time": "November 28, 2023, 09:36:54 PM",
  "content": "There is some educated well known people They claim as successful person They have nice linkden profile they have profile that they been on some fancy university .....But all they do is just fraud and scam it doesn't matter that people don't know the matter is even uneducated person can Do those scams and endorsing people Even using the media and news into their scams.Hows that possible ? To say dumb things on Youtube or on the news talking some utter nonsense and making people to fall into scam and smiling ...there nothing about it that they should university education any low educated criminal can Do that Im surprised to see criminals present themselfes with some fancy university degrees.That's funny to see they have linkden profile and they tell nice story and their followers listen \"life advice and so called motivational speech\" but all that so called role model really does it and making money it's just scam Then this person with nice linkden profile searching some people to hire talking about qualities of person and education...lol He can go right to the prisons and just make the convict to wear nice suit teach how cheat smile and scam people there is nothing about some higher education or skillset and funny thing is that person is also youtuber...and call himself as menthorship...person that's all funny and people fall for this easy. That's all is so funny",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475853",
  "comments": [
    {
      "author": "Y3shot",
      "created_time": "November 28, 2023, 11:01:07 PM",
      "body": "Being educated does not mean that one must be genuine in doing things, anybody can be a scammer either educated or uneducated. One thing you need to know is  that it is not every educated person that thinks upright and education does not really change the characters of people's behaviour. Being educated does not have anything of making people to be scammer. If you think people who are educated are not supposed scammers you need to change your mindset so that you won't be disappointed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "November 29, 2023, 12:35:31 AM",
      "body": "If there is something I have learnt by following scams and their victims for a short period of time on the internet is that the level of education does not mean someone cannot be a scammer or a victim. Some years ago I thought that only someone with a low level of education could be scammed through a basic ponzi offering unrealistic returns, until I met people who I considered to be educated and still fell for it. In the end, if you send a bad person (who is capable of scamming) to a university they will continue to be a scammer in the making, but now with a diploma or a degree. A piece of paper won't change the character or the intentions of a person. Also, a rule of thumb I use to identify scammers is: they are either anonymous and hiding behind accounts with no real names in social media (while pulling the strings of their scam) or they appear to be as professional and legit as possible while offering unrealistic expectations to potential victims.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hewlet",
      "created_time": "November 29, 2023, 04:25:02 AM",
      "body": "The world has gone to a point where to successfully carry out anything be it criminal activity or not, you need some some level of education and packaging added to it.Being educated in a particular field doesn't change a criminal minded individual into a Saint. Even most school that emphasizes that they teach there student I becomes won't in both character and I'm learning end up being too hard on these student thereby making them very wicked ones after their complete stay in school.Another angle to view this is that some of those people you see failing victims of scam are individual that are lazy and not willing to carry out their own personal research to ascertain the authenticity in the information the person is giving out. I think the we need to understand that the world is filled with of people that are so after their personal interest so much so that that if someone brings up an opportunity to you just like that, you should sit back and ask yourself some question, do some research before investing your funds in something you aren't sure of",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "November 29, 2023, 05:05:32 AM",
      "body": "Quote from: Fullbear2222 on November 28, 2023, 09:36:54 PMThen this person with nice linkden profile searching some people to hire talking about qualities of person and education...lol He can go right to the prisons and just make the convict to wear nice suit teach how cheat smile and scam people there is nothing about some higher education or skillset and funny thing is that person is also youtuber...and call himself as menthorship...person that's all funny and people fall for this easy. That's all is so funny People can claim to be anything on social media and you have no means to validate such claims. They could present fake academic qualifications and other documents to prove the claim. This is why you don't believe everything you see on the internet until you verify that they are true. Scammers don't need to get a higher university degree to be good criminals because they already have templates on how to scam people. The only education they need is how to read, write and speak. There are diverse scam software that could help an illiterate act like a university professor. Don't also be deceived by the academic qualifications of anybody, a professor can also be a scammer. For the past 16 years, my country has conducted some of the worst elections in the world. Our elections are filled with the highest form of corruption to the extent that results were already written and signed by bribed election returning officers even before the elections were conducted. It is sad to state that almost all the returning officers are university professors. Education cannot cure greed and lack of contentment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "November 29, 2023, 05:39:21 AM",
      "body": "The problem of greed and loss of ethics makes anyone willing to become a fraudster. Someone's ability to study well only reflects their ability to adapt to the current world, but problems in society are essentially balance and people will also have good and bad people.But we should also be frank that those who bully me are not the majority, and only a few of them are determined to pursue their personal goals. And when they have fame and power, they are more likely to increase their greed, until they are discovered, which is when the balance is announced.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lucifur",
      "created_time": "November 29, 2023, 05:54:13 AM",
      "body": "You have to understand that intelligence does not always equate to moral integrity. I've come to believe that it is often the individuals with extensive education who engage in scamming activities. This might seem counterintuitive at first, considering the societal expectation that education typically leads to respectable professions and ethical behavior. However, if we delve deeper into this matter, the reasons become apparent. Educated people usually possess a wide range of knowledge, strong analytical skills, and advanced problem-solving capabilities. In scamming, these intellectual abilities provide the tools necessary to devise intricate schemes designed to deceive others.These highly educated scammers can create elaborate tactics that manipulate others into falling for their scams. Their strategies may involve psychological manipulation, complex fraud schemes, or sophisticated digital scams. They can present their ploys convincingly, making them difficult to detect and resist. With their high level of intelligence, it allows them to adapt and modify their tactics as situations change, making it even more challenging to apprehend them or prevent their activities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uchegod-21",
      "created_time": "November 29, 2023, 06:51:01 AM",
      "body": "Quote from: lucifur on November 29, 2023, 05:54:13 AMYou have to understand that intelligence does not always equate to moral integrity. I've come to believe that it is often the individuals with extensive education who engage in scamming activities. This might seem counterintuitive at first, considering the societal expectation that education typically leads to respectable professions and ethical behavior. However, if we delve deeper into this matter, the reasons become apparent. Educated people usually possess a wide range of knowledge, strong analytical skills, and advanced problem-solving capabilities. In scamming, these intellectual abilities provide the tools necessary to devise intricate schemes designed to deceive others.These highly educated scammers can create elaborate tactics that manipulate others into falling for their scams. Their strategies may involve psychological manipulation, complex fraud schemes, or sophisticated digital scams. They can present their ploys convincingly, making them difficult to detect and resist. With their high level of intelligence, it allows them to adapt and modify their tactics as situations change, making it even more challenging to apprehend them or prevent their activities.Anyone can get involved in scam activities no matter their educational backgrounds. The educated people people are even more likely to engage in fraudulent activities and scams because they know what people know,  they know what people want to hear and they also know how to manipulate people into buying their ideas. Being educated does not in any way guarantee righteousness. Many youths this days don't want to stress themselves in getting legit jobs. They prefer to use the knowledge they have acquired in defrauding people and make quick money. I won't tag it laziness because this people invest their time in few cases money into their \"scam  business \". The moral consciousness in people is declining rapidly and people can  do anything now for money now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Broly46",
      "created_time": "November 29, 2023, 09:33:35 AM",
      "body": "There is once upon a time everybody have a job and could earn living wage, where husband being the breadwinner while wife being housewife and all is great, no frauds or back-stabbing or major scams to be read or found on news. But there come the population explosion and market pie is getting smaller and smaller, people today are working toward survival, where not only husband working housewife too are required to work just to survive, why have things changed so dramatically in a span of just a few decades of strong economic growth of 10-20% annually??? Due to that create rich get richer and poor get poorer, very obvious highly educated guy notably middle classes today are resorting to scamming in life just for affording foods, they are usually a 500 dollar of shortfall away from totally broke, see most American can't afford a 500 dollar \"disposable income\", they often would have to beg the public for donation to make end meet!!So long story short why smart people are scamming today but not working hard for money like the good old day? They are living an animalistic wild life in real life, they live to survive, they would do all thing in life, going out and protest, overthrow the regime etc, they could do anything. But what can you do to save yourselves, idk you gotta find the answer on your own.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ruttoshi",
      "created_time": "November 29, 2023, 10:31:29 AM",
      "body": "Scam is something can be done by anyone and I am not disappointed to see that educated people are also scammers because it is ones choice to be a scammer or not. For you to be a scammer, you must be able to speak well and dress nice even though you are not educated because that is what will make people listen to you and feel that you are for real. It is even very easy for educated people to be scammers because they already know what to tell you that will make you fall for them with fake proves.A scammer must have educated himself and would have gone through some kind of training to make sure that he can be able to convince his victim easily and you shouldn't also forget that we are humans and can easily be deceived with things that we are desperate for or have zeal on and that is what this scammers learn and use it to take advantage on their victims.  Being educated doesn't mean that you will not be who you are but instead it will bring out the best of who you are.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AYOBA",
      "created_time": "November 29, 2023, 02:45:50 PM",
      "body": "If I understand you correctly, you're attempting to imply that all educated people nowadays are all scammers to uneducated people? If you're unaware, let me enlighten you little, not only educated individuals engage in scams, but illiterate people also tend to be more physically strong than educated people, making them more resilient than those in the study. Finding a graduate to be a con artist is disheartening. We may all agree that there are lack of enough jobs in the nation, but educated people will inevitably fall victim to con artists as a result. That is deplorable. Some illiterate people are smarter and more intelligent than those who understand education, even when they have no idea what it entails.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "November 29, 2023, 03:21:53 PM",
      "body": "If your here on this forum then you must have attained a level of being educated to have been here and to also adopt bitcoin, does such idealogy also has an interpretation of you being a scam, i understand it may take a certain level of being exposed or having a certain educational requirements to be able to commit some level of scam, but that's not the reason for going through education, not every educated fellow engage in scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Miles2006",
      "created_time": "November 29, 2023, 04:24:09 PM",
      "body": "The mindset of the op is as a result of people he has encounter, the op is right, educted people are into scam, and all kind of rubbish work like fraud but not all educated men, even illiterate are into scam and fraud, but in the situation of an educated man with high standard and respect involving in fraud and scam, that person is a lazy person or an idle man. Although not all educated men have a good job but scamming people is never an option.They're just lazy to work hard and earn clean money, they choose to go the wrong way because they felt it's the best thing to do. For us not to fall victim it's better to abstain from people like that",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "November 29, 2023, 04:29:50 PM",
      "body": "You need to accept the fact to pull a scam the individual needs to have some creative ideas with him, but I am not backing the scam in any way just presenting the facts based on the history. Education is part of knowledge and being educated doesn't mean the user will behave ethically for the record one who has extraordinary skills in technology is pulling the hacks in the crypto industry so never ideolize that educated people are good and trusted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "November 29, 2023, 11:41:19 PM",
      "body": "Just think of corrupt countries, the scammers and thieves are wearing coats and suits for their own presentation but we don't know that they've been doing something crazy behind the curtains of their offices. When I say something crazy, it's making the citizens suffer and crazy about how they're going to survive.And that is because these leaders are educated, finished their degrees, got their masters and doctorate and yet they don't have ethics because all they do is trying to get easy money. I guess it's already in nature when you're able to see how easy it is to make money when you are in the position but you're robbing people's money.That's the reason why it's like a chain reaction and people who does victimized people and rob and scam their money won't even think of any compassion to their victim because they will reason out that even the people at the top, does it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iBaba",
      "created_time": "November 30, 2023, 08:22:21 AM",
      "body": "I think education is supposed to be an enlightenment for any person out there seeking for exposure and intelligence quotient. For someone who's willing to widen his horizon of thinking and accelerate his capacity to understand a diverse approach to life. This is what education gives you. Ordinarily, aquiring education, after all the above mentioned features, is supposed to put the learner into some shape of critical thinking, capacity to analyze and weigh things in more constructive way and the ability to solve realtime problems. Unfortunately, many have used the same knowledge they have acquired to harm peiple and negstively impart ofn the lives of people because of their ill-thinking.These corrupt minded individuals are mostly affected by societal vices, parental upbringing and the influence of peer groups.The Society have greatly influenced how we think overtime and one can category that as an external factor that either possitively or negatively influence the thinking faculty of people. Some people are naturally endowed with understanding and the ease of learning new things, instead of these positive attributes of the person to positively impact on them, due to the societal vices that the person is exposed to, it inversely and gradually become negative to them and their environment.Because of the bond and love that parents try to show to their kids since from childhood, some parents negatively impart on their thoughts and instead of the love and care to make the child a better person in the society, they become too ambitious and prodigal which then negatively affect their thinking and education. Likewise, parents who do are negligent in the proper upbringing of their wards.Last is the influence of peer groups which is also an external factor mostly gotten through the society. A wrong society breeds wrong association which now gives birth to wrong peer groups. Since education and knowledge is not a natural phenomenon but a decision that is taken by man and a proccess passed through, it doesn’t stop one from being affected by bad friends and that’s why the popular adage says, show me your friends and I will let you know of yourself. It is therefore imperative to associate and build relationship with good firends and progressive minds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelward",
      "created_time": "November 30, 2023, 01:59:23 PM",
      "body": "You have to understand that the attributes of good and evil are embedded in the human nature, so with  education or without it, it takes personal decision to be good or bad. This is why you'd see poor and uneducated people who have integrity and will never cheat, on the other hand you'll see educated CEO of big firms, renowned politicians being involved in dirty deals, it can also be the other way round.In this era of internet, it's quite easy for anyone to come to social media, and claim to be anything, this is why we have to verify and be sure of the authenticity of individuals, groups or organizations before engaging with them. This days scammers are becoming more sophisticated and scheming new ways to defraud unsuspecting victims, so there's need for us to be a step ahead of their games. We have to be constantly informed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "November 30, 2023, 02:23:17 PM",
      "body": "Quote from: passwordnow on November 29, 2023, 11:41:19 PMAnd that is because these leaders are educated, finished their degrees, got their masters and doctorate and yet they don't have ethics because all they do is trying to get easy money. I guess it's already in nature when you're able to see how easy it is to make money when you are in the position but you're robbing people's money.When you are the policy maker and you will get to decide what is right and what is wrong so everything they do will be legal from a law point of view and ethics are just shit and useless things for them. But people get to choose them again and again that is what the problem is with democracy just like every ruling system in the world.But what we can do is make changes in our surrounding starting from family and once everyone get into that mindset then only it is possible to have corrupt free system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "November 30, 2023, 02:56:23 PM",
      "body": "Sometimes,  most scammers are most smartest set of forks on the internet but they choose to use the smartness in the wrong directions and that,  so for sure educated or not,  what really matters is what they tend to believe and act on. Scamming of of different classes and categories and for sure some uneducated people also scam but then they have to put in some dubious tactic that allows them to act on the minds of the victims.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "November 30, 2023, 04:27:48 PM",
      "body": "Quote from: Wiwo on November 30, 2023, 02:56:23 PMSometimes,  most scammers are most smartest set of forks on the internet but they choose to use the smartness in the wrong directions and that,  so for sure educated or not,  what really matters is what they tend to believe and act on. Scamming of of different classes and categories and for sure some uneducated people also scam but then they have to put in some dubious tactic that allows them to act on the minds of the victims. Also, I would like to add an exception when comes to education and scammers. I agree that most of the times, scammers will end up being scammers, educated or not. But if someone who is a scammer get education in some branches like coding, economics, or administration, then they are very much likely to use those skills to develop scam viruses or Malware. In the other hand, if a scammer is uneducated, the most they can do is to try to scam in a very old fashioned way, like trying to fish someone on Telegram.In the end education and science are neutral things, which can be used either for good deeds or bad ones.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}