{
  "id": "topic_5411083",
  "title": "AlphaEther",
  "author": "AlphaEther",
  "created_time": "August 24, 2022, 07:41:23 PMLast edit: August 24, 2022, 08:28:08 PM by AlphaEther",
  "content": "There is a website which can give you randomly generated seed and private keys. I heard that some time people found money on those addresses. You can look up the wallet address and seeds at a same time. Website Link- https://iancoleman.io/bip39/But the fact is. I have a habit of collecting unique things. In case of make a metamusk wallet for myself i tried to get an unique address like (0x00000aaaa.....) and i select one. i got the seeds too. But I'm confused, if i use that address, anyone are able to access my wallet?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411083",
  "comments": [
    {
      "author": "hosemary",
      "created_time": "August 24, 2022, 07:55:19 PM",
      "body": "Quote from: AlphaEther on August 24, 2022, 07:41:23 PMThere is a website which can give you randomly generated seed and private keys. I heard that some time people found money on those addresses. If you generate a private key randomly, it's impossible that it has been generated by someone else before. So, you can't have a private key which has been generated randomly and its associated address has been already funded.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AlphaEther",
      "created_time": "August 24, 2022, 08:06:24 PMLast edit: August 24, 2022, 08:28:45 PM by AlphaEther",
      "body": "Quote from: hosseinimr93 on August 24, 2022, 07:55:19 PMQuote from: AlphaEther on August 24, 2022, 07:41:23 PMThere is a website which can give you randomly generated seed and private keys. I heard that some time people found money on those addresses. If you generate a private key randomly, it's impossible that it has been generated by someone else before. So, you can't have a private key which has been generated randomly and its associated address has been already funded. Thats means once an wallet had been created its impossible for anyone to find it twice by random?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "August 24, 2022, 08:13:01 PM",
      "body": "Quote from: AlphaEther on August 24, 2022, 08:06:24 PMThats means once an account had been created its impossible for anyone to find it twice by random?A wallet is not an account. A private key is a random number from a hugely big interval. The address is based on the private key.Now if you leave a proper wallet software generate that number for you, the chance others will generate the same number is smaller than the chance for winning the lottery many times in a row. So it's pretty safe to say nobody else will have the same address.On the other hand if you pick a nice number like 123456789..... to be your private key, somebody else might easily generate the same wallet and steal your money.PS. Don't use websites generate your wallet, use wallet on your computer, or, better, hardware wallet.PPS. What I was telling was about bitcoin. Eth / metamask stuff may or may no follow the same rules, you can ask in the altcoins area.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ololajulo",
      "created_time": "August 24, 2022, 08:13:18 PM",
      "body": "Quote from: AlphaEther on August 24, 2022, 08:06:24 PMQuote from: hosseinimr93 on August 24, 2022, 07:55:19 PMQuote from: AlphaEther on August 24, 2022, 07:41:23 PMThere is a website which can give you randomly generated seed and private keys. I heard that some time people found money on those addresses. If you generate a private key randomly, it's impossible that it has been generated by someone else before. So, you can't have a private key which has been generated randomly and its associated address has been already funded. Thats means once an account had been created its impossible for anyone to find it twice by random?finding at random may be different from generating a wallet at random, generating should indicate a new. The random may also mean the private keys are randomly arranged. A new wallet cant have coins inside it if generated. There is no way you can defend this post, If you make the website known, we might do research on it to find out how safe and how coins get into the wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "August 24, 2022, 08:15:06 PMLast edit: August 24, 2022, 08:31:24 PM by hosseinimr93",
      "body": "Quote from: AlphaEther on August 24, 2022, 08:06:24 PMThats means once an account had been created its impossible for anyone to find it twice by random?I don't know what you mean by account.There are around 2256 valid  bitcoin private keys. So, if a private key has been generated randomly, it's very very unlikely that it has been generated before. If there's a website which generate private keys that have been generated before, it means that it doesn't generate the private keys randomly and should be never used. You should never use a private key you don't know how it has been generated.You should never use a private key generated online.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AlphaEther",
      "created_time": "August 24, 2022, 08:20:42 PM",
      "body": "Quote from: ololajulo on August 24, 2022, 08:13:18 PMQuote from: AlphaEther on August 24, 2022, 08:06:24 PMQuote from: hosseinimr93 on August 24, 2022, 07:55:19 PMQuote from: AlphaEther on August 24, 2022, 07:41:23 PMThere is a website which can give you randomly generated seed and private keys. I heard that some time people found money on those addresses. If you generate a private key randomly, it's impossible that it has been generated by someone else before. So, you can't have a private key which has been generated randomly and its associated address has been already funded. Thats means once an account had been created its impossible for anyone to find it twice by random?finding at random may be different from generating a wallet at random, generating should indicate a new. The random may also mean the private keys are randomly arranged. A new wallet cant have coins inside it if generated. There is no way you can defend this post, If you make the website known, we might do research on it to find out how safe and how coins get into the wallet.Website link- https://iancoleman.io/bip39/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "August 24, 2022, 08:28:23 PM",
      "body": "Quote from: AlphaEther on August 24, 2022, 08:20:42 PMWebsite link- https://iancoleman.io/bip39/This website is safe, if it's used offline. In your first post, you said that the website generates funded addresses. The tool in question is open-source and it's guaranteed that the keys are generated 100% random. So, it's impossible that it generates an address that has been already used.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AlphaEther",
      "created_time": "August 24, 2022, 08:32:34 PM",
      "body": "Quote from: hosseinimr93 on August 24, 2022, 08:28:23 PMQuote from: AlphaEther on August 24, 2022, 08:20:42 PMWebsite link- https://iancoleman.io/bip39/This website is safe, if it's used offline. In your first post, you said that the website generates funded addresses. That's impossible. The website is open-source and it's guaranteed that the keys are generated 100% random. So, it's impossible that it generates an address that has been already used. I just click on generate button and got lots of private keys with address in the bottom. I found it interesting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cricktor",
      "created_time": "August 25, 2022, 12:23:42 AM",
      "body": "Quote from: AlphaEther on August 24, 2022, 08:32:34 PMI just click on generate button and got lots of private keys with address in the bottom. I found it interesting.This is just one of many purposes of this tool website. When you click Generate button random entropy is generated and the human readable representation for storage of this random entropy is shown as the mnemonic words (they basically represent the same).You can also enter mnemonic words (always use in offline mode on a safe computer, e.g. offline booted TAILS) and the entropy those mnemonic words represent is derived. Rules for this and more are in BIP-39.By defined rules and some rounds of hashing the mnemonic words a so called Master Private Key is derived. Subsequent derivation defined by rules according BIP-32 and chosen or given derivation path yields hierarchical deterministic private keys --> public keys --> public addresses of a HD wallet defined by the initial random entropy or the mnemonic words.The derived private keys are unique to the specific wallet whose derivation starts from the entropy or its human friendlier mnemonic words and the wallet's derivation path. See https://learnmeabitcoin.com/technical/hd-wallets",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "August 25, 2022, 01:20:14 AM",
      "body": "The odds that some one else get the same private key as yours are really low. You don't have to worry about that.But the fact that people generate their address online its a high risk move, and a lot of people have lose their founds doing it, and this is because it's simple for a site to save all the generated address in a data base, so, if the user send coins to that address they can be lost because the site has your private key.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "August 25, 2022, 11:22:21 AM",
      "body": "Quote from: AlphaEther on August 24, 2022, 07:41:23 PMBut the fact is. I have a habit of collecting unique things. In case of make a metamusk wallet for myself i tried to get an unique address like (0x00000aaaa.....) and i select one. i got the seeds too. But I'm confused, if i use that address, anyone are able to access my wallet?You can create custom unique addresses in Bitcoin using VanitySearch or similar software, and nobody is going to use that address other than you.Only way this could happen is if you somehow made a mistake and leaked your private key or someone else got access to your computer device, so it's better to always keep private key offline.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "August 25, 2022, 03:06:48 PM",
      "body": "Quote from: AlphaEther on August 24, 2022, 07:41:23 PMBut the fact is. I have a habit of collecting unique things. In case of make a metamask wallet for myself i tried to get an unique address like (0x00000aaaa.....) and i select one. i got the seeds too. But I'm confused, if i use that address, anyone are able to access my wallet?That's a vanity address. They are generated from a truly random private key, which by chance, outputs an address that to the human eye expresses some desirable patterns.On the other hand, if you deterministically create a private key and derive an address from that, that's where you get into trouble. As you do not have any randomness as 'input', the entropy of your key will be significantly lower and significantly higher chance for someone to find / guess it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}