{
  "id": "topic_5419027",
  "title": "shumansky",
  "author": "shumansky",
  "created_time": "November 01, 2022, 07:54:03 AMLast edit: November 01, 2022, 08:19:25 AM by shumansky",
  "content": "Hello,if youre looking for free trade bots, i recommend Pionex exchange with 16 builtin bots to choose from: dca, dca trailing, gridbot, infinity grid etc. All bots are implemented on exchange, so you dont need to use any 3rd party app, or pay montly fee for using bots. Pionex has very low trade fee, only 0,05%.Registration link: https://www.pionex.com/en/sign/ref/PzseuqJV",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5419027",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "November 01, 2022, 08:15:10 AM",
      "body": "Quote from: shumansky on November 01, 2022, 07:54:03 AMFor further questions ask me on Telegram: @SumichrastYou started well, but wanted to end it with suspicion. Why anyone should contact you on telegram? This can later lead to manipulation. I will advice people not to contact you. This is a forum to learn and to help people, all that is pertaining to the bots can be discussed on this thread.OKX has a bot, but I have not even used it before, so this kind of topic is not for me. I do trading manually and I do not have to use both for DCA.I checked Pionex exchange, the exchange is having a total trading volume of over $500 million, ranked 108. It should be a good exchange. But I will like people that are using it to let other people know if it is a good and non shady exchange, or maybe otherwise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shumansky",
      "created_time": "November 01, 2022, 08:17:23 AMLast edit: November 01, 2022, 08:27:51 AM by shumansky",
      "body": "Thanx for advice, post edited😉Btw for those who trades manually, pionex has also option: Smart trade -you can set Trailing take profit and if price of coin rises a lot in very short time, youll be able to get more profit from trade",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}