{
  "id": "topic_5407966",
  "title": "Kweek",
  "author": "Kweek",
  "created_time": "July 28, 2022, 08:14:19 PM",
  "content": "What is your current view on IEO investments for the next quarter? the points you take into consideration when investing in this type of release? What are its perks and benefits?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407966",
  "comments": [
    {
      "author": "Hydrogen",
      "created_time": "July 28, 2022, 11:38:55 PM",
      "body": "IEO. Initial exchange offering? The concept and guidelines remind me of ICOs. Which used to be available to everyone. And were regulated as being available only to accredited investors. It is possible IEOs will follow a similar course and become restricted assets in the future.It is claimed developers of crypto tokens and coins paid out large sums to become listed and supported by exchanges. This is a power exchanges have long had to legitimize existing projects through their listing process. The natural development of IEOs is intended to leverage this power further by exchanges developing their own projects to list in house.As with most things their success or failure will all come down to the implementation. If IEOs fail to amount to more than a thin cash grab, they will likely fail to have long term success in the way that NFTs are likely to do so. If they can implement a solid design with good fundamentals, that solves actual problems and is a good tool. It is likely to succeed over the long term.If anyone intends to make plays with IEOs it could be good to act quickly. Before they become regulated to accredited investors only, the way ICOs did.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bttzed03",
      "created_time": "July 29, 2022, 04:41:01 AM",
      "body": "Quote from: Kweek on July 28, 2022, 08:14:19 PMWhat is your current view on IEO investments for the next quarter?How you view investments on projects that started initial offerings on exchanges is a case to case basis. The trend seems to be an important factor for investors these days (e.g. gamefi).Quote from: Kweek on July 28, 2022, 08:14:19 PMthe points you take into consideration when investing in this type of release?Aside from the usual team and type of project, the exchange where it will be held also matters. IEOs on some ordinary exchange pales in comparison to the ones done in Binance. There have been many claims also that smaller exchanges fakes the volume to make it appear it was a success.Quote from: Kweek on July 28, 2022, 08:14:19 PMWhat are its perks and benefits?What else than the potential of taking a huge profit? At least temporarily.Just look at what's happening with the P2E Game token called crypto legion bloodstone (BLST). I don't know what's really going on with this project but it's pumping crazy. I read the initial price is at $0.60, price apparently dropped to low $0.179 before pumping to over $15.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reid",
      "created_time": "July 29, 2022, 06:29:53 AM",
      "body": "Bttzed03 is correct, it must be in a reputable exchange. It's no different with an ICO, that's the only catch with this IEO. Instead of direct purchasing of tokens from the developers of the project they will use an exchange for investors to buy it. So what will you check? Same old thing, the team, the utility, and future goals. Then, you add the exchange on where they will list it, it must have a reputation, accurate volume, and the crucial part in my opinion is history of successful IEO which also used the same exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "justdimin",
      "created_time": "July 30, 2022, 05:40:26 AM",
      "body": "Quote from: Reid on July 29, 2022, 06:29:53 AMBttzed03 is correct, it must be in a reputable exchange. It's no different with an ICO, that's the only catch with this IEO. Instead of direct purchasing of tokens from the developers of the project they will use an exchange for investors to buy it. So what will you check? Same old thing, the team, the utility, and future goals. Then, you add the exchange on where they will list it, it must have a reputation, accurate volume, and the crucial part in my opinion is history of successful IEO which also used the same exchange.Investing with an IEO is much easier because people can just skip the other parts but will simply head on a trusted exchange. They think that a trusted exchange already did the job for them which is researching because a trusted exchange can't just list a poor quality project or a scam project as that can damage their reputation and people will think that they only care for the money so they will now start to avoid it.Our only assurance before when investing in ICO or picking a bounty is to check the manager that manages it. If it's high rank and reputable because like I said earlier, they will also do their research carefully as they are also afraid for their reputation to get damaged.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KennyR",
      "created_time": "July 30, 2022, 05:59:40 AM",
      "body": "Quote from: justdimin on July 30, 2022, 05:40:26 AMInvesting with an IEO is much easier because people can just skip the other parts but will simply head on a trusted exchange. They think that a trusted exchange already did the job for them which is researching because a trusted exchange can't just list a poor quality project or a scam project as that can damage their reputation and people will think that they only care for the money so they will now start to avoid it.Our only assurance before when investing in ICO or picking a bounty is to check the manager that manages it. If it's high rank and reputable because like I said earlier, they will also do their research carefully as they are also afraid for their reputation to get damaged.Yes, based on the exchange on which the IEO is launched will give the better trust rating to the respective project. Once Binance used to list a large number of project through its launchpad. Later some projects even got delisted from Binance. So, even on the exchange listing we can't rely much to calibrate the potential of the project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kaseygriffin",
      "created_time": "July 30, 2022, 06:29:27 AM",
      "body": "Quote from: Kweek on July 28, 2022, 08:14:19 PMWhat is your current view on IEO investments for the next quarter? the points you take into consideration when investing in this type of release? What are its perks and benefits?I am only talking about the IEOs on the top exchanges that we know today. I see them all as having the potential to bring certain profits. But just like a way to navigate trends in the market, if the potential is not strong enough, they are only seen in the short term and do not need to be overrated. I believe that the coming period will have many other changes related to the market. The reactions of the market over the past few days are still showing more manipulation and control than any other market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "July 30, 2022, 07:14:25 AM",
      "body": "Quote from: Kweek on July 28, 2022, 08:14:19 PMthe points you take into consideration when investing in this type of release? What are its perks and benefits?The same exact criteria when speculating on whatever coin or token. It's really not that any different, with the only difference is that you're buying a lot earlier hence the risks(and rewards) are higher.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoYar",
      "created_time": "July 30, 2022, 07:46:34 AM",
      "body": "I have been participating in token sales since last one year. so i would like to give you some tipsOnly participate top tier exchanges IEO (You indeed get less tokens because thousands of participants, but it's better than nothing)when the token sale is over, and got your token, stick to your mobile or PC because you have to sell the token immediately after listing (Cos, token pumps after listing, and you have to exit in that pump)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batang_bitcoin",
      "created_time": "July 30, 2022, 08:05:33 AM",
      "body": "Quote from: Kweek on July 28, 2022, 08:14:19 PMWhat is your current view on IEO investments for the next quarter?Are they still a thing today? I'm sure that no longer they are.Quote from: Kweek on July 28, 2022, 08:14:19 PMthe points you take into consideration when investing in this type of release? What are its perks and benefits?Well, if I'm going to invest on this then the important factor is about the exchange itself. A reputable and good exchange really takes a lot of investors interest. Having that support would mean a lot to that project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "July 30, 2022, 09:11:42 AM",
      "body": "Quote from: mk4 on July 30, 2022, 07:14:25 AMQuote from: Kweek on July 28, 2022, 08:14:19 PMthe points you take into consideration when investing in this type of release? What are its perks and benefits?The same exact criteria when speculating on whatever coin or token. It's really not that any different, with the only difference is that you're buying a lot earlier hence the risks(and rewards) are higher.Higher the risk higher the reward for everything and anything in this world. However this comes with huge price tag of scam when you doing it in the crypto world. There is no way one can be assured of the project in the crypto universe unless and until that coin is actually “listed” on an exchanger. There was period before 2018 when ICO were doing just very hot and then some crap shit started with ICO fund raising and then scamming with all the funds. So it was way safer to wait for coin to get listed and then trade. I would suggest same pattern to be followed for the IEO investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zilon",
      "created_time": "July 30, 2022, 10:46:45 AMLast edit: July 30, 2022, 11:37:49 AM by Zilon",
      "body": "The risk to reward ratio in IEO is proportional to each other same way it is open for bugs of scam projects. The remaining quarter will definitely bring lots of new tokens but sticking to a few on reputable exchanges is my target and afterwards get ready to sell once the IEO is over to avoid falling victim to pump and dump projects everywhere",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "July 30, 2022, 11:27:42 AM",
      "body": "Quote from: CryptoYar on July 30, 2022, 07:46:34 AMwhen the token sale is over, and got your token, stick to your mobile or PC because you have to sell the token immediately after listing (Cos, token pumps after listing, and you have to exit in that pump)This is the IEO journey and this is the reason it doesn't really cause any positive vibes for investors anymore because when you get your share and relax for it to increase as expected for the purpose of profit but it will go crashing down to your face. This is why it is better investing straight with buying of ready selling coins from the market except as said you want to be ready visiting your PC always and get ready for swapping, change of contract address , KYC etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adzino",
      "created_time": "July 30, 2022, 11:43:19 AM",
      "body": "Quote from: Kweek on July 28, 2022, 08:14:19 PMWhat is your current view on IEO investments for the next quarter? the points you take into consideration when investing in this type of release? What are its perks and benefits?I would say no difference between an IEO and an ICO. Points to take consideration is which exchange is offering the IEO. If it is a bigger well known exchange, better chances of success and the IEO not being a scam. The perks are the same. There is a chance that you will be making a huge gain in the long run (or within a short period of time) if the project is successful. Another benefit is that since the exchange will be the middle man, things should be easier and safer than usual.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "July 30, 2022, 12:37:24 PM",
      "body": "I'd stay away from Initial whatever Offerings, as previous rotations have shown that it's a dangerous venue where one is extremely likely to get scammed (whether by not getting the tokens or getting useless tokens that don't go anywhere) or just fail (because once a coin makes it to exchanges, it gets heavily dumped). Sure, you can reach awesome profits if you get lucky, but it's way too risky for me. I'd rather wait for a coin to make it to coingecko/coinmarketcap, not get totally dumped, and then consider investing. You might lose some potential profits, but you also reduce the risks heavily this way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}