{
  "id": "topic_5400841",
  "title": "Nicksnickname",
  "author": "Nicksnickname",
  "created_time": "May 31, 2022, 09:45:58 AMLast edit: June 01, 2022, 03:15:48 PM by Nicksnickname",
  "content": "We can find stolen/ lost crypto!Research/ find/ trace for many cryptocurrencies! With the help of specialized analysis systems ( like chainanalys/ crystalblockchain etc ), we can find/trace stolen or lost crypto in popular ( blockchains: BTC ( btc, usdt omni etc ); ETH ( eth, USDT and erc20 tokens etc ); TRX ( USDT and another trc tokens); BSC ( Bnb, Busd etc ); and many more include DASH and ZEC.  We can also mark the crypt in the systems as scam / stolen, after which, when it gets to resources with AML, it will be blocked automatically, which will greatly complicate the life of scammers and give you the opportunity and time to return it. We can give you all data about your stolen crypto ( where, how it gone there ), we can help block it fast ( cause we works with majority CEX ). Then you can go to police in your county and with this data ( tracing, addresses, info about them, where crypto blocked etc ) you can request returning your crypto from those resources where it stopped. For admins or moderators we can do job for finding crypto and marking addresses as scam with payment after. !FIRST 2 person who will write their btc or eth addresses in tread- I’ll do connection tree of your address ( where how much crypto gone and it will show resources where it gone ) FREE!!! ( don’t give addresses with big amounts of transactions pls, it will take too much time for free job, thx ). For all questions and examples pm in telegram, I rarely come here @nicksnicknameHere is example of connections tree from crystalblockchain. https://ibb.co/kDkhPZ3",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400841",
  "comments": [
    {
      "author": "Text",
      "created_time": "June 01, 2022, 02:08:18 AMLast edit: June 01, 2022, 03:07:36 PM by Text",
      "body": "All right, let's try.I will post my MEW wallet address here: Can you pinpoint what and how many tokens were stolen from me?I won’t give a clue for now. Can you determine when this happened?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nicksnickname",
      "created_time": "June 01, 2022, 10:08:12 AM",
      "body": "Quote from: Text on June 01, 2022, 02:08:18 AMAll right, let's try.I will post my MEW wallet address here: 0xf6D938d1773c65FD1769778D4B51243a801D29D5Can you pinpoint what and how many tokens were stolen from me?I won’t give a clue for now. Can you determine when this happened?I can give you connections tree of your address to know where it was gone. But I shouldn’t play games with guessing what and when stolen. You should give me address where it ( your stolen crypto  from your address/ or transaction number ) was gone. And then I’ll give you connection tree and show where it was gone. Give me it like: 1. My crypto was stolen from this address2. This is transaction number3. This is scammer address4. This is token and amount stolenThen I’ll give you info where your crypto gone ( to what exchange for example ) Thx for understanding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "June 01, 2022, 01:47:50 PM",
      "body": "Quote from: Nicksnickname on May 31, 2022, 09:45:58 AMFor admins or moderators we can do job for finding crypto and marking addresses as scam with payment after. If you mean the moderators and admins of this forum, you should know that they are not engaged in any investigations - in other words, the scam is not moderated on this forum. As for investigations, it is relatively easy to find out where some coins ended up if that address is publicly known as the address of a CEX - just by using this site -> https://www.walletexplorer.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nicksnickname",
      "created_time": "June 01, 2022, 02:50:27 PM",
      "body": "Quote from: Lucius on June 01, 2022, 01:47:50 PMQuote from: Nicksnickname on May 31, 2022, 09:45:58 AMFor admins or moderators we can do job for finding crypto and marking addresses as scam with payment after. As for investigations, it is relatively easy to find out where some coins ended up if that address is publicly known as the address of a CEX - just by using this site -> https://www.walletexplorer.com/We don’t use free tools, cause they are often wrong. Only trust service with payment expensive subscribe- chainalysis/ crystalblockchain etc. We can do full analyses  of transactions with maximum lvl of accuracy. With this info you can go to police and made request from police to exchanges for info who behind those addresses ( verification info, IP addresses, email/ phone numbers, orders, withdrawal, deposits etc ). In some cases we can also help with this info for additional payment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceMobile",
      "created_time": "June 01, 2022, 02:53:32 PM",
      "body": "Quote from: Nicksnickname on May 31, 2022, 09:45:58 AMFor admins or moderators we can do job for finding crypto and marking addresses as scam with payment after.There's the case of bitcoins from a forum treasurer who died, after which the 250 Bitcoins moved. You don't have access to the Investigations board, so you can't read the most recent information.I think the reward theymos offered is 20% of anything recovered. How's that for a chance to prove your skills?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nicksnickname",
      "created_time": "June 01, 2022, 02:54:25 PM",
      "body": "Quote from: Nicksnickname on June 01, 2022, 02:50:27 PMQuote from: Lucius on June 01, 2022, 01:47:50 PMQuote from: Nicksnickname on May 31, 2022, 09:45:58 AMAs for investigations, it is relatively easy to find out where some coins ended up if that address is publicly known as the address of a CEX - just by using this site -> https://www.walletexplorer.com/We don’t use free tools, cause they are often wrong. Only trust service with payment expensive subscribe- chainalysis/ crystalblockchain etc. We can do full analyses  of transactions with maximum lvl of accuracy. With this info you can go to police and made request from police to exchanges for info who behind those addresses ( verification info, IP addresses, email/ phone numbers, orders, withdrawal, deposits etc ). In some cases we can also help with this info for additional payment. Quote from: Lucius on June 01, 2022, 01:47:50 PMQuote from: Nicksnickname on May 31, 2022, 09:45:58 AMIf you mean the moderators and admins of this forum, you should know that they are not engaged in any investigations - in other words, the scam is not moderated on this forum. For admins and moderators cause they have enough trust from us, that if they will order something- they will pay. For another category users- prepaid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nicksnickname",
      "created_time": "June 01, 2022, 02:57:26 PM",
      "body": "Quote from: LoyceMobile on June 01, 2022, 02:53:32 PMQuote from: Nicksnickname on May 31, 2022, 09:45:58 AMFor admins or moderators we can do job for finding crypto and marking addresses as scam with payment after.There's the case of bitcoins from a forum treasurer who died, after which the 250 Bitcoins moved. You don't have access to the Investigations board, so you can't read the most recent information.I think the reward theymos offered is 20% of anything recovered. How's that for a chance to prove your skills?I’m not sure that we understand each other right. I don’t tell that i will return btc. We can trace it. We can mark it.We have enough access to tools for tracing. We can give enough info for investigation that you don’t know but it will help for police to give any chance with returning moneys. Of course if we traced crypto, if we marked it, if it didn’t move to exchanges ( there is some nuances) etc.And i made free proposal for random 2 person to show my skills with tracing and showing where their crypto gone;)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceMobile",
      "created_time": "June 01, 2022, 03:04:17 PM",
      "body": "Quote from: Nicksnickname on June 01, 2022, 02:57:26 PMI don’t tell that i will return btc. We can trace it. We can mark it.Bitcoin is fungible. Stop trying to convince people it's not, and stop using services that treat Bitcoin as if it's not fungible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nicksnickname",
      "created_time": "June 01, 2022, 03:08:15 PM",
      "body": "Quote from: LoyceMobile on June 01, 2022, 03:04:17 PMQuote from: Nicksnickname on June 01, 2022, 02:57:26 PMI don’t tell that i will return btc. We can trace it. We can mark it.Bitcoin is fungible. Stop trying to convince people it's not, and stop using services that treat Bitcoin as if it's not fungible.Lmao you have no glue what are you talking about. Please stop spam in my tread if you don’t know anything about chainanalys, thx",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "June 01, 2022, 03:08:43 PM",
      "body": "Quote from: Nicksnickname on June 01, 2022, 10:08:12 AMI can give you connections tree of your address to know where it was gone. ~snipDon't do it, I don't want to continue, I've changed my mind. It's like the wind suddenly changed, I'm sorry.Looks like I don't need your help anymore. I know how to understand a transaction somehow.I'm sorry again if I bothered you and thank you for answering my first reply.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "saxydev",
      "created_time": "June 04, 2022, 12:45:39 PM",
      "body": "Basically you do not recover crypto, you are just following where the money went and that's it.As I work for AML in crypto for half year I can say this is quite a tough job!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nicksnickname",
      "created_time": "June 04, 2022, 07:09:50 PM",
      "body": "Quote from: saxydev on June 04, 2022, 12:45:39 PMBasically you do not recover crypto, you are just following where the money went and that's it.Exactly. To make crypto back it’s hard job, with huge percentage of nuances. And yes, job hard enough 🤝",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}