{
  "id": "topic_5400252",
  "title": "breakey",
  "author": "breakey",
  "created_time": "May 26, 2022, 09:28:23 AM",
  "content": "hi there.I am here since i found a few similiar complaints and most of them take many days to even get a response.I hope there's a stake.com representative here that can help me because the live support only says send an email to accounts@stake.com and wait for a response.but the problem is their response this is ridicilous i haven't had any communication with them at this time.i am already playing on stake for like a year or so.the problem is i was playing and suddenly i couldn't withdraw i noticed because i wanted to withdraw 400 eos. it said youre not allowed to do that when withdrawing,on the other hand depositing was no problem since i deposited lost 2 grand yeterday and came back up to $1500.after i noticed my withdraw function was locked i still could place sports bet play casino etc so i tought it was a site error wich would be solved.So i continued playing and after 2-3 hours sunddenly i was also blocked from placing sports bet and casino bets basicly my whole account was locked by then.then i went to live support and they said they could see integrity had left i note i had to send them an email so i did and i still did not recieve a response on that email and looking into other similiar issues it will take days for them to even respond let alone solve the whatever the problem is.live support can't do anything for me i have to wait for the accounts@stake.com reply but anyway its verry sad that if a website blocks your account they don't contact you by themself but you have to contact them.....beside of that its also not done to let people wait on crypto sites for more then a day for a simple response simply because crypto is volatile and my 1150 eos wich was worth yesterday $1550 is now around $1450 so i basicly lost $100 meanwhile in the waiting time, its unacceptable for me that you get a threatment like this.so i hope there's someone here from stake who can help me solve this problem in a normal timeframe. if a representative is here username is shiteplayer please unlock my withdraw function then i flee you site with lightspeed after this threatment thanks.thanks verry much peoplehave a good day.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400252",
  "comments": [
    {
      "author": "acroman08",
      "created_time": "May 26, 2022, 11:19:54 AM",
      "body": "their representative here in the forum are Stunna and Symphonized. Stunna usually reply to an issue like this when he sees it but he hasn't been online for several days, Symphonized on the other hand is actively posting on their thread. try posting this issue on their thread to get more exposure and be easily seen by their representative.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "May 27, 2022, 08:33:52 AM",
      "body": "Quote from: breakey on May 26, 2022, 09:28:23 AMso i hope there's someone here from stake who can help me solve this problem in a normal timeframe. if a representative is here username is shiteplayer please unlock my withdraw function then i flee you site with lightspeed after this threatment thanks.thanks verry much peopleNow that you posted it here you'll get your answer right away, although the representative seldom logs in Stake will be alarmed by this issue, this is your version of the story I'm sure there is an issue on your account why they restrict your account, like all the other complaints here, there will be an investigation on your account you just can't request to lift the restriction, if you're not doing anything wrong you'll be fine, let hem do an investigation first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "May 27, 2022, 02:07:55 PM",
      "body": "Live support should be the one to rely this on the concern department, since its their purpose to provide a quick support, we know the support on email are not responding right away and this is the problem on many site. Anyway, since you're a player on Stake for a year now I wonder why they restrict you from withdrawing while still allow you to deposit and gamble. Most probably they will ask for more verification, try to keep on contacting them and raise your concern until someone helps you with this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "edgycorner",
      "created_time": "May 27, 2022, 08:54:52 PM",
      "body": "It would be great if you can attach some evidence with your accusation.Like:Screenshot of your account's status, and how your account is blocked(also cover your balance and activities)Screenshot of all the conversations(chat or email) you had with themDeposit transactionsRight now your accusation is like a story. Present your case with proof, to receive serious attention.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "May 28, 2022, 01:28:58 PM",
      "body": "Quote from: edgycorner on May 27, 2022, 08:54:52 PMIt would be great if you can attach some evidence with your accusation.Like:Screenshot of your account's status, and how your account is blocked(also cover your balance and activities)Screenshot of all the conversations(chat or email) you had with themDeposit transactionsRight now your accusation is like a story. Present your case with proof, to receive serious attention.And I agree all who will file a complaint here should follow the right format, not just a story, Follow this format to back up your claim based on your accusation, if you did not violate anything your issue will be resolved, but of course, you need to be patient.Code:[b][color=black]What happened:: [/color][/b][b][color=black] Profile Link: [/color][/b][b][color=black]Reference Link: [/color][/b][b][color=black]Amount Scammed: [/color][/b][b][color=black]Payment Method: [/color][/b][b][color=black]Proof of Payment: [/color][/b][b][color=black]PM/Chat Logs: [/color][/b][b][color=black]Additional Notes: [/color][/b]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ScamViruS",
      "created_time": "May 28, 2022, 03:44:41 PM",
      "body": "Since they said to mail you a specific email then I think you should have contacted that email. They have representatives in this forum, so you'll probably get a reply from them soon and come up with a solution. But if you keep communicating in the way they said, you might get a solution. Since you have been playing on this website for a long time and have not encountered any problem, it is a matter of wondering why this problem started suddenly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "May 28, 2022, 11:12:04 PM",
      "body": "from what i understand you contacted live support and they told you to email the other support and you sent the email but they still haven't replied, how long has it been since you send email? if 7 days had passed without them having answered you and resolved your problem then I think it would make more sense for you to create this thread, I understand that it must be worrying to have your account blocked and to see that your money is stuck and getting reduced because every cryptocurrency market is going down, but you need to wait more days to see if they will answer you or not! in any case do as other members said: contact Stunna, it is not very active but at least when it is active it will tell you what is happening with your account",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}