{
  "id": "topic_5458909",
  "title": "Sheamas",
  "author": "Sheamas",
  "created_time": "July 07, 2023, 02:57:14 AM",
  "content": "The Chinese USD rating is collpase down to a history point, and obviously it's a very convenient time for any purchasing as business schedule.If you are an international company looking to purchase wholesale products from China, or are interested in investing in Chinese real estate or other opportunities, we can help. As a purchasing agent based in China, we have the expertise and resources to assist you in every step of the process.Our services include:1.Product sourcing and supplier selection: We have a vast network of reliable suppliers across China, and can help you find the best products at the most competitive prices. We will handle all negotiations and paperwork on your behalf, ensuring a smooth and hassle-free process.2.Quality control: We understand the importance of quality control, and will conduct thorough inspections of all products before they are shipped to you. We will also handle any necessary repairs or returns.3.Logistics and shipping: We will arrange for the most efficient and cost-effective shipping options, and will handle all customs and documentation procedures to ensure that your products arrive on time and in good condition.4.Real estate investment: If you are interested in investing in Chinese real estate, we can provide you with expert advice and guidance on the best opportunities available. We can also handle all legal and administrative procedures, ensuring that your investment is secure and profitable.5.Other services: We can provide a wide range of other services, including translation, interpretation, and business consulting. Whatever your needs may be, we are committed to providing you with the highest level of service and support.At our international import and export company, we pride ourselves on our professionalism, expertise, and commitment to customer satisfaction. If you are interested in purchasing wholesale products from China, or investing in Chinese real estate or other opportunities, please don't hesitate to contact us. We look forward to working with you.Any buyers who are interesting with the above, can add my whatsapp or skype please, 0086 150 0538 3721 Sheamas",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458909",
  "comments": [
    {
      "author": "Freedom4All",
      "created_time": "July 07, 2023, 06:13:16 PM",
      "body": "I don´t understand exactly what you are saying?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "July 07, 2023, 09:59:27 PM",
      "body": "Quote from: Freedom4All on July 07, 2023, 06:13:16 PMI don´t understand exactly what you are saying?He is saying that he will be your contact person in ChinaWant to buy shoes? He will do it for you and ship it to you. Want to invest in real estate in China, he will be your contact personIMO, there is no way you can trust such a stranger with zero reputation, yet we have marketplaces like Alibaba, Aliexpress that offer similar services, act as escrow and even have buyer protection and trade assurance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "July 07, 2023, 10:44:36 PM",
      "body": "OP do you not think dropping your contact number would be very dangerous and exposing you to scammers and possibly hackers? would it not have been better you had asked for any prospective client to slide in your dm there and then you exchange contact. This is a public platform and as such one must be very cautious how they release  sensitive information.I checked your profile and discovered you have been here for a year plus but not active. You only have just 5 activity and you think members would be comfortable dealing with an account with no reputation. You have a good business proposals but I think you should come up with a safer means where by your prospective clients would be comfortable dealing with you.You did not tell us your organisation name and website So we could do further research or are you hiding anything from us?If you can do escrow with any reputable member here, I think you would be  a listening ear. Anything otherwise,  I doubt if you would get the attention you desire  here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "July 08, 2023, 03:05:01 PM",
      "body": "He is talking about dropshipping, all I know is this is not how dropshipping companies do their business they have their page or their website and they have an Alibaba account to showcase their business, their achievement, and their past clients, they are very transparent, because dropshipping thrive in trust.For all, we know you are just an individual who knows how to sweet talk potential victims I don't want to refer to them as clients because you are not showing anything that will prove that you are a legit agent with contact to legit businesses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "July 08, 2023, 05:53:34 PM",
      "body": "I was planning on buying a good laptop from China as I learned they seem cheaper over there, this could be your opportunity to really Prove to us all here that all this sweet talks isn't just to lure clients and scam them.I need a laptop, no particular product to specification in mind yet, if you see this, then please reach out to me in dm, but please note, I am not sending a dime to you until I receive the product, we can employ the services of an escrow from this forum, I will take care of the fees, I will send your money(in bitcoin) to him, he will hold, then release to you as soon as i receive the product..Contact me via dm if you agree and ready for this business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "July 09, 2023, 12:29:33 AM",
      "body": "Quote from: Fivestar4everMVP on July 08, 2023, 05:53:34 PMI was planning on buying a good laptop from China as I learned they seem cheaper over there, this could be your opportunity to really Prove to us all here that all this sweet talks isn't just to lure clients and scam them.I need a laptop, no particular product to specification in mind yet, if you see this, then please reach out to me in dm, but please note, I am not sending a dime to you until I receive the product, we can employ the services of an escrow from this forum, I will take care of the fees, I will send your money(in bitcoin) to him, he will hold, then release to you as soon as i receive the product..Contact me via dm if you agree and ready for this business. China is a tech hub so I would not be surprised if a laptop is quite cheap and affordable there though. I was expecting other gadgets too to be very cheap as well. It is nice you are taking such a step to do business with OP and I also want to support your move as you have requested the services of an escrow to stand in as it happens that OP has not have much reputation to be trusted with funds when OP has no one to vouch for their services and their credibility. Looking forward to seeing the outcome of this deal before I would follow suit as I am interested in OP's services.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beerwizzard",
      "created_time": "July 09, 2023, 02:53:48 PMLast edit: July 09, 2023, 05:14:14 PM by Beerwizzard",
      "body": "Quote from: Fivestar4everMVP on July 08, 2023, 05:53:34 PMI need a laptop, no particular product to specification in mind yet, if you see this, then please reach out to me in dm, but please note, I am not sending a dime to you until I receive the product, we can employ the services of an escrow from this forum, I will take care of the fees, I will send your money(in bitcoin) to him, he will hold, then release to you as soon as i receive the product..As per your plan, someone will have to freeze a portion of his own money till he gets the escrowed payment. I doubt that someone will manage to build a stable business like that.Better just make an order on Alibaba.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beerwizzard",
      "created_time": "July 09, 2023, 02:56:06 PM",
      "body": "del",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Broadanbig",
      "created_time": "July 09, 2023, 03:22:01 PM",
      "body": "Quote from: Beerwizzard on July 09, 2023, 02:53:48 PMQuote from: Fivestar4everMVP on July 08, 2023, 05:53:34 PMI need a laptop, no particular product to specification in mind yet, if you see this, then please reach out to me in dm, but please note, I am not sending a dime to you until I receive the product, we can employ the services of an escrow from this forum, I will take care of the fees, I will send your money(in bitcoin) to him, he will hold, then release to you as soon as i receive the product..As per your plan, someone will have to freeze a portion of his own till he gets the escrowed payment. I doubt that someone will manage to build a stable business like that.Better just make an order on Alibaba.If there is no trial would there be an outcome? If he says he wants to patronize OP Services, is there anything wrong with that? Come to talk of it, escrowed funds are held by third parties as a means of guarantee that the buyer is willing and ready to deal as the case maybe.This would encourage other vendors to follow suit if this market deal between the parties scales through successful",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sheamas",
      "created_time": "July 10, 2023, 03:33:59 AM",
      "body": "Quote from: JeromeTash on July 07, 2023, 09:59:27 PMQuote from: Freedom4All on July 07, 2023, 06:13:16 PMI don´t understand exactly what you are saying?He is saying that he will be your contact person in ChinaWant to buy shoes? He will do it for you and ship it to you. Want to invest in real estate in China, he will be your contact personIMO, there is no way you can trust such a stranger with zero reputation, yet we have marketplaces like Alibaba, Aliexpress that offer similar services, act as escrow and even have buyer protection and trade assurance.Actrually I am now major as an purchasing agent for two customers, a Canada and another South Africa, and mainly on furniture, especially leisure furniture and office furniture including kinds of chairs and sofa, you're right that it's really hard to trust such a stranger with zero reputation like me, even you can make it via Alibaba, Made-In-China or something else. While I dont think it's a mistake and I just want to share an ADs for myself and have one more channel to expand the commercial chances to try do more things and make my life more interesting. It's also surely acceptable that hardly get trust, but it's a chance, isnt it？ So I tried.By the way, there are some tips for person who interesting1. I do B2B, not to C, I mean I do wholesale sevices2. I do services company to company, not personally3. My Hongkong account accept company to company T/T, no person to meThanks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Broadanbig",
      "created_time": "July 10, 2023, 09:41:38 AM",
      "body": "Quote from: Sheamas on July 10, 2023, 03:33:59 AMQuote from: JeromeTash on July 07, 2023, 09:59:27 PMQuote from: Freedom4All on July 07, 2023, 06:13:16 PMI don´t understand exactly what you are saying?He is saying that he will be your contact person in ChinaWant to buy shoes? He will do it for you and ship it to you. Want to invest in real estate in China, he will be your contact personIMO, there is no way you can trust such a stranger with zero reputation, yet we have marketplaces like Alibaba, Aliexpress that offer similar services, act as escrow and even have buyer protection and trade assurance.Actrually I am now major as an purchasing agent for two customers, a Canada and another South Africa, and mainly on furniture, especially leisure furniture and office furniture including kinds of chairs and sofa, you're right that it's really hard to trust such a stranger with zero reputation like me, even you can make it via Alibaba, Made-In-China or something else. While I dont think it's a mistake and I just want to share an ADs for myself and have one more channel to expand the commercial chances to try do more things and make my life more interesting. It's also surely acceptable that hardly get trust, but it's a chance, isnt it？ So I tried.By the way, there are some tips for person who interesting1. I do B2B, not to C, I mean I do wholesale sevices2. I do services company to company, not personally3. My Hongkong account accept company to company T/T, no person to meThanksSorry mate if that is your criteria then i think you missed it here because no one would listen to you in any way not to talk of having a deal with you. To the best of my knowledge, most deals of this nature here are on individual basis and not organisational hence they demand for escrow services for transparency and credibility. So if truly you want to deal, you would have to step down to the normal forum criteria so as to gain your trust first before thinking of the above you have listed otherwise I do not think members here would be comfortable dealing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sheamas",
      "created_time": "July 10, 2023, 09:46:25 AM",
      "body": "Thanks your advice, sincerely with my best wishes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "July 10, 2023, 10:29:00 AM",
      "body": "Quote from: Sheamas on July 10, 2023, 03:33:59 AMActually I am now major as an purchasing agent for two customers, a Canada and another South Africa, and mainly on furniture, especially leisure furniture and office furniture including kinds of chairs and sofa, you're right that it's really hard to trust such a stranger with zero reputation like me, even you can make it via Alibaba, Made-In-China or something else. While I dont think it's a mistake and I just want to share an ADs for myself and have one more channel to expand the commercial chances to try do more things and make my life more interesting. It's also surely acceptable that hardly get trust, but it's a chance, isnt it？ So I tried.It's not you, you may have a good intention to offer your service but the community had bad experiences with newbies offering different services and products only to end up scamming members who are not good at checking if the service is legit unless you can show something that will secure those who will avail the service or products.If you could be more transparent and offer guarantees that will not be a problem, it's different if you established your reputation here, dealing online is more on transparency and reputation, Alibaba established its reputation and network because it guaranteed the sellers' security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Broadanbig",
      "created_time": "July 10, 2023, 05:17:57 PM",
      "body": "Quote from: aioc on July 10, 2023, 10:29:00 AMQuote from: Sheamas on July 10, 2023, 03:33:59 AMActually I am now major as an purchasing agent for two customers, a Canada and another South Africa, and mainly on furniture, especially leisure furniture and office furniture including kinds of chairs and sofa, you're right that it's really hard to trust such a stranger with zero reputation like me, even you can make it via Alibaba, Made-In-China or something else. While I dont think it's a mistake and I just want to share an ADs for myself and have one more channel to expand the commercial chances to try do more things and make my life more interesting. It's also surely acceptable that hardly get trust, but it's a chance, isnt it？ So I tried.It's not you, you may have a good intention to offer your service but the community had bad experiences with newbies offering different services and products only to end up scamming members who are not good at checking if the service is legit unless you can show something that will secure those who will avail the service or products.If you could be more transparent and offer guarantees that will not be a problem, it's different if you established your reputation here, dealing online is more on transparency and reputation, Alibaba established its reputation and network because it guaranteed the sellers' security.  It is nice you have said this sir. I said something similar to this and it is good it is repeating itself here again. OP would need to establish his or her credibility before thinking of this method he has proposed otherwise everything would be in futility.  OP proposals it is not bad but credibility and transparency matters so therefore if OP wants members to patronize his services, I think he should make it feasible for members here so that he could get turn up otherwise nobody would take such risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noormcs5",
      "created_time": "July 10, 2023, 05:47:55 PM",
      "body": "Quote from: JeromeTash on July 07, 2023, 09:59:27 PMQuote from: Freedom4All on July 07, 2023, 06:13:16 PMI don´t understand exactly what you are saying?He is saying that he will be your contact person in ChinaWant to buy shoes? He will do it for you and ship it to you. Want to invest in real estate in China, he will be your contact personIMO, there is no way you can trust such a stranger with zero reputation, yet we have marketplaces like Alibaba, Aliexpress that offer similar services, act as escrow and even have buyer protection and trade assurance.So he will be demanding for money before he could actually buy the product and send it to your country. So how can anyone trust a person with zero reputation on this forum. I do not say that he is dishonest, but what's the grantee that he will get our money and never send us our goods  Quote from: Sheamas on July 10, 2023, 03:33:59 AMBy the way, there are some tips for person who interesting1. I do B2B, not to C, I mean I do wholesale sevices2. I do services company to company, not personally3. My Hongkong account accept company to company T/T, no person to meSo you want to deal with companies who can take goods in bulk. But do you think that business (B) and companies will be comfortable dealing with a C (Customer). In order for B2B, you also need to have a company. So will you care to tell about your company ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "July 11, 2023, 11:16:12 PM",
      "body": "Quote from: noormcs5 on July 10, 2023, 05:47:55 PMQuote from: JeromeTash on July 07, 2023, 09:59:27 PMQuote from: Freedom4All on July 07, 2023, 06:13:16 PMI don´t understand exactly what you are saying?He is saying that he will be your contact person in ChinaWant to buy shoes? He will do it for you and ship it to you. Want to invest in real estate in China, he will be your contact personIMO, there is no way you can trust such a stranger with zero reputation, yet we have marketplaces like Alibaba, Aliexpress that offer similar services, act as escrow and even have buyer protection and trade assurance.So he will be demanding for money before he could actually buy the product and send it to your country. So how can anyone trust a person with zero reputation on this forum. I do not say that he is dishonest, but what's the grantee that he will get our money and never send us our goods  Quote from: Sheamas on July 10, 2023, 03:33:59 AMBy the way, there are some tips for person who interesting1. I do B2B, not to C, I mean I do wholesale sevices2. I do services company to company, not personally3. My Hongkong account accept company to company T/T, no person to meSo you want to deal with companies who can take goods in bulk. But do you think that business (B) and companies will be comfortable dealing with a C (Customer). In order for B2B, you also need to have a company. So will you care to tell about your company ?Initially I thought OP was serious with the business offer here but when I saw the second phase of the offer on the subsequent post made by OP, I became sceptical of OPs intentions here. If OP decides not to go by the forum standard of using an escrow, the OP chances of doing business here is minuit as nobody would reason his direction anymore for the fact that OP has no reputation here to hold onto for anything deals that involves funds. Not until an escrow is involved, anything otherwise is a waste of time. If OP wants to deal, OP should step  to forum standard anything outside of that OP should not bother as nobody would look his or her direction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sheamas",
      "created_time": "July 21, 2023, 01:10:42 AM",
      "body": "Never thought that my advertisement article would lead to so heated discussion.Anyway, all are some really exist reasonable and based on this forum suggestions,thanks all your time and advices.To all friends here",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}