{
  "id": "topic_5407939",
  "title": "LBC_victim",
  "author": "LBC_victim",
  "created_time": "July 28, 2022, 03:43:06 PMLast edit: July 28, 2022, 08:52:55 PM by LBC_victim",
  "content": "Be aware of the fraudulent company localbitcoins.com. They locked my accout without any reason. Reverification succeded 2 times, but my account got locked instanly again. And now they dont reply handle my costumer tickets. They just refere to a support ticket that does not exists.The company is based in Finland run by russian scammers right? I have no contacts in Finland is there a way to hire somebody there who visit the company to get more information?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407939",
  "comments": [
    {
      "author": "stompix",
      "created_time": "July 28, 2022, 04:26:47 PM",
      "body": "Quote from: LBC_victim on July 28, 2022, 03:43:06 PMThe company is based in Norway run by russian scammers.Oh here we go again, same story, Russian scammers, Russian mafia, I've seen this kind of pattern nearly a hundred times and it's always without proof. Second, get your story right, Localbitcoins is and was based for its entire history in Finland and it has all the Finish licenses it needs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "July 28, 2022, 09:47:03 PM",
      "body": "This is not a proper accusation. How are we supposed to know that what you are saying is true?Follow the proper scam reporting format in this thread so that we can get a deep dive into the whole story.You will end up getting scammed even further by random strangers seeking to help you. Be careful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LBC_victim",
      "created_time": "July 30, 2022, 04:51:05 AM",
      "body": "Quote from: logfiles on July 28, 2022, 09:47:03 PMThis is not a proper accusation. How are we supposed to know that what you are saying is true?Follow the proper scam reporting format in this thread so that we can get a deep dive into the whole story.You will end up getting scammed even further by random strangers seeking to help you. Be careful.Thanks for your suggestion. What if LBC see its(what I am expecting) and file a case against me for cyber crime? In my country you are not allowed to expose scam or discirmination. You will end up in prison for a few  years if you do so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrimeNumber7",
      "created_time": "July 30, 2022, 05:48:43 AM",
      "body": "Quote from: LBC_victim on July 30, 2022, 04:51:05 AM[What if LBC see its(what I am expecting) and file a case against me for cyber crime? In my country you are not allowed to expose scam or discirmination. You will end up in prison for a few  years if you do so.What county are you from? Although your story has little credibility as it lacks any supporting details or evidence, I have to ask why exactly you are posting about being scammed if exposing a scam in your country subjects you to years in jail?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "July 31, 2022, 08:44:36 PM",
      "body": "Quote from: stompix on July 28, 2022, 04:26:47 PMOh here we go again, same story, Russian scammers, Russian mafia, I've seen this kind of pattern nearly a hundred times and it's always without proof. Anything goes wrong on internet, Russians are there to take the blame LOLQuote from: LBC_victim on July 28, 2022, 03:43:06 PMThe company is based in Finland run by russian scammers right? I have no contacts in Finland is there a way to hire somebody there who visit the company to get more information? As far as I know they have legal entity which means you can take them to the court. Why not take that route? $50 is a lot of money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "August 01, 2022, 07:07:48 PM",
      "body": "$50k is not a small amount. So if you are certain you didn't violate any of their terms of service then you should hire a lawyer and sue them.Any company should explain why they had to ban a customer so he knows what he did wrong. And even if the customer has violated their terms, this doesn't give them the right to seize his money. They can ban his account and prevent him from using any of their services in the future but they have to send him back the money he deposited. Otherwise, this is a pure robbery. Just my two sats!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "August 02, 2022, 07:21:48 AM",
      "body": "My advice is thinking hard if LocalBitcoins could have any reason to close your account and be honest about it. You don't have to post it here because no one can help you resolve your issues with that service provider. After you have done some thinking, start reading through their terms of service and consider if you broke any of them. Again, be honest about it. If you notice that you did something you were not supposed to, check what the TOS state are the repercussions about that breach of rules. If you haven't done anything wrong (after reading the TOS), you can start thinking about legal actions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "August 03, 2022, 10:41:23 PM",
      "body": "As far as I know, LocalBitcoins seems to me to be one of best and long standing p2p exchange from way back, I have an account with them which I've never used and already abandoned due to verification issues.An accusation like this against a company that have been in existence for the past or over five years, and without prove will be very hard to believe.My advice is that you should check properly to make sure you are doing something wrong.And secondly, consider posting screenshots, maybe of any conversation(s) you've previously had with the customer care before you were abruptly and indefinitely locked out of your account, maybe through this, the community can be able to figure out what went wrong and possibly advice you on what to do in the case that it's true that LocalBitcoins is attempting to or have scammed you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "August 05, 2022, 07:51:38 PM",
      "body": "Quote from: LBC_victim on July 30, 2022, 04:51:05 AMThanks for your suggestion. What if LBC see its(what I am expecting) and file a case against me for cyber crime? In my country you are not allowed to expose scam or discirmination. You will end up in prison for a few  years if you do so.First time where you can't expose scams even though you are a victim. Does it mean your country does not support cryptocurrency? If so then it's fine. Otherwise, it is a stupid rule or you can't express exactly the actual situation. Instead, you should have the right to file a case against LocalBitcoin. Because they block your account without reason. Are you sure you haven't done anything wrong and your clients haven't reported you? Make sure everything if you intend to take legal action.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ScamViruS",
      "created_time": "August 06, 2022, 07:58:10 PM",
      "body": "Quote from: LBC_victim on July 28, 2022, 03:43:06 PMBe aware of the fraudulent company localbitcoins.com. They locked my accout without any reason. Reverification succeded 2 times, but my account got locked instanly again. And now they dont reply handle my costumer tickets. They just refere to a support ticket that does not exists.The company is based in Finland run by russian scammers right? I have no contacts in Finland is there a way to hire somebody there who visit the company to get more information? No one knows about your problem in detail and is not sure what the solution can be. Because you have not given any evidence here, since there is no evidence here, it is not clear what kind of incident you are facing. Because it is not possible to come to the conclusion of anything unilaterally. Because you may have done some activity that violates their TOS, and based on that they blocked your account! So community members cannot give you any solutions due to lack of information here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}