{
  "id": "topic_5466116",
  "title": "sabotag3x",
  "author": "sabotag3x",
  "created_time": "September 08, 2023, 01:35:19 PM",
  "content": "Em qual preço o Bitcoin fechará o ano de 2023?A resposta que chegar mais perto ganhará 0,001 BTC Regras:Valores em dólares. [xx.xxx,xx USD];Preço do BTC/USD na Bitstamp no horário de fechamento de 2023 (23:59:59 UTC).Permitido contas criadas antes dessa postagem e que tenham 1 merit;Data limite para entradas: 30/09/2023.Boa sorte!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466116",
  "comments": [
    {
      "author": "sabotag3x",
      "created_time": "September 08, 2023, 01:36:08 PMLast edit: September 28, 2023, 04:57:54 AM by sabotag3x",
      "body": "Entradas:26.269,42 USD — @Lucasgabd27.345,28 USD — @thiagothx137028.000,00 USD — @Paredao28.999,00 USD — @rdluffy29.400,00 USD — @TryNinja30.145,10 USD — @joker_josue30.500,00 USD — @darkv0rt3x33.333,33 USD — @bitmover35.000,00 USD — @batmanoftheblock36.100,00 USD — @tg8837.500,00 USD — @Disruptivas43.400,00 USD — @alegotardo",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "September 08, 2023, 02:39:32 PM",
      "body": "Ótima iniciativa, eu lembro de ter participado de previsões assim na aba geral, mas na aba portuguesa não lembro se já teve antes ou é algo inédito. Lá na geral as chances são quase como minerar um bloco com um NerdMiner  , mas por aqui as chances já melhoram bastante.Minha aposta:Valores em dólares. [36.100,00 USD];",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "September 08, 2023, 05:06:09 PM",
      "body": "Os dois apostando em 36100? Sabem de algo que não sei?  edit: percebi agora que a tal “entrada” do sabotag3x é na verdade a lista de entradas dos usuários (que só inclui a do tg )Vou ser mais bearish e chutar baixo… e isso que estou considerando uma possivel aprovação do ETF da Grayscale ou Blackrock.$29400",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "September 08, 2023, 05:35:51 PM",
      "body": "Quote from: TryNinja on September 08, 2023, 05:06:09 PMSabem de algo que não sei?Eu não sei de algo que você sabe.. seu bot funciona nesses \"sorteios\"? pensei em usá-lo, mas acredito que esteja programado para outro modelo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "September 08, 2023, 06:49:09 PM",
      "body": "Quote from: sabotag3x on September 08, 2023, 05:35:51 PMQuote from: TryNinja on September 08, 2023, 05:06:09 PMSabem de algo que não sei?Eu não sei de algo que você sabe.. seu bot funciona nesses \"sorteios\"? pensei em usá-lo, mas acredito que esteja programado para outro modelo.Não funciona. A única coisa que o bot está programado para fazer é aceitar links de tópicos.Porém a ideia sempre foi uma modularidade para que seja possível desenvolver outros tipos de sorteios e “games”. Posso desenvolver uma opção para criar sorteios que aceitam uma entrada de texto de cada user (datas, preços, nomes, …), criando inúmeras possibilidades como essa.“Qual moeda vai crescer mais em 2024?”“Qual o preço do BTC em X”Ai o user posta, o bot atualiza a lista, e no final o dono do sorteio usa um comando para fechar para novas entradas e ele mesmo vê o resultado e realiza o pagamento.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "September 09, 2023, 05:27:58 PM",
      "body": "Não gostei muito da aposta de vocês na verdade , espero que os dois estejam bem errados e não ganhem o sorteio  Acho que setembro vai ser ruim pro mercado cripto ainda. MAs Outubro e novembro são meses bons e ai já estaremos super próximos do halving.Mas olhando o gráfico, é um pouco dificil sugerir algo muito longe. Entã vou chutar em US$ 37.500 que é a resistencia de abril de 2022.Mas espero que eu esteja errada também e possamos acabar o ano pelo menos em US$ 45",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "September 09, 2023, 08:26:36 PM",
      "body": "Quote from: Disruptivas on September 09, 2023, 05:27:58 PMNão gostei muito da aposta de vocês na verdade , espero que os dois estejam bem errados e não ganhem o sorteio  >:Lendo a tua mensagem logo fui concluindo que tu ia jogar a aposta lá para os 100k     Mas na realidade foi apenas 1k acima da minha.Eu acho que a maioria das apostas vão ficar nesse range que já temos 29 a 36 e talvez quem fizer uma mais ousada tanto pra cima quanto para baixo também tem certo potencial pois pegaria as margens de algo muito bom ou muito ruim acontecer no período.  Mas pelo visto a maioria está aguardando o prazo final para tirar uma conclusão e fazer a aposta.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "September 09, 2023, 10:11:26 PM",
      "body": "Quote from: tg88 on September 09, 2023, 08:26:36 PMLendo a tua mensagem logo fui concluindo que tu ia jogar a aposta lá para os 100k     Mas na realidade foi apenas 1k acima da minhaKkkkkEu também achei que ia fazer uma sugestão bem acima hahahahÉ que eu li e fiquei af que desanimados. Como assim? Ontem mesmo eu estava achando que já ia chegar em $35k. Aí foi olhar o gráfico pra responder e fazer minha aposta e achei meio longe tudo kkk e aí vocês pareceram ter razão. Eu olho o gráfico sempre, mas mesmo assim me surpreendo as vezes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "September 10, 2023, 01:54:03 AMLast edit: September 11, 2023, 12:17:39 AM by alegotardo",
      "body": "Cara, eu sempre fui muito crítico contra essas pessoas que tentam prever o preço do Bitcoin, mas também não consigo deixar de dar meu chute quando me perguntam ou dão essa possibilidade pra mim.Pois bem, consultando os astros aqui, cheguei à conclusão de que certamente será acima de $ 30k... eu já cheguei a prever um tempo atrás que até 2024 estariamos nos $ 100k, mas infelizmente houve alguns acontecimentos astronômicos inesperados que impediram isso de se realizar Mas falando sério, acho que sempre errei minhas previsões para menos nas últimas apostas que fizemos, então dessa vez vou chutar o balde.... minha aposta para o valor do BTC no último dia do ano é de $ 43.400k.Pode ter certeza, estarei estourando o espumante com uma mão e acompanhando o preço do BTC no celular com a outra",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "September 10, 2023, 06:43:07 AM",
      "body": "Sou tal e qual o @alegotardo. Não acho qualquer fundamento em quem tenta ganhar o que quer que seja com análises mirabulásticas e fantabulusas do que vai acontecer com o preço de Bitcoin no futuro, mas eu vou lançar a minha previsão é vai estar Cer tinga e eu vou ganhar isto. E posso fazê-lo diariamente com 100% de precisão.A minha previsão é: Metade e outro tanto.Hehegehe, está ganho. Podem enviar o prémio para mim. 😁😁",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 10, 2023, 07:01:29 PM",
      "body": "Como isto é uma brincadeira, e é assim que temos de olhar. Porque estes palpites, não tem nenhum objetivo de investimento, mas sim de divertimento, aqui vai o meu:$30.145,10 USD",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "September 10, 2023, 08:43:30 PM",
      "body": "Legal, gosto desses palpites pra tentar ganhar um prêmio  Vou fazer meu palpite e não vai ser nada popular: 28.999,00Mas já vou explicando, caso o BTC esteja bem acima disso, vou ficar bem feliz, mas se ele ficar nessa zona de preço, pelo menos posso ganhar um prêmio",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "September 10, 2023, 08:49:12 PM",
      "body": "Ao meu ver, o Bitcoin não ultrapassa os trinta mil dólares no final do ano. Talvez no começo de 2024, passando o ano-novo chinês, ele comece a subir e chegue na casa dos 40, 45 mil dólares. Não prevejo nenhum novo ATH nos próximos anos. Acredito que um novo ATH somente em 2026 ou 2027. Até lá, o negócio é esperar",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thiagothx1370",
      "created_time": "September 11, 2023, 10:11:22 AM",
      "body": "Quote from: sabotag3x on September 08, 2023, 01:35:19 PMEm qual preço o Bitcoin fechará o ano de 2023?A resposta que chegar mais perto ganhará 0,001 BTC Regras:Valores em dólares. [xx.xxx,xx USD];Preço do BTC/USD na Bitstamp no horário de fechamento de 2023 (23:59:59 UTC).Permitido contas criadas antes dessa postagem e que tenham 1 merit;Data limite para entradas: 30/09/2023.Boa sorte!$27,345.28 USD",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "September 11, 2023, 11:41:22 AM",
      "body": "Ok, então fora de brincadeiras e mesmo não ligando puto a estas previsões, porque sabemos bem que ninguém tem esse dom, por mais que alguns influencers queiram, vou mandar o meu bitaite para o ar, já que a minha sugestão anterior parece não ter sido aceite. hehehMas faço uma pequena sugestão, já que acertar em cheio até aos cêntimos de dolar parece-me quase impossível. A sugestão é que se permita um range de preços, por exemplo, um range de 1000 USD. Se a sugestão for aceite, a minha previsão é que o preço de Bitcoin a 31 de Dezembro de 2023 às 23:59:59 esteja entre 24500 USD e 25500 USD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "September 11, 2023, 12:46:52 PM",
      "body": "Quote from: darkv0rt3x on September 11, 2023, 11:41:22 AMMas faço uma pequena sugestão, já que acertar em cheio até aos cêntimos de dolar parece-me quase impossível. A sugestão é que se permita um range de preços, por exemplo, um range de 1000 USD. Se a sugestão for aceite, a minha previsão é que o preço de Bitcoin a 31 de Dezembro de 2023 às 23:59:59 esteja entre 24500 USD e 25500 USD.Não precisa acertar em cheio, só precisa chegar mais perto que os outros.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "September 11, 2023, 01:23:47 PM",
      "body": "Quote from: sabotag3x on September 11, 2023, 12:46:52 PMQuote from: darkv0rt3x on September 11, 2023, 11:41:22 AMMas faço uma pequena sugestão, já que acertar em cheio até aos cêntimos de dolar parece-me quase impossível. A sugestão é que se permita um range de preços, por exemplo, um range de 1000 USD. Se a sugestão for aceite, a minha previsão é que o preço de Bitcoin a 31 de Dezembro de 2023 às 23:59:59 esteja entre 24500 USD e 25500 USD.Não precisa acertar em cheio, só precisa chegar mais perto que os outros.Então o range que eu sugeri está fora de questão? Realmente também faz sentido ser como dizes. Por mim tudo bem. Só tenho que alterar a minha \"aposta\" para um valor exacto. E que dentro daquele range, vais ser um valor completamente ao calhas!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "September 11, 2023, 02:15:40 PM",
      "body": "Quote from: darkv0rt3x on September 11, 2023, 01:23:47 PMEntão o range que eu sugeri está fora de questão? Realmente também faz sentido ser como dizes. Por mim tudo bem. Só tenho que alterar a minha \"aposta\" para um valor exacto. E que dentro daquele range, vais ser um valor completamente ao calhas!Vou te dar uma dica se você quer ter mais chances em apostas como essa de quem chega mais perto do preçoSe você acredita nesse range de 24500 até 25500 é só você apostar no valor abaixo da aposta com menor valor até agora que é do thiagothx1370, assim todo range abaixo de 27.345,28 USD vai ser seuSe você quer esse range de qualquer forma, sua melhor aposta seria colocar 25.000,00, que provavelmente você conseguirá essa range",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "September 11, 2023, 02:23:32 PM",
      "body": "Quote from: rdluffy on September 11, 2023, 02:15:40 PMQuote from: darkv0rt3x on September 11, 2023, 01:23:47 PMEntão o range que eu sugeri está fora de questão? Realmente também faz sentido ser como dizes. Por mim tudo bem. Só tenho que alterar a minha \"aposta\" para um valor exacto. E que dentro daquele range, vais ser um valor completamente ao calhas!Vou te dar uma dica se você quer ter mais chances em apostas como essa de quem chega mais perto do preçoSe você acredita nesse range de 24500 até 25500 é só você apostar no valor abaixo da aposta com menor valor até agora que é do thiagothx1370, assim todo range abaixo de 27.345,28 USD vai ser seuSe você quer esse range de qualquer forma, sua melhor aposta seria colocar 25.000,00, que provavelmente você conseguirá essa rangeBom, depois de olhar de novo para o gráfico, devici-me por outro valor. Após uma análise mais cuidada de todos os indicadores, TA e FA e etc, lool, acho que o valor será o seguinte: 30500USD. Podem registar este valor! Tive que limpar a minha bola de cristal que estava cheia de po, mas depois a gaja brilhou! heheh",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}