{
  "id": "topic_5460350",
  "title": "Tolino",
  "author": "Tolino",
  "created_time": "July 19, 2023, 04:27:00 PMLast edit: July 19, 2023, 07:27:31 PM by Tolino",
  "content": "please delete this thread no longer needed thanks",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460350",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "July 19, 2023, 04:28:21 PM",
      "body": "Your account has been created since 2014 and no post until today. But that is not an offence. You can just forget about the account. Delete the password and do not login again. Your Bitcointalk account can not be deleted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "July 19, 2023, 04:41:45 PM",
      "body": "Quote from: Tolino on July 19, 2023, 04:33:03 PMI have privacy concerns please check again.This must be possible when I search other threads their account is deleted and their post appear under \"Anonymous\".Posting anonymously is an old feature of the forum that is now removed. Their account is not deleted but they just use anonymous posting feature before that’s why their account is displayed anonymous until now.Just delete all your post in the forum and report to moderators all the thread or post that can’t be deleted. Just include the reason and I’m sure it will be deleted.You can contact @tryninja, @loyceV and other user that scrape data to remove your post history. I get now your concern.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "July 19, 2023, 04:44:50 PMLast edit: July 19, 2023, 05:18:28 PM by stompix",
      "body": "Quote from: Charles-Tim on July 19, 2023, 04:28:21 PMYour account has been created since 2014 and no post until today. He has posted 3 times before thathttps://ninjastic.space/user/id/317240And this probably shows how hard it is in reality to get read of all your traces on the web and why OP should relly just let it go.Now with this topic, he has just brought more attention to it! Also, the irony:https://ninjastic.space/post/39794190From praising KYC to having privacy concerns!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "July 19, 2023, 04:47:36 PM",
      "body": "Quote from: Tolino on July 19, 2023, 04:27:00 PMHelloPlease delete my account and all its data.ThanksT👇👇👇Quote from: hilariousandco on March 04, 2018, 11:06:22 AMIt's not possible. Just abandon it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "July 19, 2023, 04:57:53 PM",
      "body": "You really don't have any valid data or information that truly identifies your real identity, and you definitely don't have anything to fear if you have committed any crime that you feel can be tracked through the different internet platforms and communities that you have registered on.Also, the forum moderators will not sell your IP, so you have nothing to fear. If you feel you don't want to use the account again, then just abandon it. Change the email and password to something you can't remember, then log out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "July 19, 2023, 05:15:08 PM",
      "body": "If there's nothing that can link your account to your identity then you can just change the password to random like pressing random letters on the keyboard then log out. If you didn't commit any crime then you would be okay to abandon your account without problem and it's not much hassle to do it since you only have to change the password and then log out. Try to contact theymos to make the OP anonymous although someone would still know. I think you might have known about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "July 19, 2023, 05:28:48 PM",
      "body": "If you have privacy concerns then you shouldn't do anything on the internet that can be linked to your real life identity, and you shouldn't also register on online forums with details that are connected to your identity in real life; because once you publish information about yourself on the internet, you can't completely erase it.It is not possible to delete your account, but Theymos can only change usernames to \"Anonymous\" if a user requests and he thinks it is worth doing, you don't have too much data in this forum, so just log out and forget that you ever had an account on Bitcointalk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "July 19, 2023, 05:54:36 PM",
      "body": "Op if you have any issue with your account, you can create thread for the problem then those who are in-charge it can solve the issue for you instead of deleting the account. You open this account on April 19, 2014, 03:31:19 AM and which means, you are not a newbie in the forum even though your account is still a newbie. And you know the stress to build account. In this your account to build activity will not hard as new account, you just need activeness to boost your account. So I advise you to refrain from the mindset of deleting the account. Instead resolve all problems in the forum and continue using the account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "July 19, 2023, 06:01:55 PM",
      "body": "@Tolino I didn't see nothing that can doxx your identity or something crucial regarding your previous activity here. With some millions of account created I don't think no one will notice your already deleted posts... just delete password, delete previous email (and change setting in your account to avoid to recover it) and that's all!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "July 19, 2023, 06:07:58 PM",
      "body": "What's there to check on your account details? Is it when you register in the forum? Or your account name is your real name or what? What exactly are you so terrified of that you want your account deleted at all costs? I'm asking all of this because I don't see why the forum account you made is causing you any anxiety given that you didn't disclose any personal information or submit any photos of yours. In the case of all this, to avoid further issues arising, just abandon the account and don't log in with it again. It's preferable that way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tolino",
      "created_time": "July 19, 2023, 07:26:16 PM",
      "body": "please delete this thread thank you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "July 19, 2023, 07:40:41 PM",
      "body": "Quote from: Tolino on July 19, 2023, 04:27:00 PMplease delete this thread no longer needed thanksIt's something you can also do by yourself without requesting the help of a moderator to do that for you if you really want to delete it, just wait after 24hrs and press the delete button to erase it, vut always know this that even if you deleted a thread, it has already been recorded that you made the post and archieved, another means to do so is to edit and put \"del.\" But what i still don't get about your request is what you have posted initially and why you needed it been deleted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "July 20, 2023, 10:58:16 AM",
      "body": "Quote from: Doan9269 on July 19, 2023, 07:40:41 PMQuote from: Tolino on July 19, 2023, 04:27:00 PMplease delete this thread no longer needed thanksIt's something you can also do by yourself without requesting the help of a moderator to do that for you if you really want to delete it, just wait after 24hrs and press the delete button to erase it, vut always know this that even if you deleted a thread, it has already been recorded that you made the post and archieved, another means to do so is to edit and put \"del.\" But what i still don't get about your request is what you have posted initially and why you needed it been deleted. It's written all over that op isn't interested in telling why he wants his account deleted which could be personal. And since deleting the account is not doable he should abandon the account and go about his normal life. Who knows, perhaps in the near future he might have reasons that may bring him back to the account and the account haven't default can still be used any point in time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}