{
  "id": "topic_5401847",
  "title": "SatoPrincess",
  "author": "SatoPrincess",
  "created_time": "June 08, 2022, 06:56:12 PM",
  "content": "A picture is worth a thousand words, to the average joe bitcoin is magic internet money that makes people rich, this myth clouds their investment decision and they buy what they do not understand. I made a sketch to describe how bitcoin started and where is going. The SeedBitcoin is the seed planted by Satoshi Nakamoto As a tree starts out as a small seedling and grows over a long time into a big, strong tree. The idea of Bitcoin in 2008 was still fragile and didn't have a lot of following as it does now. Water CanEvery seed planted need to be watered and nurtured to become a tree. The watercan to me represents the crypto community.  the early days, the first transactions with Bitcoin were done on Bitcointalk, forum members were amongst the first to exchanges goods and services for Bitcoin, the most famous transaction being Laszlo hanyecz buying pizza with 10,000 bitcoins. The transaction has become a history one as crypto fans have dedicated May 22 as Bitcoin Pizza day. The crypto community has been instrumental in the development of Bitcoin and other cryptocurrencies, even after Mt.Gox collapse, at times even when there were only negative news in the media about bitcoin, the community remained strong and kept the dream alive.Man in the MaskNo other than the pseudonym known as Satoshi Nakamoto. Satoshi is the creator of bitcoin, in the early days Satoshi Nakamoto was very active in bitcointalk though his account has been inactive since he disappeared from the internet. No one knows the true identity of this person or group of persons. The Bitcoin TreeThe Bitcoin Tree represents the life and growth of Bitcoin and how it has evolved the crypto space. It symbolizes the connection of Bitcoin to everything else. Bitcoin was just a seed planted by Satoshi Nakamoto but the roots of the Bitcoin Tree dig deep and spread into various sectors of economy. Bitcoin has gone beyond just being a digital currency, there are so many opportunities available in the space. In 2021, Bitcoin was officially adopted as legal tender in El Salvador.  Bitcoin is a unique cryptocurrency different from other cryptocurrencies (altcoins) created in the last decade. The Bitcoin Tree also symbolizes longevity because even as the tree grows old, it bears seeds that carry its core value so it lives on. Bitcoin has inspired the development of hundreds of thousands of other cryptocurrencies that have more use-cases than bitcoin. In conclusion, Bitcoin isn’t a money making scheme, the bitcoin white paper proves that. Since the inception of bitcoin, other cryptocurrencies have surfaced, some of them have profit ratios that are hard to resist. Before investing your money in any crypto project, you should look at all the variables such as the price history, total amount and supply of coins in circulation, chart patterns, e.t.c before making a judgment call.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401847",
  "comments": [
    {
      "author": "Rruchi man",
      "created_time": "June 08, 2022, 09:02:19 PM",
      "body": "Very creative illustration and good pencil sketch skills as well. I like thisQuote from: SatoPrincess on June 08, 2022, 06:56:12 PM The Bitcoin Tree also symbolizes longevity...because even though many branches of a tree may be cut down, the tree will also remain, even though a heavy wind blows, the tree which is deeply rooted will still remain.Newbies and others who may miss the point need to understand the direction of this discuss whish serves to prompt you to determine and verify how deeply rooted a project is (longetivity) before investing in it, and as a plant which requires patience to see it bloom, don't expect to get rich quick, because it takes time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "June 08, 2022, 09:57:23 PM",
      "body": "If I were you, I would have moved this thread to bitcoin discussion board. Just a suggestionThough bitcoin was planted by Satoshi Nakamoto and the reasons why he created bitcoin was to remove 3rd party transaction cost and also for digital cashless transaction etc. And people key into it and the good news is spreading to the seas, oceans, deserts and to everywhere in the world. That is the seed from the tree growing everywhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "June 09, 2022, 02:48:27 AM",
      "body": "Quote from: SatoPrincess on June 08, 2022, 06:56:12 PM Before investing your money in any crypto project, you should look at all the variables such as the price history, total amount and supply of coins in circulation, chart patterns, e.t.c before making a judgment call. Yes this is a must. But the problem here is most traders and investors are only putting their funds in order to gain profits quickly. Bitcoin is on the other level from these project. Variables are really important factors need to consider and I agreed with the idea in your bitcoin story. Be patience since money didnt grow that easily. Quote from: Agbe on June 08, 2022, 09:57:23 PMIf I were you, I would have moved this thread to bitcoin discussion board. Just a suggestionYes I agree with that. Its fits on that thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "June 09, 2022, 03:03:36 AM",
      "body": "You can actually do better illustration if the key objects are drawn using bond/oslo paper rather than ruled paper as it can greatly distort your drawing. Plus, to better your illustrations and give some life into it, try inking them to create a heavy contrast against the white surface of the paper you are using.I apologize for the remark about the illustration; its just that I enjoy reading short forms of contents with some sort of drawing because it makes the text more enjoyable and engaging to read.Would love to see a colorful illustration either on a traditional or digital drawing that discusses the basic technicalities behind bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "June 09, 2022, 05:23:26 AM",
      "body": "Quote from: SatoPrincess on June 08, 2022, 06:56:12 PM Before investing your money in any crypto project, you should look at all the variables such as the price history, total amount and supply of coins in circulation, chart patterns, e.t.c before making a judgment call. It was of recent i got to understand that these factors got a big role to play in the success of any crypto project. That is, a coin with a less smaller total amount in circulation of around 1million to 10million has a bigger chance and tendency to grow higher in price compared to a coin project with a largd total supply. As the law of demand and supply is meant to work here, which implies when the demand of a commodity is more than supply, it's price goes up to let only those who could afford it get it, and when the total supply is more than demand, price dropsSo same applies to crypto",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "June 13, 2022, 08:36:57 PM",
      "body": "Quote from: Maus0728 on June 09, 2022, 03:03:36 AMYou can actually do better illustration if the key objects are drawn using bond/oslo paper rather than ruled paper as it can greatly distort your drawing. Plus, to better your illustrations and give some life into it, try inking them to create a heavy contrast against the white surface of the paper you are using.I apologize for the remark about the illustration; its just that I enjoy reading short forms of contents with some sort of drawing because it makes the text more enjoyable and engaging to read.Would love to see a colorful illustration either on a traditional or digital drawing that discusses the basic technicalities behind bitcoin  No need to apologize, it’s good advice. I will do so next time. I plan on making more illustrations like this in the future. Quote from: CryptoHeadlineNews on June 09, 2022, 05:23:26 AMQuote from: SatoPrincess on June 08, 2022, 06:56:12 PM Before investing your money in any crypto project, you should look at all the variables such as the price history, total amount and supply of coins in circulation, chart patterns, e.t.c before making a judgment call. It was of recent i got to understand that these factors got a big role to play in the success of any crypto project. That is, a coin with a less smaller total amount in circulation of around 1million to 10million has a bigger chance and tendency to grow higher in price compared to a coin project with a largd total supply. As the law of demand and supply is meant to work here, which implies when the demand of a commodity is more than supply, it's price goes up to let only those who could afford it get it, and when the total supply is more than demand, price dropsSo same applies to cryptoIt’s more important to remember now when the market is red.Quote from: Rruchi man on June 08, 2022, 09:02:19 PMVery creative illustration and good pencil sketch skills as well. I like thisQuote from: SatoPrincess on June 08, 2022, 06:56:12 PM The Bitcoin Tree also symbolizes longevity...because even though many branches of a tree may be cut down, the tree will also remain, even though a heavy wind blows, the tree which is deeply rooted will still remain.Newbies and others who may miss the point need to understand the direction of this discuss whish serves to prompt you to determine and verify how deeply rooted a project is (longetivity) before investing in it, and as a plant which requires patience to see it bloom, don't expect to get rich quick, because it takes time.Thank you Rruchi man. Like you said a good project requires patience to see it bloom, newbies do not get this. They have high expectations of what to gain from their investment, without considering the fact that nothing is guaranteed… there can also be loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}