{
  "id": "topic_5463774",
  "title": "Promocodeudo",
  "author": "Promocodeudo",
  "created_time": "August 19, 2023, 05:36:34 AM",
  "content": "I know it is a big or uncommon goal to achieve considering my current income. I have a big dream of owning one Bitcoin before a certain period. So when people are bothered that the price of Bitcoin is dropping, I am seeing it as an opportunity to go closer to my dream. I am in no way happy that the price is dropping but one Bitcoin will always be one Bitcoin, no matter the price today. If you are sure of bitcoin, you will not be concerned about the price today because the price in the future will always exceed the current price.I have learned from this forum that there is no need to dump your coin because of FUD, this distraction will come and go. So I am no longer reading those blogs or social media that is promoting this this fear that will make me dump my small holding and abandon my dream. My focus is to own one Bitcoin.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463774",
  "comments": [
    {
      "author": "DapanasFruit",
      "created_time": "August 19, 2023, 06:03:52 AM",
      "body": "As I am writing this one, the price of Bitcoin has precipitously dropped from around $30K to the zone of $25K. while many people might take this as something negative, some people like you can look at this dump period like a golden opportunity to further boost one's dream of owning even just one BTC. Now, this is the kind of attitude that can re-energized BTC to where it should be and I am glad that you are taking the cudgels to make your dream come true.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "August 19, 2023, 06:04:58 AM",
      "body": "Great goal. Had the same 5 years ago, but it was a bit easier to achive that. Quote from: Promocodeudo on August 19, 2023, 05:36:34 AMI have learned from this forum that there is no need to dump your coin because of FUD, this distraction will come and go. So I am no longer reading those blogs or social media that is promoting this this fear that will make me dump my small holding and abandon my dream. My focus is to own one Bitcoin.this forum is a place for bitcoin enthusiasts. This is the perfect place to learn about bitcoin technicalities, including all the details, but it's definitely not an objective place to get information about future bitcoin pricing and investment strategies. In 1990, people were excited about Japanese stocks, which grew 350x in 40 years. When the bubble burst, it took 34 years to return to the area of precious ath (not  adjusted for inflation). Do you have that much time if history were to repeat itself on bitcoin? In japan 40 years pump and 40 years to get back to ath. on bitcoin 14 years pump and 14 years to get back to ath?I'm not saying that will happen. I even put a small probability on it, and I expect a new ATH in 2024, but it is an event with a non-zero probability, for which you also need to be prepared, to avoid scenario in which you sell your bitcoin on huge loss, after 5 years of holding, because you lost your job due to the crisis, and the entire financial cushion was in bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helena Yu",
      "created_time": "August 19, 2023, 06:09:31 AM",
      "body": "Coming close? you can post your Bitcoin address and sign a message from it.All of your threads always talk a same thing e.g. self praising Bitcoin. It's all about common discussion and anything that has been discussed over and over. Now Bitcoin price is declining and you create a thread about buying a dip. Few months or a year later during bull run season, you will create a thread about thanks to Bitcoin etc etc.1. Fix the money, Fix the world.2. Education and money as the key to Bitcoin adoption.3. Bitcoin as an opportunity for the unbanked.4. Inflation overpowers the value of money 5. Bitcoin as an inflation hedge6. Awareness as the major force for Bitcoin adoption7. My bitcoin journey mistakes and moral lesson",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Latviand",
      "created_time": "August 19, 2023, 06:14:01 AM",
      "body": "Same goal although I don't have a specific timeline, as long as I can accumulate every month no matter how small the amount of sats areI am making progress, hopefully I will be able to get to half a bitcoin in the next 3 years or less, hopefully more money making opportunities come my way so I can shorten the pace of my goal. Got myself some bitcoin already for this current dump coz I got my pay in my day job. This kind of goal is particularly difficult for those that don't have USD as their currency and in the case of my country, most of my money are spent on daily stuff and bills, I'm one of the lucky few that has money leftover after all the bills and necessities are paid for so I am still thankful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "August 19, 2023, 06:24:07 AM",
      "body": "Quote from: Promocodeudo on August 19, 2023, 05:36:34 AMI know it is a big or uncommon goal to achieve considering my current income. I have a big dream of owning one Bitcoin before a certain period. So when people are bothered that the price of Bitcoin is dropping, I am seeing it as an opportunity to go closer to my dream. I am in no way happy that the price is dropping but one Bitcoin will always be one Bitcoin, no matter the price today. If you are sure of bitcoin, you will not be concerned about the price today because the price in the future will always exceed the current price.I have learned from this forum that there is no need to dump your coin because of FUD, this distraction will come and go. So I am no longer reading those blogs or social media that is promoting this this fear that will make me dump my small holding and abandon my dream. My focus is to own one Bitcoin.You're right.Those that have been worried with the price dump this week aren't really here for the long term. But those that have been in here for a long time, this is nothing and it's not painful at all.It becomes painful when you just look at the projection value of your portfolio but eventually, you'll just ignore it and think that it's normal for this highly volatile market. Whatever the cost of this dump will also show the opposite of it, it may not be instant but we'll see it gradually.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WatChe",
      "created_time": "August 19, 2023, 06:51:47 AM",
      "body": "Quote from: DapanasFruit on August 19, 2023, 06:03:52 AMAs I am writing this one, the price of Bitcoin has precipitously dropped from around $30K to the zone of $25K. while many people might take this as something negative, some people like you can look at this dump period like a golden opportunity to further boost one's dream of owning even just one BTC. Now, this is the kind of attitude that can re-energized BTC to where it should be and I am glad that you are taking the cudgels to make your dream come true. That's the biggest issue with Bitcoin, when it goes up people start saying its now expensive to buy Bitcoin and when it goes down there are speculations that price will drop down to record low. We have seen what truth is over a period of time. Its never too late to buy Bitcoin nor price of Bitcoin will ever be going to zero, as we see Bitcoin always make a strong come back. Price of Bitcoin has gone down in last one or two days and to me its best to buy Bitcoin now as halving is coming up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "August 19, 2023, 06:59:02 AM",
      "body": "You should dream bigger.... no matter what your income is. Do not limit yourself and the motivation to achieve small goals.... just dream big. I started in Bitcoin when we sucked on faucets, but I soon realized that I will never achieve my goals ..if I wasted my time on faucets. I took on a second job and that funded my first Bitcoin buys.... I bought small amounts until I had enough to buy a few coins at $300.... then the price went up to $1000+ and I sold some of the coins to pay some of my debt. The extra income allowed me to buy more coins and it really paid off when the price skyrocketed to $20 000+",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reid",
      "created_time": "August 19, 2023, 07:00:55 AM",
      "body": "That's the spirit! I like it. Focus on the goal. Don't be bothered by those who make market analysis because you are not a trader. That is only for those who want to buy and sell whenever they like. But, for those who want to store Bitcoin for a long time or accumulate it because they find it better to keep it than sell it, then just avoid those analysis. 1 Bitcoin will always be 1 Bitcoin. Keep that kind of perspective.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "August 19, 2023, 07:19:15 AM",
      "body": "That's not a dream, you stick to your dream no matter what, if you have fear, your dreams might remain a dream forever.You are bothered by the price action of Bitcoin, will you be able to continue if Bitcoin goes down to $15,000? You would probably end up selling everything. You also have a timeline? No wonder someone ask you to prove this by signing a message on your Bitcoin address.1 BTC isn't that easy like some are saying on here, I am not looking down on anybody though, but the timeline thing is giving you away, to DCA into Bitcoin and get away with 1 BTC before the next bull market is not going go be easy. Since you are made of fear I believe you want to invest in Bitcoin to make money in the short term, I am always happy to see Bitcoin dump, I have been waiting for the 25k that happened recently since last month.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "August 19, 2023, 07:21:04 AM",
      "body": "Quote from: Promocodeudo on August 19, 2023, 05:36:34 AMI know it is a big or uncommon goal to achieve considering my current income. I have a big dream of owning one Bitcoin before a certain period. So when people are bothered that the price of Bitcoin is dropping, I am seeing it as an opportunity to go closer to my dream. I am in no way happy that the price is dropping but one Bitcoin will always be one Bitcoin, no matter the price today. If you are sure of bitcoin, you will not be concerned about the price today because the price in the future will always exceed the current price.I have learned from this forum that there is no need to dump your coin because of FUD, this distraction will come and go. So I am no longer reading those blogs or social media that is promoting this this fear that will make me dump my small holding and abandon my dream. My focus is to own one Bitcoin.      -     I agree with everything you mentioned, mate, because if you are a long-term holder of Bitcoin, there will be no effect on you if the value of Bitcoin falls in the market, instead we will have more advantage to buy if we have a purchase.Having a Bitcoin can be said to be a dream come true, in fact, most bitcoin enthusiasts are looking for that, so we must always be prudent in everything we do as a responsible investor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "August 19, 2023, 07:44:00 AM",
      "body": "One Bitcoin is equivalent to one Bitcoin, but to buy it of course someone needs to spend money which for some people they are not willing to lose. Even though I am also optimistic that the price of Bitcoin will increase in the future, in investing, of course, there must be a calculation, so that we don't \"waste\" money just to invest in Bitcoin. Calculations and analysis are needed so that at some point if the profit is good we can sell some and then buy it again at a lower price. However, if you believe that the price of Bitcoin will increase in the future and only want to invest long-term, you can hold on to it and not care about a short-term decrease in valuation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "August 19, 2023, 07:44:42 AM",
      "body": "Quote from: Promocodeudo on August 19, 2023, 05:36:34 AMI know it is a big or uncommon goal to achieve considering my current income. I have a big dream of owning one Bitcoin before a certain period. So when people are bothered that the price of Bitcoin is dropping, I am seeing it as an opportunity to go closer to my dream. I am in no way happy that the price is dropping but one Bitcoin will always be one Bitcoin, no matter the price today. If you are sure of bitcoin, you will not be concerned about the price today because the price in the future will always exceed the current price.I have learned from this forum that there is no need to dump your coin because of FUD, this distraction will come and go. So I am no longer reading those blogs or social media that is promoting this this fear that will make me dump my small holding and abandon my dream. My focus is to own one Bitcoin.It is good to have a dream, and even better - a goal, but the dream most often remains abstract, because you don't strive for it, but the goal is something of a different order. The goal will push you to action, and when viewed pragmatically, it works better than a dream. Reformulate for yourself the dream of bitcoin into a goal of bitcoin and you will see new opportunities that will begin to bring you closer to your cherished goal.The price falls or rises, you rejoice at it or get upset - why these useless emotions? You are right, 1 BTC is still 1 BTC. Strive for your goal despite the current price fluctuations. Kepp walking, Johnnie.That's right, get rid of everything that prevents you from achieving your goal (to own 1 BTC). Maintain only positive information background around.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "August 19, 2023, 07:59:23 AM",
      "body": "If your dream is to own 1btc, it is time you start buying at this current price. But one thing is that when bitcoin will be on discount, you might not have the money to accumulate as big as you want. That is why I always advise that people should use dollar cost averaging method to invest in Bitcoin and be consistent about it. You will be surprised how your bitcoin holding will increase over time. But I will also advise that bitcoin is always here and it is not running away any moment. So there is no need to set a goal for yourself that will pressure you. The most important thing is you should be holding some bitcoin, it doesn't mean if it is after 1 or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avp2306",
      "created_time": "August 19, 2023, 08:06:28 AM",
      "body": "Quote from: Promocodeudo on August 19, 2023, 05:36:34 AMI know it is a big or uncommon goal to achieve considering my current income. I have a big dream of owning one Bitcoin before a certain period. So when people are bothered that the price of Bitcoin is dropping, I am seeing it as an opportunity to go closer to my dream. I am in no way happy that the price is dropping but one Bitcoin will always be one Bitcoin, no matter the price today. If you are sure of bitcoin, you will not be concerned about the price today because the price in the future will always exceed the current price.I have learned from this forum that there is no need to dump your coin because of FUD, this distraction will come and go. So I am no longer reading those blogs or social media that is promoting this this fear that will make me dump my small holding and abandon my dream. My focus is to own one Bitcoin.Even though its stressful to read those article which create fear to people still you just need to be open minded on possibilities and read that since from those articles you can find helpful hints that can give you some good earnings.If you just let the fud pass out and don't do any action then for sure you will miss some good opportunity to buy.But still its your decision to hold if you like to do since as you said each year especially on bullish year there always be a good price set and that is the time for many holders to sell and accumulate their profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mvdheuvel1983",
      "created_time": "August 19, 2023, 08:13:23 AM",
      "body": "This is the dream for all of us who have less  than one Bitcoin. There are many things we are doing which doesn't include listening to the FUD. For us, it doesn't matter whether the price is 24K or 35k. Our goal is to own at least one Bitcoin, it's not the price that moves us to buy more , it is our strategic plan . I have been doing Dollar cost averaging for some time now but with the dip in price, I have slightly increase the amount I use for the DCA. And when there is a bull run , I'll slightly decrease the amount I use for DCA until I reach the goal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "August 19, 2023, 09:07:44 AM",
      "body": "Quote from: Promocodeudo on August 19, 2023, 05:36:34 AMI have a big dream of owning one Bitcoin before a certain period. So when people are bothered that the price of Bitcoin is dropping, I am seeing it as an opportunity to go closer to my dream.This is a good scenario to make explanation on when and why buying bitcoin using DCA is very important, assuming you have bought all you wanted some few weeks back then you might just realized some lossee from the little time frame, but when using DCA, this dip will also serve another opportunity to buy and hold, my suggestion for you is to maintain buying it in a gradual using DCA till your target of holding 1btc is achieved.Quote from: Promocodeudo on August 19, 2023, 05:36:34 AMI am in no way happy that the price is dropping but one Bitcoin will always be one Bitcoin, no matter the price today. That's true, bitcoin will always have value no matter the bearish market there's always an opportunity to see the market pumping up and holding is important to get this achieved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "koang",
      "created_time": "August 19, 2023, 09:11:56 AM",
      "body": "Quote from: Promocodeudo on August 19, 2023, 05:36:34 AMI know it is a big or uncommon goal to achieve considering my current income. I have a big dream of owning one Bitcoin before a certain period. So when people are bothered that the price of Bitcoin is dropping, I am seeing it as an opportunity to go closer to my dream. I am in no way happy that the price is dropping but one Bitcoin will always be one Bitcoin, no matter the price today. If you are sure of bitcoin, you will not be concerned about the price today because the price in the future will always exceed the current price.I have learned from this forum that there is no need to dump your coin because of FUD, this distraction will come and go. So I am no longer reading those blogs or social media that is promoting this this fear that will make me dump my small holding and abandon my dream. My focus is to own one Bitcoin.Nice playA bear market is an opportunity. Always buy the dip and stacking sats while cheap. As simple as thatUnfortunately, a majority of noobs who are investing in crypto have a gambler mindset. They want to get rich quickly. That's why so many people get burned. Long-term games with long-term people should be the goal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "August 19, 2023, 09:38:02 AM",
      "body": "Every drop in the price is an opportunity to buy more at a cheap price, unless the price drops below $15,000, which represents the long-term bottom. The people who are annoyed by the price drop are the same ones who buy when the price is above $100,000 and come to regret that the price has collapsed. They buy with the green candles and sell at the red candles.Quote from: Helena Yu on August 19, 2023, 06:09:31 AMComing close? you can post your Bitcoin address and sign a message from it.we need to read previous topics to believe the stories, what a shame.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "August 19, 2023, 09:44:09 AM",
      "body": "Quote from: mvdheuvel1983 on August 19, 2023, 08:13:23 AMThis is the dream for all of us who have less  than one Bitcoin. There are many things we are doing which doesn't include listening to the FUD. For us, it doesn't matter whether the price is 24K or 35k. Our goal is to own at least one Bitcoin, it's not the price that moves us to buy more , it is our strategic plan . I have been doing Dollar cost averaging for some time now but with the dip in price, I have slightly increase the amount I use for the DCA. And when there is a bull run , I'll slightly decrease the amount I use for DCA until I reach the goal.Is bitcoin price really unimportant? If it doesn't matter why do we discuss prices every day? Those looking to buy more bitcoin always expect a prolonged bear market, and those who have bought enough bitcoin always expect a bull market. And if you are dreaming of having enough 1 bitcoin, you have to care about the price even more because the higher the price goes up, the more difficult it will be to own 1 bitcoin, and vice versa. So OP or whoever says they don't care about price is lying. We accumulate bitcoins for profit, so there is no such thing as the price of bitcoins being unimportant and not a concern.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}