{
  "id": "topic_5420452",
  "title": "Sandra_hakeem",
  "author": "Sandra_hakeem",
  "created_time": "November 11, 2022, 12:02:29 AM",
  "content": "Hey y'all, Something came into my mind, something I thought of doing when I get my ranks, now I've got 'em and I'm expecting more to come.I honestly don't know the proceedings on how to stack an address for extra security, can anyone help out?Yeah, I'd need to sign a message using urhhhhh....kleopatra? What? I'm lost.Y'all help!!  I need to get that shiii' stacked 😟Sandra 💇",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420452",
  "comments": [
    {
      "author": "Cantsay",
      "created_time": "November 11, 2022, 02:38:48 AMLast edit: November 11, 2022, 03:01:44 AM by Cantsay",
      "body": "It's not that difficult to sign a messageCheck out this thread for the tutorial: https://bitcointalk.org/index.php?topic=990345.0I'll edit my post and add another tutorial on how to sign a message on an Android phone using  Mycelium wallet, when I'm through preparing the tutorial I'll edit and add it to my post, for now just check the link I provided above to see if you're okay with anyone there. update:Okay here's the tutorial:STEP 1:First you have to download the  Mycelium wallet make sure you download it from the official website. STEP 2:Click on the Bitcoin Hd section STEP 3: Click on the Sign message  at the top.STEP 4: Select the type of wallet address you would prefer to use. In this tutorial I'll go with the bech32 Next step is to type out the message that you want to sign and when your done typing, click on the the sign button and that will the allYou can use Mycelium to also verify a signed message.  please make sure to backup your account Here's the one I signed for this tutorialCode:-----BEGIN BITCOIN SIGNED MESSAGE-----Hi Sandra_Hakeem, This is how to sign a message with your Android phone using the Mycelium wallet.pretty simple right?-----BEGIN BITCOIN SIGNATURE-----Version: Bitcoin-qt (1.0)Address: bc1qnm4ztst3fj9ptua8yaf06kslq42v9lgy7kuenuHzhEXv9+VMxSFndQuFr/A9Ar+fKNU61IzEU5ehNqQBrZWbdu34y0xzNqAIyiy3NqR7k/10NY+h5ZO9jueq2b5W4=-----END BITCOIN SIGNATURE-----",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "November 11, 2022, 08:37:06 AMLast edit: November 11, 2022, 08:57:03 AM by NeuroticFish",
      "body": "Quote from: Sandra_hakeem on November 11, 2022, 12:02:29 AMI honestly don't know the proceedings on how to stack an address for extra security, can anyone help out?Yeah, I'd need to sign a message using urhhhhh....kleopatra? What? I'm lost.I guess that you've badly mixed up some things.Kleopatra is great for verifying your Electrum download, to make sure you won't be using a malicious clone.If you use Electrum, it's easy. First step is to pick an address from your wallet, for that you should start with View->Show Addresses and pick an address from the Addresses tab (maybe label it too, to know which one you've used). Then in Tools->Sign/Verify message you will fill the address and the message you want (usually containing your bitcointalk name and the date of signing). Press sign, you'll obtain the signature.The format to post it is in the previous post.Edit: an image for you, maybe it helpsQuote from: https://intercom.help/bity-help-center/en/articles/4574980-how-do-i-sign-a-message-with-my-bitcoin-address",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "November 11, 2022, 10:07:26 AM",
      "body": "Quote from: Cantsay on November 11, 2022, 02:38:48 AMFirst you have to download the  Mycelium wallet make sure you download it from the official website.Nobody downloads Mycelium from the official website, it's in the Play Store. But Mycelium isn't the best choice for this, I've seen messages signed by Mycelium that can't be verified. TL;DR solution: Electrum > Tools > Sign message.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "November 11, 2022, 02:12:26 PM",
      "body": "If you are having any trouble in signing the message then you can have a look at this thread for any kind of assistance as there is information for different wallets and step by step guide for it.Quote from: LoyceV on November 11, 2022, 10:07:26 AMNobody downloads Mycelium from the official website, it's in the Play Store. But Mycelium isn't the best choice for this, I've seen messages signed by Mycelium that can't be verified. TL;DR solution: Electrum > Tools > Sign message.Yeah most of user sign message with Electrum wallet to verify it and you are right on the part that the app is available on play Store and App store where you can download it easily rather then falling for scam links in order to scam you of funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "November 15, 2022, 05:00:55 PM",
      "body": "Hey NF, thanks for making me enlightened.I'mma try that out btw any of the days.... locking this thread rn. Sandra 💇",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "November 15, 2022, 07:17:33 PM",
      "body": "Quote from: Sandra_hakeem on November 11, 2022, 12:02:29 AMSomething came into my mind, something I thought of doing when I get my ranks, now I've got 'em and I'm expecting more to come.I honestly don't know the proceedings on how to stack an address for extra security, can anyone help out?Yeah, I'd need to sign a message using urhhhhh....kleopatra? What? I'm lost.Y'all help!!  I need to get that shiii' stacked 😟Sandra 💇Make sure to use a secured wallet. All of the staking method are unique and we must make sure that we are using a corresponding wallet and how that will work on your case. Also use non custodial with related to dex and thats much better than centralized exchange. It can be compromise if the exchange wont work well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}