{
  "id": "topic_5470937",
  "title": "albert0bsd",
  "author": "albert0bsd",
  "created_time": "October 19, 2023, 04:22:15 PMLast edit: October 19, 2023, 05:58:51 PM by albert0bsd",
  "content": "Muy buen días, hoy les quiero compartir una de las que creo es la mejores herramienta para  administrar sus passwords de forma segura.https://www.passwordstore.org/Si es que no lo conocen, password store es un proyecto de código abierto escrito en bash.Este te permite administrar tus contraseñas de forma segura cifradas mediante tu llave privada de GPG (Por lo cual tu y solo tu podras decifrar). Por lo que básicamente se convierte en una llave para gobernarlas a todas. Lo cual y estoy conciente es un riesgo, pero si ya le confiamos nuestros password y estos están cifrados mediante GPG por que no confiarle otros secretos como llaves privadas o mnemonicos de bitcoin y otras criptomonedas?GPG es una herramienta que ya tiene su tiempo en la comunidad de Open source: https://es.wikipedia.org/wiki/GNU_Privacy_GuardPor lo que el tema de seguridad de la misma ya esta bastante depurado.Temas de seguridad a tener en cuenta.- Tienes que tener respaldada tu llave privada GPG- Tienes que tener respaldo tu password de tu llave privada- Es conveniente tener una máquina y cuenta separada para respaldar seeds con este método (Esto ya depende de cada quien y que tan paranoico sea uno)En lo personal he dejado de utilizar el gestor de contraseñas de google y he terminado de pasar todos los password a este gestor con mis respectivas precauciones, Llave GPG respaldada offline, Password respaldado.Muchos tal vez confían en gestores como 1Password y otros, sin embargo estos al ser de código cerrado y con un largo historial de hackeos a empresas similares, Por lo siento Password store es una alternativa más segura que los anteriores.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470937",
  "comments": [
    {
      "author": "DdmrDdmr",
      "created_time": "October 19, 2023, 05:56:37 PM",
      "body": "Al ser una solución Unix, el alcance de personas que lo conozcan en el foro es reducido, y de hecho, por lo que observo, pareces ser el único que lo ha referenciado en Bitcointalk por ahora, a pesar de llevar años existiendo. Hace tiempo que no miro comparativas de gestores de contraseñas. En su momento, para entornos Windows, en el foro se solía recomendar Keepass, que es sencillo de manejar y es open source.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "womanderful",
      "created_time": "October 20, 2023, 07:48:43 AM",
      "body": "Tanto keepass como keepassx hoy día son tanto para windows como para linux. Sin embargo en linux utilizamos keepassxc, que está en desarrollo activo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "October 20, 2023, 04:06:01 PM",
      "body": "Esta herramienta tambien esta para windows dentro del enviroment de WSL (Windows Subsytem Linux). Asi mismo si se sincroniza con un repositorio git descargar tus password en distintos dispositivos.Por ejemplo yo lo utilizo en:Android (Termux)Linux DebianWindows (WSL)Al ser una herramienta de linea de comandos se me hace bastante simple y util al mismo tiempo. Les soy honesto prefiero 10 veces una herramienta de linea de comandos a una herramienta grafica. Sin embargo ya es cuestion de gustos no?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}