{
  "id": "topic_5469748",
  "title": "Jegileman",
  "author": "Jegileman",
  "created_time": "October 09, 2023, 11:58:02 AM",
  "content": "For the time being I have joined bitcointalk and also the bitcoin market. I always hear that, when the market is buying there will be an increase in price of bitcoin and when it is selling there will be a decrease in the price. My question is that, what makes the price go up as people are buying and the price goes down as people are selling because what I understand is that this action cannot increase or reduce the quantity of bitcoin available, so what action actually makes it to increase or reduce in price, is it the marketers, miners or who does that? Is there any technical reason behind that actually?More clarification on this will be appreciated.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469748",
  "comments": [
    {
      "author": "_act_",
      "created_time": "October 09, 2023, 12:12:00 PM",
      "body": "Marketcap = bitcoin price x circulating supplyBitcoin price = marketcap ÷ the circulating supply. From the calculation, you can see how marketcap is proportional to the price.The more people buy bitcoin, the marketcap increases which is directly proportional to the the price. The more people sell bitcoin, the marketcap decreases which is directly proportional to the the price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "October 09, 2023, 12:18:50 PM",
      "body": "Nothing technical it is affected by demand and supply just like some commodities like stock. It only stands out because of its fixed supply limit and this as it grows will only causes scarcity which increase its demand and then increases its price. When many people buy the demand for it has increase so the market just increases it prices and same goes as when people starts to sell off. Just thing of your agricultural produce when they are scarce in spring time how they go up in price and when they are abundance in winter how they fall in price",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "October 09, 2023, 01:26:30 PM",
      "body": "Quote from: Jegileman on October 09, 2023, 11:58:02 AM..so what action actually makes it to increase or reduce in price, is it the marketers, miners or who does that? Is there any technical reason behind that actually?Actually, there are too many factors to consider that make the Bitcoin price so volatile. It could be this,supply and demand in the open marketbuyers, sellers, market makers, and speculatorsminermarket events and media coverage like newsSo in short, just because of the fixed supply of Bitcoin, the price is so volatile.This is why the price can go up when there's more buying pressure and down when there's more selling pressure, even though the total supply remains constant.QuoteCorrelation between buying and selling of bitcoin: Is it a technical methodologyNo, it isn't, IMO, it's more on fundamental concepts than technical methodology.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "October 09, 2023, 01:33:17 PM",
      "body": "Quote from: Jegileman on October 09, 2023, 11:58:02 AMFor the time being I have joined bitcointalk and also the bitcoin market. I always hear that, when the market is buying there will be an increase in price of bitcoin and when it is selling there will be a decrease in the price. My question is that, what makes the price go up as people are buying and the price goes down as people are selling because what I understand is that this action cannot increase or reduce the quantity of bitcoin available, so what action actually makes it to increase or reduce in price, is it the marketers, miners or who does that? Is there any technical reason behind that actually?More clarification on this will be appreciated. Simple reason; Demand and supply. Both buying and selling happens when the price of Bitcoin is increasing and when it's decreasing but the difference is that when the price is increasing, there's more of buying going on and when it's decreasing, there's more of selling going on. The action of buying and selling can actually affect the quantity of Bitcoin available on the market because the more we have more people selling (a larger quantity of Bitcoin will be available on the market) but when we have more of buying going on, they'll be reducing the quantity available for trading as more people are buying. Buying and selling doesn't affect the fixed supply of Bitcoin but it affect the circulating supply. Just understand that selling = more people bringing their Bitcoin to the market (which increase the circulation supply on exchanges).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bureau",
      "created_time": "October 09, 2023, 01:36:22 PM",
      "body": "It all comes on to the key players influencing the Bitcoin price. Who are the key players here? Buyers, Sellers, miners because of the mining rewards, and those who speculate. The price of Bitcoin reflects the supply and demand with a given limited supply of the number of Bitcoin that can be mined. When the demand for Bitcoin is high the price will go up, when the demand for Bitcoin is low the price will go down. It is a basic economic principle where buying and selling activities impact the price. As an example let me quote you how an apple farmer sells his apples. We are considering that the farmer in a year through his farm produces 1000 apples. If the demand for apples goes high with the fixed produce then the farmer will increase the price. If the demand for apples goes down with the fixed produce then the farmer will reduce the price. The reason is that you cannot sell stale apples in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "October 09, 2023, 01:49:52 PM",
      "body": "Quote from: Bureau on October 09, 2023, 01:36:22 PMIt all comes on to the key players influencing the Bitcoin price. Who are the key players here? Buyers, Sellers, miners because of the mining rewards, and those who speculate. The price of Bitcoin reflects the supply and demand with a given limited supply of the number of Bitcoin that can be mined. When the demand for Bitcoin is high the price will go up, when the demand for Bitcoin is low the price will go down. It is a basic economic principle where buying and selling activities impact the price. As an example let me quote you how an apple farmer sells his apples. We are considering that the farmer in a year through his farm produces 1000 apples. If the demand for apples goes high with the fixed produce then the farmer will increase the price. If the demand for apples goes down with the fixed produce then the farmer will reduce the price. The reason is that you cannot sell stale apples in the market. Well apples can be kept fresh for 13-15 months.https://www.foodrenegade.com/your-apples-year-old/https://en.wikipedia.org/wiki/1-MethylcyclopropeneSo they are not the example to use.Back to op's question.Perception of necessity can raise demand a lot.So if people think they need it and can not get it the price rises.Thus the ½ ings create the perception it is running out.Next year blocks drop to 3.125 coins .the daily crop of coins will drop from 144 x 6.25 = 900 to 144 x 3.125 = 450",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "October 09, 2023, 02:01:44 PM",
      "body": "Quote from: Bureau on October 09, 2023, 01:36:22 PMBuyers, Sellers, miners because of the mining rewards, and those who speculate. The price of Bitcoin reflects the supply and demand with a given limited supply of the number of Bitcoin that can be mined.As an example let me quote you how an apple farmer sells his apples. We are considering that the farmer in a year through his farm produces 1000 apples. If the demand for apples goes high with the fixed produce then the farmer will increase the price. If the demand for apples goes down with the fixed produce then the farmer will reduce the price. The reason is that you cannot sell stale apples in the market. Bitcoins do not expire, bitcoins do not rot, you don't consume Bitcoins and they are not produced randomly in one season but with near complete accuracy. Also unlike a miner who can simply shut down its miners if the reward is lower than the costs there is no way for a farmer to cut losses with the same predictability, plus, let's not even mention the fact that no matter how much gear you point at mining coins you won't be able to mine more than 900 coins a day on average, with apples it takes a few years but you cat quadruple the entire world production.Quote from: philipma1957 on October 09, 2023, 01:49:52 PMThus the ½ ings create the perception it is running out.That's one of most annoying thing, I just hate when some claim that the supply is going down with the halving.Quote from: sheenshane on October 09, 2023, 01:26:30 PMSo in short, just because of the fixed supply of Bitcoin, the price is so volatile.Oil is not in fixed supply and it went from -40 to $80, something I don't see Bitcoin ever being able to replicate  Volatility has nothing to do with the supply, stocks have a limited supply too and they are all over the place in a messy day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "October 09, 2023, 03:59:09 PM",
      "body": "Quote from: Jegileman on October 09, 2023, 11:58:02 AMFor the time being I have joined bitcointalk and also the bitcoin market. I always hear that, when the market is buying there will be an increase in price of bitcoin and when it is selling there will be a decrease in the price. My question is that, what makes the price go up as people are buying and the price goes down as people are selling because what I understand is that this action cannot increase or reduce the quantity of bitcoin available, so what action actually makes it to increase or reduce in price, is it the marketers, miners or who does that? Is there any technical reason behind that actually?More clarification on this will be appreciated. I think that would be wrong to say that such actions will not increase or decrease the quantity of BTC available. Because the overall quantity remains the same, while the circulating BTC increases or decreases. For example if one is selling and that is reducing the price it, means that person has reduced the amount of BTC in circulation and vice versa. But after reading this you will be confused and will ask that if someone is selling then on the other hand someone would be buying it too. Right?But my dear, it is not necessary that on the other hand, a buyer will be present because, on most of the exchanges, there are liquidity pools of the exchanges which ensure a seamless trading experience. This means they don't want you to keep in waiting for the completion of the trade, they will trade your USDT with their own BTC or vice versa. And just giving a remainder, the price of BTC does not solely depend on the Demand and supply factor. Quote from: _act_ on October 09, 2023, 12:12:00 PMMarketcap = bitcoin price x circulating supplyBitcoin price = marketcap ÷ the circulating supply. This is the most simplest and technical explanation of the buying and selling correlation of BTC. And I really liked this explanation. To be honest, I don't think OP needs another explanation for understanding it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "October 09, 2023, 06:42:52 PM",
      "body": "Quote from: Bureau on October 09, 2023, 01:36:22 PMAs an example let me quote you how an apple farmer sells his apples. We are considering that the farmer in a year through his farm produces 1000 apples. If the demand for apples goes high with the fixed produce then the farmer will increase the price. If the demand for apples goes down with the fixed produce then the farmer will reduce the price. The reason is that you cannot sell stale apples in the market. You are forgetting one important aspect. No one can generate more bitcoin than what is written in the consensus rules. The coin's scarcity coupled with big demand gives it value. The newly minted coins per block are fixed, regardless of how much processing power you possess. But a new apple producer that enters the market with a huge supply is able to bring the prices down and even put small producers out of business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "October 09, 2023, 06:58:45 PM",
      "body": "Quote from: stompix on October 09, 2023, 02:01:44 PMQuote from: Bureau on October 09, 2023, 01:36:22 PMBuyers, Sellers, miners because of the mining rewards, and those who speculate. The price of Bitcoin reflects the supply and demand with a given limited supply of the number of Bitcoin that can be mined.As an example let me quote you how an apple farmer sells his apples. We are considering that the farmer in a year through his farm produces 1000 apples. If the demand for apples goes high with the fixed produce then the farmer will increase the price. If the demand for apples goes down with the fixed produce then the farmer will reduce the price. The reason is that you cannot sell stale apples in the market. Bitcoins do not expire, bitcoins do not rot, you don't consume Bitcoins and they are not produced randomly in one season but with near complete accuracy. Also unlike a miner who can simply shut down its miners if the reward is lower than the costs there is no way for a farmer to cut losses with the same predictability, plus, let's not even mention the fact that no matter how much gear you point at mining coins you won't be able to mine more than 900 coins a day on average, with apples it takes a few years but you cat quadruple the entire world production.Quote from: philipma1957 on October 09, 2023, 01:49:52 PMThus the ½ ings create the perception it is running out.That's one of most annoying thing, I just hate when some claim that the supply is going down with the halving.Quote from: sheenshane on October 09, 2023, 01:26:30 PMSo in short, just because of the fixed supply of Bitcoin, the price is so volatile.Oil is not in fixed supply and it went from -40 to $80, something I don't see Bitcoin ever being able to replicate  Volatility has nothing to do with the supply, stocks have a limited supply too and they are all over the place in a messy day.the supply was always 21 million. the ability or pace to unlock all the 21 million coins slows every 4 years.my biggest wish about btc would be to have had 4 blocks an hour not 6.1/2ings would have been every 6 years not every 4. same 21,000,000 coinsso satoshi's way.      Phil's way2012 50-25            2014 50-252016 25-12.5         2020 25-12.52020 12.5-6.25      2026 12.5-6.252024  6.25-3.125   2032   6.25-3.125but projections like above are think experiments or imagination games. I have to think it would have made a large difference in growth rates of coin value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "October 09, 2023, 08:22:32 PM",
      "body": "Quote from: CryptopreneurBrainboss on October 09, 2023, 01:33:17 PMBuying and selling doesn't affect the fixed supply of Bitcoin but it affect the circulating supply. Just understand that selling = more people bringing their Bitcoin to the market (which increase the circulation supply on exchanges).Yes, buying and selling of bitcoin does not affect the total supply of bitcoin but neither do they affect the the circulating supply of bitcoin. The circulating supply of bitcoin which is currently approximately $19.5 million is affected by nothing than mining reward, but the supply can have have effect on the price of bitcoin as lost coin among them will make bitcoin scarce and which can have positive effect on bitcoin price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "October 09, 2023, 08:40:28 PM",
      "body": "Quote from: Charles-Tim on October 09, 2023, 08:22:32 PMQuote from: CryptopreneurBrainboss on October 09, 2023, 01:33:17 PMBuying and selling doesn't affect the fixed supply of Bitcoin but it affect the circulating supply. Just understand that selling = more people bringing their Bitcoin to the market (which increase the circulation supply on exchanges).Yes, buying and selling of bitcoin does not affect the total supply of bitcoin but neither do they affect the the circulating supply of bitcoin. The circulating supply of bitcoin which is currently approximately $19.5 million is affected by nothing than mining reward, but the supply can have have effect on the price of bitcoin as lost coin among them will make bitcoin scarce and which can have positive effect on bitcoin price.Again if you read and understand my statement you'll see that I clarified that it's the circulating supply on an exchange. Buying and selling affect the circulating supply on an exchange and the circulating supply of Bitcoin currently is showing on coingecko  as BTC19,508,837. Circulating supply can't be measured in fiat value but actually figures. The circulating supply mightn't be accurate as well because I don't see how possible it is to track all Bitcoin in circulation as some might be lost or not on the market circulating (as a result of investors hodling).Buying and selling affect the circulating supply of Bitcoin on an exchange as when they're more buyers, technically more Bitcoin are leaving the exchange while when there's more sellers more Bitcoin are been introduced to the exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jegileman",
      "created_time": "October 10, 2023, 02:10:20 PM",
      "body": "Quote from: _act_ on October 09, 2023, 12:12:00 PMThe more people buy bitcoin, the marketcap increases which is directly proportional to the the price. The more people sell bitcoin, the marketcap decreases which is directly proportional to the the price.Quote from: Zaguru12 on October 09, 2023, 12:18:50 PMWhen many people buy the demand for it has increase so the market just increases it prices and same goes as when people starts to sell off. Just thing of your agricultural produce when they are scarce in spring time how they go up in price and when they are abundance in winter how they fall in price With this illustration, that means the market is already programmed to work in that manner. The more people demand for bitcoin, the price will tend to increase itself and when they sell, the price begins to reduce. Buying and selling are proportional to each other, because you can’t buy when there’s no seller. If that is the case, won’t buyer=seller; then where does the market programmed that way to increase or reduce the price of bitcoin come into play in such scenario?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "October 10, 2023, 02:34:57 PM",
      "body": "Quote from: Jegileman on October 10, 2023, 02:10:20 PMWith this illustration, that means the market is already programmed to work in that manner. The more people demand for bitcoin, the price will tend to increase itself and when they sell, the price begins to reduce. Buying and selling are proportional to each other, because you can’t buy when there’s no seller. If that is the case, won’t buyer=seller; then where does the market programmed that way to increase or reduce the price of bitcoin come into play in such scenario?Exactly the number of buyer is equal to the number of seller but the price set out is different. For example if the bitcoin price is $27k just like it has been moving side ways this past few days then a bad news hit crypto world like an exchange getting to close down or something like that then many people have large funds on that exchange so they are obliged to sell, with this news the buyer now sets is price down from $27k to $26.5k. With the desperate need of selling the seller trades at that price, then the price chart of others will ultimately change too and as the sellers are desperate they sell at the price. Now with more sellers coming to sell at that price the buyers now influence the market again by going lower since the supply is more. This how you find the price decreasing gradually until dust settles. Once everything settles, and many buyers are back to accumulate maybe for occasions like halving, this time the seller sets a price and since the buyer is desperate to have is bitcoin he aggress with that price and buys, subsequently other buyers follow suit and the price begins to go up again as the seller this time around sees many desperate buyers",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Natsuu",
      "created_time": "October 11, 2023, 08:28:28 AM",
      "body": "Quote from: Jegileman on October 09, 2023, 11:58:02 AMFor the time being I have joined bitcointalk and also the bitcoin market. I always hear that, when the market is buying there will be an increase in price of bitcoin and when it is selling there will be a decrease in the price. My question is that, what makes the price go up as people are buying and the price goes down as people are selling because what I understand is that this action cannot increase or reduce the quantity of bitcoin available, so what action actually makes it to increase or reduce in price, is it the marketers, miners or who does that? Is there any technical reason behind that actually?More clarification on this will be appreciated. The answer is Volume and Time.Prices are booked based on what is agreed price being bought and sold. Depending on the volume of the specific time an asset is being transferred, it will paint the price as how it is illustrated in candlestick charts. When the volume changes because there's lesser participants or the time change because it passed, then it will consider as another transaction. In short, by October 11, 2023 9:03 PM (time) a person will sell 1BTC on 4 willing buyers (volume). When It's already 9:04 (time changed) and only 3 willing buyers accepted the transaction, that's how the price was booked.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "October 11, 2023, 02:20:54 PM",
      "body": "Quote from: Jegileman on October 09, 2023, 11:58:02 AMI always hear that, when the market is buying there will be an increase in price of bitcoin and when it is selling there will be a decrease in the price. The market works with a Supply and Demand principle in general.Sellers sell bitcoins and buyers buy bitcoin. If selling pressure from sellers is bigger than buying force from buyers, price will fall. If buying force is bigger than selling pressure, price will take off.However, in this market you must know about leverages, margins, futures and forced liquidations that can make price crashes or rises a lot. Many people lose money by forced liquidations when they want to gamble in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blitzboy",
      "created_time": "October 11, 2023, 02:46:19 PM",
      "body": "Welcome to your Bitcoin trip. Exciting, right? You want to know how Bitcoin prices move, which many beginners find puzzling. I have an idea: Prices rise when people buy and fall when they sell because of supply and demand. Buyers express desire. When demand is high and supply is low, prices soar.Limited Bitcoin supply and low mining returns raise the question of what will happen when we reach that limit. How would that affect prices and miners' motivation? That sparks ideas. Will supply and demand hold when block payments, miners' main motivation, become less important?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "October 11, 2023, 04:18:31 PM",
      "body": "I see that the discussion has been broken up by examples of fruits, miners and the Halving event, among others.First of all, I mentioned it in recent days, you may know absolutely nothing about bitcoin, as in this case, perhaps!, but you pose your question incorrectly, that is, the short answer is supply and demand. Spot!OP, you question a \"thing\",  that you should known..., in fact, it is something empirical, that is, you learn without going to school; it is, supply and demand determines the price of any \"thing.\"Then, your doubt begins for not understanding these basic principles that apply to everyday life  and that in a way is the best example ever, of how to learn about bitcoin.How do you want to learn about bitcoin if you don't master other basic concepts, which are sometimes general culture or traditional academic training to deal with other knowledge..If you want to learn about bitcoin, you must have an \"academic\" or empirical basis that allows you to understand that natural correlation between supply and demand.Then, supply and/or demand is a variable that intrinsically depends on the niche where it operates, bitcoin, like any other \"thing\" that is bought and sold, is affected by different factors that make the supply and demand variables, affect the price.So, almost always these variables, supply and demand, are based on situations intrinsic to them, e.g.; Supply remains the same,(1) demand grows, then )supply falls therefore demand remains the (2) same or (3)grows.Now, unlike those traditional \"things\", bitcoint maintains a limited production, that is, \"21 million\" and it is that same fact which makes it attractive, but the intrinsic laws of supply and demand \"punish\" it and make it go through that volatility that affects its price, not only upwards but also downwards.imho.Read about supply and demand, then you can understand which factors affect the price of bitcoin in the short, medium and long term.Those factors that affect the price may not be constant or the same always, but if there is a correlation between them, perhaps you should start with the basic concepts, below is a link, then look for documentation that will help you applied to the bitcoin case, in our forum you will find You can learn a lot about the subject, but reading it is not understanding it, you have to study it, and what you learned will surely change tomorrow.https://en.wikipedia.org/wiki/Supply_and_demand",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "October 11, 2023, 11:58:36 PM",
      "body": "The price represents the balance of supply and demand. By supply we mean the coins available for sale - not the total amount of coins in existance. By demand we mean the amount of fiat money that want to buy Bitcoin. The price goes up when demand is larger than supply. This can mean that either more fiat money wants to buy Bitcoin, or that less bitcoins are up for sale. Price fall is the opposite - more coins are up for sale, less fiat money that want to buy them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}