{
  "id": "topic_5416322",
  "title": "Editbar",
  "author": "Editbar",
  "created_time": "October 07, 2022, 03:39:57 PM",
  "content": "BTC's circulating supply is now 19 billion out of the 21 billion caps.Is it possible to calculate how much the price of BTC will go up until it hits the 21 billion cap? I know there is some complicated math you can do about circulating supply, market cap, price etc, it's all connected, How can I calculate the price potential of BTC within the next 1-10 years?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416322",
  "comments": [
    {
      "author": "NeuroticFish",
      "created_time": "October 07, 2022, 03:48:09 PM",
      "body": "Quote from: Editbar on October 07, 2022, 03:39:57 PMBTC's circulating supply is now 19 billion out of the 21 billion caps.Is it possible to calculate how much the price of BTC will go up until it hits the 21 billion cap? I know there is some complicated math you can do about circulating supply, market cap, price etc, it's all connected, How can I calculate the price potential of BTC within the next 1-10 years?The price is related to block reward (halving every ~4 years), mining difficulty (rising with more and more powerful miners getting plugged in) and also quite a hefty speculative component. Maybe other things too. Altogether I don't think that anybody could \"calculate\" the future price.I expected the worldwide rise of electricity price will also matter, but for now it doesn't give any sign to do so.Overall increase in bitcoin popularity makes more invest / hold and this increases the speculative component...So yeah, people throwing this or that price in the news just make worthless speculation. Nobody has a crystal ball and math doesn't help here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "October 07, 2022, 03:53:24 PM",
      "body": "You really can't — simply because supply is one thing, but demand is the second major factor whereas you can't really know how much demand an asset has until you see it. Bitcoin can literally be at the 21 million supply cap right now but if not much people are buying it and lots more people are selling, the price will drop regardless if bitcoin already has zero inflation.https://www.investopedia.com/terms/l/law-of-supply-demand.asp",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "October 07, 2022, 04:28:59 PM",
      "body": "Quote from: Editbar on October 07, 2022, 03:39:57 PMBTC's circulating supply is now 19 billion out of the 21 billion caps.You are totally wrong with this statement of yours, because the total supply of Bitcoin is 21million and not 21billion, of which the 19million which is in circulation, Satoshi owns 1million BTC, while others lost in a wallet that can't be accessed. So there is actually no parameters to calculate how much Bitcoin will be in the next 5 to 10yrs, as it's value always fluctuate with respect to market demand and supply.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BD Crypto",
      "created_time": "October 07, 2022, 04:47:05 PM",
      "body": "The total supply of Bitcoin is 21 million and it can't be said how much Bitcoin price will go up because a lot of numbers of Crypto Whales manipulating crypto market. And it's also very volatile so no one can exactly say how much the price will go up and when will go up in the next 5 to 10 years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "October 07, 2022, 04:53:04 PM",
      "body": "Quote from: Editbar on October 07, 2022, 03:39:57 PMBTC's circulating supply is now 19 billion out of the 21 billion caps.Millions, not billions. Precisely, it's 19,171,998.41915050 BTC as of block 757553. A few thousands of them are provably non-spendable and another few just lost. Quote from: Editbar on October 07, 2022, 03:39:57 PMIs it possible to calculate how much the price of BTC will go up until it hits the 21 billion cap? No, because demand, oppositely to supply, isn't fixed.Quote from: Editbar on October 07, 2022, 03:39:57 PMI know there is some complicated math you can do about circulating supply, market cap, price etc, it's all connected, There's nothing complicated. Someone is willing to give some amount of dollars for a bitcoin. Another might offer more than that. A miner will accept selling to the latter. That's about how the price is determined.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FriedeFritz",
      "created_time": "October 07, 2022, 04:56:29 PM",
      "body": "The price of bitcoin on each exchange is determined by the most recent bitcoin transaction on exchange.However, the truth is that BTC is so unpredictable because no one is certain of its precise value in terms of money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "October 07, 2022, 05:05:56 PM",
      "body": "Mathematics fails where Bitcoin is. Because you can't do that even a supercomputer can't calculate at all. It's like we can't forecast our future, Bitcoin price totally depends on supply and demand. We don't know if big investors leave Bitcoin near future which would dump or we don't know if we will get new big investors which would pump a couple of x Bitcoin prices. So forget about price calculation. If you are a risk taker then accumulate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "October 07, 2022, 05:07:08 PM",
      "body": "Quote from: Editbar on October 07, 2022, 03:39:57 PMIs it possible to calculate how much the price of BTC will go up until it hits the 21 billion cap? This would be pure speculation, and I saw many models that predict prices from $100k  to $1 million, but with ever increasing inflation (that will most likely switch to hyperinflation) that isn't really so important.Value for dollar and other fiat currencies is going down every day, they print a ton of money and this messes up with all price predictions.Everyone probably heard about PlanB predictions, but here is one even more optimistic prediction Bitcoin rainbow chart:https://www.blockchaincenter.net/en/bitcoin-rainbow-chart/Quote from: Editbar on October 07, 2022, 03:39:57 PMHow can I calculate the price potential of BTC within the next 1-10 years?You can't calculate this, you can only make prediction like for everything else in future, unless you have a time machine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "October 07, 2022, 05:13:12 PM",
      "body": "And maybe the OP is confused with calculating and predicting.  Obviously both are not possible, we will just have our rough estimates base on several factors like supply and demand, our best guestimate.And we have seen that it could be a a hit or miss, which then goes to show that no one here can exactly tell us how big the price will be in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "October 07, 2022, 05:37:11 PM",
      "body": "Quote from: btc_angela on October 07, 2022, 05:13:12 PMAnd maybe the OP is confused with calculating and predicting.  Obviously both are not possible, we will just have our rough estimates base on several factors like supply and demand, our best guestimate.And we have seen that it could be a a hit or miss, which then goes to show that no one here can exactly tell us how big the price will be in the future.I am pretty sure OP is talking about price calculation. Not prediction. We don't need anything to predict the Bitcoin price, we can just share it from our own experience and knowledge. But we have seen a lot of stupid predictions as well like Bitcoin will be zero and so on. We just need to be realistic and predict based on past history and experience. The calculation isn't possible at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Russlenat",
      "created_time": "October 07, 2022, 09:59:22 PM",
      "body": "Quote from: mk4 on October 07, 2022, 03:53:24 PMYou really can't — simply because supply is one thing, but demand is the second major factor whereas you can't really know how much demand an asset has until you see it. Bitcoin can literally be at the 21 million supply cap right now but if not much people are buying it and lots more people are selling, the price will drop regardless if bitcoin already has zero inflation.https://www.investopedia.com/terms/l/law-of-supply-demand.asp No one can do that because not only that the market is very unpredictable, but also you will not know how many of those would want to buy and would want to sell. So it still fall on demand and supply. And you can’t even correctly predict when will bitcoin end up being bearish or starts to be bullish, the reason why everyone only end up in wild but educational guesses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "October 07, 2022, 10:12:02 PM",
      "body": "Quote from: The Cryptovator on October 07, 2022, 05:05:56 PMMathematics fails where Bitcoin is. Because you can't do that even a supercomputer can't calculate at all. It's like we can't forecast our future, Bitcoin price totally depends on supply and demand. We don't know if big investors leave Bitcoin near future which would dump or we don't know if we will get new big investors which would pump a couple of x Bitcoin prices. So forget about price calculation. If you are a risk taker then accumulate. It's not that Mathematics fails, it's just impossible to predict. There are ways you could estimate, but that would be so broad, and full of speculation that it would probably be rather pointless. You'd use Math to get to that conclusion though even if it was broad. If you knew every single factor from here to the point where every Bitcoin has been mined, you'd have a good chance at predicting it. However, since you can't know everything that's going to happen during that time, you can't. It's as simple as that, to do Math you need the input to get the output, which is something we don't have, and won't ever happen until that day comes. You can however, calculate the risk. At the moment, I'd probably go out on a limb, and say the only immediate threat that I see would be global bans of Bitcoin. However, I still think that's rather unlikely. The other things that could push the value significantly down would be vulnerabilities discovered, but hopefully we won't have too many of those in the future as that can definitely drag consumer confidence down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Viscore",
      "created_time": "October 07, 2022, 10:55:47 PM",
      "body": "Quote from: The Cryptovator on October 07, 2022, 05:05:56 PMMathematics fails where Bitcoin is. Because you can't do that even a supercomputer can't calculate at all. It's like we can't forecast our future, Bitcoin price totally depends on supply and demand. We don't know if big investors leave Bitcoin near future which would dump or we don't know if we will get new big investors which would pump a couple of x Bitcoin prices. So forget about price calculation. If you are a risk taker then accumulate.  Bitcoin will never be certain, as it may be bearish today but the next day it will start to be bullish, so no one gets to calculate its price right. And there may be big news in the future that will bring big changes in the market positively, or the other way around, bitcoin will always have negative news coming in that will make its price to fall even more. So everything is very unpredictable with bitcoin, even if you see yourself as an expert to it, you would still fail how to predict its market price movement and its future price 5-10 years from now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "October 07, 2022, 11:57:07 PM",
      "body": "the amount of coins in circulation has nothing to do with the number of coins on a marketnormal high school economics tells you less coins in circulation means higher price.. and so using dumb high school economics when bitcoin had 11mill coins in 2012 the price should have been higher than now  19m coins.so forget high school economicsprice discovery is based on the coins on the market. not coins custodian on exchanges. but actual coins being put onto market ordersyou cannot predict the sentiments/whims of peoples decisions to guess the pricehowever there is one fundamental that you can work out.. the window in which the price will wiggle withinthink of it this wayif everyone one the planet can mine bitcoin for less than X no one will happily buy bitcoin for much more then X because everyone can get bitcoin cheaper by other means.so there is always a top X level of a price windowalso if no one can mine bitcoin below Y no one would be foolish to acquire bitcoin for more and then sell for less.. so there is a limit of the bottom window of Yright now Y=$15k and X=$95Kand he price will wiggle within this window due to random sentimentwhen bitcoins mining costs increase due to the competition of hashrate or the reward halving. this widow values will increase meaning the price within the window will increase.so calculate out the cost of mining on the next gen asics releasing in early 2023. and a reasonable increase of hashrate in 1 years time. do the maths on the lowest mining cost with cheapest electric and then most expensive electric and you will see how much the window increases by which can then help calculate possible future growthin short last year X was ~$75k. which is why the sentiment of the speculative price only wiggled up to the $70k ATHthis year if there was enough emotion and sntiment to push the price up. it would max out at ~$90kthe more costly it is to mine the more people would be willing to just buy it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "worle1bm",
      "created_time": "October 08, 2022, 07:11:04 AM",
      "body": "We can only make assumptions based on the current time period but don't know what will be the scene in future like the demand and use of bitcoin at that time.We can be speculative at this time but these can totally be wrong so you can't say that according to this supply the price will be this because it's dependant on demand at that time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "October 08, 2022, 07:44:12 AM",
      "body": "Quote from: Welsh on October 07, 2022, 10:12:02 PMYou can however, calculate the risk. At the moment, I'd probably go out on a limb, and say the only immediate threat that I see would be global bans of Bitcoin. I don't see a threat of the underlying asset being banned. But banning it's generation and its coming to life through PoW mining activities is surely something many would love to see getting banned or restricted. That would kill the bitcoin we know without restricting people from using it.  Quote from: Welsh on October 07, 2022, 10:12:02 PMThe other things that could push the value significantly down would be vulnerabilities discovered, but hopefully we won't have too many of those in the future as that can definitely drag consumer confidence down. The code has been out there for so long. It's been reviewed and thoroughly checked by both honest and malicious actors. One should never say never, but I think we are a long way from someone finding and taking advantage of a serious vulnerability or a bug in the codebase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "October 08, 2022, 10:13:33 AM",
      "body": "It is possible to calculate how much btc will cost when the last coin out of 21,000,000 is mined, but it is impossible to say whether this figure will be true. We can say with confidence that the price will be many times higher than the current one. This is based on past growth rates and if inflation is taken into account. Also, the influence of many factors may change the estimated cost bitcoin in the future. If you define btc as a commodity, then the standard market laws will apply to the coin. If bitcoin is in demand by that time, then the price will be correspondingly high. I believe that at such long distances, the price prediction of bitcoin will have very large errors.1-10 years is easier to predict due to the growth bitcoin's cycle, which repeats itself after about 4 years. There is an opinion that by 2024-2025 btc will cost more than $100,000. No one will name the exact figure, but this level must be completed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "October 08, 2022, 10:41:32 AM",
      "body": "Quote from: Editbar on October 07, 2022, 03:39:57 PMBTC's circulating supply is now 19 billion out of the 21 billion caps.Is it possible to calculate how much the price of BTC will go up until it hits the 21 billion cap? I know there is some complicated math you can do about circulating supply, market cap, price etc, it's all connected, How can I calculate the price potential of BTC within the next 1-10 years?It's not a matter of complicated maths, it's a matter of how high the demand will be in the future, and that isn't something that can be calculated. The only maths calculations we can, IMO, make are related to the global economy's value, estimating how big it'll be in a few years (there are estimates for that) and trying to reasonably predict which percentage from the global economy Bitcoin market can take. But it'll just give rough estimates of how high it can possibly go, not what the price will actually be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AnotherAlt",
      "created_time": "October 08, 2022, 11:12:29 AM",
      "body": "No matter what everyone says. The Moral and the last answer is NO. No one can calculate or Give you the Exact ETA of Bitcoin Price for the future. Some people were saying Bitcoin won't touch 100K again. The last ATH was because of the Covid 19. While I partially agreed, I don't think we handled the previous ATH because of the Covid 19. Back in 2017, We didn't have Covid 19. How did it reach the 20K mark back then? It depends on demands and popularity. Spread the positivity of Bitcoin. Own your money with security and anonymously. Don't give access to others to handle your money. It's your asset.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}