{
  "id": "topic_5407956",
  "title": "Cannabijoy",
  "author": "Cannabijoy",
  "created_time": "July 28, 2022, 07:11:03 PM",
  "content": "Perhaps I am completely misunderstanding everything, but every time I mention Bitcoin, I am asked “What about when the internet is shut off”. I know this is highly unlikely, but seeing that this is the #1 criticism, I would love to have a reply that ends the conversation.I have seen that Bitcoin can be sent over HAM radio, but there seems to be some issues with this. Mostly that the recipient must be prepared to receive the Bitcoin. I was wondering if it would be possible to use HAM radio to send Bitcoin over an extremely short distance- from your hardware wallet to a paper wallet- and to do this without interference from authorities.This would allow you to make small paper wallets that could be used for local transactions. It would basically be like paper cash, and then the recipient could either radio the Bitcoin to their own wallet, or wait until internet is accessible again. Like I said, I might be misunderstanding all of this, so please don’t be too hard on me. Thanks!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407956",
  "comments": [
    {
      "author": "PowerGlove",
      "created_time": "July 28, 2022, 07:20:11 PMLast edit: July 28, 2022, 07:34:50 PM by PowerGlove",
      "body": "You can create and sign a transaction while the Internet is off (with your wallet software).You can transmit that signed transaction however you like (over radio, carrier pigeon, etc.) but you can't have that transaction \"confirmed\" and added to the blockchain until you submit it to the Bitcoin network.Be careful with these \"offline\" payments, because nothing prevents someone from \"spending\" their funds more than once, and only one of the transactions will be able to be confirmed by the network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cannabijoy",
      "created_time": "July 28, 2022, 07:31:57 PM",
      "body": "Would sending Bitcoin from your Ledger hardware wallet to a paper wallet over HAM radio submit the transaction to the Bitcoin network?https://twitter.com/NickSzabo4/status/1095471796982149120?s=20&t=PIgflgsvUpap5Uy9yv9XtQ",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "July 28, 2022, 07:48:13 PMLast edit: July 28, 2022, 07:58:41 PM by PrivacyG",
      "body": "There was a radio station from Brazil if I remember correctly that was aiming to do exactly that.  Send Bitcoin through radio.  How easy or accessible that is to do however and under which circumstances, I do not know.  Nor can I find the link anywhere on the Internet, maybe someone else could give it a better search.Larger issues arrive when you are doing short distance transactions though.  If the Internet is offline, I think it becomes extremely easy to create illegitimate Bitcoins and scam others into believing they are real.  That is because there are no more peers, there is no more network.  Therefore, how do you broadcast and how do you receive the confirmations?If there is no way you can broadcast transactions and receive confirmations, it is easy to scam.  I could have 3 laptops on me.  All disconnected from the Internet and having the same Bitcoin wallet on them.  I could meet up with 3 different people and 'send' them 1 Bitcoin each.  Although I actually own just 1 Bitcoin, I just multiplied it by 3 because my wallets are not connected to any network to verify double spending and the transactions are not being broadcasted anywhere.Similarly, a local mesh network could be malicious by running a Bitcoin chain that is mining blocks different from, say, the one running at the time under a local mesh network in Germany.  Because our local mesh network has no connection to the local mesh network from Germany, at the time the two connect, as far as I understand the longer chain becomes invalid.  And that would create a TON of problems.By having the Internet shutting down, I think Bitcoin is doomed really until the network is back up.  But on the other hand.  If the Internet shut off for even a day, would the entire world not turn into a chaos of such a large scale it would be so much more important to prioritize food and survival over anything else, including cash and Bitcoin?-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PowerGlove",
      "created_time": "July 28, 2022, 08:02:51 PM",
      "body": "Quote from: Cannabijoy on July 28, 2022, 07:31:57 PMWould sending Bitcoin from your Ledger hardware wallet to a paper wallet over HAM radio submit the transaction to the Bitcoin network?That depends on what you mean by the Internet being off.If it's just off for you, but still on for the person on the other side of the radio, then they would have to submit the transaction to the network on your behalf.If it's off for everyone, then nothing can be done to have the transaction \"confirmed\" and added to the blockchain (i.e. someone in this setup needs access to the Bitcoin network).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "July 28, 2022, 08:14:59 PM",
      "body": "Quote from: Cannabijoy on July 28, 2022, 07:31:57 PMWould sending Bitcoin from your Ledger hardware wallet to a paper wallet over HAM radio submit the transaction to the Bitcoin network?To put it simply, yes you can. A Bitcoin transaction is nothing more than a piece of digital information like any other. If you can send and receive information via HAM radio from/to the Internet, then you can do the same with Bitcoin transactions. However, whenever you transmit information about a signed Bitcoin transaction, someone on the receiving end must have a HAM radio connected to the Internet to be able to broadcast your transaction to the Bitcoin network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cannabijoy",
      "created_time": "July 28, 2022, 08:43:16 PMLast edit: August 08, 2022, 09:43:22 AM by mprep",
      "body": "Okay, if I’m understanding correctly, if the United States shut off the internet then we would need someone in Mexico or Canada to confirm all transactions over radio, which would probably be impossible. I’m guessing the best use-case for this type of transaction is if we need to escape the country, and we could pay someone over HAM radio to meet us?Quote from: PrivacyG on July 28, 2022, 07:48:13 PMBy having the Internet shutting down, I think Bitcoin is doomed really until the network is back up.  But on the other hand.  If the Internet shut off for even a day, would the entire world not turn into a chaos of such a large scale it would be so much more important to prioritize food and survival over anything else, including cash and Bitcoin?I agree we would have a lot more problems, but this seems to be an argument in favor of gold. At least with gold, we could have something to start a new economy. I’m wondering if it would be smart to make several paper wallets while we have internet, and put some satoshis on each wallet to be exchanged if the time comes. Is that the only way to use Bitcoin as a means of commerce in a temporarily offline society?[moderator's note: consecutive posts merged]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotFuzzyWarm",
      "created_time": "July 28, 2022, 08:57:30 PM",
      "body": "QuoteOkay, if I’m understanding correctly, if the United States shut off the internet then we would need someone in Mexico or Canada to confirm all transactions over radio, which would probably be impossible. Um, in what sort of reality does one live to think that the US or any modernized country would ever 'shut off the internet'? For virtually all countries these days ALL communications be it telephone, data exchange, video, etc. sooner or later runs through the internet so any country deciding to block the networks in said country is simply NOT EVER going to happen unless they want to commit economic suicide. As for any country being able to globally kill the internet, again that is simply NOT possible because by-design the networks WILL find other routes to re-establish the links needed to find each other.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PowerGlove",
      "created_time": "July 28, 2022, 09:36:39 PMLast edit: July 30, 2022, 05:05:35 AM by PowerGlove",
      "body": "Quote from: NotFuzzyWarm on July 28, 2022, 08:57:30 PMUm, in what sort of reality does one live to think that the US or any modernized country would ever 'shut off the internet'? For virtually all countries these days ALL communications be it telephone, data exchange, video, etc. sooner or later runs through the internet so any country deciding to block the networks in said country is simply NOT EVER going to happen unless they want to commit economic suicide. As for any country being able to globally kill the internet, again that is simply NOT possible because by-design the networks WILL find other routes to re-establish the links needed to find each other.I agree it's not realistic, but OP is asking a genuine question and trying to understand how it works, so no need for you to shout, IMO.Quote from: Cannabijoy on July 28, 2022, 08:43:16 PMOkay, if I’m understanding correctly, if the United States shut off the internet then we would need someone in Mexico or Canada to confirm all transactions over radio, which would probably be impossible. Seems possible to me. I'm not big into radio, but you can modulate/demodulate any data you want over it, including the entire blockchain if necessary.Quote from: Cannabijoy on July 28, 2022, 08:43:16 PMI’m guessing the best use-case for this type of transaction is if we need to escape the country, and we could pay someone over HAM radio to meet us?In that kind of scenario, another low-tech way to \"send\" them your bitcoin would be to simply tell them what your private key is, don't need wallet software and modems for that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cannabijoy",
      "created_time": "July 28, 2022, 09:50:34 PM",
      "body": "Quote from: NotFuzzyWarm on July 28, 2022, 08:57:30 PMUm, in what sort of reality does one live to think that the US or any modernized country would ever 'shut off the internet'? For virtually all countries these days ALL communications be it telephone, data exchange, video, etc. sooner or later runs through the internet so any country deciding to block the networks in said country is simply NOT EVER going to happen unless they want to commit economic suicide. As for any country being able to globally kill the internet, again that is simply NOT possible because by-design the networks WILL find other routes to re-establish the links needed to find each other.I agree it’s highly improbable. However, it’s the #1 criticism I hear, and it’s not impossible. The United States has an internet kill-switch, and it can be pulled by any president. Russia has temporarily shut off their internet to the rest of the world, and China is making it increasingly harder to use VPNs and Bitcoin. I don’t see this happening anytime soon, but it seems like it would be smart to secure Bitcoin for absolutely anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotFuzzyWarm",
      "created_time": "July 28, 2022, 09:52:25 PMLast edit: July 29, 2022, 03:49:32 PM by NotFuzzyWarm",
      "body": "Shouting?Er, no. Just providing needed emphasis that the OP's scenario cannot happen. As others have already said, the continued operation of the BTC network would be the last thing people would be caring about.As a very singular and isolated edge-case, sure, it's a valid speculative question but rates up there with \"How many angels can sit on the head of a pin\"...As for QuoteThe United States has an internet kill-switch, and it can be pulled by any president. Russia has temporarily shut off their internet to the rest of the world, and China is making it increasingly harder to use VPNs and Bitcoin.No the US (nor any other country) does not have code that can be sent out as a 'Kill switch'. Does the US and several other countries have the ability to screw with/attack the internet? Sure. Thing is the global networks are just too independent and self-healing for any attempts at 'killing the internet' to have long-term success. Yes the various countries that hold the major DNS servers and undersea intercontinental fiber trunks end-points can easily muck things up for a while if they want to and can certainly take down/control networks within their borders. As China found out when they tried having the GFW redirect certain address queries eventually ways are found to circumvent it.The most prominent example of how the internet functions outside of ANY government control is the DarkNet/Web which is comprised of a gazillion independent servers that are directly accessed via their actual TCPIP addresses. Unless one takes down every single ISP along with every possible way they can communicate (fiber/radio/old-school copper/etc) with each other in every country on Earth the networks will survive. Won't be particularly fast or reliable though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cannabijoy",
      "created_time": "July 28, 2022, 11:09:14 PM",
      "body": "Quote from: NotFuzzyWarm on July 28, 2022, 09:52:25 PMNo the US does not have code that can be sent out as a 'Kill switch'. The global networks are just too independent and self-healing for any attempts at 'killing the internet' to have long-term success. Yes the various countries that hold the major DNS servers and main fiber trunks end-points can easily muck things up for a while if they want to and can certainly take down/control networks within their borders. Thing is, As China found out when they tried having the GFW redirect certain address queries eventually ways are found to circumvent it.The most prominent example of how the internet functions outside of ANY government control is the DarkNet/Web which is comprised of a gazillion independent servers that are directly accessed via their actual TCPIP addresses. Unless one takes down every single ISP along with every possible way they can communicate (fiber/radio/old-school copper/etc) with each other in every country on Earth the networks will survive. Won't be particularly fast or reliable though.I understand that there is <5% chance that any of this will happen. I was having this conversation with someone, and I said there is a way to bypass practically any regulation, and this is what they said:Quote Right, but those still require an internet connection to your ISP. Once ISP's are forced to authenticate all user's  QR code on their proprietary routers (which you cant opt out of) were fucked. The only way BTC will work is with decentralized radio mesh networks…..I understand what you're saying, but once the proliferation of Digital ID's come in, the authentication technology will change. CCP blocks everything at the national firewall level, where as future censorship will be at the local, router level. I work in IT and cybersecI cannot confirm whether they work in IT, but what are your thoughts on this?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "July 28, 2022, 11:38:32 PM",
      "body": "Quote from: FatFork on July 28, 2022, 08:14:59 PMTo put it simply, yes you can. A Bitcoin transaction is nothing more than a piece of digital information like any other. If you can send and receive information via HAM radio from/to the Internet, then you can do the same with Bitcoin transactions.This. However the thing of shutting internet off? Is nearly impossible. Any country will not do that, almost every transaction on country like US are made via internet not just crypto/bitcoin transfer also banks. If something this happened probably it due to huge calamity breaking those internet cable undersea and other internet infras on land. OR because of war.So, if internet is shut off due to these reasons, then you could be facing lots of problem than making bitcoin transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "July 28, 2022, 11:40:54 PM",
      "body": "There are no transactions from wallets to wallets, there are only adresses. Wallets are just methods for managing addresses and their private keys. The network does not distinguish between hardware wallets or paper wallets or \"online\" wallets.To make a transaction, you need it to reach the Bitcoin network - you can be as creative as you want here, even by sending a pigeon with a QR code to a guy that has Internet and can submit the transaction. But your counterparty must have a way to verify that the transaction was confirmed - otherwise the idea of \"offline\" transactions won't really work, it would be way too easy to scam people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PowerGlove",
      "created_time": "July 29, 2022, 12:07:19 AM",
      "body": "Quote from: Cannabijoy on July 28, 2022, 11:09:14 PMI was having this conversation with someone, and I said there is a way to bypass practically any regulation, and this is what they said:Quote Right, but those still require an internet connection to your ISP. Once ISP's are forced to authenticate all user's  QR code on their proprietary routers (which you cant opt out of) were fucked. The only way BTC will work is with decentralized radio mesh networks…..I understand what you're saying, but once the proliferation of Digital ID's come in, the authentication technology will change. CCP blocks everything at the national firewall level, where as future censorship will be at the local, router level. I work in IT and cybersecI cannot confirm whether they work in IT, but what are your thoughts on this?There's a lot to unpack in your friend's quote, I'll only address some of it.Bitcoin needs a network to operate. Right now, that network is the Internet.Long before we have to resort to using post-apocalyptic mesh networks, we'll get along just fine using overlay networks like Tor.There are a lot of very determined, very intelligent Bitcoiners with \"hacker\"[1] mindsets that are willing to die on this hill.I don't believe the regulators have a hope in hell of stopping this thing.[1] The Conscience of a Hacker",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cannabijoy",
      "created_time": "July 29, 2022, 12:34:04 AM",
      "body": "Quote from: PowerGlove on July 29, 2022, 12:07:19 AMThere's a lot to unpack in your friend's quote, I'll only address some of it.Bitcoin needs a network to operate. Right now, that network is the Internet.Long before we have to resort to using post-apocalyptic mesh networks, we'll get along just fine using overlay networks like Tor.There are a lot of very determined, very intelligent Bitcoiners with \"hacker\"[1] mindsets that are willing to die on this hill.I don't believe the regulators have a hope in hell of stopping this thing.[1] The Conscience of a HackerI agree with this 100%. I am not worried about Bitcoin because I will continue to learn how to use it. I don’t care if it’s worth $100 on an exchange. I believe Bitcoin is real money. I just like to have answers other than “oh, that’ll never happen”, because shit happens. I do not trust the government, and I do not believe a manufactured civil war is beyond the realm of possibility. I’m thinking about how we will keep Bitcoin going if some apocalyptic event does happen. I believe this is important- just in case. If Bitcoin is to survive for a thousand years, then it must outlive governments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotFuzzyWarm",
      "created_time": "July 29, 2022, 01:35:09 AMLast edit: July 29, 2022, 07:17:02 PM by NotFuzzyWarm",
      "body": "Back to the original title of this thread, \"Can Bitcoin be transferred from hardware wallet to paper over radio?\", then we need to clarify what a hardware wallet (or the wallet residing on the copy of Core you can run as a BTC node) is and does...a. All a hardware or Core software wallet does is store your private keys along with public addresses derived from them and work with the accounting side of wallet software. BTC is NOT stored on the wallet. The coins themselves exist only in cyberspace waiting to be accessed through use of your keys.b. It is not until you want to spend or receive BTC that the network itself comes into play.c. The firmware in the hardware wallet along with software that comes with it should allow you to print out said keys or at a minimum display the keys so you can write them down - in other words you just moved, well to be more accurate copied, ownership of your BTC to paper.d. Given 'b' and 'c' no network access is needed as you are not moving coins, just adding another location where the keys are stored.Now, if the OP intended to ask, \"can you use BTC by having a mesh packet radio network setup\", of course the answer is yes. All it requires is the mesh network having an access point somewhere that is connected to a 'real' network so it can access the BTC Mainet and for the user to have a PC with wallet software tied to a transceiver that can access the packet radio network so your Tx's are eventually fed into the blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PowerGlove",
      "created_time": "July 30, 2022, 07:25:56 AM",
      "body": "Quote from: Cannabijoy on July 28, 2022, 07:31:57 PMWould sending Bitcoin from your Ledger hardware wallet to a paper wallet over HAM radio submit the transaction to the Bitcoin network?https://twitter.com/NickSzabo4/status/1095471796982149120?s=20&t=PIgflgsvUpap5Uy9yv9XtQOkay, I've done a bit more research about this tweet.It seems we overcomplicated things (with offline transaction signing, etc.) because unless I'm mistaken what actually happened was pretty simple: Some guy sent another guy his private key over shortwave radio.Details here (see explanation by \"nowitsalllgone\"): https://www.reddit.com/r/Bitcoin/comments/aq1f99/bitcoin_transferred_via_radio_wavesSo, to answer OP's above question: No, in this example the Bitcoin network was not interacted with during the transmission. However, once the recipient got the private key they did interact with the network by immediately \"sweeping\" the funds (to prevent the sender from spending them again).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "July 30, 2022, 08:02:25 AM",
      "body": "Quote from: Cannabijoy on July 28, 2022, 07:11:03 PMI was wondering if it would be possible to use HAM radio to send Bitcoin over an extremely short distance- from your hardware wallet to a paper wallet- and to do this without interference from authorities.It is worth pointing out that the physical distance involved is absolutely irrelevant. What is required is that the receiving party has a connection to the internet so can broadcast the transaction to the rest of the network. If neither party has an internet connection, then you cannot broadcast the transaction and so you have zero protection against a double spend.Quote from: Cannabijoy on July 28, 2022, 08:43:16 PMOkay, if I’m understanding correctly, if the United States shut off the internet then we would need someone in Mexico or Canada to confirm all transactions over radio, which would probably be impossible.If the US shut off the internet, then anyone in the US who wanted to send bitcoin would have to deliver their transaction data by some method (radio, phone, physically handing over a SD card, mesh network, carrier pigeon, whatever) to someone who did have an internet connection so they could broadcast it for them. For the people in the US to remain synced with the network and see the latest blocks, they would either need to use something like a mesh network or Blockstream Satellite.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "July 30, 2022, 01:49:48 PM",
      "body": "Quote from: Cannabijoy on July 28, 2022, 08:53:38 PMI agree we would have a lot more problems, but this seems to be an argument in favor of gold. At least with gold, we could have something to start a new economy. I’m wondering if it would be smart to make several paper wallets while we have internet, and put some satoshis on each wallet to be exchanged if the time comes.I can not provide an argument in favor or Bitcoin when there are other assets in favor under your mentioned circumstances, we have to be realistic.  Bitcoin is digital money, so without digital there is no Bitcoin.There have been several attempts to create a physical version of Bitcoin.  Casascius coins were among the first, but do you see it realistically happening?  Would you accept a small brass coin that supposedly has a Bitcoin private key printed on its back containing 0.5 Bitcoins that you can not check or move considering there is no Internet connection?  Do you trust the way Casascius generated, printed and disposed of these private keys?There was another attempt last year I think, there was a company trying to produce Bitcoin banknotes that are close to impossible to replicate and you could supposedly move around Bitcoins.  But to me, that is still not safe.  It is a central institution producing these notes, so who the hell knows what could happen when the Internet is off.  For what is worth, they could be running away to a country that still has active Internet connection and steal everyone's funds off the notes.Quote from: NotFuzzyWarm on July 28, 2022, 08:57:30 PMUm, in what sort of reality does one live to think that the US or any modernized country would ever 'shut off the internet'? For virtually all countries these days ALL communications be it telephone, data exchange, video, etc. sooner or later runs through the internet so any country deciding to block the networks in said country is simply NOT EVER going to happen unless they want to commit economic suicide.I think almost all of us have this somehow wrong (in my opinion) belief that just because today we have a 'safe and secure' regime tomorrow will be a safe day too.  History teaches us tomorrow could be the opposite of what today was for some people or countries.This Internet Blackout is one scenario I can not call unrealistic due to a variety of reasons.  We are constantly being told solar explosions could lead to such events.  We have a ton of examples of regimes turning wrong along the thousands of years of history.  And there is more to it.  It may seem and maybe even be close to impossible NOW, as we speak, but things could immediately change.  And there are some things we can not have control over.  I can not agree more with you however that in case a solar explosion knocks out electricity or the regime changes to one of a nightmare, Bitcoin is going to be our last priority.Quote from: o_e_l_e_o on July 30, 2022, 08:02:25 AMFor the people in the US to remain synced with the network and see the latest blocks, they would either need to use something like a mesh network or Blockstream Satellite.How do you make sure that Washington's mesh network is running the same chain Florida's is?  In case they mine blocks separately and they collide at some point when the Internet is back up, is it not extremely insecure especially against double spending?  If the internet shuts down and I have 1 Bitcoin in my wallet, can I not double spend it by spending it once in Florida and then moving to Washington and spending it a second time?  If the two mesh networks do not communicate, there is no way Washington's has the information that my 1 Bitcoin have already been spent before.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}