{
  "id": "topic_5467472",
  "title": "elevates",
  "author": "elevates",
  "created_time": "September 20, 2023, 02:16:54 PM",
  "content": "I was trying to find a certain date for the actual halving event as a stupid fool. I noticed that the date changes, as it all depends on the blocks. At the moment it is due in the month of March, earlier it was in the month of May next year. The next thing I did was to check the ROI of Bitcoin after every halving. The ROI, if anyone had bought Bitcoin before 2011 was 100x approximately from 2012 to 2016. if you bought Bitcoin in 2015 it would be 7X approximately in November of 2021. My math can be wrong and I am open to criticism about it. Continuing with what I discovered, I saw a pattern while trying to find my actual objective. It is a pattern that might determine when Bitcoin will get a new ATH. This might sound unreal but Bitcoin takes approximately 1.3 years to get to a new ATH. if we consider the halving dates and then check the new ATH, as an average it concludes. I am not speculating anything as it is a simple calculation of the average. just take a look:2012 halving - New ATH reached around 1 year after 2016 halving - New ATH reached around 1.5 years after2020 halving - New ATH reached around 1.5 years afterI know that there are multiple reasons for Bitcoin reaching a new ATH. I do understand that cannot be based on the law of averages. What do you guys think, Is the law of average work here or I am just speculating it?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467472",
  "comments": [
    {
      "author": "tbct_mt2",
      "created_time": "September 20, 2023, 02:23:12 PM",
      "body": "Quote from: elevates on September 20, 2023, 02:16:54 PM2012 halving - New ATH reached around 1 year after 2016 halving - New ATH reached around 1.5 years after2020 halving - New ATH reached around 1.5 years afterI know that there are multiple reasons for Bitcoin reaching a new ATH. I do understand that cannot be based on the law of averages. What do you guys think, Is the law of average work here or I am just speculating it? New all time highs in the past usually occur 1 year or a little bit longer after a halving because halving is a stimulation for Bitcoin to appear more on media. It helps Bitcoin to be expose to more people and bring them as well as their capital to Bitcoin market.It won't be seen after one night because people need time to research, have belief on something they hear of a first time, and surely need time for consideration before spending money to invest in Bitcoin. 1 year or 1.5 years, it is not too long but because you can not know where is the top, new all time high and even when it occurs, you can use past halving cycles and time needed to reach a new all time high for your plan to take profit in 2024 and 2025 bull run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "September 20, 2023, 02:46:27 PM",
      "body": "Who's still not aware with such pattern?There are so many influencers out there already create videos about Bitcoin ATH will happen in 2025, it's not mean I trust their words, but it's a sign such pattern is obvious. What if the bull run happen next 2 years after? no one know, but the highest possibility is a year after halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "September 20, 2023, 02:48:21 PM",
      "body": "I suppose one could argue that with 2020 halving, a new ATH was reached earlier than 1.5 years after the event if you consider the time of peaking above the previous ATH point and not the eventual total peak before the bear market. But it's possible to look at it from your point of view and see this pattern as well. Of course, just 3 times isn't enough to say it's a regularity, but since we've got nothing left apart from a pretty short Bitcoin history, it makes sense to try to base our guesses on that data. But if the new ATH is reached around a year and a half after halving, that doesn't mean that Bitcoin won't recover earlier because it can reach a bit over the previous ATH significantly earlier even based on historical data, as it did only 7 months after halving of 2020.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "September 20, 2023, 03:12:55 PM",
      "body": "Quote from: elevates on September 20, 2023, 02:16:54 PMI am not speculating anything as it is a simple calculation of the average.Reaching ATH is basically speculation, and your calculations are only about anything more specific than price.I also noticed that pattern as a conclusion to my predictions, but that again would not contain any accuracy because ATH is not a cycle. Several major scenarios can further influence future pattern changes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "September 20, 2023, 03:23:59 PM",
      "body": "Quote from: elevates on September 20, 2023, 02:16:54 PM2012 halving - New ATH reached around 1 year after 2016 halving - New ATH reached around 1.5 years after2020 halving - New ATH reached around 1.5 years afterI know that there are multiple reasons for Bitcoin reaching a new ATH. I do understand that cannot be based on the law of averages. What do you guys think, Is the law of average work here or I am just speculating it? This pattern cannot be disputed, but what is more interesting here is that, before the halving, you will have the option to purchase bitcoin at a price that is lower.  It is more likely that it will not go beyond the price it was at the time of the halving. It may take a year or more for bitcoin to reach its new all-time high after halving, but if you can acquire it at a cheaper price, bitcoin achieving its new all-time high in one or more years will be in your advantage of a profitable outcome. This should not deter anyone who intends to accumulate bitcoin ahead of the halving and subsequently hitting the new ATH.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "September 20, 2023, 03:41:32 PM",
      "body": "That pattern ain't a secret anymore. That's why we've got the so-called '4-year cycle' and from that cycle, that's how the market turns into a bull run after coming from a terrible bear market. But if there's another halving and bull run that's to be expected, 2021 was different from the past bull runs and that's why we might also see another different bull run approximately on 2025. Quote from: elevates on September 20, 2023, 02:16:54 PMWhat do you guys think, Is the law of average work here or I am just speculating it? We're all speculating and you know what's the beauty of this market? Every law or theory that we believe that's gonna work to Bitcoin can be applied depending on the situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sayeds56",
      "created_time": "September 20, 2023, 03:45:20 PM",
      "body": "Quote from: Jawhead999 on September 20, 2023, 02:46:27 PMWho's still not aware with such pattern?There are so many influencers out there already create videos about Bitcoin ATH will happen in 2025, it's not mean I trust their words, but it's a sign such pattern is obvious. What if the bull run happen next 2 years after? no one know, but the highest possibility is a year after halving.You are correct in being cautious when it comes to predicting future price of Bitcoin or its all time high (ATH) as well as market trend. The idea that ATH tends to occur in a year following a Bitcoin halving event may appear probable based on historical trends, but there is no guarantee as Bitcoin always surprises us with unpredicted moves, which is its inherent nature.I believe the condition of the global economy in 2024  will play crucial role in determining the timing of Bitcoin's all time high (ATH) event.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "September 20, 2023, 03:53:46 PM",
      "body": "Quote from: kryptqnick on September 20, 2023, 02:48:21 PMjust 3 times isn't enough to say it's a regularity, but since we've got nothing left apart from a pretty short Bitcoin history, it makes sense to try to base our guesses on that data. But if the new ATH is reached around a year and a half after halving, that doesn't mean that Bitcoin won't recover earlier because it can reach a bit over the previous ATH significantly earlier even based on historical data, as it did only 7 months after halving of 2020.I agree with your stated points, Yes if this had occurred more than 3 times it would have been a reason to try to rely on this fact that the OP has pinpointed out on the thread,  however, on the other hand, I tend to agree with the OP because Bitcoin tends to follow some historical patterns in the past and likely we might see or get this scenario play out, but let's keep it on a watchlist.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "September 20, 2023, 03:54:03 PM",
      "body": "Slow to the station, OP. Talked about often in these parts, hence the rubbishing by some (yours truly included) that this year or even next is the rally and ensuing bull run. Hey, plenty of time to fill those bags.Completely arbitrary perhaps but I always feel that the halving effects are only realised later, even with pricing in, perhaps game theory dawns a bit after the fact, and the usual sheeple media piping it on months after it happens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "September 20, 2023, 04:08:59 PM",
      "body": "Already observing that pattern that always concludes a lot after halving then bitcoin will ATH in the range of 1-1.5 years this guess is not just one but many have been issued by several influential people, so although my speculation is a little bit leading to it but not too concerned with this pattern now.I just need to focus on filling the bag before the preparation starts, maybe that's a better step than thinking about this pattern because it has no meaning for now.Some are definitely waiting for the halving to happen and waiting for a while, they believe more in the end of 2024 or 2025 I'm not sure, with that pattern I guess there are still those who think the same.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "September 20, 2023, 04:21:27 PM",
      "body": "You are basically doing TA without using charts. The problem with TA is that it may never replicate the past events. It is like playing coin flipping. Just because you got tails 99 times in a row, doesn’t mean that it will be tails again in the 100th game. On the other hand we also know that history doesn’t always repeat but it often rhymes. Maybe this time there will be another ATH but it won’t happen in 1.5 years… maybe this time it will take 3 years… The real question is, what will you do if there isn’t a new ath for the next 3 years? Will you give up and sell or will you hodl?  TA is like writing a story book and then actually believing that it is real.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "September 20, 2023, 05:16:29 PM",
      "body": "OP I think most of us are really familiar with such patterns as we used to observe such sorts of seasonal posts on social media,  But what's so eye-catching in it is it cant really change the current market sentiments except for bringing a bit of motivation to the newbies (for that as well I'm not sure will it work or not). The time cant be predicted exactly but we can judge the season according to the sentiments.Even these stats are not evident in their consistency, such patterns are just used to shape the timeline for the exact speculation we cant just realize on the, even the efficient speculation for ATH is not possible all goes with the hype & sentiments (Latest developments that time), mostly narratives provide the base to every ATH cycle currently the most promising narrative close to me is ETF approvals but it may really change with the passage of time, or may not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pixie85",
      "created_time": "September 20, 2023, 05:33:00 PM",
      "body": "Quote from: elevates on September 20, 2023, 02:16:54 PMThe ROI, if anyone had bought Bitcoin before 2011 was 100x approximately from 2012 to 2016. if you bought Bitcoin in 2015 it would be 7X approximately in November of 2021. My math can be wrong and I am open to criticism about it. in 2011 you were buying for something like 2 dollars so your 100x is 200 dollars. You could have that in Spring of 2013. Later that year the price reached 1000 (500x)2015 was about 700 dollars. 7x would be close to 5000 so that's your 7x ROI reached in 2017. Yes your math is off by a lot. Quote2012 halving - New ATH reached around 1 year after 2016 halving - New ATH reached around 1.5 years after2020 halving - New ATH reached around 1.5 years afterThis doesn't mean anything. This pattern could repeat but doesn't have to because what changes is the number of bitcoin users who learn from their mistakes. Knowing the halving brings ATH they will surely start investing much sooner this time and that could either lead to the longest bull run ever or to a short one that starts early and finishes early.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "September 20, 2023, 05:33:35 PM",
      "body": "Quote from: elevates on September 20, 2023, 02:16:54 PMI know that there are multiple reasons for Bitcoin reaching a new ATH. I do understand that cannot be based on the law of averages. What do you guys think, Is the law of average work here or I am just speculating it? I understand your excitement, but yes, I was aware of this pattern, even though I have used this information to reply to many questions here on BTT. If you would use the ninjastic tool then you will find them. The thing is, we can not use the law of average here, because ATH of BTC is not fixed and depends on many factors. As we all know BTC is decentralized and open source and is not pegged or backed by any assets. That's why it only depends on the demand and supply factors. Of course, it depends on many other factors too but the main factor is D and S. I hope you will understand my point here. I also got excited when I came to know about this information, which I did due to some topics here on BTT. And from then whenever I have to say something about Halving, I try to mention the dates of ATH too. But to be honest, I thought that, the ATH after first halving took around 6 to 8 months. But according to your information, it did not take 6 to 8 months.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "September 20, 2023, 05:40:05 PM",
      "body": "Let's talk about differences.2013 brought us 2 all time highs in one year with something like 8 months between them and then the biggest exchange went bankrupt and crashed the price.2017 was cut short by bitcoin futures opening and speculators betting against bitcoin to crash it. 2020 faced Chinese mining ban which reduced the price of bitcoin by 50% from 60 to 30k. Bitcoin works like a sophisticated mechanism so people think it's repeating pattern of blocks and halvings will make the price act the same way every time, but it doesn't. Every time something different happens but this event stops Bitcoin from pushing higher and staying in the FOMO phase for too long. Usually it's just weeks and then somebody does something to stop it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 20, 2023, 07:13:25 PM",
      "body": "Quote from: elevates on September 20, 2023, 02:16:54 PMThis might sound unreal but Bitcoin takes approximately 1.3 years to get to a new ATH. if we consider the halving dates and then check the new ATH, as an average it concludes. I am not speculating anything as it is a simple calculation of the average. just take a look:2012 halving - New ATH reached around 1 year after 2016 halving - New ATH reached around 1.5 years after2020 halving - New ATH reached around 1.5 years afterI know that there are multiple reasons for Bitcoin reaching a new ATH. I do understand that cannot be based on the law of averages. What do you guys think, Is the law of average work here or I am just speculating it? there are rational reasonsmany large mining farms do not audit thier costs/profit daily. instead they buy allotments of asics and electric contracts to last 2+ years. meaning they calculate cost vs earnings every 1-2 years(for tax and upgrade purposes). thus even though a halving changes the reward earned. the asic farms are not adjusting their price/value until their year-end audit when its time to file for taxes or upgrade hardware reaching its end-of-life.. thus they wont raise their prices until a year later when its time to shuffle funds aboutthe other factor is that when halvings occur there is a rush of asic purchases. which is where people double up+ their hashrate to cling onto a comparable yield of rewards. this increase of hashrate and hardware also puts pressure on prices. again there is a delaybut yes in short the pattern has real reasons. howevernow many are aware of the pattern, speculative traders are preparing for such occurrences and so by knowing a trading pattern can cause speculators to trade against the pattern to cause the pattern to change",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "September 20, 2023, 07:15:37 PM",
      "body": "Quote from: elevates on September 20, 2023, 02:16:54 PMThis might sound unreal but Bitcoin takes approximately 1.3 years to get to a new ATH. if we consider the halving dates and then check the new ATH, as an average it concludes. I am not speculating anything as it is a simple calculation of the average. just take a look:Your approximation is correct when we see the past ATH's but we not yet aware about the coming ATH and it could take place after halving for sure but still we can't determine an exact date for that event. I'm sure that after the halving event Bitcoin's price will continue to gain some momentum and it will continue to grow to good levels within short duration, but still it's next ATH is expected around 2024's last quarter to 2025's last quarter. Yes, we can't say that the ATH will happen in 2025's first quarter because that predication will most probably be inaccurate. But, surely it will happen within 2 years after halving and once we see next ATH then once again we may see another bear market. The simplest reason that why Bitcoin reaches its ATH is when new people learn about it and they invest in it and when media or influencers promote it. Those type of promotions will be common after the halving event and people will once again invest a lot of money in whole crypto market to gain profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aikidoka",
      "created_time": "September 20, 2023, 07:23:48 PM",
      "body": "So based on the patterns you just identified the new Bitcoin ATH would potentially occur around April 2014 plus 1.2 to 1.5 years, which would place it in the third or fourth quarter of 2025. However, it's important to know that while this prediction is possible, it's also couldn't happen because we cannot accurately predict the future of Bitcoin.The law of averages could indeed come into play as expected but there's always the possibility of unexpected market events during this time frame that could disrupt these patterns.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WZBcoin",
      "created_time": "September 20, 2023, 07:24:05 PM",
      "body": "The pattern detected in the timing for the new ATH is a mathematical logic which is relating various sets of data one to the other, while the number of years needed for the new ATH is proportional to many other factors. For example, the trend of 1 to 1.5 years may have been marked by the market Cap and other factors like new adoptions.  I see a pattern has frequent repetition of an element in a set of data as a response to the changing factors in the system in which the pattern is observed. Absolutely, there is a repeating pattern here with respect to the new ATH, but the timing will always depend on the factors that controls the pattern. And that is predictable if one is able to apply an algorithm that can consider majority of the factors in order to make a forecast. The pattern will still be correct when we have mass adoption and the price become stable, I mean when the speculation is gone and  bitcoin got the mass adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}