{
  "id": "topic_5471875",
  "title": "snowpega",
  "author": "snowpega",
  "created_time": "October 27, 2023, 12:29:41 PM",
  "content": "I create this sheet for my those mates/members who do work on google spreadsheet on their daily basis. It may help you guys to calculate your portfolio easily according to your future Goals. You guys Just need to put number and you will see results.Formulation of sheet: Follow accordingly 1. Write \"investment\" in A3 cell. Leave next cell empty as shown in image.2. Write \"Bitcoin Current price\" in A6 cell. Leave next cell empty as shown in image.3. Write \"Total BTC You Got\" in D4 cell.4. Write formula \"=B3/B6\" in D5 cell.5. Write \"Put predicted value here\" in A11 cell. Leave next cell empty as shown in image.6. Write \"Profit According to Your Goal\" in D11 cell. 7. write the formula \"=D5*A12\" in D12 cell.Instruction:1. Put your investment number in B3 cell.2. Put the current price of Bitcoin or any other coin you are buying in B6 cell.4. You will see how many amount you get in D5 cell.5. Put the Predicted amount in A12 Cell.6. At the end, you will see the final result in D12 cell.If You guys have any query do lemm know. Many Thanks!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471875",
  "comments": [
    {
      "author": "Faisal2202",
      "created_time": "October 27, 2023, 02:25:51 PM",
      "body": "I like the idea, can be implemented easily but thanks for not providing it (share the link to the sheet, so those who wish to use it can get benefit out of it). Overall, there are many other profit calculators out there in the market, most of the calculators do not ask you to enter the predicted amount of BTC, they simply ask you when did you buy the BTC (like the date only,) they don't even ask for time.This is really so confusing and annoying, because when we can't write the exact time of buying the BTC then the profit changes. Like the following design is really confusing:But, the following calculators can do the same task, that your spreadsheet is doing. https://ambcrypto.com/calculator/bitcoin-profit-calculatorhttps://www.cryptoprofitcalculator.com/You can even, insert the transaction fee and tax rate and the above two calculators even show the profit that you make on your investment like in your example, you wrote $500 and the total profit is $1506 but the real profit is $1006 so, it would be nice if you will add another column representing the profit only. Great work BTW.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "October 27, 2023, 03:27:08 PM",
      "body": "You can use free Portfolio Trackers from Coinmarketcap or Coingecko.How to use Coinmarketcap Portfolio Free & Powerful Crypto Portfolio TrackerCrypto Portfolio Tracker on Google SheetsIf you want to have an open source application, consider this one.Portfolio Performance [Open Source] - Keep track of your Crypto Portfolio!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "October 27, 2023, 05:30:48 PM",
      "body": "Quote from: snowpega on October 27, 2023, 12:29:41 PM-snip-Follow accordingly Wouldn't it be more practical to give us a link to your sample sheets? Anyway, good initiative. If you are skilled enough with google sheets, you can actually enrich its features and several other functions using external references and add-ons.I so far prefer using free portfolio tracker like cryptocompare.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goxcraft",
      "created_time": "October 27, 2023, 05:37:36 PM",
      "body": "Using Google Sheets for the first time can be very hard. Especially for the new users. That's why I prefer the coinmarketcap portfolio tracker, as mentioned above. The advantage of using it is that you can track all of your asset prices. Everything is already there. You just have to add those coins to your portfolio list. Add how much you invested or bought, and it will initially give you a real time portfolio. How much you profited, how much you lost, etcetera.OP, you didn't provide us with your sample sheet. How we are suppose to test it to see if works or not?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "October 27, 2023, 06:34:03 PM",
      "body": "Does one really need all this?I think anyone who really wants to invest won't think much about their profits as the market isn't that regular or directional to what you expect, let say using the current price of bitcoin as you said may not be the ending results by next year it may go lower or even more higher but when you solely rely on the profits aspect you became more worried with your position in profits. So the best is just have a trusted wallet whereby you can buy and send directly to that wallet then you can decide to unveiled it in 2 year and above by then there are few things possible either bitcoin will gained about 2x ATH or repeat the previous which I know may or may not happen since the market are of speculatively.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "October 27, 2023, 08:42:53 PM",
      "body": "Quote from: Adbitco on October 27, 2023, 06:34:03 PMDoes one really need all this?I think anyone who really wants to invest won't think much about their profits as the market isn't that regular or directional to what you expect, let say using the current price of bitcoin as you said may not be the ending results by next year it may go lower or even more higher but when you solely rely on the profits aspect you became more worried with your position in profits. So the best is just have a trusted wallet whereby you can buy and send directly to that wallet then you can decide to unveiled it in 2 year and above by then there are few things possible either bitcoin will gained about 2x ATH or repeat the previous which I know may or may not happen since the market are of speculatively.Don't you really do some calculations before making any type of investment in BTC? Because those who want to invest in BTC with the aim of holding those BTC might not give that much of importance to the profit calculator but they still make some calculations to get an estimate of the returns. To get an idea of, whether they are making enough profit on their investment or not.I mean, if you have invested $500 and started to think that you can make $100,000 out of it, then you will be in shadow, you have to do calculations to the minimum predictable and maximum predictable price of BTC to get the idea of how much you can make on your holdings only. We can make 2x at least from our holdings but those who are simply earning in BTC with their skills, or trading in BTC might need to keep track of there capital, investment, profit, loss, etc. So sheet like this will come in handy. Op you did great work in creating it but add some other functions in it like other members have shared already. And provide the link so we can check the functionality of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "October 27, 2023, 08:54:40 PM",
      "body": "Quote from: ZAINmalik75 on October 27, 2023, 08:42:53 PMQuote from: Adbitco on October 27, 2023, 06:34:03 PMDoes one really need all this?I think anyone who really wants to invest won't think much about their profits as the market isn't that regular or directional to what you expect, let say using the current price of bitcoin as you said may not be the ending results by next year it may go lower or even more higher but when you solely rely on the profits aspect you became more worried with your position in profits. So the best is just have a trusted wallet whereby you can buy and send directly to that wallet then you can decide to unveiled it in 2 year and above by then there are few things possible either bitcoin will gained about 2x ATH or repeat the previous which I know may or may not happen since the market are of speculatively.Don't you really do some calculations before making any type of investment in BTC? Because those who want to invest in BTC with the aim of holding those BTC might not give that much of importance to the profit calculator but they still make some calculations to get an estimate of the returns. To get an idea of, whether they are making enough profit on their investment or not.I mean, if you have invested $500 and started to think that you can make $100,000 out of it, then you will be in shadow, you have to do calculations to the minimum predictable and maximum predictable price of BTC to get the idea of how much you can make on your holdings only. We can make 2x at least from our holdings but those who are simply earning in BTC with their skills, or trading in BTC might need to keep track of there capital, investment, profit, loss, etc. So sheet like this will come in handy. Op you did great work in creating it but add some other functions in it like other members have shared already. And provide the link so we can check the functionality of it.I don't actually mean you won't do some pricing while doing your investment but my dear in terms of bitcoin investment it would be very hard to determine your outcome why because you can never predict what the price may come out, instead you can take profit whenever you meet the price at the top or a place were you think your profit is enough for you and like I said before. You can predict a profit of other business like a set of television or a carton of green tea, and you can easily calculate that after selling you will make 500$ after you removed the capital from the investment in this type of investment we can easily calculate total amount to come in months or years. But talking of bitcoin I can tell you that you can't be sure what the profits would be since bitcoin is not stationary like other commodities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "October 27, 2023, 09:13:31 PM",
      "body": "Quote from: Adbitco on October 27, 2023, 06:34:03 PMDoes one really need all this?Some investors are too meticulous about their investment, they wanted to track the progress every now and then but I do not think we really need to put it and calculate it on a spreadsheet when we have free online services that can track how our portfolio grow.  Just like the link sent by the earlier reply.Quote from: Adbitco on October 27, 2023, 06:34:03 PMI think anyone who really wants to invest won't think much about their profits as the market isn't that regular or directional to what you expect, let say using the current price of bitcoin as you said may not be the ending results by next year it may go lower or even more higher but when you solely rely on the profits aspect you became more worried with your position in profits. So the best is just have a trusted wallet whereby you can buy and send directly to that wallet then you can decide to unveiled it in 2 year and above by then there are few things possible either bitcoin will gained about 2x ATH or repeat the previous which I know may or may not happen since the market are of speculatively.I think otherwise, investors always think of their possible profit.  This is the reason why they invest in the first place.  They even formulate and calculate their point of entry and exit. Quote from: Adbitco on October 27, 2023, 08:54:40 PMI don't actually mean you won't do some pricing while doing your investment but my dear in terms of bitcoin investment it would be very hard to determine your outcome why because you can never predict what the price may come out, instead you can take profit whenever you meet the price at the top or a place were you think your profit is enough for you and like I said before. You can predict a profit of other business like a set of television or a carton of green tea, and you can easily calculate that after selling you will make 500$ after you removed the capital from the investment in this type of investment we can easily calculate total amount to come in months or years. But talking of bitcoin I can tell you that you can't be sure what the profits would be since bitcoin is not stationary like other commodities.This is the reason why investors set a selling price and possible stop loss prices in order to minimize losses if the market does not meet their expectation.  Anything in the market is unpredictable when the future is discussed. Great effort at OP but this is too hard for people who are new to google sheet/excel.  They would rather look for a calculator on the internet than do the calculation and plotting manually.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "October 27, 2023, 09:29:01 PM",
      "body": "Quote from: BitcoinPanther on October 27, 2023, 09:13:31 PMQuote from: Adbitco on October 27, 2023, 06:34:03 PMDoes one really need all this?Some investors are too meticulous about their investment, they wanted to track the progress every now and then but I do not think we really need to put it and calculate it on a spreadsheet when we have free online services that can track how our portfolio grow.  Just like the link sent by the earlier reply.Quote from: Adbitco on October 27, 2023, 06:34:03 PMI think anyone who really wants to invest won't think much about their profits as the market isn't that regular or directional to what you expect, let say using the current price of bitcoin as you said may not be the ending results by next year it may go lower or even more higher but when you solely rely on the profits aspect you became more worried with your position in profits. So the best is just have a trusted wallet whereby you can buy and send directly to that wallet then you can decide to unveiled it in 2 year and above by then there are few things possible either bitcoin will gained about 2x ATH or repeat the previous which I know may or may not happen since the market are of speculatively.I think otherwise, investors always think of their possible profit.  This is the reason why they invest in the first place.  They even formulate and calculate their point of entry and exit. Quote from: Adbitco on October 27, 2023, 08:54:40 PMI don't actually mean you won't do some pricing while doing your investment but my dear in terms of bitcoin investment it would be very hard to determine your outcome why because you can never predict what the price may come out, instead you can take profit whenever you meet the price at the top or a place were you think your profit is enough for you and like I said before. You can predict a profit of other business like a set of television or a carton of green tea, and you can easily calculate that after selling you will make 500$ after you removed the capital from the investment in this type of investment we can easily calculate total amount to come in months or years. But talking of bitcoin I can tell you that you can't be sure what the profits would be since bitcoin is not stationary like other commodities.This is the reason why investors set a selling price and possible stop loss prices in order to minimize losses if the market does not meet their expectation.  Anything in the market is unpredictable when the future is discussed. Great effort at OP but this is too hard for people who are new to google sheet/excel.  They would rather look for a calculator on the internet than do the calculation and plotting manually.Meaning this will be very much better for traders instead if investors who wants to invest, lemme say when bitcoin price was around 25k did you in any means knows or thought about the market possibly hit 35k no but then if you made investment you would be praying for the price to just crossed above 26 to 30k so you would take profit, so setting a sheet for calculating the profit might not be that necessary while we have cmc that reflects the price all time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "October 27, 2023, 09:54:30 PM",
      "body": "Quote from: Adbitco on October 27, 2023, 09:29:01 PMMeaning this will be very much better for traders instead if investors who wants to invest, lemme say when bitcoin price was around 25k did you in any means knows or thought about the market possibly hit 35k no but then if you made investment you would be praying for the price to just crossed above 26 to 30k so you would take profit, I think both investors and traders need to track their investment especially when investors happen to have many investment ventures in hand.  I understand what you are trying to say, it is applicable if an investor have only a few investment but if one has 10+ investment, they really need to track the price of their investment in order to act immediately if something goes wrong on one of their investment/holdings.Quoteso setting a sheet for calculating the profit might not be that necessary while we have cmc that reflects the price all time.I agree as long as the CMC site is up but it won't hurt to have a backup of the data just in case something unexpected happens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "October 27, 2023, 10:34:25 PM",
      "body": "As a long term Bitcoin investor, who is looking to be holding the Bitcoin for a long term may see this sheet as unnecessary this is so because, at some point, you have to agree with the fact that, such a sheet is most suitable for altcoins holders who may be holding multiple assets that the need to frace their individual price movement and if that be the case it means there be a lot of advantages having the spreadsheet in place.This will help to keep track of the investment movement and how much profits or losses you have incurred on a short-term basis, and most importantly to discover which of the coins in the portfolio os just dormant coins and just occupying space for nothing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "October 27, 2023, 11:00:15 PM",
      "body": "This is a good format for those who have the time to create and update their spreadsheet on a daily basis, something many of us do not have, but many of us are okay with Coingecko and Coimarket portfolio trackers and many other portfolio trackers, It is probably the easiest and you can organize it in a way that you can easily track each and every coins/tokens you have in your portfolio because it is updated on the current price and how much profit or losses you incur.https://support.coingecko.com/hc/en-us/articles/4538042336537-How-can-I-add-a-new-portfolio- Even if you invested in hundreds of tokens or coins it will take you a minute or two to see if you're making a profit and you can create or divide your portfolio based on their niche, like you can create a portfolio on memes and so on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ScoobyDu",
      "created_time": "October 28, 2023, 12:44:50 PM",
      "body": "I like the way you make a  google spreadsheet.  It makes the process easier to understand and assists you in visualizing the potential returns on your investment based on the numbers that are foretasted. it can certainly simplify the process for new users who are investing in Bitcoin. I make my sheet by following the instruction, and it turns out correctly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "October 28, 2023, 01:00:55 PM",
      "body": "Quote from: snowpega on October 27, 2023, 12:29:41 PMI create this sheet for my those mates/members who do work on google spreadsheet on their daily basis. It may help you guys to calculate your portfolio easily according to your future Goals. You guys Just need to put number and you will see results.Let's first assumed that not everyone understands the way to use the spreadsheet, not to talk of operating the computer, secondly let's also talk about the privacy of our bitcoin when we made all the information about the bitcoin portfolio we hold open to our system, are we the only one having access to that computer or not, lastly everything we need to know about the transaction history were being archived on the wallet we use, which we can. Also track from there in knowing the current market status",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "snowpega",
      "created_time": "October 30, 2023, 12:42:18 PM",
      "body": "Quote from: Faisal2202 on October 27, 2023, 02:25:51 PMYou can even, insert the transaction fee and tax rate and the above two calculators even show the profit that you make on your investment like in your example, you wrote $500 and the total profit is $1506 but the real profit is $1006 so, it would be nice if you will add another column representing the profit only. Great work BTW.Yes, buddy you really mentioned good thing here like the profit section should be separate and ok can you lemme know what is the transaction fee or tax fee held over each transaction i would like to add them for making it more usable for you. Many Thanks Quote from: BitcoinPanther on October 27, 2023, 09:13:31 PMGreat effort at OP but this is too hard for people who are new to google sheet/excel.  They would rather look for a calculator on the internet than do the calculation and plotting manually.Thanks Dear For appreciation, i will share the link of sheet here but i'm working to add some more Feature in the sheet so that you guys can have more advantage of it. Pleasure!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "October 30, 2023, 04:39:04 PM",
      "body": "Quote from: snowpega on October 27, 2023, 12:29:41 PM<...>As some people have already commented, any useful custom solution will really need to take into account multiple purchases made at different times with different bitcoin prices, let alone other aspects such as managing different coins/tokens, sales, fees, taxes and so forth. Back in the day, I used to keep track of all these things on Excel, where rows in one sheet can represent the relevant TX data (type of tx, date, price, amount, etc.), which can then be rolled-up to aggregate data per coin on a different tab (balance, aggregate cost, realized gross benefit, current unrealized value, etc.). In addition, I found it interesting at the time to import market data using an API such as this one (*), in order to track portfolio value from Excel (this can all be done with Google Sheets too).Note: Just to reiterate, the profit on the image shown in the OP is incorrect, as already been established, lacking having deducted the base investment value.(*) Make sure you use at least a unique email for this (just in case  past events reiterate in some fashion). A VPN would not go amiss either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}