{
  "id": "topic_5468772",
  "title": "Question:",
  "author": "tokeweed",
  "created_time": "October 01, 2023, 01:06:36 PMLast edit: November 02, 2023, 01:18:10 PM by tokeweed",
  "content": "There's nothing much to say except that BTC really was due for a green candle for September.    It wasn't really a huge candle, just a tad below 4% but prolly be good enough to start something that could gain momentum for October.  Hence the the poll...  Adding a 30k option to the upside.    I mean who knows...Anyway, here's the monthly chart.  Looking decent, looking like a higher low...  Dunno.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468772",
  "comments": [
    {
      "author": "Don Pedro Dinero",
      "created_time": "October 01, 2023, 01:21:59 PM",
      "body": "I am going to be optimistic and say that the price will break $30,000 and stay above it for the month. That's how I voted. October has been a traditionally good month for the price, although that is no guarantee of anything. But if we take into account that we are getting closer and closer to halving and that the worst of the macro-economy, such as the rise in interest rates, is already discounted, I believe that the price will go up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "October 01, 2023, 01:28:39 PM",
      "body": "We've had enough red this past year that it is time for seeing some green candles now. Although we don't yet have the momentum but the potential is still there. Not to mention that every day when the market manipulators fail to push the price down despite their dumps, is a day where the buy support gets stronger",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AprilioMP",
      "created_time": "October 01, 2023, 07:07:56 PM",
      "body": "October still requires extra energy like the previous month to hold because it is still not the right action to sell at this time and is still the right time to buy like the many advice circulating on the homepage.The desire to see high prices in October is still not certain to be fully realized according to the estimates of many speculators.But I support the hopes of many bitcoin holders to see a green candle this month so as to break the evil strategy played by market manipulators.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Orpichukwu",
      "created_time": "October 01, 2023, 08:12:24 PM",
      "body": "October looks like a promising month for bitcoin to skyrocket to me; it's the tenth month of the year, and there is every possibility that bitcoin can start its bull run or at least do a little price increase in preparation for the bull run ahead, as I believe that the price will do above 29k before the second week of the month, and the year might end up closing with 30k, so this month of October is the best time to start steaming the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JoyMarsha",
      "created_time": "October 01, 2023, 08:28:35 PM",
      "body": "Every year, the month of October seems to be a \"green candle\" month for bitcoin, with skyrocketing prices. Calculating the rise in bitcoin's price from 2013 through 2022 reveals that October has historically seen a significant price increases. So, October this year won't be an exception to that known fact of price increase of bitcoinQuote from: usmanghani010 on September 29, 2023, 06:11:56 AM Bitcoin October Month Performance🟢2013 → 60.79%🟢2015 → 33.49%🟢2016 → 14.71%🟢2017 → 47.81%🟢2019 → 10.17%🟢2020 → 27.7%🟢2021 → 39.93%🟢2022 → 5.56%⚪2023 → ?? %Before the month is over, I'm hoping that the price of bitcoin will surpass $30,000.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "October 01, 2023, 08:51:36 PM",
      "body": "Quote from: tokeweed on October 01, 2023, 01:06:36 PMI was looking at the chart to deduce what could actually happen  in this month of October, but I was surprised when I actually noticed that bull run may not happen 2014. It could be delayed to 2025. If you look at the chart from 2021, you will notice that the M shape is fully formed and  we know that bull doesn't really happen immediately after the second leg of the M. It seems that consolidation will happen for as long as half bear market happened before the bull run will take off. This might delay bull run to 2025.Quote from: JoyMarsha on October 01, 2023, 08:28:35 PMEvery year, the month of October seems to be a \"green candle\" month for bitcoin, with skyrocketing prices. Calculating the rise in bitcoin's price from 2013 through 2022 reveals that October has historically seen a significant price increases. So, October this year won't be an exception to that known fact of price increase of bitcoinQuote from: usmanghani010 on September 29, 2023, 06:11:56 AM Bitcoin October Month Performance🟢2013 → 60.79%🟢2015 → 33.49%🟢2016 → 14.71%🟢2017 → 47.81%🟢2019 → 10.17%🟢2020 → 27.7%🟢2021 → 39.93%🟢2022 → 5.56%⚪2023 → ?? %Before the month is over, I'm hoping that the price of bitcoin will surpass $30,000.Still following, 2022 had the lowest rise. So, with the current price of bitcoin, with a 5% rise take it to 30k? The current price is 27,105 and 5% of it is about +1355 which will not the price above 29k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sophokles",
      "created_time": "October 01, 2023, 09:17:56 PM",
      "body": "Quote from: pooya87 on October 01, 2023, 01:28:39 PMWe've had enough red this past year that it is time for seeing some green candles now. Although we don't yet have the momentum but the potential is still there. Not to mention that every day when the market manipulators fail to push the price down despite their dumps, is a day where the buy support gets stronger For the first time after 7 years september was green for bitcoin. October is usually more on the positive side while november and december can show some negativity. If there isn't any more fud with binance this year we can see a consistent green till the end of the year. BTC dominance went down a little bit today but now it has come back to its previous level again. If it goes above 52 then breaking the 30k level is kind of easy for bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Unbunplease",
      "created_time": "October 01, 2023, 09:41:32 PM",
      "body": "If you study the statistics, October is usually a good month for bitcoin. Therefore, we can expect bitcoin to be able to at least reach the $30,000 mark during the month. But it may well fail to gain a foothold and go back to 25,000-27,000. The speculators' games continue",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "October 02, 2023, 06:17:24 AM",
      "body": "I vote for \"Break out above 28k and stay there\". Which seems like the most likely scenario to me. I think that we are not at a stage where we will have the strength to make more than 10% in one month, because it would be one of the better Octobers. And this could be expected at a different stage of the cycle, because currently, in my opinion, we are in \"disbelief\" and not in \"thrill\" or \"euphoria\"Quote from: KingsDen on October 01, 2023, 08:51:36 PMQuote🟢2013 → 60.79%🟢2015 → 33.49%🟢2016 → 14.71%🟢2017 → 47.81%🟢2019 → 10.17%🟢2020 → 27.7%🟢2021 → 39.93%🟢2022 → 5.56%⚪2023 → ?? %Still following, 2022 had the lowest rise. So, with the current price of bitcoin, with a 5% rise take it to 30k? The current price is 27,105 and 5% of it is about +1355 which will not the price above 29k.There are few years missing  Like 2011 with -35% return. 2014 with -12% or 2018 with -4%",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "armanda90",
      "created_time": "October 02, 2023, 06:49:24 AM",
      "body": "September is red and October will be green, optimistic with Bitcoin price this month will raise to higher price and my voted \"Break out above 30k and stay there\" for bitcoin price. Second days of October, Bitcoin success make good progress with few percent up from $26k until current price today reached to $28k above and looks have promising for this month Bitcoin back above $30k. Optimistic with usually habit bitcoin every month on October make benefit for bitcoin have positive news and make price up drastically. Lest forward first week of October will get correction or Bitcoin can defend on stable price above $28k, if drop under $27k seems not chance to see green market on October will be the same on September bitcoin have been dropped.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xcode7",
      "created_time": "October 02, 2023, 08:27:37 AM",
      "body": "Quote from: armanda90 on October 02, 2023, 06:49:24 AMSeptember is red and October will be green, optimistic with Bitcoin price this month will raise to higher price and my voted \"Break out above 30k and stay there\" for bitcoin price. Second days of October, Bitcoin success make good progress with few percent up from $26k until current price today reached to $28k above and looks have promising for this month Bitcoin back above $30k. Optimistic with usually habit bitcoin every month on October make benefit for bitcoin have positive news and make price up drastically. Lest forward first week of October will get correction or Bitcoin can defend on stable price above $28k, if drop under $27k seems not chance to see green market on October will be the same on September bitcoin have been dropped.That is quite possible and after seeing the significant Bitcoin price movement at the beginning of October, I am even more convinced that in October we will again see a price of $30k.That's a pretty realistic target after looking at what happened in the past and the current Bitcoin price development, and if there is no negative global news then I'm pretty confident of seeing $30k again in the near future, even in the last 2 days it increased Bitcoin is doing pretty well, it will continue to do so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Texac",
      "created_time": "October 02, 2023, 09:17:56 AM",
      "body": "Quote from: Xcode7 on October 02, 2023, 08:27:37 AMQuote from: armanda90 on October 02, 2023, 06:49:24 AMSeptember is red and October will be green, optimistic with Bitcoin price this month will raise to higher price and my voted \"Break out above 30k and stay there\" for bitcoin price. Second days of October, Bitcoin success make good progress with few percent up from $26k until current price today reached to $28k above and looks have promising for this month Bitcoin back above $30k. Optimistic with usually habit bitcoin every month on October make benefit for bitcoin have positive news and make price up drastically. Lest forward first week of October will get correction or Bitcoin can defend on stable price above $28k, if drop under $27k seems not chance to see green market on October will be the same on September bitcoin have been dropped.That is quite possible and after seeing the significant Bitcoin price movement at the beginning of October, I am even more convinced that in October we will again see a price of $30k.That's a pretty realistic target after looking at what happened in the past and the current Bitcoin price development, and if there is no negative global news then I'm pretty confident of seeing $30k again in the near future, even in the last 2 days it increased Bitcoin is doing pretty well, it will continue to do so.I also picked bitcoin to exceed $30k, but I think there will be a few corrections between now and the halving.  I mean bitcoin will reach 30k$ but it can't stay there, there will be a correction back to the 25k price range or even lower.  October and November are usually positive months for the market but there is no guarantee that everything will go according to script because we are still affected by the world economic situation.  so optimism is still something we should continue to maintain, but don't be too subjective, anything can happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "October 02, 2023, 10:43:15 AM",
      "body": "Historically, I am optimistic about the last three months of the year, starting in October, but I reserve the greatest optimism for December. As for October, I expect that we will exceed 28K to touch 30K, but we will not exceed it.I do not think that the price of Bitcoin will rise above 30K by much. Most likely, we will remain throughout the month in a sideways area between 28 and 30K. This is my prediction based on current market data.Of course, I hope, like many Bitcoin fans, that Bitcoin will surprise us as it has done several times in the past and exceed all these expectations and analyses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "October 02, 2023, 02:46:47 PM",
      "body": "Just as previously discussed already in some of the speculation threads on October bitcoin price and sentiment, this months has been made declared a month for pump in market price, we have been on thesame spot of dip for a while and the more we keep going dip as well despite that there have always been every attempts to see the market break the limit of $26,000 or below ever since, the recent move we had which takes us up to $27,000 still eventually falls down back as the resistance was too high until we are here at it again but on a gradual approach, i see the market getting upto $30,000 before the month ends base on other indications seen with the current trend in the bitcoin market, you can DYOR.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "October 02, 2023, 06:14:33 PM",
      "body": "The chart shows that the last month ended with the buy beginning to start and that is significant to the expectation for this last quarter of the year to end in bull. October is usually good for btc and with the speculation for continuation from the steady waves of September, we are suddenly going to see the bull towards the second and third week. However, we were suppose to see more hands buying in for December short sell but with halving around the corner maybe that will turn into more DCA for halving bull. So everything should work good for btc price from this month.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "October 02, 2023, 06:44:10 PM",
      "body": "Just like last month it looks like people are FOMOing at this month as well and I feel like they are going to be right this time around. I know that it is not all that easy and we could end up with a bigger return eventually but we need to end up with something that should be a bit more calmer and not 30k. I am sensing that above 28k and stay there seems a bit more logical to me, because 30k looks little bit too much right now.We are already above 28k which is awesome and it looks like October will be a green month already and when you are this good just early few days of the month that gives you a better chance. I think staying around here would be good enough, if we can go to 30k+ and stay there that would be lovely and I would be very very happy, but I would stay happy as long as it stays above 28k as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beerwizzard",
      "created_time": "October 02, 2023, 09:45:00 PM",
      "body": "It really feels like right now we may gather liquidity somewhere close to 29k and then get another correction. Due to FOMO many people tried to short which already gave a boost to get on where we are now. We will probably go higher due to positive sentiment, but there is no serious changes that may trigger a serious bull market and correction may happen sooner than you may expect.I don't expect BTC will go high but hopefully, it will give some fuel for alts as some of them have over 300d of accumulation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "October 02, 2023, 11:59:16 PM",
      "body": "I voted for this option \"Break out above 28k and stay there\".It seems the Bitcoin price this month will remain in the range based on my prediction ($27k - $28k).  I didn't see any events that boosted the price.  But who knows, we are all wrong with this prediction.But IF I'm wrong with this, for sure it might be at the $30k range for sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "October 03, 2023, 12:14:01 AM",
      "body": "After Bitcoin rose by a good percentage at the beginning of October and the presence of optimistic historical data this month, we can say that at least we will test $30,000 and $31,704 twice, and this optimism is accompanied by some technical analysis indicators such as the Relative Strength Index (RSI) to 70 level. The problem lies if its price breaks these levels, it may invalidate the bullish candle, especially if we continue to close below 26,700 for several days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}