{
  "id": "topic_5481690",
  "title": "RocketSingh",
  "author": "RocketSingh",
  "created_time": "January 15, 2024, 08:09:25 PM",
  "content": "If not, then is there any reliable non-KYC Virtual Credit Card service that accepts Crypto? In that case, I may convert BTC to the accepted Crypto and pay for AWS through it.Please note that, I am looking for non-KYC processes only. KYC processes are already known to me. Location is outside USA and I need the card only to use AWS Lambda for free as of yet. Paid instances might come later when I want the flexibility to pay with Crypto.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5481690",
  "comments": [
    {
      "author": "RickDeckard",
      "created_time": "January 15, 2024, 10:39:39 PM",
      "body": "I believe that directly paying AWS with Bitcoin isn't possible as of know[1]. Considering that you are outside the US I found this service that offers a worldwide prepaid mastercard that could work - you buy it with BTC and then use the card to pay for your service. From the reviews that I found in a quick search the service seems legit but I can't vouch for it as I have never used it before.[1]https://www.reuters.com/technology/amazon-ceo-says-not-adding-cryptocurrency-payment-option-anytime-soon-cnbc-2022-04-14/[2]https://www.coinsbee.com/en/My%2BPrepaid%2BCenter%2BMastercard-bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "January 16, 2024, 03:05:56 AM",
      "body": "Quote from: RocketSingh on January 15, 2024, 08:09:25 PMIf not, then is there any reliable non-KYC Virtual Credit Card service that accepts Crypto? In that case, I may convert BTC to the accepted Crypto and pay for AWS through it.No. This option is yet to be available. QuotePlease note that, I am looking for non-KYC processes only. KYC processes are already known to me. I doubt if you will find a non-KYC process for this. AFIK, this is what I found on their webpage regarding clearly stated on their acceptable payment methods for locations out side of the United States. I don't know your location but it includes places like Korea, India, Malasyia, Brasil, South-Africa, New Zealand, Canada, Australia, Japan, Brasil. - What payment methods does AWS accept?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "windsplazz",
      "created_time": "January 16, 2024, 03:21:52 AM",
      "body": "Unfortunately, aws does not currently use this type of payment, although I do not think that this type of payment will be possible in the future. if you need to use their vps look for services that accept BTC as a payment method, i use aeza myself, and there is many other services that offer bitcoin as a payment method",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "January 16, 2024, 04:44:35 AM",
      "body": "Op what you are looking for is hard to see but you can check these if they can suit your desire. https://cointelegraph.com/press-releases/bitstore-introduces-kyc-free-virtual-cards-and-unveils-websites-new-look and https://satoshifire.com/virtual-credit-card-bitcoin and if what you are looking for can't be easily getting then you can use another means to get your things done. Because to see a company that is accepting cryptocurrency in their payment and yet there is no KYC. Even AWS which I was trying to check online does not... Therefore you can still go back your former payment method.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "January 16, 2024, 08:30:59 AM",
      "body": "Must it be AWS? If yes then the answer to your question is NO, I do online shopping a lot, and I have use crypto as means of payment many times but not AWS, I have watched myself converting my Bitcoin back into Dollar and move the money into a virtual credit card to make online payments, I do wish that popular online stores can accept Bitcoin direct. Even with the high transaction fee I still found crypto payment as easy option to buy stuffs online, the last time I use Bitcoin direct for purchase was in 2023 on a Hardware wallet official website, it went so easily, and the transaction was confirmed. Even with this ETFs approval, I doubt that many stores will start accepting crypto, it's a matter of choices though, only if they feel like or maybe many customers start asking for this payment option? This could make it faster for implementation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "January 16, 2024, 10:13:32 AM",
      "body": "Quote from: RocketSingh on January 15, 2024, 08:09:25 PMIf not, then is there any reliable non-KYC Virtual Credit Card service that accepts Crypto?With very strict terms set by VISA and MasterCard, non-KYC virtual credit/debit card almost non-existent. Excluding prepaid card, most of those usually become scam or eventually require their customer to perform some form of identity verification. It's also worth Amazon may reject those card.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "January 16, 2024, 01:04:18 PM",
      "body": "Quote from: RocketSingh on January 15, 2024, 08:09:25 PMIf not, then is there any reliable non-KYC Virtual Credit Card service that accepts Crypto? In that case, I may convert BTC to the accepted Crypto and pay for AWS through it.If you find such a non-KYC Virtual Credit Card, it will have very high fees, and there is a high possibility that it will be rejected or suspended within the next 6 months. Therefore, the risks are very high, and you may find that some of these cards are stolen, which will lead you to legal problems.If you can do KYC, you will find some options, otherwise you are forced to convert Bitcoin into cash.anyway @The Cryptovator has a good experience with ---> RedotPay Crypto Virtual Card you can ask him about the service.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JustineCollins09",
      "created_time": "January 16, 2024, 01:09:21 PM",
      "body": "Rather you can buy aws accounts from someone with any mode of payment",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "January 16, 2024, 07:27:13 PM",
      "body": "Quote from: RocketSingh on January 15, 2024, 08:09:25 PMIf not, then is there any reliable non-KYC Virtual Credit Card service that accepts Crypto? In that case, I may convert BTC to the accepted Crypto and pay for AWS through it.I think there are gift cards that work for AWS, but availability of this cards is always changing so you need to check them yourself.There are several website like this I know but bitrefill.com and thebitcoincompany.com are two biggest one, but remember to check the country supported by specific gift card.Some non-kyc virtual cards may also work in AWS but there are no guarantees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RickDeckard",
      "created_time": "January 16, 2024, 07:28:44 PM",
      "body": "Quote from: hugeblack on January 16, 2024, 01:04:18 PMQuote from: RocketSingh on January 15, 2024, 08:09:25 PMIf not, then is there any reliable non-KYC Virtual Credit Card service that accepts Crypto? In that case, I may convert BTC to the accepted Crypto and pay for AWS through it.If you find such a non-KYC Virtual Credit Card, it will have very high fees, and there is a high possibility that it will be rejected or suspended within the next 6 months. Therefore, the risks are very high, and you may find that some of these cards are stolen, which will lead you to legal problems.If you can do KYC, you will find some options, otherwise you are forced to convert Bitcoin into cash.anyway @The Cryptovator has a good experience with ---> RedotPay Crypto Virtual Card you can ask him about the service.While this is a good suggestion, OP seems to want a method that is non-KYC. According to RedotPay user guides the procedure to obtain a card involves KYC procedures[1] and this is also mentioned in their terms & conditions[2].OP: If changing provider is an option for you and paying crypto is a must, perhaps switching to a service that resells servers and accepts cryptocurrencies such as Bithost[3]? Or even Servers.Guru[4]?[1]https://support.redotpay.com/hc/en-us/articles/8169796079887-KYC-verification[2]https://www.redotpay.com/en/terms/[3]https://bithost.io/[4]https://servers.guru/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "January 17, 2024, 07:06:29 AM",
      "body": "Quote from: RocketSingh on January 15, 2024, 08:09:25 PMIf not, then is there any reliable non-KYC Virtual Credit Card service that accepts Crypto? In that case, I may convert BTC to the accepted Crypto and pay for AWS through it.Please note that, I am looking for non-KYC processes only. KYC processes are already known to me. Location is outside USA and I need the card only to use AWS Lambda for free as of yet. Paid instances might come later when I want the flexibility to pay with Crypto.Can't you just convert the crypto to fiat money in your bank account and use a normal credit/debit card? Do you have a bank account?Some prepaid cards work with AWS, while others don't work. I used a Paywithmoon VCC with AWS years ago and it worked, but Paywithmoon isn't active anymore. Finding a working non-KYC crypto virtual card is a pain in the ass and I've given up on searching for one.I remember that there were AWS account sellers in many forums. Some people are selling AWS credits, but I guess that you just want the AWS free tier and don't want to pay for AWS credits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "January 17, 2024, 08:59:23 AM",
      "body": "No, you can't.You can't use a prepaid card either.Also if you use some crypto debit card and open a ticket, they might close your account until you provide \"bank statement verification\" which AFAIK isn't possible most of the times.Quote from: JustineCollins09 on January 16, 2024, 01:09:21 PMRather you can buy aws accounts from someone with any mode of paymentWhat good is an AWS account without account credit? (which AFAIK is not implemented in AWS)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blckhawk",
      "created_time": "January 17, 2024, 09:03:27 AM",
      "body": "The unavailability of this options and having only a fiat middlemen/alternative is why we're still yearning for a bitcoin adoption. AWS is a really useful service and it's still baffles that Amazon hasn't touched upon this payment option yet because this is a thing that should happen already, it's 2024 and I believe it's high time that a lot of companies are still not doing any of this, I'm sure they're going to profit from it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "January 17, 2024, 11:26:24 AM",
      "body": "There is actually a way, but it is indirectly, Amazon has it's own gift card which you can use to shop on the platform, and this gift card is available online in various stores that accept Bitcoin and other crypto coins as means of payment, for example Bitrefill, use the gift card to load up your balance and use that on AWS.There is also AWS credits, I don't know if anyone have heard or use this one before, for those who don't know, it's a promotional coupons offered by Amazon, these credits can be applied to cover costs of eligible AWS services. I sure do know that this could be very helpful for those who are interested in the AWS services. I heard that this could make you have access to the service as a life time offer, using AWS credits instead, what I couldn't find is how to purchase AWS credits, I think this will benefit you more OP, if you are good at doing research you can find answers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "January 17, 2024, 12:00:05 PM",
      "body": "I am not sure from which part of the world you are as you haven't mentioned it. If you have not heard about Bitrefill prepaid card then you should check it for making payments in Bitcoin to AWS. The card is available for your usage instantly and it comes preloaded. However, it is not available globally as it only works in selected countries. There is an article by them on how to pay AWS or Hetzner using it. Here is the link to that article - Pay on AWS or Hetzner with Bitcoin, ETH, USDT or Crypto",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitcoin talk",
      "created_time": "February 11, 2024, 07:53:33 AM",
      "body": "Quote from: KiaKia on January 16, 2024, 08:30:59 AM... I do online shopping a lot, and I have use crypto as means of payment many times ... Which virtual cards your recommend for major sites not AWS but general stuff?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "February 11, 2024, 07:58:23 AM",
      "body": "Not really but if there's any service that allows you to topup a card (Virtual) with Crypto, I am sure you can use that on AWS. AWS mostly supports all the cards and that will be the most optimal way to spend on AWS without using your actual cash/credit. Other than that, you can also try asking one of your friend to do it for you if that's possible. I mean most of the people in tech are using crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "February 11, 2024, 08:59:56 PM",
      "body": "I don’t know how it is now but I remember 5 years ago they were very strict.Even if you used your actual credit card using your real name and address they limited some services at first because there was lots of scams and chargebacks.After a few good weeks and no missed payments they gave you more control and you could rent more servers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "betswift",
      "created_time": "October 31, 2024, 10:22:48 AM",
      "body": "Quote from: felaij on October 31, 2024, 10:19:36 AMAWS doesn’t directly accept Bitcoin or other cryptocurrencies for payment, so you’ll need to use a credit card or another traditional payment method. If you’re looking for non-KYC virtual credit cards that accept crypto, there are some services out there, but it’s essential to be careful and research their reputation, as not all of them are reliable.Nowadays, space is really blooming with different schemes that people use to scam you into verifying something, so, yeah, totally agree.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}