{
  "id": "topic_5455039",
  "title": "Newyork777",
  "author": "Newyork777",
  "created_time": "June 04, 2023, 11:47:31 AM",
  "content": "Im trader over 12 years of experince.I like to challenge myself iwill use mainly moving average indicator.My goal is to start with 7$ and in 15 days i'll turn this into 229376$ I'll post here results when i have done this my PNL from binance.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455039",
  "comments": [
    {
      "author": "Ojima-ojo",
      "created_time": "June 04, 2023, 11:53:09 AM",
      "body": "Quote from: Newyork777 on June 04, 2023, 11:47:31 AMIm trader over 12 years of experince.I like to challenge myself iwill use mainly moving average indicator.My goal is to start with 7$ and in 15 days i'll turn this into 229376$ I'll post the here results when I have done my PNL from binance.Turning $7 into 229k+ in 15 days sound weird and unbelievable even though it is possible, but for sure you have to perform some miracle to have this happen in 15 days and that is something to really look out for. Since you said you will update us on your journey to achieving that, we will be waiting to see what reality you can make from the sarcastic statement to prove all of us wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "June 04, 2023, 11:54:04 AM",
      "body": "Quote from: Newyork777 on June 04, 2023, 11:47:31 AMMy goal is to start with 7$ and in 15 days i'll turn this into 229376$You are only wasting your time. You will use high leverage, but your liquidation price would be very close to the extent of getting your trading fund liquidated.Quote from: Newyork777 on June 04, 2023, 11:47:31 AMI'll post here results when i have done this my PNL from binance.Before you open any position, let us know your entry price. And also let us know your closing price after you close the position.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Newyork777",
      "created_time": "June 04, 2023, 11:59:37 AM",
      "body": "Quote from: Ojima-ojo on June 04, 2023, 11:53:09 AMQuote from: Newyork777 on June 04, 2023, 11:47:31 AMIm trader over 12 years of experince.I like to challenge myself iwill use mainly moving average indicator.My goal is to start with 7$ and in 15 days i'll turn this into 229376$ I'll post the here results when I have done my PNL from binance.Turning $7 into 229k+ in 15 days sound weird and unbelievable even though it is possible, but for sure you have to perform some miracle to have this happen in 15 days and that is something to really look out for. Since you said you will update us on your journey to achieving that, we will be waiting to see what reality you can make from the sarcastic statement to prove all of us wrong. The plan: 15 days starting with 7$ Calculation: 7x2x2x2x2x2x2x2x2x2x2x2x2x2x2x2=229376 15 days in one month there will be big swings enough to give me at least 100% ROE.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "June 04, 2023, 12:00:46 PM",
      "body": "Hi! Newbie with 12 years of experience, which means you are involved in trading from around 2011, and that's really surprising that you have known BTC from 2011 and yet you are new to this platform because AFAIK, most of the people involved in early age of BTC are here on this platform because this platform was the main source of all types of Activities related to BTC. Well maybe you have heard about BTC from your friends or from anywhere else. So, that maybe the reason of your new account on this platform.Well, i am quite surprised with your challenge of turing 7$ into 229376$. Because that is YUM-possible (means impossible) with such low capital, plus i think you forget to put a dot after 22 like maybe you want to write it as 22.9376$. Am i right (maybe i took it wrong) no disrespect i am just quite amazed to see your ambitions and experience and yet you are challenging here to complete your challenge of earning 229376$ out of 7$ looks fake well as i said no disrespect i really value your ambition plus i am too eager to watch your pnl analysis which you will share after 15 days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Newyork777",
      "created_time": "June 04, 2023, 12:09:46 PMLast edit: June 04, 2023, 01:28:56 PM by Newyork777",
      "body": "Quote from: Faisal2202 on June 04, 2023, 12:00:46 PMHi! Newbie with 12 years of experience, which means you are involved in trading from around 2011, and that's really surprising that you have known BTC from 2011 and yet you are new to this platform because AFAIK, most of the people involved in early age of BTC are here on this platform because this platform was the main source of all types of Activities related to BTC. Well maybe you have heard about BTC from your friends or from anywhere else. So, that maybe the reason of your new account on this platform.Well, i am quite surprised with your challenge of turing 7$ into 229376$. Because that is YUM-possible (means impossible) with such low capital, plus i think you forget to put a dot after 22 like maybe you want to write it as 22.9376$. Am i right (maybe i took it wrong) no disrespect i am just quite amazed to see your ambitions and experience and yet you are challenging here to complete your challenge of earning 229376$ out of 7$ looks fake well as i said no disrespect i really value your ambition plus i am too eager to watch your pnl analysis which you will share after 15 days. There was no reason 4 me to use bitcointalk b4.I just discovered what a nice board existing online  but i been in trading and Investment long long time.I will post here the day soon when i START and after 15 days from the start i'll post my PNL.OFF COURSE I might fail in this but i want to see If i get close to my target goal at least 229376I been doing trading long enough so i want to push my limits to try something difficult so i can Challenge myself. FROM TODAY we start counting 15 days*I start today exacly 7$ margin ammount i short JOE with 20x leverage now sl 0.4655$ Im expecting 100%+ ROE. My tp 0.4240$",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "safar1980",
      "created_time": "June 04, 2023, 12:25:36 PM",
      "body": "Quote from: Newyork777 on June 04, 2023, 11:47:31 AMIm trader over 12 years of experince.I like to challenge myself iwill use mainly moving average indicator.My goal is to start with 7$ and in 15 days i'll turn this into 229376$ I'll post here results when i have done this my PNL from binance.Did you remember to put a comma in your number- 229376 ?I do not believe that you have 12 years of trading, most likely you have a lot of experience of losing at gambling games if you set such goals.I think that with such leverage you will lose your money in the first days, and you will have to try many more times until you understand the stupidity of your idea.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ziskinberg",
      "created_time": "June 04, 2023, 12:49:53 PM",
      "body": "Quote from: Newyork777 on June 04, 2023, 11:47:31 AMIm trader over 12 years of experince.I like to challenge myself iwill use mainly moving average indicator.My goal is to start with 7$ and in 15 days i'll turn this into 229376$ I'll post here results when i have done this my PNL from binance.That sounds unbelievable honestly but gonna wait for the update in the next 15 days. Well, honestly speaking, doubts are really on my mind and I can't really imagine someone can do magic in 15 days with the capital of $7 and multiple to several times. Let us say that you have a long years of trading experience but seems impossible, even reaching $1,000 is too hard. But as I've said, I'd love to wait for your updates and I expect that OP. And to see how serious you are or just making some fun and planned trick to people asking how?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "June 04, 2023, 01:26:59 PM",
      "body": "Quote from: Ziskinberg on June 04, 2023, 12:49:53 PMQuote from: Newyork777 on June 04, 2023, 11:47:31 AMIm trader over 12 years of experince.I like to challenge myself iwill use mainly moving average indicator.My goal is to start with 7$ and in 15 days i'll turn this into 229376$ I'll post here results when i have done this my PNL from binance.That sounds unbelievable honestly but gonna wait for the update in the next 15 days. Well, honestly speaking, doubts are really on my mind and I can't really imagine someone can do magic in 15 days with the capital of $7 and multiple to several times. Let us say that you have a long years of trading experience but seems impossible, even reaching $1,000 is too hard. But as I've said, I'd love to wait for your updates and I expect that OP. And to see how serious you are or just making some fun and planned trick to people asking how?Just like I said earlier, it is not sustainable and high leverage is something too risky to stake your bet on, trading can go sideways and your entry and position may not be achieved, but since you, the ops have opened the position and have posted the count down timer and let see how the next 15 days turn out to be for the ops and if he can prove anything then we will see the final result. Let's keep an eye on this thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "June 04, 2023, 01:40:48 PM",
      "body": "If you're a trader with 12 years of experience, you will not wasting your time to create this kind thread because you will only focus on how to make money through trading. A real trader will put all his time to analyze and then enjoy his life.Even you will back in this forum after the next 15 days and you able to double your money everyday, I wouldn't believe it. It's easy to photoshopped the HTML code, record the screen and you withdraw the money which you have deposited before to looks like a real.I believe you're want to convince people if you're a trader and you will scam them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rby",
      "created_time": "June 04, 2023, 02:06:21 PM",
      "body": "Quote from: Jawhead999 on June 04, 2023, 01:40:48 PMIf you're a trader with 12 years of experience, you will not wasting your time to create this kind thread because you will only focus on how to make money through trading. A real trader will put all his time to analyze and then enjoy his life.If he is able to turn $7k to $229k, what other thing can we call it if not making money?There was no time wasted in creating a two liner posts of course, so Op still have enough time to analyse and trade.Creating this type of post could be somthing that gives Op joy.Quote from: Oshosondy on June 04, 2023, 11:54:04 AMQuote from: Newyork777 on June 04, 2023, 11:47:31 AMMy goal is to start with 7$ and in 15 days i'll turn this into 229376$You are only wasting your time. You will use high leverage, but your liquidation price would be very close to the extent of getting your trading fund liquidated.Why did you forget so fast that he has 12yrs trading experience. He must have a way to handle your fear.Let's just wait for 15days and see his results. Very simple",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "June 04, 2023, 02:14:04 PM",
      "body": "Has no one noticed the similarities between OP and Shortmaster? It seems to me that it is one and the same person who is just trying to sell you the same story in a different way. If someone could make $200k+ in two weeks from $7, trust me they wouldn't be on any forum convincing anyone they can do it. The goal is actually to try, and then in any case show that he succeeded and try to sell his service to some fool who will give him as much money as possible to make millions out of them.  When someone starts his post with \"Im trader over 12 years of experince\" and can't even spell the word \"experience\" correctly, we know what kind of expert he really is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "June 04, 2023, 02:23:54 PM",
      "body": "Thats one heck of a goal with just $7. With 12 years of experience, you could have a chance to achieve it. You wouldn't mind sharing the strategy right?I have not seen anyone yet have done such profit in less than a month. You have got to be the greatest once you can do all these. But yup good luck Newyork777.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "user210822",
      "created_time": "June 04, 2023, 02:40:31 PM",
      "body": "Spelling!!! That explains everything. As soon as he'll be sober back he will laugh at this himself!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "June 04, 2023, 03:01:47 PM",
      "body": "Quote from: Newyork777 on June 04, 2023, 11:47:31 AMIm trader over 12 years of experince.I like to challenge myself iwill use mainly moving average indicator.My goal is to start with 7$ and in 15 days i'll turn this into 229376$ I'll post here results when i have done this my PNL from binance.Oh my trader friend, you should wake up from your dreams and continue living in the reality. It's not a child's play to 2x your money everyday with crypto-trading, and if this was the case then every trader would be a billionaire right now. There are many traders who have been trading since 1990's and yet they can't earn consistent 2x income from trading then someone like you could only dream of doing such a thing. I'm not trying to discourage you but seriously my friend the task is 99.9999% impossible and your name will be written in the Guinness World Records if you successfully accomplish this goal.Quote from: Newyork777 on June 04, 2023, 11:59:37 AMThe plan: 15 days starting with 7$ Calculation: 7x2x2x2x2x2x2x2x2x2x2x2x2x2x2x2=229376 15 days in one month there will be big swings enough to give me at least 100% ROE.Why not to be the richest person in the world by continuing the game for 20 more days? If you can do that for 15 days consistently than why not for 20 more days? I wish you best of luck in achieving the goal, and if you really accomplish the goal then I will consider you the luckiest guy. Because it's almost impossible in my eyes to do something like that in trading, even with shorting it would be truly the hardest thing to achieve.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "June 04, 2023, 03:24:00 PM",
      "body": "Quote from: Newyork777 on June 04, 2023, 12:09:46 PMThere was no reason 4 me to use bitcointalk b4.I just discovered what a nice board existing online  but i been in trading and Investment long long time.This is still not finding a good landing in my head. As far back 12 years age, you don't know this forum and yet you are a trader... Alright then, which exchanges do you trade with then and which do you trade now? Being an experienced trader who makes huge turn over like you want to do again, so what is your prove of work? Your trade history will get more people to believe but now people will hardly believe your 15 days trade journey for now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MFahad",
      "created_time": "June 04, 2023, 04:46:01 PM",
      "body": "Enhancing 7$ to such a higher value seems somewhat difficult but sometimes it happens because it will depends on the situations of market and I think that 7$ and your enhancing value is much more different from each other so let's see what happens. The market is not always friendly and sometimes market disappointed its users very much so if you are saying that you have 12 years of experience so may be you have learned something that you should share with others because such happening is impossible for most of the crypto users and whenever you achieve your this goal then share this news too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "June 04, 2023, 05:26:29 PM",
      "body": "Quote from: Newyork777 on June 04, 2023, 11:47:31 AMIm trader over 12 years of experince.I like to challenge myself iwill use mainly moving average indicator.My goal is to start with 7$ and in 15 days i'll turn this into 229376$ I'll post here results when i have done this my PNL from binance.Why didn’t you choose a round figure as your desired goal? Why this odd number? Moreover turning 7$ to this much bit amount will take a lot of risks and high trades, if you can manage to overcome that, then definitely you can set an example for the others also. I wouldn’t advise anyone to risk this much and trade high with high risks. Nevertheless at the end of the day it’s your money, so yes all the best and do update us with the final outcome.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "steve5946",
      "created_time": "June 04, 2023, 08:23:47 PM",
      "body": "Lmao, who else is waiting for OP to make miracles happen. 229376$ in 15 days? Hmmmm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Botnake",
      "created_time": "June 04, 2023, 08:58:57 PM",
      "body": "Quote from: Ziskinberg on June 04, 2023, 12:49:53 PMQuote from: Newyork777 on June 04, 2023, 11:47:31 AMIm trader over 12 years of experince.I like to challenge myself iwill use mainly moving average indicator.My goal is to start with 7$ and in 15 days i'll turn this into 229376$ I'll post here results when i have done this my PNL from binance.That sounds unbelievable honestly but gonna wait for the update in the next 15 days. Well, honestly speaking, doubts are really on my mind and I can't really imagine someone can do magic in 15 days with the capital of $7 and multiple to several times. Let us say that you have a long years of trading experience but seems impossible, even reaching $1,000 is too hard. But as I've said, I'd love to wait for your updates and I expect that OP. And to see how serious you are or just making some fun and planned trick to people asking how? Sorry to offend you but it seems you’re not a real trader after all. Having that goal needs a complete miracle so that it will be possible within 15 days. While professional traders could hardly do it, and here you are telling us that you’re capable enough to turn it into reality. Wow you must be some kind of exceptional. But let us hear from you after 15 days if you can provide us a good proof.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}