{
  "id": "topic_5432554",
  "title": "dkbit98",
  "author": "dkbit98",
  "created_time": "December 31, 2022, 07:06:12 PM",
  "content": "Everyone likes cool calendars and it's even better when they are connected with Bitcoin.There is one very cool project called Bitcoin Timechain Calendar that is showing real-time data from the Bitcoin timechain with immutable history.You can see bunch of information with Block Height in center, supply and epoch is shown in upper left corner, sats value is in upper right corner, time clock is in lower left corner, and date in lower right corner.Above Block Height you can see average block time, next difficulty adjustment and hashrate.Below Block Height there are four categories of estimates fees with mempool stats and unconfirmed transactions.Great thing about Timechain Calendar is that you adjust settings how you like them, and got back in time since Genesis block, or go in future.All this is packed in one simple tool and I see no reason why this wouldn't be my new daily Bitcoin calendar  in 2023  https://timechaincalendar.com/I am not affiliated with Bitcoin Timechain Calendar in any way.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432554",
  "comments": [
    {
      "author": "WhyFhy",
      "created_time": "December 31, 2022, 10:47:03 PM",
      "body": "This is wicked cool, start making widget's and API's for it!!!Id attempt to help   I did try though!edit got ahead of myself lolQuote I am not affiliated with Bitcoin Timechain Calendar in any way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "January 01, 2023, 10:06:58 AM",
      "body": "This looks like a cool project, but I'm experiencing an issue where I am not able to view any data. I am not sure if the issue is with my device or if the server is experiencing a high load, but all I see are all zeros. No data is being displayed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "January 02, 2023, 04:46:47 PM",
      "body": "Quote from: dkbit98 on December 31, 2022, 07:06:12 PMEveryone likes cool calendars and it's even better when they are connected with Bitcoin.There is one very cool project called Bitcoin Timechain Calendar that is showing real-time data from the Bitcoin timechain with immutable history.You can see bunch of information with Block Height in center, supply and epoch is shown in upper left corner, sats value is in upper right corner, time clock is in lower left corner, and date in lower right corner.Above Block Height you can see average block time, next difficulty adjustment and hashrate.Below Block Height there are four categories of estimates fees with mempool stats and unconfirmed transactions.Great thing about Timechain Calendar is that you adjust settings how you like them, and got back in time since Genesis block, or go in future.All this is packed in one simple tool and I see no reason why this wouldn't be my new daily Bitcoin calendar  in 2023  https://timechaincalendar.com/I am not affiliated with Bitcoin Timechain Calendar in any way.This project is beautiful I would really like to know who the developer is, do you know? How did you find this project? I'd like to know if he's thinking about porting as an Apple watch interface for example, I think such a watch face would be really epic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptounityCUT",
      "created_time": "January 16, 2023, 04:56:09 PM",
      "body": "wow that is great.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "January 17, 2023, 01:43:49 AM",
      "body": "I thought this was a default calendar that can use to look today's date. but it turns out I was wrong, so I don't how if the mining (block) time is not 10 minutes exactly, is the next time changed?just tried and find out when block 777777 happens, it's less than 1 month from now.I can't wait to screenshot it in the next month.Quote from: mendace on January 02, 2023, 04:46:47 PMThis project is beautiful I would really like to know who the developer is, do you know? How did you find this project? I'd like to know if he's thinking about porting as an Apple watch interface for example, I think such a watch face would be really epic.you can look and ask them on twitter: https://mobile.twitter.com/TimechainCaL",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jensen Guttenberg",
      "created_time": "January 17, 2023, 02:29:37 AM",
      "body": "Not only is this calendar visually stunning, but it also serves as a valuable tool for those interested in Bitcoin and its evolving ecosystem. The creators of this project should be commended for their creativity to be honest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "January 17, 2023, 09:42:21 PM",
      "body": "I was wondering if theymos or someone else can implement Bitcoin Timechain Calendar or something similar to bitcointalk forum in some mini version.Maybe this can be done with some script or browser extension but it would be cool to have this on top or page bottom.Ideal position for adding this information would be top right corner, since regular date and time are already located there.This doesn't have to be graphical, regular text would be just fine, but here is my fast rookie example below:I am tagging @TryNinja and @PowerGlove and calling other members if they can come up with some idea for this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "January 18, 2023, 08:55:02 AM",
      "body": "Quote from: dkbit98 on January 17, 2023, 09:42:21 PMI was wondering if theymos or someone else can implement Bitcoin Timechain Calendar or something similar to bitcointalk forum in some mini version.Maybe this can be done with some script or browser extension but it would be cool to have this on top or page bottom.Ideal position for adding this information would be top right corner, since regular date and time are already located there.This doesn't have to be graphical, regular text would be just fine, but here is my fast rookie example below:I just search and find how it possible: https://bitcointalk.org/index.php?topic=5178297.msg52303977#msg52303977 and here : https://bitcointalk.org/index.php?topic=5178297.0Only if timechaincalendar.com sharing the API",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "January 19, 2023, 12:56:47 AM",
      "body": "It's a cool tool to use, however just checking the calendar, noticed how Satoshi was clever to code the mining protocol in a way so they could mine most of the coins under 20 years.😉",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WhyFhy",
      "created_time": "January 21, 2023, 06:06:18 PMLast edit: January 21, 2023, 06:34:31 PM by WhyFhy",
      "body": "Quote from: ETFbitcoin on January 19, 2023, 12:17:05 PM-snipThis seems like commemorative moment. Would be neat to see a bunch of stuff minted/burned or whatever on this block.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "January 23, 2023, 04:41:39 AM",
      "body": "Quote from: Sarah Azhari on January 18, 2023, 08:55:02 AMQuote from: dkbit98 on January 17, 2023, 09:42:21 PMI was wondering if theymos or someone else can implement Bitcoin Timechain Calendar or something similar to bitcointalk forum in some mini version.Maybe this can be done with some script or browser extension but it would be cool to have this on top or page bottom.Ideal position for adding this information would be top right corner, since regular date and time are already located there.This doesn't have to be graphical, regular text would be just fine, but here is my fast rookie example below:I just search and find how it possible: https://bitcointalk.org/index.php?topic=5178297.msg52303977#msg52303977 and here : https://bitcointalk.org/index.php?topic=5178297.0Only if timechaincalendar.com sharing the APIThank you, I wasn't aware of the existence of this Google Chrome extension for the Bitcoin Talk forum, it contains more options for Bitcoin Talk and display the price of Bitcoin and Ethereum.I downloaded it, it's really cool, there are many good options, and the price of Bitcoin and Ethereum is displayed on the top. Very nice.It would also be great, as the OP said, if a member of the forum could develop this plugin or another plugin to display the Bitcoin calendar which I think would be really amazing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "January 23, 2023, 02:17:28 PM",
      "body": "This is an awesome project, i liked a lot the user interface, and the fact that time is measured by each block makes it really easy to navigate. I feel the project needs a little more of SEO because the title of the site is the current block, and is a nice feature to have it that way, but it isn't good for the search engines indexing. It should have the name of the project and then the current block. And another feature that I would like to see in this time machine is the bitcoin forks. That would be nice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}