{
  "id": "topic_5436776",
  "title": "npuath",
  "author": "npuath",
  "created_time": "January 25, 2023, 07:26:10 PM",
  "content": "Newbie question: Some topic subjects are prepended with a word in square brackets.In some cases I can guess the meaning of this, in others I'm clueless. Some words seem to indicate a topic type ([ASK]), others seem more like cathegories ([TELEGRAM]).Is there a description of why, how and when to use this?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436776",
  "comments": [
    {
      "author": "bullrun2024bro",
      "created_time": "January 25, 2023, 08:38:09 PM",
      "body": "Quote from: npuath on January 25, 2023, 07:26:10 PMIs there a description of why, how and when to use this?There is no general rule when to use [...] - at least none that I know of. Most users use a note in the thread description to directly let the reader know what the thread is about. The most frequently used references are probably the following:[DIS] for a discussion thread.[INFO] for an info thread on a specific topic.[UPDATED] for a thread that recently got updated.[ANN] for an announcement thread of a specific project - most commonly used in the altcoin and services section.[BOUNTY] for a bounty thread.[Service/Open/CNFP etc.] for certain service or campaign threads.However, there are no general rules. Just use these as you like, or don't.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "January 25, 2023, 10:09:57 PM",
      "body": "Just like what had mentioned by @bullrun2020bro there's no certain rule for that when creating a thread. But on some boards like Marketplace, Collectibles, Currency Exchange this is encouraged to easily categorized a post. You can see the title thread have this kind of tags aside from the mentioned above.[WTS] = Want to sell[WTB] = Want to buy[WTT] = Want to trade[EDU] = Education?[General] = i dont know, something like a general post[HELP] = self-explanatory[GUIDE] = self-explanatory[AUCTION]  self-explanatory[FREE RAFFLE] = self-explanatory[FOR SALE] = self-explanatory[OPEN], [CLOSED] = self-explanatory, mostly used for campaigns accepting participants, or trades[CFNP] = Close For New Participants[SIGNATURE] = Signature campaign[Merit] = Usually a post giving merit for certain task, accomplishment, etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "January 25, 2023, 10:10:38 PM",
      "body": "There's a guideline on how to write a nice title from 2012 written by theymos- https://bitcointalk.org/index.php?topic=102944.0We are in 2023 and don't know how much effective the guideline is too but it should be the same still now. Anyway, you should use the way you can better present the thread title so that readers can understand what the thread is all about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "npuath",
      "created_time": "January 26, 2023, 01:30:08 AM",
      "body": "Thanks all, got it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}