{
  "id": "topic_5434535",
  "title": "bitcoinore.com",
  "author": "bitcoinore.com",
  "created_time": "January 13, 2023, 01:53:39 AM",
  "content": "As Bitcoin gains traction, it will make sense for us to have a unit between Bitcoin and Sats since it will be much easier to say the Price of something is 10 Naks, VS 0.0001 BTC or 10,000 Sats.Eventually, twenty years from now, everything will be sold in Sats when one BTC equals $10,000,000 USD, but until then, it's an intermediate step.Thoughts?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434535",
  "comments": [
    {
      "author": "BlackBoss_",
      "created_time": "January 13, 2023, 02:07:13 AM",
      "body": "Many units I can not remember and don't use, milliBitcoin, milliSatoshi, Tonal Bitcoin ...Bitcoin unitsMilliSatoshi for Lightning NetworkTonal BitcoinSatoshi conversion to USD rate.https://www.btcsatoshi.com/Have another unit Nak is not necessary. I won't use it and can not remember it like other units. Two units, Bitcoin and satoshi are enough for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "January 13, 2023, 03:30:17 AM",
      "body": "Well, who knows? When the right time comes. For now, it seems we only need the Bitcoin, the millibitcoin or mBTC, and the Sat or Satoshi. And it seems things are running pretty smoothly with these three units, at least for now. There might come a time when a different name will be assigned to 10,000 Sats. It remains a possibility. It could be named Naks, who knows?We have to acknowledge the fact that early on, there was no millisatoshi, and then comes the Lightning Network and it was perfect time for the one hundred billionth of a Bitcoin or one-thousandth of a sat to be called millisatoshi. So, your Naks might come in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "January 13, 2023, 01:15:57 PM",
      "body": "There are already many bitcoin Units.bitcoin, bitcent cBTC, millibit, mBTC, bit μBTC, finney ,sat and millisatoshi ( for the Lightning Network).There is no need to create another one.You can ssee all of them here:https://bitcoindata.science/bitcoin-units-converter.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "January 13, 2023, 02:22:24 PM",
      "body": "You'd have to submit a proposal letter to the bitcoin's manager  Kidding aside, I think you are in the minority here. I mean given how many bitcoin units there is, only 2 or 3 of them is being used on a daily basis. Not to mention that there are still many elderly people who have newly entered the bitcoin space hardly grasp how decimals are divided across many bitcoin units.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "January 13, 2023, 02:44:08 PM",
      "body": "An interesting proposal with a funny name (Nak). I guess when the name for the (Sat) measurement was chosen, (Nak) was one of the options that was rejected. It seems to me that adding one more unit would be superfluous. Traditionally, all currencies use 2 values, for example, the dollar and the penny. Extra units can only confuse people more, especially beginners. So, OP, I expect that your proposal will not get a big response in the bitcoin-community, but anyway, thanks for your initiative and it was curious to know about your idea.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "January 13, 2023, 09:38:12 PM",
      "body": "There is no need for adding one more Bitcoin unit called Nak when we already have a bunch of them, and in my opinion it can only create more confusion with people.Even with units we have now I myself have to check conversion data to verify if amount is exact when I am checking values for sats and mBTC.Maybe in future when Bitcoin value is much larger in fiat terms we could use some better and easier system of units, but until then I think this is enough.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "January 13, 2023, 09:38:47 PM",
      "body": "Nice effort, but I don't think it's necessary, though. Sats are still a thing and adding more units will only confuse people because we will end up having millinaks, meganaks etc  The appearance of stablecoins such as USDT in the crypto-marketplace made the use of sats less popular and less appreciated but in the pre-USDT times, quotation of coin price was done in sats most with the Bitcoin trading pairs",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitcampaign",
      "created_time": "January 13, 2023, 10:28:53 PM",
      "body": "I'm new to the NAK unit because so far I only know a few unit names such as SAT satoshi, this information is quite useful for all beginners, although many may be more familiar with satoshi units because the high price of bitcoin makes people only hold a few satoshi in their wallets they",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "January 13, 2023, 11:19:48 PM",
      "body": "I don't even use Satoshi's. I just say 0.00001 or 0.01343 rather than using any other names like mbtc etc. I find it confusing, especially for new users that might not be familiar with the terms. Saying this to someone that isn't that familiar with Bitcoin, will get you a rather confused reply. If you spell out the denomination, there's little that can go wrong really. It doesn't require any special knowledge or being in the know of what everything is being called these days; obviously if they don't listen, then they could mess up how many zeros etc, but there's ways around that also.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "January 13, 2023, 11:54:06 PM",
      "body": "We already have mBTC as a convenient unit for fractions of Bitcoin that are much larger than satoshi. It's convenient because most of the world (sorry, Americans) are familiar with SI, so people don't have to learn how much 1 mBTC is, everyone knows that \"milli\" stands for 1/1000. I don't see how any other unit in this category could become more popular than mBTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dezoel",
      "created_time": "January 14, 2023, 03:03:41 PM",
      "body": "I do agree that there are too many unit names already and there is really no need to find another name. These names all started with some people using it at first, and other places taking it and using it as well, so if you want NAK to be used then you need to promote it to everywhere, or at least have some big name places to use it as well.However, like I said we do not need it, I agree with others, bitcoin and satoshi is enough for me and I do not feel the need to use anything else, hell do not even use satoshi all that much aside from gambling, so it is clear that it's not going to be a simple thing to convince people using this one at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "January 18, 2023, 08:56:24 AM",
      "body": "The positive point in Bitcoin is that you can adopt this label and apply it in your software, and if people continue to use it, you may find that everyone started using it as a measure to describe a certain part of Bitcoin, but at the protocol level, there is nothing called these units other than Bitcoin.The rest of the divisions less than Sat are all based on locked solutions and thus you need to trust in locking code.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "January 18, 2023, 09:09:15 AM",
      "body": "Quote from: Welsh on January 13, 2023, 11:19:48 PMI find it confusing, especially for new users that might not be familiar with the terms. Saying this to someone that isn't that familiar with Bitcoin, will get you a rather confused reply.When units become confusion, they can be used to scam newbies.We can not say newbies are careless, lack of basic knowledge about Bitcoin units so they are deserved to be scammed. Units are created by people, by Bitcoin community and if we can avoid confusion by don't create too many units, less newbies will be scammed.After Satoshi, Nak units, maybe community will want to have SatNak (SN) unit",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "January 18, 2023, 09:15:17 AM",
      "body": "This makes me laugh lolThere's no any benefit if there's a denomination called as Nakamoto since it's a middle between Bitcoin and Satoshi. Many people are keep discussing to add new denomination that is smaller than Satoshi, because many people believe in the future when Bitcoin price is really high and 1 Satoshi is really expensive, anyone who only have small money can't buy any Satoshi. So some people think it's good to add new denomination like Mili Satoshi or Micro Satoshi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "January 18, 2023, 08:52:49 PM",
      "body": "I like it as an idea it's not bad to have an intermediate unit that facilitates the conversion but why NAK?  I remind you that Sats is an abbreviation of Satoshi so it should be the Nakamotos then abbreviated to NAK.  So I like how the idea should be put to the vote of the community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nullama",
      "created_time": "January 18, 2023, 11:01:36 PM",
      "body": "Quote from: bitcoinore.com on January 13, 2023, 01:53:39 AM~snip~As Bitcoin gains traction, it will make sense for us to have a unit between Bitcoin and Sats since it will be much easier to say the Price of something is 10 Naks, VS 0.0001 BTC or 10,000 Sats.Eventually, twenty years from now, everything will be sold in Sats when one BTC equals $10,000,000 USD, but until then, it's an intermediate step.Thoughts?If something is 10,000 sats you can say it's 10k sats.No need to add another name, we have the Metric PrefixSince Bitcoin has 8 decimal places, having BTC and sats work great. First 4 decimals have value?, use BTC:0.1234XXXX would be about 0.1234 BTCLast 4 decimals have value?, use sats:0.00001234 would be 1234 sats, or about 1.2k sats",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "January 18, 2023, 11:10:02 PM",
      "body": "I'll get confuse with all of these milli units for smaller amounts or in decimal amounts of bitcoin. I'm used to tell like 0.001 bitcoin and rarely use satoshis for the smaller units but I've known that when I've started to accumulate for which I've seen in the faucets.But anyway proposal is welcome as it's for the contribution of what we think is good and easier conversion units.I think that if it's acceptable in the community and many sees that it's easier to say Nak/s then it'll be popular. Otherwise, everyone will stick to just sats or simply tell decimal amout + \"bitcoin\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "January 18, 2023, 11:20:07 PM",
      "body": "Quote from: jossiel on January 18, 2023, 11:10:02 PMI'll get confuse with all of these milli units for smaller amounts or in decimal amounts of bitcoin. I'm used to tell like 0.001 bitcoin and rarely use satoshis for the smaller units but I've known that when I've started to accumulate for which I've seen in the faucets.But anyway proposal is welcome as it's for the contribution of what we think is good and easier conversion units.I think that if it's acceptable in the community and many sees that it's easier to say Nak/s then it'll be popular. Otherwise, everyone will stick to just sats or simply tell decimal amout + \"bitcoin\".People are getting confused with these Bitcoin terms on sub-units, adding more terms to the table will more likely add more confusion.  I also don't think that there is a need to introduce new terms in the Bitcoin unit system, I believe it is already covered and there is no more need for an additional Bitcoin unit name.  As I said adding additional terms will more likely cause confusion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "January 19, 2023, 01:20:58 AM",
      "body": "Yeah, it will make things complicated for us, I mean for beginners, its going to be confusion. Heck, even some of us who have been here in crypto may not understand how many decimal point Sat is.And then we have BTC as unit and others. As much as we want to honor Satoshi with another unit in his name, I don't think that the majority will be into it. We are already fine with what we have right now, we have established the norm, we don't want to disrupt it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}