{
  "id": "topic_5420527",
  "title": "Famous Grouse",
  "author": "Famous Grouse",
  "created_time": "November 11, 2022, 01:22:05 PM",
  "content": "Matic still remains one of the fastest recovery coins I guess 🤔",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420527",
  "comments": [
    {
      "author": "zasad@",
      "created_time": "November 11, 2022, 02:03:14 PM",
      "body": "Now the main thing is not to buy those assets where Alameda has invested, because they will sell. The market may still fall, I do not believe in such a quick recovery.Do not keep money on exchanges, or send money there only to buy assets, with a subsequent withdrawal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YUriy1991",
      "created_time": "November 16, 2022, 10:21:45 AM",
      "body": "No one knows the future of Layer 2, not even Kay herself. But one thing's for sure there are some big names backing this up, along with a lot of people eager to see the next steps to see what happens between now and then.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "asriloni",
      "created_time": "November 16, 2022, 04:27:56 PM",
      "body": "Some reasons that make recovery was so fast for matic- meta adoption- good scalability and small fees- supported by so many ecosystem- the blockchain has been working smoothly. this far better than solana which was first layer blockchainIm actively using this blockchain other than BSC. polygon has become the most potential second layer solution to compete with the BSC blockchain which has been backed by binance. When the bullish come and you will see massive recovery gonna happen with matic. I do like how the developers to handle its blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "November 16, 2022, 05:49:44 PM",
      "body": "Quote from: zasad@ on November 11, 2022, 02:03:14 PMNow the main thing is not to buy those assets where Alameda has invested, because they will sell. The market may still fall, I do not believe in such a quick recovery.Do not keep money on exchanges, or send money there only to buy assets, with a subsequent withdrawal.This is amazing thinking, I get it how the market would be unstable wherever Alameda is there. That’s really worth noting down because imagine how pissed they must be considering they lost millions of dollars in such pity way. It could take up some serious time and efforts to earn that much money back. FTX is already not believing into returning any sort of money to anyone since they have worst loss ever. Other markets where they have invested is high risk. If they start to sell something then they will do it at mega levels and could end up creating chain reaction of selling. Better move everything into the wallet. Good idea.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "November 17, 2022, 08:13:02 AM",
      "body": "Quote from: so98nn on November 16, 2022, 05:49:44 PMQuote from: zasad@ on November 11, 2022, 02:03:14 PMNow the main thing is not to buy those assets where Alameda has invested, because they will sell. The market may still fall, I do not believe in such a quick recovery.Do not keep money on exchanges, or send money there only to buy assets, with a subsequent withdrawal.This is amazing thinking, I get it how the market would be unstable wherever Alameda is there. That’s really worth noting down because imagine how pissed they must be considering they lost millions of dollars in such pity way. It could take up some serious time and efforts to earn that much money back. FTX is already not believing into returning any sort of money to anyone since they have worst loss ever. Other markets where they have invested is high risk. If they start to sell something then they will do it at mega levels and could end up creating chain reaction of selling. Better move everything into the wallet. Good idea. You read what happened to the FTX exchange and what happened to Alameda. They stole their depositors' money. Sam and Caroline will be relaxing in the Bahamas in their expensive home, and we will no longer know the details of the investigation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}