{
  "id": "topic_5404692",
  "title": "david678345",
  "author": "david678345",
  "created_time": "June 30, 2022, 08:06:17 PM",
  "content": "I wanted to transfer crypto from coinbase to bitget...whats the best way to transfer from coinbase to bitgetA few months ago I saw a video that it was recommended to use litecoin to transfer from coinbase to Kucoin...and he was right the trading fees were very low...but now I wanted to transfer from coinbase to bitget.Is this still the case? and to transfer from coinbase to bitget do you guys recommend to use litecoin or another coin?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404692",
  "comments": [
    {
      "author": "jackg",
      "created_time": "June 30, 2022, 08:11:30 PM",
      "body": "Litecoin is probably the simplist and easiest option (it might be the most secure for lower fees too).I've transferred coins like usdt which have been cheap over the tron network and usdc has been cheap over the binance chain too (but I didn't notice the actual fees paid - and this was between two lesser known exchanges).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "June 30, 2022, 08:16:34 PM",
      "body": "You can use a webpage to compare the withdrawval fees of several coins on Coinbase.According to one I have just checked, you can withdraw BTC from Coinbase Pro for roughly 0,09$.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "July 01, 2022, 03:04:59 AM",
      "body": "I don't use Coinbase and Bitget and I don't know their withdrawal fees.You can check a very general information from Withdrawalfees.comType a coin you want to check its withdrawal fee from CoinBase and Biget, if you are interested in (see its fee is cheap enough), you can check it further on Coinbase and Bitget website.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kamvreto",
      "created_time": "July 01, 2022, 01:23:08 PM",
      "body": "Not only Litecoin, there are some coins that have cheaper fees such as SOLANA with a withdrawal fee of only $0.0001 and some other coins have different withdrawal fees.you just have to compare it and what coin you choose.The practice of transferring assets to other exchanges is also often called arbitrage by taking advantage of any price differences in each market.You can see complete information about withdrawal fees on this website.https://withdrawalfees.com/exchanges/coinbase",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}