{
  "id": "topic_5400067",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "May 24, 2022, 10:22:20 PM",
  "content": "QuoteSolar panels would be mandatory on all new buildings in the European Union under a new proposal aimed at ending its reliance on Russian fossil fuels by 2027 and supercharging its transition to green energy.The “solar rooftop initiative” in the European Commission’s REPowerEU plan would introduce a phased-in legal obligation to install solar panels on new public and commercial buildings, as well as new residential buildings.“We can also lead by example,” Frans Timmermans, who is leading the commission’s work on the European Green Deal, said at a news conference announcing the plan on Wednesday. “Let us show as a commission how quickly we can put solar panels on our buildings.”The initiative forms part of the commission’s drive to scale up and speed up renewable energy in power generation, industry, buildings and transport, to accelerate the EU’s independence from Russian imports, give a boost to the green transition and reduce energy prices over time.The detailed plan published on Wednesday comes after the commission, the European Union’s executive arm, called for the rapid phase-out of Russian fossil fuels and an acceleration of the European Green Deal in March in response to Russia’s invasion of Ukraine.European leaders then agreed to fully phase out Europe’s dependency on Russian gas, oil and coal imports as soon as possible at the European Council meeting later that month, and asked the commission to develop a plan by the end of May.The REPowerEU plan published on Wednesday is the commission’s detailed proposal of how to do just that. The plan has three main pillars: energy savings, diversification of energy supplies, and accelerated roll-out of renewable energy.The commission has said the plan will require an additional investment of €210bn (£178bn) between now and 2027 from the private and public sector across Europe, describing it as a “downpayment” on the bloc’s future independence and security. The proposal says cutting Russian fossil fuel imports can save the EU almost €100bn a year.“It is clear we need to put an end to this dependence [on Russian fossil fuels] as soon as possible and a lot faster than we had forseen before this war,” said Mr Timmermans. “In March we showed it could be done, the European Council in Versailles decided it should be done, today we show how it will be done.”Accelerating the rollout of renewablesThe proposed mandatory solar panel roll out is part of the ‘renewable energy’ pillar.The commission is proposing to increase its current target for renewables to produce 40 per cent of the EU’s energy by 2030, raising it to 45 per cent.In order for this to happen, the commission is proposing to double the rate of deployment of heat pumps, to produce 10 million tonnes of domestic renewable hydrogen by 2030, and to double wind and solar capacity.By 2030, solar energy will also be the largest electricity source in the EU with more than half coming from rooftops, said Kadri Simson, the EU commissioner for energy.The commission is also calling on member states to create dedicated “go-to” areas for renewables in places with lower environmental risks, where it says permitting processes should be shortened and simplified.It says it will roll out contracts to support the update of green hydrogen by industry and will use emission trading revenues to support the switch away from Russian fossil fuel dependencies. It says it will also “intensify” work on the supply of critical raw materials for the renewable transition and prepare a legislative proposal.“There is huge potential for rooftop solar ... there is a huge potential for on and offshore wind, there is a huge potential for increased biomethane production,” said Mr Timmermans. “If we do all these things we will first of all reduce our imports of Russian gas by one-third already this year and then we will, working towards 2027, reduce our dependency to zero.”Saving energyIn terms of saving energy, the commission is proposing to raise its current target for reducing energy consumption by 2030 via energy efficiency, from 9 per cent to 13 per cent.It is also encouraging member states to use policy to boost energy savings, such as reduced VAT rates on energy-efficient heating systems, building insulation and appliances and products, or by strengthening national energy requirements of new buildings.In the short term, citizens and businesses can save energy by reducing heating temperatures and reducing the use of air conditioning, switching off lights, using more public transport and using household appliances more efficiently, the commission added.“The cheapest energy is the energy you don’t use,” said Mr Timmermans.Diversifying energy suppliesIn the proposal, the commission says it is considering the development of a “joint purchasing mechanism”, which will contract and negotiate gas purchases on behalf of participating member states. It will also enable joint purchasing of renewable hydrogen.The commission will also consider legislative measures to insist on diversification of gas supply over time by member states, it added.https://news.yahoo.com/solar-panels-set-mandatory-buildings-112507536.html....I have read posts on this forum claiming solar is not a good energy option for europe. It appears EU lawmakers have also heard the call and decided to rule against it by making solar panels on new real estate development obligatory.The EU however was not the 1st to legislate this policy. That honor belongs to the US state of california who requires newly constructed homes to have solar panels on them by default as of 2020.QuoteCalifornia Gives Final OK To Require Solar Panels On New HousesSolar panels will be a required feature on new houses in California, after the state's Building Standards Commission gave final approval to a housing rule that's the first of its kind in the United States.Set to take effect in 2020, the new standard includes an exemption for houses that are often shaded from the sun. It also includes incentives for people to add a high-capacity battery to their home's electrical system, to store the sun's energy.https://www.npr.org/2018/12/06/674075032/california-gives-final-ok-to-requiring-solar-panels-on-new-housesThe following is also interesting:Quote“We can also lead by example,” Frans Timmermans, who is leading the commission’s work on the European Green Deal, said at a news conference announcing the plan on Wednesday. “Let us show as a commission how quickly we can put solar panels on our buildings.”Democrats in the USA pushed the 1st green new deal around 2021.QuoteDemocrats Push Green New Deal Measures, Other Liberal Policies Through HouseJuly 1, 2021 Washington, D.C. – Today, Congressman Michael Guest (MS-03) voted against the Democratic Majority's $715 billion package reauthorizing surface transportation and water and wastewater programs. The bill excluded almost all of the Republican alternative proposals in the STARTER Act 2.0, including those that would address the gaps in funding between rural and urban transportation, create more flexibility for local governments to address their state or region's own unique needs, and streamline costly review processes in order to reduce bureaucratic delays. The legislation passed 221-201.https://guest.house.gov/media/press-releases/democrats-push-green-new-deal-measures-other-liberal-policies-through-houseSo finally the EU is addressing the russia ukraine situation.Would be interested to know which direction public opinion is blowing on these policies.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400067",
  "comments": [
    {
      "author": "jackg",
      "created_time": "May 24, 2022, 11:30:03 PM",
      "body": "It's probably something Spain and Greece could do well having but I'm not sure if there's any other country that gets a good amount of sun.If they tried making rooftop wind turbines that were quiet and stable enough, you'd be able to produce a lot of electricity from the UK, the Netherlands, France, Denmark, Sweden (and probably most of the rest of Northern Europe).The rise in fuel price is probably good in a way as it might make renewables seem a more attractive source (the EU already sources half of it's electricity from renewables). I think Denmark is able to source half of its electricity usage by wind too. It'd probably also be useful to push efficiency, a modern mobile phone uses very little electricity when compared to other things (boiling a kettle uses about the same energy as giving a phone a day's charge).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Moneyprism",
      "created_time": "May 25, 2022, 07:51:48 AM",
      "body": "to be honest, not everyone has the ability to buy solar panels because they are quite expensive, especially for the installation and battery costs.. if the government can provide subsidies for this I think this could be the best option to reduce carbon footprint, particularly in the European region",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "May 25, 2022, 08:00:04 AM",
      "body": "Interestingly I see no words about the maintenance of those solar panels. We may easily end up with people installing the panels because they have to, but most will have basically no efficiency after a few years because of dust, hail and so on. Hence without this we can easily end up creating more pollution than clean energy...Together with not separating the rules for northern countries from the south makes me think that, typical for EU lately, they've rushed it and didn't give it a good thought.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bakasabo",
      "created_time": "May 25, 2022, 08:01:55 AM",
      "body": "I find solar panels not the best solution to fight with high electricity prices. To be able to set a proper amount of solar panels to become independent from outside electricity sources, a house must have particular roof sloped. You cant just install a solar panel on each cardinal direction of a roof and be happy. Once I have calculated, that for a 200+ m2 two store house, I had to install 8 solar panels. My house had only 2 sun sides, where panels would work effectively. In addition, I cant fit all 8 there. I can even barely fit 4 there without redoing roof surface. This greatly increases payback time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "May 25, 2022, 09:20:15 AM",
      "body": "The only positive aspect that I see in this news is that all these opportunities and investments will develop the solar panels and batteries industry quickly and effectively. If these investments were able to manufacture batteries more efficient than lithium batteries at a price of up to a quarter, I think that the cost of solar energy systems would be greatly reduced.In general, the adoption of solar energy in European countries is not a strategic option, but looking at the map below, I think that a lot of things will change in the next five years.https://www.sciencedirect.com/science/article/pii/S0301421515301324",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "May 25, 2022, 10:45:26 AM",
      "body": "Quote from: Hydrogen on May 24, 2022, 10:22:20 PMI have read posts on this forum claiming solar is not a good energy option for europe. It appears EU lawmakers have also heard the call and decided to rule against it by making solar panels on new real estate development obligatory.Of course, it's not and one look at a map would be enough:https://globalsolaratlas.info/map?c=44.308127,16.699219,4Half of Europe gets less sun exposure than Alaska!!!It has been known for decades, it has been hidden in statistics but the reality is that it makes zero sense to go solar, if you want renewable sat least stick to wind, but solar, and the timetable of solar compared to the start of activities in Europe makes no sense. You need backup or tons of batteries that will take ages to be built.QuoteThat honor belongs to the US state of california who requires newly constructed homes to have solar panels on them by default as of 2020.When you talk about a 74% difference, it makes sense:QuoteUsing a yearly average, there are 5.38 daily peak sun hours across the state of California.vsGermany has about the same solar potential as Alaska, which has an average of 3.08 sun hours/daysQuote from: bakasabo on May 25, 2022, 08:01:55 AMI find solar panels not the best solution to fight with high electricity prices. To be able to set a proper amount of solar panels to become independent from outside electricity sources, a house must have particular roof sloped. You cant just install a solar panel on each cardinal direction of a roof and be happy. Each system comes with adjustments for the slopes, the only need is to not have the roof completely tilted the wrong way on both sides, it doesn't happen since most of the houses are already being built taking into account the sun, even before when there was no talk about solar panels. Anyhow, the reduction in efficiency is not major even for a 60% axis is something about 20-30%, that can be overcome by size. That is not the important thing, the problem is that there is not enough sun once you go north of the Alps, not to mention that a lot of European towns are being built in valleys even in countries with better sun exposure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "May 25, 2022, 11:28:40 AM",
      "body": "Quote from: jackg on May 24, 2022, 11:30:03 PMIt's probably something Spain and Greece could do well having but I'm not sure if there's any other country that gets a good amount of sun.If they tried making rooftop wind turbines that were quiet and stable enough, you'd be able to produce a lot of electricity from the UK, the Netherlands, France, Denmark, Sweden (and probably most of the rest of Northern Europe).The rise in fuel price is probably good in a way as it might make renewables seem a more attractive source (the EU already sources half of it's electricity from renewables). I think Denmark is able to source half of its electricity usage by wind too. The UK, Norway, Germany, Netherlands and Denmark will invest about 135 billion euro into building wind turbines in the North Sea.Small rooftop wind turbines are not a good idea. The wind turbines have to be bigger, in order to be more efficient. Studies show that there's enough wind in the North Sea(in terms of both power and consistency), so the big wind turbines might be really effective.Anyway, I don't mind having solar panels on my roof, but the EU has to provide some sort of financial aid, in order to incentivize more people to put solar panels on their roofs. I know that the solar panel technology is getting cheaper and more efficient every year, but the mass implementation would cost billions and the energy system would still need conventional coal and nuclear power plants, in order to compensate the new solar power plants, because they won't be consistent at producing energy 24/7.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "May 25, 2022, 01:33:15 PM",
      "body": "So the plan is to implement renewable energy sources across EU within next 8 years of timeline. However, the document is talking about how they making the plans, for example every roof top should posses solar panels. But this does not fully solve the problem because this will solve the problem max to heating up houses, electrifying them etc. If they going for complicated process like producing hydrogen gas then also it won’t help much, because not everything runs on hydrogen, neither cars are that abundant.  This still sucks at the end of fuel shortages. Also when I mentioned about 8 years planning, have they forecasted the neighbour war situation and for how long it’s gonna last. What if they get injected further EU and causes more disturbances? Just making point because many of them part of NATO and they are involved with war directly. There are so many things they need to consider before going for huge investment like this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wind_FURY",
      "created_time": "May 25, 2022, 02:12:22 PM",
      "body": "A good response to start and be more independent from Russian energy, but it will obviously not be enough. The fastest, and most efficient path to be truly self-sustaining in energy production is nuclear. I believe there will be an overreaction, and the over-production of nuclear power all over Europe will be good news for the Bitcoin mining cartels.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "May 26, 2022, 03:06:58 AM",
      "body": "This is good but it’ll take a decade to have a noticeable effect, especially to replace Russians energy. Solar energy would be enough to power the entire planet however it’s very difficult and expensive to collect this energy.I looked into this at my own home. However the cost right now is way too high and many people are also considering the same. Even the technology has improved and they are cheaper now than before, it’s still a huge cost.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "May 26, 2022, 03:48:08 AM",
      "body": "Although in principle it may seem a logical measure, it seems a bit desperate to me. It is logical because the EU does not have large reserves of fossil fuels that it could extract if it wanted to. So it seems that intensifying the use of so-called green energies would be a solution. The problem is that they have got where they are precisely because of this, and they seem to want to keep digging the hole deeper. \"Green\" energies need backup power of uninterruptible supply. It's not always sunny, it's not always windy, so you need other energies. They don't want nuclear, they don't want oil, and the solution until recently was gas, LOL, you see gas is green and on top of that depending on Russian gas.In the end, either they will have to build more nuclear or they will have to continue consuming fossil fuels, no matter how much measures like this are meant to pretend that they will solve something.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "May 26, 2022, 04:43:41 AM",
      "body": "This sounds more like a publicity stunt to fool the masses into thinking they are solving the issue.For starters most of the energy is spent in the industries, for example most of the gas that is bought from Russia goes directly to factories not the housholds, a lot of electricity is also used by industries. In other words if every house added the solar panels it still wouldn't cut the dependence on Russian energy.On top of that, there are parts of EU that don't have that much sunlight to begin with. The solar panels would work on a much reduced capacity at all times.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bakasabo",
      "created_time": "May 26, 2022, 09:20:29 AM",
      "body": "Does anyone knows anything about solar panel maintenance? I mean like special maintenance? Or it will be enough to clean it with a a wet rag? I am not an expert, but I feel like solar panel maintenance is going to be regular, sort of a monthly cleaning. Compared to gas or water pipes, or wires, that require almost to maintenance and only annual check-ups. I bet if we sum up such points as panel price, installation, maintenance, payback, panels life cycle, it will turn out that it is aint so profitable in the end.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wind_FURY",
      "created_time": "May 26, 2022, 09:22:57 AM",
      "body": "Quote from: pooya87 on May 26, 2022, 04:43:41 AMThis sounds more like a publicity stunt to fool the masses into thinking they are solving the issue.For starters most of the energy is spent in the industries, for example most of the gas that is bought from Russia goes directly to factories not the housholds, a lot of electricity is also used by industries. In other words if every house added the solar panels it still wouldn't cut the dependence on Russian energy.On top of that, there are parts of EU that don't have that much sunlight to begin with. The solar panels would work on a much reduced capacity at all times.That sounds familiar. It's just like the Fed who talks of \"fighting inflation\", but won't do enough to actually fight it. The economy needs a hard landing, a crash, a reset. There's no other path but that. In the energy crisis in the E.U., everyone should only believe those politicians are serious in solving the issue, IF they make policies to set up and encourage the production of energy through.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "May 26, 2022, 10:20:47 AM",
      "body": "Quote from: so98nn on May 25, 2022, 01:33:15 PMBut this does not fully solve the problem because this will solve the problem max to heating up houses, electrifying them etc. Lols, we're talking about Europe and US here, electrifying what? Not that solar panels are a solution but let's not focus on problems solved a century ago.Quote from: bakasabo on May 26, 2022, 09:20:29 AMDoes anyone knows anything about solar panel maintenance? I mean like special maintenance? Or it will be enough to clean it with a a wet rag? I am not an expert, but I feel like solar panel maintenance is going to be regular, sort of a monthly cleaning. Depends where you live, if you live in a region that gets at least one serious rain at least every two weeks with little dust you can clean them once a year, the effect of small particle deposits will be minimal, and cloudy weather will have more impact than this. If you live in a desert things might start to get a bit more tricky as you will need a once-a-week clean, and yeah, the usual garden hose and a sponge will do the trick. Quote from: Poker Player on May 26, 2022, 03:48:08 AMIn the end, either they will have to build more nuclear or they will have to continue consuming fossil fuels, no matter how much measures like this are meant to pretend that they will solve something.We really need something far more serious than just this price spike or the threat of Russia cutting the gas to finally start building back nuclear power plants, it's the only obvious choice that produces energy 24/7 and that can store the fuel for decades, but now, because one earthquake and tsunami in Japan, Germany who hasn't experienced an earthquake over 7 on Richter scale in its history and only 2 over 6 in 700 years decided they are too risky, and this while France has one of its powerplants right on the border.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "May 26, 2022, 12:12:52 PM",
      "body": "Quote from: Poker Player on May 26, 2022, 03:48:08 AMAlthough in principle it may seem a logical measure, it seems a bit desperate to me. It is logical because the EU does not have large reserves of fossil fuels that it could extract if it wanted to. So it seems that intensifying the use of so-called green energies would be a solution. The problem is that they have got where they are precisely because of this, and they seem to want to keep digging the hole deeper. \"Green\" energies need backup power of uninterruptible supply. It's not always sunny, it's not always windy, so you need other energies. They don't want nuclear, they don't want oil, and the solution until recently was gas, LOL, you see gas is green and on top of that depending on Russian gas.In the end, either they will have to build more nuclear or they will have to continue consuming fossil fuels, no matter how much measures like this are meant to pretend that they will solve something.Producing electricity doesnt happen at the flick of a switch, the huge power plantsused to produce electricity take hours to shut down and start up so in my country I believe our Peat, Coal and Oil burning plants are constantly burning even when the sun is shining and wind blowing because its not easy to just switch it offand switch it on again.One of the biggest items used to produce Solar Panels is coal, so we are still extractingfossil fuels to create Solar.So yes we are been hoodwinked into thinking Solar is a solution, big business concernedwith Coal burning and Solar production are reaping the benefits of all this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "May 26, 2022, 02:58:12 PM",
      "body": "I mean, if we look at the bigger picture, and assumed that this would work, which obviously as already established many places wouldn't have the same effectiveness of those in the southern areas of the world, Bitcoin could benefit from this. At the moment the biggest argument against Bitcoin would be the fact that it uses the grid for its miners,  whereas if every household converted to generating energy via the sun, we would see that argument become pretty redundant, and would likely benefit Bitcoin's adoption. At the very least, reduce its attack surface. Quote from: pooya87 on May 26, 2022, 04:43:41 AMOn top of that, there are parts of EU that don't have that much sunlight to begin with. The solar panels would work on a much reduced capacity at all times.Not something I'm massively in know of, but I'm wondering if transferring the energy that has been collected in countries or areas which are more prone to sun, to places without that much sun could be an option. I'm assuming this would likely be quite expensive, and would likely mean losing some of that energy in the process, but I keep hearing that this is priority from the governments, so why haven't they kicked into gear? Quote from: aoluain on May 26, 2022, 12:12:52 PMOne of the biggest items used to produce Solar Panels is coal, so we are still extractingfossil fuels to create Solar.Yeah. I guess the defense against this is they're going to need that production at first, but once they convert everything to solar, hydro or wind they'll be able to manufacture these things without using fossil fuels. Whether we ever get to that stage is another thing mind you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "May 26, 2022, 03:35:16 PM",
      "body": "There isn't yet a positive ROI associated with solar panels when you factor in initial cost, maintenance, and geographical variance with some places not being exposed to a lot of sunlight. It's another one of the \"feel good\" measures that attempt to shift the conventional forms of energy into the green renewable energy utopia (which isn't actually attainable at the moment). It's comical that they cite the reliance on Russian imports as a reason for this. Imagine not diversifying the energy sources, becoming self reliant, or modifying the energy trading partners but instead electing to choose technology that's under developed and doesn't meet energy demands. Nuclear energy seems more sustainable, but for obvious reasons, the Europeans use it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "May 26, 2022, 04:06:45 PMLast edit: May 26, 2022, 04:18:00 PM by Zlantann",
      "body": "The plan is set to achieve two objective; transit Europe to renewable energy in power generation and curb or stop Europe dependence on Russian supplies. Critics have identified cost, maintenance skills, and durability as some of the problems of solar energy. But for me, if solar energy  is one of the means of gaining independence from Russian gas, then it is a risk worth taking. The European Union is so desperate to be free from Russian influence that they have pledged to invest €210bn to ensure that Europe become safe and self-reliant. After all, Europe is currently spending more to defend Ukraine and other nations. So both public and private firms would be granted some grants to produce and sell the solar system at subsided prices. There would also be training sections for individuals on how to install and maintain the solar system. If solar is one of the means of granting Europe power independence from Russia, let Europe embrace it now and adjustment can be made in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}