{
  "id": "topic_5467272",
  "title": "tech30338",
  "author": "tech30338",
  "created_time": "September 19, 2023, 04:02:35 AMLast edit: September 19, 2023, 04:15:06 AM by tech30338",
  "content": "Most of the people that are into crypto spend lots of time, learning on their on in front of the computers , phone, laptop, tablets , anything that will provide them with information, but sometimes those are not enough.We could participate on events with topics are blockchains, web3, where also speakers who are well known in crypto, also founders, because not only you will learn a lot from them but also be inspire for what they have achieved over the years not only wealth but also knowledge.note: Be careful going to event who always ask for fee's people who are just using crypto to earn from fee's to enter their event where you learn nothing, this were organized by unknown people, pretending to know bitcoin etc.As much as possible spend less, some events only need registrations, to confirm that you can attend, attend only where you are interested so that you will have time, and do your own research, hope this helps are fellow member to know events coming on their area.Here is a link where you can see upcoming events in the future, please share if you have other links of crypto events thank you:https://bravenewcoin.com/eventshttps://cryptoevents.global/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467272",
  "comments": [
    {
      "author": "Hatchy",
      "created_time": "September 19, 2023, 05:24:39 AM",
      "body": "There are some  thread which have been raised in the past concerning this op, Is going to a the bitcoin conference worth it?Going to Bitcoin eventsWhile Going to such events, can be very informative or educative, because you would meet alot of people who are like minded and probably share new ideas there are still some reason why alot of person would decide not to go 1. Some of these events are hosted by creators of shit coins, they have nothing to impact on you just trying to sell their coins.2. It puts a lot of peoples identity at risk exposing them to the public. Possibly to scammers, thief, kidnappers and lots more.3.In countries where cryptocurrency are banned it isn't adviced to join such gathering as governments officials will use this as a means to target such person.4.attending such events might be expensive and such people don't bother going but can decide to watch a video of it on tv or Livestream.I haven't been to such events before, and I don't think I will be attending any soon, but it isn't bad, as one would meet experts, learn new things and even meet new people from different parts of the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "September 19, 2023, 05:43:22 AM",
      "body": "Quote from: tech30338 on September 19, 2023, 04:02:35 AMMost of the people that are into crypto spend lots of time, learning on their on in front of the computers , phone, laptop, tablets , anything that will provide them with information, but sometimes those are not enough.We could participate on events with topics are blockchains, web3, where also speakers who are well known in crypto, also founders, because not only you will learn a lot from them but also be inspire for what they have achieved over the years not only wealth but also knowledge.note: Be careful going to event who always ask for fee's people who are just using crypto to earn from fee's to enter their event where you learn nothing, this were organized by unknown people, pretending to know bitcoin etc.As much as possible spend less, some events only need registrations, to confirm that you can attend, attend only where you are interested so that you will have time, and do your own research, hope this helps are fellow member to know events coming on their area.Here is a link where you can see upcoming events in the future, please share if you have other links of crypto events thank you:https://bravenewcoin.com/eventshttps://cryptoevents.global/Op, sticking to the topic I would like to say that there is no such need for beginners to attend such sorts of events first of all they need to get familiar with the basic terminologies in the market and their usage after covering this step they can go for the video tutorials to learn as much as they can because a lot of substantial data is available. The move of exploring the other aspects of the markets is not for beginners, and it is never recommended them this should followed by the market experts.Secondly OP I'm not sure if you are native in English or not but I would like to suggest avoiding typo/spelling errors try to use Grammarly or any other tool, it will assist you in the effitive delivery of the message.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "September 19, 2023, 06:00:59 AM",
      "body": "Unless I won't gain anything from promoting a business or networking with people, I'd rather pass. If I'd gain the same information/knowledge from watching a conference live and watching a replay on YouTube, it's not worth it — not money-wise, but privacy and security-wise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "September 19, 2023, 06:03:18 AM",
      "body": "Quote from: tech30338 on September 19, 2023, 04:02:35 AMMost of the people that are into crypto spend lots of time, learning on their on in front of the computers , phone, laptop, tablets , anything that will provide them with information, but sometimes those are not enough.It actually is enough. Learning for months in front of your computer and asking questions daily from more knowledgeable members is a much better way to learn than attending an event for a couple of hours hosted by multiple people.YouTube videos can replace the feeling of being a an event and has the advantage that you can choose what to learn at a giving point in time and can build on your knowledge gained.Crypto events are rarely centered on Bitcoin and exposes one to several shitcoins looking to build some publicity and reach a wider audience. There are other risks attached that makes it not worth it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ever-young",
      "created_time": "September 19, 2023, 07:59:08 AM",
      "body": "I will prefer learning from my home, using my computer, and watching some tv presentation and any form of E-learning that can aid to my knowledge, it’s going to somewhere to learn from other authors is not something that everyone finds interesting, as time and other factors are also part of the reason most people preferred going digital, when you look at the time, and other expenses required to just go their you will have to discourage your self from learning.one thing that make most people lack knowledge about something today is because they don’t have the right source to get it, and how that things have been made all digital you still want someone to go and be squeezing their self in one hall all in the name of seminars, unless their are some special things which one will gain when they are available on the event center if not their is no point of going, even if they are our favorite person when it comes to motivation, you can still watch through their show online and drop your question in the comment section and things will be answered even more than it could be on the open seminar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "September 19, 2023, 08:26:00 AM",
      "body": "I have never attended any of such events and i don't think i would even be interested in attending one. Mind you that you don't learn about Bitcoin in a Bitcoin conference that just lasts a few hours, and whatever thing that would be said there can easily be found online. As a matter of fact most people who attend these conferences already have enough knowledge of Bitcoin, they only attend for networking purposes.Not to talk about the risks involved in attending such events, and the disappointment of finding out that the conference wasn't actually about Bitcoin, but for one altcoin or the other. Learn over the internet, join Bitcoin forums like Bitcointalk; if you do these you might never see the need for these events.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "September 19, 2023, 08:30:18 AM",
      "body": "Quote from: tech30338 on September 19, 2023, 04:02:35 AMMost of the people that are into crypto spend lots of time, learning on their on in front of the computers , phone, laptop, tablets , anything that will provide them with information, but sometimes those are not enough.You didn't give a reason to why you said this isn't enough, learning on your own could be the best methods for you as to been around people, socializing could also be a distraction. Atleast when you learn alone you won't get disturbed about the next bitcoin (altcoins) as if they pop up as ads you could easily skip it. Most of the big names we have in the industry didn't attend those seminars or event that they're now hosting yearly as a means to generate revenue for their business and give publicity to the next scam (wanna be Bitcoin) that they're working on. Don't get me wrong as some of those bitcoin or cryptocurency related events are fun to attend and also educational but you shouldn't think your understating of Bitcoin depends on those events.Quote from: tech30338 on September 19, 2023, 04:02:35 AMWe could participate on events with topics are blockchains, web3, where also speakers who are well known in crypto, also founders, because not only you will learn a lot from them but also be inspire for what they have achieved over the years not only wealth but also knowledge.If you need inspiration then read about the core Bitcoin developers that have helped in bringing Bitcoin to where it is today, Satoshi didn't attend events even though back then Bitcoin wasn't popular to have a fan base but still he won't do it now that Bitcoin has become very popular. There isn't anything that's been taught or learnt on their event that you can learn at the comfort of your home. This events aren't the best suggestions to give because they're target of scammers, hackers and kidnappers that watch people that attend the event to make them their target (victim) to extort money from them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "September 19, 2023, 08:43:20 AM",
      "body": "Quote from: tech30338 on September 19, 2023, 04:02:35 AMMost of the people that are into crypto spend lots of time, learning on their on in front of the computers , phone, laptop, tablets , anything that will provide them with information, but sometimes those are not enough.When it comes to learning, we must broaden the band to the extent at which we can acquire knowledge of, learning is not a stereotype one way direction, we have to apply multiple approach to ensure that we get the desired target from what we intend to learn, we could see learning both in practical and theoretical aspects being important as well as the place, the means and how this learning takes place, we also have what is called conscious and unconscious learning, those that the environment and things we see often affects our own personal interest and behaviors towards learning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sophokles",
      "created_time": "September 19, 2023, 08:55:06 AM",
      "body": "Quote from: tech30338 on September 19, 2023, 04:02:35 AMsnipThese events are great places for promoting new business ideas and creating new connections. If you don't intend to do any of these, it will just cost money and time. The information you will learn from these events about bitcoin is already available on the internet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "September 19, 2023, 09:11:54 AM",
      "body": "Quote from: tech30338 on September 19, 2023, 04:02:35 AMMost of the people that are into crypto spend lots of time, learning on their on in front of the computers , phone, laptop, tablets , anything that will provide them with information, but sometimes those are not enough.We could participate on events with topics are blockchains, web3, where also speakers who are well known in crypto, also founders, because not only you will learn a lot from them but also be inspire for what they have achieved over the years not only wealth but also knowledge.I remember attending a few events where I newly learned about crypto and that excitement made me wanted to see those that were regarded as gurus online and when I got to the event I must say what I got there wasn’t what I expected. They talked about some benefits of getting into crypto and then majorly discussed about their life and their success and afterwards sponsors took over the stage and started coming out one after the other to advertise their products/services to those that were present there. Although some were very educative while others were a waste of time but all the same I still don’t think it’s mandatory for newbies to go to crypto event if they wish to strive but if they have someone that they look up to and he’s hosting an event then they can go and learn from them but as for attending an event just because it’s crypto based I don’t support that, that’s just for me tho.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "September 19, 2023, 09:15:28 AM",
      "body": "Quote from: tech30338 on September 19, 2023, 04:02:35 AMMost of the people that are into crypto spend lots of time, learning on their on in front of the computers , phone, laptop, tablets , anything that will provide them with information, but sometimes those are not enough.We could participate on events with topics are blockchains, web3, where also speakers who are well known in crypto, also founders, because not only you will learn a lot from them but also be inspire for what they have achieved over the years not only wealth but also knowledge.note: Be careful going to event who always ask for fee's people who are just using crypto to earn from fee's to enter their event where you learn nothing, this were organized by unknown people, pretending to know bitcoin etc.As much as possible spend less, some events only need registrations, to confirm that you can attend, attend only where you are interested so that you will have time, and do your own research, hope this helps are fellow member to know events coming on their area.Here is a link where you can see upcoming events in the future, please share if you have other links of crypto events thank you:https://bravenewcoin.com/eventshttps://cryptoevents.global/Attending events about Bitcoin and blockchain technology has its benefits since you can have one-on-one interaction with the guest speakers and also gain practical knowledge.  But I can attest that there is nothing you want to learn about the crypto industry that is not on the internet and relevant books.  The internet has all it takes to make one proficient in the industry. Most of the founders of bitcoin live anonymous or quiet lives so you can hardly see them in such events.  In most cases, these speakers or lecturers are wannabe crypto experts that are only concerned with promoting a shitcoin or scam project. You can hardly find a genuine event that has no hidden agenda to make a profit. I will be willing to attend an event that will be organized by any reputable members of the forum, but I am sure this will never happen because the forum is enough avenue to learn.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z390",
      "created_time": "September 19, 2023, 09:49:05 AM",
      "body": "Remember that the questions that you have in mind is in someone else mind too, and they will ask when they attend the event. Why not watch the full video of the event on your computer or smartphone? Because OP your post is annoying, as if everyone can afford to take a flight out if their country to a crypto event location. Even those who are living internationally always talk about how it's expensive to attend a crypto event in another country, my question for you is how many events like this have you attended? Can you throw some pictures for us to see? To at least make us have the dream of attending crypto events some day? Maybe we aren't working hard enough like you do. There is nothing that can be discussed in any crypto event that isn't available online to read, you don't have to be there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "September 19, 2023, 12:38:34 PM",
      "body": "Quote from: tech30338 on September 19, 2023, 04:02:35 AMWe could participate on events with topics are blockchains, web3, where also speakers who are well known in crypto, also founders, because not only you will learn a lot from them but also be inspire for what they have achieved over the years not only wealth but also knowledge.I do not see these events as very necessary if it is just knowledge you are seeking. The internet and this forum are far better to get engaged with to get more knowledge than an event of just one day or a few days. With the internet, you can learn anything from any corner of the world with good reception.Quote from: tech30338 on September 19, 2023, 04:02:35 AMWe could participate on events with topics are blockchains, web3, where also speakers who are well known in crypto, also founders, because not only you will learn a lot from them but also be inspire for what they have achieved over the years not only wealth but also knowledge.Participate in these events if you like to meet more people who have the same interest as you, see how people around you view these new innovations and how they are using it. If it is to learn, you may get disappointed. Some of these events are organized by people who have personal benefits to get from doing so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "September 19, 2023, 12:56:18 PM",
      "body": "It is typical that these events will have some products to advertise or pitch to all of the attendees. But if you're for having fun attending these as you've got knowledge to gain and you simply just enjoy meeting people, it's a good venue to do it.You'll get to connect with many people and who knows if one from there will play a vital role to your progress and career in the crypto space.But these days, I'd rather be interested to go in webinars instead of actual meet ups.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "September 19, 2023, 03:12:26 PM",
      "body": "I follow the news via: - https://coinmarketcal.com/en/ - https://coinscalendar.com/They both offer good filters that enable you to know and track all the news you need and thus get better results.For technical news, I recommend ----> https://bitcoinops.org, in addition to some specialized YouTube channels[1] that you can customize after listening to them and determining the content that is good for you and the content that you consider to be a waste of time.Other than that, Google gives you everything you need.[1] https://www.youtube.com/channel/UCJWCJCWOxBYSi5DhCieLOLQ",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "September 19, 2023, 03:40:57 PM",
      "body": "Quote from: tech30338 on September 19, 2023, 04:02:35 AMMost of the people that are into crypto spend lots of time, learning on their on in front of the computers , phone, laptop, tablets , anything that will provide them with information, but sometimes those are not enough.We could participate on events with topics are blockchains, web3, where also speakers who are well known in crypto, also founders, because not only you will learn a lot from them but also be inspire for what they have achieved over the years not only wealth but also knowledge.note: Be careful going to event who always ask for fee's people who are just using crypto to earn from fee's to enter their event where you learn nothing, this were organized by unknown people, pretending to know bitcoin etc.As much as possible spend less, some events only need registrations, to confirm that you can attend, attend only where you are interested so that you will have time, and do your own research, hope this helps are fellow member to know events coming on their area.Here is a link where you can see upcoming events in the future, please share if you have other links of crypto events thank you:https://bravenewcoin.com/eventshttps://cryptoevents.global/For any knowledge you want to have, you could attend seminar's or event's that are hosted to teach what you don't know or have concrete knowledge about.I've attended one or two crypto events in my location some time back, all this will broaden your understanding as long as you getting the right information and education.Though you can as well learn a lot from the internet from the comfort of your home. This daysLearning alone most times help you to grow faster, you could as ask questions where necessary here in the forum so don't make some unnecessary mistake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "September 19, 2023, 04:09:36 PM",
      "body": "Quote from: hugeblack on September 19, 2023, 03:12:26 PMI follow the news via: - https://coinmarketcal.com/en/ - https://coinscalendar.com/They both offer good filters that enable you to know and track all the news you need and thus get better results.For technical news, I recommend ----> https://bitcoinops.org, in addition to some specialized YouTube channels[1] that you can customize after listening to them and determining the content that is good for you and the content that you consider to be a waste of time.Other than that, Google gives you everything you need.[1] https://www.youtube.com/channel/UCJWCJCWOxBYSi5DhCieLOLQYou forgot to mention one of best place to get news about Bitcoin and cryptocurrency market as well, it's Bitcointalk.  What news in the world for this market won't be discussed in Bitcointalk. First, visit Wall Observer (WO) thread and get news.Wall Observer BTC/USD - Bitcoin price movement tracking & discussionIf not, get it around the forum.Some media websites for people who want to follow news. Honestly I stopped doing this a long time.Bitcoin News and Bitcoin Price Chart Sites",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "September 19, 2023, 04:56:23 PM",
      "body": "Crypto event are actually cool to attend since thoughts and ideas are being shared among people who are intellectual in the line of cryptocurrency and bitcoin at large. My first event then was a messy one but after that I decided not to be going for event as my first attend was so out of point what they were saying isn't related to what I gained here. Like I noticed here is even the best place to learn about bitcoin and cryptocurrency related discussion and knowledge sharing, after which I decided to make here my best place to study and learn things than going for an event where the speaker doesn't know what they are saying instead they are even wanting to make you look more like a fool in their eyes so I decided to stop and focused learning things from here. We have lots of expert and experience people over here who can give you a full knowledge about bitcoin including wallets security and progression.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "September 19, 2023, 08:44:44 PM",
      "body": "Quote from: mk4 on September 19, 2023, 06:00:59 AMUnless I won't gain anything from promoting a business or networking with people, I'd rather pass. If I'd gain the same information/knowledge from watching a conference live and watching a replay on YouTube, it's not worth it — not money-wise, but privacy and security-wise. Thinking the same thing. I definitely agree that it's a waste of time if the information or knowledge that you will learn from such events can be learned online. I'd rather learn it online instead of going to the event and I think if there's an event it would be most likely an explanation of their platform and how it is different from other platform and promoting their website. I have been in flthe forum for quite some time and I did gain some knowledge online and I never attended an event once because all that I learned are from different sources online.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}