{
  "id": "topic_5410455",
  "title": "CryptoHeadlineNews",
  "author": "CryptoHeadlineNews",
  "created_time": "August 19, 2022, 08:06:18 AM",
  "content": "Despite the fact that Bitcoin since it's invention has made young billionaires, made transaction fast and change the lives of many who grabbed the opportunity investing at it's early stage, there are still some out there who can't afford at least one square meal a day, which is unfortunate as these people could be found around us in our various communities/cities all around the world. Because I have seen a lot of threads emphasing about \"educating people about Bitcoin\" but never did I find any going an extra mind on checking or touching the lives of the people they have educated, because of what benefit will it be trying to educate hungry people who can't afford at least one square meal a day? Or are you trying to say we should exclude these people simply because they are poor? No no no... Because I think both the poor & rich deserves the right to know about Bitcoin, because nobody knows tomorrow, as a person's condition in life is never always permanent, of which Satoshi will be very proud of this very act of kindness.And that's why in this new thread of mine, I decided to take another dimension by offering aides to the less privilege and most especially the poor kids in my community, to put smiles on there faces by offering a Bitcoin t-shirt and a catton of Indomie Noddles worth $19 each to any random poor kids I happen to come across on the streets in my community.So let's ride on as I explain in detail how I was able to make this little act of kindness successful by touching the lives of these poor kids with all my 3 weeks campaign BTC.Actually, WinTomato was my very first campaign as a Full Member on this forum, of which we were been paid $25/wk, and I always had in mind to sow seed with my very first campaign payment, of which the idea of \"touching lives\" came into my mind, and since my first payment wasn't enough, I had to wait longer working on my plans till this very moment that it has been made a success.AIMS & OBJECTIVESThe aims & objective of this thread were as follows;1. Touching lives:I decided to touch the lives of these poor kids because looking at the current economic situation in my country, I knew that there were people out there who needed this BTC more than me, and however, it was actually my first signature payment, so I used it to sow seed into their lives.2. Promote Bitcoin:  In other for me to promote Bitcoin in my little way, since it is ban in my country, I decided to use these kids who are below the legal age to help facilitate my promotion by offering them a t-shirt with a Bitcoin phrase written on it, such as Bitcoin is real, Bitcoin is not a scam, Bitcoin has come to stay and Bitcoin is a digital currency. (You can have a look at the t-shirts below).Below are the Bitcoin t-shirt 1. 2.3.4.What I actually did was that  I bought 4 white plain t-shirt and gave it to an artist who wrote those Bitcoin related phrases as you can see above (Bitcoin is real, Bitcoin is not a scam, Bitcoin has come to stay & Bitcoin is a digital currency) which cost me $9 each for the t-shirt and artist fee. And after that, what I did was to  buy 4 catton of Indomie Noddles (One of Nigerian favorite Noddles and breakfast meal) worth $10 each to be given to any random poor kids I happen to come across on the streets, which you can see all the pictures below.Below are the moment when I gave the Bitcoin t-shirt and catton of Indomie Noddles to poor random kids 1.2. 3. 4. MY POSSIBLE FINDINGS1. I was able to find out that many people out there in the society are suffering, and you don't have to be a Sr. Hero or Legendary Member of this forum to be able to touch someone's life with the little campaign money earn from this forum in our own little way, because it's simply an act of kindness and an act of kindness always get a  bountiful reward.2. I was able to find out that thou Bitcoin is banned in my country, there was a way I could subconsciously promote Bitcoin into the minds of people in the society, which was by designing a Bitcoin t-shirt and given to kids so that when they wear these t-shirts and walk on the streets in the community they will subconsciously promote in the minds of people that Bitcoin is real, is not a scam, has come to stay and is a digital currency.CONCLUSION:In conclusion, you actually need to see how happy these 4 kids who I gave the Bitcoin t-shirt and catton of Indomie Noddles, and I too was also happy, for being able to touch their lives through the use of my campaign BTC. And how I wish I could touch more lives, but that was all my rank and campaign payment could afford, and I am so much grateful to WinTomato signature campaign for making this a success..So I have just done mine, and now is your turn.. let us touch lives with be our Bitcoin and I'm sure Satoshi will be proud of you. Thanks 🙏",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410455",
  "comments": [
    {
      "author": "Lucius",
      "created_time": "August 19, 2022, 09:21:54 AM",
      "body": "It's always nice to see how people try to change something for the better in their environment, even with a little money and a lot of goodwill. Although it doesn't seem like much, people who are at the bottom of society appreciate such gestures much more than those who live in relatively good conditions and receive expensive gifts.I try to help people who are in need in my local community, but also through some international humanitarian projects that I know really make a difference when it comes to children and what they need in life, namely food and education. One of the best projects that I personally support is Mary’s Meals which currently provides around 2.3 million meals a day for school children in various parts of the world. A donation of just $19 provides food for 1 child for the entire school year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "August 19, 2022, 09:50:00 AM",
      "body": "This is a great move and work well done. Basically i would point out to you about Bitcoin not banQuote from: CryptoHeadlineNews on August 19, 2022, 08:06:18 AM2. since it is ban in my countryIt is not ban but rather restricted us from associating our local account with bitcoin transaction, there are some shopping mall that accepts bitcoin including gas station in the country so if it was ban there wouldn't have been a way for them to be accepting bitcoin.Secondly i must commend on your love for kids. It is a thing of joy help out kids by the street this serves as means of reducing criminality and hunger among kids growing in hard country most especially Nigeria.Thank you for love.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "August 19, 2022, 12:55:20 PM",
      "body": "I also want to express my gratitude to the OP. Seeing smiles on the faces of children is the greatest happiness. And if you, OP, bring those smiles to them, they will definitely come back to you in the future. The only person who is never guilty of being poor is a child. Giving them a good mood, giving them direction that the world is not so cruel and there are ways to change their future, will be a good motivation for these children, and maybe those around them. I have great respect for these people, and I understand how many difficulties they have to overcome. And I really hope that the knowledge of bitcoin and the possibility of using it will somehow improve the lives of these people, and indeed of any people who are currently praying not only for their wealth but about how to let their children survive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "August 19, 2022, 03:50:29 PM",
      "body": "I am happy that you are making efforts for people and Bitcoin. Those who not only help people out of their own pockets and profits, but also educate them about Bitcoin at their own expense deserve the maximum merit you can can send to someone per 30 days. So congratulations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Haunebu",
      "created_time": "August 19, 2022, 04:25:58 PM",
      "body": "Great stuff op. Always great to see these random acts of kindness sprinkled around in this forum. Personally, I liked the one that said \"Bitcoin has come to stay\". I have no idea what Indomie Noddles means though.What's different about this thread is the fact that you specifically mentioned the campaign that you worked with and thanked them. Wonder if they know about this thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "August 19, 2022, 04:46:04 PM",
      "body": "That's a good initiative from you, having the interest of young ones in mind is a good and an ideal way to effectively use the benefits of bitcoin in giving back to our society, many couldn't have gone to an extent but not all minds are directed to a single phocus, engaging in sharing the little from what one had unto others especially those in need is a good act one cannot do without, most importantly those that has a generous mind of giving/charity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "August 19, 2022, 05:13:33 PM",
      "body": "Wow!!! This what is needed in the society. OP I really appreciate what you have done to those children. At least the carton of Indomie can sustain them for one week and the T-shirt will advertise Bitcoin for the community. But according to a saying, \"I will not give you fish but I will teach you how to fish\". Now those children you gave the indomie are still in poverty but if you would have teach them and give them devices to use bitcoin then you would have helped their families. Although you helped them but for temporal, probably one week. Please also teach them how to fish...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "August 19, 2022, 05:33:03 PM",
      "body": "It's a nice read Op, you did two important things simultaneously. One touching lives with your weekly earning and secondly promoting bitcoin. It is something great, if you can find a way to collaborate with like minds and make it a continuity, it will be nice.Quote from: NotATether on August 19, 2022, 03:50:29 PMI am happy that you are making efforts for people and Bitcoin. Those who not only help people out of their own pockets and profits, but also educate them about Bitcoin at their own expense deserve the maximum merit you can can send to someone per 30 days. So congratulations.You did great and I applaud you for it Boss, Op needs any kind of available encourage and handing out 50merits is a great motivation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "August 19, 2022, 05:47:41 PM",
      "body": "I like what you have done, anybody who is a passionate bitcoin user and lover would like what you have done; i'm sure it is something that many of us do, but some don't feel like sharing it here with the other members, so i praise you for taking your time to share it with us here, it is appreciated, and hopefully you will do more. I know the kids will be very happy, and i hope they grow up to use bitcoin and be part of the network. Cheers CryptoHeadlineNews.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "August 19, 2022, 06:05:02 PM",
      "body": "Quote from: CryptoHeadlineNews on August 19, 2022, 08:06:18 AM I was able to make this little act of kindness successful by touching the lives of these poor kids with all my 3 weeks campaign BTC.It is becoming more of a ripple these days on this forum, how members are seeing how other forum members are touching lives via btc and following suite to try and contribute in their own quota. It is a good ting that you have done and you will be surprised how far this your little act of kindness will go. I like the fact that you made some branded t-shirts as well, that will contribute greatly to the awareness about bitcoins and far outlive the carton of noodles which is still great. keep up the good work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "August 19, 2022, 06:21:08 PM",
      "body": "Quote from: NotATether on August 19, 2022, 03:50:29 PMI am happy that you are making efforts for people and Bitcoin. Those who not only help people out of their own pockets and profits, but also educate them about Bitcoin at their own expense deserve the maximum merit you can can send to someone per 30 days. So congratulations.Wow.. I am just very speechless right now. This is far beyond just a motivation Sir, because I have never been this motivated the way you just did today with the maximum merit one can get within 30days.. I am very grateful for you Sir, for finding me worthy of such priceless forum possession. And I promise to offer my very best for the growth of this forum. Thanks 🙏",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "August 19, 2022, 09:54:38 PM",
      "body": "Selfless giving is when you give to people that dont have the capacity to give back to you. What you have done OP shows that you have the the intention of contributing positively to the wellbeing of of these less privileged children. And using your campaign funds to carry out this task is an extraordinary action. The children might not have the capacity to pay you for your good works but posterity wouldn't forget your kind gesture. You have also used this great opportunity to spread the news of Bitcoin. Well done.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GiftedMAN",
      "created_time": "August 20, 2022, 07:32:36 AM",
      "body": "This is good and I must commend you OP for taking out your time, energy and resources to reach out to poor kids in your area and to also promote Bitcoin and its importance to them. I believe in time to come, these kids will likely want to know more about Bitcoin hence they were informed that the T-shirts and other gift items came from someone who is a Bitcoiner.I have given you two merit to appreciate your generosity and I hope you continue with the good work in touching lives through your earnings and promoting Bitcoin to everyone around you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yawa2020",
      "created_time": "August 20, 2022, 07:49:49 AM",
      "body": "Quote from: CryptoHeadlineNews on August 19, 2022, 08:06:18 AM2. Promote Bitcoin:  In other for me to promote Bitcoin in my little way, since it is ban in my country, I decided to use these kids who are below the legal age to help facilitate my promotion by offering them a t-shirt with a Bitcoin phrase written on itFirst of all, I must commend your efforts for trying to touch the lives of those less privilege with your hard earned resources. However, if I understand you clearly, you said Bitcoin is ban in your country as I quote above. My concern is; since Bitcoin is ban in your country, this your particular act (promoting btc) isn't considered as a violation of government policy since it is banned? I will like to hear your response to this. QuoteSo I have just done mine, and now is your turn.. let us touch lives with be our Bitcoin and I'm sure Satoshi will be proud of you. Thanks 🙏You've actually done well and set a pace for us all to emulate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "August 20, 2022, 10:07:50 AM",
      "body": "This type of thread always gives me more courage and belief in Bitcoin; I'm becoming more interested in community service, particularly in spreading awareness about Bitcoin and cryptocurrency. I'm also looking for a way to help and support my community in order to teach and give back to society because I know they're missing out and need proper Bitcoin orientation; I'll also give my own advice soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "August 20, 2022, 02:03:16 PM",
      "body": "I really commend your good job here in touching some lives and equally promoting Bitcoin to this poor people through your gifts and I do believe this is gonna stick in their mind as they keep growing.I know a lot of people here has also done some charity work too, through the money they earn from signature campaigns both in the past and present, including the ones that actually did not bring it into notice and this shows that this forum has really gone far beyond expectations and have had great success both in terms of changing people's life positively and in educating people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obito",
      "created_time": "August 20, 2022, 02:27:38 PM",
      "body": "Nice one OP, you didn't just give them food, you gave them quality food because Indomie is such a good noodles. And the fact that you sacrificed 3 weeks of your payment to do this kind of thing speaks volumes to your personality. I'm not yet at your level so I don't have the means to even help a lot but when I do, I will definitely be helping a lot even stray animals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.right85",
      "created_time": "August 20, 2022, 03:29:48 PM",
      "body": "Therr are only a handful of persons like you and on the forum that have taken to teaching and of recently, gifting from the little you've got and your doing all that too in the name of bitcoin  which makes it great.We see things like these from the high class of our African societies only during elections to sell there name and promote there political interest and influence but, this is different as its got no end means rather than to educate, uplift and make life better for those who it isn't by there choosing that they find themselves in the situations they are today.Your aid to these underprivileged onces do counts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "August 20, 2022, 03:50:47 PM",
      "body": "I agree with the op that it's terrible that many people still experience hunger, and I do believe that helping with such matters, even on a small-scale level, is important and likely more important than simply educating people about Bitcoin. Bitcoin is money, and if you have none, it can't solve it, after all. It can also be an investment, but if you're very poor, you have nothing to invest in. And by now I'm not surprised that this project is in Nigeria because, at least from this forum, it seems that Nigeria has many amazing people who want to boost their country's economy in responsible and meaningful ways by promoting Bitcoin and engaging with local communities. The kind of passion I see from the posts about Nigeria is unparalleled. I believe that eventually, all this strength of the people willing to work on making their country a much better place will become way more known, and Nigeria might even become an example to many others. And of course, here I mean the people, the civil society of Nigeria, not the government.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}