{
  "id": "topic_5474465",
  "title": "God bless u",
  "author": "God bless u",
  "created_time": "November 17, 2023, 03:52:54 PM",
  "content": "What Happened:  Scam/Phishing Aptos airdrop siteFake Website:Code:https://aptscommunity.com/Real Website:https://aptoslabs.com/Whois information Code:Expires On2024-11-17Registered On2023-11-17Updated On2023-11-17Name Serversmonroe.ns.cloudflare.com162.159.38.153steven.ns.cloudflare.com162.159.44.17Kindly report it AbuseReportWhats happened:I was searching for new airdrops in the twitter and after scrolling down for some minutes I found above site. Aptos airdrop ended in the past. First I thought that it may be new round airdrop. I opened site and there is option of checking airdrop. when I clicked its ask for connect wallet and surprisingly Metamask connect option is also available. I checked domain name in whois . Website is just created today.  I doesn't connect my wallet because I has been told that never connect wallet to the new site for airdrop and I followed senior and survived.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474465",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "November 17, 2023, 09:02:23 PM",
      "body": "Quote from: God bless u on November 17, 2023, 03:52:54 PMI doesn't connect my wallet because I has been told that never connect wallet to the new site for airdrop and I followed senior and survived.I'll go one up and say never connect your wallet to any third party. The essence of using a non custodian wallet is preventing other parties from accessing your wallet. Airdrops are majorly scams which steal your funds or privacy and gives you worthless tokens in return, avoiding them means prioritizing your security. If you must use them, create a new wallet which you do not use for any personal transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God bless u",
      "created_time": "November 18, 2023, 09:36:03 AM",
      "body": "Quote from: Upgrade00 on November 17, 2023, 09:02:23 PMQuote from: God bless u on November 17, 2023, 03:52:54 PMI doesn't connect my wallet because I has been told that never connect wallet to the new site for airdrop and I followed senior and survived.I'll go one up and say never connect your wallet to any third party. The essence of using a non custodian wallet is preventing other parties from accessing your wallet. Airdrops are majorly scams which steal your funds or privacy and gives you worthless tokens in return, avoiding them means prioritizing your security. If you must use them, create a new wallet which you do not use for any personal transaction.I am using new wallet for airdrop which I connect with Galxe, Taskon and some other airdrop sites. I am holding just fee for collecting NFTs and OAT which is one condition for eligibility of the airdrops. I have not received any big reward from free airdrop. I watched videos where Youtubers got a big airdrop from by doing some sample tasks. I am following them just with thinking that maybe I also get it. I am following safety precautions also whenever I join any task",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "November 18, 2023, 11:26:43 AM",
      "body": "The site has been reported for phishing.It's good that you didn't connect your wallet, basically I'm suspicious of all the airdrops that ask participants to connect their wallet, they can just ask for the address and then send the airdrop to the address without connecting the wallet.These sites have become very popular in the recent period, especially those that use the names of big airdrops because they are tempting to victims, so the wallet should not be connected to any site for these airdrops.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gladitorcomeback",
      "created_time": "November 18, 2023, 05:11:05 PM",
      "body": "Good catch OP, I have also reported this bloody scam sites and hope Godaddy will take action soon. unfortunately the website is still live and there is no google chrome warning which is dangerous and site designing is looking so official. Hackers are active everywhere. today I asked for help in exchange telegram group and in 5 minutes I received messages from fake account pretending to be admin of exchange. We have to be very careful in online field and should not allow scammers to scam us.You done a great job by not connecting your wallet otherwise this site would drain your wallet. I recommend you to use wallet guard extension which will show you what will happen to your wallet if you allow sign or connect wallet.. scammer usually using hidden fee promt which we approve and our wallet become empty. This extension will show you what changes will be happen, how much fee will be charged. Wallet Guard",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "November 18, 2023, 07:17:28 PM",
      "body": "I am just curious: are forum users still running behind the Airdrop scam? I mean, Airdrop is totally a scam; it doesn't matter if you get worthless tokens or compromise your wallet through fake links. At the end of the day, you are a loser. You are spending your time and getting nothing. I will advise you to just stay away from airdrops, so you don't need to identify fake or real airdrops. Keep in mind that nothing is free in the world; you have to lose something when you want to get something free. Anyway, thanks for sharing the phishing site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "November 19, 2023, 10:40:27 PM",
      "body": "Good catch, as far I know, GoDaddy is very quick to response to this kind of complaints. Did my part already,In any case that this is not address by GoDaddy, I know someone inside that company, maybe I will try to reach to him and tell that there is a phishing site using their company. But let's wait first and again, as I have said, they are fast so let's hope that this is still the case.Quote from: The Cryptovator on November 18, 2023, 07:17:28 PMI am just curious: are forum users still running behind the Airdrop scam? I mean, Airdrop is totally a scam; it doesn't matter if you get worthless tokens or compromise your wallet through fake links. At the end of the day, you are a loser. You are spending your time and getting nothing. I will advise you to just stay away from airdrops, so you don't need to identify fake or real airdrops. Keep in mind that nothing is free in the world; you have to lose something when you want to get something free. Anyway, thanks for sharing the phishing site.Yeah, but still there are a lot of gullible users, maybe newbie in the world of crypto and they think that airdrops is still a thing even in 2023. And there could still be legitimate airdrops out there, but not the kind of money that it used to be way back in 2017 wherein airdrop is really worth something.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "November 20, 2023, 10:11:14 PM",
      "body": "Quote from: Kemarit on November 19, 2023, 10:40:27 PMYeah, but still there are a lot of gullible users, maybe newbie in the world of crypto and they think that airdrops is still a thing even in 2023. And there could still be legitimate airdrops out there, but not the kind of money that it used to be way back in 2017 wherein airdrop is really worth something.However, there are still promising airdrops, but they are rare, not like in 2017, of course. Have you heard of Arbitrum or Optimism airdrops? Participating in projects with their own blockchain and ecosystem might be worth it in the end. However, if airdrop hunters lack sufficient experience, they may fall victim to any phishing sites. Also, participating in these airdrops is not guaranteed now because the project owners may not release airdrops for early participants later. Experience, knowledge, and conducting research are effective weapons, as without them, the capital of any beginner remains at significant risk.As for the phishing site mentioned by the OP, thousands like it have been found, so it is everyone's responsibility to report and increase awareness among beginners.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "November 20, 2023, 10:46:38 PM",
      "body": "Oh no!I don't like airdrop and free tokens it's very bad and dangerous can easily compromised your wallet especially if you are not aware of the effect before joining airdrop, you tends to loose what you can't even achieve from the airdrop campaign joined. So newbie should be aware and source for the official website of any airdrops they are about to join otherwise their wallet will get phished and they will lost valuable.The best is to stay away from airdrop campaign to avoid any hacked and phishing site, do not always go for free money because those people who are giving out such amount of money are always wanting something back as a return.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "November 21, 2023, 07:31:13 PM",
      "body": "Quote from: God bless u on November 18, 2023, 09:36:03 AMI have not received any big reward from free airdrop. I watched videos where Youtubers got a big airdrop from by doing some sample tasks. I am following them just with thinking that maybe I also get it.Don't be deceived by what YouTubers display out there now. That golden era where people got appreciable rewards from airdrops has gone. That was the 2016–2017 era. I was a crypto rookie when that was happening and couldn't understand what was going on. Well, there was that killing ETH gas fee then and there were only a few exchanges where to sell off those tokens then. Most of those airdropped tokens never lasted. They got \"rugpulled\" as soon as they got listed on some unpopular exchanges. Some of those exchanges were co-owned by those projects and that made it very easy for them to cash out. It was the same way we had merry days with faucets but all that don't attract much interest this day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God bless u",
      "created_time": "November 22, 2023, 01:50:23 PM",
      "body": "Quote from: Mpamaegbu on November 21, 2023, 07:31:13 PMQuote from: God bless u on November 18, 2023, 09:36:03 AMI have not received any big reward from free airdrop. I watched videos where Youtubers got a big airdrop from by doing some sample tasks. I am following them just with thinking that maybe I also get it.Don't be deceived by what YouTubers display out there now. That golden era where people got appreciable rewards from airdrops has gone. That was the 2016–2017 era. I was a crypto rookie when that was happening and couldn't understand what was going on. Well, there was that killing ETH gas fee then and there were only a few exchanges where to sell off those tokens then. Most of those airdropped tokens never lasted. They got \"rugpulled\" as soon as they got listed on some unpopular exchanges. Some of those exchanges were co-owned by those projects and that made it very easy for them to cash out. It was the same way we had merry days with faucets but all that don't attract much interest this day.My own cousins get more  than 10k$ in front of me and you are saying that Airdrop ear is gone. You confused me now because I joined many airdrops and also make transaction in some new chains for airdrops. My own cousins get 3k$ from Arbitrum airdrop, 1000$ from Aptos and also 3k from SUI token in the last 2 years. My other friends also get more than 2k in the last 2 years.I am using new wallet when I join any airdrop. I think Airdrop Era is not gone and might be you have not joined any airdrop for many years which is the reason you completely ignoring the value of airdrop. I think, I should use all safety precautions and then join all compaign. I hope I will also get airdrop which will fulfill my small dreams.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "November 23, 2023, 04:48:53 AM",
      "body": "Quote from: God bless u on November 22, 2023, 01:50:23 PMQuote from: Mpamaegbu on November 21, 2023, 07:31:13 PM~snipped~My own cousins get more  than 10k$ in front of me and you are saying that Airdrop ear is gone. You confused me now because I joined many airdrops and also make transaction in some new chains for airdrops. My own cousins get 3k$ from Arbitrum airdrop, 1000$ from Aptos and also 3k from SUI token in the last 2 years. My other friends also get more than 2k in the last 2 years.You should've been in cryptos during the years I mentioned, perhaps you would've understood my comment better. By the way, those airdrops you mentioned didn't happen this year. You can check two years ago and what's happening now to reflect on what happened during the era I alluded to. I ain't saying people don't get anything at all off airdrops now, what I'm saying is that it's going down in benefit.QuoteI am using new wallet when I join any airdrop.If you use separate wallet for every airdrop you participate in, it means you're going to mess something up somewhere along the line. You will also have a complete notebook for jotting your numerous passphrases. It's a bore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}