{
  "id": "topic_5503691",
  "title": "Accardo",
  "author": "Accardo",
  "created_time": "July 21, 2024, 06:03:21 PM",
  "content": "Questions about Bitcoin inheritance and what happens to our bitcoin when we are gone isn't new. But the solution to this isn't satisfying, including the idea of Bitcoin inheritance services, that is gaining traction in the cryptocurrency market. While their ideas of introducing vaults and the use of multisig wallets in the platforms are all great. The need to pay about $2,100 a year is quite much for a person who needs to trust a platform with their bitcoin when they're gone. What if the site drops dead before the coin owner dies? If eventually the person can recover their assets the service fee would be a big loss. On a scale of 40 years interval the service fee would be quite enough for someone to inherit it.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5503691",
  "comments": [
    {
      "author": "Stalker22",
      "created_time": "July 21, 2024, 07:28:37 PM",
      "body": "$2100 a year seems crazy high for what is basically a custodian with a fancy name.  I mean, shoot, you could just make one of those multisig wallets with a couple trustworthy folks and save a boatload.  And if you ask me, not relying on one platform that might go belly up down the road seems smarter.   Im not saying its a bad service or nothing.  But that sticker price - sheesh! With a DIY setup youd keep more cash in your pocket rather than forking it over to some company.  Know what I mean? Id pass if it were me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "July 21, 2024, 07:44:25 PM",
      "body": "You can hold bitcoin in a trustless way. I do not have to pay inheritance service providers before I can use a good and secure way for my bitcoin inheritance process. My hire would know what bitcoin is very well and I can go for time lock which I think is the best. I can cancel the transaction and make another one at anytime and set another time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "July 21, 2024, 07:50:42 PM",
      "body": "Maybe it's time to start this type of business? How much does it cost to set up a multisig wallet? Let's say I'd offer this to someone, I'd probably build a vault somewhere on my property that would be an elevated concrete building with no electricity, no flammables anywhere near, blast doors and that would contain all the private keys to people's wallets engraved on metal plates. Realistically that place would be indestructible. All that's left is to make sure there's at least 3 people that know about the building and how to access records, in case I die in a car crash or something and you're telling me that I could get $2k a year for that per key stored? Crazy. I'd be able to make it worth my time for half the price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alani123",
      "created_time": "July 21, 2024, 07:55:07 PM",
      "body": "You can use multisig with a lawyer or a notary public and skip the entire process of relying on a service of a platform that might go down. Under many jurisdictions the state can hold secure inheritance documents for you. So long as you explain to the receiving party that their BTC will be free with their part of the signature that they must keep secure, it's all good. This process can be made more decentralized than relying on a proprietary platform. If you don't want you don't have to involve the state either. Just find a way to release a signature upon death. Certainly the more traditional methods other than online services seem more trustworthy to me. We've been doing wills for centuries for instance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "July 21, 2024, 08:19:55 PM",
      "body": "Why not just teach your children while you are still alive and let them know you have coins to access when something happens? Just let them know you own this much of coins and then make sure they can enjoy the inheritance. I think you would agree to this rather than entrusting your coins to a lawyer who could betray them the first chance they get. For me, I would rather give them their share and only make them inherit the real properties and businesses. It's more convenient. It's possible to have an extra phone where they can open it when they scan their face and this phone has a wallet in there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "July 21, 2024, 09:32:03 PM",
      "body": "Quote from: Accardo on July 21, 2024, 06:03:21 PMQuestions about Bitcoin inheritance and what happens to our bitcoin when we are gone isn't new. But the solution to this isn't satisfying, including the idea of Bitcoin inheritance services, that is gaining traction in the cryptocurrency market.  Are there such services? although I don't think that they're thriving or gaining traction because if they're going to be like that, there's a trust issue regarding these services IMHO.Quote from: Accardo on July 21, 2024, 06:03:21 PMWhile their ideas of introducing vaults and the use of multisig wallets in the platforms are all great. The need to pay about $2,100 a year is quite much for a person who needs to trust a platform with their bitcoin when they're gone. What if the site drops dead before the coin owner dies? If eventually the person can recover their assets the service fee would be a big loss. On a scale of 40 years interval the service fee would be quite enough for someone to inherit it. That's the risk there and even the platform becomes dead or out of service, the very person who handles all of these might runaway with their customer's money. That retaining or service fee isn't worth it at all, start teaching your kids and wives/husbands about Bitcoin and how to keep their wallets safe and instruct them how they'd get their inheritance through your holdings once you're gone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "July 21, 2024, 09:42:23 PM",
      "body": "Quote from: _act_ on July 21, 2024, 07:44:25 PMYou can hold bitcoin in a trustless way. I do not have to pay inheritance service providers before I can use a good and secure way for my bitcoin inheritance process. My hire would know what bitcoin is very well and I can go for time lock which I think is the best. I can cancel the transaction and make another one at anytime and set another time.Indeed, one can hold Bitcoin and be able to use the time lock feature.  Aside from that, having a third party service to use to keep one's Bitcoin may produce trouble in the future.  One is the what if of the service shutting down before the need for it come.  Second, we use Bitcoin because we wanted to have full control of our funds, why would we entrust our holdings to other people?  This is no difference from services available for fiat.  The possibility of identity problem will also possible to occur in the future.  So why do we have to undergo this difficulty and pay too much money to give our heir a huge problem in the future?  And I think the annual service charge stated by @OP is too high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "July 21, 2024, 09:58:12 PM",
      "body": "Quote from: alani123 on July 21, 2024, 07:55:07 PMThis process can be made more decentralized than relying on a proprietary platform. If you don't want you don't have to involve the state either. Just find a way to release a signature upon death. Certainly the more traditional methods other than online services seem more trustworthy to me. We've been doing wills for centuries for instance. I agree with this opinion, we can all agree about the anonymous nature of bitcoin but once the assets in question is stored for special cases like the inheritance we are talking about, someone needs to be trusted with the keys or seed phrase of the wallet, and the best bet is to put into death will like the traditional way of sharing properties. I believe with the current adoption of the bitcoin they will get to the knowledge of it themselves and know how to go about. One can add a security feature like the lock time script and set out a time that you feel your inheriting person can come of age. The lock script will protect it to the certain period of time and only the seed phrase or key needs to be protected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Casdinyard",
      "created_time": "July 21, 2024, 10:30:53 PM",
      "body": "Quote from: Accardo on July 21, 2024, 06:03:21 PMQuestions about Bitcoin inheritance and what happens to our bitcoin when we are gone isn't new. But the solution to this isn't satisfying, including the idea of Bitcoin inheritance services, that is gaining traction in the cryptocurrency market. While their ideas of introducing vaults and the use of multisig wallets in the platforms are all great. The need to pay about $2,100 a year is quite much for a person who needs to trust a platform with their bitcoin when they're gone. What if the site drops dead before the coin owner dies? If eventually the person can recover their assets the service fee would be a big loss. On a scale of 40 years interval the service fee would be quite enough for someone to inherit it.  For me, not so much. Call me selfish or whatever but I'm not building wealth right now just so someone else can enjoy it when I die. Don't get me wrong, I'm still putting money in the bank for \"future generations\" to have something, and I have a couple of properties that they can use so it's not like I'm leaving them with nothing, but the fact of the matter is that I have this money right now for me to enjoy and spend. So in that regard, the concept of bitcoin inheritance isn't something that I trouble myself with. But even if I do look into the options to have someone else effectively inherit my shit, I wouldn't get into these inheritance programs that you're talking about, especially if it's just going to cost me even more money in the process. I'd rather just hold the coins on an airlocked computer and give the pass phrases to my kids/grandkids when I'm about to die than risk getting my money tampered or stolen in the process of securing it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "July 22, 2024, 11:32:32 AM",
      "body": "Personally, I don't buy the idea of using any third-party service to give my bitcoins to my children. For the multiple times that this topic has been discussed here, my opinion has always remained the same, which is that I will only hold my coin in a cold wallet and I will keep a trace of how my family can get access to my crypto asset when I pass it on. Some rich people don't even want their kids to know about some of their investments when they are alive, but they will keep some trace of how their children can get access to those investments after they die. So, that's the approach I will take towards my Bitcoin investment. I will keep trace to how they can access my wallet and how they can share the asset.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "July 22, 2024, 12:30:41 PM",
      "body": "Quote from: Accardo on July 21, 2024, 06:03:21 PMQuestions about Bitcoin inheritance and what happens to our bitcoin when we are gone isn't new. But the solution to this isn't satisfying, including the idea of Bitcoin inheritance services, that is gaining traction in the cryptocurrency market. While their ideas of introducing vaults and the use of multisig wallets in the platforms are all great. The need to pay about $2,100 a year is quite much for a person who needs to trust a platform with their bitcoin when they're gone. What if the site drops dead before the coin owner dies? If eventually the person can recover their assets the service fee would be a big loss. On a scale of 40 years interval the service fee would be quite enough for someone to inherit it. I don't know the custodian or inheritance services that charge such an amount to keep funds for future beneficiaries. It is only people who are rich that can afford such a high service charge. I wouldn't also risk the suggestion of keeping my money in a centralized platform. These services can go bankrupt which means, everybody will lose their funds. It will be safer to teach my heir how to use wallets. So that they can be able to retrieve my funds when I am gone. Life is unpredictable that's why I have started making moves to teach my close relatives the rudiments of the crypto space.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "July 22, 2024, 12:37:00 PM",
      "body": "This sounds to me like the same thing as storing your Bitcoins in a centralized exchange. There are better alternatives. You can choose to tell your spouse or someone you trust where they can find the private keys in the eventuality of your death. Though I personally recommend the use of timelocked transaction method. There are many threads on the subject:  [Tutorial]Making your Bitcoin Inheritable In what way you’ll inherit Bitcoin to your loved ones?When Bitcoin Must Be InheritedBitcoin inheritance Leaving Bitcoin as inheritance",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mirakal",
      "created_time": "July 22, 2024, 12:55:13 PM",
      "body": "Quote from: cabron on July 21, 2024, 08:19:55 PMWhy not just teach your children while you are still alive and let them know you have coins to access when something happens? Just let them know you own this much of coins and then make sure they can enjoy the inheritance. I think you would agree to this rather than entrusting your coins to a lawyer who could betray them the first chance they get. For me, I would rather give them their share and only make them inherit the real properties and businesses. It's more convenient. It's possible to have an extra phone where they can open it when they scan their face and this phone has a wallet in there.So far, this is the best idea for me. Don’t complicate yourself by entrusting other person your bitcoin assets when you can teach your wife or your kids early about bitcoin investment and how they will be able to access your bitcoin assets when you’re no longer around. I don’t think they won’t accept that idea knowing their future inheritance relies on it, and aside from that, now that they are more aware how bitcoin works, it’s now possible they will continue the legacy what you have started, and even grow your bitcoin assets 5x or 10x in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "July 22, 2024, 01:03:34 PM",
      "body": "I would rather teach my next of kin how to operate bitcoin wallets and how to transact, the basics and observe how they are doing it. Giving them the knowledge I have gained over this forum should be enough if they are willing to follow it.Paying an inheritance platform is something new that I am hearing, maybe I was living under a rock, but no, I would not spend on it. Our motto in bitcoin is to not spend on things that can be saved.Also in future we might see a different and simpler method of inheritance, so keep your fingers crossed for now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ranochigo",
      "created_time": "July 22, 2024, 01:06:35 PM",
      "body": "Quote from: SatoPrincess on July 22, 2024, 12:37:00 PMThough I personally recommend the use of timelocked transaction method.That's not what timelocked addresses are for. The thing about inheritance is that you should still be able to access the funds before your death and that the funds are accessible to the intended beneficiaries after. Whilst some easy scripting would allow for MultiSig with timelock, it is still a condition that doesn't account for the time of the user passes on.I don't think crypto inheritance services are necessary. Using MultiSig and putting a key in the will should be fine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "July 22, 2024, 01:48:13 PM",
      "body": "Not all inheritance platforms asking you to purchase or pay their service, someone in this forum created a site to compare each inheritance platforms, I see that the project by wizardsardine is interesting.I'm not sure if I will use inheritance platform or not, because the reason why I trust Bitcoin is due to decentralization and not trusting any third party, so it's hard to make me to trust someone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "July 22, 2024, 01:57:56 PM",
      "body": "2100 usd per year just to pay for bitcoin inheritance services? lol with that much money every year you can get more bitcoins. no need to bother thinking about inheriting bitcoin, just write your private key on paper and then you can save it in the bank and keep it safe with your lawyer, it's much easier and safer than entrusting your assets to a third party.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Questat",
      "created_time": "July 22, 2024, 02:07:28 PM",
      "body": "Quote from: TheUltraElite on July 22, 2024, 01:03:34 PMI would rather teach my next of kin how to operate bitcoin wallets and how to transact, the basics and observe how they are doing it. Giving them the knowledge I have gained over this forum should be enough if they are willing to follow it.Paying an inheritance platform is something new that I am hearing, maybe I was living under a rock, but no, I would not spend on it. Our motto in bitcoin is to not spend on things that can be saved.Also in future we might see a different and simpler method of inheritance, so keep your fingers crossed for now.In addition, while we used to believed that bitcoin promotes anonymity, then how can this be possible if we are trying to pay a third party here for the safekeeping of our coins? I do think we are only breaking our own rule here, by allowing other party to manage our bitcoin assets when we have our own family to trust and make it happen.I don’t actually support this kind of idea. Maybe for others it seems very working but for me who value my coins like how I value my family, I have to say my family should know this first before other party will have an access to my own investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoBuds",
      "created_time": "July 22, 2024, 03:36:15 PM",
      "body": "Quote from: Questat on July 22, 2024, 02:07:28 PMQuote from: TheUltraElite on July 22, 2024, 01:03:34 PMI would rather teach my next of kin how to operate bitcoin wallets and how to transact, the basics and observe how they are doing it. Giving them the knowledge I have gained over this forum should be enough if they are willing to follow it.Paying an inheritance platform is something new that I am hearing, maybe I was living under a rock, but no, I would not spend on it. Our motto in bitcoin is to not spend on things that can be saved.Also in future we might see a different and simpler method of inheritance, so keep your fingers crossed for now.In addition, while we used to believed that bitcoin promotes anonymity, then how can this be possible if we are trying to pay a third party here for the safekeeping of our coins? I do think we are only breaking our own rule here, by allowing other party to manage our bitcoin assets when we have our own family to trust and make it happen.I don’t actually support this kind of idea. Maybe for others it seems very working but for me who value my coins like how I value my family, I have to say my family should know this first before other party will have an access to my own investment.I've said this before, I really don't understand why we can trust third parties, lawyers...people we don't know but we can't trust our wives and children? I find we often advise each other not to share our bitcoin investments with anyone, including family members, to ensure privacy and safety. But the irony is that now we not only want to disclose our investments to others but even entrust our bitcoins to them to manage. This was a really bad idea, I chose to teach my family bitcoin instead and I did this for a long time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}