{
  "id": "topic_5448041",
  "title": "Fiatless",
  "author": "Fiatless",
  "created_time": "April 08, 2023, 01:14:08 PMLast edit: April 08, 2023, 01:28:54 PM by Fiatless",
  "content": "I want to apologize for writing about an area of Bitcoin that I know little about. From what I have gathered so far Bitcoin miners are attracted to places that have constant but cheap electricity supply, favorable government policies, security, less pollution, and accessible quality infrastructures. Cheap and uninterrupted power supply increases the chances of making profit, friendly government policies and security determine the longevity of the business, clean and green environment reduces the effect of mining emissions and quality infrastructures make the miners and their families live good lives in a particular location. All African nations might not have these qualities but some possess them. I want to state a few reasons why miners should consider Africa.Humanitarian Grounds: If Bitcoin miners focus only on profit taking, Africa might be the least continent to consider to locate your mining firm. But if your goal is to make a profit and also help to improve the standard of living of Africans, then it is the best location. Africa needs help because of so many negative factors. Like the case of  Gridless  a company that started a bitcoin mining project by tapping into 50 kilowatts (kW) clean, stranded and excess hydro energy in Malawi. This Bitcoin mine has brought economic empowerment and job opportunities and 1,600 households connected to this mine have constant power supply. Another company  SustainSolar, Earth Wind and Power and INENSUS saw the opportunity to use what would have been otherwise wasted energy to support crypto mining and in the process generate electricity to process high-value agricultural crops such as vanilla and BEC in rural Uganda; and yield many socio-economic benefits for the surrounding farming community.Friendly Government Policies: Only four African countries have absolutely banned Bitcoin operation in their jurisdiction which includes  Morrocco , Tunisia, Egypt, and Algeria. Some African nations don’t have any laws that prevent or approve mining activities. Many countries in Africa will be willing to welcome miners because they desperately need revenue from the tax.  So, mining activities will be welcomed in Africa as long as you pay your tax. Relatively cheap electricity: African countries are among the nations that have cheap electricity costs. According to  Statista  a firm that analyses the power consumption of countries, out of 30 nations that have the cheapest power four African countries made the list which includes Rwanda (8th), Kenya (15th), South Africa (15th), and Nigeria (27th). Africa has a lot of sunlight to power solar, many rivers or water bodies for hydroelectric power, and several abandoned power projects that can be revamped.  Security: Africa has always been a continent characterized by wars and political conflicts. In some of these nations, there is a high rate of crime. But this narrative is changing because many African nations are become politically stated and security friendly. African nations might not be among the first twenty safest countries but their rating has consistently improved  Mauritius is the 28th safest country in the world, Ghana is the 40th, Gambia 45th and Botswanan 48th. Infrastructures: Some African nations are investing heavily in infrastructural development. An example is  Seychelles , a tropical island in the East of Africa which 100% of the population has access to electricity while 98% has unhindered access to drinking water. The country has 247 internet service providers and with the lowest population in Africa, the country still has 14 airports spread across its many cities. It has good roads, a quality health system, and well-planned cities. Other countries like  Mauritius , Ghana, South Africa and São Tomé and Príncipe all have basic facilities that will be of great interest to bitcoin miners. Friendly people: 80% of Western experts and local business leaders interviewed by  How we made it in Africa  confirmed that the best thing about the African country in which they operate is the people, along with its geographical beauty. According to the  InterNations  report, East African country received the highest marks for friendliness. More than 57% of experts in Uganda gave ‘general friendliness’ the best possible rating (the global average was 26%) and not a single respondent ranked this factor negatively. African love foreigners and treat them with love and respect. It will not be bad for some interested bitcoin miners to marry Africans because they are wonderful people.As I said before, Africa might not be a perfect place to mine bitcoin but it could be a place to consider because things are changing for the better and we also need the support of bitcoin miners.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448041",
  "comments": [
    {
      "author": "hZti",
      "created_time": "April 08, 2023, 06:22:07 PM",
      "body": "Very good overlook on the situation and I think stuff like this is always appreciated by the community. What I think would be of high interest by others investors, would be to see if there are already successful bitcoin projects in Africa, and see how they go. What investors always fear is to invest into something where they can not calculate the risk. Afrika seems to be in many areas a continent where the risk can hardly be calculated. If you however give examples on companies that already do buisness there than you can take this into account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "April 08, 2023, 09:35:55 PM",
      "body": "This would be more enticing if Africa offers the cheapest electricity but placing in 8th 15th and 27th is somehow way more expensive than mining on the ranked 1st to 7th.  In terms of government regulation, it is not an assurance that a country will be friendly if they don't have any law about crypto mining activities.  Anytime this country can turn hostile if its leader somehow thinks that crypto miners are depleting their natural resources.  If that time comes then a company that took advantage of the unregulated stance of many countries of Africa may have suffered huge losses.Some of the African places today may be good as an alternative places for crypto mining but their unregulated stance is worrisome, especially in these three stated locations where the electricity is cheapest in that region.  According to the information on the internet Rwanda (the one that is ranked 8th in cheap electricity) deemed cryptocurrency as illegal[1]Kenya's stance on cryptocurrency is somehow vague,. They do not have any regulatory law but somehow propose a bill to tax crypto[2]Although South Africa is crypto friendly, they also don't have any regulatory law on cryptocurrency while the Nigeria government is somehow hostile to cryprocurrency due to them favoring CBDC, they somehow have not tagged cryptocurrency as illegal yet.  In order to have an attractive place to set up Bitcoin mining, the stated factors by the OP should be met by the place where the mining farm is targeted.  Patching good information about Africa that appears in different places is not convincing at all especially each places has their own government and leaders.[1] https://freemanlaw.com/cryptocurrency/rwanda/[2] https://www.coindesk.com/policy/2022/11/21/kenya-proposes-bill-to-tax-crypto/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Casdinyard",
      "created_time": "April 10, 2023, 06:07:21 PM",
      "body": "I agree, as someone living in a third world country as well, too many opportunities are getting overlooked due to the poor living conditions in the country, add to this the negative preconceptions that they carried with them from their households, If they learn to get past that, I would bet my money that they'd make a killing here and in Africa, bitcoin mining or not. As for crypto mining regulations, I do think the continent is not in the position to issue cease and desist orders in these mining entities/firms, especially if they help promote African Tourism and therefore jumpstart Africa's economy. The only thing that these people are a little wary of is the security, standard of living, and of course quality of basic human necessities. Mining is still one of those industries that need a lot more time to gain traction, I suppose that if we give S.Africa more time to recuperate and build its own reputation, enough people will be able to realize the benefits of mining in Africa and therefore will come flocking towards the continent to make home of and mine not diamonds, but bitcoin this time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "April 10, 2023, 06:52:38 PM",
      "body": "Op I appreciate you for this statistics and the good information given to the world. Africa is a good continent to invest on mining business. We really needs mining experts to come and mine in Africa. Africa is also blessed with natural resources which can be used for the Mining plants. Some of such resources has been mentioned by the OP like, Seas, And Rivers, Waste, Crude oil and sun which can be used to to generate electricity. In the area of mining, electricity is the major factor and the aspect of electricity has been tackle then every other things become secondary. Op once again thank you for this awareness.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "April 10, 2023, 07:04:57 PM",
      "body": "It all comes down to money!If things would have been that great for mining in Africa people would have moved there and not flocked to Texas or Canada or Russia or... the list goes on.But yeah the first paragraph says it all, if you want to take a chuck of your profits and give it away, have a lower profit margin and you're interested more in the regional impact of your business, yeah, do it. But, you need the money to do that! And money ain't cheap!  A few things about :Quote a firm that analyses the power consumption of countries, out of 30 nations that have the cheapest power four African countries made the list which includes Rwanda (8th), Kenya (15th), South Africa (15th), and Nigeria (27th).LE: The link you've posted shows Rwanda at 25 cents/kwh, it's completely the opposite, these are the most expensive, 25c/kwh is a no-go!This would make the next paragraph I've written a bit inaccurate!Rwanda consumes 527.30 million kWh  a year, that's around 20k S19, so around 0.66% of the global hashrate in perfect optimization.Just having cheap electricity doesn't mean they have the capacity to power any large operations without making others run out of power.Not quoting everything since it look like a mess now with that change in c/kwh but look how you're giving the examples:- cheap electricity: Rwanda (8th), Kenya (15th), South Africa (15th), and Nigeria- security Mauritius  is the 28th safest country in the world, Ghana is the 40th, Gambia 45th and Botswanan 48th.Now if I were to look at what you mentioned before, Rwanda is 72, Kenya 120, RSA 118, and Nigeria 143.You can't just go and pick each of the best ones whenever it suits you based on one factor, everyone would want cheap energy as in Norway and taxes as low as in Malta, but, you simply can't have them all.That being said, probably a few of the African countries are far more attractive than the whole of Europe right now, to what level they can compete with the cheap power and infrastructure available in the US or Russia, that is a thing to be seen, although I wouldn't get my hopes that high for further decentralization of mining farms.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kano",
      "created_time": "April 10, 2023, 10:02:49 PM",
      "body": "Ping times to jo-burg from europe were terrible when I had a node down there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "April 10, 2023, 11:58:59 PM",
      "body": "Given that mining profitability is very dependent on the cost of electricity. I just see about 4 countries you have mentioned. Africa has over 50 countries if I recall well, where are the rest? Or is mining going to happen in only 4 countries in the whole continent?Solar energy makes much more sense as a backup option, but not running full-time. There might be a lot of Sunlight in the Sahara and Sub Saharan areas, but don't forget the unpredictable weather in the tropics. Importing solar equipment from Europe, the US or Asia might also be very expensiveNow, I doubt if there are any mining gear manufacturers based in Africa, so importing the mining will also likely double the cost of investment. We all know shipment fees and custom taxes can be very exorbitant",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "April 11, 2023, 04:15:21 AM",
      "body": "Quote from: kano on April 10, 2023, 10:02:49 PMPing times to jo-burg from europe were terrible when I had a node down there.alas, ping times are directly related to the distance, Johannesburg is in South Africa, it's the furthest point in Africa from Europe,  half of Africa is closer to the EU than the east part of U.S, EU is closer to the majority of African countries than to the western part of the U.S, a random example would be ping from Lagos to London, which averages below 100ms, a much better result than most other locations in respect to London.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "April 11, 2023, 04:28:00 AM",
      "body": "I think there is people willing to mine on bitcoin there but it not just about cheap electricity although is be one of a lot of consideration too Like internet speed, reliability of power and regulation on bitcoin mining oh also the source of electricity since some people believe bitcoin mine on dirty energy would be great if the energy comes from renewable source",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Newbie.",
      "created_time": "April 11, 2023, 06:06:18 AM",
      "body": "One thing that really stood out to me is the friendly people of Africa. It's so important to have a welcoming and supportive community when setting up a business, and it sounds like African nations have a lot to offer in that regard.I think it's great to consider all the factors when deciding where to mine Bitcoin, and Africa definitely seems like a promising option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kano",
      "created_time": "April 11, 2023, 01:36:37 PM",
      "body": "Quote from: mikeywith on April 11, 2023, 04:15:21 AMQuote from: kano on April 10, 2023, 10:02:49 PMPing times to jo-burg from europe were terrible when I had a node down there.alas, ping times are directly related to the distance, Johannesburg is in South Africa, it's the furthest point in Africa from Europe,  half of Africa is closer to the EU than the east part of U.S, EU is closer to the majority of African countries than to the western part of the U.S, a random example would be ping from Lagos to London, which averages below 100ms, a much better result than most other locations in respect to London.However, which of these have high quality high reliability data centres?AWS only has Cape Town,Azure only has Cape Town and Johannesburg,Google only has Johannesburg,Vultr only has Johannesburg...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serveria.com",
      "created_time": "April 11, 2023, 09:54:23 PM",
      "body": "Quote from: Fiatless on April 08, 2023, 01:14:08 PMI want to apologize for writing about an area of Bitcoin that I know little about. From what I have gathered so far Bitcoin miners are attracted to places that have constant but cheap electricity supply, favorable government policies, security, less pollution, and accessible quality infrastructures. Cheap and uninterrupted power supply increases the chances of making profit, friendly government policies and security determine the longevity of the business, clean and green environment reduces the effect of mining emissions and quality infrastructures make the miners and their families live good lives in a particular location. All African nations might not have these qualities but some possess them. I want to state a few reasons why miners should consider Africa.Humanitarian Grounds: If Bitcoin miners focus only on profit taking, Africa might be the least continent to consider to locate your mining firm. But if your goal is to make a profit and also help to improve the standard of living of Africans, then it is the best location. Africa needs help because of so many negative factors. Like the case of  Gridless  a company that started a bitcoin mining project by tapping into 50 kilowatts (kW) clean, stranded and excess hydro energy in Malawi. This Bitcoin mine has brought economic empowerment and job opportunities and 1,600 households connected to this mine have constant power supply. Another company  SustainSolar, Earth Wind and Power and INENSUS saw the opportunity to use what would have been otherwise wasted energy to support crypto mining and in the process generate electricity to process high-value agricultural crops such as vanilla and BEC in rural Uganda; and yield many socio-economic benefits for the surrounding farming community.Friendly Government Policies: Only four African countries have absolutely banned Bitcoin operation in their jurisdiction which includes  Morrocco , Tunisia, Egypt, and Algeria. Some African nations don’t have any laws that prevent or approve mining activities. Many countries in Africa will be willing to welcome miners because they desperately need revenue from the tax.  So, mining activities will be welcomed in Africa as long as you pay your tax. Relatively cheap electricity: African countries are among the nations that have cheap electricity costs. According to  Statista  a firm that analyses the power consumption of countries, out of 30 nations that have the cheapest power four African countries made the list which includes Rwanda (8th), Kenya (15th), South Africa (15th), and Nigeria (27th). Africa has a lot of sunlight to power solar, many rivers or water bodies for hydroelectric power, and several abandoned power projects that can be revamped.  Security: Africa has always been a continent characterized by wars and political conflicts. In some of these nations, there is a high rate of crime. But this narrative is changing because many African nations are become politically stated and security friendly. African nations might not be among the first twenty safest countries but their rating has consistently improved  Mauritius is the 28th safest country in the world, Ghana is the 40th, Gambia 45th and Botswanan 48th. Infrastructures: Some African nations are investing heavily in infrastructural development. An example is  Seychelles , a tropical island in the East of Africa which 100% of the population has access to electricity while 98% has unhindered access to drinking water. The country has 247 internet service providers and with the lowest population in Africa, the country still has 14 airports spread across its many cities. It has good roads, a quality health system, and well-planned cities. Other countries like  Mauritius , Ghana, South Africa and São Tomé and Príncipe all have basic facilities that will be of great interest to bitcoin miners. Friendly people: 80% of Western experts and local business leaders interviewed by  How we made it in Africa  confirmed that the best thing about the African country in which they operate is the people, along with its geographical beauty. According to the  InterNations  report, East African country received the highest marks for friendliness. More than 57% of experts in Uganda gave ‘general friendliness’ the best possible rating (the global average was 26%) and not a single respondent ranked this factor negatively. African love foreigners and treat them with love and respect. It will not be bad for some interested bitcoin miners to marry Africans because they are wonderful people.As I said before, Africa might not be a perfect place to mine bitcoin but it could be a place to consider because things are changing for the better and we also need the support of bitcoin miners.Very nice review, from what I've heard from people trying to start a mining operation in Africa mostly they were struggling with issues like high crime, political instability, corruption and unstable power supply. Africa has huge potential, but is not ready to host any significant mining farms at the moment. Please change my mind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sashapan",
      "created_time": "April 11, 2023, 10:00:28 PM",
      "body": "I think in Africa a lot of electricity will be used to cool video cards) the colder the country, the lower the electricity costs",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "April 12, 2023, 12:47:26 AM",
      "body": "Quote from: kano on April 11, 2023, 01:36:37 PMHowever, which of these have high quality high reliability data centres?As far as the topic at hand is concerned, you don't need a data center to mine Bitcoin, many mining farms do exist in Africa, they face many issues but internet connection is not one of them.Power infrastructure is the main concern, whatever Statista has to say about how cheap electricity is in Africa is pretty much far from accurate, power is cheap in most African countries because it's subsidized, and even the oil-rich countries don't own enough petroleum refineries, so the cost of electricity is pretty on the high end even for those countries, and since it's subsidized, it's pretty limited, many countries don't produce anything above 5000-10000MW worth of power, Africa as-is is a terrible place for any large mining operation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MinMan",
      "created_time": "April 12, 2023, 06:56:50 PM",
      "body": "Considering how the profitability in Bitcoin mining depends on running heavy equipment 24/7 and the probability of mining a valid block is decreasing with time and it's getting more difficult to earn much profit from mining, the very first thing for a Bitcoin mining firm is obviously having cheap and always available electricity supply.African countries that you mentioned which made it in the list of cheap electricity-providing countries aren't close to the top 5 nations, so I wonder why would a mining firm choose a country positioned at number 8 or above instead of choosing one from the top.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "April 13, 2023, 01:33:00 PM",
      "body": "Quote from: sashapan on April 11, 2023, 10:00:28 PMI think in Africa a lot of electricity will be used to cool video cards) the colder the country, the lower the electricity costs Not only that but you also can not really use the heat for other purposes. If you own a warehouse in Siberia you can have a mining section somewhere in a corner and as a side effect your warehouse is heated for free. This will sadly not work in Africa and also cooling water etc will be more challenging.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "April 18, 2023, 09:30:45 AM",
      "body": "I totally agree with OP. It's great to see how Bitcoin mining can make a positive impact on the standard of living in African communities. It's true that some African nations may not have all the ideal conditions for mining, but things are changing for the better. I think it's important to consider the humanitarian aspects of mining, not only economic, and strive for a positive impact on the communities in which mining operations are located.Quote from: hZti on April 13, 2023, 01:33:00 PMQuote from: sashapan on April 11, 2023, 10:00:28 PMI think in Africa a lot of electricity will be used to cool video cards) the colder the country, the lower the electricity costs Not only that but you also can not really use the heat for other purposes. If you own a warehouse in Siberia you can have a mining section somewhere in a corner and as a side effect your warehouse is heated for free. This will sadly not work in Africa and also cooling water etc will be more challenging.Totally get what you're saying! Using the heat generated from mining to warm up a warehouse like in Siberia might not be as feasible in Africa. The hot temperatures there don't really lend themselves to that kind of setup. And yeah, cooling can be a challenge too, especially with water scarcity in some areas. But hey, there are still ways to repurpose the heat for things like hot water in hotels or hospitals, with some cool techniques like immersion cooling. After all, heat is just another form of energy that can be harnessed and converted into other forms of energy and used for various purposes. It's all about finding creative solutions and making the most of what's available, right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aikidoka",
      "created_time": "April 18, 2023, 08:23:53 PM",
      "body": "Quote from: FatFork on April 18, 2023, 09:30:45 AM~snip~After all, heat is just another form of energy that can be harnessed and converted into other forms of energy and used for various purposes. It's all about finding creative solutions and making the most of what's available, right?Well said, the use of heat and the sun is crucial. It's possible to generate energy from heat, whether it's for making hot water to heat things like water in hotels or hospitals, as you mentioned, and/or we can use it to generate electricity with PV-panels. If you create a good project to generate electricity using solar radiation, you could obtain free electricity to power another mining project with numerous cooling equipments and anything else you might need. It would be very interesting to mine in Africa imo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "safar1980",
      "created_time": "April 28, 2023, 02:33:02 PM",
      "body": "It's hard to mine when it's 40-50 degrees Celsius outside. If only somewhere in the mountains, where it is not so hot. A lot of electricity has to be spent on cooling, and building their own stations to generate electricity. Lots of extra costs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}