{
  "id": "topic_5447378",
  "title": "tg88",
  "author": "tg88",
  "created_time": "April 03, 2023, 11:59:20 AM",
  "content": "Nos últimos dias a mineração via gpus vem passando pelo maior pico de rentabilidade desde a migração do ETH para PoS. Ocorreu uma subida sincronizada das principais moedas mineráveis via gpu atualmente: Kaspa, Nexa, RXD (Radiant), Dynex.Inclusive Kaspa está no top10 das criptomoedas que melhor performaram no primeiro trimestre deste ano.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447378",
  "comments": [
    {
      "author": "rdluffy",
      "created_time": "April 03, 2023, 01:21:21 PM",
      "body": "Ei tg88, está de campanha nova também, parceiro do Paredao agora, Parabéns!!!Que notícia boa, eu estava comentando há pouco minutos no fórum de mineração lá na Altcoins, que temos que ficar atentos para não perder o timing certo para voltar a minerar ou comprar novas placas, pois esse período dura pouco tempo e quando você vê as placas aumentam de preço, a recomensa de moedas diminui, a dificuldade aumenta...Você está fazendo mineração com mais moedas ao mesmo tempo?Eu vi que o pessoal está minerando 3 moedas e até vi um comentário de minerar 4 moedas ao mesmo tempo",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "April 03, 2023, 06:50:03 PM",
      "body": "Quote from: rdluffy on April 03, 2023, 01:21:21 PMEi tg88, está de campanha nova também, parceiro do Paredao agora, Parabéns!!!Obrigado, eu e Paredao estamos na mesma equipe agora. Estou torcendo pra ser duradouro.Quote from: rdluffy on April 03, 2023, 01:21:21 PMVocê está fazendo mineração com mais moedas ao mesmo tempo?Eu vi que o pessoal está minerando 3 moedas e até vi um comentário de minerar 4 moedas ao mesmo tempo Estou fazendo dual a um bom tempo já, minero nexa+zil ou kaspa+zil. Ziliqa já está listada na binance e possui um esquema de mineração bem interessante. A cada hora se minera um round de zil e depois volta para a mineração convencional, resumindo se perde 1 minuto ou 2 da mineração da moeda principal a cada hora mas o resultado final vale a pena. Consigo tirar uns 40 reais adicionais mensalmente.Vou dar uma olhada nesse triple mining",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "April 03, 2023, 07:00:16 PM",
      "body": "@tg88Como estas mais por dentro desta nova fase de mineração, achas que vale a pena ligar a minha 3060 Ti e minar com o NiceHash? Sinceramente, só tenho interesse em minar, se no final receber BTC. Não tenho muita paciência para andar a fazer trocas...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "April 04, 2023, 01:40:25 AM",
      "body": "Quote from: joker_josue on April 03, 2023, 07:00:16 PMComo estas mais por dentro desta nova fase de mineração, achas que vale a pena ligar a minha 3060 Ti e minar com o NiceHash? Sinceramente, só tenho interesse em minar, se no final receber BTC. Não tenho muita paciência para andar a fazer trocas...Faz alguns meses que não uso mais nicehash, mas pelo que vi eles listaram já o algoritmo kHeavyHash que seria o mesmo de Kaspa. Acho que vale a pena você fazer um teste, está rentável sim, não é muito dinheiro mas vai dar pra juntar uns satoshis a mais no fim do mes. O lado bom do nicehash é que voce consegue sacar usando a LN.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "May 27, 2023, 01:41:34 PM",
      "body": "Como está a sua mineração tg88?Ainda está conseguindo ter lucro mesmo com essa queda que teve quando o BTC atingiu 30k e agora está uns 27k?Kaspa ficou bem pior por causa das Asics entrando?Estou curioso aqui",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "May 28, 2023, 12:37:48 AM",
      "body": "Quote from: rdluffy on May 27, 2023, 01:41:34 PMComo está a sua mineração tg88?Ainda está conseguindo ter lucro mesmo com essa queda que teve quando o BTC atingiu 30k e agora está uns 27k?Kaspa ficou bem pior por causa das Asics entrando?Estou curioso aquiVoltou a ficar ruim depois do ultimo pico, ainda bem que eu aproveitei pra vender tudo na época. Atualmente nas cotações atuais de IRON estou tendo um \"prejuízo\" de 50 reais por mês mas vou seguir a estratégia por mais um ou 2 meses aguardando uma nova subida.Kaspa deixei de minerar pois a dificuldade realmente vem subindo bastante mas ainda tenho um saldo aguardando pra liquidar. Só não entraram tantos ASICS ainda na rede pois o valor deles é bem alto o  KS3 da Bitmais está sendo vendido por 49 mil dólares por exemplo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "November 23, 2024, 01:39:53 PMLast edit: November 23, 2024, 01:52:38 PM by sabotag3x",
      "body": "Você ainda está minerando @tg88?Acabei de ler uma matéria sobre uma moeda chamada ALEO que está dando lucros.Os números do WhatToMine também parecem legais.. US$ 0,45 de lucro por dia com uma RTX 3070: https://whattomine.com/gpusedit: na verdade, US$ 0,45 não é o lucro, mas o rendimento, vi errado.. com os custos de energia do Brasil, fica no negativo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "November 23, 2024, 03:54:55 PM",
      "body": "Quote from: sabotag3x on November 23, 2024, 01:39:53 PMVocê ainda está minerando @tg88?Acabei de ler uma matéria sobre uma moeda chamada ALEO que está dando lucros.Os números do WhatToMine também parecem legais.. US$ 0,45 de lucro por dia com uma RTX 3070: https://whattomine.com/gpusedit: na verdade, US$ 0,45 não é o lucro, mas o rendimento, vi errado.. com os custos de energia do Brasil, fica no negativo.Não estou mais, acabei vendendo todos os equipamentos a mais ou menos 1 ano atras e foi bom porque nesse meio tempo a mineração com gpu não está indo muito bem e na época eu comprei BTC com o dinheiro das peças então considero que foi uma decisão acertada pois hardware só teria desvalorizado e a mineração provavelmente pagaria as contas mas sobraria pouco alem de todo trabalho envolvido.Mas torço pra voltar, espero que um dia se torne rentável novamente... Tenho memórias muito boas da época de mineração de ETH, quem sabe algo grande aconteça nesse sentido e o POW via gpu de uma animada.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "November 23, 2024, 06:38:15 PM",
      "body": "Quote from: tg88 on November 23, 2024, 03:54:55 PMMas torço pra voltar, espero que um dia se torne rentável novamente... Tenho memórias muito boas da época de mineração de ETH, quem sabe algo grande aconteça nesse sentido e o POW via gpu de uma animada.Acho difícil o POW via GPU volte a ter um novo impulso. Normalmente essas coisas não tendem em repetir, pois já existe muito mais pessoas atentas, e qualquer coisa que surja nesse sentido, vai atrair muita gente e num curto espaço de tempo deixa de ser viável novamente.Talvez o ETH teve o impacto que teve, porque surgiu numa altura em que estava a mudar a mineração BTC, de GPU para ASIC. Então, muitos simplesmente direcionaram as suas GPUs para o ETH, mesmo que isso não desse lucro.Neste momento o setor já esta muito explorado nesse campo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "November 23, 2024, 09:26:02 PM",
      "body": "Quote from: joker_josue on November 23, 2024, 06:38:15 PMAcho difícil o POW via GPU volte a ter um novo impulso. Normalmente essas coisas não tendem em repetir, pois já existe muito mais pessoas atentas, e qualquer coisa que surja nesse sentido, vai atrair muita gente e num curto espaço de tempo deixa de ser viável novamente.Talvez o ETH teve o impacto que teve, porque surgiu numa altura em que estava a mudar a mineração BTC, de GPU para ASIC. Então, muitos simplesmente direcionaram as suas GPUs para o ETH, mesmo que isso não desse lucro.Neste momento o setor já esta muito explorado nesse campo.Depende muito do surgimento de uma nova moeda que seja inovadora em algum aspecto e também faça questão de manter uma base de mineradores via gpu. A ultima ocorrência foi com Kaspa mas eles não mantiveram interesse em ser ASIC resistente e hoje é dominada por ASICS. Hoje até que existem soluções inovadoras para algoritmos com resistência ASIC mas eu tenho a impressão que os devs até preferem usar os algoritmos dominados por ASIC pois consideram um publico minerador mais especializado. Mas é curioso pois a mineração via CPU ainda existe e vem tendo uns picos de rentabilidade de tempos em tempos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}