{
  "id": "topic_5432456",
  "title": "darxiaomi",
  "author": "darxiaomi",
  "created_time": "December 31, 2022, 12:56:47 AM",
  "content": "Como bien dice el titular, hoy estaba navegando como siempre por los portales de noticias y me encuentro con esta noticia.https://www.infobae.com/economia/2022/12/30/impuesto-al-bitcoin-un-pais-europeo-impuso-una-tasa-a-las-criptomonedas-del-26-desde-2023/El titular de la noticia marcaba un alarmante 26% por lo cual decidi entrar a ver de que estabamos hablando especificamente, la realidad es que es mas de lo mismo, es sobre las ganancias o si hay perdida el pdoer usar ese credito en ejercicios posteriores.Sin embargo creo que son tasas MUY altas.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432456",
  "comments": [
    {
      "author": "seoincorporation",
      "created_time": "December 31, 2022, 01:33:02 AM",
      "body": "También yo me encontré con la noticia, y al principio pensé lo mismo. Que el 26% es un impuesto muy elevado. Pero como bien comentas ese impuesto solo se aplica a la ganancia y solo en caso de que vendamos todas las criptos que adquirimos previamente ya que si el dinero no toca nuestra cuenta de banco entonces no hay nada que fiscalizar.Seguro la ente encontrará la manera de evadir esta clase de impuestos, basta con pedir una tarjeta de banco prestada para recibir el depósito.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "December 31, 2022, 03:21:56 AM",
      "body": "Quote from: seoincorporation on December 31, 2022, 01:33:02 AMTambién yo me encontré con la noticia, y al principio pensé lo mismo. Que el 26% es un impuesto muy elevado. Pero como bien comentas ese impuesto solo se aplica a la ganancia y solo en caso de que vendamos todas las criptos que adquirimos previamente ya que si el dinero no toca nuestra cuenta de banco entonces no hay nada que fiscalizar.En España, las ventas de criptomonedas tributan entre el 19 y el 28%, o sea que más o menos como Italia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "December 31, 2022, 03:05:37 PM",
      "body": "Como rango porcentual, es efectivamente similar a España en el tramo máximo vigente, aunque por lo que parece, Italia lo aplicará sin tramos a modo de baremo plano al 26 % (si hay ganancias superiores a 2K €).Hay más cosas interesantes en lo aprobado en Italia, aunque no he dado con el clavo de algún artículo que lo explique bien por ahora. Así, el abajo referenciado indica que:QuoteAsimismo, se establece un «impuesto sustituto» para los inversores que declaren sus criptomonedas no informadas en periodos fiscales anteriores, que será del 3,5% más un 0,5% de multa por cada año, informó RAI.Es decir, han incorporado algún mecanismo para ponerse al día, pero están hablando de \"criptomonedas no informadas\". Esto me da a pensar de que hablan en este punto de tenencia, no de operaciones. He visto varias referencias a una suerte de amnistía mediante lo recogido en la cita anterior, pero como digo, las referencias que he visto son poco exhaustivas en delimitar el alcance y el contexto de lo que están hablando.Ver: https://www.criptonoticias.com/regulacion/parlamento-italia-aprueba-impuesto-26-ganancias-bitcoin-criptomonedas/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Artemis3",
      "created_time": "December 31, 2022, 11:03:03 PM",
      "body": "El único impuesto que se podría admitir es el IVA, ya que tiene la forma de auditoría en el intercambio del producto o la prestación del servicio. El resto está destinado a ser evadido. Es el mismo error de España, pero no tiene nada de raro que los políticos anticuados se estén copiando unos a otros. Bitcoin va por encima de lo que ellos han conocido toda su vida. Claro llenen de leyes e impuestos todo, ya veremos si la gente los cumple...Ni el Estado ni nadie tiene que saber la cantidad de bitcoins que la gente tiene, ni ellos están obligados a revelarlo, aunque lo pongan en leyes que son letra muerta. Como mínimo aprenderán a tener mas de una wallet \"no declarada\" para los ahorros de la cual muy de vez en cuando podrían pasar cantidades pequeñas a la declarada. Luego en otro país con mayor libertad podrán disponer de su dinero con tranquilidad.Es correcto, toda traba que se le hace a Bitcoin, únicamente niega la creación de riquezas en ese país. Pretenden sacar mas dinero de la gente, y en la realidad producen el efecto contrario. Es la clase política de siempre, entre mas hacen que el Estado intervenga, peor es para todos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "January 01, 2023, 01:24:29 AM",
      "body": "Siempre me pareció alarmantemente curioso como el impuesto sobre la venta de Bitcoin es desproporcionado en la mayoría de los paises en que se aplica.Aunque también admito que no estoy al cien por cien informado de cual es la comparación con otros activos más tradicionales; da la sensación de que este tipo de tributos se establecen como un medio para persuadir a la población de no dar el paso a activos decentralizados (y más volátiles), para que se queden con portafolios más tradicionales. En el mejor de los casos para los gobiernos de los paises desarrollados, el grueso de su población pondría todo el dinero en bonos del tesoro de los Estados Unidos o sus equivalente europeos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "January 01, 2023, 10:28:26 AM",
      "body": "Quote from: Hispo on January 01, 2023, 01:24:29 AM<…>En España, los tramos por las plusvalías de ganancias con las acciones es el mismo que con bitcoin y las demás criptomonedas, estableciendo tramos entre el 19% y el 26% (ampliable a 28% este año) en función del volumen de ganancias. Por lo que observo, el 26% de Italia plano sobre las criptomonedas es el mismo baremo que aplica de por sí a las ganancias de capitales de productos que generen dividendos e intereses y plusvalías.Digamos que, en ambos casos, se han equiparado las criptomonedas a productos financieros existentes en términos impositivos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}