{
  "id": "topic_5416105",
  "title": "Flodner",
  "author": "Flodner",
  "created_time": "October 05, 2022, 10:27:10 PM",
  "content": "We live in interesting and dynamic times. Only a few months ago we had a fuel crisis in Ukraine, there was a big shortage of fuel. Many gas stations stopped working, others continued to work only as shops, and those few which had available fuel - had huge lines, so people had to wait hours in line.Even the war doesn't stop innovation and crypto. Just recently it became possible to pay for fuel with crypto via Binance app.By the way, if you don’t have a Binance account yet - with this special partner link, you can get -20% trading fees. And, of course, an additional -25% if you use BNB.So the process is very fast and simple. I just stopped at the fuel station, opened the WOG app, and chose the amount of funds I wanted to pay (I chose in UAH, but paid in USDT as you can see from the image). Then I selected \"Binance\" in the payment method and paid. I tanked my car myself, that's actually one more benefit of using crypto - I don't need to go inside the station, and order, so tanking the car this way is much faster.WOG is a big chain of gas stations, they exist in all regions in Ukraine. I have an old car and recently chose cheaper fuel on other stations, but now I will go mostly to WOG. The first reason is that there is an ongoing contest for this month and I can find some additional funds. But another reason is that this way I'm increasing the statistics of crypto usage and crypto adoption.You can say that's a small impact on crypto usage. I remember in 2017-2018 there existed one startup which implemented crypto-payment solution for restaurants. At the peak, there were about 50 or 100 restaurants in Kyiv where it was possible to pay with crypto. But few people used it, so the restaurants abandoned this practice and that startup vanished. That's why in this case I would prefer to pay more but use crypto. And first of all, for the fuel, I will use my crypto-blogging income, which is now very small, but it may grow both market and the number of readers grow.That's the video where I show how I paid for fuel in crypto (it's in Ukrainian, but you can see the process)https://www.youtube.com/watch?v=o8p24AULtok",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416105",
  "comments": [
    {
      "author": "Gallar",
      "created_time": "October 06, 2022, 05:41:28 AM",
      "body": "in my country there is no payment system using crypto,because crypto is still not completely legal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "October 06, 2022, 02:01:28 PM",
      "body": "There isn’t a huge amount of stores/services that accept bitcoin for payment right now. I mean, the amount is increasing every year but not that quickly. What you can do though is use coinbase card, you’re actually using fiat but it is deducted from your crypto balance on coinbase. Technically it’s using crypto I guess. If you ever wanted to know more see this link https://help.coinbase.com/en/coinbase/trading-and-funding/other/coinbase-card-faq",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flodner",
      "created_time": "October 06, 2022, 10:34:08 PM",
      "body": "Quote from: DeathAngel on October 06, 2022, 02:01:28 PMThere isn’t a huge amount of stores/services that accept bitcoin for payment right now. I mean, the amount is increasing every year but not that quickly. What you can do though is use coinbase card, you’re actually using fiat but it is deducted from your crypto balance on coinbase. Technically it’s using crypto I guess. If you ever wanted to know more see this link https://help.coinbase.com/en/coinbase/trading-and-funding/other/coinbase-card-faqThanks for info. That's not the only card, I know about several others, i.e. Crypto.com and Binance. But they are not available in many regionsFor example in Ukraine they are not available yet.But this way - the payment is done very fast by Binance app",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "October 12, 2022, 12:26:22 AM",
      "body": "Thanks for sharing your story and be safe there in Ukraine. AFAIK, the country is being attacked at the moment by the Russian forces. I hope that this usage that you've made will have an impact on others to see that it's an interesting way of paying for goods like fuel and other stuff. It's for restaurants, gas stations, and other businesses to adopt it because they'll be the ones receiving it. It's an easy thing if the owners are even traders and holders just like us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mich",
      "created_time": "October 16, 2022, 05:03:46 AM",
      "body": "Well being able to purchase gasoline with crypto is very cool and exciting if you ask me. As more businesses begin to accept crypto, I can see in the near future that one day Bitcoin will be accepted as payment for fueling up at more places. Hopefully after we get out of this 'bear market' and enter the 'bull marker' then more gas stations around the world will be able to accept any crypto as a means of paying for gas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flodner",
      "created_time": "October 16, 2022, 07:48:00 PM",
      "body": "Thank you guys for good words and wishesSince the post, I paid with crypto a few more times. I'll be paying this way often)Now not so much, as I try not to drive as much as before, but hopefully in the future it will be my favorite method",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}