{
  "id": "topic_5402969",
  "title": "Robert518",
  "author": "Robert518",
  "created_time": "June 17, 2022, 12:54:08 PM",
  "content": "How can crippling losses be avoided?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402969",
  "comments": [
    {
      "author": "mk4",
      "created_time": "June 17, 2022, 01:50:33 PM",
      "body": "1. Practice with virtual portfolios first for a while2. Use smaller allocations per trade so you have more runway even if you get consecutive losses3. Think about your trades really well first before pulling the trigger4. Don't tradePick one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "June 17, 2022, 02:29:19 PM",
      "body": "Quote from: Robert518 on June 17, 2022, 12:54:08 PMHow can crippling losses be avoided? A loss can cripple a trader if and only if volume traded is more than the amount the trader can afford to lose. Now we all keep telling each other to not invest more than we can afford to lose, but it reality nobody listens to this statement and everyone puts all in whenever the market goes down.Again if you bought in the bull market then of course the bear market will cripple your investment - that is obviously the wrong way to invest.In other words, there are methods to prevent a loss that can do sizeable impact on your portfolio.-Invest only in bitcoin under the \"crypto\" umbrella.-10% of your allocation for all sorts of trading to crypto, not more, maybe less.-Say no to any altcoin out there.-Diversify, not into altcoins, but into markets other than crypto like stocks, commodities, real estate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "June 17, 2022, 03:56:45 PM",
      "body": "Quote from: palle11 on June 17, 2022, 02:21:28 PMQuote from: Robert518 on June 17, 2022, 12:54:08 PMHow can crippling losses be avoided?Cripple loses question depend on whether you mean trading that is on going or you mean if you have been making losses consistently. I want to go on answering you with ongoing trade first. If your trading is gradually in lost, then exit the trade and have your peace.Another point if you are making consistent or crippling loses you need to study your strategy and reduce your risk taking.To be honest, we're in the season where the study of the market and strategy will mostly provide negative results because experience traders are also making a huge loss, and the best way to make peace is to stop trading and move to the old crypto investment style of accumulation and sell when the market rise. However, if this also shows no positive result the best thing is to just accumulate the dip using the DCA.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "June 17, 2022, 04:07:19 PM",
      "body": "Quote from: suzanne5223 on June 17, 2022, 03:56:45 PMTo be honest, we're in the season where the study of the market and strategy will mostly provide negative results because experience traders are also making a huge loss,Just a heads up that shorting (and with leverage as well) exists, hence actual experienced traders can make a lot more money even in huge drawdowns like the one we're having right now. If you're an actual experienced trader and you can only make money in bull markets, are you really an 'experienced' trader?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "June 17, 2022, 04:07:24 PM",
      "body": "Dont DCA when the trend is nlt in the DCAing trend. Bear market is not a good time for DCAing. Crippling loss sounds like you put all in your savings to BTC while bears are wining the market.Also don't forget to sell when its time to sell. The indicators don't lie so when you see that the BTC is over bought which had reached its All time High, get out because its time. Don't chase it if you see it bounce up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "June 18, 2022, 02:00:09 AM",
      "body": "It can't be avoided but you can minimize it.Even the long term traders and holders, we can't skip losing due to the trend that we have which is the bear market. To minimize your losses, ask yourself what actually is your plan with the market.Are you willing to stay for long and you're okay to see that the growth might not be quick as what you're thinking? Are you okay to be patient and watch your portfolio grow over time gradually? Well, if it's a yes, the only thing you need to do is to make a choice of what you're going to buy. This is where the big factor comes like if you're buying random shitcoins out there, you're unsure of the return of it. You might get lucky or you go home rekt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "June 18, 2022, 03:21:37 AM",
      "body": "Quote from: cabron on June 17, 2022, 04:07:24 PMDont DCA when the trend is nlt in the DCAing trend. Bear market is not a good time for DCAing. DCA is mostly used by people that just realize that they can't time the market, and that they'll just continue to buy in consistently regardless of market sentiment. Not DCA-ing in times of bear markets but only in bull/ranging markets is quite an absurd strategy if you ask me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "June 18, 2022, 07:22:29 AM",
      "body": "Quote from: Robert518 on June 17, 2022, 12:54:08 PMHow can crippling losses be avoided?Stop-Loss.Its extremely handy to save us from huge loss and almost all the exchanges have such feature so you can decide the limit which your asset don't want to go beyond that can be set so the trade will be executed once it reaches that value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "June 18, 2022, 07:43:10 AM",
      "body": "Quote from: Robert518 on June 17, 2022, 12:54:08 PMHow can crippling losses be avoided?The only advice I can give is to be responsible on the money you'll invest in this too volatile market and always look at the long term potential it could have. That will make your life easier and not feel you've been crippled in your tangible life. Bitcoin and the overall market bounce stronger historically, so, it doesn't matter if are ahead from the rest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dollar_Hunter",
      "created_time": "June 18, 2022, 07:49:01 AM",
      "body": "Quote from: Robert518 on June 17, 2022, 12:54:08 PMHow can crippling losses be avoided?the way is very easy if we are not greedy, because greedy traders and investors will experience more losses when the bear market comes, the bear market in crypto is very different in the stock market, in the crypto market we will see -90% on each coin, and that's true -true happens, but in stock market maybe -30% is worst",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "June 18, 2022, 09:50:06 AM",
      "body": "Quote from: Dollar_Hunter on June 18, 2022, 07:49:01 AMthe way is very easy if we are not greedy, because greedy traders and investors will experience more losses when the bear market comes, the bear market in crypto is very different in the stock market, in the crypto market we will see -90% on each coin, and that's true -true happens, but in stock market maybe -30% is worstIt must be shitcoins since you said the price is decrease -90% e.g. UST and LUNA, the crash on Bitcoin history never reach -90%, the highest is 80% on 2018 and it's not a sudden change like a day or a week. Stock is controlled by the financial institutes which have limit down that every stock can't increase or decrease higher than the limit (around 5-7%/day). It do prevent from panic, but Bitcoin enthusiast doesn't like a third party who can control anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "June 18, 2022, 02:48:00 PM",
      "body": "Quote from: jrrsparkles on June 18, 2022, 07:22:29 AMQuote from: Robert518 on June 17, 2022, 12:54:08 PMHow can crippling losses be avoided?Stop-Loss.Its extremely handy to save us from huge loss and almost all the exchanges have such feature so you can decide the limit which your asset don't want to go beyond that can be set so the trade will be executed once it reaches that value.Cripple loses question depend on whether you mean trading that is on going or you mean if you have been making losses consistently. I want to go on answering you with ongoing trade first. If your trading is gradually in lost, then exit the trade and have your peace.Another point if you are making consistent or crippling loses you need to study your strategy and reduce your risk taking. This reinforces the use of stop loss because if you are using the stop loss technique, you won't have to encounter that losses that will gradually and consistently eat up your investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "June 19, 2022, 11:06:36 AM",
      "body": "From all the points above you must have gotten some learning’s. In addition to them always remember back of the mind regarding the volatility issues of this market. The market is wavy ocean, lot of tornadoes along the way and darker than black nights! Might seem dram or play lines but that’s how stuff works in the crypto circle. It’s harsh here, there is no one to scold if you lost your money and no one to blame for its recovery. Just take current example of the market, peeps loosing huge sum of money but it’s upto them now either to keep it or leave it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "June 19, 2022, 03:27:45 PM",
      "body": "Quote from: Robert518 on June 17, 2022, 12:54:08 PMHow can crippling losses be avoided?Not to trade is sometimes a good trade.I believe that not all the times are good to trade, there are times that the market is ugly and even you short or long is not a good idea so it is better to wait for a good entry.Another thing is you should preserve your capital, not chasing your losses will help you to do it, there are lot of good entry opportunity in the future as long as you still have your capital.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "June 20, 2022, 01:12:10 PM",
      "body": "Quote from: suzanne5223 on June 17, 2022, 03:56:45 PMTo be honest, we're in the season where the study of the market and strategy will mostly provide negative results because experience traders are also making a huge loss,You will have losses only if you bought coins at high for your entire deposit and continue to hold them. This tactic brings profit only in the bull market, but if the market has changed to bearish, be prepared for the fact that every day your deposit will become smaller and smaller.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "June 20, 2022, 02:13:28 PM",
      "body": "Quote from: tvplus006 on June 20, 2022, 01:12:10 PMYou will have losses only if you bought coins at high for your entire deposit and continue to hold them. This tactic brings profit only in the bull market,  I would not say for sure. Considering that newbies entering the market is always at the peak of bull market, they end up buying at all time high and dont think of selling at all. They will end up with a huge loss once the market turns over. The buying level should be clear and pre-calculated, doing this in a rush is a worst mistake that one can do to ruin their future cryptocurrency experience.While there will be people making profit from the bull run even when buying at the top, this number is usually low. Most people will buy at low and then sell at high in the ideal scenario. Of course failing to do so will lead to crippling losses, specially since a lot of users take loans to buy bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "June 20, 2022, 03:25:22 PM",
      "body": "I would say that averaging your entry points is the only way. That way you are not buying something with all of your money, you are buying it from a situation that ended up with a drop and you got some there too and then some more drop and you got some more hence the price would go down a lot.This is why I care a lot about the current market, because it means I could make a lot of profit by buying from here, and then I could wait months or even years and then sell it for a high profit. Many people will miss that, they will WISH that they bought it, and I will be counting my profits when they are regretting, so there is nothing wrong with dropping prices, you can wait and not have any losses at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "June 20, 2022, 04:04:05 PM",
      "body": "Practice makes a man perfect and practice makes a trader better. How you practice is the key here.You have to keep trying different techniques and strategies with lower amounts and this will improvise your efficiency at trading.Once you improve enough then the game is just about the quantity. The profits you earn will keep growing then onwards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alisha-k",
      "created_time": "June 20, 2022, 04:40:50 PM",
      "body": "To avoid crippling losses learn the trend, trade with the trend, avoid joining a trade when the price has moved quite far always target a retracement to place a trade  and lastly trade with fellow traders never analyze the market alone because most times emotions and greed could set in. Learn to make profit in both trends",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}