{
  "id": "topic_5446125",
  "title": "Mimiklinton",
  "author": "Mimiklinton",
  "created_time": "March 24, 2023, 07:49:17 AM",
  "content": "On March 10 2023 when silicon Valley Bank collapse and the subsequent failure of two others in silver Gate capital and signature bank, many had feard bitcoin would go dip, but rather, in this turmoil bitcoin have performed incredibly well,  already rallied around 70% this year. And for me this is an evidence that bitcoin is  offering an alternative to the traditional banking system as a place for people to keep their money safe. And one can say that this year with the current  activities happening in the banking sector,we might just see bitcoin getting to its previous high of nearly 69000k,and iven surpass it to have a record high..",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446125",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "March 24, 2023, 08:15:22 AM",
      "body": "Quote from: Mimiklinton on March 24, 2023, 07:49:17 AMAnd one can say that this year with the current  activities happening in the banking sector,we might just see bitcoin getting to its previous high of nearly 69000k,and iven surpass it to have a record high..I do not think we can say the current happening in banking sector because the banks have collapsed already, bitcoin rallied to over $28000, and maybe bitcoin price may still go further and increase more and more. But I am not of the type that thinks like ChatGPT or thinking that bitcoin will increase more than expected this year, all my expectation still lies in 2024 after bitcoin halving, which would likely wakeup both old and new retail and institutional investors to pump the market again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "March 24, 2023, 08:52:19 AM",
      "body": "Bitcoin is the most volatile currency that exists, so obviously it can rally even if just shortly before it crashed or vice versa. But I get you point, since for now we can use some higher prices to stabilize the ecosystem and don’t scare of to many people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "March 24, 2023, 09:24:02 AM",
      "body": "Quote from: Mimiklinton on March 24, 2023, 07:49:17 AMOn March 10 2023 when silicon Valley Bank collapse and the subsequent failure of two others in silver Gate capital and signature bank, many had feard bitcoin would go dipMany? Who were those many?The SVB failure was a textbook case for BTC just as much as the previous Cyprus bank crisis, it was an event that BTC was designed to prevent so it was obvious it would go up. Silvergate is a completely different thing, it was a bank mainly used by crypto exchanges, also dubbed as a crypto bank, its failure has been seen as a possible restriction of capital inflow into crypto, and that's why it didn't have the same effect. Quote from: Mimiklinton on March 24, 2023, 07:49:17 AMAnd one can say that this year with the current  activities happening in the banking sector,we might just see bitcoin getting to its previous high of nearly 69000k,and iven surpass it to have a record high..Highly possible but one must remember that if people can't get their money out of banks they can't also invest in BTC, so if half of the value of capital out there is gone so is the possible investment also.Quote from: Charles-Tim on March 24, 2023, 08:15:22 AMall my expectation still lies in 2024 after bitcoin halving, which would likely wakeup both old and new retail and institutional investors to pump the market again.Why would a timed event everyone is aware of be a trigger for those institutional investors to put money into bitcoin at that time and not do that now if it is set in stone BTC will go up? The halving is so overrated, everyone tries to find patterns with the halving at the center being the one causing the rise more to reassure themselves that this will happen over and over again every 4 years but what BTC has shown us in the last cycle is that every single pattern can be broken.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "March 24, 2023, 09:48:02 AM",
      "body": "Quote from: Mimiklinton on March 24, 2023, 07:49:17 AMOn March 10 2023 when silicon Valley Bank collapse and the subsequent failure of two others in silver Gate capital and signature bank, many had feard bitcoin would go dip, but rather, in this turmoil bitcoin have performed incredibly well,  already rallied around 70% this year. And for me this is an evidence that bitcoin is  offering an alternative to the traditional banking system as a place for people to keep their money safe. And one can say that this year with the current  activities happening in the banking sector,we might just see bitcoin getting to its previous high of nearly 69000k,and iven surpass it to have a record high..Just a speculation that it will have a negative impact on the market. But on the other hand, this  banking collapses just make bitcoin very strong and it just shows how resilient it is. Individuals will have to look for option to where to put their wealth and logically, bitcoin's volatility might turn out others, but majority still see it as the best choice for now.Not saying that we should be happy when there is a financial crisis because we will benefit from it. However, with how the world is going on, bitcoin is now being look at as a hedge against this crisis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mikky.Crypto",
      "created_time": "March 24, 2023, 11:05:05 AM",
      "body": "This is why I love Bitcoin! It's a safe haven for our money when the traditional banking system fails. The fact that it's performing so well right now is just the icing on the cake. I think we're going to see even more people flocking to Bitcoin as they realize its potential as a true alternative to traditional banks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "March 24, 2023, 11:14:16 AM",
      "body": "Quote from: stompix on March 24, 2023, 09:24:02 AMWhy would a timed event everyone is aware of be a trigger for those institutional investors to put money into bitcoin at that time and not do that now if it is set in stone BTC will go up? The halving is so overrated, everyone tries to find patterns with the halving at the center being the one causing the rise more to reassure themselves that this will happen over and over again every 4 years but what BTC has shown us in the last cycle is that every single pattern can be broken.Pattern can be broken, that is true, but how was the pattern broken in the last cycle? Bitcoin halved in 2020. All-time-high in 2020 and 2021. Bear market in 2022. Now bull and bear but slightly bull in 2023 (likely what would happen). I have not seen anything that has been broken. It is just almost similar to  the previous cycles.99x volatility before first halving33x volatility after the first halving6.2x volatile after the second halving 4.4x volatility after the third halving (or maybe bitcoin is still going below the $15500?)Bitcoin falled below the last all-time-high, but that should be expected, but that should not change the mentality of those that wants to invest. In my opinion, I have still seen everything to be going healthy. The pattern is still almost the same as of the old.Everyone has different believes, not that we are excellent in something is what makes us become rich sometimes, but just a believe can do it sometimes. I understand you, there may be one time that the cycle of a thing would be broken, but I will prefer my believe to fail rather not to believe that it won't work again. If it fails, then we moved to the next level.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "March 24, 2023, 11:30:10 AM",
      "body": "Quote from: Mimiklinton on March 24, 2023, 07:49:17 AM And for me this is an evidence that bitcoin is  offering an alternative to the traditional banking system as a place for people to keep their money safe.This is exactly what’s happening on Bitcoin market. People are scared that banks will drain their fiat that result to mass exodus on bank accounts to Bitcoin. You will notice that Bitcoin is the only one that keeps pumping hard with it’s increasing dominance. This is a clear sign that Bitcoin is being use as an alternative on banking turmoil. Feds keeps increasing the interest rate that kills bank slowly. This will not gonna be hood in the long run even on crypto market once the recession occurred since everyone will play safe fiat for their daily necessities purchase and investment will be less priority that time. I hope that feds interest rate will slow down and banks will be back to normal so that we can see an organic growth and not a hype growth due to panic which we all know that will result to pump and dump once the issue was resolved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "March 24, 2023, 11:49:55 AMLast edit: May 20, 2023, 07:09:05 PM by stompix",
      "body": "Quote from: Charles-Tim on March 24, 2023, 11:14:16 AM~Pattern can be broken, that is true, but how was the pattern broken in the last cycle? Bitcoin halved in 2020. All-time-high in 2020 and 2021. Bear market in 2022. Now bull and bear but slightly bull in 2023 (likely what would happen). I have not seen anything that has been broken. It is just almost similar to  the previous cycles.I was not talking about the halving which is already pushed to the limit by trying to span the time frame randomly but about the others, no lower than the previous ATH, the double top that never happened previously, etc. The halving pattern is just waiting around the corner to be broken too, already the time frame of the last bull and bear period are inverted in length. Patterns have only one purpose in life, to be broken, that's why stuff like this although plausible at the moment of writing looks ridiculous now:https://bitcoinmagazine.com/markets/how-halvings-will-bring-the-bitcoin-price-to-400000Quote from: Charles-Tim on March 24, 2023, 11:14:16 AMBitcoin falled below the last all-time-high, but that should be expected, Why should that be expected and a drop after the halving unexpected?Is there any real argument for one to happen and for the other not to other than just past experience?Quote from: Charles-Tim on March 24, 2023, 11:14:16 AM99x volatility before first halving33x volatility after the first halving6.2x volatile after the second halving 4.4x volatility after the third halving (or maybe bitcoin is still going below the $15500?)So, by the same numbers in 3-4 cycles, we're hitting 1 volatility, meaning the pattern will be broken as everything would either have to be flat or history will not repeat itself.Quote from: Charles-Tim on March 24, 2023, 11:14:16 AMI understood you, there may be one time that the cycle of a thing would be broken, but I will prefer my believe to fail rather not to believe that it won't work again. If it fails, then we moved to the next level.Exactly what I was saying, it's belief more than actual technical or economical arguments, just because BTC went up, then it must go up, infinitely.Because it doesn't then this whole thing is broken, so at what point does it have to stop since obviously, it can't go like this forever, and why is the stopping point not this one?Isn't far more believable that just because everyone thinks half a year after the halving there must be a bull run and buys the FOMO the bull run happens, more like a self-fulfilling prophecy?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "March 24, 2023, 12:08:51 PM",
      "body": "Quote from: Mimiklinton on March 24, 2023, 07:49:17 AMmany had feard bitcoin would go dip, There are always a vocal minority who have such weird expectations and even call that \"speculation\". Some of them are even referred to as \"experts\"! The fact is that they have no understanding of bitcoin, its market and in some cases economy in general Quote from: Mimiklinton on March 24, 2023, 07:49:17 AMAnd one can say that this year with the current  activities happening in the banking sector,we might just see bitcoin getting to its previous high of nearly 69000k,and iven surpass it to have a record high..I agree but at the same time we should consider that the market is so much more complicated than that. The banking collapse is going to continue being a strong cause for the price rise (in the future too) but also recession is going to be a negative force that prevents more investment from coming in to help the future rises.Specially when FED is still keeping interest rates high and there is a risk to increase them even more, things could get uglier.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "March 24, 2023, 12:11:23 PM",
      "body": "Quote from: Mimiklinton on March 24, 2023, 07:49:17 AMmany had feard bitcoin would go dip, but rather, in this turmoil bitcoin have performed incredibly wellIf bitcoin price had gone with the people's prediction over ut then we would have been having a pool of disorganized price soecula but things don't work out as many had thought, bitcoin works base on demand and supply, anyone xan say anything aside this real fact to how bitcoin price goes, sinxe bitcoin can attaining the peak of $28k this month right from the dip where it picked up then nothing is impossible anytime from now.Quote from: Mimiklinton on March 24, 2023, 07:49:17 AMbitcoin is offering an alternative to the traditional banking system as a place for people to keep their money safe.#There's high security measures in dealing with bitcoin as long as you're been decentralized away from the centralized exchanges and know how to safely and privately handles your keys.Quote from: Mimiklinton on March 24, 2023, 07:49:17 AMbitcoin getting to its previous high of nearly 69000k,and iven surpass it to have a record high..Ofcourse when the bullrun begins, it will get beyond the all time high of $69,000 to over hundred, this is the next move we are expecting sooner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "March 24, 2023, 12:38:58 PM",
      "body": "Banks are suffering in US, this could create a lot of panic and in my country they also started to create FUD which I believe this can lead into a Bitcoin adoption. As we can see, even the banks in US started to file bankruptcy, Bitcoin remain stable at its current price. US also raises the interest rate, which I believe many will think if its still worth it to hold on their bank account or just take the risk with Bitcoin. The Monthly price trend of Bitcoin remains bullish, this could be a good sign to those who are waiting for the pump signal, better to grab some BTC now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "March 24, 2023, 12:52:09 PM",
      "body": "Quote from: Mimiklinton on March 24, 2023, 07:49:17 AMOn March 10 2023 when silicon Valley Bank collapse and the subsequent failure of two others in silver Gate capital and signature bank, many had feard bitcoin would go dip, but rather, in this turmoil bitcoin have performed incredibly well,  already rallied around 70% this year. And for me this is an evidence that bitcoin is  offering an alternative to the traditional banking system as a place for people to keep their money safe. And one can say that this year with the current  activities happening in the banking sector,we might just see bitcoin getting to its previous high of nearly 69000k,and iven surpass it to have a record high..I know these are big news, but Bitcoins mainly use this as a secondary source to pump or fall. The price of Bitcoins completely depends on the users, that is, if we demand for more Bitcoins, then the price will increase, if the demand is less, then the price will fall. This generally happens, as Bitcoins are limited in number and hence the demand completely depends on the supply. So I would suggest not to worry about the price now, enjoy the bullish nature of the coin and take profits in regular intervals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z390",
      "created_time": "March 24, 2023, 02:35:24 PM",
      "body": "I understand, and you do have a point, by Bitcoin is volatile, nothing can change this, I am expecting a downside once bitcoin manage to take 32,000$ range, but we are still bullish and the month of April will look more better, I feel it's the right time to start buying intensively but carefully, whenever we pump we will go down for correction this is how Bitcoin moves. Do not let this change the way you see bitcoin, anything can happen but since your goal is a long term goal you don't have to fear any situation that might come, keep dollar cost averaging and wait for the halving, after halving the market sentimental will be stronger.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "March 24, 2023, 05:51:04 PM",
      "body": "We can say that but maybe people's responses will be different because they still use the traditional banking system to save money. And as long as their government \"still provides guarantees\" that their money is safe with the government, they should be fine. They will not immediately invest in bitcoin or save their money in bitcoin because some of them are still afraid of fluctuations in the price of bitcoin. Even though they recognize the potential for the bitcoin price to reach new highs, they are still not convinced it can happen. And I guess let's just let people think like that because maybe they already have their own plans. The important thing is we can keep investing in bitcoin in case of anything that can happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "siniminomorocomunisakito",
      "created_time": "March 24, 2023, 06:07:58 PM",
      "body": "Quote from: Mimiklinton on March 24, 2023, 07:49:17 AMOn March 10 2023 when silicon Valley Bank collapse and the subsequent failure of two others in silver Gate capital and signature bank, many had feard bitcoin would go dip, but rather, in this turmoil bitcoin have performed incredibly well,  already rallied around 70% this year. And for me this is an evidence that bitcoin is  offering an alternative to the traditional banking system as a place for people to keep their money safe. And one can say that this year with the current  activities happening in the banking sector,we might just see bitcoin getting to its previous high of nearly 69000k,and iven surpass it to have a record high..Market sentiment is fickle and can change quickly. Despite the collapse of Silicon Valley Bank and the subsequent failures of Silver Gate Capital and Signature Bank, Bitcoin has risen by about 70% this year. I think this is proof that Bitcoin offers an alternative to the traditional banking system as a place for people to store their money safely.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "March 24, 2023, 06:44:47 PM",
      "body": "Bitcoin generally has been risk-on for the past 3 years. There are times when its not correlated  but for most of the time is it. Look what happened during the covid crash. Bitcoin crashed also with stocks.This banking crisis is considered risk-off but its different because people are panicking about their funds inside their bank. If they disappear they are in trouble. Hence why many bought bitcoin because with bitcoin your money doesn't disappear and they also can't print an unlimited number like fiat.So if there are more bank failures its bullish for bitcoin. But if the entire economy falls into a deep recession and stocks go down... so might bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Quidat",
      "created_time": "March 24, 2023, 07:34:05 PM",
      "body": "Quote from: Mimiklinton on March 24, 2023, 07:49:17 AMOn March 10 2023 when silicon Valley Bank collapse and the subsequent failure of two others in silver Gate capital and signature bank, many had feard bitcoin would go dip, but rather, in this turmoil bitcoin have performed incredibly well,  already rallied around 70% this year. And for me this is an evidence that bitcoin is  offering an alternative to the traditional banking system as a place for people to keep their money safe. And one can say that this year with the current  activities happening in the banking sector,we might just see bitcoin getting to its previous high of nearly 69000k,and iven surpass it to have a record high..If this banking crisis would continue there would be no doubt that this would really be causing up some rally more on Bitcoin or entire crypto space as investors would really lost up trust on Banks,but do we really believe that they wont really be making up solutions? Of course they wont and this is why im not really that much confident when it comes to this considering thatthere would be always some solution for government to do this specially SEC.Banks might be crashing but we know that printing up money wont really be that a problemand when hyperinflation do comes then this is where Bitcoins value shoots up even more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "March 25, 2023, 11:40:36 AM",
      "body": "Quote from: Mimiklinton on March 24, 2023, 07:49:17 AMOn March 10 2023 when silicon Valley Bank collapse and the subsequent failure of two others in silver Gate capital and signature bank, many had feard bitcoin would go dip, but rather, in this turmoil bitcoin have performed incredibly well,  already rallied around 70% this year. And for me this is an evidence that bitcoin is  offering an alternative to the traditional banking system as a place for people to keep their money safe. And one can say that this year with the current  activities happening in the banking sector,we might just see bitcoin getting to its previous high of nearly 69000k,and iven surpass it to have a record high..I don't know, but your attempt to link or establish a relationship seems weak. There may be an indirect link to the Fed's pumping of liquidity into the markets, but there is no guarantee that that liquidity has been pumped into Bitcoin.As for the reason, does Bitcoin need a reason to rise by 70%, especially since we have been at the bottom for a long time.What is happening in the banking sector does not mean that the money in it will go to Bitcoin, as when panic prevails, the average investor does not go to high-risk investments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "March 25, 2023, 01:39:30 PM",
      "body": "Quote from: adaseb on March 24, 2023, 06:44:47 PMBitcoin generally has been risk-on for the past 3 years. There are times when its not correlated  but for most of the time is it. Look what happened during the covid crash. Bitcoin crashed also with stocks.This banking crisis is considered risk-off but its different because people are panicking about their funds inside their bank. If they disappear they are in trouble. Hence why many bought bitcoin because with bitcoin your money doesn't disappear and they also can't print an unlimited number like fiat.I don't think there ever has been a risk-off period for Bitcoin. I definitely see it as a long-term asset, pretty sure more conventional like banks and governments are also warming up to the idea, but it's still a lot of risk even for the medium-term of 3-5 years.This correlation thing also hasn't weakened, to my view. If anything, you can almost just tell what Bitcoin price is by following the (tech) stock news.Quote from: adaseb on March 24, 2023, 06:44:47 PMSo if there are more bank failures its bullish for bitcoin. But if the entire economy falls into a deep recession and stocks go down... so might bitcoin.Yup. Banking crash = Bitcoin rally makes sense because it's a blow to the money alternative. But systemic economic failure won't see anything escape.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}