{
  "id": "topic_5405422",
  "title": "Jossque",
  "author": "Jossque",
  "created_time": "July 06, 2022, 06:29:00 PM",
  "content": "Yatırımcılarından 7.2 milyon dolar toplayan layer 2 projesi. Aralarında gavin wood da mevcut.Projenin amacı rollup as a service kavramını geliştirmek. Proje airdrop yapabilir.Nft airdropları olacakmış. Takip edilmesi gerekiyor. Whitelist ile de alım olacak.https://twitter.com/alt_layer/status/1544652225284567041İlgili makalehttps://blog.altlayer.io/altlayer-og-badge-nft-drop-e7c2e62ddbd7",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405422",
  "comments": [
    {
      "author": "kriminall",
      "created_time": "July 07, 2022, 07:40:41 PM",
      "body": "AirDrop yapılacaksa takipte fayda var, aldıkları yatırımda hatırı sayılı bir yatırım, bu yatırıma göre güzel bir satış bekleyebiliriz, Whitelist ve airdrop için takip edeceğim hocam paylaşımınız için teşekkür ederim böyle projeler bazen gözden kaçabiliyor, böylece gözden kaçırmamış oluyoruz,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "July 07, 2022, 10:49:41 PM",
      "body": "Quote from: kriminall on July 07, 2022, 07:40:41 PMAirDrop yapılacaksa takipte fayda var, aldıkları yatırımda hatırı sayılı bir yatırım, bu yatırıma göre güzel bir satış bekleyebiliriz, Whitelist ve airdrop için takip edeceğim hocam paylaşımınız için teşekkür ederim böyle projeler bazen gözden kaçabiliyor, böylece gözden kaçırmamış oluyoruz, Umarım sadece whitelist isterler airdrop için, şimdiki yeni airdrop sistemi çok teferruatlı, binbir türlü şeyler istiyorlar airdrop alabilmek için, önceden telegrama katıl, mail bırak, discord'a katıl bir şeyler veriyorlardı şimdi nerdeyse hiçbiri kalmadı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Retro Harmony",
      "created_time": "July 08, 2022, 04:16:05 AM",
      "body": "Quote from: MK-74 on July 07, 2022, 10:49:41 PMQuote from: kriminall on July 07, 2022, 07:40:41 PMAirDrop yapılacaksa takipte fayda var, aldıkları yatırımda hatırı sayılı bir yatırım, bu yatırıma göre güzel bir satış bekleyebiliriz, Whitelist ve airdrop için takip edeceğim hocam paylaşımınız için teşekkür ederim böyle projeler bazen gözden kaçabiliyor, böylece gözden kaçırmamış oluyoruz, Umarım sadece whitelist isterler airdrop için, şimdiki yeni airdrop sistemi çok teferruatlı, binbir türlü şeyler istiyorlar airdrop alabilmek için, önceden telegrama katıl, mail bırak, discord'a katıl bir şeyler veriyorlardı şimdi nerdeyse hiçbiri kalmadı.Whitelist AirDrop için tek şart olursa güzel olur aslında bunun yanında telegram kanalına girme gibi ödevler de verilebilir. Bunlara tamamım da bazıları artık para gönder işlem yap paranı çekme ss alınacak vb yöntemlere başvurabilirler. Bundan sonra airdrop işinden faydalanmak için daha fazla risk almak gerekiyor bu da ne kadar doğru bilmiyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "July 08, 2022, 08:27:17 AM",
      "body": "Quote from: Retro Harmony on July 08, 2022, 04:16:05 AMQuote from: MK-74 on July 07, 2022, 10:49:41 PMQuote from: kriminall on July 07, 2022, 07:40:41 PMAirDrop yapılacaksa takipte fayda var, aldıkları yatırımda hatırı sayılı bir yatırım, bu yatırıma göre güzel bir satış bekleyebiliriz, Whitelist ve airdrop için takip edeceğim hocam paylaşımınız için teşekkür ederim böyle projeler bazen gözden kaçabiliyor, böylece gözden kaçırmamış oluyoruz, Umarım sadece whitelist isterler airdrop için, şimdiki yeni airdrop sistemi çok teferruatlı, binbir türlü şeyler istiyorlar airdrop alabilmek için, önceden telegrama katıl, mail bırak, discord'a katıl bir şeyler veriyorlardı şimdi nerdeyse hiçbiri kalmadı.Whitelist AirDrop için tek şart olursa güzel olur aslında bunun yanında telegram kanalına girme gibi ödevler de verilebilir. Bunlara tamamım da bazıları artık para gönder işlem yap paranı çekme ss alınacak vb yöntemlere başvurabilirler. Bundan sonra airdrop işinden faydalanmak için daha fazla risk almak gerekiyor bu da ne kadar doğru bilmiyorum.Biraz risk birazda iş isteyen işlemler istiyorlar aslında, çoğu proje testnet'e katılana veriyor artık. Ben Forta Protocol'ü takip ettim sadece, hiç bir şey alamadım ama testnet'ine katılanlar güzel para aldılar.Sağlam projelerin çoğu veriyor airdrop, yeterki bir şeyler yap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "January 25, 2024, 07:07:04 AM",
      "body": "Altlayer sonunda airdrop açıkladı galxe sitesindeki görevleri yapanlara 933 tane vermişler en azından benim cüzdanıma 933 tane düşmüş bakalım ne kadar edecek pek birşey edeceğini düşünmüyorum ufak tefek paralara binance sağlam ödöüller dağıtıyor gibi birşey gördüm.  Diğer cüzdanımada 600 tane gelmiş umarım para eder.Altlayeri galxe da kimsenin umursadığını hatırlamıyorum neden yaptım bende bilmiyorum ama galxe ara sıra işe yarıyor.https://airdrop.altlayer.io/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "varanvaran",
      "created_time": "January 25, 2024, 09:57:35 AM",
      "body": "ALT bana binance'nin Luncpoolundan geldi. 282 adet ama ben çok değerli olacağını düşünmesemde stake de beklerken güzel bir kar bırakırsa süper olur modundayım. Aynı şekilde geçen hafta manta gelmişti beklediğimin üstünde güzel bir açılış yaptı. satmadım. zaten Stake den gelen lunchpool ları kısa vadede satmayı düşünmüyorum havadan geleni belki ilerde bişiler olur diye tutuyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "demir77",
      "created_time": "January 25, 2024, 10:23:38 AM",
      "body": "Sattım. Launcpool ile 55$ kazanmış oldum. Kar cebe yakışır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "January 25, 2024, 11:21:55 AM",
      "body": "Quote from: demir77 on January 25, 2024, 10:23:38 AMSattım. Launcpool ile 55$ kazanmış oldum. Kar cebe yakışır.ben elde tutuyorum galxe'da nedense o dönem boş kaldım sanırım multilemişim 2 değil 4 farklı cüzdanım uygunmuş birinden gelenleri satıp eth aldım onlarıda o cüzdanlara çektim diğerlerini satmayı düşünmüyorum ne olacağı belli olmuyor pahalı diyoruz fiyatlamaya devam edebiliyorlar.Altlayer'i nedense cok sevmiştim o ara saçma salak nftlerini almışım az daha ilgilensem ciddi bir rakam yakalayacakmışız neyse kısmet değil deyip önümüze bakıyoruz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "January 25, 2024, 11:31:51 AM",
      "body": "3500 dolar civarında olan bnbye 90 dolarlık alt verdi sattım gitti yollarımızı ayırdık belki fiyatı düşerse yine alttan 90 dolarlık alıp beklerim en azından hiç yoktan gelen airdrop miktarımı arttırırım 1.1 milyar adet dolaşımda var ve toplam 10 milyar adet supply var genelde de ilk listelemeye düzenli düşüş daha sonra yavaş yavaş artış oluyor gözlemlediğim kadarıyla fiyat biraz daha düşer bence ytd",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "January 25, 2024, 02:20:31 PM",
      "body": "En çok kazandıran Binance Launchpoolu oldu sanırsam. En çok kazandıranlardan biridir kesin en çok kazandıran olmasa da. 1000 dolarlık stable coine bile 10 dolardan fazla verdi. Gerçi bilet sistemi hep en iyisi olarak kalacak. Ama eşit dağıtımda bu kadar pay dağıtması da hoş oldu.Tam bi her şey bitti. Binance eskisi gibi olmaz diyenler varken bi anda yine hoş bişi çıktı ortaya. Bana kalırsa herkes bu Launchpoolu referans alacak. Ve bi sonraki Launchpoola, Launchpade katılacak. Tabiki aynı şeyler beklenemez. Ama üst üste 3 tane Altlayer gibi proje çıksa çok hoş bi kitle toplar Binance kendine. BNB'nin fiyatı da baya bi artar bu durumda.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jossque",
      "created_time": "January 25, 2024, 02:28:26 PM",
      "body": "Altlayer airdrop açıklandı.Açıklandı açıklanmasına ama burada bir tesadüf olmayan durum var.İnsan sorgulamadan edemiyor tabiki.Bir cüzdan hesabı tuttuğu NFT'ler ile birlikte 1 milyona küsür ALT airdrobuna hak kazandı.Sanki biliyormuşcasına yani insider bilgi varmışcasına sadece o NFT'leri tutması da ilginç olan kısım zaten.İlerleyen zamanlarda airdrop kriterleri arasında NFT tutmak önemli bir şart haline gelecek gibi gözüküyor bunun yanı sıra.https://twitter.com/mztacat/status/1750441618568519949",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mustang Shelby",
      "created_time": "January 25, 2024, 09:09:49 PM",
      "body": "Quote from: Ondekinecakabilirim on January 25, 2024, 02:20:31 PMEn çok kazandıran Binance Launchpoolu oldu sanırsam. En çok kazandıranlardan biridir kesin en çok kazandıran olmasa da. 1000 dolarlık stable coine bile 10 dolardan fazla verdi. Gerçi bilet sistemi hep en iyisi olarak kalacak. Ama eşit dağıtımda bu kadar pay dağıtması da hoş oldu.Tam bi her şey bitti. Binance eskisi gibi olmaz diyenler varken bi anda yine hoş bişi çıktı ortaya. Bana kalırsa herkes bu Launchpoolu referans alacak. Ve bi sonraki Launchpoola, Launchpade katılacak. Tabiki aynı şeyler beklenemez. Ama üst üste 3 tane Altlayer gibi proje çıksa çok hoş bi kitle toplar Binance kendine. BNB'nin fiyatı da baya bi artar bu durumda.Ben eskiden çok fazla kilitlemenin mantıksız olduğunu düşünüyordum ama artık bunla beraber düşüncem değişti. Üstte bazı örnekler var ama tabi BNB önceden beri yatırım olarak tutanlar yine kazanıyorlar. İyi bir fiyata düşse de biraz BNB alsak ve böyle projelerde kilitlesek. Halka arzlar gibi kilitle kazan yapsa ayda 200 dolar bıraksa fena sayılmaz. Hayaller iyi ama hayatlar kesin böyle olmaz",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzigie",
      "created_time": "January 25, 2024, 10:35:46 PM",
      "body": "Quote from: Jossque on January 25, 2024, 02:28:26 PMAltlayer airdrop açıklandı.Açıklandı açıklanmasına ama burada bir tesadüf olmayan durum var.İnsan sorgulamadan edemiyor tabiki.Bir cüzdan hesabı tuttuğu NFT'ler ile birlikte 1 milyona küsür ALT airdrobuna hak kazandı.Sanki biliyormuşcasına yani insider bilgi varmışcasına sadece o NFT'leri tutması da ilginç olan kısım zaten.İlerleyen zamanlarda airdrop kriterleri arasında NFT tutmak önemli bir şart haline gelecek gibi gözüküyor bunun yanı sıra.https://twitter.com/mztacat/status/1750441618568519949Bu adrese alarm kurup takip etmek gerekir. İnsider olduğu çok açık. Tokenları sattığında hemen satmak gerekir. Gerçi bi insider ise artık ortaya çıktığı için daha temkinli davranır ama hareketlerini takip etmek gerekir. İnsider olmasa bile zeki biri olduğu ve projeyi yakından takip ettiği açık. Stablecoinlere ayrılan payı biraz daha arttırsalar boşta kalmaktansa girerim ama giremiyorum son Launchpollara. Stablecoinlerin payı az. BNB sert fiyatlanıyor. Launchpool'dan 20 dolar kazanmak için BNB'den 200 dolar zarar etme ihtimali var. Bu yüzden giremiyorum Launchpollara. Fakat bu launchpool fikrimi ve bakış açımı değiştirebilir. Durduk yerde iyi kazandırmış.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabsav",
      "created_time": "January 26, 2024, 07:30:36 AM",
      "body": "insiderlık bir durum yok adamlar zaten bu nftlere drop yapacaklarını aylar öncesinde solemısler. zaten nftlerde ole çok ucuz değil. ayının dans ettiği donemde 1 ether olan nft bu.size insider gibi bir düşünce vereyim zk drop atarken kesinlikle libertas nftlerine birşey atacaktır.(kaynak deneyimlerim)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "January 26, 2024, 07:34:29 AM",
      "body": "Quote from: cabsav on January 26, 2024, 07:30:36 AMinsiderlık bir durum yok adamlar zaten bu nftlere drop yapacaklarını aylar öncesinde solemısler. zaten nftlerde ole çok ucuz değil. ayının dans ettiği donemde 1 ether olan nft bu.size insider gibi bir düşünce vereyim zk drop atarken kesinlikle libertas nftlerine birşey atacaktır.(kaynak deneyimlerim)bunu yazmaya gelmiştim aynen öyle adamlar önceden söyledi sorun bizde öyle sadece sosyal medya gezerek proje araştırılmıyor orjinal kanallarını araştırmak gerekiyor. Zksync'deki nftden elimde sadece 2 tane kaldı diğerlerini önceden para lazım olduğu için sattım 2si bile güzel para yapar oldu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "W Jr.",
      "created_time": "January 26, 2024, 11:34:24 AM",
      "body": "Quote from: mandown on January 26, 2024, 07:34:29 AMQuote from: cabsav on January 26, 2024, 07:30:36 AMinsiderlık bir durum yok adamlar zaten bu nftlere drop yapacaklarını aylar öncesinde solemısler. zaten nftlerde ole çok ucuz değil. ayının dans ettiği donemde 1 ether olan nft bu.size insider gibi bir düşünce vereyim zk drop atarken kesinlikle libertas nftlerine birşey atacaktır.(kaynak deneyimlerim)bunu yazmaya gelmiştim aynen öyle adamlar önceden söyledi sorun bizde öyle sadece sosyal medya gezerek proje araştırılmıyor orjinal kanallarını araştırmak gerekiyor. Zksync'deki nftden elimde sadece 2 tane kaldı diğerlerini önceden para lazım olduğu için sattım 2si bile güzel para yapar oldu.Paraya ihtiyacın varsa şu an borç al, kredi al ama o NFT’leri satma  Bir süre daha elinde tutman senin için daha iyi olur.Cabsav hocamın dediği gibi en ayı döneminde bile 1 eth fiyatı vardı diye hatırlıyorum ben de diğer nftleri.O dönemden beri o Nftye sahip olanlara bir iyilik yapmak istemeleri mantıklı bence.Yapsınlar o kadar artık.Bir insider biz yakalasak keşke forum olarak",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "January 26, 2024, 12:48:46 PM",
      "body": "Dolaşıma sokulacak tokenlerin süresi ne? Daha %11’i dolaşımda olan bir tokene veya coin neyse işte ederini vermek holder için mantıklı değil. Trade etmek isteyene bir şey olmaz %10 alır keyfine bakar ama bana göre holder olmak kriptoda daha çok kazandırıyor. Bu yüzden holdlamak için müsait mi sizce sevgili forum?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "January 26, 2024, 03:43:15 PM",
      "body": "sanırım yaklaşın son 1 ayda binance borsası yaklaşık 1.000 dolardan fazla para kazandırdı sadece bu launchpad/launchpool ayağına. benim gibi döner sever bir insansanız bu fırsatları boş geçmeyin derim. altlayer'e gelecek olursam 0,29-30 civarından salladım gitti. işin komik tarafı listeleneceği zamanı unutmuştum. tam kahve içerken birden aklıma geldi ve yolda durup sattım. sattıktan sonra güldüm ve arkadaşlarım ne olduğunu sordu. hiç dedim bedava para kazandım dedim:)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "January 26, 2024, 05:33:21 PM",
      "body": "Quote from: gospodin on January 26, 2024, 03:43:15 PMsanırım yaklaşın son 1 ayda binance borsası yaklaşık 1.000 dolardan fazla para kazandırdı sadece bu launchpad/launchpool ayağına. benim gibi döner sever bir insansanız bu fırsatları boş geçmeyin derim. altlayer'e gelecek olursam 0,29-30 civarından salladım gitti. işin komik tarafı listeleneceği zamanı unutmuştum. tam kahve içerken birden aklıma geldi ve yolda durup sattım. sattıktan sonra güldüm ve arkadaşlarım ne olduğunu sordu. hiç dedim bedava para kazandım dedim:)Bu durum daha bi çok sahip olduğunuz para ile alakalı diiil mi gospodin. 30 bin dolarlık BNB'niz varsa. BNB fiyatı 300 doların altına düştüğünde pek bi etkilenmiyorsanız. Launcpoollardan para 1000 dolar kazanabilirsiniz 1 ayda. Ama çoğunluk BNB'ye o kadar yatırım yapmıyor. Bu yüzden kazandığı para o kadar olmuyor. Ama launchpoollar bu şekil giderse herkes BNB almaya başlayabilir bütün parasıyla. Bilet sistemli dönemi saymazsak en çok kazandırdığı zamanları yaşıyor launchpoollar. Bu şekil bi kazanç herkesin dikkatini çeker.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}