{
  "id": "topic_5468430",
  "title": "Luis98",
  "author": "Luis98",
  "created_time": "September 28, 2023, 02:10:33 PM",
  "content": "How Much Do You Trust Bitcoin?Those who invested later, IS ANYONE BUYING BITCOIN AT 60 K?Imagine Buying Bitcoin AT 60 K And Your Money Is Now 0Well, Bitcoin Stagnated in the 20-30 Band, Do You Think the Number Could Fall?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468430",
  "comments": [
    {
      "author": "philipma1957",
      "created_time": "September 28, 2023, 02:24:08 PM",
      "body": "Quote from: Luis98 on September 28, 2023, 02:10:33 PMHow Much Do You Trust Bitcoin?Those who invested later, IS ANYONE BUYING BITCOIN AT 60 K?Imagine Buying Bitcoin AT 60 K And Your Money Is Now 0Well, Bitcoin Stagnated in the 20-30 Band, Do You Think the Number Could Fall?Bitcoin is not dropping to 0 in the foreseeable future.If you purchased at 68k in Nov 2021you just as easily could have Purchased at two times the coins 16k in Nov 2022.which would mean three coins1 at 682 at 16 each3 coin cost would be 33,333we will be pushing 40 by april.If you purchased at 68k and had no money to buy at 16k you deserve to lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "September 28, 2023, 02:35:25 PM",
      "body": "Quote from: Luis98 on September 28, 2023, 02:10:33 PMHow Much Do You Trust Bitcoin?Those who invested later, IS ANYONE BUYING BITCOIN AT 60 K?Imagine Buying Bitcoin AT 60 K And Your Money Is Now 0Well, Bitcoin Stagnated in the 20-30 Band, Do You Think the Number Could Fall?Your calculation is wrong if someone bought Bitcoin at $60k then his/her portfolio should be at $26k or above now and if the same person bought once again at $16k then cost of Bitcoin would be $38k for that person that person will also be profitable if he/she holds those coins for 2025. Now, let's say a person bought Bitcoin at $65k and is still holding his/her investment then within next two years he/she may get chance to double up his/her portfolio. The price of Bitcoin will at least reach $100k during the next bull run and that person will still make enough profits from that investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "September 28, 2023, 02:38:26 PM",
      "body": "Imagine we're back to 2019 where Bitcoin price touch as low as $3K, who bought Bitcoin at $19K and your money is 0? Wake up! Bitcoin reach new ATH at 2021 and people who bought at $19K can triple their money if they can sell when Bitcoin price was still $60K.This mean even you bought at ATH, it's not make you become dumb because you're only need to wait the good momentum if you want to sell it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "September 28, 2023, 02:38:41 PM",
      "body": "Quote from: Luis98 on September 28, 2023, 02:10:33 PMHow Much Do You Trust Bitcoin?More or less like those who believe in fiat currency I believe in bitcoin as a cryptocurrency.Quote from: Luis98 on September 28, 2023, 02:10:33 PMThose who invested later, IS ANYONE BUYING BITCOIN AT 60 K?I'd say there is and those still holding will make a profit when the price reaches $100k.As long as circulation continues in the market, whatever the price of bitcoin, someone will buy it because bitcoin is not only an investment asset that is widely used by all levels of society but a transaction tool such as when you make transactions using the country's official currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chilwell",
      "created_time": "September 28, 2023, 02:58:24 PM",
      "body": "Quote from: Luis98 on September 28, 2023, 02:10:33 PMHow Much Do You Trust Bitcoin?Those who invested later, IS ANYONE BUYING BITCOIN AT 60 K?Imagine Buying Bitcoin AT 60 K And Your Money Is Now 0Well, Bitcoin Stagnated in the 20-30 Band, Do You Think the Number Could Fall?I trust it 100 percent that if the holder can wait patiently he/she will see profit to take home, the calculation you are doing is wrong because when someone bought at 60k and you are saying his money is zero, when the price is between 20-30k, definitely his is not zero, now that we are expecting bull run now and our expectations on price of bitcoin should be above 100k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "September 28, 2023, 03:01:05 PM",
      "body": "Quote from: Luis98 on September 28, 2023, 02:10:33 PMHow Much Do You Trust Bitcoin?I trust bitcoin as long as the network protocols remains as it has always been and as well as the value of bitcoin keep increasing despite it volatility, i trust bitcoin because it is decentralized and was intended on us by it inventor to serve us with a financial alternative to using the fiat currency, i trust bitcoin because it's all about freedom and trust itself.Quote from: Luis98 on September 28, 2023, 02:10:33 PMThose who invested later, IS ANYONE BUYING BITCOIN AT 60 K?There's no rate you buy bitcoin that cannot render you the opportunity for profitability as long as you can hodl, so if i may say this, each time always comes with it own opportunity and now is the beginning of that future you might have aspired in bitcoin.Quote from: Luis98 on September 28, 2023, 02:10:33 PMImagine Buying Bitcoin AT 60 K And Your Money Is Now 0Well, Bitcoin Stagnated in the 20-30 Band, Do You Think the Number Could Fall?[/left][/center]It's not possible, if you have invested while bitcoin was at that rate, all you have to do is to hodl and wait till after the next halving season where you can sell after a new all time high is achieved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "September 28, 2023, 03:01:30 PM",
      "body": "That will be a bigger Ouch. But that will not provoke a strong hand investor to feel too disappointed when they bought Bitcoin at $60k. They believe the price will have its correction and they just need to wait until that time comes so that they can start buying gradually.But I do not believe Bitcoin will go to zero, especially when many people and countries already know it. What is happening is that the price will start to increase and reach its old ATH again. After that, the price will make a new ATH, surprising everyone who doesn't believe in Bitcoin.And the people who bought Bitcoin at $60k are already buying more, especially at the below $20k price because it's a big discount for them. Now they are still buying more Bitcoin while waiting for the time to increase. We still believe in Bitcoin so this waiting period is not a big problem for us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "September 28, 2023, 03:30:33 PM",
      "body": "Quote from: Luis98 on September 28, 2023, 02:10:33 PMHow Much Do You Trust Bitcoin?Those who invested later, IS ANYONE BUYING BITCOIN AT 60 K?Imagine Buying Bitcoin AT 60 K And Your Money Is Now 0Well, Bitcoin Stagnated in the 20-30 Band, Do You Think the Number Could Fall?The current price of Bitcoin as of the time of writing this post is $26,600, and as such, it clearly means that if a user had bought 1BTC when the value was $60k, what he/she should be having now is $26,600 and not $0, because that's not possible, Bitcoin is not altcoin or shitcoin that goes $0 in value, which is why it is the most invested cryptocurrency, and the coin with the largest market cap. Moreover, here is an example to help you understand how this works.QUESTION: Mr. A invested $200 in Bitcoin when the price of BTC was $60k/BTC, and kept hodling the coin till the value fell to $26k/BTC, so how much do you think should be left in his wallet currently?Answer: To know the percentage of $26k to $60k, what you need to do is;$26,000/$60,000×100%= 43.3%To know percentage lost = 100% - 43.3% = 56.7%Therefore, to know how much lost;56.7/100%×$200= $113.4Hence; how much that will be left in the users account will be$200- $113.4 = $86.6",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sophokles",
      "created_time": "September 28, 2023, 04:54:07 PM",
      "body": "Quote from: Luis98 on September 28, 2023, 02:10:33 PMHow Much Do You Trust Bitcoin?I have more trust on bitcoin than some useless paper cash or government controlled CBDC.Quote from: Luis98 on September 28, 2023, 02:10:33 PMThose who invested later, IS ANYONE BUYING BITCOIN AT 60 K?You came here to talk about bitcoin so i guess you know what bitcoin is and how to trade it. I assume you have this basic knowledge so why don't you check the market to learn about its current price. It is around 27k right now in spot market. Why someone would buy it in 60k! Quote from: Luis98 on September 28, 2023, 02:10:33 PMImagine Buying Bitcoin AT 60 K And Your Money Is Now 0Well, Bitcoin Stagnated in the 20-30 Band, Do You Think the Number Could Fall?[/left][/center]If we look at the potential bitcoin holdings, even $60,000 will look cheap. Touching an all-time high and taking up to a 70% correction is normal for bitcoin. This happens in every four-year cycle, so if someone bought bitcoin at $60,000, they have a great opportunity to lower the average right now. The possibility of bitcoin revisiting the $20,000 level is nominal. There are some catalyst events ahead of us that will take bitcoin above $100,000, so I am bullish on bitcoin in the long term. You can check out my post about those events to get a positive sentiment about the future of bitcoin. Potential events that can initiate next bitcoin rally",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "September 28, 2023, 07:35:15 PM",
      "body": "Quote from: Luis98 on September 28, 2023, 02:10:33 PMHow Much Do You Trust Bitcoin?Those who invested later, IS ANYONE BUYING BITCOIN AT 60 K?Imagine Buying Bitcoin AT 60 K And Your Money Is Now 0Well, Bitcoin Stagnated in the 20-30 Band, Do You Think the Number Could Fall?Nobody can predict the future. The only thing we are doing here is re-confirming our judgement about the potential of Bitcoin as an investment. And obviously many people are all of the same thought: That Bitcoin prevails and will continue to prevail. Every single argument against or critisicm against Bitcoin has been abolished, gracefully, with amazing counter arguments and pure logic.Imagine buying Bitcoin at 60k and it goes up to 120k. There are many scenarios which are very likely, and much more likely than Bitcoin falling to 0. In fact, the probability of the scenario of Bitcoin going to over 100k is much higher than it going to under 1k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "September 28, 2023, 07:49:04 PM",
      "body": "Wrong if you're saying someone bought at $60k and then the price now is $27k, there's still value or left from that money. It is that the value of the money that someone invested from it before has become lesser. But that's okay because this is what volatility means and that person just have to wait again until the price surpasses the $60k line. This has happened before and said during the peak of $20k and many have thought who's going to buy at that line knowing that it was an ATH, then another ATH came in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Quidat",
      "created_time": "September 28, 2023, 07:59:26 PMLast edit: September 28, 2023, 08:15:37 PM by Quidat",
      "body": "Quote from: Luis98 on September 28, 2023, 02:10:33 PMHow Much Do You Trust Bitcoin?Those who invested later, IS ANYONE BUYING BITCOIN AT 60 K?Imagine Buying Bitcoin AT 60 K And Your Money Is Now 0Well, Bitcoin Stagnated in the 20-30 Band, Do You Think the Number Could Fall?Trust is something that do differ on each person or investor but much sure that Bitcoin wont really be dropping to zero considering on how big the community that supporting is then we canreally say that its unlikely to happen but well we do know that everything could happen in a snap and it would always matter with the demand and recognition.Its really that hard on making out some conclusion in regards about Bitcoin situation in the future because we dont really actually know on what the future holds on which means that everything would really be depending on Bitcoins adoption and recognition if we do speak about its value or price. Trying out to make some conclusions about those technical indicators? I would say that it wont really be that a solid thing on which you could really be able to tell that it would go to zero(0). We've been already on several situations or times where its price is really that something that sits on being stagnated on a certain value and not really moving much but we know that when bull run cycle kicks in then everything is really that changed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "September 28, 2023, 08:09:00 PM",
      "body": "Quote from: Luis98 on September 28, 2023, 02:10:33 PMHow Much Do You Trust Bitcoin?Those who invested later, IS ANYONE BUYING BITCOIN AT 60 K?Imagine Buying Bitcoin AT 60 K And Your Money Is Now 0This is an exaggeration, Bitcoin still have value and yet to become worthless, so the money invested when Bitcoin was at $60 suffer a huge loss but does not become 0.  Whether we trust Bitcoin or not, I am sure an informed investor can wait rather than selling his stash at a loss.Quote from: Luis98 on September 28, 2023, 02:10:33 PMWell, Bitcoin Stagnated in the 20-30 Band, Do You Think the Number Could Fall?[/left][/center]There is a possibility but with how Bitcoin is able to recover its price and eventually break its ATH during bull run, I can say that history might probably repeat itself and we see the Bitcoin price recovering and paper losses being voided by the uptrend of BTC market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "September 28, 2023, 08:10:41 PM",
      "body": "Quote from: Luis98 on September 28, 2023, 02:10:33 PMHow Much Do You Trust Bitcoin?Those who invested later, IS ANYONE BUYING BITCOIN AT 60 K?Imagine Buying Bitcoin AT 60 K And Your Money Is Now 0Well, Bitcoin Stagnated in the 20-30 Band, Do You Think the Number Could Fall?I think that most people need BTC for long-term hodling, so even if someone bought BTC for 60K they still have a chance to get some profit out of it... Moreover, the price of btc depends no only on btc value, but also on dollar value: if dollar inflation occurs, the price of btc can rise up to 100K or even more, but the \"true\" value of these 100 K will be just the same as it was before the inflation. There is a chance to conserve the savings this way (however, in case of dollar inflation, cryptocrrencies and other fiats are at a risk of inflation too).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kawetsriyanto",
      "created_time": "September 28, 2023, 08:30:53 PM",
      "body": "Quote from: Luis98 on September 28, 2023, 02:10:33 PMHow Much Do You Trust Bitcoin?Why you should ask this question?  When we invest in Bitcoin, it means we no doubt with Bitcoin. We even trust on Bitcoin for our future. Investing in Bitcoin for a long term, means we 100% believe in the future of Bitcoin. We won't put our money for many years if we don't trust in Bitcoin.Anyway, before you ask others, can you answer how much you believe in Bitcoin?Quote from: Luis98 on September 28, 2023, 02:10:33 PMThose who invested later, IS ANYONE BUYING BITCOIN AT 60 K?Of course, there should be people who bought Bitcoin at $60k. I still remember when BTC was around $60k, people believe it will be $100k. At that time, people may have no doubt to buy Bitcoin at $60k. But sadly, it stopped in $69k (latest ATH). So, people who bought at $60k probably still keep their Bitcoin and wait for the next ATH.Quote from: Luis98 on September 28, 2023, 02:10:33 PMImagine Buying Bitcoin AT 60 K And Your Money Is Now 0As long as those people didn't sell their Bitcoin and keep it on the wallets, their money isn't 0. You must know that Bitcoin price never dropped to 0 value. So, how can their money to be 0?Quote from: Luis98 on September 28, 2023, 02:10:33 PMWell, Bitcoin Stagnated in the 20-30 Band, Do You Think the Number Could Fall?Do you mean the price looks stable around $20k-$30k?It is because we are still in the bearish season and there are many FUDs lately. But if you understand the havling schedule and bullrun season, you must be aware that we are heading those green market period. So, the price of Bitcoin seems to increase, it probably won't be stuck (sideways) anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "September 28, 2023, 08:48:58 PM",
      "body": "Quote from: Luis98 on September 28, 2023, 02:10:33 PMImagine Buying Bitcoin AT 60 K And Your Money Is Now 0How about the opposite - can you imagine someone buying 100 bitcoin in 2010 and they still have $2.7M in their wallet today?How likely are you to ignore that fact instead of being too afraid of the future?I'm not sure you really dare invest $1000 - $5000 in bitcoin at current prices to expect returns in the years to come. Really we didn't come for useless things like worrying about the future. Investment risks will always exist regardless of your investment assets. If you are worried about the future - then don't do it at all or don't involve yourself. But I hope you can change that mindset once you know what the reality is - so get more facts instead of talking a lot about pointless things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "September 28, 2023, 08:53:41 PM",
      "body": "Bitcoin can have a two-way situation either it is thriving well or it is dead.  But who cares, we can just enjoy the opportunities and functionality that Bitcoin brings.  Why bother too much on the unknown charter of Bitcoin future when we can actively participate in its economic activity right now?In terms of Bitcoin price, I believe it will recover just like what happened in the previous years of Bitcoin.  So before stating any conclusion, why not just observe and participate in the Bitcoin market while the future for Bitcoin unfolds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 28, 2023, 09:02:10 PM",
      "body": "Quote from: Luis98 on September 28, 2023, 02:10:33 PMHow Much Do You Trust Bitcoin?Those who invested later, IS ANYONE BUYING BITCOIN AT 60 K?Imagine Buying Bitcoin AT 60 K And Your Money Is Now 0Well, Bitcoin Stagnated in the 20-30 Band, Do You Think the Number Could Fall?imagine it this wayimagine the most expensive location to mine bitcoin on the planet being japan and hawaii where by in 2021 the mining cost max of the planet was $75kimagine the most efficient location to mine bitcoin on the planet being asia and slovic areas where by in 2021 the mining cost min of the planet was $15know imagine speculation psychology...if no one on the planet can mine for less than $15k then no one wants to sell for less and everyone wouldturn to buying at that low.. this creates a support wall to stop it going down below $15kif everyone on the planet can mine for less than $75k then no one wants to buy for more than $75k everyone would turn to mining and selling at that high.. this creates a resistance wall to stop it going upwell now in 2023 the support of the planet is about $22k and the resistance is at $150kand the market ALWAYS speculates between the periods support/resistance of the economy..the resistance and support does rise at a slower pace and the market speculates randomly within the moving limitsas long as the mining cost/competition continues we will not see  a zero bottom again",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stedsm",
      "created_time": "September 28, 2023, 09:02:33 PM",
      "body": "Buying btc at 60k and it becomes 0?How is that even possible? To even think for btc to be worth nothing, we will need something else to take its place that may either replace it or just get to a place where even btc couldn't reach. Let's talk about the final situation of btc, I think it will never be worth 0 so it's not worth it to talk about what is not possible in crypto.It has been more than a decade and there have been various coins that came and even some projects died, but btc had been there no matter what.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}