{
  "id": "topic_5444004",
  "title": "Last Effort",
  "author": "Last Effort",
  "created_time": "March 08, 2023, 01:33:03 PM",
  "content": "check this out through Blockchain.info or blockchair.com for this wallet➡️ 1NDyJtNTjmwk5xPNhjgAMu4HDHigtobu1s - *mysterious Binance Wallet* 1️⃣ info by BLOCKCHAIR.COM more than 15,654,676 btc had been received through this BINANCE WALLET and it staggered been transfered out until the balance is 0.3btc . since 08-08-2017 when the wallet been created2️⃣ info by BITINFOCHART        Balance: 0.30001596 BTC6,603.7 USD   wallet: Binance-walletReceived:   15,591,515.9663 BTC (886465 ins)   first: 2017-08-08   last: 2022-12-27Sent:   15,591,515.6663 BTC (886435 outs)   first: 2017-08-08   last: 2021-12-23Profit from price change:   155,582,745.45 USDUnspent outputs: 30               how it could be the heaviest transaction all time than other wallet..still can't figure it out...total in and out with spectacular transaction.with a lot of misyterious history about CZ speciality in blockchain 3rd members of Blockchain.info before he join the OKcoin as a CTO then CZ opened up his OWN EXCHANGER as BINANCE.this is only some guts feeling from the author, it is not any personnel issue or trying to demolished some one who are striking in their forte.the Question is, is CZ was the SATOSHI 🤣..and why CZ keep Hunting the President or TOP GUN some of the Country to open more his Empire with the Business collaboration?try do your search for the wallet, maybe u have a courage to monitor and trail it to the beginning of the transaction..maybe its not own by CZ but own by another person in the planet.refference : wallet-Binance ➡️➡️➡️ 1NDyJtNTjmwk5xPNhjgAMu4HDHigtobu1s",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444004",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "March 08, 2023, 03:21:38 PM",
      "body": "Yes, it is not owned by CZ but that wallet owns by Binance users who use their service. If your point is that this wallet that owns by Binance is hacked I don't think they are hacked according to what I heard before they gradually moved some funds to other wallets to ensure the security of their users' funds and to reduce the risk from hacks and security breaches.It is likely they are moving the funds from the hot wallet to the cold wallet and they periodically transfer funds back to the hot wallet when the funds are exhausted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "March 08, 2023, 04:16:28 PM",
      "body": "As you said yourself, that address is owned by Binance. As we all know, Binance is a big exchange and they have many users. It's not surprising that the address in question has received such big amount of bitcoin. What's the problem now? What do you find mysterious?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "imamusma",
      "created_time": "March 08, 2023, 04:35:31 PM",
      "body": "Quote from: Last Effort on March 08, 2023, 01:33:03 PMthe Question is, is CZ was the SATOSHI 🤣..and why CZ keep Hunting the President or TOP GUN some of the Country to open more his Empire with the Business collaboration?I don't think CZ is satoshi, but he is one who benefits from bitcoin being made by satoshi.Like any large corporation or business, you can expect them to have potential subsidiaries in multiple countries that can support their popularity and long-term business strength. The subsidiary will reach more users in different countries, of course, it will make the parent stronger. Likewise with its business collaborations with several other brand exchanges in various countries.I thought that was what CZ had been doing all along, but then again CZ wasn't Satoshi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pokapoka124",
      "created_time": "March 08, 2023, 05:50:52 PM",
      "body": "It’s 2023 and people still fantasize about finding the identity of Satoshi. I think linking CZ to satoshi is far fetched and obviously a witch hunt. There are better ways to spend one’s time perhaps you should try crossword puzzles. Those can be fun. Also there’s nothing mysterious about the wallet address or its content. Binance is one of the biggest exchanges in the world today, it’s no surprise that kind of volume is being moved through Binance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "March 08, 2023, 09:37:42 PM",
      "body": "nothing special at allthat wallet is a standard hot wallet that just moves ~100 average coins every 3 minutes (5 times per 15 minutes at times)which is just moving alot of customers custodian value from a cold wallet. to the hot wallet and then out to customersdoing 100btc that often soon adds up per hour, day, month, year",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bestdss",
      "created_time": "March 08, 2023, 09:57:16 PM",
      "body": "I don't think CZ is Satoshi because if he really is in one way or the other he would have revealed himself in one of his talks.When it comes to the supposed wallet with that huge amount of Bitcoin, it shouldn't be a surprise to anyone because Binance is the best exchange, Crypto Whales can use Binance for transactions and also it could also be CZ/Binance bitcoin wallet address. In anyway the deposit or withdrawal of this BTC have not caused anyone any harm, so we are good and fine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "March 10, 2023, 11:46:05 PM",
      "body": "Quote from: Bestdss on March 08, 2023, 09:57:16 PMI don't think CZ is Satoshi because if he really is in one way or the other he would have revealed himself in one of his talks.How can a guy who suggested to re-org the Bitcoin blockchain be satoshi?Quote from: Bestdss on March 08, 2023, 09:57:16 PMWhen it comes to the supposed wallet with that huge amount of Bitcoin, it shouldn't be a surprise to anyone because Binance is the best exchange, Best exchange, from what angle exactly... this is subjective. Every top exchange has such kinds of wallets anyway, hot and cold. I don't know why this address is even raising eyebrows.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "March 12, 2023, 03:47:33 AM",
      "body": "Nah CZ is not Satoshi the wallet you showed maybe is an old wallet that use by binance as Temporary wallet or hot wallet since the final balance was emptied. Or yeah it might just CZ wallet   since he is the wealthiest person in crypto space 'maybe for now'",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ataiwo913",
      "created_time": "March 12, 2023, 07:22:36 AM",
      "body": "Mysterious is a wallet for everyday use. It was designed with the mobile phone in mind and can be easily used as a wallet replacement, but is also fully functional as a traditional cryptocurrency holder. The wallet enables you to securely store your cryptocurrencies using the latest multi-signature technology that requires multiple signatures from every person with access to your wallet before spending any funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "March 12, 2023, 07:40:38 AM",
      "body": "You're jumping from one conclusion to another without any solid basis. Why would a wallet that has transferred many bitcoin mean that CZ or whoever owns that wallet is satoshi? Not to mention the age of that wallet is not that old, and the number of people or groups who have the ability to transfer that many are not limited to Binance/CZ either.Quote from: Last Effort on March 08, 2023, 01:33:03 PMhow it could be the heaviest transaction all time than other wallet..still can't figure it out...total in and out with spectacular transaction.Check out other exchange addresses and you'll see more or less similar behavior. The number of BTC might be lower of course, but that doesn't really matter considering the number of Binance users is likely higher too. Unless you find an address that has solid transaction history to old satoshi addresses, it won't be enough to convince people that the address is owned by satoshi, especially if it is owned by an exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}