{
  "id": "topic_5417544",
  "title": "Gorilla22",
  "author": "Gorilla22",
  "created_time": "October 18, 2022, 12:06:17 PM",
  "content": "I currently own BitBox02, and I think may be I should buy a second HW to have it as backup wallet, use it for forks, trading, shitcoins etc.I was researching Trezor T and discovered (from other people feed backs online) that it is very buggy and people are struggling all the time to make it work properly. I was thinking why was it so popular then, and the most probable answer was: brand.Old, highly respected brand, open source. And nothing good about device itself. Just bugs and issues, issues and bugs.People don't enjoy USING it. The enjoy HAVING it. Due to its brand. And I start thinking about bitcoin economy in general. The fewer people use bitcoin, want bitcoin, own bitcoin, the lower is price of bitcoin. The more people use, own, want bitcoin, the bigger is its price. But if hadware wallets are buggy, hard to use, difficult to set up. Then only technical people and experienced computer users can use them. Then:Your grandma cannot use them.Those ordinary young people who are not nerds, they cannot use them. The school kid next door cannot use them.Your neighbor cannot use them.All that means these people cannot use bitcoins.When they cannot use bitcoins they don't want bitcoins. When those mainstream people don't want bitcoin, then bitcoin price don't grow. The way hardware wallets are built causes either interest to bitcoin or fear. From ordinary people.So, from the point of view of bitcoin economy in general, in order bitcoin to grow, which hardware wallet is good and which one is bad?The good one is that which ordinary (not technical, not computer experienced people) can use. And the bad one is that which only technical computer experienced guys can use and no one else. Let's  say: 1. Do you need Python or Ubuntu to use the wallet? Bad wallet! Because these words are scary for your Grandma. 2. Does the wallet look ugly and cheap? Bad wallet! Because boys and girls in school and high school will not show off such a wallet for each other. 3. Does it not have a large touch screen?Bad wallet! Because your drunk neighbour will be unable to pay with bitcoins for his whisky. Is it possible to quickly start using this wallet for people who can only browse online, use email and internet banking, and nothing more on PC? If they need to learn too much to start using HW, it is bad HW! Just because they will not do those efforts, and thus they will not use bitcoins, and bitcoin economy will not get new users. Guys,  most of the people are  not computer experts. Not technically educated. And things which are easy for you, those things are scary and even feels impossible for them. So when you say it doesn't matter if hardware wallets are aesthetyc or not, easy to set up and use or not, buggy or not..... you don't care about bitcoin economy. And if all manufacturers act this way, then mainstream ordinary people will not use HW, will not use bitcoins, and then YOUR OWN BITCOIN will not grow in price! And even if you are satisfied with Trezor, ColdCard, Foundation Passport despite the fact your Grandma  cannot use them, and beleive that all HW should be like those,  this is a selfish mindset which as consequences makes that you don't care about your own bitcoins to grow in price. The manufacturer who will be able to create a secure open source HW for ordinary mainstream people (and yes, for your Grandma, school kids, and your drunk neighbour), that manufacturer will contribute to bitcoin economy tremendously, and that manufacturer may earn huge money selling his devices. ColdCard, Trezor, Foundation Passport is not HW future. Just because your Grandma cannot use them.From this point of view they are all bad. A good HW: Has a large touch screen.It's manual doesn't contain scary words like Ubuntu or Python.It is lovishly, aesthetically designed.No bugs!It is so easy to set up and to use for anyone who can no more than just browse onlie and send email.To use that HW is not more difficult than to use online banking.HW issue is never users problem, its always  manufacturers problem. And manufacturer is very sorry for any inconvenience for user. Manufacturer is doing his best for user to switch off his brain, to make no efforts, just to relax and enjoy using the wallet. Then it is a good wallet! If there were such hardware wallet, interest for bitcoin would grow a lot! You would become richer! Guys, please think about this. We must suport and cherish manufacturers who is making pleasant easy effortless wallets.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417544",
  "comments": [
    {
      "author": "NeuroticFish",
      "created_time": "October 18, 2022, 02:04:22 PM",
      "body": "Quote from: Gorilla22 on October 18, 2022, 12:06:17 PMNo bugs!My car has more software bugs than my hardware wallet. And the HW is a cheap one.I get your point, but you're not entirely right.* The good HW by your logic will be rather expensive (plus expensive compared to the competition) and grandma' won't understand why she needs that.* It won't matter the HW is great and friendly if there's no nice and friendly companion software wallet. I think that first step should be grandma' friendly software wallets.Nowadays one (new?) trend is to make a NFC card (with no screen) as HW. And the companion wallet handles it all. It's not safe enough by my standards, but I think that it's the closest we have now to grandma' friendly HWs. And some are cheap too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "October 18, 2022, 03:09:45 PM",
      "body": "In my opinion, this topic is so pointless that I was very close to clicking on the \"report to moderator\" button, given that the OP is starting to write fairy tales about hardware wallets. Philosophical questions of this type are more suitable for Off topic or maybe even another board.I know people on this forum complain mostly about Ledger (for various reasons), but I haven't noticed users complaining about Trezor in the sense that that device is as bad as the OP suggests. The experiences of others do not always have to be true, nor are they crucial in the formation of one's opinion - if that were the case, I would never invest a single cent or a single second of my time in Bitcoin.QuoteSo when you say it doesn't matter if hardware wallets are aesthetyc or not, easy to set up and use or not, buggy or not..... you don't care about bitcoin economy. And if all manufacturers act this way, then mainstream ordinary people will not use HW, will not use bitcoins, and then YOUR OWN BITCOIN will not grow in price! Claiming that the price of Bitcoin has anything to do with whether people use hardware wallets or whether they use nice or ugly devices is one of the stupidest things I've read on this forum. I wonder if you know when the first hardware wallet was made and how Bitcoin managed to survive until then?Not only did you not understand the advice given by some members (including me), but you decided to spam this board even more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "October 18, 2022, 03:24:09 PM",
      "body": "Quote from: Lucius on October 18, 2022, 03:09:45 PMClaiming that the price of Bitcoin has anything to do with whether people use hardware wallets or whether they use nice or ugly devices is one of the stupidest things I've read on this forum.Not necessarily. More easy to use hardware wallets means better security for the average Joe, less stories about lost/stolen bitcoins and maybe more people investing into bitcoin. And with higher demand the price should rise.A bit far fetched maybe, but it's not worse than the calls \"for all forum members\" to buy bitcoin in (this or that) crypto winter in order to revert the trend, for example",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OROBTC",
      "created_time": "October 18, 2022, 04:10:06 PMLast edit: October 18, 2022, 05:34:57 PM by OROBTC",
      "body": "...Gorilla22It may be that some grandmas can't use a hardware wallet, but then why would they mess with Bitcoin?  You can always offer to teach them how to use them if they are interested (but my mom, a great-grandmother is not interested, thank you!).I'm a grandpa, and NOT a computer expert at all.  I found that, yes, there is a learning curve for both the Trezor T and BitBox02, but that it was not that hard for me.  I like them both, and have not had buggy experiences with them (though, of course, I am nowhere close to being an expert).  I believe that both the manufacturers of those two HWs understand that they must be relatively easy to use, secure and non-buggy.  Else, who among the many people like me would buy them?Perhaps teenagers ought NOT show off their HWs to their friends in school?  Just sayin'...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "October 18, 2022, 08:18:52 PM",
      "body": "Quote from: Gorilla22 on October 18, 2022, 12:06:17 PMWhen they cannot use bitcoins they don't want bitcoins.The fact that they've tried and failed is a clear indication that they actually wanted it, but due to some limitations, they couldn't use it!Quote from: Gorilla22 on October 18, 2022, 12:06:17 PM2. Does the wallet look ugly and cheap? Bad wallet! Because boys and girls in school and high school will not show off such a wallet for each other.If you don't warn your child about the various risks of flashing such things in public, then that makes you a bad parent!Quote from: Gorilla22 on October 18, 2022, 12:06:17 PM3. Does it not have a large touch screen?Bad wallet! Because your drunk neighbour will be unable to pay with bitcoins for his whisky. Without considering the security aspect of the situation, if I were drunk, it'd probably be easier for me to operate a HW with physical buttons than the one with the large touch screen!Quote from: Gorilla22 on October 18, 2022, 12:06:17 PMand then YOUR OWN BITCOIN will not grow in price! Instead of being fixated on nonsensical stuff, please take a minute to familiarize yourself with other aspects of Bitcoin [the current or future price of Bitcoin doesn't define its \"real\" value]!Quote from: Gorilla22 on October 18, 2022, 12:06:17 PMA good HW: ~Snipped~I'm surprised you didn't mention anything about its security!Quote from: Gorilla22 on October 18, 2022, 12:06:17 PMNo bugs!Can you name a single HW out there that never had such a thing?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "October 24, 2022, 11:19:08 AM",
      "body": "Quote from: Gorilla22 on October 18, 2022, 12:06:17 PMAnd I start thinking about bitcoin economy in general. The fewer people use bitcoin, want bitcoin, own bitcoin, the lower is price of bitcoin. The more people use, own, want bitcoin, the bigger is its price. The price depends on supply and demand; not on the usability of a single hardware wallet.A large portion of coins 'owned' by people isn't even stored in personal wallets of any kind (software / hardware) at all, but just sits on exchanges.Also keep in mind that there are 'flashy, easy' software wallets that anyone can use very easily. Quote from: Gorilla22 on October 18, 2022, 12:06:17 PMColdCard, Trezor, Foundation Passport is not HW future. Just because your Grandma cannot use them.Have you tried these? I only have experience with Trezor and Passport and both are incredibly easy to use. Passport even easier with Envoy on  your smartphone; it doesn't get much simpler than that. I will elaborate in my upcoming review.Quote from: Gorilla22 on October 18, 2022, 12:06:17 PMA good HW: Has a large touch screen.Why? This is just a signing device with secure storage. It has to have a screen so you can verify the transaction, but size and touch are unnecessary costs, make the thing larger, harder to conceal, harder to use without attracting attention.Quote from: Gorilla22 on October 18, 2022, 12:06:17 PMIt's manual doesn't contain scary words like Ubuntu or Python.Hardware wallets don't mention Python in their 'Getting Started' guide. I don't think anyone is scared about a Linux icon on a webpage.The only place I see 'Ubuntu' or other Linux distributions mentioned, is on wallets' downloads pages; alongside Windows and macOS. Supporting all major platforms is not unusual and common practice for all types of software. Are you arguing a good hardware wallet should only support Windows? And are you aware that some hardware wallets don't even come with their own client; so operating systems are not mentioned at all?Quote from: Gorilla22 on October 18, 2022, 12:06:17 PMNo bugs!That's impossible. There exists no software without bugs.Quote from: Gorilla22 on October 18, 2022, 12:06:17 PMIt is so easy to set up and to use for anyone who can no more than just browse onlie and send email.To use that HW is not more difficult than to use online banking.It seems to me like you've never used a hardware wallet. These devices are actually easier to use than online banking.What's most important is not that the device is as 'pleasant, easy, effortless' as possible, but that the device is secure. That requires open-source in hardware and software and that everything's verifiable. Bitcoin is all about eliminating trust.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "October 24, 2022, 12:02:18 PM",
      "body": "Quote from: Gorilla22 on October 18, 2022, 12:06:17 PM1. Do you need Python or Ubuntu to use the wallet? Bad wallet! Because these words are scary for your Grandma.OP's indignation and discontent surprise me. Any device, be it a hardware wallet or a smartphone, must first of all perform its basic functions, be convenient and easy to use. For most users. That is why all hardware wallet primarily work with the Windows OS (as the most common), and not with Python. Although almost all devices work fine with Ubuntu and Mac OS.Quote from: Gorilla22 on October 18, 2022, 12:06:17 PM2. Does the wallet look ugly and cheap? Bad wallet! Because boys and girls in school and high school will not show off such a wallet for each other.I don’t see anything wrong with the fact that any manufacturer (of any gadget) is trying to make their devices prettier and more attractive in order to sell better. Nothing personal, it's business. Each manufacturer also strives for cheapness in order to reduce their costs and increase profits. Nothing personal, it's capitalism.Quote from: Gorilla22 on October 18, 2022, 12:06:17 PM3. Does it not have a large touch screen?Bad wallet! Because your drunk neighbour will be unable to pay with bitcoins for his whisky.Not many devices have a touchscreen. Not to mention big. Most often these are small monochrome displays.If we strive for mass adoption of crypto currencies, then hardware wallets that allow to store, pay and send crypto should be as easy to use, cheap and minimalistic in design.Quote from: Gorilla22 on October 18, 2022, 12:06:17 PM~snipThen it is a good wallet! If there were such hardware wallet, interest for bitcoin would grow a lot! You would become richer! Guys, please think about this.Look at the HW market. Such devices already exist. What annoys you about them? Choose the one you like best and that's it. Or create very best in the world your hardware wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "October 31, 2022, 09:46:56 PM",
      "body": "Quote from: ETFbitcoin on October 24, 2022, 12:22:33 PMQuote from: Gorilla22 on October 18, 2022, 12:06:17 PMColdCard, Trezor, Foundation Passport is not HW future. Just because your Grandma cannot use them.I have doubt you've used any of those wallet. I agree ColdCard[1] and Passport Foundation[2] isn't that friendly towards non-technical user, although i doubt  [1] https://coldcard.com/docs/beginner[2] https://docs.foundationdevices.com/passport/setupIn case of doubt; check out my review of the Passport 'Founders Edition':https://bitcointalk.org/index.php?topic=5382675.0'Easy setup and usage' was one of the main pros for this device.As well as check out both their devices in the simulator, as explained here:Quote from: n0nce on September 29, 2022, 11:20:03 PMQuote from: DireWolfM14 on September 29, 2022, 09:51:36 PM~[1] Get Ubuntu 22.04.1 ISO and spin up the VM.[...]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}