{
  "id": "topic_5446167",
  "title": "toolateforbtc",
  "author": "toolateforbtc",
  "created_time": "March 24, 2023, 01:36:32 PMLast edit: March 24, 2023, 07:04:06 PM by toolateforbtc",
  "content": "If it sounds too good to be true...  This time it's true     Contact Telegram @hqaccc | @accsempDiscord hqaccc #4408Shop https://notionai.mysellix.ioLooking to top up your Notion balance at a discounted rate?Our Notion Balance Top-Up Service is here to help From us you only pay $150 to get $1000 balance on your own notion accountOr you can buy a ready-to-use account with balanceExample: https://ibb.co/qsjCJ1J You deserve moreDon't settle for paying full priceMaximize your purchasing power & Get the greatest value with us *More denominations are to be added*TAT: Instant - 12 Hours*Discount for bulk purchase As a new seller on this forumwe would offer free trial to a reputable member in exchange for an honest reviewIf anyone's interested please contact usSlot 0/1---I AM A LINE---Happy to announce our first success case (free trial)https://imgtr.ee/images/2023/03/24/9pnnI.png QuoteFor friends who haven't heard of Notion...Notion is a powerful tool used by individuals and organizations alike to stay organized and productive.It allows you to create customizable databases, notes, to-do lists, and more, all in one place.Notion offers a wide range of features that can help streamline your workflow and enhance your productivity,including task management, project management, and note-taking.Upgrading notion premium unlocks even more advanced features like unlimited file uploads,advanced permissions, and priority support.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446167",
  "comments": [
    {
      "author": "Cantsay",
      "created_time": "March 24, 2023, 02:14:00 PM",
      "body": "Op Incase you didn't notice the image you provided as an example or perhaps previous sales you have made has \"notion.so\" has the web link while the link you're providing for your service is \"https://notionai.mysellix.io\". Why's that?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "toolateforbtc",
      "created_time": "March 24, 2023, 02:28:45 PM",
      "body": "Quote from: Cantsay on March 24, 2023, 02:14:00 PMOp Incase you didn't notice the image you provided as an example or perhaps previous sales you have made has \"notion.so\" has the web link while the link you're providing for your service is \"https://notionai.mysellix.io\". Why's that?You can purchase our top-up balance service from our Sellix shop link.Please note that this service is not affiliated with Notion's official website.We are an honest top-up service provider,and to prove our service's validity,we offer a free trial in exchange for an honest review from a reputable Bitcointalk.org memberContact us if you're interested",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "toolateforbtc",
      "created_time": "March 25, 2023, 03:14:31 AM",
      "body": "this is not a bump",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2double0",
      "created_time": "March 25, 2023, 09:57:13 AM",
      "body": "Please adhere the rules of this forum.No bump till 24 hours, and writing that \"This is not a bump\" won't help because all you're doing is bumping this thread without adding anything constructive to your post to keep it above everything else. Even if you want to update everyone on something, you must remember that there is an \"edit\" button here, so please stop shit-bumping here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}