{
  "id": "topic_5410656",
  "title": "Nosirrr",
  "author": "Nosirrr",
  "created_time": "August 21, 2022, 07:28:21 AM",
  "content": "Moin Leute, ich habe noch alte Wallet Datein aus dem Jahr 2015.Es sind \"*****.wallet\" von Bitcoin CoreUnd MultiBit.Die Wallets liegen noch im Format \"Name.wallet\" vor, und nicht im heutigen Format. (wallet.dat)Wie öffne ich die alten Wallets?Mit Bitcoin Core (sync ist fast fertig) kann ich die alte \"XXX.wallet\" nicht einbinden.Habt ihr ne Ahnung?Vielen Dank",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410656",
  "comments": [
    {
      "author": "HeRetiK",
      "created_time": "August 21, 2022, 10:38:13 AM",
      "body": "Hallo Nosirrr!2015 hat das Bitcoin Core Wallet File bereits wallet.dat geheißen, tatsächlich bin ich mir nicht sicher ob das Wallet File jemals einen anderen Dateinamen hatte.Laut diesem Thread aus 2017 ist das Multibit Wallet Format (also das *.wallet File das du hast) auch nicht mit Bitcoin Core kompatibel:https://bitcointalk.org/index.php?topic=1945939.0Das einfachste wird wahrscheinlich sein das *.wallet File mit Multibit zu öffnen und dann die Coins auf ein neues Wallet deiner Wahl zu transferieren.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "August 21, 2022, 11:30:13 AM",
      "body": "Herzlich willkommen bzw. welcome back Nosirrr!Wie HeRetiK schon sagt wird der Weg über Multibit vermutlich am schnellsten zur Lösung führen Falls nicht möglich oder gewünscht kannst du ja gerne nochmal Bescheid geben damit wir eine Alternative suchen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "-doubleU-",
      "created_time": "August 27, 2022, 11:19:56 PM",
      "body": "Quote from: mole0815 on August 21, 2022, 11:30:13 AM~wird der Weg über Multibit vermutlich am schnellsten zur Lösung führen Bei Multibit kann der Weg aber durchaus auch mal sehr lang werden, da diese Wallet ja so einige Probleme hatte. Irgendwo hatte ich dazu schon mal etwas geschrieben und auf einer externen HDD habe ich auch noch ein paar alte Installations Files zu dieser Wallet liegen. Natürlich soll niemand von mir (unbekannter Quelle ) einen Walletinstaller annehmen, aber falls Hilfe benötigt wird, kann ich gern unterstützen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "August 31, 2022, 01:47:38 PM",
      "body": "Quote from: -doubleU- on August 27, 2022, 11:19:56 PMIrgendwo hatte ich dazu schon mal etwas geschrieben und auf einer externen HDD habe ich auch noch ein paar alte Installations Files zu dieser Wallet liegen.Das war dann vermutlich genau hier im Wallet Backup? Recovery möglich? Thread.Hier noch 2 Threads zum Thema Multibit:Wallet geplündertWelches Bitcoin wallet von 2014 nur Logo und orderAlso das Thema sollten wir schon gelöst bekommen Nosirrr",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "-doubleU-",
      "created_time": "August 31, 2022, 09:07:12 PM",
      "body": "Quote from: mole0815 on August 31, 2022, 01:47:38 PMDas war dann vermutlich genau hier im Wallet Backup? Recovery möglich? Thread.~Also das Thema sollten wir schon gelöst bekommen Nosirrr Genau diese Gelegenheit war es, wo ich zuletzt mit dieser Wallet zu tun hatte. Eigentlich ein Stück Software welche so langsam in Vergessenheit geraten könnte bei den ganzen Problemen welche es damit gab, aber man sieht ja das eben doch noch hin und wieder Nachfrage da ist. Daher lösch ich solche alte Installer auch nicht.Wenn jetzt nicht noch ein vergessenes Passwort dazu kommt, sollte man Walletdatei also geöffnet bekommen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}