{
  "id": "topic_5400983",
  "title": "Coin Crypto Price",
  "author": "Coin Crypto Price",
  "created_time": "June 01, 2022, 01:55:08 PM",
  "content": "Hello everyone,I am creating a cryptocurrency project, Coin Crypto Price - MarketCap View https://coincryptoprice.com, I need your suggestions.You can search thousands of Crypto Coins, find Prices, Exchanges and Ico’s!You can see charts, in each currency you can see the projects' websites and their social networks, etc...Leave your comments. Thanks",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400983",
  "comments": [
    {
      "author": "seoincorporation",
      "created_time": "June 01, 2022, 02:46:26 PM",
      "body": "That's a nice user interface +1I would love to see a new column on the main table with the Bitcoin price. I know we can switch between btc and USD, but if you add both you will be one step forward than the competence  Another recommendation is to add referral links to the exchanges, that way you can generate a passive income. and you should run ads on the site, because when it gets massive traffic that will represent a nice income for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "June 02, 2022, 05:55:45 AM",
      "body": "Before giving my own suggestion I would like to congratulate and commend you for launching a tool for the community, it's worth meriting, it's worth praising, I check the tool, and it's like an all in one tool for traders and investors but the best tools or pages are not very visible they are in the bottom of the site.If you can bring those pages to be secondary pages or on top or below the header, it would be great for users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "June 02, 2022, 07:54:16 AM",
      "body": "If your site depends directly on obtaining data from sites such as CMC, I advise you to change the idea completely and start relying on several sources.The interface is beautiful and the way to update the data is interactive, but it does not provide a different model from traditional currency tracking sites.I hope to focus on better currency rankings, more charts, and more technical analysis.In general, your site provides the basics, so I think it is good, but you need a lot to be able to compete.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "June 03, 2022, 07:22:06 AM",
      "body": "There is nothing wrong with it and great of you to try it out. But ask yourself, why would users switch to my site instead of using CoinMarketCap, CoinGecko or any of the other alternatives? You need to figure something out that will make them stay and use your site as source of pricing information.A couple of suggestions:Please add a darker background or at least a day/night switch. I wanted to suggest a price calculator, but noticed there is one when you click on any of the coins + a link at the bottom of the page. I think all links should be visible on the top, not at the bottom of the page. The bottom could be used for TOS, Contact info, Privacy Policy, and that kind of thing.The exchange tabs should contain links to the correct trading pairs on that exchange. That's not the case here. The links only take you to more info about said exchange.Prices are updated in real time on the main page, but when I access Bitcoin's page, for example, it always shows $30,268.00. This number doesn't change and I have tried if a few times. Refreshing does nothing to it either.Consider creating a logo that will be visible at the top.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "June 04, 2022, 07:39:27 PM",
      "body": "Quote from: Coin Crypto Price on June 01, 2022, 01:55:08 PMYou can see charts,It could've been better if it wasn't just limited to a year of data.Found a couple of minor issues on the main page:If you change the price to \"BTC\", it'll show a number higher than 1 for BTCitcoin [screenshot].The \"next and previous\" buttons are missing!You might want to consider adding the following things to your \"Latest Crypto News\" section [it's too plain at the moment]:More sourcesVarious filtering optionsThumbnails and summaries",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coin Crypto Price",
      "created_time": "June 06, 2022, 03:46:04 PM",
      "body": "Hi guys, thanks for your posts and constructive criticism.The site is in an embryonic phase, and some things that I've read I'm also seeing how to do it in the best way,There really is a problem with BTC price when selected, I hadn't noticed that yet.I'll get in touch with the developer about this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "June 06, 2022, 06:54:58 PM",
      "body": "Overall looks good to me, as I can see you do not track data from CMC or CG. Because I searched some coins which have on CMC and CG but not on your site, so assume you are independent. If so, then that's better for you. Everything looks clean except the name, I don't think you should use a dot com after the name on the header. You wrote CoinCryptoPrice.com. I think it will better look if you write \"CoinCryptoPrice\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "June 06, 2022, 07:27:59 PM",
      "body": "Quote from: Coin Crypto Price on June 01, 2022, 01:55:08 PMLeave your comments. ThanksWhile I find the site neat and informative, I've found a bug and now I fear I cannot trust the data you display.Please double check how the things are being stored, calculated and shown, since whatever-BTC is a different market than whatever-USD (and then converting to BTC) and keeping only one market and converting can give odd results.Example: Monero's ATH. The date it tells it's 2018-01-09. In base currency USD it tells 542$. In  BTC it tells 0.0172BTCNow... the thing is that from my research none of that is correct.XMR-BTC ATH seems to have been some 0.031-0.033 BTC in 2018-02-25XMR-USD ATH seems to have been some 475$ in 2021-05-02I've got my data from Yahoo charts, I don't know how accurate they are, but I'm sure they do prove what I want to tell/explain. (CMC has a bit different numbers and dates, but at least they're pretty close.)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coin Crypto Price",
      "created_time": "June 30, 2022, 09:46:10 AM",
      "body": "Quote from: seoincorporation on June 01, 2022, 02:46:26 PMThat's a nice user interface +1I would love to see a new column on the main table with the Bitcoin price. I know we can switch between btc and USD, but if you add both you will be one step forward than the competence  Another recommendation is to add referral links to the exchanges, that way you can generate a passive income. and you should run ads on the site, because when it gets massive traffic that will represent a nice income for you.Hello seoincorporation,thanks for your constructive criticism.I'm keeping the tables on the home page as simple as possible and with the necessary and most essential information, for the home page and also for the website to load faster.Yes, at the moment I only have one referral link, it is on all cryptocurrency pages. Sell and Buy.Thanks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RashidulIR",
      "created_time": "July 02, 2022, 03:07:39 PM",
      "body": "Quote from: Coin Crypto Price on June 01, 2022, 01:55:08 PMHello everyone,I am creating a cryptocurrency project, Coin Crypto Price - MarketCap View https://coincryptoprice.com, I need your suggestions.You can search thousands of Crypto Coins, find Prices, Exchanges and Ico’s!You can see charts, in each currency you can see the projects' websites and their social networks, etc...Leave your comments. ThanksHope the success of your initiative.  I want to give you a suggestion I don't know what it will be like.  We can see many projects but most of them are deceptive.  And it would be nice if you could create a page on your website that would contain the names and proofs of all the fraudulent projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "July 02, 2022, 06:01:04 PM",
      "body": "My suggestion may be strange, but the way to arrange the site because of the market capacity will be understandable if the site is related to market capacity and not price, so re-arranging accordingly may be appropriate for the domain name.The number of people who tracking crypto prices is not a big like before two years, so the number of views may be affected by Bear market, but it is an ideal opportunity to build an audience, so focus on continuous updates, speed of response, and that advertisements are attractive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coin Crypto Price",
      "created_time": "July 10, 2022, 09:09:28 PMLast edit: July 11, 2022, 02:14:30 PM by mprep",
      "body": "Quote from: NeuroticFish on June 06, 2022, 07:27:59 PMQuote from: Coin Crypto Price on June 01, 2022, 01:55:08 PMLeave your comments. ThanksWhile I find the site neat and informative, I've found a bug and now I fear I cannot trust the data you display.Please double check how the things are being stored, calculated and shown, since whatever-BTC is a different market than whatever-USD (and then converting to BTC) and keeping only one market and converting can give odd results.Example: Monero's ATH. The date it tells it's 2018-01-09. In base currency USD it tells 542$. In  BTC it tells 0.0172BTCNow... the thing is that from my research none of that is correct.XMR-BTC ATH seems to have been some 0.031-0.033 BTC in 2018-02-25XMR-USD ATH seems to have been some 475$ in 2021-05-02I've got my data from Yahoo charts, I don't know how accurate they are, but I'm sure they do prove what I want to tell/explain. (CMC has a bit different numbers and dates, but at least they're pretty close.)Hello NeuroticFish,The date we use or API is from coingecko https://www.coingecko.com/en/apiQuote from: robelneo on June 02, 2022, 05:55:45 AMBefore giving my own suggestion I would like to congratulate and commend you for launching a tool for the community, it's worth meriting, it's worth praising, I check the tool, and it's like an all in one tool for traders and investors but the best tools or pages are not very visible they are in the bottom of the site.If you can bring those pages to be secondary pages or on top or below the header, it would be great for users.https://i.imgur.com/CIx2xx7.pngHello robelneo,thanks for your help, can you check now? What do you think?[moderator's note: consecutive posts merged]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "July 11, 2022, 08:57:38 AM",
      "body": "^^ don't make a separate post for every reply you give. I don't know where you get data from, or which API are you using, but you definitely need to change that.First, the charts on the coin page, they are completely useless and non-functional. I looked at the \"exchanges\" tab for Ethereum and I saw some wrong results for the trading volume. some of those reporting fake volumes are on your top 1 page. even on Coingecko, it is not such a result.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "July 11, 2022, 09:01:04 AM",
      "body": "Quote from: examplens on July 11, 2022, 08:57:38 AM^^ don't make a separate post for every reply you give. I don't know where you get data from, or which API are you using, but you definitely need to change that.First, the charts on the coin page, they are completely useless and non-functional. I looked at the \"exchanges\" tab for Ethereum and I saw some wrong results for the trading volume. some of those reporting fake volumes are on your top 1 page. even on Coingecko, it is not such a result.The answer he gave shows that OP doesn't actually care to fix issues, he just made a page and wants people go there, no matter how crappy/wrong the results are.The users will sooner or later find that out and go for the better sources of information. And if he doesn't care, should I?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "July 11, 2022, 11:46:46 AM",
      "body": "Quote from: Coin Crypto Price on July 10, 2022, 09:09:28 PMThe date we use or API is from coingecko https://www.coingecko.com/en/apiAre you sure your developer is using a single API only? I'm not a developer by any means, but perhaps he/she is using multiple APIs without noticing a conflict in certain parts and that might be the reason for inaccurate data...- The issue that I reported last month in regards to BTCitcoin value still exists!Quote from: examplens on July 11, 2022, 08:57:38 AMFirst, the charts on the coin page, they are completely useless and non-functional. Have you tried checking it with different browsers?- I didn't encounter any issues in Chrome.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "July 11, 2022, 12:10:04 PM",
      "body": "Quote from: NeuroticFish on July 11, 2022, 09:01:04 AMThe answer he gave shows that OP doesn't actually care to fix issues, he just made a page and wants people go there, no matter how crappy/wrong the results are.The users will sooner or later find that out and go for the better sources of information. And if he doesn't care, should I?now that I look closer, it's just another WP site with a well-known CMC plugin. it is questionable what the OP can do in terms of improving the functionality of the script itself.Quote from: SFR10 on July 11, 2022, 11:46:46 AMQuote from: examplens on July 11, 2022, 08:57:38 AMFirst, the charts on the coin page, they are completely useless and non-functional. Have you tried checking it with different browsers?- I didn't encounter any issues in Chrome.Checked it on Chrome, and now on Firefox also. There is no difference.Check volume bars, or zoom out/in button (when it appears)at a time when we have very serious similar services on offer, some basic things have to function flawlessly if you want to be at least equal with the competition.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coin Crypto Price",
      "created_time": "July 11, 2022, 09:11:10 PM",
      "body": "Quote from: NeuroticFish on July 11, 2022, 09:01:04 AMQuote from: examplens on July 11, 2022, 08:57:38 AM^^ don't make a separate post for every reply you give. I don't know where you get data from, or which API are you using, but you definitely need to change that.First, the charts on the coin page, they are completely useless and non-functional. I looked at the \"exchanges\" tab for Ethereum and I saw some wrong results for the trading volume. some of those reporting fake volumes are on your top 1 page. even on Coingecko, it is not such a result.The answer he gave shows that OP doesn't actually care to fix issues, he just made a page and wants people go there, no matter how crappy/wrong the results are.The users will sooner or later find that out and go for the better sources of information. And if he doesn't care, should I?Well, after 4 months of work and €800 spent on licenses, server, domain and various SEO services. Optimization, cloudflare, translate, many hours/days wasted solving problems and conflicts, etc... I bought 3 types of php scripts, WP plugins from different manufacturers to see the best. I abandoned over 10 years of CMS Joomla to move to WP! This comment is unfair to say the least.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coin Crypto Price",
      "created_time": "July 11, 2022, 09:25:10 PM",
      "body": "Guys, share the problem with the data, detailed or with screenshots so I can share this information and this post with the plugin manufacturer.Thank you for your help.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "July 12, 2022, 08:49:54 AM",
      "body": "^^ again, don't make a separate post for every reply you give. put all the replies together in one post.Quote from: Coin Crypto Price on July 11, 2022, 09:11:10 PMWell, after 4 months of work and €800 spent on licenses, server, domain and various SEO services. Optimization, cloudflare, translate, many hours/days wasted solving problems and conflicts, etc... I bought 3 types of php scripts, WP plugins from different manufacturers to see the best. I abandoned over 10 years of CMS Joomla to move to WP! This comment is unfair to say the least.you don't need to be upset about every comment.I would say that you have chosen a very complicated path. Do you expect us to test scripts/plugins developed by someone else, and you will pass on all the proposals to them and wait for them to correct them in the official script?now you have a script, which has a lot of flaws (and you can correct very few of them yourself), and you're out of favour by the original developer. Quote from: Coin Crypto Price on July 11, 2022, 09:25:10 PMshare the problem with the data, detailed or with screenshots so I can share this information and this post with the plugin manufacturer.Otherwise, I have seen the identical WP plugin installed on many sites (the developer has already sold it many times) and if the shortcomings have not been corrected so far, I am personally very sceptical that anything will change after your reports.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}