{
  "id": "topic_5432426",
  "title": "baywatch10",
  "author": "baywatch10",
  "created_time": "December 30, 2022, 08:11:34 PM",
  "content": "Καλησπέρα,Γνωρίζει κάποιος κάποια πλατφόρμα η οποιδήποτε άλλον τρόπο που να αγοράζεις bitcoins χωρίς ταυτοποιήση; Δεν θέλω τα biτcoins ATM λόγω απαγορευτικής προμήθειας 8%.Ευχαριστώ",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432426",
  "comments": [
    {
      "author": "BlackHatCoiner",
      "created_time": "December 31, 2022, 08:49:45 AM",
      "body": "Έχουμε και λέμε.Αν θέλεις να αγοράσεις / πουλήσεις μεγάλα ποσά, βρες αγοραστή / πωλητή στο Bisq. Είναι ανώνυμο αλλά θέλει μια μέρα να κάτσεις να διαβάσεις πως λειτουργεί. Έχει κι αυτό ένα fee, αλλά δε συγκρίνεται με το 8% του ATM.Αν θέλεις μικροποσά, διάλεξε το robosats (το link θέλει Tor για να φορτώσει). Επίσης όλα ανώνυμα, και λαμβάνεις τα bitcoins σε lightning. Μηδέν fees.Αν δε σε βολεύει τίποτα από τα δύο, τσέκαρε όλα τα exchanges χωρίς KYC εδώ: https://kycnot.me/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "January 02, 2023, 11:11:05 AM",
      "body": "Quote from: baywatch10 on January 02, 2023, 09:39:01 AMΠώς θα πληρώσω χωρις να φένετε my real identity ;Αυτό μάλλον με μεγάλη δυσκολία θα το βρεις σήμερα-- κι αν το βρεις θα το πληρώσεις ακριβά. Ο μόνος τρόπος για να κρύψεις την ταυτότητά σου είναι να ανταλλάξετε μετρητά με bitcoin. Μπορείς να κάνεις μια πρόταση σε αυτό το sub-forum, ή ακόμη καλύτερα, να κάνεις offer σαν seller στο Bisq (το μοναδικό στην Ελλάδα), και να κανονίσετε να βρεθείτε κάπου στο κέντρο. Quote from: baywatch10 on January 02, 2023, 09:39:01 AMΑν κάνω πληρωμη με paypal η με deibt μέσω agoradesk ή localmonero είναι traceable το transcation; Η PayPal ή η χρεωστική σου θα μπορεί να σε ιχνηλατήσει. Αν ρωτάς αν ο αγοραστής θα μπορεί, πιθανότατα όχι. Δίνεις e-mail ή 16ψήφιο κωδικό. Δε νομίζω να βρεις με PayPal εύκολα όμως, γιατί οι συναλλαγές είναι εύκολα αντιστρέψιμες.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "January 02, 2023, 01:46:21 PM",
      "body": "Quote from: baywatch10 on January 02, 2023, 12:49:26 PMΓιατί με μεγάλη δυσκολια να κρύψεις την ταυτοτητά σου; ..εδω οι χακερς ζητανε λυτρα σε monero και btc και δεν τους πιάνουν ποτέ.Εννοώ είναι δύσκολο να ανταλλάξεις bitcoin για fiat χωρίς να φανερώσεις την ταυτότητά σου (ή έστω κάποιο στοιχείο που μπορεί να σε αποκαλύψει) στον παραλήπτη. Οι hackers που ζητάνε Monero και Bitcoin δεν συνδέουν τη συγκεκριμένη δραστηριότητά τους με τον τραπεζικό τους λογαριασμό. Απλώς όταν θα χρειαστεί να ανταλλάξουν peer-to-peer με κάποιον θα φανερωθεί πως ο Τάδε πούλησε x XMR/BTC και τα έλαβε στον τάδε τραπεζικό λογαριασμό.Quote from: baywatch10 on January 02, 2023, 12:49:26 PMΜπορείς σε παρακαλώ να μου εξηγήσεις πως είναι εύκολα αντιστρέψιμες οταν πληρώνεις  μέσω paypal έναν πωλητη στην νοτια αφρικη και σου στέλνει μέσω πλατφόρμας κρυπτονομίσματα. Πόσο εύκολα είναι αντιστρέψιμο;Δεν ξέρω, δεν έχω ασχοληθεί. Ξέρω ότι οι συναλλαγές PayPal μπορούν να αντιστραφούν μέχρι και για 6 μήνες. Quote from: baywatch10 on January 02, 2023, 12:49:26 PMΑν αγοράσω gift card με μετρητά η και απο το internet και μετά ο πωλητης μου στείλει κρυπτονομίσματα μέσω web πλατφόρμας  agoradesk....εδω νομίζω οτι δεν μπορεί να είναι traceable transaction. Ναι, είναι αρκετά ανώνυμος τρόπος αυτός. Το ίδιο ισχύει και με την Paysafe card. Απλώς δίνεις μετρητά στον ψιλικατζή και όταν θα χρειαστεί να το δώσεις σε κάποιον για bitcoin, δεν ανταλλάζεται κανένα στοιχείο ταυτότητας. Quote from: baywatch10 on January 02, 2023, 12:49:26 PMΔιάβασα οτι τα monero δεν αφήνουν στοιχεία. Τις πλατφόρμες agoradesk και locamonero τις ξέρεις; Εχεις γνώμη για αυτές;Τις ξέρω, αλλά δεν τις έχω χρησιμοποιήσει. Το Monero είναι ανώνυμο, ναι. Αυτό σημαίνει πως εταιρίες που αναλύουν την αλυσίδα στο bitcoin δεν μπορούν να κάνουν το ίδιο και για αυτό.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "January 03, 2023, 05:53:19 PM",
      "body": "Quote from: baywatch10 on January 03, 2023, 05:28:54 PMΑν έχω ενα paypal λογαριασμό που δεν έχει τα πραγματικά στοιχεία μου (αλλα συνδέεται με τον πραγματικο μου) και πληρώσω τον πωλητη, τότε ο πωλητής δεν θα ξέρει ποιος είμαι δηλαδη τα πραγματικα μου στοιχεια.Φαντάζομαι όμως ότι ο πραγματικός σου λογαριασμός συνδέεται με τον λογαριασμό που θα πληρώσεις τον πωλητή. Η PayPal γνωρίζει δηλαδή τη συναλλαγή που μεταξύ της ταυτότητας του πωλητή και της δικιάς σου.Quote from: baywatch10 on January 03, 2023, 05:28:54 PMΑυτο με το 6 μηνες στην paypal μπορω να το βρώ;https://www.paypal.com/us/brc/article/bank-reservals-guide (δε βρίσκω το λινκ για τους 6 μήνες). Αν στείλεις σε \"friends & family\" δεν έχεις δικαίωμα για chargeback βέβαια, απ' όσο γνωρίζω. Quote from: baywatch10 on January 03, 2023, 05:28:54 PMΣτην paysafe θελει ταυτότητα για να ανοίξεις λογαριασμό.Ναι αλλά δε θέλει για να αγοράσεις. Δίνεις μετρητά. Δε μπορεί η paysafe να γνωρίζει αν ο κωδικός που χρησιμοποίησες τον αγόρασες εσύ ο ίδιος ή κάποιος άλλος που στον πούλησε, όπως και ο πωλητής δε γνωρίζει το paysafe account σου. Quote from: baywatch10 on January 03, 2023, 05:28:54 PMΚάνεις εναν λογαριασμό που δεν βάζεις κανενα αληθινό στοιχείο στο agoradesk και αγοράζεις μέσω paypal (αληθινο paypal λογαριασμο ή ένα λογαριασμό paypal με διαφορετικά στοιχεια)  monero ή διαφορετικά crypto και επιβαιβεώνεις το transaction μέσα απο την ανωνυμη πλατφόρμα agoradesk.  Εδω μπορεις σε παρακαλώ να μου εξηγησεις πως γίνετε αντστρέψιη η συναλλαγή;Μόλις στείλεις με PayPal τα χρήματα στον XMR seller; Δεν έχω ζητήσει ποτέ reversal, αλλά γνωρίζω πως επικοινωνείς μαζί με την PayPal κάπως και το ζητάς. Αν έχεις πιστωτική κάρτα συνδεδεμένη, απλά κάνεις μια κλήση στην εταιρία (VISA, Mastercard κ.ο.κ).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bmxakias",
      "created_time": "January 11, 2023, 10:16:25 PM",
      "body": "Σε ποια πόλη είσαι; Αν ήμαστε κοντά ίσως μπορώ να εξυπηρετήσω εγώ. Τσέκαρε την αγγελία που έχω εδώ στο forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}