{
  "id": "topic_5470526",
  "title": "Abiky",
  "author": "Abiky",
  "created_time": "October 16, 2023, 11:34:42 AM",
  "content": "Among the good-old coins listed on the market today, which one do you prefer the most? Litecoin or Dogecoin? The former is often used for serious cross-border payments at a fraction of the cost, while the latter is used more for micropayments/tipping. Despite these differences, it's no secret that DOGE is faster and cheaper to use than LTC itself (Dogecoin's block time is lower than Litecoin's, while market prices are cheaper). I'd choose both as they're tried-and-tested blockchain networks with decentralization and security/reliability in mind.What would be your pick? And why did you choose that coin in the first place? Your input would be greatly appreciated. Thank you.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470526",
  "comments": [
    {
      "author": "barhavsky",
      "created_time": "October 16, 2023, 12:48:24 PM",
      "body": "Quote from: Abiky on October 16, 2023, 11:34:42 AMAmong the good-old coins listed on the market today, which one do you prefer the most? Litecoin or Dogecoin? The former is often used for serious cross-border payments at a fraction of the cost, while the latter is used more for micropayments/tipping. Despite these differences, it's no secret that DOGE is faster and cheaper to use than LTC itself (Dogecoin's block time is lower than Litecoin's, while market prices are cheaper). I'd choose both as they're tried-and-tested blockchain networks with decentralization and security/reliability in mind.What would be your pick? And why did you choose that coin in the first place? Your input would be greatly appreciated. Thank you. I prefer Dogecoin rather than Litecoin, even though Dogecoin is a meme coin, but I have often used Dogecoin to make transactions and in my opinion transactions using Dogecoin are very fast and of course the gas fees are also very cheap, so if one day cryptocurrency will become a currency that legal, so I'm sure there will be many people or companies using Dogecoin for transactions, because transactions using Dogecoin are very fast and cheap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "atamism",
      "created_time": "October 16, 2023, 01:01:16 PM",
      "body": "Quote from: Abiky on October 16, 2023, 11:34:42 AMAmong the good-old coins listed on the market today, which one do you prefer the most? Litecoin or Dogecoin? The former is often used for serious cross-border payments at a fraction of the cost, while the latter is used more for micropayments/tipping. Despite these differences, it's no secret that DOGE is faster and cheaper to use than LTC itself (Dogecoin's block time is lower than Litecoin's, while market prices are cheaper). I'd choose both as they're tried-and-tested blockchain networks with decentralization and security/reliability in mind.What would be your pick? And why did you choose that coin in the first place? Your input would be greatly appreciated. Thank you. I think I'll go with Litecoin, for my personal preference Doge isn't that good coin. It's just that it came from meme and who's gonna take that seriously? Yup, Doge built his name for hype and that's it. It just ended up like that. I know a person who invested her money in Doge and regretted it, I warned her about Doge and she doesn't listen to me. Her money disappeared in thin air.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "October 16, 2023, 01:05:19 PM",
      "body": "Quote from: Abiky on October 16, 2023, 11:34:42 AMWhat would be your pick? And why did you choose that coin in the first place? Your input would be greatly appreciated. Thank you. Personally I didnt use any of these two yet but Ive traded them before on exchange. I am fond of using bitcoin and other altcoins instead of old coins so I didnt know the feeling of using it. But some of my friends are using dogecoin as its very fast and got small fees. Not sure if comparable to L1 if its still much cheaper though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "@sriyan",
      "created_time": "October 16, 2023, 01:16:01 PM",
      "body": "Quote from: Abiky on October 16, 2023, 11:34:42 AMAmong the good-old coins listed on the market today, which one do you prefer the most? Litecoin or Dogecoin? The former is often used for serious cross-border payments at a fraction of the cost, while the latter is used more for micropayments/tipping. Despite these differences, it's no secret that DOGE is faster and cheaper to use than LTC itself (Dogecoin's block time is lower than Litecoin's, while market prices are cheaper). I'd choose both as they're tried-and-tested blockchain networks with decentralization and security/reliability in mind.What would be your pick? And why did you choose that coin in the first place? Your input would be greatly appreciated. Thank you. I will go with the litecoin. The dogecoin is just a meme coin. it will popular the awareness about the crypto in the community. but the litecoin has real utility rather than the dogecoin. When it comes to decentralization, litecoin is more decentralize than the dogecoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dockrun",
      "created_time": "October 16, 2023, 01:28:00 PM",
      "body": "I prefer doge, because Elon Musk pumps it lol",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "October 16, 2023, 01:33:33 PM",
      "body": "Quote from: barhavsky on October 16, 2023, 12:48:24 PMI prefer Dogecoin rather than Litecoin, even though Dogecoin is a meme coin, but I have often used Dogecoin to make transactions and in my opinion transactions using Dogecoin are very fast and of course the gas fees are also very cheap, so if one day cryptocurrency will become a currency that legal, so I'm sure there will be many people or companies using Dogecoin for transactions, because transactions using Dogecoin are very fast and cheap.I thought I was the only one, literally, who noticed the fast transaction speed of Dogecoin. The first time I used it a few years again, I was shocked because the transfer I made confirmed even before I could flip the site to check it. Not even BSC transactions come any close to its speed and ease of confirmation. As for Litecoin, I first knew of it when it was $4 but for one thing or the other I haven't keyed into buying and keeping more than a handful of it. Just a few weeks ago I tried again and bought a few days to its halving but the outcome has been regretful as the coin slumped after that event. It has continued on a steep since then.I will choose Dogecoin any day above Litecoin or any other alts when it comes to payment option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "October 16, 2023, 01:46:42 PM",
      "body": "Quote from: Abiky on October 16, 2023, 11:34:42 AMAmong the good-old coins listed on the market today, which one do you prefer the most? Litecoin or Dogecoin? The former is often used for serious cross-border payments at a fraction of the cost, while the latter is used more for micropayments/tipping. Despite these differences, it's no secret that DOGE is faster and cheaper to use than LTC itself (Dogecoin's block time is lower than Litecoin's, while market prices are cheaper). I'd choose both as they're tried-and-tested blockchain networks with decentralization and security/reliability in mind.What would be your pick? And why did you choose that coin in the first place? Your input would be greatly appreciated. Thank you. They are the coins that were still here before Ethereum made its entrance into the Crypto world they are two coins that were considered to be Bitcoin's rival but that was then they had their own community and were still considered to have a place in the market, I like both of them where Bitcoin is you can also find these two coins, in exchange and on casinos and on market place, they have built their niche in the community.Right now Dogecoin has an edge because the meme coins are trending now and because they got backed by the richest man on Earth Elon MusK, maybe Litecoin will be put in the spotlight but if the meme trends are over Litecoin will have an edge against DogecoinBut these two coins are worth keeping in your portfolio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "forexandcryptoauditor",
      "created_time": "October 16, 2023, 01:51:48 PM",
      "body": "My first preference will be doge coin. Having a great utility is one of the most important thing of any coin or project. Even though litecoin is more aggressive in that part from doge coin, later one is having huge community and kind a backed up by Elon Musk along with nonpayment utility. It also offers less gas fee for its transactions which is also one of the important factor.From investment perspective, doge coin is way better than litecoin if we look at the growth patterns.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fmz89",
      "created_time": "October 16, 2023, 02:06:30 PM",
      "body": "no thanks for both, doge already pump really hard, and ltc always like that from begining its like to long for gain some percentageeither way for safety return ltc seems ok at current price. and yes doge maybe get some love again from elon. but i wouldnt bet to move like before",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeffBrad12",
      "created_time": "October 16, 2023, 02:46:31 PM",
      "body": "I will be honest, when it comes to investing in these meme coin i would always avoid coin like doge thats basically just meme coin that has reached its peak, but when it comes to investing and i'm limited to only 2 options mentioned above, then its no brainer that i would choose doge for the simple fact that it got more fluctuation therefore could easily make profit from it than the other.I can't really see much massive rise potential when it comes to litecoin and i personally didn't think it will have yet another massive bullrun either.the technology is obsolete with this coin, smart contract based blockchain are better, meanwhile doge coin price was driven mainly by hypes not the technology.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$crypto$",
      "created_time": "October 16, 2023, 02:52:04 PM",
      "body": "Both coins are used only for gambling. Casinos have widely integrated the two coins because they have fast transaction speeds and low fees.There are also those with the intention of investing in both coins no problem except doge which is called gambling because it does not know when it will go up unless it only relies on the hype of Elon Musk, so far that's what I use for gambling - because with both coins the withdrawals and deposits are very small.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "big kid",
      "created_time": "October 16, 2023, 02:53:58 PM",
      "body": "I prefer Litecoin. I mean, DOGE is great and all, but it's a memecoin, and it's time has passed. But I'm not investing in LTC, I'm using it for cheap transactions. I'm sure DOGE is not much worse, but I'm used to LTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_Hiloveua_",
      "created_time": "October 16, 2023, 03:03:35 PM",
      "body": "Personally I like both LTC and DOGE coins. Considering some aspect between LTC and DOGE coin I would give LTC more importance because LTC has higher transaction fees but it pumps better in futures which helps traders to get huge profits. On the upside, the transaction fee of DOGE coin is comparatively very low and very fast, according to this aspect, DOGE coin is very good. Although doge coin has good ranking and it will give good traders less profit for meme coin. This is why I think people will use DOGE coin more than LTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "October 16, 2023, 03:30:10 PM",
      "body": "Quote from: Abiky on October 16, 2023, 11:34:42 AMAmong the good-old coins listed on the market today, which one do you prefer the most? Litecoin or Dogecoin? The former is often used for serious cross-border payments at a fraction of the cost, while the latter is used more for micropayments/tipping. Despite these differences, it's no secret that DOGE is faster and cheaper to use than LTC itself (Dogecoin's block time is lower than Litecoin's, while market prices are cheaper). I'd choose both as they're tried-and-tested blockchain networks with decentralization and security/reliability in mind.What would be your pick? And why did you choose that coin in the first place? Your input would be greatly appreciated. Thank you. Just as you, I'll choose both.Litecoin is the silver Bitcoin and up to now is still one of the top coins. It has a solid foundation and community that even Lee is no longer around this coin, it's still moving on.I think projects that have been built and has got a solid community will stay regardless of what type of coin they are. And Litecoin is just one of those few that are still up til' now.Dogecoin is good and it has started the craze for meme coins but talking about fees and speed, no doubt it's one that belongs to the gang.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "October 16, 2023, 04:23:39 PM",
      "body": "I personally won’t choose either but for the sake of the topic, I’d say Litecoin has an advantage. Ofcourse Doge has larger demand nowadays because of the hype created by meme tokens. But to put it aside, Litecoin has been in this industry for years which for me, adds credibility from investing into it. Dogecoin is indeed more profitable but I just cannot gauge its volatility which is most of the time controlled by whales and FOMOs, more than established coins in this industry. Choosing between the two relies on the purpose. If it is with more profit then Doge, but if it is some sort of market sustainability then I think Litecoin would be a good choice as well. Again, have no investment on these two.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "October 16, 2023, 04:28:36 PM",
      "body": "Quote from: Abiky on October 16, 2023, 11:34:42 AMAmong the good-old coins listed on the market today, which one do you prefer the most? Litecoin or Dogecoin? The former is often used for serious cross-border payments at a fraction of the cost, while the latter is used more for micropayments/tipping. Despite these differences, it's no secret that DOGE is faster and cheaper to use than LTC itself (Dogecoin's block time is lower than Litecoin's, while market prices are cheaper). I'd choose both as they're tried-and-tested blockchain networks with decentralization and security/reliability in mind.What would be your pick? And why did you choose that coin in the first place? Your input would be greatly appreciated. Thank you. Of course Litecoin. Dogecoin has completely lost its credibility and utilitarian properties. This is largely thanks to Ilon Musk. DOGE used to be a convenient tool for transferring value between exchanges, but now it's not exactly profitable. The cost of transactions can be as high as 50 cents. Litecoin allows transfers for a few cents and the speed of transaction confirmation is extremely fast. DOGE has now become synonymous with manipulation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "October 16, 2023, 04:49:43 PM",
      "body": "Looks like DogeCoin has had a huge impact in the last few years and it is because Elon Musk always promoted it throughout these years, But with the constant update, Litecoin is still there and worth investing but not really recommendable because you can always choose Bitcoins for the high chance of success in your investment. Nevertheless, this is not an easy investment because both are tricky and you need to get the right timing when to sell your Doge or LTC because their price just suddenly decreases most of the time, especially Doge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "October 16, 2023, 05:11:49 PM",
      "body": "Quote from: Abiky on October 16, 2023, 11:34:42 AMAmong the good-old coins listed on the market today, which one do you prefer the most? Litecoin or Dogecoin? The former is often used for serious cross-border payments at a fraction of the cost, while the latter is used more for micropayments/tipping. Despite these differences, it's no secret that DOGE is faster and cheaper to use than LTC itself (Dogecoin's block time is lower than Litecoin's, while market prices are cheaper). I'd choose both as they're tried-and-tested blockchain networks with decentralization and security/reliability in mind.What would be your pick? And why did you choose that coin in the first place? Your input would be greatly appreciated. Thank you. I used to use them moving money between exchanges when there wasn't any other good coins that exchanges had adopted. First i used litecoin as i didn't trust doge. But after seeing the speed, cost and liquidity of it, it came a no-brainer to choose that. I would convert to it to something else anyway. It was just for transfers.These days, if i still would have to choose, it would be doge unless it would get slow and expensive at some point. But i doubt it would get used that much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kentrolla",
      "created_time": "October 16, 2023, 06:47:58 PM",
      "body": "I would choose Litecoin if the transaction amount is huge as I cannot risk transaction of huge amount at the mercy of an meme coin which can pump to 10x or dump to zero at anytime, I have used Litecoin in the past when they were not many lightening speed transaction options available and I know Doge is cheaper and faster than LTC but as I said if it's higher amount I would go with LTC and if it's smaller transaction I will go ahead with Doge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}