{
  "id": "topic_5460869",
  "title": "Vivageneviv",
  "author": "Vivageneviv",
  "created_time": "July 24, 2023, 09:42:49 AM",
  "content": "I have had Worldcoin on my radar for quite a while and I believe it's features and benefits will bring about a huge adoption, making it a token to watch.Worldcoin aims to create a new identity and financial network owned by everyone, and introduces a unique feature, World ID- a global digital identity system that will bring the much needed solution to various identity-related issues using Iris scanner.The app also facilitates seamless transactions using the native token WLD, as well as other cryptocurrencies and stablecoins.I would like to know what you guys think about the project and possible CEX listsings for the token WLD",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460869",
  "comments": [
    {
      "author": "X-ray",
      "created_time": "July 24, 2023, 11:40:15 AM",
      "body": "This token already exist since a few years ago. This is pretty much the same like pi coin. WLD token being airdropped for anyone who was able scanning their qr code through orb. Binance, bybit, kucoin and many exchange sites already listed this coin. It's also available in CMC right now. I remember that a member of this coin said that worldcoin is exist to change the world which is so an usual statement that came from the supporter of garbage tokens. Look at how much token owned by the team. I don't even know why so many venture capitals were investing in this shit. Irish scanner is not something new in this world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "July 24, 2023, 11:55:14 AM",
      "body": "Well! if they won't stop developing and updating it until it becomes superior to its competitors, then their project will be successful because this is one of the unique ideas we have in this industry and it could also solve a world problem which is identity theft which is common in some other countries and in my country as well because I know someone that has her identity stolen without her knowing about it, she already became OFW without leaving the country because of it. If they gonna solved these kinds of problems, their coins will also be famous with it in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "timoshani",
      "created_time": "July 24, 2023, 01:08:25 PM",
      "body": "World coin, it seems as very perspective. But what is about of it future listing. Where will this token trading? Also, I didn't find any info about main features of WorldCoin. Please, give the url, where can I read more about this coin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "July 24, 2023, 01:35:16 PMLast edit: December 27, 2023, 06:02:16 PM by Wiwo",
      "body": "Quote from: timoshani on July 24, 2023, 01:08:25 PMWorld coin, it seems as very perspective. But what is about of it future listing. Where will this token trading? Also, I didn't find any info about main features of WorldCoin. Please, give the url, where can I read more about this coinThe thng is that the project  worldcoin has been around for some years now and my recent findings have shown that the team holds a large portion of these coins making them be in total control which is a bigger risk to the success of the project, although the general idea behind the project sounds good, then also a lot of centralization have jeopardized that efforts, instead of focusing on the on developing the project, the team was busy allocating tons of total coins to themselves and this has really slow down the past of the project development.Even though loads of big exchanges have listed the coin, its value has struggled in the market, which is an indication that the team is really getting involved and interfering with the coin development or market growth, and that practice could have a long-term negative effect on the project and also could affect investors total grows profits since the merging between losing vs profits is wider and holding the coin at any point put you into greater risk of losing than profits even on the long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "July 24, 2023, 03:51:29 PM",
      "body": "At first I thought it was just another shitcoin with a claim, but then I looked at the statistics and was surprised. Trading started only today and the project was invested by large investors for 115 million dollars. Now I would not buy this token as you can overpay a lot, the market can expect a correction and this token can also correct. Not financial advice, personally my guesses. They invested well in marketing, the token is already traded on all top exchanges, even binance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vivageneviv",
      "created_time": "July 24, 2023, 04:23:00 PM",
      "body": "Quote from: timoshani on July 24, 2023, 01:08:25 PMWorld coin, it seems as very perspective. But what is about of it future listing. Where will this token trading? Also, I didn't find any info about main features of WorldCoin. Please, give the url, where can I read more about this coin I'm not sure link sharing is allowed on the thread, but if it's ok with you, you can share your twitter/discord/ telegram handle so I can cast more light on the project",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chibaba",
      "created_time": "July 24, 2023, 04:55:27 PM",
      "body": "Quote from: timoshani on July 24, 2023, 01:08:25 PMWorld coin, it seems as very perspective. But what is about of it future listing. Where will this token trading? Also, I didn't find any info about main features of WorldCoin. Please, give the url, where can I read more about this coinThe token is already trading on few top CEXes including Binance and particularly Bitget who seems to have healthy liquidity and reward campaign to celebrate its listing. The OP also seems to have highlighted the main features of the project and i suggest you visit their website for further info since url sharing isn't allowed here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "July 24, 2023, 05:10:25 PM",
      "body": "Is this the OpenAI's token?I've just seen the news but don't have much information about it. So, I just looked at the few details that I may be interested with. I think if the developer of it which is part of OpenAI doesn't have a name.There's not going to be much attention on it because even before them, there have been a lot of AI projects already launched before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mrbluntzy",
      "created_time": "July 24, 2023, 05:13:57 PM",
      "body": "I noticed that this project had some good feature and have attracted huge investors, so I also predicted that the coin was going to be bullish after it's listed. I   did not follow the news for the world coin my I was surprised to see it on Binance exchange today trading on the range of $5, while it was listed with $0.15, I am happy that I did not buy at $4 or $5 because I would have lost my asset to volatility because the price has fall from $5 to $2. This coin seems to be a good one but we can't predict altcoins and know the one that can become a shitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "July 24, 2023, 05:18:03 PM",
      "body": "Quote from: Vivageneviv on July 24, 2023, 09:42:49 AMWorldcoin aims to create a new identity and financial network owned by everyone, and introduces a unique feature, World ID- a global digital identity system that will bring the much needed solution to various identity-related issues using Iris scanner.How on earth a token will solve identity related issues? What is world ID? Why a private corporation will be allowed to create a global identity system if possible? It can be misused quite easily. It seems Sam Altman is one of the board members of this coin. It's kind of funny when the creator of a large scale AI program talks about having a more human internet. Sound oxymoron.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nonstopspider",
      "created_time": "July 24, 2023, 05:58:45 PM",
      "body": "Quote from: Chibaba on July 24, 2023, 04:55:27 PMQuote from: timoshani on July 24, 2023, 01:08:25 PMWorld coin, it seems as very perspective. But what is about of it future listing. Where will this token trading? Also, I didn't find any info about main features of WorldCoin. Please, give the url, where can I read more about this coinThe token is already trading on few top CEXes including Binance and particularly Bitget who seems to have healthy liquidity and reward campaign to celebrate its listing. The OP also seems to have highlighted the main features of the project and i suggest you visit their website for further info since url sharing isn't allowed here.The project got so much hype for having Devs of ChatGPT and also the free tokens of the ORB (if you were lucky to encounter one on the streets of your country). By the way the second CEX has a deposit event to share 15K of WLD so if you want to trade the token, that is a solid option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nonstopspider",
      "created_time": "July 24, 2023, 06:00:21 PM",
      "body": "Quote from: jossiel on July 24, 2023, 05:10:25 PMIs this the OpenAI's token?I've just seen the news but don't have much information about it. So, I just looked at the few details that I may be interested with. I think if the developer of it which is part of OpenAI doesn't have a name.There's not going to be much attention on it because even before them, there have been a lot of AI projects already launched before.Yes it is, (openAI devs are behind this, not all)the head of OpenAI is Sam Altman as avikz said",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "July 24, 2023, 06:33:54 PM",
      "body": "I am avoiding this like a plague. Not only they are exploiting developing countries, but you would have to give your biometric data to them? This is going to be a failed attempt to ride on their fame. You only need to look at tokenomics to see that fully diluted valuation currently is $21,750,522,917. Thats insane! In comparison, fully diluted valuation of ADA is $13,644,285,510It's going to be a horrible investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "July 24, 2023, 07:10:31 PM",
      "body": "Quote from: Nonstopspider on July 24, 2023, 06:00:21 PMQuote from: jossiel on July 24, 2023, 05:10:25 PMIs this the OpenAI's token?I've just seen the news but don't have much information about it. So, I just looked at the few details that I may be interested with. I think if the developer of it which is part of OpenAI doesn't have a name.There's not going to be much attention on it because even before them, there have been a lot of AI projects already launched before.Yes it is, (openAI devs are behind this, not all)the head of OpenAI is Sam Altman as avikz saidAlright. I thought that it's just only Sam and that's why his involvement did matter a lot from deciding to get in touch with this project. But I won't be surprised if something like hype dies eventually for this project.If there's an actual integration on this project like the whole company relies on this token, that's gonna be something else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jacafbiz",
      "created_time": "July 24, 2023, 07:19:34 PM",
      "body": "Quote from: X-ray on July 24, 2023, 11:40:15 AMThis token already exist since a few years ago. This is pretty much the same like pi coin. WLD token being airdropped for anyone who was able scanning their qr code through orb. Binance, bybit, kucoin and many exchange sites already listed this coin. It's also available in CMC right now. I remember that a member of this coin said that worldcoin is exist to change the world which is so an usual statement that came from the supporter of garbage tokens. Look at how much token owned by the team. I don't even know why so many venture capitals were investing in this shit. Irish scanner is not something new in this world. This is my own concern too, why do we have all these VCs' support the project, I don't know what they want to gain investing into the project. I know people want free money, and easily they will give them their biometrics free of charge, but this project is everything Crypto stands for. If the price pumped, all these concerns will die down very quickly, but I don't see the need to hold the tokens",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "July 24, 2023, 10:58:30 PM",
      "body": "Quote from: jossiel on July 24, 2023, 05:10:25 PMIs this the OpenAI's token?I've just seen the news but don't have much information about it. So, I just looked at the few details that I may be interested with. I think if the developer of it which is part of OpenAI doesn't have a name.There's not going to be much attention on it because even before them, there have been a lot of AI projects already launched before.It's not affiliated with OpenAI officially. They have some separation of concerns being that Worldcoin is inherently a crypto project.With the worldcoin launch earlier today, it's clear that we still have a very long way to go to achieve true decentralization in this space. Worldcoin has ridden on the narrative that Bitcoin is owned by just a few rich people whereas they didn't have any public sale (just private investors, Sam Altman has access to yCombinators investors).Ironically, Sam created OpenAI that resulted in the AI problem vs humanity and then he created worldcoin. So I see it this way:create a problem -> create the solution and sell it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "samcrypto",
      "created_time": "July 24, 2023, 11:04:05 PM",
      "body": "Quote from: Chibaba on July 24, 2023, 04:55:27 PMQuote from: timoshani on July 24, 2023, 01:08:25 PMWorld coin, it seems as very perspective. But what is about of it future listing. Where will this token trading? Also, I didn't find any info about main features of WorldCoin. Please, give the url, where can I read more about this coinThe token is already trading on few top CEXes including Binance and particularly Bitget who seems to have healthy liquidity and reward campaign to celebrate its listing. The OP also seems to have highlighted the main features of the project and i suggest you visit their website for further info since url sharing isn't allowed here.This could be more interesting if that World coin really solves the issues about the human and AI.I'm still learning about this project as it recently gain the spot from the public and have some hype as well. I'm still wondering how a coin can really help the humanity with regards to this issue. Anyway, the liquidity is ok but the volume is just normal, any future update from this project?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "asriloni",
      "created_time": "July 24, 2023, 11:36:12 PM",
      "body": "Quote from: timoshani on July 24, 2023, 01:08:25 PMWorld coin, it seems as very perspective. But what is about of it future listing. Where will this token trading? Also, I didn't find any info about main features of WorldCoin. Please, give the url, where can I read more about this coinIt's not so difficult in visiting CMC and then you can use search worldcoin there. I give you the link https://coinmarketcap.com/currencies/worldcoin-org/The price is consistently dropping. The inflation already projected to be around 1.5% every year but im not feeling so good with it. I saw that if 75% from total tokens dedicated to the users but im not sure what kind of task that will available in the future. It's caused by orb was only available in the several countries. There are so many countries that didn't have orb to be a part of ecosystem. A coin that claimed to help humanity to be even better. The vision that owned by this project seems BS. https://worldcoin.org/cofounder-letter",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "July 24, 2023, 11:53:12 PM",
      "body": "The price of the world coin when it was first listed on exchanges was extremely not convincing and driven only by hype, the price of the world coin reached above $3 a few hours after it was listed on some centralized exchanges.For me, it will still go down, the price right now is too expensive for Worldcoin. I'm looking forward on sub $1 price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}