{
  "id": "topic_5473651",
  "title": "PrivacyG",
  "author": "PrivacyG",
  "created_time": "November 10, 2023, 09:01:05 PM",
  "content": "Some printers are known to include watermarks on printed pages for further identification of the device used to print.  This is Privacy concerning.  I guess you can understand why.Today we have Smart phones though.  What is known is that they leave EXIF information on pictures we take with the camera.  EXIF is easy to erase.  Particularly if you have a Linux Operating System such as Tails.  Does any body here know of any proof that these photos ALSO have some kind of other 'watermark' similar to those Machine Identification Codes we saw in printers?I imagine this would be a number of pixels arranged in a certain spot that reveal identification of the device used to take photos with.  Or something like that.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473651",
  "comments": [
    {
      "author": "Ucy",
      "created_time": "November 14, 2023, 08:31:03 AM",
      "body": "Quote from: PrivacyG on November 10, 2023, 09:01:05 PMSome printers are known to include watermarks on printed pages for further identification of the device used to print.  This is Privacy concerning.  I guess you can understand why.Today we have Smart phones though.  What is known is that they leave EXIF information on pictures we take with the camera.  EXIF is easy to erase.  Particularly if you have a Linux Operating System such as Tails.  Does any body here know of any proof that these photos ALSO have some kind of other 'watermark' similar to those Machine Identification Codes we saw in printers?I imagine this would be a number of pixels arranged in a certain spot that reveal identification of the device used to take photos with.  Or something like that.In regards to the bolded: it'll be hard to know since alot of the softwares and hardware companies aren't open source. And they tend to follow certain standards that aid governments in tracking down people who may try to use their products to harm society. There could be way more hidden tech/features people are not aware of that are utilized by government agents to aid in criminal investigations. It's just better to use open-source stuff when doing nothing immoral that needs to be privacy protected",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "November 14, 2023, 05:24:54 PM",
      "body": "Quote from: Ucy on November 14, 2023, 08:31:03 AMIn regards to the bolded: it'll be hard to know since alot of the softwares and hardware companies aren't open source. And they tend to follow certain standards that aid governments in tracking down people who may try to use their products to harm society. There could be way more hidden tech/features people are not aware of that are utilized by government agents to aid in criminal investigations. It's just better to use open-source stuff when doing nothing immoral that needs to be privacy protected I do not get your message.How am I supposed to use Open Source stuff in my case.  Why involve the immoral part.  I only asked if there was proof of such thing.There are some Open Source Smart phones out there.  But they lack a lot of functionality and have big issues.  Some of them like Librem 5 are not even released yet.  Anyway.  I do not know if their phone camera is Open Source too.  I am curious if they have ever been caught stamping watermarks on photos or videos in some ways besides EXIF.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}