{
  "id": "topic_5437647",
  "title": "raja9167",
  "author": "raja9167",
  "created_time": "February 01, 2023, 02:29:20 PM",
  "content": "Are you a NFT and Domain holder ?What you think about NFTs and Domains Future?Which Network NFTs and Domains you are currently holding and why?Eth, Bsc,polygon,  Sol, Aptos?I am holding bsc and polygon network's NFTs and domains because of the Transection fees are to low in these two Networks",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437647",
  "comments": [
    {
      "author": "o48o",
      "created_time": "February 01, 2023, 06:00:20 PM",
      "body": "Quote from: raja9167 on February 01, 2023, 02:29:20 PMAre you a NFT and Domain holder ?What you think about NFTs and Domains Future?Which Network NFTs and Domains you are currently holding and why?Eth, Bsc,polygon,  Sol, Aptos?I am holding bsc and polygon network's NFTs and domains because of the Transection fees are to low in these two NetworksETH and Polygon. I am collecting and flipping with Eth mostly because that's where all the whales are. Although i must admit that SOL and DeGods got me by surprise. I was sure it would be just full of crap. When chain is cheap enough to use it will attract a lot of shitcoins and scammers as making a project doesn't cost a penny and entry price curve for newbs to enter is pretty low.But i am looking at newcomers as well when ever i found out about them. Just to see what the competition is, and because early users are often rewarded later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cytpoway121",
      "created_time": "February 01, 2023, 07:10:14 PM",
      "body": "Quote from: raja9167 on February 01, 2023, 02:29:20 PMAre you a NFT and Domain holder ?What you think about NFTs and Domains Future?Which Network NFTs and Domains you are currently holding and why?Eth, Bsc,polygon,  Sol, Aptos?I am holding bsc and polygon network's NFTs and domains because of the Transection fees are to low in these two NetworksPlease do make sure you are not just holding nfts for the sake of it. For me, i have nfts in the POLYGON network which are long terms; while i flip nfts on the ethereum network i.e i buy low and sell high as soon as i can. In Polygon, i have the phaver lens nft, bebop events nft and couple of others. Your can also check up Arbitrum nfts; equally cheap",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ItsCrafty",
      "created_time": "February 01, 2023, 07:19:38 PM",
      "body": "Quote from: raja9167 on February 01, 2023, 02:29:20 PMAre you a NFT and Domain holder ?Yes I am holding NFT and many domain from different projects. Most of them are available in polygon while Bsc, Ethereum and optimism also QuoteWhat you think about NFTs and Domains Future? There are lot of domain and NFt projects and only few if them will be succes. It's all depends update n popularity and Usecase. If good Usecase is introduced then we may expect good trend otherwise I think theirs future is not good.QuoteI am holding bsc and polygon network's NFTs and domains because of the Transection fees are to low in these two NetworksYou should hold some NFTs and Domain I. Ethereum also. There are many chances to recieve free Airdrops while you holding Ethereum NFTs and you should not missed this opportunity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "February 01, 2023, 09:04:27 PM",
      "body": "IMO, NFTs trend is over.I don't like NFTs at all because how the order book and everything is hard for us in case want to exit the project. Holding NFTs for Instrument Asset is not a suitable and good things, because it's only a picture.See now the old NFTs who are reaching all-time high. How is going ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "February 01, 2023, 10:56:23 PM",
      "body": "I don't plan on getting a domain yet but I've been interested on Unstoppable Domains for some time. I may not be too much of a fan of .nft right now but I still like the concept of adding a crypto sounding suffix into your site. It's also something that you can use for yourself or just hold on to and sell in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FreeZeroCoin",
      "created_time": "February 03, 2023, 08:23:18 AM",
      "body": "Quote from: ryzaadit on February 01, 2023, 09:04:27 PMIMO, NFTs trend is over.I don't like NFTs at all because how the order book and everything is hard for us in case want to exit the project. Holding NFTs for Instrument Asset is not a suitable and good things, because it's only a picture.See now the old NFTs who are reaching all-time high. How is going ?i agree with you, and many people take free content from the internet and sell as their own NFT.example, you download free 3d models from rigmodels.com or 3dripper.com library, and sell as NFTs.do you think this will stay long?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "February 03, 2023, 08:30:51 AM",
      "body": "Ive got some domain on evmos network since its cheap that time. But Im not sure whether the price move eversince. But I only name famous one not related to my name cause maybe this could be more valuable later on. With regards to nft, I didnt do any degen plays or nft flipping at the moment due to saturation. A lot of nft has been swarming again, and its kinda hard to know which one has solid and potential gains especially the acquiring of it are always on the whitelist mode.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dbshck",
      "created_time": "February 03, 2023, 08:49:24 AM",
      "body": "Quote from: FreeZeroCoin on February 03, 2023, 08:23:18 AMi agree with you, and many people take free content from the internet and sell as their own NFT.example, you download free 3d models from rigmodels.com or 3dripper.com library, and sell as NFTs.do you think this will stay long?No, free models from these sites aren't meant for commercial purposes. Both websites explicitly state that free models cannot be used in commercial projects. Anyway, I doubt that anyone would actually purchase these NFTs Quote from: raja9167 on February 01, 2023, 02:29:20 PMAre you a NFT and Domain holder ?What you think about NFTs and Domains Future?Which Network NFTs and Domains you are currently holding and why?Eth, Bsc,polygon,  Sol, Aptos?I am holding bsc and polygon network's NFTs and domains because of the Transection fees are to low in these two NetworksYes, I do own some ENS and SNS. I used to collect NFTs in the Ethereum network, but I had to move to Solana due to the steep increase in gas fees back in 2021. About its future, if you're considering NFTs as investments, those days may be behind us. NFTs are here to stay, but not as part of the speculative market that we saw in the last two years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "February 03, 2023, 08:53:31 AM",
      "body": "Quote from: ryzaadit on February 01, 2023, 09:04:27 PMIMO, NFTs trend is over.I don't like NFTs at all because how the order book and everything is hard for us in case want to exit the project. Holding NFTs for Instrument Asset is not a suitable and good things, because it's only a picture.See now the old NFTs who are reaching all-time high. How is going ?I wouldn't ever suggest that people should buy NFTs as they are even harder to estimate how they hold value compared to altcoins and people would most likely be losing money. But i feel that people who are bashing them are doing it for wrong reasons. Like you could ask sarcastically \"how is it going\" in the bottom of the bear market and point at anything.If you look at erc20 or bep20 tokens, and compare them to erc721 tokens, over 99% of all of them are worthless now. There are just more erc20 or bep20 tokens.So how are NFTs done but altcoins not?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "February 03, 2023, 03:29:03 PM",
      "body": "Quote from: raja9167 on February 01, 2023, 02:29:20 PMAre you a NFT and Domain holder ?What you think about NFTs and Domains Future?Which Network NFTs and Domains you are currently holding and why?Eth, Bsc,polygon,  Sol, Aptos?I am holding bsc and polygon network's NFTs and domains because of the Transection fees are to low in these two NetworksI never have any domain NFTs but planning to own one, just can't decide on what's the best one though. For me, I think it's still best if it's on Ethereum network considering the recent upgrades and there's a lot of projects that comes from other L2s want to be on ETH especially those Solana projects. With the upgrades for sure Ethereum will lessen its transaction fees too, it may not be right now but in the near future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "February 03, 2023, 05:13:49 PM",
      "body": "That’s a bitter choice for me. Neither NFT nor the second one. I am aware that flipping has got some profits on the way but dude NFT is scrambled like egg now. It has no shape and no future either it will drift along the way as it is doing right now or it will go off the market all of sudden. Even these days the NFT are not that popular or in talks which makes us think whether it is short term market or long term market really ??Anyways, those who are relying on single asset acquisitions such as NFT should always diversify the portfolio, just in case if future comes up with another trend!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hildentine",
      "created_time": "February 03, 2023, 05:37:07 PM",
      "body": "In this case i said that in this time many Airdrops are ongoing on the basis of NFT and Domains many projects are eligible participated are that who are claim domains and nft and they send there reward in to there wallet which are hold those projects domains etc.In this time market situation are good so many strong project ongoing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}