{
  "id": "topic_5406010",
  "title": "Len Saldua",
  "author": "Len Saldua",
  "created_time": "July 12, 2022, 02:02:59 PM",
  "content": "Tried to configure my MetaMask for Avalanche, sent some AVAX from my centralized exchange to MetaMask... never got them. MY centralized exchange refunded the AVAX but I'm pretty sure my Avalanche settings are all wrong now after that experience.I revised the settings but can not tell where the problem is. Is it easier to just try an avalanche specific wallet ?  I want to use Trader Joe, I think it only works with Avalanche.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406010",
  "comments": [
    {
      "author": "Jawhead999",
      "created_time": "July 12, 2022, 02:36:11 PM",
      "body": "Lucky for you the centralized exchange can refunded your coins since most of cases the exchanges didn't, you need to set up your Metamask first to add Avalanche network [1] or you can use the project wallet [2] It would be better if you own hardware wallet e.g. Ledger which have better security rather than web wallet.[1] https://support.avax.network/en/articles/4626956-how-do-i-set-up-metamask-on-avalanche[2] https://wallet.avax.network/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shinratensei_",
      "created_time": "July 12, 2022, 05:16:27 PM",
      "body": "I have been using metamask and all are working smoothly. I think that you have been making a mistake. Why don't you try to test it? i meant if you didn't feel good with your metamask and you can start to test it with small amounts of avalanche to make sure if the amounts can be sent to your metamask wallet. This is the main point. Im always trying to do that as well. You must learn from your mistake but just wanna know what exchange sute that already refund your money? Just feel curious if there was still a trusted exchange site like that",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tsaroz",
      "created_time": "July 12, 2022, 07:51:00 PM",
      "body": "The exchange might not have sent the coins in first place as once sent to external wallet, they can't get it back. For setting up avalanche setting in metamask, I visit a some trustable sites like autofarm and try to connect avalanche network through metamask, on not finding the settings, it itself  suggests a proper one. But the act might riskier than manually entering setting from official document but as I'm cautious of what I'm doing, it works.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "July 12, 2022, 08:40:03 PM",
      "body": "Quote from: Len Saldua on July 12, 2022, 02:02:59 PM-snip-A little bit weird.They can refunded your asset, could be the reason you withdraw from the centralized with the wrong network? If you check AVAX on Coinmarketcap. Currently they have 3 network:- Avalanche X Chain- BEP20- MoonbeamCould be your fund can be recovery while you are withdraw to \"BEP\" using Avalanche but since is a wrong address/network is stuck on the exchange. Then, they're easily refund since can't be automatically process due a wrong chain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "July 12, 2022, 11:38:07 PM",
      "body": "Quote from: Len Saldua on July 12, 2022, 02:02:59 PMTried to configure my MetaMask for Avalanche, sent some AVAX from my centralized exchange to MetaMask... never got them. MY centralized exchange refunded the AVAX but I'm pretty sure my Avalanche settings are all wrong now after that experience.I revised the settings but can not tell where the problem is. Is it easier to just try an avalanche specific wallet ?  I want to use Trader Joe, I think it only works with Avalanche.First and foremost, which platform are you withdrawing the AVAX from?There are different chains or networks when you are withdrawing AVAX, depending on the exchangeWas it AVAX C-Chain? AVAX X-chain? AVAX BEP20?It's easier to know which wallet you can use if you specify the chain you tried to use. Be very keen or else you can easily lose your assets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "July 13, 2022, 09:04:59 AM",
      "body": "Quote from: Len Saldua on July 12, 2022, 02:02:59 PMTried to configure my MetaMask for Avalanche, sent some AVAX from my centralized exchange to MetaMask... never got them. MY centralized exchange refunded the AVAX but I'm pretty sure my Avalanche settings are all wrong now after that experience.I revised the settings but can not tell where the problem is. Is it easier to just try an avalanche specific wallet ?  I want to use Trader Joe, I think it only works with Avalanche.I wonder which exchange you used as they refunded the error transactions. Would you mind, telling us which is it?If you wanted to use traderjoe then definitely your format should be C-chain. The platform supports it are usually Binance and Kucoin but for sure other big exchanges are already supporting it.You need to change the rpc of your metamask to avalanche network cause its usually set up via eth network as starters.Quote from: Jawhead999 on July 12, 2022, 02:36:11 PM[1] https://support.avax.network/en/articles/4626956-how-do-i-set-up-metamask-on-avalancheThis link can help.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Len Saldua",
      "created_time": "July 13, 2022, 11:17:52 AM",
      "body": "Checked my settings, I still don't know what is wrong with them !As you can see , everything seems to be set up for the C Chain correctly, but when I click on \"Account Details\" on MetaMask, it brings up the same address I am using for the MATIC and ETH Network. I was told this was because of the EVM compatibility other networks have with Ethereum. My centralized exchange is in Australia so it wouldn't do you guys any good, they didn't actually refund the coins, apparently I didn't specify the address properly so they never got sent. This brings me up to the original question... why?! Everything is set up properly so it seems my Account Details address on MetaMask is where the problem is. NOt sure what I need to change that address to. It begins with 0x... like it's supposed to ! I tried also going to Trader Joe, using my MetaMask, it allowed me to connect to that site, does that mean everything is okay ? What's some other site that will fix my settings automatically ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Len Saldua",
      "created_time": "July 13, 2022, 11:35:43 AM",
      "body": "Alright guys, I did another test... went back to my centralized exchange, and sent out a tiny bit of AVAX to my MetaMask... let's see if it gets there. They gave me the choice of which Network I wanted to use ( I picked Avalanche ) so I think my chances are good now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "July 13, 2022, 11:50:08 AM",
      "body": "On my exchange, the input and output line says Avalanche C-Chain. I understand that I can use an ethereum address.Lots of useful settings herehttps://chainlist.org/Try to buy some coins here, select Avax C-Chainhttps://changelly.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Len Saldua",
      "created_time": "July 13, 2022, 02:29:48 PM",
      "body": "It worked ! I tested it and bought some NEIBR tokens on Trader Joe ! Now if I could buy some Trader Joe tokens....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}