{
  "id": "topic_5431024",
  "title": "Symmetrick",
  "author": "Symmetrick",
  "created_time": "December 22, 2022, 06:08:15 PMLast edit: November 29, 2023, 11:54:55 PM by Symmetrick",
  "content": "ㅤ",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5431024",
  "comments": [
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "December 22, 2022, 10:07:48 PM",
      "body": "Each year will always comes with it own good and challenges in diverse means and having the year running towards an end yet in the dip with crypto market signifies that nothing much is been anticipated for in this year than to have next year come in with new hopes for the price to surges, bitcoin has always been the lead in crypto market and things are probably going to turn a new leaf come 2023 which will serve a year to bitcoin halving, bitcoin has also serves the major role of exposing shitcoins during this kind dip period, but it's much a pity alot of these attrocities were attributed to altcoins and centralized exchanges that poss the more threat on investors with them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NdaMk",
      "created_time": "December 22, 2022, 10:19:51 PM",
      "body": "These are some of the challenges that a knowledgeable bitcoin enthusiast will face in order to reap the benefits of their investment later. It was difficult to remain patient throughout this process and continue to rely on bitcoin to maintain its value despite the obstacles it faces from both the masses and the government. Indeed, 2022 was full of disappointment, which affected some people mentally, but the strong ones who were mentally prepared for the aftermath remain optimistic; those are the true market heroes. Hopefully, 2023 will be better, with fewer problems arisen than this years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "December 22, 2022, 10:32:59 PM",
      "body": "Yeah, just a reminder how volatile crypto market is, although we haven't had a big crash like the Mt. Gox years ago, but still there are black swan events that are comparable to it. Specially the collapse of FTX that really put the market at the edge again.And not only this kind of events, but they are a couple of FUDs around that will somewhat affect us.In any case, those who remained in the market would need a lot of patience and think for the long term and then take advantage to buy when the price goes down hard because of this events.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "December 22, 2022, 10:48:01 PM",
      "body": "So much FUD it honestly feels like an orchestrated attack.  Not trying to initiate a conspiracy here.  It just feels like it.  Or way too many people jumped in the 'let's become Bitcoin rich by creating a company with fake reserves' wagon and caused this FUD volcano.I truly believe the up and coming years will offer more positive news and the Market will rebound.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "December 22, 2022, 10:55:03 PM",
      "body": "Ftx and luna were both fairly unexpected, but so was Doge the year before and quite a few other value readjustments (both up and down).I don't think the market is down that much compared with previous bear cycles though - there's also a lot more entities in the market to lose money now though too so perhaps overall we're a lot lower than might've been expected from people investing in crypto companies via traditional routes (such as Coinbase's stock performing badly).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "December 23, 2022, 12:11:33 PM",
      "body": "This year marks a very unfortunate sequence of event and thats really hurt a lot of investors. But for surr this isnt the end of cryptomarket and that will change overtime. Many users believed that recovery will happened on 2024 to 2025 and that means that yesr of 2023 is an accumulation period. So better to keep dca until the bull arrives especially the prices now are cheap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "December 23, 2022, 01:20:02 PM",
      "body": "This year has been not so good for the market on a general note and it seems it will end on the same note as we are still not seeing any major pumps hitting the market taking price up.So you have presented the good infographics covering most of the reasons of these volatile scenarios but yes FTX scam was big one that have wiped billions out of market.The other include LUNA algorithm fault and destabilising the market then 3AC meltdown holding huge funds and there was so much panic in the market at that time also but somehow it recovered a little bit after it but now again we are in same scenario.But the investors need to have money into bitcoin again to move it little bit with supply shrinking it can give boost to the prices but yes this year was messed up with bankruptcy and scams.Quote from: jackg on December 22, 2022, 10:55:03 PMFtx and luna were both fairly unexpected, but so was Doge the year before and quite a few other value readjustments (both up and down).Frankly saying the Doge downfall was expected as it was only rising under the influence of Musk as before his interaction with the memcoin it was trading at far low value and he took undue advantage of his position to influence and manipulate people to invest in Dogecoin and then after it crashed hard.The ATH went to $0.73 in 2021 and now it's at $0.078 so as expected people who holds it have lost majority of their funds in it because they were ignorant enough to invest under someone else influence and he has made huge profits out of it.The majority of supply was concentrated in few wallets meaning centralised sort of control and we all know the prices can be manipulated so for me it was expected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "December 23, 2022, 01:30:49 PM",
      "body": "In bear market, even if there is positive news it's overshadowed by negativity that surrounds in such market while exact opposite happens in bull market, people ignore obvious signs. Companies are adopting nfts — ethereum, solana, axelar, osmosis had significant upgrades/parterships recently. This will all blow up soon enough, and people will regret not making use of current market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Merit.s",
      "created_time": "December 23, 2022, 02:25:06 PM",
      "body": "This year brought dismay on btc and the cryptosystem market a lot. So many person couldn't withstand the challenge the crypto market faced and sold their investment, some even lost their investment from the aforementioned crashes. This lead to criticism of btc by banks and social media but still btc is still standing and will have a rise in price hopefully next year. Some many altcoins couldn't withstand all the challenges and also crashed just like FTX and Luna did.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "December 23, 2022, 02:34:20 PM",
      "body": "Or all incidents is just an excuse so that all the person behind this fallen project can exit on crypto while the the price is still high? This series of failed project started when crypto established a downtrend. The only way for them to exit instantly is to make the company bankrupt or hacked so that all holder can’t react quickly to exit liquidity. A story like this always happened during market. I’m speculating that this projects is already scam from the beginning same for those dead project that just doing a very slow development to make there project looks like still alive so that they can use investors money for exit liquidity slowly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "December 23, 2022, 05:31:17 PM",
      "body": "Quote from: aysg76 on December 23, 2022, 01:20:02 PMQuote from: jackg on December 22, 2022, 10:55:03 PMFtx and luna were both fairly unexpected, but so was Doge the year before and quite a few other value readjustments (both up and down).Frankly saying the Doge downfall was expected as it was only rising under the influence of Musk as before his interaction with the memcoin it was trading at far low value and he took undue advantage of his position to influence and manipulate people to invest in Dogecoin and then after it crashed hard.The ATH went to $0.73 in 2021 and now it's at $0.078 so as expected people who holds it have lost majority of their funds in it because they were ignorant enough to invest under someone else influence and he has made huge profits out of it.The majority of supply was concentrated in few wallets meaning centralised sort of control and we all know the prices can be manipulated so for me it was expected.I meant the initial rise more than the decline of doge. It's still up about 14x from where it normally used to settle (around 50 sats).I would've expected it to have completely fallen and it even looks to not being too badly considering it's a potentially insecure meme coin (depending on whether it or litecoin have the highest hash power).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "December 23, 2022, 07:15:58 PM",
      "body": "Quote from: cryptoaddictchie on December 23, 2022, 12:11:33 PMThis year marks a very unfortunate sequence of event and thats really hurt a lot of investors. But for surr this isnt the end of cryptomarket and that will change overtime. Many users believed that recovery will happened on 2024 to 2025 and that means that yesr of 2023 is an accumulation period. So better to keep dca until the bull arrives especially the prices now are cheap. I am not going to wait till bitcoin goes down to 10k because it might still never happen, too many people believe that 10k is the bottom and it will happen in 2023, doing the opposite of what others are doing is the path that works for me, so I plan to build my second crypto bag in early 2023 and I will keep doing this till the next Bitcoin halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "December 23, 2022, 08:15:25 PM",
      "body": "The year 2022 hasn’t been terrible for crypto-Currency but are we being to hard on Crypto-currency? 2022 hasn’t been good for the financial ecosystem, many Currencies saw their worst inflation rate and some lots value up to the extent of being thrown away.But Crypto-currency is an ecosystem that is volatile and I don’t know which way it may go bearish or bullish but the fact is that I don’t gamble with Altcoin and when I only believe in bitcoin I believe I am safe no matter the market conditions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "December 23, 2022, 08:37:29 PM",
      "body": "Quote from: Outhue on December 23, 2022, 07:15:58 PMQuote from: cryptoaddictchie on December 23, 2022, 12:11:33 PMThis year marks a very unfortunate sequence of event and thats really hurt a lot of investors. But for surr this isnt the end of cryptomarket and that will change overtime. Many users believed that recovery will happened on 2024 to 2025 and that means that yesr of 2023 is an accumulation period. So better to keep dca until the bull arrives especially the prices now are cheap. I am not going to wait till bitcoin goes down to 10k because it might still never happen, too many people believe that 10k is the bottom and it will happen in 2023, doing the opposite of what others are doing is the path that works for me, so I plan to build my second crypto bag in early 2023 and I will keep doing this till the next Bitcoin halving. Price predictions are often based on speculation and can be highly uncertain, and it is not uncommon for them to be proven wrong. It is always a good idea to have your own plan and to carefully consider all the risks and potential rewards before making any investment decisions.Clearly in terms of price, the market seems to think things are looking bleak. What could happen that could spur a recovery? Back above $30k by February! At this point, your guess is as good as anyone else's. With any luck however, it'll be a nice easy upswing. Probably not going to be shorting bitcoin anytime soon though - many things that can go wrong there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "December 23, 2022, 09:51:58 PM",
      "body": "That's a lot of connection for FTX.It's true that this year has been disappointing because too many people involve having their funds affected as well. But if we'll speak about the market, it's still quite good.Nevertheless, this year is full of disappointment and surprises because of the events that had occurred. It's certainly a bloody year especially for the new ones.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "December 24, 2022, 09:02:00 AM",
      "body": "The market cap count for all cryptocurrencies is very misleading, the market has grown from 1 trillion to 2.5 from Nothing but because of random Altcoins/tokens that are printed without having value and therefore evaporated quickly, the most important thing is to measure Bitcoin because it is the main controller of all prices.Some unexpected events, such as FTX and Luna, are what hastened to extinguish the rise and thus achieve a rapid correction, which is different from things like GBTC, TESLA, Musk that that contributed to the rapid increase.So the Bitcoin market began to change rapidly and gain a stronger position.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aylabadia05",
      "created_time": "December 25, 2022, 10:49:02 AM",
      "body": "The series of events that occurred this year (2022) are likely to leave an impression on all those involved in the journey of crypto activities as seen in the OP image.No exception to the various FUDs that spread like a virus that disrupts concentration, although we are not at all fooled and still believe in Bitcoin's journey until one day it will reach the stage that many investors want.Maybe at the close of 2022, the price of Bitcoin will still stay in the range of $16k to $17k even a little more above that price. But the journey for 2023 may be different from 2022.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "December 30, 2022, 02:15:11 PM",
      "body": "Quote from: aylabadia05 on December 25, 2022, 10:49:02 AMThe series of events that occurred this year (2022) are likely to leave an impression on all those involved in the journey of crypto activities as seen in the OP image.No exception to the various FUDs that spread like a virus that disrupts concentration, although we are not at all fooled and still believe in Bitcoin's journey until one day it will reach the stage that many investors want.Maybe at the close of 2022, the price of Bitcoin will still stay in the range of $16k to $17k even a little more above that price. But the journey for 2023 may be different from 2022.Any PR is useful for the crypto industry!Even negative informational occasions contribute to attracting interest in Bitcoin and other cryptocurrencies.  People read about all these financial disasters and they think - I wanted to buy Bitcoin at $65,000 last year!  Now its price has dropped significantly and I can buy it cheaply.  Perhaps as a result of such reasoning, these potential investors will not buy Bitcoin (it is very difficult and scary to invest in the midst of a bear market).  However, in spring their mood will change, good sunny weather will add to their optimism.  They will read about Bitcoin again and still make a positive purchase decision.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Moeda",
      "created_time": "December 30, 2022, 09:35:50 PM",
      "body": "Indeed, there are so many problems going on with crypto in 2022. And those problems are continuing. Stock exchange hacks are happening all the time, and it's something that needs serious attention. I think exchange developers need to pay attention to the level of security. Perhaps the two biggest issues that cost investors big are Terra and FTX. I also left a small amount of assets on the FTX exchange, it is currently inaccessible. What needs to be considered is the cause of bankruptcy, hacking, and so on. Do not let us think this happened naturally or accidentally, or done by other parties outside the exchange. Suspicion is important to protect our assets in the future. Maybe my assumptions are too exaggerated in this regard, but this assumption arises because I personally have experienced it many times. We just need to be careful in storing assets. Losses due to dumps in crypto prices are commonplace, and that's not a problem for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}