{
  "id": "topic_5402273",
  "title": "Majestic-milf",
  "author": "Majestic-milf",
  "created_time": "June 12, 2022, 12:51:24 PM",
  "content": "While there are countries who have embraced or tolerated BTC since it's emergence in 2008, there seem to be some who are adamant about it because of its high volatility rate and the ability to conduct nefarious activities with it. In September 2021, El Salvador became the first country to not just embrace it, but also to use it as a legal tender and where were followed by Central African Republic in April 2022. It would seem that these countries have seen the light(BTC), in this case and have held firmly. Despite it's controversial emergence, it has managed to gain a kind of positive publicity. Countries who are strongly against it and have moved for it's ban in their nations are; Algeria They passed into law in 2014 and making illegal the use, buying and selling or holding of crypto currency Bolivia  Bolivia Central Bank passed the law of the total ban of the use of crypto currency in 2014 China  On Sept 24, the Bureau of the People's Financial Consumer Rights Bank of China outrightly banned the use of BTC. https://en.m.wikipedia.org/wiki/Legality_of_cryptocurrency_by_country_or_territory There are many more countries who have taken this step. My question now is, how do citizens who have BTC and reside in areas that are not crypto friendly cope?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402273",
  "comments": [
    {
      "author": "Solosanz",
      "created_time": "June 12, 2022, 12:55:51 PM",
      "body": "Don't:Don't use centralized exchangeDon't link your address with any services e.g. gambling, lending, investment platform etcDo:Use decentralized exchange e.g. bisqBuy a gift card using Bitcoin without link your identityUse Tor to hide your IP address for searching any Bitcoin stuffsUse a mixer e.g. Chipmixer to concealing your tainted coin for better privacyEven your countries isn't ban Bitcoin, but you should be worry since government can do anything to ban or unban if they want. So you need to be prepare when the worst happen on your country about Bitcoin legality especially you live in the country where Bitcoin legality is still grey area.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "June 12, 2022, 12:59:51 PM",
      "body": "It's quite discrete though imo for people in those countries.If it does well they could probably either just move country to sell their crypto or find someone who could trade it for them - in countries where drugs have been made illegal, they don't seem too hard to come by (enough people seem to have them/take them).Quote from: Solosanz on June 12, 2022, 12:55:51 PMUse Tor to hide your IP address for searching any Bitcoin stuffsI wonder how easy tor is to access and use in China without detection.. I know there's a bridge that was made so people from China could connect to tor but I'm not sure how noticeable it is (and presumably you'd have to get tor from an unofficial source).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "June 12, 2022, 01:01:51 PM",
      "body": "It's actually 2018 for Algeria, and September of 2021 for China.As mentioned above, using decentralized and P2P exchanges will do the trick. I however don't think that it matters for most of the banned countries.  If you check the biggest exchanges out there, you'll see that Algeria, Bolivia, and a few others are still supported so I'm guessing that it just depends on the jurisdiction or how much push there's from the regulators. I still wouldn't encourage using CEXes though, especially if identity verification is required.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UserU",
      "created_time": "June 12, 2022, 01:19:18 PM",
      "body": "While western sites are mainly banned in China, nothing is stopping from residents from utilizing VPNs to access them. Bitcoin is no different.Besides, China has more things to prioritize (e.g. political stability) about than simply Bitcoin alone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "okorieemmanuel",
      "created_time": "June 12, 2022, 01:38:37 PMLast edit: June 12, 2022, 02:01:18 PM by okorieemmanuel",
      "body": "Quote from: Majestic-milf on June 12, 2022, 12:51:24 PMWhile there are countries who have embraced or tolerated BTC since it's emergence in 2008, there seem to be some who are adamant about it because of its high volatility rate and the ability to conduct nefarious activities with it. In September 2021, El Salvador became the first country to not just embrace it, but also to use it as a legal tender and where were followed by Central African Republic in April 2022. It would seem that these countries have seen the light(BTC), in this case and have held firmly. Despite it's controversial emergence, it has managed to gain a kind of positive publicity. Countries who are strongly against it and have moved for it's ban in their nations are; Algeria They passed into law in 2014 and making illegal the use, buying and selling or holding of crypto currency Bolivia  Bolivia Central Bank passed the law of the total ban of the use of crypto currency in 2014 China  On Sept 24, the Bureau of the People's Financial Consumer Rights Bank of China outrightly banned the use of BTC. https://en.m.wikipedia.org/wiki/Legality_of_cryptocurrency_by_country_or_territory There are many more countries who have taken this step. My question now is, how do citizens who have BTC and reside in areas that are not crypto friendly cope?  Wow! Are you actually looking for tips to break the law of countries banning Bitcoin? That's a bid odd. If you have bitcoin and you stay in an area where it is banned, you can simply take a plane or trip to a place where bitcoin is not banned and use your bitcoin. At least, you will be on the right side of the law. If you stay in area where bitcoin is banned and you take all these people advices and eventually get caught, the expenses you will incure will be greater than a simple travel. Even binance exchange was founded in China. When china issued such ban on crypto, they simply moved their headquarters to cayman islands. Such individuals can do the same. Don't break the lawhttps://en.m.wikipedia.org/wiki/Binance",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "June 12, 2022, 01:49:31 PM",
      "body": "Quote from: Majestic-milf on June 12, 2022, 12:51:24 PMHow can I survive in a place where BTC is restricted?Just as how 6 billion poeple managed to survive before 2009.This whole drama, I can't use bitcoin, I'm going to die is just lame, according to a study I just read on a  topic yesterday bitcoin-related sources quoted a number of 30 million users, how the hell does the rest of the world go by? /sQuote from: OmegaStarScream on June 12, 2022, 01:01:51 PMAs mentioned above, using decentralized and P2P exchanges will do the trick. I however don't think that it matters for most of the banned countries. Might do the trick!Decentralized exchanges don't have your data, but that doesn't mean the one sending or receiving money from you for the coins exchanged won't.And depending on the seriousness of the country that wants to ban this kind of transaction you might end up dealing with an undercover cop or the guy with whom you tarded might get nabbed by the police and from there all they have to do is go through all his bank/paxum/paypal whatever transactions.I've always warned people that a trader is so easy to be discovered by a bank, just how many people that you know do 10 bank transfers to complete strangers all over the country each day?   All t takes is one to go down and every one after that is so easy to catch. It all comes to how hard the police want to catch you, not how good you're hiding your tracks.If you have small amounts try to buy stuff from the outside or deal with close friends that might help you, if you have large sums, it's time to move away as you won't be able to cover the real-life wealth once you sell 10 BTC, how are you going to explain 300k in your accounts when your wage is 300 or worse than that you're unemployed",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "June 12, 2022, 02:01:28 PM",
      "body": "You can survive of living in a country that do not accept Bitcoin or embraced it as a legal tender or for exchanges of goods and services. They are not going to deprived of internet access to operate via cryptocurrencies or set an organization who will be moving house hold to house hold search for people who dealing with cryptocurrency, the answer is No. So therefore we have peer to peer platforms which any country or continent can operate with via peers to peer transaction. For me even though my country restrict the adoption of bitcoin it won't affect me, because i exchange my cryptocurrency to their fiat currency and use in purchase of anything",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "June 12, 2022, 02:11:51 PM",
      "body": "You can still use it — mostly just not as a currency, but for holding. You just need to hold extra quietly, and make sure you don't over-allocate so you wouldn't be forced to sell some if you needed the money.As for buying, I'd try to figure out a method. One way on the top of my head (outside of doing P2P) is to use your local currency to buy game items(CSGO, RuneScape, etc), then sell the game items for bitcoin.^ You're going to pay an extra premium for that buying method, but if you're extra paranoid then it's a decent method imo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "June 12, 2022, 02:46:41 PM",
      "body": "Quote from: jackg on June 12, 2022, 12:59:51 PMI wonder how easy tor is to access and use in China without detection.. I know there's a bridge that was made so people from China could connect to tor but I'm not sure how noticeable it is (and presumably you'd have to get tor from an unofficial source). It is pretty hard to stay undercover in China simply due to human errors.  Out of say 100 days of browsing, I would imagine there is a big chance you mess up at least once.  I do this myself, even as paranoid and extremely cautious as I am.  If you are very tired or drunk, or even just not having the ability to pay attention for a second, you might click the wrong thing and that could turn out very badly for you.I remember there were some communities selling CD's and USB sticks with Tails on them that you could buy in countries where Tor is banned so that you can bypass governmental restrictions.  But again, there is a big risk you have to assume by using it.  I would rather occasionally travel to other countries and do my Bitcoin business there and return to my country when I am done.  They can find you are using Tor, but they can not find your seed as long as you properly store it.Long story short.  If you can not survive in a country due to a Bitcoin ban, maybe it is time to move to another country instead.  Or travel every now and then specifically to do your Bitcoin business somewhere else where Bitcoin is not banned, or if you have the balls then risk it and try to stay undercover in a country that may end up torturing you and destroying your life for it.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "June 12, 2022, 04:23:23 PM",
      "body": "Quote from: Majestic-milf on June 12, 2022, 12:51:24 PMThere are many more countries who have taken this step. My question now is, how do citizens who have BTC and reside in areas that are not crypto friendly cope? No choice. But if they arent so tight to use on crypto. Then use decentralized exchange or p2p to trade crypto. Thats the only way you cant be bound to such rules and strict regulations. Obviously they are seeking cooperation on exchanges that operates within their territory. But if you arent gonna use that, then you can still survive using dex. However the chances of small numbers of people are using it or even doing p2p is the cons of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "June 12, 2022, 09:11:49 PM",
      "body": "Peer to peer(P2P) transactions is one of the ways to go if you are in a country where its illegal to own or use bitcoin.My country is a good reference point of what I am talking about, the government of my country ones made it illegal to own or transact in bitcoin, all banks were instructed to report any bitcoin or crypto currency related transactions, in the end, we all resorted to peer to peer,, all we do is to make sure we don't include anything that has to do with bitcoin or crypto in our payment description/reference note when transferring or sending money to the other party.The above is one of the ways to survive in a country where bitcoin and cryptocurrencies are restricted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oilacris",
      "created_time": "June 12, 2022, 09:24:54 PM",
      "body": "Each country does have their own takings and perceptions into different things specially we do talk about Bitcoin or crypto as a whole which there would be places whowould fully accepted it and there are who would completely ban it thats why it would be not that good to experience or deal with crypto if its banned.So lucky for those who had lived on a country which does have good impressions and taking about bitcoin or crypto as a whole.You could really be that confident on dealing with something which isnt banned or prohibited.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "June 12, 2022, 09:55:07 PM",
      "body": "Quote from: Oilacris on June 12, 2022, 09:24:54 PMEach country does have their own takings and perceptions into different things specially we do talk about Bitcoin or crypto as a whole which there would be places whowould fully accepted it and there are who would completely ban it thats why it would be not that good to experience or deal with crypto if its banned.So lucky for those who had lived on a country which does have good impressions and taking about bitcoin or crypto as a whole.You could really be that confident on dealing with something which isnt banned or prohibited.the OP has not mentioned what country he is coming from. so we don't know what kind of restrictions they have in terms of crypto market. is it total ban or just crypto businesses such as local exchange is not permitted to operate? are they allowing their people to hold crypto and use at their own risk? it depends on the level of restriction here. because if he can use the p2p method, there are several reputable sites to convert his crypto to fiat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "June 12, 2022, 09:59:00 PM",
      "body": "Have a decentralized wallet or hard wallet, and if you have good amount of Bitcoin you can travel abroad and use your Bitcoin there. Living on those restricted countries is really hard and you can’t do anything about that aside from following their laws or else you will face consequences. Just keep it to yourself and safely secured your wallet, time will come and they make that legal in the future, they can’t just ignore Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelvinid",
      "created_time": "June 12, 2022, 10:09:49 PM",
      "body": "I guess you need to move on and find another way to spend your Bitcoin (if you have) like converting them to fiat money. Otherwise, you will never enjoy them as possible it will be seized by the authorities if they know about you. Well, some had made their decision to transfer their residency to other places where Bitcoin is legal but I'm not suggesting it. That is why I'm saying, you have to forget about crypto, about Bitcoin. We can still make a living without Bitcoin so we can still survive despite everything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "June 12, 2022, 10:57:14 PM",
      "body": "It's an interesting question, because in few years more of us can be in a situation like this in our countries where there aren't specific laws for bitcoin and crypto yet. There isn't much to do: or you use it illegally taking the risks of being harassed, blackmailed, fined and persecuted by authorities, give up on crypto and throws on the garbage your financial life becoming a slave of the local system forever or you move on to a friendly crypto country.The latter option is the best, but I imagine it's hard to go to an entirely new country where you don't know anyone, without any guarantees, opportunities or a sure place to start your new life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jemzx00",
      "created_time": "June 12, 2022, 11:59:15 PM",
      "body": "It's either you follow the law of your government and know that your safe and out of possible criminal activity or you don't. You might still be able to hold and use btc or other crypto however it will be harder for you to do a transaction. Also, there's a chance that you might get caught in the process if you are not careful enough.Again, you will still be able to use and hold cryptocurrency. Your main problem is doing transaction with it especially selling it for fiat or even doing P2P. Another issue are website that also restrict access on these countries as your funds may not be available once they've detected your from an illegal country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alisha-k",
      "created_time": "June 13, 2022, 01:02:19 AM",
      "body": "To survive with your BTC in restricted countries it means you should avoid services that will link your address. The most tempting is funding centralized services directly from your decentralized wallet. The easiest way to track address has been through centralized exchanges since the have the KYC of their customers so staying as decentralized as possible or avoiding any direct link to centralized services with your wallet will be just fine",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "South Park",
      "created_time": "June 13, 2022, 02:36:11 AM",
      "body": "Quote from: okorieemmanuel on June 12, 2022, 01:38:37 PMWow! Are you actually looking for tips to break the law of countries banning Bitcoin? That's a bid odd. If you have bitcoin and you stay in an area where it is banned, you can simply take a plane or trip to a place where bitcoin is not banned and use your bitcoin. At least, you will be on the right side of the law. If you stay in area where bitcoin is banned and you take all these people advices and eventually get caught, the expenses you will incure will be greater than a simple travel. Even binance exchange was founded in China. When china issued such ban on crypto, they simply moved their headquarters to cayman islands. Such individuals can do the same. Don't break the lawhttps://en.m.wikipedia.org/wiki/BinanceA good option is to simply hold your coins, we know that one day bitcoin could be legal and the next day it could not depending on the mood of a small number of politicians, it is because of this it is important to always retain your privacy, however even if at some point bitcoin becomes illegal where you live you can just keep holding it, if you never revealed to anyone you have it then no one will be looking for you, and once bitcoin becomes legal where you live then you can begin to use it again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}