{
  "id": "topic_5398386",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "May 12, 2022, 11:12:19 PM",
  "content": "QuoteAs food prices skyrocket, the world needs to admit it can’t live without modern, efficient agricultureThe energy crisis caused by the war in Ukraine disabused many politicians of the notion that the world could make a swift transition to green energy powered by solar, wind and wishful thinking. As food prices skyrocket and the conflict threatens a global food crisis, we need to face another unpopular reality: Organic farming is ineffective, land hungry and very expensive, and it would leave billions hungry if it were embraced world-wide.For years, politicians and the chattering classes have argued that organic farming is the responsible way to feed the world. The European Union pushed last year for members roughly to triple organic farming by 2030. Influential nonprofits have long promoted organic farming to developing nations, causing fragile countries like Sri Lanka to invest in such methods. In the West, many consumers have been won over: About half the population of Germany believes that organic farming can fight global hunger.The rise in food prices—buoyed by increased fertilizer, energy and transport costs—amid the conflict in Ukraine has exposed inherent flaws in the argument for organic farming. Because organic agriculture shirks many of the scientific advancements that have allowed farmers to increase crop yields, it’s inherently less efficient than conventional farming. Research has conclusively shown that organic farming produces less food per acre than conventional agriculture. Moreover, organic farming rotates fields in and out of use more often than conventional farming, which can rely on synthetic fertilizer and pesticides to maintain fertility and keep away pests.Taking this and the lower production in a given field into account, organic farming produces between 29% to 44% less food than conventional methods. It therefore requires as much as 78% more land than conventional agriculture and the food produced costs 50% more—all while generating no measurable increase in human health or animal welfare.This higher cost is untenable in developing nations, and it was irresponsible for activists in wealthy economies to push inefficient farming methods on them. Nowhere is this tragedy more obvious than Sri Lanka, where the imposition of organics has been calamitous. President Gotabaya Rajapaksa ran for election in 2019 promising a transition to organic food production. This policy produced nothing but misery. The eschewing of fertilizer caused rice production to drop by 20% in the first six months after the switch to organic farming was implemented. Last winter, farmers predicted that tea yields could fall by as much as 40%. Food prices rose; the cost of vegetables quintupled. Protests finally forced Sri Lanka mostly to give up its organic foray this past winter, too late to rescue much of this year’s crop.Sri Lanka’s example underscores the irresponsibility of organics. Organic farming rejects synthetic nitrogen fertilizer, but there is currently far from enough organic nitrogen to feed the world. It turns out that synthetic nitrogen is directly responsible for feeding four billion people, more than half the world’s population.Wealthy consumers can take the related price increases, but many poor households in the developing world spend more than half their income on food. Every 1% hike in food prices tips another 10 million people into global poverty. Advocating for global organics implicitly means suggesting that billions should forgo food.It is easier to ignore these inconvenient details when food shortages aren’t in the headlines, but the war in Ukraine has put world hunger on everyone’s mind. Russia and Ukraine normally provide more than a quarter of the world’s exported wheat and significant supplies of corn, vegetable oil and barley. Almost a third of global potash, a potassium-rich product crucial for plant growth, comes from Russia and Belarus and most is likely subject to sanctions. Russia also produces 8% of the world’s nitrogen, the price of which had already more than tripled over the two years before the invasion. Most nitrogen is made from fossil fuels, and many factories have had to stop production as the pandemic and climate policies have raised the price of nonrenewable energy. And it doesn’t help food prices that the costs of transport have more than doubled since the pandemic began.The result will be devastation. Rising fertilizer prices could decrease rice yields by 10% in the next season, leading to a drop in food production equivalent to what could feed half a billion people.Policy makers and nonprofits must urgently focus on ways to produce more food for the world’s poorest at less cost. Genetic engineering, better pest management and more irrigation would go a long way toward increasing yields. Ramping up the production of artificial fertilizer, as well as considering removing regulation that makes its fossil-fuel inputs more expensive, will also help. These simple, common-sense approaches can curb price hikes, avoid hunger and even help the environment. Agriculture already uses 40% of the ice-free land on the earth. Increasing its efficiency will allow us to keep more land wild and natural.It’s time to let go of this self-indulgent obsession with organics and focus on scientific and effective approaches that can feed the planet.https://www.wsj.com/articles/ukraine-crisis-reveals-the-folly-of-organic-farming-global-hunger-crops-food-prices-energy-11651869179....The following seems to imply sanctions on russia should be removed to reduce the cost of natural gas used to produce chemical based agricultural fertilizers.QuoteRamping up the production of artificial fertilizer, as well as considering removing regulation that makes its fossil-fuel inputs more expensive, will also help.Left with no other options, the world will have no alternatives aside from organic farming to turn to.Sanctions on natural gas could also carry a potential to price monsanto GMOs out of many farmer's budgets.Is there a clear cut and obvious solution to these issues society faces.We know that synthetic fertilizers can scale production. Can organic farming scale as well?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398386",
  "comments": [
    {
      "author": "Ozero",
      "created_time": "May 13, 2022, 06:42:59 AM",
      "body": "I do not agree with your arguments. Organic farming is also called natural farming. It mainly uses organic matter as fertilizers, that is, overripe crop residues, weeds, all greens and dried plant residues, which, when used correctly, turn into biohumus. I don't see any problem here. Chemical fertilizers are worse for the assimilation of plants, non-compliance with the norms can harm human health. With organic, natural farming, there are no such problems. In addition, green manure crops are used in organic farming, that is, before sowing the main crops, after them, or even together with them, other crops are sown that saturate the soil with the necessary elements and fight pests. Organic farming definitely needs to be applied on small farms. I don’t know why you think that the harvest is much worse than fertilizer with different chemicals. In my opinion, just the opposite.On the issue of the war between Russia and Ukraine. Russia, which attacked peaceful Ukraine, is now artificially causing food problems throughout the world. Now Russia has blocked the Black Sea and does not allow the export of wheat from Ukrainian ports for export, which has collected more than 4.5 million tons. Also, the Russian army is deliberately destroying the civilian infrastructure of Ukraine, trying to undermine its economy, including destroying agricultural equipment, and preventing crops from being sown now. Farmers are allowed to sow if they give them 70 percent of their crops. This is such a new kind of slavery in the 21st century.The Putin regime needs to be crushed and destroyed, and not to flirt with it and remove sanctions from it. Otherwise, then almost the entire crop will have to be given to the aggressor and feed a foreign army in your own country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "May 13, 2022, 12:14:26 PM",
      "body": "Quote from: Ozero on May 13, 2022, 06:42:59 AMI do not agree with your arguments.These are not my arguments btw. I posted them to share what is being said in the media.Sanctions on natural gas are making monsanto GMOs and chemical fertilizers more expensive. Pricing them outside the budget of many farmers.Organic farming is our main option and alternative. But can it scale? How long does it take to scale? It may be critically important to begin scaling as soon as possible if it is the option people wish to pursue. Due to the lag time between initial transition and sustainability.Over the long term these trends could lead to a demise of GMO based farming which could be replaced by organic alternatives. I thought that might be interesting to consider but apparently no one cares about it. Quote from: Ozero on May 13, 2022, 06:42:59 AMthe Russian army is deliberately destroying the civilian infrastructure of UkraineI wonder what the motive for that could be.If you were invading a foreign country, wouldn't be it be more valuable to capture it with its infrastructure intact?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "May 13, 2022, 01:21:02 PM",
      "body": "Quote from: Hydrogen on May 12, 2022, 11:12:19 PMWe know that synthetic fertilizers can scale production. Can organic farming scale as well?From my personal experience I can say that it is much harder to produce any vegetable or fruit in a 100% natural way because here we are talking about industrial production which aims to produce as much as possible with as little risk as possible that crops will be destroyed by disease, pests or wild animals. The amount of chemicals used in the production of all grains is huge, and as a result we have a poisoned product and everything that comes from it in the processing chain. What matters is the quantities, and they are only possible with all the chemicals used. Sri Lanka is an example that organic production is unsustainable on a large scale, and that it can only function at the level of personal production without putting pressure on how much we have to produce.Quote from: Hydrogen on May 13, 2022, 12:14:26 PMI wonder what the motive for that could be.If you were invading a foreign country, wouldn't be it be more valuable to capture it with its infrastructure intact?There are several reasons that can explain such a way of warfare :- instead of sending soldiers into direct combat, you destroy everything in front of you with artillery, thus destroying the enemy and his logistics, and in the end you send infantry to occupy the area.- an invasion aimed at destroying the economy of another state without the intention of permanently occupying the occupied territories.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "May 13, 2022, 04:26:20 PM",
      "body": "Quote from: Hydrogen on May 12, 2022, 11:12:19 PMWe know that synthetic fertilizers can scale production. Can organic farming scale as well?Ask Sri Lanka about it! As a part of financial reform and for a drive towards self-reliance, Sri Lanka banned the usage of fertilizers on April 2021. That reduced their farming yield by 45%. A country already struggling with Chinese debt, this one was the final nail on the coffin. Organic farming is not really a solution for a country unless they decide to use all of their lands for farming only. That's not gonna happen and that also has after effects on the economy because thet country will then have to be importing foods.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "May 13, 2022, 04:37:58 PM",
      "body": "I've seen discussions about organic food having high environmental impact because of being more resource intensive, but linking that to Russia's war against Ukraine is kind of superficial. The prices are going up not because of the farming, but because Ukraine is among the world's biggest exporters of grain and sunflower oil, a leader of supplies to some of the poorest countries. And Russia is not only stealing a lot of grain, bombing grain warehouses, and effectively preventing a successful sowing campaign by military actions, but also blocking a lot of grain in seaports.What would be of great help is to make Russia stop the war, which includes tough sanctions that would really hit its economy. Another thing that could help a lot is a campaign to reduce the consumption of meat, so that we don't spend tons of resources on growing, keeping and feeding cattle.I would also like to point out that it's an opinion article, and if you just google the guy, he's famous for saying that global warming is by no means the biggest environmental threat, and he is not a climate scientist but makes bold statements undermining global warming which are widely condemned and refuted by the academic community.So while there might be some truth to his points, we should take it with a grain of salt because he's literally famous for misleading data and unscientific statements about the environment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "May 13, 2022, 05:55:23 PM",
      "body": "Quote from: Hydrogen on May 12, 2022, 11:12:19 PM...Left with no other options, the world will have no alternatives aside from organic farming to turn to.Sanctions on natural gas could also carry a potential to price monsanto GMOs out of many farmer's budgets.Is there a clear cut and obvious solution to these issues society faces.We know that synthetic fertilizers can scale production. Can organic farming scale as well?I see the EU sanctions on Russia are getting weaker and weaker...Russia to this day still shows an indifferent attitude towards western and US sanctions because Putin knows what Europe needs (oil and gas) and he holds it in his hands. Organic farming is definitely the solution for Ukraine to reduce their level of dependence on cities that produce vegetables and other basic necessities because distribution costs are soaring and it's really dangerous. Besides that, organic farming is a solution for the future of world agriculture.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ozero",
      "created_time": "May 14, 2022, 08:30:51 AM",
      "body": "Quote from: Hydrogen on May 13, 2022, 12:14:26 PMQuote from: Ozero on May 13, 2022, 06:42:59 AMI do not agree with your arguments.These are not my arguments btw. I posted them to share what is being said in the media.Sanctions on natural gas are making monsanto GMOs and chemical fertilizers more expensive. Pricing them outside the budget of many farmers.Organic farming is our main option and alternative. But can it scale? How long does it take to scale? It may be critically important to begin scaling as soon as possible if it is the option people wish to pursue. Due to the lag time between initial transition and sustainability.Over the long term these trends could lead to a demise of GMO based farming which could be replaced by organic alternatives. I thought that might be interesting to consider but apparently no one cares about it. Quote from: Ozero on May 13, 2022, 06:42:59 AMthe Russian army is deliberately destroying the civilian infrastructure of UkraineI wonder what the motive for that could be.If you were invading a foreign country, wouldn't be it be more valuable to capture it with its infrastructure intact? In the early days of the invasion, the Russian army did not destroy the civilian infrastructure of Ukraine, as it really expected to use it to its advantage after the occupation. But as the active resistance of the Armed Forces of Ukraine and the entire Ukrainian people grew, when the Kremlin realized that they could not completely capture Ukraine, the tactics changed. Russian troops began to massively fire from tanks, artillery, multiple launch rocket systems, aviation, in addition to military facilities, and civilian infrastructure: residential buildings, schools, hospitals, cultural institutions, plants and factories, that is, everything that keeps the economy of the state and the life of its people. The calculation was, on the one hand, to frighten the government of Ukraine with the possible scale of destruction and thus force them to lay down their arms, and on the other hand, to arouse dissatisfaction with their government on the part of the people.Recently, given the general futility of their attacks, the invaders have generally begun to use the scorched earth tactics, in which the territory of the Ukrainian defenders is almost completely destroyed by fire from all types of weapons, and only after that this part of the territory is captured.Having invaded Ukraine under the pretext of protecting the Russian-speaking population, the Russian army is now actively destroying the Russian-speaking population of Ukraine, since there were more traditional Russian speakers in the east and south, that is, from the side of the borders with Russia.After the victory of Ukraine in this war, the atrocities of the Russians will cause and are already causing the desire of the citizens of Ukraine to abandon everything Russian, including the Russian language and culture. Russia is losing from the unleashed war in all directions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nhazwrath",
      "created_time": "May 14, 2022, 10:35:13 AM",
      "body": "First let me say that this entire topic is designed distraction BS from the media.  Secondly No, organic farming cannot scale to come anywhere near gm foods and modern fertilizer pesticides and herbicides. The best organic farmers on the planet the Amish Best effort is aprox 1/4 to 1/3 results with 10 times the manpower of a modern farm.  we are also Not running out of food or fertilizer.  more media bs.  all prices are entirely due to inflation and fuel costs. not scarcity.You CANNOT print off 80% of all the money ever printed in 1 go and expect a good result.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eaLiTy",
      "created_time": "May 14, 2022, 11:49:19 AM",
      "body": "Quote from: Hydrogen on May 12, 2022, 11:12:19 PM~Sanctions on natural gas could also carry a potential to price monsanto GMOs out of many farmer's budgets.Is there a clear cut and obvious solution to these issues society faces.We know that synthetic fertilizers can scale production. Can organic farming scale as well?Organic farming needs time and it is nearly impossible to scale like farming using synthetic fertilizers. Lets take the example of Sri Lanka, the government banned chemical fertilizer, pesticides, weedicides and fungicides without considering the after affects if they implement the ban all of a sudden and starts promoting organic farming. What happened is that the farmers started pay the price as the soil is not conducive to organic farming due the usage of chemical fertilizers and it has created a rippling affect as there is food shortage and higher food prices and now they are facing one of the worst economic crisis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "May 14, 2022, 12:09:50 PM",
      "body": "I live in a nation with no organic farming of worth, sure there are some for more elite but it's rarely bought in bulk by the common people, and regular food increased a ton as well. We are in a situation where gas/oil/petrol whatever you call it (thing that runs the cars and trucks) costs so so so much more that we just have to realize that the world will become a lot more expensive for everyone and everything that needs to be transported.So, anything that you need to take from place A to place B will use trucks and gas and that will cost more. We need to realize that we can't blame organic farming for this, that had nothing to do with the high inflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mometaskers",
      "created_time": "May 14, 2022, 02:38:34 PM",
      "body": "The agricultural crisis in Sri Lanka should be enough to show people that you can't just switch completely to organic farming without seeing a decrease in yields. Until we can completely recycle all the nutrients back into the soil, we would still need some synthetic fertilizers. I guess if people really get desperate they can improve their sewage collection LOL.Quote from: Hydrogen on May 12, 2022, 11:12:19 PMSanctions on natural gas could also carry a potential to price monsanto GMOs out of many farmer's budgets.NGL I'm not exactly upset about this. I've recently read a book about the history of plant domestication and found out one of their potatoes isn't even officially recognized as food.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "May 14, 2022, 04:33:07 PM",
      "body": "Quote from: avikz on May 13, 2022, 04:26:20 PMQuote from: Hydrogen on May 12, 2022, 11:12:19 PMWe know that synthetic fertilizers can scale production. Can organic farming scale as well?Ask Sri Lanka about it! As a part of financial reform and for a drive towards self-reliance, Sri Lanka banned the usage of fertilizers on April 2021. That reduced their farming yield by 45%. A country already struggling with Chinese debt, this one was the final nail on the coffin. Organic farming is not really a solution for a country unless they decide to use all of their lands for farming only. That's not gonna happen and that also has after effects on the economy because thet country will then have to be importing foods. I was having same thoughts while reading the news article posted. When they said organic, only Sri Lanka came on my mind. Don’t do that, never repeat the mistake which others did. We know the consequences. Without modern farming there is no way they can grow with high efficiency and also in large quantities. Organic farming is critical process and needs additional costs of setting up green houses, organic fertilisers are costly too! Ukrainians will need to depend on imports for very long period of time now. With war, there is no organic and inorganic farming for sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "May 15, 2022, 11:10:36 AM",
      "body": "Quote from: so98nn on May 14, 2022, 04:33:07 PMUkrainians will need to depend on imports for very long period of time now. With war, there is no organic and inorganic farming for sure. Ukraine is a large country with significant agricultural land, and I remember reading somewhere that sowing in parts of the country not directly affected by the war is relatively normal. The problem will be how to deliver what they produce, because the Russians have already destroyed (and are still destroying) key transport infrastructure (railways) and are blocking access to the sea, which exports most of the grain. I think the least problem for them now is how to produce organic food, because that would be insane at a time like this.On the other hand, people who have even a small garden will certainly try to produce some food for themselves and their families, because let's not forget that in addition to the inflation that we all complain about - they have a war that puts them in a far harder position than anyone else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "May 16, 2022, 05:41:45 AM",
      "body": "Quote from: Ozero on May 13, 2022, 06:42:59 AMI do not agree with your arguments. Organic farming is also called natural farming. It mainly uses organic matter as fertilizers, that is, overripe crop residues, weeds, all greens and dried plant residues, which, when used correctly, turn into biohumus. I don't see any problem here. Lol, no problems? You just invented bio humus! Second, you're deeply mistaken thinking weeds or feces or other residues that turn into compost are making hummus out of the blue, compost is itself is artificial, if you add compost on something that is not at all pure natural, you're just playing with notions and names.And organic farming is not natural farming, natural farming means you're taking the fruits directly from trees that have not been purposely planted, organic farming is not using pesticides and chemicals but you can still use modified plant species for it, actually, it's pretty hard not to use a hybrid at all if you want to grow at least one meal every 10 years.Quote from: Ozero on May 13, 2022, 06:42:59 AMI don’t know why you think that the harvest is much worse than fertilizer with different chemicals. In my opinion, just the opposite.That's the problem, it's your opinion and is not backed by data.Everyone thinks that because he was able to plant 10 potatoes in his garden or grow a lemon tree in a pot this could be done over hectares and hectares of land and all with compost and other mumbo jumbo and not a single problem or cost issue will arise.Oh, I got snails in my garden, drive to Home Depot and buy some Diatomaceous, cool  20 euros and you're all set, try to do it on one ha, and suddenly you'll see it costs you nearly 1,5k, and unless it's some fast-growing plant you might have to add another \"organic\" insect killer. At 10 tons at maximum for the organic harvest, 30 cents price per kilo and let's see how that goes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "May 16, 2022, 06:43:23 AM",
      "body": "Quote from: stompix on May 16, 2022, 05:41:45 AMQuote from: Ozero on May 13, 2022, 06:42:59 AMI do not agree with your arguments. Organic farming is also called natural farming. It mainly uses organic matter as fertilizers, that is, overripe crop residues, weeds, all greens and dried plant residues, which, when used correctly, turn into biohumus. I don't see any problem here. Lol, no problems? You just invented bio humus! Second, you're deeply mistaken thinking weeds or feces or other residues that turn into compost are making hummus out of the blue, compost is itself is artificial, if you add compost on something that is not at all pure natural, you're just playing with notions and names.And organic farming is not natural farming, natural farming means you're taking the fruits directly from trees that have not been purposely planted, organic farming is not using pesticides and chemicals but you can still use modified plant species for it, actually, it's pretty hard not to use a hybrid at all if you want to grow at least one meal every 10 years.Quote from: Ozero on May 13, 2022, 06:42:59 AMI don’t know why you think that the harvest is much worse than fertilizer with different chemicals. In my opinion, just the opposite.That's the problem, it's your opinion and is not backed by data.Everyone thinks that because he was able to plant 10 potatoes in his garden or grow a lemon tree in a pot this could be done over hectares and hectares of land and all with compost and other mumbo jumbo and not a single problem or cost issue will arise.Oh, I got snails in my garden, drive to Home Depot and buy some Diatomaceous, cool  20 euros and you're all set, try to do it on one ha, and suddenly you'll see it costs you nearly 1,5k, and unless it's some fast-growing plant you might have to add another \"organic\" insect killer. At 10 tons at maximum for the organic harvest, 30 cents price per kilo and let's see how that goes.Pretty good calculations here. If organic fertilisers would have been that easy to make or obtain then definitely it would have been on mass scale by now. The problem with organic fertilisers is, you have to use natural resources, from cow dung to wastes which are biodegradable. The process is natural and very slow which means time is another factor that is added into the costs. Moreover, as @stompix said, it would be hard to process the farming on hectares of land. We thinking about feeding the whole nation so definitely that much land would be needed to cultivate. If we go organic for such mass level then imagine how much cows and waste we will need to produce the required fertiliser. You will have to maintain both the thing at the same time. This is why Synthetic Fertilisers came into existence. They are so much advice that they are being produced on the level of genomic levels. They study the crop genome, and can now design specific fertiliser for that crop batch. It guarantees your crop production of high quality and also in bulk. With the world moving at faster pace, we have to be modern in the farming too!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nhazwrath",
      "created_time": "May 16, 2022, 11:09:40 AM",
      "body": "Quote from: Ozero on May 13, 2022, 06:42:59 AMI do not agree with your arguments. Organic farming is also called natural farming. It mainly uses organic matter as fertilizers, that is, overripe crop residues, weeds, all greens and dried plant residues, which, when used correctly, turn into biohumus. I don't see any problem here. Chemical fertilizers are worse for the assimilation of plants, non-compliance with the norms can harm human health. With organic, natural farming, there are no such problems. In addition, green manure crops are used in organic farming, that is, before sowing the main crops, after them, or even together with them, other crops are sown that saturate the soil with the necessary elements and fight pests. Organic farming definitely needs to be applied on small farms. I don’t know why you think that the harvest is much worse than fertilizer with different chemicals. In my opinion, just the opposite.You are seriously mistaken if you think that organic farming or natural farming or something Old style farming is somehow equal to modern farming.  BEST effort from the BEST organic farmers on the planet the Amish.   Their yield compared to modern farming is aprox only 1/4 to 1/3 a standard modern farm and it requires 10 to 20x the manpower.  I KNOW that the organic farming is the media darling tread ATM that somehow its \"better\" or \"equal\"  from modern farming but its not.   Not even close.   I DEARLY want people to stop listening to the media for their opinions.  talk to some actual modern farmers Most of the decent ones tend to have a science degree due to the requirements of modern farms.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitgov",
      "created_time": "May 16, 2022, 02:49:49 PM",
      "body": "Quote from: Nhazwrath on May 16, 2022, 11:09:40 AMQuote from: Ozero on May 13, 2022, 06:42:59 AMI do not agree with your arguments. Organic farming is also called natural farming. It mainly uses organic matter as fertilizers, that is, overripe crop residues, weeds, all greens and dried plant residues, which, when used correctly, turn into biohumus. I don't see any problem here. Chemical fertilizers are worse for the assimilation of plants, non-compliance with the norms can harm human health. With organic, natural farming, there are no such problems. In addition, green manure crops are used in organic farming, that is, before sowing the main crops, after them, or even together with them, other crops are sown that saturate the soil with the necessary elements and fight pests. Organic farming definitely needs to be applied on small farms. I don’t know why you think that the harvest is much worse than fertilizer with different chemicals. In my opinion, just the opposite.You are seriously mistaken if you think that organic farming or natural farming or something Old style farming is somehow equal to modern farming.  BEST effort from the BEST organic farmers on the planet the Amish.   Their yield compared to modern farming is aprox only 1/4 to 1/3 a standard modern farm and it requires 10 to 20x the manpower.  I KNOW that the organic farming is the media darling tread ATM that somehow its \"better\" or \"equal\"  from modern farming but its not.   Not even close.   I DEARLY want people to stop listening to the media for their opinions.  talk to some actual modern farmers Most of the decent ones tend to have a science degree due to the requirements of modern farms.  We cannot predict or blame anything for a trouble. Who would have known that war is coming for Ukraine is coming days- And how would have Russia thought that so many sanctions are coming for Russia. Ukraine was a progressive country before war. And blaming for anything is not a good gensture.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}