{
  "id": "topic_5448963",
  "title": "dimonstration",
  "author": "dimonstration",
  "created_time": "April 15, 2023, 04:34:09 PM",
  "content": "This happened to me last year and I just remember again when I view my PM history. Someone report all my previous post. I received bunch of deleted post notification on my inbox for more than a week then I received temporary ban for 7 days afterwards..All the post deleted is a decent and not spammy because I’m just disccusing with other user post on the thread with only 2 page. I realize that someone just browse my post history and report all my previous post. Question: At what certain amount of deleted post will cause a permaban? I lost count because I delete all this notification on my message because it's already annoying at that time.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448963",
  "comments": [
    {
      "author": "_act_",
      "created_time": "April 15, 2023, 04:44:25 PM",
      "body": "Quote from: dimonstration on April 15, 2023, 04:34:09 PMAll the post deleted is a decent and not spammy because I’m just disccusing with other user post on the thread with only 2 page. I realize that someone just browse my post history and report all my previous post. If you are not spamming in your own view make sure you read and reread your post again to make sure you have no typo errors. Sometimes typo errors can change the meaning of your posts into something else and if you did not read it for correction, your post may just be spam.Quote from: dimonstration on April 15, 2023, 04:34:09 PMQuestion: At what certain amount of deleted post will cause a permaban? I lost count because I delete all this notification on my message because it's already annoying at that time.I think admin and moderators would be able to answer this. I would not bother to know because I am not spamming.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "April 15, 2023, 05:12:39 PM",
      "body": "Quote from: dimonstration on April 15, 2023, 04:34:09 PMQuestion: At what certain amount of deleted post will cause a permaban? I lost count because I delete all this notification on my message because it's already annoying at that time.Spamming hardly gets one a ban but I think when your deleted post is more than your posts left then you get a temp and a temp ban that is incurred more than three times then the fourth one might lead to a permanent ban. https://bitcointalk.org/index.php?topic=1684035.0I don’t see this happening to an old account, mostly an account that is new and gets post deletion most often are the victims. Imagine making 50 posts and 30 are reported for spamming then it could lead to temp ban. But for a reputable account with some 50 post deletion from a total of thousand posts isn’t affected i think",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "April 15, 2023, 05:35:18 PM",
      "body": "Quote from: _act_ on April 15, 2023, 04:44:25 PMIf you are not spamming in your own view make sure you read and reread your post again to make sure you have no typo errors. Sometimes typo errors can change the meaning of your posts into something else and if you did not read it for correction, your post may just be spam.I check all my deleted post. I’m sure that it's not a spam because it's same quality on all of my post. I notice that this an attack because all the reported post was made a month ago and its in consecutive order.Quote from: Zaguru12 on April 15, 2023, 05:12:39 PMQuote from: dimonstration on April 15, 2023, 04:34:09 PMQuestion: At what certain amount of deleted post will cause a permaban? I lost count because I delete all this notification on my message because it's already annoying at that time.Spamming hardly gets one a ban but I think when your deleted post is more than your posts left then you get a temp and a temp ban that is incurred more than three times then the fourth one might lead to a permanent ban. https://bitcointalk.org/index.php?topic=1684035.0I don’t see this happening to an old account, mostly an account that is new and gets post deletion most often are the victims. Imagine making 50 posts and 30 are reported for spamming then it could lead to temp ban. But for a reputable account with some 50 post deletion from a total of thousand posts isn’t affected i thinkI remember it was 6 pager on my inbox all contains a notification of deleted post. With 5 to 10 deleted post in daily basis for a period of a week or more. I have around 3000 post that time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "April 15, 2023, 06:21:33 PM",
      "body": "Quote from: dimonstration on April 15, 2023, 04:34:09 PMThis happened to me last year and I just remember again when I view my PM history. Someone report all my previous post. I received bunch of deleted post notification on my inbox for more than a week then I received temporary ban for 7 days afterwards..All the post deleted is a decent and not spammy because I’m just disccusing with other user post on the thread with only 2 page. I realize that someone just browse my post history and report all my previous post. Question: At what certain amount of deleted post will cause a permaban? I lost count because I delete all this notification on my message because it's already annoying at that time.judging from the quoted post below that I found, deleted posts can only get you temporarily banned, and once you get to the fourth offence, you'll get the permaban. as for how many deleted posts before you get temporarily banned, I am not sure. from my experience, 30+ posts of mine were deleted in less than a month before I got temporarily banned(other user's experience could be different).Quote from: hilariousandco on November 17, 2016, 12:46:01 PMStaff do not want to hand out bans for unconstructive posts but if we feel that you as a user are continually making very poor or unsubstantial posts due to your paid signature the following bans will be issued:First offence: 7 daysSecond offence: 14 daysThird offence: 30 daysFourth: Permanent banYour first ban is your first warning. If you have to be banned for a fourth time it is permanent and you will no longer be allowed to participate on the forum under any accounts. Note: If you are banned on one account then you are not allowed to post under any accounts you own for the duration of your ban. The only exception to this rule is Meta where you can discuss the circumstances of your ban if you wish to do so but anywhere outside of that sub will be considered ban evasion and will get your ban doubled, but it is generally best to just patiently wait out your ban and improve your posts on return and hopefully no further bans will be needed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "April 15, 2023, 06:53:26 PM",
      "body": "Quote from: dimonstration on April 15, 2023, 04:34:09 PMThis happened to me last year and I just remember again when I view my PM history. Someone report all my previous post. I received bunch of deleted post notification on my inbox for more than a week then I received temporary ban for 7 days afterwardsNo matter how long it might have taken them to discover a post to be deleted, once they know this fact and have clear evidence it's not worth it, it will surely end being deleted, if you it seems ok by you doesn't means it's fine and ok by others, moderators keep to their duty roles by monitoring this.Quote from: dimonstration on April 15, 2023, 04:34:09 PMQuestion: At what certain amount of deleted post will cause a permaban? I don't think a deleted post can cause a permanent ban but the content of what you posted is very important as well, they may be suspicious activities you may not know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "April 15, 2023, 07:05:14 PM",
      "body": "Quote from: dimonstration on April 15, 2023, 05:35:18 PMI check all my deleted post. I’m sure that it's not a spam because it's same quality on all of my post. I notice that this an attack because all the reported post was made a month ago and its in consecutive order.It was not an attack, someone or some people saw your posts with errors or unworthiness and they keep reporting it is always the reason posts are deleted like that. As it led to temporary ban, it only means that you did something wrong. Your posts was reported continuously and moderators were deleting it.Quote from: dimonstration on April 15, 2023, 04:34:09 PMI remember it was 6 pager on my inbox all contains a notification of deleted post. With 5 to 10 deleted post in daily basis for a period of a week or more. I have around 3000 post that time. You can screenshot it for us to see if true you think they are not spam, just screenshot like 5 to 10 posts for us to see.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "April 15, 2023, 07:22:56 PM",
      "body": "Quote from: dimonstration on April 15, 2023, 04:34:09 PMQuestion: At what certain amount of deleted post will cause a permaban? I lost count because I delete all this notification on my message because it's already annoying at that time.There is no specific amount of deleted posts that would lead to a permanent ban, at least based on the unofficial rules of the forum, everything would be handled by the moderator on a case by case basis. Well i don't think i have ever seen a ban appeal by a user who claimed they were banned because they had too many deleted posts. For newbies they would basically just be nuked, but for users who have been here for sometime, i don't think they should be worried about a permaban for deleted posts, but they should work on the overall quality of their posts to prevent this from happening.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "April 15, 2023, 08:43:37 PM",
      "body": "Quote from: dimonstration on April 15, 2023, 04:34:09 PMQuestion: At what certain amount of deleted post will cause a permaban? I lost count because I delete all this notification on my message because it's already annoying at that time.Only the officials from the forum like Global moderators or admins can give you a specific answer to the question but from my experience and observation since all these years I may say that there are no actual number to it. The forum also does not have any point system too to ban you automatically. The mods manually ban a user. In that case, it entirely depends on the judgement of the mod who is banning you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "April 15, 2023, 09:51:58 PM",
      "body": "Quote from: dimonstration on April 15, 2023, 05:35:18 PMI check all my deleted post. I’m sure that it's not a spam because it's same quality on all of my post. I notice that this an attack because all the reported post was made a month ago and its in consecutive order.I doubt it was a personal attack, even if someone reported yourself out of malice, it is up to the moderators to decide how to handle the case. I have reports that are left handled for months, probably because the moderators consider the posts to be in a gray zone. In your case, it could be that it wasn’t that your posts were spam but the threads you made the posts were deleted by the OP or moderators. Still that would not have resulted in a temp ban, I think you got temp ban for something else. It would be much easier if you provided samples of some of the deleted posts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "April 15, 2023, 09:56:01 PM",
      "body": "Quote from: dimonstration on April 15, 2023, 05:35:18 PMI check all my deleted post. I’m sure that it's not a spam because it's same quality on all of my post. I notice that this an attack because all the reported post was made a month ago and its in consecutive order.Moderators carefully review your post before they delete it, so you can't be absolutely sure it's not spam even if you didn't mean to send it. The problem might be that some people are interested in reporting a user's old post or two, but so far that's not what I'm reporting. I tend to report the latest post that I accidentally come across in several different thread, this saves me a lot more time than accidentally reviewing posts from one profile to another.About spam or not, it depend on the moderator who handle the report because I'm sure they will review the report one by one before marking our report as good, bad or not handled.QuoteQuestion: At what certain amount of deleted post will cause a permaban? I lost count because I delete all this notification on my message because it's already annoying at that time.Only moderators know the amount. But when you keep getting posts deleted within 24 hours up to 30 - 50 posts, then it's very possible moderator ban your account with temporary ban.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "April 15, 2023, 10:03:19 PM",
      "body": "Quote from: dimonstration on April 15, 2023, 04:34:09 PMThis happened to me last year and I just remember again when I view my PM history. Someone report all my previous post. I received bunch of deleted post notification on my inbox for more than a week then I received temporary ban for 7 days afterwards..All the post deleted is a decent and not spammy because I’m just disccusing with other user post on the thread with only 2 page. I realize that someone just browse my post history and report all my previous post. Question: At what certain amount of deleted post will cause a permaban? I lost count because I delete all this notification on my message because it's already annoying at that time.I did check your history and as per BPIP:@acroman08 has posted regarding the rules about it.But let me quote @hilariousetc for a better explanation:Quote from: hilariousetc on July 23, 2019, 10:17:13 AMThere is no set number and bans are taken on a case by case basis but bans are rarely given for a set amount of posts deleted. If you're caught spamming and all your posts are very low quality then you might get a temp ban. If you don't take the warning and continue making low quality content you'll usually get another ban with the duration doubled but if you have to be banned three times then the fourth is usually the last one you'll get. Thankfully most don't get that far these days but there's also less bans given out for sig spam. This is something we still should be enforcing at the root cause which is the sig campaigns themselves. If they're paying for this fluff time and time again then they should receive the punishment but that's rare. The only case I can think of recently was yobit. Thankfully most campaigns don't get that bad but yobit was like an avalanche of spam unleashed instantly so they had to be dealt with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "April 16, 2023, 06:30:45 AM",
      "body": "too many threads about posts being deleted, and it also happen to me.So, it's a good time for the forum or administrator open registration (or rotate) new staff or moderators openly.please consider it, don't look it by the report, because the quote below will create you like crazy.QuoteIf you want to be a moderator, report many posts with accuracy. You will be noticed.https://bitcointalk.org/adrotate.php?adinfo",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "April 16, 2023, 07:22:49 AM",
      "body": "Case will be handle case-by-case and it depends on intensity for rule violation as well as each moderator perspective when applying forum's (un)official rules.Usually, sending unsolicited PMs will cause to 7-day temporary ban (first offence), 14-day temporary ban (second offence) but like the following case, it's 30-day temporary ban for a first offence.Quote from: theymos on September 22, 2019, 12:42:51 PMYou sent over 100 PMs with the same format: clear unsolicited bulk PMs. 4 people reported it, making it unwanted & unsolicited bulk PMs = spam. Most others would've been banned much longer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "April 16, 2023, 07:34:27 AM",
      "body": "Quote from: Sarah Azhari on April 16, 2023, 06:30:45 AMtoo many threads about posts being deleted, and it also happen to me.So, it's a good time for the forum or administrator open registration (or rotate) new staff or moderators openly.If the moderator delete your post, it's mean the reporter was right. AFAIK moderator isn't looking to check each thread or post, but they will take an action if it's reported. Moderators are just do their jobs, if you think moderator shouldn't delete a bad, low or spam post, you're wrong. To be fair, if you think your post is good enough and moderator made a mistake for delete your post, you can create an appeal thread about your deleted posts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Timelord2067",
      "created_time": "April 16, 2023, 08:42:39 AM",
      "body": "I've had posts of my own in my own thread talking about the topic of the thread deleted by Troll DT1 Trolls who are admins or mods.When one or more of them have a vendetta against you (in my case exposing their alts or calling out their scam behaviour) they will continue to hold a grudge and constantly delete your posts.Sad really.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "April 16, 2023, 09:09:14 AM",
      "body": "Quote from: Zaguru12 on April 15, 2023, 05:12:39 PMQuote from: dimonstration on April 15, 2023, 04:34:09 PMQuestion: At what certain amount of deleted post will cause a permaban? I lost count because I delete all this notification on my message because it's already annoying at that time.Spamming hardly gets one a ban but I think when your deleted post is more than your posts left then you get a temp and a temp ban that is incurred more than three times then the fourth one might lead to a permanent ban. https://bitcointalk.org/index.php?topic=1684035.0I don’t see this happening to an old account, mostly an account that is new and gets post deletion most often are the victims. Imagine making 50 posts and 30 are reported for spamming then it could lead to temp ban. But for a reputable account with some 50 post deletion from a total of thousand posts isn’t affected i thinkSpamming is against the forum rules but then 90% of the total posts in the forum are spam posts it is hard to enforce this rule.   If the admin wanted to ban every spammer, there wouldn't be any users left to post   If someone is getting banned temporarily for spamming, then his posts should be incredibly out of topic, one liners or some other crap. Or maybe the mod was fooled to think you were a spammer since he is getting so much reports because somebody was targeting you, but then this mod isn't right in the head for falling to this cheap trick.Quote from: Timelord2067 on April 16, 2023, 08:42:39 AMI've had posts of my own in my own thread talking about the topic of the thread deleted by Troll DT1 Trolls who are admins or mods.When one or more of them have a vendetta against you (in my case exposing their alts or calling out their scam behaviour) they will continue to hold a grudge and constantly delete your posts.Sad really.Who is it you are talking about? Be more specific please. Names.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Timelord2067",
      "created_time": "April 16, 2023, 10:04:27 AM",
      "body": "QuoteName namesNot my thread.(But look at the DT1's who distrust me and you'll have your answers - one of the admin/mod on DT1 is even distrusting me with both thier main and their alt - with LoyceV's blessing)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "April 16, 2023, 10:42:40 AM",
      "body": "Quote from: Timelord2067 on April 16, 2023, 08:42:39 AMI've had posts of my own in my own thread talking about the topic of the thread deleted by Troll DT1 Trolls who are admins or mods.~snip~Do you claim that one of the 2 admins that exist on this forum deletes your posts for some reason without any valid reason? It seems to me that they are dealing with much more important work than stooping to such a low level, which would include some kind of personal revenge in the form of deleting posts.In addition, in almost 10 years of your presence on the forum, you have only had 33 deleted posts, so I don't know where you see that someone is against you in the sense of how you imagine it. It must be extremely difficult to live in the belief that only you are unique, and all others are alt accounts of some other alt accounts...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "April 16, 2023, 12:54:06 PM",
      "body": "Quote from: Timelord2067 on April 16, 2023, 10:04:27 AMwith LoyceV's blessingIf you want to spread BS about me, at least do it in my reputation thread. What makes you think Admin or Mods needs my blessing to do anything?Quote from: Lucius on April 16, 2023, 10:42:40 AMDo you claim that one of the 2 admins that exist on this forum deletes your posts for some reason without any valid reason?Timelord2067 has always had a poor understanding of the Trust system. That's okay, many users don't get the details, but it seems to really bother him.QuoteIt must be extremely difficult to live in the belief that only you are unique, and all others are alt accounts of some other alt accounts...His beef is with hilariousandco, who doesn't want to see his feedback. That's totally fine, I even get it. He uses the Trust system as his personal diary.Back ontopic:Quote from: dimonstration on April 15, 2023, 04:34:09 PMAll the post deleted is a decent and not spammy because I’m just disccusing with other user post on the thread with only 2 page.I've had posts deleted, but I've never been banned. The point is to learn from it, and not to do it again. If you think the posts weren't spammy, you'll need to provide examples, but my guess is you're probably wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}