{
  "id": "topic_5430037",
  "title": "halloweenn666",
  "author": "halloweenn666",
  "created_time": "December 18, 2022, 07:34:18 PM",
  "content": "Düşünsene evrenin yaşı 4-5 milyar yıl belkidaha fazlaDunyanin yaşı aynı şekilde.Sen 70-80 yılcık omrunle gelmişsin burada kendini özel hissediyorsun falan.Bir tane akıllı yok mu biz napiyoruz ya diyecek ?En azından zeki insanları bir araya toplayıp durumu izah edecek?Abi herşey boş hepinize bol şanslar ama gerçekten su hayatın tadını çıkarın. 4-5 milyar yıl sonra tüm tesadüfler bir araya geldi ve ben burada size yazıyorum sizde okuyorsunuz keyfini çıkarın.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5430037",
  "comments": [
    {
      "author": "meser#",
      "created_time": "December 18, 2022, 08:19:13 PM",
      "body": "Bu üzerinde asırlarca felsefe yapılmış bir şey ve tak diye cevabı olan bir şey de değil. Bir inanışa göre reenkarnasyon diye birşey var. Hadi diyelim reenkarnasyon var ve insanlığın olduğu süreçten bu yana binlerce hayatın oldu ve bir tanesinde geniş bir aydınlanma yaşadın ve hayatın boş olduğuna karar verdin. Semavi dinler penceresinden bakalım. Öteki dünya için bir sınav yeri olan bu dünya da hayat boş dedin canın ne istiyorsa yaptın ya da yaşamanın ne gereği var dedin canına kıydın. Öteki tarafdan da oldun. Daha başka bir pencereden bakalım bu evrende düşünebilen bir varlık olmak yerine başka birşey olarak gelmiş olsaydın ezilen, avlanan vb...  Varsayımına bakarak şunu da diyebiliriz 4-5 milyar yıllık bir evrende 70-80 senelik bir ömrün var ve bunun ne kadar hakkını verebildin? Boş gelip boş mu gideceksin? Sahnenin sana ayrılan süresinin sonunda pişmanlıklarınla mı gideceksin? Varsayımlarında tek etkili olabileceğin şey ne zaman öleceğindir hah hadi ben kaçtım diyerek şuan canına kıyabilirsin onun dışında başka birşeye etkili olamazsın. Son nefesin geldiyse 1 dk daha geciktiremezsin. Burada önemli olan bu kadar az süre içerisinde ne kadar güzel yaşayabileceğin olmalıdır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wolwoo",
      "created_time": "December 19, 2022, 07:31:53 PM",
      "body": "Hayat niye bomboş olsun, herşey var ama istifade edebilmek mesele!bazen kayıplarımız oluyor üzülüyruz falan ama aslında neler neler kaçırıyoruz? maddi-manevi...haberimiz bile yok olsaydı 2010da herkese pizza ısmarlar bitcoinleri cebe atardık Kâlû Belâdan bu yana 5 milyar yıl beklemişiz, gele gele bu döneme denk gelmişiz  gerçi daha kötüsü de olabilirdi WWI-WWII gibi dönemlere oranlaHayat bir oyun ve eglenceden ibarettir, mal ve evlatlar süsü, önemli olan iyi bir insan olabilmek ve mümkün olduğunca çalışıp çabalamak, helalinden birşeyler kazanmak, kazandığını harcamak-paylaşmak, insanları canlıları mutlu etmek ve o arada kendini de mutlu edebilmek...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}