{
  "id": "topic_5454047",
  "title": "Succeeder5748",
  "author": "Succeeder5748",
  "created_time": "May 26, 2023, 12:10:02 AM",
  "content": "Hi, I was wondering which YouTube bitcoin influencers/traders/presenters are good examples for terrible bitcoin analysis that can give me an opposing view to some of the other adept influencers? That I could perhaps try to counter trade their advice?At the moment I kind of think IvanonTech the Russian dude is pretty convincing to counter trade, what do you folks reckon?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454047",
  "comments": [
    {
      "author": "Darker45",
      "created_time": "May 26, 2023, 01:03:22 AM",
      "body": "I'm not following any YouTube and other social media Bitcoin influencers or traders, but I've read some posts about a handful of strong Bitcoin critics whose words are treated as a signal to buy. Peter Schiff is one. Each time he barks at Bitcoin is accordingly buy time. Is Paul Krugman also treated the same? Anyway, is this a wise way of trading? If you are trading like this, how different are you from these speculators or influencers? I guess they should all be treated with a grain of salt. You're probably better off following your own analyses, technical or fundamental.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "May 26, 2023, 02:27:22 AM",
      "body": "I don't follow any influencer to take any trade, I just see what the price action is doing and do what your mind thinks is good.If it goes bad, you learn. If it goes your way, you earn. Keep on doing it with a small amount and you will soon be good at it.If you want to counter-trade someone, it's Jim Cramer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nutildah",
      "created_time": "May 26, 2023, 02:30:16 AM",
      "body": "Here's the thing: if they're an actual influencer, then they're bad at trading. Anybody who actually knows what they're talking about isn't going to be posting their knowledge for free on YouTube. So they're all bad.  Your average influencer can't pump or dump the price of BTC, but they can altcoins. So if you see one chatting up a particularly low-cap altcoin and its already been pumped (up far more than usual in too short a time), then that's likely a good short opportunity.Sorry I don't have specific examples to give you, I never look at that kind of stuff on YouTube. Usually I'm trying to get away from crypto stuff when I go there. Basically nobody knows anything when it comes to BTC speculation (at least in the short term), and if they claim they do know, run away from them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "May 26, 2023, 04:22:46 AM",
      "body": "Quote from: ImThour on May 26, 2023, 02:27:22 AMIf you want to counter-trade someone, it's Jim Cramer.What is wrong with this guy  it seems that every prediction that he makes turns out to be the complete opposite outcome.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "May 26, 2023, 04:49:20 AM",
      "body": "@OP what's your current job? would you mind if I replace your position?If a real trader give his signal and analysis to everyone for free, what's the benefit for them if they can keep silent and make a lot money from it? it's just a wasting time to give a free signal to every strangers in social media.Influencers are making money through ad sense and total views, while free signal in telegrams are making money by asking you to click a link, download or use his referral link, don't get tricked.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AHOYBRAUSE",
      "created_time": "May 26, 2023, 04:56:10 AM",
      "body": "He is not talking about bitcoin but this guy, Austin Hilton, is a shiba inu jokester.Don't really understand his agenda but this guy is pushing shiba so hard, even though he doesn't deliver .He also flames other altcoins and praises shiba and other meme coins to be the holy grail.He often posts like 2-3 videos a day , basically always the same nonsense, haha.I didn't find any bitcoin or altcoin trader/news channel that is worth my time yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "May 26, 2023, 04:56:35 AM",
      "body": "Quote from: Succeeder5748 on May 26, 2023, 12:10:02 AMHi, I was wondering which YouTube bitcoin influencers/traders/presenters are good examples for terrible bitcoin analysis that can give me an opposing view to some of the other adept influencers? That I could perhaps try to counter trade their advice?At the moment I kind of think IvanonTech the Russian dude is pretty convincing to counter trade, what do you folks reckon?I would recommend you to avoid those social media influencers at any cost. Even, if their analysis turns out terrible or give opposing view I still suggest you to avoid those people. The Bitcoin market isn't an easy thing to manipulate and even if a social media influencer that has more than 1 million subscribers announces that Bitcoin is going to moon this weekend, don't trust that person.It's not a great thing to blindly counter trade against the analysis of those influencers whose analysis always follows the reverse trend. Because sometimes the situation can be different and instead of their advice going inverse it can go according to their predictions. The real whales can influence the market and if they all decide to do something to the market than they have the power to do so.Although, the whales are powerful enough to change the market for short term but they won't be able to keep it that way for long term. Bitcoin isn't like other alternative coins that can be altered by whales and social media influencers easily and for long term. It has its own level and that can't be influenced by a single person or a group. Only most famous people can do such things like Elon Musk, and Jeff Bezos, and they will be able to do that only if they promote their own products and add Bitcoin as a premium way of payment with some extra perks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "glendall",
      "created_time": "May 26, 2023, 07:50:35 AM",
      "body": "no suggestions for crypto influencer channels, because they can't be role models, where they only look for hype from new coins and are fomo as long as they get money only,moreover, you will invite them to debate crypto issues, I think it will be a waste of your time where they don't understand what they have to offer and tell their channel as a wholethe reason I say that is because I don't follow YouTube and other social media Bitcoin influencers or traders, I trade according to my will and my readiness in the capital I have",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tokentitan",
      "created_time": "May 26, 2023, 08:11:27 AM",
      "body": "Quote from: Succeeder5748 on May 26, 2023, 12:10:02 AMHi, I was wondering which YouTube bitcoin influencers/traders/presenters are good examples for terrible bitcoin analysis that can give me an opposing view to some of the other adept influencers? That I could perhaps try to counter trade their advice?At the moment I kind of think IvanonTech the Russian dude is pretty convincing to counter trade, what do you folks reckon?All of them are scams! They are only interested in your money. Do your own research and develop your own strategy.Even seasoned people get cheated sometimes. I knew this long ago but watching one popular YouTuber talking about Sezar I analysed it on Dex Tools and without further research due to the influence of convincing sweet talk and analysis presented I bought loads of Sezar even overlooking risk management. Look at it now! See for yourself. This is what happens following YouTube Videos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "May 26, 2023, 08:15:17 AM",
      "body": "Quote from: Succeeder5748 on May 26, 2023, 12:10:02 AMHi, I was wondering which YouTube bitcoin influencers/traders/presenters are good examples for terrible bitcoin analysis that can give me an opposing view to some of the other adept influencers? That I could perhaps try to counter trade their adviceDon't rely on anyone with your money, capital for your investment and trading.They can be influencers who only want to gain traffics for their channels, increase followers and get more income from advertisements.They can be good people and want to help you but they can not be right always. If you rely on their opinion for your decisions, if they are wrong, you will make wrong decisions too. At the end, you can not ask them to cover your losses.Awesome Crypto TradingOne of best weapons for trading",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "May 26, 2023, 08:16:48 AM",
      "body": "Quote from: Succeeder5748 on May 26, 2023, 12:10:02 AMHi, I was wondering which YouTube bitcoin influencers/traders/presenters are good examples for terrible bitcoin analysis that can give me an opposing view to some of the other adept influencers? That I could perhaps try to counter trade their advice?Advise for you OP1. Why do you want to venture into an opposition attacks that only focus on tackling others on the crypto network, is that being professional as well?2. You need to be very care of those you so called bitcoin influencers or analyst, they are nothing than promoters of a certain effect or brand they were being paid for to do, where you also paid to attack someone or to join those into this funny acts of attackers calling theirselves influencers in disguise.3. I will advise you not to join them, and i don't think I can give such a recommendation for you when what you're intending for it is not upto expectation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z390",
      "created_time": "May 26, 2023, 09:05:28 AM",
      "body": "So your plan is to always do the opposite of what the crap influencers says on their channel? Bro you are a weird one  , no one want to do this but you? Hahaha very funny, you remind me of Bitboy, he now has a token called Ben, I am very sure that almost all crypto influencers that created their own meme coins will get arrested in the future, I can take a bet on this from anybody. Anyways, you do your thing, but I won't do the same because you are making things sound as if those bad crypto influencers are intentionally doing this, but they are learning too, as time goes on they will learn from their mistake and if you trade because of this you might make a mistake and do a bad trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "May 26, 2023, 10:16:09 AM",
      "body": "Quote from: tokentitan on May 26, 2023, 08:11:27 AMAll of them are scams! They are only interested in your money. Do your own research and develop your own strategy.Even seasoned people get cheated sometimes. I knew this long ago but watching one popular YouTuber talking about Sezar I analysed it on Dex Tools and without further research due to the influence of convincing sweet talk and analysis presented I bought loads of Sezar even overlooking risk management. Look at it now! See for yourself. This is what happens following YouTube Videos.That's right, why should an experienced trader who knows his strategy tell what his capital does? All these YouTube and TikTok channels are aimed only at their own material benefit and nothing more. Maybe before, when social networks were just emerging and people were interested in connecting with those who were far from them, one could think of a sincere common interest. Today, everything is only about your own \"I\" and your glory. As soon as these predictors are wrong, they either disappear and are resurrected with a new name, or they blame everyone around them but not themselves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bussybuddy",
      "created_time": "May 26, 2023, 12:43:31 PM",
      "body": "Information and knowledge appear in abundance in different media, with many ways to win the trust of people and especially those who are new and less experienced in this environment. I really find it useless to hear any fake stuff or someone about the word expert in this market and promoted with YT, and I also know some users still consider information from YT is clean  , anyway with this market, I'm pretty forgetful about where is for fun and where to talk about work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Edwardard",
      "created_time": "May 26, 2023, 02:05:49 PM",
      "body": "Quote from: Succeeder5748 on May 26, 2023, 12:10:02 AMHi, I was wondering which YouTube bitcoin influencers/traders/presenters are good examples for terrible bitcoin analysis that can give me an opposing view to some of the other adept influencers? That I could perhaps try to counter trade their advice?At the moment I kind of think IvanonTech the Russian dude is pretty convincing to counter trade, what do you folks reckon?Almost all of them have their good days and bad days. Counter trading one particular youtuber today might be beneficial but doesn't give you a guarentee that they will be always wrong (seems sarcastic but true). So, dont get into all these mess and create more confusions for yourself. Just be calm and peacefully follow your own charts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "May 26, 2023, 02:26:39 PM",
      "body": "#Metoo, I hardly think that I have ever got influenced by any youtuber or any other social media influencer. They are just making money with their followers and their views. Most of the time famous accounts will invest heavily in the paid views, and what's leftover as small portion is organic traffic. That too I hardly think follow them seriously and get influenced. If I am scrolling through YouTube shorts then I would literally see people sharing their graphs and making thousands of dollars in 1 minute video. If you check, the account with thousand to million followers would do nothing but advertise the related products, get super thanks, paid versions of videos and in play ad videos etc etc. Basically they are getting paid for virtual influence. Lolz. So that is a big no for sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robattfield",
      "created_time": "May 26, 2023, 06:48:16 PM",
      "body": "I don't follow any influencers in the crypto community and don't follow their lead. This is really bullshit; they just want to make an impact through their free insights to increase their reputation and attract customers, and it doesn't help the community. So do not waste time on these useless videos; it is better to research and learn by yourself to create value for the work you are doing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "May 26, 2023, 06:53:57 PM",
      "body": "I stop following youtube speculators since I learned that most of their prediction often contradicts the result.  I also think that a trader will never spill his secret so most of these so-called trade influencers are just copying the works of others and basing their predictions on the news which many of us can do too.  Aside from that influencers are focused on creating content while traders are focused on their trading activities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "May 26, 2023, 07:15:04 PM",
      "body": "This wouldn't work neither. I mean obviously OP already knows following youtubers to trade wouldn't work since he is looking for someone to counter trade and that looks like a more serious threat to them. But at the same time, we are talking about something reverse wouldn't really work neither. How would you know when they will be right and when they will wrong, you could do what they say and they could be wrong and you lose money but you could do opposite of what they say and they could be right and you would lose again.So, it is much wiser to just ignore them, not even have a remotely small tiny idea what they are doing and that way they would be doing a lot better. I personally would prefer that a lot and could help them on the long run as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}