{
  "id": "topic_5470503",
  "title": "nicehash",
  "author": "nicehash",
  "created_time": "October 16, 2023, 08:17:52 AM",
  "content": "Kaspa miners can take advantage of the NiceHash kHeavyHash stratum to sell their hashrate. You can mine anonymously and get higher earnings directly in Bitcoin, or open an account and enjoy advanced mining statistics & reporting, frequent payouts, fast & cheap Bitcoin Lightning Network withdrawals and other advantages of the platform.Kaspa mining has seen a lot of interest since the addition of ASICs to the network, and on the NiceHash social media accounts we are running a contest to win KS0 miners this month, feel free to enter. Find out how to connect your miners on the link below:https://www.nicehash.com/asic-mining",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470503",
  "comments": [
    {
      "author": "FP91G",
      "created_time": "October 18, 2023, 12:00:47 PM",
      "body": "Why don't you visit your project threads on this forum?https://bitcointalk.org/index.php?topic=562238.6900https://bitcointalk.org/index.php?topic=5132119.2860Completing KYC is not mandatory for existing users at this time, but is recommended to further protect your NiceHash account. KYC is mandatory for previously registered users who log in for the first time after the launch of the new platform.https://www.nicehash.com/support/general-help/kyc/what-is-kycWhy do you require KYC from miners if they do not trade hashrates?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nicehash",
      "created_time": "October 23, 2023, 01:27:26 PM",
      "body": "You don't need KYC for mining, only for buying hashpower. We also recently added a feature to auto withdraw mining earnings where you can set an external wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sxemini",
      "created_time": "October 24, 2023, 09:41:02 AM",
      "body": "Quote from: nicehash on October 23, 2023, 01:27:26 PMYou don't need KYC for mining, only for buying hashpower. We also recently added a feature to auto withdraw mining earnings where you can set an external wallet.I can´t withdraw my funds without KYC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}