{
  "id": "topic_5431134",
  "title": "mausuv",
  "author": "mausuv",
  "created_time": "December 23, 2022, 04:28:44 PM",
  "content": "@LoyceV (OP)Hi, I need Bitcoin Public Key Database with balance  2009 to 2022Please upload Bitcoin Public Key Database with balance your site http://addresses.loyce.club/Example Publickeys.txtCode:02ceb6cbbcdbdf5ef7150682150f4ce2c6f4807b349827dcdbdd1f2efa885a263002ceb6cbbcdbdf5ef7150682150f4ce2c6f4807b349827dcdbdd1f2efa885a263002ceb6cbbcdbdf5ef7150682150f4ce2c6f4807b349827dcdbdd1f2efa885a2630Bitcoin Public Key Database  2009-2022 any  gdrive github other site send link pleasei need 1M < 10M public keys .txt formetany one send me link pleaseOrHow to scrape bitcoin public key 2009 to 2022 , any code ineed 1M<10M Public keys",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5431134",
  "comments": [
    {
      "author": "jackg",
      "created_time": "December 23, 2022, 05:40:06 PM",
      "body": "1. You need to start by syncing with the bitcoin blockchain (such as by running bitcoin core). You can then use software to parse the blockchain database (there's quite a lot of options available, as well as running the commands on the daemon yourself).Your might face an issue if you're wanting a public key instead of an address though as they're only given when funds are spent from them and not when funds are received as those are sent to addresses (which are hashed forms of private keys).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoSh1va",
      "created_time": "December 23, 2022, 06:34:38 PM",
      "body": "Quote from: jackg on December 23, 2022, 05:40:06 PMYour might face an issue if you're wanting a public key instead of an address though as they're only given when funds are spent from them and not when funds are received as those are sent to addressesOn very old addresses, the public key can be seen even without outgoing transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "December 24, 2022, 04:48:53 AM",
      "body": "Quote from: mausuv on December 23, 2022, 04:28:44 PMHow to scrape bitcoin public key 2009 to 2022 , any code ineed 1M<10M Public keysYou can't get a database of all public keys that have a positive balance, but you can find at least some of them: particularly those with P2PK scripts, associated with partially spent addresses, re-used addresses, and those that have been stolen or exposed in any other way. You probably need to find all addresses with balance and than filter out those that didn't reveal a public key. Some useful scripts in Python:https://github.com/graymauser/btcposbal2csvhttps://github.com/shivaenigma/bitcoin-abehttps://github.com/alecalve/python-bitcoin-blockchain-parserhttps://github.com/ragestack/blockchain-parserhttps://github.com/garethjns/PyBC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "December 24, 2022, 02:03:33 PM",
      "body": "So, as far as I understand you want three kind of outputs:P2PK outputs. (most of which happened from coinbase rewards in the early days)Outputs with reused addresses. (reuse of an address reveals its public key(s), if any)P2TR outputs.To be sure you've checked all public keys, you'll have to probably either alter the source code of one of these projects witcher_sense has provided, or write one yourself. If not, they must do the work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}