{
  "id": "topic_5405038",
  "title": "mrxdaunknown",
  "author": "mrxdaunknown",
  "created_time": "July 03, 2022, 05:14:03 PMLast edit: March 25, 2025, 02:47:15 PM by mrxdaunknown",
  "content": "_______________________________________________________________________________ _disclaimer: Hey guys, I just noticed there is no flamingo thread on bitcointalk and of course there should be one.I am not the owner or developer, just a participant in the project_______________________________________________________________________________ _Flamingo.Finance - Innovative DeFi on the NEO blockchainhttps://flamingo.finance/Flamingo Docs (Flamingo Litepaper, How to Set Up a Neo Wallet, How to Buy FLM Tokens, Swap):---- https://docs.flamingo.finance/ ----Social Media:Twitter: https://twitter.com/FlamingoFinance Discord: https://discord.gg/flmMedium: https://medium.com/flamingo-finance/Reddit: https://www.reddit.com/r/FlamingoDeFi/Telegram: https://t.me/flamingo_financeYouTube: https://www.youtube.com/c/FlamingoFinanceWhat is Flamingo (FLM)?Flamingo Finance is a Decentralized Finance (DeFi) platform where users can convert assets, wrap assets, provide liquidity,and earn yield through staking.The Flamingo token (FLM) functions as the rewards token users can earn by adding liquidity to liquidity pools and staking their liquidity pool tokens (LP tokens). Flamingo's SmartStake feature enables users to perform all of these actions in a single click.   The platform facilitates automated transactions between cryptocurrency tokens on the Neo N3 blockchain through the use of smart contracts. The project was initially launched by Neo Global Development* (NGD), underscoring Neo's vision to build the Smart Economy, of which DeFi is a crucial component. It has been in development for almost 2 years!!*Neo Global Development (NGD) is the execution arm under Neo Foundation.https://coinmarketcap.com/currencies/flamingo/FLM Tokenomicshttps://flamingo-1.gitbook.io/user-guide/v/master/flm-tokenomicsThere is a hard cap of 1 Billion FLM tokens, to be minted and released into circulation over the next 17 years. The total supply will be fully minted and released into circulation by the end of 2039. At the time of writing, 337.6 Million (about 1/3 of the total supply) FLM tokens have been minted and are in circulation. The current annual inflation rate (July) is 3.1%. Come December, 2022, the annual inflation rate will drop to 2.55%. The annual inflation rate will continue to decrease monthly until January, 2033. It will then drop again January, 2037, and again October, 2039. All 1 Billion FLM tokens will be minted and released by the end of 2039.Why Flamingo.Finance?>>> Built on NEO - one of the fastest and best smart contract blockchains <<<>>> Trade like you would do on a CEX with Orderbook+ (a completely decentralized, on-chain, block-based orderbook on layer 1) <<<>>>  Own Stablecoin FUSD (a decentralized, over-collateralized USD stablecoin) <<<>>> FLOCKS - A dividend-bearing asset (earn like a shareholder from plattform fees) <<<>>>  Easy to use and innovative   <<<>>> Useable on mobile via OneGate Mobile App - you can convert, stake, earn, claim rewards, and more, directly from your mobile device  <<<>>>  Flamingo Bug Bounty Program - up to $1,000,000 USD rewards (to ensure a safe and trustly platform)  <<<>>>  Great team behind it - which is improving the platform even while you´re reading this line  <<<>>>  1st July 2022: Users can now buy crypto with fiat on Flamingo.Finance! \"With Inst.Money, you can now buy crypto instantly. It’s fast, easy and secure, and right on Flamingo.\"  <<<FUSD stablecoin- Launched 10th January 2023- FUSD is a decentralized, over-collateralized USD stablecoin developed by Flamingo on the Neo N3 blockchain- The value of FUSD is backed by the most prominent Neo-N3 assets tradable on Flamingo — FLUND, bNEO and fWBTC. - FUSD can be generated by anyone whose connected wallet contains at least one of these tokens. Up to 35% of the value of the crypto assets used can be lent. Example: I have $10,000 worth of bitcoin and can now deposit it and mint up to $3500 worth of FUSD and lend it. Of course, interest is due (it’s a loan).You can read more about it here: https://flamingo-1.gitbook.io/user-guide/v/master/flamingo-stablecoin-fusd An easy-to-understand video of the process is also available: https://youtu.be /CuXVS8odl-c- Learn more: https://medium.com/flamingo-finance/flamingo-finance-defi-releases-usd-stablecoin-fusd-49d61657a2c4OrderBook+- Updated OrderBook+ launched 6th March 2025- After years of pure innovation, Flamingo has done what has never been done before: built a completely decentralized, on-chain, block-based orderbook on layer 1.> The first of it´s kind in the whole crypto space! <- On Flamingo’s OrderBook+, you can now trade like you’ve never traded before, with fully decentralized order matching. - Traders can expect to be able to make limit and market orders with enhanced liquidity routing mechanisms, right on the Neo N3 blockchain.- Trade on a DEX like you would trade on a CEX! Flamingo’s OrderBook+ combines the powers of an Automated Market Maker (AMM) and limit orders to create optimaldecentralized trading conditions. The result is an orderbook with zero-spread and automated market making whilst letting users still trade like they are used to by placing limit orders.- OrderBook+ allows users to create limit orders for any trading pair on the Flamingo Decentralized Exchange (DEX). A limit order is an order to buy or sell a token at a specific price or better. Just set a bid-price or ask-price and wait for your order to be executedRead more here: https://medium.com/flamingo-finance/experience-the-future-of-defi-with-flamingos-orderbook-2-0-now-live-on-mainnet-bbc1babafc15FLOCKS - BURN-TO-EARN25 March 2025: It´s finally here! FLOCKS has launched! Another huge innovation and milestone in the crypto space.\"FLOCKS is Flamingo’s dividend-bearing asset. Owning FLOCKS tokens can be seen as owning a piece of Flamingo. Flamingo users can buy a share of FLOCKS to receive passive income (yield). FLOCKS holders receive this yield from many different sources: platform fees, loan interest, and minting rewards.\"Read full announcement here: https://medium.com/flamingo-finance/flamingo-finance-announces-flocks-dividend-bearing-token-and-flund-migration-d41355153378At the start (first 6 days), FLUND holders can convert FLUND to FLOCKS. Afterwards, everyone can buy FLOCKS for FLM - or to be more precise - burn FLM to get FLOCKS.At the time of writing, over 12 Million FLM have been burned already!The TeamThe current team did take over from the original NGD team about 1 year ago. NGD wanted to pass on flamingo to the community, and mr.google already created a few tools for them (smartstake). He then applied to take over flamingo and built a team around it. The real takeover happened about 8 months ago.-> https://neonewstoday.com/general/mymingo-submits-application-to-manage-and-maintain-flamingo-finance/ <-Mr.Google and some of the other flm members are doxxed, but do your own research.Thanks for reading  . Last Edit: March 25, 2025",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405038",
  "comments": [
    {
      "author": "MrSunshine",
      "created_time": "July 14, 2022, 10:24:55 AM",
      "body": "The Flamingo Single-Stake Fund (Flund) looks like an interesting fund. Flamingo looks like they are trying new and innovative DeFi products - great to see.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mrxdaunknown",
      "created_time": "July 14, 2022, 04:59:03 PM",
      "body": "Yeah and I really like the long term vision of it: \"There is a 0.5% exit fee to discourage short term investors and possible exploits.\"And I totally agree with your statement about how they are trying new and innovative DeFi products. Hopefully CoinMarketCap will finally list them as a DEX exchange in the next time. It took them long enough  . They have got all required information from the flamingo team.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mrxdaunknown",
      "created_time": "July 21, 2022, 05:01:50 PM",
      "body": "From the flamingo discord: \"Mr.Google — 10:25 We have a lot of cleanup and technical debt we need to pay after all the new stuff we made. So our plan is:1. Orderbook2. FUSD3. Cleanup code4. Implement multi wallet view + manual (same for mobile page (not OneGate))And I forgot all the new pairs with bNEO, FUSD + new cross chain tokens\"On https://flamingo.finance/roadmap you can also see their roadmap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mrxdaunknown",
      "created_time": "August 04, 2022, 10:23:28 PMLast edit: August 05, 2022, 08:58:23 PM by mrxdaunknown",
      "body": "Hey guys, just wanted to give you a FLUND calculation (maybe will do it every few months).\"Minting rewards for the Flund will begin on Friday, April 29, 2022 at 12:00 UTC.\"So let´s say FLUND did start about 1st May. 1 FLUND = 1 FLM1st August 1 FLUND = about 1.26 FLMThat means: 3 months = 26% increasement1st May 1 flm = 0.17$1st August 1 flm = 0.20$Example: Let´s say you did invest 10.000$ in flm on the 1st May and did stake your flm into FLUND.Start: 10.000$ (1st May) 10000/0.17 = 58.823,53 flm (1 FLUND = 1 FLM) = 58.823,53 FLUNDNow: 1st August -> 58.823,53 FLUND * 1.26 = 74.117,65 FLM 74.117,65 FLM * 0,17$ would have been 12.600$, but flm did rise during this time too.74.117,65 FLM * 0,2 $ = 14823,53 $That means, your initial investment of 10.000$ did increase about 50% in 3 months. Not half bad, right? Let´s see what´s going to happen in the next 3 months.Also some news about FLUND: https://medium.com/flamingo-finance/flamingo-flund-exit-fee-to-increase-to-2-a5db53b123bfThat means: Long-term holders are going to profit even more from FLUND. Especially with the orderbook in the next days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mrxdaunknown",
      "created_time": "August 09, 2022, 01:12:14 PMLast edit: August 09, 2022, 05:40:50 PM by mrxdaunknown",
      "body": "Flamingo Finance Now Supports Limit Order Trading with Revolutionary OrderBook+https://medium.com/flamingo-finance/flamingo-finance-now-supports-limit-order-trading-with-revolutionary-orderbook-f741c213926dFrom the medium article:\"A Block-Based Order BookFlamingo’s OrderBook+ is a first-of-its-kind, block-based order book that leverages the powers of the Neo N3 blockchain to make on-chain limit orders without bots.As the plus sign in OrderBook+ suggests, there’s a lot more to the brand-new Flamingo feature other than being able to just place limit orders.Flamingo’s OrderBook+ combines the powers of an Automated Market Maker (AMM) and limit orders to create optimal decentralized trading conditions. The result is an order book with zero-spread and automated market making whilst letting users still trade like they are used to by placing limit orders.Limit OrdersOrderBook+ allows users to create limit orders for any trading pair on the Flamingo Decentralized Exchange (DEX). A limit order is an order to buy or sell a token at a specific price or better. Just set a bid-price or ask-price and wait for your order to be executed.OrderBook+ will open limit order trading with a few selected pairs, but more will be added in the days and weeks following the launch.The launch pairs are:bNEO/FLMFLM/fUSDTbNEO/fUSDTCompletely On-Chain (Bot Free)Unlike other DEX order books, Flamingo’s OrderBook+ is run completely on-chain and does not require you or any other users to run a bot to execute orders. Many other order book implementations, such as those on Sushi and PancakeSwap, require a separate bot network to execute orders. Not OrderBook+.Guaranteed Execution OrderBecause OrderBook+ does not require bots to execute orders, it can guarantee that the orders are executed in the order they are placed in the order book, resulting in a fair order execution mechanism for both small and big traders.Zero-Spread TradingOrderBook+ leverages the Automated Market Maker (AMM) to create a zero-spread order book. In “zero-spread trading”, traders can trade without a difference between bid and ask prices.Because OrderBook+ combines with an AMM, the order book can empty and still allow for trading.Benefits the PlatformOrderBook+ also gives fees to the Flamingo Flund, a community-owned decentralized fund on Flamingo, which benefits the entire Flamingo platform.Should I Use Convert or OrderBook+?Convert will still make asset conversions using the AMM (not the order book). This helps the GAS fee stay low for small conversions, as the order book can be more GAS heavy but again will counter the price with a much lower price impact for larger orders.When to use ConvertFor small amounts or if you are feeling lazy (fewest steps involved).When to use OrderBook+ (market order)When you want to go from token A to token B quickly and want a lower price impact.When to use OrderBook+ (limit order)When you have a fixed price you want for token A in token B.When NOT to use ConvertFor large amounts, as the conversion will go directly to the AMM, and the price impact will be higher than using a market order that uses the AMM plus the order book (but has a higher GAS cost).When NOT to use OrderBook+ (market order)For small amounts (has higher GAS cost) or if you have a fixed price you want for a token.When NOT to use OrderBook+ (limit order)When you want another token as soon as possible.Note: There is a $10.00 USD minimum to execute limit orders.So, if you’re looking to bring your trading skills to the next level using a block-based order book on a DEX, Flamingo’s OrderBook+ is exactly where you’ll want to be.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mrxdaunknown",
      "created_time": "August 15, 2022, 12:40:01 PM",
      "body": "There currently is an event running with the Poly Network: https://medium.com/flamingo-finance/flamingo-parties-with-poly-network-6d99708569dd\"WhatTo join the party, just initiate cross-chain transactions on Flamingo. To initiate cross-chain transactions, just wrap or unwrap assets. It’s that simple.WhenAugust 8, 2022 at 3:00 UTC — September 8, 2022 at 3:00 UTC.RulesFlamingo will reward the top 100 addresses based on cross-chain costs from August 8th at 3:00 UTC to September 8th at 3:00 UTC.We will gather all transactions in the period mentioned and distribute a prize pool of $1,000 to be paid in FLM tokens.The top 100 addresses share of the prize pool is based on how much the user paid in their transactions compared to the total transaction costs of the top 100. For example, if a user has 10% of the transaction costs compared to the total transaction costs, that user would receive a $100 prize.Other dApps will also participate in the Poly Network Voyage 2nd Anniversary event in their own ways. Each dApp that joins the event will have specific award rules to select winners and distribute prizes.Prizes will be awarded to users of the Poly Network ecosystem. Besides from the individual dApp contests and prizes, Poly Network will also reward the top 1,000 addresses based on cross-chain costs (including source chain transaction fees and target chain transaction fees) with Poly Network NFTs!\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mrxdaunknown",
      "created_time": "October 26, 2022, 04:09:13 PM",
      "body": "Long time no post, but that doesn´t mean there are no news  . According to Mr. Google:Mr.Google — 24.10.2022\"We are in the 4th audit round now, and it will take approx. 2 weeks, after that its final polish of the UI (If all goes as planned) FUSD has taken a lot of time and has been a huge project, making it secure is important since we only get one try, so we can't compromise security over the delivery time.The whole @Mods had a chat and we know that we need to be more active on Twitter as well and that will be improved from today. When it comes to discord it's no issue as we are always here\"That means, we´ll soon have the stable coin \"FUSD\" backed by yield bearing FLUND tokens. That´s huge, because the Neo blockchain really needs a good stable coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mrxdaunknown",
      "created_time": "November 11, 2022, 09:28:10 PM",
      "body": "Hey DeFi-fans,flamingo.finance is still working hard and building:atlazor (developer): \"The Asset Actions is being revamped to makes space for lendingLending (FUSD) is starting to look good and we are getting closer and closer to release\"More information coming soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mrxdaunknown",
      "created_time": "November 14, 2022, 06:19:10 PM",
      "body": "\" atlazor — 10:41 @everyone We’re thrilled to announce some changes being made to our liquidity pools, including the addition of $BNB pools! This is the first wave of a four-wave series as we get ready to launch $FUSD. Stay tuned!Read more: https://medium.com/flamingo-finance/flamingo-finance-announces-first-wave-of-new-liquidity-pools-including-binance-chains-bnb-3499d3cd4ce0Tweet: https://twitter.com/FlamingoFinance/status/1592090151076986882 \"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoGM",
      "created_time": "November 22, 2022, 09:24:42 AM",
      "body": "Would love to give you a PR service at an affordable for any new updates you have or even on such a piece https://twitter.com/FlamingoFinance/status/1593545990291824640?s=20&t=4ntWgQBA6QO7N9qC3ugdTAReach me on Telegram @ICO_Services",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mrxdaunknown",
      "created_time": "December 06, 2022, 11:48:35 PM",
      "body": "\"Flamingo Finance Announces Second Wave of Liquidity Pool Changes Including FUSD\"https://medium.com/flamingo-finance/flamingo-finance-announces-second-wave-of-liquidity-pool-changes-including-fusd-d68549df0344What will happen in the second wave?The second wave of liquidity pool changes will include the launch of the FUSD stablecoin, brand new FUSD liquidity pools, and some minting adjustments to the existing pools.\"FUSD Stable Coin LaunchThe anticipated FUSD, Flamingo’s USD pegged stablecoin, will finally launch in the second wave. It will launch under a brand new Lend-section on flamingo.finance, where you can lend FUSD by using different assets as collateral.Flamingo will launch with four different supported assets that can be used as collateral. Interest rates for loans will be different depending on the collateral you use, and the rates are as follows:bNEO: 4%*FLUND: 6%*fWBTC: 6%** Simple interest: based on the principal amount of a loan only and does not include compounding interest.Stay tuned to read more about FUSD and how it works in a new article.\"Flamingo team on fire again. In the next days, we´ll finally see the long awaited stablecoin FUSD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mrxdaunknown",
      "created_time": "December 08, 2022, 07:56:44 PM",
      "body": "https://flamingo-1.gitbook.io/user-guide/v/master/flamingo-stablecoin-fusdI´m skipping the explanations about \"What´s a stablecoin, what´s a collateralized stablecoin etc. You can read it, when you follow the link.\"We explain what FUSD is and the concepts behind it.​FUSD is a decentralized, over-collateralized USD stablecoin developed by Flamingo on the Neo N3 blockchain. FUSD’s value is collateralized by mainstream Neo N3 assets tradable on Flamingo — FLUND, bNEO, and fWBTC. FUSD can be minted by anyone whose connected wallet holds at least one of these tokens.To mint FUSD, users must open a Vault. A Vault is associated with a specific collateral asset, such as FLUND. Users can then deposit the collateral asset and mint FUSD as a loan against the collateral. At the time of writing, users can open up to three Vaults — one Vault for each collateral token. Vault owners can make partial or full repayments of their FUSD loan(s) at any time.Interest RatesThe FUSD protocol charges interest rates depending on the collateral token:bNEO: 4%*FLUND: 6%*fWBTC: 6%** Simple interest (APR): based on the principal amount of a loan only and does not include compounding interest. FUSD interest rates compound on every mint/repay/maintenance operation, so the compounded interest (APY) may be slightly higher.Loan-to-ValueTo ensure the solvency of the protocol (the ability to pay one’s debts), FUSD can be minted at 35% of the value of the collateral asset. For example, someone who deposits $1,000 of fWBTC can mint a maximum of 350 FUSD ($350 USD). This ratio ($350 / $1,000 = 35%) is called the Loan-to-Value.Vault owners can withdraw collateral at any time, as long as it does not make the Loan-to-Value less than 35%. In order to withdraw all collateral, users must repay all outstanding FUSD he or she was loaned.If the Loan-to-Value of a Vault becomes greater than 40% due to market movements, the Vault becomes eligible for margin maintenance. In other words, anyone can maintain a margin on any Vault by transferring FUSD if the Loan-to-Value of that vault becomes greater than 40%. For example if Jack opens a Vault, Jill can maintain Jack’s margin if Jack’s Vault goes above 40% Loan-to-Value.Up to 50% of outstanding FUSD on loan of a Vault can be repaid by a maintainer. In our above example, if we have 350 FUSD backed by $1,000 fWBTC and the fWBTC drops by half, we now have 350 FUSD backed by $500 fWBTC, making a Loan-to-Value of 70%. A maintainer can send 175 FUSD to receive $175 of fWBTC and a 5% bonus, or a total of $183.75 of fWBTC for their efforts.Margin maintenance on Vaults incur an 8% penalty. That is, 92% of the FUSD sent by the maintainer will be burned and deducted from the Vault balance, as if it were a simple repayment. The remaining 8% will be kept by the platform. In the previous example, 161 of the 175 FUSD sent by the maintainer will be deducted from the Vault’s outstanding balance and 14 will be kept by the FUSD platform.Vault owners can always keep track of a Vault’s Loan-to-Value percentage on the platform. We will also configure a discord bot on the to help vault owners follow along there.Disclaimer: The discord bot is just an informational source and can, at any given time, be offline or not be able, for some reason, to warn you. It can also provide wrong information. It is always your responsibility to check on your loans.\"You are kindly invited to join the flamingo discord (https://discord.com/invite/xGp9gbM) to ask your questions. Or ask them here and I´ll forward them to the team. FUSD is a huge milestone for the Neo blockchain and of course for the awesome Defi flamingo.finance!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mrxdaunknown",
      "created_time": "December 15, 2022, 11:23:47 PM",
      "body": "So we still need to wait for FUSD (better safe than sorry), but they are releasing a full version on Testnet next week.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mrxdaunknown",
      "created_time": "December 21, 2022, 10:56:31 AMLast edit: December 22, 2022, 12:47:23 AM by mrxdaunknown",
      "body": "As promised:\"Flamingos! While we wait for a final check, we want to invite the community to a public test phase for Flamingo Lend and $FUSDThe test phase will last until mainnet launch early next year. More info on how to test on our Discord: https://discord.com/invite/4XNqQjwEjF\"- You can get test funds for the testnet and then test itEDIT: VIDEO about $FUSD test -> https://www.youtube.com/watch?v=sNj9hrJlkFkMr. Google: \"We are trying to create a decentralized stable coin.Currently, Dai is not decentralized as > 70% of its collateral is backed by centralized stablecoins.USDT, USDC, BUSD are all centralized stablecoins.To make a coin that is stable it cannot be a speculation aspect, so therefor, FUSD should not let gamblers be allowed to gamble as that would jeopardize the integrity of the stable coin.That other platforms allow > 50% is in my head just insane as you can then get undercollateralized if you do round robins (lend, by collateral, lend more, repeat), that just shows that they do not take the Stable aspect seriously since that can with small market changes de-peg the whole token\"Answer to a question, why 35% is maximum. Gladly join discord and ask your questions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mrxdaunknown",
      "created_time": "January 05, 2023, 03:14:52 PM",
      "body": "\"bordois —The long-awaited $FUSD is almost here! $FUSD will release on January 10th along with four brand-new liquidity pools. Minting for the new pools will begin on January 11th. Read more about the pools: https://medium.com/flamingo-finance/flamingo-finance-announces-second-wave-of-liquidity-pool-changes-including-fusd-d68549df0344Read more about the protocol and lending: https://flamingo-1.gitbook.io/user-guide/v/master/flamingo-stablecoin-fusd \"Promo Video: https://twitter.com/i/status/1611006602093514752",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mrxdaunknown",
      "created_time": "January 07, 2023, 12:06:14 AM",
      "body": "They are working on the final touches:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mrxdaunknown",
      "created_time": "January 09, 2023, 09:40:01 PM",
      "body": "The team has prepared some tutorials, so everyone can understand how to use it:Video: https://youtu.be/CuXVS8odl-cUser Guides: https://flamingo-1.gitbook.io/user-guide/v/master/user-guides/fusd-loans",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mrxdaunknown",
      "created_time": "January 10, 2023, 04:12:56 PM",
      "body": "\"atlazor — today @everyone - It’s here! We’re thrilled to announce the release of Flamingo’s very own stablecoin: FUSD! - FUSD is a decentralized, over-collateralized USD stablecoin developed by Flamingo on the Neo N3 blockchain. - Learn more: https://medium.com/flamingo-finance/flamingo-finance-defi-releases-usd-stablecoin-fusd-49d61657a2c4\"The team has finally released the long awaited FUSD stable coin! Tomorrow the rewards for the liquidity pools will be activated too. A huge milestone for NEO, FLM and the whole crypto space  .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mrxdaunknown",
      "created_time": "January 13, 2023, 11:14:10 AM",
      "body": "The launch of FUSD was a great success!As you can see on the pictures, the total transactions really spiked. Also you can still get an awesome APY on the FUSD-FUSDT pool or even more on the other ones.13.01.2022 11:00 am UTC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}