{
  "id": "topic_5432741",
  "title": "noormcs5",
  "author": "noormcs5",
  "created_time": "January 02, 2023, 03:21:21 PMLast edit: January 02, 2023, 03:34:53 PM by noormcs5",
  "content": "I happened to download an excel file from an unknown source thinking there are free templates (Free 60 Day 1,000 professional Excel templates). However, after downloading and opening the file i realized it was .exe file and not .xls file. The file ran, and nothing happens on my system but I am sure this was some type of malware.Now what should i do? Is my system infected with some sort of virus?Virus Total shows that Quote18 security vendors and no sandboxes flagged this file as malicious Anyone expert can tell me what does it means  https://www.virustotal.com/gui/file/6660776dfecf917cfbd51a0fa853052005f3d4a136c1edce0a3d6b7002c3f48e/detailsI am worried as i have electrum wallet being installed in this computer plus some excel files containing sensitive data.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432741",
  "comments": [
    {
      "author": "jackg",
      "created_time": "January 02, 2023, 03:39:09 PM",
      "body": "Quote from: noormcs5 on January 02, 2023, 03:21:21 PMNow what should i do? Is my system infected with some sort of virus?If you've got crypto wallets and they're encrypted with a strong password, they're likely only going to become unsafe if you try to decrypt them. If you have nmemonics you could make a new account on a phone, hardware or an exchange and send the funds there but there's no reason to rush this.What do.you expect to do? Have you used the system much since then? Have you checked the file's metadata to see if there's anything about who might have made it, do you have antivirus installed (they might be able to run scans for its heuristics). This list of things you can do extend from deleting and reinstalling your system to backuping your system using a live os like Ubuntu (onto an external drive) and the.not using that drive unless you have something you desperately need and can reinstall your os afterwards to running a backup if you want and risking the results of just continuing to run a potentially infected system. If you can help it, don't shutdown your machine from this point or restart it for a while as this activates a lot of viruses that would otherwise remain dormant (instead, if you must, use hibernation or sleep - you can access the menu by using alt+F4 on your \"desktop\" - the screen that shows when all apps are minimised). Stop running admin accounts when you don't need to if there's a chance you'll do something like this is possibly a great place to end...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "January 02, 2023, 03:44:09 PM",
      "body": "Since it was an .exe file, did you happen to installed the .exe file? Or open it? If not, good, try to delete the file (shift+delete) and full scan your computer with an anti-virus. If it was unfortunately installed, try to uninstall it on your program list, although i dont know if its enough but do it asap, full scan your AV and do things that is recommended by your AV, or the least i could think is to reset your pc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "January 02, 2023, 04:01:49 PM",
      "body": "If you click \"Detection\" on your link, you can see what some of the AVs have detected. The most hits are for Trojan.GenericKD.64566212 which can basically do many malicious things on your computer, and if you want to know more, search it through the search engine. The second thing detected is FileRepMalware, which is actually not dangerous and some AVs mark software that has a bad reputation that way. The third detection shows Artemis, which some classify as ransomware and others as an application that will use your browsers to show you various ads and redirect you to various websites.If you want to be 100% sure that you have removed all threats, unfortunately formatting the disk is the only thing that can be recommended - otherwise there is always a doubt that something managed to avoid the detection of any AV.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "January 02, 2023, 05:33:56 PM",
      "body": "Quote from: noormcs5 on January 02, 2023, 03:21:21 PMI happened to download an excel file from an unknown source thinking there are free templates (Free 60 Day 1,000 professional Excel templates). However, after downloading and opening the file i realized it was .exe file and not .xls file. The file ran, and nothing happens on my system but I am sure this was some type of malware.Now what should i do? Is my system infected with some sort of virus?Virus Total shows that Quote18 security vendors and no sandboxes flagged this file as malicious Anyone expert can tell me what does it means  https://www.virustotal.com/gui/file/6660776dfecf917cfbd51a0fa853052005f3d4a136c1edce0a3d6b7002c3f48e/detailsI am worried as i have electrum wallet being installed in this computer plus some excel files containing sensitive data.There are probably two things that might have happened to the Excel File that you were downloading. Yes those things happen when downloading software from the net and when you don't know the particular site to download the genuine free software. One of the thing that make the Excel file to be exe file is your antivirus in the system is very strong or the file was already corrupt from the internet. Yes it is a malware from the internet not your system converted the file. exe file are empty file that reads, not accessible. I believe it will not affect your wallet. Just calm down everything is fine. Just uninstall the software and redownload it from a of site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "|MINER|",
      "created_time": "January 02, 2023, 06:13:07 PM",
      "body": "Quote from: noormcs5 on January 02, 2023, 03:21:21 PMNow what should i do? Is my system infected with some sort of virus?At the beginning I will say, you have done a stupid thing to download any file from an unknown and untrustworthy website. They lure you into their phishing trap by offering something enticing Now if your PC is infected by virus then I suggest you to take these steps urgently:Firstly log out and change the password of all kinds of accounts that you have signed in to that pc.Transfer the all funds of all wallets to another safe walletThen backup important files in another storage deviceReinstall your os",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noormcs5",
      "created_time": "January 28, 2023, 04:53:25 AM",
      "body": "Thank you for all the advices. I have not reisntall my system due to the nature of my computer which contains a lot of my files and programs.However, i have uninstall electrum from my PC and also remove the folder of electrum which contains the private seeds txt files.Also, almost a month have passed and there is no hack of my wallets (Electrum or Metamask), so i guess i am safe now. I only care about my wallets only, and i did not care if hacker want to steal any file  other information from my system as it does not contain any sensitive information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "January 28, 2023, 05:07:06 AM",
      "body": "first of all is disconnect all your PC to internet, if this a keylogger or some sort of malware they intend to steal and then send it to the initial hacker all in the background after that try to uninstall the program, if there is no app installed try to check your task manager and look is there any suspicious app if yes end the program and right click to see where the programs located or using windows+R and services.msc you will see bunch of service and check it one by one the simplest things is install antivirus but sometimes it doesn't work note if you are using windows",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}