{
  "id": "topic_5414423",
  "title": "livecoins",
  "author": "livecoins",
  "created_time": "September 21, 2022, 07:13:57 PM",
  "content": "Jimmy Song tá vindo pra um evento no BR.\"A Satsconf reunirá alguns dos maiores expoentes nacionais e internacionais do Bitcoin para compartilhar conhecimentos sobre liberdade, soberania individual e o dinheiro mágico nativo da internet. Um dia inteiro de networking, palestras, workshops e painéis. Um evento para todos os públicos: do iniciante ao avançado. #Bitcoin-only.\"Quem quiser saber mais:https://satsconf.com.br/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5414423",
  "comments": [
    {
      "author": "Paredao",
      "created_time": "September 21, 2022, 08:34:46 PM",
      "body": "Quem é ? Nunca ouvi falar sobre esse cidadão. É algum figurão gringo ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "September 22, 2022, 01:08:54 AM",
      "body": "Quote from: Paredao on September 21, 2022, 08:34:46 PMQuem é ? Nunca ouvi falar sobre esse cidadão. É algum figurão gringo ?Tá aí uma boa oportunidade para pesquisar mais sobre ele.Tudo oque sabia é que ele era um dos devs do Bitcoin, mas sequer sabia que isso foi por um pouco período de tempo e também nunca soube que ele também foi uma das mentes brilhantes que ajudou a criar os colored coins.Até onde li me parece que ele está bem focado nos últimos anos em lançamento de livros e várias palestras, sendo muito apreciado em todos os eventos por onde participa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "September 23, 2022, 12:37:23 AM",
      "body": "Eu tinha comentado do evento no posto que eu havia criado sobre a iniciativa focada no financiamento doa desenvolvedores de Bitcoin. Acho que vão ter ainda outros nomes interessantes e acho que cada vez vamos ter mais e mais esse intercâmbios de personalidades fortes vindo pro Brasil. Aqui é inegavelmente um super polo de atenção e vai ser ótimo para podermos desfrutar dessas pessoas com super conhecimento sem precisar viajar tanto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "September 23, 2022, 04:17:29 AM",
      "body": "Esse Jimmy Song já trabalhou em alguns projetos e empresas no ecossistema crypto, incluindo a Paxos. Ele também já lestrou um curso de programação com blockchain na Universidade do Texas.Ele também foi um dos desenvolvedores que trabalhou nas colored coins, a primeira versão dos tokens criadas sob a rede do Bitcoin (onde inclusive você podia transicionar USDT, pela Omnichain). A precursora do ERC20 e afins.Colored Coins - Jimmy Song - Bitcoin Meetup Zug, SwitzerlandNão vou mentir que já pensei que ele fosse um cantor estilo sertanejo quando vi a sua foto com esse chapéu e o nome que mexe com o subconsciente (\"song\").",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 23, 2022, 07:54:28 AM",
      "body": "Quote from: TryNinja on September 23, 2022, 04:17:29 AMNão vou mentir que já pensei que ele fosse um cantor estilo sertanejo quando vi a sua foto com esse chapéu e o nome que mexe com o subconsciente (\"song\").    Eu não conhecia a personagem. Então quando comecei a ler a vossa explicação sobre quem era a pessoa e pesquisei sobre ele, e vi a foto dele pensei exatamente no mesmo!Fiquei naquela: \"devo ter escrito mal o nome...\"  É sempre bom ver pessoas, que de alguma forma são relevantes no meio, a continuarem a partilhar o seu conhecimento na área. Pelo menos este não é mais um que gosta de falar o que as pessoas gostam de ouvir para ganhar uns trocos, mas sim alguém que sabe do que fala.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}