{
  "id": "topic_5411667",
  "title": "Fawwaz wildan",
  "author": "Fawwaz wildan",
  "created_time": "August 30, 2022, 04:06:24 AM",
  "content": "Berikut beberapa kutipan untuk menjelaskan proyek supaya mudah dikenali legitimasinya apakah skema Ponzi atau bukan.Quote1. Apakah Organisasi Heart of Hope itu? Heart of Hope pertama kali dibentuk pada tahun 2004 ketika tsunami terjadi di Samudra Hindia.Organisasi non-pemerintah dalam bilang perawatan, menyumbangkan obatobatan dan obat-obatan, dan melakukan bantuan untuk daerah yang terkena bencana.Resmi terdaftar pada tahun 2006, terutama untuk organisasi amal nirlaba di Asia Tenggara.Tujuan didirikan: untuk membawa lebih banyak harapan kepada yang membutuhkan, dan untuk membiarkan lebih banyak rekan hidup bahagia dan damai. Amal adalah jenis cinta sejati. Itu tulus, welas asih, bersyukur, cerah, dan tak ternilai harganya. 2. Apakah Redford itu? Redford adalah sebuah platform trading dari USA yang sudah teregistrasi di Fincen.gov yaitu lembaga resmi USA yang mengawasi tentang money laundry,kejahatan keuangan (https://www.fincen.gov/msb-registrant-search) dan Redford sudah dinyatakan aman3. Apakah Redford adalah milik Heart of Hope? Bukan. Redford bukanlah milik Heart of Hope dan sama sekali tidak bekerja sama, Heart of Hope hanya memakai platform Redford sebagai sarana untuk trading4. Apakah Redford adalah skema ponzi atau money game? Perlu diketahui Skema Ponzi atau money game selalu menarik uang iuran dari anggota dan biasanya setiap anggota yang bergabung dikenakan uang pendaftaran/Iuran yang besar dan bagi perekrut akan mendapat bonus dari uang pendaftaran/iuran yang disetorkan oleh anggota yang direkrut demikian seterusnya sehingga akhirnya yang bergabung terakhir yang akan menderita kerugian terbesar. Di Redford sama sekali tidak ada uang pendaftaran ataupun iuran hanya anggota baru yang bergabung diwajibkan mempunyai minimal 50 USDT sebagai syarat untuk membeli coin cyrpto dan 50 USDT ini bisa membelinya di platform redford dengan nilai Rp.810.000 atau bisa mentransfernya dari platform lain seperti indodax atau binance dsb dan perekrut sama sekali tidak mendapatkan keuntungan dari deposit tersebut,semua uang tersebut adalah mutlak milik anggota. Jika anda ingin membaca lebih banyak, bisa di baca disini:https://us.docworkspace.com/d/sIITl6IIf5Ji2mAY?sa=e1&st=0Pertanyaan, apakah benar sah atau memang Skema Ponzi. Mohon pencerahannya.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411667",
  "comments": [
    {
      "author": "Razmirraz",
      "created_time": "August 30, 2022, 05:51:50 AM",
      "body": "yayasan heart of hope telah di resmikan pada tanggal 23 juli 2022. Yayasan ini juga sudah terdaftar di akta notaris 02 tahun 2022 KEP. MENKHUMHAM RI NOMOR AHU-0012544.AH.01.04.TAHUN 2022.yayasan heart of hope didirikan oleh Dr. H. Habib Baedlowi, M.Pd.I dengan tujuan untuk mengentaskan kemiskinan, beberapa program yang menjadi misi dari yayasan heart of hope adalah memberi santunan, beasiswa dan memberi edukasi kepada masyarakat supaya tidak hanya mengandalkan tenaga untuk bekerja keras, harapannya masyarakat bisa bekerja cerdas dengan cara investasi. Yayasan heart of hope yang di dalamnya ada mesin pencari uang mealalui investasi trading juga sudah melewati melalui jalur Bappeti dan sudah legal. Sedangkan Redford Trading status masih abu-abu, Satgas Waspada Investasi (SWI) masih meragukan keabsahan Redford Trading dan menyebutnya sebagai entitas tanpa izin (Ilegal). Redford Trading masuk dalam salah satu dari 13 entitas yang melakukan penawaran investasi tanpa izin dan telah dihentikan oleh SWI.Daftar 13 entitas yang telah dihentikan oleh SWI.Quote1. PT Multi Mitra Mandiri Bersatu2. Boke Financial Limited3. Yayasan Shanti Bhakti Amertha (Duplikasi nama Yayasan Shanti Bhakti Amertha)4. PT Royal Cipta Properti5. PT Niscaya Sitindo6. FIRTSOLARIDN.com7. PERDAGANGAN KEDOK8. PT Vestifarm Agro Indonesia (vestifarm.com)9. Grup Almira10. Redford11. Pi Network Indonesia12. Yayasan Surya Nuswantara13. OINVESTASI/Oi Otomotif InvestasiBerdasarkan dua sumber yang saya lampirkan disini, yayasan heart of hope dan Redford Trading menempuh jalur berbeda. Keduanya tidak bisa dikatakan punya tujuan sama karena salah satunya sudah mendapat status legal dari Bappeti.Sumber: 1. https://www.google.com/amp/s/www.bonsernews.com/news/amp/pr-4794058626/yayasan-hati-harapan-atau-heart-of-hope-mengedukasi-masyarakat-supaya-bekerja-cerdas-dengan-cara-investasi2. https://www.ivoknews.com/berita/pr-4444288384/swi-sebut-redford-trading-ilegal-lakukan-hal-ini-agar-uang-kembali",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "August 30, 2022, 10:01:19 AM",
      "body": "Ada backgroundnya kenapa op ngepost ini kah? Apa karena tiba\" ada tren anggota HOH nyuruh/rekomendasi pake platform Redford? Terlepas dari itu semua, agak aneh juga kalau yayasan ini tetap pake Redford kalau di Indonesia dinyatakan ilegal. Walau dasar pemakaiannya diklaim dari rule luar negeri, mending dihindari saja kalau tidak ada kejelasan atau transparansi alur dana investasinya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "indah rezqi",
      "created_time": "August 30, 2022, 03:20:22 PM",
      "body": "Quote from: joniboini on August 30, 2022, 10:01:19 AMAda backgroundnya kenapa op ngepost ini kah?Berdasarkan judulnya maka saya pikir backgroundnya bisa jadi karena OP ingin tahu apakah yang sedang dibicarakan ini merupakan skema ponzi atau tidak. Tapi saya pikir kalau mengacu pada pernyataan dalam kutipan dibawah ini, maka saya agak meragukan kalau platform Redford bukan ponzi.QuoteDi Redford sama sekali tidak ada uang pendaftaran ataupun iuran hanya anggota baru yang bergabung diwajibkan mempunyai minimal 50 USDT sebagai syarat untuk membeli coin cyrpto dan 50 USDT ini bisa membelinya di platform redford dengan nilai Rp.810.000 atau bisa mentransfernya dari platform lain seperti indodax atau binance dsb dan perekrut sama sekali tidak mendapatkan keuntungan dari deposit tersebut,semua uang tersebut adalah mutlak milik anggota.Saya kemudian membaca lebih lanjut pada sumber yang ada di OP, jadi kutipan berikut ini sepertinya dapat menjadi bahan pertimbangan juga karena tampaknya ada sistem piramida dari cara kerjanya.Quote5. Apakah seorang perekrut mendapatkan bonus dari setoran deposit anggota yang direkrut? Tidak. Perekrut tidak mendapatkan bonus dari yang direkrut tetapi pada umumnya semua platform akan mengenakan biaya transaksi sebesar 1% misalkan seorang anggota melakukan trading di Redford sebesar $100, maka Redford akan mengenakan fee transaksi hanya 1% atau $1 dan jumlah inilah yang dibagikan kepada para perekrut dengan sistim 3 level yaitu:Level 1 60% atau $0,6 Level 2 30% atau $0,3 Level 3 10% atau $0.1 Dan ini bukan dipotong dari keuntungan trading tetapi dari fee transaksi sebagaimana bila kita berdagang saham pun akan dikenakan fee transaksi untuk jual beli per lot. Bila anggota deposit sebesar $10000 tetapi tidak ditradingkan maka leader diatasnyapun tidak mendapatkan apa apa dari deposit tersebut.Jadi tidak ada unsur skema ponzi ataupun money game disini.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chikito",
      "created_time": "September 03, 2022, 03:37:38 AM",
      "body": "Quote from: Fawwaz wildan on August 30, 2022, 04:06:24 AMPertanyaan, apakah benar sah atau memang Skema Ponzi. Mohon pencerahannya.Begini saja cara melihatnya, Jika ada iming-iming investasi yang menggiurkan, untung besar dalam sekejap dan gampang, kamu harus waspadai dan tidak ikut bergabung. Yang namanya Bank saja sulit untuk menyalurkan investasi nasabah, apalagi perusahaan yang pengelolaan keuangannya saja tertutup. Kamu harus tahu bahwa tujuan sebuah perusahaan dibentuk itu adalah mencari Untung. (Mereka untung 3 digit disalurkan ke investor cuma 1 digit)Tidak ada yang cuma-cuma di dunia ini, apa lagi menjanjikan untung puluhan % berkala, Kalau mereka bisa memberi puluhan, tidak mungkin dong mereka dapat ribuan %?.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SEEEP ZEEBOLOGI",
      "created_time": "September 05, 2022, 01:35:31 PMLast edit: September 13, 2022, 10:50:48 AM by SEEEP ZEEBOLOGI",
      "body": "Saya pribadi kurang tau soal \"Heart of Hope\", tapi untuk Redfort saya rasa bukan fonzi, seperti yang anda kutip di atas bahwa mereka sudah terdaftar di Fincen.gov, sementara kalo soal legalitas di indonesia masih ilegal karena mereka gak mau ngurus legalitas disini dan belum mendaftarkan diri, kalo soal legalitas dalam negri memang gak bisa jadi acuan aman tidaknya saya rasa, kita sebutkan saja binance, go trade dll alasanya tentu saja sedehana seperti ini misalnya:Quote\"Tongam menjelaskan, meskipun Gotrade memiliki perizinan di negara lain, namun untuk bisa melakukan penawaran umum di Indonesia harus terdaftar di OJK. Hal tersebut diatur dalam penjelasan pasal 1 angka 15 UU Pasar Modal.\"Rujukan: https://katadata.co.id/intannirmala/finansial/6130c41f78385/trading-saham-di-gotrade-diklaim-ilegal-oleh-satgas-waspada-investasiCiri ciri skema fonzi: 1. Menjanjikan/memberikan hasil keuntungan yang sangat tinggi2. Tidak memiliki bentuk bisnis yang jelas3. Produk atau perusahaan biasanya berasal dari luar negeri4. Investor akan dipersulit jika ingin menarik dana investasinya5. Memanfaatkan figur atau tokoh masyarakat dalam menarik investorMaaf kalo sedikit off topic, baru baru ini juga pemerintah memblokir steam, paypal dll hanya karena mereka belum memiliki ijin PSE jadi saya rasa semua yang illegal belum tentu tidak aman, tapi belum memiliki ijin saja.kalo masih belum yakin informasi soal Redford bisa anda temukan disini: https://opencorporates.com/companies/us_ca/C3914114https://www.bloomberg.com/profile/company/0335440D:HKhttps://www.fincen.gov/fcn/financial_institutions/msb/msbstateselector.html#",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chikito",
      "created_time": "September 11, 2022, 12:01:45 AM",
      "body": "Sebaiknya menghindari hal-hal berbau donasi, kemanusian dsb. Karena itu kedok baru penipuan untuk melarikan uang Nasabah. Zaman serba sulit, nyari duit susah, Penipu akan mulai mencari uang dengan memasang foto memelas anak kecil yang tertimpa musibah, jangan jauh-jauh, di sini juga banyak. Kalau memang mau berdonasi, langsung saja ke tempatnya, person perperson ke panti asuhan atau ke pengungsian bencana.Quote from: SEEEP ZEEBOLOGI on September 05, 2022, 01:35:31 PMMaaf kalo sedikit off topic, baru baru ini juga pemerintah memblokir steam, paypal dll hanya karena mereka belum memiliki ijin PSE jadi saya rasa semua yang illegal belum tentu tidak aman, tapi belum memiliki ijin saja.Sekarang sudah zaman crypto, ada baiknya meninggalkan hal-hal yang demikian (paypal, perfect money, ds), pertukaran crypto juga sudah banyak sehingga tidak ada kendala lagi untuk merupiahkannya. Kalau dulu, iya. Paypal sangat dibutuhkan jika punya relasi di luar negeri untuk ngirim duit, tapi kalau sekarang, via btc malah lebih enak dan nukarnya langsung ke exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SEEEP ZEEBOLOGI",
      "created_time": "September 13, 2022, 10:59:22 AM",
      "body": "Quote from: DroomieChikito on September 11, 2022, 12:01:45 AMSekarang sudah zaman crypto, ada baiknya meninggalkan hal-hal yang demikian (paypal, perfect money, ds), pertukaran crypto juga sudah banyak sehingga tidak ada kendala lagi untuk merupiahkannya. Kalau dulu, iya. Paypal sangat dibutuhkan jika punya relasi di luar negeri untuk ngirim duit, tapi kalau sekarang, via btc malah lebih enak dan nukarnya langsung ke exchange.Memang enak tapi gak semua orang make crypto, orang orang lebih memilih paypal karena itu yang lebih umum dipake, kalo ditulis *hanya menerima pembayaran via crypto* jika berurusan dengan klien orang luar saya rasa beberapa orang akan keburu beralih ke yang lain.Alasana lainnya adalah karena harga crypto terlalu gampang berubah dibandingkan mata uang fiat, yah walaupun sekarang sudah ada banyak stable coin tapi setelah longsornya Terra Luna beberapa orang terutama orang awam pasti semakin enggan menggunakan crypto sebagai alat pembayaran.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Razmirraz",
      "created_time": "September 13, 2022, 12:40:18 PM",
      "body": "Quote from: SEEEP ZEEBOLOGI on September 13, 2022, 10:59:22 AMQuote from: DroomieChikito on September 11, 2022, 12:01:45 AMSnip.Memang enak tapi gak semua orang make crypto, orang orang lebih memilih paypal karena itu yang lebih umum dipake, kalo ditulis *hanya menerima pembayaran via crypto* jika berurusan dengan klien orang luar saya rasa beberapa orang akan keburu beralih ke yang lain.Alasana lainnya adalah karena harga crypto terlalu gampang berubah dibandingkan mata uang fiat, yah walaupun sekarang sudah ada banyak stable coin tapi setelah longsornya Terra Luna beberapa orang terutama orang awam pasti semakin enggan menggunakan crypto sebagai alat pembayaran.Tergantung kenyamanan masing-masing individu juga sih sebenarnya, jika kita berbicara dalam konteks crypto, lebih nyaman digunakan pertukaran crypto dan untuk proses pengiriman ke luar negeri juga tidak terlalu rumit karena disana masih ada Exchange untuk proses pertukaran.Sementara Paypal juga memberi kemudahan bagi penggunanya, seperti pengiriman uang antar sesama akun PayPal tidak dikenakan biaya administrasi, bisa digunakan untuk berbelanja di situs-situs e-Commerce di berbagai negara dan biaya administrasi per-transaksinya juga terhitung murah. Dengan banyaknya pengguna Crypto baik di Indonesia maupun di negara luar, sangat mudah menggunakan Crypto jika berurusan dengan clien luar \"jika menerima pembayaran via Crypto\". Sedangkan orang awam tentang crypto saya pikir tidak perlu disinggung, mau bagaimanapun memberi edukasi pada mereka tentang crypto akan sangat sulit dipahami, apalagi disana ada fluktuasi. Mengenai anjloknya harga Terra Luna tidak berpengaruh pada aset crypto lain terutama pada stabil koin, namun kehkawatiran tetap ada bagi orang awam karena mereka tidak sepenuhnya mengerti bagaimana sestem crypto bekerja.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chikito",
      "created_time": "September 15, 2022, 01:21:48 AM",
      "body": "Quote from: SEEEP ZEEBOLOGI on September 13, 2022, 10:59:22 AMQuote from: DroomieChikito on September 11, 2022, 12:01:45 AMSekarang sudah zaman crypto, ada baiknya meninggalkan hal-hal yang demikian (paypal, perfect money, ds), pertukaran crypto juga sudah banyak sehingga tidak ada kendala lagi untuk merupiahkannya. Kalau dulu, iya. Paypal sangat dibutuhkan jika punya relasi di luar negeri untuk ngirim duit, tapi kalau sekarang, via btc malah lebih enak dan nukarnya langsung ke exchange.Memang enak tapi gak semua orang make crypto, orang orang lebih memilih paypal karena itu yang lebih umum dipake, kalo ditulis *hanya menerima pembayaran via crypto* jika berurusan dengan klien orang luar saya rasa beberapa orang akan keburu beralih ke yang lain.Alasana lainnya adalah karena harga crypto terlalu gampang berubah dibandingkan mata uang fiat, yah walaupun sekarang sudah ada banyak stable coin tapi setelah longsornya Terra Luna beberapa orang terutama orang awam pasti semakin enggan menggunakan crypto sebagai alat pembayaran.Paypal juga sudah banyak ditinggalkan, nda. selain karena dibaned OJK beberapa waktu lalu ada faktor lain yang membuat pamor paypal turun tergerus crypto. Ada sebagian orang malah gak tau apa itu Luna, soalnya pemain besar itu rata2 fokusnya btc, usdt atau coin berfundamental.Kalau berbicara donasi dan yayasan jadi inget ACT, dimana para bos ACT hidup bergelimang harta dari donasi berkedok kemanusian. Yang begini ini akan terus tumbuh, apa lagi donasinya pake crypto yang tidak gampang ditutup rekeningnya jika bermasalah. Tentu tumbuhnya akan semakin berimprovisasi dengan bermacam gaya dan kedok, bisa donasi berkamuflase exchange, sumbangan kemanusian dsb. jadi kalau sekiranya OP telah dapat ambil kesimpulan dan pencerahan atas pertanyaannya di atas, silahkan dilock threadnya biar tidak makin melebar ke alat pembayaran.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}