{
  "id": "topic_5466920",
  "title": "CLS63",
  "author": "CLS63",
  "created_time": "September 15, 2023, 04:58:43 PM",
  "content": "I'm sure that many of you have realized that side bets are much more popular this year compared to the previous years.I also created a spreadsheet to make it easier to follow after making side bets with many members this year. Later on I decided to open a topic for this work with the recommendation of some members after adding the side bets between the other members to the spreadsheet.I think that you can write down the side bets you would like to be added to the spreadsheet and make side bet offers to other members at the same time under this subject.For the ones who would like to take a look at the spreadsheet is here:spreadsheet",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466920",
  "comments": [
    {
      "author": "GxSTxV",
      "created_time": "September 15, 2023, 08:23:15 PM",
      "body": "It's a good thing to finally see an organized thread with a spreadsheet containing all the side bets and friendly wagers between members of the forum gathered here. I'm delighted also to see that many people have interacted in my thread here and probably an extra reason to start this. I believe that more bets will likely emerge following this trend that’s going on now possibly because many users were unaware of this before or just lacked the confidence to participate. Seeing many top members engaging in side bets with significant amounts of money may encourage others to join in.Regarding the spreadsheet I would like to suggest adding links to each side bet, specifying the timing for when results will be available, and possibly allowing other members to join these side bets if they wish to participate rather than starting new ones every time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shogun47",
      "created_time": "March 27, 2025, 10:32:39 AM",
      "body": "Hi CLS63, sometimes I am reading posts in any of the gambling discussion topics and then I wish to immediately offer a bet. I thought there must have been someone running a topic for side bets already and now I found yours and it hasn't been used yet. Are you accepting all bets and also act like an escrow if needed? Here is an example that triggers me to immediately offer a bet. Justbillywitt posted:  Quote from: Justbillywitt on March 27, 2025, 09:37:58 AMQuote from: tottong on March 27, 2025, 01:14:23 AMQuote from: sotelorene on March 26, 2025, 06:42:31 PM-snip-snipManchester United can not beat Nottingham forest at home. Nottingham forest is going to defeat Manchester United that's for sure. If you don't know what to predict that match, you should take it as a straight winning. Manchester United attention has been shifted to the Europa league, so even if they lose against Nottingham forest it won't matter much. Besides how many teams has won at City ground this season? Manchester city, Arsenal and other big teams dropped points there. Nottingham forest know that they are in a critical stage of the season where any slip would be very detrimental to their pursuit of top 4 finish. I want to go against him and bet 0.3 mbtc that Nottingham Forest is not going to win that game. I would like to see if he puts his money where his mouth is or whether it is about posting some rubbish because he doesn't know what else to write.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "justinlamode",
      "created_time": "March 27, 2025, 11:13:01 AM",
      "body": "Side bets is only sweet for me when I hangout with friends to watch match together and it's done just for the fun. Apart from this, I have not really done side bet before since I can simply bet the game in one of the casino where I win who I don't know. Finally I will find it difficult feeling comfortable winning big money from someone I know or consider as a friend. That is why I don't see side bets beyond fun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shogun47",
      "created_time": "March 27, 2025, 11:31:34 AM",
      "body": "Quote from: justinlamode on March 27, 2025, 11:13:01 AMSide bets is only sweet for me when I hangout with friends to watch match together and it's done just for the fun. Apart from this, I have not really done side bet before since I can simply bet the game in one of the casino where I win who I don't know. Finally I will find it difficult feeling comfortable winning big money from someone I know or consider as a friend. That is why I don't see side bets beyond fun. You are the reason why threads should sometimes be moderated... Nobody is interested to know whether you like side bets or not. This topic is supposed to be dedicated to those who like side bets and want to discuss the terms of possible side bets. If you had taken a minute to read OP, you would have known.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CLS63",
      "created_time": "March 27, 2025, 03:45:27 PM",
      "body": "Quote from: shogun47 on March 27, 2025, 10:32:39 AMHi CLS63, sometimes I am reading posts in any of the gambling discussion topics and then I wish to immediately offer a bet. I thought there must have been someone running a topic for side bets already and now I found yours and it hasn't been used yet. Are you accepting all bets and also act like an escrow if needed? My actual reason to create this thread is to list the long term side bets and prevent them from being forgotten. However I can do the work you said as well. If both sides accept it wouldn't be a problem for me to be the escrow.https://docs.google.com/spreadsheets/d/14es7evOMV-jPMl7b2btR_zH0_GRAJPNfj9sOUxZ5Ycc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbamoni",
      "created_time": "March 27, 2025, 03:59:57 PM",
      "body": "For the side bets to work perfectly on this thread you need to be actively responsive on this thread to ascertain that all bets by the two parties are documented for reference purposes and that the winning party must be paid the exact amount they win. I have gone through the spreadsheet, everything looks good. One day i will get to participate in a side bet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shogun47",
      "created_time": "March 28, 2025, 04:08:48 AM",
      "body": "Quote from: CLS63 on March 27, 2025, 03:45:27 PMQuote from: shogun47 on March 27, 2025, 10:32:39 AMHi CLS63, sometimes I am reading posts in any of the gambling discussion topics and then I wish to immediately offer a bet. I thought there must have been someone running a topic for side bets already and now I found yours and it hasn't been used yet. Are you accepting all bets and also act like an escrow if needed? My actual reason to create this thread is to list the long term side bets and prevent them from being forgotten. However I can do the work you said as well. If both sides accept it wouldn't be a problem for me to be the escrow.https://docs.google.com/spreadsheets/d/14es7evOMV-jPMl7b2btR_zH0_GRAJPNfj9sOUxZ5YccOk understood, I will keep you in the back of my head and sometimes will call out shitposters who claim to know the exact outcome of a game. It sometimes bothers me to read that gibberish and then I feel like betting against them.  If I come across some \"suspect\", I will quote them here and offer a bet, but I don't expect anyone of those generic trash posters to accept a bet. I feel already sorry for bumping your thread as now Agbamoni feels like educating you on how to run your spreadsheet , all just to get his post count up. I wish you could delete their generic posts. Creeps everywhere. Before anyone posts here to get their post count up, read the thread. It is for concrete side bet discussions, not for your personal opinion on side bets in general.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}