{
  "id": "topic_5472720",
  "title": "FP91G",
  "author": "FP91G",
  "created_time": "November 03, 2023, 02:20:51 PM",
  "content": "A proposal by Argentine presidential candidate Sergio Massa to use excess natural gas from the Vaca Muerta oil fields to mine Bitcoin has generated controversy in the country's cryptocurrency community.Vaca Muerta, which translates to \"dead cow,\" got its name in the 19th century when fossilized remains of megafauna—think giant ground sloths and glyptodonts—were found in the Vaca Muerta formation. The abundance of these fossils led early geologists to nickname the area \"Vaca Muerta\" or Dead Cow. The name stuck and became official after large petroleum reserves were discovered in the Vaca Muerta shale rock in the late 20th century.The idea was presented to Massa last week by computer scientist Santiago Siri. It involves utilizing surplus gas from Vaca Muerta, a major shale oil and gas deposit in western Argentina, to power bitcoin mining operations. Supporters say it would allow the gas to be put to productive use rather than being flared or vented.https://decrypt.co/204164/argentina-presidential-hopeful-wants-to-mine-bitcoin-from-dead-cow?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472720",
  "comments": [
    {
      "author": "chmod755",
      "created_time": "November 03, 2023, 04:02:12 PM",
      "body": "It might be better for the gas to be productive, but I wonder if Bitcoin mining is the best option. It's a very competitive market.Of course, they need ideas, because the government of Argentina is always bankrupt...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "November 09, 2023, 08:59:38 AM",
      "body": "I believe that using excess energy that could have gone to waste can be a good idea to mine Bitcoin so something of value can be converted out of that \"dead cow\" natural gas. In the world where resources can be getting scarce, it would be a good proposition if something can be utilized for good like mining Bitcoin. In a country that needs all the resources it can muster for economic gains, they should try and see how this can be working to their favor. In my country, electricity rate is quite high that is why no viable crypto mining can operate here and that is why if a country can do it there is no reason for the idea to be turned down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cr1776",
      "created_time": "November 09, 2023, 03:49:30 PM",
      "body": "Quote from: chmod755 on November 03, 2023, 04:02:12 PMIt might be better for the gas to be productive, but I wonder if Bitcoin mining is the best option. It's a very competitive market.Of course, they need ideas, because the government of Argentina is always bankrupt...  Given the current level of inflation, the number of times Argentina has defaulted on their debt, devalued their currency, added currency controls and destroyed their economy by inflation in the past compared with the above, it is extremely ironic that they would be even discussing bitcoin since it is an extraordinarily hard currency over time.  It is essentially the Anti-Argentinian peso and would neuter their ability to defraud the people of Argentina and the people who loan money to Argentina from around the world by devaluing the currency.Maybe it will help the people of Argentina get out from under the thumb of their oppressive politicians.  Of course they keep voting the same type of politician in periodically by falling for the same \"something for nothing\", \"my right to force someone else to pay for my choices\" socialist rhetoric.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}