{
  "id": "topic_5415740",
  "title": "realusinvestment",
  "author": "realusinvestment",
  "created_time": "October 03, 2022, 05:00:17 AM",
  "content": "Dear Community I want to know more about Bitcoin satoshi.can this project real or scam. What is this project future?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415740",
  "comments": [
    {
      "author": "Tony116",
      "created_time": "October 03, 2022, 05:33:21 AM",
      "body": "Quote from: realusinvestment on October 03, 2022, 05:00:17 AMDear Community I want to know more about Bitcoin satoshi.can this project real or scam. What is this project future? What project are you talking about? or are you asking about bitcoin? if you're asking about bitcoin that doesn't sound right because according to your account you're not a complete newbie to bitcoin. This account was created in 2017 and before that this account has participated in many bounty campaigns before. And if you are really asking about bitcoin this account has changed hands, as I can see this account just woke up after a long time. This is your first post from 2021.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lagduf",
      "created_time": "October 03, 2022, 05:46:20 AM",
      "body": "Quote from: Tony116 on October 03, 2022, 05:33:21 AMQuote from: realusinvestment on October 03, 2022, 05:00:17 AMDear Community I want to know more about Bitcoin satoshi.can this project real or scam. What is this project future? What project are you talking about? or are you asking about bitcoin? if you're asking about bitcoin that doesn't sound right because according to your account you're not a complete newbie to bitcoin. This account was created in 2017 and before that this account has participated in many bounty campaigns before. And if you are really asking about bitcoin this account has changed hands, as I can see this account just woke up after a long time. This is your first post from 2021.I guess just ignore him. he has so many negative trust and that proves if he was a shady guy. It seems like that he knows about that so well but he wanna only increasing his post count. He was in the bitcoin forum since a few years ago and asking redundant question like this proves if it's worthy for him to be tagged by DT members. Remember some campaign needs active users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "realusinvestment",
      "created_time": "October 03, 2022, 06:05:32 AM",
      "body": "Quote from: Tony116 on October 03, 2022, 05:33:21 AMQuote from: realusinvestment on October 03, 2022, 05:00:17 AMDear Community I want to know more about Bitcoin satoshi.can this project real or scam. What is this project future? Dear I know Bitcoin . I want to know Bitcoin Satoshi this new project many people mining on phone apps What project are you talking about? or are you asking about bitcoin? if you're asking about bitcoin that doesn't sound right because according to your account you're not a complete newbie to bitcoin. This account was created in 2017 and before that this account has participated in many bounty campaigns before. And if you are really asking about bitcoin this account has changed hands, as I can see this account just woke up after a long time. This is your first post from 2021.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "October 03, 2022, 03:00:11 PM",
      "body": "Quote from: realusinvestment on October 03, 2022, 06:05:32 AMDear I know Bitcoin . I want to know Bitcoin Satoshi this new project many people mining on phone apps I don't find any project that the name is \"Bitcoin Satoshi\" you need to be more specific and if possible post the link of the project too.You need to know any projects that has a name about \"Bitcoin\" or \"Satoshi\" are scam since they just want to link their project with the real Bitcoin, as we know the real Bitcoin project is very successful.Quote from: Lagduf on October 03, 2022, 05:46:20 AMI guess just ignore him. he has so many negative trust and that proves if he was a shady guy. It seems like that he knows about that so well but he wanna only increasing his post count. He was in the bitcoin forum since a few years ago and asking redundant question like this proves if it's worthy for him to be tagged by DT members. Remember some campaign needs active users. I don't see any reason why you need to link it to his negative trust since it's unrelated with his question, although bounty need active users, but a good managers wouldn't hire a shitposter with negative trust.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anonylz",
      "created_time": "October 03, 2022, 05:02:15 PM",
      "body": "Quote from: lobo13hf on October 03, 2022, 04:22:29 PMWow a bit surprised to see that someone who have been actively participating in the bounty for years and then he comes to this section talked about whether bitcoin is a scam or not. This question is not acceptable even you OP was only quoting without giving any reply. Im sure that if you are coming back from your sleep. Will you sleep again? it seems like that you are wanna participating in the bounty again. The way I see it..... it seems @op is talking about another project called 'bitcoin satoshi' which I don't know where he gets that. Otherwise, I don't understand why he will be confused and thinks btc is scam after several years in existence, this is ridiculous.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "October 03, 2022, 10:34:28 PM",
      "body": "Asking if bitcoin is legitimate or a scam? I'm about to ask you what type of man cave you've been living but I also realized that many have asked me the same thing when I've introduced it to them and I was kind of hurt when I've heard that question from them. Well, to be serious OP, bitcoin isn't a scam and if you're going to ask the most legitimate cryptocurrency it will be bitcoin.In fact, out of most projects, they're trying to kick in bitcoin as their inspiration and wanting to have that goal to be at the top because it is the #1, the first born and the most ahead crypto of all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}