{
  "id": "topic_5465902",
  "title": "WEB503",
  "author": "WEB503",
  "created_time": "September 06, 2023, 09:03:03 PMLast edit: October 30, 2023, 03:18:07 PM by WEB503",
  "content": "Test thread for publishing test tasks",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465902",
  "comments": [
    {
      "author": "WEB503",
      "created_time": "September 06, 2023, 09:03:42 PM",
      "body": "Quote from: WEB503 on September 06, 2023, 09:03:03 PMparsingicopress, in addition to what we mentioned, update the design of the OP",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WEB503",
      "created_time": "September 06, 2023, 09:10:40 PM",
      "body": "restor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WEB503",
      "created_time": "September 06, 2023, 10:34:55 PM",
      "body": "Also please make a design for the thread and a set of signatures.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WEB503",
      "created_time": "September 08, 2023, 08:26:25 PM",
      "body": "Webmixer your Bitcoin Mixeryour (this word is connecting so its scale should be reduced at least several times).I would also be grateful if some kind of unobtrusive background was added (so that it would be more similar to the original banner)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WEB503",
      "created_time": "September 08, 2023, 08:27:04 PM",
      "body": "If we reduce the width of the blocks a little, we can free up some space so that there is more space around the main logo",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WEB503",
      "created_time": "September 08, 2023, 08:27:32 PM",
      "body": "If we reduce the width of the blocks a little, we can free up some space so that there is more space around the main logo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WEB503",
      "created_time": "September 08, 2023, 08:28:30 PM",
      "body": "This looks great",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WEB503",
      "created_time": "September 18, 2023, 02:42:35 PM",
      "body": "",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WEB503",
      "created_time": "September 18, 2023, 02:43:34 PM",
      "body": "Please make sets of signatures in the old style. But so that they can easily adapt to the new site (red and white).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WEB503",
      "created_time": "September 23, 2023, 08:55:10 PM",
      "body": "An ideal block (it will be easy to manipulate the color scheme in the future).Can we try putting this block in a frame?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WEB503",
      "created_time": "September 23, 2023, 08:55:52 PM",
      "body": "Here you need a black background (the edges are the same black as in the background of the first block, but with a light tint in the middle). Considering that in 2 weeks the main color scheme will change, the blue background will have no place in the new design... so the black gradient background seems reasonable to me as it will suit both the current design and the future one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WEB503",
      "created_time": "September 23, 2023, 08:57:48 PM",
      "body": "Sorry to criticize but I think this can be improved.I found a great \"onion\" among your old designs. Can we try putting this design in a frame? (so that the length and width of the frame are identical to the second block. Only I think the background for the word “TOR” should be removed. The colors of the onion should be left as they are for now.... I would like to see how it will look.But I would be grateful if you showed how this block will look like (accet via, Tor -  black, frame color - black ... as in block 2, \"onion\" is black and red).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WEB503",
      "created_time": "September 23, 2023, 08:59:09 PM",
      "body": "I would also be grateful if you showed me one more option in which the frames will be completely absent. I believe that due to this we will be able to achieve an increased size of the texts and the onion.Don't create a signature for the SR just yet (until we finish the main design for the Legendary). I'm sorry I'm causing you a lot of trouble. 🫣",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WEB503",
      "created_time": "September 27, 2023, 03:02:21 AM",
      "body": "Quote from: icopress on December 03, 2017, 06:01:26 PMQuote from:  Webmixer /en/][Clearnet] • /][Tor Mirror] Discussion in [Rus] • [Rom] • [Filipino] • [French] • [German] • [Pidgin] • /en/faq/][FAQ]/en/]/en/][banned mixer] is a reliable tool created to anonymize BTC. Intuitive interface with 3 mix modes, .Mixer, Precise, Max Anonymity. thanks to which you receive purified coins from various exchanges. We do not keep logs or provide letters of guarantee and any information about a successful mix is deleted within 24 hours of completion of the cleanup, so your level of anonymity is 100%. Coin cleaning is available both through Clearnet & Tor and through the Telegram bot..➥ No registration, no logs / all data is encoded.➥ Immediate auto-delete of client data / data on requests for mixing gets erased in 168 hours.➥ The only proof of cleaning in our service is a letter of guarantee, which stays with you.After your coins arrive in our props, your coins are split into random parts and sent to the biggest stock exchanges. You receive back purified BTC (depending on the mix mode you chose). You receive either coins from our clients who took advantage of the “max anonymity” mode, or you receive Bitcoins sent from exchanges. This coins is unlinkable and resistant to all deanonymization tools. ➥ To start clearing, you need your incoming transaction to have 1 network confirmation. ➥ The timing depends on the mode you choose, but usually it takes from 2 to 6 hours.➥ Incoming address is valid for 7 days (168 hours). All payments made after this time will be ignored.➥ We charge from 1% to 5% of the amount + 0,0007 BTC➥ The maximum amount varies depending on the mode you choose - 1 or 50 BTC.➥ The minimum clearing amount is 0.001 BTC, all amounts below the minimum will be considered donations.____________________  /en/contacts/]    /]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WEB503",
      "created_time": "October 10, 2023, 06:46:22 AM",
      "body": "Please update the design (red shades). We are talking about banners and icons.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WEB503",
      "created_time": "October 10, 2023, 06:47:31 AM",
      "body": "The block is duplicated",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WEB503",
      "created_time": "October 23, 2023, 12:54:34 PM",
      "body": "Please do not forget about the light version of the site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WEB503",
      "created_time": "October 30, 2023, 02:07:33 PM",
      "body": "I would appreciate it if you could reduce the depth of the red (i.e. a little more transparent). Applies to all blocks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WEB503",
      "created_time": "October 30, 2023, 02:08:37 PM",
      "body": "Replace all black elements with white ones.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}