{
  "id": "topic_5459682",
  "title": "Assiduous",
  "author": "Assiduous",
  "created_time": "July 13, 2023, 02:07:02 PM",
  "content": "Welcome to all forum members!  Recently I noticed that many new members don't know all the rules, me being one of them. It's not really our fault.  Because not all rules are written. The members of this forum are eager to help you, so you can learn all you want about cryptocurrency by asking questions and ask questions where you are not clear.  Searched for some important information for new members that need to know about your forum. I also read this information. New members like me need to know the information.  The information may have been given by people before.  But I re-posted it, so new members can easily see it, no need to search. https://bitcointalk.org/index.php?topic=1689727.0 https://bitcointalk.org/index.php?topic=703657.0 https://bitcointalk.org/index.php?topic=1631151.0 If you want to get more technical * https://github.com/bitcoinbook/bitcoinbook#chapters Security Related: https://cryptosec.info * https://www.lopp.net/bitcoin-information/security.html thank you",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459682",
  "comments": [
    {
      "author": "bullrun2024bro",
      "created_time": "July 13, 2023, 02:13:41 PM",
      "body": "Most of the important threads are pinned anyway. See below.There is really no need to repost them, since this thread won't be visible anymore in a few days.(Meta Board)(Beginners & Help)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "July 13, 2023, 02:14:42 PM",
      "body": "Quote from: Assiduous on July 13, 2023, 02:07:02 PMWelcome to all forum members!  Recently I noticed that many new members don't know all the rules, me being one of them.And you want to guide other forum members, are you serious?It's easy to learn if you and other newbie members to read sticky threads. They can learn most of rules and basics and what do they need? Time and readiness to learn.[Bitcointalk sticky threads] Newbies - read before starting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Assiduous",
      "created_time": "July 13, 2023, 02:28:26 PM",
      "body": "And you want to guide other forum members, are you serious?No. I am a new member of the forum. Currently I have no knowledge to guide. But I want to learn a lot by spending time on the forum. And help everyone like you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "July 13, 2023, 02:44:21 PM",
      "body": "Quote from: Assiduous on July 13, 2023, 02:28:26 PMNo. I am a new member of the forum. Currently I have no knowledge to guide.If you are a new member, you did not make this topic.QuoteBut I want to learn a lot by spending time on the forum. If you want to learn, you did not make this topic.QuoteAnd help everyone like you.You changed from want to help new forum members to help legendary members, seriously?Silently learn and ask if you are unclear, don't write non-sense guide topics like this one, please.Newbies - Read before posting[Guide] Searching effectivelyEnough for any newbie to start.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "July 13, 2023, 02:49:28 PM",
      "body": "Quote from: Assiduous on July 13, 2023, 02:07:02 PM Recently I noticed that many new members don't know all the rules, me being one of them. It's not really our fault.Whose fault then when you're here on this forum and all you could think is to do what you feels like, if this is what other members are doing then there will be no moderation to the level of how you've met everything being coordinated like this or to this extent, the rules are there for you to go through them are read including other threads pinned, we don't create time to read before taking actions or seek after knowledge first, especially when we are being introduced to something new.Quote from: Assiduous on July 13, 2023, 02:07:02 PM Because not all rules are written.What do you mean that not all the rules are being written? Once it's not written on the forum's rules and regulations then it should be treated as not being part of the rules at all.Quote from: Assiduous on July 13, 2023, 02:07:02 PM The members of this forum are eager to help you, so you can learn all you want about cryptocurrency by asking questions and ask questions where you are not clear.But it's a pity that you could discover how some newbies are showing i too know whereby a newbie that knows nothing is trying to advise other newbies, we don't have to fake things here to imprest anyone, you will always appears the same way your true identity is with time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "July 13, 2023, 02:59:56 PM",
      "body": "every newbie in the forum should read more information, including those related to forum rules. although there are also those who ignore it because they have different goals such as just wanting to take part in the bounty campaign. they don't really take forum rules into account.I think beginners must be confused in making their first post, they will only read more without actively participating in the discussion of certain topics. especially for a new topic that they really don't really understand. Newbies looking for information should have seen the threads pinned by moderators with important information on each board. so they shouldn't have missed the information. or at least when they come from a certain country, there is already a local board that can help them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "July 13, 2023, 04:25:10 PM",
      "body": "This thread you have created for the help of newbies as you say? If newbies who have registered on the forum don't look for these pinned threads in each board how come you are sure they will look into your thread and then click on those links? This thread will be buried under pile of others thread moving back to pages while the pinned threads remain on top so it's more easy for them to go through them?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "July 13, 2023, 05:31:40 PM",
      "body": "Quote from: Assiduous on July 13, 2023, 02:28:26 PMAnd you want to guide other forum members, are you serious?No. I am a new member of the forum. Currently I have no knowledge to guide. But I want to learn a lot by spending time on the forum. And help everyone like you.Are you for real? Like a newbie like you who hasn't been on this forum for more than a month wants to assist a legendary member who has been on here for years.Isn't that an insult? What sort of guide will you provide for him here on the forum that he hasn't read about? You had better be aware of the viewpoints you express here. You shouldn't let the fact that the forum is open to everyone's opinions prevent you from being at least somewhat polite.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "July 13, 2023, 05:53:16 PM",
      "body": "No offence Op, but, I see this thread as a waste of time. Because in less than three days this whole thread will become buried by other threads making it difficult for others (newbies) to find. Aside from that, most of the links in your post can easily be found in meta and beginners & help board making it more useless.Quote from: Marykeller on July 13, 2023, 05:31:40 PMAre you for real? Like a newbie like you who hasn't been on this forum for more than a month wants to assist a legendary member who has been on here for years.Sorry to say, but no matter your status in this world you should have an open heart to learn from others no matter how low they are to you in status comparison. You will be surprised about the thing you will learn from those that you think are beneath you i.e. if only you would submit yourself to learning...QuoteIsn't that an insult? What sort of guide will you provide for him here on the forum that he hasn't read about? You had better be aware of the viewpoints you express here. You shouldn't let the fact that the forum is open to everyone's opinions prevent you from being at least somewhat polite. It's only text and what the OP wrote could be entirely different from what he or she meant to say.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "July 13, 2023, 06:33:23 PM",
      "body": "Quote from: Assiduous on July 13, 2023, 02:28:26 PMAnd you want to guide other forum members, are you serious?No. I am a new member of the forum. Currently I have no knowledge to guide. But I want to learn a lot by spending time on the forum. And help everyone like you.Ops since you want to share forum rules to keep members of the forum mostly newbies updated with the forum rules,  but you have violated one of the forum rules that could get you ban in this comment,  you copy and paste is not allowed in the forum,  best way to do that is the quote the ops and make your comment instead of copying and pasting which is prohibited. So now you are also victim of same ignorance you want to eliminate!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GiftedMAN",
      "created_time": "July 13, 2023, 06:42:27 PM",
      "body": "Quote from: Assiduous on July 13, 2023, 02:28:26 PMNo. I am a new member of the forum. Currently I have no knowledge to guide. But I want to learn a lot by spending time on the forum. And help everyone like you.Indeed you are a fast learner seeing that you already learnt a lot for yourself before considering creating this thread where you reposted links for informatios that has been shared before now good job but I don't think it's necessary since the information is not hiden for any newbie who's eager to learn about the rules and other things about the forum and Bitcoin. Imo, I think you should focus on getting knowledge for yourself first and make more research to guide your knowledge before trying to teach your fellow newbies because it's very difficult for them to believe you since you are few days in the forum and in the same tank with them.Don't be discouraged by the response you get but let it motivate you to give yourself more time to learn so that you will have what to teach others when the time comes, as it is generally said, you can't impert knowledge to others when you lack knowledge so learn before helpin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "July 13, 2023, 08:26:48 PM",
      "body": "OP you have done well. I know the response you have gotten here would want to discourage you but do not relent.  There are other newbies who would find your post meaningful and helpful to them to scale through in the course of their presence on this platform.Nevertheless, you too can do much better than this and from your little activities I have found out that you are good in trying to be creative here which had led you to creating this thread.  It is not bad your efforts as it is welcomed. You can do very much better than this mate. Keep up with your good work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "July 13, 2023, 08:35:24 PM",
      "body": "Quote from: Assiduous on July 13, 2023, 02:07:02 PMsnipAlmost all of the links you posted are already pinned in the beginning and help sections, as well as the meta board and other sections in the forums. I don't think your post is necessary because the information you're sharing has already been passed here, and pinned threads are more beneficial because they always appear at the top of the sections, unlike your thread, which will soon move down after people stop engaging on it.Quote from: Assiduous on July 13, 2023, 02:28:26 PMAnd you want to guide other forum members, are you serious?No. I am a new member of the forum. Currently I have no knowledge to guide. But I want to learn a lot by spending time on the forum. And help everyone like you.If you truly want to learn, be mindful of how you interact with or respond to some responses, particularly those from senior colleagues, because they have the expertise to lead and teach you whatever you want to learn in this forum;. Nonetheless, this forum is an excellent learning environment, and if you quietly want to learn, you will learn to the best of your ability.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "July 13, 2023, 08:40:25 PM",
      "body": "Quote from: Assiduous on July 13, 2023, 02:07:02 PM But I re-posted it, so new members can easily see it, no need to search. What a wasted effort. This is why newbies should relax and understand what’s going on before making these topics. This may sound harsh but the truth usually is, there are already pinned threads on this board for newbies to read. Anyone who misses the pinned threads will definitely miss your thread, which will likely move to the bottom after a few days. Quote from: Assiduous on July 13, 2023, 02:28:26 PMAnd you want to guide other forum members, are you serious?No. I am a new member of the forum. Currently I have no knowledge to guide. But I want to learn a lot by spending time on the forum. And help everyone like you.You should learn how to quote properly.  [TIPS] to avoid pyramid quotes (for Newbies)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "July 13, 2023, 09:12:02 PM",
      "body": "Quote from: Assiduous on July 13, 2023, 02:07:02 PMWelcome to all forum members!  Recently I noticed that many new members don't know all the rules, me being one of them. It's not really our fault.  Because not all rules are written. The members of this forum are eager to help you, so you can learn all you want about cryptocurrency by asking questions and ask questions where you are not clear.  Searched for some important information for new members that need to know about your forum. I also read this information. New members like me need to know the information.  The information may have been given by people before.  But I re-posted it, so new members can easily see it, no need to search. https://bitcointalk.org/index.php?topic=1689727.0 https://bitcointalk.org/index.php?topic=703657.0 https://bitcointalk.org/index.php?topic=1631151.0 If you want to get more technical * https://github.com/bitcoinbook/bitcoinbook#chapters Security Related: https://cryptosec.info * https://www.lopp.net/bitcoin-information/security.html thank youGood initiative to remind new comers to see this link but I think it would be great if you are able to embed the link to the title of the thread like this:Newbies - Read before postingUnofficial list of (official) Bitcointalk.org rules, guidelines, FAQ[General] Bitcoin Wallets - Which, what, why?This way the reader can have a prompt idea what is the link you have given is about.  I think it is  enough to just link this: Unofficial list of (official) Bitcointalk.org rules, guidelines, FAQ because it contains all the details about the forum rules and the list of forum boards and each information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "July 13, 2023, 09:31:15 PM",
      "body": "Quote from: Assiduous on July 13, 2023, 02:28:26 PMI am a new member of the forum. Currently I have no knowledge to guide. But I want to learn a lot by spending time on the forum. And help everyone like you.It will be a great thing if you just sit back and learn. There is no harm in you trying to share a knowledge with the forum but the reason why other members are against this your thread is because there are multiple of these thread already spread across this board and even the entire forum just to give newbies a start up kit, some were even pinned for easy identification, but still some newbies go ahead to ask the same questions. So just look at it if someone can’t click on a pinned post how will they locate your thread that after two to three days be way down. Creating exciting threads like this, mostly regarded as spamming. So if you feel concerned about sharing them which is a good thing, then whenever a thread about them been needed are created by newbies then you can just proceed to reply with all this links. I think that way it will be much appreciated than having it on a thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kalam001",
      "created_time": "July 13, 2023, 09:36:43 PM",
      "body": "Quote from: Assiduous on July 13, 2023, 02:07:02 PMWelcome to all forum members!  Recently I noticed that many new members don't know all the rules, me being one of them. It's not really our fault.  Because not all rules are written. The members of this forum are eager to help you, so you can learn all you want about cryptocurrency by asking questions and ask questions where you are not clear.  Searched for some important information for new members that need to know about your forum. I also read this information. New members like me need to know the information.  The information may have been given by people before.  But I re-posted it, so new members can easily see it, no need to search. https://bitcointalk.org/index.php?topic=1689727.0 https://bitcointalk.org/index.php?topic=703657.0 https://bitcointalk.org/index.php?topic=1631151.0 If you want to get more technical * https://github.com/bitcoinbook/bitcoinbook#chapters Security Related: https://cryptosec.info * https://www.lopp.net/bitcoin-information/security.html thank youAdditionally to all new users and some members who are not yet very familiar with the forum, even if you are to comment or want to ask questions about some posts you find appealing and interesting or not very clear about, your inquiries should always be about that specific topic rather than of the topic or should be reasonable and understandable to all viewers or members so that they can have a very positive answer to the inquiries. Also this should serve as a reminder to users not to copy or submit content that has previously been posted by another user. All the new members are highly welcome to the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "July 13, 2023, 09:39:00 PM",
      "body": "I don't understand what these new breeds are really up to... Now this is just another crappy massage from someone that doesn't even know Thier left from right... Haven't you seen those informations already on 'em Sticky post?? What's the point of the tautology?You seee....I perfectly understand... maybe nobody else does, buh I do..cus atimes, you run outta what to post, and at the same time, alot is expected from you before anyone could ever think of meriting.... The anxiety produces the same results dude...CHILL!!!! DONT YOU GET IT?? Relax and LEARN. A time will come that you don't lagg behind anymore.Sandra 🧑‍🦰",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "July 13, 2023, 09:57:40 PM",
      "body": "Quote from: Assiduous on July 13, 2023, 02:07:02 PMWelcome to all forum members! Thanks for your warm welcome. I appreciate Quote from: Assiduous on July 13, 2023, 02:07:02 PM  But I re-posted it, so new members can easily see it, no need to search. https://bitcointalk.org/index.php?topic=1689727.0 https://bitcointalk.org/index.php?topic=703657.0 https://bitcointalk.org/index.php?topic=1631151.0 If you want to get more technical * https://github.com/bitcoinbook/bitcoinbook#chapters Security Related: https://cryptosec.info * https://www.lopp.net/bitcoin-information/security.html thank youIt is nice you have discovered all these links, then I will advice you care for yourself first and give less priority to others like us, we will learn with time.Since you are able to discover all these links that are difficult to find in the forum, just make out time and read through them, they will help your journey in this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}