{
  "id": "topic_5432076",
  "title": "Fullbear2222",
  "author": "Fullbear2222",
  "created_time": "December 27, 2022, 10:09:33 PM",
  "content": "No more liquity it's gone the markets need liquity to not dry out of the liquity.The central Banks just stoped printing It's serious becouse the money what we use to be had now that at least 60% of the world population dont have that money what they need.We are out of the money and 60-70% of the world population dont get money what they need.Many Banks Also cant function for too long If liquity dont start coming in but no signs about rate cuts or quantive easing.People say war is bad thing If it start year of 2023 but Even without war there is no money people don't get money as much they Will need it to buy food.Right now we Will see that local food stores getting robbed and probably closed after robbery.The solution here is only 3: You start your currency in your Community or you join with the elite the Same old powers or you make your own team your own army.All the others who dont belong in the team of the old bankers or new army of their local Community will starve.Becouse of shortages of money people start starving and goverment cant give stimulus money either becouse for stimuls money money printer must go brrrrr... But no rate cuts so no more money printer brrrrr so no more stimulus.Probably a lot your Local stores Will be closed down and no matter If war start or not you likely will die from the bullets or starving or Even freezing.The fed and goverment don't admit that If they don't cut rates and buy bonds to print money then 60% of the world people Will suffering shortages of money Also banks have liquity problems so some Banks Will close it Also some exchangers Will close it such us crypto and stock market.The liquity is like oil for car engine without this engine dont work.And no matter where you look at there is no more liquity the money shortages everywhere.Also it's Even problem to keep war on becouse there is no money and to keep war Active then money printers must go brrrrr... But not much money production so likely people Will starve not die by bullets.War need massive printing of money but if printers dont go brrrrr..then it's allmost impossible to have any war becouse war Are very expensive.But likely people Will be starving",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432076",
  "comments": [
    {
      "author": "Smartprofit",
      "created_time": "December 28, 2022, 07:29:30 AM",
      "body": "During the Covid-19 coronavirus pandemic, a lot of new money was additionally released into circulation.  This additional liquidity has not made its way to consumer markets.  There was no increase in prices for food, clothing and consumer goods.  Instead, additional liquidity has poured into the equity and cryptocurrency markets.  This resulted in bitcoin hitting an all-time high of $69,000.  Many stocks have risen in price.  Now the situation is different.  The Fed implements a policy of quantitative easing and raises the discount rate (refinancing rate).  Under these conditions, the price of shares and cryptocurrencies fell significantly, and previously provided liquidity flowed to consumer markets, which led to price increases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mauser",
      "created_time": "December 28, 2022, 08:30:25 AM",
      "body": "Quote from: Fullbear2222 on December 27, 2022, 10:09:33 PMThe liquity is like oil for car engine without this engine dont work.And no matter where you look at there is no more liquity the money shortages everywhere.Also it's Even problem to keep war on becouse there is no money and to keep war Active then money printers must go brrrrr... But not much money production so likely people Will starve not die by bullets.War need massive printing of money but if printers dont go brrrrr..then it's allmost impossible to have any war becouse war Are very expensive.But likely people Will be starving Didn't we print enough money in the last 10 years? I am glad that the printing is finally being contained. Since 2008 did the big central banks issued a lot of new debt and kept the interest rates near 0%. The main argument has always been that inflation is low and we need to keep the economy afloat. It was only a matter of time for inflation to finally pick up and now we are screwed with double digit inflation rates. There is nothing politicians can do now, the printing had to stop otherwise we would be facing hyperinflation very soon. For Russia and Ukraine it might be different because of the war, but the international community is happy to pump a lot of money and weapons into Ukraine, so it's mostly Russia that is struggling to refinance their debt since they got removed from the SWIFT system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "December 28, 2022, 12:00:51 PM",
      "body": "Quote from: Fullbear2222 on December 27, 2022, 10:09:33 PMNo more liquity it's gone the markets need liquity to not dry out of the liquity.Stop shitposting, you have no idea what you're talking about, at least learn to spell the term correctly if you want to appear smart...Quote from: Fullbear2222 on December 27, 2022, 10:09:33 PMYou start your currency in your Community or you join with the elite the Same old powers or you make your own team your own army.Maybe we should call it Pizza coin or whatever you already called it using one of your alt accounts while you were spreading FUD in the last bear market. So each community should have its own currency and its own army, and then wars should be fought with other communities over whose pizza is better or some similar nonsense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "asawale",
      "created_time": "December 29, 2022, 11:58:05 AM",
      "body": "Adding more liquidity to the market or into the economy will only bring about rise in the price of commodities which will end up reducing the purchasing of the poor. Series of free monies were given out to the people during COVID-19 lockdown because no one could work at the time. The effect of that too much of free money is what results in global rise in the price of basic needs coupled with the effect of Russian/Ukrainian war.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}