{
  "id": "topic_5470608",
  "title": "komisariatku",
  "author": "komisariatku",
  "created_time": "October 16, 2023, 11:57:47 PM",
  "content": "Salam gan...Sampai saat ini bitcoin masih dilarang digunakan untuk transaksi pembayaran apapun di Indonesia. Bitcoin hanya legal untuk di miliki dan digunakan dalam platform perdagangan crypto. Sebetulnya tidak menjadi masalah karena jika digunakan untuk transaksipun kemungkinan masyarakat kita masih belum siap dan malah akan membuat masalah baruNamun, saya kepikiran jika kita membuat platform exchange to pay apakah boleh? Maksudnya ada gateway yang berfungsi sebagai pertukaran tetapi bisa digunakan untuk membayar sesuatu. Misalnya membeli celana di shopee seharga 150rb atau 10 USDT, nah kita bayar ke layanan exchange to pay dengan USDT tetapi pada layanan itu akan dikonversi ke rupiah dan memberikan pembayaran ke shopee dalam bentuk rupiah, apakah hal seperti itu di perbolehkan? Atau hal seperti itu masih masuk dalam kategori pembayaran melalui crypto?NB: maaf saya mencontohkannya dalam bentuk USDT karena lebih mudah di konversi ke rupiah dari oada hitung berapa mbtc untuk nilai 150rb rupiah",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470608",
  "comments": [
    {
      "author": "armanda90",
      "created_time": "October 17, 2023, 12:28:13 AM",
      "body": "Ini seperti platform yang sama digunakan teman saya dulu saat transaksi jual pulsa via online, dia menggunakan website dan menerima pembayaran dengan semua platform cryptocurrency namun tidak dikonversi langsung ke rupiaH hanya update nilai dari koin yang dia tampung saja. Untuk skala kecil membuat layanan ini sepertinya tidak terlalu beresiko dan tidak ada investigasi dari pemerintah, namun yang saya takutkan jika platform ini bisa berkembang lebh besar ke depannya ditakutkan ada pelanggaran karena kita menggunakan cryptocurrency sebagai alat transaksi di Indonesia sampai saat ini masih illegal. Sesuai dengan UU No. 7 tahun  2011 dalam pasal 21 menyatakan bahwa rupiah wajib digunakan  dalam setiap transaksi yang mempunyai tujuan pembayaran dan juga dalam transaksi online, Dimana melarang dalam melakukan transaksi di Indonesia menggunakan cryptocurrency, termuat juga dalam Peraturan Bank Indonesia No.18/40/PBI/2016 Tentang Penyelenggaraan Pemrosesan Transaksi Pembayaran.CRYPTOCURRENCY, BISAKAH DIGUNAKAN SEBAGAI ALAT PEMBAYARAN YANG SAH DI INDONESIA?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "komisariatku",
      "created_time": "October 17, 2023, 12:35:01 AM",
      "body": "Quote from: armanda90 on October 17, 2023, 12:28:13 AMIni seperti platform yang sama digunakan teman saya dulu saat transaksi jual pulsa via online, dia menggunakan website dan menerima pembayaran dengan semua platform cryptocurrency namun tidak dikonversi langsung ke rupiaH hanya update nilai dari koin yang dia tampung saja. Untuk skala kecil membuat layanan ini sepertinya tidak terlalu beresiko dan tidak ada investigasi dari pemerintah, namun yang saya takutkan jika platform ini bisa berkembang lebh besar ke depannya ditakutkan ada pelanggaran karena kita menggunakan cryptocurrency sebagai alat transaksi di Indonesia sampai saat ini masih illegal. Sesuai dengan UU No. 7 tahun  2011 dalam pasal 21 menyatakan bahwa rupiah wajib digunakan  dalam setiap transaksi yang mempunyai tujuan pembayaran dan juga dalam transaksi online, Dimana melarang dalam melakukan transaksi di Indonesia menggunakan cryptocurrency, termuat juga dalam Peraturan Bank Indonesia No.18/40/PBI/2016 Tentang Penyelenggaraan Pemrosesan Transaksi Pembayaran.CRYPTOCURRENCY, BISAKAH DIGUNAKAN SEBAGAI ALAT PEMBAYARAN YANG SAH DI INDONESIA?Nah itu bedanya gan, kalo misalkan kita membuat platform A, nah platform A ini adalah pihak ketiga yang berfungsi sebagai pertukaran sekaligus bisa untuk membayar. jadi sebelum di bayarkan pihak lain (misal shopee) bitcoin akan di konversi dahulu dan saat dibayarkan ke shopee sudah dalam bentuk rupiah. jadi platform A ini adalah pialang atau calo sebagai jembatan antara bitcoin dengan rupiah jadi transaksi yang jeluar dari platform A sudah dalam bentuk rupiah. Apakah hal seperti ini termasuk dilarang?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "masulum",
      "created_time": "October 17, 2023, 12:15:59 PMLast edit: October 17, 2023, 03:17:17 PM by masulum",
      "body": "Quote from: komisariatku on October 17, 2023, 12:35:01 AMApakah hal seperti ini termasuk dilarang?Kalau dari pemahaman saya, jika yang dibayarkan adalah rupiah itu tidak melanggar aturan undang-undang mas. Kalau diperbankan ada juga sistem yang mirip, yaitu rewards point. Rewards ini kan bentuknya adalah poin, bisa ditukar dengan voucher berupa potongan diskon yang dibayarkan ke merchant dalam bentuk rupiah oleh perusahaan yang mengeluarkan point tersebut, hal tersebut tidak dianggap sebagai membayar dengan point. Sama halnya jika diimplementasikan pada ilustrasi yang mas sebutkan. Meskipun pada awalya yang dibayar adalah kripto, namun karena pihak merchant menerimanya dalam bentuk rupiah, jadi sama halnya mas membayar dengan rupiah. Mungkin yang perlu diperhatikan adalah izin dari penyedia tersebut, karena mau tidak mau, layanan tersebut harus terdaftar sebagai exchange yang terdaftar di Bappebti, karena mereka menyediakan penukaran kripto. Ini saya buatkan garfisnyaDengan grafis diatas, jelas bahwa pembeli melakukan pembelian dengan Rupiah, karena ada proses penukaran dari kripto ke Rupiah, jadi seharusnya itu sah, karena proses penukaran tersebut telah menggugurkan pembayaran dengan kripto. Ini menurut pemahaman saya, silakan dikoreksi jika salah.Quote from: komisariatku on October 17, 2023, 02:41:11 PMKok bisa ada gambar yang sama persis dengan yang saya ilustrasikan. Apa ini gambar bikinan agan? Ya meskipun terkesan agak \"ngakali\" tetapi karusnya memang di perbolehkan kalo konsepnya seperti exchange to payIni saya bikin sendiri, untuk memudahkan yang lain memahami maksud dari mas seperti apa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "October 17, 2023, 01:55:28 PM",
      "body": "Asalkan penjual quotes atau menggunakan harga IDR, dan kemudian pembeli bayar pakai IDR, medium perantara yang digunakan bisa apa saja. Kalau tadi contohnya bayar pakai USDT tentu tidak boleh.Permasalahannya walaupun payment gateway itu boleh, misalnya:- Pembeli transfer IDR 150rb -> BTC exchanger -> Penjual menerima IDR 150rbTransaksi ini ga ada faedahnya untuk saat ini, tidak lebih baik dan tidak lebih murah daripada bayar pakai e-wallet, QRIS, atau transfer bank langsung. Kecuali di masa depan biaya pakai platform gateway BTC ini bisa lebih kecil daripada misalnya depo e-wallet (IDR 1rb - 1,5rb) atau biaya merchant QRIS. Coba bayangkan agan scan QR code di merchant pakai apps bank kesayangan agan untuk belanja (tidak ada potongan), dan kemudian fee untuk penjual juga lebih murah dari QRIS.Bisa juga:- Pembeli ambil senilai IDR 150rb dari tabungan BTC-nya -> BTC exchanger -> Penjual menerima IDR 150rbTransaksi ini minim peminat karena ga banyak yang punya tabungan BTC dan terlebih lagi di antara orang yang punya tabungan BTC ga banyak yang mau pakai BTC-nya buat belanja.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "komisariatku",
      "created_time": "October 17, 2023, 02:41:11 PM",
      "body": "Quote from: masulum on October 17, 2023, 12:15:59 PM~snip~Kok bisa ada gambar yang sama persis dengan yang saya ilustrasikan. Apa ini gambar bikinan agan? Ya meskipun terkesan agak \"ngakali\" tetapi karusnya memang di perbolehkan kalo konsepnya seperti exchange to payQuote from: mu_enrico on October 17, 2023, 01:55:28 PMAsalkan penjual quotes atau menggunakan harga IDR, dan kemudian pembeli bayar pakai IDR, medium perantara yang digunakan bisa apa saja. Kalau tadi contohnya bayar pakai USDT tentu tidak boleh.~snip~Kok ga boleh si gan? Kan transaksi yang keluar tetep pakai rupiah, jadi secara tidak langsung uang yang buat belanja sudah berbentuk rupiah bukan lagi USDT. Kan kasusnya jadi mirip misal saya jual usdt ke indodax kemudian uange saya buat beli celana, kan sama gan? Pihak toko celana tetap menerima dalam bentuk rupiah, bukan lagi usdtKalau efektifitas atau nilai lebihnya si belum ada, misal lebih murah dan lainnya. Hanya jadi terkesan bisa beli celana pakai crypto aja gitu",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abhiseshakana",
      "created_time": "October 17, 2023, 03:32:00 PM",
      "body": "Kalo menurutku, layanan jasa (dengan platform exchange to pay) sepertinya sudah masuk ke ranahnya perdagangan aset Kripto karena ada sebuah transaksi pertukaran dari cryptocurrency ke IDR, sehingga ada kemungkinan untuk proses layanan jasa tersebut harus mengantongi ijin dari Bappebti. Yang jelas Bappebti pernah mengeluarkan statement bahwa untuk Penyedia jasa Kripto atau Exchange Kripto ilegal yang memiliki basis operasi di Indonesia akan mendapatkan sanksi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "October 17, 2023, 04:49:23 PM",
      "body": "mungkin saja membuat layanan pihak ketiga seperti ini dengan catatan bahwa skala transaksinya tidak terlalu besar sehingga tidak diketahui oleh pemerintah. soalnya di bali ada beberapa orang yang menerima pembayaran bitcoin untuk membeli tiket hotel bagi turis luar negeri dan skemanya seperti yang anda bilang. namun jika skala transaksinya sudah besar atau layanan anda terendus oleh pemerintah kemungkinan besar bahwa anda bisa dikenakan pasal undang-undang dan terancam pidana atau denda karena menggunakan cryptocurrency sebagai alat pembayaran untuk transaksi anda menggantikan rupiah. selengkapnya bisa anda baca pada artikel ini: https://journal.univpancasila.ac.id/index.php/selisik/article/download/644/380/#:~:text=Maksud%20dari%20Kewajiban%20Penggunaan%20Rupiah,penduduk%20(WNA)%2C%20baik%20Perorangan",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "October 17, 2023, 05:05:19 PM",
      "body": "Saya pernah nulis tentang metode ini disini https://bitcointalk.org/index.php?topic=5454652.msg62333630#msg62333630 setelah sempat mikir salah satu bursa yg bisa WD via pulsa setelah di tuker kirpto ke IDR. Jika produk digital bisa gitu, bagaimana produk fisik.Ya, emang agak berisiko tanpa konsultasi dengan pakar hukum terlebih dahulu, lebih-lebih kalo metode ini dilakukan secara terang-terangan dipinggir jalan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AnisahSiti",
      "created_time": "October 17, 2023, 05:39:38 PM",
      "body": "Maaf ikut silaturahmi.. apa suhu-suhu disini punya pengalaman menggunakan atau kenal dengan Triv.co.id? Tahun 2017-2018, saya punya pengalaman melakukan transaksi di platform tersebut terkait layanan beli pulsa provider dan beli token listrik menggunakan BTC diplatform tersebut. Sedari awal berdiri Triv mereka fokus pada layanan tersebut sebagai sampingan, dan produk utamanya jual beli Bitcoin, dan sekarang sudah ada market cryptonya. Nah jika layanan beli pulsa dan beli token listrik menggunakan crypto  itu masih ada sampai sekarang di Triv.co.id maka sah sah saja jika OP berencana untuk membuat layanan yang seperti OP maksudkan. Namun untuk lebih amannya OP bisa konsultasi ke badan hukum terkait, karena ini ranah sensitif yang bisa menimbulkan sanksi jika OP malah terlibat melanggar undang-undang yang ada. Maaf saya belum bisa cek kembali apakah Triv masih menyediakan layanan tersebut karena saya masih dalam perjalanan dan kebetulan saya juga lupa password akun saya karena sudah lama saya tinggalkan, jadi jika ada waktu luang akan saya update terkait hal ini.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "October 17, 2023, 11:40:51 PM",
      "body": "Quote from: komisariatku on October 17, 2023, 02:41:11 PM-snip- meskipun terkesan agak \"ngakali\" tetapi karusnya memang di perbolehkan kalo konsepnya seperti exchange to payBerarti konsepnya yang membayar dalam bentuk Rupiah ke marketplace adalah pihak ketiga yakni exchange. Pertama tentunya exchange tersebut harus sudah mengantongi izin resmi sebagai pedagang aset kripto; Nah yang mungkin menjadi pertanyaan berikutnya adalah apakah exchange tersebut perlu mendapat izin juga untuk berfungsi sebagai perantara pembayaran ke marketplace.Atau mungkin konsepnya dibalik; Jadi pihak ketiga ini membuka layanan pembayaran ke marketplace atau toko online dengan menggunakan Rupiah, dan bekerjasama juga dengan exchange-exchange yang sudah berizin. Contoh, pihak ketiga ini di websitenya mencantumkan layanan pertukaran secara redirect di exchange (dengan menggunakan akunnya), dari hasil koin kripto user yang sudah dikonversi ke Rupiah itulah yang kemudian selanjutnya digunakan pihak ketiga atau user untuk meneruskannya ke marketplace.Sementara itu exchange lokal yang memilki fungsi lain seperti menyediakan jasa pembayaran token listrik, pulsa, dll. setahu saya Triv (https://triv.co.id/dashboard/product), dalam hal ini user yang memprosesnya (Deposit aset kripto -> Jual aset kripto dan masuk ke Dompet Rupiah Triv -> Proses pembayaran/pembelian produk).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PytagoraZ",
      "created_time": "October 18, 2023, 12:43:25 AM",
      "body": "Quote from: komisariatku on October 16, 2023, 11:57:47 PM~cut~Ane pikir itu ide yang bagus gan dan harusnya di perbolehkan karena engga terjadj transaksi salam bentuk crypto tapi tetep dalam rupiah. tapi ada kelamahan di dalam sistem ke gitu, karena jelas ada lebih banyak biaya, yakni biaya dalam exchange dan biaya dalam proses permbayaran ke marketplaceTapi kalo sistem seperti ini di aplikasikan salam skala global, mungkin bisa bagus karena besaran biaya jadi tidak terlalu terasa. Tapi maaf statment ini hanya asumsi ane ajaQuote from: Husna QA on October 17, 2023, 11:40:51 PMSementara itu exchange lokal yang memilki fungsi lain seperti menyediakan jasa pembayaran token listrik, pulsa, dll. setahu saya Triv (https://triv.co.id/dashboard/product), dalam hal ini user yang memprosesnya (Deposit aset kripto -> Jual aset kripto dan masuk ke Dompet Rupiah Triv -> Proses pembayaran/pembelian produk).Nah ini bisa di artikan bahwa konsep yang agan komisariatku angkat berarti di perbolehkan karena secara konsep sama seperti membeli pulsa menggunakan crypto",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "October 18, 2023, 12:53:56 AM",
      "body": "Quote from: AnisahSiti on October 17, 2023, 05:39:38 PM... apa suhu-suhu disini punya pengalaman menggunakan atau kenal dengan Triv.co.id? Tahun 2017-2018, saya punya pengalaman melakukan transaksi di platform tersebut terkait layanan beli pulsa provider dan beli token listrik menggunakan BTC diplatform tersebut. -snip-Beli tokennya langsung menggunakan BTC?Saya sendiri belum tahu banyak tentang BTC dan exchange nya ditahun 2017 apakah memang ada yang memfasilitasi langsung seperti diatas.Namun yang saya ketahui sejak registrasi di Triv dan hingga saat ini, pembayaran ataupun pembelian produk di Triv itu tidak ada yang menggunakan aset kripto melainkan menggunakan Rupiah baik itu melalui dompet Rupiah Triv, e-money ataupun transfer bank*.Quote from: PytagoraZ on October 18, 2023, 12:43:25 AMNah ini bisa di artikan bahwa konsep yang agan komisariatku angkat berarti di perbolehkan karena secara konsep sama seperti membeli pulsa menggunakan crypto* Berikut ini contoh metode pembayaran salah satu produk yang difasilitasi Triv:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abhiseshakana",
      "created_time": "October 18, 2023, 03:25:04 AM",
      "body": "Quote from: Husna QA on October 18, 2023, 12:53:56 AMBeli tokennya langsung menggunakan BTC?Saya sendiri belum tahu banyak tentang BTC dan exchange nya ditahun 2017 apakah memang ada yang memfasilitasi langsung seperti diatas.Namun yang saya ketahui sejak registrasi di Triv dan hingga saat ini, pembayaran ataupun pembelian produk di Triv itu tidak ada yang menggunakan aset kripto melainkan menggunakan Rupiah baik itu melalui dompet Rupiah Triv, e-money ataupun transfer bank*.Kalo di era dulu (dikisaran tahun 2016-2017) kita bisa membeli Pulsa, token listrik, voucher games dan tagihan air/listrik dengan menggunakan pembayaran BTC di Triv. Jadi dengan cara memilih opsi pembayaran E-Wallet >>> Triv BTC Wallet. Menurutku dengan menggunakan opsi BTC Wallet, maka pihak Triv secara otomatis mengkonversi pembayaran tersebut kedalam bentuk Rupiah.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "October 18, 2023, 04:07:46 AM",
      "body": "Quote from: abhiseshakana on October 18, 2023, 03:25:04 AMQuote from: Husna QA on October 18, 2023, 12:53:56 AM-snip-Kalo di era dulu (dikisaran tahun 2016-2017) kita bisa membeli Pulsa, token listrik, voucher games dan tagihan air/listrik dengan menggunakan pembayaran BTC di Triv. Jadi dengan cara memilih opsi pembayaran E-Wallet >>> Triv BTC Wallet. Menurutku dengan menggunakan opsi BTC Wallet, maka pihak Triv secara otomatis mengkonversi pembayaran tersebut kedalam bentuk Rupiah.Apakah karena pada kisaran tahun tersebut regulasi mengenai aset kripto ini memang belum ada dan seketat seperti sekarang sehingga opsi \"pembayaran dengan BTC\" tersebut ada di Triv? Meskipun jika merujuk apa yang mas Abhie sebutkan di atas, sebenarnya pembayaran tetap dengan Rupiah hanya saja dibuat otomatis* di Triv dengan mengkonversi aset kripto yang disetor user.Kalau sekarang kan yang mengkonversi Aset kripto hingga menjadi Rupiah dan masuk ke Dompet Rupiah Triv untuk keperluan pembayaran tagihan listrik, dll., sepenuhnya oleh pihak user-nya.* Mirip dengan fungsi BIDR di Tokocrypto ketika masih otomatis terkonversi ke Rupiah saat withdraw ke akun Bank.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abhiseshakana",
      "created_time": "October 18, 2023, 09:15:01 AM",
      "body": "Quote from: Husna QA on October 18, 2023, 04:07:46 AMApakah karena pada kisaran tahun tersebut regulasi mengenai aset kripto ini memang belum ada dan seketat seperti sekarang sehingga opsi \"pembayaran dengan BTC\" tersebut ada di Triv? Meskipun jika merujuk apa yang mas Abhie sebutkan di atas, sebenarnya pembayaran tetap dengan Rupiah hanya saja dibuat otomatis* di Triv dengan mengkonversi aset kripto yang disetor user.Kalau sekarang kan yang mengkonversi Aset kripto hingga menjadi Rupiah dan masuk ke Dompet Rupiah Triv untuk keperluan pembayaran tagihan listrik, dll., sepenuhnya oleh pihak user-nya.* Mirip dengan fungsi BIDR di Tokocrypto ketika masih otomatis terkonversi ke Rupiah saat withdraw ke akun Bank.Kemungkinan besar karena regulasi penggunaan Crypto saat itu memang belum pasti, sehingga meskipun Triv memberikan layanan pembelian pulsa, tagihan listrik dan lain sejenisnya menggunakan pembayaran BTC, mereka tidak mendapatkan sanksi dari otoritas terkait. Seingatku pemerintah mengeluarkan himbauan untuk tidak menggunakan Cryptocurrency sebagai alat pembayaran pada akhir 2017, namun karena peraturannya belum dibuat, otomatis pemerintah tidak bisa menindak penyedia layanan yang memfasilitasi pembayaran BTC dan Cryptocurrency lainnya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AnisahSiti",
      "created_time": "October 18, 2023, 11:33:19 AM",
      "body": "Quote from: Husna QA on October 18, 2023, 12:53:56 AMBeli tokennya langsung menggunakan BTC?Saya sendiri belum tahu banyak tentang BTC dan exchange nya ditahun 2017 apakah memang ada yang memfasilitasi langsung seperti diatas.Namun yang saya ketahui sejak registrasi di Triv dan hingga saat ini, pembayaran ataupun pembelian produk di Triv itu tidak ada yang menggunakan aset kripto melainkan menggunakan Rupiah baik itu melalui dompet Rupiah Triv, e-money ataupun transfer bank*.Benar Mas/Mba @Husna, jadi dulu saya beli pulsa dan token listrik disana menggunakan BTC atau ETH disana dan dipotong langsung jumlah crypto saya. Ini masih periode awal muncul Triv. Dan regulasi masih belum jelas, masih mengambang, ditahun tersebut juga di bali masih banyak exchange BTC bahkan ada beberapa outlet yang menerima pembayaran BTC seinget saya.Quote from: abhiseshakana on October 18, 2023, 03:25:04 AMKalo di era dulu (dikisaran tahun 2016-2017) kita bisa membeli Pulsa, token listrik, voucher games dan tagihan air/listrik dengan menggunakan pembayaran BTC di Triv. Jadi dengan cara memilih opsi pembayaran E-Wallet >>> Triv BTC Wallet. Menurutku dengan menggunakan opsi BTC Wallet, maka pihak Triv secara otomatis mengkonversi pembayaran tersebut kedalam bentuk Rupiah.Saya lupa tahun pasti Triv muncul cuman layanan tersebut ada dan pembayaran menggunakan BTC masih berjalan seperti yang Mas/Mba @abhiseshakana ungkapķan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "October 18, 2023, 02:27:25 PM",
      "body": "Quote from: AnisahSiti on October 18, 2023, 11:33:19 AMQuote from: Husna QA on October 18, 2023, 12:53:56 AMBeli tokennya langsung menggunakan BTC?-snip-Benar Mas/Mba @Husna, jadi dulu saya beli pulsa dan token listrik disana menggunakan BTC atau ETH disana dan dipotong langsung jumlah crypto saya. Ini masih periode awal muncul Triv. Dan regulasi masih belum jelas, masih mengambang, ditahun tersebut juga di bali masih banyak exchange BTC bahkan ada beberapa outlet yang menerima pembayaran BTC seinget saya.Terima kasih sudah sharing pengalamannya. Jadi teringat informasi mengenai ATM Bitcoin yang dulu pernah ada di Bali dan di Jakarta. Artinya memang pada saat itu belum masuknya peran pemerintah dalam me-regulasi penggunaan aset kripto masih jadi peluang tersendiri bagi beberapa layanan seperti Triv untuk menyediakan pembelian dengan aset kripto (padahal transaksi yang sebenarnya tetap menggunakan Rupiah si penyedia layanan).Btw, Exchange yang bekerjasama dengan marketplace sudah pernah ada (contoh: Tokocrypto - Shopee), namun kalau kerjasama untuk pembayaran sebagaimana yang dimaksud OP, nampaknya perlu kejelasan dari segi aturannya dulu.Kalau di luar negeri, layanan yang saya lihat sering digunakan beberapa merchant untuk metode pembayaran dengan aset kripto antara lain Bitpay (https://bitpay.com/).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tuturtinular",
      "created_time": "October 18, 2023, 10:10:08 PM",
      "body": "Quote from: komisariatku on October 16, 2023, 11:57:47 PMMisalnya membeli celana di shopee seharga 150rb atau 10 USDT, nah kita bayar ke layanan exchange to pay dengan USDT tetapi pada layanan itu akan dikonversi ke rupiah dan memberikan pembayaran ke shopee dalam bentuk rupiah, apakah hal seperti itu di perbolehkan? Atau hal seperti itu masih masuk dalam kategori pembayaran melalui crypto?Kalau menurut saya dan sepemahaman saya, model seperti itu (exchange to pay) seharusnya di perbolehkan atau legal gan. Karena saya kira ini seperti otomatisasi dari pertukaran dan gateway. Jadi kalo model sekarang kita menjual btc ke rupiah dan setelah itu kita gunakan rupiah untuk kepentingan kita termasuk buat belanja. Dan kalo sistem yang agan sampaikan berarti btc di konversi dan dari platform itu langsung di balayarkan ke maketplace untuk membeli barang, jadi ini mungkin hanya otomatisasi dan harusnya memang di perbolehkanTapi saya sepakat dengan agan agan yang sudah komentar di atas bahwa kemungkinannya platform seperti ini membutuhkan biaya layanan yang tinggi karena melayani 2x proses dan mungkin itu kelemahannya gan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "armanda90",
      "created_time": "October 19, 2023, 01:13:51 AM",
      "body": "Quote from: abhiseshakana on October 18, 2023, 09:15:01 AMKemungkinan besar karena regulasi penggunaan Crypto saat itu memang belum pasti, sehingga meskipun Triv memberikan layanan pembelian pulsa, tagihan listrik dan lain sejenisnya menggunakan pembayaran BTC, mereka tidak mendapatkan sanksi dari otoritas terkait. Seingatku pemerintah mengeluarkan himbauan untuk tidak menggunakan Cryptocurrency sebagai alat pembayaran pada akhir 2017, namun karena peraturannya belum dibuat, otomatis pemerintah tidak bisa menindak penyedia layanan yang memfasilitasi pembayaran BTC dan Cryptocurrency lainnya.Ini gambaran seperti postingan saya diatas dimana Triv tidak hanya menerima pembayaran via cryptocurrency tetapi juga menerima pembayaran via PayPal untuk semua transaksi mulai dari pembelian pulsa dan pembelian edigital lainnya. Namun pemerintah sepertinya memberikan izin untuk TRIV aapalagi situs ini sudah bertahan cukup lama dan dulu menjadi langganan saya untuk withdraw assets crypto disana dengan fee 10K IDR dan proses penarikan instan, nampaknya TRIV masih beroperasi seperti biasanya meskipun sudah ada aturan atau larangan transaksi dengan menggunakan cryptocurrency dikeluarkan oleh pemerintah.Sejauh ini pemerintah hanya tegas pada transaksi cryptocurrency namun untuk edigital lainnya seperti PayPal masih legal bahkan di Bali rumornya transaksi via fiat USDT masih digunakan oleh para turis manca negara.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}