{
  "id": "topic_5451178",
  "title": "Dave1",
  "author": "Dave1",
  "created_time": "May 04, 2023, 12:33:47 AMLast edit: November 18, 2023, 01:23:56 AM by Dave1",
  "content": "You can read Robert Kennedy's Jr stance on bitcoin, mining and other subjects regarding crypto.https://twitter.com/RobertKennedyJr/status/1653808786577010697I would agree on his points, specially that it seems that Biden administration is driving away this innovation. For instance, Coinbase and other exchanges are in the limelight because SEC has been sending Well's notice,https://www.law.cornell.edu/wex/wells_noticeQuoteA \"Wells Notice\" is a letter sent by a securities regulator to a prospective respondent, notifying him of the substance of charges that the regulator intends to bring against the respondent, and affording the respondent with the opportunity to submit a written statement to the ultimate decision maker.There is no legal requirement for a regulator to provide a Wells Notice, however it is the practice of the SEC and the NASD to provide such notice.  Procedurally, the SEC and NASD Staff (the people you are dealing with during the investigation) do not have the authority to commence proceedings.  They need to obtain approval to commence proceedings.  The approval process is handled without any input from the prospective defendant.And as a response to that, Coinbase,QuoteThe SEC will not let crypto companies “come in and register” – we tried.The U.S. crypto regulatory environment needs more guidance, not more enforcementhttps://www.coinbase.com/blog/we-asked-the-sec-for-reasonable-crypto-rules-for-americans-we-got-legalAnd they've also expanding with their International Exchange: https://www.coinbase.com/blog/introducing-coinbase-international-exchangeAnd the concern about bitcoin mining's effect, there is a good paper to read about it, Can Bitcoin Stop Climate Change? Proof of Work, Energy Consumption and Carbon Footprint (SoK).",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451178",
  "comments": [
    {
      "author": "mk4",
      "created_time": "May 04, 2023, 01:33:35 AM",
      "body": "Been around Twitter frequently, and this dude is slowly but surely getting the support from the Bitcoin/crypto industry. Unsurprisingly so because compared to his peers, he seems to be more freedom and innovation friendly.Just a heads up to not automatically vote for a certain candidate just because he/she aligns with your crypto holdings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "May 04, 2023, 02:12:57 AM",
      "body": "I am not surprised to see Bitcoin and cryptocurrencies appear more in propaganda of President election candidates in coming months. They know that blockchain, cryptocurrencies especially Bitcoin have become more attractive in the USA, among their citizens amidst the uncertainty of their financial system, their economic recession and some bank collapses recently.Nobody can feel safely with stocks of banks as they, as stock investors, won't be protected by FDIC, and that triggered massive panic sales on many bank stocks.With Bitcoin, they know that they will have a better asset of trading, investment, or as inheritance for their children too.More politicians will do what Robert Kenedy Jr. did to attract more supporters for their campaigns and their political career.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "May 04, 2023, 02:14:50 AM",
      "body": "Thumbs up for Robert Kennedy's Jr because his stance regarding Bitcoin and other crypto-currencies is true. These digital currencies are a huge part of innovation in current digital world and putting 30% tax on mining operations of Bitcoin doesn't make sense. As that will impact the earnings of the miners and as a result many miners will have to sell out the mining equipment.Joe Biden should rethink about his proposal because US has to grow with its mining operations to be on top in the list if such taxes became compulsory for the miners to pay then that tax will affect those mining operations badly. Very few people like Robert Kennedy's Jr are brave enough to favor the truth and in this case it is Bitcoin and the innovation it brought to the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "May 04, 2023, 03:14:47 AM",
      "body": "Glad someone is taking a stance for Bitcoin and Bitcoin mining however they always have a hidden motive behind it.Maybe he's invested in Bitcoin as well? or maybe he just loves innovation. Who knows? Joe Biden is a clone. Fr",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "May 04, 2023, 04:08:56 AM",
      "body": "So how do we know he actually is pro Bitcoin and not trying to just buy votes. His campaign team might of came up with this idea since the current and former president wasn’t pro crypto.They figured there are a few million people into crypto, Trump obviously was never a fan. I don’t count his NFT collection as being pro crypto. So most likely he will buy himself a few million votes this way.After he is elected, his stance can completely change.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "May 04, 2023, 04:14:47 AM",
      "body": "Quote from: OcTradism on May 04, 2023, 02:12:57 AMI am not surprised to see Bitcoin and cryptocurrencies appear more in propaganda of President election candidates in coming months. They know that blockchain, cryptocurrencies especially Bitcoin have become more attractive in the USA, among their citizens amidst the uncertainty of their financial system, their economic recession and some bank collapses recently.Nobody can feel safely with stocks of banks as they, as stock investors, won't be protected by FDIC, and that triggered massive panic sales on many bank stocks.With Bitcoin, they know that they will have a better asset of trading, investment, or as inheritance for their children too.More politicians will do what Robert Kenedy Jr. did to attract more supporters for their campaigns and their political career.Politicians know very well that bitcoin is very popular among the young voters, so most likely it is going to be a topic that is going to be brought forward over and over again in order to gain the support of that sector of the population.However even if that is true he is not wrong about his views about the policies the current president is taking, the US became the most powerful country around the world by supporting innovation and being the first to adopt all kind of new technologies, by taking the opposite stance Biden is driving innovation and prosperity out of the US while some other countries will be the ones to reap the benefits while the US gets nothing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "May 04, 2023, 05:35:44 AM",
      "body": "Quote from: ImThour on May 04, 2023, 03:14:47 AMGlad someone is taking a stance for Bitcoin and Bitcoin mining however they always have a hidden motive behind it.Maybe he's invested in Bitcoin as well? or maybe he just loves innovation. Who knows? Joe Biden is a clone. FrClone? Do you mean clown? Anyway, this Robert Kennedy Junior guy is so pro-crypto, as if he is an actual member of Bitcointalk.org. All his statements repeat most of the things we write in the forum, when we discuss all the environmental FUD drama around BTC mining and crypto in general. Maybe he has an account here, or maybe he just reads the forum. I don't know anything about him, except that he is from the Kennedy family. According to Wikipedia, he was spreading anti-vaccine propaganda and conspiracy theories about \"big pharma\". No wonder that he is pro-crypto. Also he is a Democrat, which is usually a bad sign. Most Democrats usually want more government intervention, more bureaucracy and more government control.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "May 04, 2023, 12:06:19 PM",
      "body": "Quote from: adaseb on May 04, 2023, 04:08:56 AMSo how do we know he actually is pro Bitcoin and not trying to just buy votes. His campaign team might of came up with this idea since the current and former president wasn’t pro crypto.They figured there are a few million people into crypto, Trump obviously was never a fan. I don’t count his NFT collection as being pro crypto. So most likely he will buy himself a few million votes this way.After he is elected, his stance can completely change. There was a time that Trump's adviser is pro-crypto, but it didn't translate to anything. But at least his government stay neutral and didn't have that hard stance or maybe they know that they have some pressing issues to tackle during his term.Not the first time though, we have heard a lot of supposedly pro-bitcoin candidates in the past, and so it's a hit or miss for this candidates. But he open up clean points and it's good to hear that somewhat Kennedy Jr is talking some sense with regards to the current government of Biden attack on bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "May 04, 2023, 12:23:33 PM",
      "body": "To say the fact having upto 30% tax payment on bitcoin miners is a very bad idea to the entire bitcoin miners, this is one of the reasons some believed they could go more decentralized with their mining in a renewable energy source than depending on the government for their electric power supply used in the mining rigs, we can see in many ways how bitcoin mining had been profitable to many people and how they have been finding this mining procedure very challenging which have resulted in many establishing a mini mining rigs within the comfort of their homes than the conventional mineral resources mining causing environmental pollution.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}