{
  "id": "topic_5513315",
  "title": "freedomgo",
  "author": "freedomgo",
  "created_time": "October 15, 2024, 01:27:23 PM",
  "content": "Google Search Stops Displaying Bitcoin and Crypto Price DataQuotePreviously, Google provided charts displaying the current rates of leading cryptocurrencies, enabling users to check prices anytime. Consequently, this feature enabled users to see real-time or near-real-time price charts for Bitcoin without the need to navigate to another financial site or platform.Just remembered, the last time Google search trends lined up with Bitcoin’s price was during the bull run. Back then, Google searches were used to gauge people’s interest in investing. Recently, it was reported that searches for Bitcoin have dropped, yet the price is still bullish. What’s going on here? When we think of Google searches, it’s usually driven by regular folks. But with the price soaring, could it be that institutional investors are behind the bullish trend, while the general public hasn’t jumped on the hype yet? Or maybe we’ll soon see a surge in searches as people start to FOMO in?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5513315",
  "comments": [
    {
      "author": "Don Pedro Dinero",
      "created_time": "October 15, 2024, 01:43:45 PM",
      "body": "I interpret the news as misinterpreting it. They have not disappeared, they are just not shown by default, and now you have to go to the ‘finance’ tab to see it.Then you see this.I wouldn't be surprised if it had to do with some EU measure, and I say this as my own speculation, but something similar happened recently. Before, when you searched for a street, it immediately showed you google maps and now, due to an EU antitrust measure, it no longer shows it and you have to search for it from the app or add ‘maps’ to the name of the street you are looking for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "October 15, 2024, 01:53:38 PM",
      "body": "If I search Bitcoin price, top results are from Binance, Coinmarketcap, Coingecko, Coindesk, Tradingview, Crypto.com. Good enough and I don't find big issue with Google change on their searching result display.Google for Bitcoin price is for newbies, outsiders but Bitcoiners know where to get its price one cryptocurrency websites like Coinmarketcap, Coingecko and exchange applications if they have them on mobile devices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bigmanik",
      "created_time": "October 15, 2024, 01:56:39 PM",
      "body": "Well in my opinion just because the search dropped doesn't necessarily mean people are less interested in it despite the decrease there has still been a significant amount of search i believe that this actually shows that Bitcoin has matured alot unlike before where people didn't have much idea about it and everyone wanted to know what it's all about people now know more about it and its no longer something new to the worldYou can easily walk to hundred people and ask them do you know what bitcoin is although they might not have a deep understanding but I'm certain that atleast 80 out of that 100 will say yesOn the under hand if you asked them about some meme coin they will probably not know about it because they are new and are yet to gain the maturity of cryptocurrencies like bitcoinAnd you can easily get the price of Bitcoin from different places aside google like coingecko so to me that doesn't really matter",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alpha Marine",
      "created_time": "October 15, 2024, 02:06:16 PM",
      "body": "Quote from: Don Pedro Dinero on October 15, 2024, 01:43:45 PMI interpret the news as misinterpreting it. They have not disappeared, they are just not shown by default, and now you have to go to the ‘finance’ tab to see it.Yeah, I noticed this too but it was not like this before. Before, once you search 'Bitcoin price\" on Google it takes you immediately to the live chart with the Bitcoin price in my local currency and a space to check the price in any other currency. Now you have to go to the finance side. It's not as smooth as it used to be.I might not have noticed this because I don't use Google to know the price of bitcoin, I used coinmarketcap, but that Google feature was good for when I'm discussing bitcoin with newbies or people who don't really understand what bitcoin is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "October 15, 2024, 02:33:06 PM",
      "body": "Quote from: freedomgo on October 15, 2024, 01:27:23 PMJust remembered, the last time Google search trends lined up with Bitcoin’s price was during the bull run. Back then, Google searches were used to gauge people’s interest in investing. Recently, it was reported that searches for Bitcoin have dropped, yet the price is still bullish. What’s going on here? When we think of Google searches, it’s usually driven by regular folks. It's true that google searches for Bitcoin have dropped but it's not a major reason why the price has gone up. The people's interest are still there but it's not a big information for everyone to look at the bull run based on this factor.Quote from: freedomgo on October 15, 2024, 01:27:23 PMBut with the price soaring, could it be that institutional investors are behind the bullish trend, while the general public hasn’t jumped on the hype yet? Or maybe we’ll soon see a surge in searches as people start to FOMO in?They could be but one thing is, this is the normal cycle that we're having. Although we cannot deny that the institutional investors play a big part in this because of the bitcoin spot etfs. And if the price skyrockets, the bandwagon for the new interest will come for sure but don't expect too much from them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YUriy1991",
      "created_time": "October 15, 2024, 03:13:57 PM",
      "body": "I also tried searching for prices and browsing on Google with the keyword today's btc price usd and the display is the same as what has been seen from the post @Don Pedro Dinero. I think there is a connection and usually they will enter exactly like the current conditions. Personal purchases are also busy coming to buy BTC. I just take the positive from the good movement in the last few days and at least the acceleration of price increases can continue to increase amidst the atmosphere hit by various economic and geopolitical issues today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "October 15, 2024, 03:23:31 PM",
      "body": "Quote from: hd49728 on October 15, 2024, 01:53:38 PMGoogle for Bitcoin price is for newbies, outsiders but Bitcoiners know where to get its price one cryptocurrency websites like Coinmarketcap, Coingecko and exchange applications if they have them on mobile devices.I am one of those that are googling for bitcoin price.  Years ago, when I completely switched to hodl mode, I removed all price tracking apps from my mobile phone and price tracking websites from my bookmarks because I wanted to stop obsessing over bitcoin price. One of the best crypto decisions I've ever made.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "October 15, 2024, 03:36:41 PM",
      "body": "This is very simple, if the search for Bitcoin on Google dropped, it signified that quite a good number of Google search users already know about Bitcoin and know where to get all the necessary informations on daily basis, take for example, if you really want to know the accurate Bitcoin Price, searching for it through Google may give you an inaccurate price based on short term purpose since it need to be manually updated at intervals of time.So if I am looking to know how much Bitcoin is worth in the market, I won't be using google Rather I will go through exchange to know the right price. Thirdly google is not so used by cryptocurrencies trader's since they may not be having need for it and that makes the traffic to the search engine low lately, so we need to understand all that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "October 15, 2024, 03:50:02 PM",
      "body": "Quote from: freedomgo on October 15, 2024, 01:27:23 PMRecently, it was reported that searches for Bitcoin have dropped, yet the price is still bullish.Price is not bullish though. It is more like side way where price neither goes up nor down and both! Remember that going from $60k to $65k is not exactly bullish trend. Breaking $70k is.This explains why the searches have dropped as well. People don't really search about bitcoin when it is not on top of the news saying it has soared or crashed!Quote from: freedomgo on October 15, 2024, 01:27:23 PMGoogle Search Stops Displaying Bitcoin and Crypto Price DataThis doesn't really have any significance in my opinion. Fetching the price from price reporting sources like preev, exchanges, coinmarketcap like websites, etc. is far better. Seeing charts on tradingview is also far more useful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "October 15, 2024, 03:55:56 PM",
      "body": "Quote from: freedomgo on October 15, 2024, 01:27:23 PMGoogle Search Stops Displaying Bitcoin and Crypto Price DataQuotePreviously, Google provided charts displaying the current rates of leading cryptocurrencies, enabling users to check prices anytime. Consequently, this feature enabled users to see real-time or near-real-time price charts for Bitcoin without the need to navigate to another financial site or platform.Just remembered, the last time Google search trends lined up with Bitcoin’s price was during the bull run. Back then, Google searches were used to gauge people’s interest in investing. Recently, it was reported that searches for Bitcoin have dropped, yet the price is still bullish. What’s going on here? When we think of Google searches, it’s usually driven by regular folks. But with the price soaring, could it be that institutional investors are behind the bullish trend, while the general public hasn’t jumped on the hype yet? Or maybe we’ll soon see a surge in searches as people start to FOMO in?It just got stopped now, and I never saw such an interface before. I searched the price of BTC many times but never showed the graphs and other stuff and even how much 1 BTC is in my local currency (converter) too. But after reading Don Pedro Dinero's post I tried the finance sector and the very first time after searching this keyword I saw such results. This is new for me even if it gets stopped now why have they never shown to my interface before?Well, I can't disagree with you because Google first allowed the ads of crypto and it also brought many investors to them and they obviously make money from ads too. I still think BTC is in a bullish state but yeah the real hype was in April and from that point to now those searches might be reducing due to the shift from a bullish trend to bearish which I said I still think is bullish. These institutions really plays an important role but I think the general public has jumped on the hype already and most of them are already even out from it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 15, 2024, 04:28:35 PM",
      "body": "I thought it was a browser issue or my IP address, after reading the article they made changes in the price but I can still search using any bitcoin address and get the balance.Quote from: Don Pedro Dinero on October 15, 2024, 01:43:45 PMI interpret the news as misinterpreting it. They have not disappeared, they are just not shown by default, and now you have to go to the ‘finance’ tab to see it.They removed the option from Google in the past you could search using 0.2 btc to usd and get a result.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "October 15, 2024, 04:38:15 PM",
      "body": "Quote from: hd49728 on October 15, 2024, 01:53:38 PMIf I search Bitcoin price, top results are from Binance, Coinmarketcap, Coingecko, Coindesk, Tradingview, Crypto.com. Good enough and I don't find big issue with Google change on their searching result display.Google for Bitcoin price is for newbies, outsiders but Bitcoiners know where to get its price one cryptocurrency websites like Coinmarketcap, Coingecko and exchange applications if they have them on mobile devices.Yea I dont see the big deal with whether google has changed the way it displaysBitcoins market price. I dont use google for that as I'm sure the majority ofpeople dont either. Personally i use and have bookmarked on all my devices > https://cryptopurview.com/live-price/Almost everyone would be checking on their waller or whatever exchange they use.Its only those who are not yet in Bitcoin who would use google search I suspect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "October 15, 2024, 04:47:40 PM",
      "body": "Quote from: freedomgo on October 15, 2024, 01:27:23 PMGoogle Search Stops Displaying Bitcoin and Crypto Price DataQuotePreviously, Google provided charts displaying the current rates of leading cryptocurrencies, enabling users to check prices anytime. Consequently, this feature enabled users to see real-time or near-real-time price charts for Bitcoin without the need to navigate to another financial site or platform.Just remembered, the last time Google search trends lined up with Bitcoin’s price was during the bull run. Back then, Google searches were used to gauge people’s interest in investing. Recently, it was reported that searches for Bitcoin have dropped, yet the price is still bullish. What’s going on here? When we think of Google searches, it’s usually driven by regular folks. But with the price soaring, could it be that institutional investors are behind the bullish trend, while the general public hasn’t jumped on the hype yet? Or maybe we’ll soon see a surge in searches as people start to FOMO in?Well it has not been removed but moved under the finance tab as correctly pointed out by Don Pedro Dinero. But it's good. Because Google always used to show less price than actual when compared to CMC website. I am sure their algorithm works differently and using different sources for the pricing data but it was always less than what CMC is showing. With the bullish trend, people might start to FOMO in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "October 15, 2024, 04:59:32 PM",
      "body": "This might be a minor inconvenience for some, but it's also a reminder that the crypto landscape is constantly evolving. Possibly reflecting the ongoing tensions between traditional finance and the growing crypto world.The decrease in search volume for Bitcoin aligns with historical data, which suggests that low search interest often precedes significant price increases. Market stagnation can present prime opportunities for investors.It sparks curiosity about the motivations behind this move, could it be an attempt to limit easy access to crypto data, or simply a strategic shift?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "October 15, 2024, 05:24:20 PM",
      "body": "I checked from my phone in the Safari browser, and I was able to see the price directly on the first page only. I don’t think these search changes happened in the Asia region at least. Though I haven’t checked this from my PC. But the main concern is why this happened with other guys? I don’t think the reduction in the search frequencies has any direct relation to this update. Nevertheless, we need to do more research about this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "October 15, 2024, 06:08:39 PM",
      "body": "Quote from: hd49728 on October 15, 2024, 01:53:38 PMGoogle for Bitcoin price is for newbiesI never used google to look for the current Bitcoin price even when I was a newbie. That is beyond amateur-level, that is 90 year old using a computer for the first time level of amateur.   I think most newbies at the very least know to set up a widget that continually shows the price or an app that they can easily access, especially if they are using a crypto exchange for their Bitcoin dealings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "October 15, 2024, 06:09:23 PMLast edit: October 15, 2024, 06:35:54 PM by Fiatless",
      "body": "Quote from: Nrcewker on October 15, 2024, 05:24:20 PMI checked from my phone in the Safari browser, and I was able to see the price directly on the first page only. I don’t think these search changes happened in the Asia region at least. Though I haven’t checked this from my PC. But the main concern is why this happened with other guys? I don’t think the reduction in the search frequencies has any direct relation to this update. Nevertheless, we need to do more research about this.I guess it has been restored because it was not like that before. I usually use Google to check the price and never need to click on the finance icon to get the price. But it changed a few days ago that you cannot see the price on the first page. But after seeing this thread I checked and saw that it has been restored to the first page. Maybe it was a technical issue from Google.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "October 15, 2024, 07:36:52 PM",
      "body": "Quote from: goldkingcoiner on October 15, 2024, 06:08:39 PMQuote from: hd49728 on October 15, 2024, 01:53:38 PMGoogle for Bitcoin price is for newbiesI never used google to look for the current Bitcoin price even when I was a newbie. That is beyond amateur-level, that is 90 year old using a computer for the first time level of amateur.   I don't use Google to see the price, but I like de conversion tool, that way we can search for \"Doge to Btc\" and Google let us see the doge price in btc. For me is a quick tool to find the other coins price, but as other users mentón, this is not the right tool for that propose, we should use tools like coinmarketcap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gooner0",
      "created_time": "October 15, 2024, 07:46:49 PM",
      "body": "Hmmmm, i don't think doing google searches about Bitcoin price is the best way to go about it . There are many crypto exchanges that could give you the prices just the way it is.And I don't think because you don't seem to see Bitcoin price search results in Google means that people are slowly loosing interest in Bitcoin!🥱",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}