{
  "id": "topic_5450673",
  "title": "willi9974",
  "author": "willi9974",
  "created_time": "April 30, 2023, 06:43:41 AM",
  "content": "Hoffe mal es wird jetzt bei den kleinem Preis kein großer Verkaufsdruck ausgelöst… und somit die aktuelle Steigerung wieder negiert…#########Bekommt Bitcoin neuen Verkaufsdruck? – BTC-Vermögen auf Binance steigt rasant anDas Bitcoin-Vermögen auf der Binance ist in nur einem Monat um 50.000 BTC gestiegen, was darauf hindeuten könnte, dass schon bald neuer Verkaufsdruck entsteht.Quelle: https://de.cointelegraph.com/news/bitcoin-sell-off-next-binance-btc-balance-shoots-up-1-5b-in-1-month",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450673",
  "comments": [
    {
      "author": "aBaxs",
      "created_time": "May 01, 2023, 03:10:21 AM",
      "body": "Könnten auch nur ein paar ältere Wallets sein - siehe Twitter: https://twitter.com/lookonchain/status/1649387289745977344?s=20",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kryptowerk",
      "created_time": "May 01, 2023, 06:37:39 AM",
      "body": "Quote from: willi9974 on April 30, 2023, 06:43:41 AMHoffe mal es wird jetzt bei den kleinem Preis kein großer Verkaufsdruck ausgelöst… und somit die aktuelle Steigerung wieder negiert…#########Bekommt Bitcoin neuen Verkaufsdruck? – BTC-Vermögen auf Binance steigt rasant anDas Bitcoin-Vermögen auf der Binance ist in nur einem Monat um 50.000 BTC gestiegen, was darauf hindeuten könnte, dass schon bald neuer Verkaufsdruck entsteht.Quelle: https://de.cointelegraph.com/news/bitcoin-sell-off-next-binance-btc-balance-shoots-up-1-5b-in-1-monthGrundsätzlich interessante Info. In dem Zusammenhang auch gut in Erinnerung zu behalten, dass nach dem FTX-fuckup extrem große Mengen an coins von fast allen Exchanges gezogen wurden. Wie zu erwarten war das aber nur ein temporärer Move, die meisten Leute lernen langfristig nicht wirklich dazu. Insofern würde ich auch erwarten das der Großteil dieser funds früher oder später wieder auf die Börsen zurückfließt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "May 01, 2023, 11:50:53 AM",
      "body": "Ich denke und glaube jetzt nicht das durch die in einem Monat auf Binance 50.0000 Btc angehäuften Coins jetzt bedeutet das ein Verkaufsdruck entsteht oder kommen könnte.Viel mehr kann es ja durchaus sein das die Personen oder leute eventuell mehr wissen als wir , auch wäre es Informativ von wie vielen Wallets die Coins sind.Ob es Coins auf nur wenigen Accounts sind oder wirklich sehr viele einzelne.Meiner meinung nach kann ich mir nicht vorstellen das dies alles Leute unter druck setzt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}