{
  "id": "topic_5401951",
  "title": "Cone-headed Cat",
  "author": "Cone-headed Cat",
  "created_time": "June 09, 2022, 02:18:40 PMLast edit: June 09, 2022, 05:20:33 PM by Cone-headed Cat",
  "content": "Hello, we just launched a horse racing platform called Racing Factors and its currency called Karrotz which will go on pre-sale by the end of this month.Meet Karrotz, an ERC20-compliant crypto coinKarrotz is a currency option for any blockchain-backed projects geared towards mainstream consumers in the horse racing industry. Karrotz has become a proof of concept in the Racing Factors ecosystem, which we believe will be a game-changer in the future of horse racing user-facing blockchain products. Karrotz is a fuel that drives the whole Racing Factors platform.Play-To-Earn with Pick 10 competition will reward players with Karrotz for each winning selections of their 10 daily picked horses. Winners of the daily and monthly prize pool will be given Karrotz coins as their winning prize.Own-To-Earn transactions from buying and selling of Current racehorse NFTs on the Racing Factors platform will be executed using Karrotz coins. Owners of racehorse NFTs will receive their prize money in Karrotz. Members can buy a Current Racehorse NFT once they have built up a supply of Karrotz or by simply purchasing Karrotz at the market rate on the crypto exchange.Settlement of all competition prizes, winnings and referral rewards are made in Karrotz.Few words about Racing FactorsRacing Factors is a user-focused horse racing website that joins millions of horse racing fans worldwide in a community on a single platform. The platform is fully integrated with industry-leading horse racing feed providers – offering daily live racecards, odds and results in multiple territories. The value proposition is based on a Play-To-Earn and Own-To-Earn mechanisms where all prizes, winnings and rewards are paid in Karrotz. Although we've recently seen a couple of digital horse racing games built on blockchain technology, however, there is currently no mechanism for owning a racehorse NFT for value using real horse racing data.LinksKarrotz website - https://karrotzcoin.com/Karrotz whitepaper - https://karrotz.gitbook.io/Discord - https://discord.gg/KaxNRwGhQGTelegram - https://t.me/KarrotzCoinRacing Factors - https://www.racingfactors.com/That's all!Any feedback will be more than appreciated.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401951",
  "comments": [
    {
      "author": "unnamed0simple",
      "created_time": "June 10, 2022, 12:04:17 AM",
      "body": "Alternate cryptocurrencies > Announcements (Altcoins) > Tokens (Altcoins) I'd like to propose that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}