{
  "id": "topic_5499589",
  "title": "Aunt Lydia",
  "author": "Aunt Lydia",
  "created_time": "June 11, 2024, 12:22:03 PM",
  "content": "What is the future of Bitcoin?We know where it was in 2009, where it is now (2024), but where is it going?Will it make everyone free? Will it be regulated and become government controlled?All normal and crazy theories please",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5499589",
  "comments": [
    {
      "author": "Frankolala",
      "created_time": "June 11, 2024, 12:43:38 PM",
      "body": "Quote from: Aunt Lydia on June 11, 2024, 12:22:03 PMWhat is the future of Bitcoin?We know where it was in 2009, where it is now (2024), but where is it going?Will it make everyone free? Will it be regulated and become government controlled?All normal and crazy theories please  Government can only regulate centralized exchanges and not bitcoin. This is because bitcoin is censorship resistance due to its decentralized nature, and nobody can control bitcoin core protocols. So if you have your bitcoin in your noncustodial wallet, just keep hodling because it is giving you financial freedom using it in a decentralized way.It is only altcoins that can be regulated and controlled by the government if they want. With bitcoin, you are free and using it as a store of value/investment over a long time will give you more freedom from inflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitterguy28",
      "created_time": "June 11, 2024, 12:55:56 PM",
      "body": "Quote from: Aunt Lydia on June 11, 2024, 12:22:03 PMWhat is the future of Bitcoin?We know where it was in 2009, where it is now (2024), but where is it going?Will it make everyone free? Will it be regulated and become government controlled?All normal and crazy theories please  for 15 years of bitcoin existence it has been a big help for many people , from those who trust and support this like me and my family and friends so with all of those? personally? i really don't care what will bitcoin looks in the future because what I wanna enjoy is what I am having now and in the coming years.if this will continue to progress for my second and third generation then that is something very best but what I have gained and gather from those years of being here? i believe it is something i must be thankful for bitcoin and its creator.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "June 11, 2024, 01:30:32 PM",
      "body": "I think Bitcoin is moving more and more into the areas of financial assets, and it's getting regulated as such in different countries. That means that Bitcoin is perceived not as a currency, but as something you can own and then sell for profit. This sentiment is common on the forum, and it's of course, attractive to tax authorities because assets are taxed, while currencies are not (income received in currencies is taxed, but the currency itself isn't).I hope that there will be some solutions to the issue of transaction fee spikes, and that non-custodial wallets will remain legal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "June 11, 2024, 01:32:27 PM",
      "body": "It will be an asset to back up the economy... just like gold.Most countries will have bitcoin in their banks to back up their economy, and while more govs want it, then it will cost more. Just remember Satoshi words, he said how bitcoin value in the future would be a lot or zero, and we only have those two options. And from how things look now, the value can only go one way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helena Yu",
      "created_time": "June 11, 2024, 02:03:22 PM",
      "body": "I speculate almost all Bitcoin will be controlled by government, this is because most holders choose to hold in centralized exchanges or trusting their money to land based company (ETFs). Any coins that hand in centralized exchanges and ETFs companies can cooperate with the government, the government can confiscate the coins just like Executive Order 6102 where the government force people to send their gold.Currently Bitcoin has been regulated, the government make the regulations tighter and tighter every year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iamcrypticguy",
      "created_time": "June 11, 2024, 03:07:33 PM",
      "body": "Quote from: Aunt Lydia on June 11, 2024, 12:22:03 PMWhat is the future of Bitcoin?We know where it was in 2009, where it is now (2024), but where is it going?Will it make everyone free? Will it be regulated and become government controlled?All normal and crazy theories please  Definitely an asset, accepted by more countries and trading above 100k for sure..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "June 11, 2024, 03:23:19 PM",
      "body": "Quote from: Aunt Lydia on June 11, 2024, 12:22:03 PMWhat is the future of Bitcoin?The future lies on the past, present and the same expected future in bitcoin under a decentralized digital network, in serving as an alternative means for financial economy currency, which is more cheaper, easier and faster for everyone to use without going through any regulated body.Quote from: Aunt Lydia on June 11, 2024, 12:22:03 PMWe know where it was in 2009, where it is now (2024), but where is it going?To another new all time high after this post halving experience, get ready on the next move.Quote from: Aunt Lydia on June 11, 2024, 12:22:03 PMWill it make everyone free?Bitcoin is decentralized, so by that alone people are free in using it with having to go through any regulated institution or government authorization.Quote from: Aunt Lydia on June 11, 2024, 12:22:03 PMWill it be regulated and become government controlled?No",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chigo",
      "created_time": "June 11, 2024, 03:25:15 PM",
      "body": "Bitcoin in the future will not make people free as imagined, it is only enhanced security and privacy on people's transactions and makes people freer to manage their assets without intervention. And whether it is regulated or controlled by the government, I think that bitcoin will be increasingly regulated by the government and it may limit the function of bitcoin only as a trading instrument, not free to be used for payments like people use fiat. But even if it is regulated, it does not reach the point where the government controls it like they can control fiat. That's just my picture, maybe it will be different, but I believe that bitcoin is heading there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blitz23",
      "created_time": "June 11, 2024, 03:48:52 PM",
      "body": "The future of Bitcoin likely includes increased adoption as a legitimate payment method and digital gold-like store of value, alongside more governmental regulation to address legal concerns",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "June 11, 2024, 03:49:37 PM",
      "body": "I believe regulations will become even stricter both for businesses and individuals owning and trading bitcoin. As long as we have non-custodial wallets, we don't have to be their subjects, but those bastards will find ways to limit that side of the industry. Bogus charges against developers is one way to threaten them. I wonder how long until we start hearing about cases where developers are charged by random women for sexual abuse.Quote from: Helena Yu on June 11, 2024, 02:03:22 PMI speculate almost all Bitcoin will be controlled by government, this is because most holders choose to hold in centralized exchanges or trusting their money to land based company (ETFs). When it comes to centralized exchanges, their positions keep decreasing as time goes by. That's a positive thing because it means there are less coins that might get hacked and cause a big downtrend as a result. You are right that ETFs have seed huge inflows of money recently. In fact, the money coming in every day is much more than what miners can theoretically mine in the same period.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Uhwuchukwu53",
      "created_time": "June 11, 2024, 03:51:30 PM",
      "body": "Quote from: Helena Yu on June 11, 2024, 02:03:22 PMI speculate almost all Bitcoin will be controlled by government, this is because most holders choose to hold in centralized exchanges or trusting their money to land based company (ETFs). Any coins that hand in centralized exchanges and ETFs companies can cooperate with the government, the government can confiscate the coins just like Executive Order 6102 where the government force people to send their gold.Currently Bitcoin has been regulated, the government make the regulations tighter and tighter every year.Yes I concur to this your speculation because many holder or investment has their investment trusted in centralized exchange, secondly many government will focus more on how to control and regulate Bitcoin or crypto to avoid any thing that will bring count down on their fiat, currently I will site example of some of the third world countries like Nigeria is kicking on how to regulate the Bitcoin or crypto currency exchange , it may apply to other nations but I don't think if all of it will have it head because Bitcoin is not built for centralized exchange only those that chooses it that store their currency their many will still like the self custodian wallet which will make most if their regulations not achievable easily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "June 11, 2024, 04:27:47 PM",
      "body": "Quote from: Aunt Lydia on June 11, 2024, 12:22:03 PMWill it be regulated and become government controlled?From the projections and the way that bitcoin is moving, you do not need anyone to tell you that since the government have already picked up an interesting in it, there is no way that the future of bitcoin will exist without any form of regulations. Acceptance will increase, adoption will also increase, same with regulations, and to what extent, we can only guess.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MeGold666",
      "created_time": "June 11, 2024, 04:34:07 PM",
      "body": "Quote from: Frankolala on June 11, 2024, 12:43:38 PMGovernment can only regulate centralized exchanges and not bitcoin. This is because bitcoin is censorship resistance due to its decentralized nature, and nobody can control bitcoin core protocols. So if you have your bitcoin in your noncustodial wallet, just keep hodling because it is giving you financial freedom using it in a decentralized way.It is only altcoins that can be regulated and controlled by the government if they want. With bitcoin, you are free and using it as a store of value/investment over a long time will give you more freedom from inflation. You couldn't be more wrong.Here is a lecture for you:https://thebitcoinmanual.com/articles/bitcoins-battle-with-ofac-compliance/Due to transparent nature of Bitcoin, big miners can be forced to use black list and remove certain coins from transacting.And even if your black listed coins find their way into the block, they are easily traced and movement alone can mean jail for you.As for the question, what it will look like - it will look the same as today but more expensive and more censored.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ahli38",
      "created_time": "June 11, 2024, 04:43:09 PM",
      "body": "Quote from: Aunt Lydia on June 11, 2024, 12:22:03 PMWhat is the future of Bitcoin?We know where it was in 2009, where it is now (2024), but where is it going?Will it make everyone free? Will it be regulated and become government controlled?All normal and crazy theories please  The future of bitcoin is that those who initially reject it will sooner or later or eventually adopt it too. There will be more countries like El Salvador that will legalize Bitcoin as legal tender in the future. Even though it may not be like fiat money, everyone will realize that this is like gold which is also sometimes used for transactions in the real world. Government interference can never be avoided. Because regulations regarding everything related to crypto have now begun to be created in all countries. It's just that they won't be able to have control like they control fiat. And bitcoin will remain a freedom for its holders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "June 11, 2024, 04:45:21 PM",
      "body": "The government is trying its best to control the bitcoins. They are forcing people to use the centralized exchanges so that they can keep track of how many Bitcoins a user is selling and how much he is withdrawing. Next, it will impose tax based on the winnings. So yes, in the future, if this goes on, then I highly doubt that the popularity of the coin will increase. People get into Bitcoins due to the decentralized nature of it. But now the government is trying hard to either make it illegal or impose a huge tax on it. Due to the decentralized exchanges and P2P platforms, Bitcoins are still heaven for many investors and traders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "June 11, 2024, 04:48:49 PM",
      "body": "Quote from: Aunt Lydia on June 11, 2024, 12:22:03 PMWhat is the future of Bitcoin?We know where it was in 2009, where it is now (2024), but where is it going?Will it make everyone free? Will it be regulated and become government controlled?All normal and crazy theories please  For the time being bitcoin have been in existence, you can see how the government have tried to regulate it and have it under their control and still not able to succeed with their aim, this is more than 10 years now, do you still think it will be possible for them in the future if they try more? I don’t think so, because with all what is happening in bitcoin, its operation and on the path it thrives on, the decentralized nature of it will make it impossible for them. It was invented to serve as alternative to the traditional banking system, so making people free in what aspect do you mean? What it can guarantee you is ownership and control of your money by yourself without the involvement of third party or rules being made on you on how to spend your money. This is what bitcoin is and the government can never be a friend to it for this reasons.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MeGold666",
      "created_time": "June 11, 2024, 04:51:36 PMLast edit: June 11, 2024, 05:03:07 PM by MeGold666",
      "body": "Quote from: Ahli38 on June 11, 2024, 04:43:09 PMThere will be more countries like El Salvador that will legalize Bitcoin as legal tender in the future.Aside from making nice headlines in articles, Bitcoin in El Salvador was a big failure...https://www.youtube.com/watch?v=asmOZh-E8W0You just can't expect poor people to pay high fees for transacting with Bitcoin when their monthly salary is ~400 USDAnd you can't expect them to understand LN as even computer savvy guys have problems using it.In the end, easy of use, transaction fees and speed is what matters the most for regular people, not the decentralization and \"number goes up\".This people want to spend, trade, not to hodl.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "June 11, 2024, 05:41:42 PM",
      "body": "Quote from: Aunt Lydia on June 11, 2024, 12:22:03 PMWhat is the future of Bitcoin?We know where it was in 2009, where it is now (2024), but where is it going?Will it make everyone free? Will it be regulated and become government controlled?All normal and crazy theories please  With the increase in government regulation and the inflow of institutional investors into the Bitcoin arena, I predict that the industry is moving towards centralization. These ETF operators are investing so much money on publicity which promotes centralization. I suspect that very soon only a few people will be aware that they can keep their Bitcoin in a decentralized wallet. People are now been brainwashed that these centralized platforms are the ideal medium of investing in Bitcoin. However, there will still be people who will not fall for the government or these institutions. Quote from: Pmalek on June 11, 2024, 03:49:37 PMI believe regulations will become even stricter both for businesses and individuals owning and trading bitcoin. As long as we have non-custodial wallets, we don't have to be their subjects, but those bastards will find ways to limit that side of the industry. Bogus charges against developers is one way to threaten them. I wonder how long until we start hearing about cases where developers are charged by random women for sexual abuse.How are we sure that the government will not criminalize the use of non-custodian wallets in the future. The attack on anonymity services might be an indication that after the attack on mixers and conjoin services, non-custodian wallets might be their next target very soon. The government can come up with different avenues to ensure that they limit privacy. In my country, the government accused cryptos of contributing to the loss or value of our currency. They now use this avenue to clamp down on diverse crypto platforms. Meanwhile, we all know that the reason for the fall of our currency is corruption and bad economic policies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MeGold666",
      "created_time": "June 11, 2024, 05:54:38 PM",
      "body": "Quote from: Die_empty on June 11, 2024, 05:41:42 PMWith the increase in government regulation and the inflow of institutional investors into the Bitcoin arena, I predict that the industry is moving towards centralization. These ETF operators are investing so much money on publicity which promotes centralization. I suspect that very soon only a few people will be aware that they can keep their Bitcoin in a decentralized wallet. People are now been brainwashed that these centralized platforms are the ideal medium of investing in Bitcoin. However, there will still be people who will not fall for the government or these institutions. People outside of crypto still think that banks are safe for storing money and that this third-parties with their \"insurance\" is the only good way to store large amounts of money.It takes hyper-inflation for people to realize how this \"insurance\" works and to switch for something different.Or some hostile takeover due to some accusations.There are a lot of price fluctuations in crypto space, we can't deny that and we can't guarantee anything in this respect.But I still take it over physical money that's hard to secure and over third-party custody.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}