{
  "id": "topic_5521999",
  "title": "adultcrypto",
  "author": "adultcrypto",
  "created_time": "December 08, 2024, 12:09:59 AM",
  "content": "We have seen several instances of people criticizing bitcoin publicly with some saying it was never to be trusted and others saying it was going to zero. The list of these people is long with Nassim Taleb the \"black swan\" man and Janet Yellen as two of the notable critics. For those that want to know some of them and what they have said about bitcoin, Red Bull website gave a short list of some of them.My concern is that I have not seen some of the vocal fud spreaders coming out public to apologize or at least express their change of mind after they might have seen that bitcoin is never what they thought. So, does it mean these critics never ever changes their mind? Can we say that those who think that bitcoin price will get to zero still believe till now that it will happen even after seeing that bitcoin is soaring at six figures?Please if you know anywhere these critics tender public apology or at least express a change of opinion, kindly point me to such material.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5521999",
  "comments": [
    {
      "author": "fokinlipat",
      "created_time": "December 08, 2024, 03:49:38 AM",
      "body": "There is nothing like this.Opinions can change whether it is about earth being round or bitcoin being bad for us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "December 08, 2024, 06:39:55 AM",
      "body": "Critics? No.FUDsters? Yes.Majority of those who may look like simple \"critics\" of Bitcoin, are not critics at all. They are corrupt people who saw their own thing threatened and decided to spread some FUD about bitcoin. They will not change, ever. Like the CEO of one of the most corrupt banking cartel named JP Morgan who called Bitcoin \"fraud\" while one of their companies was buying bitcoin during the crash at the time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "December 08, 2024, 07:17:58 AM",
      "body": "Quote from: adultcrypto on December 08, 2024, 12:09:59 AMMy concern is that I have not seen some of the vocal fud spreaders coming out public to apologize or at least express their change of mind after they might have seen that bitcoin is never what they thought. So, does it mean these critics never ever changes their mind? Can we say that those who think that bitcoin price will get to zero still believe till now that it will happen even after seeing that bitcoin is soaring at six figures?We are seeing an open acceptance instead of a public apology. We have seen these repentant critics openly buying or speaking good about Bitcoin. An example is Michael Saylor and Donald Trump. Other like Financial Times  still believe that the price will still get to zero. They might wait for eternity.Quote from: pooya87 on December 08, 2024, 06:39:55 AMCritics? No.FUDsters? Yes.Majority of those who may look like simple \"critics\" of Bitcoin, are not critics at all. They are corrupt people who saw their own thing threatened and decided to spread some FUD about bitcoin. They will not change, ever. Like the CEO of one of the most corrupt banking cartel named JP Morgan who called Bitcoin \"fraud\" while one of their companies was buying bitcoin during the crash at the time.Some of them will rather die in shame than to swallow their pride. Instead of publicly apologizing, they prefer to secretly invest in Bitcoin. Some of these blind die-hard critics include Warren Buffett, Jamie Dimon and Peter Schiff.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Botnake",
      "created_time": "December 08, 2024, 07:22:14 AM",
      "body": "I think No in general, because take Jamie Dimon, the CEO of JPMorgan, for example. Back in 2017, he was extremely skeptical about Bitcoin and even threatened to fire employees if he found out they were trading it. But look at JPMorgan now...  Cryptocurrency Market News: JPMorgan, Wells Fargo Report Holding Spot Bitcoin ETFsSome critics might stay that way, but many big-time investors who were once skeptical have already jumped on the Bitcoin bandwagon.Even notable figures like Michael Saylor and Elon Musk were once critics of Bitcoin before they fully embraced it. It just shows how perspectives can change over time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dunfida",
      "created_time": "December 08, 2024, 07:36:42 AM",
      "body": "Quote from: adultcrypto on December 08, 2024, 12:09:59 AMWe have seen several instances of people criticizing bitcoin publicly with some saying it was never to be trusted and others saying it was going to zero. The list of these people is long with Nassim Taleb the \"black swan\" man and Janet Yellen as two of the notable critics. For those that want to know some of them and what they have said about bitcoin, Red Bull website gave a short list of some of them.My concern is that I have not seen some of the vocal fud spreaders coming out public to apologize or at least express their change of mind after they might have seen that bitcoin is never what they thought. So, does it mean these critics never ever changes their mind? Can we say that those who think that bitcoin price will get to zero still believe till now that it will happen even after seeing that bitcoin is soaring at six figures?Please if you know anywhere these critics tender public apology or at least express a change of opinion, kindly point me to such material. Why they would be needing to apologize? They havent done something wrong. We are having that a speculative market on which its normal that there would really be those people who do speculate whether negative or positive. Therefore, they havent done something for them to apologize for. Pretty sure that they are now murmuring into themselves about on the missed opportunity on acquiring or getting some cheap coins wayback with that bear market. For sure there would really be those who had changed up their view or impressions towards Bitcoin specially now that it do able to hit up 6 figures on which they've been criticizing about on having that inability could reach up these value or price. As of this moment on which trying out to look around or in the market then we can hardly see to those who do say negative towards Bitcoin on which everything seem fine eh? This is really that a normal sentiment that we can look around on the time that we are heading for the bull run period on which we do know that we are really that going there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adultcrypto",
      "created_time": "December 08, 2024, 07:37:01 AM",
      "body": "Quote from: pooya87 on December 08, 2024, 06:39:55 AMCritics? No.FUDsters? Yes.Majority of those who may look like simple \"critics\" of Bitcoin, are not critics at all. They are corrupt people who saw their own thing threatened and decided to spread some FUD about bitcoin. They will not change, ever. Like the CEO of one of the most corrupt banking cartel named JP Morgan who called Bitcoin \"fraud\" while one of their companies was buying bitcoin during the crash at the time.You are right, critics are different from FUDsters like you put them and I think the later are deliberately being obtuse which is the reason they will never stop or change their stance. They know what they are doing just like you rightly said so they will continue being unfortunate rather than come out public with a change of opinion. Quote from: Die_empty on December 08, 2024, 07:17:58 AMQuote from: adultcrypto on December 08, 2024, 12:09:59 AMMy concern is that I have not seen some of the vocal fud spreaders coming out public to apologize or at least express their change of mind after they might have seen that bitcoin is never what they thought. So, does it mean these critics never ever changes their mind? Can we say that those who think that bitcoin price will get to zero still believe till now that it will happen even after seeing that bitcoin is soaring at six figures?We are seeing an open acceptance instead of a public apology. We have seen these repentant critics openly buying or speaking good about Bitcoin. An example is Michael Saylor and Donald Trump. Other like Financial Times  still believe that the price will still get to zero. They might wait for eternity.I think you are missing some of the points I raised in the post. I intend to know if there have been a case of those who spread misinformation about bitcoin coming public to admit that they were wrong. I don't think Michael Saylor and Donald Trump fit into that category because they never publicly condemned bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "December 08, 2024, 07:46:59 AM",
      "body": "Does their \"apology\" mean anything?To me no. Reason behind this is that FUD is so common in crypto and was so in this forum too like 7-8 years back, that buying bitcoin at that time would seem like a mental challenge you have overcome. In the background, people like them could cause the market to collapse and buy at discounts leaving smaller fries empty handed. You might call the small fries stupid, but this was very prevalent then and not every person is sound enough to make all these decisions on their own with an asset class that literally no one actually understands how to use.So let them remain critics, who cares? We buy bitcoin when the price drops, that is it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "December 08, 2024, 11:02:19 AM",
      "body": "Quote from: adultcrypto on December 08, 2024, 07:37:01 AMQuote from: Die_empty on December 08, 2024, 07:17:58 AMQuote from: adultcrypto on December 08, 2024, 12:09:59 AMMy concern is that I have not seen some of the vocal fud spreaders coming out public to apologize or at least express their change of mind after they might have seen that bitcoin is never what they thought. So, does it mean these critics never ever changes their mind? Can we say that those who think that bitcoin price will get to zero still believe till now that it will happen even after seeing that bitcoin is soaring at six figures?We are seeing an open acceptance instead of a public apology. We have seen these repentant critics openly buying or speaking good about Bitcoin. An example is Michael Saylor and Donald Trump. Other like Financial Times  still believe that the price will still get to zero. They might wait for eternity.I think you are missing some of the points I raised in the post. I intend to know if there have been a case of those who spread misinformation about bitcoin coming public to admit that they were wrong. I don't think Michael Saylor and Donald Trump fit into that category because they never publicly condemned bitcoin. I don't think I missed something. Both Donald Trump and Michael Saylor were well-known critics of Bitcoin. Trump once said that Bitcoin was not money and it was used to facilitate illegal transactions. The President elect has also said that Bitcoin looks like a scam. Before Michael called Bitcoin a digital gold he had once said the currency was doomed to fail. Trump and Saylor might have not publicly apologised about their past negative views about Bitcoin but their current support could be seen as an apology. https://www.forbes.com/sites/julianhayesii/2024/10/14/trillion-dollar-pivot-what-michael-saylors-bitcoin-bet-teaches-ceos/https://www.google.com/amp/s/www.bbc.com/news/business-57392734.amp",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "December 08, 2024, 11:11:17 AM",
      "body": "Quote from: adultcrypto on December 08, 2024, 12:09:59 AMCan we say that those who think that bitcoin price will get to zero still believe till now that it will happen even after seeing that bitcoin is soaring at six figures?They can have their reasons to think that Bitcoin will fall to zero, with Bitcoin price at $10, $100, $1000, $10000 or even $100,000 or even higher, but what can we do with them?Nothing. They have their brains and there are enough free resources to learn about Bitcoin, they are free to absorb these resources or ignore them. If now, they still believe that \"Bitcoin will fall to zero\" or they will still believe it in future, we only can let them be. We can not change these people who are obsessive with their wrong thinking.They can change their critics from \"Bitcoin will fall to zero\" to \"Bitcoin will fall to $1,000 or $100\" when price is about $500,000 or $1M.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "December 08, 2024, 12:21:17 PM",
      "body": "There are different kinds of Bitcoin critics. There are those who will eventually bend a knee. There are also those who won't. Those who won't could be classified further. For example, Schiff and Taleb's arguments aren't the same. I haven't heard all of their arguments against Bitcoin, but it seems Taleb's arguments are more on the fundamentals. He doesn't even give much value to Bitcoin's price. Bitcoin hitting $100,000 or even a million doesn't matter to him. Bitcoin remains essentially that technology that doesn't have much worth regardless of its fiat value. I think this kind of critic, one who doesn't mind the price, won't turn into a convert.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvell1",
      "created_time": "December 08, 2024, 01:05:39 PM",
      "body": "But can you tell me why you care about this and what we would gain if bitcoin critics publicly apologized? This world is colorful, everyone has different personalities, interests and tastes...we shouldn't expect everyone to be like us. Furthermore, our purpose in entering the market is to profit and get rich, not to argue and prove right and wrong. So in my opinion, we should ignore and avoid contact with people who do not think the same way as us. As investors, we should focus on accumulating bitcoins because that is how we make profits. Also, we can't know what their real purpose is in criticizing bitcoin, do they really hate it or are they just trying to find a way to keep people away from it but still secretly buy it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "December 08, 2024, 01:31:25 PM",
      "body": "Quote from: adultcrypto on December 08, 2024, 12:09:59 AMMy concern is that I have not seen some of the vocal fud spreaders coming out public to apologize or at least express their change of mind after they might have seen that bitcoin is never what they thought. So, does it mean these critics never ever changes their mind? Can we say that those who think that bitcoin price will get to zero still believe till now that it will happen even after seeing that bitcoin is soaring at six figures?Some would have changed their minds, but the effects and implications they might have caused on themselves and others will always remain, you can imagine a situation whereby some are willing and interested on bitcoin and were eager to give a try, but due to its attacks received from others discouraged them and stops them from investing and that same opportunity got wasted at that particular time, also in this, they may also be affected since being the critics, they are nit also investing in bitcoin as they discourage others from doing so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "December 08, 2024, 03:39:04 PM",
      "body": "The tendency is that the list of critics to Bitcoin decrease, as it becomes more and more successful along the cycles, but inevitably there will be always critics and negative predictions regards Bitcoin. People who claim Bitcoin is going to zero can still believe it's going to happen someday, as it's a prediction based on future events which nobody knows for sure. Moreover, people can say anything they wish, although the fact is that such predictions make no difference for Bitcoin. Bad things have been being told about it incessantly, what didn't prevent Bitcoin from reaching where it currently is.Just ignore empty critics based on speculation. Focus in your personal goals and investments, do your research and reading of the market critically, but don't be biased or influenced by people who just want to defame it, neither by those who want to defend it at all costs. In both cases reasoning isn't present, so you should be careful with that. To be aware about the pros and cons is the best way to prepare yourself consciously for the potential outcomes of this market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "December 08, 2024, 04:17:53 PM",
      "body": "As much as I want to see one person saying sorry, I don't see it going to happen since they are still waiting for BTC's fall. They even announce the death of BTC in every bear market so yeah they will remain a critic forever even if there is a Bitcoin Reserve already.We could see them trying to talk about how they tricked people into not buying while they were buying. So it's not going to be surprising if one of them announces they own more than a thousand BTC. That would be a funny announcement that's for sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "December 08, 2024, 04:41:01 PM",
      "body": "The answer for the title made by op is NO! We have seen many like that before, just like other countries that banned Bitcoin before but later they also revoked it and the best thing about it is that they have even adapted the concept and features of Bitcoin until now.Then it's just like politics where your former enemy politician can become your ally, and your ally now can become your enemy later because he is your opponent in politics, the same goes for this field industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "December 08, 2024, 08:51:30 PM",
      "body": "Critical thinking individuals who were simply frightened of the idea? No. Egomaniacs who thrive by spreading misinformation they regard as absolute truth and who cannot tolerate the thought of being wrong? Yes. Many think bitcoin is an IQ test, but it is actually an ego test. Early adopters who hodled to this date didn't do so because of their intelligence. They did so, because of their humility.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Patikno",
      "created_time": "December 08, 2024, 08:52:51 PM",
      "body": "Quote from: adultcrypto on December 08, 2024, 12:09:59 AMMy concern is that I have not seen some of the vocal fud spreaders coming out public to apologize or at least express their change of mind after they might have seen that bitcoin is never what they thought. So, does it mean these critics never ever changes their mind? Can we say that those who think that bitcoin price will get to zero still believe till now that it will happen even after seeing that bitcoin is soaring at six figures?Please if you know anywhere these critics tender public apology or at least express a change of opinion, kindly point me to such material.  Before I came to this post, I went to another post which provided us with a link to a person named Peter Schiff talked about not to buy Bitcoin or something like that, the video was 20 minutes long and I lost interest on minutes 5.Then I went to google to search up this guy, then I found another recent video of him. Does Peter Schiff Regret Not Buying Bitcoin?Here you go, friend. Probably this is what you are looking for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odusko",
      "created_time": "December 08, 2024, 09:33:30 PM",
      "body": "Quote from: adultcrypto on December 08, 2024, 12:09:59 AMWe have seen several instances of people criticizing bitcoin publicly with some saying it was never to be trusted and others saying it was going to zero. The list of these people is long with Nassim Taleb the \"black swan\" man and Janet Yellen as two of the notable critics. For those that want to know some of them and what they have said about bitcoin, Red Bull website gave a short list of some of them.My concern is that I have not seen some of the vocal fud spreaders coming out public to apologize or at least express their change of mind after they might have seen that bitcoin is never what they thought. So, does it mean these critics never ever changes their mind? Can we say that those who think that bitcoin price will get to zero still believe till now that it will happen even after seeing that bitcoin is soaring at six figures?Please if you know anywhere these critics tender public apology or at least express a change of opinion, kindly point me to such material. Apology for what, no one need apology from them, and I pray that they overcome their individual web of lack of knowledge and the tendency to give a concluding assumption on Bitcoin future, such critice will never change their way, their will always have something bad to write about Bitcoin, their aim is to stereotype Bitcoin and painting Bitcoin in a bad light, so no one give a dem about them Lmao.I have stopped reading anything coming from anti Bitcoin advocate and all I care about right about now is how well I can manage the risk within Bitcoin and to sustain my positions as I keep accumulating more Bitcoin no matter how small it could be.Most of those that publicly speak against Bitcoin, have all invested in Bitcoin in the secret but in public, they make Bitcoin look very dangerous for the newbies who have low or no knowledge about Bitcoin and this have being affecting only those who listen to those rumors monger's and hypocrisy preacher, majority of them have large Bitcoin starch in tye secrets, but attack Bitcoin publicly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "December 08, 2024, 10:29:40 PM",
      "body": "If they don't change their mind, who cares? That's the thing I've come to understand about life. Not everyone will be on the same sides no matter how good one side will be. That's why we have:— different clubs. — different religions. — different personalities.— and above all, different currencies including Bitcoin.Most bitcoin critics will not change simply because if they backtrack on their critisms and concede defeat, they lose some of their reputation and street cred from their fans and everyone who believed in their critisms and fuds. That said, most of them will stay the course. Critics and Fudsters won't change for the same reason why Craig Wright won't stop claiming to be satoshi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}