{
  "id": "topic_5459446",
  "title": "Sidd_Das",
  "author": "Sidd_Das",
  "created_time": "July 11, 2023, 05:49:51 PM",
  "content": "Hello,I wanted to take a moment to share my experience with LeetCode and also introduce you to an exciting platform that my peers and I have developed for all blockchain enthusiasts out there.As an avid user of Leetcode for several years, I have greatly benefited from the extensive collection of coding questions and the amazing community support. It has been instrumental in sharpening me for several interviews and even landed me jobs. However, as of recent I have taken upon blockchain engineering and felt there was a gap in the availability of coding questions specifically tailored to Solidity and blockchain-related problems.Blockchain, with its decentralized and transparent nature, is revolutionizing various industries, and Solidity has emerged as the go-to programming language for developing smart contracts on the Ethereum platform. As someone who's new to the space, I wanted to push my boundaries further and practice coding challenges that align with this domain.Therefore, along with my peers, I embarked on a journey to bridge this gap and create a platform that caters specifically to Solidity-based coding challenges. Today, I am thrilled to introduce you to https://www.wriggly.io/ - a website designed to enhance your blockchain skills through a collection of Solidity coding challenges.Wriggly provides a comprehensive set of carefully curated coding questions that cover various aspects of Solidity programming, including smart contracts, token creation, decentralized applications (DApps), and much more. With Wriggly, you can dive deep into the world of Solidity and blockchain.Here are some key features that make Wriggly:1) Library of Solidity Coding Challenges: Wide range of problems with varying difficulty levels, ensuring there is something for everyone to sovle.2) Detailed Explanations and Solutions: Each problem comes with detailed explanations and solutions, helping to understand the best approches and learn from our community.3) Peer Learning and Collaboration: We have a strong community which engages in disucission, share insights, and collaborate to accelerate growth in the blockchain space.4) Realistic Coding Enviornment: Similar to what is provided on LeetCode, Wriggly allows users to run and submit code for respectice problems. We even have a sandbox to test out custom code.I invite you all to check out Wriggly.io and begin your journey in blockchain development. Please feel free to provide feedback, share your experiences, and let us know how we can further improve Wriggly to meet your needs. We would also like to bring this feature onto LeetCode, so submitting a feature request would be very helpful!Best regards,Sidd",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459446",
  "comments": []
}