{
  "id": "topic_5429359",
  "title": "hundof94",
  "author": "hundof94",
  "created_time": "December 16, 2022, 12:01:57 PM",
  "content": "What if 50-100 years from now new generations just fork bitcoin from the beginning to start again because they were not part of the early wealth accumulation? 🤔In 50-100 years the gap is going to be so massive. Someone born 50 years from now have almost zero chance to own 1 bitcoin while there will be people holding thousands.Does that mean new generations will have the motive to start bitcoin over again and start spreading the same way Facebook did? Starting from college students and get mass adopted later on?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5429359",
  "comments": [
    {
      "author": "NeuroticFish",
      "created_time": "December 16, 2022, 12:24:14 PM",
      "body": "Quote from: hundof94 on December 16, 2022, 12:01:57 PMWhat if 50-100 years from now new generations just fork bitcoin from the beginning to start again because they were not part of the early wealth accumulation? 🤔In 50-100 years the gap is going to be so massive. Someone born 50 years from now have almost zero chance to own 1 bitcoin while there will be people holding thousands.Does that mean new generations will have the motive to start bitcoin over again and start spreading the same way Facebook did? Starting from college students and get mass adopted later on?You know, the simple fact a coin is called Bitcoin doesn't make it worth a lot. See all the Bitcoin forks.Also a newly made coin may or may not become valuable, see the altcoins, in huge numbers being disappointing for the investors.And, as a bottom line, the fact a coin (like bitcoin) worth a lot doesn't mean the world/the people get rich. No. Only few of the investors.This being said, creating a new bitcoin may not make sense, especially if it'll be just a clone. I'd expect people will work in Satoshis in 50-100 years to overcome the price rise, but not much else.So creating a new coin can (only) make sense if it brings something really new and useful to the ecosystem. And that's not related to the price of the competitor coins. Also that can be done now too, no need to wait 50 years. Again, see the altcoins, some did bring new useful features and some of those are going pretty much OK.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "December 16, 2022, 12:31:51 PM",
      "body": "Quote from: hundof94 on December 16, 2022, 12:01:57 PMWhat if 50-100 years from now new generations just fork bitcoin from the beginningForks usually happen at the current chain, if you restart from the start it's an altcoin. You don't have to wait 50 years for that, people have already done that thousands of times. Some of them got rich from it, but ultimately they all want Bitcoin instead of their own made-up coin.QuoteIn 50-100 years the gap is going to be so massive. Someone born 50 years from now have almost zero chance to own 1 bitcoin while there will be people holding thousands.If only young people could do that with dollars or euros too",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Artemis3",
      "created_time": "December 16, 2022, 01:21:25 PM",
      "body": "The funny thing is that very thing has been ocuring during all the life of Bitcoin, its called \"altcoins\"... Doesn't mean they will succeed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "December 16, 2022, 04:42:29 PM",
      "body": "Concentrate on the now, not in the past and what could have been. The vast majority of uswere not involved with the early stages of Bitcoin but we should be grateful for the early adoptersand everyone else who have nurtured it and helped it grow to where it is today.Forking Bitcoin in any way won't result in what the OP wishes, The Bitcoin Blockchainwill continue on its path with the vast majority of interested people supporting and following it, it's consensus!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "S A KHAIR",
      "created_time": "December 16, 2022, 05:00:40 PM",
      "body": "What will be certain is that bitcoin will still exist or be used in the next 100 years. Thinking about that is too far-fetched and makes no sense at the moment. We're in the present, so let's try to have more bitcoins than others, that's what we should be more concerned with than thinking about the next 100 years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "December 16, 2022, 06:33:57 PM",
      "body": "I was having a somewhat similar thought. But not skipping 50-100 years. I have seen BTC grow and fall. Also, there are thousands of altcoins and new blockchains are popping up now and then with their own coins. But none of them has come close to BTC in price point.Why can't they succeed? (there are few successful projects!) If someday BTC falls and went out of existence (just imagine), which will be its successor?....And if one could replace BTC, will it provide the same features, or will it be improved? This makes no sense, but just a thought in my curious mind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "December 16, 2022, 06:44:47 PM",
      "body": "What would be benefits of a fork form the beginning? They cannot obtain Bitcoin or fork coin because of the fork. I'm not sure if the OP is familiar with Bitcoin fork. Forking new coins would be similar to Ravencoin (RVN), which claims to be a Bitcoin fork with a different supply. It has no monetary value, unlike Bitcoin. Or another type of fork, such as Bitcoin Cash, which is a waste of time for the community. None of them are competitive with Bitcoin or anything similar. Rather, I believe that when the next generation learns about Bitcoin, they will develop a different currency than Bitcoin. It will not harm Bitcoin's existence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "December 16, 2022, 07:20:12 PM",
      "body": "I missed the 'early wealth accumulation' too.  Anyone not investing today will say the same years down the road.  I can try to restart Bitcoin right now.  But I will fail, because nobody is going to want my Coin.By spending 1 BTC today, you are spending about $17,000 that could be worth well over a million one decade from now.  This is why I am saying it.  We are and will always continue to be early.  It is just never going to be late.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "December 16, 2022, 08:23:14 PM",
      "body": "Quote from: hundof94 on December 16, 2022, 12:01:57 PMWhat if 50-100 years from now new generations just fork bitcoin from the beginning to start again because they were not part of the early wealth accumulation? 🤔It won't be bitcoin anyway. People already attempted doing this and then we have Bitcoin Cash, Bitcoin Gold, Bitcoin SV, Bitcoin Diamond, Super Bitcoin... And much more.Quote from: hundof94 on December 16, 2022, 12:01:57 PMIn 50-100 years the gap is going to be so massive. Someone born 50 years from now have almost zero chance to own 1 bitcoin while there will be people holding thousands.Well, better to have 0.0001BTC with Bitcoin pricing 100,000$-200,000$ than owning 1 Bitcoin Something pricing 0,01$.Quote from: hundof94 on December 16, 2022, 12:01:57 PMDoes that mean new generations will have the motive to start bitcoin over again and start spreading the same way Facebook did? Starting from college students and get mass adopted later on?Younger generations should start with bitcoin like the previous ones. The search for an improved bitcoin has already lead many investors into losing money to pump and dump schemes through altcoins. And if they continue thinking like this, younger generations are going to lose more money yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitDane",
      "created_time": "December 16, 2022, 10:02:11 PM",
      "body": "Quote from: hundof94 on December 16, 2022, 12:01:57 PMWhat if 50-100 years from now new generations just fork bitcoin from the beginning to start again because they were not part of the early wealth accumulation? 🤔In 50-100 years the gap is going to be so massive. Someone born 50 years from now have almost zero chance to own 1 bitcoin while there will be people holding thousands.Does that mean new generations will have the motive to start bitcoin over again and start spreading the same way Facebook did? Starting from college students and get mass adopted later on?We don't need to wait 50-100 years but rather we can just look back and check cryptocurrency's Bitcoin fork history dating 2014 up to present.  This history will discourage new generation in forking Bitcoin because most of these Bitcoin fork happen to have short success and then goes down the drain.  Besides, Bitcoin isn't just a code anymore, it has already an established economy  and community that will try to resist any changes greedy developers wanted to implement for their personal gain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zilon",
      "created_time": "December 16, 2022, 10:15:13 PM",
      "body": "There have been a lot of Bitcoin fork after Bitcoin cash, and none has made half the impact Bitcoin has done. 50-100 years is too far to guess what to expect the present forks is enough to give a picture of what to expect if the future generation tries to fork Bitcoin because they feel they missed the early accumulation phase it will only end up in altcoin projects except there will be a different ledger system more advanced than the blockchain anything that operate on the blockchain as a crypto currency forked from Bitcoin remains altcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romero121",
      "created_time": "December 16, 2022, 11:56:31 PM",
      "body": "Quote from: Zilon on December 16, 2022, 10:15:13 PMThere have been a lot of Bitcoin fork after Bitcoin cash, and none has made half the impact Bitcoin has done. 50-100 years is too far to guess what to expect the present forks is enough to give a picture of what to expect if the future generation tries to fork Bitcoin because they feel they missed the early accumulation phase it will only end up in altcoin projects except there will be a different ledger system more advanced than the blockchain anything that operate on the blockchain as a crypto currency forked from Bitcoin remains altcoin.Same as this we can see more people trying to fork bitcoin. Someone like Roger will claim it to be the real bitcoin keeping some legal players. This is common as everything is connected with money. The generation needs to understand about blockchain and later they won't think of cloning the bitcoin network so to own a single cloned bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "December 17, 2022, 01:34:09 AM",
      "body": "Quote from: Artemis3 on December 16, 2022, 01:21:25 PMThe funny thing is that very thing has been ocuring during all the life of Bitcoin, its called \"altcoins\"... Doesn't mean they will succeed.Yep this is true if the young generation started all over again the chain this will called altcoin even though is the technology that used is same thing as the bitcoin did.In my perspective the way we called \"Bitcoin\" is only one the fork of bitcoin is altcoin and that's it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "December 17, 2022, 01:56:54 AM",
      "body": "This is a question no one can predict, even though we may not know exactly where bitcoin is. It's safe to say that while blockchain technology is here to stay, it will be very interesting to see how it shapes the future for generations.actually, there's no point in thinking too far out there because there's no point in thinking about something we won't feel or know about because we definitely don't exist, but I think bitcoin will last forever as long as people use it.and if you look at the difference in technology between 100 years ago and now, or even 20 years ago and now. the rate of technological evolution is increasing rapidly, largely due to the increase in the flow of information. And blockchains like bitcoin will improve these flows and the accuracy of the data contained within them, but like all technologies, blockchains will need to be replaced at some point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "December 17, 2022, 02:28:58 AM",
      "body": "Quote from: hundof94 on December 16, 2022, 12:01:57 PMWhat if 50-100 years from now new generations just fork bitcoin from the beginning to start again because they were not part of the early wealth accumulation? 🤔In 50-100 years the gap is going to be so massive. Someone born 50 years from now have almost zero chance to own 1 bitcoin while there will be people holding thousands.Does that mean new generations will have the motive to start bitcoin over again and start spreading the same way Facebook did? Starting from college students and get mass adopted later on?Just take a look at al the forks and altcoins which have existed over the years and you will see that such a thing does not matter at all, at the same time your argument is really weak because if that was enough of a reason to reboot bitcoin then why not do the same with the whole economy? After all now most of the wealth is concentrated in a few hands and some may think of this as unfair and yet we do not do it, so while I can see why some may think it is unfair other users have so many coins when they have almost nothing, this is not enough of a reason to do this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "December 17, 2022, 03:10:26 AM",
      "body": "The moment Bitcoin was launched was also the moment all succeeding coins will be named altcoins. Whatever coin they are, they will be nothing but mere altcoins. The point is that there is no starting Bitcoin over again. However, I have to embrace the reality that Bitcoin is probably not the best currency the world will ever have. At this point, Bitcoin probably is, but a hundred years from now? We cannot tell. Calling Bitcoin the best currency the world will ever have is probably a huge insult to an ever-developing and evolving world. The growing pace of technological development and innovation and the ever-changing times could mean a new best currency would arise a century from now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "December 17, 2022, 05:43:47 AM",
      "body": "I guess it could happen. But if they want to get 1 full bitcoin, they can look for it and try to trade with stable coin pair altcoins because that's what we've been doing. As long as they can do these methods and they can find out how they can get 1 bitcoin, they can have a lot of bitcoins, especially if they can analyze bitcoins.When the price of bitcoin is like it's out of reach for most people but they can still try to get it in various ways, they will do it. Even though that means they have to fork bitcoin again because their goal is still to have 1 full bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "justdimin",
      "created_time": "December 17, 2022, 05:49:02 AM",
      "body": "Quote from: hundof94 on December 16, 2022, 12:01:57 PMDoes that mean new generations will have the motive to start bitcoin over again and start spreading the same way Facebook did? Starting from college students and get mass adopted later on?That is basically what is going on with altcoins, are you not aware? There are a lot of people who were not part of the early part of bitcoin and try to join in on the newer altcoins in case they grow to be huge, like if something you got in when it was 10-20 million marketcap became 10 billion in marketcap, that is good enough forever for you, you will never need more money ever again. That is what people are banking on when they are investing into crappy shitcoins that come out everyday.I personally feel like there is a good chance people will keep doing that, but forking bitcoin will not make the real one gone, it will just create another altcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chato1977",
      "created_time": "December 17, 2022, 06:48:36 AM",
      "body": "Quote from: ethereumhunter on December 17, 2022, 05:43:47 AMI guess it could happen. But if they want to get 1 full bitcoin, they can look for it and try to trade with stable coin pair altcoins because that's what we've been doing. As long as they can do these methods and they can find out how they can get 1 bitcoin, they can have a lot of bitcoins, especially if they can analyze bitcoins.When the price of bitcoin is like it's out of reach for most people but they can still try to get it in various ways, they will do it. Even though that means they have to fork bitcoin again because their goal is still to have 1 full bitcoin.Accumulating bitcoin isn't that easy because the value nowadays is really high but if you know how to trade altcoin then for sure in the time that you gather enough profit then you can purchase one and keep it for holding , but of course this will take time.,effort and courage same as Knowledge to gain that much.it took me years before finally hot my whole bitcoin..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}