{
  "id": "topic_5472517",
  "title": "philipma1957",
  "author": "philipma1957",
  "created_time": "November 01, 2023, 11:35:53 PM",
  "content": "2015 Sept up 2.82%2015 Oct.  up 31.92%2015 Nov  up  21.44%2015 Dec  up  13.75%here we are 8 years later2023 Sept 3.95%2023 Oct 28.51%2023 Nov ?2023 Dec ?I looked at the post below to come up with my 2015 to 2023 comparison.will we repeat this?Quote from: taufik123 on October 31, 2023, 11:47:49 PMQuote from: fzkto on October 31, 2023, 04:15:08 PMQuote from: BlockchainWizard on October 31, 2023, 04:10:44 PMIt's funny to see that October is the most successful month for Bitcoin. This has probably already become firmly anchored in people's minds, so that all market participants act accordingly. A self-fulfilling prophecy in that sense. Yes, this October was no exception and bitcoin didn't just rise, it broke resistance that couldn't be broken all of 2023. But I doubt about the psychology that it happened naturally, September was also green, although it was almost always red.Naturally or not, initially it was the effect of Cointelegraph giving invalid news about ETF acceptance that FOMO occurred and many bought Bitcoin at this time so that it broke the $30k resistance, then indeed dumped after the news was not true. But the next effect is like a snowball that makes market conditions better and until now it is able to hold at $34k + +. October was a green month and we are about to enter November which in the last 2 years has always shown a drastic decline.Will the trend change?we will see.If we do the 2015 pattern from sept to dec we will rock 2 more months.35000 x 1.21 = 42350 by dec 142350 x 1.1375 = 48173 by jan 1.opinons and guesses?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472517",
  "comments": [
    {
      "author": "albert0bsd",
      "created_time": "November 02, 2023, 02:06:24 AM",
      "body": "Quote from: philipma1957 on November 01, 2023, 11:35:53 PMwill we repeat this?Well, this become a little more predictable every halfing and maybe the euphoria for bitcoin will be a little more conservative than before. But since this is still speculative there is no way to know, 8 years ago a lot of my acquaintances and family never heard about bitcoin, this year even my mom knows that bitcoin its something to care about...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "November 02, 2023, 02:37:47 AM",
      "body": "Quote from: philipma1957 on November 01, 2023, 11:35:53 PMIf we do the 2015 pattern from sept to dec we will rock 2 more months.35000 x 1.21 = 42350 by dec 142350 x 1.1375 = 48173 by jan 1.opinons and guesses?Yeah, it could be around that price range and I think that's where the numbers are being predicted as well by December or early next year, like $40,000-$50,000. And so if the pattern continues maybe just a little +/- but still around that ball park number.And with that, we should be expecting the economics picture of Bitcoin going to improvement in the next two months. Bullish sentiments is still up in the air and we all know that it's hard to go against that. So we will see and hopefully the pattern is still valid for this 2023.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "November 02, 2023, 03:24:12 AM",
      "body": "I am inclined to toss out all of the 2020-2021 rally due to the covid factor.if we trend back to 2015-2016-2017. for 2023 -2024-2025we could easily surpass  500k by dec 2025.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "November 02, 2023, 04:25:23 AM",
      "body": "Quote from: philipma1957 on November 02, 2023, 03:24:12 AMwe could easily surpass  500k by dec 2025.With how long you've been doing this, I'm surprised you'd say that. Haven't we learned anything from what happened this cycle? Everyone was looking at stats and charts and predicting stratospheric prices for this very cycle, which have not come true. $150K was one low prediction for this cycle out of many, and look how that turned out. Dan Held was already predicting a maximum of $0.5M million for this cycle. We also had very sophisticated models such as the S2F model giving predictions that were astounding and when the price falsified the theory the author insisted on continuing to make a fool of himself by reformulating the theory instead of considering it false. That said, I hope you are right or even short and we hit $2M per Bitcoin the next cycle. That would do me great.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "November 02, 2023, 06:08:53 AM",
      "body": "Quote from: philipma1957 on November 01, 2023, 11:35:53 PM2015 Sept up 2.82%2015 Oct.  up 31.92%2015 Nov  up  21.44%2015 Dec  up  13.75%here we are 8 years later2023 Sept 3.95%2023 Oct 28.51%2023 Nov ?2023 Dec ? 8 years is not 8 days so it's hard been that we can't really be sure about similar figures resurfacing in the remaining two months of Nov and Dec of this year. However, what pumps my heart with optimism and that of other bitcoiners about the bitcoin price either retaining similar figures or going above the 2015 % within these two months is the proposed approval of the  bitcoin spot ETF by 2024  that have been of positive influence to BTC price with both new individual and institutional investors investing their way into the market, it's therefore my expectation that bitcoin price would exceed those percentage by the end of this two months.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "November 02, 2023, 10:31:15 AM",
      "body": "Quote from: philipma1957 on November 01, 2023, 11:35:53 PM2015 Sept up 2.82%2015 Oct.  up 31.92%2015 Nov  up  21.44%2015 Dec  up  13.75%here we are 8 years later2023 Sept 3.95%2023 Oct 28.51%2023 Nov ?2023 Dec ?opinons and guesses?The Technical Data is very similar, but 8 years ago the United States did not dominate crypto and was not interested. Today, America is very interested in crypto because it wants to control everything. In fundamental analysis, I would like to point out that the FED decisions and the ETF issue are important on the Bitcoin price today. For example, if the ETF decision is realized today, it will positively affect the Bitcoin price and cause a lot of deviation in the data. Bitcoin and crypto markets are more dependent than they were 8 years ago, and it is very difficult to decide whether the data will match or not. We may not even see the positive effects of the halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "November 02, 2023, 11:34:07 AM",
      "body": "There doesn't seem to be a dominating pattern as to the months of November and December which suggests that they are either good or bad months. So I think it's open. Both possibilities of green and red could happen. November and December could bring us either increase or decrease. But then certain factors or circumstances like the highly anticipated Bitcoin spot ETF and the halving in April of 2024 may be at play in the last two remaining months. And they signal a generally positive outlook.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "November 02, 2023, 01:47:32 PM",
      "body": "After the price broke the 35,000 level, I do not find strong resistance at 38,000, and therefore there is nothing preventing us from seeing 42,000 within a month or 48,000 within two months, with the possibility that we will have a correction. The longer it stays above $30,000, the more the upward trend is moving, and there is nothing preventing this trend.If things go the same as in 2016/2017, what are your expectations for the new ATM?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "November 02, 2023, 03:33:38 PM",
      "body": "Quote from: philipma1957 on November 02, 2023, 03:24:12 AMI am inclined to toss out all of the 2020-2021 rally due to the covid factor.if we trend back to 2015-2016-2017. for 2023 -2024-2025we could easily surpass  500k by dec 2025.But let's not forget that bitcoin's market cap today is far higher today than it was in 2015-2017, so we really can't make the same comparison. The more money there is invested in an asset, the harder it is to pump/dump it. Unless, we really get huge inflows of money from an ETF or a black-swan event in the world of finance that'll be favorable for Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "November 02, 2023, 06:16:17 PM",
      "body": "Quote from: Poker Player on November 02, 2023, 04:25:23 AMQuote from: philipma1957 on November 02, 2023, 03:24:12 AMwe could easily surpass  500k by dec 2025.With how long you've been doing this, I'm surprised you'd say that. Haven't we learned anything from what happened this cycle? Everyone was looking at stats and charts and predicting stratospheric prices for this very cycle, which have not come true. $150K was one low prediction for this cycle out of many, and look how that turned out. Dan Held was already predicting a maximum of $0.5M million for this cycle. We also had very sophisticated models such as the S2F model giving predictions that were astounding and when the price falsified the theory the author insisted on continuing to make a fool of himself by reformulating the theory instead of considering it false. That said, I hope you are right or even short and we hit $2M per Bitcoin the next cycle. That would do me great.no I normally would never say a number like that.  But just pull out 2019-2020-2021and look at 2015-2016-2017 and a big big big big uptick looks more likely.We all know 2019-2021 was really fucked up world wide due to covid.So maybe we should give a lot more weight to the 2015-2017 up tick.  If you look at me for all the years I have been around I never made picks this bullish.at mk4 500k is not that much. It is 10 trillion. If we perfectly copied 2015-2017 we would do 2.1 millionor 40trillion.  So I adjusted downwards to account for what you are saying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "November 02, 2023, 07:41:49 PM",
      "body": "I do not think that it will be that clear, the difference is that back in 2015 we were quite low and it wasn't all that hard to make that kind of difference, it was quite possible to see the difference and was easy to handle. However, the reality is that we are not going to end up with anything that good that easily, we should avoid hoping for that, the market cap is not that small anymore and going up that much is not that easy.Yes we have gone up one month like that, but multiple months like that is a huge bull run that requires a global attention to it, which may happen but not right now because I think that's reserved for next year after the halving when usually the bull starts. If we have it now, on top of that we would need another one and that would be just way too much money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "November 02, 2023, 09:37:11 PM",
      "body": "Quote from: el kaka22 on November 02, 2023, 07:41:49 PMI do not think that it will be that clear, the difference is that back in 2015 we were quite low and it wasn't all that hard to make that kind of difference, it was quite possible to see the difference and was easy to handle. However, the reality is that we are not going to end up with anything that good that easily, we should avoid hoping for that, the market cap is not that small anymore and going up that much is not that easy.Yes we have gone up one month like that, but multiple months like that is a huge bull run that requires a global attention to it, which may happen but not right now because I think that's reserved for next year after the halving when usually the bull starts. If we have it now, on top of that we would need another one and that would be just way too much money.well I can't say I did not tell you.  I see a bull run that will bring us well past the 2021 run.I have been on this site for a long time and have never ever pushed big huge numbers in the future.Now I am.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "johnsaributua",
      "created_time": "November 02, 2023, 11:35:21 PMLast edit: November 03, 2023, 01:51:21 AM by johnsaributua",
      "body": "The time span is enough to analyze the journey of bitcoin 8 scenarios can happen, I see the possibility if such a trip in 2020 is repeated again this is extraordinary especially towards the end and enter the beginning of 2021 harvest bitcoin sir.But in 2017 I am not sure about the confidence of bitcoin holders because there is a considerable decline, maybe there is other news that disrupts the bitcoin journey, I take the middle of the middle of the year you mentioned, although it has not completely surpassed 2020 and 2021 in January 2024 it will be able to enter at a price of $48000-$55000, logically last month there was an increase of $7000$ about 26% instantly, if towards the end of the year there is a potential of 40%-50%, HODL bitcoin!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "November 02, 2023, 11:57:10 PM",
      "body": "I don't expect the growth rates of the past to repeat this time, because back then there was a lot of room for price growth - the price increase of only $100 was doubling the price or increasing it by half. Today $100 increase is just noise, a lot more money is needed to move the market, and I'm not sure that such money is available. So I keep by expectations modest and believe it will take some time to reach the previous ATH and we won't go too far past it. In this model going 10-20% up every month seems too fast.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "November 03, 2023, 12:44:45 AM",
      "body": "Quote from: hatshepsut93 on November 02, 2023, 11:57:10 PMI don't expect the growth rates of the past to repeat this time, because back then there was a lot of room for price growth - the price increase of only $100 was doubling the price or increasing it by half. Today $100 increase is just noise, a lot more money is needed to move the market, and I'm not sure that such money is available. So I keep by expectations modest and believe it will take some time to reach the previous ATH and we won't go too far past it. In this model going 10-20% up every month seems too fast.This is where I think most people are mistaken. BTC has shown itself as high as 1.2 trillion cap.so we only need do 8x that to go over 500k and a 10 trillion cap.I do believe it is coming.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "November 03, 2023, 03:18:43 PM",
      "body": "These gains are even prior to halving and for some Bitcoin ETF approval. I am optimistic that the end of the year will be good but I am leaning and moving forward to next year and more with post-halving.Quote from: philipma1957 on November 03, 2023, 12:44:45 AMso we only need do 8x that to go over 500k and a 10 trillion cap.I do believe it is coming.With all the setting that we're having that institutions are joining, I am crossing my fingers that we'll be there soon. I'd be patient until it comes. I have seen the growth of Bitcoin but you're longer than me on this game that's why I won't say it is impossible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BrewMaster",
      "created_time": "November 03, 2023, 03:50:12 PM",
      "body": "we are slowing heading to that moment where the launchpad is now in sight.all it takes is one more step to start the subsequent rises that nobody can stop or slow down anymore.this time we should only see 6 digits prices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "November 03, 2023, 03:55:34 PM",
      "body": "Quote from: philipma1957 on November 01, 2023, 11:35:53 PMIf we do the 2015 pattern from sept to dec we will rock 2 more months.35000 x 1.21 = 42350 by dec 142350 x 1.1375 = 48173 by jan 1.opinons and guesses?I’m very new here when this happened and I remember I created my forum account because I’m curious why Bitcoin is pumping hard that time until I learn what’s Bitcoin halving. I believe Bitcoin will follow same pattern considering how the potential ETF approval gives us a huge hype while halving is already in few months. The pump during pre halving is imminent but what I’m curious more if this pump will continue until the new ATH after the halving since there’s always a huge correction after huge event like this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "South Park",
      "created_time": "November 03, 2023, 09:39:08 PM",
      "body": "Quote from: Beparanf on November 03, 2023, 03:55:34 PMQuote from: philipma1957 on November 01, 2023, 11:35:53 PMIf we do the 2015 pattern from sept to dec we will rock 2 more months.35000 x 1.21 = 42350 by dec 142350 x 1.1375 = 48173 by jan 1.opinons and guesses?I’m very new here when this happened and I remember I created my forum account because I’m curious why Bitcoin is pumping hard that time until I learn what’s Bitcoin halving. I believe Bitcoin will follow same pattern considering how the potential ETF approval gives us a huge hype while halving is already in few months. The pump during pre halving is imminent but what I’m curious more if this pump will continue until the new ATH after the halving since there’s always a huge correction after huge event like this. We need to prepare ourselves mentally as anything can happen, the scenario being presented by the OP can definitely happen and I think it is even reasonable that it does, but bitcoin is extremely volatile and temperamental, so it could just as easily take the opposite direction and it would not surprise me one bit if it did, however taking into account that this time there is not going to be a pandemic that artificially crashes the price of bitcoin, it seems possible the next bull run could be more intense than anticipated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}