{
  "id": "topic_5405126",
  "title": "sensimilia",
  "author": "sensimilia",
  "created_time": "July 04, 2022, 12:02:45 PM",
  "content": "Bitcoin has played an important role in making the system more popular in paperless economic transactions. In paperless economic transactions, any amount of currency can be exchanged quickly without any hassle. There is no interference from anyone and no one can know any information about this transaction. So in this transaction system many people feel comfortable to do the transaction.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405126",
  "comments": [
    {
      "author": "DooMAD",
      "created_time": "July 04, 2022, 01:18:39 PM",
      "body": "But weirdly, at the same time, Bitcoin is also the biggest deterrent for governments to abolish physical cash.  If people are forced to choose between a paperless currency controlled by the government and a paperless currency which no one can control, I'd imagine a fair few would opt for the latter.  Governments don't want that.  So it provides them a reason to keep cash around for a bit longer.  They are almost certainly going to spend that time looking for ways in which to subvert Bitcoin, so we need to keep an eye on that.  But I'm fairly confident Bitcoin can withstand whatever ploys they come up with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "July 04, 2022, 02:08:08 PM",
      "body": "Quote from: sensimilia on July 04, 2022, 12:02:45 PMBitcoin has played an important role in making the system more popular in paperless economic transactions. In paperless economic transactions, any amount of currency can be exchanged quickly without any hassle. There is no interference from anyone and no one can know any information about this transaction. So in this transaction system many people feel comfortable to do the transaction.Not really! Bitcoin has created a parallel economy alongside the mainstream one. The forerunner for paperless economy is will be CBDCs. Bitcoin can surely claim that it has forced the governments to fasttrack their CBDC projects, but bitcoin didn't replace paper currency from the economy. Bitcoin is mostly used as an investment rather than a daily currency. In a perfect world, no one is interested in paying a transaction fee for their regular purchases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "July 04, 2022, 02:30:41 PM",
      "body": "Quote from: sensimilia on July 04, 2022, 12:02:45 PMThere is no interference from anyone and no one can know any information about this transaction. So in this transaction system many people feel comfortable to do the transaction.Yes, Bitcoin did a wonderful job by introducing blockchain to the world and also changed the way we see digital money but you'll be surprised that with the help of some blockchain analysis company or advanced research and the information about crypto transactions can be known because Bitcoin is not anonymous. It requires some extra activity ( the use of Bitcoin tumbler or privacy wallet) to make Bitcoin transactions anonymous.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luzin",
      "created_time": "July 04, 2022, 03:00:43 PM",
      "body": "Quote from: sensimilia on July 04, 2022, 12:02:45 PMBitcoin has played an important role in making the system more popular in paperless economic transactions. In paperless economic transactions, any amount of currency can be exchanged quickly without any hassle. There is no interference from anyone and no one can know any information about this transaction. So in this transaction system many people feel comfortable to do the transaction.In terms of comfort, there is little that makes me feel sad right now. Sometimes the congested network makes me wait to get a lower cost. Although now many applications like Lightning Network sometimes Bitcoin or other crypto network if it is in congested then confirmation will take longer time. Maybe this is one of the fears why governments in big countries have not dared to replace paper money with digital money, even though currently the world's banks have adopted a little technology in the form of numbers in bank transactions. I also agree this is more efficient but all have drawbacks if we are not vigilant. Many take advantage of this situation to commit crimes. I think this is just the beginning of the digital money era and it will continue to grow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "July 04, 2022, 08:38:26 PM",
      "body": "Quote from: sensimilia on July 04, 2022, 12:02:45 PMBitcoin has played an important role in making the system more popular in paperless economic transactions.No it didn't, the introduction of payment cards, and later online banks and payment apps is what made people switch to digital payments. Bitcoin with its 700,000 transactions per day is so insignificant, that if it stopped working tomorrow, the society wouldn't notice. No one is switching from cash straight to Bitcoin, people move from cash to digital payment methods, and from them to Bitcoin. But while there are many people who only use digital fiat payments, there's very little people who only use Bitcoin in their daily lives.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "July 04, 2022, 08:48:21 PM",
      "body": "Quote from: DooMAD on July 04, 2022, 01:18:39 PMBut weirdly, at the same time, Bitcoin is also the biggest deterrent for governments to abolish physical cash.  If people are forced to choose between a paperless currency controlled by the government and a paperless currency which no one can control, I'd imagine a fair few would opt for the latter.  Governments don't want that.  So it provides them a reason to keep cash around for a bit longer.  They are almost certainly going to spend that time looking for ways in which to subvert Bitcoin, so we need to keep an eye on that.  But I'm fairly confident Bitcoin can withstand whatever ploys they come up with.I believe that physical cash will still exists for some time, at least in some countries.It is the most anonymous and free money that exists (which is why governments will try to banish it one day).Unfortunately, it is hard to transfer high amounts of cash, as it is risky and hard to manage.Bitcoin and other cryptocurrency might become an alternative to physical cash, it bitcoin is more private than a bank transfer and we have as much liberty as we have on cash (even more, as it is easy to transfer)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "July 04, 2022, 09:27:09 PM",
      "body": "Quote from: sensimilia on July 04, 2022, 12:02:45 PMBitcoin has played an important role in making the system more popular in paperless economic transactions. I believe paperless economy was not pioneered by bitcoins, we have had debit cards for some time now that don't necessarily require you moving around with the traditional fiat. Quote from: sensimilia on July 04, 2022, 12:02:45 PMIn paperless economic transactions, any amount of currency can be exchanged quickly without any hassle. There are slight challenges sometimes with sending bitcoins, it is not like the process is always hassle free. We can say bitcoin has facilitated transactions and eliminated the bureaucracy involved with sending large sums with traditional banks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "July 04, 2022, 09:33:37 PM",
      "body": "I have to say credit cards and debit cards feels like they are the forerunner of the paperless economy to me. I have went outside today, and spent a good chunk of money (for my nation of course, it was more like 20 dollars only) and I never touched a single cash. It was definitely something I have to warn in the long run as a great risk to banknotes. I do not think that nations who \"print\" money even print it anymore, do they? Like when USA says they \"print\" trillions, do they literally go out there and print 100 dollars or whatever denomination of money worht of trillions of dollars? All in banknotes? And send that to somewhere? I still think most shouldn't even be printed, its all on bank accounts now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "July 04, 2022, 09:46:01 PM",
      "body": "Quote from: DooMAD on July 04, 2022, 01:18:39 PMIf people are forced to choose between a paperless currency controlled by the government and a paperless currency which no one can control, I'd imagine a fair few would opt for the latter.  Governments don't want that.  So it provides them a reason to keep cash around for a bit longer.Big doubts about your statement.  I might be more pessimistic than the average person over here but I doubt the majority will move to Bitcoin than stay in their own comfort with the instant payments, customer support and whatever else the banks will be offering with these paperless currencies the governments will release.  Even forced to choose, most will prefer to avoid responsibility and choose what is easier, faster and less of a headache overall (government's currency).They already have the opportunity to choose between controlled and not controlled, and they seem to still choose the former even if Bitcoin has been roughly battle tested for more than a decade long.  They still choose comfort.  And even out of those who are holding Bitcoin, how many are actually using it as a non controlled paper less currency?  Because my gut feeling tells me most of them are here just for speculation.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "July 04, 2022, 10:14:11 PM",
      "body": "Quote from: sensimilia on July 04, 2022, 12:02:45 PMBitcoin has played an important role in making the system more popular in paperless economic transactions. In paperless economic transactions, any amount of currency can be exchanged quickly without any hassle. There is no interference from anyone and no one can know any information about this transaction. So in this transaction system many people feel comfortable to do the transaction.In modern transactions, you'll know the sender and the receiver. With bitcoin, it's true that we've got anonymous transactions and it's a good thing if you're for it.As we do the transaction, we can set the fee and how much it will be. In return, that will play the part of the speed of confirmation, whether you do it with priority or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "edgycorner",
      "created_time": "July 04, 2022, 10:28:19 PM",
      "body": "Do I want bitcoin to be the frontrunner? Absolutely.is it rught now? Nope. Not even close.It's only true for a few sectors, most of which can be considered illegal or within the grey area.For the rest of the consumer and business side of things, transactions are indeed paperless but they still include the bank(or a similar service, for example paypal,skrill,webmoney, apple pay) as a party.Bitcoin is waaay beyond, when you compare it with the above services in terms of volume. But waaaay ahead, in terms of quality, ownership, and fungibility. Weird world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DooMAD",
      "created_time": "July 04, 2022, 11:22:52 PM",
      "body": "Quote from: PrivacyG on July 04, 2022, 09:46:01 PMQuote from: DooMAD on July 04, 2022, 01:18:39 PMIf people are forced to choose between a paperless currency controlled by the government and a paperless currency which no one can control, I'd imagine a fair few would opt for the latter.  Governments don't want that.  So it provides them a reason to keep cash around for a bit longer.Big doubts about your statement.  I might be more pessimistic than the average person over here but I doubt the majority will move to Bitcoin than stay in their own comfort with the instant payments, customer support and whatever else the banks will be offering with these paperless currencies the governments will release.  Even forced to choose, most will prefer to avoid responsibility and choose what is easier, faster and less of a headache overall (government's currency).They already have the opportunity to choose between controlled and not controlled, and they seem to still choose the former even if Bitcoin has been roughly battle tested for more than a decade long.  They still choose comfort.  And even out of those who are holding Bitcoin, how many are actually using it as a non controlled paper less currency?  Because my gut feeling tells me most of them are here just for speculation.Think of it this way.  People currently have the option to pay with cash.  That is comfortable for most people.  At the moment, yes, the primary motivation for many for getting involved with Bitcoin probably is speculation, as you've said.  But that's all going to change.  When the government suddenly says people no longer have any other option than to use a government-sanctioned digital currency, which spies on you, tracks your every move and can be blocked or frozen for any reason, it's safe to say that \"your money\" won't actually be yours to do with as you like anymore.  Money is going to become a tool for surveillance and control (more so than it already is, I mean).  I feel like that would create a lot of resentment from a large proportion of the public.  People will realise the importance of privacy when they're faced with the threat of losing it forever (because that's what CBDCs represent).  And once they become aware that there is an alternative, I fully expect there to be a surge in popularity for Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "asimi.io",
      "created_time": "July 05, 2022, 06:17:55 AM",
      "body": "Yes! you are pretty right, the single thing which I feel is good in crypto currency is that there is proof from the buyer or to the seller. Who is buying and who is selling no idea at all. I think its the only reason why people trust more on Crypto. BTC will rise up soon and we will see massive pump for sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "July 05, 2022, 06:24:32 AM",
      "body": "Quote from: DooMAD on July 04, 2022, 01:18:39 PMBut weirdly, at the same time, Bitcoin is also the biggest deterrent for governments to abolish physical cash.  If people are forced to choose between a paperless currency controlled by the government and a paperless currency which no one can control, I'd imagine a fair few would opt for the latter.  Governments don't want that.  So it provides them a reason to keep cash around for a bit longer.This theory has little to do with reality.Quote from: DooMAD on July 04, 2022, 11:22:52 PMThink of it this way.  People currently have the option to pay with cash.  That is comfortable for most people.  What is convenient for people is to pay with their mobile phone or watch. Cash is dirty and uncomfortable: you pay with a banknote and you get heavy notes and coins back. With a mobile phone, while you send a WhatsApp or look at Instagram, you pay and you don't notice.Quote from: DooMAD on July 04, 2022, 01:18:39 PM Money is going to become a tool for surveillance and control (more so than it already is, I mean).  I feel like that would create a lot of resentment from a large proportion of the public.  People will realise the importance of privacy when they're faced with the threat of losing it forever (because that's what CBDCs represent).  And once they become aware that there is an alternative, I fully expect there to be a surge in popularity for Bitcoin.I respect your opinion, but I think you are confusing wishful thinking with reality.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChrisPop",
      "created_time": "July 05, 2022, 06:46:55 AM",
      "body": "Quote from: sensimilia on July 04, 2022, 12:02:45 PMBitcoin has played an important role in making the system more popular in paperless economic transactions. In paperless economic transactions, any amount of currency can be exchanged quickly without any hassle. There is no interference from anyone and no one can know any information about this transaction. So in this transaction system many people feel comfortable to do the transaction.It depends on what states are you referring to. If you go in third-world countries there are a lot of unbanked people especially older generatioon who are not educated enough to use a debit/credit card. It will be very hard to bank or digitalize such a big mass of people, so I think we still have to wait around 10-20 years before we can expect a true paperless economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "July 05, 2022, 07:05:41 AM",
      "body": "You know I'm all Bitcoin and all that but there have actually been some countries that were going almost paperless in terms of money when Bitcoin was still a glint in Satoshi's eye. And what do you mean no one can know about transactions? Block explorer?Also, if we're being technical, what do you think people were running economies on before they invented paper?See, I can bring up contextless discussions too",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Thara20",
      "created_time": "July 05, 2022, 07:31:44 AM",
      "body": "Let's agree to disagree. Since banks went digital and other modes of digital payment popped up, people have been moving digitally for some time now. Bitcoin, on the other hand, is a catalyst for how transactions can take place in the near future. On the flip side , not everyone who owns bitcoin in the real world wants an extra fee for every transaction made. Plus, the major point is that you need fiat money to buy bitcoin. That in itself is a contradiction to how currency works in a paperless economy. Being a pioneer, Bitcoin sure did make blockchain and cryptos a reality. This created a new economy entirely aside from the established one. When looking at bitcoin, this has to be considered as a long term investment until crypto gets normalized globally.https://medium.com/chickeychik/future-of-cryptocurrency-998d0b3aced6",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "doomloop",
      "created_time": "July 06, 2022, 07:14:39 PM",
      "body": "Quote from: Thara20 on July 05, 2022, 07:31:44 AMLet's agree to disagree. Since banks went digital and other modes of digital payment popped up, people have been moving digitally for some time now. Bitcoin, on the other hand, is a catalyst for how transactions can take place in the near future. On the flip side , not everyone who owns bitcoin in the real world wants an extra fee for every transaction made. Plus, the major point is that you need fiat money to buy bitcoin. That in itself is a contradiction to how currency works in a paperless economy. Being a pioneer, Bitcoin sure did make blockchain and cryptos a reality. This created a new economy entirely aside from the established one. When looking at bitcoin, this has to be considered as a long term investment until crypto gets normalized globally.The OP didn't say that bitcoin was the first but he only said that bitcoin makes cashless transactions became more popular due to its unique features like being decentralized which cant be found on the rest. Real life events such as the covid 19 have also help people to start using cashless since they can't get out of their house but they must find a way to continue doing a transaction.Fiat is mostly needed to obtain a bitcoin but there are mining, faucet and so many ways to obtain a bitcoin without needing to have a fiat on hand. Many people look at bitcoin as an investment asset but the default use of bitcoin are actually a currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "July 07, 2022, 04:04:42 AM",
      "body": "OP is right from the use of the word \"More\" popular, bitcoin didn't make it popular debit cards did, so bitcoin took it from there and made paperless transaction more popular, even bitcoin served the world in times of trouble when those other paperless methodologies may not work. During Covid bitcoin was used to run some transaction and it got noticed, no cashless method would have served millions of people without their server having a crash like bitcoin did for the Ukrainians when the Russians struck their territory. Looking at these major global occurrence, bitcoin can be said or have indeed made the paperless economy more popular.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}