{
  "id": "topic_5447633",
  "title": "T3PR00T",
  "author": "T3PR00T",
  "created_time": "April 05, 2023, 07:27:25 AM",
  "content": "Sorry for another topic in short time. I was checking out discussion of the topic made earlier on service discussion board. It's about mixers, nothing too take seriously.I was reading some other topics to until I saw the topic about trusted escrow service on the forum. I know Dabs is having some financial difficulties so I was checking which signature is he wearing? I found nothing. While I was just exploring I saw his post history page and found he really is struggling.Quote from: Dabs on January 31, 2023, 09:03:53 PMHi zazarb,I would like to kindly request for further extension, I am still unable to pay for now. I will have some funds incoming by March 2023. Please allow until then March 31, 2023 and if we can maintain the payment at 0.605 BTC.Thank you and very much appreciated for your kind consideration.DabsAnd then after checking the next few posts from the list I saw he has an existing loan from DarkStar_ too which is supposed to repay in three months and taken on last October.Quote from: Dabs on October 30, 2022, 02:36:00 AMRequest For a No Collateral LoanRequired USDT Amount: 15,000.00Estimated Loan Duration: 3 Months (October 29 2022 to January 29 2023)USDT TRC-20 Address: TG9JY1mhjc1kLPvq2FZGcfPEDuUZPYkXipAmount to be repaid: 16,800.00Signed Message:-----BEGIN PGP SIGNED MESSAGE-----Hash: SHA256This is Dabs, today is October 29 2022 and I ask a loan from DarkStar_ in 3 months period with repayment of 16,800 USDT.-----BEGIN PGP SIGNATURE-----iQIzBAEBCAAdFiEELtryBF/BzPuVE2TLNuQVeDKtdWUFAmNdCsYACgkQNuQVeDKtdWUaBQ//eLE5sZictrQJPDkxoGO2q29jr+YzpgKuODTfPBWnHK+hJeSW9JDznj35bTpNJe4+x1wVaD08BkY5OWuStTamepO1l6Le8MtBqJafpLzb5Aycs03tKdPnIA1M3FVsX7wQjdYHyti3cpBsM3J//4MNma77/pbFgOtoYDlqpg9PS76CyA8XF/pt2/s0QEzz8mK/9esyNQDF/zNlrUEAGU7T8hVH11T9yC6Ss4M/RjUX36IIwMwJk0EEtKMGViluoDXXT3YGFvxNbsAXfz4vPOFdpvE9OPh7WZH8s3Rr3DzsnMXZoWL+NCFO8raYunrSC4HBHCJzpp+374tIfKPoXXvFpDUMynAEFo1PaFX55xznsyuqwVaK+h1k+jmefFHOue/L2cITDSDzeCpOYw6JVEvGKE5nBz37ikREQS435MCC9MBJwQCqdHsLrqON5eP7eItq5IE1e66KzaxjGAk7Q4aJ5xTVIiiEj1c7vuCbq3w+zLjHAEWOlsoPkAwXDSTvj8ib4AF/YibHknDOXhHZMZIH34mCsi+G+DyBgiNeRyNPVV0u+jvqC3GT+mt3xurDIbs5wKBD+suwg1bY3cBs82BBJh2QRCcLx3arhRGnHvGQsfiQX2kZY55hlgyDNPArfHke+d6XeIavmBbQ4NUuIXNlIQpvWmzmMlY81DrhF8xqEQE==NuTkMy concern is, when someone has such debt and really not easy going to repay the debt, is he fit for escrow service? Dabs is advertising the service in his signature too.When people are in debt, they are vulnerable. Dabs could be an exception but how confidently we can accept it?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447633",
  "comments": [
    {
      "author": "Plaguedeath",
      "created_time": "April 05, 2023, 08:01:21 AM",
      "body": "You're overreacting this situation, Dabs currently not involved in escrow service, do you have a proof if he was escrowed something in this forum?If someone still want to use Dabs's escrow service, they're already know the risk since DarkStar_ has left neutral feedback on his account, if they don't know Dabs has unpaid huge loan, it's their mistakes for being careless.Quote from: T3PR00T on April 05, 2023, 07:27:25 AMI was checking which signature is he wearing? I found nothing.Signature campaign isn't the only way to earn money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "April 05, 2023, 08:36:40 AM",
      "body": "Quote from: Plaguedeath on April 05, 2023, 08:01:21 AMYou're overreacting this situation, Dabs currently not involved in escrow service, do you have a proof if he was escrowed something in this forum?It's not overreacting. It's a valid concern because Dabs owes money to others and his escrow topic is active too. There's no update on the topic that he isn't anymore offering escrow service on the forum. I'm not telling Dabs is not trusted but having this together is impossible. What if somehow Dabs lost the money in escrow, how will Dabs pay back the money to the party.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "John Abraham",
      "created_time": "April 05, 2023, 09:16:45 AM",
      "body": "Quote from: Plaguedeath on April 05, 2023, 08:01:21 AMDabs currently not involved in escrow service.  Who said that? Did you see any notice in his escrow service thread? If not, How do you say he has not been involved in Escrow service while his Signature Space advertising for his Service?QuoteDo you have a proof if he was escrowed something in this forum? Why not check his Escrow service thread and Feedback page as well? He is a well-known guy and has successfully done some deals for forum users.QuoteIf someone still want to use Dabs's escrow service, they're already know the risk since DarkStar_ has left neutral feedback on his account, if they don't know Dabs has unpaid huge loan, it's their mistakes for being careless. I don't know what to say. He is a well-known reputed guy who has done some deals. If he knows that it's risky. He should avoid continuing his service until he gets into a stable position again.QuoteSignature campaign isn't the only way to earn money.He is not earning money from Signature Campaign. He is advertising his own service in his Signature Space.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nutildah",
      "created_time": "April 05, 2023, 09:52:03 AM",
      "body": "He opened the thread in 2013, and there hasn't been a reply to it in over 2 years. How is this remotely a concern? Obviously people looking for an escrow are going to do their own due diligence before settling on one, and having a debt doesn't necessarily preclude him from acting as an escrow. Perhaps he can use the escrow fees to help repay the debt.Besides, he probably put it in his signature a long time ago. This is not a real problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "April 05, 2023, 10:16:22 AM",
      "body": "I don't think anyone's going to use it:Quote from: Dabs on June 15, 2013, 11:05:04 AMMinimum Fee: 0.1 BTCThat topic was created when Bitcoin was worth a lot less. Here, it shows Dabs' minimum fee is 0.03 BTC. I don't think anyone is going to use it, but indeed, I wouldn't ask someone with debts to act as escrow. He stopped posting since he took some (huge) loans.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "April 05, 2023, 10:19:02 AM",
      "body": "Quote from: Little Mouse on April 05, 2023, 08:36:40 AMQuote from: Plaguedeath on April 05, 2023, 08:01:21 AMYou're overreacting this situation, Dabs currently not involved in escrow service, do you have a proof if he was escrowed something in this forum?It's not overreacting. It's a valid concern because Dabs owes money to others and his escrow topic is active too. There's no update on the topic that he isn't anymore offering escrow service on the forum. I'm not telling Dabs is not trusted but having this together is impossible. What if somehow Dabs lost the money in escrow, how will Dabs pay back the money to the party.Risk is there so everything could change without us knowing and the amount borrowed is huge so there are possibilities that anything bad could happen so I find the concern of OP is valid. If Dabs still offering escrow which we cannot see it actively happening he should clean up those loans first so that there will be no question regarding on this situation and people could easily erase out their doubts about those negative possibilities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "April 05, 2023, 11:41:03 AM",
      "body": "Quote from: Taskford on April 05, 2023, 10:19:02 AMQuote from: Little Mouse on April 05, 2023, 08:36:40 AMQuote from: Plaguedeath on April 05, 2023, 08:01:21 AMYou're overreacting this situation, Dabs currently not involved in escrow service, do you have a proof if he was escrowed something in this forum?It's not overreacting. It's a valid concern because Dabs owes money to others and his escrow topic is active too. There's no update on the topic that he isn't anymore offering escrow service on the forum. I'm not telling Dabs is not trusted but having this together is impossible. What if somehow Dabs lost the money in escrow, how will Dabs pay back the money to the party.Risk is there so everything could change without us knowing and the amount borrowed is huge so there are possibilities that anything bad could happen so I find the concern of OP is valid. If Dabs still offering escrow which we cannot see it actively happening he should clean up those loans first so that there will be no question regarding on this situation and people could easily erase out their doubts about those negative possibilities.I don't question Dabs integrity, but T3PR00T concern is valid unless he locks the thread and takes out the escrow service in his signature he's still offering an escrow service, the purpose of the signature is to promote whatever products or services we are associated it, but it's better for Dabs to come here and address this issue and so we can all be enlightened on T3PR00T's concern.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "April 11, 2023, 08:46:11 AM",
      "body": "OP is logically correct on the other hand we can't assaisinate someone's character just based on their financial status, have you ever read a story like a homeless person returned a lost wallet of a rich man and didn't accept any favours from him so there are such kind of people also living in this world.About this topic its clear that he isn't involved in escrowing at the moment even though someone hire him after reading the risk beyond then its their choice so they have to face the circumstances as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "April 11, 2023, 12:55:48 PM",
      "body": "Quote from: Findingnemo on April 11, 2023, 08:46:11 AMOP is logically correct on the other hand we can't assaisinate someone's character just based on their financial statusIf the escrow makes a mistake, he should be able to cover the damage he caused. No matter how good his intentions are, having financial problems make that very difficult.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "April 12, 2023, 03:25:11 AM",
      "body": "I agree that it does not seem appropriate for him to continue to advertise his escrow service in his signature until he resolves his debts. But the moral of the story I take from it is that he registered on the forum in March 2012, when a Bitcoin cost $5. With different management of his finances, the story could be very different. Many of us dream of having known this world back then. That people like him resort to debt does not make me confident that Bitcoin will move us away from the debt-based financial system. Just stop by the lending section for a sample.  By the way, it seems that it is already late for loan repayment. Do we know if it is due to lack of updates in the lenders' threads or what?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "April 12, 2023, 07:18:14 AMLast edit: April 13, 2023, 08:19:09 AM by LoyceV",
      "body": "Quote from: Poker Player on April 12, 2023, 03:25:11 AMThat people like him resort to debt does not make me confident that Bitcoin will move us away from the debt-based financial system. Just stop by the lending section for a sample.We (humanity) will never be without debt, but it's still different than fractional reserve debts. Fiat debts are based on inflation, and get smaller over time. Bitcoin debts on the other hand increase as it's value goes up, which makes it a very risky debt.QuoteBy the way, it seems that it is already late for loan repayment. Do we know if it is due to lack of updates in the lenders' threads or what?I noticed it too, but we can't know for sure until the lender complains.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "April 12, 2023, 06:46:43 PM",
      "body": "Quote from: LoyceV on April 12, 2023, 07:18:14 AMWe'll never be without debt, but it's still different than fractional reserve debts. Fiat debts are based on inflation, and get smaller over time. Bitcoin debts on the other hand increase as its value goes up, which makes it a very risky debt.Never be without debt? Speak for yourself.  Bitcoin debts aren’t risky because Bitcoin goes up. Bitcoin debt is risky because there is a limited supply so if debt rises then there comes a point where it can never be paid back. That’s the difference. Whether the value rises or falls is meaningless. Fiat is printed to infinity, so debt can always be serviced. From a systemic standpoint, rising debt in BTC can never be repaid. That’s why every single entity that has offered interest in Bitcoin has failed and always will.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kopipe",
      "created_time": "April 20, 2023, 02:28:19 PM",
      "body": "This thread has devolved into pointless philosophical discussion and navel-gazing.To get back to the point of Dabs' reputation:Dabs has never given me a reason not to trust him in our eight years of doing business.Historical / on hold or not, his escrow service is reliable and one of the best games in town.He easily could have dipped years ago on his obligations.He just did an escrow for me where he held $4000 for over a week because the terms of a contract needed hashing out: https://bitcointalk.org/index.php?topic=5448307.0Not that my word ought count for much, but I trust him. I've met him in person, too, in the Philippines, many moons ago.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Awaklara",
      "created_time": "April 20, 2023, 09:37:24 PM",
      "body": "Quote from: T3PR00T on April 05, 2023, 07:27:25 AMWhen people are in debt, they are vulnerable. Dabs could be an exception but how confidently we can accept it?of course, anyone who owes them will be vulnerable. but it all depends on the relationship with the lender. looking at the reputation of the borrower, of course, many people have been in contact with him and that has built his reputation.if something goes wrong, of course, it will be the responsibility of the borrower. the problem with the amount of the loan made, the risk has been handled by the lender.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "April 21, 2023, 07:39:31 AM",
      "body": "Quote from: kopipe on April 20, 2023, 02:28:19 PMDabs has never given me a reason not to trust him in our eight years of doing business.Good point. As far as I know, there haven't been any valid accusations so far.QuoteHe just did an escrow for me where he held $4000 for over a week because the terms of a contract needed hashing out: https://bitcointalk.org/index.php?topic=5448307.0At least this confirms his escrow service is still active.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "April 21, 2023, 05:23:16 PM",
      "body": "Quote from: kopipe on April 20, 2023, 02:28:19 PMThis thread has devolved into pointless philosophical discussion and navel-gazing.To get back to the point of Dabs' reputation:Dabs has never given me a reason not to trust him in our eight years of doing business.Historical / on hold or not, his escrow service is reliable and one of the best games in town.He easily could have dipped years ago on his obligations.He just did an escrow for me where he held $4000 for over a week because the terms of a contract needed hashing out: https://bitcointalk.org/index.php?topic=5448307.0Not that my word ought count for much, but I trust him. I've met him in person, too, in the Philippines, many moons ago.Good to see Dabs doing his old things. The escrow topic does not seem to have many activities from long time. Anyone without knowing him will not give much attention but someone who knows Dabs from years will still trust him. I think the lending based on that trust too. Dabs is having difficulties as far as I know too but no matter what situation you are in a good man is always a good man.Well done.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}