{
  "id": "topic_5462386",
  "title": "fillippone",
  "author": "fillippone",
  "created_time": "August 07, 2023, 05:50:06 PMLast edit: August 07, 2023, 11:36:57 PM by fillippone",
  "content": "In critical news Today, PayPal decided to launch its stablecoin. PayPal becomes first major fintech to launch dollar-backed stablecoinQuotePayPal's stablecoin, dubbed PayPal USD, is backed by U.S. dollar deposits and short-term U.S. Treasuries and will be issued by Paxos Trust Co. It will gradually be available to PayPal customers in the United States.It's an important news to me. First, because this kind of issuance by private money has already been frowned upon by regulators, think about Meta so that it can be an acid test for regulators: has the stance changed since the Meta experiment? Secondly, with high-interest rates, collecting liquidity for free and investing in Treasuries can boost PayPal revenues. This is the contract. Of course, this is not an isolated venture of PayPal in cryptocurrencies, as they have been quite active in the past, as you may recall.  PayPal to allow cryptocurrency buying, selling and shopping on its networkI am on the move today; I will update this OP with more relevant information later.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462386",
  "comments": [
    {
      "author": "stompix",
      "created_time": "August 07, 2023, 06:13:06 PM",
      "body": "Tether guys not happy!  QuoteAs an ERC-20 token issued on the Ethereum blockchain, PayPal USD will be available to an already large and growing community of external developers, wallets and web3 applications, can be easily adopted by exchanges, and will be deployed to power experiences within the PayPal ecosystem.  ERC-20 token, how nice ./sLong term this is going to be interesting, normally I would see it replacing usdt with ease but leave it to Paypal to screw up even the basics, they have a huge advantage in userbase and real-world application but this whole thing could easily fail to gain momentum.Quote from: fillippone on August 07, 2023, 05:50:06 PMFirst, because this kind of issuance by private money has already been frowned upon by regulators, think about Meta so that it can be an acid test for regulators: has the stance changed since the Meta experiment? They won't care that much.Facebook fucked up with Libra by trying to make it a global currency and them acting like an international central bank, everyone was afraid it would end up with some crypto coin in their country that claims to be stable, backed by true reserve, and in reality outside their jurisdiction.This is just Paypal money, backed by usd, running in usd and probably already doing everything under their supervision.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "August 07, 2023, 07:24:36 PM",
      "body": "A moment of humor, from reality, and on a related topic:Justin Sun, the owner of Huobi Bankrupt (https://t.me/c/1597252347/4025), offered Paypal to launch a PYUSD stable on the TRON network.Paypal is lucky for scam offers    After all, PYUSD was supposed to be released back in 2022 on Solana with the support of FTX (https://t.me/c/1597252347/2561).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "August 07, 2023, 11:35:44 PMLast edit: August 07, 2023, 11:53:29 PM by fillippone",
      "body": "It needs further investigation, but apparently, this is the token: There are many fake versions, but this one appears to be held at an address labelled as Paxos.PayPal entered the stablecoin market. Paolo Ardoino is not impressed:I easily can see why that: I guess targeted markets are totally different: Traders for USDT and casual holders and spenders for Py USD",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "August 08, 2023, 08:11:02 AM",
      "body": "The key advantage of PayPal's solution is that it is a stable, well-established, international company with good status and market capitalization. Behind which there is history, trust, technology, and the largest payment system ! All together adds weight to PayPal, and at the same time, hopefully, will provide a really secured, not subject to speculative and illegal influences, stablecoin for the crypto market ! Plus, PREPARATELY, PayPal also has plans to make a bridge between crypto and fiat, through the PayPal platform, which will be very convenient and will attract more PayPal users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "August 08, 2023, 09:35:21 AM",
      "body": "This is a welcome development for PayPal and this stablecoin can be redeemed for US dollars at any given time. Also this would be used to facilitate the easy flow of buying and selling of other crypto currencies offered on the platform.But investing in crytocurrencies via the platform is not such a good idea because PayPal never gives you the private key but rather prefers to keep it, making it difficult for the user to spend or transfer the funds off it's platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "August 08, 2023, 10:27:21 AM",
      "body": "I rejoice with the OP but have mixed feelings about this since it's a welcome development but nothing new as people are already manoeuvring their way to exchange their coins for USD and vice versa without the involvement of PayPal and this could continue without them being missed. This is for their own (Paypal) business because of the dominance of crypto in the financial system. As it is, the stablecoin is better guaranteed in price, so they have little or nothing to lose.But I pity those who Paypal would seize their USDT/USD assets just like the noncustodial wallets, if your USDT is big, just know that you might answer queries for your own money, this is nonsense. Paypal can do and undo and does not have that integrity online, especially with non-US users. Good luck to those who will risk this, I can never be a party to it, not even for business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alastantiger",
      "created_time": "August 08, 2023, 11:03:05 AM",
      "body": "I have not used PayPal however with the feedbacks I have read on social media platforms, they do not seem to be in the good light of the public due to their terms of service, of fining customers $2500 for saying things that they do not agree with. They deducted this money from their bank account. Some old customers are saying if they did this to them and so why should they trust them with their newly launched stablecoin? Well, as much as this sounds good, I think that the US regulators may in the future come for them just as they did with UDSC and Binance USD because they don't want on-shore stable coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "August 08, 2023, 11:12:47 AM",
      "body": "Finally,  something that can beat USDT is unleashed in crypto world, many aren't going to be happy about this, and that includes the Tether guys, I think many funds will leave USDT at this point and swim into Paypal new stable coin.It looks like a good news, this could be the bridge between biggest payment systems in the world and crypto space at last, I had this dream in 2019 but it failed, lets hope this one will kick off well. Maybe this will make payment option on online shopping more easier, because in my county I still have to get a virtual dollar card to shop on online marketplace and it sucks so bad, maybe this is the begging of the solution.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btcfilmmaker",
      "created_time": "August 08, 2023, 02:54:15 PM",
      "body": "Wasn't there something in the contract that allowed them to freeze wallets and remove funds if they deemed fit? Not sure how true it is as I only saw it floating about on Twitter, didn't read into it yet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "August 08, 2023, 03:11:23 PMLast edit: August 08, 2023, 08:43:53 PM by fillippone",
      "body": "Twitter is mad at the following:Apparently, in PayPal USD the issuer can enter an “asset protection mode” and “block” and “seize” assets.In addition to that it can raise the max issued limit without any problems.A lot of criticism about these features: “Bitcoin has fixed max issuance”, “Not your Keys, not your coins\", \"transaction censorship!\" \"centralisation attack vector!\"Well... what did you expect? If PayPal just wanted a cheap, reliable, censorship-resistant way of allowing their customer to transfer economic value, they would have implemented... Lightning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Knight Hider",
      "created_time": "August 08, 2023, 03:35:15 PM",
      "body": "Quote from: fillippone on August 08, 2023, 03:11:23 PMApparently, in PayPal USD the issuer can enter an “asset protection mode” and “block” and “seize” assets.In addition to that it can raise the max issued limit without any problems.Nice try PayPal.QuoteIf PayPal just wanted a cheap, reliable, censorship-resistant way of allowing their customer to transfer economic value, they would have implemented... Lightning. With Lightning they wouldn't be able to control the money, and it would be much more difficult to profit from other people's money.PayPal is not your pal.--Knight Hider",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sayeds56",
      "created_time": "August 08, 2023, 04:23:38 PMLast edit: August 08, 2023, 06:50:00 PM by Sayeds56",
      "body": "Indeed, it is a significant development in the financial and digital payment landscape. Backed entirely by fiat currencies, this stable coin signifies substantial step forward to gain confidence and support of investors. As Paypal holds a prominent position within the  landscape of payment system, its active participation in crypto currencies arena could potentially accelerate the widespread adoption of cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "August 08, 2023, 04:31:00 PM",
      "body": "The big thing is that unlike a lot of other stablecoin issuers PayPal is a single public company that does have a lot of audits, and a lot to loose if they try and scam.They also have KYC for just about everyone who has ever used them. So, although a lot of people who would not want to give their docs to other places already gave it to PP decades ago.Still not going to use it, but I can see it's appeal.As for the ability to block things, other stablecoins do it too so not much different then the others.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Emmanuelex",
      "created_time": "August 08, 2023, 04:37:01 PM",
      "body": "Looking back, the idea of PayPal embracing crypto felt distant. Now, seeing their acceptance and even launching their own, it's a positive shift. With current developments, it seems the market is gearing up for a bullish run. Exciting times ahead!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "August 08, 2023, 05:03:13 PM",
      "body": "I have not used Paypal in my life, and I do not think about using it, frankly, because according to what I note from the experiences of others, Paypal is not at all lenient with regard to cryptocurrencies and its terms of use are not available to everyone. In this same vision, I would like to ask the question, why did Paypal take this step and how can users benefit from it? As far as I know, Paypal does not care much about the privacy of users, and it is not one of its priorities to enter the cryptocurrencies market. Also, the question comes to my mind, why did they chose the erc20 option on Ethereum, and will this currency be traded on cryptocurrency platforms, or will it be a private currency? We know very well that Paypal can track the sources of deposits, and we do not know if it will accept deposits from trading platforms directly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "August 08, 2023, 05:07:31 PM",
      "body": "Quote from: fillippone on August 08, 2023, 03:11:23 PMTwitter is mad at the following:Apparently, in PayPal USD the issuer can enter an “asset protection mode” and “block” and “seize” assets.In addition to that it can raise the max issued limit without any problems.A lot of criticism about these features: “Bitcoin has fixed max issuance”, “Not your Keys, not your coins\", \"transaction censorship!\" \"Central issuer attack vector!\"Well... what did you expect? If PayPal just wanted a cheap, reliable, censorship-resistant way of allowing their customer to transfer economic value, they would have implemented... Lightning. It's PayPal, almost everyone is using this service and they also entrust their dollar to Paypal, what difference doesn't it make if they block someone's address? They are known to be very strict right from day one, any human complaining about this now is stupid, this is a stablecoin anyway, not a new type of Bitcoin.The biggest stablecoins in crypto are all centralized stable coins and people still use them, USDT freezes addresses too, so I am going to support this stable coin from Paypal, I don't see any difference between this and others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "August 08, 2023, 05:19:04 PM",
      "body": "Quote from: KiaKia on August 08, 2023, 05:07:31 PMIt's PayPal, almost everyone is using this service and they also entrust their dollar to Paypal, what difference doesn't it make if they block someone's address? They are known to be very strict right from day one, any human complaining about this now is stupid, this is a stablecoin anyway, not a new type of Bitcoin.I believe the current smart contract is much harsh because it will burn the frozen asset which means it’s not recoverable while frozen paypal account can be recover by followinf the help center resolution. Owning the pyUSD especially those whale will need to think twice because Paypal can freeze their assets and burns it. I'm not sure how will Paypal deal with recovery on burn tokens but it's worst if the owner doesn't recover it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "August 08, 2023, 08:36:59 PM",
      "body": "Quote from: fillippone on August 08, 2023, 03:11:23 PMTwitter is mad at the following:Apparently, in PayPal USD the issuer can enter an “asset protection mode” and “block” and “seize” assets.In addition to that it can raise the max issued limit without any problems.A lot of criticism about these features: “Bitcoin has fixed max issuance”, “Not your Keys, not your coins\", \"transaction censorship!\" \"Central issuer attack vector!\"Well... what did you expect? If PayPal just wanted a cheap, reliable, censorship-resistant way of allowing their customer to transfer economic value, they would have implemented... Lightning. Well, you do realize that PayPal is a fully \"official\" payment system, plus a high-tech one, and is obliged to comply with ALL legislation. Including the possibility of blocking assets, as it is now with accounts and accounts in the system. There is an assumption - that in this stablecoin will be realized some mechanisms from the CDBC concept. What is this about ? It means that in all CDBC implementations there is a mechanism of total control and CENTRALIZED MANAGEMENT of accounts. I.e. if a \"complaint\" comes in, the wallet/transaction, as if \"decentralized\", will be suddenly blocked.  This is not some \"hidden mechanism\", it is a requirement of regulators and legal framework, realized in the form of blockchain technology.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "August 08, 2023, 09:26:46 PM",
      "body": "Quote from: stompix on August 07, 2023, 06:13:06 PMbut leave it to Paypal to screw up even the basics, they have a huge advantage in userbase and real-world application but this whole thing could easily fail to gain momentum.I'd just like to say Paypal sucks ass and fuck them up & down and all around.  If they fall flat on their face with this, I hope it hurts them financially, and particularly the executive officers.  Oh, and whoever they hired in their customer service department, because that bunch of clowns should be fired ASAP.But wow, I do see the similarities between this and Libra, but was Libra supposed to be an ERC-20 token or its own coin and blockchain?  I don't remember and honestly don't care, because they can go eat a D as well.  If Paypal says they're going to integrate crypto payments into their system (aside from their own stablecoin), that's when the bright red warning flags start popping up.  Anyone using bitcoin, doge, ltc, whatever through Paypal is going to have all of their transactions tracked for infinity.  To say Paypal is in bed with the US government would be an understatement.  More apt would be to say that they have the wildest bedroom kinks and crank out sex tapes on a constant basis.Thanks for posting this, OP.  I'd be in a crypto news black hole if it weren't for this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}