{
  "id": "topic_5456752",
  "title": "---X---",
  "author": "---X---",
  "created_time": "June 18, 2023, 01:43:36 PM",
  "content": "I created my token and launched it on launchpad, but I don't have money for advertising am I doomed to failure?I'm trying everything Twiiter, Tiktok, Kwaii and telegran. I'm even calling people in private and that way I got 20 dollars so far...Do you have any tips or is it better to just give up and let it go?Thanks in advance for the help#PilpiCoinToTheMoon lol",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456752",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "June 18, 2023, 01:57:03 PM",
      "body": "If you don't have the knowledge to promote your own project then try to learn SEO on-page or off-page SEO its free traffic comes from the SERP.Actually, without money you can't get more exposure you will need to hire experts or a campaign manager to promote your project.And honestly, what I see from your token it is a churn and burn or meme token that usually dies fast.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "---X---",
      "created_time": "June 18, 2023, 02:06:47 PM",
      "body": "Quote from: BitMaxz on June 18, 2023, 01:57:03 PMIf you don't have the knowledge to promote your own project then try to learn SEO on-page or off-page SEO its free traffic comes from the SERP.Actually, without money you can't get more exposure you will need to hire experts or a campaign manager to promote your project.And honestly, what I see from your token it is a churn and burn or meme token that usually dies fast.hey thanks for commenting, and yes it's a meme coin lol it's no secret. Is it just another memecoin like the majority of the market, does it intend to help the animal cause? he has! But this is not related to the technology itself, I have no intention of creating the next ETH. Honestly, I just wanted to see if someone without a lot of free time, without resources and without being famous could build something in the crypto market or if it really has become a game of marked cards and only with a lot of money to make the project work. And don't say that it's because there's nothing new in token technology that's going to fail. Day in and day out there's also one of those that becomes hype.Anyway, I appreciate your comment and thanks for the help friend I will research about SEO that you told me!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "June 19, 2023, 06:29:51 AM",
      "body": "Quote from: ---X--- on June 18, 2023, 02:06:47 PMhey thanks for commenting, and yes it's a meme coin lol it's no secret. Is it just another memecoin like the majority of the market, does it intend to help the animal cause? he has! But this is not related to the technology itself, I have no intention of creating the next ETH. Honestly, I just wanted to see if someone without a lot of free time, without resources and without being famous could build something in the crypto market or if it really has become a game of marked cards and only with a lot of money to make the project work. And don't say that it's because there's nothing new in token technology that's going to fail. Day in and day out there's also one of those that becomes hype.Anyway, I appreciate your comment and thanks for the help friend I will research about SEO that you told me!Making your own crypto coin is actually really easy afaik, literally anyone with the tech how and probably a bit of time can make one. To sell it though is another thing. You'd have to burn a hole in your funds,  a big one at that, to even see a bit of marketing be effective. And that effectiveness isn't even guaranteed to return whatever you spend. But hey, if your meme coin manages to become a big thing due to some external factor, then funds aren't an issue. The internet will 100% solve that issue for you since they'd do it for free.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "June 19, 2023, 08:47:27 AM",
      "body": "Quote from: ---X--- on June 18, 2023, 02:06:47 PMhey thanks for commenting, and yes it's a meme coin lol it's no secret. Is it just another memecoin like the majority of the market, does it intend to help the animal cause? he has! But this is not related to the technology itself, I have no intention of creating the next ETH. Honestly, I just wanted to see if someone without a lot of free time, without resources and without being famous could build something in the crypto market or if it really has become a game of marked cards and only with a lot of money to make the project work. And don't say that it's because there's nothing new in token technology that's going to fail. Day in and day out there's also one of those that becomes hype.Anyway, I appreciate your comment and thanks for the help friend I will research about SEO that you told me!Oh man. So you spent 5 minutes in the code (because that's enough to make a meme coin) and you would like us to help you sell it to investors?? You know that falls under the definition of fraud/stealing or at least exploiting the mentally ill? (you create something with zero value, not planning to add value in the future - with new use cases- and want to sell it) You don't have to be rich/elite to make money in crypto. Create something that everyone wants to use. a tool that peopel need. And then people will start using it and you can think about monetization. However, if you want to make a new scam coin \"AKA meme coin\" then don't count on our help.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kizlod",
      "created_time": "June 19, 2023, 09:01:12 AM",
      "body": "Bro, promoting things is really hard, especially if your token doesn't have real use. You need a lot of money, or to be a marketing genius.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "June 19, 2023, 10:09:05 AM",
      "body": "Promoting, Marketing, Offering, etc... It sucks to be in that position especially if you are on your own. That is why project owners do hire people who will focus on this department. This ain't the last 5 years ago when many investors would waste their money on anything just for kicks or to play with the market and boost their investments more. There are too many created meme coins now, the question \"What makes you think yours is that special?\" should pop out. Because you cannot rely on just willpower to reach certain heights like \"There are projects who just used the hype.\" I don't think that is still how it works now unless you have that popular guy as your brother or father.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "June 19, 2023, 10:41:03 AM",
      "body": "Quote from: ---X--- on June 18, 2023, 01:43:36 PMI created my token and launched it on launchpad, but I don't have money for advertising am I doomed to failure?...And what did you expect when you made your cryptocurrency? Or did you think that investors would be queuing up to buy a coin made by no one knows who and intended for no one knows what? Obviously, everyone dreamed of releasing their own cryptocurrency, now your dream has come true and your experience will become more about how the cryptocurrency market works.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "---X---",
      "created_time": "June 19, 2023, 11:28:12 AM",
      "body": "Well obviously I was too excited about creating the token hahahah thanks to all of you for your comments and help, I'll take you all into account if I ever try to do something again. At the end of it all, I'm going to throw the tokens into a bunch of random wallets so they don't just have me. Thanks again for your contribution and I didn't take anything personally, but as a learning experience. Have a good week",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "June 19, 2023, 02:59:20 PM",
      "body": "Quote from: ---X--- on June 18, 2023, 01:43:36 PMI created my token and launched it on launchpad, but I don't have money for advertising am I doomed to failure?I'm trying everything Twiiter, Tiktok, Kwaii and telegran. I'm even calling people in private and that way I got 20 dollars so far...Do you have any tips or is it better to just give up and let it go?It's bot about the fact that people are not helping you, what are the feasibility that your project has that can serve as a center of focus to attract people to join or clip up with you and advanced the project, tou have the idea they've got the fun, you all need to understand each other very well, make an agreement and have a means of making your project more presentable by giving it a well package and make the goals realistic, change the channels or means which you are looking for to get funding a d give it a new approach and see what comes in next right of the repackaging.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "---X---",
      "created_time": "June 19, 2023, 03:57:24 PM",
      "body": "Quote from: Doan9269 on June 19, 2023, 02:59:20 PMQuote from: ---X--- on June 18, 2023, 01:43:36 PMI created my token and launched it on launchpad, but I don't have money for advertising am I doomed to failure?I'm trying everything Twiiter, Tiktok, Kwaii and telegran. I'm even calling people in private and that way I got 20 dollars so far...Do you have any tips or is it better to just give up and let it go?It's bot about the fact that people are not helping you, what are the feasibility that your project has that can serve as a center of focus to attract people to join or clip up with you and advanced the project, tou have the idea they've got the fun, you all need to understand each other very well, make an agreement and have a means of making your project more presentable by giving it a well package and make the goals realistic, change the channels or means which you are looking for to get funding a d give it a new approach and see what comes in next right of the repackaging. ok i will do it buddy! I still have the telegram channel to try. But your tip is great",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "June 19, 2023, 04:01:38 PM",
      "body": "Quote from: ---X--- on June 18, 2023, 01:43:36 PMI created my token and launched it on launchpad, but I don't have money for advertising am I doomed to failure?I'm trying everything Twiiter, Tiktok, Kwaii and telegran. I'm even calling people in private and that way I got 20 dollars so far...Do you have any tips or is it better to just give up and let it go?Thanks in advance for the help#PilpiCoinToTheMoon lol  Yes, Most likely your token will failed because the competition on shitcoins is very tough. Advertisement is everything on shitcoin industry. You should hire influencers and active shillers if you want to gather investors around your token since no one will trust you if you don’t have anything while influencers can sell shit tokens with their follower since their opinion serves as financial advice.Just let it go if you don’t have enough funds to continue the promotion. It’s a waste of time. Tons of shit tokens being mint every seconds that same as you, day are dreaming for their token to pump.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mdzahed134",
      "created_time": "June 19, 2023, 04:53:04 PM",
      "body": "Quote from: Beparanf on June 19, 2023, 04:01:38 PMQuote from: ---X--- on June 18, 2023, 01:43:36 PMI created my token and launched it on launchpad, but I don't have money for advertising am I doomed to failure?I'm trying everything Twiiter, Tiktok, Kwaii and telegran. I'm even calling people in private and that way I got 20 dollars so far...Do you have any tips or is it better to just give up and let it go?Thanks in advance for the help#PilpiCoinToTheMoon lol  Just let it go if you don’t have enough funds to continue the promotion. It’s a waste of time. Tons of shit tokens being mint every seconds that same as you, day are dreaming for their token to pump.I agree with you, to create a token it’s not a big deal, i think it’s very easy to mint a new token just watching a tutorial in YouTube ha ha, i see a lot of such videos right now. Whatever, yeah there are no value without promotion for a new project, and i think to launch a new project, must be needed a big amount of money to promote i otherwise it will be worthless.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "---X---",
      "created_time": "June 19, 2023, 06:35:51 PM",
      "body": "Quote from: mdzahed134 on June 19, 2023, 04:53:04 PMQuote from: Beparanf on June 19, 2023, 04:01:38 PMQuote from: ---X--- on June 18, 2023, 01:43:36 PMI created my token and launched it on launchpad, but I don't have money for advertising am I doomed to failure?I'm trying everything Twiiter, Tiktok, Kwaii and telegran. I'm even calling people in private and that way I got 20 dollars so far...Do you have any tips or is it better to just give up and let it go?Thanks in advance for the help#PilpiCoinToTheMoon lol  Just let it go if you don’t have enough funds to continue the promotion. It’s a waste of time. Tons of shit tokens being mint every seconds that same as you, day are dreaming for their token to pump.I agree with you, to create a token it’s not a big deal, i think it’s very easy to mint a new token just watching a tutorial in YouTube ha ha, i see a lot of such videos right now. Whatever, yeah there are no value without promotion for a new project, and i think to launch a new project, must be needed a big amount of money to promote i otherwise it will be worthless.Yes, that's right. I'm surprised that I had 4 orders totaling 21 dollars in the presale hahaha anyway I'll keep trying until the fifth day when the presale ends and the tokens will go back to their owners for not reaching the goal. If I get anything other than failure I'll let you know lol",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeffBrad12",
      "created_time": "June 19, 2023, 11:04:35 PM",
      "body": "Quote from: kizlod on June 19, 2023, 09:01:12 AMBro, promoting things is really hard, especially if your token doesn't have real use. You need a lot of money, or to be a marketing genius. I mean why even someone promotes their coin in the first place if it doesn't have use, it's like just telling people to give their money to the coin deployed and that doesn'treally seem like a good gesture honestly.also there are reasons why some meme coins always have some similar names, because they knew their coin have no use whatsoever and yet they still want it to be popular.so the naming definitely become their strategy to promote their coin without the need of spending massive amount of money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "June 19, 2023, 11:11:25 PM",
      "body": "I'm sure you will leave your project when you are already making a profit, especially if the results you get don't match your expectations, many people can make tokens by hiring developers and also advertising, but only a few are really serious and have good planning, and the tokens it creates have use case so they survive but of the many meme-coin projects it's clear it's just to get money fast and leave the project just like that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "June 19, 2023, 11:25:40 PM",
      "body": "Quote from: ---X--- on June 18, 2023, 01:43:36 PMI created my token and launched it on launchpad, but I don't have money for advertising am I doomed to failure?If it's a shitcoin yes your project is doomed to failure, shitcoins thrive on massive marketing and shilling if you don't have money for marketing don't add another shit token in the communityQuoteI'm trying everything Twiiter, Tiktok, Kwaii and telegran. I'm even calling people in private and that way I got 20 dollars so far...Do you have any tips or is it better to just give up and let it go?Just let it go, these people who you contact find your project a shit coin if it's an interesting project they would have poured their support and will market it for free and invest in itQuoteThanks in advance for the helpIf you are not going to continue then we'll thank you for doing that, we don't need shitcoins anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "---X---",
      "created_time": "June 19, 2023, 11:53:26 PM",
      "body": "Quote from: coin-investor on June 19, 2023, 11:25:40 PMQuote from: ---X--- on June 18, 2023, 01:43:36 PMI created my token and launched it on launchpad, but I don't have money for advertising am I doomed to failure?If it's a shitcoin yes your project is doomed to failure, shitcoins thrive on massive marketing and shilling if you don't have money for marketing don't add another shit token in the communityQuoteI'm trying everything Twiiter, Tiktok, Kwaii and telegran. I'm even calling people in private and that way I got 20 dollars so far...Do you have any tips or is it better to just give up and let it go?Just let it go, these people who you contact find your project a shit coin if it's an interesting project they would have poured their support and will market it for free and invest in itQuoteThanks in advance for the helpIf you are not going to continue then we'll thank you for doing that, we don't need shitcoins anymore.Unfortunately for me I'm the least of your shitcoin problems ahhaha",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "---X---",
      "created_time": "June 20, 2023, 12:00:56 AM",
      "body": "Quote from: Strongkored on June 19, 2023, 11:11:25 PMI'm sure you will leave your project when you are already making a profit, especially if the results you get don't match your expectations, many people can make tokens by hiring developers and also advertising, but only a few are really serious and have good planning, and the tokens it creates have use case so they survive but of the many meme-coin projects it's clear it's just to get money fast and leave the project just like that.It's not the intention, I'd like to see something created kkk but words on a blog I must admit are not enough to prove it kkk but fear your honesty for your character don't apply it to people you don't know. I'm fine asking for advice if I was a fdp I'd have better ways to do this",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "June 20, 2023, 03:16:47 AM",
      "body": "The point is to make your token's visibility increase in the target market, regardless you hire a socialite or an ordinary person. The more famous they are, the more they charge you.I wasn't sure about this suggestion before looking at your coin details, but for years this forum has millions of members ready to be paid even with tokens that aren't worth anything. You can check some marketing techniques here. It will be more economical if you can manage it yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}