{
  "id": "topic_5448245",
  "title": "Question:",
  "author": "BitAnaBit",
  "created_time": "April 10, 2023, 10:45:34 AMLast edit: April 11, 2023, 11:29:57 AM by BitAnaBit",
  "content": "Attention all blockchain casino enthusiasts! CasinosBlockchain is passionate about online casinos, cryptocurrencies, and blockchain technology. We aim to change the reductive mindset that views crypto casinos as a niche market. Our mission is to guide prospective crypto gamblers in their online journey by providing in-depth reviews of trusted casinos and calling attention to the shortcomings of others.We want to hear from you! As part of the CasinosBlockchain Awards 2023, we are conducting a poll to find out which crypto casino is the most popular in our community. So, if you have a favorite crypto casino that you love to play at, make sure to cast your vote in our poll. Your opinion matters to us, and the results of the poll will be shared with everyone in the community. To know more about CasinosBlockchain Awards 2023, feel free to visit https://casinosblockchain.io/blockchain-casino-awards-2023-criteria/Don't miss out on this opportunity to have your voice heard and to help decide which blockchain casino will be crowned the winner of the CasinosBlockchain Awards 2023. Cast your vote today, and let us know what your favorite blockchain casino is!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448245",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "April 10, 2023, 11:02:56 AM",
      "body": "I will choose Stake instead. Why not add more casinos that we have on the gambling site on this forum? You should know that blockchain casinos should be said to be decentralized casinos, but the ones you mentioned are centralized casinos. That only means that they are not blockchain casinos but you can call them crypto casinos because they offer crypto deposit and withdraw.If Livecasino is among, I would have chose it, not because that I am wearing their signature, but because I am using it and it is quite excellent to use and they process withdraw as fast as possible. It is a very good casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sashapan",
      "created_time": "April 10, 2023, 11:18:24 AM",
      "body": "",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "April 10, 2023, 11:43:39 AM",
      "body": "Apart from being a participant in signing the Stake campaign, of course I chose Stake over the several options above, bc games are also good sometimes I just play a few times too but for casinos and sports betting the best is Stake , if you don't agree you should visit Stake and try playing there, btw add another casino because there are many big and well-known casinos on this forum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "April 10, 2023, 12:34:09 PM",
      "body": "With a huge user base, sponsorships and the best choice of VIPs, and of course wide reach marketing Stake is a runaway winner, but the number of casinos listed here is very limited you should include as many casinos, As all those casinos listed are not really blockchain-based they are all centralized so that means all casinos here that are centralized can be included but you should expand to at least ten casinos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "April 10, 2023, 01:20:25 PM",
      "body": "Quote from: Oshosondy on April 10, 2023, 11:02:56 AMI will choose Stake instead. Why not add more casinos that we have on the gambling site on this forum? You should know that blockchain casinos should be said to be decentralized casinos, but the ones you mentioned are centralized casinos. That only means that they are not blockchain casinos but you can call them crypto casinos because they offer crypto deposit and withdraw.It seems OP didn't understand the concept of blockchain-based casinos I agree with you that these casinos are not blockchain-based casinos he should change the title and take out the word blockchain and just use the word Crypto casinos, I also recommend that he include other casinos because between all the casinos listed in the poll, for obvious reason Stake will be the runaway winner put the other top casinos for competitive voting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "April 10, 2023, 01:33:11 PM",
      "body": "Stake will probably win from the options in the poll. I would have also liked a more comprehensive list of popular crypto gambling platforms from the forum but Stake would still win most likely if the serious gamblers would take time to vote.Last year's poll did not attract too much attention as only 33 members voted with Betfury winning. What made you decide to exclude them and third placer Roobet this time? Is there a particular reason or you just don't remember them?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "April 10, 2023, 01:36:25 PM",
      "body": "What is JustBit? this is the first time I heard this casino.If you only compare these 5 casinos, obviously Stake will win, too easy lol.You need to add other casinos in this forum especially the casinos which have active signature campaign because it's a way to make other people know the existence of the casino we're promoting and most of them are big casinos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "April 10, 2023, 01:42:32 PM",
      "body": "Quote from: Plaguedeath on April 10, 2023, 01:36:25 PMWhat is JustBit? this is the first time I heard this casino.If you only compare these 5 casinos, obviously Stake will win, too easy lol.You need to add other casinos in this forum especially the casinos which have active signature campaign because it's a way to make other people know the existence of the casino we're promoting and most of them are big casinos.I too have never heard of JustBit casino before, this is the first time I am hearing about this casino and there are many other casinos that are on this forum which are the ones that are most common to us, we use them and they are good.I am wondering why Flush, Livecasino, Rollbit, Duelbit and many other casinos that we know are not on the poll so that we can have a fun voting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "April 10, 2023, 01:48:49 PM",
      "body": "Where would this be posted? I'm curious as to why I just have heard of the Casinos Blockchain awards. It would be fun to see the event itself so that our votes here would be somewhat relevant. I think the majority here knows only of Stake and not the other casinos in the poll.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "April 10, 2023, 02:33:28 PM",
      "body": "I gave my vote to Stake. I agree with @Oshosondy's suggestion to add other reputable casinos to this forum. You can add LiveCasino, Duelbits, BitCasino, Roolbit, Roobet and more.BC.games is also good and can be an option but I still choose Stake. Uh, but you mentioned blockchain casinos. Does that mean casinos that don't have KYC or are decentralized? But it is better to make a list of casinos in this forum so that the choices are many and we can all choose our favourite casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "April 10, 2023, 02:37:05 PM",
      "body": "Quote from: BitAnaBit on April 10, 2023, 10:45:34 AMAttention all blockchain casino enthusiasts! We want to hear from you! As part of the CasinosBlockchain Awards 2023, we are conducting a poll to find out which blockchain casino is the most popular in our community. So, if you have a favorite blockchain casino that you love to play at, make sure to cast your vote in our poll. Your opinion matters to us, and the results of the poll will be shared with everyone in the community. Don't miss out on this opportunity to have your voice heard and to help decide which blockchain casino will be crowned the winner of the CasinosBlockchain Awards 2023. Cast your vote today, and let us know what your favorite blockchain casino is!OP I do welcome and commend your efforts to recognizing blockchain casinos and not only that, also seeing this platform to casting a vote to choose and comment on their best casinos for the awards. It is a welcome development mate.  This would call for more competition amongst the casinos to deliver good Services to their participants. And for those already up to standard and doing good,  they would receive some accolades for their good Services.If I may ask you OP, before you come up with this I believe there must have been some delebration on this award and the recipients of the awards. So what are the set criteria for choosing the listed names for the awards you mentioned above because for sure as you have asked participants to send in their list or names of casinos they would do that and possibly some if the casino might not meet up with the criteria for standing up for the contest. So what are the measures, procedures and modalities you used in choosing the eligible casinos for the contest and if possible I would suggest you edit your post and state it so we could see them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "April 10, 2023, 02:50:34 PM",
      "body": "The list is very limited and my favorite online casinos are not available, the only one I have used before was Stake.com and that will be my number 1 pick on your list, there are others I prefer over Stake.com but since they are not on your list I have to go for Stake. I have never used the other casinos on your list. Here are others like Roobet, Rollbit, and Duelbit, they are wonderful online gambling platforms.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "benalexis12",
      "created_time": "April 10, 2023, 03:49:16 PM",
      "body": "For my stakes.com is the choice because this gambling platform has been tested and it has already built a lot of community here in the cryptocurrency industry. Also, those who play here on this platform are not just random, they really have funds.In addition to that, it has been in the crypo space for several years and it has been proven and tested and I have never heard of it having an issue that was not resolved because its support can accommodate well, but it is rare that it has an issue and usually As far as I know, the complainants are the ones who humiliated him in the end.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "April 10, 2023, 03:51:25 PM",
      "body": "Quote from: KiaKia on April 10, 2023, 02:50:34 PMThe list is very limited and my favorite online casinos are not available, the only one I have used before was Stake.com and that will be my number 1 pick on your list, there are others I prefer over Stake.com but since they are not on your list I have to go for Stake. I have never used the other casinos on your list. Here are others like Roobet, Rollbit, and Duelbit, they are wonderful online gambling platforms. The OP should add more in his list. As the choices are very limited, it is understandable that all voters will select for Stake.If he wants a more general opinion of the forum users, at least put up all popular casinos found in this forum.Hope the OP will rectify the list as soon as he can. Such list is very short to get the over-all sentiments of forum gamblers.Also, he may not get the actual answer based on what is really good for a blockchain casino as voters may have the possibility to select the casino they are promoting here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "April 10, 2023, 04:11:22 PM",
      "body": "The list is just too few, there are semi-popular casinos but one might just prefer playing on it than to another. Who organizes this Casinos Blockchain Awards 2023 and will they really give awards to casinos?  What awards would temp them to go out from their man caves? I'm curious if the owners will actually come forward and reveal themselves to the public.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "April 10, 2023, 04:24:54 PM",
      "body": "Op you have not made strong competition for stake as you can see everyone who has got to make a choice have done that, making a giveaway for stakes. Some of the names are not known while stake have been here along time and have had big players like drake. It is not a very robust list for bettors to choose from, there are reputable names in the forum apart from those mentioned example there is FortuneJack, flush.. Are there criteria you used to make your selection? And there financial value attached to the award?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahdirakib",
      "created_time": "April 10, 2023, 04:28:09 PMLast edit: April 10, 2023, 04:41:58 PM by Mahdirakib",
      "body": "@BitAnaBit, Why have you added 5 casinos in the poll while there are almost 40 casinos listed on your website? You organised similar type of poll in the previous year and the poll had more than 30 casinos: Blockchain Casinos - Consumer's Choice! (2022)Although you had added other popular casinos by getting suggestions from the forum members. I hope you will update the poll shortly by adding all popular crypto casino. Anyway, I have voted for Stake.com, I would do the same even if there were more casinos in the poll.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BobK71",
      "created_time": "April 10, 2023, 05:11:46 PM",
      "body": "Stake will be the foremost among the mentioned sites. Because those who know about Stake may not choose any other platform. But for a reliable survey some more platforms should have been included. Many have mentioned that there are several other casino names out of the list. If they were included, there would be an evaluation of the voting system. There are currently no votes in any casino except stake.com, I believe that stake.com will always be ahead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "April 10, 2023, 06:09:48 PM",
      "body": "Quote from: Oshosondy on April 10, 2023, 11:02:56 AMI will choose Stake instead. Why not add more casinos that we have on the gambling site on this forum? Yes, ops have limited numbers of popular casinos in here only stake.com is the only noticeable forum casino we can notice on the list, back to the question to the ops on a number pf things we may need clarity on and below are the questions bordering my mind after reading through this thread.1: what website does he represent and what are the award categories?2: what are the prizes that the casino with the most rate will get?3: can ops share some more information so about the platform he represents with a link?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}