{
  "id": "topic_5459800",
  "title": "mineshop.eu",
  "author": "mineshop.eu",
  "created_time": "July 14, 2023, 12:00:54 PM",
  "content": "When it comes to Bitcoin mining, the choice of equipment can be crucial for profitability. ASIC miners, in particular, have risen to prominence in the Bitcoin mining industry due to their superior power efficiency and hashing capabilities compared to other types of mining hardware. In 2023, various ASIC miners compete for attention in the market. However, the selection process can be complicated, considering energy costs, miner prices, and efficiency ratings.In this blog post, we are going to analyze four major Bitcoin ASIC miners available on the market:Bitmain Antminer S19 XP 141 TH/sBitcoin Miner S19J Pro 122TWhatsminer M50 120THBitmain Antminer S19 90 TH/sBitmain Antminer S19 XP 141 TH/sThe Bitmain Antminer S19 XP is a cutting-edge miner with a hash rate of 141 TH/s. Its high hash rate makes it a power horse for Bitcoin mining, suitable for miners looking to generate a significant return, power usage is 3000watts. However, it also means that efficient machines will be most expensive per th/s, hence more considerable operational expenses in terms of energy costs. This could protentional increase your ROI time.The key to assessing its value is to weigh the initial acquisition cost against its efficiency (watt per TH/s) and your local electricity rates. If you have access to cheaper electricity, this miner high cost could increase your (ROI time).Bitcoin Miner S19J Pro 122TThe Bitcoin Miner S19J Pro 122T is another powerful ASIC miner from the Bitmain line. Despite its slightly lower hash rate of 122 TH/s compared to the S19 XP, it shines with its energy efficiency. This balance of power and efficiency can provide a better ROI for miners with higher electricity costs.Whatsminer M50 120THWhatsminer has been known for producing reliable and efficient ASIC miners, and the M50 is no exception. With a hash rate of 120TH/s, it offers a similar performance level to the S19J Pro. However, its exact efficiency will depend on specific power usage, which might vary. It’s a solid choice for both cheap and moderately priced electricity scenarios.Bitmain Antminer S19 90 TH/sThe Bitmain Antminer S19 90 TH/s, while offering the lowest hash rate among these miners, stands out for its cost-effectiveness. It’s a reasonable choice for those with lower electricity costs or beginners who are just starting their mining journey. However, its lower performance might require a longer timeframe to reach a positive ROI compared to the higher-end models. If your electric price is close to “ZERO” , this might be the machine of your choice as it has the cheapest price per th/s and could protentional be the fastest ROI. ConclusionChoosing the right Bitcoin ASIC miner depends largely on your specific circumstances, particularly your electricity cost. If your electricity price is low, you could opt for a miner with the best price per TH/s, like the Bitmain Antminer S19 90ths, for the fastest ROI.If your electricity is expensive, a more efficient miner balancing watt per TH/s and price per TH/s, like the Bitcoin Miner S19J Pro 122T or s19 XP, might be the better option. Nonetheless, careful consideration of each miner’s capabilities, cost, and efficiency will help optimize your Bitcoin mining endeavor in 2023 and beyond.Keep in mind this post is done on 14.07.2023 , crypto market changes very quickly and by the time you see this miner prices and profitability can change which could potentially affect your ROI.full postWEBSITE | INSTAGRAM | TELEGRAM | TWITTER | YOUTUBE",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459800",
  "comments": [
    {
      "author": "paid2",
      "created_time": "July 15, 2023, 11:32:36 AM",
      "body": "I'm in Europe, and I thought, \"Great!  I'll be able to avoid some taxes!\"So I took a look at your reputation. As a result, I'm thinking of keeping my Shenzhen contacts for ordering ASICs, and paying taxes instead, which seems less risky to me.With this kind of reputation, and prices that I find very high, I'd rather pass.Examples of feedbacks related to your shop : Quote from: christophfen on December 25, 2017, 01:35:57 PMComprehensive MineShop Review:TransactionHardwareThe rig comes pre-installed with ethos which I erased and installed Ubuntu instead as I am more familiar with that distro. The rig that arrived was different to the specs I had ordered on the website, I ordered 6 MSI 470's 120GB 8GB fury ram. What arrived was 6 MSI 580s 16GB SSD and 4GB of cheap ram. I have no issue with this really as I will be mining Electroneum mainly  but should I want to change my mind and mine Ethereum instead I would have to upgrade the SSD to allow for the huge DAG file Ethereum has. I would say that the hardware may have been used for mining prior to being sent. The rigs come with wooden supports under the motherboard which is to stop the board shorting on the metal frame, they're unpainted so are very contrasting to the rest of the rig. My rig has been working without issue for about a week, so the hardware they sent to me is in good working order.SupportI tried to contact MineShop to confirm the different specs (to see if they had made a mistake) but they did not seem to understand my questions at all, either by being intentionally dismissive or by not understanding, the owners seem to be from eastern Europe but based in Ireland. ReputationI reviewed on Cryptocompare as well but it seem that the reviews there are mostly fake, If you look at the style of writing it is very similar to what is posted on the Facebook page and also multiple reviews have the same writing style. They have suggested that the bad feedback may be due to sites being setup similar to theirs to scam potential customers. From my opinion it seems like disgruntled customers who did not get a response in a reasonable time frame.Conclusion:I would not recommend using MineShop if you can build the rig yourself, the biggest let down in my opinion is the lack of support (order wise and any questions about the hardware you have been sent). Customer service is key, especially when ordering online and when the order value is significant. Quote from: sageandonions on February 08, 2018, 11:00:39 PMBad experience with this guy , uses cheap parts and offers no warranty whatsoever , also mines the rigs for several weeks before putting up for sale as brand new . Ignorant and difficult to deal with . Stay away from mineshop.eu    Will charge you for all postage costs and repair even if rig becomes faulty after a few weeks . you have been warnedQuote from: RelaxedCrypto on May 02, 2022, 07:30:05 PMThey are selling FAKE delta fans , 5 fans failed just after one month of use . If you would have to RMA your product you will pay for return shipping cost. It's one man operation shop I would avoid .... ( and I'm experienced miner) have over 50 delta fans which are running for almost 2 years bought from different shop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mineshop.eu",
      "created_time": "July 28, 2023, 01:59:50 PM",
      "body": "Quote from: iwantmyhomepaidwithbtc2 on July 15, 2023, 11:32:36 AMI'm in Europe, and I thought, \"Great!  I'll be able to avoid some taxes!\"So I took a look at your reputation. As a result, I'm thinking of keeping my Shenzhen contacts for ordering ASICs, and paying taxes instead, which seems less risky to me.With this kind of reputation, and prices that I find very high, I'd rather pass.Examples of feedbacks related to your shop : Quote from: christophfen on December 25, 2017, 01:35:57 PMComprehensive MineShop Review:Quote from: RelaxedCrypto on May 02, 2022, 07:30:05 PMThey are selling FAKE delta fans , 5 fans failed just after one month of use . If you would have to RMA your product you will pay for return shipping cost. It's one man operation shop I would avoid .... ( and I'm experienced miner) have over 50 delta fans which are running for almost 2 years bought from different shop.Thank you for taking the time to express your concerns and share the feedback from other users. Transparency and trust are essential in our industry.Tax: While we try to provide solutions that might be beneficial tax-wise, we always advocate for following local regulations. If you're more comfortable ordering ASICs from your Shenzhen contacts and paying the necessary taxes, that's entirely your choice.Reputation: We acknowledge that reputation is vital. While I won't discount the experience of others, it's worth noting that every business will have a mix of positive and negative reviews. We are continuously working to improve our services and to address any concerns raised by our customers.Feedback from christophfen: It's regrettable that the hardware differed from what was ordered. We strive for accuracy in all our shipments. We take this feedback seriously and will be working to ensure such discrepancies do not occur in the future. Additionally, while our rigs are tested before being shipped to ensure they are functional, we do not use them for mining purposes. The difference in specs might have been due to an inventory mismatch, and we apologize for the inconvenience caused.We value all feedback as it helps us refine our services. If you have any further concerns or questions, or if you'd like more details about any aspect of our operations, please feel free to ask.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}