{
  "id": "topic_5404618",
  "title": "Lilacthrow123",
  "author": "Lilacthrow123",
  "created_time": "June 30, 2022, 09:27:20 AM",
  "content": "I’ve attached screenshots below showing proof of wins, bonus being cleared, etc. Please read So starting from the beginning. I’m a vip member at rocketpot and they give me a 100% deposit bonus weekly. So I deposited $1500 in Eth and got a $1500 bonus. I lost the real funds and just had bonus funds left. I decided to play book of 99 as it’s a 99% rtp game I ended up losing and being down to my last $140. I decided to play sweet bonanza candy land(game show) bet the bonus games and ended up hitting a 60x for  $4800. Then decided to play book of 99 slot again and ended up winning, getting a balance of 16kish. I decided to play blackjack/game shows and slots to clear the 100x wager requirement. After a long grind, I cleared the wager requirement breaking even and 14-16k was added to my real balance. I immediately requested a cash out  of 7.5k(as there is a 10k weekly limit) and decided to do fruit party bonus buys with the rest. Eventually hit a 53k win off a $2000 buy in fruit party(see screenshots below) Keep in mind this is all real funds at this point as the bonus was cleared. While waiting for withdrawal to be processed I decided to keep playing setting a stop loss of 10-20k as I can only withdraw 10k/week anyways. I ended up running my balance to over 160k usd in etherum. Now rocketpot has declined my withdrawal and telling me they won’t process it with no real explanation besides “dishonest behaviour” with an explanation of “I activated the bonus funds and then collect bonuses or spins in a game directly. Then I go and cancel or lose the bonus funds. After that I go back into the game collect the spins or bonus and have it added to real balance” that’s just complete bs as I never canceled or lost the bonus, I completed the wager requirements for the bonus. Their explanation doesn’t even make any sense as I never did any of the things they said. I got extremely lucky and was able to clear a 100x wager requirement and ended up winning 53k on fruit party legitimately afterwards with real funds. After I explained that I never canceled or lost the bonus funds and ended up clearing it. I was told they are gonna continue to investigate it. As of this moment Im still waiting for a update, but I’m posting this to raise awareness and for people to stay away from rocketpot as I truly believe they are looking for any excuse at this point to not pay out as it’s a large payout. If you guys have any legal course I can take please let me know as I fully intend to take any means necessary against this as this is life changing money for me and I feel I am literally getting robbed. Will continue to post updates on here. Ps I’ve also went over rocketpots terms of service and nothing I did is against there tos https://imgur.com/a/LGb13NR",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404618",
  "comments": [
    {
      "author": "jackg",
      "created_time": "June 30, 2022, 04:01:29 PM",
      "body": "I don't think I've heard of them before and they've not been mentioned on the forum much?How long have they taken so far to investigate your win/withdrawal? When was the win and withdrawal put in?I could imagine it taking a week to a month for something like this to go through but not longer... There's a chance they don't have the money to payout but that's not exactly you're problem because they should have managed/expected that (and means they might be able to pay back smaller amounts over a longer timeframe if so).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "June 30, 2022, 04:34:09 PM",
      "body": "Thats huge. They might not want to pay, Sofia is not even sure what she's saying in the chat. You got extremely lucky with the bonus funds, I got the feeling that the money you win thru the bonus you received wil not be honored. Its time for them to ask your KYC and all sort of stuff. Maybe this threat should be in the Scam accusation forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Joca97",
      "created_time": "June 30, 2022, 04:38:48 PM",
      "body": "Never heard of this site before at all. This is why you dont bet on new sites and that no one has heard off. This are your winnings and because the win is so large maybe they dont have the money to pay you. But in the future try using big sportsbooks that will always pay you no matter how the big win is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noormcs5",
      "created_time": "June 30, 2022, 04:58:02 PMLast edit: June 30, 2022, 05:08:41 PM by noormcs5",
      "body": "You have created two topics for the same issue. One here in the gambling discussion section and the other one Rocketpot.io refusing to pay out 170k win in the gambling section. Also you have posted the same here in the ANN thread for rocket.io.Please do not spam your concern everywhere. Better move one of these threads to the Scam Accusations section as that is the perfect place for this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "June 30, 2022, 08:05:46 PM",
      "body": "You are lucky that they don't implement the support chat privacy terms in which the statement between you and the staff shouldn't be shared or posted on other platforms such as social media and forums or else you could have broken their TOS and may have a ground for your account termination.  Anyway, just follow what the earlier reply stated, file a scam accusation on the link given by noormcs5.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "June 30, 2022, 08:33:55 PM",
      "body": "This is a very huge amount and I don't imagine that any sports betting site or virtual bet is able to pay that amount in the form of profits. It makes sense that they will close the site and give a third of that amount to qualified lawyers to save them from legal proceedings.Actually, the site you mentioned is not known and is never mentioned here on the forum since Bitcointalk represents the largest market of ads for crypto gambling sites in the world.I'm sorry to tell you that you won't get those profits no matter how hard you put efforts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "June 30, 2022, 08:46:36 PM",
      "body": "This is the second time I see op posted the same topic about not getting paid 170k. I suggest you lock the thread in the gambling board and better focus on this one or you can just move this on scam accusation board if they didn't pay you the amount. One is enough already and just wait for them to contact you back if ever they will. If they didn't then I guess they didn't care about their reputation getting bad because of you not getting paid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "June 30, 2022, 08:47:11 PM",
      "body": "It's strange that every minute you do win and never got a single lose. Never heard that much of the casino but something bothers me that they suspect you for a fraud. How long have you been being a VIP? You need to post it on scam accusations board and not here though, the response from the chat support was confusing too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vaskiy",
      "created_time": "June 30, 2022, 09:39:45 PM",
      "body": "That's a big win, which looks to be the fair reason why the particular site doesn't want to pay. OP is really lucky to make a big win, and if he had played in any of the trusted platform now he couldn't have encountered this issue. He might've been requested to submit KYC, and he has a planned withdrawal so that KYC too isn't required. There are chances of the site going bankrupt if they pay the player the winning amount.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zackgeno96",
      "created_time": "June 30, 2022, 09:48:30 PM",
      "body": "These are also serious amounts that are mentioned. I hate to say it but I think you should keep in mind that the site will look for excuses not to pay out the money. Those kinds of stories are not uncommon when players win a lot of money. By the way, it doesn't belong in this thread. I hope the site pays for it but I have bad feelings about it. We'll keep an eye on the thread, I wouldn't be surprised if they come up with an argument that the conditions have been violated. That's my first thought.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "July 01, 2022, 02:15:07 AM",
      "body": "Quote from: jackg on June 30, 2022, 04:01:29 PMI don't think I've heard of them before and they've not been mentioned on the forum much?They have been in this community before,  Rocketpot.io Signature Campaign(CLOSED). But it was 3 years ago, so we really don't know what happen to them, but it seems they are inactive in this community. Their official account is here:  TheRocketman is also not active, which make some of our suspicions that they might respond to the allegations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "July 01, 2022, 06:31:15 AM",
      "body": "Quote from: Kemarit on July 01, 2022, 02:15:07 AMQuote from: jackg on June 30, 2022, 04:01:29 PMI don't think I've heard of them before and they've not been mentioned on the forum much?They have been in this community before,  Rocketpot.io Signature Campaign(CLOSED). But it was 3 years ago, so we really don't know what happen to them, but it seems they are inactive in this community. Their official account is here:  TheRocketman is also not active, which make some of our suspicions that they might respond to the allegations.I was a member of that sig campaign back in 2019 for a week or two and I remember that I created an account there, but the website was really slow and my browser kept crashing. The overall experience wasn't great, but at least they paid me my earnings.Anyway, this sounds like the typical \"I've made a lot of money, but the casino won't give them to me.\" story. I've seen this many times before and rocketpot.io isn't the first casino doing this scam. This is what you get after betting big amounts, using too many bonuses and being extremely lucky. Move this thread to the Scam Accusations forum. Maybe you should call a lawyer, but I don't think that rocketpot.io is ever going to pay you 170K.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cling18",
      "created_time": "July 01, 2022, 07:07:45 AM",
      "body": "It's my first time hearing about the site and to be honest, it's too frustrating if a site won't pay you with such a big amount after you trusted them. As I've seen, there is already negative feedback about the site which has been working for three years. I hope you were aware of it. That's why it's too important to check the reputation of the site first before depositing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gianluca95",
      "created_time": "July 01, 2022, 07:30:44 AM",
      "body": "I haven't heard this site, this is the first time. Why don't you have checked here if this site was present, and also trusted, before to bet? 170k is a big amount, and I think that their bankroll is lower than the bet that you'vewon, that's why they don't want to pay you. Be careful the next time and play only on the site present in this section.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "July 01, 2022, 09:00:48 AM",
      "body": "Eyy fellas! The issue have been resolved and OP have received customer support response that he will be able to withdraw his/her winnings based from his latest update in his other thread[1].[1] https://bitcointalk.org/index.php?topic=5404614.20",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}