{
  "id": "topic_5441975",
  "title": "bonfire66",
  "author": "bonfire66",
  "created_time": "March 03, 2023, 11:57:08 AM",
  "content": "Многие не слишком умные интернет-писатели любят писать, что вот, когда народу (или олигархам) надоест Путин, то они его возьмут и скинут. Это невозможно, я уже писал тут об этом. Путин будет у власти, пока у него есть деньги платить силовикам, Росгвардии, ОМОНУ, ФСО, ФСБ и тд. Других сценариев смены власти я раньше не видел. Но это всеж какой-то сценарий (про конец денег). Обычно даже серьезные политологи или журналисты не предлагают никаких реальных методов, идей или сценариев.   Но на днях у меня появилась весьма реалистичная идея. Как все может произойти примерно через год. Будут выборы президента. И, допустим, г-жа Памфилова возьмет, и нарисует такие результаты, что Путин, типа, например, наберет только 40% голосов, а (допустим) Собянин – 55%. И все! Легко и просто. Ну типа «не вышло в этот раз набрать Путину много голосов. СВО и все такое прочее… бывает..». Не получилось. Хотела как всегда, но не вышло. Не смогла.         Тогда Путину придется уйти с поста Президента. Официально и окончательно. А уж Собянин (или Мишустин) как-то порешает, что делать потом со всей этой кашей, которую заварил Путин.    И все. Я думаю, мировое сообщество запросто сможет отстегнуть Памфиловой миллиард долларов за этот финт ушами и простить ей все прошлые прегрешения. Это получится весьма дешевый и бескровный метод смены власти в России.             Как вам идея?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441975",
  "comments": [
    {
      "author": "The0ldl_lser",
      "created_time": "March 03, 2023, 01:25:54 PM",
      "body": "Идея красивая. Найдется ли такая условная Памфилова, которая рискнет - хороший вопрос. Думаю рано или поздно найдется, страна большая, в данном случае это играет скорее в пользу чем во вред.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "March 03, 2023, 02:44:18 PM",
      "body": "Я говорю не про условную Памфилову, а про самую настоящую. Сама ли она до этого додумается, или ей подскажут - не важно. Главное - результат!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "March 04, 2023, 03:27:04 AM",
      "body": "Quote from: bonfire66 on March 03, 2023, 02:44:18 PMГлавное - результат!Если главное - результат, то эту твою идею можно реализовать в 100 раз дешевле.Вот смотри: на Украине, как и в РФ, выборы через год. В марте 2024.Для результата нам нужно нанять ну, пусть, 10 тыщ майдаунов. Дать каждому по тыще баксов (чтобы они недельку-другую в палатках пожили, пошумели, поскакали на майдадане с кастрюлями на головах и всё остальное, что они любят делать).Итого: цена вопроса - всего 10 мультов (а не ярд), и на Украине появляется нормальный правильный президент вместо нынешнего клоуна.Новый президент сразу прекращает боевые действия, проводит демилитаризацию Украины (=распродаёт всё оружие другим странам, как на Украине привычно делали начиная с 1991 года), сносит все памятники Бандере и процим нацистам, самых радикальных укро-нацистов отправляет на 15 лет принудительных работ по восстановлению разрушенной Украины, признаёт новые российские регионы, подписывает мирный договор с РФ в новых границах - и все счастливо живут дальше.И всё это в 100 раз дешевле, чем твой вариант!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cyop",
      "created_time": "March 04, 2023, 04:59:30 AM",
      "body": "Quote from: bonfire66 on March 03, 2023, 02:44:18 PMЯ говорю не про условную Памфилову, а про самую настоящую. Сама ли она до этого додумается, или ей подскажут - не важно. Главное - результат!А сможет ли взяткодатель гарантировать безопасность от любителей ледорубов, кувалд и шпилей?Миллиард долларов, но всю жизнь на корвалоле и феназепаме потом сидеть.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "March 04, 2023, 06:23:56 AM",
      "body": "Quote from: cyop on March 04, 2023, 04:59:30 AMА сможет ли взяткодатель гарантировать безопасность от любителей ледорубов, кувалд и шпилей?Миллиард долларов, но всю жизнь на корвалоле и феназепаме потом сидеть.Вот-вот.10 тыщ майдаунов и обойдутся в 100 раз дешевле, и таких вот проблем у них не будет )",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cyop",
      "created_time": "March 04, 2023, 08:50:17 AM",
      "body": "Quote from: Snork1979 on March 04, 2023, 06:23:56 AMВот-вот.10 тыщ майдаунов и обойдутся в 100 раз дешевле, и таких вот проблем у них не будет )А какой смысл менять власть в Украине? там президент выбирается, в этой теме обсуждается как турнуть обнулёныша, в Украине либо изберут, либо турнут с помощью майдана, речь идет о несменяемости власти престарелых генсеков на России и в идеале еще бы вернуть в казну наворованное пукинской вертикалью.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "March 04, 2023, 11:15:08 AM",
      "body": "Quote from: cyop on March 04, 2023, 08:50:17 AMв этой теме обсуждается как турнуть обнулёнышаВ этой теме, судя по её названию \"Бескровный метод смены власти\", обсуждаются именно бескровные методы смены власти.Без привязки к какой-либо одной стране.Quote from: cyop on March 04, 2023, 08:50:17 AMА какой смысл менять власть в Украине?Так я же выше уже подробно написал про это:Результат - тот же (окончание военных действий и мир).Цена - в 100 раз дешевле, чем предлагает Бонифаций.Для тебя \"в 100 раз дешевле за тот же результат\" - это недостаточный смысл разве?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cyop",
      "created_time": "March 04, 2023, 05:15:45 PM",
      "body": "Quote from: Snork1979 on March 04, 2023, 11:15:08 AMВ этой теме, судя по её названию \"Бескровный метод смены власти\", обсуждаются именно бескровные методы смены власти.Наверное сам пост надо почитать, а не только название.Quote from: Snork1979 on March 04, 2023, 11:15:08 AMБез привязки к какой-либо одной стране.Результат - тот же (окончание военных действий и мир).Цена - в 100 раз дешевле, чем предлагает Бонифаций.Для тебя \"в 100 раз дешевле за тот же результат\" - это недостаточный смысл разве? Таки с привязкой или без привязки? в Сирии или Ираке будет еще в 1000 раз дешевле, а результат - тот же: окончание военных действий и мир.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "March 04, 2023, 09:15:18 PM",
      "body": "Quote from: cyop on March 04, 2023, 05:15:45 PMНаверное сам пост надо почитать, а не только название.Наверное, тебе нужно хотя бы попытаться понять формальную логику, а не только \"укро-логику\".(хотя я и понимаю, что для тебя это слишком сложная задача)Quote from: cyop on March 04, 2023, 05:15:45 PMТаки с привязкой или без привязки? в Сирии или Ираке будет еще в 1000 раз дешевле, а результат - тот же: окончание военных действий и мир.В 1000 раз дешевле от 10 мультов - это 10 тыщ баксов.Окей, наш укро-бот, напиши здесь свой вариант, как, по-твоему, можно закончить войну в Сирии или Ираке всего за 10 тыщ баксов?Я с интересом послушаю твои мысли на этот счёт",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cyop",
      "created_time": "March 05, 2023, 12:33:10 AMLast edit: March 05, 2023, 03:50:27 AM by cyop",
      "body": "Quote from: Snork1979 on March 04, 2023, 09:15:18 PMQuote from: cyop on March 04, 2023, 05:15:45 PMНаверное сам пост надо почитать, а не только название.Наверное, тебе нужно хотя бы попытаться понять формальную логику, а не только \"укро-логику\".(хотя я и понимаю, что для тебя это слишком сложная задача)Quote from: cyop on March 04, 2023, 05:15:45 PMТаки с привязкой или без привязки? в Сирии или Ираке будет еще в 1000 раз дешевле, а результат - тот же: окончание военных действий и мир.В 1000 раз дешевле от 10 мультов - это 10 тыщ баксов.Окей, наш укро-бот, напиши здесь свой вариант, как, по-твоему, можно закончить войну в Сирии или Ираке всего за 10 тыщ баксов?Я с интересом послушаю твои мысли на этот счёт   В 1000 раз дешевле от 1 млрд. это 1 млн., но можно и за 2 доллара покупаешь пачку гречки и две сосиски нанимаешь на них отряды путина во главе со снорком и противник умирает от смеха, оставшиеся 9998 отправляешь на нужды ВСУ. Готово.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "March 06, 2023, 12:09:17 PM",
      "body": "Я имел, конечно, ввиду бескровный метод смены власти в России. А не в Украине.Просто тут сильные ограничения по длине заголовка поста. Поэтому и приходится быть кратким.На самом деле, прикол в том, что НЕ НАДО НИЧЕГО ДЕЛАТЬ!Нужно всего лишь будет через год провести ЧЕСТНЫЕ выборы. То есть, не надо будет делать никакие вбросы в пользу альтернативных кандидатов. Памфиловой нужно всего лишь нЕ ВМЕШИВАТЬСЯ. ТО есть сделать все ЧЕСТНО, а не как раньше. Так что ее совесть будет чиста. И придраться будет не к чему. И все. С учетом того, как движется тенденция развития СВО - через год рейтинг Путина будет раза в 2-3-5 ниже, чем сейчас. И все. Честно и бескровно.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arsentevmoxa",
      "created_time": "March 06, 2023, 05:26:32 PM",
      "body": "честные выборы? не будет и не было уже много лет. если надо все подкорректируют и подрисуют, хоть на бланках, хоть в Конституции",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "March 06, 2023, 05:47:19 PM",
      "body": "Вы так и не поняли суть идеи. Для того, чтобы сменить власть, нужно будет через год всего лишь провести честные выборы. И никаких революций, расстрелов \"белого дома\", взрывов в центре Москвы и тысяч трупов. Рецепт очень простой - просто НЕ МЕШАТЬ выборам. Думаю, этого будет через год уже достаточно. А приз - миллиард долларов. Недавно была принята резолюция ассамблеи ООН против войны. И 141 страна мира высказалась против продолжения войны в Украине. Это примерно 70%. Как вы думаете, какие страны высказались за продолжение этой СВО? Правильно - Россия, Белоруссия, Эритрея, Сирия и тд. 7 стран. За то, чтобы продолжать войну. И 141 страна - за то, чтобы войну прекратить. И это только сегодняшняя тендеция. Еще несколько  месяцев - и сторонников продолжения войны, а также воздержавшихся будет еще меньше. Как снаружи России, так и внутри. Так что через год все окончательно решится. Либо Памфилова получит свой миллиард, либо сядет спустя год или два пожизненно.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cyop",
      "created_time": "March 06, 2023, 10:11:22 PM",
      "body": "Честные выборы за взятку в миллиард долларов звучит как оксюморон.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nurnbergprocess",
      "created_time": "March 07, 2023, 03:57:31 AM",
      "body": "Не, херня какая-то, не выйдет так 100%",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The0ldl_lser",
      "created_time": "March 07, 2023, 10:17:34 AM",
      "body": "Quote from: cyop on March 06, 2023, 10:11:22 PMЧестные выборы за взятку в миллиард долларов звучит как оксюморон.  Да кто ж ей даст миллиард? Так, просто от Гааги освободит, и позволит путешествовать по миру, как ни в чем не бывало",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "March 08, 2023, 12:40:25 PM",
      "body": "Но ведь тоже неплохо? Лучше чем полная конфискация, в том числе и имущества родственников и тюрьма до конца жизни?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "March 08, 2023, 05:45:29 PM",
      "body": "Quote from: bonfire66 on March 06, 2023, 12:09:17 PMЯ имел, конечно, ввиду бескровный метод смены власти в России. А не в Украине.Бонифаций, не хочу тебя расстраивать и заставлять тебя в очередной раз сомневаться в собственном уровне \"интеллекта\", но: если ты \"что-то имеешь ввиду\", так и заявляй это сразу прямо и однозначно в названии топика и в стартовом посте.Не у всех здесь, знаешь ли, есть хрустальный шар, чтобы угадать заранее твои \"мысли\", которых у тебя и нет",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "March 08, 2023, 05:55:39 PM",
      "body": "Я очень четко обрисовал свой сценарий. И это именно - сценарий. А не голословное утверждение что \"мы завтра Киев возьмем за 3 дня\" - такое уже было не раз, и как показала история, те люди, которые это ОФИЦИАЛЬНО заявляли - они обосрались жидким серевом конкретно. Я считаю, что конец всему можно положить через год. Совершенно официально и демократическим путем убрав Путина из власти. Просто, дешево и легко. Для этого просто как минимум наверное достаточно будет просто провести ЧЕСТНЫЕ выборы. И выбрать любого другого кандидата. А вы вот лично за кого бы проголосовали через год? Просьба ответить ЧЕСТНО! И прямо сразу!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}