{
  "id": "topic_5439519",
  "title": "Husires",
  "author": "Husires",
  "created_time": "February 11, 2023, 10:05:33 PM",
  "content": "The UK economy flatlined in the last quarter of 2022, meaning that it just managed to avoid falling into a recession. QuoteGross domestic product (GDP) had fallen 0.2% in the July-September quarter, and two consecutive quarters of contraction would have pushed the country into a recession. GDP for the October-December period showed zero growth, the Office for National Statistics (ONS) said Friday.For the whole of 2022, the economy grew by 4%, following an expansion of 7.6% in 2021. Its performance is likely to deteriorate sharply this year: the International Monetary Fund has forecast that the United Kingdom will be the only major economy to contract in 2023. And last week, the Bank of England forecast a 0.5% decline in UK economic output this year, broadly in line with the IMF’s prediction.https://edition.cnn.com/2023/02/10/economy/uk-economy-gdp/index.htmlAccording to the classic definition of a two-quarter downturn, UK economy has weathered the recession, but has it really done so? What are the expectations for next year?The country is witnessing widespread strikes, and the repercussions of leaving the European Union are still underway. The energy crisis gives the impression that worse is yet to come.UK is almost the only G7 country whose GDP still hasn't reached pre-2020 levels.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5439519",
  "comments": [
    {
      "author": "Sarah Azhari",
      "created_time": "February 12, 2023, 02:06:10 AM",
      "body": "Quote from: Husires on February 11, 2023, 10:05:33 PMAccording to the classic definition of a two-quarter downturn, UK economy has weathered the recession, but has it really done so? What are the expectations for next year?I think so, as a weapon supporter of Ukraine, England has branches in mind besides the economic country. Apart from the people, England also thinks about how to manage money to buy other than the needs of the people and is not too focused on how to prepare for a recession. So no one is to blame, this is a policy mistake, I think it will be fine if enter foreign exchange from commonwealth countries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "February 12, 2023, 04:43:12 AM",
      "body": "Worst is still to come to England.The inflation is already high in UK regardless of how they change the way it is calculated to lower it.On top of that they have increased the interest rate so high trying to battle the inflation but it caused recession. Which is happening regardless of what the \"official stats\" are saying.This has caused increased unemployment (check out the large number of layoffs, businesses shutting down, etc. not official stats about unemployment), decreased income and increased cost of living that has led to a cost of living crisis across UK.On top of that there is the middle class that has slowly fallen down to become lower class facing all kinds of economic hardship.I said the worst is still to come because of all the protests and strikes across UK that are starting to get violent too, like half a million protesting in London recently. They are demanding higher salaries, etc. and the government has to comply sooner or later but paying them more means worsening all the existing economical problems (higher inflation and worse recession) as they have to for example print more money to pay them, basically like a bandaid that sweeps the problem under the rug for a couple of months.Cherry on top:There is now Scotland (and others) that are talking about independence. The worse things get in UK the more they would want to become independent. England that has been facing an energy crisis could lose its major gas supplier (between 60% to 70% comes from Scotland), then things become a hundred times worse for England...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "February 12, 2023, 08:08:03 AM",
      "body": "Quote from: Husires on February 11, 2023, 10:05:33 PMAccording to the classic definition of a two-quarter downturn, UK economy has weathered the recession, but has it really done so? What are the expectations for next year?They really did? I dont know why this metric does not include inflation into calculation. If GDP grew by 0.2% with inflation at 6% it means that it went down by 5.8%. I bet you can have growing GDP even on dying country in deep recession as long as you will print enough money. USA, UK and whole euro zone is in deep recession. People sees this, no matter what official numbers says.And the worst is yet to come. we have at least 10 hard years ahead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vishnu.Reang",
      "created_time": "April 30, 2023, 03:39:21 PM",
      "body": "As recession fears mount on wall street and inflation remains well above the fed's 2% target, some of the top commentators in markets, business, and economics have been sounding off on just how bad they think next downturn might be, and how far stocks may have to  fall.Even if a non dollar-denominated asset sees no real gains during inflation that's still much better than holding cash and seeing your real purchasing power undermined. In other words, sometimes you have to choose between the lesser of two evils.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "April 30, 2023, 07:47:25 PM",
      "body": "The United Kingdom should consider to re-join the European Union if they do not manage to escape their own economical recession, in my opinion.People have had thought that was a good idea back them, keeping in mind their nationalist ideas but the people can change of mind specially when they see their way of life being threatened by  the macroeconomics in their nation.If they had never left, they probably would not need to worry about this because they could have had a bigger support coming from the continent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}