{
  "id": "topic_5470676",
  "title": "bit_dream",
  "author": "bit_dream",
  "created_time": "October 17, 2023, 11:29:22 AM",
  "content": "White Paper: https://docs.atomicals.xyzOfficial recommendation: https://twitter.com/atomicalsxyzIntroduction to the Atomicals protocol:The Atomicals protocol is a simple and flexible protocol used to cast, transmit, and update digital objects (traditionally referred to as irreplaceable tokens) for unused transaction output (UTXO) blockchains such as Bitcoin. Atoms (or \"atoms\") are a way of organizing the creation, transmission, and updating of digital objects - they are essentially digital ownership chains defined according to some simple rules.The protocol has built-in modules such as NFT, containers, domains, and tokens, which can be directly used for issuing/casting operations.Current module:1 NFT: By storing binary data in uxto, additional content can be added.2 Container: Reserved for the project team's collection. The project team can directly cast all NFTs into the collection, or add content to the collection. Additional content can be added.3 Domain: Preemptive and unique. There are sub domain concepts.4 Tokens: built-in deployment/issuance and fair launch rules for tokens. Decentralized indexing.Developer team and project built on Atomicals:Wizz Wallet Signboard: https://wizz.cash/dashboardATOM wallet (Google plugin/includes mobile): https://atomicalswallet.com/satsxCasting platform: https://satsx.ioOfficial domain query: https://realm.name/punkIndexing and NFT duplicate checking tools: https://crypt0biwan.github.io/atomical-nft-viewer/Inscription Browser: https://atomicalmarket.com/atomical/0",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470676",
  "comments": [
    {
      "author": "bit_dream",
      "created_time": "October 17, 2023, 11:38:11 AM",
      "body": "Atomicals revealed that future Atomicals frameworks will utilize technologies such as novel # BitVM inventions. Bitvm fully aligns with the computational paradigm they envisioned for atoms.https://twitter.com/atomicalsxyz/status/1712501426918773173",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "October 18, 2023, 05:21:55 AM",
      "body": "reading the specification of the whitepaper.. its just another useless arbitrary bloat of crap data added to the witness of a tx.. thus no real transfer proofits just ordinals junk data under a different name. idiots cant even figure out how to show proof of transfer in the right part of a transaction using real strict ruleset and cryptographic proof of ownership that is unbreakable/unchangeable.... its just appended junk added to the end, which uses silly wallet suggested policy yet again that input x transfers to output X. but thats not how bitcoins proof of transfer works. because their silly policy can, without changing blockdata change their suggested policy within their wallet/explorers to become output Y is input X's recipient. without breaking the blockchainthus not immutable provable transfer just the \"suggestion\" of such without a finite rule, based on whatever policy their explorer node suggests that weekif only they would learn basic bitcoin logic, math, cryptography and immutable rules",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bit_dream",
      "created_time": "October 18, 2023, 11:42:48 AM",
      "body": "I will provide feedback on your suggestions to the official team to see what their opinions may be. Is there anyone else who can express their views on Atomicals? We should accept more ideas and suggestions, and accept some new innovations on btc。",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "October 18, 2023, 02:34:46 PM",
      "body": "Quote from: bit_dream on October 18, 2023, 11:42:48 AMI will provide feedback on your suggestions to the official team to see what their opinions may be. Is there anyone else who can express their views on Atomicals? We should accept more ideas and suggestions, and accept some new innovations on btc。feedback. learn how proof of transfer really words and how to actually link a unspent output(input) with a spending output(output) property within the data and how to ensure integrity of data and integration of data into the inputs instead of appended as witnessif you dont even know a silly system you are promoting even works to need to seek guidance from some \"team\" , then maybe you should not promote it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bit_dream",
      "created_time": "October 18, 2023, 04:00:46 PM",
      "body": "Btc also encountered great doubts when it first came out. I want to have a deeper understanding of a new thing and then come here to seek the opinions of the OGs, isn't there any mistake ❓ If I know everything, do I still need to seek everyone's opinions ❓",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "October 18, 2023, 04:17:10 PM",
      "body": "Tomato to-ma-to, ordinal-atomical, garbage-trash-junk-spam-scam-monkeypics.If we could find a way to increase the fee only for transactions including something other than bitcoin/sats, then we could see if people would still pay $50 as a fee to send out 1000 transactions or not, then we'd see if it's really a new innovation/ technology and if people really use them and find them useful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bit_dream",
      "created_time": "October 18, 2023, 04:35:33 PM",
      "body": "So you think any attempt or innovation on btc is wrong and garbage ❓",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "October 18, 2023, 05:21:03 PM",
      "body": "Quote from: bit_dream on October 18, 2023, 04:35:33 PMSo you think any attempt or innovation on btc is wrong and garbage ❓atomicals is not a innovation. its copying a scam to be ultra scammyQuote from: digaran on October 18, 2023, 04:17:10 PMIf we could find a way to increase the fee only for transactions including something other than bitcoin/sats, then we could see if people would still pay $50 as a fee to send out 1000 transactions or not, then we'd see if it's really a new innovation/ technology and if people really use them and find them useful.there are many ways to have a fee mechanism in bitcoin that only punishes one subset of users, funny part is the only fee mechanisms at the moment punish everyone but discount the annoyances",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "October 18, 2023, 05:35:53 PM",
      "body": "Essentially anything unrelated to transfer of bitcoins on Bitcoin's blockchain should be treated as parasite and we know parasites are not good for any system.Using Bitcoin's popularity to line your pockets is just another form of scam, but hey why not having miners to somehow check every transaction for any alien data and if the fee was the same as native data's fee, they would simply reject it, drop it and only include native TXs?At least miners can do that if there is a way to distinguish non-native from native data, right? And doing that would benefit miners as well as eradicating any spam/attack on the network.This will ensure that not every person who has failed scamming people by ICO tactics can now attempt the same scam using Bitcoin.Note that if you don't fight parasites, they will consume you entirely where at some point in time it would be impossible to tell the difference.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bit_dream",
      "created_time": "October 18, 2023, 05:43:08 PM",
      "body": "So what is something related to Bitcoin transfer on the Bitcoin blockchain ❓",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bit_dream",
      "created_time": "April 18, 2024, 03:45:32 PM",
      "body": "ATOMICALS: Expanding The Bitcoin Universe. AVM Atomicals Virtual MachineSmart contract system and decentralized indexer operating on bitcoin layer 1. L1#AVM Overview- High level programming language- Private contract state- 100% on-chain logic and data. #L1- Smart contracts are called #Reactors#AVM Capabilities- Complete developer freedom- Swap, stake, deposit withdraw #ARC20 - Turing Complete- *Payable* contract methods turns every #ARC20 into a medium of exchange in any contract reactorhttps://twitter.com/atomicalsxyz/status/1777657512872890571",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}