{
  "id": "topic_5405457",
  "title": "The Sceptical Chymist",
  "author": "The Sceptical Chymist",
  "created_time": "July 07, 2022, 03:38:53 AM",
  "content": "The e-mail account I use on this forum I generally don't use for much else, but I happened to check it just a little while ago and got three e-mails from bitcointalk stating that someone had used the \"forgot password\" function for my account, and all three attempts were over the course of about an hour.I'm not crazy, right?  That means someone is trying to get into my account, right?  What I don't understand is why that person would try to do that if they don't know what my e-mail is.And after giving it a little thought, I have exposed a few e-mail addresses to members of the forum in the past, whether through deals or by becoming acquaintances with those members.  I'm wondering if one of those people thought I used whatever e-mail they had as my forum e-mail....and that's a frightening thought.So if you should happen to see my account start posting in the Russian section or if my English deteriorates to brain-vegetable bounty hunter quality, just know that I got hacked and neg my account to high hell until I get it back.  This is the first time something like this has happened to me since I've been a member.  Yikes.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405457",
  "comments": [
    {
      "author": "DireWolfM14",
      "created_time": "July 07, 2022, 04:41:48 AM",
      "body": "Quote from: The Pharmacist on July 07, 2022, 03:38:53 AMThe e-mail account I use on this forum I generally don't use for much else, but I happened to check it just a little while ago and got three e-mails from bitcointalk stating that someone had used the \"forgot password\" function for my account, and all three attempts were over the course of about an hour.Send the big man a PM with the time stamps of the emails, he might have the IP of the culprit.  Of course it could just be a tor exit node or whatever, but it could be not.Quote from: The Pharmacist on July 07, 2022, 03:38:53 AMI'm not crazy, right?Um, no comment, but that's off topic.  Quote from: The Pharmacist on July 07, 2022, 03:38:53 AMThat means someone is trying to get into my account, right?  What I don't understand is why that person would try to do that if they don't know what my e-mail is.Sounds that way to me.Quote from: The Pharmacist on July 07, 2022, 03:38:53 AMAnd after giving it a little thought, I have exposed a few e-mail addresses to members of the forum in the past, whether through deals or by becoming acquaintances with those members.  I'm wondering if one of those people thought I used whatever e-mail they had as my forum e-mail....and that's a frightening thought.You should change all the passwords on those email accounts, pronto.  If they've been compromised you may not know unless the culprit sent an email.  Or changed the password.  Quote from: The Pharmacist on July 07, 2022, 03:38:53 AMSo if you should happen to see my account start posting in the Russian section or if my English deteriorates to brain-vegetable bounty hunter quality, just know that I got hacked and neg my account to high hell until I get it back.  This is the first time something like this has happened to me since I've been a member.  Yikes.Honestly, it sounds like an amateur attempt.  Still you may want to assess the strength of the passwords for your forum account and the affiliated email account, and take action if needed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "July 07, 2022, 06:08:00 AM",
      "body": "I don't know if it has anything to do with it but take a look at this thread:weird pm receivedIn this case he talks about PM in the forum. It may have nothing to do with it or if it has something to do it will be some amateurs trying to hack forum members accounts in DT with great reputation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "July 07, 2022, 06:10:09 AM",
      "body": "Quote from: The Pharmacist on July 07, 2022, 03:38:53 AM-snip-What I don't understand is why that person would try to do that if they don't know what my e-mail is.Just tried luck.I don't really remember the account self-recovery method as I forgot when I last touched “forgot password”, maybe he thought there would be some method like social media accounts in general.Quote from: The Pharmacist on July 07, 2022, 03:38:53 AM-snip-So if you should happen to see my account start posting in the Russian section or if my English deteriorates to brain-vegetable bounty hunter quality, just know that I got hacked and neg my account to high hell until I get it back.  Of course, especially when it comes to spending smerit to bounties shitposter. I hope you haven't forgotten where you put your staked address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "July 07, 2022, 06:36:55 AM",
      "body": "Quote from: The Pharmacist on July 07, 2022, 03:38:53 AMI'm not crazy, right?  That means someone is trying to get into my account, right?  What I don't understand is why that person would try to do that if they don't know what my e-mail is.Even if the person just knows your e-mail, they can't get into your account, the person must have to compromise your email so when the \"reset password\" message is sent to the email they can reset the password. Using the \"forgot password\" function when you have not taken custody of the email is a waste of time. I feel this is not a serious hack attempt, maybe somebody is just playing around.Quote from: The Pharmacist on July 07, 2022, 03:38:53 AMI'm wondering if one of those people thought I used whatever e-mail they had as my forum e-mail....and that's a frightening thought.Not too frightening The Pharmacist, if you still have the e-mails, confirm that they have not been compromised and change their passwords if possible, if they are toss-out e-mails you have no more and is not connected to you in any manner, you can forget about it. I still feel someone is just playing around, though do some security necessities.Quote from: The Pharmacist on July 07, 2022, 03:38:53 AMSo if you should happen to see my account start posting in the Russian section or if my English deteriorates to brain-vegetable bounty hunter quality, just know that I got hacked and neg my account to high hell until I get it back.    unlikely to happen. You will get your account back fast if it happens though because of your reputation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "July 07, 2022, 06:43:58 AMLast edit: July 07, 2022, 01:11:04 PM by YOSHIE",
      "body": "Quote from: The Pharmacist on July 07, 2022, 03:38:53 AMAnd after giving it a little thought, I have exposed a few e-mail addresses to members of the forum in the past, whether through deals or by becoming acquaintances with those members.  I'm wondering if one of those people thought I used whatever e-mail they had as my forum e-mail....and that's a frightening thought.Maybe, I think your guess is right, maybe someone is trying to get into your account, via Email as I saw in the past.Quote from: DireWolfM14 on December 25, 2020, 06:37:29 PMThey might try to tamper with the above email to get into your account, Looks like the hacker has failed, because it's not your real email.Or maybe it's your fault, as you post below, in the past.Quote from: The Pharmacist on November 18, 2019, 02:07:59 PMQuote from: bL4nkcode on November 18, 2019, 12:49:24 PMI don't think the .com domain is a phishing site or something scamI hope not, because one time I logged into that site with my .org password by accident--and it was stupid, I admit, but for a second I thought the new forum software had been launched (I'd just woken up, that's my excuse).  Right after realizing my mistake I quickly logged on to the right forum and changed my password, but it scared the crap out of me for a few minutes.Who knows the phishing site is trying to take advantage of the email and password you registered at that time, now they are just trying to enter, Topic: The .com forum.Quote from: The Pharmacist on July 07, 2022, 09:41:36 AMthough two of those three things are coming soon.in cases like this, it seems you have to remember the words that are often said by: TMAN.QuoteAn ounce of prevention is worth a pound of cure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "July 07, 2022, 07:45:57 AM",
      "body": "Had the same thing late July 1st and into July 2nd. 2 emails from someone trying to get into my account. I think whomever it is is probably trying it on multiple users and hoping they get lucky. It's like they think we are stupid and have simple passwords.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "July 07, 2022, 08:40:05 AM",
      "body": "This type of thing happens a lot, if you're a user with a little bit of a reputation, regardless where you're at, then you'll likely see this. I've had business accounts which were particularly valuable in the past on other websites, and they literally non stop, every day, sometimes all day get password resets. It's why some websites only allow a certain amount of requests, but that might then mean the legitimate user not being able to do it, because others have done it before them, and continue to do so. These are usually very low, speculative malicious users though. So, can usually be safely ignored. As long as you have your credentials, and accounts secured, and ideally some sort of two factor authentication. You should be alright.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Evolyn",
      "created_time": "July 07, 2022, 09:09:14 AM",
      "body": "Quote from: yahoo62278 on July 07, 2022, 07:45:57 AMHad the same thing late July 1st and into July 2nd. 2 emails from someone trying to get into my account. I think whomever it is is probably trying it on multiple users and hoping they get lucky. It's like they think we are stupid and have simple passwords.Its no secret bitcointalk was hacked multiple times and email addresses got leaked. Even I registered this kind of attack on my account dedicated to bitcointalk one week ago and I guess alot of other users were affected, too. It was only a matter of time untill we see a wide spread attack like this happens to related users/email accounts.Quote from: Welsh on July 07, 2022, 08:40:05 AMThis type of thing happens a lotUnfortunately this. Default opsec like having strong and unique passwords for every service you use, two factor when possible like you stated and you should already be fine.If someone goes full paranoid mode now, may the thread Stake your Bitcoin address here https://bitcointalk.org/index.php?topic=996318.0 is usefull to have a plan B for worst case scenario.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "July 07, 2022, 09:41:36 AM",
      "body": "Quote from: Poker Player on July 07, 2022, 06:08:00 AMI don't know if it has anything to do with it but take a look at this thread:weird pm receivedYeah, I got my PM, posted in that thread, came back to this thread and you just turned me around like 720 degrees.  My head's a-spinning.  Lol.Quote from: DireWolfM14 on July 07, 2022, 04:41:48 AMSend the big man a PM with the time stamps of the emails, he might have the IP of the culprit.  Of course it could just be a tor exit node or whatever, but it could be not.My e-mail provider linked to his IP address, which I looked up.  It said it was a VPN, and whoever this rubberdick is used Bangladesh as the location.  Man, I hope it's not the gas station guy across the street from me.  That's not paranoid, is it?Quote from: DireWolfM14 on July 07, 2022, 04:41:48 AMQuote from: The Pharmacist on July 07, 2022, 03:38:53 AMI'm not crazy, right?Um, no comment, but that's off topic.  Message received.Quote from: DireWolfM14 on July 07, 2022, 04:41:48 AMHonestly, it sounds like an amateur attempt.  Still you may want to assess the strength of the passwords for your forum account and the affiliated email account, and take action if needed.Man, my e-mail password for that throwaway account is so strong, it'd take an Avogadro's number of cryptographers a million lifetimes to crack it.  And then even if they hit the lottery they'd be left with a bunch of spam, because that's all that e-mail account receives.  But thanks for the advice anywho.Quote from: Welsh on July 07, 2022, 08:40:05 AMThis type of thing happens a lot, if you're a user with a little bit of a reputation, regardless where you're at, then you'll likely see this. Damn right regardless of where you're at--I'm a nobody with nothing to my name, and who the hell would want to pick my account to hack?  I haven't pissed anybody off lately that I know of.  Maybe Big Brother Biden finally formed a crypto goon squad that's infiltrated bitcointalk and has started with retards like me.  That would actually make sense, given that it's Biden we're talking about.  Goddamn Weekend at Bernie's president with the real power having their arms up his sphincter to prop him up and get him to the church on time, if you know what I'm saying.I don't even know what I'm saying.  Can't fuckin' sleep again.Quote from: YOSHIE on July 07, 2022, 06:43:58 AMOr maybe it's your fault, as you post below, in the past.Jayyyzus H Christ, some of you have memories like steel traps when it comes to little details like that post of mine.  I even forgot about that one, but you're probably right (although that was quite some time ago).  In any case, I did change my login details following that snafu.  And you're correct, that e-mail address you showed a pic of is definitely not mine.  Nor am I Italian or that old or that grey, though two of those three things are coming soon.Quote from: noorman0 on July 07, 2022, 06:10:09 AMI hope you haven't forgotten where you put your staked address.Funny you should take that poke at my teacup-sized memory.  My last staked address is from an Electrum wallet that I created especially for signing messages should I have to here, and I do have the seed phrase tattooed on the inside of my butt crack.  Nobody is ever going to find it there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ahli38",
      "created_time": "July 07, 2022, 11:32:34 AM",
      "body": "I think the ones trying to do that are just amateurs playing around. But you need to be careful too. maybe this time he failed. but we don't know what it will do when it wants to hack you again. because if someone seriously wants to hack your account. then the person will not stop with just one to ten failures. he will continue to find a way. in a classic way like sending a link or something like that or in a more modern way. being careful and making anticipation is better than being late. But of course we hope that it's just a prankster and not really not serious about hacking you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mv1986",
      "created_time": "July 07, 2022, 03:00:05 PM",
      "body": "Quote from: yahoo62278 on July 07, 2022, 07:45:57 AMHad the same thing late July 1st and into July 2nd. 2 emails from someone trying to get into my account. I think whomever it is is probably trying it on multiple users and hoping they get lucky. It's like they think we are stupid and have simple passwords.This is interesting. I have the same problem to deal with. I am a very private person. I wondered how someone else could get access to my number. Well, I am aware of the fact that even mobile sell data. So, blame on me, right? Saying A, doing B, and thinking C, just is ridiculous. I shouldn't be wondering. But still, I was quite surprised.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "skarais",
      "created_time": "July 07, 2022, 06:11:49 PM",
      "body": "Quote from: The Pharmacist on July 07, 2022, 03:38:53 AMI'm not crazy, right?  That means someone is trying to get into my account, right?  What I don't understand is why that person would try to do that if they don't know what my e-mail is.That person might just be trying his luck, but he forgot that it was a wasted effort. The Pharmacist, I experienced the same thing last February and I think there are many other users who experience the same thing. But in my opinion it's never too dangerous especially if the hacker doesn't know your email.Attempted account hacking via forgot account password Quote from: The Pharmacist on July 07, 2022, 09:41:36 AMMan, I hope it's not the gas station guy across the street from me.  That's not paranoid, is it?Damn, it's already at a severe stage I guess.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "July 07, 2022, 06:47:56 PM",
      "body": "Looks like the same thing happened to me in less than a week. I get e-mail about resetting password while I never did. The e-mail took me by surprise and suddenly I had to urgently see if I could access the account but luckily because till now my account is still safe without any changes. For now I ignore the e-mail and everything is still fine. But I really have to stay alert for the worst.In the meantime I did a little search about the IP location listed in the e-mail, here are the findings. The Pharmacist, let me know if you find a location similar to this about that person. He's probably the same guy who also tried to hack my ass. LOL",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypto Library",
      "created_time": "July 07, 2022, 09:48:42 PM",
      "body": "Quote from: _BlackStar on July 07, 2022, 06:47:56 PM~snip~Wow , It's seems nearest me. When did the people here become such big hackers? LolLocation in Bhuapur, Bhuapur sub-district, Tangail district, Dhaka division. It's a shame to see all this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "July 07, 2022, 09:53:33 PM",
      "body": "Quote from: Poker Player on July 07, 2022, 06:08:00 AMI don't know if it has anything to do with it but take a look at this thread:weird pm receivedIn this case he talks about PM in the forum. It may have nothing to do with it or if it has something to do it will be some amateurs trying to hack forum members accounts in DT with great reputation.found this thread and wanted to add 2 cents as I think someone is trying to hack anyone they can with good credit merit trust etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oluwa-btc",
      "created_time": "July 08, 2022, 04:07:49 AM",
      "body": "Quote from: The Pharmacist on July 07, 2022, 03:38:53 AMSo if you should happen to see my account start posting in the Russian section or if my English deteriorates to brain-vegetable bounty hunter quality, just know that I got hacked and neg my account to high hell until I get it back.  This is the first time something like this has happened to me since I've been a member.  Yikes.I'll tell you Mr TP, you're unique with all of your writings, your grammar and higher vocabularies used, as ion think anyone can match your writings. ( No kidding )  How well you talk about the past DT system's, merit system,bounty hunting and cheating. A change would be very easy for anyone to notice. But, further more, reconsider changing your pass to your mail. Maybe, more harder to crack! Hopefully all be sorted out. Safe!You should do well to front the dude at the gas station if you think he has something to do with it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "July 08, 2022, 06:02:31 PM",
      "body": "I did not receive PM from newalias, I did not receive any password reset email, all these means that I am a boring user 🤣. I feel left out now. Is it bad or good? 😉Quote from: The Pharmacist on July 07, 2022, 03:38:53 AMThis is the first time something like this has happened to me since I've been a member.  Yikes.I have gone through the worst. Motherfucker hacked my account but it was theymos and the recovery team who were really helpful to recovered my account. They were unexpectedly quick. There were times when you had to wait months even years to get back the accounts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "July 08, 2022, 06:58:11 PM",
      "body": "Quote from: Crypto Library on July 07, 2022, 09:48:42 PMWow , It's seems nearest me. When did the people here become such big hackers? LolLocation in Bhuapur, Bhuapur sub-district, Tangail district, Dhaka division. It's a shame to see all this. We don't really know where the real culprit is, but surely the IP he's using has put you and some others there to shame. The hacker knows how he has to hide, and they may use a VPN or TOR to carry out his actions.For now I haven't thought about changing the account password and e-mail, but as I said before, I'm definitely going to be very wary now. Quote from: BitcoinGirl.Club on July 08, 2022, 06:02:31 PMI did not receive PM from newalias, I did not receive any password reset email, all these means that I am a boring user 🤣. I feel left out now. Is it bad or good? 😉No idea, but surely they hate you so much that you are ignored.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nullius",
      "created_time": "July 08, 2022, 10:45:49 PM",
      "body": "xkcd 1121, “Identity”.Relevant recent discussion elsewhere:Quote from: nullius on July 07, 2022, 09:26:21 AMOn a side note, I don’t like that the forum doesn’t let you remove your e-mail address, and/or otherwise totally disable password reset by e-mail.  (Yes, you can set a fake e-mail address; but then, you need to be careful to make sure it can never be valid.  And that does not itself totally disable password reset by e-mail.)  I’m not the only one.  Lauda complained to me about that.On a side note, I don’t like that the forum doesn’t let you disable password authentication, and log in by signing a challenge with your PGP key...  OK, I will stop right here. Quote from: newalias on July 07, 2022, 06:41:01 PMI want to see security questions disabled, option to disable email recovery per account and 2FA introduced. BCT is about large sums and does not have up-to-date security mechanisms.Check if known database compromises could be used to exploit your information from one site to gain access to your accounts at another site:  haveibeenpwned.com.  Most importantly, never use the same password at two different sites—never.  Use a secure password manager, and a different long, random password for each site.Users who value their accounts should be able to disable all automated account recovery mechanisms (other than some hypothetical mechanism that uses strong cryptography; that would be great!).  These “recovery” mechanisms are per-account backdoors.  They are well-known attack surfaces, which have been very frequently exploited for years—sometimes in high-profile cases that make the news.Quote from: https://www.wired.com/2012/08/apple-amazon-mat-honan-hacking/How Apple and Amazon Security Flaws Led to My Epic HackingIn the space of one hour, my entire digital life was destroyed. First my Google account was taken over, then deleted. Next my Twitter account was compromised, and used as a platform to broadcast racist and homophobic messages. Here's the story of exactly how my hackers created havoc by exploiting Apple and Amazon security flaws.Mat HonanAug 6, 2012 8:01 PM[..]And so, with my name, address, and the last four digits of my credit card number in hand, Phobia called AppleCare, and my digital life was laid waste. Yet still I was actually quite fortunate.They could have used my e-mail accounts to gain access to my online banking, or financial services. They could have used them to contact other people, and socially engineer them as well. As Ed Bott pointed out on TWiT.tv, my years as a technology journalist have put some very influential people in my address book. They could have been victimized too.Instead, the hackers just wanted to embarrass me, have some fun at my expense, and enrage my followers on Twitter by trolling.See also:  “A story of how PayPal and GoDaddy allowed the attack and caused me to lose my $50,000 Twitter username.” (2014)Quote from: _BlackStar on July 07, 2022, 06:47:56 PMLooks like the same thing happened to me in less than a week. [...] In the meantime I did a little search about the IP location listed in the e-mail, here are the findings.Quote from: _BlackStar on July 08, 2022, 06:58:11 PMThe hacker knows how he has to hide, and they may use a VPN or TOR to carry out his actions.Tor can be checked.  I had to guess the date for “less than a week” before 2022-07-07.http://hctxrvjzfpvmzh2jllqhgvvkoepxb4kfzdjm6h7egcwlumggtktiftid.onion/exonerator.html?ip=119.30.39.74&timestamp=2022-07-01&lang=enClearnet site for those not using Tor: https://metrics.torproject.org/exonerator.htmlQuote from: https://metrics.torproject.org/exonerator.html?ip=119.30.39.74&timestamp=2022-07-01&lang=enExoneraTorResult is negativeWe did not find IP address 119.30.39.74 on or within a day of 2022-07-01.P.S., pet peeve:Quote from: https://2019.www.torproject.org/docs/faq.html.en#WhyCalledTorNote: even though it originally came from an acronym, Tor is not spelled \"TOR\". Only the first letter is capitalized. In fact, we can usually spot people who haven't read any of our website (and have instead learned everything they know about Tor from news articles) by the fact that they spell it wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}