{
  "id": "topic_5442443",
  "title": "Squaremile777",
  "author": "Squaremile777",
  "created_time": "March 04, 2023, 04:10:36 PMLast edit: March 04, 2023, 09:18:38 PM by Squaremile777",
  "content": "After previous drop down SOL price gained kinda artificially the price.Sol can go to re-test previous lows.Sol can touch 12-15 price range again.After previous crash of SOL i saw a lot instutions money inflow i guess they want to take it back from the retail those who bought in by fomo.Whatever the case Will be Im short with SOL now and market lose the bullish grip Im expecting the 12-15price really. Reason for that becouse price of SOL been pushed up \" kinda artificially\" Usually i dont trade but when i see good opportunity then i trade only Im not trader but more like Dca investor.I have my own style : \"dca until support and resitance by % \"So If i have time i check markets what to trade. But i know it's bit of risky i'll better just do the dca like all the instutions does it",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5442443",
  "comments": [
    {
      "author": "crwth",
      "created_time": "March 04, 2023, 04:35:30 PM",
      "body": "So if I got this right, you said that you predicted it will go even lower because that's what happens when there are institutions money flowing in, right? If I got it correctly, that would mean that they are going to increase the volume since there's inflow, you would bet that they would get it from SOL, hence the short that you are doing. Correct?That's going to be a risk to trade for sure. I'm kind of confused when you said you are short but DCA investor, that would mean long positions. Correct me if I'm wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Squaremile777",
      "created_time": "March 04, 2023, 07:22:00 PM",
      "body": "Quote from: crwth on March 04, 2023, 04:35:30 PMSo if I got this right, you said that you predicted it will go even lower because that's what happens when there are institutions money flowing in, right? If I got it correctly, that would mean that they are going to increase the volume since there's inflow, you would bet that they would get it from SOL, hence the short that you are doing. Correct?That's going to be a risk to trade for sure. I'm kind of confused when you said you are short but DCA investor, that would mean long positions. Correct me if I'm wrong.I said i do DCA usually Im dca guy. But today Im using futures leverage short SOL.But Im doing always dca becouse i use so small % that i will not run out of cash no matter what.Strong support 13$ for SOL until that i don't see it can hold very well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "March 05, 2023, 05:18:23 AM",
      "body": "If Bitcoin loses its recently low then it’s not only Solana which will tank almost all coins will. Even Ethereum which somehow managed to escape breaking its yearly low when Bitcoin break its low from the summer.Solana has a lot of issues. There is always some network issue and you got the deal with its ties to FTX. You need to realize this coin probably will never go back to top 10 ever again. Most people are scaredTo touch it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "March 05, 2023, 07:29:09 AM",
      "body": "Just in case if I will do trade on Solana right now, maybe I can do a small buy the dip below the $20 price because right now, I can see is the $20 here is strong support where right now it is acting support and anytime it can be tested again.So maybe a wick below $20, could be a  good long trade entry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "March 05, 2023, 10:04:26 AM",
      "body": "I wonder why solana is on your watchlist when bitcoin loses it support. I think every coins out there might literally a candidate to go down since bitcoin really dragging down any alts when its on reddish state. But based on the historical, once bitcoin go down then theres gonna be more blood bath on altcoins like solana so typically a short in leverage is a good move. However, bitcoin is quite unpredictable sometime that can ruin some short positions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "March 05, 2023, 11:29:23 AM",
      "body": "Quote from: cryptoaddictchie on March 05, 2023, 10:04:26 AMI wonder why solana is on your watchlist when bitcoin loses it support. I think every coins out there might literally a candidate to go down since bitcoin really dragging down any alts when its on reddish state. But based on the historical, once bitcoin go down then theres gonna be more blood bath on altcoins like solana so typically a short in leverage is a good move. However, bitcoin is quite unpredictable sometime that can ruin some short positions. It's true. If Bitcoin is unwell, has big red candle, altcoins will have bloodpath days and Solana is not a type of altcoin can move oppositely than Bitcoin. Bitcoin falls 10%, altcoins can have 20% or 30% falls and it is proven many times by cryptocurrency market history.I think it is more wisely to wait for Bitcoin fall to finish before thinking of any altcoin. It's more safely to wait for panic effect to complete and the market to calm down after the storm, before buying any altcoin.In the past two months, the market gives us chances to enjoy Bitcoin and altcoin rallies from their bottoms but now, it's not time to be greed. It's time to be careful and only observe the market but prioritize to protect our capital.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wheelz1200",
      "created_time": "March 05, 2023, 08:44:49 PM",
      "body": "Quote from: Squaremile777 on March 04, 2023, 04:10:36 PMAfter previous drop down SOL price gained kinda artificially the price.Sol can go to re-test previous lows.Sol can touch 12-15 price range again.After previous crash of SOL i saw a lot instutions money inflow i guess they want to take it back from the retail those who bought in by fomo.Whatever the case Will be Im short with SOL now and market lose the bullish grip Im expecting the 12-15price really. Reason for that becouse price of SOL been pushed up \" kinda artificially\" Usually i dont trade but when i see good opportunity then i trade only Im not trader but more like Dca investor.I have my own style : \"dca until support and resitance by % \"So If i have time i check markets what to trade. But i know it's bit of risky i'll better just do the dca like all the instutions does it Everything follows bitcoin.  If bitcoin moons so does the alt market and if btc crashes so does the alt market.  Not to say individually coins can't counter that trend but for the most part that's how things go.  The altcoin market just crashes harder and moons higher.  Much more volatile than bitcoin but if you hit it right you can get a good pump.  Lots being talked about sol might have to check it out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sana54210",
      "created_time": "March 07, 2023, 10:42:51 AM",
      "body": "Quote from: tbct_mt2 on March 05, 2023, 11:29:23 AMIf Bitcoin is unwell, has big red candle, altcoins will have bloodpath days and Solana is not a type of altcoin can move oppositely than Bitcoin. Bitcoin falls 10%, altcoins can have 20% or 30% falls and it is proven many times by cryptocurrency market history.I think it is more wisely to wait for Bitcoin fall to finish before thinking of any altcoin. It's more safely to wait for panic effect to complete and the market to calm down after the storm, before buying any altcoin.In the past two months, the market gives us chances to enjoy Bitcoin and altcoin rallies from their bottoms but now, it's not time to be greed. It's time to be careful and only observe the market but prioritize to protect our capital.I think it is not really a must, if you check the markets right now for example you will see that there are some altcoins that didn't went down as much as bitcoin did, and there are some which didn't even fall. It means that the coins you need to invest into could change from day to day, for example SOL could do amazing on a bad market day, or could do terrible on a great market day, it's never a sure thing that it will react the way you expect it to react at all times. Just because it was good at one moment, doesn't mean it will be good each time the same thing happens, it could react well once and then react horrible in another time, we wouldn't really know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "March 08, 2023, 07:06:48 AM",
      "body": "Quote from: Squaremile777 on March 04, 2023, 04:10:36 PMAfter previous crash of SOL i saw a lot instutions money inflow i guess they want to take it back from the retail those who bought in by fomo.SOL is dead. 1- it did not build userbase big enough to justify marketcap2- its connected to FTX and SBF so people wont trust it anymore3- according to what SBF said about \"box tokens\" in his most famous interview ... it would be faster, cheaper, safer and more profitable to lauch new SOL instead of trying to resurrect the old one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "March 08, 2023, 07:25:22 PM",
      "body": "Quote from: cryptoaddictchie on March 05, 2023, 10:04:26 AMI wonder why solana is on your watchlist when bitcoin loses it support. I think every coins out there might literally a candidate to go down since bitcoin really dragging down any alts when its on reddish state. But based on the historical, once bitcoin go down then theres gonna be more blood bath on altcoins like solana so typically a short in leverage is a good move. However, bitcoin is quite unpredictable sometime that can ruin some short positions. Because everyone is just looking their favorite bags as that's the only thing that matters, it's simple as that. But we know in couple of days what's going to happen. I personally think that MTGox distribution is priced in and if we are lucky (and OP is not) there will be a short squeeze. Any kind of other unforeseen fud can't even be calculated. But i am not jinxing it by speculating it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tellek Garing",
      "created_time": "March 09, 2023, 07:09:26 PM",
      "body": "Quote from: Tytanowy Janusz on March 08, 2023, 07:06:48 AMQuote from: Squaremile777 on March 04, 2023, 04:10:36 PMAfter previous crash of SOL i saw a lot instutions money inflow i guess they want to take it back from the retail those who bought in by fomo.SOL is dead. 1- it did not build userbase big enough to justify marketcap2- its connected to FTX and SBF so people wont trust it anymore3- according to what SBF said about \"box tokens\" in his most famous interview ... it would be faster, cheaper, safer and more profitable to lauch new SOL instead of trying to resurrect the old one.I must express my concern about the information you have provided, as it is quite alarming. Sol is one of the projects in which I have invested since the beginning of the bearish market last year, and I am eagerly hoping for its recovery from the low point it reached at the end of last year. However, if the information you have quoted is accurate, it suggests that the potential loss to Sol's investors could be even greater than what happened with Luna. It is my fervent hope that Sol will not experience a similar fate, and that it will not become valueless like Luna did.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JayTrain",
      "created_time": "March 15, 2023, 09:59:34 PM",
      "body": "Quote from: Squaremile777 on March 04, 2023, 04:10:36 PMAfter previous drop down SOL price gained kinda artificially the price.Sol can go to re-test previous lows.Sol can touch 12-15 price range again.After previous crash of SOL i saw a lot instutions money inflow i guess they want to take it back from the retail those who bought in by fomo.Whatever the case Will be Im short with SOL now and market lose the bullish grip Im expecting the 12-15price really. Reason for that becouse price of SOL been pushed up \" kinda artificially\" Usually i dont trade but when i see good opportunity then i trade only Im not trader but more like Dca investor.I have my own style : \"dca until support and resitance by % \"So If i have time i check markets what to trade. But i know it's bit of risky i'll better just do the dca like all the instutions does it Your comment suggests that you are looking at SOL as a trade rather than a long-term investment.  Your opinion is based on technical analysis and the expectation of a possible drop in the price of SOL to the level of 12-15 dollars.  However, as with any trade, there are risks, and therefore it is important to have a clear plan and strategy for getting out of a position if the market goes against you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fullhdpixel",
      "created_time": "March 18, 2023, 06:42:32 PM",
      "body": "Quote from: JayTrain on March 15, 2023, 09:59:34 PMQuote from: Squaremile777 on March 04, 2023, 04:10:36 PMAfter previous drop down SOL price gained kinda artificially the price.Sol can go to re-test previous lows.Sol can touch 12-15 price range again.After previous crash of SOL i saw a lot instutions money inflow i guess they want to take it back from the retail those who bought in by fomo.Whatever the case Will be Im short with SOL now and market lose the bullish grip Im expecting the 12-15price really. Reason for that becouse price of SOL been pushed up \" kinda artificially\" Usually i dont trade but when i see good opportunity then i trade only Im not trader but more like Dca investor.I have my own style : \"dca until support and resitance by % \"So If i have time i check markets what to trade. But i know it's bit of risky i'll better just do the dca like all the instutions does it Your comment suggests that you are looking at SOL as a trade rather than a long-term investment.  Your opinion is based on technical analysis and the expectation of a possible drop in the price of SOL to the level of 12-15 dollars.  However, as with any trade, there are risks, and therefore it is important to have a clear plan and strategy for getting out of a position if the market goes against you.You're right. He is a mix of both trader and investor but more of an investor. He only trades when he saws a good opportunity  (he quoted). Trading is mostly based on technical analysis and he already knows something about it so why won't he try it and see if he can make something good.He is aware that trading is risky but he can always opt for smaller amounts. That should lessen the risk that he will be getting. He may only get smaller returns but it will still be possible to build it up slowly. If all fails, don't worry because he still have a back up and that is his investments on the side. He can still be able to recover his losses in trading and possibly get some extra profits with it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Retainly_Collie",
      "created_time": "March 19, 2023, 06:39:19 AM",
      "body": "Quote from: JayTrain on March 15, 2023, 09:59:34 PMQuote from: Squaremile777 on March 04, 2023, 04:10:36 PMAfter previous drop down SOL price gained kinda artificially the price.Sol can go to re-test previous lows.Sol can touch 12-15 price range again.After previous crash of SOL i saw a lot instutions money inflow i guess they want to take it back from the retail those who bought in by fomo.Whatever the case Will be Im short with SOL now and market lose the bullish grip Im expecting the 12-15price really. Reason for that becouse price of SOL been pushed up \" kinda artificially\" Usually i dont trade but when i see good opportunity then i trade only Im not trader but more like Dca investor.I have my own style : \"dca until support and resitance by % \"So If i have time i check markets what to trade. But i know it's bit of risky i'll better just do the dca like all the instutions does it Your comment suggests that you are looking at SOL as a trade rather than a long-term investment.  Your opinion is based on technical analysis and the expectation of a possible drop in the price of SOL to the level of 12-15 dollars.  However, as with any trade, there are risks, and therefore it is important to have a clear plan and strategy for getting out of a position if the market goes against you.And given the past scenario I believe the OP will soon panic over price fomo issues, such fomo indicates they are new to the market and have yet to anticipate the risks involved.Sol is no longer my preferred choice, but I still remember before when there was an airdrop meme, the Sol community responded and pushed the price up.Anyway, this class is over, maybe we have learned the knowledge and now that the market situation is very good, I think the price will go up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "March 19, 2023, 10:54:42 AM",
      "body": "It's okay if you are still interested in using SOL for trading and indeed, there is a possibility that SOL will still survive after the case yesterday occurred and caused many investors to suffer losses. But you still have to be careful if you want to invest in SOL and manage your money well because we also don't know whether it's true that SOL will still survive or if it will fall again like before. But I think many other coins might have more potential to go up, so you can watch and analyze them too to find the right coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "March 22, 2023, 04:36:34 AM",
      "body": "IF bitcoin loses the support Solana will lose the support too just like the other altcoin unless there is big big news that happens on solana. But I wonder why there is so much people that talked about solana, I mean recent news is that helium is going to move from its native chain to solana and binance decide to delisted the coin from the exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}