{
  "id": "topic_5467810",
  "title": "execrypto",
  "author": "execrypto",
  "created_time": "September 23, 2023, 11:44:48 AMLast edit: October 28, 2023, 06:41:47 PM by execrypto",
  "content": "In the ever-evolving realm of cryptocurrencies, Shiba Inu (SHIB) has emerged as a captivating newcomer, poised to reshape the crypto landscape. At EXEcrypto, your trusted source for up-to-the-minute cryptocurrency insights and news, we invite you to explore the world of Shiba Inu and uncover why it's garnering widespread attention.Shiba Inu in a NutshellShiba Inu, affectionately known as \"SHIB,\" made its debut in August 2020, offering a fresh and playful take on the cryptocurrency market. Inspired by the Shiba Inu dog breed and the success of Dogecoin (DOGE), SHIB has quickly become a notable presence in the crypto sphere.Key Features of Shiba InuCommunity-Driven: SHIB thrives on an enthusiastic and engaged community, much like its DOGE counterpart. Its growth is propelled by the collective passion of its supporters.Decentralized Playground: SHIB introduces ShibaSwap, a decentralized exchange that opens doors to various opportunities, including yield farming, staking, and token swapping.Deflationary Model: With a limited supply, SHIB has the potential to gain value over time, creating a sense of scarcity within the market.Why Shiba Inu MattersShiba Inu is more than just a meme coin; it embodies the spirit of community-driven projects in the cryptocurrency world. Its rapid ascent underscores the influence of collective support and innovation within the crypto community.Stay Informed with EXEcryptoFor the most recent updates, expert analysis, and breaking news about Shiba Inu and the broader cryptocurrency ecosystem, rely on EXEcrypto as your ultimate information hub. We are dedicated to providing you with accurate, timely, and comprehensive information to empower your cryptocurrency decisions.ConclusionShiba Inu (SHIB), with its playful charisma and community-centered approach, is emerging as a force to be reckoned with in the cryptocurrency space. Its journey exemplifies the transformative potential of community backing and the limitless opportunities for innovation within the crypto community. For the latest insights on Shiba Inu and other cryptocurrencies, explore EXEcrypto. Your voyage into the dynamic world of crypto begins here.Source: execrypto.com/what-is-shiba-inu",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467810",
  "comments": [
    {
      "author": "Tytanowy Janusz",
      "created_time": "September 23, 2023, 05:26:45 PM",
      "body": "Quote from: execrypto on September 23, 2023, 11:44:48 AMThe Rising Star Redefining the Crypto Landscapeall shiba did was ridicule the profile of a typical crypto investor. Before the meme coin bubble we were considered investors in modern, innovative technology, after the meme coin bubble we are considered gamblers with a kindergarten mentality. The meme coin bubble ridiculed the entire industry and probably scared away serious investors and technology creators.shame shame shame",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bangjoe",
      "created_time": "September 23, 2023, 05:55:42 PM",
      "body": "What makes Shib special is because he gains popularity when the market is echoing about Dogecoin, which makes meme coin a silly investment such as gambling, and at the beginning of the project is only made for an entertainment without any innovation and creativity for the formation of a network that is in Needed by the development of crypto technology in general.If you see the Shiba ecosystem, it has its own coin as an activation tool, and Shiba is only made as a mask of popularity, and I think it's not healthy for the development of Shiba itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "September 23, 2023, 07:11:52 PM",
      "body": "Somewhat the title is misleading though, I mean SHIB has reach popularity already, it's not like it's rising star in crypto. And what about redefining the crypto landscape? It's another meme coin following DogeCoin so that it makes it special?I think this is just another obvious post shill though, sorry to burst the bubble to the OP. I do understand, in the last bull run, perhaps a lot of us here makes huge profit from it and maybe there are individuals who wanted to have that kind of run in the next bull run. So they will have to shill it again and again. However, this might back fire for those holders, just saying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oneandpure",
      "created_time": "September 23, 2023, 07:13:29 PM",
      "body": "I don't think any special side from shit or meme coins although Shiba Inu (SHIB) have listed on the top exchange market, current Shiba Inu (SHIB) price dropped drastically from their all time high price last two years and seems not second chance with this coins will back to high price Don't be fanaticism with one coins have drop price for seeing they will up again to higher price. So far, Shiba Inu (SHIB) not build real community or get new partner for progressing their project in the future. Only how to make investor are interested for investing in Shiba Inu (SHIB) coin and waiting price up for taking profit, need new innovation for Shiba Inu (SHIB) if want to be more popular altcoin or shit in the future by adopting in real business and become partner for several payment transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "September 23, 2023, 08:49:35 PM",
      "body": "As the OP said, it's just a meme coin so what gives? I mean it all started with Doge and we all know that when you are a prime mover here, you will stay and survived in this market.But now sure about Shib, sorry for those supporters here, but I think it's just a fad or what we call hype in the market. So there will be time that it will be pump hard and then goes down. Unless you are in for that kind of pump and dump scheme, then maybe you will go and invest on this kind of projects. But for those who are really looking for solid project, I guess this kind of meme coins are not for us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "babygun",
      "created_time": "September 23, 2023, 10:33:27 PM",
      "body": "I am pretty sure that 99.9999% of all people that have invested in SHIB thought they would make a nice profit out of it, as when it got launched it went up like crazy. I also invested in it (a while ago) and have around 50% loss so unless we get another bull market and all coins go up like crazy, I will end up with a loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "September 23, 2023, 11:20:03 PM",
      "body": "Quote from: bangjoe on September 23, 2023, 05:55:42 PMWhat makes Shib special is because he gains popularity when the market is echoing about Dogecoin, which makes meme coin a silly investment such as gambling, and at the beginning of the project is only made for an entertainment without any innovation and creativity for the formation of a network that is in Needed by the development of crypto technology in general.If you see the Shiba ecosystem, it has its own coin as an activation tool, and Shiba is only made as a mask of popularity, and I think it's not healthy for the development of Shiba itself.At the end of the day, Shib is still a pump and dump memecoin, not different from Dogecoin.  It thrives on the speculative market and the SHIB marketing department excels in it, they even send half of its circulating coins to Vitalik address just to get attention from investors, it fires back when Vitalik sells it to donate to some charities.Quote from: babygun on September 23, 2023, 10:33:27 PMI am pretty sure that 99.9999% of all people that have invested in SHIB thought they would make a nice profit out of it, as when it got launched it went up like crazy. I also invested in it (a while ago) and have around 50% loss so unless we get another bull market and all coins go up like crazy, I will end up with a loss.I did make a good profit around 5400%, but I am totally out now unless the price crashes back to the price when I purchased it, I may consider buying again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "September 24, 2023, 01:56:59 AM",
      "body": "What is the link at the end of the article? If it is a phishing link, it is better for you to avoid such things because it will lead to your account being banned.Shiba Inu (SHIB) is a way from binance to try to imitate and benefit from any success that happens to dogecoin. If the price increases, they will achieve profits by burning a quantity of coins and taking advantage of the supply difference and the price increase to temporarily pump profits, and so on.The presence of the quadrillion SHIB will make it more of a pump and dump job than a future investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "September 24, 2023, 04:58:53 AM",
      "body": "Quote from: babygun on September 23, 2023, 10:33:27 PMI am pretty sure that 99.9999% of all people that have invested in SHIB thought they would make a nice profit out of it, as when it got launched it went up like crazy. I also invested in it (a while ago) and have around 50% loss so unless we get another bull market and all coins go up like crazy, I will end up with a loss.That is the way things work, people look at those that are able to sell their coins for 100x and more and they think they can get the same results, however in order for someone to get those results this means a great deal of people had to lose their money, so for every winner there are dozens of losers.And while a 50% loss is bad, it seems to me Shiba is popular enough to last until the next bull run and allow you to recover your money, and maybe even obtain a small profit with it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Questat",
      "created_time": "September 24, 2023, 09:54:51 AM",
      "body": "Quote from: babygun on September 23, 2023, 10:33:27 PMI am pretty sure that 99.9999% of all people that have invested in SHIB thought they would make a nice profit out of it, as when it got launched it went up like crazy. I also invested in it (a while ago) and have around 50% loss so unless we get another bull market and all coins go up like crazy, I will end up with a loss.You lose because you are late already but if have invested in this project during its hyped, you will be making a huge profit as well like others. Unfortunately, you'll make a mistake from choosing this while the hype is over and I will tell you that it was hard to expect from a project that comes from hype to rise again. Shiba was known in the fast few days but it was already closing its popularity then and all the investors who are still holding this is already suffering losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kentrolla",
      "created_time": "September 24, 2023, 11:06:27 AM",
      "body": "Quote from: wxa7115 on September 24, 2023, 04:58:53 AMQuote from: babygun on September 23, 2023, 10:33:27 PMI am pretty sure that 99.9999% of all people that have invested in SHIB thought they would make a nice profit out of it, as when it got launched it went up like crazy. I also invested in it (a while ago) and have around 50% loss so unless we get another bull market and all coins go up like crazy, I will end up with a loss.That is the way things work, people look at those that are able to sell their coins for 100x and more and they think they can get the same results, however in order for someone to get those results this means a great deal of people had to lose their money, so for every winner there are dozens of losers.And while a 50% loss is bad, it seems to me Shiba is popular enough to last until the next bull run and allow you to recover your money, and maybe even obtain a small profit with it.I hope it works out like that only else many who have invested in SHIB when it was at peak will not be able to recieve it though most would have sold it due to panic selling, but I feel this bull run it would be different set of coins which will pump because if we consider 2017 bill run then those coins which pumped hard didn't make any impact in recent bull run and I guess even this time the same process will repeat. We need to start analysing and shortlisted the potential coins now itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VFalcon",
      "created_time": "September 24, 2023, 01:07:10 PM",
      "body": "I once also believed in SHIBA and thought that I could make money on this token, but after manipulations with it stopped even thinking about it. I just found a TFS token and now I am steadily increasing my profits thanks to their high APR",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iv4n",
      "created_time": "September 24, 2023, 01:47:51 PM",
      "body": "Quote from: VFalcon on September 24, 2023, 01:07:10 PMI once also believed in SHIBA and thought that I could make money on this token, but after manipulations with it stopped even thinking about it. I just found a TFS token and now I am steadily increasing my profits thanks to their high APRTFS Token... you mean the one from FairSpin casino? Well, they offer a nice APR I saw it, but they are also \"KYC mandatory\", something I don't like... so I didn't even register on the site. But generally, I like casino tokens, to earn them by playing and later to stake them for some additional rewards. Well, Shiba Inu is just a meme coin... maybe we will see some price rise in the future, maybe not, but I don't expect miracles in some short period of time. I like to compare it with Doge, a stable price most of the time, and there's always a chance for the price to skyrocket... we just need to see Elon (or someone similar) pushing it a bit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Furious 7",
      "created_time": "September 24, 2023, 04:57:12 PM",
      "body": "Quote from: execrypto on September 23, 2023, 11:44:48 AMWhy Shiba Inu MattersShiba Inu is more than just a meme coin; it embodies the spirit of community-driven projects in the cryptocurrency world. Its rapid ascent underscores the influence of collective support and innovation within the crypto community.That's right, the Shiba Inu is not just a meme coin but much more than that. Many of us already know that Shiba Inu is one of the meme coins (shitcoins) that in the end just say very wisely as if they have a large community but in fact they remain the same and the community that is talked about until now is just a cover to make beginners fooled because in the end they remain the same as other shitcoins by only relying on the pump after which it is thrown back down after making a profit and bragging again that they have a strong community Those who are in Shiba right now are probably just those who are still waiting and hoping for a pump and those who are stuck not making a profit no more than that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vaskiy",
      "created_time": "September 24, 2023, 11:26:05 PM",
      "body": "Shiba redefining the crypto space is just a statement within meaning. It emerged as a memecoin and profited good number of users. Initially lacked development and further the growth lead to the formation of good development team and community.The development team keeps trying to stabilize the price without drastic loss in the value as the supply is huge. For this several burn process were followed and things were kept under control, yet the price keeps dropping. During the same time more stores begun to accept Shiba, but in reality those are just words. Shiba can be considered one among the memecoin,but it doesn't have the hype as eloborated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamifoud",
      "created_time": "September 25, 2023, 06:51:19 AM",
      "body": "Shiba is a promising project but that was before. There is a saying that once a meme coin always a meme coin. As we think about how these mems coins showed to us, we can say that they are just good during their hypes but there is no sustainable growth to see after and this is what it happened to Shiba Inu and Pepe coin. Now, if you think that was promising, that was your opinion but if you have to analyze its current market performance, you'll find out what a huge decline.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bangjoe",
      "created_time": "September 25, 2023, 07:54:05 AM",
      "body": "Quote from: serjent05 on September 23, 2023, 11:20:03 PMQuote from: bangjoe on September 23, 2023, 05:55:42 PMWhat makes Shib special is because he gains popularity when the market is echoing about Dogecoin, which makes meme coin a silly investment such as gambling, and at the beginning of the project is only made for an entertainment without any innovation and creativity for the formation of a network that is in Needed by the development of crypto technology in general.If you see the Shiba ecosystem, it has its own coin as an activation tool, and Shiba is only made as a mask of popularity, and I think it's not healthy for the development of Shiba itself.At the end of the day, Shib is still a pump and dump memecoin, not different from Dogecoin.  It thrives on the speculative market and the SHIB marketing department excels in it, they even send half of its circulating coins to Vitalik address just to get attention from investors, it fires back when Vitalik sells it to donate to some charities.And yes it is also a benchmark why Shiba Inu became noticed at that time so that it was increasingly popular that made everyone enthusiastic about buying Shib, for the class of meme coins, it was the history of their biggest success in the Indusrty Cryptocurrency, besides sharing for vitalik charity and also burned Most of the ownership of the shib token shib that makes the urge to be higher at price pressure.Quote from: serjent05 on September 23, 2023, 11:20:03 PMQuote from: babygun on September 23, 2023, 10:33:27 PMI am pretty sure that 99.9999% of all people that have invested in SHIB thought they would make a nice profit out of it, as when it got launched it went up like crazy. I also invested in it (a while ago) and have around 50% loss so unless we get another bull market and all coins go up like crazy, I will end up with a loss.I did make a good profit around 5400%, but I am totally out now unless the price crashes back to the price when I purchased it, I may consider buying again.I also made a profit at that time approximately 1500% even though I did not sell at the highest price but I got a decent profit with a small capital, but for me, I would not buy back Shib even though the price returned to the price at the time of my first purchase, that Very risky, maybe to test the luck $ 20 is enough for that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "September 25, 2023, 08:54:50 AM",
      "body": "I'm not gonna lie, but I think Shiba Inu has some potential because they are expanding the usage of this token into some other matters useful. this is not the case for other meme coins because right now, they haven't proven anything more than they are doing inside their platforms and nothing is going to change their development if they don't do what the Shiba Inu did. I wanted to see in the future that they can also be something like accepting payments in the other big stores online if they can do that, then we can say that they are improving a lot and they are really following their plans on their roadmaps.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "September 25, 2023, 12:37:05 PM",
      "body": "Is anyone else interested in this memcoin? It has played its role in the crypto world for a long time, has gathered a large capitalization, enriched its creators and made a lot of investors who bought this token in 2021, during the SHIB hype period, lose money. Now the community is interested in other memcoins that are growing fast and bringing in lots of x's. I don't think SHIB will ever be able to do that again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}