{
  "id": "topic_5450687",
  "title": "mir0trx",
  "author": "mir0trx",
  "created_time": "April 30, 2023, 08:51:28 AM",
  "content": "Bonjour,je m'appelle Miroslav et je suis le cofondateur de Wimblee, une plateforme qui référence les produits de différents sites acceptants les crypto comment moyen de paiement.Voici le lien : https://www.wimblee.com/fr/Dispo en FR / ENG il facilite la recherche sur des produits crypto et vous fera gagner du temps. (Je précise que chaque article à la finalité (lorsque vous souhaitez payer) vous redirige vers le site marchand et contient un lien d'affiliation).Avant tout, nous aimerions des retours constructifs sur le site pour ceux qui iront y faire un tour, je vous remercie par avance.Pour le reste, je serais ravi de répondre à toutes vos questions et interrogations Agréable journée.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450687",
  "comments": [
    {
      "author": "paid2",
      "created_time": "April 30, 2023, 12:06:01 PM",
      "body": "Salut Miroslav,Je viens de passer un petit moment sur ton site. le concept est vraiment cool !Cependant, la quasi totalité des produits me renvoie vers un 404 error :Sinon, en dehors de ça, la base semble propre et c'est agréable à parcourir, le site est réactif et ne pose pas de problème. Penses-tu intégrer un darkmode ? Cela pourrait plaire à certains utilisateurs (dont moi  )",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mir0trx",
      "created_time": "April 30, 2023, 12:27:23 PM",
      "body": "Hello ! Merci pour ton retour, effectivement on a fait une mise à jour hier soir et nous n'avons pas vérifiés les produits via le menu, c'est réglé à présent !Pour le darkmode, on y réfléchit mais effectivement j'aimerais aussi l'avoir haha.N'hésites pas à partager le lien autour de toi si tu as des connaissances que ça pourrait intéresser, nous avons sorti le site il y a un peu plus d'un mois maintenant donc chaque nouvelle personne qui adhère au site compte énormément pour nous  A bientôt !Miroslav",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "April 30, 2023, 01:14:07 PM",
      "body": "Quote from: mir0trx on April 30, 2023, 12:27:23 PMMerci pour ton retour, effectivement on a fait une mise à jour hier soir et nous n'avons pas vérifiés les produits via le menu, c'est réglé à présent !Ouais en effet ça marche parfaitement maintenant, très cool votre réactivité ! Cependant, si tu me permets de faire un peu le chieur, j'ai remarqué autre chose qui ne fonctionne pas trop. Si je sélectionne \"Afficher le prix en BTC\" par exemple, le prix reste en euros, même après avoir refresh la page :QuoteN'hésites pas à partager le lien autour de toi si tu as des connaissances que ça pourrait intéresser, nous avons sorti le site il y a un peu plus d'un mois maintenant donc chaque nouvelle personne qui adhère au site compte énormément pour nous  Ouais je vais faire le maximum de publicité possible, mais les répercussions ne seront pas dingues pour vous malheureusement haha, le problème c'est que je suis dans un pays d'Europe de l'Est où les services postaux/douanes sont nul à chier, et les gens autour de moi n'ont pas trop la culture de commander des biens physiques en ligne à cause de ça..Je vais donner le lien à mes amis en France, je sais que certains seront contents d'avoir une sorte de centralisation d'offres acceptant les cryptos, j'espère qu'ils passeront des commandes pour tester et surtout que vous arriverez à vous lancer comme il se doit  Bonne continuation!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mir0trx",
      "created_time": "April 30, 2023, 01:28:14 PM",
      "body": "Alors là pour le coup c'est étrange je n'arrive pas à reproduire ton problème .. et ça m'intrigue ! On a jamais eu de retour sur ça en plus, peut-être essayer sur un autre navigateur voir si ça fait la même chose.. Et merci pour le reste, ça fait plaisir d'avoir du soutiens !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "April 30, 2023, 01:40:59 PM",
      "body": "Quote from: mir0trx on April 30, 2023, 01:28:14 PMAlors là pour le coup c'est étrange je n'arrive pas à reproduire ton problème .. et ça m'intrigue ! On a jamais eu de retour sur ça en plus, peut-être essayer sur un autre navigateur voir si ça fait la même chose.. Et merci pour le reste, ça fait plaisir d'avoir du soutiens !Oh au temps pour moi, ça fonctionne bien avec Firefox. J'ai le problème avec Brave, mais les autres navigateurs rien à signaler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GrosWesh",
      "created_time": "April 30, 2023, 01:47:01 PM",
      "body": "Sympa le site ! J'avais moi aussi l'erreur 404 mais ça a été rapidement réparé, c'est cool.Mais pour être franc, j'attendrai d'avoir des retours d'autres utilisateurs plus téméraires avant de commander par contre",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "April 30, 2023, 01:52:50 PM",
      "body": "Quote from: GrosWesh on April 30, 2023, 01:47:01 PMSympa le site ! J'avais moi aussi l'erreur 404 mais ça a été rapidement réparé, c'est cool.Mais pour être franc, j'attendrai d'avoir des retours d'autres utilisateurs plus téméraires avant de commander par contre  Perso ça me semble pas trop risqué dans la mesure où le site t'envoie vers les sites des marchands. Ou j'ai loupé quelque chose ? Quand je clique sur \"voir\" je retombe jamais sur wimblee de mon côté, donc si le vendeur est ok et réputé je pense que ça peut le faire sans stress",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mir0trx",
      "created_time": "April 30, 2023, 01:55:19 PM",
      "body": "C'est gentil merci pour ton retour !Au final ce n'est pas nous qui vendons, on se contente simplement de proposer un catalogue le plus diversifié possible, donc pour chaque vendeur tu peux te référer directement aux retours de leur site pour être plus sur A bientôt !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}