{
  "id": "topic_5456445",
  "title": "thecryptogandalf",
  "author": "thecryptogandalf",
  "created_time": "June 15, 2023, 01:55:26 PMLast edit: June 19, 2023, 07:19:51 AM by thecryptogandalf",
  "content": "Hello everyone, it has been quite a while developing the Manual Backtester tool, aiming make backtesting more efficient. I would really appreciate your feedback, especially from fellow traders within the community. Feel free to explore the project on cleo.finance, and let me know your thoughts. EDIT: It is already finished, you can try it now. Here are the features:Replay assets in real-time, enabling you to analyze historical data as if you were trading live.Automatically calculate statistics for more informed decision-making.Pause and save you backtests, enabling you to come back and continue at any time.Place positions, simulate candle movements and set multiple stop-loss and take-profit levels.Create custom drawings such as trendlines or rectangles.View past positions' take-profit and stop-loss levels.Adjust playback speed, navigate through timeframes, and jump to specific times.Set targets and stops by dragging them on the chart using the Drag & Drop feature.Access an expandable detailed position table with information on position details, order list, take profit, and stop loss. You can also track the transaction costs associated with your positions when backtesting, allowing for more realistic results.Funding fees, commissions, and slippage are visualized on the chart, as well as in the full breakdown of statistics. The spread, commissions, and slippage that you set will appear as a yellow line and will impact all profit and loss (PnL) calculations. You can set these fees at the beginning of the backtest in the second step of the backtest settings.The tool is built to make backtesting a fast and painless process. For further improvement, it would be great to have your suggestions and feedback so that it can get better for traders.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456445",
  "comments": [
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "June 15, 2023, 03:07:45 PM",
      "body": "I think you've made a good development which i have that strong feelings that some might be interested of making use of to serve as an additional tools for them to be able to track down their trades, market price and other past informations needed to keep on track records concerning their bitcoin trading experience, though we shouldn't rely on a single entity to derive our conclusion on bitcoin market price speculation because the more we explore dip the more results we get differently.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecryptogandalf",
      "created_time": "June 19, 2023, 07:12:59 AM",
      "body": "Quote from: greengrassis on June 16, 2023, 06:35:07 PMThe most difficult task so far is to implement it all. I think this is also quite difficult and enough time needs to be devoted to the implementation of this plan.Yes, we have been working on it for quite a while. Now it is all implemented so you can try it now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecryptogandalf",
      "created_time": "June 19, 2023, 07:17:04 AM",
      "body": "Quote from: Aanuoluwatofunmi on June 15, 2023, 03:07:45 PMI think you've made a good development which i have that strong feelings that some might be interested of making use of to serve as an additional tools for them to be able to track down their trades, market price and other past informations needed to keep on track records concerning their bitcoin trading experience, though we shouldn't rely on a single entity to derive our conclusion on bitcoin market price speculation because the more we explore dip the more results we get differently. Very good point, the aim is to provide a space for traders that they constantly improve their trading approach. They can leverage these kind of innovative tools to increase their trading success and have a better insight into the markets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}