{
  "id": "topic_5472146",
  "title": "mexcycle",
  "author": "mexcycle",
  "created_time": "October 30, 2023, 04:46:55 AMLast edit: October 30, 2023, 05:31:38 AM by mexcycle",
  "content": "It is a fraudulent scam site and has not been able to withdraw money for 3 days. I did not launder money and am a normal game user. I submitted this deposit information and also completed KYC authentication. But they don't even allow withdrawals.The site claims that it is a game without KYC, but this is not true and they are trying to give you money. Everyone, this site’s withdrawals are very strict, so don’t play the game!The customer service center is full of people and doesn't respond all day long. No answer even though it’s Monday!https://talkimg.com/images/2023/10/30/TbumC.pngIt was posted as a site without KYC, but contrary to the truth, it is requesting KYC. This is a fraudulent site.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472146",
  "comments": [
    {
      "author": "PX-Z",
      "created_time": "October 30, 2023, 04:56:29 AM",
      "body": "It's true that's there's no info on their website regarding the asking of KYC. Can you still login your account? Can you share screenshots of your account status for the withdrawal and the convo with their CS. It's hard to call them here since their rep here is inactive anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "October 30, 2023, 04:58:58 AM",
      "body": "Quote from: mexcycle on October 30, 2023, 04:46:55 AMIt is a fraudulent scam site and has not been able to withdraw money for 3 days. I did not launder money and am a normal game user. I submitted this deposit information and also completed KYC authentication. But they don't even allow withdrawals.The site claims that it is a game without KYC, but this is not true and they are trying to give you money. Everyone, this site’s withdrawals are very strict, so don’t play the game!The customer service center is full of people and doesn't respond all day long. No answer even though it’s Monday!Move this topic on scam accusation board https://bitcointalk.org/index.php?board=83.0 and provide evidence about your case in the form of screenshots. You can use your conversation with the support so that we can determine what’s the full context on your case instead of directly accusing them without a proof.Use talkimg.com to upload image and share the link here.Scam report formatCode:[b][color=black]What happened:: [/color][/b][b][color=black]Scammers Profile Link: [/color][/b][b][color=black]Reference Link: [/color][/b][b][color=black]Amount Scammed: [/color][/b][b][color=black]Payment Method: [/color][/b][b][color=black]Proof of Payment: [/color][/b][b][color=black]PM/Chat Logs: [/color][/b][b][color=black]Additional Notes: [/color][/b]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mexcycle",
      "created_time": "October 30, 2023, 05:01:04 AM",
      "body": "https://talkimg.com/images/2023/10/30/TKqSo.pngYour account status is normal. I want to attach a photo, but I don't know how to do so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mexcycle",
      "created_time": "October 30, 2023, 05:24:30 AM",
      "body": "Quote from: PX-Z on October 30, 2023, 04:56:29 AMIt's true that's there's no info on their website regarding the asking of KYC. Can you still login your account? Can you share screenshots of your account status for the withdrawal and the convo with their CS. It's hard to call them here since their rep here is inactive anymore. https://tronscan.org/#/address/TFFvEezrM9bxK1D7TG7QiBqS9yfefEvWHiThis is the headquarters wallet.Headquarters does not have sufficient funds!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UserU",
      "created_time": "October 30, 2023, 12:00:18 PM",
      "body": "Quote from: mexcycle on October 30, 2023, 05:01:04 AMYour account status is normal. I want to attach a photo, but I don't know how to do so.Your account rank has to reach Jr. Member which requires 1 Merit given by someone.Alternatively, you can purchase the Copper Membership for a fee although it's not worth it solely for this case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahdirakib",
      "created_time": "October 30, 2023, 12:08:15 PM",
      "body": "Quote from: mexcycle on October 30, 2023, 04:46:55 AMIt was posted as a site without KYC, but contrary to the truth, it is requesting KYC. This is a fraudulent site.Interesting, I also know them as a 'No KYC' casino. Even they have mentioned it several times in their home page. Luckydice.com is the sister site of BitKong.com. BitKong email support had confirmed me in the November month of 2022 that they don't request for KYC. I had added BitKong in this thread according to the information.How much you had deposited there? I can see that your withdrawal amount is 19.3k USDT. Maybe they are considering it as a large withdrawal, and they will process it manually.Quote from: https://luckydice.com/en/terms-of-useIn case of large withdrawals, manual processing may be implemented. Manual withdrawals are processed on business days from 10:00 to 18:00 GMT.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "luckydice.com",
      "created_time": "October 30, 2023, 12:28:09 PM",
      "body": "Hello!We have been in the market for 4 years with Luckydice and 8 years with BitKong, making our company one of the oldest in the market. Throughout our long operational history, we have required KYC from only a few players whom we suspect of money laundering. One such player deposited 0.57226183 BTC and, two minutes after the deposit without making any bets, withdrew 19,308.86 USDT over the Tron network. According to our terms of use (https://luckydice.com/en/terms-of-use exchange section), the exchange function is solely for game-related purposes, and deposit/exchange/withdrawal is prohibited. We are not an exchange, and in the event that our site is used as an exchange, we require certain documents to protect ourselves against potential future government inquiries regarding such transactions.We typically resolve these kinds of issues within a few hours. However, since the deposit was made on a Friday and our team, which handles this does not work over the weekend, it took a few days. We hope everything is clear.Here is the link to the transaction:https://tronscan.org/#/transaction/3738a67779781c527d85cd24f2d7f8d55869cfc0a7c59f0a577e46b921380810Thanks!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mexcycle",
      "created_time": "October 30, 2023, 12:37:16 PM",
      "body": "Quote from: luckydice.com on October 30, 2023, 12:28:09 PMHello!We have been in the market for 4 years with Luckydice and 8 years with BitKong, making our company one of the oldest in the market. Throughout our long operational history, we have required KYC from only a few players whom we suspect of money laundering. One such player deposited 0.57226183 BTC and, two minutes after the deposit without making any bets, withdrew 19,308.86 USDT over the Tron network. According to our terms of use (https://luckydice.com/en/terms-of-use exchange section), the exchange function is solely for game-related purposes, and deposit/exchange/withdrawal is prohibited. We are not an exchange, and in the event that our site is used as an exchange, we require certain documents to protect ourselves against potential future government inquiries regarding such transactions.We typically resolve these kinds of issues within a few hours. However, since the deposit was made on a Friday and our team, which handles this does not work over the weekend, it took a few days. We hope everything is clear.Here is the link to the transaction:https://tronscan.org/#/transaction/3738a67779781c527d85cd24f2d7f8d55869cfc0a7c59f0a577e46b921380810Thanks!This is a screenshot of the kyc request.https://talkimg.com/images/2023/10/30/TbumC.pngI played the game. I will upload a screenshot of the game I played.https://talkimg.com/images/2023/10/30/TpGio.pngI played a game at Bustabbit and deposited it knowing the casino inzul, but the game was boring and I didn't find it fun, so I withdrew it. It seemed like it would be great if there was a swap function and I could swap it without having to sell it on the exchange, so I withdrew it right away.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mexcycle",
      "created_time": "October 30, 2023, 12:47:36 PM",
      "body": "It doesn't make sense. The above statement is false. There were clearly no coins in the wallet. They even requested KYC under the pretext of fraud and made nonsense about money laundering and all that. Then I wrote in the chat room that I would spread the news online. Attach photos. And then the money was withdrawn!https://talkimg.com/images/2023/10/30/TpIYv.png",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahdirakib",
      "created_time": "October 30, 2023, 12:59:08 PM",
      "body": "Quote from: luckydice.com on October 30, 2023, 12:28:09 PM~snip~I'm not sure whether you appeared here after getting my email or not. But thank you for clarifying the situation.Quote from: mexcycle on October 30, 2023, 12:37:16 PMI played a game at Bustabbit and deposited it knowing the casino inzul, but the game was boring and I didn't find it fun, so I withdrew it.Your deposited amount was equivalent to $20k, where you have wagered only $100 with that. It doesn't matter how much you have wagered on Bustabit. Although, Luckydice stands with 'No-KYC', but I think the KYC verification was reasonable in your case. Think twice before making a large deposit on a casino to withdraw it after wagering a tiny part of the deposited amount.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mexcycle",
      "created_time": "October 30, 2023, 01:02:01 PM",
      "body": "Quote from: Mahdirakib on October 30, 2023, 12:59:08 PMQuote from: luckydice.com on October 30, 2023, 12:28:09 PM~snip~I'm not sure whether you appeared here after getting my email or not. But thank you for clarifying the situation.Quote from: mexcycle on October 30, 2023, 12:37:16 PMI played a game at Bustabbit and deposited it knowing the casino inzul, but the game was boring and I didn't find it fun, so I withdrew it.Your deposited amount was equivalent to $20k, where you have wagered only $100 with that. It doesn't matter how much you have wagered on Bustabit. Although, Luckydice stands with 'No-KYC', but I think the KYC verification was reasonable in your case. Think twice before making a large deposit on a casino to withdraw it after wagering a tiny part of the deposited amount.The company is responding to me mentioning that I withdrew money without even placing a bet. Please read the post clearly!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahdirakib",
      "created_time": "October 30, 2023, 01:08:05 PM",
      "body": "Quote from: mexcycle on October 30, 2023, 01:02:01 PMThe company is responding to me mentioning that I withdrew money without even placing a bet. Please read the post clearly!Yep, I have seen it. But it is same as placing no bets as you have wagered only 0.5% of the deposited amount. Moreover, you have exchanged your BTC and made the withdrawal in USDT. Kindly lock this thread as you have already received your withdrawal. I can't see any reason to continue the discussion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}