{
  "id": "topic_5403790",
  "title": "Betesports",
  "author": "Betesports",
  "created_time": "June 23, 2022, 03:52:15 PMLast edit: June 23, 2022, 04:02:24 PM by Betesports",
  "content": "hi thereI have struggled to withdraw 563 usd on this site since beginning of May. they made various of excuses not to pay me, rejecting even management placed withdrawals. First they told me their platform had problems placing withdrawals, and they asked to sent a request via email which I did and they placed it manually. After almost a week they rejected it giving me no explanation. On live chat they told me that they have no clue what's happening and by email they also did not answer. After a while of contacting them they told me to place it again which I did but also that one was rejected. Then their site goes down and after a while a new platform appeared. On the new platform I had no access to my account. On live chat they told me to email to security some details of the account so they can restore it to the new platform. I did it but then they asked also the has transaction of the deposit I made. If I had access to my account I would find it in seconds... However I had 2 almost identic transactions on my bitcoin wallet made on the day I deposited with them and sent to them the 2 transactions also explaining that one of them was for sure the deposit to Bitlucy. First Bitlucy pointed one of them was it, and then they told me that it was not. This is just an excuse not to pay me. I'm 1 million % that one of the 2 transactions is the deposit. I also sent them the screenshots of my account with my balance on the old platform. Now they are not even responding anymore. This is just scam. They have not any intention to pay. please be awarehttps://imgur.com/a/nSv9Pjtscreenshots of the 2 last email exchanges and also of my balance and withdrawals rejected by them",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403790",
  "comments": [
    {
      "author": "acroman08",
      "created_time": "June 23, 2022, 06:15:05 PM",
      "body": "their casino has cut contact here in the forum and Royse777 who used to manage their signature campaign and their ANN thread has said that he is not representing Bitlucy anymore. perhaps try posting this on casino.guru to increase exposure. you can also try contacting their licence provider regarding the issue. here's his last post on their ANN thread.Quote from: Royse777 on June 16, 2022, 11:03:40 AMThe management of BitLucy has decided to cut off all connections from bitcointalk and I am not officially representing bitlucy on bitcointalk anymore, according to them it's hostile to conduct a business in the forum especially a new business who are still in their baby steps. This means after resolving the cases (valid cases) filled up via the Google form (close after 17th as mentioned on the post), I will not be responsible for anything else anymore for bitlucy on the forum.Quote from: Royse777 on June 11, 2022, 02:46:40 PMI would request anyone who had issue with bitlucy, let me know. First post the issue in the ANN thread and then fill up the form (The spreadsheet will be private so please don't worry about personal information. I need to know your problem and if this is valid, you will get solution).https://forms.gle/ra1Uk5xVhJmfq9kR8The form will be closed after 17th.Please make one entry for one user, make my life easier.Furthermore, there will be no more promotions, no official representation from bitlucy in this forum too.I will lock this thread in the next 24 hours to finish it officially.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "June 23, 2022, 08:14:30 PM",
      "body": "OP, here is the last post Royse777 made in which he explained what happened with bitlucy:Royse777, Bitlucy and long story in briefHe said there are only four customers who filled out the form and he will try to reimburse them by sending them their initial deposits. I don't know if you are one of those four customers who filled out the form but if you are not, try contacting him and see if you can reach an arrangement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "June 23, 2022, 10:02:27 PM",
      "body": "Quote from: khaled0111 on June 23, 2022, 08:14:30 PMOP, here is the last post Royse777 made in which he explained what happened with bitlucy:Royse777, Bitlucy and long story in briefHe said there are only four customers who filled out the form and he will try to reimburse them by sending them their initial deposits. I don't know if you are one of those four customers who filled out the form but if you are not, try contacting him and see if you can reach an arrangement. Bitlucy has taken a toll on Royse777 reputation I just notice he has an existing flag because of collaboration with Bitlucy although Royse777 has explained his side of the story, I don't think this is going to be the last one and many more complaints like this one will pop up here in Bitcointalk, I hope this thread will contribute to the awareness of people about Bitlucy's state, its not worth playing here anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "June 23, 2022, 10:34:27 PM",
      "body": "For some reason, I wasn't interested in BitLucy casino from the start, so I didn't follow the whole the drama. Op, I am sorry for your loss but I doubt you will get any response here because I do not think BitLucy has an official representative here anymore. Have you tried reaching out to Royce777 to see if he can assist in any way? As far as I know, he was part of the BitLucy team.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "June 24, 2022, 01:54:22 AM",
      "body": "Sorry for the loss, the best is to avoid Bitlucy, it is nothing more than a scam site, anyone that uses that betting site should just consider their money gone. The betting site even had a campaign on this forum recently, the campaign participants were complaining that the site do not pay them, also people that are using the site are complaining that they can not withdraw. The site is a scam site and a reason to best avoid the site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "June 25, 2022, 02:34:47 PM",
      "body": "Sorry OP.They are no longer in the forum, as has been explained to you, and it seems to me that the site has disappeared, although it has been on and off lately, probably taking advantage to fleece some unwary before disappearing again.The bad thing about this is that regardless of Royse777's reputation, many people have lost their money, some from the forum but who knows how many who are not on this forum will have been scammed as well.Quote from: khaled0111 on June 23, 2022, 08:14:30 PMOP, here is the last post Royse777 made in which he explained what happened with bitlucy:Royse777, Bitlucy and long story in briefHe said there are only four customers who filled out the form and he will try to reimburse them by sending them their initial deposits. I don't know if you are one of those four customers who filled out the form but if you are not, try contacting him and see if you can reach an arrangement. She also gave a deadline that in theory has passed. Apparently she is no longer related to the owner of Bitlucy and paid the signature campaigns out of her own pocket and it seems to me that it was mentioned that she was going to try to pay the withdrawals as well to save her reputation, but I doubt it, especially if the amount is high.In any case, the OP should try, because he has nothing to lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}