{
  "id": "topic_5445847",
  "title": "MeCsc",
  "author": "MeCsc",
  "created_time": "March 21, 2023, 07:47:16 PMLast edit: March 25, 2023, 09:32:39 PM by MeCsc",
  "content": "I Ask a question out of curiosity about this at first but no response so I did some research and here is what I found out :The Nigeria homicide detective are under the FCID (Force Criminal Investigation Department).FCID is the highest investigating arm of the police force, they investigate and prosecute serious and complex criminal case within and out Nigeria.Sections under the FCID include Forensic science, Anti-Human Trafficking, interpol and others. See full list of all sections of the FCID and who control them here Nigeria Police Force Criminal Investigation and Intelligence DepartmentCriminologists: Criminologists is one who study criminology. While Criminology is the study of crime and criminal behaviour. Criminology is a Course of study in some universities in Nigeria like University of Ilorin (UNILORIN), University of Jos (UNIJOS), Kaduna State University (KASU), University of Ibadan (UI) and others.Requirements to Study Criminology in Nigeria :O’Level Subject CombinationYou need Five (5) SSC credit passes which must include English Language, Mathematics, and any other four subjects.JAMB Subject combinationYou need Economics, Mathematics and any of Government, History, Geography, Literature in English, French and Christian Religious Studies /Islamic Studies.Direct Entry Admission Requirements:i). Two (2) A-Level passes in Social Science or Arts subjects.ii). ND in Law, Public Administration, Criminal Justice with passes at lower credit or higher grade.In our discussion about the Nigeria police force most of us don't really know that there are various departments in the Nigeria police force and they all have their specialisation.Here is a link to see how the Nigeria police force (NPF) is structured  NPF Structure",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445847",
  "comments": []
}