{
  "id": "topic_5450011",
  "title": "cygan",
  "author": "cygan",
  "created_time": "April 24, 2023, 02:51:54 PMLast edit: May 28, 2024, 09:32:55 AM by cygan",
  "content": "Autor: GazetaBitcoinWątek oryginalny: Bitcoin: The dream of Cypherpunks, libertarians and crypto-anarchistsUlga reprezentująca Rzymian płacących podatki || Źródło zdjęcia: historyhit.comRządy uciskają ludzi od wieków. Jedna z pierwszych form takiego ucisku narodziła się w czasach Imperium Rzymskiego, 2000 lat temu. Czas mijał, ale praktyka ta pozostała. Metody są różne, m.in. podatki bezpośrednie, podatki pośrednie, inflacja, cenzurowanie dostępu do informacji, akty oskarżenia, prohibicja, niewolnictwo, niesprawiedliwe procesy, zbieranie danych osobowych i wykorzystywanie ich przeciwko uczciwym ludziom. Wszystkie one jednak prowadzą do tego samego nadrzędnego celu: władza ma pozostać w rękach elit, a biedni mają pracować na rzecz elit. Ludzie walczyli, ale w większości przypadków z pustymi rękami. Ta epicka bitwa, która trwa od czasów starożytnych, została najlepiej opisana przez Murraya Rothbarda jako \"wielki konflikt, który wiecznie toczy się między wolnością a władzą\".Jednym ze sposobów na uzyskanie wolności i swobody były prywatne pieniądze, ale rządy nie zgadzały się na taką konkurencję. A monopol na bicie monet władze mają już od czasów Imperium Rzymskiego. Jednak pragnienie ludzi do posiadania prywatnego pieniądza zaczęło się wieki temu i historia mówi nam, że w wielu przypadkach prywatny pieniądz istniał w różnych formach.Znakomity ekonomista i filozof Friedrich August von Hayek, laureat Nobla w dziedzinie nauk ekonomicznych w 1974 roku, podniósł bardzo uzasadnioną debatę w swoim arcydziele Denacjonalizacja pieniądza: Argument dopracowany: \"[...] nie można przestać się zastanawiać, dlaczego ludzie tak długo znosili, że rządy przez dwa tysiące lat sprawowały wyłączną władzę, która była regularnie wykorzystywana do ich wykorzystywania i defraudacji\". Inną emblematyczną postacią, która podtrzymywała potrzebę istnienia prywatnego pieniądza, jest Murray Rothbard.Między 1700 a 1900 rokiem w Stanach Zjednoczonych krążyły różne prywatne monety. Pierwszą prywatną monetą w historii USA jest miedziana moneta Higley, wybita w 1737 roku przez rodzinę Higley. Być może najbardziej popularne są złote monety Bechtlera (pierwsza emisja w 1831 roku), znane z tego, że mają większą czystość niż monety emitowane przez państwo. Również firma Moffat&Co z San Francisco zapisała kartę historii w czasie gorączki złota, bijąc swoje monety. Jedną z najbardziej poszukiwanych monet był Brasher Doubloon, wybity przez Ephraima Brashera w 1787 roku. Z innych godnych uwagi monet bitych prywatnie należy wymienić: Morgan Dollars, Saint-Gaudens Double Eagles, Barber Quarter. Oczywiście rząd nie zgadzał się z prywatnymi mennicami, ale pewne jest to, że w różnych momentach istniały prywatnie bite pieniądze. Monety te były używane na dużą skalę, bez względu na wysiłki państwa mające na celu ich zamknięcie.Libertarianizm i anarchizmMurray Rothbard || Źródło zdjęcia: fee.org\"Definiuję społeczeństwo anarchistyczne jako takie, w którym nie ma prawnej możliwości przymusowej agresji przeciwko osobie lub własności jakiejkolwiek jednostki\" -- Murray RothbardMijały lata, a państwo wszelkimi możliwymi sposobami zakazywało korzystania z prywatnych pieniędzy. Ucisk stawał się coraz silniejszy. Wzmocniło się też pragnienie ludzi dotyczące wolności. W przeszłości wyrażali te pomysły poprzez liberalizm, który później przekształcił się w libertarianizm. Pierwsze formy libertarianizmu pojawiły się między XVIII a XIX wiekiem. O współczesnym libertarianizmie, zapoczątkowanym od 1950 r. mówiły wielkie umysły, takie jak Murray Rothbard, Milton Friedman czy Hayek. Według Rothbarda \"libertariańskie credo opiera się na jednym centralnym aksjomacie: że żaden człowiek ani grupa ludzi nie może dokonać agresji przeciwko osobie lub własności kogokolwiek innego. Można to nazwać \"aksjomatem nieagresji\". \"Agresja\" jest definiowana jako inicjacja użycia lub groźba użycia przemocy fizycznej wobec osoby lub własności kogokolwiek innego. Agresja jest zatem synonimem inwazji\". W dużym uproszczeniu można powiedzieć, że libertarianizm skupiał się na prawach jednostki, ograniczeniu rządzących, zachęcaniu do wolnego rynku i pokoju.Jedną ze szczególnych stron libertarianizmu jest anarchizm. Mimo że ruch ten jest bardziej radykalny, nadal jest zorientowany na jednostki. Zasadniczo anarchizm zakłada społeczeństwo wolne od rządu, wolne jednostki, które nie są rządzone przez prawa, ale przez wolne umowy. Sam wyraz \"anarchia\" oznacza \"brak rządu\". Jednak anarchizm nie powinien być kojarzony z przemocą: nigdy nie był o przemocy i nigdy nie będzie. Świetne wyjaśnienie w tej kwestii daje kanadyjska teoretyczka L. Susan Brown: \"Podczas gdy popularne rozumienie anarchizmu dotyczy gwałtownego, antypaństwowego ruchu, anarchizm jest tradycją o wiele bardziej subtelną i zniuansowaną niż prosty sprzeciw wobec władzy rządowej. Anarchiści sprzeciwiają się idei, że władza i dominacja są niezbędne dla społeczeństwa, a zamiast tego opowiadają się za bardziej kooperatywnymi, antyhierarchicznymi formami organizacji społecznej, politycznej i ekonomicznej\".Wojny kryptoweKoszulki z amunicją, zgodnie z prawem amerykańskim, oryginalnie stworzone przez Adama Baca || Źródło zdjęcia: Twitter\"Jeśli prywatność zostanie zdelegalizowana, tylko przestępcy będą mieli prywatność.\" -- Phil ZimmermannZostawiamy za sobą lata 1950 i wchodzimy w erę technologii: ARPANET, przodek Internetu, rodzi się w 1967 roku; mikroprocesory ewoluują w oparciu o prawo Moore'a; komputery osobiste (PC) trafiają na rynek w 1975 roku; World Wide Web pojawia się w 1989 roku. Kryptografia rozkwitała dzięki genialnemu umysłowi Friedmana. Ale wszystkie te osiągnięcia technologiczne nie były przeznaczone dla społeczeństwa (jeszcze): państwo właśnie odkryło nowy sposób opresji, być może najbardziej niebezpieczny - inwigilację. Która była ciągłym procesem naruszania prywatności ludzi. Jeśli jednostka szpieguje sąsiada przez okno, może stanąć przed sądem; jeśli rząd szpieguje cały naród, nie ma problemu. Jeśli normalny człowiek próbuje znaleźć transakcje finansowe kogoś innego, może zostać pozwany; jeśli państwo chce poznać wszystkie transakcje finansowe każdego człowieka, nie ma problemu.Technologia zaoferowała rządzącym wspaniałą broń i zaczęli ją wykorzystywać z pełną mocą, aby mieć pełną kontrolę, głównie poprzez agencje takie jak NSA. Permanentny głód informacji o obywatelach stał się głodem wielkich danych: każda jednostka jest uwarunkowana dokumentami wydawanymi przez rząd. Nie można urodzić dziecka bez dowodu osobistego wydanego przez rząd, nie można wziąć ślubu bez dowodu osobistego wydanego przez rząd, nie można umrzeć bez dowodu osobistego wydanego przez rząd, nie można udowodnić swojej tożsamości bez dowodu osobistego wydanego przez rząd, nie można wejść do szpitala bez dowodu osobistego wydanego przez rząd i tak dalej. A wszystkie te informacje są zapisywane w bazach danych, które są kontrolowane przez różne ramiona państwa; ostatecznie są one kontrolowane przez państwo.W tych ciężkich czasach, w 1975 roku, Whitfield Diffie wynalazł kryptografię z kluczem publicznym, upubliczniając genialne narzędzie. Rząd zareagował, oferując swoją pomoc w \"zabezpieczeniu\" prywatnych kluczy ludzi. To nigdy nie nastąpiło i od tego momentu zaczęły się wojny kryptowe. W 1977 roku algorytm szyfrowania RSA został wynaleziony przez Rona Rivesta, Adi Shamira i Leonarda Adlemana; algorytm ten wykorzystywał kryptografię klucza publicznego. Kolejnym posunięciem NSA był zakaz publicznego dostępu do wynalazku Diffie'go oraz eksportu algorytmów szyfrujących poza granice USA. Dyrektor NSA Bobby Inman zaczął się martwić, ponieważ ludzie mogli uzyskać dostęp do technologii szyfrowania, która do tego momentu była używana tylko przez agencje. W 1993 roku z artykułu Wired wyciekł adres wysłany przez Inmana w 1979 roku, ostrzegający, że \"pozarządowa działalność kryptologiczna i publikacje [...] stanowią wyraźne zagrożenie dla bezpieczeństwa narodowego\". Algorytmy szyfrowania były uznawane za informacje niejawne i chronione przepisami federalnymi, takimi jak ITAR (International Traffic in Arms Regulations, 22 CFR 121-128). Za ich eksport groziło 10 lat więzienia. W odpowiedzi opinia publiczna wydrukowała kilka linii kodu RSA na koszulkach, a agencja ostrzegła, że noszenie tego typu koszulek podczas podróży poza USA lub ich eksportowanie będzie oznaczało odsiadkę dla \"przestępców\", gdyż tego typu koszulki zostały uznane za \"amunicję\". Za przestępców uznano również osoby noszące tatuaże z algorytmem RSA. Być może był to pierwszy raz, kiedy rząd obawiał się, że może stracić kontrolę. Ten strach widać w nazwie adresu wydanego przez Inmana: \"iSky upada\".John Gilmore, odważny młody człowiek, stanął wysoko przed agencją. Ten sam artykuł Wired cytuje go podkreślającego: \"Pokażcie nam. Pokażcie społeczeństwu, jak wasza zdolność do naruszania prywatności każdego obywatela zapobiegła poważnej katastrofie\". Oni ograniczają wolność i prywatność wszystkich obywateli - aby bronić nas przed bogiem, którego nie wyjaśnią. Decyzję o dosłownym przehandlowaniu naszej prywatności musi podjąć całe społeczeństwo, a nie jednostronnie wojskowa agencja szpiegowska.\"Cypherpunki i kryptoanarchia: \"Rebelianci z przyczyną\"Przednia okładka magazynu Wired (\"Rebelianci z przyczyną\"), Maj/Czerwiec 1993 || Źródło zdjęcia: Wired.com\"Jestem zafascynowany kryptoanarchią Tima Maya. W przeciwieństwie do społeczności tradycyjnie kojarzonych ze słowem \"anarchia\", w kryptoanarchii rząd nie jest tymczasowo zniszczony, ale trwale zakazany i trwale niepotrzebny. To społeczność, w której groźba przemocy jest bezsilna, ponieważ przemoc jest niemożliwa, a przemoc jest niemożliwa, ponieważ jej uczestników nie można powiązać z ich prawdziwymi nazwiskami lub fizycznymi lokalizacjami.\" -- Wei DaiSzybko wybiegamy w przyszłość do roku 1992. Grupa trzech entuzjastów kodu i kryptografów, utworzona przez Timothy'ego C. Maya, Johna Gilmore'a i Ericha Hughesa, odkrywa, że wszyscy mają podobną wizję na temat inwigilacji i cenzury rządu. Wszyscy posiadali głęboką wiedzę z zakresu informatyki. May pracował jako główny naukowiec w firmie Intel, Gilmore spędził lata w Sun Microsystems przed założeniem własnej firmy, natomiast Hughes był programistą i matematykiem. Zaczęli się widywać w biurze Gilmore'a, w rejonie Zatoki San Francisco, próbując znaleźć sposób na ochronę prywatności ludzi za pomocą kryptografii. Wkrótce dołącza do nich kolejny entuzjasta: haker Jude Milhon, znany również jako St. Jude. Znajduje ona również nazwę dla grupy: łącząc słowa \"cipher\" (związane z kryptografią) i \"cyberpunk\" (będący częścią gatunku science fiction opartego na dystopijnej rzeczywistości i anarchii) wymyśla nazwę \"Cypherpunks\".Grupa ewoluowała i dołączyło do niej wiele innych osób. Aby utrzymać kontakt uruchomili listę mailingową; archiwum maili można znaleźć na Metzdowd.com i Cypherpunks.venona.com. W szczytowym momencie miała ona około 2000 abonentów.Ideologia Cyberpunka wyniosła libertarianizm i anarchizm na zupełnie nowy poziom: kryptoanarchii. \"Widmo nawiedza współczesny świat, widmo kryptoanarchii\", stwierdził Tim May w 1988 roku, w czymś, co zyskało miano arcydzieła w literaturze cypherpunkowej: \"Manifest kryptoanarchistyczny\".\"Cypherpunki piszą kod\", podkreślał Eric Hughes, w \"Manifest Cypherpunka\", kolejnym znakomitym piśmie, które stanowi kawałek historii. I poprzez kod chcieli zaoferować ludziom prywatność. Chcieli, aby społeczeństwo miało wolny dostęp do kryptografii. Innymi punktami zainteresowania były anonimowość online, teoria gier, bezpieczna wymiana plików, systemy reputacji, wolny rynek i nieposłuszeństwo obywatelskie. Steven Levy, autor wspomnianego artykułu z Wired, określił ich terminem niemożliwym do przetłumaczenia na język obcy: \"techie-cum-civil libertarians\".Kolejnym wielkim pragnieniem Cypherpunków było stworzenie elektronicznej gotówki. Formy nieśledzonego pieniądza, który mógłby powstrzymać inwigilację rządów nad życiem finansowym jednostek.Z czasem do grupy przyłączyło się wielu entuzjastów podzielających tę ideologię. Wśród tych najbardziej znanych można wymienić Philipa Zimmermanna, wynalazcę PGP, Juliana Assange'a, założyciela WikiLeaks, Jacoba Appelbauma, twórcę Tora oraz Hala Finneya, twórcę PGP 2.0 i Reusable Proof-of-Work. Innych niezwykłych Cypherpunków można znaleźć tutajDigiCashNiektórzy z tych kryptografów zaczęli pracować nad tym marzeniem, które mieli: elektroniczna gotówka. I mieli wzór do naśladowania: DigiCash dr Davida Chauma. Praca Davida Chauma stanowiła inspirację dla grupy Cypherpunków i można go nazwać dziadkiem Cypherpunków. Jego pisma (takie jak \"Nieśledzona poczta elektroniczna, Adresy zwrotne, oraz Cyfrowe pseudonimy\", \"Ślepy podpis dla płatności niemożliwych do śledzenia\" czy \"Bezpieczeństwo bez komputerów z kartami identyfikacyjnymi, które uczynią Wielkiego Brata przestarzałym\") dowodziły, że myślał on o wiele wcześniej niż jego czasy. W 1989 roku udało mu się już uruchomić firmę produkującą elektroniczne pieniądze DigiCash Inc. Firma ta oferowała społeczeństwu system płatności eCash oraz monety CyberBucks, które były oparte na ślepych podpisach. Propozycja ta znalazła zastosowanie w rzeczywistych płatnościach, została przyjęta przez kilka banków, takich jak Mark Twain Bank z St. Louis, Deutsche Bank, Credit Suisse, Norske Bank i Bank Austria. Twórczością Chauma zainteresowali się inni wielcy gracze: Visa, Netscape, ABN Amro Bank, CitiBank i ING Bank. Nawet Bill Gates próbował wbudować DigiCash w Windows '95. Niestety, ci ostatni gracze nigdy nie podpisali umów z Chaumem. W końcu, w 1998 roku, DigiCash Inc. zbankrutował. Ludzi nie ciągnęło do korzystania z systemu. Propozycja Chauma była również ponadczasowa.Cypherpunkowcy uważali również, że o porażce DigiCash Inc. zadecydował fakt, że opierał się on na centralnej władzy. Kluczem do sukcesu była całkowicie zdecentralizowana forma pieniądza.e-GoldPodobny biznes był rozwijany w latach 1996-2009 przez firmę Gold & Silver Reserve, Inc. Firma ta uruchomiła spółkę zależną o nazwie e-gold Ltd. do obsługi elektronicznego złota. Użytkownicy mogli zdalnie przekazywać między sobą złoto w jednostkach gramów lub uncji trojańskich. Biznes kwitł, mając w szczytowym momencie około 5 milionów użytkowników. Wiele giełd zaadoptowało to elektroniczne złoto, a użytkownicy mogli je również przesyłać za pomocą swoich telefonów. Jednak w 2007 r. właściciele zostali oskarżeni przez amerykański rząd o operowanie pieniędzmi bez licencji. Właściciele przyznali się do winy i zostali uznani za winnych (w 2008 roku), a giełdy zostały zamknięte. Za przyznanie się do złamania prawa i przyjęcie do wiadomości, że potrzebują licencji na operowanie pieniędzmi, otrzymali łagodniejsze zarzuty. Jednak zgodnie z prawem USA, skoro zostali uznani za winnych, nie mogli uzyskać takiej licencji i e-Gold przestał istnieć.HashCashŹródło zdjęcia: Lista dyskusyjna CypherpunkówW 1997 roku dr Adam Back wyszedł z propozycją na liście dyskusyjnej o nazwie HashCash. Była to epoka, w której spam internetowy (zwłaszcza spam w poczcie elektronicznej) zaczął być poważnym problemem. Problem trafił na radary dużych firm, stąd pierwszy krok wykonała w 1992 roku firma IBM, z propozycją o nazwie Ustalanie ceny poprzez przetwarzanie lub zwalczanie poczty śmieciowej. Propozycja badaczy IBM zostanie gdzieś w przyszłości nazwana Proof-of-Work.Wynalazek Adama Backa nie był oparty na propozycji IBM; miał jednak wiele cech wspólnych. Koncepcja HashCash zakładała procedurę Proof-of-Work dla ograniczenia spamu mailowego i ataków DDos, opartą na koszcie każdego maila, co w ostatecznym rozrachunku sprawiłoby, że spam byłby zbyt kosztowny, aby go używać. Później, HashCash stanie się częścią silnika Bitcoina, będąc również wspomnianym w white paper Bitcoina.Poza tym Adam Back pozostaje znany z tego, że to on wskazał Satoshi Nakamoto do Wei Dai, po znalezieniu podobieństw między ich propozycjami elektronicznego pieniądza. Były tylko dwie osoby, z którymi Satoshi kontaktował się osobiście w sprawie Bitcoina: pierwsza to Adam Back; druga to Wei Dai.b-moneyWei Dai rzadkie zdjęcie, które może (lub może nie) przedstawiać go; według jego oświadczenia na WeiDai.com, \"Proszę zauważyć, że od tego pisania, wszelkie rzekome zdjęcia mnie w Internecie są w rzeczywistości innych osób o imieniu Wei Dai\" || Źródło zdjęcia: steemit.comW 1998 roku z propozycją elektronicznego pieniądza przyszedł kolejny niezwykły Cypherpunk: Wei Dai przedstawił b-money. Projekt opierał się również na Proof-of-Work i został przedstawiony w dwóch wersjach. Niestety, b-money był podatny na ataki Sybil, a Wei Dai nie dokończył swojej pracy. Propozycja nigdy nie została wdrożona.I nigdy nie ukończył swojego wynalazku, ponieważ nie ufał już ani użyteczności na b-money, ani ideologii kryptoanarchii. W późniejszej dyskusji na forum LessWrong przyznał: \"Nie podjąłem żadnych kroków, aby zakodować b-money. Po części dlatego, że b-money nie był jeszcze kompletnym projektem praktycznym, ale nie kontynuowałem pracy nad projektem, ponieważ w rzeczywistości nieco rozczarowałem się kryptoanarchią do czasu, gdy skończyłem pisać b-money, i nie przewidziałem, że system taki jak ten, po jego wdrożeniu, może przyciągnąć tak wiele uwagi i być używany poza małą grupą hardcorowych cypherpunków\". Zarzut ten został podwojony w dyskusji, którą wysłał do Adama Back'a i do innych Cypherpunków, dowodząc, że nie wierzył w praktyczne zastosowanie b-money: \"Myślę, że b-money będzie co najwyżej niszową walutą/ mechanizmem egzekwowania umów, służącym tym, którzy nie chcą lub nie mogą korzystać ze sponosorowanych przez rząd\".Jednak, choć Wei Dai nie ufał zbytnio swojemu wynalazkowi, zrobił to ktoś inny. Dekadę później, za radą Adama Back'a, Satoshi Nakamoto skontaktował się z nim, aby przyjrzał się jego propozycji elektronicznej gotówki o nazwie Bitcoin. Wymienili trzy maile. W pierwszym z nich, z 22 sierpnia 2008 roku, Satoshi napisał:\"Z dużym zainteresowaniem przeczytałem Twoją stronę o b-money.  Przygotowuję się do wydania dokumentu, który rozszerza twoje pomysły w kompletny działający system.  Adam Back (hashcash.org) zauważył podobieństwa i skierował mnie na Twoją stronę.Potrzebuję dowiedzieć się, jaki jest rok publikacji waszej strony b-money dla cytatu w moim piśmie.  Będzie to wyglądało tak:[1] W. Dai, \"b-money\", http://www.weidai.com/bmoney.txt, (2006?).Przedpremierowy projekt można pobrać ze strony http://www.upload.ae/file/6157/ecash-pdf.html.  Czuj się swobodnie, aby przekazać go wszystkim innym, którzy Twoim zdaniem byliby zainteresowani.\"Wei Dai odpowiedział na tego maila. Napisał:\"Cześć Satoshi. b-money został ogłoszony na liście mailingowej cypherpunków w 1998 roku. Oto zarchiwizowany post: http://cypherpunks.venona.com/date/1998/11/msg00941.htmlNa stronie http://cypherpunks.venona.com/date/1998/12/msg00194.html jest trochę dyskusji na ten temat.Dziękuję za poinformowanie mnie o twoim piśmie. Przyjrzę się mu i dam znać, jeśli będę miał jakieś uwagi lub pytania.\"Wei Dai nie przeanalizował jednak projektu Satoshiego ani nie wrócił z odpowiedzią do Satoshiego. 10 stycznia 2009 roku otrzymał kolejny e-mail od Satoshiego, informujący go, że Bitcoin w pełni działa:\"Chciałem dać ci znać, właśnie wydałem pełną implementację dokumentu, który wysłałem ci kilka miesięcy temu, Bitcoin v0.1.  Szczegóły, download i zrzuty ekranu są na www.bitcoin.org.Myślę, że osiąga prawie wszystkie cele, które założyłeś, aby rozwiązać w swoim dokumencie b-money.System jest całkowicie zdecentralizowany, bez żadnego serwera czy zaufanych stron.  Infrastruktura sieciowa może wspierać pełen zakres transakcji i umów powierniczych, ale na razie skupiamy się na podstawach pieniądza i transakcji.\"Wei Dai nie utrzymywał połączenia z Satoshim z powodów, które znał tylko on sam. Może nie ufał potencjałowi Bitcoina, a może nie zgadzał się z walutą bez stabilnej wartości. Pewne jest to, że po latach żałował swojego działania:\"Uznałbym Bitcoina za porażkę w odniesieniu do jego polityki monetarnej (ponieważ polityka ta powoduje dużą zmienność cen, co nakłada duże koszty na jego użytkowników, którzy muszą albo podejmować niepożądane ryzyko, albo angażować się w kosztowny hedging, aby używać tej waluty). (To może być częściowo moja wina, ponieważ kiedy Satoshi napisał do mnie z prośbą o komentarze do jego projektu pisma, nigdy nie odezwałem się do niego. W przeciwnym razie być może mógłbym odwieść go (lub ich) od pomysłu \"stałej podaży pieniądza\").\"Choć nie wiedząc o tym w tamtym czasie, Wei Dai pozostaje w historii jako jedna z dwóch osób, z którymi osobiście skontaktował się Satoshi Nakamoto przed uruchomieniem Bitcoina.Bit GoldInnym prominentnym Cypherpunkiem, który próbował rozwiązać problem prywatnej formy pieniądza elektronicznego był Nick Szabo. Był on zaznajomiony z tą ideą, pracując w przeszłości z Dr. Chaumem w DigiCash. W 2005 roku wystąpił publicznie z propozycją o nazwie Bit Gold. Ale propozycję tworzył od 1998 roku. Według Whitepaper jego wynalazek miał \"wykorzystać funkcje wzorcowe, a także techniki kryptografii i replikacji, aby skonstruować nowatorski system finansowy, Bit Gold, który służy nie tylko jako schemat płatności, ale także jako długoterminowy magazyn wartości niezależny od jakiegokolwiek zaufanego organu\". Więcej szczegółów na temat tej propozycji można znaleźć również na blogu Szabo.Bit Gold wykorzystywał Reusable Proof-of-Work, ale był również podatny na ataki Sybil, podobnie jak b-money. Koncepcja nigdy nie została uruchomiona jako rzeczywista aplikacja i pozostała w historii jako wpis na blogu, ponieważ napotkała zbyt wiele trudności technicznych do pracy w rzeczywistym środowisku. Jednak podstawowe pomysły stojące za Bit Gold zainspirowały Satoshiego jeszcze bardziej do stworzenia jego arcydzieła - Bitcoin.Satoshi, ostatni (?) Cypherpunk]The Times, Styczeń 3ci, 2009, Wydanie londyńskie, edycja poranna || Źródło zdjęcia: TheTimes03Jan2009.com\"Podstawowym problemem związanym z konwencjonalną walutą jest zaufanie, którego wymaga jej funkcjonowanie. Trzeba ufać bankowi centralnemu, że nie będzie fałszował waluty, ale historia walut fiatowych jest pełna naruszeń tego zaufania. Banki muszą mieć zaufanie do przechowywania naszych pieniędzy i przekazywania ich drogą elektroniczną, ale pożyczają je w falach baniek kredytowych z ledwie ułamkiem rezerwy. Musimy im ufać w kwestii naszej prywatności, ufać, że nie pozwolą złodziejom tożsamości na drenaż naszych kont.\" -- Satoshi NakamotoWyobraź sobie Satoshi Nakamoto rankiem 3 stycznia 2009 roku. Właśnie kupił gazetę The Times z kiosku na dole. Wracając do swojego domu, pije gorącą kawę i czyta główny tytuł: \"Kanclerz na skraju drugiego ratunku dla banków. Wciąż czeka na znalezienie bloku genesis. Jakie myśli mógł mieć? Może szepnął sam do siebie \"teraz to już jest zdecydowanie za dużo! Rządzący przekroczyli wszelkie możliwe granice! Ale Bitcoin już jest...\".Nikt nie wie, co mógł myśleć w tamtym dniu. Ale pewne jest to, że 3 stycznia 2009 roku wydobyto blok genesys Bitcoina. I oznaczony tytułem głównego artykułu z The Times.Prace przy Bitcoinie rozpoczęły się prawie 2 lata wcześniej, w 2007 roku. Satoshi, który również dołączył do listy dyskusyjnej Cyberpunków, musiał asystować przy tym, co stało się z e-Goldem i jego właścicielami. Państwo jasno określało swoje zamiary wobec prywatnych form pieniądza. Kontekst ekonomiczny i polityczny był zły, bo świat stał w obliczu ogromnego kryzysu. Być może Bitcoin był osobistym marzeniem Satoshiego. A może kontekst światowy zdeterminował go do pracy nad swoim wynalazkiem. Jakakolwiek jest prawda, faktem jest, że podążał za tym marzeniem Cypherpunksów, marzeniem podzielanym również przez libertariańskich przodków.Opierając się na ideologii libertariańskiej i kryptoanarchicznej, podążając za koncepcjami swoich poprzedników, Satoshi Nakamoto zdołał stworzyć \"nowy system elektronicznej gotówki, który jest w pełni peer-to-peer, bez zaufanej trzeciej strony\". System ten \"pozwalałby na przesyłanie płatności online bezpośrednio od jednej strony do drugiej bez obciążeń związanych z przechodzeniem przez instytucję finansową.  Sygnatury cyfrowe zapewniają część rozwiązania, ale główne korzyści są utracone, jeśli zaufana strona jest nadal wymagana, aby zapobiec podwójnemu wydawaniu pieniędzy.\"Innymi słowy, Bitcoin był pierwszą elektroniczną formą prywatnego pieniądza, która była w stanie ostatecznie wyzwolić ludzi spod inwigilacji rządzących, ponieważ środki mogły być przekazywane bezpośrednio pomiędzy osobami, bez interwencji jakiejkolwiek strony trzeciej - takiej jak banki, które działają jako długie ramiona rządzących.Bitcoin genesys blok || Źródło zdjęcia: RedditLibertarianizm Satoshiego jest obecny w wielu jego słowach.\"Tradycyjny model bankowości osiąga pewien poziom prywatności poprzez ograniczenie dostępu do informacji do stron zaangażowanych w transakcję oraz zaufanej strony trzeciej. Konieczność publicznego ogłaszania wszystkich transakcji wyklucza tę metodę, ale prywatność można nadal zachować, przerywając przepływ informacji w innym miejscu: poprzez zachowanie anonimowości kluczy publicznych. Opinia publiczna może zobaczyć, że ktoś wysyła jakąś kwotę do kogoś innego, ale bez informacji łączącej transakcję z kimkolwiek. Jest to podobne do poziomu informacji ujawnianych przez giełdy, gdzie czas i wielkość poszczególnych transakcji, ‘taśma’, jest upubliczniana, ale bez informowania, kim były strony.\"Inny dobry przykład w tej sprawie znajduje się w artykule z 2015 roku z The Verge, który ilustruje jego pierwszą dyskusję z Martti Malmi, który później stanie się administratorem BitcoinTalk. Martti był również osobą o anarchistycznych poglądach, gdyż był członkiem nieistniejącego już forum anti-state.org. W artykule czytamy:\"W swoim pierwszym mailu do Satoshi Nakamoto, w maju 2009 roku, Martti zaoferował swoje usługi: \"Chciałbym pomóc w Bitcoinie, jeśli jest coś, co mogę zrobić\" - napisał.Przed dotarciem do Satoshiego, Martti pisał o Bitcoinie na anti-state.org, forum poświęconym możliwościom anarchistycznego społeczeństwa zorganizowanego wyłącznie przez rynek. Używając nazwy ekranowej Trickster, Martti przedstawił krótki opis idei Bitcoina i poprosił o przemyślenia: \"Co o tym sądzicie? Jestem naprawdę podekscytowany myślą o czymś praktycznym, co mogłoby naprawdę przybliżyć nas do wolności jeszcze za naszego życia :-)\"Martti załączył link do tego postu w swoim pierwszym mailu do Satoshiego, a Satoshi szybko go przeczytał i odpowiedział.\"Twoje zrozumienie Bitcoina jest punktowe\" - odpisał Satoshi\".Poniższa część pokazuje pierwsze oznaki rozwoju Bitcoina (nb. - dziękuję cyganowi za tę część!) - 5 e-maili wymienionych między Satoshim a Adamem Backiem. Jeśli wierzyć tym 5 e-mailom (a nie ma sposobu, aby to łatwo zrobić), kontakt między Satoshim Nakamoto a Adamem Backiem istniał od sierpnia 2008 roku, kiedy Satoshi poprosił Adama o opinię na temat dokumentu. Dzięki tym 5 ważnym \"dokumentom\" możemy po raz kolejny zmapować pewien okres czasu i zdać sobie sprawę, że Satoshi był w kontakcie z niektórymi Cypherphunkami.    Odpowiedź Satoshiego jest krystalicznie czysta, jeśli chodzi o jego wizję. A jego lekcja nigdy nie powinna zostać zapomniana.Podobnie jest z nim, gdy mówimy o dzieleniu się punktami zainteresowania Cypherpunków - dał ludziom wolny dostęp do Bitcoina, do prywatności oferowanej przez Bitcoin. Wolny dostęp i łatwość użycia kluczy kryptograficznych używanych przez jego protokół. Bitcoin miał (i udało mu się) w pełni zmienić wolny rynek. Ostatecznie był formą obywatelskiego nieposłuszeństwa. Metodą zajęcia pozycji wobec pieniądza rządzących - pieniądza śladowego, pieniądza napompowanego, pieniądza, który z dnia na dzień traci na wartości, bo drukarnie rządzących ciągle emitują nowe pieniądze.Chciał pomóc ludziom, by znów byli wolni. A to było możliwe dzięki Bitcoinowi. Żaden bank i żaden prezes nie mógł już \"doić\" ludzi z ich pieniędzy za pomocą mniej lub bardziej wyrafinowanych mechanizmów, takich jak podatki za przekazywanie ich środków, podatki za sprzedaż ich produktów, podatki za sprzedaż ich siły roboczej. Bitcoin jest wolny dla każdego, a wolność mieszka w nim; jeśli chcesz mieć kontrolę nad swoją prywatnością i finansami, wszystko co musisz zrobić, to go przyjąć.Bitcoin został przewidziany wiele lat, przy wielu okazjach, przez Tima Maya. Na przykład w swoim eseju z 1994 roku Kryptoanarchia i społeczności wirtualne powiedział \"Technologia wypuściła dżina z butelki. Kryptoanarchia uwalnia jednostki od przymusu ze strony ich fizycznych sąsiadów - którzy nie mogą wiedzieć, kim są w sieci - oraz od rządów. Dla libertarian silna kryptowaluta zapewnia środki, dzięki którym będzie można uniknąć rządu\".Bitcoin jest prawdziwy i jest tutaj, aby trwać. Niebo zaczęło spadać od 1979 roku i od tego czasu ciągle spadało. Rządzący przegrali wojnę. Wolność jest w naszych rękach.To mój tysięczny post.I jest to kontynuacja mojego poprzedniego pisania związanego z Cypherpunkami, historią i kryptoanarchią. Duch Cypherpunków żyje w wielu z nas. Naszym obowiązkiem jest utrzymanie go przy życiu. Naszym obowiązkiem jest dalsza walka o wolność i swobodę!Referencje:- 12 lat później, a ludzie nadal nie wiedzą jak używać Bitcoina, ani do czego jest dobry- Rządy biorą się za handlowców!- Kryptowaluta kontra cyfrowy pieniądz emitowany przez państwo- Manifest kryptoanarchistyczny - Wszyscy powinniśmy go przeczytać- Rządy próbują od wieków ograniczać dostęp społeczeństwa do informacji i wolności- Myśli Phila Zimmermanna na temat PGP - Wszyscy powinniśmy je przeczytać- When the govern wants to hold your private keys- Wezwanie do Juliana Assange'a || Manifest WikiLeaks - Wszyscy powinniśmy go przeczytaćTłumaczenie wykonane w ramach inicjatywy AOBT",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450011",
  "comments": [
    {
      "author": "cygan",
      "created_time": "April 24, 2023, 02:55:24 PMLast edit: May 14, 2023, 02:06:44 PM by cygan",
      "body": "Kolejny obrazek to porównanie dokonane przez Gazeta dla Bitcoina i jego przodków. I jak sam uważa, jest on jedyny w swoim rodzaju.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GazetaBitcoin",
      "created_time": "April 24, 2023, 03:55:34 PM",
      "body": "Drogi cygan, brak mi słów na widok Ciebie tłumaczącego również mój 1000 post na forum. Chciałem zrobić pamiętny esej z tym 1000-tnym postem, dlatego postanowiłem napisać ten artykuł o Bitcoinie i jego przodkach. Mam nadzieję, że wszyscy polscy użytkownicy z przyjemnością przeczytają ten kawałek historii, który przedstawia jak Wei Dai, Adam Back, Nick Szabo czy David Chaum utorowali drogę Satoshiemu, dziesiątki lat temu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "April 26, 2023, 07:02:32 AM",
      "body": "to był dla mnie zaszczyt, że mogłem przetłumaczyć na język polski ten twój tysięczny post, aby poinformować polskich użytkowników o całej historii, od powstania aż do narodzin Bitcoina. bardzo interesujące wydały mi się historie \"poprzedników\" Bitcoina, które nie zdołały się przebić z wymienionych i różnych powodów.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "October 03, 2023, 06:25:32 AM",
      "body": "niedawno ujawniony e-mail ujawnia więcej informacji na temat wcześniej mało znanej historii powstania Bitcoina. jest to najstarszy znany fragment pisma od założyciela Bitcoina, Satoshi Nakamoto. wiadomość z 22 sierpnia 2008 r. do Wei Dai.ze swojej strony Dai pracował (jak wspomniała GazetaBitcoin w tym wątku) nad cyfrowym systemem pieniężnym o nazwie 'b-money' od 1998 roku. najwyraźniej SN został zainspirowany tym, co potwierdza również e-mail. w nim założyciel Bitcoin prosi o datę publikacji strony b-money, aby mógł ją zacytować w swojej wkrótce opublikowanej pracy.https://finbold.com/this-is-the-first-known-satoshi-nakamotos-email-whats-inside/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "October 04, 2023, 06:16:36 AM",
      "body": "Dzięki za tłumaczenie tego wątku. Szkoda, że nie ma moderatora obecnie dostępnego, bo zasługuje on zdecydowanie na przypięcie jako jeden z ważniejszych wątków o bitcoinie. Niesamowita historia.Dodam jeszcze, że:1- rozwarstwienie na elity i klasę pracującą sięga neolitycznej rewolucji agrarnej - około 10 000 lat temu2- świetnie, że wspominasz o Murray Rothbard. W tej tematyce polecam jego książkę \"Złoto, banki, ludzie. Krótka historia pieniądza\". Krótka, łatwo się czyta, a pokazuje jak elity od tysięcy lat starają się zmonopolizować i kontrolować pieniądz. Jak pod płaszczykiem dawania nam bezpieczeństwa \"prywatne mennice mogą was oszukać zaniżając ilość złota/srebra w monecie, my damy wam bezpieczeństwo\" a kończyło się tak, że w ciągu 100 lat od 200 do 300 roku naszej ery inflacja wyniosła 15 000% a jak? A tak, że zaczynano od srebrnej monety a kończono na monecie ze srebrem w ilości homeopatycznej, ale uwaga, bo \"prywatne mennice mogą was oszukać\"3- od czasów starożytnego rzymu widać jeden trend. Przejęcie całej kontroli nad pieniądzem z CBDC jako wisienka na torcie, by kontrolować nie tylko emisję waluty ale też dystrybucję i to na co jest wydawana",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vjudeu",
      "created_time": "October 04, 2023, 07:40:21 AM",
      "body": "Quotejest to najstarszy znany fragment pisma od założyciela Bitcoina, Satoshi Nakamoto. wiadomość z 22 sierpnia 2008 r.Istnieją starsze źródła tekstowe. Przykładem jest kod źródłowy, w którym widać datę rozpoczęcia prac nad Bitcoinem. Wystarczy zajrzeć do pliku \"sha.h\" w wersji \"BitCoin v0.01 ALPHA\" (taką nazwę można znaleźć w pliku \"readme.txt\").Code:// This file is public domain// SHA routines extracted as a standalone file from:// Crypto++: a C++ Class Library of Cryptographic Schemes// Version 5.5.2 (9/24/2007)// http://www.cryptopp.com#ifndef CRYPTOPP_SHA_H#define CRYPTOPP_SHA_H#include <stdlib.h>Co więcej, 2007 jako rok, od którego wszystko się zaczęło, jest potwierdzony oficjalnie przez Satoshiego:Quote from: satoshi on June 18, 2010, 04:17:14 PMQuote from: laszlo on June 17, 2010, 06:50:31 PMHow long have you been working on this design Satoshi?  It seems very well thought out, not the kind of thing you just sit down and code up without doing a lot of brainstorming and discussion on it first.  Everyone has the obvious questions looking for holes in it but it is holding up well Since 2007.  At some point I became convinced there was a way to do this without any trust required at all and couldn't resist to keep thinking about it.  Much more of the work was designing than coding.Fortunately, so far all the issues raised have been things I previously considered and planned for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "October 22, 2023, 02:14:14 PMLast edit: October 23, 2023, 08:30:11 AM by cygan",
      "body": "wczoraj dobrze znany Jameson Loop opublikował bardzo interesujący artykuł na swojim blogu na temat legendarnego cypherpunka Hala Finneya. w tym artykule przedstawia wyniki swoich badań i popiera swoje twierdzenie, że HF nie był/nie jest Satoshi Nakamoto.QuoteA compilation of evidence that Hal Finney and Satoshi Nakamoto were different people.https://blog.lopp.net/hal-finney-was-not-satoshi-nakamoto/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}