{
  "id": "topic_5454540",
  "title": "Ojima-ojo",
  "author": "Ojima-ojo",
  "created_time": "May 30, 2023, 05:08:21 PMLast edit: May 30, 2023, 05:34:52 PM by Ojima-ojo",
  "content": "As the month winds up and we are beginning to see the end of May we are now approaching june, the second quarter of the year 2023.Bitcoin on a general note have maintained resistance bear forces which accompany the year after the 2022 bear market and other cryptocurrency market crisis such as all the exit scam (bankruptcy) of big exchanges and other investments, but the beginning of the year 2023 saw a market positive advances that are when the price of Bitcoin recovered back from $16,000 to around 25k and thereafter recovered all through the time up till this very moment where bitcoin price is 27k+ after touching $31,000+ within the last two months, this signifies a lot of bull tenacities.So what are your bitcoin second quarter of 2023 market analyses, let discussed.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454540",
  "comments": [
    {
      "author": "pooya87",
      "created_time": "May 30, 2023, 05:14:23 PM",
      "body": "I don't see the sideways trend changing without some significant event. However with the irrelevant news about US possible default coming to an end we may get rid of some FUD in the market that has been creating artificial sell pressure so the sideways may end up with slight rise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "May 30, 2023, 06:41:54 PMLast edit: May 30, 2023, 06:52:56 PM by Hyphen(-)",
      "body": "Quote from: Ojima-ojo on May 30, 2023, 05:08:21 PMSo what are your bitcoin second quarter of 2023 market analyses, let discussed.There is always hope for a Bitcoin price recovery, but the Bitcoin market was down through the year 2022, despite some ups and downs in the market that keep our hope alive, and as we are expecting a halving, we will always hope for a price recovery.The Bitcoin price has increased by 1.9% in the last seven days; hence, as we enter the third quarter of the year, we anticipate a very strong price recovery against halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "May 30, 2023, 07:04:51 PM",
      "body": "Quote from: Ojima-ojo on May 30, 2023, 05:08:21 PMAs the month winds up and we are beginning to see the end of May we are now approaching june, the second quarter of the year 2023.Bitcoin on a general note have maintained resistance bear forces which accompany the year after the 2022 bear market and other cryptocurrency market crisis such as all the exit scam (bankruptcy) of big exchanges and other investments, but the beginning of the year 2023 saw a market positive advances that are when the price of Bitcoin recovered back from $16,000 to around 25k and thereafter recovered all through the time up till this very moment where bitcoin price is 27k+ after touching $31,000+ within the last two months, this signifies a lot of bull tenacities.So what are your bitcoin second quarter of 2023 market analyses, let discussed.So far bitcoin has done quite well this two quarters of the year. The second quarter had the price fluctuating because of the various issues regarding banks facing bankruptcy, the economic crisis or rather confusion been face by some countries like the US leading to interest rates been increased and also the ordinal saga on bitcoin blockchain that caused the congestion of the mempool. For the end of the second quarter and the beginning of third I am going bullish. Mainly because of the news surrounding the Chinese government relaxing the restrictions on cryptocurrencies. The last time bitcoin was discussed on CCTV on November 2017 even though it was warning people then about bitcoin, it went bullish. So now again I believe same news will cause bullish sentiment due to FOMO by investors",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stavri",
      "created_time": "May 30, 2023, 07:41:00 PM",
      "body": "June usually more positive and green comparing to may.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "May 30, 2023, 08:21:18 PM",
      "body": "I expect the Bitcoin market to continue with the sideways trend and also experience a more bearish price trend than a bullish till the Q4 of this year if there's no solution to the Bitcoin network congestion caused by the ordinal/Brc20 because the BTC market is also prone to bearish whenever there are huge unconfirmed transactions. Besides, there are a lot of reports about miners selling a huge amount of BTC technically the FUD will continue until a tangible solution is introduced.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "May 30, 2023, 09:04:40 PM",
      "body": "Probably a few more months of this boring 25-30k price range, because it's too early for the bull market but too late for any sharp price drops, unless there's some sort of black swan event, like a disastrous stock market crash, a new global pandemic, etc. That's how the market was behaving during the previous periods that came before a halvening and its bull run. Assuming that it will be like that this time too is the best prediction that we can make, I think.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "May 30, 2023, 09:14:26 PM",
      "body": "Though bitcoin price movement cannot be given accurately but there might be some good news which will help pump the price. For now I don't see any major significant of such apart from China that has uplifted its ban on cryptocurrency which might make a little pump in the price. I will hope to see the price gets to 29k because,there need to be a pump in price after the price correction to 26k+ which lasted for a month or more. Therefore,it is time for a pump in price on bitcoin because it is volatile and the price needs to move up and down. We have seen the downward movement in price to 26k+ and I don't think it will dip below that price since the halving time is getting close.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "May 31, 2023, 03:53:28 AM",
      "body": "Quote from: pooya87 on May 30, 2023, 05:14:23 PMI don't see the sideways trend changing without some significant event. The same here. Although if you ask me about the following months, I would say the same, and at some point the price will tend to go up due to the proximity of halving. The normal thing is that pre-halving we will have a small rise and after halving the good things will come. I don't think we will have a year of sideways.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "May 31, 2023, 04:22:51 AM",
      "body": "There are a few events like the Hong Kong launch on June 1st, the unemployment numbers and the CPI and the fed rate. Depending how the employment looks and how CPI performs we might have some volatility. Basically everyone is expecting softening of the employment and inflation. If they come in hot then we might be in for a ride.I vote for a slightly bullish June however.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "waONE",
      "created_time": "May 31, 2023, 08:53:04 AM",
      "body": "the price of Bitcoin in June is likely to be bullish because the market cap of cryptocurrencies will obviously increase, because users in China have been allowed to trade freely, so the bullish potential for bitcoin in June will be large, my target is at $ 35k first and august is likely to skyrocket to $50k hopefully so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "May 31, 2023, 10:17:26 AM",
      "body": "I think it's honestly hard to tell right now, as the market has been somewhat trendless and sideways for the past 2 months. Instead I'd say it's more likely going to be based on what happens in the coming weeks. For example whether price holds the 200 WMA around $26.3K (which is also close to the 20 Week MA) and therefore continues to the upside, or whether the recent month-long correction will continue.Personally I still think a pull-back to around $23K accumulation zone remains likely before further upside. This would be a healthy re-test of the 200 Day MA that is trending to the upside, similar to in March rebound. Either way, the fact there hasn't so far been a sharp correction or rejection from $30K is a positive sign, similar to the consolidation above $25K previous resistance level that remains bullish.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "May 31, 2023, 11:36:15 AM",
      "body": "Quote from: Ojima-ojo on May 30, 2023, 05:08:21 PMSo what are your bitcoin second quarter of 2023 market analyses, let discussed.Since we all know that bitcoin is a volatile cryptocurrency and no matter how it goes bearish or bullish it will still come back to normal state but as we've known that it's a highly volatile currency, if it goes dip the more even below $20,000 i still have that confidence that it will rise back to $27,000 or beyond, the target now is for us to see that bitcoin rises back close to it's all time high of $68,000 before we can be anticipating for a new all time high after the halving, so there's likely possibilities that we bread the limit off $27,000 to about $40,000 at anytime in June.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fzkto",
      "created_time": "May 31, 2023, 01:54:33 PM",
      "body": "Quote from: adaseb on May 31, 2023, 04:22:51 AMThere are a few events like the Hong Kong launch on June 1st, the unemployment numbers and the CPI and the fed rate. Depending how the employment looks and how CPI performs we might have some volatility. Basically everyone is expecting softening of the employment and inflation. If they come in hot then we might be in for a ride.I vote for a slightly bullish June however.China officially removes its ban on cryptocurrencies tomorrow. I think this is bullish news. After China banned cryptocurrencies, the market started falling. I think that when they remove the ban, the market may start to rise again. China, like the US, has a lot of capital that can get into the market. I expect June to be a start for the bulls. There was a correction in May, now it's time to rise again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "May 31, 2023, 03:45:00 PM",
      "body": "Maybe a bullish outlook would see $35,000 by the end of Q3 (June 2023). Starting tomorrow Hong Kong retail investors can buy bitcoin again after the ban in 2021. This could help drive a bullish narrative. So yes, maybe we rise to $35,000. Uncertainty around the US debt ceiling looks to be sorted imminently too so that will give investors confidence to go for risk on assets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "May 31, 2023, 05:23:50 PM",
      "body": "I feel like it is going to be just stagnant with only a small movement during June. I mean surely we could have like 5% down or up, we could see it go under 27k again, or go above 28k again after that, these type of movements should be normal in the crypto world. But that doesn't mean that we are going to end up with a too volatile movements.June is usually a \"boring\" month if you look at the past, sure there were some moments when it moved a lot, but most of the time it was less volatile compared to other months, and that is why I do not expect too much of an increase or decrease this month. We should be able to just accumulate more during this month for the upcoming increase, when it will happen is unknown but it will happen for sure, so just accumulate more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "May 31, 2023, 05:41:19 PM",
      "body": "I'll go with what the majority has said here, it could be sideways for some time. I think we have exhausted everyone from January-April this month as we have reach $30k+ although it was not that sustainable.And after that, a new pattern emerge, no more increase in price and so most likely this will be our pattern for now, unless there is a break out run for the month of June. Although I will be on the fence about it, as historically, June is very slow for all of us. The price action might pick up later, in the last three months of the year, in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "May 31, 2023, 11:30:22 PM",
      "body": "Quote from: Dave1 on May 31, 2023, 05:41:19 PMI'll go with what the majority has said here, it could be sideways for some time. I think we have exhausted everyone from January-April this month as we have reach $30k+ although it was not that sustainable.And after that, a new pattern emerge, no more increase in price and so most likely this will be our pattern for now, unless there is a break out run for the month of June. Although I will be on the fence about it, as historically, June is very slow for all of us. The price action might pick up later, in the last three months of the year, in my opinion.Once the gap around $20k is filled, we would be more likely seeing a bullish pattern. It is currently a threat to people who plans to enter the market already. But to some, they are having expectation of a reversal trend this coming month because the market price have already reached $25k which could be its lowest if not anything would happen. As we all know, it would be impossible to accurately determine what price movement would it be. The only thing we could do is to wait for right trend patterns. My personal take on the possible price movement would still be sideways given that there are anticipated highs and lows on its price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "June 01, 2023, 08:36:27 AM",
      "body": "Bitcoin analysis is not based on monthly bases or linked to the first and second quarters, but rather to technical analysis, as supply and demand, support and resistance points, and trading volumes are what control the price movement more than they are periods of time, especially for short periods of time such as quarters during the year.If we take the historical data as a reference, then Bitcoin is likely to remain negative.The month of May was 6.92%, and the end of the year and the first quarter are mostly positive compared to the second and third quarters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "June 01, 2023, 11:22:58 AM",
      "body": "Nothing different that I think will happen in the month of June at least nothing significant. The month of May and June are the same thing in the history of bitcoin so we may still see that the price may almost stay how it ended in May or a little bit to $30k because of those DCA in expectation of a rise after the correction few months ago. Apart from that, strong hands will still hodl and I don't expect volatility at this month but things can still change.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}