{
  "id": "topic_5430788",
  "title": "xml",
  "author": "xml",
  "created_time": "December 21, 2022, 10:12:27 AMLast edit: December 21, 2022, 10:24:11 AM by xml",
  "content": "The total cost of conversion from ETH to BTC amounted to approx. 1% or $50 (for the volume of 4 ETH -> 0.3 BTC) yesterday. The total cost broke down into: - 90% of the exchange fee charged by THORSwap and- the remaining 10% of network fees (28.0 sat/vB for Bitcoin and 13 gwei for Ethereum).The Bitcoin and Ethereum networks were not congested and prices were not valatile (BTCUSD $16,727-$17,045.90 and ETHUSD $1,203.88 - $1,229.32 in the preceding 12 hours).Link to THORSwap: https://app.thorswap.finance/swapPros:- transaction was instant and automatic,- simple GUI,- no KYC.Cons:- 1% or $50 cost seems expensive,- the advertised (inside the app) total cost was lower (misleading): in the range of $16-$28 (where the part of the exchange fee was $14),- unclear if TapRoot addresses (bc1p...) are supported.How does it compare to alternative ways to convert ETH to BTC, e.g. centralized exchanges, peer-to-peer? How would you rate it? What alternative would you recommend?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5430788",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "December 21, 2022, 12:24:32 PM",
      "body": "So the swap page said 16$ but you were asked to pay 50$ when you were going to sign for the transaction with your wallet? I could be wrong but from my understanding of this[1]. It seems like you paid x3 premium fees due to the route used.Quote from: xml on December 21, 2022, 10:12:27 AM-snip-How does it compare to alternative ways to convert ETH to BTC, e.g. centralized exchanges, peer-to-peer? How would you rate it? What alternative would you recommend?I think the main problem right now with them is liquidity. If you try and swap 1 BTC for USDC on Avalanche, you'll get ~15.4K while if you were to trade it for USDC on ETH, you'll get more reasonable rates (~16.7K). If they manage to attract more users to provide liquidity, that would be great.So if you were to compare the platform (in its current state) with CEXes, then for someone who wants to save money, it's probably not the best option but if you want to avoid KYC at all costs, then sure.P2P is also way cheaper but at the same time, you need to trust the individual you're dealing with.[1] https://docs.thorswap.finance/thorswap/thorswap-products/thorswap/frequently-asked-questions/fees",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xml",
      "created_time": "December 21, 2022, 02:42:00 PM",
      "body": "Quote from: OmegaStarScream on December 21, 2022, 12:24:32 PMSo the swap page said 16$ but you were asked to pay 50$ when you were going to sign for the transaction with your wallet? I could be wrong but from my understanding of this[1]. It seems like you paid x3 premium fees due to the route used.(...)[1] https://docs.thorswap.finance/thorswap/thorswap-products/thorswap/frequently-asked-questions/feesIf THORSwap charged x3 premium fees then they should advertise the total cost equal to the \"x3 premium fees\" instead of artificial 3 times lower amount, I think. There is the screenshot of the GUI widget shown to a user: https://i.postimg.cc/Kc5zbGxT/20221220-THORSwap-BTCETH-example.pngThanks for a reply.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "December 21, 2022, 04:22:41 PM",
      "body": "Quote from: xml on December 21, 2022, 02:42:00 PMIf THORSwap charged x3 premium fees then they should advertise the total cost equal to the \"x3 premium fees\" instead of artificial 3 times lower amount, I think. There is the screenshot of the GUI widget shown to a user: Thanks for a reply.I think you understand the way DEXs work incorrectly. In DEXs there is no specific mechanism for determining fees or exchange rate, but liquidity is what governs, meaning that I can exchange BTC/ETH pair for 1 Bitcoin and get ~ 13.86 ETH to ~12 ETH according to the available liquidity and thus, despite the lack of need To verify identity, however, I may lose some money if sufficient liquidity is not available.Fees may change according to how they provide liquidity (they pay money to people to provide liquidity in return for APY)In CEXs what happens is that the site modifies the site database according to the trading prices, and thus the speed and cheap fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xml",
      "created_time": "December 22, 2022, 09:20:07 AM",
      "body": "Quote from: Husires on December 21, 2022, 04:22:41 PMI think you understand the way DEXs work incorrectly. In DEXs there is no specific mechanism for determining fees or exchange rate, but liquidity is what governs, meaning that I can exchange BTC/ETH pair for 1 Bitcoin and get ~ 13.86 ETH to ~12 ETH according to the available liquidity and thus, despite the lack of need To verify identity, however, I may lose some money if sufficient liquidity is not available.Fees may change according to how they provide liquidity (they pay money to people to provide liquidity in return for APY)In CEXs what happens is that the site modifies the site database according to the trading prices, and thus the speed and cheap fees.If there is no specific mechanism for determining fees or exchange rate then why they are displayed to a user in the GUI widget (\"Network fee $9.43\" and \"Exchange fee $14\")?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xml",
      "created_time": "December 29, 2022, 10:46:59 AM",
      "body": "Can anybody compare THORSwap to SideShift or FixedFloat, perhaps?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}