{
  "id": "topic_5426456",
  "title": "alecfisker",
  "author": "alecfisker",
  "created_time": "December 07, 2022, 12:21:56 PMLast edit: April 24, 2023, 09:38:06 AM by alecfisker",
  "content": "Paid post bounty steps (please ignore below warning, RESOLVED)1. Ask questionOpen chrome browser, install/use existing metamask walletSign web site interaction allowance in metamask popupAsk question2. Answer questionLogin in new windows desktop session using another accountOpen chrome browser install/use second existing metamask walletSign web site interaction allowance in metamask popupClick any question Once chat opens provide answerRewardsQuestion 10 centsAnswer 20 centsBug 50 centsReply to thread with metamask addressOptional bug report",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5426456",
  "comments": [
    {
      "author": "Saisher",
      "created_time": "December 07, 2022, 01:08:50 PM",
      "body": "I don't trust platforms that ask me to connect my wallet, after those reports about connecting your wallet to unknown platform people should not hurry to connect their wallets even if the offer is tempting, And when I open the site I have this warningAnd on the home page, they have these icons but they are not clickable, they post these images to deceive their potential victims",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "December 07, 2022, 02:05:11 PM",
      "body": "Hey are being serious about this stuff you said here? Scam alert!!I don't suggest anyone to associate their chrome browser and their wallet to this site, from the above post it's confirmed that site is not trusted so anyone who partake on this is likely to be a victim of being scammed or compromise their wallet.Whatever that request access to metamask address is suspicious and likely to harm your wallet. Don't your wallet for just some fractions of cent.Be warned!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "December 07, 2022, 03:51:43 PM",
      "body": "this is very strange. right after the OP opened the thread, I visited his site and everything seemed normal. He asked me to connect to Metamask, but the page itself opened without any problems. Now I get this warning too.Quote from: Saisher on December 07, 2022, 01:08:50 PMAnd on the home page, they have these icons but they are not clickable, they post these images to deceive their potential victimsin the meantime, this was also removed.an obvious scam, but it busted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alecfisker",
      "created_time": "December 07, 2022, 04:13:11 PM",
      "body": "not sure why warning triggered for chrome, checkingin the mean time please use brave/mozilla browsers",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "December 07, 2022, 05:16:30 PM",
      "body": "This looks fishy. Looking at your rank on the platform you are a new bie here with your first posting referring platform participants to link or connect their metamask wallet address to your website. SCAM ALERT!!!!Run away from that website with your dear precious hard earned funds and assets or you loose your funds. No body should attempt linking or clicking on that site for their own safety.I checked the website and this was what I found out;I know you have already seen it  as uploaded before but to clear the doubt I had to upload it again. I checked the website  to see for myself and this was what I found above.  OP you did not say anything about the website as means of introduction to know about the site and what it is all about. What you quickly did was to put up this post for participants to click and fall prey of a suspicious scam site suspected to be  hackers.You do not need any sooth Sayer to tell you what to do. Save  yourself some stress and be at alert.Scammers everywhere! Be warned!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alecfisker",
      "created_time": "December 07, 2022, 06:41:22 PM",
      "body": "RESOLVED please clear browser cache",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "December 07, 2022, 10:04:35 PM",
      "body": "Quote from: alecfisker on December 07, 2022, 06:41:22 PMRESOLVED please clear browser cacheIt's very clear that you are the owner of the project because you have reconfigured the site to make it more acceptable you are guilty of deception and manipulation by taking out these images you just admit that you are the owner of the site and you are deceiving your visitors by trying to make it appear that you are a trusted and reputable site.Whois information of the site QuoteDomain:webhelpboard.xyzRegistrar:Hosting Concepts B.V. d/b/a Registrar.euRegistered On:2022-11-09Expires On:2023-11-09Updated On:2022-11-09https://www.whois.com/whois/webhelpboard.xyz",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}