{
  "id": "topic_5457495",
  "title": "Victan22",
  "author": "Victan22",
  "created_time": "June 25, 2023, 05:56:37 AM",
  "content": "Hi guys,I'm super excited to finally be a part of this family of great minds in the crypto world.As a newbie in the crypto community  I've heard people talk about how great they have lost their resources on several crypto platform, so I've resolved to ask:How best do I secure my investment on bitcoin as a newbie? indeed so many people jump into the crypto with little or zero knowledge of bitcoin and it's security and intending risk, so pls i will really appreciate a response from professionals in the house",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457495",
  "comments": [
    {
      "author": "mk4",
      "created_time": "June 25, 2023, 06:00:17 AM",
      "body": "If your bitcoin is worth <$200 then just install BlueWallet[1] on your mobile phone. On the other hand, if it's more than $200, grab a hardware wallet[2].[1] https://BlueWallet.io/[2] https://chainsec.io/wallets",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "June 25, 2023, 06:26:42 AM",
      "body": "Quote from: Victan22 on June 25, 2023, 05:56:37 AMHow best do I secure my investment on bitcoin as a newbie? The two wallet’s suggested by mk4 are ok to store your funds. But I will like to add that should you want to consider more security and you feel hardware wallets are expensive for you, then another suggestion could be the use of electrum on desktop. You can use it on air gapped devices. Also the security of actually lies on you how you secure this the seed phrase or keys generated. The reputation of a wallet doesn’t guarantee its security if you don’t manage it well yourself. There People that got there wallets compromised by hackers through exposing there keys on online platforms or",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "June 25, 2023, 06:41:22 AM",
      "body": "Quote from: Victan22 on June 25, 2023, 05:56:37 AMHow best do I secure my investment on bitcoin as a newbie? Do not deposit funds online.Use a trusted open source wallet like Electrum, Bitcoin Core (desktop). To add to the robustness of the security system, use a hardware wallet. Later you can connect from the software wallet that I mentioned.Learn how to use a wallet properly and correctly.Keep the backup in a safe place that is not connected to the internet.When finished buying on the exchange, immediately transfer assets to the wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "June 25, 2023, 07:04:57 AM",
      "body": "To add to all they have said, try as much as you can to avoid leaving your Bitcoin in exchanges.As they have also recommended wallets for you, make sure you keep your private key safe in a place where no one can have access to it because if someone has access to your private key, your Bitcoin is gone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "June 25, 2023, 07:05:00 AM",
      "body": "Quote from: Victan22 on June 25, 2023, 05:56:37 AMHi guys,I'm super excited to finally be a part of this family of great minds in the crypto world.As a newbie in the crypto community  I've heard people talk about how great they have lost their resources on several crypto platform, so I've resolved to ask:How best do I secure my investment on bitcoin as a newbie? indeed so many people jump into the crypto with little or zero knowledge of bitcoin and it's security and intending risk, so pls i will really appreciate a response from professionals in the house Buddy first of all welcome to the platform, your query is one of the sot important ones from the basics. To secure your funds in this market all you need is to follow the slogan of Bitcoin \"Not your key, not your coins\". So always hold your fund in your personal wallet, and make sure of the security of the personal wallet as (Passphrase, Password & Private key).That is all as I always use to say safety is as simple as ABC Always Be Ccareful. That's it buddy, with good wishes that you might get success on this path.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "June 25, 2023, 09:03:06 AM",
      "body": "You shouldn't keep your bitcoin on custodial services like centralized exchanges. If you keep your bitcoin on a custodial wallet, you give full control over your coins to a a third party. It's possible that they are hacked or they steal your fund. So, you should use a non-custodial wallet. You should use a trustworthy open-source non-custodial wallet. In this way, you can be sure that there is nothing hidden from the users. If you use a close source wallet, you don't know how your keys have been generated and whether developers have access to your keys or not. With using a trust worthy non-custodial wallet, you can be sure that no one has access to your keys, but there's still the chance that your wallet is compromised and hackers steal your fund. So, if you want to be completely secure, you should use a good non-custodial wallet on an air-gapped device. If you can't have an airgapped device, you can go for a hardware wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YUriy1991",
      "created_time": "June 25, 2023, 10:16:48 AM",
      "body": "Quote from: Victan22 on June 25, 2023, 05:56:37 AMHi guys,I'm super excited to finally be a part of this family of great minds in the crypto world.As a newbie in the crypto community  I've heard people talk about how great they have lost their resources on several crypto platform, so I've resolved to ask:How best do I secure my investment on bitcoin as a newbie? indeed so many people jump into the crypto with little or zero knowledge of bitcoin and it's security and intending risk, so pls i will really appreciate a response from professionals in the house If it's very technical, maybe it's a little long, the first thing I ask is, are you ready to invest here with Bitcoin? Well, if you are ready and really ready. First, prepare your funds, secondly, choose a reliable and trusted platform (you can ask your close friends or even more experts) and have legality, at least your local government, then use the safest wallet, the choices are various good examples, BlueWallet as presented @mk4 and the first thing you need to take care of is the e-mail (Create a special one and not one that you often share with friends or colleagues in your work profession), Copy that for passwords and private keys, save them in a special place and don't save them automatically on your desktop, for example, crome. At a minimum, the basics for completeness can be added by friends here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "June 25, 2023, 10:23:53 AM",
      "body": "Quote from: Victan22 on June 25, 2023, 05:56:37 AMHow best do I secure my investment on bitcoin as a newbie? 1. Keep your coins in your own custody. The logic / wallets presented in the first reply you've got are pretty good.2. Store the seed words safely in places only you can access, and if it's a significant amount then there should be at least 2 geographically separate places for copies of that seed.3. Don't brag about how much bitcoin you own.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "June 25, 2023, 11:42:07 AM",
      "body": "I can suggest using the Electrum wallet. Download it only from the official site.  https://electrum.org/#downloadAdd the site to your favorites so you don't end up on a phishing site in the future. https://bitcointalk.org/index.php?topic=5351743.0Always avoid copy-paste functions and read about the consequences of using the CTRL-C and CTRL-V keys.https://bitcointalk.org/index.php?topic=5190776.0There can actually be a lot of advice; the best thing you can do is to gradually read the topics that interest you. Keeping the seed phrase in a safe place and using a Linux system is also a good way to start learning.But all advice can be useless if you don't understand what you're doing. Always think about what you are doing, check several times, and only then act.Topics on security :https://bitcointalk.org/index.php?topic=5434404.msg61717956#msg61717956",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "June 25, 2023, 11:47:45 AM",
      "body": "Quote from: Victan22 on June 25, 2023, 05:56:37 AMHow best do I secure my investment on bitcoin as a newbie? Make sure you actually spend your money to invest in Bitcoin, not in any Bitcoin forks, stocks, and not invest into any Ponzi.Reminder: do not keep your money in online accounts. Be your own bank with private keys of your wallets, because \"Not your private keys, not your bitcoins\"Use Non Custodial wallets and hold your bitcoins.[General] Bitcoin Wallets - Which, what, why?Recommended wallets[GUIDE] How to Safely Download and Verify Electrum[LIST] Open Source Hardware Wallets",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "June 25, 2023, 12:51:50 PM",
      "body": "Quote from: YUriy1991 on June 25, 2023, 10:16:48 AMthen use the safest wallet, the choices are various good examples, BlueWallet as presented @mk4 and the first thing you need to take care of is the e-mail (Create a special one and not one that you often share with friends or colleagues in your work profession), Copy that for passwords and private keys, save them in a special place and don't save them automatically on your desktop, for example, crome. At a minimum, the basics for completeness can be added by friends here.Your email should not be used to save your passwords or private keys, use a Hierarchical deterministic wallet so you'll have only the seed phrase to save, write it down on paper and keep it very safe, if you use a password for your wallet file that you can't remember, also write it down, but in a different place from where you wrote your seed phrase. Don't save private keys or seed phrase online or in your email, it can be hacked easily and your funds will be stolen by scammers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mamesso",
      "created_time": "June 25, 2023, 02:23:23 PM",
      "body": "Quote from: Victan22 on June 25, 2023, 05:56:37 AMHow best do I secure my investment on bitcoin as a newbie? I can suggest that you stop here to find a suitable wallet for you. [1] https://bitcointalk.org/index.php?board=37.0[2] http://bitcoin.org/en/choose-your-wallet[3] https://en.bitcoin.it/wiki/Hardware_walletThere are so many choices of wallets that you can use to secure your investment, above other users have also recommended wallets that can be used, you can choose one of the several suggested wallets.Quote from: lovesmayfamilis on June 25, 2023, 11:42:07 AMI can suggest using the Electrum wallet. Download it only from the official site.  https://electrum.org/#downloadIt looks like the link you suggested doesn't work properly in your post, I'm trying to fix it so it can be downloaded if he's interested. https://electrum.org/#download",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BD Crypto",
      "created_time": "June 25, 2023, 02:31:12 PM",
      "body": "Quote from: Victan22 on June 25, 2023, 05:56:37 AMHow best do I secure my investment on bitcoin as a newbie? Have you already invested in Bitcoin? If yes then you are welcome you have done a great work. It's not only for newbies but also for every users must have the best security for his investment in Bitcoin. To stay safe we must avoid the exchange wallets which are custodial like Binance, Kucoin, OKX or any other exchanges to keep funds in it for long term. Because there is a sentence \"Not Your Keys Not Your Coins\". So what should I do ? We must use Non custodial wallets like Electrum, Trust Wallet, Exodus etc and also choose open source wallets like Electrum. And for the best security Hardware Wallets are the best to use like Trezor, Ledger Nano etc. So try to secure your funds and keep your keys safe so that no one can get it.Quote from: Victan22 on June 25, 2023, 05:56:37 AMindeed so many people jump into the crypto with little or zero knowledge of bitcoin and it's security and intending risk, so pls i will really appreciate a response from professionals in the house We all start from zero knowledge then little and then much. But there is a Phrase: Little Learning is a Dangerous Thing and it's true. We should learn about Bitcoin, Funds Security, How it works and what are the benefits of it, the risks of losing and many more to be a proper investor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "June 25, 2023, 02:39:58 PM",
      "body": "Quote from: BD Crypto on June 25, 2023, 02:31:12 PMWe must use Non custodial wallets like Electrum, Trust Wallet, Exodus etc and also choose open source wallets like Electrum. As you said, we should use open-source wallets.Electrum is surely a good option, but both trustwallet and Exodus should be avoided. Trustwallet and Exodus are non-custodial and give you access to your private keys, but they are close-source and there is no guarantee that your keys have been generated in a secure way and you are the only one who has access to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "June 25, 2023, 02:57:04 PM",
      "body": "Quote from: mk4 on June 25, 2023, 06:00:17 AMIf your bitcoin is worth <$200 then just install BlueWallet[1] on your mobile phone. On the other hand, if it's more than $200, grab a hardware wallet[2].[1] https://BlueWallet.io/[2] https://chainsec.io/walletsWhy BlueWallet? Also on a mobile phone, the security of which is similar to a leaky bucket. Why not electrum installed on PC?You can go a little more complicated, but reliable way: Tails OS on a flash drive (electrum is preinstalled), connect it to any PC and use it. The only trouble is that you will have to enter a seed phrase every time a new one (every new session).Buying a hardware wallet already with an investment of $200? Come on. This should be done at least at $500-1000.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "June 25, 2023, 03:07:38 PM",
      "body": "Quote from: Victan22 on June 25, 2023, 05:56:37 AMindeed so many people jump into the crypto with little or zero knowledge of bitcoin and it's security and intending risk, so pls i will really appreciate a response from professionals in the house In what method do you want your Bitcoin security, storage, exchange, investment or trading, what is certain is that everyone who enters the crypto world risks always exist, for that if you talk about Bitcoin storage of course you can see here: https://bitcointalk.org/index.php?topic=5421039.msg61293646#msg61293646And if you talk about security or loss other than exchange/wallet, understand investment and trade, of course you need a lot of investment and trading knowledge and information, so that you don't run the risk of big losses, the journey of investing and trading is long it takes time to be safe and successful in that, because the risks you face are very high, miscalculations, analysis, the market will all end in regret, so learn more here about crypto, one day you will understand and understand all that, high level of security about your crypto.Don't be shy and reluctant to ask early, if you don't understand especially about crypto, the members here will be happy to help you, without reward.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "June 25, 2023, 03:10:08 PM",
      "body": "You used the term \"investment\", which means you are planning to hold for some time and to hold BTC, best practise is to use Hardware Wallets, a thread is already been made by dkbit98 Open Source Hardware Wallets. You can select any hardware wallet from the list, i suggest you to not select any DIY wallet as you are newbie so it would be confusing + difficult.Second, if you have no enough money then the probability of huge investment in BTC is low for you, so if you have less investment then you could go for Open-Source Mobile or desktop wallets such as Electrum etc. If you do not know how to setup electrum then this guide will be of great help to you.Crypto Wallet EnquiryAnd my big advice for you is:Never store you Holding BTC on Any ExchangeNever trust any of your friend and relatives or any person you meet, with your BTC, because the worst scenario is you will lost everything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "June 25, 2023, 03:20:49 PM",
      "body": "Quote from: m2017 on June 25, 2023, 02:57:04 PMAlso on a mobile phone, the security of which is similar to a leaky bucket. Why not electrum installed on PC?You also can get physical problems likePhone screen broke, how to get to mycelium wallet?Broke touchscreen, How do I get my coins off Bitcoin Wallet?QuoteYou can go a little more complicated, but reliable way: Tails OS on a flash drive (electrum is preinstalled), connect it to any PC and use it. The only trouble is that you will have to enter a seed phrase every time a new one (every new session).Tails OS are very useful if you have to use public computers that not belong to you only.[Guide] How to Install Tails OS on USB flash drive for Wallet PurposeQuoteBuying a hardware wallet already with an investment of $200? Come on. This should be done at least at $500-1000.Don't buy used (second-hand) hardware wallets.Prioritize open-source hardware wallets.[LIST] Open Source Hardware Wallets",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "June 25, 2023, 05:16:37 PM",
      "body": "Quote from: m2017 on June 25, 2023, 02:57:04 PMWhy BlueWallet? Also on a mobile phone, the security of which is similar to a leaky bucket. Why not electrum installed on PC?BlueWallet is vital for people who use IOS devices, people who use only IOS devices cannot use electrum because it is not available, thus they have to use an alternative, and BlueWallet is a good alternative; it is a non-custodial wallet and is open source too. Having said that, i don't think security issues are peculiar to mobile phones, you can use a mobile phone securely without being hacked, it basically depends on how you pay attention to personal security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}