{
  "id": "topic_5405770",
  "title": "jamyr",
  "author": "jamyr",
  "created_time": "July 10, 2022, 06:16:16 AM",
  "content": "Promise to Merit or Future Dated MeritThere have been times that I wanted to send a post a merit, but since I don't normally have an sMerit to give, what I do is either save it so that I could give it a merit whenever I can. Other times, I just try to remember to do so.Yes there is a thread where people can recommend posts that deserves a merit, but thing is, it will not come from you. -- So instead, say you believe that a post deserves a merit, based on your reasoning. Promise to merit will allow to automatically send sMerit to the post when your sMerit >= promised amount of merit to give.Example:Alice saw a post(mPost) she deemed meritorious. Alice dont have sMerit to give. Alice promise to sMerit mPost. After a week, Alice gets merit from her own post, if Alice's sMerit => 1, 1 sMerit will be sent to mPost. Ideally, limitations should be considered:1. the amount of sMerit to give to a specific post using promise to merit.2. the amount of promise to merit should be limited.3. promise to merit to a post should not be visible to public but only to the sender. Once promise to merit is fulfilled, merit sent to the post could be seen by public.Thank you.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405770",
  "comments": [
    {
      "author": "SquirrelJulietGarden",
      "created_time": "July 10, 2022, 06:59:20 AM",
      "body": "You can do it with Google Excel, Google Sheet, Note pad, WordIf you want to have script, you can ask DdmrDdmr to share as [FUN] Is DdmrDdmr even human? is a proof that the user uses a tool (script) to automatically distribute merit to posts marked with his sent merit in the past.Maybe DdmrDdmr sent 1 merit to each good post he saw, then when his sourced merit filled, he clicks on his script to remerit it with 1 or 2 more merit.Not sure if he shares, you are able to use his script. Maybe you can not use because you don't know the language he codes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "July 10, 2022, 07:52:32 AM",
      "body": "[self-moderated] Report unmerited good posts to Merit Source Some of the members who've ran out of sMerits uses that thread for other members to review and eventually give merit to that particular post if they deem it useful. Plus, I don't think any new features will be added to this forum anytime soon as epochtalk is underway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "July 10, 2022, 08:21:09 AM",
      "body": "This is such an extremely minor problem that could be fixed with more than a dozen simple solutions(bookmarking, link to txt file, etc) that it definitely shouldn't be an added feature.Next thing you know people here would be requesting that Bitcointalk should have an alarm clock or fitness tracker or something.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "July 10, 2022, 08:39:34 AM",
      "body": "I don't see any reason why you need to promise the thread starter if you want to give merit, because the users who have merit isn't only you and if the post is really high quality, you can expect he will got many merit ASAP. But if the post haven't get merited and it's already an old post, you can just report the post on the thread that @Maus0728 provided above.IMO you're just try to complicating a tiny issue, there's a lot posts in this forum, I believe you will find other high quality post when you have 1 sMerit at that time.I'm more like to see DeMerit feature since many users seems send too much Merit to some users or the post didn't even deserved any merit. I'm fine if the DeMerit only available for Merit source since they're more experienced to send sMerit, I guess if that happen in the future, there's will be a new thread of \"Report merited shit posts to Merit Source\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "July 10, 2022, 08:59:38 AM",
      "body": "Quote from: Maus0728 on July 10, 2022, 07:52:32 AM[self-moderated] Report unmerited good posts to Merit Source Yeah, I think OP knows about that:Quote from: jamyr on July 10, 2022, 06:16:16 AMYes there is a thread where people can recommend posts that deserves a merit, but thing is, it will not come from you. He's just looking for a reminder system or an automated one for members who are chronically low on sMerits.  Been there myself and it's frustrating.This is the second time I'm having to write this in 24 hours:  I've seen so many feature suggestions like this that would make it easier for members to do certain things, but I never see any of them come to fruition.  So OP, use one of the tricks suggested here and make a program for yourself, because if you plan on waiting until Theymos springs off his throne to rip through the coding necessary to implement the feature you want, you'll just become a bitter, jaded curmudgeon like me and you don't want that for yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "July 10, 2022, 09:08:44 AM",
      "body": "Quote from: jamyr on July 10, 2022, 06:16:16 AM<…>As stated (by you and others), similar situations are usually resolved by simply saving the links to the posts to merit, and then getting back to them when you’ve got some sMerits to send. Having a build-in forum feature to deal with this in an automated manner doesn’t really seem like a necessary feature. In fact, conceptually, it could render some weird results.Say for example you’ve marked 10 posts to give 1 sMerit to, but you yourself are empty pocketed. You then start receiving at a rate of 10 Merits per month (having therefore generated a batch of 5 sMerits per month). You’d take two months to cover your automated self-committed sMerits, but in the meantime, you won’t be able to give sMerits to any posts you encounter in your day to day readings, since you are virtually stalled by the self-committed sMerits. You’d probably then add more post to the self-committed sMerit list, and could end-up in a perpetual state of \"paying off\" your self-committed sMerits rather than having the capability to sMerit as you go. In addition, you could end-up meriting accounts that are banned in the interim (unless the automated process has a flag to avoid this – good luck with this feature being implemented).I’d rather have the freedom to balance out my decisions between those posts I want to merit on the fly, and those I were to bookmark (were it the case), than steer my meriting habits to automatically give priority to a self-committed backlog automatically.Note: By self-commitment I mean the action by which one has vouched to himself, as opposed to committing to another person explicitly by means of comments or such on posts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "July 10, 2022, 09:21:04 AM",
      "body": "Quote from: jamyr on July 10, 2022, 06:16:16 AMPromise to Merit or Future Dated MeritWhy overcomplicate the things? No reason, really.The forum should be (and is) centered on discussing things, not on getting merit. Merit is.. just a bonus.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jamyr",
      "created_time": "July 10, 2022, 11:10:07 AM",
      "body": "Quote from: SquirrelJulietGarden on July 10, 2022, 06:59:20 AMIf you want to have script, you can ask DdmrDdmr to share as [FUN] Is DdmrDdmr even human? is a proof that the user uses a tool (script) to automatically distribute merit to posts marked with his sent merit in the past.Maybe DdmrDdmr sent 1 merit to each good post he saw, then when his sourced merit filled, he clicks on his script to remerit it with 1 or 2 more merit.Not sure if he shares, you are able to use his script. Maybe you can not use because you don't know the language he codes.That is so cool.  Quote from: Maus0728 on July 10, 2022, 07:52:32 AM..cut..Yeah that's the thread I was referring to, thanks anyways.Quote from: mk4 on July 10, 2022, 08:21:09 AMThis is such an extremely minor problem that could be fixed with more than a dozen simple solutions(bookmarking, link to txt file, etc)Yeah currently I bookmark.Quote from: Apocollapse on July 10, 2022, 08:39:34 AMI don't see any reason why you need to promise the thread starter if you want to give merit,It's like a remember-to stuff. No need to let the author know.Quote from: The Pharmacist on July 10, 2022, 08:59:38 AMHe's just looking for a reminder system or an automated one for members who are chronically low on sMerits.  Been there myself and it's frustrating.This is the second time I'm having to write this in 24 hours:  I've seen so many feature suggestions like this that would make it easier for members to do certain things, but I never see any of them come to fruition.  So OP, use one of the tricks suggested here and make a program for yourself,Maybe I'll use one of my topics in Archival and save the links there. Thank you.curmudgeon: [noun] a crusty, ill-tempered, and usually old man.source: web searchcrusty!!!Quote from: DdmrDdmr on July 10, 2022, 09:08:44 AMI’d rather have the freedom to balance out my decisions between those posts I want to merit on the fly, and those I were to bookmark (were it the case), than steer my meriting habits to automatically give priority to a self-committed backlog automatically.Note: By self-commitment I mean the action by which one has vouched to himself, as opposed to committing to another person explicitly by means of comments or such on posts.Okay. I will maybe use the archival topic.Quote from: NeuroticFish on July 10, 2022, 09:21:04 AMWhy overcomplicate the things? No reason, really.One of my many episodes. sorry,Conclusion:I will just try to be crafty and use the available tools. Thank you all for your input. locking it....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}