{
  "id": "topic_5468883",
  "title": "robelneo",
  "author": "robelneo",
  "created_time": "October 02, 2023, 11:15:15 AM",
  "content": "Kala natin mga pangkaraniwang tao lang ang naiiscam ng mga Ponzi scheme gamit ang Cryptocurrency, ito kababalita lang 2 artista ng Gma Sparkle na mag kasintahan ang na iscam ng Cryptocurrency Ponzi scheme bukod sa kanila mayroong iba pa silang kasama  na iscam na umabot sa 8 milyon piso..Dating modus operandi aalukin ka na mag invest para sa 5% monthly interest nung una ay narereceive nila ang profit dahil dito sila ay kumagat sa double profit na tubo hangang sa tuluyan na silang pinagtaguan ng mga scammers Panoorin ang kabuuan ng balita na ito Kababalita lang habang sinusulat ko ang post na ito iuupdate ko na lang ang Youtube link pagkatapos ng live telecast ng 24 Oras.https://www.youtube.com/watch?v=eWZXfSjRqo0",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468883",
  "comments": [
    {
      "author": "Beparanf",
      "created_time": "October 02, 2023, 11:23:42 AM",
      "body": "Quote from: robelneo on October 02, 2023, 11:15:15 AMDating modus operandi aalukin ka na mag invest para sa 5% monthly interest nung una ay narereceive nila ang profit dahil dito sila ay kumagat sa double profit na tubo hangang sa tuluyan na silang pinagtaguan ng mga scammers Bilib din nmn ako sa mga scammer na ito. Bukod sa may connection sa mga artista ay ang lalakas pa ng loob magoffer ng investment scheme na kahit bangko ay hindi kaya ibigay sa investors nila despite mga real professional fund manager ang empleyado nila.Siguro mga batak itong suspect sa futures trading tapos nagkasunod2 yung talo kaya hindi na makabayad since sure ako na may nagbacker sa mga scammer na ito para makuha ang tiwala ng mga artista. Nakakapagtaka kasi na papatol ang mga artista sa investment scheme na offer ng kung sinu lng na individual. Mabigat pa nito ay kung literal na ubos na yung pera nila dahil hindi na talaga sila mababayadan tapos saglit lang yata ang kulong sa ganitong case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kingvirtus09",
      "created_time": "October 02, 2023, 12:16:45 PM",
      "body": "Kakapanuod ko lang nyan ngayon sa GMA saksi 24 oras, nadungisan na naman ang cryptocurrency.  Yan ang problema kapag masama ang intensyon ng indibidwal na tao. In fairness, inalagaan pa muna ng scammer yung bibiktimahin, kumbaga pinadama o pinapanalo muna para maging makatotohanan, dahil mas malaking halaga pala yung main target nung scammer. At nagtagumpay siya, dahil nung nakuha na nya yung tiwala ng artista ay dun na siya tumirada ng milyon na demand sa artista, dahil napasukan din ng greed yung artista at nakita nyang kumita siya sa una, ayun kumagat din, nahulog na sa patibong ng scammers. Pinairal kasi tiwala lang  at hindi nagsagawa ng Dyor din sa ginagawa nila.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "October 02, 2023, 01:00:17 PM",
      "body": "Ako sa nakita ko sa dalawang artista na ito, pinakita din nila yung kanilang pagiging sakim sa pera, isipin mo naniwala agad sila na within 2 weeks tutubo din agad yung pera nila ng walang ginawang pag-iimbestiga. Ibig sabihin sa simula palang alam na ng scammer talaga na mahuhulog sila sa intensyon ng masamang loob, ang hindi lang maganda talaga ay nadamay na naman ang cryptocurrency.Kung sa bagay, kung marunong ang viewers hindi rin sila agad basta maniniwala na lahat ng crypto ay masama. Dahil ang totoong masama ay yung gumagamit ng crypto sa kasamaan.,Siguro ilang linggo mula ngayon malalantad narin yang mga scammer, maliban nalang kung nasa ibang bansa na sila agad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bhadz",
      "created_time": "October 02, 2023, 01:36:33 PM",
      "body": "Iba talaga kapag kulang sa financial literacy at kahit mga artista pa madadale nitong mga modus ng mga scammer na ito. Siguro panahon na talaga para iforce ang financial literacy na mga subjects sa mga school at pati sa lahat ng mga agencies at companies para ang lahat ng mga breadwinner, meron silang knowledge kung paano nila iingatan yung perang pinaghirapan nila. Kasi kung titignan natin yung modus, halos parehas lang din sa mga nakaraan na mga scam tapos paulit ulit lang at ang naiba lang, this time ay mga artista ang nabingwit nitong mga scammer na ito. Paulit ulit lang yan at hangga't walang action na gagawin ang mga ahensya ng gobyerno, schools at private corporations, mangyayari lang yan ulit although na ang responsibilidad ay nasa bawat indibidwal pero malaking bagay kung merong initiative na magmumula sa mga nabanggit na yan. Problema na din kasi sa ating dugo yung easy money, kikita ng malakihan tapos walang gagawin. Parang embedded na sa atin na ganito lang gusto natin at iniisip na passive income.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "October 02, 2023, 01:42:49 PM",
      "body": "Grabe, wala talagang kawala sa mga scammer na 'to. Kahit mga artista o kilalang personalidad ay nagiging biktima nila, pero kung sabagay ito nga naman yung mga klase ng tao na may pera. Clever din nyang scammer na yan at pinakagat muna nya yung mga naging biktima nya at pinakita na maayos yung system nya para mag tiwala sakanya. Pero aside from that, isang balita nanaman ito na makakasira sa image ng crypto sa bansa. Ang masama kasi dito ay hindi na nga ganun kaganda ang tingin ng mga kababayan natin sa crypto dahil sa portrayal ng media dito, mababalita pa na ganito. Pano ba naman kasi yung crypto ang nasisisi at hindi yung mga scammer mismo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tech30338",
      "created_time": "October 02, 2023, 02:00:25 PM",
      "body": "Nakakapagtaka lang kasi madalas itong balita na ito at mga artista sila sa GMA7 kung saan madalas din ang ganetong balita na napapalabas sa network nelaAt madalas ding sinasabi na huwag basta basta magtiwala lalo na kapag too good to be true ang makukuha nila in return , sa kabila neto bakita marami parin ang naloloko kahit sinabi na ng SEC na magingat hindi kaya meron silang pinapaamoy parang ganun sa budol na mapapapayag kanila, kahit ayaw mo? kahit kasi sa social media kung saan nagtitiktok sila may babala din eh, weird diba.Pero sa huli tama sinabi nila huwag basta nagtiwala lalo na kung too goog to be true ang return, wag din sayangin ang pera sa mga ganeto ang maissuggest ko:Instead na iba ang magmanage bakit hindi nlang nila aralin, magopen ng sariling account sa mga CEX, at maggawa ng sariling metamask, account nila, para sakin kung matalo ako sa trade ako mismo ung nagkamali hindi iyong walang kalaban laban ang pera mo nawala ng dika manlang ginanahan or naexcite, mahirap din minsan iba pinagmamanage ng pera, minsan tlga tinatakbo ng mga swapang at ganid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "October 02, 2023, 02:14:08 PM",
      "body": "Kaya dapat tayo hindi basta basta naniniwala sa mga iniendorse kasi sila nga naiiscam parang yung nang yari kay Luis Manzano nakapanghikayat para mag invest sa mga scammers, nagtataka ako ang alam ko yang mga artista may mga abogado yan at mga investment adviser, sa kaso ng dalawang ito malamang di sila humingi muna ng advice sa mga abogado nila.Nagpadala sila sa greed nila sabagay di mo naman sila masisisi kasi ang pag aartista walang kasiguruhan, maaring sikat ka ngayun pero sa mga susunod na mga tao n may mga bagong mukha na papalit sa inyo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "October 02, 2023, 03:45:25 PM",
      "body": "Quote from: tech30338 on October 02, 2023, 02:00:25 PMPero sa huli tama sinabi nila huwag basta nagtiwala lalo na kung too goog to be true ang return, wag din sayangin ang pera sa mga ganeto ang maissuggest ko:Instead na iba ang magmanage bakit hindi nlang nila aralin, magopen ng sariling account sa mga CEX, at maggawa ng sariling metamask, account nila, para sakin kung matalo ako sa trade ako mismo ung nagkamali hindi iyong walang kalaban laban ang pera mo nawala ng dika manlang ginanahan or naexcite, mahirap din minsan iba pinagmamanage ng pera, minsan tlga tinatakbo ng mga swapang at ganid.Sa sobrang busy nila baka di na sila magkapanahon pa dyan kaya ginawa nila nag shortcut na lang sila at bumakas na lang sila sa mga traders kuno para sa siguradong kita pero kung may naka pag educate sana sa kanila na sa trading walang garantisadong kitaan at minabuti na lang nila ang mag hold mas kikita sila.Pero sa tingin ko sa impuwensya nila at mapera naman sila kaya nila mag demanda sa mga akusado, sana makabalita tayo ng mga scammers sa mga Crypto trading dito sa Pilipinas na makukulong, isa ito sa mga dahilan kaya hirap yung adoption sa atin, suma sama talaga ang image ng Cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "October 02, 2023, 03:51:40 PM",
      "body": "Kapag may mga napapanood akong ganitong kaso, naaalala ko at bumabalik sa akin ang nangyari sa amin noon, kung paano kami na-scam. Parang ganito rin, dahil sa koneksyon ng mag-anak na humihikayat sa iyo na mag-invest sa isang modus, nadadamay pa sa mga magiging biktima. Hindi sila aware sa mga ganitong Ponzi scheme, ang alam lang nila ay ang kikitain na pera.Dapat ang SEC ay nagve-verify ng mga address ng mga kompanya o korporasyon na nag-apply sa kanila upang tiyakin kung talagang mayroon itong kredibilidad at legalidad. Gayunpaman, sa ganitong sitwasyon, wala palang ganong address na nasambit.Eto yung specific clip ng mismong balita: https://youtu.be/8APBWh8d_p8",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xLays",
      "created_time": "October 03, 2023, 08:54:34 AM",
      "body": "Quote from: robelneo on October 02, 2023, 11:15:15 AMKala natin mga pangkaraniwang tao lang ang naiiscam ng mga Ponzi scheme gamit ang Cryptocurrency, ito kababalita lang 2 artista ng Gma Sparkle na mag kasintahan ang na iscam ng Cryptocurrency Ponzi scheme bukod sa kanila mayroong iba pa silang kasama  na iscam na umabot sa 8 milyon piso..Dating modus operandi aalukin ka na mag invest para sa 5% monthly interest nung una ay narereceive nila ang profit dahil dito sila ay kumagat sa double profit na tubo hangang sa tuluyan na silang pinagtaguan ng mga scammers -snip-Panoorin ang kabuuan ng balita na ito Kababalita lang habang sinusulat ko ang post na ito iuupdate ko na lang ang Youtube link pagkatapos ng live telecast ng 24 Oras.Base sa balita yung 5 yung kakasuhan pinaghahanap pa, yung isa sa lima college student pa which is hindi naman nagtatago. Not sure kung ponzi scheme bato kasi ang kwento nila na nagrereklamo is papasok din sa trading yung funds na nakulekta, baka nataon lng din talaga na yung coin na pinag investan nila bumaba na yung value or sabihin natin na liquidate sila.Dapat talaga nyan harapin nung mga nakasuhan para malaman din natin yung side nila kung ano ba talaga nangyari base kasi sa balita iba iba yung kung saan lalagay yung pera.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arwin100",
      "created_time": "October 03, 2023, 01:45:30 PM",
      "body": "Quote from: xLays on October 03, 2023, 08:54:34 AMQuote from: robelneo on October 02, 2023, 11:15:15 AMKala natin mga pangkaraniwang tao lang ang naiiscam ng mga Ponzi scheme gamit ang Cryptocurrency, ito kababalita lang 2 artista ng Gma Sparkle na mag kasintahan ang na iscam ng Cryptocurrency Ponzi scheme bukod sa kanila mayroong iba pa silang kasama  na iscam na umabot sa 8 milyon piso..Dating modus operandi aalukin ka na mag invest para sa 5% monthly interest nung una ay narereceive nila ang profit dahil dito sila ay kumagat sa double profit na tubo hangang sa tuluyan na silang pinagtaguan ng mga scammers -snip-Panoorin ang kabuuan ng balita na ito Kababalita lang habang sinusulat ko ang post na ito iuupdate ko na lang ang Youtube link pagkatapos ng live telecast ng 24 Oras.Base sa balita yung 5 yung kakasuhan pinaghahanap pa, yung isa sa lima college student pa which is hindi naman nagtatago. Not sure kung ponzi scheme bato kasi ang kwento nila na nagrereklamo is papasok din sa trading yung funds na nakulekta, baka nataon lng din talaga na yung coin na pinag investan nila bumaba na yung value or sabihin natin na liquidate sila.Dapat talaga nyan harapin nung mga nakasuhan para malaman din natin yung side nila kung ano ba talaga nangyari base kasi sa balita iba iba yung kung saan lalagay yung pera. Kakahiya yung nangyari sa kanila biruin mo na outdmart sila ng college student at natangayan sila ng milyon. Nung una palang talaga dapat nag duda na sila o di kaya nag research man lamang ng kunti dahil maliligtas sila sa tiyak na kapahamakan kung ginawa lang nila yun. Kaso nauna yung greed nila at umasang kikita ng malaki kaya ayun relationship goal nila ngayon ang ma scam. Kaya sana hindi na pamaresan to at unti unti na sanang maubos ang mga pinoy na nag titiwala sa mga scams o di kaya easy money.Kung ponzi ba ito malamang sa malamang ganun talaga yan at paulit ulit na method lang ang ginamit ng mga scammers pero wala eh mahirap talaga matoto ang mga pinoy since lamang sa karamihan ang paniwalain sa bagay bagay na medyo impossibleng mangyari sa maikling panahon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "October 03, 2023, 05:58:12 PM",
      "body": "This is why kahit galing sa kamaganak ko yung referral sa mga kagaya nitong investment scheme is duda talaga ako. Too good to be true yung offer sakanila at alam nila yung, nagkamali lang sila na pinatulan nila porket successful yung front scheme nila na 5% compounding is mag titiwala padin sila. Kahit hindi too good to be true investment is ni reresearch padin dapat. One sad thing is apektado nanaman yung crypto sa public dahil crypto yung ginamit ng scammers at yung headlines is crypto scam. May maloloko at maloloko padin kahit na media na yung ganitong scam schemes ng paulit ulit kaya yung best na gawin natin is to educate people na wala masyadong idea or nabubulag sa possible returns ng pinapasukan nilang investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sanugarid",
      "created_time": "October 03, 2023, 06:39:38 PM",
      "body": "Grabe yung mga sacmmer ngayon kung ano ano na lang pinaggagawa nila para lang makascam, napunta na rin sila sa crypto. Sobrang laki rin ng natangay nilang pera ha millions ata.Kaya dapat talaga wag agad magtitiwala at laging idouble check project, mautak rin yung mga scammer dahil inalagaan muna talaga nila ito hanggang sa makuha na nila yung loob ng 2 at nung malaki laki na yung nalabas na pera dun na sila kumilos",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "October 03, 2023, 09:01:11 PM",
      "body": "Buti may mga pangalan na nakuha kasi minsan wala. Sana mapatawan ng mabigat na parusa mga ito kaya lagging umuulit o mayroon na namang gagawa kasi alam ng karamihan na hindi mabigat iyong kaso na isasampa kapag nahuli. Sa totoo lang hindi naman talaga crypto ang investment na ito, ginagamit lang nila ito para makahikayat lalo na't alam ng karamihan na marami ang yumaman sa crypto lalo na sa panahon ngayon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Twentyonepaylots",
      "created_time": "October 03, 2023, 09:39:48 PM",
      "body": "Actually anything can be used as GOLD as scheme for scam investment, literally everything kahit property pa yan. Di na nakakasurpresa yung mga ganitong balita lalo na sa mga wala talagang alam or researches about crypto. Laganap talaga yung mga ganitong scam sa crypto, they are using the name of crypto para makattract ng mga potential investor, syempre lumalago na yung industry ng crypto, sabayan mo pa ng mga exaggerated na kwento from other people, although yung iba ay makatotohanan naman talaga. Kung mascam ako sa crypto, baka hindi ko na ipagsabi sa iba e kasi nakakahiya lang especially kung kilala ka nila as enthusiast or known for several years na involve sa crpyto space.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "October 03, 2023, 11:22:13 PM",
      "body": "Quote from: rhomelmabini on October 03, 2023, 09:01:11 PMButi may mga pangalan na nakuha kasi minsan wala. Kawawa yung mga biktima na walang pangalan at hindi bibigyan ng special treatment kapag nag sampa ng kaso. Yung ganito ay matututukan ng mga police at gagawan nila ng operation yan dahil magkakaroon sila ng magandang record at mame-media yan. Hindi ko sinasabing wala silang ginagawang action pero kapag ganito, mas makikita sa public na gumagawa sila ng paraan para matrack yang mga scammers na yan at may mga lehitimong operasyon silang ginagawa para mahuli itong mga panloloko nila.Quote from: rhomelmabini on October 03, 2023, 09:01:11 PMSana mapatawan ng mabigat na parusa mga ito kaya lagging umuulit o mayroon na namang gagawa kasi alam ng karamihan na hindi mabigat iyong kaso na isasampa kapag nahuli.Ang mahirap sa mga ganitong kaso kung hindi areglo, magkakaroon lang yan ng piyansa at yung piyansang ipambabayad nila ay galing din sa napag-scamman nila. Kaya mahirap din sa batas natin na mapahuli itong mga manloloko na ito lalo na kapag alam ng mga nasa itaas na malaki laking pera ang nakulimbat nila dahil sigurado piyansa lang ang katapat niyan.Quote from: rhomelmabini on October 03, 2023, 09:01:11 PMSa totoo lang hindi naman talaga crypto ang investment na ito, ginagamit lang nila ito para makahikayat lalo na't alam ng karamihan na marami ang yumaman sa crypto lalo na sa panahon ngayon.Ayun na nga kabayan. Ginagamit nila ang crypto o Bitcoin sa pangs-scam nila at sasabihin nilang kumikita sila sa trading which is totoo namang puwedeng kumita sa trading. Kaso itong mga scammer ang puhunan nila laway lang. Sa interview ni Mikee Quintos, parang nauna siyang nag invest sa ibang investments na inalok sa kanya at parang kinuha muna ang loob niya tapos binayaran siya ng walang palya hanggang sa inengganyo siya sa crypto investment at doon na din niya nayaya ibang kaibigan niya at boom, doon na sila dinale nitong mga scammers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "October 04, 2023, 06:29:40 AM",
      "body": "Quote from: robelneo on October 02, 2023, 11:15:15 AMHindi naman namimili ang mga scammers , lalo na at ang biktima ay makasarili at may pagka sakim din na naniniwalang mabilis kikita ang pera nila,bakit hindi mag negosyo ng matino kesa easy money?QuotePanoorin ang kabuuan ng balita na ito Kababalita lang habang sinusulat ko ang post na ito iuupdate ko na lang ang Youtube link pagkatapos ng live telecast ng 24 Oras.https://www.youtube.com/watch?v=eWZXfSjRqo0Napanood ko to at ang nasabi ko lang , na sa tagal ng nakakabiktima ng mga ganitong modus eh hanggang ngayon meron pa ding naniniwala?now mahaba habang kasohan nnman to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "October 04, 2023, 02:56:39 PM",
      "body": "-      Ako nakikita ko dyan, panalo panalo ang scammer dyan, dalawa lang nga nakikita ko dyan sa scammer na bumiktima sa kanila, una nagtatago na talaga yan or pwedeng harapin nila ang kasong sinampa sa kanila at kahit pa na guilty ang kalalabasan ng desisyon sa korte, panalo parin yung scammer?Sa paanong paraan panalo parin ang scammer? Siyempre ,dahil milyon naman ang naiscam nila ay magbabayad sila ng pangpiyansa, barya lang yan sa pera nakuha nila sa biniktima nila sa totoo lang, ito ay sa aking analisa lang naman na posiblemg ganun pero di qu rin sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Viscore",
      "created_time": "October 04, 2023, 03:07:20 PM",
      "body": "Nakita ko rin ang balitang ito sa TV. Mukhang naluko talaga sila dahil nga wala silang alam. Naniwala na lang sila sa mga buwanang returns ng investment na ni recommend ng malapit na kaibigan ng kanilang pamilya. Ayon, agad na nagtitiwala. Sa umpisa, may natatanggap pa silang kita, pero habang tumatagal, wala nang ibinibigay. Ganito naman talaga ang estilo ng scam, para mas maengganyo, bibigyan ka muna nila ng kita. Ang tawag dito ay PONZI scheme. Kawawa naman sila, pero sana ay matuto sila.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}