{
  "id": "topic_5467683",
  "title": "emre06060",
  "author": "emre06060",
  "created_time": "September 22, 2023, 08:18:12 AM",
  "content": "Son günlerde sosyal medyada yayımlanan bir video beni dehşete düşürdü. Atatürk resmini eline alan bir lise öğrencisi resmi mahrem yerlerine sürerek video paylaşmıştı. İşin en vahim tarafı bir imam hatip öğrencisi olması. Çünkü biliyoruz ki ülkemizde imam hatipli olanların bir kısmı bir şekilde Atatürk düşmanı olmayı benimsiyor. Nedenini hala anlamış da değilim. Atatürk din düşmanı, imam düşmanı olan birisi değil aksine dinin sahte hocalardan değil gerçek ilim sahibi hocalardan öğrenilmesi gerektiği fikriyle 1924'te imam hatip okullarını açmış ve bilime bu okullarda ağırlık verilmişti. Neyse asıl konu bu değil. Asıl konu bu rezil görüntülerde şahsın 17 yaşında olmasına reşit olamamasına atıfta bulunan bir kesmin şahsın tutuklanmaması, hatta özür dileyip bırakılması gerektiği fikrinde olması. Ben buna katılmadığımı aynı şeyi incil işin, kuran için, bayrak için yapan aynı yaştaki kişi nasıl ceza alacaksa aynı cezanın verilmesi taraftarıyım. Çünkü alay ettiği değer topluma malolmuş bir değer. 17 yaşında tecavüz etse reşit sayılacak, evlense çocuğu olacak bir şahıs bu çocuktur deyip geçiştirilmemeli.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467683",
  "comments": [
    {
      "author": "Mustang Shelby",
      "created_time": "September 22, 2023, 12:01:34 PM",
      "body": "Ahmet Davutoğlu bu dediğiniz şeye benzer bir açıklama yaptı. Yerinin hapis olmadığını söyledi bence yeri net bellidir kısa süreli bile olsa hapis cezası almalı ki bu konuda tepkisiz kalınırsa önüne geçilemez şeyler olur. Büstlere geçmişte nasıl saldırılar olduğunu herkes hatırlıyor ve her okulda bir büst bulunmak zorunda. Bunların önüne geçmezsek daha kötü senaryolar olabilir. Bu milletinkahramanı olmasaydı o bugün doğmayacaktı bile.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "September 22, 2023, 09:01:55 PM",
      "body": "Özrü kabahatinden büyük diye bir laf var ya tam olarak o olay bu.Çocuk yaptığı savunmada resimdeki kişinin Atatürk olduğunu bilmediğini söylemiş. Buna da kim inanırsa artık. Tamam gençtir bir hata yapmıştır denir ama bu tamamen ilgi çekmek için kasıtlı yapılmış bir şey. Arkadaşlarıyla eğleneyim onlar arasında bir yer bulayım derken yapılmış bir hata. Hafife alınmadan ciddi bir ceza verilmeli ki ilerde benzer olaylar yaşanmasın gençler sapıtıp durmasın",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "September 23, 2023, 07:31:49 AM",
      "body": "Quote from: xzone on September 22, 2023, 09:01:55 PMÖzrü kabahatinden büyük diye bir laf var ya tam olarak o olay bu.Çocuk yaptığı savunmada resimdeki kişinin Atatürk olduğunu bilmediğini söylemiş. Buna da kim inanırsa artık. Tamam gençtir bir hata yapmıştır denir ama bu tamamen ilgi çekmek için kasıtlı yapılmış bir şey. Arkadaşlarıyla eğleneyim onlar arasında bir yer bulayım derken yapılmış bir hata. Hafife alınmadan ciddi bir ceza verilmeli ki ilerde benzer olaylar yaşanmasın gençler sapıtıp durmasın Atatürk’e yapılan hakaretleri kesinlikle sert şekilde cezalandırmalı bence sonuçta Türkiye cumhuriyeti kurucusu ve bugün böyle rahat yaşıyorsak bunu ona ve askeri dehasına, canlarını veren şehitlere borçluyuz o yüzden Atatürk’ün manevi değerini asla azaltmalarına izin vermemeliyiz ayrıca Atatürk olduğunu bilmediğini söyleyerek kime inandıracak acaba",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "onurgozupek",
      "created_time": "September 23, 2023, 10:11:05 AM",
      "body": "Olayın vehametini tartışmaya gerek yok. Yapılan şey, Türkiye'nin kurucusuna, atasına saygısızlıktır. Cezası verilmelidir.ANCAK, herkesin bu olayın bokunu çıkartmasına karşıyım. Çünkü, bir çocuğa 17 yaşına gelene atasına saygı duymayı öğretemeyen ailesi, öğretmenleri, akrabalarının yanı sıra o görüntüleri çeken ve en az o çocuk kadar suçlu arkadaşlarının ve yakın çevresinin de çocuğun kendisi kadar suçlu olduğu unutulmamalıdır.Bu güne kadar kimse \"bak evladım sen 7 yaşında okula başladın, 10 senedir haftanın 5 günü, yılın 9 ayı elinde tuttuğun fotoğrafa bakarak ders işledin, bu topraklarda özgür dolaşabiliyorsan, esaret altında değilsen bunu Atatürk'e borçlusun\" dememiş mi? Muhtemelen dememiş. Çünkü öyle olsaydı, çevresinde Atatürk'e değer veren bir kaç kişi olabilseydi, o çocuk o boku yemeye cesaret edemezdi. Son 20 yılda eğitim sistemi o kadar bozuldu ki, tüm kanı bozukların cahil cesareti katlanarak arttı. Öyle bir hale geldik ki o çocuk cezasını çekip salıverildikten sonra olduğundan daha iyi yerlere gelecek muhtemelen ve biz buna seyirci kalacağız..Yapılan son derece yanlıştır. Tüm suçu tek bir kişiye yıkmak ise saçmalıktır.Arkadaşına hakaret edersen bu senin sorumluluğundadır. Sonucuna katlanırsın. Ancak Ata'mıza terbiyesizlik yapabiliyorsan, bunun tek suçlusu sen olamazsın. O kadar basit değil...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "September 24, 2023, 06:26:56 PM",
      "body": "Quote from: xzone on September 22, 2023, 09:01:55 PMÖzrü kabahatinden büyük diye bir laf var ya tam olarak o olay bu.Çocuk yaptığı savunmada resimdeki kişinin Atatürk olduğunu bilmediğini söylemiş. Buna da kim inanırsa artık. Tamam gençtir bir hata yapmıştır denir ama bu tamamen ilgi çekmek için kasıtlı yapılmış bir şey. Arkadaşlarıyla eğleneyim onlar arasında bir yer bulayım derken yapılmış bir hata. Hafife alınmadan ciddi bir ceza verilmeli ki ilerde benzer olaylar yaşanmasın gençler sapıtıp durmasın Bu çocuğa şu taktiği veren avukatın da ta aq. İş o kadar gerizekalı ki bulabildikleri tek savunma bu olmuş. Bu devacı vs. dinci insanların maalesef kafa yapısı böyle. Bu çocuğun yetiştiği aile ortamını bir hayal edin. Sevmeyebilirsiniz ya da fikirlerine katılmayabilirsiniz ama bu çocuk Atatürk hakkında evde kim bilir neler gördü ki böyle bir şeyi yapabiliyor. Bazı olaylar bazı olgular için turnusol görevi görebiliyor. Bu çocuğun durumu da öyle oldu. Çocuğu savunan ya da koruyan vs kim varsa benim gördüğüm kadarıyla istisnasız d.ly.rak kimseler oldu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "September 24, 2023, 06:36:47 PM",
      "body": "İktidarı bu konuda alkışlamak lazım istedikleri türde seçmen geliyor cahil, gördüğünden anlamayan, okuduğundan birşey çıkartamayan adam yıllarca atatürk'ü görüyor ve onun kim olduğunu bilmiyor.  sözde.Savcılıktan tut birçok alanın içi boşalınca böyle saçma savunmaları kabul ediyorlar. Bu çocuk ceza evine girecekmi sanıyorsunuz? adam öldüreni ceza evinde tutamıyorsun. Ceza falan almaz sadece okul hayatı artık dışarıdan devam eder bu çocuk siyasete bile girecek göreceksiniz. Tam istedikleri seçmen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "September 29, 2023, 05:52:50 PM",
      "body": "chp trolleri kadar zavallısı yok...pkk'nın siyasi uzantısı ile her türlü seçim ittifakına girip bütün naneleri yedikten sonra hınçlarını 17 yaşındaki bir çocuğun arkadaş ortamında yaptığı anlamsız hareketten çıkarmaya çalışıyorlar. :)işlerine geldiği zaman kafaya kalpak takıp atatürkçülük oynuyorlar, ki bu işlerine gelme konusu genelde din düşmanlığı yapmak istediklerinde ortaya çıkıyor, ki çocuğun gündem olması da imam hatipli olması ile alakalı...işlerine gelmediği zaman 'askeri değil, generali olsanız ne yazar it sürüleri' diyenlerin eteğini öpüyorlar (birkaç milletvekili koltuğu kapmak için)...https://www.facebook.com/stargazete/videos/571514366680993/atatürk'ü böyle işinize geldiğinde canınızın istediği gibi kullanırsanız çoluk çocuktan böyle davranışlar görürsünüz; azıcık kalıbınızın adamı olun.ayrıca, rahat bırakın artık şu adamı, sömürmeyin, din düşmanlığı yapmak için maske olarak kullanmayın, tarih zaten onun da sizin de ne olduğunuzu biliyor, teknoloji çağında kimseyi ahmaklık duvarına sıkıştıramazsınız...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "emrecemsan",
      "created_time": "September 29, 2023, 05:56:54 PMLast edit: September 29, 2023, 06:51:18 PM by emrecemsan",
      "body": "Dünyanın hiçbir yerinde milli değerleri aşağılayıp güle oynaya hayatınıza devam edemezsiniz. O yüzden bu çocuğu korumaya çalışanlar neyin kafasını yaşıyor hiçbir fikrim yok açıkçası. Siz örneğin gidin Almanya'ya onların milli değerleriyle açık açık dalga geçin bakalım neler oluyor. Aynı hassasiyetin ülkemizde de olması çok güzel bir şey ve umarım buna yönelik anayasal yaptırım da her zaman var olur. İster reşit olsun ister olmasın bu insan sonuçta bir birey. Ayrıca 5 yaşında çocuk da değil yani bir şeyleri çok iyi idrak edebilecek bir yaşta.Edit: @CLS63 size ABD konusunda katılıyorum. Biraz dikkatsiz bir şekilde yazmışım.    Avrupa ülkelerini örnek vermem gerekirdi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CLS63",
      "created_time": "September 29, 2023, 06:02:30 PM",
      "body": "Quote from: trendcoin on September 29, 2023, 05:52:50 PMchp trolleri kadar zavallısı yok...pkk'nın siyasi uzantısı ile her türlü seçim ittifakına girip bütün naneleri yedikten sonra hınçlarını 17 yaşındaki bir çocuğun arkadaş ortamında yaptığı anlamsız hareketten çıkarmaya çalışıyorlar. işlerine geldiği zaman kafaya kalpak takıp atatürkçülük oynuyorlar, ki bu işlerine gelme konusu genelde din düşmanlığı yapmak istediklerinde ortaya çıkıyor, ki çocuğun gündem olması da imam hatipli olması ile alakalı...işlerine gelmediği zaman 'askeri değil, generali olsanız ne yazar it sürüleri' diyenlerin eteğini öpüyorlar (birkaç milletvekili koltuğu kapmak için)...https://www.facebook.com/stargazete/videos/571514366680993/atatürk'ü böyle işinize geldiğinde canınızın istediği gibi kullanırsanız çoluk çocuktan böyle davranışlar görürsünüz; azıcık kalıbınızın adamı olun.ayrıca, rahat bırakın artık şu adamı, sömürmeyin, din düşmanlığı yapmak için maske olarak kullanmayın, tarih zaten onun da sizin de ne olduğunuzu biliyor, teknoloji çağında kimseyi ahmaklık duvarına sıkıştıramazsınız...Bu yaşananlardan dolayı ifade özgürlüğünün İsveç'de olduğu gibi olmasını istiyorum.İsteyen gitsin yarın Kuran-ı Kerim'i yaksın İncil'i yaksın Tevrat'ı yaksın isteyen de Atatürk'ün resmini yaksın bir şeyler yapsın.Ne dinlerin değeri 3-5 kendini bilmez onlara saldırdı diye azalır ne de ülkenin kurucu lideri ona saldırdı diye azalır.Yalnız bu arada çocuğun arkadaş ortamında yaptığı hareketten dolayı tepki gösterenler arasında çok sayıda MHPli isim de var MHP pkk'nın siyasi uzantısıyla hangi seçim ittifakına girdi?Bu çocuğun işlediği suçun üst sınırına bakacak olursak bile tutuklanması saçmalık sosyal medyaya göre mahkemelerin karar veriyor olması ülke açısından oldukça üzücü.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "September 29, 2023, 06:06:04 PM",
      "body": "Quote from: CLS63 on September 29, 2023, 06:02:30 PMQuote from: trendcoin on September 29, 2023, 05:52:50 PMchp trolleri kadar zavallısı yok...pkk'nın siyasi uzantısı ile her türlü seçim ittifakına girip bütün naneleri yedikten sonra hınçlarını 17 yaşındaki bir çocuğun arkadaş ortamında yaptığı anlamsız hareketten çıkarmaya çalışıyorlar. :)işlerine geldiği zaman kafaya kalpak takıp atatürkçülük oynuyorlar, ki bu işlerine gelme konusu genelde din düşmanlığı yapmak istediklerinde ortaya çıkıyor, ki çocuğun gündem olması da imam hatipli olması ile alakalı...işlerine gelmediği zaman 'askeri değil, generali olsanız ne yazar it sürüleri' diyenlerin eteğini öpüyorlar (birkaç milletvekili koltuğu kapmak için)...https://www.facebook.com/stargazete/videos/571514366680993/atatürk'ü böyle işinize geldiğinde canınızın istediği gibi kullanırsanız çoluk çocuktan böyle davranışlar görürsünüz; azıcık kalıbınızın adamı olun.ayrıca, rahat bırakın artık şu adamı, sömürmeyin, din düşmanlığı yapmak için maske olarak kullanmayın, tarih zaten onun da sizin de ne olduğunuzu biliyor, teknoloji çağında kimseyi ahmaklık duvarına sıkıştıramazsınız...Bu yaşananlardan dolayı ifade özgürlüğünün İsveç'de olduğu gibi olmasını istiyorum.İsteyen gitsin yarın Kuran-ı Kerim'i yaksın İncil'i yaksın Tevrat'ı yaksın isteyen de Atatürk'ün resmini yaksın bir şeyler yapsın.Ne dinlerin değeri 3-5 kendini bilmez onlara saldırdı diye azalır ne de ülkenin kurucu lideri ona saldırdı diye azalır.Yalnız bu arada çocuğun arkadaş ortamında yaptığı hareketten dolayı tepki gösterenler arasında çok sayıda MHPli isim de var MHP pkk'nın siyasi uzantısıyla hangi seçim ittifakına girdi?Girmedik diyemiyorsun, dürüst davrandığın için şukunu verdim. Ben alacağımı aldım, isteyenler 17 yaşındaki bir çocuğun anlamsız hareketi üzerinde tepinerek pkk'nın siyasi uzantısı ile yapılan ittifakın gazını almaya çalışabilir.bu arada, kuran tekmeleyen bir çocuk vardı ve o da linç edilmişti. bu arada, fark edenler olmamıştır diye bir daha yazayım her ikisini de çocuk olarak niteledim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CLS63",
      "created_time": "September 29, 2023, 06:23:41 PM",
      "body": "Quote from: trendcoin on September 29, 2023, 06:06:04 PMGirmedik diyemiyorsun, dürüst davrandığın için şukunu verdim. Ben alacağımı aldım, isteyenler 17 yaşındaki bir çocuğun anlamsız hareketi üzerinde tepinerek pkk'nın siyasi uzantısı ile yapılan ittifakın gazını almaya çalışabilir.bu arada, kuran tekmeleyen bir çocuk vardı ve o da linç edilmişti. bu arada, fark edenler olmamıştır diye bir daha yazayım her ikisini de çocuk olarak niteledim.Çocuk olsun olmasın bence bunlar suç olma kapsamından çıkarılmalı Atatürk'ün değeri mi azaldı şu hareketle ? Benim yukarıda kutsal kitapları örnek verme sebebim Atatürk ile dinleri yarıştırmak değil bence ifade özgürlüğü alanı oldukça geniş toplumun en büyük sinir hatları olan dinler bile bu işin içinde olmalı ancak o noktaya çok uzağız hatta o noktadan gün geçtikçe uzaklaşıyoruz.Bakın sosyal medyaya millet kendine küfür ettirerek para kazanmanın peşinde.  Ben girmedik tabii ki diyemem ben herhangi bir siyasi partinin üyesi ya da taraftarı değilim.Seçime kadar oturup ak partinin icraatlerinin hepsini savunmak ya da muhalefetin icraatlerinin hepsini savunmak gibi bir iş bana ters geliyor yanlışa yanlış demek gerekiyor.(örneğin hüdapar cumhura katılınca hüdapar çok iyiye dönüyor ilişki.Cumhurbaşkanlığı seçimlerinde muhalefete oy vermiştim ancak yerel seçimlerde oy verme hakkım olsaydı bunu yapmazdım yani pişmanım.Sanki parti sözcüsüymüşüm gibi benim mesajlarımın satır aralarını okumanız çok mantıklı olmaz gerçi chpnin parti sözcüsü bile artık girmedik diyemez ittifaklar ondan bile gizli yapılıyor.   (Tek adam denilen Tayyip Erdoğan'ın parti içinde son kararı veren olmasına sözünün üstüne söz söylenememesine rağmen istişare ettiği bir gerçek chp bu konuda daha beter durumda) ben bunları diyebiliyorum muhalif bir seçmen olarak ancak iktidarı savunanlar mülakatlarda yenilen kul haklarını bir kere gündeme getirmiyor.Quote from: emrecemsan on September 29, 2023, 05:56:54 PMDünyanın hiçbir yerinde milli değerleri aşağılayıp güle oynaya hayatınıza devam edemezsiniz.Farklı bir dünyada mı yaşıyoruz bilmiyorum ama dünyaca ünlü Amerikan yapımı Family Guy dizisinde Peter karakteri tuvalet kağıdı bitmiş neyse Amerikan Bayrağı var onu kullanırım diyor bu animasyonun yapımcıları güle oynaya hayatına devam ediyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "October 03, 2023, 06:59:10 PM",
      "body": "CLS63, sen kopenhagçısın ben değilim. senin arzu ettiğin hayat finlandiya'da ya da isveç'te olur bak. oradaki oğlanlar sokağa çıkarken yüzüme hangi güneş kremini sürsem diye düşünen adamlar. biz burada çevremizde binbir türlü bela ve pislik ile mücadele ediyoruz. bizim özgürlüğümüz ancak güvenliğimizi sağladığımız anda olur. bu nedenle kopenhagçılık bana göre bir şey değil ama sana ve senin gibi düşünen insanlara diğerlerine olduğu gibi saygı duyuyorum.bu forumda bile dhkpc sempatizanları var, türk ordusu kimyasal silah kullanmış olabilir, biz bunu bir araştıralım diyerek trollük yapan türksüz tabipler odası sempatizanları var, apo'ya ya da pol pot'a oy atarım diyen var, her türlüsü var ve bak bunlar yalnızca bu forumda dolaşanlar, dışarıda bunun misliyle dolusu var.türkiye gibi ülkeler özgürlüğünü ancak güvenliğini sağladığında kazanır. içimizde bu kadar çok 5. kol faaliyeti yapan tipler varken 5816 gibi kanunların asla kaldırılmaması ve diğer değerlerimiz için de benzerlerinin oluşturulması gerekir. benim dikkat çekmek istediğim konu olayın öznesinin bir çocuk olmasıydı. ben 17 yaşındayken ne yapıyordum inan bilmiyorum. muhtemelen salakça şeyler yapıyordum. çocuk da bir salaklık yapmış. ne yapak yani? yaşını büyütüp asalım mı? tek parti faşisti miyiz biz?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "October 03, 2023, 07:39:33 PM",
      "body": "17 yaşında bir çocuk çevresinde ne duyduysa onu söyler kendi fikirleri olduğunu zannetmiyorum, hele şimdiki nesil ağzına geleni söylüyor, öyle her duyduğunu, gördüğünü konuşmaması öğrenmesi gerekiyor gençlerin. Ülkemizin Cumhuriyetimizin kurucusu  Mustafa Kemal Atatürk'e hakaret edipte cezasız kalmamalı kimse. Ufakta olsa bir ceza verilsin ki ülkemizin önemli değerlerini kimse hiçe saymadan konuşamasın önleyici olması için bir cezayı haketmiş.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CLS63",
      "created_time": "October 03, 2023, 09:44:06 PM",
      "body": "Quote from: trendcoin on October 03, 2023, 06:59:10 PMCLS63, sen kopenhagçısın ben değilim. senin arzu ettiğin hayat finlandiya'da ya da isveç'te olur bak. oradaki oğlanlar sokağa çıkarken yüzüme hangi güneş kremini sürsem diye düşünen adamlar. biz burada çevremizde binbir türlü bela ve pislik ile mücadele ediyoruz. bizim özgürlüğümüz ancak güvenliğimizi sağladığımız anda olur. bu nedenle kopenhagçılık bana göre bir şey değil ama sana ve senin gibi düşünen insanlara diğerlerine olduğu gibi saygı duyuyorum.bu forumda bile dhkpc sempatizanları var, türk ordusu kimyasal silah kullanmış olabilir, biz bunu bir araştıralım diyerek trollük yapan türksüz tabipler odası sempatizanları var, apo'ya ya da pol pot'a oy atarım diyen var, her türlüsü var ve bak bunlar yalnızca bu forumda dolaşanlar, dışarıda bunun misliyle dolusu var.türkiye gibi ülkeler özgürlüğünü ancak güvenliğini sağladığında kazanır. içimizde bu kadar çok 5. kol faaliyeti yapan tipler varken 5816 gibi kanunların asla kaldırılmaması ve diğer değerlerimiz için de benzerlerinin oluşturulması gerekir. benim dikkat çekmek istediğim konu olayın öznesinin bir çocuk olmasıydı. ben 17 yaşındayken ne yapıyordum inan bilmiyorum. muhtemelen salakça şeyler yapıyordum. çocuk da bir salaklık yapmış. ne yapak yani? yaşını büyütüp asalım mı? tek parti faşisti miyiz biz? Konuyu çok fazla uzatmak istemiyorum bundan dolayı bu son mesajım ancak özgürlükçü politikalarla birlikte teröre karşı da mücade birlikte sağlanabilir diye düşünüyorum evet örnek verdiğim ülkeler bu konuda çok rahat ülkeler yarın bir ülke savaş ilan etse direkt olarak beyaz bayrak sağlarlar.Coğrafya kaderdir sözü de buradan geliyor ancak biz ülke olarak gerçekten çok büyük bir potansiyele sahibiz.Tek parti dönemi olarak nitelendirdiğiniz dönemde iki cumhurbaşkanı görev yapıyor.Mustafa Kemal Atatürk ve İsmet İnönü ikisinden de ben razıyım.Geçmişte Atatürk'ün bazı kararlarını sert buluyordum ancak chp'nin şuanki durumuna bakınca Atatürk kesinlikle yapılması gerekeni yapmış.17 yaşında çok genç hepimizin aklı o yaştayken bir karış havada ben bundan dolayı bu çocuğun televizyon televizyon gösterip ifşa etmenin doğru olmadığını zaten söyledim ancak bizim gibi ülkelerde linç sevilen bir şey bunu iktidar tarafı da yapıyor muhalefet tarafı da o yüzden iki tarafıda birbirinden ayırmak bana olaya objektif bakmaktan uzaklaşmak gibi geliyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "October 04, 2023, 09:45:46 AM",
      "body": "Quote from: CLS63 on October 03, 2023, 09:44:06 PM...Tek parti dönemi olarak nitelendirdiğiniz dönemde...mesajımın içinde herhangi bir şeyi tek parti dönemi olarak nitelendirmedim; tek parti faşistleri dedim. bu ikisinin aynı şey olmadığı açık. tek parti dönemi tarihte geri dönmek istemeyeceğimiz bir dönemken tek parti faşistleri bizi antidemokratik ortamlara çekmek isteyen partizanlara yapılmış bir atıf. beni biraz daha iyi anlayabilmen için; yaşı 17 iken 18 yapılıp asılan kimmiş bir bak bakayım; orada tek parti yoktu. haa oraya bakınca, \"bilmem ne partisi bilmem kaç yıldır iktidar olamıyor, neden her suçu bilmem ne partisine atıyorsunuz\" demenin ne kadar bomboş bir şey olduğunu da umarım anlarsın. bir taşla iki kuş vurduk senle; senle iyiyiz...Quote from: CLS63 on October 03, 2023, 09:44:06 PM...Geçmişte Atatürk'ün bazı kararlarını sert buluyordum ancak chp'nin şuanki durumuna bakınca Atatürk kesinlikle yapılması gerekeni yapmış....atatürk yapar da nasıl yapılması gereken olmaz!? bu nasıl bir düşünce!? vah vah ki ne vah! sen nasıl olur da hayatının bir dönemini böyle düşünerek geçirmişsin!? bu devlet sana bunca yıl bunu sorgula diye mi eğitim verdi? aksine bunu tam bir itaat hali ile kabul etmen için sana eğitim verilmedi mi? sakın bir daha böyle şeyler düşünme, olur da böyle şeyler düşünecek olursan üç kulhu bir elham oku, sonra üç kere üfleyip yüzüne sür.atatürk'e hakareti cahiller ve koyu tek parti faşistleri yapar. cahiller cahil oldukları için yapıyor çünkü tarihi verileri argüman olarak sunmak yerine tepki çekecek davranışlarda bulunuyorlar. tek parti faşistleri ise tarihi gerçeklerin gün yüzüne çıkmasını engellemek için atatürk'e hakaret ederek tepkileri farklı noktalara çekmeye çalışıyor.cahil tipe örnek bu 17 yaşındaki çocuktur.tek parti faşistine örnek motor_dizel'dir. geçmişte bu forumda bunu defalarca yaptı. şimdi 15 dakikamı ayırsam 15 farklı provakasyon içeren konusunu bulurum. yani, alnında 6 ok dövmesiyle gezerken atatürk'e hakaret edenler de olabiliyor, dikkatli olun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "October 07, 2023, 01:32:03 PM",
      "body": "Quote from: onurgozupek on September 23, 2023, 10:11:05 AMOlayın vehametini tartışmaya gerek yok. Yapılan şey, Türkiye'nin kurucusuna, atasına saygısızlıktır. Cezası verilmelidir.ANCAK, herkesin bu olayın bokunu çıkartmasına karşıyım. Çünkü, bir çocuğa 17 yaşına gelene atasına saygı duymayı öğretemeyen ailesi, öğretmenleri, akrabalarının yanı sıra o görüntüleri çeken ve en az o çocuk kadar suçlu arkadaşlarının ve yakın çevresinin de çocuğun kendisi kadar suçlu olduğu unutulmamalıdır.Bu güne kadar kimse \"bak evladım sen 7 yaşında okula başladın, 10 senedir haftanın 5 günü, yılın 9 ayı elinde tuttuğun fotoğrafa bakarak ders işledin, bu topraklarda özgür dolaşabiliyorsan, esaret altında değilsen bunu Atatürk'e borçlusun\" dememiş mi? Muhtemelen dememiş. Çünkü öyle olsaydı, çevresinde Atatürk'e değer veren bir kaç kişi olabilseydi, o çocuk o boku yemeye cesaret edemezdi. Son 20 yılda eğitim sistemi o kadar bozuldu ki, tüm kanı bozukların cahil cesareti katlanarak arttı. Öyle bir hale geldik ki o çocuk cezasını çekip salıverildikten sonra olduğundan daha iyi yerlere gelecek muhtemelen ve biz buna seyirci kalacağız..Yapılan son derece yanlıştır. Tüm suçu tek bir kişiye yıkmak ise saçmalıktır.Arkadaşına hakaret edersen bu senin sorumluluğundadır. Sonucuna katlanırsın. Ancak Ata'mıza terbiyesizlik yapabiliyorsan, bunun tek suçlusu sen olamazsın. O kadar basit değil...Altına imzamı atarım, gerçekten ben de aynı şeyleri düşünüyorum ama bu kadar iyi ifade edemezdim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "October 15, 2023, 04:56:47 PM",
      "body": "şu hesap ve onun provokatif paylaşımları alnında 6 ok dövmesi taşıyan motor_dizel'e aitti. şimdi aramızda bok püsür bilmem ne diye bir nick ile dolaşıyor ve kat mülkiyeti sahibi arkadaştan merit nevalesini hüpletiyor.https://bitcointalk.org/index.php?topic=5145059.msg51131133#msg511311335816'dan yargılanması gereken eski paylaşımları da vardı. üstelik bu süzme trolün babası da askerdi hatırladığım kadarıyla.yani, atatürk'e hakareti en çok bu tür 6 okçular yapar, dikkatli olun!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}