{
  "id": "topic_5400717",
  "title": "TerrableLuser",
  "author": "TerrableLuser",
  "created_time": "May 30, 2022, 10:40:38 AM",
  "content": "Hi, I created a MemeCoin for all those who suffered at the hands of Do Kwon.Following the collapse of Terra (LUNA) , I created a token for those who got kicked in the balls.Token sale from 12:00:00 UTC 6/10/22 - 6/15/22It is a BEP 20 token1 BNB = 1 Billion $LUSER tokensFixed supply = 20 Trillion $ LUSER tokensFeel free to ask me any questionsEnjoy: https://www.terrableluser.com/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400717",
  "comments": [
    {
      "author": "Techdev",
      "created_time": "May 30, 2022, 07:58:37 PM",
      "body": "I'm available to offer marketing services. Telegram:@SMMarketers",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "spiker777",
      "created_time": "June 08, 2022, 07:03:22 PM",
      "body": "Quote from: TerrableLuser on May 30, 2022, 10:40:38 AMHi, I created a MemeCoin for all those who suffered at the hands of Do Kwon.Following the collapse of Terra (LUNA) , I created a token for those who got kicked in the balls.Token sale from 12:00:00 UTC 6/10/22 - 6/15/22It is a BEP 20 token1 BNB = 1 Billion $LUSER tokensFixed supply = 20 Trillion $ LUSER tokensFeel free to ask me any questionsEnjoy: https://www.terrableluser.com/you created a memecoin and doing a tokensale of it. so what is the benefits of the victims of Terra. those investors who lost their life savings which were in $billions. how you plan to incentivize them?are you going to do some kind of airdrop for them? or they must spend more money to particiapte in your tokensale and wait for 1000x profit so they can cover their lose..or it is what it is? a memecoin created to make fun of Terra and all the people who lost?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "illetyus",
      "created_time": "June 10, 2022, 08:58:06 PM",
      "body": "Actually, the idea of ​​creating a community for luna losers is not bad.When people are stressed and upset, they tend to form a community.But I don't think the project will be successful. It really takes a strong team and strong marketing. (Individual effort is not enough.)I also think it's too late to create the project. Luna is about to be forgotten...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "June 11, 2022, 11:49:51 AM",
      "body": "Quote from: illetyus on June 10, 2022, 08:58:06 PMActually, the idea of ​​creating a community for luna losers is not bad.When people are stressed and upset, they tend to form a community.But I don't think the project will be successful. It really takes a strong team and strong marketing. (Individual effort is not enough.)I also think it's too late to create the project. Luna is about to be forgotten...I don't think there will be a big community to support this one mate because Imagine after being called as a scam project you are building a new community?and what is the promises for this one? what kind of assurance people may get from this? I'm not sure if there is something big coming but one thing is for sure here? that people in this community will not support such action and may consider this to be another attempt like what LUNA did.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "June 11, 2022, 08:20:13 PM",
      "body": "I do not think that creating a meme coin for people who lost their money because of investment is a good idea, which can be accepted in the event that it does not ask for money from users and is dedicated to helping them, even though that has become almost impossible.In short, there are several ways to promote your project, and if it is honest, this method is not the right one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}