{
  "id": "topic_5457007",
  "title": "pawel7777",
  "author": "pawel7777",
  "created_time": "June 20, 2023, 04:49:11 PM",
  "content": "Fresh press hit from only 3h ago. You would think that Bitcoin's growing dominance is a good thing, but author disagrees (spoiler: growing BTC dominance is a sign of lower trust in the crypto market): Bitcoin Rises as Its Dominance Across Cryptos Grows. Why It’s a Bad Sign.https://www.barrons.com/articles/bitcoin-ethereum-price-crypto-markets-today-a65ce26QuoteBitcoin and other cryptocurrencies were rising Tuesday with the dominance of the largest digital asset at historically high levels—something that may not bode well for sentiment across the crypto landscape.The price of Bitcoin has risen more than 1% over the past 24 hours to $26,750, at the upper end of a trading range between $26,000 and $27,000 that has held since a 10-month high above $30,000 was reached in April—a level that has proved difficult to reclaim. Cryptos have continued to stagnate in range-bound trading despite key catalysts on both the regulatory and economic front.“Short-term indicators point higher, although intermediate-term indicators point lower, so we stay short-term neutral for now,” said Katie Stockton, managing partner at technical research firm Fairlead Strategies. “A breakout, while unlikely near-term, would target second resistance … near $32,000.(...)”",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457007",
  "comments": [
    {
      "author": "DooMAD",
      "created_time": "June 21, 2023, 12:44:53 PM",
      "body": "I think whatever is happening at any given moment, someone is going to claim it's a bad sign.  Controversy sells.  Whatever it takes to get someone to read whatever nonsense they're writing.The whole idea is that it doesn't rely on trust, so I'd argue that fewer people trusting centralised shitcoins is a good thing, heh.  As a general rule, if it requires trust, you're doing it wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "June 21, 2023, 03:50:52 PM",
      "body": "Quote from: DooMAD on June 21, 2023, 12:44:53 PMI think whatever is happening at any given moment, someone is going to claim it's a bad sign.  Controversy sells.  Whatever it takes to get someone to read whatever nonsense they're writing.Well, in the world of trading, good news for one trader can be bad for another (zero sum game), depends on what positions do they hold.In case of the article in question, it doesn't really explain why increasing BTC dominance is bad for Bitcoin, they're making a case for altcoins if anything, or for the crypto market viewed as a whole.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "June 22, 2023, 02:09:34 PM",
      "body": "I think a logical explanation will be that people are removing their coins from centralized exchanges, because they see what is happening with the SEC and Binance in the USA. This might be happening all over the world at all the exchanges.... so the result of that is.... lower supply and less transactions on exchanges. The price of Bitcoin are determined by the market (Supply & demand) on these Exchanges... so you can see the impact that can have on the price.    (This is just my own theory.... not actual facts)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cr1776",
      "created_time": "June 26, 2023, 02:44:26 PM",
      "body": "Quote from: Kakmakr on June 22, 2023, 02:09:34 PMI think a logical explanation will be that people are removing their coins from centralized exchanges, because they see what is happening with the SEC and Binance in the USA. This might be happening all over the world at all the exchanges.... so the result of that is.... lower supply and less transactions on exchanges. The price of Bitcoin are determined by the market (Supply & demand) on these Exchanges... so you can see the impact that can have on the price.    (This is just my own theory.... not actual facts) I think the smart one are doing so.  My sister-in-law asked me about it a few weeks ago and told her she shouldn't (still) keep coins on exchanges.  I'd only been harping on it for 7-8 years.  But she actually is doing something this time.And I agree, someone will CLAIM it is a bad thing, but BTC dominance is a good thing.  All the alts are too centralized, and many are just junk.  ETH included in the centralized portion - when you have one person or a small group who can roll back transactions and fork, long term that is a huge risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "June 26, 2023, 02:59:47 PM",
      "body": "QuoteBitcoin Rises as Its Dominance Across Cryptos Grows. Why It’s a Bad Sign.Why? Are investors losing confidence in shitcoins?Do users realize that you don't need a blockchain to run an app like Uber?Every single economically illiterate wanna-be rich guy over Twitter understanding that a meme coin is just a meme coin and that 99% of the world doesn't even get that meme at all?Quote“The Bitcoin dominance grows when investors do not feel confident about the short-term market trend and adjust their position towards a less speculative portfolio, increasing their exposure to Bitcoin, which is commonly known to be the less volatile digital asset,” said Matteo Greco, an analyst at digital asset group Fineqia International.Oh no, the horror!I remember when traders were saying that capping the gas prices at 200E/MWh is a bad idea and it will destroy trading as nobody is selling and buying, we're at 30! Same for oil, putting a cap will reduce volatility and it will affect the markets, oh no the horror of the outcome!The entire economy is doomed if short-term speculators will quit the scene! Please come back when I ask you to!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kryptowerk",
      "created_time": "June 27, 2023, 11:45:58 PM",
      "body": "Quote from: pawel7777 on June 20, 2023, 04:49:11 PMFresh press hit from only 3h ago. You would think that Bitcoin's growing dominance is a good thing, but author disagrees (spoiler: growing BTC dominance is a sign of lower trust in the crypto market): Bitcoin Rises as Its Dominance Across Cryptos Grows. Why It’s a Bad Sign.https://www.barrons.com/articles/bitcoin-ethereum-price-crypto-markets-today-a65ce26QuoteBitcoin and other cryptocurrencies were rising Tuesday with the dominance of the largest digital asset at historically high levels—something that may not bode well for sentiment across the crypto landscape.The price of Bitcoin has risen more than 1% over the past 24 hours to $26,750, at the upper end of a trading range between $26,000 and $27,000 that has held since a 10-month high above $30,000 was reached in April—a level that has proved difficult to reclaim. Cryptos have continued to stagnate in range-bound trading despite key catalysts on both the regulatory and economic front.“Short-term indicators point higher, although intermediate-term indicators point lower, so we stay short-term neutral for now,” said Katie Stockton, managing partner at technical research firm Fairlead Strategies. “A breakout, while unlikely near-term, would target second resistance … near $32,000.(...)”It is interesting to note, though, most altcoins are still WAAAY down compared to their ATHs, like 50 - 90% down. Bitcoin is doing great in comparison to its ATH.What some short-sighted short-term traders think of it doesn't matter much.Another thing to remember, Bitcoin's price does NOT always reflect the current state of adoption or regulation. So his conclusion is kind of wrong. There are just too many factors playing into Bitcoins short-term price-range.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}