{
  "id": "topic_5463691",
  "title": "Nalain420",
  "author": "Nalain420",
  "created_time": "August 18, 2023, 11:52:51 AM",
  "content": "https://cointelegraph.com/news/spacex-sold-bitcoin-acquired-2021-2022-reportالسلام عليكم لجميع مجتمع اللغة العربية!في عام 2021، كشف إيلون ماسك عن حيازات SpaceX من البيتكوين بناءً على تقديم تقرير للجنة الأوراق المالية والبورصات (SEC) يشير إلى خطة تسلا لشراء 1.5 مليار دولار من البيتكوين. ومع ذلك، تشير التقارير الحديثة إلى أن SpaceX قلصت قيمة حيازاتها من البيتكوين بمقدار 373 مليون دولار خلال عامي 2021 و 2022، مع مؤشرات على أنها قد قامت ببيع عملتها المشفرة. ولا يُعرف بالضبط مقدار العملة المباعة. تكشف وثائق SpaceX المالية حوالي 5.2 مليار دولار في مصاريف عام 2022 و 5.4 مليار دولار لاقتناء العقارات والمعدات والبحث في عامي 2021-2022. إعلان ماسك لحيازات SpaceX من البيتكوين في عام 2021 تزامن مع خطط تسلا، مما ساهم في ارتفاع سعر البيتكوين إلى أكثر من 43,000 دولار. تقرير تسلا للربع الثاني من عام 2023 أشار إلى أنهم احتفظوا بمبلغ 184 مليون دولار من حيازاتهم من البيتكوين بعد بيع معظمها في عام 2022.Quoteهل هذا مؤكد أم لا؟",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463691",
  "comments": [
    {
      "author": "yhiaali3",
      "created_time": "August 18, 2023, 08:44:17 PM",
      "body": "طبعا الأخبار منتشرة على كل وسائل التواصل الاجتماعي لكنها غير مؤكدة ولم يصدر أي تصريح من إيلون ماسك أو شركة SpaceX حول الموضوع. منطقيا هذا مستبعد لكون إيلون ماسك اشترى البيتكوين في عام 2021 تقريبا وكانت معدلا الأسعار في ذلك الوقت أعلى من السعر الحالي وبما أنه رجل أعمال لايحب الخسارة من غير المتوقع أن يبيع بهذه الأسعار. لا أحد يعرف الحقيقة لكن لا أستبعد أن يكون ماسك يتلاعب بالسوق كعادته عن طريق نشر هذه الاخبار.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nalain420",
      "created_time": "August 18, 2023, 09:48:56 PM",
      "body": "Quote from: yhiaali3 on August 18, 2023, 08:44:17 PMطبعا الأخبار منتشرة على كل وسائل التواصل الاجتماعي لكنها غير مؤكدة ولم يصدر أي تصريح من إيلون ماسك أو شركة SpaceX حول الموضوع. منطقيا هذا مستبعد لكون إيلون ماسك اشترى البيتكوين في عام 2021 تقريبا وكانت معدلا الأسعار في ذلك الوقت أعلى من السعر الحالي وبما أنه رجل أعمال لايحب الخسارة من غير المتوقع أن يبيع بهذه الأسعار. لا أحد يعرف الحقيقة لكن لا أستبعد أن يكون ماسك يتلاعب بالسوق كعادته عن طريق نشر هذه الاخبار. نعم، أنت على حق، أخي. هذا الخبر لم يتم تأكيده. يبدو أنها شائعة تفيد بأن إيلون ماسك قد بيع بيتكوينه. في رأيي، يقوم الناس بنشر هذا الخبر الزائف فقط لخلق سيناريو يمكن أن يؤدي إلى إلقاء بيتكوين. إذا كان هذا صحيحًا، في حالة ما، سيقوم شخص ما بمشاركة دلائل على الصفقة لتأكيد أن إيلون ماسك حقًا قد باع بيتكوين.بعض الأشخاص يقترحون حتى أن الهبوط الأخير في قيمة بيتكوين يعود إلى هذا الخبر.https://www.reuters.com/world/china/china-evergrande-files-protection-us-court-part-32-bln-debt-overhaul-2023-08-18/#:~:text=HONG%20KONG%2FNEW%20YORK%2C%20Aug,impact%20on%20the%20weakening%20economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "August 18, 2023, 10:15:49 PM",
      "body": "أتفق مع الأخ يحي فيما ذكره، فشركة سبيس إكس خفضت قيمة ما تحمله من البتكوين منذ العاميين الماضيين وباعت قبل هذا الهبوط، أيضا إفلاس إحدى الشركات واسمها إتشينا إيفرجراند ربما لا يكون هو السبب المنطقي في حدوث هذا الهبوط الضخم للبتكوين وللعملات الأخرى، ما حدث هي عمليات بيع ضخمة وتصفيات طويلة في بورصات عديدة مثل بينانس وكوين بيس وكراكين وكوكوين أهمهم منصة اوكيكس والتي تمثل أربعين فالمائة من السوق، وأيضا ارتفاع سعر الفائدة في الولايات المتحدة الأمريكية احد الاسباب، وحقا مهما كانت الأسباب فالأهم هو تأثيره، والجدير بالذكر أن احد المحللون المخضرمون من خلال الشارت ذكر ان البتكوين قد يتفوق فى الاداء على الاثيروم والعملات البديلة الاخرى ويواصل حتى الوصول لأعلى مستوى له، الخبر الأهم للسوق الآن هو حكم محكمة الاستئناف الفيدرايلية ضد شركة Grayscale ولجنة الاوراق المالية التى ستحدد ما إذا كانت SEC مخطئة فى رفض صندوق تداول العملات الرقمية ETF المقترح من قبل الشركة الامريكية ام لا، هذا الحكم اما ان يساعد على ارتفاع السوق ام استمرار هبوطه.المصادر:[1] https://www.coindesk.com/markets/2023/08/18/no-spacex-isnt-the-cause-of-this-multi-billion-dollar-bitcoin-bloodbath/[2] https://twitter.com/CredibleCrypto/status/1692464362081206533",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "August 19, 2023, 03:37:14 PM",
      "body": "Quote from: albon on August 18, 2023, 10:15:49 PMأتفق مع الأخ يحي فيما ذكره، فشركة سبيس إكس خفضت قيمة ما تحمله من البتكوين منذ العاميين الماضيين وباعت قبل هذا الهبوط، أيضا إفلاس إحدى الشركات واسمها إتشينا إيفرجراند ربما لا يكون هو السبب المنطقي في حدوث هذا الهبوط الضخم للبتكوين وللعملات الأخرى، ما حدث هي عمليات بيع ضخمة وتصفيات طويلة في بورصات عديدة مثل بينانس وكوين بيس وكراكين وكوكوين أهمهم منصة اوكيكس والتي تمثل أربعين فالمائة من السوق، شكرا على هذا الشرح الوافي. لفتت انتباهي نقطة مهمة بشأن موجة المبيعات المرتفعة على بورصات التداول و التي اتساءل بشأن اذا ما كانت تلك المنصات هي من خفضت احتياطاتها من البيتكوين او ان تلك المبيعات يقوم بها المستخدمون؟ و على افتراض ان المستخدمين هم من يقومون بذلك، هل هناك فرضية ان تكون سبايس ايكس هي من قامت بتلك المبيعات على اعتبار انها تستخدم اكثر من بورصة للقيام بذلك؟ كما ذكرت فان سبايس ايكس بدأت في خفض مدخراتها من البيتكوين منذ سنتين و ما استبعده في هذا الشأن هو أن تعمد سبايس ايكس الى بيع ذلك الحجم من البيتكوين دفعة واحدة و تتسبب في خفض الاسعار بهذا الشكل. لا ارى فائدة من قيامها بهذا الا ان كانت تريد من الحيتان ان يشتروا اكثر بيتكوين في القاع. على نفس المستوى، أعرف أن مجرد نشر اعلان بيع سبايس ايكس لذلك الحجم من البيتكوين قادر على التسبب في حالة فزع في السوق تؤدي الى موجة بيع شاملة. و لكن ما نراه في هذا الرسم البياني هو تركز الجزء الاكبر من المبيعات بنسبة تقارب الاربعين بالمائة في منصة واحدة مع غياب شبه تام لمنصات اخرى مهمة مثل كوينبيز و بيتفينيكس.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "August 19, 2023, 11:34:34 PM",
      "body": "كل الاسواق تأترث بالهبوط الايام الماضية، لذلك لا ارجح ان يكون السبب له علاقة ببيع سبيس اكس لحصصها من البتكوين.اعتقد ان خبر افلاش عملاق المقاولات الصيني Evergrande هوا السبب الرئيسي، لانه قد يكون بداية تحرك كرة الجليد نحو الهاوية لان سوق العقار في الصين مهدد بالهبوط العنيف.بالمجمل تاثير الاخبار مؤقت، ومايهم هوا الاتجاه العام للاقتصاد والذي لايبدو جيد حتى الان، الحرب في اوروبا هي اساس المشكلة ولن نبدا في التعافي الاقتصادي حتى تقترب الحرب من نهايتها.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Trawda",
      "created_time": "August 20, 2023, 03:35:35 AM",
      "body": "Quote from: mikeywith on August 19, 2023, 11:34:34 PMكل الاسواق تأترث بالهبوط الايام الماضية، لذلك لا ارجح ان يكون السبب له علاقة ببيع سبيس اكس لحصصها من البتكوين.اعتقد ان خبر افلاش عملاق المقاولات الصيني Evergrande هوا السبب الرئيسي، لانه قد يكون بداية تحرك كرة الجليد نحو الهاوية لان سوق العقار في الصين مهدد بالهبوط العنيف.بالمجمل تاثير الاخبار مؤقت، ومايهم هوا الاتجاه العام للاقتصاد والذي لايبدو جيد حتى الان، الحرب في اوروبا هي اساس المشكلة ولن نبدا في التعافي الاقتصادي حتى تقترب الحرب من نهايتها.لم أفهم صراحة ما علاقة انهيار شركة المقاولات الصينية العملاقة Evergrande بانخفاض سعر الببيتكوين المفاجئ؟ أفهم طبعا أن انهيار هكذا شركة عملاقة له تأثير كبير على الاقتصاد الصيني والعالمي بشكل عام ومن الطبيعي أن تهبط أسعار الأسهم والبورصات أما أن يؤدي إلى هذا الهبوط المفاجئ للبيتكوين فلم أتبين العلاقة بالضبط. يعني من الطبيعي أن يتأثر البيتكوين بالاقتصاد العالمي لكن ليس لهذه الدرجة الكبيرة وخاصة أن هذه الشركة الصينية ليس لها علاقة بالبيتكوين أو العملات المشفرة، أيضا أتذكر أنه وقت انتشار كورونا وتأزم الاقتصاد العالمي ارتفع سعر البيتكوين نتيجة توجه الناس لشراء البيتكوين بدل الأسهم والسندات لأنه ملاذ آمن.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "August 20, 2023, 11:55:25 PM",
      "body": "الغريب في الأمر أن كميات كبيرة من البيتكوين تم بيعها في فترة وجيزة لا تتجاوز الساعة تقريبا. هذا ما يجعلني اعتقد انها حركة منظمة و متفق عليها مسبقا او ان من قام بالبيع هو شخص أو شركة واحدة.التساؤل الاخر هو عن سبب القيام بعملية البيع هذه اذ لا يوجد أي اخبار سلبية قوية لدرجة تدعو للذعر و القيام ببيع كل هذه الكمية من البيتكوين.على العموم، يبدو أن اغلب المحللين يرجحون تواصل نزول الأسعار في الفترة القادمة. هل هناك من يتفق مع مثل هذه التحاليل؟",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "August 21, 2023, 02:07:46 AM",
      "body": "Quote from: khaled0111 on August 20, 2023, 11:55:25 PMالغريب في الأمر أن كميات كبيرة من البيتكوين تم بيعها في فترة وجيزة لا تتجاوز الساعة تقريبا. هذا ما يجعلني اعتقد انها حركة منظمة و متفق عليها مسبقا او ان من قام بالبيع هو شخص أو شركة واحدة.التساؤل الاخر هو عن سبب القيام بعملية البيع هذه اذ لا يوجد أي اخبار سلبية قوية لدرجة تدعو للذعر و القيام ببيع كل هذه الكمية من البيتكوين.على العموم، يبدو أن اغلب المحللين يرجحون تواصل نزول الأسعار في الفترة القادمة. هل هناك من يتفق مع مثل هذه التحاليل؟ حدث هذا الامر في العديد من المرات وليس الى مستوى البيتكوين فقط بل كل العملات واضن انه خطوة لخفض سعر البيتكوين بعدما كان يتداول لفترة طويلة على مستويات ال 30 الف دولار. لا اضن ان نية الباعة هو التخلي بشكل كامل على البيتكوين لانه الان في وقتنا هذا معظم المستخدمين والمستثمرين في البيتكوين يعرفون السوق جيدا وخفض السعر بالنسبة لي هي مجرد فرصة لهم للشراء من مستويات منخفضة ايضا قبل حدوث صعود جديد. وكما قلت لا توجد هنالك اية اخبار سلبية قد تؤثر على السوق وتخلق ذعر.الاسباب التي ذكرها صاحب الموضوع من المقال لا تبدوا لي سببا مقنعا لما حدث والشركات التي تمتلك كميات من البيتكوين ليست بالغبية لكي تتخلى عنها في هذا التوقيت بالذات علما انه كانت اخبار سلبية من قبل وكانت هناك امكانية لانهيار السعر سابقا بعد ترقب ما سيحدث لبايننس ومالكها لكن لم يحث ولم يتأثر السوق كثيرا وهذا يرجع لثقافة مستخدمي البيتكوين وتعلمهم من الدروس السابقة.شخصيا وفي هذه الحالة لا يوجد لدي اي تخوف على السعر او سبب لبيع البيتكوين حاليا بل بالعكس اي يمكن الاستفادة من هذه الفرصة واستثمار القليل بهذا السعر. ما رأي الاعضاء الاخرين في هذا الامر؟",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "August 21, 2023, 04:15:49 AM",
      "body": "Quote from: GxSTxV on August 21, 2023, 02:07:46 AMشخصيا وفي هذه الحالة لا يوجد لدي اي تخوف على السعر او سبب لبيع البيتكوين حاليا بل بالعكس اي يمكن الاستفادة من هذه الفرصة واستثمار القليل بهذا السعر. ما رأي الاعضاء الاخرين في هذا الامر؟بالتأكيد هي فرصة للجميع لشراء البيتكوين بأسعار منخفضة و قد تكون هذا هي المنفعة الوحيدة مما يحصل. انما نحن فقط نحاول فهم ما يحصل خصوصا انه ليس هناك اشارات قوية لتساهم في هذا النزول مع غرابة ما يحصل من حركة بيع سريعة لكمية هائلة من البيتكوين و التي على ما يبدو ليست مسؤولية سبايس ايكس هذه المرة.ليس هنالك مخاوف على عودة السعر الى الارتفاع و هو منذ يومين مستقر عند حدود ال25 الف الى ال26 ألف و انما عن الى متى سيدوم هذا الاستقرار و هل سيكون هناك نزول اكثر ام لا. يبين هذا الضبابية في المشهد العام للسوق و ان الناس لازالوا غير مدركين لما يحصل و بالتالي لم تتواصل موجة الفزع فيبيع الناس اكثر فينزل السعر اكثر، و بنفس الوقت لم يستعيدوا ثقتهم كاملة في السوق ليشتروا المزيد.انها فرصة للذين يريدون دخول سوق الاستثمار لأنه من المتوقع ان السعر هذه المرة اذا عاد الى الارتفاع فانه لن ينزل مرة اخرى ما دون ال30 الف.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "August 21, 2023, 09:00:11 AM",
      "body": "أنا شخصيا لا أستبعد أن يهبط أكثر من ذلك خلال الفترة القادمة، وأتفق مع الجميع أنه لايوجد أي داعي للخوف بل هذه فرصة جديدة للشراء. لكن ما يقلقني ليس السعر أو هبوط السعر، بل ما يقلقني أكثر هو هذا التقلب المفاجئ وبدون سبب واضح، أستغرب كيف لعملة قوية مثل البيتكوين بعد أن حصلت على كل هذه الثقة والقبول على مستوى العالم أن تتأثر ببعض المتغيرات الغير واضحة بهذا الشكل العاصف. أنا من الناس الذين كانوا سعداء باستقرار سعر البيتكوين خلال الفترة الماضية (حيث كان هناك استقرار نسبي مع تغيرات طفيفة لفترة طويلة قبل هذا الهبوط المفاجئ) هذا الاستقرار كان يشكل عامل قوي جدا لتوسع التبني حول العالم وخاصة من قبل المؤسسات الكبيرة أو حتى الحكومات، أما التقلب الكبير فهو يجعل البيتكوين صالح للمضاربة والاستثمار فقط.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "August 29, 2023, 05:39:02 PM",
      "body": "Quote from: albon on August 18, 2023, 10:15:49 PM=الخبر الأهم للسوق الآن هو حكم محكمة الاستئناف الفيدرايلية ضد شركة Grayscale ولجنة الاوراق المالية التى ستحدد ما إذا كانت SEC مخطئة فى رفض صندوق تداول العملات الرقمية ETF المقترح من قبل الشركة الامريكية ام لا، هذا الحكم اما ان يساعد على ارتفاع السوق ام استمرار هبوطه.تحديث:كما كان متوقعاً إخوتي الكرام، صعد البتكوين وأسعار العملات الأخرى بقوة وقفز البتكوين إلى 28 ألفاً بزيايدة مؤيـة كبيرة بعد إعلان فوز كبير اللإستثمار Grayscale على هيئة الأوراق المالية أمام المحكمة، حيث وافقت محكمة الاستئناف على صندوق تداول التكوين الفوري Spot ETF والتماس جراي سكيل للمراجعة للرفض الذي أقرته SEC لصندوق تداول البتكوين.[1] https://cointelegraph.com/news/grayscale-wins-sec-lawsuit",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "August 29, 2023, 06:00:59 PM",
      "body": "Quote from: albon on August 29, 2023, 05:39:02 PMQuote from: albon on August 18, 2023, 10:15:49 PM=الخبر الأهم للسوق الآن هو حكم محكمة الاستئناف الفيدرايلية ضد شركة Grayscale ولجنة الاوراق المالية التى ستحدد ما إذا كانت SEC مخطئة فى رفض صندوق تداول العملات الرقمية ETF المقترح من قبل الشركة الامريكية ام لا، هذا الحكم اما ان يساعد على ارتفاع السوق ام استمرار هبوطه.تحديث:كما كان متوقعاً إخوتي الكرام، صعد البتكوين وأسعار العملات الأخرى بقوة وقفز البتكوين إلى 28 ألفاً بزيايدة مؤيـة كبيرة بعد إعلان فوز كبير اللإستثمار Grayscale على هيئة الأوراق المالية أمام المحكمة، حيث وافقت محكمة الاستئناف على صندوق تداول التكوين الفوري Spot ETF والتماس جراي سكيل للمراجعة للرفض الذي أقرته SEC لصندوق تداول البتكوين.[1] https://cointelegraph.com/news/grayscale-wins-sec-lawsuitهذا الخبر هو حديث السوق اليوم و الجميع لم يكن يتوقع فشل الدعوى التي رفعتها Grayscale ضد هيئة الأوراق المالية الأمريكية SEC. و بذلك تحولها الى منصة تبادل الادخار التداولي ETF Exchange Traded Funds و هو ما يعطي دفعة كبيرة لسوق البيتكوين الذي ظل طيلة الفترة السابقة يتعرض لضغوطات كبيرة من هيئات الرقابة الأمريكية ما اضطر العديد من الشركات الى اعلان الافلاس او ايقاف النشاط.السعر الان يسير الى كسر حاجز ال30 الف دولار في فترة وجيزة جدا اذا استمرت حركة الصعود بهذه الوتيرة. هذه كانت فرصة جيدة للراغبين في الاستثمار استمرت لفترة يمكن اعتبارها بالمطولة قليلا وصل فيها السعر الى مستويات قياسية.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "August 30, 2023, 02:37:50 AM",
      "body": "نعم بالفعل أخبار كبيرة وترند على كل مواقع التواصل. فوز شركة Grayscale ضد لجنة الأوراق المالية والبورصات الأمريكية SEC هو فوز هام ومعنوي كبير ليس فقط لأنه أول صندوق بيتكوين فوري في الولايات المتحدة ولكن بسبب الانتصار الثاني على SEC بعد قضية ريبل، بدا الآن واضحا أن كل القرارات التي تتخذها SEC تعسفية وغير مبنية على أسس قانونية سليمة. مثلا في قضية رفض GBTC الذي قدمته شركة Grayscale بررت SEC رفضها بأنه بسبب المخاطر العالية بينما كانت وافقت على صندوقي تداول للبيتكوين للعقود الآجلة لشركتي Valkyrie و Teucrium، والجميع يعرف أن تداول العقود الآجلة أخطر بكثير من التداول الفوري.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "August 30, 2023, 09:59:31 PM",
      "body": "على قدر ما تسعدني مثل هذه الأخبار الإيجابية، مثل كل مستخدمي البيتكوين، على قدر انشغالي بمدى تأثيرها على سعر البيتكوين و باقي العملات الرقمية.ما يشغلني هو الى متى سيضل سعر البيتكوين مرتبط بمثل هذه الأخبار خاصة اننا نتحدث على تأثير كبير في السوق بشكل مستمر. إلى متى سيتواصل اعتبار البيتكوين كسوق و فرصة للاستثمار و الربح السريع؟باعتقادي اغلب من يمتلكون البيتكوين هم متداولون و مضاربون و القليل منهم يعتبره وسيلة دفع.ربما هو قلق مبالغ فيه، لكن برأيي اذا تواصل الحال كما هو فلا اعتقد ان البيتكوين سيصبح في يوم من الايام عملة منافسة فعليا للعملات التقليدية.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "August 31, 2023, 02:38:36 AM",
      "body": "Quote from: khaled0111 on August 30, 2023, 09:59:31 PMعلى قدر ما تسعدني مثل هذه الأخبار الإيجابية، مثل كل مستخدمي البيتكوين، على قدر انشغالي بمدى تأثيرها على سعر البيتكوين و باقي العملات الرقمية.ما يشغلني هو الى متى سيضل سعر البيتكوين مرتبط بمثل هذه الأخبار خاصة اننا نتحدث على تأثير كبير في السوق بشكل مستمر. إلى متى سيتواصل اعتبار البيتكوين كسوق و فرصة للاستثمار و الربح السريع؟باعتقادي اغلب من يمتلكون البيتكوين هم متداولون و مضاربون و القليل منهم يعتبره وسيلة دفع.ربما هو قلق مبالغ فيه، لكن برأيي اذا تواصل الحال كما هو فلا اعتقد ان البيتكوين سيصبح في يوم من الايام عملة منافسة فعليا للعملات التقليدية. أنا مثلك أخي خالد، هل تصدق أنني انزعجت عندما رأيت سعر البيتكوين صعد من 26 إلى 28 ألف دولار خلال ساعات أو ربما لحظات بسبب خبر فوز شركة غراي سكيل على SEC!!! طبعا في البداية كنت مسرور بسبب الأخبار الإيجابية والارتفاع الفوري لكن حين فكرت قليلا انزعجت وقلت في نفسي هل يعقل أن يتأثر البيتكوين بشكل فوري سواء بشكل إيجابي أو سلبي لمجرد خبر واحد؟؟!! يعني إلى متى سيبقى البيتكوين مرتبط بالأخبار خبر يرفعه وأخر ينزله. قلقلك ليس مبالغ فيه أخي خالد بل هو في محله تماما، إذا بقي البيتكوين على هذا الشكل فمن المستحيل أن يتحول إلى عملة عالمية مقبولة لدى الجميع، والسبب واضح كما تفضلت أخي أ الغالبية لايزالون ينظرون إلى البيتكوين كفرصة للاستثمار والربح السريع، لكن أنا وانت وغيرنا من المستخدمين العاديين لا نملك أن نفعل شيء الأمر كله بيد الشركات الكبيرة والحيتان.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "October 01, 2023, 01:06:57 PM",
      "body": "Quote from: yhiaali3 on August 31, 2023, 02:38:36 AMقلقلك ليس مبالغ فيه أخي خالد بل هو في محله تماما، إذا بقي البيتكوين على هذا الشكل فمن المستحيل أن يتحول إلى عملة عالمية مقبولة لدى الجميع، والسبب واضح كما تفضلت أخي أ الغالبية لايزالون ينظرون إلى البيتكوين كفرصة للاستثمار والربح السريع، لكن أنا وانت وغيرنا من المستخدمين العاديين لا نملك أن نفعل شيء الأمر كله بيد الشركات الكبيرة والحيتان.  للأسف فان اكثر استخدامات البيتكوين هي للتداول و الاستثمار و لازلنا لم نصل بعد الى الاستفادة منه وظيفيا و هذا تسبب فيه بشكل رئيسي عدم تبني الدول له كعملة معترف بها في التبادلات و المعاملات اليومية. القليل من الاستثمارات بدأت في قبول مدفوعات البيتكوين و فيهم من بدأ في هذا مبكرا جدا و لكنه يبقى دوما لا يمثل نسبة كبيرة من اجمالي الاستخدامات. نفس الفكرة تنسحب على ما نسميه \"حيتان السوق\" و الذين لا يستطيعون دفع الحكومات و المؤسسات المالية الى التبني بشكل كامل.ما زاد الأمر سوءا هو اطلاق ما يسمى \"العملات المستقرة\" و التي عوضت بالمطلق نقود فيات على البلوكشين. اكثر من 99 بالمائة من العملات المستقرة في السوق مرتبط بالدولار و نلاحظ جليا كيف ان تلك العملات اخذت مكان البيتكوين و الكريبتو و ساهمت اكثر في تعطيل التبني التام.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hg_away",
      "created_time": "October 01, 2023, 04:44:32 PM",
      "body": "Quote from: Kavelj22 on October 01, 2023, 01:06:57 PMما زاد الأمر سوءا هو اطلاق ما يسمى \"العملات المستقرة\" و التي عوضت بالمطلق نقود فيات على البلوكشين. اكثر من 99 بالمائة من العملات المستقرة في السوق مرتبط بالدولار و نلاحظ جليا كيف ان تلك العملات اخذت مكان البيتكوين و الكريبتو و ساهمت اكثر في تعطيل التبني التام.اعرف احد الاصدقاء الذي اشتري مبلغ ضخم من USDT ليستفيد من ال staking ولكن تكمن المشكلة في انك بحاجة للثقة في طرف ثالث سوا كان ذلك الطرف الثالث منصة او كانت العملة في ذاتها حيث ان هناك احتمالية ان ينخفض سعر السعر لتلك العملات مقابل الدولار.عموما تبني البيتكوين في ازدياد وبمجرد ان يصل لعدة ترليونات ستقتنع الشركات ان هذه العملة ستبقي وانها بعيدة عن كل التهويل الذي كان مصاحب لها لذلك فستندفع تلك الشركات لاستخدام البيتكوين وصحيح ان هذا سياخذ بعض الوقت ولكننا لا نزال في خطواتنا الاولى.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "October 01, 2023, 05:33:14 PM",
      "body": "Quote from: hg_away on October 01, 2023, 04:44:32 PMعموما تبني البيتكوين في ازدياد وبمجرد ان يصل لعدة ترليونات ستقتنع الشركات ان هذه العملة ستبقي وانها بعيدة عن كل التهويل الذي كان مصاحب لها لذلك فستندفع تلك الشركات لاستخدام البيتكوين وصحيح ان هذا سياخذ بعض الوقت ولكننا لا نزال في خطواتنا الاولى.من المهم للغاية ادراك انه بالرغم من تأخر التبني الواسع للأسباب التي شرحناها فان درجة التبني التي وصل اليها البيتكوين حاليا تعتبر مهمة جدا و مرتفعة للغاية مقارنة بالوقت الذي اخذه هذا. ان البيتكوين بلا عمر حرفيا لأن 10 سنوات او 12 سنة لا يمكن ان تجعل من اي عملة مستخدمة على نطاق عالمي كما هو البيتكوين اليوم. تقريبا لم تحضى اي عملة أخرى في التاريخ بهكذا نجاح في وقت وجيز كما حضي به البيتكوين. هذا يمكن اعتباره انجازا خارقا.الرحلة لاتزال طويلة و بالتأكيد سيأتي اليوم الذي ينتشر فيه استخدام البيتكوين بما انه لم يعد بالامكان تجاوزه او التغافل عنه.العديد من الشركات متأخرة عن التبني نظرا لارتباطها الحيوي مع نظام المالي العالمي الذي يحارب في شق كبير منه انتشار ثقافة البيتكوين التي ستقضي على كل نفوذه. ليس من السهل ابدا التخلص من نظام عالمي يعمل ضمنه الجميع و تعويضه بنظام تستعمله قلة قليلة. أعتقد ان هذا احد اهم الأسباب التي تشجع متحمسين مثل الون ماسك و غيره الى التخلي عن البيتكوين لفائدة أصول أخرى لأنه لا يستطيع استخدامه في السوق بشكل عملي.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}