{
  "id": "topic_5411037",
  "title": "examplens",
  "author": "examplens",
  "created_time": "August 24, 2022, 09:59:26 AM",
  "content": "As I get a lot of notifications related to the discussion about the https://preev.net site. I would say that the whole thing (starting with preev.com) is very important for the bitcoin community. so let me go.yes, I bought the preev.net domain, which was available at this time, and it seems to me that the easiest transition will be from preev.com which has an availability problem. I'm opening this thread to explain future intentions with this domain/site, as well as to collect constructive suggestions for making the final solution.the current version of the site is not a conceptual solution, now it is more important that the page is not empty and that visitors can still get the information they came for. therefore, I will not bother with any correction of the current state, I will turn to make a completely new one from scratch.I personally am not on the best of terms with javascript or any of their framework, if I can't solve it myself, I'll probably hire someone to do it. (if there is a member here who is willing to cooperate, I am open to good deals)For example, I need a few suggestions, I hope I can get them.as for the design itself, is the initial version of the preev.com site really that good, so most similar services copy it? is it really necessary to have all possible currencies, for example, 170 FIAT and 5k+ cryptocurrencies? Or top 10 or 20 from CMC is enough?how many sources should be used to calculate the mean value, and what are the relevant sources that must be included?do you keep a page like this open all the time, to keep track of the current value? which update timer is desirable in that case?I saw some interesting features like the historical price that were liked by some members. whether such things are necessary? I would say more possibilities mean less simplicity but if there is an add-on that can be very useful, why not?Of course, any constructive suggestion is welcome.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411037",
  "comments": [
    {
      "author": "DaveF",
      "created_time": "August 24, 2022, 11:11:08 AM",
      "body": "I would do BTC and possibly 1 or 2 alts I that's it.USD EUR GBP for the fiat sideAdd a couple of donation addresses on the bottom with different coins. The more popular but cheaper to send alts even if someone sends you a few doge here and there it could add up.The original preev colors were fine as is the white on black you have setup.Keep it as simple as possible so lower power devices / slow internet can still get to it.Just my thoughts.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "August 24, 2022, 11:51:59 AM",
      "body": "Quote from: examplens on August 24, 2022, 09:59:26 AMis it really necessary to have all possible currencies, for example, 170 FIAT and 5k+ cryptocurrencies? Or top 10 or 20 from CMC is enough?If you want to follow preev.com step which aim for simplicity, i'd suggest choosing few fiat and cryptocurrency. Personally i would recommend <= 5 fiat and <= 8 cryptocurrency. Take note besides BTC and ETH, top X coin from CMC frequently changed. You might want to see the change from CMC historical data, https://coinmarketcap.com/historical/.Quote from: examplens on August 24, 2022, 09:59:26 AMhow many sources should be used to calculate the mean value, and what are the relevant sources that must be included?I'd say 3 or more sources. But FYI CoinGecko which currently you use already doing that.Quote from: https://www.coingecko.com/en/faqCoin Price refers to the current global volume-weighted average price of a cryptoasset traded on an active cryptoasset exchange as tracked by CoinGecko.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "August 24, 2022, 12:03:53 PM",
      "body": "Quote from: examplens on August 24, 2022, 09:59:26 AMOf course, any constructive suggestion is welcome.Hello examplens. You made a nice initiative.  Congratulations. My suggestion is that you do not add too many cryptocurrencies. What made preev.com important for the community was it simplicity. I would go only for btc, maybe btc and eth if you think that is important. About 170 fiat? Well, I have a website that is doing that. If you need help, I will be glad to help. I know how to work with react and javascript. I can also help if you need scripts go get data from multiple sources.I would get from at least 3, and make a volume weighted average  of them if you are getting from exchanges directly . If you are getting from coinmarketcap.com and coingecko, no need to mKe weighted average",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "August 24, 2022, 03:02:28 PM",
      "body": "@examplens, you made a very good decision in acquiring the domain. Congratulations!It would be best to keep the site as simple as possible and I think the old preev.com design was good enough. There is no need for more than three sources to calculate the price, imo. As for available currencies, I would limit to top 5 or top 10 for the front page. You can, for example, create a secondary page for a larger selection of currencies. The same applies for the historical price feature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "August 24, 2022, 04:55:53 PM",
      "body": "A historical price reference wouldn't be a bad thing to see. It doesn't have to be on the main page because it's of secondary importance after all. But you could add it and link to it with a button to the graphs at the bottom next to the \"About\" and \"Share\" buttons, for example. I would like to see mBTC as well together with BTC and sats. Since you are a Balkan-native, why not show prices in Serbian dinar and Croatian kuna as well?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "August 24, 2022, 05:02:37 PM",
      "body": "It would be much awesome if you add more fiat since all of us are not in the same country and add more crypto just like what others said above I prefer to add LTC, ETH, Doge, and Monero, and a few top 10 coins except for stablecoins and token. It may look like this Just a sample but don't edit the design of your website just add more crypto and fiat having more options more people will use your site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "August 24, 2022, 05:57:50 PM",
      "body": "I just thought of something else. I remember that the old preev.com site used to show the current BTC value next to the title on the browser tab. It would update in real time, which was quite neat because you didn't need to have the preev.com tab open to check the price. I hope you understand what I am trying to say. Currently, the subject in your browser tab says \"preev.net - Bitcoin to Fiat Calcu...\" Maybe it could just say \"preev.net - BTC=21.657\", for example.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "August 24, 2022, 06:55:21 PM",
      "body": "Quote from: examplens on August 24, 2022, 09:59:26 AMas for the design itself, is the initial version of the preev.com site really that good, so most similar services copy it? I think that default design is clean and good so I wouldn't make any drastic changes, but few improvements are fine.Maybe adding mBTC along with BTC and Sats value would be nice, since this is one of the most popular bitcoin units used on many websites.Quote from: examplens on August 24, 2022, 09:59:26 AMis it really necessary to have all possible currencies, for example, 170 FIAT and 5k+ cryptocurrencies? Or top 10 or 20 from CMC is enough?I would waste time and resources listing many shitcoins, but adding British Pound and some major fiat currencies could be useful.If you don't want to break current page style maybe you can create separate Settings menu on bottom.Quote from: examplens on August 24, 2022, 09:59:26 AMhow many sources should be used to calculate the mean value, and what are the relevant sources that must be included?Using aggregator middle value is best option for me (Coingecko is fine), but you could add fallback values with several top exchanges.Quote from: examplens on August 24, 2022, 09:59:26 AMdo you keep a page like this open all the time, to keep track of the current value? which update timer is desirable in that case?Don't fetch value to often or they could ban access to their API.I think checking every minute is fine, but it can be lowered to 20 or 45 seconds.Quote from: examplens on August 24, 2022, 09:59:26 AMI saw some interesting features like the historical price that were liked by some members. whether such things are necessary? I would say more possibilities mean less simplicity but if there is an add-on that can be very useful, why not?On very rare occasions I check historic values do it's not something I would use, and there must be a way to verify that price was like that according to reliable sources.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "August 24, 2022, 07:34:33 PM",
      "body": "Quote from: bitmover on August 24, 2022, 12:03:53 PMMy suggestion is that you do not add too many cryptocurrencies. What made preev.com important for the community was it simplicity. I kinda second this, with some additions:* if you want to add altcoins and still keep this simple, it could be \"good for the business\", but I'd suggest you do that on a subdomain and you just keep a link to that on main page (altcoins.preev.net?)* more fiat currencies could also be useful, but, again, I'd keep preev simple and make the more complicated one a/another subdomain I find more important to have more often updates for the price (or conversion amount) and to see the price/conversion amount at in the title bar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "August 26, 2022, 07:42:59 AM",
      "body": "When Preev.com was still working, I had it open at all times.... it showed the BTC price in the browser tab.. so I did not even had to have the page open to see the recent price. (that is very convenient, because you can go on with other things... and still see what happens with the price)  I also liked that it had several FIAT currencies (including my countries currency) ...so it was very easy to do the conversion when I wanted to do it. (provide a lot of Fiat currencies ...please)It also gave us the option to choose which data source we want to use to display the price, which was a very neat feature. The main thing I liked about Preev.com was it's simplicity..... you do not have too much clutter on the page and it was advertisement free.  Adding a lot of Alt coins are just going to complicate issues... and possibly slow down the site?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "August 26, 2022, 06:17:35 PM",
      "body": "That's a huge domain mate, each minute down you are loosing money.I would like to see something like this in the main page:https://codepen.io/rainner/details/bjJYjpThat would be a nice start, after that you can add the live data tracker for each coin or token.If you start with the most popular coins you will get offers from tokens creators to get listed, that's how the business should work, while you get some extra income with ads and ref links.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "August 27, 2022, 12:29:24 AM",
      "body": "The design should be simple IMO as like preev.com had. Having too much components make it looking awful. I really liked the simple design of preev.com and I believe most people would love that too.For adding other currencies, having BTC as default option, while people can get ETH and LTC price too. I would prefer these only. If you were to add more, consider community coin lik Dogecoin etc.For Fiat option, please add as more as you can. Also, I would prefer if it's something like you pull the data from Binance P2P for Fiat option. I would request you to add BDT of course",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "August 27, 2022, 03:09:13 PM",
      "body": "Quote from: examplens on August 24, 2022, 09:59:26 AMFor example, I need a few suggestions, I hope I can get them.as for the design itself, is the initial version of the preev.com site really that good, so most similar services copy it? Since you acquire the domain name preev with another extension that is .net from .com I suggest that you retain the simplicity of the design in the tradition of the original one that the whole community can relate to.Quoteis it really necessary to have all possible currencies, for example, 170 FIAT and 5k+ cryptocurrencies? Or top 10 or 20 from CMC is enough?Not really but it can help users to make your preev version a must-go-to site for everything related to currency exchange, I have one created when I was looking for alternatives since I can find many alternatives I created something that has many currencies on it its already five years old sometimes I forgot to renew I only become aware of it when it was not accessible anymore, hope I'm not spamming but here it is https://www.whois.com/whois/thecryptocoinconverter.com",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "August 28, 2022, 07:41:44 AM",
      "body": "It will help if you can keep the site \"online\" for a couple of hours during the day, because it has been offline or unavailable for days. If it is still under construction... then you should announce that, when people visit the site. It just looks bad when we discuss this site and when we saw it online.... and now it's been \"offline\" for a long time. Cmon, you can do better than this. Are you having technical difficulties with the site... or did you stop the project?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "August 28, 2022, 01:45:47 PM",
      "body": "Nice work brother. The only thing I see is missing: The live update. It does not update the way it used to for preev. It updated only page refresh only.Quote from: Kakmakr on August 28, 2022, 07:41:44 AMIt just looks bad when we discuss this site and when we saw it online.... and now it's been \"offline\" for a long time. Cmon, you can do better than this. Are you having technical difficulties with the site... or did you stop the project?This could be a hosting issue too. If it's just a regular shared hosting then excessive traffic will make the site unavailable. I assume the site should already have good traffic from search engine because people like us always look for preev in their browser. So a good hosting will be needed at the end.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinBarrel",
      "created_time": "August 28, 2022, 07:43:39 PM",
      "body": "It's a nice site, but I would consider it to be unethical to piggy-back off their established brand name.I would suggest creating your own domain, because not only is it unethical but could lead to trademark problems in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "August 29, 2022, 06:26:36 AM",
      "body": "Quote from: BitcoinGirl.Club on August 28, 2022, 01:45:47 PMNice work brother. The only thing I see is missing: The live update. It does not update the way it used to for preev. It updated only page refresh only.Quote from: Kakmakr on August 28, 2022, 07:41:44 AMIt just looks bad when we discuss this site and when we saw it online.... and now it's been \"offline\" for a long time. Cmon, you can do better than this. Are you having technical difficulties with the site... or did you stop the project?This could be a hosting issue too. If it's just a regular shared hosting then excessive traffic will make the site unavailable. I assume the site should already have good traffic from search engine because people like us always look for preev in their browser. So a good hosting will be needed at the end.Nah, my apologies.... it was my mistake, because I am so used to typing my own urls... I typed www.preev.net and it should be https://preev.net/       I am going to wait until the extra Fiat currencies are added, before I am going to use it more frequently, otherwise I will have to do two calculations to get to the fiat value of the bitcoins I want to calculate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "August 29, 2022, 07:57:50 AM",
      "body": "Quote from: Kakmakr on August 29, 2022, 06:26:36 AMit was my mistake, because I am so used to typing my own urls... I typed www.preev.net and it should be https://preev.net/I don't see it as a mistake, I see it as a (good!) test.I think that nowadays every website can and should make both www. and simple urls work.And probably this can help OP fix that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PawGo",
      "created_time": "August 29, 2022, 10:16:52 AM",
      "body": "I have 2 questions:1) as I understand, the price is loaded during page load/refresh, and calculations are done \"offline\". If I keep page open for several hours/days, does it update the price?2) do you plan to expose any simple api, which would return the price? Currently you use call to coingecko:Code:https://api.coingecko.com/api/v3/simple/price?vs_currencies=usd,eur&ids=bitcoinDo you plan to do something like that, but without call to 3rd party side (to have your server returning the result)?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}