{
  "id": "topic_5423665",
  "title": "Question:",
  "author": "BTCapsule",
  "created_time": "November 27, 2022, 07:41:23 AMLast edit: November 28, 2022, 12:33:15 PM by BTCapsule",
  "content": "There is an ongoing battle on Bitcoin Twitter about whether Bitcoin should be considered a weapon (and protected by the Second Amendment in the US) or speech (and protected by the First Amendment in the US). The legal precedent is that encryption is a munition in the United States, and therefore protected by the Second Amendment. During the Crypto Wars of the 90’s, cypherpunk Adam Back made a ridicule of this by creating a t-shirt with an RSA-encrypted message on the back, making it illegal to export or show this shirt to non-US citizen. EDITI personally don’t care what Bitcoin is called. However, there are people in the US government trying to legally classify Bitcoin as a weapon. That is why this conversation is important. To me, Bitcoin is property, and nobody has the right to take your property. Unfortunately in the US, property is irrelevant because politicians have interpreted the Commerce Clause of the Constitution to mean they can regulate absolutely any \"substance\" in existence.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5423665",
  "comments": [
    {
      "author": "hatshepsut93",
      "created_time": "November 27, 2022, 06:54:44 PM",
      "body": "Quote from: BTCapsule on November 27, 2022, 07:41:23 AMThe legal precedent is that encryption is a munition in the United States, and therefore protected by the Second Amendment.Don't confuse people here, there is no such precedent.Bitcoin is a digital currency. It's not a weapon, it's not a free speech mechanism. There's absolutely no way that any court would deem that Bitcoin is protected within the First or the Second amendment. If the US government has a precedent of seizing gold, why would it recognize the right to own Bitcoin as a part of the Constitution?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "November 27, 2022, 07:52:48 PM",
      "body": "Quote from: BTCapsule on November 27, 2022, 07:41:23 AMSnippedDespite all the rough and hard times bitcoin had suffered from US i can tell you vividly that US is still one of the countries with the highest numbers of bitcoiners in the world, yet it government attacking to regulate the currency, but your comparison here is what may be confusing because I don't see any correlation between bitcoin and speech, if bitcoin had been considering all manners of speeches against it maybe it could have been nowhere today, everyone has the freedom of speech while bitcoin remains unltared by any level of human speech levied against it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BTCapsule",
      "created_time": "November 27, 2022, 09:55:42 PMLast edit: November 27, 2022, 11:18:41 PM by BTCapsule",
      "body": "Quote from: hatshepsut93 on November 27, 2022, 06:54:44 PMQuote from: BTCapsule on November 27, 2022, 07:41:23 AMThe legal precedent is that encryption is a munition in the United States, and therefore protected by the Second Amendment.Don't confuse people here, there is no such precedent.Bitcoin is a digital currency. It's not a weapon, it's not a free speech mechanism. There's absolutely no way that any court would deem that Bitcoin is protected within the First or the Second amendment. If the US government has a precedent of seizing gold, why would it recognize the right to own Bitcoin as a part of the Constitution? Quote from: Aanuoluwatofunmi on November 27, 2022, 07:52:48 PMQuote from: BTCapsule on November 27, 2022, 07:41:23 AMSnippedDespite all the rough and hard times bitcoin had suffered from US i can tell you vividly that US is still one of the countries with the highest numbers of bitcoiners in the world, yet it government attacking to regulate the currency, but your comparison here is what may be confusing because I don't see any correlation between bitcoin and speech, if bitcoin had been considering all manners of speeches against it maybe it could have been nowhere today, everyone has the freedom of speech while bitcoin remains unltared by any level of human speech levied against it. I don’t mean to confuse anyone. This is not my analysis. The weapon position is from someone named Jason Lowery who works for the US Space Force. I do believe Bitcoin falls under speech because we have a 12 word seed phrase that gives us access to our property. Nobody can say we are not allowed to keep those 12 words in our head, speak those words, or write them down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "November 27, 2022, 11:05:46 PM",
      "body": "Quote from: BTCapsule on November 27, 2022, 09:55:42 PMQuote from: hatshepsut93 on November 27, 2022, 06:54:44 PMQuote from: BTCapsule on November 27, 2022, 07:41:23 AMThe legal precedent is that encryption is a munition in the United States, and therefore protected by the Second Amendment.Don't confuse people here, there is no such precedent.Bitcoin is a digital currency. It's not a weapon, it's not a free speech mechanism. There's absolutely no way that any court would deem that Bitcoin is protected within the First or the Second amendment. If the US government has a precedent of seizing gold, why would it recognize the right to own Bitcoin as a part of the Constitution? I don’t mean to confuse anyone. This is not my analysis. The weapon position is from someone named Jason Lowery who works for the US Space Force. I do believe Bitcoin falls under speech because we have a 12 word seed phrase that gives us access to our property. Nobody can say we are not allowed to keep those 12 words in our head, speak those words, or write them down.I really don't understand why people suddenly treat bitcoin like this, there is so much legality that makes bitcoiners more confuse.In the beginning it was just that simple, you have your mnemonic phrase, and private keys then it's yours. We don't need to be like debating whether it is considered as a weapon or speech and what legal precedence is covered or not.Bitcoin is for everyone, simple as that, this people just make it more complicated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BTCapsule",
      "created_time": "November 27, 2022, 11:17:24 PM",
      "body": "Quote from: Baofeng on November 27, 2022, 11:05:46 PMQuote from: BTCapsule on November 27, 2022, 09:55:42 PMQuote from: hatshepsut93 on November 27, 2022, 06:54:44 PMQuote from: BTCapsule on November 27, 2022, 07:41:23 AMThe legal precedent is that encryption is a munition in the United States, and therefore protected by the Second Amendment.Don't confuse people here, there is no such precedent.Bitcoin is a digital currency. It's not a weapon, it's not a free speech mechanism. There's absolutely no way that any court would deem that Bitcoin is protected within the First or the Second amendment. If the US government has a precedent of seizing gold, why would it recognize the right to own Bitcoin as a part of the Constitution? I don’t mean to confuse anyone. This is not my analysis. The weapon position is from someone named Jason Lowery who works for the US Space Force. I do believe Bitcoin falls under speech because we have a 12 word seed phrase that gives us access to our property. Nobody can say we are not allowed to keep those 12 words in our head, speak those words, or write them down.I really don't understand why people suddenly treat bitcoin like this, there is so much legality that makes bitcoiners more confuse.In the beginning it was just that simple, you have your mnemonic phrase, and private keys then it's yours. We don't need to be like debating whether it is considered as a weapon or speech and what legal precedence is covered or not.Bitcoin is for everyone, simple as that, this people just make it more complicated.I agree that we don’t need to be debating these things, but there are officials in the US military who are bringing up this debate. I don’t care what the precedence of anything is. The government still classifies tomatoes as a vegetable for tax purposes. I don’t trust the government. But I have serious concerns about this, because Jason has implied mining is a weapon of mass mutual destruction. Of course he says it’s “non-lethal” and claims to love Bitcoin and want it to advance, but I’m very uncomfortable with this idea.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "November 27, 2022, 11:25:18 PM",
      "body": "Quote from: hatshepsut93 on November 27, 2022, 06:54:44 PMQuote from: BTCapsule on November 27, 2022, 07:41:23 AMThe legal precedent is that encryption is a munition in the United States, and therefore protected by the Second Amendment.Don't confuse people here, there is no such precedent.Bitcoin is a digital currency. It's not a weapon, it's not a free speech mechanism. There's absolutely no way that any court would deem that Bitcoin is protected within the First or the Second amendment. If the US government has a precedent of seizing gold, why would it recognize the right to own Bitcoin as a part of the Constitution? What I want to let us understand is that, we all aware that Bitcoin is a digital currency and also a decentralized currency,which is very understanding that government of a particular country does not have any command of Bitcoin because of it's technology.so therefore, government can add the valuation of Bitcoin or enshrined it in the law base on regulations ir condition, while in gold they can give any instructions of gold in all ramifications of order, so in summary both of them can be chosen be in the constitution of a nation depending on their wish.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "November 27, 2022, 11:28:43 PM",
      "body": "Bitcoin is a weapon?  A speech mechanism?  Lol.Bitcoin is the same as fiat and it was created for the purpose of a fiat alternative, nothing more. We know that FinCEN and IRS don't consider crypto to be legal tender but they know how to have tax guidance and consider Bitcoin is good for money transmitters like fiat.  There's a proper regulation to combat global and domestic criminal activities in each jurisdiction and I think that's the best solution while adopting Bitcoin.If you read the Whitepaper of Bitcoin it has a good purpose than using it as you've said.It's a digital currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "November 28, 2022, 12:22:01 AM",
      "body": "Its decentralised nature likely means we don't have to pick which of the two it is (if it falls into the category of either).It might be legal for the same reasons tor is legal or it could be legal because it's not been made illegal and there's little reason to make it illegal (eg the EU saying only 2% of crypto transactions are related to illegal activity iirc).If bitcoin were illegal, it'd probably appreciate in value.The right to freedom of speech is protected in a lot more places than the freedom to carry deadly weapons with a hope your can discharge it on someone before they discharge it on you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChiBitCTy",
      "created_time": "November 28, 2022, 12:56:55 AM",
      "body": "Bitcoin a weapon and free speech are really all completely different things. I guess theoretically you could say that it’s a weapon of the people, for the people and by the people. In that sense it’s one of the most powerful weapons ever created in the fact that it’s something the government literally literally couldn’t fully shut down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "November 28, 2022, 02:19:29 AM",
      "body": "I think these are all subjective interpretations of what Bitcoin is. So this is not a black and white dilemma. Is Bitcoin literally a weapon? No. But could it be used as a weapon? I think so. Bitcoin is also not really a speech but could it be interpreted as a form of speech, a statement? I also think so. It all depends on how you treat and use it. But it doesn't have a definite or material description. Bitcoin isn't a tangible object like a knife or a fork or whatever that is specifically created for a definite purpose. If somebody says Bitcoin is freedom, it means a lot of things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "November 28, 2022, 05:06:57 AM",
      "body": "Quote from: BTCapsule on November 27, 2022, 07:41:23 AMThere is an ongoing battle on Bitcoin Twitter about whether Bitcoin should be considered a weapon (and protected by the Second Amendment in the US) or speech (and protected by the First Amendment in the US). That makes no sense at all. Why force bitcoin into a category that it doesn't fit into?To be honest the whole discussion on twitter seems to be among idiots who either don't understand what \"weapon\" or \"speech\" means or they are pursing a different purpose that can only be known if we know a little background of the people who started this fake discussion.Quote from: BTCapsule on November 27, 2022, 09:55:42 PMI do believe Bitcoin falls under speech because we have a 12 word seed phrase that gives us access to our property. This was so funny",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "November 28, 2022, 10:00:16 AM",
      "body": "Neither, Although you can write anything during sign a message, but not many people can sign a message since it need few process to know your message and I think it's kind of cencorship, so Bitcoin isn't a speech.Bitcoin also not a weapon since you can't hit someone if you have Bitcoin except you hire a criminal to shoot someone that you don't like.Bitcoin is just a decentralized currency to avoid any third party or centralization, that's it!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "November 28, 2022, 10:32:48 AM",
      "body": "Of all the ridiculous things to do, and this new culture of being able to \"weaponise\" anything. Gender, culture, language, code... makes sense of course, but try hard enough and you could fit Bitcoin into a box of your choosing. Probably fun for a master's dissertation or a tongue-in-cheek journal submission but only if you're the kind of guy that likes arguing for the sake of argument.Speech probably where I lean. Bitcoin is code at the end of the day, and that does need someone to learn how to interact with it, or read English to learn to use a wallet, seed phrase, even latin script (in my part of the world a lot of people still only can read their local script).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BTCapsule",
      "created_time": "November 28, 2022, 04:33:04 PM",
      "body": "Quote from: ETFbitcoin on November 28, 2022, 12:20:02 PMQuote from: BTCapsule on November 27, 2022, 07:41:23 AMThere is an ongoing battle on Bitcoin Twitter about whether Bitcoin should be considered a weapon (and protected by the Second Amendment in the US) or speech (and protected by the First Amendment in the US).Bitcoin could be whatever depending on how it's used by its owner. And IMO forcing Bitcoin to be either weapon or speech to get protection by 1st/2nd amendment is ridiculous.I agree with this wholeheartedly. As an American, I don’t really care what the Constitution says. However, people in this country view it as a religious document, and believe everything must fall into one of its categories. The Ninth Amendment is the only one that matters to me, but it is ignored by all institutions.Quote from: ETFbitcoin on November 28, 2022, 12:20:02 PMQuote from: BTCapsule on November 27, 2022, 09:55:42 PMI do believe Bitcoin falls under speech because we have a 12 word seed phrase that gives us access to our property.If you're going to force Bitcoin as speech, at least make better argument. For example, Bitcoin is used by citizen to perform freedom by speech by utilizing OP_RETURN.Quote from: pooya87 on November 28, 2022, 05:06:57 AMThat makes no sense at all. Why force bitcoin into a category that it doesn't fit into?To be honest the whole discussion on twitter seems to be among idiots who either don't understand what \"weapon\" or \"speech\" means or they are pursing a different purpose that can only be known if we know a little background of the people who started this fake discussion.This was so funny In the US, speech means much more than having the freedom to say things. It can be ideas, art, actions, etc. A political cartoon is speech like sticking up your middle finger to a politician. Gigi argues that Bitcoin is speech because we can roll some dice or flip a coin to get our private key. We can then convert that key into a secret “phrase”. So creating and writing down the private key is speech. To make this action illegal is essentially restricting our freedom of speech and thought. Jason Lowery, who works for the US military, argues that miners are at digital war against each other based on first principles of bacteria fighting for natural selection. He has build an entire philosophy on the idea that mining is a non-lethal means of warfare called “soft-war” that can replace a majority of “hard-war” that involves physical bodies. It’s a noble idea on the surface, but he builds on this analogy to say mining could be a weapon of mass mutual destruction, and it’s in the interest of the US government to protect mining, rather than ban it. He uses the Second Amendment to explain why the government cannot forbid us from Bitcoin or mining, but this worries me because US citizens are not permitted to possess the same weapons that the government possesses (WMDs).So none of this is about banning Bitcoin. It seems worse to me. Instead, I feel like the government wants to seize the means of Bitcoin production (mining) and start a digital war with other countries to have the biggest hash rate. This would mean individuals could no longer compete with mining.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "November 28, 2022, 05:41:08 PM",
      "body": "Quote from: BTCapsule on November 28, 2022, 04:33:04 PMGigi argues that Bitcoin is speech because we can roll some dice or flip a coin to get our private key. We can then convert that key into a secret “phrase”. So creating and writing down the private key is speech. To make this action illegal is essentially restricting our freedom of speech and thought. It's a stupid argument for a few reasons. First, Bitcoin is not just a private key, it's the whole software and the network. And a ban on Bitcoin wouldn't look like a ban on running software, no one will bother with enforcing that, instead Bitcoin-related operations will be banned - exchanging it for fiat, using it as a payment method, etc. If these bans are enforced, then Bitcoin would be nothing more than a record in a database with no utility.And second, this is just a version of the reductive argument that information is just a number and you can't outlaw a number.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BTCapsule",
      "created_time": "November 28, 2022, 06:11:19 PM",
      "body": "Quote from: hatshepsut93 on November 28, 2022, 05:41:08 PMQuote from: BTCapsule on November 28, 2022, 04:33:04 PMGigi argues that Bitcoin is speech because we can roll some dice or flip a coin to get our private key. We can then convert that key into a secret “phrase”. So creating and writing down the private key is speech. To make this action illegal is essentially restricting our freedom of speech and thought. It's a stupid argument for a few reasons. First, Bitcoin is not just a private key, it's the whole software and the network. And a ban on Bitcoin wouldn't look like a ban on running software, no one will bother with enforcing that, instead Bitcoin-related operations will be banned - exchanging it for fiat, using it as a payment method, etc. If these bans are enforced, then Bitcoin would be nothing more than a record in a database with no utility.And second, this is just a version of the reductive argument that information is just a number and you can't outlaw a number.Maybe you will find this article interesting. Gigi can explain it a lot better than I can:https://dergigi.com/2021/08/02/implications-of-outlawing-bitcoin/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jon_Hodl",
      "created_time": "November 28, 2022, 07:17:46 PM",
      "body": "I tend to think that Bitcoin is speech but I think it's even more than that. It's an idea. It's math. It's thought.Bitcoin is absolutely NOT a weapon. It's more like a vault with 2^256 different possible combinations to steal all the money inside.The whole notion that \"bitcoin is a weapon because it can defend wealth like a gun can be used for self-defense\" is absolute nonsense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "November 29, 2022, 04:53:59 AM",
      "body": "Quote from: BTCapsule on November 28, 2022, 04:33:04 PMSo none of this is about banning Bitcoin. It seems worse to me. Instead, I feel like the government wants to seize the means of Bitcoin production (mining) and start a digital war with other countries to have the biggest hash rate. This would mean individuals could no longer compete with mining.Philosophically speaking you can define anything as anything (eg. Bitcoin and Speech) but that doesn't mean it is right!But about this part I have to say it is impossible because the hashrate is already too huge and too spread around the globe for US to jump on board at this point and start owning a large enough percentage of it to have any kind of control. Keep in mind that US neither has the cheapest electricity nor access to ASIC production (the factory is in China).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BTCapsule",
      "created_time": "November 29, 2022, 05:28:08 AM",
      "body": "Quote from: pooya87 on November 29, 2022, 04:53:59 AMQuote from: BTCapsule on November 28, 2022, 04:33:04 PMSo none of this is about banning Bitcoin. It seems worse to me. Instead, I feel like the government wants to seize the means of Bitcoin production (mining) and start a digital war with other countries to have the biggest hash rate. This would mean individuals could no longer compete with mining.Philosophically speaking you can define anything as anything (eg. Bitcoin and Speech) but that doesn't mean it is right!But about this part I have to say it is impossible because the hashrate is already too huge and too spread around the globe for US to jump on board at this point and start owning a large enough percentage of it to have any kind of control. Keep in mind that US neither has the cheapest electricity nor access to ASIC production (the factory is in China).The US does not have the cheapest electricity, but they have the money printer. Price is not a concern to the government, especially when it comes to war. The fiat system is built in such a way that it incentivizes spending as quickly as possible, which is the opposite of Bitcoin. Fiat was created to fund war, and as long as the money can be spent before it affects the market, those who print the money can buy whatever they want for the current market prices. Quote“It is no coincidence that when recounting the most horrific tyrants of history, one finds that every single one of them operated a system of government-issued money which was constantly inflated to finance government operation. There is a very good reason that Vladimir Lenin, Joseph Stalin, Mao Ze Dong, Adolf Hitler, Maximilien Robespierre, Pol Pot, Benito Mussolini, Kim Jong Il, and many other notorious criminals all ruled in periods of unsound government-issued money which they could print at will to finance their genocidal and totalitarian megalomania. It is the same reason that the same societies which birthed these mass murderers did not produce anyone close to their level of criminality when living under sound monetary systems which required governments to tax before they spent. None of these monsters ever repealed sound money in order to fund their mass murder. The destruction of sound money had come before, hailed with wonderful feel-good stories involving children, education, worker liberation, and national pride. But once sound money was destroyed, it became very easy for these criminals to take over power and take command of all of their society's resources by increasing the supply of unsound money.”- The Bitcoin Standard, Saifedean Ammous",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}