{
  "id": "topic_5456059",
  "title": "bananaunana",
  "author": "bananaunana",
  "created_time": "June 11, 2023, 03:25:18 PM",
  "content": "Bounty campaigns and Signature campaigns are very famous for Bitcointalk as a part of a vital crypto ecosystem, where many Crypto Services, like Gambling sites or new coins are frequently trying to create awareness on Bitcointalk, where Satoshi was active himself. When we are participating in such campaigns, it means directly an endorsement of certain campaign and especially for famous accounts, it is also important because of reputation. If a known DT member or Legendary ranked account is adding a certain signature on his account, it gives an impression of trust, visible to every viewer. Wearing a certain signature means directly an endorsement. As a result, we should be very careful, which services are setting up a Signature campaign here on Bitcointalk and members joining such a campaign need to do a detailed research about it. We should always check out if it’s a legit service or not and if it’s not legit, we should avoid it. Wearing a Signature of a scamsite will result in negative trust on our accountYes, wearing a Signature of a scamsite will result in negative DT trust entry for certain members promoting it, rightfully so. Because endorsing such a scamsite can lead to people falling victim to such a scamsite. Only proven scams will lead to negative DT trust entry on accounts wearing certain signaturesDon’t worry, it’s easy to avoid getting a negative DT trust entry from promoting scamsites. To be considered as a scamsite, DT needs to deliever a proof if a site is a scamsite. Accusations are not enough, it really needs to be a proven scam, for example, when a community member has been scammed. So, you are safe, just stay away from any scamsite and don’t endorse it by wearing a signature.  Example: 1xbit is a big scamsiteA perfect example of a big scamsite offering a signature campaign here in Bitcointalk is 1xbit, which is a proven scamsite.  As a scam sportsbook, 1xbit has scammed many community members and 1xbit has all its accounts on Bitcointalk painted in negative trust from various DT members. You can check out 1xbit’s scamming here: https://bitcointalk.org/index.php?topic=5267919.0We have more legitimate sportsbooks here on Bitcointalk, like Sportsbet.io, Betnomi or Stake.com. Stay away from 1xbit, don’t bet on 1xbit and don’t add 1xbet’s signature. Because recently, 1xbit has launched a new signature campaign. Everyone who joins, will get a negative DT trust entry for promoting scamsites. JollyGood has made a very honorable effort to expose accounts participating in 1xbit’s campaigns. I can encourage to tag 1xbit account when you’ll notice one. Give it a negative trust. Improving Bitcointalk: call out scamsites and supporters of scamsitesScams are not moderated on Bitcointalk. It is our job to research, present proof and call out scam sites. When someone wears a signature on his account, it means directly endorsing by promoting such a site. Especially if a known DT member or Legendary ranked account is adding a certain signature on his account, it gives an impression of trust, visible to every viewer.We need to make sure, it’s really a legitimate site to avoid endorsing a scam. We need to call out scammers, scamsites and people endorsing scamsites. When everyone does so, Bitcointalk will be a safer place from scamsites.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456059",
  "comments": [
    {
      "author": "bananaunana",
      "created_time": "June 11, 2023, 04:03:12 PM",
      "body": "Quote from: T3PR00T on June 11, 2023, 03:38:28 PMWhat is the goal of the topic It is to make aware to look up a project before supporting it. We should not give legitimacy for fraudulent projects by wearing a signature of it. For example, LoyceV has rejected a ponzi project because it is fraudulent: Quote from: LoyceV on June 07, 2023, 02:20:16 PMQuote from: hugeblack on June 07, 2023, 02:00:26 PMHow long do you want to run a signature campaign? If it was for a long time, I hope to hire @LoyceV, he is an excellent member, and I did not see him running a campaign soon, so he will give you good results.I took a quick look at \"FireDAO\", and it's not something I want to support. It's another BS ponzi scam with \"ape pictures\".In addition, I have reported your post: Quote from: mprep on July 21, 2014, 05:27:51 PM1. No zero or low value, pointless or uninteresting posts or threads.You should not violate forum rules. Your post is pointless and spammy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "T3PR00T",
      "created_time": "June 11, 2023, 04:13:35 PM",
      "body": "Quote from: bananaunana on June 11, 2023, 04:03:12 PM]In addition, I have reported your post: Quote from: mprep on July 21, 2014, 05:27:51 PM1. No zero or low value, pointless or uninteresting posts or threads.You should not violate forum rules. Your post is pointless and spammy. Good job but you are far away to understand what is on topic and what is not. Good luck though.A piece of advice: Learn which belongs to reputation and which belongs to beginners and help. Your topic created no encouragement for anything but another spam topic to hope for receiving some merit.Do you really think it's a topic providing any value to anyone who visit the reputation area?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bananaunana",
      "created_time": "June 11, 2023, 04:27:18 PM",
      "body": "Quote from: T3PR00T on June 11, 2023, 04:13:35 PMQuote from: bananaunana on June 11, 2023, 04:03:12 PM]In addition, I have reported your post: Quote from: mprep on July 21, 2014, 05:27:51 PM1. No zero or low value, pointless or uninteresting posts or threads.You should not violate forum rules. Your post is pointless and spammy. Good job but you are far away to understand what is on topic and what is not. Good luck though.You don't understand my topic, it's all about DYOR before joining a Signature campaign. Not everyone wants fraudulent sites supported. Quote from: T3PR00T on June 11, 2023, 04:13:35 PMA piece of advice: Learn which belongs to reputation and which belongs to beginners and help. Your topic created no encouragement for anything but another spam topic to hope for receiving some merit.A piece of advice: learn how to write a constructive first reply post to a new, constructive topic. Especially, a first reply comment in a new topic should be way more constructive. My topic is very clearly an encouragement for DYOR, creating awareness how supporting a scam site in our signature will most likely lead to a negative DT trust. Look at 1xbit promoters. Your spampost is not my responsibility. I've reported your spam post in my topic, my job is done. Plz stop derailing my topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "T3PR00T",
      "created_time": "June 11, 2023, 04:41:06 PM",
      "body": "Quote from: bananaunana on June 11, 2023, 04:27:18 PMYou don't understand my topic, it's all about DYOR before joining a Signature campaign. Not everyone wants fraudulent sites supported. Yes professor. Good luck with your constructive work.PS: feel free to repost this response because it's indeed an off-topic reply in a topic which is not a topic at all lol",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "June 11, 2023, 04:52:20 PM",
      "body": "People should have some sort of moral compass period and there are a lot here that do not. Some will promote a company scam or not. Like your example 1xbit, there are at least 50 users who ruined their accounts once 1xbit stops advertising for just a few bucks a week. Maybe they're all owned by the same person as suggested by others, maybe not but they're all worthless accounts once 1xbit leaves this forum. 1xbit is a known scam company. Advertising or even applying in their thread will lead you to have a neg trusted account. What about companies that aren't labeled a scam yet? You left this out of your presentation. If a company is found to be a scam, the manager and the participants should cease all advertising for that company. This will save everyone from getting painted red for advertising that company.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "June 11, 2023, 04:59:34 PM",
      "body": "@T3PROOT The OP has a point on creating this thread here since his topic is about the repercussions of promoting scam site in user reputation/trust score. This topic is also appropriate on beginners and help since the target audience of this content is beginner because most of the forum member knew already the basics for protecting their reputation.Both of you should learn how to appreciate comment and suggestions. Stop being a child just because your opinion is not considered.OP, the most effective method to counter this kind of problem is to join only on campaigns that manage by reputable manager. You will have low chance on participating scam site. Low chance not zero chance to be clear.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "June 11, 2023, 06:19:13 PM",
      "body": "Quote from: yahoo62278 on June 11, 2023, 04:52:20 PMPeople should have some sort of moral compass period and there are a lot here that do not. Some will promote a company scam or not. Like your example 1xbit, there are at least 50 users who ruined their accounts once 1xbit stops advertising for just a few bucks a week. Maybe they're all owned by the same person as suggested by others, maybe not but they're all worthless accounts once 1xbit leaves this forum. 1xbit is a known scam company. Advertising or even applying in their thread will lead you to have a neg trusted account. What about companies that aren't labeled a scam yet? You left this out of your presentation. If a company is found to be a scam, the manager and the participants should cease all advertising for that company. This will save everyone from getting painted red for advertising that company.The most important factor to note in all of this is when the user knows that the company is a proven scam and still went ahead knowingly promotes such company the user should be guilty of the same offence as the principal and the tag is justified. Just as you said Yahoo that we as members should have some moral justification and responsibility to check the services we promote via our signature or avatar because we are directly luring users to those companies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bananaunana",
      "created_time": "June 11, 2023, 07:12:27 PM",
      "body": "Quote from: yahoo62278 on June 11, 2023, 04:52:20 PMWhat about companies that aren't labeled a scam yet? You left this out of your presentation. Well, we don't know if a site is a scam before it is proven. We can only check if it's yet known if a site is a scamsite. And we should always investigate new sites presenting Signature campaigns on Bitcointalk. Quote from: yahoo62278 on June 11, 2023, 04:52:20 PMIf a company is found to be a scam, the manager and the participants should cease all advertising for that company. You are right, after it is 100% clear, where it is proven a site to be scam, everyone needs to stop advertising it. Quote from: Beparanf on June 11, 2023, 04:59:34 PMThis topic is also appropriate on beginners and help since the target audience of this content is beginner because most of the forum member knew already the basics for protecting their reputation.Yes, it can also be considered a Beginners Help topic because it's about advice for avoiding to damage our reputation and promote a proven scam site in our signature. I have moved my topic to Beginners and Help, where it seems to have better audience. Quote from: Beparanf on June 11, 2023, 04:59:34 PMOP, the most effective method to counter this kind of problem is to join only on campaigns that manage by reputable manager. You will have low chance on participating scam site. Low chance not zero chance to be clear.Very good advice, we have very professional Bounty managers here on Bitcointalk of a great reputation who will look out for shady projects and also avoid such projects, while also ensuring an escrow of funds. Most projects are hiring a good manager but some do not and such cases can lead to confusion. It is also an important advice to select Bitcoin campaigns over Altcoins campaigns because Bitcoin campaigns have proven to be more reliable, while many Altcoins have defaulted rewards or turned out to be shitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "June 11, 2023, 07:15:16 PM",
      "body": "Accounts that actively wear signature and promote scam sites do not do so out of ignorance, they are well aware of their actions and the consequences but because they choose to go that way because of the money the company may be offering ( scam casinos are known to spend lavishly on their promotion).  A large percentage of 1xbit promoters are accounts with previous red tags, they know their accounts will not be accepted into any credible campaigns.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qwertyup23",
      "created_time": "June 11, 2023, 07:36:24 PM",
      "body": "Quote from: yahoo62278 on June 11, 2023, 04:52:20 PM1xbit is a known scam company. Advertising or even applying in their thread will lead you to have a neg trusted account. What about companies that aren't labeled a scam yet? You left this out of your presentation. If a company is found to be a scam, the manager and the participants should cease all advertising for that company. This will save everyone from getting painted red for advertising that company.The fact that people still apply and advertise a very well-known scam gambling website speak on how it is managed. All participants who are enrolled in 1xbit are either negatively tagged or blacklisted due to their decision on promoting an ongoing scam.Unfortunately, I also observed that majority of the participants in the 1xbit campaign comment on threads that are very irrelevant- which has nothing to do with the thread posted by the OP. It is like, they are just posting for the sake of attempting to acquire traction. But they fail miserably since these participants also are either not paid or being trolled by 1xbit in the process.At the end of the day, everything boils down to your decision on whether you want to promote a scam campaign or not. Sure, they may offer rates that are higher compared to other campaigns but be ready for the consequence when you commit to such decision.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "June 11, 2023, 10:27:16 PM",
      "body": "Quote from: Beparanf on June 11, 2023, 04:59:34 PMOP, the most effective method to counter this kind of problem is to join only on campaigns that manage by reputable manager. You will have low chance on participating scam site. Low chance not zero chance to be clear.Sometimes reputation managers can still launch campaign for a project that has always had the intention of performing an exit scam but just presented themselves at first as a good, strong reliable project.Everyone is bound to make mistake so managers are prone to mistake when performing research on a project they are to launch campaign for, and that's why you still see some scam accusation thread for a project that's been managed by some of the most reputable managers here in the forum. The best thing that a good manager can and should do in a situation where there's slight chance of the project scamming is to cut all ties with the project and inform the community about their observation rather than to continue promoting it just for the sake of their monetary gain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "June 11, 2023, 10:59:48 PM",
      "body": "Quote from: qwertyup23 on June 11, 2023, 07:36:24 PMUnfortunately, I also observed that majority of the participants in the 1xbit campaign comment on threads that are very irrelevant- which has nothing to do with the thread posted by the OP. It is like, they are just posting for the sake of attempting to acquire traction. But they fail miserably since these participants also are either not paid or being trolled by 1xbit in the process.At the end of the day, everything boils down to your decision on whether you want to promote a scam campaign or not. Sure, they may offer rates that are higher compared to other campaigns but be ready for the consequence when you commit to such decision.We can report them until they didn't get paid for what they've promoted because all their posts have been deleted.It's all about money why are they still promoting scam casinos even though they know it's a scam and as we can see, all those accounts have ruined their reputation already. Think about it, by promoting scams, you undermine legitimate businesses that provide good and honest services. Legitimate businesses work hard to build trust and deliver value to their customers.  Promoting scams not only harms individuals but also can cause financial loss to others, so think about it if you're one of them promoting scam casinos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Issa56",
      "created_time": "June 11, 2023, 11:13:26 PM",
      "body": "Quote from: bananaunana on June 11, 2023, 03:25:18 PMit is also important because of reputation. If a known DT member or Legendary ranked account is adding a certain signature on his account, it gives an impression of trust, visible to every viewer. Wearing a certain signature means directly an endorsement. As a result, we should be very careful, which services are setting up a Signature campaign here on Bitcointalk and members joining such a campaign need to do a detailed research about it. We should always check out if it’s a legit service or not and if it’s not legit, we should avoid it. As a legend member or a DT member, I see no reason they should market for scam websites, I know a signature might be launched here which everyone will join and things might be going well, any rank can join even the legendary members, but immediately maybe the site have been tagged as scam, am sure everyone should remove the signature and avatar immediately, if we keep on advertising scam websites, then you are putting forum members at risk of being scam, because if they see the signature on your profile, they might end up following the link on your profile to the site which they will be scammed. Quote from: bananaunana on June 11, 2023, 03:25:18 PMWearing a Signature of a scamsite will result in negative trust on our accountYes, wearing a Signature of a scamsite will result in negative DT trust entry for certain members promoting it, rightfully so. Because endorsing such a scamsite can lead to people falling victim to such a scamsite. If a campaign is tag as a scam campaign, then the manager is should pause the campaign immediately and the participants should change their signature immediately, if a campaign is tag as scam and the manager keeps on running the campaign, then the manager should be tag also and any member that keeps on advertising for them should be tagged also. Quote from: bananaunana on June 11, 2023, 03:25:18 PMExample: 1xbit is a big scamsiteI find it painful whenever I see people participating in 1xbit campaign, people participating in 1xbit are just selfish people that only care about the little amount of money that will be paid to them, and they don’t care if anyone is being scammed at the end or not, I believe those people those not mean well for the forum and forum members so they deserve to be tagged.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "June 12, 2023, 02:53:01 AM",
      "body": "Quote from: bananaunana on June 11, 2023, 03:25:18 PMBounty campaigns and Signature campaigns are very famous for Bitcointalk as a part of a vital crypto ecosystem, where many Crypto Services, like Gambling sites or new coins are frequently trying to create awareness on Bitcointalk, where Satoshi was active himself.Many information is not correct in it.QuoteAs a result, we should be very careful, which services are setting up a Signature campaign here on Bitcointalk and members joining such a campaign need to do a detailed research about it. We should always check out if it’s a legit service or not and if it’s not legit, we should avoid it. Checking it or not, you can not sure that it is not a scam project. It is not a matter if you wear a signature of a scam project when you are not known about it. Problem occurs if the community warn that it is a scam project with proofs for their conclusion. If you continue to wear signature of that scam project after community warning, you will have problem with DT members and forum community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mamesso",
      "created_time": "June 12, 2023, 03:30:38 AM",
      "body": "This advice is very useful for newbies to avoid scam sites when they want to promote Bounty Campaigns and Signature Campaigns in forums. The obsession with being part of the Bitcoin paid signature campaign has made some users heed all the prohibitions written on the forum, they are willing to have their accounts stabbed in red ink in order to collect Bitcoin fractions that were forcibly taken from site users.1xbit is one of the most combated sites on the forum, several users involved in it have been punished for heeding the restrictions on the forum. Need to be aware of raising money on forums, maintaining account reputation is better than collecting a few dollars of stolen money that site owners do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "June 12, 2023, 07:32:09 AM",
      "body": "Quote from: bananaunana on June 11, 2023, 03:25:18 PMOnly proven scams will lead to negative DT trust entry on accounts wearing certain signaturesDon’t worry, it’s easy to avoid getting a negative DT trust entry from promoting scamsites. To be considered as a scamsite, DT needs to deliever a proof if a site is a scamsite. Accusations are not enough, it really needs to be a proven scam, for example, when a community member has been scammed. So, you are safe, just stay away from any scamsite and don’t endorse it by wearing a signature.  This is one good thing about the forum, every accusation must be backed with evidence and proven to be true. This is because some reputable casinos have been falsely accused by some people and these claims were not proven to be true. Competitors might also want to tarnish the image of some service providers by coming up with false accusations. The community will always give each party the privilege to present their cases and a verdict will be given based on the facts presented.Quote from: sheenshane on June 11, 2023, 10:59:48 PMLegitimate businesses work hard to build trust and deliver value to their customers.  Promoting scams not only harms individuals but also can cause financial loss to others, so think about it if you're one of them promoting scam casinos.Many people don't care about their reputation or even the consequences of their actions. Their only focus is just to get the money and nothing else. Sometimes I see some high-ranking and clean accounts applying for this scam campaign and I think this is a result of impatience. Maybe because they were not accepted in a reputable campaign, they feel that it will be easier to start earning from these irresponsible promotions. For me, there is no moral justification to prone a casino or service that will lead to the loss of funds unsuspected clients, and damage the reputation of a.mwmbwr after all the hard work building an account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alisha-k",
      "created_time": "June 12, 2023, 10:41:47 PM",
      "body": "Quote from: bananaunana on June 11, 2023, 03:25:18 PMBounty campaigns and Signature campaigns are very famous for Bitcointalk as a part of a vital crypto ecosystem, where many Crypto Services, like Gambling sites or new coins are frequently trying to create awareness on Bitcointalk, where Satoshi was active himself. When we are participating in such campaigns, it means directly an endorsement of certain campaign and especially for famous accounts, it is also important because of reputation. If a known DT member or Legendary ranked account is adding a certain signature on his account, it gives an impression of trust, visible to every viewer. Wearing a certain signature means directly an endorsement. As a result, we should be very careful, which services are setting up a Signature campaign here on Bitcointalk and members joining such a campaign need to do a detailed research about it. We should always check out if it’s a legit service or not and if it’s not legit, we should avoid it. Wearing a Signature of a scamsite will result in negative trust on our accountYes, wearing a Signature of a scamsite will result in negative DT trust entry for certain members promoting it, rightfully so. Because endorsing such a scamsite can lead to people falling victim to such a scamsite. Only proven scams will lead to negative DT trust entry on accounts wearing certain signaturesDon’t worry, it’s easy to avoid getting a negative DT trust entry from promoting scamsites. To be considered as a scamsite, DT needs to deliever a proof if a site is a scamsite. Accusations are not enough, it really needs to be a proven scam, for example, when a community member has been scammed. So, you are safe, just stay away from any scamsite and don’t endorse it by wearing a signature.  Example: 1xbit is a big scamsiteA perfect example of a big scamsite offering a signature campaign here in Bitcointalk is 1xbit, which is a proven scamsite.  As a scam sportsbook, 1xbit has scammed many community members and 1xbit has all its accounts on Bitcointalk painted in negative trust from various DT members. You can check out 1xbit’s scamming here: https://bitcointalk.org/index.php?topic=5267919.0We have more legitimate sportsbooks here on Bitcointalk, like Sportsbet.io, Betnomi or Stake.com. Stay away from 1xbit, don’t bet on 1xbit and don’t add 1xbet’s signature. Because recently, 1xbit has launched a new signature campaign. Everyone who joins, will get a negative DT trust entry for promoting scamsites. JollyGood has made a very honorable effort to expose accounts participating in 1xbit’s campaigns. I can encourage to tag 1xbit account when you’ll notice one. Give it a negative trust. Improving Bitcointalk: call out scamsites and supporters of scamsitesScams are not moderated on Bitcointalk. It is our job to research, present proof and call out scam sites. When someone wears a signature on his account, it means directly endorsing by promoting such a site. Especially if a known DT member or Legendary ranked account is adding a certain signature on his account, it gives an impression of trust, visible to every viewer.We need to make sure, it’s really a legitimate site to avoid endorsing a scam. We need to call out scammers, scamsites and people endorsing scamsites. When everyone does so, Bitcointalk will be a safer place from scamsites.  this days, we have just very few persons who have human sympathy and are not willing to compromise their dignity and self respect for money, asides this, everyone's looking out for their pocket, In as much as the campaign's willing to pay, the too are willing to bag the money without thinking of the effect their review would have on the next person.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "June 12, 2023, 11:22:53 PM",
      "body": "Promoting and supporting scam projects in bitcointalk is not encouraged by this forum. Though scams don't moderate on this forum but members can with enough proof. I saw 1xbit runs their campaign for long time and many forum members promotes that by wearing signatures. I don't know how they manage to run the campaign for so long but it is good that now they are gone. As a member of the forum we should take the responsibility of what we promote.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "loopes",
      "created_time": "June 13, 2023, 12:07:12 AM",
      "body": "Quote from: Alisha-k on June 12, 2023, 10:41:47 PMQuote from: bananaunana on June 11, 2023, 03:25:18 PMWearing a Signature of a scamsite will result in negative trust on our accountYes, wearing a Signature of a scamsite will result in negative DT trust entry for certain members promoting it, rightfully so. Because endorsing such a scamsite can lead to people falling victim to such a scamsite.  this days, we have just very few persons who have human sympathy and are not willing to compromise their dignity and self respect for money, asides this, everyone's looking out for their pocket, In as much as the campaign's willing to pay, the too are willing to bag the money without thinking of the effect their review would have on the next person.Not gonna lie, regarding to self respect is personal matter. I do not want to get into it. But the some annoying things are if you promot scam then you can not join to some signature campaign that restrict its campaigners have negative trust. beside that, your promotion scam will potentially become a loss for everyone else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}