{
  "id": "topic_5409766",
  "title": "325btc",
  "author": "325btc",
  "created_time": "August 13, 2022, 04:25:14 PM",
  "content": "Everyday we wake up and i ask is btc long or short.Nowdays this is biggest question and most important one We wake up morning we ask is the day gona be LONG or SHORT day Many people asking thus everyday will be short or long and how short or how long will be long or short.Before we go to bed we think isit going to be short or long if we leave position open for the night.So yeah.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409766",
  "comments": [
    {
      "author": "Raflesia",
      "created_time": "August 13, 2022, 04:54:10 PM",
      "body": "Why should you bother with this?When you ask him every day why don't you do your research whether this will be long or short at least with this you can find out even though it's just a basic idea and maybe it's still speculation.One thing is for sure when you know then what? if it's long you'll regret not following it and if it's short do you regret being in it too?Decide for yourself because when you ask questions every day without any clarity, it will only make you dizzy. enter btc when you are sure you are there and stop now if you are not sure because if you continue it will only hurt yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "August 13, 2022, 05:42:18 PM",
      "body": "You are talking about \"Day traders\" and speculators.... not true supporters of the Satoshi vision. The people that wants Bitcoin to succeed in the long-term..are those people who wants to see less volatility and a more stable Bitcoin price...so that it can be used as a currency and not just as a commodity.  I do not wake up with the cellphone in hand.. to see what the Bitcoin price is, because I do not care.... I want to see Bitcoin adoption increase and I want people to use it as a currency. (That will push the Bitcoin price to much higher prices in the long-term future)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "August 13, 2022, 05:59:18 PM",
      "body": "There is no need to think about it to such extreme level and with deep thoughts every morning to ruin it. Lolz. Bitcoin is crazy ride with guaranteed returns over the time. However, it takes lot of patience to keep up with time and that roller coaster.  You can not keep thinking about it like this, or it will make to your nerves and you may end up selling bitcoin in a loss. Just keep pushing the balance of your wallet upwards and fiat value will surely rise up sooner or later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "August 13, 2022, 11:16:27 PM",
      "body": "Most people? I don't think that's true.325btc, you should do a simple survey here on the forum or in your local area and find out for yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "samcrypto",
      "created_time": "August 13, 2022, 11:25:51 PM",
      "body": "There’s a reason behind this, its either you are trap on top of you are so excited to take profit which is very common if you are into trading especially with the newbies. We are just futuristic which is part of being human, but if you do this out of panic and depression, that’s a bad habit and you really need to seek help because thinking too much about the market might also affect your mindset and behavior.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "August 14, 2022, 03:56:47 AM",
      "body": "You'd be asking this if you were shorting Bitcoin or you're basically a newbie trader who needs to look at how much their investment lost or grew, which is dumb. It's like min-maxing to an extreme degree, to the point that even if you profit, it isn't worth it (not to mention you might not even profit that often). Even people who short probably don't overdo it. Not to mention doing it like that tend to create panic moves even though the price decreased by only 1-3% or so, you'd sell it and then buy again at a higher price, inevitably lowering the initial investment you had bit by bit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasisog",
      "created_time": "August 14, 2022, 02:17:04 PM",
      "body": "It's fine to monitor the current value of your investment but you don't have to do it from time to time because you will only be stressing out yourself. During the bearish season, it's advisable to purchase and accumulate Bitcoin because of its low price but it would be better to hold it in the long run so if you will always check on its value, it might affect you emotionally because the market is too volatile. Have brave and strong hands if you're investing in crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oceat",
      "created_time": "August 14, 2022, 04:05:08 PM",
      "body": "Somehow for over 10 years long Bitcoin is still surviving despite of them saying Bitcoin is dead everytime when there's a bear market or correction. Bitcoin needs the right people those who can still hold without a doubt and not those who only came after just for the profit but not for the usage of it.Yes, everyone can trade what currency they like but Bitcoin is not just like that it could be an asset or as a currency. And if you are too bothered about the volatility of Bitcoin price that keeps moving, I think you should change the way how you perceived Bitcoin because there are things that are out of our control.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pealr12",
      "created_time": "August 14, 2022, 04:07:26 PM",
      "body": "Quote from: 325btc on August 13, 2022, 04:25:14 PMEveryday we wake up and i ask is btc long or short.Nowdays this is biggest question and most important one We wake up morning we ask is the day gona be LONG or SHORT day Many people asking thus everyday will be short or long and how short or how long will be long or short.Before we go to bed we think isit going to be short or long if we leave position open for the night.So yeah.If you are a futures trader this can be a problem for you, not knowing if to long or short btc and from your post you seem to lack the knowledge to trade futures, why stress yourself in area you have no idea instead to just hold your coins! market is fluctuating a lot which makes it difficult to know which direction it will go.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "August 14, 2022, 04:29:28 PM",
      "body": "This only matters to the day traders and those who have a huge stake in bitcoin and crypto, but not so much for the regular folks like us who just invested into bitcoin and kinda forget about it on our day-to-day lives since we have other jobs and hustles to do in order to make money. If bulk of your finances depend on crypto, perhaps you'll always be thinking what kind of trading strategy would you be doing every day. It is a different scenario when you're only investing in hopes of getting huge profits in the future, and no plans of going full time into crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "August 14, 2022, 05:14:33 PM",
      "body": "Hodlers don't depend on anything because it's not all about the day-to-day basis of what you're explaining. As a trader, that is what you're talking about. But it's not just all about asking a simple question if you should short or long because if you're doing that, you're easy to be tricked by the person you're asking.It's better to learn trading on your own and don't be dependent on others as what you're trying to say about knowing if it's gonna be a short day or long day as if you're trading in futures.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jemzx00",
      "created_time": "August 14, 2022, 05:27:16 PM",
      "body": "This doesn't really apply to most bitcoin holders or even other crypto holders as only day traders who can only relate to this. Also, even most traders doesn't really check whether it's long or short during this time as the market are currently stable as of now and we haven't seen any sudden big changes. It is not best to assume that what you are feeling and experiencing happens to the most of us as not everyone trades daily. It is also good not to overthink whether the price is long or short right now since the market is currently stable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "August 14, 2022, 05:32:10 PM",
      "body": "I don't know, but not defining your feelings while trading is a dangerous behavior, and if you end up making profits, it will go to address the negative psychological impact of tracking the bitcoin price continuously.Stay away from the price and the charts, take a break and build a solid trading strategy, then all psychological, medium and short-term variables will not have an effect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "August 14, 2022, 07:23:12 PM",
      "body": "I think people should obsess over the price less, and this applies to most common categories. If you're a long-term investor, you shouldn't be bothered with short-term fluctuations at all, and even a bear market for half a year shouldn't bother you because you can just wait it out. If you're a trader, you shouldn't care about the price per se and should learn to make use of regular daily volatility to profit from these minor changes. If you believe in Bitcoin as money, you shouldn't check the price unless right before thinking whether to pay with fiat or with Bitcoin. I personally check the price once in a few days, and that's just to see how Bitcoin is doing but I don't have much of an emotional reaction to it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "August 14, 2022, 08:01:10 PM",
      "body": "I no longer check the price of Bitcoin every day. Setting long and short trading positions will definitely leave the OP feeling very anxious. Its risky business, a far more stress free play is to just Buy the Dips and DCA.The majority of us as commented above are not tied into what the market is doing, it mattersonly to the traders and speculators and can create a lot of stress.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lixer",
      "created_time": "August 14, 2022, 08:12:33 PM",
      "body": "Quote from: Kakmakr on August 13, 2022, 05:42:18 PMYou are talking about \"Day traders\" and speculators.... not true supporters of the Satoshi vision. The people that wants Bitcoin to succeed in the long-term..are those people who wants to see less volatility and a more stable Bitcoin price...so that it can be used as a currency and not just as a commodity.  I do not wake up with the cellphone in hand.. to see what the Bitcoin price is, because I do not care.... I want to see Bitcoin adoption increase and I want people to use it as a currency. (That will push the Bitcoin price to much higher prices in the long-term future)  I think that traders and speculators are still supporters because they buy btc and they waste some of their precious time to speculate about btc. This still helps btc to succeed. Btc is built to be highly volatile so wanting to see the volatility go down may seem to be impossible.If you are not like them (traders and speculators) but you are only looking forward to use your bitcoin as a payment method for your business then volatility should not be a hindrance. Look at different companies, shops and people that simply use btc for daily use. I think they rarely complain but are already used to the way btc is created. I thought you don't care about the price? But your last sentence tells that you want the price to go higher.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheNineClub",
      "created_time": "August 14, 2022, 08:25:45 PM",
      "body": "I doubt most people think like that. Some are in this for a longer period of time, and the day to day fluctuations mean little. Sure, it can be an issue for day traders, but honestly, that's not what crypto is about and how it was concived. To some it's a game, to some it's a project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "August 14, 2022, 08:56:49 PM",
      "body": "Op you don't get to bother on long or short for bitcoin, the market is not really stable now. The price last week has been up and down trading from $21k to $24k and swinging between the price. This isn't a sure price to rely on for short or long but is better to trade with caution. Don't invest what you can not bear to lose this is the usual trading advise as the speculation is not looking one direction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alisha-k",
      "created_time": "August 14, 2022, 09:14:28 PM",
      "body": "Getting bothered about Bitcoin been long or short each day should be a case of concern for day traders. For long term investors the only care about holding and consistently holding till the bull market resumes. Getting worried about daily candle can stir up high blood pressure because the trend isn't well defined at the moment as such prices will continually stay so inconsistent",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}