{
  "id": "topic_5461182",
  "title": "Alik Bahshi",
  "author": "Alik Bahshi",
  "created_time": "July 27, 2023, 08:11:21 AMLast edit: July 27, 2023, 10:07:39 AM by Alik Bahshi",
  "content": "Алик БахшиО самом гуманном суде в Мире       В России все знают правду о самом гуманном и самом справедливом суде в Мире (https://www.youtube.com/watch?v=9F12xeuTZuE), так вот, в России объявили в розыск судью Международного Уголовного Суда, выдавшего ордер на арест Путина и детского омбудсмена Марии Львовой-Беловой. В ответ следственный комитет России возбудил уголовные дела против судьи Международного уголовного суда Томоко Аканэ и прокурора Карима Ахмада Хана о привлечении заведомо невиновного Путина к уголовной ответственности и приготовлении к нападению на представителя иностранного государства, пользующегося международной защитой.    Зная наперёд, что самым главным лицом во всей судебной системы России является её президент, в подчинении которого находятся рыцари плаща и кинжала, можно с большой вероятностью ожидать, что Томоко Аканэ и Карим Ахмат Хан предстанут, в случае их похищения, перед Басманным судом в Москве или подвергнутся воздействию «Новичка». Короче, я бы ломанного гроша не дал за их судьбу. Единственное, что можно им посоветовать, это чтобы Аканэ и Карим хранили свои трусы в надёжном сейфе. (1)  1.   Судьба и трусы. https://alikbahshi.livejournal.com/65370.html    27.07.2023",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461182",
  "comments": [
    {
      "author": "bonfire66",
      "created_time": "July 28, 2023, 11:13:14 AM",
      "body": "Коллега! Вы совершили распространенную ошибку!Прежде того, как предоставить Российский суд как самый гуманный суд в мире следовало было бы привести аргумены в защиту ваших слов. Статистические данные, например, которые об этом свидетельствуют.Однако, все, похоже наоборот. По количеству обращений в ЕСПЧ за последние примено 30 лет, то есть, с момента своего современного сущестования Россия лидирует среди ВСЕХ стран мира. То есть, этот факт  однозначно указывает, что Российский суд как раз является САМЫМ негуманным судом в мире. Особенно если учесть количество случаев НЕИСПОЛНЕНИЯ решений ЕСПЧ в России. Например, А. Навальному была ГАРАНТИРОВАНА свобода, если он вернется в Россию из Германии после его отравления. Однако его тут же арестовали. Как-то так... увы... все грустно...  Qui pro Quo - только после того, как Россия освободит Навального, признает его арест незаконным и привлечет к ответсвенности лиц, виновных в данном злодеянии, только после этого МУС выдаст Карим Ахмата Хана в руки \"самого справедливого\" Российского правосудия.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Malletyou",
      "created_time": "November 24, 2023, 10:06:19 AM",
      "body": "Точно гуманный, насильников, убийц и людоедов амнистирует с войны, полный трындец. Им либо сдохнуть на поле боя либо в тюрьме гнить.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EdinboroSc",
      "created_time": "December 05, 2023, 10:24:55 AM",
      "body": "Шиза в госдуре и кремле не знает границ - уже и баб зеков хотят освобождать раньше.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "December 28, 2023, 06:13:39 PM",
      "body": "Quote from: malayacheremsha on December 28, 2023, 11:55:40 AMВот вот, а мобилизованные сидеть в окопах будут еще очень долго, государство людей за скот держитДа, нацистский киевский режим уже почти два года держит мобилизованных украинцев за скот.Это правда, и это очень печально Но, с другой то стороны ... а так ли сильно он в этом не прав то?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "leonello",
      "created_time": "December 29, 2023, 06:14:56 AM",
      "body": "Quote from: Snork1979 on December 28, 2023, 06:13:39 PMQuote from: malayacheremsha on December 28, 2023, 11:55:40 AMВот вот, а мобилизованные сидеть в окопах будут еще очень долго, государство людей за скот держитДа, нацистский киевский режим уже почти два года держит мобилизованных украинцев за скот.Там сейчас с подачи клоуна очень интересный закон готовится. Тотальная мобилка всех и вся. Ухилянты-релоканты тоже походу под раздачу попадут (привет вонючке  ).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "amantmaitresse",
      "created_time": "January 05, 2024, 11:09:01 AM",
      "body": "Quote from: Snork1979 on December 28, 2023, 06:13:39 PMQuote from: malayacheremsha on December 28, 2023, 11:55:40 AMВот вот, а мобилизованные сидеть в окопах будут еще очень долго, государство людей за скот держитДа, нацистский киевский режим уже почти два года держит мобилизованных украинцев за скот.Это правда, и это очень печально Но, с другой то стороны ... а так ли сильно он в этом не прав то? Пойми одно, если в рф идут как на убой люди - то значит, что они рабы или попросту глупые и покорные. А в Украине сопротивляются, бьются за себя, это о чем говорит? Что менталитет там не рабский и люди могут отстаивать свои взгляды, не терпилы как в России.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "leonello",
      "created_time": "January 06, 2024, 06:48:13 AM",
      "body": "Quote from: amantmaitresse on January 05, 2024, 11:09:01 AMQuote from: Snork1979 on December 28, 2023, 06:13:39 PMQuote from: malayacheremsha on December 28, 2023, 11:55:40 AMВот вот, а мобилизованные сидеть в окопах будут еще очень долго, государство людей за скот держитДа, нацистский киевский режим уже почти два года держит мобилизованных украинцев за скот.Это правда, и это очень печально Но, с другой то стороны ... а так ли сильно он в этом не прав то? Пойми одно, если в рф идут как на убой люди - то значит, что они рабы или попросту глупые и покорные. А в Украине сопротивляются, бьются за себя, это о чем говорит? Что менталитет там не рабский и люди могут отстаивать свои взгляды, не терпилы как в России. Да? А я, ботяра, вижу в многочисленных инторнет-видосиках как громадяне сопротивляются и бьются за себя когда их пакуют сотрудники укровоенкоматов",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "January 06, 2024, 09:04:03 AM",
      "body": "Quote from: leonello on January 06, 2024, 06:48:13 AMДа? А я, ботяра, вижу в многочисленных инторнет-видосиках как громадяне сопротивляются и бьются за себя когда их пакуют сотрудники укровоенкоматов  Так наш рогуля именно про это и говорит.У них же повесточка недавно сменилась на 180 градусов.Теперь у них те укры, которые попали в ВСУ и добровольно пошли на удобрения - лохи и тупой скот.А те, которые бегают от военкомов и шкерятся у пшеков или у мамки под юбкой - \"гордые люди, которые отстаивают свои взгляды\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "leonello",
      "created_time": "January 06, 2024, 09:19:01 AM",
      "body": "Quote from: Snork1979 on January 06, 2024, 09:04:03 AMQuote from: leonello on January 06, 2024, 06:48:13 AMДа? А я, ботяра, вижу в многочисленных инторнет-видосиках как громадяне сопротивляются и бьются за себя когда их пакуют сотрудники укровоенкоматов  Так наш рогуля именно про это и говорит.У них же повесточка недавно сменилась на 180 градусов.Теперь у них те укры, которые попали в ВСУ и добровольно пошли на удобрения - лохи и тупой скот.А те, которые бегают от военкомов и шкерятся у пшеков или у мамки под юбкой - \"гордые люди, которые отстаивают свои взгляды\" Именно. Достаточно зайти на мой горячо любимый цензор и убедиться какой лютый вой рогулей стоит в темах о мобилизации, когда в других темах активность практически отсутствует, за исключением небольшого количества платных штатных пэрэможников пытающихся выжать эту самую пэрэмогу из чего угодно",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The0ldl_lser",
      "created_time": "January 06, 2024, 04:17:13 PM",
      "body": "^Не знаю как там \"ботяра\", а мне лично идея с маской старика очень понравилась   Главное близко к ТЦКшникам не подходить. Иначе получится что все \"старики\" на одно лицо  https://t.me/voynareal/80804",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BAIROT",
      "created_time": "January 08, 2024, 08:03:28 AM",
      "body": "Вспомнился фильм \"несноный дед\"   А что, хорошую маску одел и пошел, не запалят, главное осанку держать",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}