{
  "id": "topic_5412465",
  "title": "apirone.com",
  "author": "apirone.com",
  "created_time": "September 05, 2022, 12:58:06 PM",
  "content": "Apirone.com is a gateway for crypto payments in Bitcoin, Litecoin, Bitcoin Cash, and Dogecoin.What our service provides:White label crypto processing using APIInvoicesCMS plugins for OpenCart and WooCommerceDonation widgetWe accept all incoming payments absolutely Free.Payouts and mass payments with fixed fees. https://apirone.com/pricingOpen RESTful APITo get started, you do not need to go through tedious registration, KYC, and DOCs, just connect and get to work. Use the payment interface without any restrictions, both in terms of the amount and the number of payments.Our support team is happy to help you.support@apirone.comhttps://apirone.com",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5412465",
  "comments": [
    {
      "author": "apirone.com",
      "created_time": "October 24, 2022, 01:14:42 PM",
      "body": "Updated both plugins:Opencart 2.x, 3.x, 4.x Crypto forwardinghttps://www.opencart.com/index.php?route=marketplace/extension/info&extension_id=43824&filter_search=bitcoinWordPress WooCommerce 5.6 or higherhttps://wordpress.org/plugins/multi-crypto-currency-payment/advanced/Write your wishes and improvements for us.PS: more than 3600+ customers installed our WooCommerce plugin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "October 24, 2022, 07:57:48 PMLast edit: October 29, 2022, 09:12:52 PM by decodx",
      "body": "There are many other payment methods available for merchants to accept Bitcoin. How does your service differ from other, more popular services, such as BitPay, Coinbase or CoinGate? It all comes down to what each individual merchant is looking for in terms of functionality and pricing. Are there any advantages to using your service over the competition?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apirone.com",
      "created_time": "February 20, 2023, 01:00:16 PM",
      "body": "Quote from: decodx on October 24, 2022, 07:57:48 PMThere are many other payment methods available for merchants to accept Bitcoin. How does your service differ from other, more popular services, such as BitPay, Coinbase or CoinGate? It all comes down to what each individual merchant is looking for in terms of functionality and pricing. Are there any advantages to using your service over the competition? 1) Isolated wallet. Your money will not be mixed with others. Also, you transfer coins from the exact address.2) Mass-payments3) Immediately transfer4) no KYC / blocks5) One endpoint for all cryptosAlso, all incoming payments are free of charge for customers and merchants.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apirone.com",
      "created_time": "February 20, 2023, 01:37:23 PM",
      "body": "We started articles for beginners.The first post is [DEV: PHP] Writing code to replenish balances in games and serviceshttps://dev.to/apirone_com/dev-php-writing-code-to-replenish-balances-in-games-and-services-lpk",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "February 20, 2023, 09:35:50 PM",
      "body": "This very amazing that your service has been around since 2017. That's almost 6 years since it's launch, but I just got to know about it only today. I like that part where there is No KYC or blocking of funds. This can be a very strong selling point.I don't know about your marketing strategy, but you might want to try increasing the exposure of your service to potential clients as much as possible. I also looked for your terms of service, but failed to see them. I only saw the Privacy Policy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apirone.com",
      "created_time": "February 27, 2023, 12:34:38 PM",
      "body": "Quote from: Bitcoin_Arena on February 20, 2023, 09:35:50 PMThis very amazing that your service has been around since 2017. That's almost 6 years since it's launch, but I just got to know about it only today. I like that part where there is No KYC or blocking of funds. This can be a very strong selling point.I don't know about your marketing strategy, but you might want to try increasing the exposure of your service to potential clients as much as possible. I also looked for your terms of service but failed to see them. I only saw the Privacy Policy.No KYC or KYB. This service is like Blockchain-As-A-Service.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apirone.com",
      "created_time": "February 27, 2023, 12:45:22 PM",
      "body": "Lesson 2[DEV: PHP] Writing code for payout in cryptocurrencieshttps://dev.to/apirone_com/dev-php-writing-code-for-payout-in-cryptocurrencies-27ohAdvantages:1) mass payouts2) transactions with up to 255 recipients in each3) one-time fixed commission4) instant transfer, without delays and checks5) your coins are isolated from other customers",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apirone.com",
      "created_time": "March 06, 2023, 08:19:28 AM",
      "body": "Lesson 3[DEV: PHP] Cryptocurrency transferring from selected addresseshttps://dev.to/apirone_com/dev-php-cryptocurrency-transferring-from-selected-addresses-195nCryptocurrencies are pseudo-anonymous means of payment. On the one hand, you do not need to pass verification to create a wallet, and on the other hand, you can determine the source of funds from the transaction chain. Exchangers do not want to deal with “dirty” coins, so they conduct KYC processes and check each transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "March 07, 2023, 12:58:14 PM",
      "body": "Quote from: apirone.com on February 27, 2023, 12:34:38 PMNo KYC or KYB. This service is like Blockchain-As-A-Service.I understand all this and I am fully behind you.Since it's a service, the issue about terms of service should not be taken lightly. In case of a legal dispute, the terms of will save you lots of trouble. I hope you know this. Things can happen so fast in the digital world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apirone.com",
      "created_time": "March 15, 2023, 11:32:50 AM",
      "body": "[DEV: PHP] How to create and process an invoice in cryptocurrencyIf you do not want to handle payments at your site, check facts of under-/overpayment, then you just need to use a ready-made decision for creating invoices on the side of a processing service.https://dev.to/apirone_com/dev-php-how-to-create-and-process-an-invoice-in-cryptocurrency-2e0n",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apirone.com",
      "created_time": "April 03, 2023, 08:23:02 AM",
      "body": "For your convenience, we have expanded the possibilities of the service commission. Now, we have two tariff plans for you to choose from:1) Fixed commission, which does not depend on the amount of the transfer and the number of transactions in the transfer.2) Percentage calculation of the commission (1% of the transfer amount).Switch to the tariff you need at any time, and calculate your benefit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apirone.com",
      "created_time": "April 06, 2023, 07:54:11 AM",
      "body": "Top 70 Crypto Payment Services And Gatewayhttps://dezentralizedfinance.com/top-70-crypto-payment-services-and-gateway-terminals#cryptocurrency #payments #blockchains #security #money #estores #apirone",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apirone.com",
      "created_time": "May 02, 2023, 07:02:01 AM",
      "body": "Currently, the Bitcoin mempool has 200k+ unconfirmed transactions, the network fee is too high for most transactions and they are stuck. But don't worry, nobody loses Bitcoins. We permanently re-broadcast all our transactions so the transactions will be confirmed sooner or later.Also, you can choose high fees strategies or apply a custom network fee.https://apirone.com/docs/fee/#network-fee",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apirone.com",
      "created_time": "May 29, 2023, 08:36:28 AM",
      "body": "FAQ: Where is my BTC?https://medium.com/@apirone/faq-where-is-my-btc-946da7bd5f6e",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apirone.com",
      "created_time": "August 01, 2023, 12:57:40 PM",
      "body": "Apirone is one of the few companies that adopted the Taproot protocol for transfers and payment forwarding. Taproot or Bech32m address is the most recent and advanced Bitcoin address format. Taproot introduces more advanced security, privacy, flexibility, and scaling to Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DonateAnyCrypto",
      "created_time": "August 02, 2023, 08:45:41 PM",
      "body": "Quote from: apirone.com on August 01, 2023, 12:57:40 PMApirone is one of the few companies that adopted the Taproot protocol for transfers and payment forwarding. Taproot or Bech32m address is the most recent and advanced Bitcoin address format. Taproot introduces more advanced security, privacy, flexibility, and scaling to Bitcoin.That's cool, but let's be honest, we 'all are waiting for Ethereum support",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apirone.com",
      "created_time": "August 09, 2023, 12:21:40 PM",
      "body": "We revealed a big update. Added new widgets:payment buttonpayment formSDKUpdated donation widgetPublished new use cases and F.A.Q.https://apirone.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "August 13, 2023, 10:29:48 PM",
      "body": "Quote from: DonateAnyCrypto on August 02, 2023, 08:45:41 PMThat's cool, but let's be honest, we 'all are waiting for Ethereum support Maybe because of the not so friendly transaction fees on the ethereum network?For now, they seem to be supporting on Bitcoin and its forks. Maybe with time they will expand to other networks like TRON to support stablecoins like USDT TRC20 that will protect merchants against price big price fluctuations",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apirone.com",
      "created_time": "October 04, 2023, 07:58:30 AM",
      "body": "Updated OpenCart / OcStore and WP WooCommerce plugins:https://www.opencart.com/index.php?route=marketplace/extension/info&extension_id=43824&filter_search=bitcoinhttps://wordpress.org/plugins/multi-crypto-currency-payment/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}