{
  "id": "topic_5439805",
  "title": "codepleb",
  "author": "codepleb",
  "created_time": "February 14, 2023, 08:05:29 AM",
  "content": "Hello CommunityI wanted to tell you about a DCA (Dollar Cost Averaging) bot that I coded, for the crypto exchange Kraken.Features:Buys 0.0001 BTC every couple seconds/minutes/hours.Spreads all buys over the span of a month (when a new fiat deposit is expected, it should have used all fiat right before).Buys hundreds/thousands/millions of times per month (depending on the amount of fiat you deposit).Automatic adjustments after each buy (what is the price of bitcoin now, how many more buys can I do until the end of the month, when should the next buy take place?). If the bitcoin price drops by 50%, you will not run out of fiat earlier! You will just buy less frequently.Automatic withdrawals to your hardware wallet! Either monthly or when reaching a certain bitcoin-stacking target on Kraken.All open source and no compiled code. You can read it yourself.Can be used with dockerStep by step video manuals included!AND THE MOST IMPORTANT ONE:The fees do not stack! Kraken has very low fees (0.26% without any trading-tier, for each transaction, which means the amount of transactions does not matter). Investing $500 each month will only cost you ~$1.30. A withdrawal to your hardware wallet will be as cheap as ~$0.07.I use this bot myself since several months, probably close to a year.Check it out here:https://github.com/raphaellueckl/kraken-dcaAnd yes, I'm new to this forum.  Read a lot here and there, but never took part in discussions.GreetingsCodepleb",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5439805",
  "comments": [
    {
      "author": "hugeblack",
      "created_time": "February 18, 2023, 04:49:53 PM",
      "body": "It's good that you made it open source, but why just Kraken? Does it work with different platforms? Or does it only work with that platform?Is the time interval an hour as a maximum, or can many hours be added to represent a week, or once a month?Also, in the event of any technical error, is it possible to withdraw to an address that is not in the white list, or can you add any address to withdraw.I will give it a try if it works with OKX.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "codepleb",
      "created_time": "February 19, 2023, 07:43:50 PM",
      "body": "Quote from: hugeblack on February 18, 2023, 04:49:53 PMIt's good that you made it open source, but why just Kraken? Does it work with different platforms? Or does it only work with that platform?It only works for kraken. Doing that for other exchanges would be best achieved by writing another bot, as every exchange has different APIs to talk to.Quote from: hugeblack on February 18, 2023, 04:49:53 PMIs the time interval an hour as a maximum, or can many hours be added to represent a week, or once a month?One hour is not any time interval defined by me? I think there is a misunderstanding: You deposit, say, 500 dollars each month. The bot will notice that you did a deposit and reserves time for another month in which it will buy bitcoin until that time is over. It will always buy 0.0001 bitcoin (if you don't adapt this value). At the current price (24'700$) it could execute 204 times the 0.0001 bitcoin buy order. It will spread those buys equally over the next month, so that you run out of money until that month has ended. Since the price changes all the time, it will permanently adjust itself though, so that you don't run out of fiat too fast or too late. The highest prio is to have 0 fiat in your account by the end of that timespan (a month). And it will permanently adjust itself to the current bitcoin price after each executed buy order.Say you deposit on the 15th of a month, it will use up all your fiat until the 15th of the next month!Quote from: hugeblack on February 18, 2023, 04:49:53 PMAlso, in the event of any technical error, is it possible to withdraw to an address that is not in the white list, or can you add any address to withdraw.No, the bot cannot withdraw to random bitcoin addresses. You explicitly need to define those in your kraken account and give an alias to them. The bot itself will only know the alias, not the actual address. The bot has no idea where the bitcoins will be sent to.Example, on kraken you will need to add your bitcoin withdrawal addresses combined with aliases that might look like this:Alias: my-ledgerAddress: bc1qiowrjovglnlsgfnAlias: metamask-hotwalletAddress: bc1jhadashjdkjashdGreetings!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "February 21, 2023, 02:39:33 PM",
      "body": "Quote from: codepleb on February 19, 2023, 07:43:50 PMYou deposit, say, 500 dollars each month. The bot will notice that you did a deposit and reserves time for another month in which it will buy bitcoin until that time is over. It will always buy 0.0001 bitcoin (if you don't adapt this value). At the current price (24'700$) it could execute 204 times the 0.0001 bitcoin buy order. It will spread those buys equally over the next month, so that you run out of money until that month has ended.But why? What's the point of making 204 small buys instead of just buying $500 worth of Bitcoin at once?DCA is only worth it if the price drops. In that case, you'll end up with more Bitcoin. But if the price goes up, you would have been better off buying in a lump sum. And even if you buy $500 \"lump sum\", it's still considered DCA if you do it every month.Because Bitcoin goes up on average (why else would you invest in it), I believe your DCA-method will result in a (slightly) smaller Bitcoin stash than if you'd buy $500 worth of Bitcoin once a month.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "codepleb",
      "created_time": "February 21, 2023, 03:35:36 PM",
      "body": "Quote from: LoyceV on February 21, 2023, 02:39:33 PMBut why? What's the point of making 204 small buys instead of just buying $500 worth of Bitcoin at once?DCA is only worth it if the price drops. In that case, you'll end up with more Bitcoin. But if the price goes up, you would have been better off buying in a lump sum. And even if you buy $500 \"lump sum\", it's still considered DCA if you do it every month.Because Bitcoin goes up on average (why else would you invest in it), I believe your DCA-method will result in a (slightly) smaller Bitcoin stash than if you'd buy $500 worth of Bitcoin once a month.It takes away the stress, as you no longer time the market, but buy as often as possible at all prices. That's the beauty of DCA.  If you try to time the market, history shows that your performance will be worse on average. Are you sure that you will buy every month, using your strategy? Or will you wait because tomorrow, the dip will be even bigger (potentially)?I understand your theory, but I doubt that your psychology will not interfere with it.And what if you buy 500$ at the beginning of the month and the day after bitcoin is at 30% discount... Won't you pull your hair, because you could have waited just one more day?Doing DCA completely takes out all stress for me. Price dips: My stash gets less valuable, but I buy bitcoin at cheaper prices all the time. Price moons: My stash gets more valuable, but my buys get less frequent due to them becoming more expensive.I literally cannot lose with this strategy. Since I'm doing DCA, I notice how disconnected I can be from all the volatility and go on live my life in peace.But that's an individual decision, the need differs between people. I absolutely love it!Cheers!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "February 21, 2023, 03:56:28 PM",
      "body": "Quote from: codepleb on February 21, 2023, 03:35:36 PMIt takes away the stress, as you no longer time the market, but buy as often as possible at all prices.My stress-free method of doing that is buying/selling at fixed days, either monthly or weekly.QuoteAre you sure that you will buy every month, using your strategy?Yes.QuoteI understand your theory, but I doubt that your psychology will not interfere with it.I've learned a long time ago that I can't time the market.QuoteAnd what if you buy 500$ at the beginning of the month and the day after bitcoin is at 30% discount... Won't you pull your hair, because you could have waited just one more day?Yes, it happens. But it happens in the other direction too.QuoteI literally cannot lose with this strategy.Sure you can. If Bitcoin goes up, you could have had more by buying sooner*. If it goes down, your purchasing power goes down.QuoteI absolutely love it!That's what matters. If it works for you, keep doing it * Hypothetical, of course. The same \"problem\" exists if you spend Bitcoin, and it increases in value afterwards. But as I read on the Wall Observer a while ago: \"That's the problem we want to have\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "codepleb",
      "created_time": "March 29, 2023, 08:08:45 AM",
      "body": "New Update:- Made the code more error proof (some errors were not catched and could shutdown the bot).- Made checking cycle from 10 Minutes to 1 Minute (still customizable, if you want to adapt this value).How to update:https://github.com/raphaellueckl/kraken-dca#updatesDon't forget to join the discord!  https://discord.gg/TARdDh4hN8",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "March 30, 2023, 07:20:01 AM",
      "body": "Is volatility should be considered when you plan DCA? In DCA, usually people set amount, frequency. No matter what the price is, they will buy in the fixed period and with the exact amount. When you are buying frequently adjusting with the volatility, you are trying to get the benefit of a dump etc.Well, the same can be done through your bot too and it's helpful for people who don't want to take the stress of buying manually at their fixed period.Do you have plan to make it available for Binance? Maybe I would give it a try for different purposes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "codepleb",
      "created_time": "April 02, 2023, 08:05:20 PM",
      "body": "Quote from: Little Mouse on March 30, 2023, 07:20:01 AMIs volatility should be considered when you plan DCA? In DCA, usually people set amount, frequency. No matter what the price is, they will buy in the fixed period and with the exact amount. When you are buying frequently adjusting with the volatility, you are trying to get the benefit of a dump etc.Well, the same can be done through your bot too and it's helpful for people who don't want to take the stress of buying manually at their fixed period.Do you have plan to make it available for Binance? Maybe I would give it a try for different purposes.Not really. I wrote this bot for me, but thought it would be of use for others too, as this is a much requested feature by a lot of people. I don't need to buy bitcoin on several exchange. One exchange with good fees is totally fine for me. It's not really a risk either, as I withdraw it at least once a month (can be adjusted too). I would obviously swap it for another exchange, if kraken would go down or if they would increase fees tremendously, but at the moment they are amongst the cheapest permanent fees over all exchanges.Cheerscodepleb",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "April 05, 2023, 08:36:13 AM",
      "body": "Quote from: Maxre on April 04, 2023, 05:50:52 PMI don't think that most people will trust kraken cause it has bad reputation and it's not working good.Kraken works fine and I have no reason not to trust them. Your claim needs more convincing evidence than just stating it as if it's a fact.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "codepleb",
      "created_time": "April 05, 2023, 11:09:47 AM",
      "body": "Quote from: Maxre on April 04, 2023, 05:50:52 PMI don't think that most people will trust kraken cause it has bad reputation and it's not working good. So I I'll say that You should make This DCA bot for Kucoin or Bitget and as people like these an there are a lot of funds that are on Bitget. And also these two exchanges have their own Bots and they ate working fine so I think if really someone wants to run Bit than they can go to the Kucoin Bot. Not trusting kraken but trusting kucoin instead? That's exactly my humor. :'DIf you don't trust kraken, the only thing left for you are DEX, as there isn't an exchange with a security as prooven as kraken to this day. Not a single hack. Unlike binance, unlike kucoin, unlike [name any exchange older than 3 years].",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "codepleb",
      "created_time": "June 05, 2023, 03:15:24 PM",
      "body": "Catch-All-Errors Update:- Bot should no longer stop upon networking issues or Kraken API being down.- Added support for AUD currency.How to update:https://github.com/raphaellueckl/kraken-dca#updatesDon't forget to join the discord!  https://discord.gg/TARdDh4hN8",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zoomic",
      "created_time": "June 06, 2023, 10:53:54 AMLast edit: June 08, 2023, 11:01:08 PM by Zoomic",
      "body": "Quote from: codepleb on February 21, 2023, 03:35:36 PMQuote from: LoyceV on February 21, 2023, 02:39:33 PMBut why? What's the point of making 204 small buys instead of just buying $500 worth of Bitcoin at once?And what if you buy 500$ at the beginning of the month and the day after bitcoin is at 30% discount... Won't you pull your hair, because you could have waited just one more day?What if the bot bought 0.0001btc for me today and by tomorrow I discover that bitcoin is in 40% discount. Is there a way I will maneuver or stop the bot DCA process and then manually buy with my remaining let's say $450. By the next circle I can re-start with the bot.In other words, the bot should be able to increase the buy amount with respect to percentage discount offered by bitcoin at every given period of time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "June 06, 2023, 01:16:52 PM",
      "body": "Quote from: Zoomic on June 06, 2023, 10:53:54 AMIs there a way I will maneuver or stop the bot DCA process and then manually buy with my remaining let's say $450.Just place a manual order, after that, the bot will be out of funds and can't buy more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "June 06, 2023, 11:21:29 PM",
      "body": "Quote from: codepleb on February 21, 2023, 03:35:36 PMQuote from: LoyceV on February 21, 2023, 02:39:33 PMBut why? What's the point of making 204 small buys instead of just buying $500 worth of Bitcoin at once?DCA is only worth it if the price drops. In that case, you'll end up with more Bitcoin. But if the price goes up, you would have been better off buying in a lump sum. And even if you buy $500 \"lump sum\", it's still considered DCA if you do it every month.Because Bitcoin goes up on average (why else would you invest in it), I believe your DCA-method will result in a (slightly) smaller Bitcoin stash than if you'd buy $500 worth of Bitcoin once a month.It takes away the stress, as you no longer time the market, but buy as often as possible at all prices. That's the beauty of DCA.  If you try to time the market, history shows that your performance will be worse on average. Are you sure that you will buy every month, using your strategy? Or will you wait because tomorrow, the dip will be even bigger (potentially)?I understand your theory, but I doubt that your psychology will not interfere with it.And what if you buy 500$ at the beginning of the month and the day after bitcoin is at 30% discount... Won't you pull your hair, because you could have waited just one more day?Doing DCA completely takes out all stress for me. Price dips: My stash gets less valuable, but I buy bitcoin at cheaper prices all the time. Price moons: My stash gets more valuable, but my buys get less frequent due to them becoming more expensive.I literally cannot lose with this strategy. Since I'm doing DCA, I notice how disconnected I can be from all the volatility and go on live my life in peace.But that's an individual decision, the need differs between people. I absolutely love it!Cheers! It's so nice to see and doing DCA helps you at the same time to take away your stress, I hope everyone who does DCA is like you, anyway, is what you're saying bot really tested? I hope you showed at least a screenshot so that those who see what you are saying will be familiar.Then @hugeblack is right why only kraken? it might that kraken isn't accepted by all countries, or it could be that country will be restricted there? Though there is a video tutorial, I will watch it to be familiarize with those guidelines as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "codepleb",
      "created_time": "September 18, 2023, 08:32:31 PM",
      "body": "Quote from: bettercrypto on June 06, 2023, 11:21:29 PMThen @hugeblack is right why only kraken? it might that kraken isn't accepted by all countries, or it could be that country will be restricted there? Though there is a video tutorial, I will watch it to be familiarize with those guidelines as well. I use kraken and did this project for myself and shared it with others too. I don't see a need to support any other less prooven exchanges as long as kraken is cheap, up and running fine.But feel free to port this to other exchanges.BTW sorry I manually checked this thread. I don't get email notifications. Probably did that on purpose back then.I'm using this bot and didn't abandon it. And I work on it when I see new requirements or bugs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "September 22, 2023, 10:47:12 PM",
      "body": "Quote from: codepleb on September 18, 2023, 08:32:31 PMI use kraken and did this project for myself and shared it with others too. I don't see a need to support any other less prooven exchanges as long as kraken is cheap, up and running fine.I think it will be better to make a similar bot for other exchanges as well. As you're good at programming and you can make those bots for the users of other exchanges in your free time. A lot of members on this forum aren't Kraken users and that's why it's better to make a similar bot for some other famous exchanges that people use. I would also recommend you to add daily and weekly interval option into the bot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "codepleb",
      "created_time": "May 10, 2024, 11:35:25 AM",
      "body": "Quote from: Zoomic on June 06, 2023, 10:53:54 AMIn other words, the bot should be able to increase the buy amount with respect to percentage discount offered by bitcoin at every given period of time.It will not increase the amount of a single buy. It will shorten the time between buys, which basically has output you are desiring.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "codepleb",
      "created_time": "May 10, 2024, 11:58:17 AM",
      "body": "Quote from: SamReomo on September 22, 2023, 10:47:12 PMQuote from: codepleb on September 18, 2023, 08:32:31 PMI use kraken and did this project for myself and shared it with others too. I don't see a need to support any other less prooven exchanges as long as kraken is cheap, up and running fine.I think it will be better to make a similar bot for other exchanges as well. As you're good at programming and you can make those bots for the users of other exchanges in your free time. A lot of members on this forum aren't Kraken users and that's why it's better to make a similar bot for some other famous exchanges that people use. I would also recommend you to add daily and weekly interval option into the bot.I earn absolutely nothing with this bot. I do that completely in my free time. And since I have no use for other exchanges and kraken is pretty well spread over the world, I don't see why I should put in that additional amount of work. It anyways would require creating a separate bot, since a lot of thing in there are specific to kraken.You are free to do that yourself or find someone who does that for you, of course. My code is open source.I wrote this bot for myself and was sure that there would be people thankful for it, so I spread it. If you are not amongst those, that's completely ok, but a lot of people seem to be happy that it exists. As long as this is not a paying job for me, I don't do work that doesn't improve it for myself. I did that for some currencies I don't use and people asked for, but supporting another exchange means hours of additional work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "May 20, 2024, 12:09:22 AM",
      "body": "Quote from: LoyceV on February 21, 2023, 02:39:33 PMQuote from: codepleb on February 19, 2023, 07:43:50 PMYou deposit, say, 500 dollars each month. The bot will notice that you did a deposit and reserves time for another month in which it will buy bitcoin until that time is over. It will always buy 0.0001 bitcoin (if you don't adapt this value). At the current price (24'700$) it could execute 204 times the 0.0001 bitcoin buy order. It will spread those buys equally over the next month, so that you run out of money until that month has ended.But why? What's the point of making 204 small buys instead of just buying $500 worth of Bitcoin at once?DCA is only worth it if the price drops. In that case, you'll end up with more Bitcoin. But if the price goes up, you would have been better off buying in a lump sum. And even if you buy $500 \"lump sum\", it's still considered DCA if you do it every month.Because Bitcoin goes up on average (why else would you invest in it), I believe your DCA-method will result in a (slightly) smaller Bitcoin stash than if you'd buy $500 worth of Bitcoin once a month.I don't think you are understanding the point of DCA.DCA is not \"only worth it if the price drops\". The point of DCA is to take the guesswork out of investing. Instead of trying to pick the best time to buy, you just buy often, potentially at regular intervals. This is exactly what this person built - a bot to DCA often over the course of a month.You could also choose to DCA once a month of course, but the OP built a bot to DCA very often. People can DCA at whatever interval they wish, and this bot allows them to do it at smaller intervals automatically without needed to log in to an exchange constantly. It's a great idea. The only problem I'd have with it is you'd just have to keep track of the cost basis for many many many transactions for tax purposes when you one day sell or spend the bitcoin in the future, so for that reason I certainly wouldn't want to be buying every minute or hour or even day, but some people might not mind that accounting headache.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}