{
  "id": "topic_5476204",
  "title": "bew3lin",
  "author": "bew3lin",
  "created_time": "December 01, 2023, 03:50:21 PM",
  "content": "Я люблю создавать временные проекты, которые после приложения усилий в их продвижение дают годный профит —  ты получаешь интересное коммьюнити, знания, заработок. В общем, с пользой и интересом проводишь время. Двигаешься по своей воле и инициативе.Таких проектов у меня было достаточно, с лучших я получала необходимый результат.Так в чем вопрос?После старта держусь, получаю результаты, а в какой-то момент останавливаюсь с мыслями, что уже не так волнительно даже, ну не тянет, а там очевидно еще есть проход дальше, но что за ним? И с этими мыслями бегу создавать что-то новое, а старое забрасываю, потому что неактуально для меня и скучно. В итоге старое прогорает как недовыжатый лимон, возвращаться к нему может грозить потерей времени, пока новое вовсю живет свой период.Неужели действительно есть смысл просто создавать кучу всего возможного, и однажды что-то из этого зацепит надолго, или достаточно просто взять все в руки и через силу вкладываться в одну степь, чтобы выжать из этого в разы больше? И как к этому поддерживать интерес тогда?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476204",
  "comments": [
    {
      "author": "LevDriftwood",
      "created_time": "December 01, 2023, 06:08:33 PM",
      "body": "Заниматься разными вещами всегда хорошо, не попробуешь - не узнаешь.Quote from: bew3lin on December 01, 2023, 03:50:21 PMНеужели действительно есть смысл просто создавать кучу всего возможного, и однажды что-то из этого зацепит надолго, или достаточно просто взять все в руки и через силу вкладываться в одну степь, чтобы выжать из этого в разы больше? И как к этому поддерживать интерес тогда? И то, и другое. Заниматься разными вещами всегда хорошо, не попробуешь - не узнаешь. Но и дисциплинировать себя нужно, дела стоит доводить до конца.Как поддерживать интерес?К любому делу нужно подходить играюче, даже занимаясь однообразным делом можно найти свой \"кайф\".Работаешь дворником? Запульни метлой бутклу в урну, подметай в танце, попробуй делать на время и побивать собственные рекорды и тдНайти такие веселые моменты можно в любом, даже самом скучном, рутинном деле.а по поводу \"что там дальше?\" - никто не знает, идти надо туда где страшно - дух исследования",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fesxx",
      "created_time": "December 06, 2023, 12:29:08 PM",
      "body": "Quote from: bew3lin on December 01, 2023, 03:50:21 PMЯ люблю создавать временные проекты, которые после приложения усилий в их продвижение дают годный профит —  ты получаешь интересное коммьюнити, знания, заработок. В общем, с пользой и интересом проводишь время. Двигаешься по своей воле и инициативе.Таких проектов у меня было достаточно, с лучших я получала необходимый результат.Так в чем вопрос?После старта держусь, получаю результаты, а в какой-то момент останавливаюсь с мыслями, что уже не так волнительно даже, ну не тянет, а там очевидно еще есть проход дальше, но что за ним? И с этими мыслями бегу создавать что-то новое, а старое забрасываю, потому что неактуально для меня и скучно. В итоге старое прогорает как недовыжатый лимон, возвращаться к нему может грозить потерей времени, пока новое вовсю живет свой период.Неужели действительно есть смысл просто создавать кучу всего возможного, и однажды что-то из этого зацепит надолго, или достаточно просто взять все в руки и через силу вкладываться в одну степь, чтобы выжать из этого в разы больше? И как к этому поддерживать интерес тогда? По моему мнению, это весьма стандартный взгляд на мир предпринимателя, если взглянуть на любой проект не с стороны экономической составляющей, а со стороны того что любая предпринимательская деятельность решает какие-то проблемы, то предприниматель это человек которому хватает энергии решать чьи то вопросы, а работать над одной и той же задачей на протяжение долгого времени мало кому понравится. Другое дело если человек главным ставит заработок, то нет разницы где ты будешь зарабатывать деньги, главное, что бы их было побольше, а работы меньше. Таким образам я подвожу к тому, что вы просто являетесь предпринимателем более заинтересованном в решение каких-то проблем, но я бы посоветовал вам перед тем как полностью уходить из проекта, ищите себе замену или продавайте его.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}