{
  "id": "topic_5465818",
  "title": "kriminall",
  "author": "kriminall",
  "created_time": "September 06, 2023, 05:43:53 AM",
  "content": "12 Eylülde iPhone 15 lansmanı yapılacak, tabi sadece iPhone ile değil, diğer apple ürünleri de tanıtılmaya devam edilecek, Apple Watch ultra 2 tanıtımı yapılacak ve bunda 3d baskılı parçalar sayesinde daha hafif bir saatin olmasından konuşuluyor,Gelgelelim bizim için önemli olan kısma, gerçi beni pek ilgilendirmiyor da eminim yine sırada bekleyenler, sabahlayanlar olacaktır, iPhone 15 ve diğer modellerinde apple muhteşem bir yenilik getirmiş, USB-C şarj girişi Şaka değil, bu gerçek 2024 e giriyoruz ve apple böyle bir karar almış, kablo bulma konusunda dert edinenler bu yüzden herhalde iPhone almaz  Diğer yeniliklerini merakla bekliyorum, iPhone 15 Pro modellerinde ise A17 Bionic işlemciye ilk kez yer verilecek, bu anlamda farklı işlemci deneyimi yaşayacak bazı kullanıcılar olacak,Tahmini satış fiyatı ise 899 dolar olacak, 1e1 oranda vergileme geldiğini düşünürsek, baz modelin 46-50k arasında satışa çıkacağını söylüyorlar Kaynak : https://www.haberet.com/teknoloji/iphone-15in-fiyati-ortaya-cikti-iphone-15-yeni-ozellikleri-say-say-bitmiyor-31146",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465818",
  "comments": [
    {
      "author": "Phoenix Anka",
      "created_time": "September 06, 2023, 05:58:13 AM",
      "body": "Fiyat 900 dolar + Türkiye’deki vergiler olursa şu an ihtiyacım yok almam. Bu baz model için geçerli bir de. Pro Max gibi modellere muhtemelen 100 bin civarı fiyat isterler. O paraya ihtiyacım olmayan telefon alacağıma yatırım yaparım, kendi geleceğimi aydınlatmaya çalışırım daha iyi. Telefon ölü yatırım. Parası olan bir çok kişi kullanışlı telefonunu değiştirmeye gerek duymuyor bile. Bir tek bizim insanımızda herhalde bu muhteşem tüketim çılgınlığı alım gücüne kıyasla zirvelerde. Kredi çekip alanlar bile olacak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "September 06, 2023, 12:12:38 PM",
      "body": "Kredi çekip borca girip o yeni iPhonelardan almaya çalışan çok fazla oluyor. Bizim halkımızda böyle bir talep var, statü olarak gördüklerinden sanırsam. Hiç bir zaman telefon değiştirmek için istekli olmadım uzun yıllar kullanırım öyle değiştiririm telefonlarımı. 900 + vergilerle ne güzel yatırımlar yapılır oysa dimi hem de ayılar uyurken, uyuturken. telefonun bir geri dönüşü olsa bir şekilde almaya çalışılır da oda yok gereksiz paralar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silence Scream",
      "created_time": "September 06, 2023, 12:47:34 PM",
      "body": "Gereksiz yatırım bana göre, hatta telefon yatırım değil ancak ihtiyaç olabilir. iPhone ihtiyacım var mı diye sorup evet diyorsanız ve mali tablonuz buna el veriyorsa alabilirsiniz ancak iPhone 13 veya 14 kullanıcısı iseniz Tip C şarj girişi ve renkli kablolar için doğru düzgün bir fark yaratılmamış bir telefona akılsızca böyle yüksek paralar vermek mantıksız.Nitekim, Türkiye’nin ekonomik gücünü burada defalarca yazdık. Gıda enflasyonu konusunda @Gencecikmen hocamız da yeterli bilgileri ekonomi bölümüne yazıyordu. Teknolojik enflasyonu da bir ara araştırırız ancak teknolojik enflasyonun dolar ile doğal orantılı olduğunu düşünüp üstüne bir kat ÖTV eklersek teknolojik cihazlara ihtiyaç olmadıkça değiştirilmemesi gerektiğini düşünüyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "September 06, 2023, 01:33:24 PM",
      "body": "Quote from: kriminall on September 06, 2023, 05:43:53 AMiPhone 15 ve diğer modellerinde apple muhteşem bir yenilik getirmiş, USB-C şarj girişi Şaka değil, bu gerçek 2024 e giriyoruz ve apple böyle bir karar almışType-C şarj girişi Apple’ın isteyerek yaptığı bir değişiklik değildir. Avrupa Parlamentosunun AB ülkelerinde satılacak elektronik cihazlarda Type-C girişini zorunlu hale getiren yasal bir düzenleme çıkardırlar. Apple ipad air5 modelinde zaten Type-C şarj girişini kullanıyordu. Apple lightning kablo kullanması bence tamamen ekonomik bir durum yani pazar yaratmak. Type-C kablolar Lightning kablolardan 85 kat daha hızlı veri transferi sağlıyor. Bu durum bencede çok daha iyi oldu kullandığımız ürünlerin çoğunluğu Type-C uyumlu ve böyle bir standart olması kullanıcılar için oldukça iyi bir gelişme.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silence Scream",
      "created_time": "September 06, 2023, 01:38:28 PM",
      "body": "Quote from: ZekiBeyy on September 06, 2023, 01:33:24 PMQuote from: kriminall on September 06, 2023, 05:43:53 AMiPhone 15 ve diğer modellerinde apple muhteşem bir yenilik getirmiş, USB-C şarj girişi Şaka değil, bu gerçek 2024 e giriyoruz ve apple böyle bir karar almışType-C şarj girişi Apple’ın isteyerek yaptığı bir değişiklik değildir. Avrupa Parlamentosunun AB ülkelerinde satılacak elektronik cihazlarda Type-C girişini zorunlu hale getiren yasal bir düzenleme çıkardırlar. Apple ipad air5 modelinde zaten Type-C şarj girişini kullanıyordu. Apple lightning kablo kullanması bence tamamen ekonomik bir durum yani pazar yaratmak. Type-C kablolar Lightning kablolardan 85 kat daha hızlı veri transferi sağlıyor. Bu durum bencede çok daha iyi oldu kullandığımız ürünlerin çoğunluğu Type-C uyumlu ve böyle bir standart olması kullanıcılar için oldukça iyi bir gelişme.Peki bunun için yeni bir telefon almaya gerek var mı? Ben şahsen bu sebepten dolayı gidip telefon almam. Bir telefon bekliyorsanız yenilik herkesin hakkı. Apple en çok bu yüzden eleştiriliyor zaten. Geçen sene kamera yerleri değişti, ondan önce de öyle bir şeyler oldu. Bu sene de sadece böyle bir değişiklik varsa almak konusunda kimse motive olmaz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "September 06, 2023, 02:20:03 PM",
      "body": "Quote from: Silence Scream on September 06, 2023, 01:38:28 PMQuote from: ZekiBeyy on September 06, 2023, 01:33:24 PMQuote from: kriminall on September 06, 2023, 05:43:53 AMiPhone 15 ve diğer modellerinde apple muhteşem bir yenilik getirmiş, USB-C şarj girişi Şaka değil, bu gerçek 2024 e giriyoruz ve apple böyle bir karar almışType-C şarj girişi Apple’ın isteyerek yaptığı bir değişiklik değildir. Avrupa Parlamentosunun AB ülkelerinde satılacak elektronik cihazlarda Type-C girişini zorunlu hale getiren yasal bir düzenleme çıkardırlar. Apple ipad air5 modelinde zaten Type-C şarj girişini kullanıyordu. Apple lightning kablo kullanması bence tamamen ekonomik bir durum yani pazar yaratmak. Type-C kablolar Lightning kablolardan 85 kat daha hızlı veri transferi sağlıyor. Bu durum bencede çok daha iyi oldu kullandığımız ürünlerin çoğunluğu Type-C uyumlu ve böyle bir standart olması kullanıcılar için oldukça iyi bir gelişme.Peki bunun için yeni bir telefon almaya gerek var mı? Ben şahsen bu sebepten dolayı gidip telefon almam. Bir telefon bekliyorsanız yenilik herkesin hakkı. Apple en çok bu yüzden eleştiriliyor zaten. Geçen sene kamera yerleri değişti, ondan önce de öyle bir şeyler oldu. Bu sene de sadece böyle bir değişiklik varsa almak konusunda kimse motive olmaz.İphone 11'le birlikte toplumda telefonun statüyü belirlediğini sanması saçmalığı büyük oranda ortadan kalktı. 11 çıktıktan sonra hadi yeni çıkanı alalım gibi düşünenlerin sayısı çok azaldı. En azından çevremden gördüğüm şey bu. Uzun zamandır tasarımda bir yenilik gelmiyor ve İphone kullanıcısı da bunun farkında. Mesela gelecek olan ios 17'deki yenilik diye sundukları şeyleri görseniz gülersiniz. Adamlar en ufak şeyi bile çok büyük bir şey yapmışlar gibi sunmaları artık saçma geliyor. Ben yıllardır iphone kullanıyorum ve memnunum ama bu son zamanlarda yaptıkları yenilik adı altında gelen çok çok basit şeyleri çok fazla abartarak sunmalarına karşıyım. Neymiş İos17'de şarj esnasına telefon yatay olarak kullanıldığında takvim görevi görecekmiş. Çok şey derdim de neyse. Kablo olarak veri bağlantısı baz alınarak hep aynı kalacak şekilde bir tercih yapmaları gerekiyordu. Bunu yıllar önce yapmaları gerekiyordu ama maalesef çok geç kalındı. Herkesin elinde onlarca kablo var ve her ürüne farklısını takıyoruz.Yeni telefon almayı gerektiren hiçbir yenilik yok. Mac'i sınırlarına kadar kullanır gibi iphone'u kullanmıyorsanız hiç gerek yok. Bence 11 ve üstü aynı işi senelerce görecektir.Asıl sorun şu bence. Yeni telefon çıktıkça eski versiyonlardan desteklerini çekmeleri. Buna engel olmalılar. Bir ürünü satın alıyorsam sırf her sene yenisi çıkıyor diye 3-4 sene önce satın aldığımdan destek çekmemeliler. Eğer 5-6 yılda bir ürün çıksa ve değişen çok şey olsa anlarım ama her sene aynı şeyler çıkıp da destek çekmek doğru değil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1kodumtek7",
      "created_time": "September 06, 2023, 03:14:12 PM",
      "body": "Çıktığı gibi Türkiye'de stok krizi yaşanacak muhtemelen. Ekonomik kriz olduğu kadar servet sahibi kolay para kazanan insanlar da var. Kimler sıraya giriyor diyoruz ya. İşte bubların ayakçıları sıraya giriyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "September 06, 2023, 04:05:49 PM",
      "body": "2 kuruş cebine para girince ilk iphone'a yönelen garip bir toplumuz.  isterse 200k tl olsun millet kapısında köle gibi bekleyip alacaktır. Ürün adamın ürünü istedikleri kadar servis verir istedikleri gibi davranabilirler apple kaliteli ürün üretiyor buna diyecek lafım yok ama şuanki enflasyonda 10k tl civarında olan herhangi bir telefonun yapamadığı hangi işi yapıyor cidden merak ediyorum bak zamanında bende samsung'un fanboyluğunu yapıp s3'e 2000 tl ödemiştim ozaman 2000 tl çok büyük paraydı düşünün 32binlira sıfır arabaydı  yani arabanın neredeyse %10'u bir telefona vermiş birkaç yıl sonra telefon tamamen çöp olmuştu o gün dedim napıyorum lan ben. 100k apple telefona verecğime mac alırım daha iyi en azından daha aktif kullanabilirsiniz. bu benim görüşümdür.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "September 06, 2023, 05:53:40 PM",
      "body": "Quote from: 1kodumtek7 on September 06, 2023, 03:14:12 PMÇıktığı gibi Türkiye'de stok krizi yaşanacak muhtemelen. Ekonomik kriz olduğu kadar servet sahibi kolay para kazanan insanlar da var. Kimler sıraya giriyor diyoruz ya. İşte bubların ayakçıları sıraya giriyor.Bu telefonları kullanmak için paraya ya da çok para kazanmaya ihtiyaç yok. Sırf kendince prestij için statü sahibi görünmek için alacak milyonlar var bu ülkede.Hepsinin boğazına kadar borcu var hala yeni telefon almak için ihtiyaç kredisi çekenler var. Yatırım aracı desen değil, lazım desen değil ama herkes almaya çalışıyor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "September 06, 2023, 09:55:38 PM",
      "body": "Dolar fiyatı da sürekli artıyor galiba bu meretin. Ne diyelim Allah fanlarına kolaylık versin işleri rast gitsin rahat rahat yenilesinler telefonlarını.Ben bunların hedef kitlesine girmediğim için haberi sadece burada gördüm. Bir gün Amerika'da yaşarsam Apple kullanabilirim ama bu şartlarda imkansız.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "September 07, 2023, 07:31:11 AM",
      "body": "Quote from: LGD2Business on September 06, 2023, 09:55:38 PMDolar fiyatı da sürekli artıyor galiba bu meretin. Ne diyelim Allah fanlarına kolaylık versin işleri rast gitsin rahat rahat yenilesinler telefonlarını.Ben bunların hedef kitlesine girmediğim için haberi sadece burada gördüm. Bir gün Amerika'da yaşarsam Apple kullanabilirim ama bu şartlarda imkansız.Apple kullanılabilir ancak şu an 15 kullanmak mantıksız geliyor 13/14 olan kişi için ben 13 aldım geçen sene ve gayet memnunum yapamadığım hiç bir şey yok ayrıca hafızası da 256 gb bana fazlasıyla yeterli geliyor 15 almaya iten bir şey yok beni hedef kitlesine giriyoruz ama daha çok düşük maaşlı kredi çeken arkadaşlar gösteriş merakından bizden daha fazla istiyorlar yeni telefonu almayı",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "execijutiere",
      "created_time": "September 08, 2023, 11:39:02 AM",
      "body": "Lightning şarj aletinden USB-C'ye dönmeleri iPhone telefonlar için bir artı olarak işleyebilir çünkü çoğu powerbank cihazlarında lightning girişi yok.Yani telefonunuzu powerbank ile şarj etme sıkıntınız oluyor.Edersiniz fakat dönüştürücü almanız gerekiyor ek olarak o da ne kadar sağlıklı bilemiyorum.iPhone 15 ve gelecek olan yeni iPhone/Apple ürünlerinde USB-C şarj girişi olması bence güzel bir karar olmuş.Fiyat olarak tabiki türkiye'de çok pahalı olması yine insanların yurtdışından telefon almaya itebilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "September 08, 2023, 05:38:19 PM",
      "body": "Apple ya da android tercih etmek konusu çok çetin bir tartışma konusu oldu son zamanlarda. Iphone kullananların çoğu kesinlikle başka telefonları kullanılamaz olarak görüyorlar. Bana geçenlerde bir arkadaşım android telefonumu görünce 'abi çocuk musun ya android mi kullanıyosun hala' dedi. Böyle değişik bir mentaliteye evrildi bu olay. Eşimde 13 pro var, tamam güzel foto çekiyor ama kesinlikle o para değmez. Tek makul sebebi gerçekten influencer olup kitlelere hitap etmek olabilir bence. Adam mesela restaurant videosu çekiyor, milyonlar izliyor, tamam iphone alması mantıklı olur. Ama evde oturup türk kahvesi storysi atan, cafeye gidip kahve nargile cüzdan anahtar storysi atan insanların pahalı iphone'a ihtiyacı olduğunu düşünmüyorum. Bu arada iphone 8 çıktığında hafif bir çığır açmıştı, onu kabul ederim. 2017-2018 yılları olması lazım. İş yerinde herkes gidip arkadaşın iphone 8'ini incelemişti. Zaten ondan sonra fotoğraflar neredeyse aynı.Bu iphone fanatikliği gibi yavaş yavaş tesla fanatikliği de başlıyor gördüğüm kadarıyla. Tesla da diğer otomobillerden ayrı bir dünya kurmaya ve arabanın iphone'u olmaya çalışıyor bence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "September 08, 2023, 06:03:51 PM",
      "body": "Bu tarz liberal/kapitalist harcamalara çok fazla laf edemiyorum ben, zira evet bende \"bir telefona bu kadar para mı verilir\" derken, aynı zamanda gidip başka şeylere saçma harcama yapabiliyorum. Ülkenin durumu sıradan bir lise öğrencisinin maaşıyla alabileceği şeyleri bile ancak iyi eğitimli güzel maaşlı bir insanın lüks olarak kendine alması düzeyinde olduğu için, maalesef bu tarz şeyler lüks zannediliyor ülkede. Bakacak olursak, bir ps5 almak, bir iphone 15 almak, bir macbook almak, amerikada liseli öğrencinin mcdonaldsta biraz çalışıp kendine alabildiği bir şey, aynı şekilde ev araba falan deseniz zaten komik rakamlara, bugün istanbulda evinize satsanız, miamide 500+ metre kare villa alırsınız, araba desen bizim arabayı satsak amerikada aynından sıfır 2 tane alırız o kadar fark var. o yüzden bırakın insanlar ne almak istiyorsa alsınlar, zaten zor durumdayız çoğumuz, bari hayata gelmişken yokluk yaşamayalım, borç harç öderiz bir şekilde.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "emrecemsan",
      "created_time": "September 08, 2023, 07:33:28 PM",
      "body": "iPhone 14 Pro 62 bin 500 lira gibi bir başlangıç fiyatına sahip şu an. 15 Pro için de ben en az bu civarda bir fiyat bekliyorum ama bakalım. Tahminimden az çıkarsa daha iyi tabi ama bu ülkede o fiyata kısa zamanda zam gelmesi işten bile olmaz.    Eli yüzü düzgün bir telefonun bu fiyatta olması üzücü olsa da yapacak bir şey yok. İnsanlar durumu el veriyorsa daha fazla zamlanmadan satın almak isteyecektir. Yurtdışından getirme olayına talep daha fazla olur tabi. IMEI kayıt ücreti artsa bile hala yurtdışı daha mantıklı görünüyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "September 09, 2023, 09:44:21 AM",
      "body": "Quote from: emrecemsan on September 08, 2023, 07:33:28 PMiPhone 14 Pro 62 bin 500 lira gibi bir başlangıç fiyatına sahip şu an. 15 Pro için de ben en az bu civarda bir fiyat bekliyorum ama bakalım. Tahminimden az çıkarsa daha iyi tabi ama bu ülkede o fiyata kısa zamanda zam gelmesi işten bile olmaz.    Eli yüzü düzgün bir telefonun bu fiyatta olması üzücü olsa da yapacak bir şey yok. İnsanlar durumu el veriyorsa daha fazla zamlanmadan satın almak isteyecektir. Yurtdışından getirme olayına talep daha fazla olur tabi. IMEI kayıt ücreti artsa bile hala yurtdışı daha mantıklı görünüyor.Pro fiyatlarında ekstra özel bir lens kullanıldığı için sanırım normal fiyattan daha farklı fiyatlardan bahsediliyor, Pro ve Pro Max için eski modellerin fiyat farklarından daha ciddi farklardan söz ediliyor hocam, yani Pro 70 bin civarında olur en az bence, daha yükseği bile olabilir,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hvdv",
      "created_time": "September 09, 2023, 11:07:59 AM",
      "body": "Bir telefona bu kadar çok para vermeye niyetli değilim. 2023 yılında 50-60 bin liraya telefon almak benim hayat görüşüme uymasa da kalite olarak bakarsak o parayı verenlerin de eleştirilmemesi gerektiğini düşünüyorum. Eleştirilmesi gereken tek şey bir telefondan bir telefon kadar vergi alan sistemi kuranlarda. Özel tüketim vergisi adı altında vatandaşına araba alma, telefon alma gibi hakları sunmayan, daha doğrusu haklı şekilde sunmayan bir devletin eleştirilmesi gerekiyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "September 09, 2023, 01:08:58 PM",
      "body": "Quote from: Hvdv on September 09, 2023, 11:07:59 AMBir telefona bu kadar çok para vermeye niyetli değilim. 2023 yılında 50-60 bin liraya telefon almak benim hayat görüşüme uymasa da kalite olarak bakarsak o parayı verenlerin de eleştirilmemesi gerektiğini düşünüyorum. Eleştirilmesi gereken tek şey bir telefondan bir telefon kadar vergi alan sistemi kuranlarda. Özel tüketim vergisi adı altında vatandaşına araba alma, telefon alma gibi hakları sunmayan, daha doğrusu haklı şekilde sunmayan bir devletin eleştirilmesi gerekiyor. Bir telefona 28 k vermiş bir insan olarak şunu rahatlıkla söyleyebilirim ki enflasyon olan bir ülkede uzun vadeli telefon değiştirmek istemiyorsanız bu telefonlara verdiğiniz paraya eğer ihtiyacınız varsa üzülmeyeceksiniz mesela ben verdim ama yaklaşık 5 sene telefon ihtiyacım olmayacak benim için de şu an aldığım fazlasıyla yeterli geliyor bana eğer değiştirme ihtiyacınız varsa alın yoksa değiştirmeye gerek yok",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "September 10, 2023, 10:20:36 AM",
      "body": "Fiyatı çok olmasa ( bizim ülke için tabi) alınabilir. İşi gücü yerinde olan parası pulu kazancı iyi olan alsın.Geliri belli olan ve geçinme konusunda kit kanaat geçinenler için Xiaomi huwei yeter de artar bile. Evet kalite olarak fark vardır ama android telefonlar bu pahalılıkta iş görür.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}