{
  "id": "topic_5405715",
  "title": "woez",
  "author": "woez",
  "created_time": "July 09, 2022, 12:18:02 PMLast edit: July 09, 2022, 12:34:00 PM by woez",
  "content": "The signature campaign is one of the interesting campaigns in a bounty campaign that not only gives additional knowledge about crypto but also gives more rewards to a campaign. but only certain levels can follow it. How can we go to class??",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405715",
  "comments": [
    {
      "author": "sabine80",
      "created_time": "July 09, 2022, 12:55:20 PM",
      "body": "write good comments, help other people and you'll get merit. dont just focus on bounties, be useful to this forum. then you will be rewarded for it. deal with the topic of merit. there are many good threads with tips on how to earn it.Newbies - Read before postinghttps://bitcointalk.org/index.php?topic=1689727.msg16958010#msg16958010",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WalkerIVIV",
      "created_time": "July 09, 2022, 01:44:05 PM",
      "body": "You must have contributed a lot to the forum and it's better if you are visiting another section like beginner and help section. You're here aiming for the reward and not contributing to the forum. I guess there will be lots of things that must be learned before you will be achieved more rank. It's better if you are also reading the guidelines to be a good poster. https://bitcointalk.org/index.php?topic=1684035.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonyaserg",
      "created_time": "July 09, 2022, 01:53:56 PM",
      "body": "Over the years I have been involved in various projects. And as soon as I see that there is a subscription company in this project, I always participate with great joy and share my opinion. And also I'm interested in the opinion of other participants. Since I learn a lot of new things for myself on the signature forum. So for beginners, I can say that this signing forum is very interesting and gives great knowledge in the crypto industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "July 09, 2022, 02:13:35 PM",
      "body": "For now you have to focus more on understanding the forum, learning everything useful regarding crypto in general from all the learned members of this great forum and building your account alongside by contributing positively in anyway you can to support the forum. Doing this will surely earn you merit depending on your creativity and contribution, beside that there is no special class to attend. Your focus should be on building your account to level up in other to be able to participate in signature campaigns.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Issa56",
      "created_time": "July 09, 2022, 04:30:55 PM",
      "body": "I think the first thing you will do before you can participate in signature campaign is to have merit, you get merit by making positive impact on the forum, but I think you should go true the forum rules because most people always go against the forum rules when trying to rank up, always make sure you avoid plagiarism because that's one of the serious problem newbies are always having. Make sure you understand the forum first, don't be after the merit you are looking for just because you want to join signature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "July 09, 2022, 06:29:51 PM",
      "body": "What does this have to do with altcoins? Signature campaigns don't give you any knowledge. But if you publish interesting and quality posts, you can get paid for it. So if you want to be a part of these campaigns, you should have already gathered some baggage of knowledge and practical experience in the crypto space that you can talk about in your posts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "July 09, 2022, 06:57:01 PM",
      "body": "Quote from: woez on July 09, 2022, 12:18:02 PMThe signature campaign is one of the interesting campaigns in a bounty campaign that not only gives additional knowledge about crypto but also gives more rewards to a campaign. but only certain levels can follow it. How can we go to class??It seems to me that you have misplace priorities. If you are here only for the sake of joining signature campaigns/bounties or gaining merits, then you are in the wrong place.Focus on knowledge and helping out other members. SIG campaigns just come in as a bonus.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shamm",
      "created_time": "July 09, 2022, 06:59:51 PM",
      "body": "Quote from: woez on July 09, 2022, 12:18:02 PMThe signature campaign is one of the interesting campaigns in a bounty campaign that not only gives additional knowledge about crypto but also gives more rewards to a campaign. but only certain levels can follow it. How can we go to class??I don't know if you are here to contribute and gain more knowledge to the forum or you are here because of signatures campaign that can pay you. As a newbie you should not overspeed take it easy you must learn first the rules and regulation here in forum and then you proceed what you want to do but always remember the prohibited here which is copying someone work and claim that it is yours to gain more merits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "July 09, 2022, 07:16:13 PM",
      "body": "Merit comes naturally when you have lots of information and knowledge on your mind.  Just listen to the earlier reply.  Focus on gaining knowledge and roam the forum and take advantage of the opportunity to help members who are asking for pieces of information and suggestions regarding anything that interests them that is related to crypto and this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "waybesuricata",
      "created_time": "July 09, 2022, 07:46:14 PM",
      "body": "You should open topics that will help people and at the same time make useful comments. If you do it this way, forum users will give you merit. At the same time, merit resources will also give you plenty of merit, when you see that you are constantly making useful posts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "July 09, 2022, 08:08:08 PM",
      "body": "Quote from: woez on July 09, 2022, 12:18:02 PMThe signature campaign is one of the interesting campaigns in a bounty campaign that not only gives additional knowledge about crypto but also gives more rewards to a campaign. but only certain levels can follow it. How can we go to class??It is definitely true that the best bounty campaigns are only available for the ranks of Full Member or above. Some of them are even exclusively for Hero or Legendary members. First of all i have to say that the people that have registered on this forum a long time ago were pretty lucky because they could have ranked up to Legendary pretty easily only with writing posts, asking questions or whatever. Nowadays you don't only need activity but also Merit, which means you need to write a post that another user finds so helpful, funny or whatever that he manually sends you one of his Merits as a reward. Sometimes this is not really fair because it is possible that you write a great post or that you are directly answering a question of another member and you still don't get any merit for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "July 09, 2022, 08:12:04 PM",
      "body": "You are wrong, signature campaign has nothing to do in helping you Knowledge of crypto-currency, Rather it’s the other way round, you knowledge of crypto-currency will make you make constructive post that would earn you a good status to be able to be on a signature campaign, but for what it worth that should not be your priority concern right now, go in search of the knowledge and rest the idea of a signature campaign till you are ready.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "July 09, 2022, 08:18:39 PM",
      "body": "Most signatures (excluding those that accept spammers or negative trust profiles) require the author to be a user who can write quality comments or be able to add a value to a discussion here on forum. This Is the way. No One want read comments without real value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zonefloor",
      "created_time": "July 09, 2022, 08:19:40 PM",
      "body": "you need to produce quality comments and content for the forum and its members. For example, you can increase your chances of winning a merit by supporting the necessary titles with new information. However, since merit is not easily earned, it is not given in abundance by everyone. As you produce high-value content, you can see that there are plenty of merits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lagduf",
      "created_time": "July 09, 2022, 11:48:52 PM",
      "body": "Signature was a way for the promotion purpose and it has nothing to do to increase your knowledge or something like this, if you are wishing to get additional money from there and you can but again you must not expect to get a huge income from there. The fact that if signature campaign will be offering you salary to promote the project. It will not give you any knowledge but you must have knowledge to be able to participate on signature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "July 10, 2022, 03:03:10 AM",
      "body": "Quote from: woez on July 09, 2022, 12:18:02 PMThe signature campaign is one of the interesting campaigns in a bounty campaign that not only gives additional knowledge about crypto but also gives more rewards to a campaign. but only certain levels can follow it. How can we go to class??In bounty campaigns you can see signature campaigns but bounties bassically give you very low payment and sometimes no payment at all or what payment you receive does not worth good value.To be eligible for good signature campaigns (not as part of bounties), you should read and learn fromSignature campaign guideline",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "July 10, 2022, 05:54:28 PM",
      "body": "Quote from: Lagduf on July 09, 2022, 11:48:52 PMSignature was a way for the promotion purpose and it has nothing to do to increase your knowledge or something like this, if you are wishing to get additional money from there and you can but again you must not expect to get a huge income from there. The fact that if signature campaign will be offering you salary to promote the project. It will not give you any knowledge but you must have knowledge to be able to participate on signature. Very good way to respond to op request. Meanwhile I think he should take this to meta board or better to beginners and help section. Signature campaign don't teach you the knowledge of cryptocurrency or bitcoin but you should have knowledge to be able to qualify with your rank. You need to concentrate on the knowledge now as a newbie and you can get some nerit that will grow your account to a level that you can apply to signature campaign and recently few signature campaign accept full member ranks, it is recently with senior member, so work hard if you want to earn btc but bounty is there for lower ranks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Psynthax",
      "created_time": "July 10, 2022, 11:34:35 PM",
      "body": "Some members above have been explaining a lot about how to get merit especially sharing the thread about the guideline but it's not so easy right now. You need to hardwork to make it happen and making so many constructive post. this is a very long process that must be done. The fact that if merit can be achieved when you are creating a post that can impress others who agreed with your opinion to give you merit. The payment in the signature btc was quite stable unlike bounty sometime it can give you big or low.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "len01",
      "created_time": "July 11, 2022, 03:00:10 AM",
      "body": "don't focus too much on the bounty campaign on this forum but focus on the quality of your posts so that they become constructive posts for other members in this forum.if you make posts that are informative and can provide new information or motivation you will get rewarded from it all.no need to complain about merit. because there are so many beginners in this forum who have earned a lot of merit. because they make quality posts and focus on building this forum not just looking for bounties.you can see a lot of novice members in this forum they make a lot of really good posts and they get the rewards they deserve",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}