{
  "id": "topic_5445451",
  "title": "WhiteCrypto",
  "author": "WhiteCrypto",
  "created_time": "March 19, 2023, 01:15:39 AM",
  "content": "Just found out an interesting  Bitcoin documentary film on YouTube. CZ Binance, Justin Sun Tron, Charles Hoskinson Cardano and many other top crypto projects founders & influencers discuss how blockchain changes the world. Do you think it is worth to be watching? Or we don’t have to trust centralized ecosystem founders to discuss Bitcoin? Here is the link: https://youtu.be/jP5W8PmyC1c",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445451",
  "comments": [
    {
      "author": "Ever-young",
      "created_time": "March 19, 2023, 01:29:44 AM",
      "body": "In as much as one is against centralized exchanges and organization that's does not mean those men behind those big projects don't have anything to offer to the crypto world.. I respect them alot, pulling a big project like is something that requires brain and calculation. They see vision beyond what most of us see in Bitcoin that's why they make a great move by creating their own project. We are all for same purpose (supporting crypto currency) but just on a different page.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "March 19, 2023, 03:29:36 AM",
      "body": "One thing for sure: Bitcoin and the things it is representing including decentralization and for me financial empowerment is HERE TO STAY and in the face of the great turmoil happening right now in the banking system, it is getting the limelight it all deserves. Now, crypto industry leaders know that eventually it is decentralization that we are fighting for. One day, decentralized platforms will be taking the lead especially in the threats posed by many encroaching governments as they want to exercise their control mechanism on all of us. This documentary is a very good one...educating people on many things so as we can appreciate Bitcoin and the revolution it started years ago. Indeed, our money should be working for us and not against us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tisnaislam111",
      "created_time": "March 19, 2023, 04:54:57 AM",
      "body": "If we look at history. Then I can see. How people have changed since ancient times. How did people live then? And how is it now?The world where it is now will be better in the future. Will develop more.Nothing in the world can survive alone.Also this banking system can be lost. More modern technology will come from this.So what if the latter changes the world. Then blockchain will change the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "March 19, 2023, 05:25:42 AM",
      "body": "Quote from: WhiteCrypto on March 19, 2023, 01:15:39 AMJust found out an interesting  Bitcoin documentary film on YouTube. CZ Binance, Justin Sun Tron, Charles Hoskinson Cardano and many other top crypto projects founders & influencers discuss how blockchain changes the world. Do you think it is worth to be watching? Or we don’t have to trust centralized ecosystem founders to discuss Bitcoin? Here is the link: https://youtu.be/jP5W8PmyC1cWatch it if you have too much free time but in the end they can’t decide BTC’s future. Do you think btc would die if binance was shut down? Only the price would go down maybe for a week… Remember CZ tried to rewind the blockchain once after binance got hacked. He is (or was) that clueless about bitcoin. Somehow he is the face of the biggest crypto exchange and remember, he is only a talking head. His words don’t really carry any weight.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "March 19, 2023, 06:43:46 AM",
      "body": "Quote from: WhiteCrypto on March 19, 2023, 01:15:39 AMCZ Binance, Justin Sun Tron, Charles Hoskinson Cardano and many other top crypto projects founders & influencers What's the relation between those projects and Bitcoin's decentralization?Binance is kill the Bitcoin's decentralization while other projects e.g. Tron and Cardano are created in order to beat Bitcoin and the most important thing they're centralized. The documentary videos will only talk about common sense just like Bitcoin is decentralized and no one can control it, but technically when you're send your Bitcoin to Binance, Binance do have a control over your coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "March 19, 2023, 06:54:39 AM",
      "body": "Quote from: Solosanz on March 19, 2023, 06:43:46 AMQuote from: WhiteCrypto on March 19, 2023, 01:15:39 AMCZ Binance, Justin Sun Tron, Charles Hoskinson Cardano and many other top crypto projects founders & influencers What's the relation between those projects and Bitcoin's decentralization?It is not an exaggeration if I say Bitcoin is the only cryptocurrency project that is actually decentralized. Altcoin projects are all centralized no matter how they tried to build up DAO to become decentralized in view of investors. In fact, their vote systems are biased by strongly centralization of big token holders.Decentralization of Bitcoin network is shown on mining activities as well as node distribution.Mining map and Live map of reachable nodesQuoteBinance is kill the Bitcoin's decentralization while other projects e.g. Tron and Cardano are created in order to beat Bitcoin and the most important thing they're centralized. Those projects were not born with initial missions to beat Bitcoin and they won't be able to do this. Many altcoin projects born with so noisy missions but they never fulfilled their ambitious missions or what they wrote in White paper, roadmap are simply lie.Don't buy altcoins because they are top altcoinsIf you want to check top altcoins and their histories (born, jumped to top, died gradually or completely dead), let's visit Coinmarketcap's Cryptocurrency Historical Snapshots",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "March 19, 2023, 07:29:34 AM",
      "body": "Quote from: WhiteCrypto on March 19, 2023, 01:15:39 AMOr we don’t have to trust centralized ecosystem founders to discuss Bitcoin?Good point, and I'd say not completely.All they'll do is talk volatility, investment, emphasize that there are many advantages of a centralized service, as best they can try to turn you into a speculator and encourage you to use their platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crunck",
      "created_time": "March 19, 2023, 08:15:38 AM",
      "body": "Quote from: Solosanz on March 19, 2023, 06:43:46 AMQuote from: WhiteCrypto on March 19, 2023, 01:15:39 AMCZ Binance, Justin Sun Tron, Charles Hoskinson Cardano and many other top crypto projects founders & influencers What's the relation between those projects and Bitcoin's decentralization?Binance is kill the Bitcoin's decentralization while other projects e.g. Tron and Cardano are created in order to beat Bitcoin and the most important thing they're centralized. The documentary videos will only talk about common sense just like Bitcoin is decentralized and no one can control it, but technically when you're send your Bitcoin to Binance, Binance do have a control over your coins.It's their business, and what they care about is profits, not the future of bitcoin or anything. If bitcoin is not in your favor or support it is not profitable for you, will you invest or continue to support it? I do not think so. All for money, we are like them, but the way of making money is different.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "March 19, 2023, 08:49:53 AM",
      "body": "Quote from: WhiteCrypto on March 19, 2023, 01:15:39 AMSnipThe only focus or context of the videos was on the importance of BTC and blockchain over people's custody of their assets. Like \"we can fully control our assets etc. Well, I have a question for you, like I am from a developing country where a problem of load shedding exists. And sometimes there is no electricity even in the whole country but now the occurrence of this event increased in 2022 till now. So in a total blackout, there is no we can access our assets because to do that we need a battery in our devices like laptops and phones, and to perform transactions we need the internet. Overall, in that total blackout banks were also un functional so overall, I can say both sectors depend on electricity and internet communication. So I think we should not say that by adopting blockchain or BTC technology and decentralization we will be free, no. We just have to take care of our assets ourselves. And in the video, there was a question about whether BTC and blockchain could make lives more efficient than why other groups of people are opposing it. I think that's because of less employment there will be once the total sector of banking and finance shifts to blockchain and digital currency which will eliminate the need for workers. Well, that's only one factor on the list. It's up to you to trust the CEOs of exchanges or not, as far as BTC has come, it's been a great success for it and there is no doubt in it that BTC provides the poor side of society a chance to come forward and give a healthy life. Likewise my self I have no properties I am a student and started to earn via writing articles for bounties then things just started to streamline.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "March 19, 2023, 10:19:26 AM",
      "body": "I haven't watched it, and I guess I probably won't. I will give them the benefit of the doubt but when it comes to unbiased views, these people are not the best out there. They're more of businessmen than visionaries, especially Zhao and Sun. I'm not even sure if these two are assets or liabilities to the crypto community. I don't know what they're preaching, but if it's the gospel of Bitcoin, they're certainly not practicing what they're preaching, not walking the talk. Andreas Antonopoulos is a world better than them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "March 19, 2023, 11:12:34 AM",
      "body": "Quote from: WhiteCrypto on March 19, 2023, 01:15:39 AMDo you think it is worth to be watching?NoQuote from: WhiteCrypto on March 19, 2023, 01:15:39 AMOr we don’t have to trust centralized ecosystem founders to discuss Bitcoin?They are entrepreneurs. Their #1 goal is making money. If praising Bitcoin helps them make money, they will do it. If attacking Bitcoin and promoting their shitcoin is more profitable, they will do that instead. Besides, they never tell anything interesting or original. It's always \"blockchain is the future, crypto is the future, buy my shitcoin before it's too late\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "March 19, 2023, 11:16:01 AM",
      "body": "Quote from: WhiteCrypto on March 19, 2023, 01:15:39 AM~Bitcoin documentary film on YouTube. CZ Binance~ discuss how blockchain changes the world. Do you think it is worth to be watching? Or we don’t have to trust centralized ecosystem founders to discuss Bitcoin?Do you want to trust a man who wants to reorg/roll back bitcoin in order to save his own centralized exchange? Anyway, I didn't watch the video and probably won't try to see it as a whole at all. But if you truly want to grasp how blockchain gets utilized or generally about bitcoin digital economy and decentralization, there are way better resources compared to the three people who made centralized coins and \"influencers\" that on the video.A. Antonopoulos is a renowned person that talks about bitcoin since its early stage, you might want to take a look at his content. You can also see further various resources about bitcoin:  https://www.lopp.net/bitcoin-information.html, instead of a single documentary you put, there is various option that I am certain it is way more comprehensive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "March 19, 2023, 11:51:50 AM",
      "body": "Quote from: hatshepsut93 on March 19, 2023, 11:12:34 AM~snip~They are entrepreneurs. Their #1 goal is making money. If praising Bitcoin helps them make money, they will do it. If attacking Bitcoin and promoting their shitcoin is more profitable, they will do that instead. You wrote that well and I agree that for them Bitcoin was and will remain only a stepping stone in achieving their goals. They actually said everything about Bitcoin with their works, because if Bitcoin was enough for them, they wouldn't have created something else, which is the complete opposite of what Bitcoin represents.Quote from: hatshepsut93 on March 19, 2023, 11:12:34 AMBesides, they never tell anything interesting or original. It's always \"blockchain is the future, crypto is the future, buy my shitcoin before it's too late\".Always the same old stories, but we should not forget that the audience is changing and that it sounds very interesting and new to some, because they are beginners who need advice, guidance and vision. According to CZ, the average investor is not intelligent enough to be his own bank anyway, and instead of teaching them about it, he advocates a custodial service because it suits him personally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "March 19, 2023, 12:12:28 PM",
      "body": "Quote from: WhiteCrypto on March 19, 2023, 01:15:39 AMJust found out an interesting  Bitcoin documentary film on YouTube. CZ Binance, Justin Sun Tron, Charles Hoskinson Cardano and many other top crypto projects founders & influencers discuss how blockchain changes the world. Do you think it is worth to be watching? Or we don’t have to trust centralized ecosystem founders to discuss Bitcoin? Here is the link: https://youtu.be/jP5W8PmyC1cIt can be assumed that the centralized sector of cryptocurrency satisfies some segment of the customers in the industry but it is vital to state that this is not the main thrust of Bitcoin. These exchanges are not part of the plan of Bitcoin creation. These set of entrepreneurs are a businessmen that wants to promote their businesses so that they can get more money and fame. These shitcoin promoters know they can't compete with Bitcoin because the coin creator is selfless while they are just pursuing their selfish interest.Quote from: Lucius on March 19, 2023, 11:51:50 AMAlways the same old stories, but we should not forget that the audience is changing and that it sounds very interesting and new to some, because they are beginners who need advice, guidance and vision. According to CZ, the average investor is not intelligent enough to be his own bank anyway, and instead of teaching them about it, he advocates a custodial service because it suits him personally. I think it is easy to learn and set up a decentralized wallet than registering and operating a centralized account in any of these exchanges. I hope that these exchanges in the process of teaching these newbies also tell them that their privacy is compromised and they don't also own their coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "March 19, 2023, 02:00:52 PM",
      "body": "Quote from: Fiatless on March 19, 2023, 12:12:28 PMI think it is easy to learn and set up a decentralized wallet than registering and operating a centralized account in any of these exchanges. I hope that these exchanges in the process of teaching these newbies also tell them that their privacy is compromised and they don't also own their coins.These crypto businessmen abhor self custody and the truth, so they would rather deceive people by saying 99% of people will lose crypto stored in self custody, so people can keep their crypto in centralized exchanges and services to be used for trading and gambling by the exchange for their personal profit.I don't know why people think these crypto businessmen like BTC, if they do, they would educate people how to use BTC the right way, and that is to move their funds into self custody after every successful trade, but how are they going to make money if they don't have billions of their customers money to gamble with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "March 19, 2023, 04:23:19 PM",
      "body": "The future of decentralization is uncertain but as we know many uses it already in any kind of sectors, many country implement decentralized system already too. While these crypto founders will always promote their services/blockchain/business but will always empower the use case of crypto especially bitcoin because thats where they get profit the most.Quote from: Z-tight on March 19, 2023, 02:00:52 PMI don't know why people think these crypto businessmen like BTC, if they do, they would educate people how to use BTC the right way, and that is to move their funds into self custody after every successful trade, but how are they going to make money if they don't have billions of their customers money to gamble with.It's the users choice, they just provide services where most convenient use can be. Besides most of their site's service have faq/blog pages to educate regarding bitcoin, their tokens and other blockchain/crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kelonmusk",
      "created_time": "March 21, 2023, 01:32:49 PM",
      "body": "Personally, I think it's always worth staying informed and educated about new developments in the crypto space, so I think watching documentaries can be a good way to learn more.Nonetheless, it is important to remember that while the founders and influencers featured in the documentary may have valuable insight, they represent a centralized ecosystem.So, it is always important to approach any new information with a critical eye and consider various perspectives before making any conclusions.The future of BTC's decentralized and digital economy remains a little uncertain, but it is clear that blockchain technology is here to stay.I think it's up to all of us to continue to learn and explore this space, and to stay open to new ideas and developments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bushdark",
      "created_time": "March 21, 2023, 01:42:13 PM",
      "body": "I don't have the time to watch the video for now but things had really been changing since the development of Blockchain ecosystem. Blockchain is going to dominate the world soon and what is left for us now is to get prepared because things will keep changing with time and sooner we are not going to be seeing those common things we see today. The world now is moving to a decentralized habitat and we would be sorry for those people especially the exchanges that think centralization would never end. All we need now is just the time to see how everything is going to play out in due time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "justdimin",
      "created_time": "March 21, 2023, 09:12:20 PM",
      "body": "Quote from: Bushdark on March 21, 2023, 01:42:13 PMI don't have the time to watch the video for now but things had really been changing since the development of Blockchain ecosystem. Blockchain is going to dominate the world soon and what is left for us now is to get prepared because things will keep changing with time and sooner we are not going to be seeing those common things we see today. The world now is moving to a decentralized habitat and we would be sorry for those people especially the exchanges that think centralization would never end. All we need now is just the time to see how everything is going to play out in due time. Blockchain going into the fiat world would be the thing that changes the most things, we are talking about a system that is designed to be both decentralized and incorruptible that ends up used by the whole world, and that could actually be amazing for all of us. I am not saying that it will start happening tomorrow or something like that, of course we are going to need some time.However, we all know that visa and mastercard are already working on it and there are some smaller companies that already started using it, which provides a point that it is better, if it is not better why would they move towards that direction. It changed the whole landscape of economy if you ask me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}