{
  "id": "topic_5459998",
  "title": "DenyHunter",
  "author": "DenyHunter",
  "created_time": "July 16, 2023, 12:17:02 PM",
  "content": "I would like to leave here my indignation with BC.Game. I've been trying to solve a problem for 3 weeks and the support only knows how to open tickets and promise deadlines that they don't meet. The problem is, I'm entitled to an affiliate reward. But I don't think the site wants to pay. Anyone else having problems with this site?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459998",
  "comments": [
    {
      "author": "MainIbem",
      "created_time": "July 16, 2023, 12:28:45 PM",
      "body": "I am sure of what the problem would be but I believe before you do raised ticket there may be others that are yet to solve, so currently I believe your request has been received and would carefully look it when it's your turn. I think is something you should raised alarm yet rather have patients with them and keep your records very tight as it may served as an evidence maybe if passes a month or something so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DenyHunter",
      "created_time": "July 16, 2023, 12:52:54 PM",
      "body": "I understand but the support promised several times to solve the problem in 48 hours. I've already received two tickets with the same problem. They asked for print several times. I have ticket 181757 and 167864. None with any response.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "July 16, 2023, 01:03:47 PM",
      "body": "Quote from: DenyHunter on July 16, 2023, 12:52:54 PMI understand but the support promised several times to solve the problem in 48 hours. I've already received two tickets with the same problem. They asked for print several times. I have ticket 181757 and 167864. None with any response.BC.game last login in forum was july 4 and there’s still active complaints about them that still unanswered on the scam accusation thread and on their ANN thread. Posting here will not gonna make your issue move forward faster because support is not active here compared on their support ticket that acknowledging your concern.Having a deadline even if it’s not meet yet is mich better to look forward instead of having no timeline at all. Just keep ask them for update until you got your answer. @Efialtis is an affiliate with bc.game, Maybe he can answer some of your questions regarding commission.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MainIbem",
      "created_time": "July 16, 2023, 01:05:34 PM",
      "body": "Quote from: DenyHunter on July 16, 2023, 12:52:54 PMI understand but the support promised several times to solve the problem in 48 hours. I've already received two tickets with the same problem. They asked for print several times. I have ticket 181757 and 167864. None with any response.Then when contacting them please try to provide those tickets it would be useful to fast track your request. Basically I don't know anything about them neither have I gambling with the site before but I am only responding to you based on experience I have had with gambling site issuing you a ticket or an order number to use in tracking your issues.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "July 16, 2023, 01:16:22 PM",
      "body": "Quote from: DenyHunter on July 16, 2023, 12:52:54 PMI understand but the support promised several times to solve the problem in 48 hours. I've already received two tickets with the same problem. They asked for print several times. I have ticket 181757 and 167864. None with any response.There are other issues with Bc.Game and I think their support is already addressing that problem and this could be next.I'm wondering why the support takes longer to solve a simple issue, they can easily check your account with regards to the affiliate program and its really not ok to wait longer. Anyway, better to share your proof here so we can be more aware about the situation and know if this is legit accusation or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "July 16, 2023, 01:59:16 PM",
      "body": "Quote from: DenyHunter on July 16, 2023, 12:17:02 PMI would like to leave here my indignation with BC.Game. I've been trying to solve a problem for 3 weeks and the support only knows how to open tickets and promise deadlines that they don't meet. The problem is, I'm entitled to an affiliate reward. But I don't think the site wants to pay. Anyone else having problems with this site?This is not the right board for this thread. It is better that you move it to scam accusation board,where forum members can look into the issue for it to be resolved. I don't know what is the problem with BC.games as they haven't responded to any complain or accusation laid upon the casino. Is it that their representative here on this forum will no longer come online anymore to come and clear the air of what is happening with all the complains and accusations by forum members. I would have said that you should exercise more patience to see if your time will come for attention but you have waited long enough.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "July 16, 2023, 02:05:57 PM",
      "body": "Quote from: DenyHunter on July 16, 2023, 12:17:02 PMI would like to leave here my indignation with BC.Game. I've been trying to solve a problem for 3 weeks and the support only knows how to open tickets and promise deadlines that they don't meet. The problem is, I'm entitled to an affiliate reward. But I don't think the site wants to pay. Anyone else having problems with this site?OP, BC.Game gambling site has representatives here who can handle problems especially for their users, you can visit them here: https://bitcointalk.org/index.php?topic=5088875.0Or you can directly contact their representative about the affiliate prize you mean, I think if you really have an absolute win, if you are not satisfied with the support in their chat, maybe you can try to discuss with @BC.GAME, to solve your ticket problem, just try contacting hopefully there will be a satisfying answer for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maydna",
      "created_time": "July 16, 2023, 02:38:20 PM",
      "body": "3 weeks is a long time to wait for one member to resolve a problem. Perhaps, BC.game is experiencing serious problems in their casino, so they are delaying solving many problems or complaints experienced by their members. Perhaps some people have the same problem as you but haven't complained about it or are still patiently waiting.And my advice may be like other friends. Try to keep asking about your case in the support service and the ANN so that it will attract the attention of BC.game representatives. I've never had a problem like you, so I'm sorry I don't know and can only suggest as other friends did.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "July 16, 2023, 03:41:57 PM",
      "body": "Quote from: DenyHunter on July 16, 2023, 12:17:02 PMI would like to leave here my indignation with BC.Game. I've been trying to solve a problem for 3 weeks and the support only knows how to open tickets and promise deadlines that they don't meet. The problem is, I'm entitled to an affiliate reward. But I don't think the site wants to pay. Anyone else having problems with this site?I'm sorry to hear that, unfortunately, we can't do anything about it. It seems that BC.Game official representative has stop login to this community and so we don't know what is happening behind their gambling platform as of this late.Maybe you can go to arbitration, as your worst case scenario (https://www.askgamblers.com/submit-complaint), best of luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "July 16, 2023, 03:51:03 PM",
      "body": "Quote from: maydna on July 16, 2023, 02:38:20 PM3 weeks is a long time to wait for one member to resolve a problem. Perhaps, BC.game is experiencing serious problems in their casino, so they are delaying solving many problems or complaints experienced by their members. Perhaps some people have the same problem as you but haven't complained about it or are still patiently waiting.And my advice may be like other friends. Try to keep asking about your case in the support service and the ANN so that it will attract the attention of BC.game representatives. I've never had a problem like you, so I'm sorry I don't know and can only suggest as other friends did.I don't think they are facing any issues or atleast for the withdrawals because one of the forum member confirmed that his withdrawal on BC.game proceeded in minutes,Quote from: iv4n on July 14, 2023, 05:45:14 PMFrom the last night! I saw it in my wallet in less than a minute, literally... also it seems lot of scam accusations created lately with manipulated proofs so it is some kind of attack to break their reputation?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "icopress",
      "created_time": "July 16, 2023, 03:55:39 PM",
      "body": "Please note that BC considers user requests ONLY through the official support on the site (https://help.bc.game/ru/).Their thread and forum account has been created and is for informational purposes only.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "July 16, 2023, 03:57:26 PM",
      "body": "Quote from: jrrsparkles on July 16, 2023, 03:51:03 PMQuote from: maydna on July 16, 2023, 02:38:20 PM3 weeks is a long time to wait for one member to resolve a problem. Perhaps, BC.game is experiencing serious problems in their casino, so they are delaying solving many problems or complaints experienced by their members. Perhaps some people have the same problem as you but haven't complained about it or are still patiently waiting.And my advice may be like other friends. Try to keep asking about your case in the support service and the ANN so that it will attract the attention of BC.game representatives. I've never had a problem like you, so I'm sorry I don't know and can only suggest as other friends did.I don't think they are facing any issues or atleast for the withdrawals because one of the forum member confirmed that his withdrawal on BC.game proceeded in minutes,Quote from: iv4n on July 14, 2023, 05:45:14 PMFrom the last night! I saw it in my wallet in less than a minute, literally... also it seems lot of scam accusations created lately with manipulated proofs so it is some kind of attack to break their reputation?The issue of OP here is regarding the affiliate reward and not a withdrawal. Also if one user doesn’t have any have problem doesn’t mean other user complain is invalidated since we have different experience in each casino.I’m not accusing that their cases is legit but the lack of response here by the bc.game representative doesn’t prove anything about all the existing case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "knowngunman",
      "created_time": "July 16, 2023, 04:15:56 PM",
      "body": "Quote from: MainIbem on July 16, 2023, 12:28:45 PMI think is something you should raised alarm yet rather have patients with them and keep your records very tight as it may served as an evidence maybe if passes a month or something so.Good 3 weeks and you think it's not the right time to raise the alarm yet? It's very obvious something is wrong somewhere. Unless it's a very complicated technical issue, a responsive support team should be able to attend and resolve the customer issue within 24 to 48 hours. I think OP is patient enough already for delaying the alarm till this moment. It's better to provide customers with accurate information than fixing deadline that they won't meet up. Quote from: jrrsparkles on July 16, 2023, 03:51:03 PMI don't think they are facing any issues or atleast for the withdrawals because one of the forum member confirmed that his withdrawal on BC.game proceeded in minutes,This is different aspects from OP complain. Withdrawal is technical aspect that operate on auto and check from time to time for maintenance. The OP case has to do with customer service aspect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "July 16, 2023, 04:48:29 PM",
      "body": "I don't quite understand exactly what they've been telling you because you haven't posted any photos of the conversation you've been having with their support, something you should have posted in this thread, at least with a photo of the conversation you've been having with them it would make it easier for us to understand what's going on, anyway how they haven't solved your problem and the OP hasn't been active in this forum. could you contact the user @efialtis take into account that he is not an employee of this casino, so I'm not saying that he will solve your problem, but I saw his post on this casino's thread:Quote from: efialtis on July 14, 2023, 11:44:41 AMWe have updated our BC.Game review --> https://www.btcgosu.com/review/bc-game/Also worth mentioning is that we had the pleasure of meeting some members of the BC.Game team at iGB Live Amsterdam maybe he can tell you if the casino is having a problem or if everything ok on his side, and he is getting the commissions from referrals without any problems, anyway get in touch with him and ask for help, you don't lose anything in his case if refuse or not be able to help you. despite many people saying that this is a reliable casino, in the last few weeks there have been complaints about this casino, which is very strange because before they didn't have many complaints, I don't know what's going on",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "July 16, 2023, 07:08:52 PM",
      "body": "Quote from: DenyHunter on July 16, 2023, 12:17:02 PMI would like to leave here my indignation with BC.Game. I've been trying to solve a problem for 3 weeks and the support only knows how to open tickets and promise deadlines that they don't meet. The problem is, I'm entitled to an affiliate reward. But I don't think the site wants to pay. Anyone else having problems with this site?just curious, what exactly did they say? As with every accusation here in the forum, you should at least provide evidence supporting your claim. it is one of the most important things to include when posting a thread like this. Slow death mentioned efialtis, I am not sure how much he can help you but it wouldn't hurt to ask for help.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "July 16, 2023, 07:16:10 PM",
      "body": "Quote from: DenyHunter on July 16, 2023, 12:17:02 PMI would like to leave here my indignation with BC.Game. I've been trying to solve a problem for 3 weeks and the support only knows how to open tickets and promise deadlines that they don't meet. The problem is, I'm entitled to an affiliate reward. But I don't think the site wants to pay. Anyone else having problems with this site?The question is have you earn any affiliate rewards in the past if the answer is yes then it mean their trying to put of something that may end up as being a deduction or reduction pf the percentage payment,  which will result in you getting a smaller amount as your reward for this round. But is this is your first time to get the reward and trying to know what you total amount in rewards are,  it then means you will need to keep following the support and create reminder so that if their is a problem from your own end you can resolve it because at this point if I am right you don't know the exact amount your affiliate reward will be unless of you already made a manual calculation of that which is almost impossible so you have really keep in touch to get what you have to do to get your rewards credited.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "July 16, 2023, 07:32:20 PM",
      "body": "Quote from: DenyHunter on July 16, 2023, 12:17:02 PMI would like to leave here my indignation with BC.Game. I've been trying to solve a problem for 3 weeks and the support only knows how to open tickets and promise deadlines that they don't meet. The problem is, I'm entitled to an affiliate reward. But I don't think the site wants to pay. Anyone else having problems with this site?Well, for me, it's really been a while I played last on this casino, but then, In all my days, months of playing there, I've never had any issues with withdrawals.And yes, I know, like you said, your issue is related to them not paying your affiliate reward, I never participated in their affiliate marketing program, so I have no idea how it works, or what the payment structure Is like...All I can tell you is to be patient, you can contact the manager of their Ann here on this forum and see if he or she can help resolve your issue, I do know that of late, there are been complaints from some users about Bc.games not processing their withdrawal request, I believe this should be a temporary issue which will all be resolved soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "July 16, 2023, 08:09:25 PM",
      "body": "Quote from: DenyHunter on July 16, 2023, 12:52:54 PMI understand but the support promised several times to solve the problem in 48 hours. I've already received two tickets with the same problem. They asked for print several times. I have ticket 181757 and 167864. None with any response.Shouldn't these two tickets complicate things if the issue is the same?  This might cost for another delay because the support might get confused about the two tickets and might end up producing another problem.  Opening another ticket on the same issue is not the best thing to do IMO.  You can just bump your ticket by asking them about the update and not opening another one.  But if the case is different then I think it is ok to create another ticket since the other one is different from the existing one.You can follow up and ask them, you should even talk to the online support personnel and inquire about your ticket on their support chat.  I bet the support stuff will answer your inquiries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "July 16, 2023, 08:17:45 PM",
      "body": "Quote from: dimonstration on July 16, 2023, 03:57:26 PMThe issue of OP here is regarding the affiliate reward and not a withdrawal. Also if one user doesn’t have any have problem doesn’t mean other user complain is invalidated since we have different experience in each casino.I’m not accusing that their cases is legit but the lack of response here by the bc.game representative doesn’t prove anything about all the existing case. I think in any gambling platform there are affiliate managers who deals with their affiliates. Usually the affiliate sections are separated from the main business section. I did not use BC game that much and never checked how their affiliate sections has designed but if this is separate section then showing withdrawal from the main platform does not mean anything.I read somewhere that they always take care the cases on their support section. But when gamblers or affiliate partners do not receive much attentions fir their issues then they will obviously try to seek attention from other sources. BC.game needs to response here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}