{
  "id": "topic_5467143",
  "title": "Hamada1983",
  "author": "Hamada1983",
  "created_time": "September 18, 2023, 12:56:15 AM",
  "content": "I just posted a topic about Xqtraders after being scammed on crypto trading October 2022. According to bbb.org and sunbiz.org the company was founded by Kevin Russ and Nicholas Spurlock. I just want to know if the scammer used a fake name or taking information from that company claiming to be that company? According to sunbiz.org the company was dissolved last September 2022. I believe they registered online from abroad to appear more legit. Another question is how come the domain was registered for ten years from December 2020 to December 2030 according to Whois? So the  scammer created that domain to appear more legit? Lunofund and Xqtraders are same crypto scam company created by Nigerians because both website was taken down on October 2022 claiming to have issue with original host but they ran away with the money.Both website were reported by users for illegal activities.Opinions will be appreciated.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467143",
  "comments": [
    {
      "author": "Gladitorcomeback",
      "created_time": "September 18, 2023, 01:15:49 AM",
      "body": "Quote from: Hamada1983 on September 18, 2023, 12:56:15 AMI just posted a topic about Xqtraders after being scammed on crypto trading October 2022. If you have already created a thread upon this topic then kindly use the same previous thread for making any updates or asking any questions. I checked your previous thread and it's was active and many members have researched on this scam issue. I will recommend to make a new reply there.Previous threadhttps://bitcointalk.org/index.php?topic=5433432.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "September 18, 2023, 10:15:27 AM",
      "body": "I just went through your previous thread and I noticed that you asked the same question that is in your first paragraph in the previous thread and you got an answer to that question.While to your second question, most times when we check the information of an investment site on whois the first thing we check is “when did they create their site” and “when will their domain expire” so there’s a high possibility that they choose for it to have that registration date so as to deceive those that will check to see if they’ll be staying long or gonna run away with their investment (that does not mean a shit tho).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "September 18, 2023, 11:06:02 AM",
      "body": "Quote from: Hamada1983 on September 18, 2023, 12:56:15 AMAnother question is how come the domain was registered for ten years from December 2020 to December 2030 according to Whois? So the  scammer created that domain to appear more legit? Lunofund and Xqtraders are same crypto scam company created by Nigerians because both website was taken down on October 2022 claiming to have issue with original host but they ran away with the money.Both website were reported by users for illegal activities.Opinions will be appreciated.If you have enough and sufficient evidence over all these projects then why not create a scam accusation and follow the normal procedure for proper report, also make sure that you have enough evidence to support your claim in other to make it well presentable, the essence of these is not to get them banned because the forum does not moderate scam but to let others know the implications of making any deal with them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "September 18, 2023, 09:18:29 PM",
      "body": "Quote from: Cantsay on September 18, 2023, 10:15:27 AMI just went through your previous thread and I noticed that you asked the same question that is in your first paragraph in the previous thread and you got an answer to that question.While to your second question, most times when we check the information of an investment site on whois the first thing we check is “when did they create their site” and “when will their domain expire” so there’s a high possibility that they choose for it to have that registration date so as to deceive those that will check to see if they’ll be staying long or gonna run away with their investment (that does not mean a shit tho).I agree it's not really the date of registration and expiration there are domain registrars that offer higher discounts on domains that are purchased or renewed for additional years, domain expiration is an additional hint of the project's bad intention you have to go deeper to check is a scam or will turn to scam.The site is not accessible and may have already been reported or they have taken it down already, if OP has been scammed he should follow the right format but I consider this already valid as there are bad reports about Xqtraders, but OP need not create another thread for this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamada1983",
      "created_time": "September 19, 2023, 02:11:34 PMLast edit: September 19, 2023, 04:23:13 PM by Hamada1983",
      "body": "How do I delete this thread? Someone told me to multiple thread is not allowed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "September 19, 2023, 04:10:46 PM",
      "body": "Quote from: Hamada1983 on September 19, 2023, 02:11:34 PMHow do I delete this thread? Someone told me to multiple thread is not allowed.You cannot delete this thread you can only lock it by clicking edit and on the bottom you can see the lock topic link you click it and the topic will be locked.Next time follow the forum rules It is useless to create multiple threads for one subject, you will not achieve the result that you want if you have two topics it will mislead readers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}