{
  "id": "topic_5470455",
  "title": "Amphenomenon",
  "author": "Amphenomenon",
  "created_time": "October 15, 2023, 06:52:30 PM",
  "content": "We all know the importance of centralise exchanges in our country, though they are not the best because the risks in it is greater than the benefits but when you get to understand a way of avoiding the risks then you can enjoy the benefits with having little worries. The two common we use CEX are trading and p2p but my focus today is the p2p. We know the risks involve in buying and selling our bitcoin to vendors even sometimes the trusted still scam especially when the amount is huge or they know that you can`t catch/locate them, alot of people has fallen victim and many will still fall victim to these scammers. To avoid these issues  many Nigerians have opt for using exchanges like binance, kucoin, remitano and others, which has trusted p2p transaction and this has really helps us well. Aside this, the p2p exchange rate from the exchanges are better than the exchange rate of these vendors most times because some of them buy/sell from these exchanges and so will have to to make their gains. These exchanges doesn't stop the scam of p2p but just reduce the risk and also serves mediator to help you get your fund's in case the other party try to scam you but that's if it was done according to their terms and conditions. some ways by which we avoid the risks involved in CEX include:Use exchanges with good reputation and always try to stay inform about the exchange Always remember the phrase Not Your Key Not Your WalletOnly keep few of your coin which you know you either use for trading/use frequently you don't have to store gains from trading there Still yet we ought to be cautious when using p2p like addressed here: Be smart while using a p2p exchanges and Pay attention on xchange's P2P transactions. Question:Aside all the dangers on these exchanges, there have been really helpful to us, How do think Nigeria would have gone in our bitcoin adoption without CEX and also how bad would be the scamming rate on p2p ?ps, I notice that there have been some post from some users about the number of none bitcoin related post on the board which is good but the approach makes it more like you are spamming the board I guess that is the reason our seniors on this board use this  thread instead of creating two or more post like as been done by some others.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470455",
  "comments": [
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "October 25, 2023, 04:14:23 AM",
      "body": "Quote from: Amphenomenon on October 15, 2023, 06:52:30 PMQuestion:Aside all the dangers on these exchanges, there have been really helpful to us, How do think Nigeria would have gone in our bitcoin adoption without CEX and also how bad would be the scamming rate on p2p ?I guess we'll never know  quoting Kanye west Grammy winning speech . Before anything become a success, there's always a trying or I'll say failure stages but they always progress pass that stages. Bitcoin would had still succeeded without CEX. CEX only made the adoption faster and na the same thing wey happen for Nigeria be dat. Truly the CEX dem make everything easier and safer but at what cost, our privacy? not enjoying true decentralization wey Bitcoin promised? Most Nigerian aren't using Bitcoin in a decentralized manner, dat's why we can't relate well when people dey discuss all those talk wey focus for dat side and na dat one wey you go dey call better adoption? What's the difference between using our local banks and using Binance exchange? When you use both you're still using a centralized third party so no difference. Same thing wey your banks fit do you na wetin all those CEX exchange go still fit do you so although they made it a little bit safer but they took away the privilege to enjoy real decentralization.You never noticed say dApp no dey get better wave for the country na so so centralized service full everywhere. If this CEX no be dey e for bring about innovative minds to work on dApp for the country and maybe we for dun put our names on the map in the crypto space. Wetin we dun fit achieve na for  dem to see us as consumers and not producers because na dem dey create everything and give us to consume. See as Binance exchange dey dominate everywhere you think say any better start-up wey dey decentralized fit get weight for the country. Centralized service is taking us backwards instead of progressing us forward for this crypto industry. I appreciate all they did but I think the industry would have been better without them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelward",
      "created_time": "October 25, 2023, 08:31:48 AM",
      "body": "You topic de very interesting because na debate for several discussions about di importance and relevance of CEX for crypto transactions. I don even take am start thread for economic section inside main board https://bitcointalk.org/index.php?topic=5462408.msg62661873#msg62661873 . The way wey i see am exchanges na unavailable middlemen for bitcoin transactions, for inside Nigeria, and for everywhere in the world. But as your focus na Nigeria, me i go say di exchanges de help reduce scams wey de for p2p transactions, because as bitcoin no get any centralized authority or office wey you go report to if person scam you for inside, no authority wey go help you trace di fraudulent transaction. And as e be say yahoo 419 plenty for di country, we need di exchanges to de reduce di chances of dem scams. Aldo if alternative de to bypass di CEX dem to de do transactions wey chances of scam no go de, me i for like am because bitcoin transactions suppose de decentralized, but as e be so we no get much choice, but to rely on exchanges wey get reputation to reduce scams..For di second matter wey you raise about why off topics de plenty for dis our board, i believe say di solution na to give us sub boards wey go accommodate oda none related topics to bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartGold01",
      "created_time": "October 25, 2023, 08:44:59 AM",
      "body": "Exchange like centralized exchange is something that brings the wide spread of bitcoin and the general awareness of cryptocurrencies especially those who don't have the privileges to smoothly interact with DEX as I can say, at some point connecting one wallet to a decentralized exchange were becoming more cautious of it. But today, people freely use centralized exchange to sell and buy bitcoin and any other currency through the banks if not for the restrictions that was sets by our Government not interacts and associates our banks details with cryptocurrency related operation, If not for centralized exchange I believe the rate of scam would have increased above this level. Actually the P2P came into active on binance when they noticed most countries doesn't allow her citizens to operate on cryptocurrency especially to buy directly from banks and when other platform noticed it they implemented same methods today we have lots of exchange that trades on p2p.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Amphenomenon",
      "created_time": "October 26, 2023, 02:40:31 AMLast edit: October 26, 2023, 02:53:25 AM by Amphenomenon",
      "body": "Quote from: CryptopreneurBrainboss on October 25, 2023, 04:14:23 AM-Snip-This is true and it's seems like dApps is slowly going out in Nigeria, only those interested in getting presale and airdrop might be using it won't be suprise that alot of Nigerians see binance and other CEX as a safe means of keeping their coins.Aside CEX, how do you think exchange like Bisq will fair in Nigeria if its becomes popular in Nigeria?Quote from: Kelward on October 25, 2023, 08:31:48 AMFor di second matter wey you raise about why off topics de plenty for dis our board, i believe say di solution na to give us sub boards wey go accommodate oda none related topics to bitcoin. Our local board is not even up to a year, we can't be making request after request, we need to show we can manage resources and responsible enough to control our board. The biggest issue we have been facing which was the low merit allocation, Hugeblack has supported us alot this past month with it.Also maybe we can have a Thread just like this African Proverbs in Pidgin, that would be use to make post aside bitcoin, politics and cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adultcrypto",
      "created_time": "October 26, 2023, 04:15:48 AM",
      "body": "The CEX you mentioned like Binance, Kucoin, Remitano and others which you did not mention like Luno, NairaEx and Naira4Dollar all played important part in putting Nigeria at the limelight in Bitcoin trading and usage. Without them, Nigerians would have relied on individual acting as third party and who often scam people without mercy. Although we have the genuine ones but you only find them after probably falling to scams. The only problem with Nigerians is that most of them store their funds on these exchanges and that is not safe. The knowledge of hardware wallets and other safe means of storage is not really deep in Nigeria. I just there is no breach of these CEX else it will really do so much damage to Nigerians.On the aspect of DEX, you are right that it is not popular here. Maybe with time they will especially if Nigerians start taking their privacy seriously.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "October 26, 2023, 05:57:18 AM",
      "body": "Quote from: Amphenomenon on October 15, 2023, 06:52:30 PM Aside this, the p2p exchange rate from the exchanges are better than the exchange rate of these vendors most times because some of them buy/sell from these exchanges and so will have to to make their gains. These exchanges doesn't stop the scam of p2p but just reduce the risk and also serves mediator to help you get your fund's in case the other party try to scam you but that's if it was done according to their terms and conditions. Exchanges na dem still be d best to use wen it comes to p2p services. Na dem dey provide d best service and dem go help safeguard your money make scammers no woo you with your money which everybody no fit take am. If you no know vendor neh physically, e no get use to go set trade with dem because you go dey on d verge of losing your money to fraud which many people don dey use take advantage of crypto people. Na dem dey contribute join to d bad name wey people dey attach to bitcoin. If everybody dey just and honest, we no go dey face all dis blackish for bitcoin matter, but as everybody wan dey claim wiseness criminally, e go continue dey affect everybody even d one’s wey no know anything about am.QuoteQuestion:Aside all the dangers on these exchanges, there have been really helpful to us, How do think Nigeria would have gone in our bitcoin adoption without CEX and also how bad would be the scamming rate on p2p ?Sincerely speaking, scamming rate on p2p go don dey high and dis na bad signal to d people wey go wan join and start dey use bitcoin. Also, d level of adoption wey don dey now no go don imminent by now. Despite say all dis centralised exchanges no dey trusted to leave money inside, people wey go dey careless with their keys go dey somehow safe while using and operating with a trusted exchange with reputation for the time being. Just take a look at Binance, if not everybody, almost everybody wey dey into crypto dey use that exchange and some people no even know say decentralised exchanges dey sef.  So tey d government been accuse Binance of having effect for d depreciation of naira to dollar that time. No matter d bad names attached to centralised exchanges, dey don play their own path in Bitcoin adoption for the society which we fit see and actually confirm am.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}