{
  "id": "topic_5485934",
  "title": "Youngkhngdiddy",
  "author": "Youngkhngdiddy",
  "created_time": "February 21, 2024, 03:54:12 PM",
  "content": "This is really a food for thought. Having a full thought on this, I will say 5.00 CGPA why? Cause one can get to improve more on their skills and acquire more skill set. That is one can work in any industry and acquire more pay. But with 5 BTC one will just have just a fixed number, what i mean is, any time btc goes up or down that's the whole amount you  have but with a 5.00 in a good field you can tend to grow what you earn. However, I still think this is not something that is debate-able for those in my country, especially in this trying times where we are seeing a hike in inflation and economy crisis. I’m sure majority will go for the 5 btc without hesitation the economy has guard up our survival instincts to a whole different level. The system has made us to believe that you have to go through the educational process to get a good life and be responsible. Good thing we have a lot of prominent people who do not have a degree to determine their wealth, we now have a lot of young people who are ready to give  up going to university or college, if they have a paying idea or skill or what ever that makes them income.  Although, this does not dispute the fact that education is ìmportant, we should give credit to the smart and intelligent ones because, their time and effort of being the best should be rewarded accordingly. Well, which would you rather go for if you had the chance,  would you rather chase a degree, get good grades to work in an industry or quit school and accept 5 BCT, what's your opinion?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5485934",
  "comments": [
    {
      "author": "Nwada001",
      "created_time": "February 21, 2024, 04:09:59 PM",
      "body": "The question here is: Is everyone interested in those grades? There are people who are obsessed with academics and want a good grade because they believe that with such a grade they can achieve whatever they want in life. That works for most of them.  There are also people who are focused only on learning how to read, and chasing those degrees is not that important to them; they are more focused on developing themselves with skills that can be beneficial to them. They believe in practicality rather than going for those grades, which they don't see as necessary. We are all out here for different dreams that land on almost the same goal. So if you are to ask someone who only needs to build up their life, develop a skill, and chase their career, they will choose the 5 BTC because it will help them achieve anything they need very quickly. It's a lot of money to set someone up.  Whichever way, one thing you need to know is this: getting a 5 CGPA as a grade does not guarantee you success; no company is looking to employ a certificate; rather, they are focused on who can bring in productivity and help them achieve their aim. You can have those grades but still lack the skills needed to fit in on today's labour market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "February 21, 2024, 04:11:27 PM",
      "body": "There's really no right answer to this. Will you be able to capitalize on your formal education, and with a steep enough long-term growth? Then sure. But at the same time, some people really don't need that high of a formal education to be able to make money and be successful. It'll really depend on the person.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "February 21, 2024, 04:47:47 PM",
      "body": "Quote from: Youngkhngdiddy on February 21, 2024, 03:54:12 PM This is really a food for thought. Having a full thought on this, I will say 5.00 CGPA why? Cause one can get to improve more on their skills and acquire more skill set. That is one can work in any industry and acquire more pay. But with 5 BTC one will just have just a fixed number, what i mean is, any time btc goes up or down that's the whole amount you  have but with a 5.00 in a good field you can tend to grow what you earn. However, I still think this is not something that is debate-able for those in my country, especially in this trying times where we are seeing a hike in inflation and economy crisis. I’m sure majority will go for the 5 btc without hesitation the economy has guard up our survival instincts to a whole different level. The system has made us to believe that you have to go through the educational process to get a good life and be responsible. Good thing we have a lot of prominent people who do not have a degree to determine their wealth, we now have a lot of young people who are ready to give  up going to university or college, if they have a paying idea or skill or what ever that makes them income.  Although, this does not dispute the fact that education is ìmportant, we should give credit to the smart and intelligent ones because, their time and effort of being the best should be rewarded accordingly. Well, which would you rather go for if you had the chance,  would you rather chase a degree, get good grades to work in an industry or quit school and accept 5 BCT, what's your opinion?It depends. If I get 5 CGPA from a very well reputed university then it means I am really good at what I do.I would get a good job at one of the FAANG companies and in a matter of few years I will be able to accumulate 5 BTC.So having a high IQ would be my preference to secure both 5 CGPA as well as 5 BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "February 21, 2024, 04:50:18 PM",
      "body": "This has to be determined by the current situation at the time the option is presented. When bitcoin was first introduced several years ago, many people, including myself, would prefer to go to school, earn a good grade, and work in a reputable industry. Today, as it stands, and given how bitcoin has evolved over the years, I will not hesitate to go with the 5BTC despite its volatility because even after school, a good work is not guaranteed for you. As you mentioned, it may still depend on where you are from and the value of 5BTC when converted to your fiat currency. I know a lot of people today who graduated with good grades but had to settle for menial jobs because of bad economy of the country they live in. Those kind of people and those looking up to them won’t hesitate to go for 5BTC when this options are presented to them to chose from.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "February 21, 2024, 04:50:37 PM",
      "body": "Quote from: Youngkhngdiddy on February 21, 2024, 03:54:12 PM This is really a food for thought. Having a full thought on this, I will say 5.00 CGPA why? Cause one can get to improve more on their skills and acquire more skill set.One does not need to even to go to universities just to acquire a skill set. Experience is your biggest teacher. I know lots of people who did not even graduate but are now very successful. Meanwhile, I do know people who had amazing grades but are working with only an average salary.Your cgpa is the fixed number. Grades are only important when you are first applying to jobs however a few years after you graduate companies or employers do not look at your educational attainment as much anymore because they would rather see your experience in the field.Quotewould you rather chase a degree, get good grades to work in an industry or quit school and accept 5 BCT, what's your opinion?Is it not your goal in attending school is to gain money? If you are given 5 btc you already have so much than what you will earn from a degree in 5 years maybe even 10 for some. But for me, even I have the 5 btc I would still want to study and finish school. Money is not my end goal but it will make things easier and much more comfortable if I had the 5 btc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "snowpega",
      "created_time": "February 21, 2024, 05:47:47 PM",
      "body": "haha... what a nice topic  Dear why are you comparing these things Education is important and money is also important. Well, I do not know what kind of mentality you have behind the creation of this topic. Education is important and getting good grades does not mean you will be a successful person in life or in any field until you do not have any solid and good skills. Along with education skills are the most necessary thing that every student should focus on.Besides all that, if you think 5 Bitcoin right Money is the most important thing you need to have for your survival through which you can fulfill your daily expenses and family expenses, and with the help of money you can get an education and get any kind of skill. So, in conclusion, I would say this topic is not that much strong topic where we all can have real-time talk, and comparing like this is not the real thing. What do you say? You need money at the end of the day to fulfill your each desire or dream so without money how can any person survive?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "February 21, 2024, 06:03:51 PMLast edit: February 21, 2024, 08:53:07 PM by SatoPrincess",
      "body": "I will choose 5bitcoins over a first class degree. 1bitcoin today is worth $50,940. A CGPA of 5.0 is worth what? Can’t put an exact number on it. Having a high CGPA helps in getting the jobs you want, recruiters love to interview people who they think are highly qualified for the position. It automatically gets your foot in the door, but there are also stereotypes that comes with having a 5.0 cgpa, recruiters may assume you are not sociable, introvert or lack people skills just because of your degree. This will definitely set you back if you’re applying for a sales position. I don’t think companies care much about cgpa the way professors make it seem like while in the university. What makes you hirable is your experience, ability to learn on the job and adapt to certain situations. Companies want employees who are passionate about their work, the technical aspects can be learned from experience.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bolshojkush",
      "created_time": "February 21, 2024, 06:08:01 PM",
      "body": "Quote from: Youngkhngdiddy on February 21, 2024, 03:54:12 PM This is really a food for thought. Having a full thought on this, I will say 5.00 CGPA why? Cause one can get to improve more on their skills and acquire more skill set. That is one can work in any industry and acquire more pay. But with 5 BTC one will just have just a fixed number, what i mean is, any time btc goes up or down that's the whole amount you  have but with a 5.00 in a good field you can tend to grow what you earn. However, I still think this is not something that is debate-able for those in my country, especially in this trying times where we are seeing a hike in inflation and economy crisis. I’m sure majority will go for the 5 btc without hesitation the economy has guard up our survival instincts to a whole different level. The system has made us to believe that you have to go through the educational process to get a good life and be responsible. Good thing we have a lot of prominent people who do not have a degree to determine their wealth, we now have a lot of young people who are ready to give  up going to university or college, if they have a paying idea or skill or what ever that makes them income.  Although, this does not dispute the fact that education is ìmportant, we should give credit to the smart and intelligent ones because, their time and effort of being the best should be rewarded accordingly. Well, which would you rather go for if you had the chance,  would you rather chase a degree, get good grades to work in an industry or quit school and accept 5 BCT, what's your opinion?I am absolutely convinced that everything depends on the individual. For some, studying is simply necessary, because they will never be able to develop in their lives in any other way, other people succeed no matter what they do, and they are quite successful people who do not need studying. All people are different and an individual approach is needed here. There are many examples of successful people who have not graduated from any educational institution after school, but nevertheless they are professionals in their field of activity and earn a lot of money. Therefore, everyone should decide for himself what he should do, choose education or bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "February 21, 2024, 06:41:02 PM",
      "body": "@OP you are probably hunting for a job in your disposition.  I would rather have the 5 BTC and work on my entrepreneurial skills to set up a business and be successful in it.  It does look good with a 5.0 CGPA (Cumulative Grade Point Average) but it will probably take you a long time to accumulate 5.0 BTC worth of cash (at least in my place) if you are only starting to look for a job.  While choosing 5.0 BTC instantly gives you around a little more than $250k at the current exchange rate.  This will enable a person to have funds or capital to set up a business.  In my place, this will settle me with houses, and cars, and still have a deep pocket for a business.  Having 5 BTC will allow me to live a comfortable life even if I don't work for a lifetime.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "February 21, 2024, 06:42:14 PM",
      "body": "So having good grades versus having 5 Bitcoin? Well, if you hold 5 Bitcoin long enough you'll be rich. But of course in the meantime you need to make money to live on. Building ones marketable skills and being able to earn or create an income for oneself is always the MOST valuable economic thing someone can attain. You may never get as rich as if you had been able to hold onto 5 bitcoin, but you can earn income for life.If someone quits school to take 5 bitcoin, but they can still earn enough in a job to get by, and wait a few years until bitcoin is up at like $200k and then start using a little bit of bitcoin each year to supplement their income to live a nicer higher cost-of-living life (say 0.1 BTC or less for 50+ years, with the economic quality of life of that person continuing to rise over the long term as the value of Bitcoin rises), that could be worth it. As long as what they were quitting on wasn't like their passion in life. Never give up your passion to take a lump sum of money. Life is about a lot more than having money.In general though, earning potential beats assets, because earning potential earns you money to buy assets with. And 5 bitcoin isn't YET so much money that its a fortune. Since Bitcoin is a currency and not a \"productive asset\" you have to use it to access any economic value from it. For productive assets of course once the annual payout reaches your income that asset is far superior. But with Bitcoin the calculation would have to be \"over the course of your life will it produce more economic value as you spend it than having a career would\".As bolshojkush said, it would entirely depend on the individual's situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "February 21, 2024, 07:02:41 PM",
      "body": "What`s preventing me from achieving both of them?This topic has surfaced over the internet countless times, and yet there is no distinctive answer to it. For me, I will try to aim for both of them, and I will do it one at a time. According to your question, there`s no restriction against going for the other one after achieving one of them.I`ll first go for the 5BTC, and from there, I can fund my academics and aim for a 5.0CGPA in a course that won`t be difficult or require 15+ hours of study daily. So it won`t matter if I go for medicine and surgery or if I go for fishery as long as I get my 5.0 CGPA, that's all that will matter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "February 21, 2024, 07:03:04 PM",
      "body": "Quote from: SatoPrincess on February 21, 2024, 06:03:51 PMI will choose 5bitcoins over a first class degree.  5bitcoins today is worth $50,940. A CGPA of 5.0 is worth what? Can’t put an exact number on it. Having a high CGPA helps in getting the jobs you want, recruiters love to interview people who they think are highly qualified for the position. It automatically gets your foot in the door, but there are also stereotypes that comes with having a 5.0 cgpa, recruiters may assume you are not sociable, introvert or lack people skills just because of your degree. This will definitely set you back if you’re applying for a sales position. I don’t think companies care much about cgpa the way professors make it seem like while in the university. What makes you hirable is your experience, ability to learn on the job and adapt to certain situations. Companies want employees who are passionate about their work, the technical aspects can be learned from experience. I guess you mean 1BTC is equal to $50k+ and not 5BTC worth $50k+. Currently, 5 BTC should be around $254k+, which is a big amount of money that, if put to good use, can set one up above whatever white collar job you will be using that grade for.  Like I said above, which also ties in with your point, the grade is just a number if the person can't defend it. You need to be equipped upstairs in order to achieve those high-paying jobs. No company wants to hire someone who can't help them skillfully. Those certificates are evidence of what you should be capable of, but if you're not equipped with the brain, then it's useless.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "February 21, 2024, 07:22:44 PM",
      "body": "Quote from: SatoPrincess on February 21, 2024, 06:03:51 PMI will choose 5bitcoins over a first class degree. 5bitcoins today is worth $50,940. A CGPA of 5.0 is worth what? Can’t put an exact number on it. Having a high CGPA helps in getting the jobs you want, recruiters love to interview people who they think are highly qualified for the position. It automatically gets your foot in the door, but there are also stereotypes that comes with having a 5.0 cgpa, recruiters may assume you are not sociable, introvert or lack people skills just because of your degree. This will definitely set you back if you’re applying for a sales position. I don’t think companies care much about cgpa the way professors make it seem like while in the university. What makes you hirable is your experience, ability to learn on the job and adapt to certain situations. Companies want employees who are passionate about their work, the technical aspects can be learned from experience. In a working society, attaining a CGPA of 5.00 is priceless. Such a person will be an instant target for many top organisations that are willing to offer automatic lucrative employment. In some higher institutions, such a graduate is given a job to lecture in the university. When one has a good or high-paying job, accumulating Bitcoin can be easier. Companies don't care about first-class degrees in most developing countries because such grades can now be bought by money to undeserving students. But you cannot say that a first-class graduate from Yale, MIT or Havard will not attract some of the high-paying employers. Most of these top universities combine both theory and practical learning and they keep upgrading their curriculum to suit the current global tasks. Based on the condition I find myself in my country, I would prefer to own Bitcoin because good grades don't matter in my location. Certificates or grades are irrelevant in my country because they don't determine the true test of knowledge because of our retrogressive educational system. Bribery and corruption, tribalism, and religious fanatism have contributed to making certificates worthless, so give me the Bitcoin and I will sort other things out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "February 21, 2024, 07:34:44 PM",
      "body": "For me, 5 bitcoins is enough to live a luxurious lifestyle the rest of my life. So definitely, I have to choose 5 bitcoins for me instead of a higher educational score. The answer would be different based on circumstances, and a few may choose a higher degree with good grades. Do you think the world's richest person achieves that position through a high-grade degree? I don't think so; they use their brains and work hard to achieve that. It isn't necessary to have a high-grade degree.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "February 21, 2024, 07:37:44 PM",
      "body": "Get that 5 BTC, study and try to achieve those academic goals and grades that you wish to achieve. Because time will come that 5 BTC is going to be a lot, actually it's already a lot as of this time. Having $250k is enough to have a good standard of living while you study. Or get the most of that 5 BTC and wait for the right time to come and sell it, and have a good education. If there's an opportunity for you to have it right now, why not? Study can wait although time is going to pass. While having that amount, you have already the advantage over those that are studying and they'll get tired to work achieving those goals that you already have through having 5 BTC. It's a case to case basis but asking this on a Bitcoin forum, you'll get most people here telling you that we'll choose 5 BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "February 21, 2024, 08:11:41 PM",
      "body": "Is 5 a good grade? I always thought that this system is based on % so 5 is 50%. I haven't really used that system in my time, but where I studied 50% on a test would get you an F You needed 60% to pass. I'm going to skip the fact that I'm long past the school system, but if I were to choose for my child, I'd rather she had 5BTC to start with than good grades. 5BTC already gives you any start in life that you want. It can be your own business, private school, courses... Let's say you have a child who wants to be a pilot. Good grades won't cut it, you need money to get some fly hours and a license which isn't cheap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "February 21, 2024, 08:22:22 PM",
      "body": "Quote from: Youngkhngdiddy on February 21, 2024, 03:54:12 PM This is really a food for thought. Having a full thought on this, I will say 5.00 CGPA why? Cause one can get to improve more on their skills and acquire more skill set. That is one can work in any industry and acquire more pay. But with 5 BTC one will just have just a fixed number, what i mean is, any time btc goes up or down that's the whole amount you  have but with a 5.00 in a good field you can tend to grow what you earn. However, I still think this is not something that is debate-able for those in my country, especially in this trying times where we are seeing a hike in inflation and economy crisis. I’m sure majority will go for the 5 btc without hesitation the economy has guard up our survival instincts to a whole different level. The system has made us to believe that you have to go through the educational process to get a good life and be responsible. Good thing we have a lot of prominent people who do not have a degree to determine their wealth, we now have a lot of young people who are ready to give  up going to university or college, if they have a paying idea or skill or what ever that makes them income.  Although, this does not dispute the fact that education is ìmportant, we should give credit to the smart and intelligent ones because, their time and effort of being the best should be rewarded accordingly. Well, which would you rather go for if you had the chance,  would you rather chase a degree, get good grades to work in an industry or quit school and accept 5 BCT, what's your opinion?I would rather go for the education rather than the 5 BTC but you posed your question in a strange fashion... It sounded like you were saying what would you rather get (as in instantly) good grades or Bitcoin. Because if thats the case, I would prefer the 5 BTC over the free good grades. In fact, I do not care about the grades, nor the piece of paper that says I have a qualification for so and so. Without the knowledge and skills it would be worthless anyway. You could have a non-perfect score and it would still be worth the time you put into studying. Nobody needs a perfect grade.The better and more precise question should be 5 BTC or give up on your education forever? Obviously a chance for good education is the better investment than the 5 BTC but most countries in the world (except the USA, where education and medicine is considered a luxury) already offer free chances for education.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Y3shot",
      "created_time": "February 21, 2024, 08:42:08 PM",
      "body": "5.00 CGPA is not a guarantee that one will be rich,  you can still get high cgpa and still be poor but having a 5 BTC is a lot of money that can change one's life even  till the next generation if it is invested very well. I will go for 5 bitcoin and I know if I invest very well I will be happy with myself and I will make a better career for myself. 5btc have more value than having cgpa of 5, this is something you don't need to think about twice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "February 21, 2024, 09:00:45 PM",
      "body": "Quote from: Zlantann on February 21, 2024, 07:22:44 PMIn a working society, attaining a CGPA of 5.00 is priceless. Such a person will be an instant target for many top organisations that are willing to offer automatic lucrative employment. In some higher institutions, such a graduate is given a job to lecture in the university. When one has a good or high-paying job, accumulating Bitcoin can be easier. Companies don't care about first-class degrees in most developing countries because such grades can now be bought by money to undeserving students. But you cannot say that a first-class graduate from Yale, MIT or Havard will not attract some of the high-paying employers. Most of these top universities combine both theory and practical learning and they keep upgrading their curriculum to suit the current global tasks. It depends on your field of study. Having a 5.0 cgpa in non professional course cannot automatically open doors of opportunity to you. Like I said before, companies look at other things aside from grades when recruiting people. You chose to use MIT, Harvard, Yale as your base of argument, these schools have a reputation and even if you graduate will a average grade, you would still be able to get a good job. Quote from: Nwada001 on February 21, 2024, 07:03:04 PMI guess you mean 1BTC is equal to $50k+ and not 5BTC worth $50k+.Thanks for the correction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}