{
  "id": "topic_5434504",
  "title": "VinceAbernathy",
  "author": "VinceAbernathy",
  "created_time": "January 12, 2023, 07:38:43 PMLast edit: January 19, 2023, 10:20:33 AM by VinceAbernathy",
  "content": "I recently heard about Blue Chip NFTs and wanted to learn more. After doing some research, I can say that Blue Chip NFTs are a type of Non-Fungible Token (NFT) created on the Ethereum blockchain that represent ownership of a digital asset such as artwork, music, or digital collectibles.https://blog.alphaguilty.io/what-is-a-blue-chip-nftThe benefits of owning a Blue Chip NFT are numerous; they are highly secure and provide a unique digital asset to collect. Additionally, Blue Chip NFTs are a great way for artists to showcase and monetize their work, as well as for investors to have a tangible asset to store value.Overall, I believe that Blue Chip NFTs are a great addition to the world of digital assets. They offer a secure, unique, and valuable asset to collect and store value.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434504",
  "comments": [
    {
      "author": "blockman",
      "created_time": "January 12, 2023, 08:25:21 PM",
      "body": "This is the wrong board to discuss NFTs. This board is for Bitcoin Discussion so move this thread to Altcoin Discussion (https://bitcointalk.org/index.php?board=67.0) where all discussions are related to NFT/Altcoins.Anyway as for these NFTs, whether they're branded or whatever is the name of it what I believe is most of them are nearly done and if ever some new NFTs will emerge, they'll just be few, really few.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "January 12, 2023, 11:11:17 PM",
      "body": "Quote from: blockman on January 12, 2023, 08:25:21 PMThis is the wrong board to discuss NFTs. This board is for Bitcoin Discussion so move this thread to Altcoin Discussion (https://bitcointalk.org/index.php?board=67.0) where all discussions are related to NFT/Altcoins.Anyway as for these NFTs, whether they're branded or whatever is the name of it what I believe is most of them are nearly done and if ever some new NFTs will emerge, they'll just be few, really few.Yeah, it seems that the market is very saturated with this NFT's and whatnot. So not sure why Blue Chip is different from other before it. I know that the NFT thingy is still hype up to this day and people are taking advantage of it. But if the market is saturated then there will be a point in time wherein we gets tired of it, just saying.Here is a good definition of it,QuoteBlue chip NFTs are projects that are expected to be stable in terms of value and profitable in the long term. -Blue chip NFTs have several characteristics in common – a relatively high floor price, brand power, celebrity endorsements, commitment of the project team, and real-world utility. -Blue chip NFTs include Bored Ape Yacht Club, Mutant Ape Yacht Club, Crypto Punks, and ENS: Ethereum Name Servicehttps://decrypt.co/resources/what-is-a-blue-chip-nft",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TastyChillySauce00",
      "created_time": "January 12, 2023, 11:43:10 PM",
      "body": "Blue chip NFTs were only over hyped NFTs. I didn't even see any usefulness from these kind of NFT. Bluechip NFT was also the most suitable way for artist to seize your money. I didn't see how this can be considered as investment. There's no something special from this NFT other than the big hype that was making the price floor relatively high. Another good this is when NFT will be airdropped with the token that issued by the creator of NFTs. It seems for me that these kind of blue chip NFTs are so garbage. It's full with manipulation. The long term value were not even stable. It's the same like token as it's going up and down. They were nothing before but after some manipulations happened and they have high price floor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "January 13, 2023, 01:17:43 AM",
      "body": "Quote from: VinceAbernathy on January 12, 2023, 07:38:43 PMOverall, I believe that Blue Chip NFTs are a great addition to the world of digital assets. They offer a secure, unique, and valuable asset to collect and store value.How unique? There are so many NFTs offering the same products and features. Every unique and original collection of NFTs is a worthless bunch of avatars which people wouldn't pay 1$ if it wasn't because of the speculative hype. The arts are basic and simple, there is nothing special about them to justify a price of million of dollars, as some were sold. Store of value is bitcoin, be careful with such garbage being sold to you as gold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "January 13, 2023, 02:32:37 AM",
      "body": "NFT industry is built on greediness and hype together with many scams. You won't be able to find bluechip NFTs.They are kind of altcoins but how many bluechip altcoins you can have in cryptocurrency market? Not more than one hand.For me I can name only Ethereum, BNB (Binance token) and maybe UNI token (from Uniswap) to the list of bluechip altcoins.Sandbox, Decentraland, Axie Infinity are suffered seriously by dump pressure from their gamers, not only from the bear market. In addition, those NFT projects raised funds from the crowd by many sale rounds, Serie A, B, C, private, seed, public sales that bring dump pressure when their tokens get unlocked.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "January 13, 2023, 03:28:39 AM",
      "body": "Quote from: VinceAbernathy on January 12, 2023, 07:38:43 PMI recently heard about Blue Chip NFTs and wanted to learn more. After doing some research, I can say that Blue Chip NFTs are a type of Non-Fungible Token (NFT) created on the Ethereum blockchain that represent ownership of a digital asset such as artwork, music, or digital collectibles.The benefits of owning a Blue Chip NFT are numerous; they are highly secure and provide a unique digital asset to collect. Additionally, Blue Chip NFTs are a great way for artists to showcase and monetize their work, as well as for investors to have a tangible asset to store value.Overall, I believe that Blue Chip NFTs are a great addition to the world of digital assets. They offer a secure, unique, and valuable asset to collect and store value.Blue chip NFTs are a bigger scam than normal NFTs. rest all are same! They are structured in the same way! But since the NFT market is completely saturated (it was expected), the NFT makers were looking for a marketing buzzword so that they can at least sell off their computer-generated images which failed to find a buyer. There is nothing called blue chip NFT. It's all about creating a buzz in the market. Think about ICO market. When ICO boom was slowing down, ICO scammers were thinking of something else to sell off their tokens in the name of IEO, IDO etc. Blue Chip NFT is just same!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "January 13, 2023, 03:54:44 AM",
      "body": "Quote from: avikz on January 13, 2023, 03:28:39 AMBlue chip NFTs are a bigger scam than normal NFTs. rest all are same! They are structured in the same way! But since the NFT market is completely saturated (it was expected), the NFT makers were looking for a marketing buzzword so that they can at least sell off their computer-generated images which failed to find a buyer.I neither support nor hate them (NFTs), but, mate, you should know all about them first before giving your opinion on them. Yes, i know they are hype driven, but they are actually more than you think. They are just like any other, offering use-cases. for the use-cases they offer, you can look for them on the Internet.Quote from: avikz on January 13, 2023, 03:28:39 AMThink about ICO market. When ICO boom was slowing down, ICO scammers were thinking of something else to sell off their tokens in the name of IEO, IDO etc.That's called evolving to be at a better level, mate. Imagine if the ICO hype continues, there will be more and more people who will be tricked. Therefore, now we know more about initial offerings that are better, which aim to protect investors, the most promising IMO is the IEO (on Binance).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cloirecrom",
      "created_time": "January 13, 2023, 04:01:22 AM",
      "body": "Quote from: OcTradism on January 13, 2023, 02:32:37 AMNFT industry is built on greediness and hype together with many scams. You won't be able to find bluechip NFTs.They are kind of altcoins but how many bluechip altcoins you can have in cryptocurrency market? Not more than one hand.For me I can name only Ethereum, BNB (Binance token) and maybe UNI token (from Uniswap) to the list of bluechip altcoins.Sandbox, Decentraland, Axie Infinity are suffered seriously by dump pressure from their gamers, not only from the bear market. In addition, those NFT projects raised funds from the crowd by many sale rounds, Serie A, B, C, private, seed, public sales that bring dump pressure when their tokens get unlocked.cause there is opportunity on it. same think can be said with  crypto project, stock market, bank system list goes on.some only produce useless nft build unto hype. but there are many real project with real utility that need nft to work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "January 13, 2023, 04:26:50 AM",
      "body": "Not different with a non blue chip nft except that its branded as secure or legit. However, regardless whether its good, the nft market is highly saturated now and you can see a lot of projects go down. Maybe before its really profitable, and even use case sometimes its not that worth at all to hold and only those rich are shilling those expensive jpeg nft for a price raise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "January 13, 2023, 04:58:47 AM",
      "body": "Quote from: VinceAbernathy on January 12, 2023, 07:38:43 PMI recently heard about Blue Chip NFTs and wanted to learn more. After doing some research, I can say that Blue Chip NFTs are a type of Non-Fungible Token (NFT) created on the Ethereum blockchain that represent ownership of a digital asset such as artwork, music, or digital collectibles.Uhm, that's just an NFT plain and simple, it's not a \"Blue Chip\" NFT specifically.Quote from: VinceAbernathy on January 12, 2023, 07:38:43 PMThe benefits of owning a Blue Chip NFT are numerous; they are highly secure and provide a unique digital asset to collect. Additionally, Blue Chip NFTs are a great way for artists to showcase and monetize their work, as well as for investors to have a tangible asset to store value.The benefits of not owning one are numerous as well, one you don't get the chance of being scammed, two you avoid scalpers that just boost the price up on purpose then crash it down after profiting, three, you can hire artists on their platforms as well, there's a LOT of freelance platforms out there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}