{
  "id": "topic_5433145",
  "title": "krishnaverma",
  "author": "krishnaverma",
  "created_time": "January 05, 2023, 02:50:17 PMLast edit: January 05, 2023, 03:53:59 PM by krishnaverma",
  "content": "Here is a report from CoinGatehttps://coingate.com/blog/post/crypto-payments-overview-2022I found the report very interesting. We all thought that 2022 was very bad for crypto as bear market continued for most part of the year. But so far as crypto payments for online payments is concerned, the data suggests otherwise. There is increase in total number as well as volume of crypto transactions. Another interesting data in this report is that bitcoin topped the total share of all payments. 48% of the transactions happened with bitcoin which proves that bitcoin is still the King of crypto even after we have thousands of alt coins.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433145",
  "comments": [
    {
      "author": "ryzaadit",
      "created_time": "January 05, 2023, 07:14:37 PM",
      "body": "Not surprised.Because is all about \"Regulation\", under 2017 we still get a strict restriction regulation from a lot country. At the time \"Bitcoin\" reaching all-new time high with a few news like El Salvador\" announce they accepting \"Bitcoin\" payment.The use-case is increase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "January 05, 2023, 07:29:15 PM",
      "body": "This year adoption will be more massive than that of last year, with the economy crisis happening around the world, and with the way governments are taxing every payment made under it's local currency, business owners and Marchants will be forced to adopt crypto as means of payment to avoid most taxes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "January 05, 2023, 08:03:11 PM",
      "body": "Quote from: Nwada001 on January 05, 2023, 07:29:15 PMThis year adoption will be more massive than that of last year, with the economy crisis happening around the world, and with the way governments are taxing every payment made under it's local currency, business owners and Marchants will be forced to adopt crypto as means of payment to avoid most taxes. With merchants looking for other alternative payment methods, bitcoin will really come up as one of the top choices for them.Though they are reading some negative news pertaining to the crypto market, but still some are trying to get hands on btc.Most businesses are going digital, and crypto is a very candidate to be included in the digital payment methods. If one business owner is satisfied with the inclusion of btc in particular, he will possibly endorse it to his colleagues, and word of mouth is a very good marketing tool.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "January 05, 2023, 11:47:09 PM",
      "body": "Quote from: krishnaverma on January 05, 2023, 02:50:17 PM48% of the transactions happened with bitcoin which proves that bitcoin is still the King of crypto even after we have thousands of alt coins. And that will increase in the next years to come. The mainstream media are all in for bitcoin and that's going to give it more time and exposure for people that still don't know it yet.Aside from that, there could be some other altcoins that might also gain a percentage of it but mainly will come I think from stable coins like USDT even if it's known that it can freeze someone's fund whether purposely or randomly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "krishnaverma",
      "created_time": "January 06, 2023, 03:37:06 AM",
      "body": "Quote from: Nwada001 on January 05, 2023, 07:29:15 PMThis year adoption will be more massive than that of last year, with the economy crisis happening around the world, and with the way governments are taxing every payment made under it's local currency, business owners and Marchants will be forced to adopt crypto as means of payment to avoid most taxes. That might be one of the reasons behind this. But Governments are powerful and evil enough to start putting heavy taxes on crypto transactions as well. The only option left with people is to hide these transactions from government which I never recommended to keep peace of mind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "January 06, 2023, 03:58:18 AM",
      "body": "The article points out that bitcoin still remain as the most popular cryptocurrency for payments, although its dominance decreased few percents in comparision to 2021.However, it's important to notice the difference didn't add to any altcoins which could be potential alternatives to replace bitcoin, rather it was the USDT stablecoin which gained more popularity. In my opinion that is normal and expected, as there is a significant portion of crypto enthusiasts who are constantly seeking for means to be less exposed to volatility on this market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "January 06, 2023, 04:13:58 AM",
      "body": "Quote from: krishnaverma on January 05, 2023, 02:50:17 PMHere is a report from CoinGatehttps://coingate.com/blog/post/crypto-payments-overview-2022I found the report very interesting. We all thought that 2022 was very bad for crypto as bear market continued for most part of the year. But so far as crypto payments for online payments is concerned, the data suggests otherwise. There is increase in total number as well as volume of crypto transactions. Another interesting data in this report is that bitcoin topped the total share of all payments. 48% of the transactions happened with bitcoin which proves that bitcoin is still the King of crypto even after we have thousands of alt coins. Very opposing activity as you have said, I think regardless of what is the current cycle, online payment will be big, imagine in the pandemic, everyone is buying stuff online thru credit cards, or crypto itself.So we can't compare the data about online payments and the bear market or the state that we are in right now.If will increase overtime, maybe in the next 2 years it will double that numbers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "oaz7t",
      "created_time": "January 06, 2023, 05:08:18 AMLast edit: January 06, 2023, 06:25:55 AM by oaz7t",
      "body": "Obviously man, number of bitcoin user is already very high as compared to multiple high performing altcoins. Which means mathematically there should be more number of bitcoin transactions as compared to the altcoins by default. Moreover, most of the altcoins are traded against BTC as trading pair which makes it top most currency in the crypto space. These are the against BTC as trading pair which makes it top most currency in the crypto space. These are the to evolve to the level bitcoin did. Only ETH we transactions as compared to the altcoins by default. Moreover, most of the altcoins are traded against BTC as trading pair which makes it top most currency in the against BTC as trading pair which makes it top most currency in the crypto space. These are the to evolve to the level bitcoin did. Only ETH we can see growing but it's been more than decade now it was not able to catch the tail of bitcoin. Lets stay relax and feel the power of Bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "January 06, 2023, 06:26:21 AM",
      "body": "Because payments and price are two different things...? And most countries have started creating more and more regulations that open up businesses to being able to accept crypto payments. Ofc I wouldn't necessarily call it \"regular\" yet, but it is going there imo. I reckon it'd only go up from here, with more and more countries opening up and more and more businesses starting to accept crypto. In the first place online payments have boomed back in the pandemic and hasn't exactly left us even though we're already opening up to f2f, and I hardly doubt it ever will.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "January 06, 2023, 10:28:28 AM",
      "body": "This is the classic example of a crypto adoption, sooner or later if people around the world will take advantage of crypto as a online crypto payment then the trend will continue. The problem is just online retailers doesn't want to accept it right away. So just imagine if Amazon will suddenly change their stance and allow let's say Bitcoin or Ethereum as a gateway payment, it will be huge for us.So let's see how it goes, I mean that there are websites that directly or indirectly accepts crypto as payment.But still a small percentage if I'm not mistaken.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fzkto",
      "created_time": "January 06, 2023, 11:50:14 AM",
      "body": "Quote from: krishnaverma on January 05, 2023, 02:50:17 PMHere is a report from CoinGatehttps://coingate.com/blog/post/crypto-payments-overview-2022I found the report very interesting. We all thought that 2022 was very bad for crypto as bear market continued for most part of the year. But so far as crypto payments for online payments is concerned, the data suggests otherwise. There is increase in total number as well as volume of crypto transactions. Another interesting data in this report is that bitcoin topped the total share of all payments. 48% of the transactions happened with bitcoin which proves that bitcoin is still the King of crypto even after we have thousands of alt coins. I thought stabelcoins was much more popular than Bitcoin, because the dollar is much more popular. Thanks to stabelcoins, there are now no restrictions on cashing out in different countries. With the current unstable situation in the world, I'm not surprised that people are using cryptocurrency for cross-border payments. This trend will probably increase even more in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "January 06, 2023, 12:10:46 PM",
      "body": "Quote from: krishnaverma on January 05, 2023, 02:50:17 PMHere is a report from CoinGatehttps://coingate.com/blog/post/crypto-payments-overview-2022I found the report very interesting. We all thought that 2022 was very bad for crypto as bear market continued for most part of the year. But so far as crypto payments for online payments is concerned, the data suggests otherwise. There is increase in total number as well as volume of crypto transactions. Another interesting data in this report is that bitcoin topped the total share of all payments. 48% of the transactions happened with bitcoin which proves that bitcoin is still the King of crypto even after we have thousands of alt coins. Bear market in crypto doesn't mean that use cases would drop. It just means that price goes down for a long time. People who like to use it for payments still use it for payments. For some services it's handy. Like for VPN for example it gives one more extra layer of privacy. And people who like to cash out and buy stuff but don't have bank account to do so. Or don't want that shows in their bank account history.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "January 06, 2023, 12:15:59 PM",
      "body": "The reports seem promising. Nevertheless, noting it only counts Coingate statistic usage, do in mind other third-party payments services, and other services or platforms that accept cryptocurrency payments by implementing their own payment gateway like BTCPay Server. Cryptocurrency adoption is diverse enough that a single piece of information from a specific service might not truly explain the wider or bigger picture. Quote from: Nwada001 on January 05, 2023, 07:29:15 PM~business owners and Marchants will be forced to adopt crypto as means of payment to avoid most taxes. Cryptocurrency is not made for tax evasion and Coingate also requires business verification. Their terms and conditions about taxes are also crystal clear.Quote from: https://coingate.com/purchaser-terms-and-conditions#Taxes15.1. It is your own responsibility for paying any taxes applicable to you in relation to using our System.15.2. We make no representations in relation to tax liabilities, assume no tax liability for any Purchaser, assume no responsibility for the tax liability of any Purchaser, not for collecting, reporting, withholding or remitting any taxes arising from your use of CoinGate System.15.3. In case we are obliged under applicable law or voluntarily decide to report to any competent authorities any information that is related with your tax obligations, you undertake to provide us with the requested documents, data and information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "January 06, 2023, 06:28:54 PM",
      "body": "Adoption could increase while having the price go down. How could this happen? Lets assume that the market cap is 1 trillion dollars, but only 10 billion dollars of that were used for online shopping, then another year the marketcap is 500 billion, but 20 billion of that is used for online shopping.See, you get the price going down, but the amount used on online shopping increased. That's basically this data shows, price is lower but more and more people are using it, and to be fair if given the option I would pick crypto over any other payment method as well, I always go with crypto than any other project and that's a lot better for me in the long run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "January 06, 2023, 06:58:48 PM",
      "body": "Yes, this is a good example of crypto adoption. As more people around the world begin using cryptocurrency for online transactions, there will be greater demand for it. But while many retailers have begun accepting cryptocurrency, others are reluctant to do so - because they don't understand it or regard is as risky. Retailers are hesitant to accept crypto payments because they’re unsure how it will affect their business if something goes wrong - for example, if the price of Bitcoin suddenly drops. They don’t want to risk losing money by accepting a payment method that could be volatile.But retailers are slowly realizing that there is no need for them to accept cryptocurrency payments directly. They can simply use a service like BitPay, CoinGate or Coinbase Commerce as an intermediary between their business and their customers. These companies will take care of all the complex technical stuff so retailers can focus on what they do best: selling products or services.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "krishnaverma",
      "created_time": "January 07, 2023, 01:17:15 PM",
      "body": "Quote from: el kaka22 on January 06, 2023, 06:28:54 PMAdoption could increase while having the price go down. How could this happen? Lets assume that the market cap is 1 trillion dollars, but only 10 billion dollars of that were used for online shopping, then another year the marketcap is 500 billion, but 20 billion of that is used for online shopping.See, you get the price going down, but the amount used on online shopping increased. That's basically this data shows, price is lower but more and more people are using it, and to be fair if given the option I would pick crypto over any other payment method as well, I always go with crypto than any other project and that's a lot better for me in the long run.All the bitcoin in circulation is not being used for shopping. So even if shopping total has increases, overall demand might be less. This is the reason I can give for price going down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "asawale",
      "created_time": "January 07, 2023, 01:52:55 PM",
      "body": "Quote from: krishnaverma on January 05, 2023, 02:50:17 PMHere is a report from CoinGatehttps://coingate.com/blog/post/crypto-payments-overview-2022I found the report very interesting. We all thought that 2022 was very bad for crypto as bear market continued for most part of the year. But so far as crypto payments for online payments is concerned, the data suggests otherwise. There is increase in total number as well as volume of crypto transactions. Another interesting data in this report is that bitcoin topped the total share of all payments. 48% of the transactions happened with bitcoin which proves that bitcoin is still the King of crypto even after we have thousands of alt coins. It is really a plus for cryptocurrency world if cryptocurrency is accepted for payments, whether online or offline transactions as it expands the uses and utilities that drive the price of the coins concerned. Where challenges just occur is most of these stores may choose to accept a certain coin which one has not invested in. It means one will have to invest in or hold a whole lot of coin to trade on different stores online.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "January 07, 2023, 01:59:23 PM",
      "body": "Maybe they’re just a lot of people using it, but the people using it is somewhat accepting of the current price of that specific crypto so that it just stays on the same range or probably selling it off by the sellers that receive that kind of payment method and immediately converted into fiat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasisog",
      "created_time": "January 07, 2023, 05:54:18 PM",
      "body": "Merchants and huge business platforms are now noticing that there are already lots of crypto users so most of them are starting to adopt crypto which is a good sign of more upcoming adoptions this year. We all want mass adoption because it's a sign that the crypto industry is growing and it is also needed for the stronger foundation of the crypto market. If more people would notice how convenient and helpful it is to transact using crypto, I'm sure that more businesses will be open to more adoptions and will consider accepting more cryptocurrencies in the coming months and years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}