{
  "id": "topic_5472894",
  "title": "BTC_pokaop",
  "author": "BTC_pokaop",
  "created_time": "November 05, 2023, 05:07:29 AM",
  "content": "I am new to this forum and have not learned anything yet. I don't see the account security in this forum, I opened the account and got no email notification, I logged in again and still no email notification. I think security should have been given while making this account.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472894",
  "comments": [
    {
      "author": "nutildah",
      "created_time": "November 05, 2023, 05:23:06 AM",
      "body": "You won't receive an email notification upon logging in, and there is no option to do so. There is only the option to receive an email when somebody replies to your post (or in specific threads) or sends you a PM. There is also no 2-FA for the forum, meaning you will have to take good care of your login credentials (don't store them online, for starters).These options can be found by clicking on Profile, then \"Notifications and Email\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "November 05, 2023, 05:34:21 AM",
      "body": "If I were you I wouldn't think too much because account with 5 activity and 0 merit is almost nothing.But if you're really don't want to lose your account, you can install one of Bitcoin wallet e.g. Electrum, Bluewallet, Mycelium etc and then post your sign message in this thread Stake your Bitcoin address here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cafter",
      "created_time": "November 05, 2023, 05:34:52 AM",
      "body": "You will not receive any security email after registering, like a confirmation email we receive after creating a new account on any platform.But you will receive email for other security related issues like to change password.You can read the \"HELP\" page on the main menu to learn for features about the forum. or simply click here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "November 05, 2023, 06:14:02 AM",
      "body": "You can monitor your login IP for the last 30 days on this page https://bitcointalk.org/myips.phpAlso use 3rd party resources to monitor security logs (password changes and activity status): https://bpip.org/Profile?id=3581291Tips for recovering your account from loss/hacking: stake your btc address. https://bitcointalk.org/index.php?topic=996318.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "November 05, 2023, 06:28:48 AM",
      "body": "Use a strong passwordYou can use 2FA to protect the email you used to register on this forumDo not click on a link on a PM that will lead to a fake page of login that you will input your username and password. If you see anything like that, it is fake. It is just a way a hacker wants to know your username and password. It is very import to stake your bitcoin address on this forum. Do not lose its seed phrase or private key because your wallet sign a message with private key, while seed phrase can always generate the private key.You can always check your IP logs. But if you follow everything that I haves mentioned before, the chance that your account will be hacked is very little or highly not possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "November 05, 2023, 07:39:59 AM",
      "body": "Quote from: BTC_pokaop on November 05, 2023, 05:07:29 AMI don't see the account security in this forum, I opened the account and got no email notification, I logged in again and still no email notification. I think security should have been given while making this account.Forum account: security, privacy, and recovery[GUIDE] How to Create a Strong/Secure PasswordAre your passwords in the green?Read a first topic and some topics about account recovery, you will understand about steps for account recovery then know what you must do to secure your account now as well as can be helpful for you in account recovery in future.Next two topics are about passwords, how to have a strong passwords to avoid password brute force.Some members advised you to stake your Bitcoin message. Beyond that you can stake your PGP key.The BCT PGP/GPG Public Key Database: Stake Your PGP Key HereReceive Merit - Post your PGP key, add an encrypted message, open for anyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "November 05, 2023, 07:53:33 AM",
      "body": "You won't get account security settings on Bitcointalk as you would see on your social media accounts — we do things a little bit differently here. Choose a strong password, then stake and sign here[1] using your bitcoin wallet address.[1] https://bitcointalk.org/index.php?topic=996318.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "November 05, 2023, 08:39:36 AM",
      "body": "Quote from: BTC_pokaop on November 05, 2023, 05:07:29 AMI am new to this forum and have not learned anything yet. I don't see the account security in this forum, I opened the account and got no email notification, I logged in again and still no email notification. I think security should have been given while making this account.As much as there are no security tools, they are good for those who want to enhance their privacy. You do not need an email to log in here, but you do need it if you want to recover your account. To secure your account, you need to prepare a strong password. Make sure that you can access the email associated with the account and sign a message with the Bitcoin address. Make sure someone else has quoted it.There is no benefit from hacking Bitcoin accounts, so most hacker attacks are for blackmail, or using the account to join signature campaigns.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChiBitCTy",
      "created_time": "November 05, 2023, 08:56:46 AM",
      "body": "Quote from: hugeblack on November 05, 2023, 08:39:36 AMQuote from: BTC_pokaop on November 05, 2023, 05:07:29 AMI am new to this forum and have not learned anything yet. I don't see the account security in this forum, I opened the account and got no email notification, I logged in again and still no email notification. I think security should have been given while making this account.As much as there are no security tools, they are good for those who want to enhance their privacy. You do not need an email to log in here, but you do need it if you want to recover your account. To secure your account, you need to prepare a strong password. Make sure that you can access the email associated with the account and sign a message with the Bitcoin address. Make sure someone else has quoted it.There is no benefit from hacking Bitcoin accounts, so most hacker attacks are for blackmail, or using the account to join signature campaigns.^second all thatDownload a password manager like Bitwarden. Use an encrypted email service. Make a pc only account (main account) and one for cellular use (that is if it will be used less often). That way if your phone is sim swapped it won’t be for your main account and you can post on here not to trust your mobile account now because of it. If it’s a low ranking lightly used account hackers won’t want it anyhow.  Also the staking a btc account as others have mentioned. Doing all this is more than enough security.  2FA would be nice though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartGold01",
      "created_time": "November 05, 2023, 09:20:25 AM",
      "body": "Quote from: BTC_pokaop on November 05, 2023, 05:07:29 AMI am new to this forum and have not learned anything yet. I don't see the account security in this forum, I opened the account and got no email notification, I logged in again and still no email notification. I think security should have been given while making this account.You are correct that is why you need to choose a very strong password that could be too hard for people especially your friends to memorize or remember. There has been lots of discussion to increase and implement some functionality to protect account against hack but there was no attention given to it because that isn't the sole purpose but rather is an open place for people to get access to their details whenever it's being misplaced. So I suggest you can change password and choose a more complicated one so that it will be too difficult to hack.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "November 05, 2023, 02:09:37 PM",
      "body": "Quote from: BTC_pokaop on November 05, 2023, 05:07:29 AMI am new to this forum and have not learned anything yet. I don't see the account security in this forum, I opened the account and got no email notification, I logged in again and still no email notification. I think security should have been given while making this account.When in Rome do as the Romans we have our way of securing our account and you have to follow what members are doing here to secure their account, get a strong password, be sure you have a clean PC, and stake your wallet here in case there is an intrusion to your account,  people here can easily validate your account and it's your way to recover your account too.Security should start with the user there's no need to worry about why no email is coming when registering, you will get notified when you receive a personal message or get your post deleted just be sure to whitewash the Bitcointalk notification, everything is working perfectly here you just have to adapt to this community and you are good to go.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "November 05, 2023, 03:26:02 PM",
      "body": "A long random password. And the ability to access your starting email.Also get a btc address stake it. Learn to sign it.Your password should be at least 16 letters upper and lower case along with some symbols and some numbers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "November 05, 2023, 03:35:02 PM",
      "body": "Quote from: SmartGold01 on November 05, 2023, 09:20:25 AM..that is why you need to choose a very strong password that could be too hard for people especially your friends to memorize or remember. ...So I suggest you can change password and choose a more complicated one so that it will be too difficult to hack.\"To memorize\" you mean to guess? Because why would your friend able to memorize it if he didn't see your password, well if he did, better change it asap.Passwords that are \"complicated\" are easy to forget unless you use a password manager which i recommend, better to use familiar words you ONLY know with a combination of numbers and symbols.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "November 05, 2023, 03:51:20 PM",
      "body": "Hey there! Welcome to the forum!  Don't stress too much about the email notifications thing.  I'm sure it's not a big security problem or anything.  Just double check that your email is right in your profile, just in case you ever need to recover your password.  But the main thing is having a solid password thats hard to break.  As long as your password is strong, it's really unlikely that someone could hack your account or anything, unless you do something careless like use the same password for multiple sites or click on sketchy links and end up on phishing sites.Basically as long as you use smart online security practices, your account should be fine and secure even without the email notifications and  anyway, hope this helps put your mind at ease! Enjoy the forums!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "November 05, 2023, 06:36:08 PM",
      "body": "The most recommendable account security is to stake your bitcoin address on the forum just as few people already said and the only way to restore your account from hack is to provide the previously used address by signing back a message. Alternatively you have to use a solidify password that you don't regularly used maybe that is not known by anyone else not even your spouse or fiance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ShowOff",
      "created_time": "November 05, 2023, 08:06:28 PM",
      "body": "By default, the bitcointalk forum will send you a notification email if a hacker succeeds in changing your password or changing your email. Otherwise any security is your responsibility including some suggestions that have been given to you by other users before my post. Apart from using a strong password, you should also avoid using disposable emails so that one day you can more easily recover your account if a hack occurs. Signing bitcoin messages can certainly help, but consistently maintain your security, including by surfing safely on the internet. One more thing, don't use the same email to register on other sites, especially with the same password.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "November 05, 2023, 08:54:34 PM",
      "body": "Quote from: BTC_pokaop on November 05, 2023, 05:07:29 AMI am new to this forum and have not learned anything yet. I don't see the account security in this forum, I opened the account and got no email notification, I logged in again and still no email notification. I think security should have been given while making this account.You are your account's security and you'll have to make it secure yourself. Only register your account with an e-mail that you can access only and make sure to have a strong password for your account. Don't have sign into the account from someone else's device and try your best to keep your account's private data as secret as possible. That's the only way to be secured from hackers otherwise your account can get stolen and unfortunately it will be hard for you to get access to your account again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "November 05, 2023, 10:28:12 PM",
      "body": "Quote from: BTC_pokaop on November 05, 2023, 05:07:29 AMI am new to this forum and have not learned anything yet. I don't see the account security in this forum, I opened the account and got no email notification, I logged in again and still no email notification. I think security should have been given while making this account.Don't worry too much - you just need to learn to carry out normal practices so that your account security can be better. It doesn't matter what your current posts and activity are - but security practices are recommended to keep your account safe. Nowadays no one really wants to hack a beginner with very low activity - unless you have announced that you have a lot of bitcoin somewhere.Learn how to sign bitcoin messages - then do as suggested. If you do it well without any mistakes - then I believe your account will be safe. Anyway - use TOR if you care about privacy and don't store any of your data online.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DYING_S0UL",
      "created_time": "November 06, 2023, 04:36:03 AM",
      "body": "If your bitcointalk password is compromised, there is no way to revert this. There is no 2FA or extra layer of security. 1. Use a good unique strong password. 2. Use 2FA in email address that you used to register.3. Stake your BTC address.There is one crucial thing you can do to protect your bitcointalk account. You can stake your BTC address and sign a message. In case your your account is compromised or hacked, or your email is changed, you can still recover your account if you can sign from your staked BTC address again. You just have to sign a message saying, \"your account is hacked and you wanna recover that\" or show theymos some recent transaction on that old staked address.  Stake your bitcoin address hereYou must not lose your staked BTC address. If you lose it, there is absolutely no way to recover your account. It's lost forever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}