{
  "id": "topic_5451759",
  "title": "swiftxi",
  "author": "swiftxi",
  "created_time": "May 06, 2023, 04:27:58 PMLast edit: May 08, 2023, 05:49:38 PM by swiftxi",
  "content": "He acuses all members and junior members of scam, before they even get to make 1 trade.Please leave the trading to the lender and lendee.I dont think anyone here needs you DIREWOLFM14 To baby sit them.Do they?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451759",
  "comments": [
    {
      "author": "ps34",
      "created_time": "May 06, 2023, 04:30:23 PM",
      "body": "haha i know what you mean brother he also accused me of being a scammer or having any ALTS without have ANY proof what about innocent until proven guilty huh  direwolfm14  i believe your 14m stands for 14 male guy   how about you keep it to yourself",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "May 06, 2023, 04:30:45 PM",
      "body": "Quote from: swiftxi on May 06, 2023, 04:27:58 PMHe acuses all members and junior members of scam, before they even get to make 1 trade.Please leave the trading to the lender and lendee.I dont think anyone here needs you DIREWOLFM14 To baby sit them.Do they?Not a self-moderated thread this time?  Big mistake.  But here's some advice anyway; this thread is off-topic in the lending board, move it to the Reputation board instead.  There's a link down in the lower left to move the thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swiftxi",
      "created_time": "May 06, 2023, 04:39:21 PMLast edit: May 06, 2023, 09:39:51 PM by Mr. Big",
      "body": "Quote from: ps34 on May 06, 2023, 04:30:23 PMhaha i know what you mean brother he also accused me of being a scammer or having any ALTS without have ANY proof what about innocent until proven guilty huh  direwolfm14  i believe your 14m stands for 14 male guy   how about you keep it to yourself Well ps34, In your case I think its very valid to be suspicious since your account seems to be purposefully created to ask for a loan.... . .. . . You spammed out for all sorts of loans , in dm's, multiple threads, multiple commend requests for large ammounts.But ye , he DW14 is kinda retarded.I first time today stumbled uppon the lending section, and tryed to as a \"nagotiable ammount\" , possibly around 0.015BTC Yes ok its alot but thats why I say  that its nagotiable and that Im new to lending so we can discuss it.From shasan i asked 140$ in USDT for loan , since im not going to ask 500$ on my very first loan.Quote from: DireWolfM14 on May 06, 2023, 04:30:45 PMQuote from: swiftxi on May 06, 2023, 04:27:58 PMHe acuses all members and junior members of scam, before they even get to make 1 trade.Please leave the trading to the lender and lendee.I dont think anyone here needs you DIREWOLFM14 To baby sit them.Do they?Not a self-moderated thread this time?  Big mistake.  But here's some advice anyway; this thread is off-topic in the lending board, move it to the Reputation board instead.  There's a link down in the lower left to move the thread.I dont care.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "May 06, 2023, 07:45:33 PM",
      "body": "Quote from: swiftxi on May 06, 2023, 04:40:38 PMI dont care.We don't care either, so why this topic?By the way, DireWolfM14's negative feedback on your account was within his rights and consistent with the standards of this community, and I think it was justified. If you don't like it, you're welcome to seek a loan from another source.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "May 06, 2023, 08:01:50 PM",
      "body": "Quote from: swiftxi on May 06, 2023, 04:27:58 PMNewbies and junior members are seen as none established members of the forum so at that members offering lending services always try to limit them from requesting for loans, most especially in none collateral loans, and this rule is clearly stated in the lending terms and conditions. So any newbies that apply for such loans can be tagged as potential risks who can default on the loan payments. But in your case, DireWolfM14 have asked you to prove that you have the 1+BTC you mentioned as collateral and the tag will be removed, so your problem can be solved by just signing Bitcoin messages from your acclaimed wallet holding the Bitcoin the Bitcoin you want to use as collateral.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "May 06, 2023, 08:54:13 PM",
      "body": "Jesus H Christ, thank you for this info. I am not aware DireWolf has that kind of thread. I personally thought it could be a waste of time as --just like several others pointed out on that thread already-- the accounts are mostly newbies and disposable, but it certainly can be helpful for lender if they need reference. Thank you once again, without you pointing it out by creating this thread, that thread will probably never come to my attention... and appreciation. Gonna leave a tiny amount of merit on that thread [my sMerit are mostly reserved for lower rank, to help them rank up, so I tend to be a bit frugal on those who already on legendary].DireWolfM14, good job on that thread.Shasan, it might be out of my place, but would you probably reconsider your second feedback to our dearest OP? The first one is justified, but the second one seems arguably out of place and weak-based. I think the first one is sufficient enough.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "May 06, 2023, 09:27:21 PM",
      "body": "When scammers start trolling and making such necessary threads, then it means the person being targeted is actually doing a very good job exposing their scam network.I believe one of the reason making OP lose his mind and sleep is this thread made by DireWolfM14 a few days back Restrict newbies from posting in the lending board?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "May 06, 2023, 09:34:17 PM",
      "body": "lol you are a newbie. it's how it is the fact that you ask money from someone. you can just leave your account and the lender fumbles about how he could get the money back. before you could even do that, DireWolfM14 will just give you a red rep. that will stop newbies from scamming.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ps34",
      "created_time": "May 06, 2023, 09:36:06 PM",
      "body": "just tell us that we have no rights at all why don't you you discriminate us  the jr members/newbies  you all have started at the rank of newbie so stop beating us down because frankly we won't have it you hear ? i'm sick and tired of people  bashing on me just for the sole fact that i'm a newbiedirewolf  always acuses people that's the point  every newbie/jr member without having ANY proof for this outrageous",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "May 06, 2023, 10:06:09 PMLast edit: May 06, 2023, 10:24:21 PM by DireWolfM14",
      "body": "Okay, this guy really has lost his mind, and looks like he's phishing for ban:All these posts were posted rapid-fire, and all were deleted immediately (by a moderator, I presume.)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ps34",
      "created_time": "May 06, 2023, 10:37:33 PM",
      "body": "okay that's just ridiculous don't need to play hostile to the guy   or death treaths   that's just dumb and immature  i'm sorry direwolf you need to go through that  i just tell you how it is in a civil manner i hope you understand my point of view",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "May 06, 2023, 10:55:12 PM",
      "body": "Quote from: ps34 on May 06, 2023, 10:37:33 PMi just tell you how it is in a civil manner i hope you understand my point of viewBut maybe try to see things from our perspective too? The thing is, there is a sticky topic in the Lending board that clearly explains that newbies cannot just ask for a no-collateral loan. It is just not allowed. And if you ignore the warning, you will be tagged, plain and simple.  Providing valid collateral is a common requirement for getting a loan, regardless of whether it is a traditional bank loan or a cryptocurrency loan. By offering collateral, you are showing the lender that you have assets that can be used to cover the loan in case you are unable to repay it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "May 06, 2023, 11:08:56 PM",
      "body": "Quote from: swiftxi on May 06, 2023, 04:27:58 PMI dont think anyone here needs you DIREWOLFM14 To baby sit them.The community doesn't need babysitting, but given that scams aren't moderated here we need all the scam-busters we can get.  I would also add that anyone who tries to take on a role like that won't garner any support, much less make it onto DT, if the accusations they sling don't hold any water.I have not looked at DireWolfM14's sent feedback, but he's proven himself a trusted member of the forum and I haven't seen any controversy surrounding any negative trust or scam accusations he might have levied against anyone--at least not recently or that I can recall.  This looks like a bunch of bitching by members who aren't trusted against a member who has a lot to lose by being wrong.Doubt he's going to change his mind, boys.  Better lock this up and try harder next time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "May 06, 2023, 11:41:27 PM",
      "body": "Quote from: DireWolfM14 on May 06, 2023, 10:06:09 PMAll these posts were posted rapid-fire, and all were deleted immediately (by a moderator, I presume.)He definitely posted death threats, which should attract a permanent ban as it's against the forum rules. But I don't know if mods can also rely on third party archives for evidence in order to ban a member.I think we have had enough of this lending board newbie scammers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Timelord2067",
      "created_time": "May 06, 2023, 11:57:02 PM",
      "body": "Quote from: swiftxi on May 06, 2023, 04:00:23 PMWhat you think I waited for 4 years on this forum so that I can scam somoene for a 0.01 loan ?Im not going to further this to absurdity, but just saying your wrong It wasnt a scam attempt or whatever.And just check your untrusted feedback, you think all those members were just scammers?Jesus H C.Code:Date Registered:  2021-07-31, 00:11:05Must be a previous scamming alt  How's \"stripdice\" going these days?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "May 07, 2023, 02:10:03 AM",
      "body": "Quote from: ps34 on May 06, 2023, 09:36:06 PMjust tell us that we have no rights at all why don't you you discriminate us  the jr members/newbies  you all have started at the rank of newbie so stop beating us down because frankly we won't have it you hear ? i'm sick and tired of people  bashing on me just for the sole fact that i'm a newbiedirewolf  always acuses people that's the point  every newbie/jr member without having ANY proof for this outrageousBeing told you're a bad risk to loan to is not saying you have no rights. You have been told many times that noone will loan you due to the collateral you try to offer. It is worthless to the users on this forum no matter what you think.Quote from: swiftxi on May 06, 2023, 04:27:58 PMHe acuses all members and junior members of scam, before they even get to make 1 trade.Please leave the trading to the lender and lendee.I dont think anyone here needs you DIREWOLFM14 To baby sit them.Do they?Don't view it as babysitting, view it as looking out for the community. People come in all the time and try to ask for non collateral loans from low ranked accounts. Why should anyone loan to them? So they can wonder if they will be repaid? There is nothing to make them pay back. No collateral, losing their low ranked $5 account, or even talking about getting authorities involved doesn't make a lender feel safe. That's why without reputation or collateral you will get 0. There's no reason to be mad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "May 07, 2023, 03:59:53 AM",
      "body": "Technically the two moderators who are have a control on lending board can ban any user to post in the section they managed, just like franky1 got banned on Development and Technical Discussion.But asking to ban DireWolfM14 on lending board because he was harsh to Jr. Member or Newbie rank account is really pointless, there's no rule about harsh and abusive is forbidden in this forum, actually this forum want to be free as possible.You can put him on ignore if you want, that's what you can do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "May 07, 2023, 04:09:36 AM",
      "body": "I don't see anything wrong with DireWolfM14 here. What I do see is accounts that have been properly red tagged. So just own it and stop whining please.The lending section works a lot, from time to time I go there, out of curiosity more than anything else, and I see several active threads where several members, that DireWolfM14 compiled in a thread, offer loans to the community and those who take them in almost all cases return them precisely because those who lend take precautions. By the way DireWolfM14, I don't see you on the list of lenders but it sounds to me that at least for a while you were a lender, is that right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ps34",
      "created_time": "May 07, 2023, 12:07:14 PM",
      "body": "funny how moderators here don't ban scammers i have yet to see a ban by cyrus or any other mod  by banning a user for scamming  but when i post messages that don't \"fit\" in this forum they got deleted  how ironic",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}