{
  "id": "topic_5453721",
  "title": "bayu7adi",
  "author": "bayu7adi",
  "created_time": "May 23, 2023, 12:12:26 AM",
  "content": "Bitcoin Pizza Day adalah sebuah pengingat tahunan merayakan penggunaan Bitcoin pertama kalinya sebagai alat pembayaran untuk pembelian produk fisik setiap tanggal 22 Mei.Peringatan Bitcoin Pizza Day di forum Bitcointalk selalu digelar dengan kontes-kontes menarik seperti kontes membuat Pizza unik yang mana dalam menentukan pemenangnya akan dilakukan vote untuk beberapa kontestan yang ikut sebagai peserta. Untuk informasi lengkapnya bisa cek pada channel Discord : https://discord.gg/ahgHyku (link undangan ini udah ane tes tanggal 23 Mei 2023 dan belum expired).Pengumuman kontes Bitcoin Pizza Day 2023 ada disini : https://bitcointalk.org/index.php?topic=5247383.msg62285486#msg62285486Sedikit informasi mengenai rules yang harus diperhatikanJoin discord Bitcointalk Party telebih dahulu Submit foto atau animasi GIF pada channel discord #pizza-day-event-2023Bisa mengirim lebih dari satu gambar pada channel discord, tetapi hanya 1 gambar yang akan di pin sebagai entry untuk votingReaction akan di disable sebelum periode submit selesai. Reaction akan bisa digunakan setelah tanggal 1 Juni untuk memudahkan penghitungan votesTema: Bitcoin Pizza DayHadiah untuk pemenang Badge Bitcoin Pizza Bitcointalk 1 tahun (kemungkinan ada sepasang badge lagi dengan durasi terbatas)Ledger Nano X kustom dari Betnomi7mBTC (5mBTC untuk juara #1 and 2mBTC untuk juara #2)Preview tampilan Badge Bitcoin Pizza Bitcointalk     Untuk saat ini Badge Bitcoin Pizza Bitcointalk di pegang oleh fillippone. Mengingat event ini memiliki durasi terbatas (batas submit sampai tanggal 1 Juni 2023), ada baiknya bagi yang ingin ikut kontes ini segera memikirkan konsep Pizza yang akan di submit nantinya. Apakah agan-agan disini bakal ikut memeriahkan event Bitcoin Pizza Day tahun ini?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453721",
  "comments": []
}