{
  "id": "topic_5448204",
  "title": "octobuzz",
  "author": "octobuzz",
  "created_time": "April 10, 2023, 01:58:31 AM",
  "content": "So, I just stumbled on a link to download a browser from an ad and it has mining capabilities for Bitcoin. Since my PC doesn't meet up to Bitcoin Core specifications, I'm thinking I should try this browser out.However, I would like to get your opinions on this matter.What do you think?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448204",
  "comments": [
    {
      "author": "NotFuzzyWarm",
      "created_time": "April 10, 2023, 03:05:38 AM",
      "body": "It and all other browser-based 'mining' programs/add-ons are at best scams and at their worst malware that can steal passwords and other login data, crypto addresses, etc.. Avoid at all costs!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "April 10, 2023, 11:57:36 PM",
      "body": "Cryptotab is known to scam you won't be able to mine Bitcoin using that plugin.Have ever tried to search first? Check this trust pilot reviews below - https://www.trustpilot.com/review/cryptobrowser.site?stars=1And check this thread below - CryptoTab Browser Cloud Mining still pending withdrawIf you want to mine Bitcoin first read this First time/Small miner reference for getting started.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "April 18, 2023, 07:09:26 AM",
      "body": "Looks like I have to state the obvious: You cannot use CPUs to mine Bitcoin anymore. Anybody who tells you that you can mine bitcoins on your computer needs a reality check.Also, you cannot use Bitcoin Core to mine bitcoin! It is a full node implementation only.Did you get served this download link from an ad? If so, you should be using an adblocker, to protect yourself from scams like this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "April 18, 2023, 11:26:42 AM",
      "body": "It is surprising to see that this website/app is still alive after years of people asking whether they are a scam or not. Even their Twitter is full of replies claiming they are scamming them and so on. OP, I suggest you install an ad-blocker so you don't click malicious links which might redirect you to a malware site. Also, they are not really mining with your computer, they just turn your computer into a botnet for their farming activities/collecting personal data/etc, and 'pay' (scam) you with some miniscule sats. Stay away from any app like that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}