{
  "id": "topic_5465271",
  "title": "o48o",
  "author": "o48o",
  "created_time": "September 01, 2023, 09:43:23 AM",
  "content": "AI prediction of 2.9.2023 UFC Fight NightAfter ChatGPT came out, i've seen some threads about AI and if it could help in gambling. Back then, AI:s couln't access to internet so they couldn't find latest stats to compare, but now it's a whole new ball game. While i am highly skeptical about results i thought i might give it a go to try it.I admit that this is a fraction of any sample size that would be needed to come to any conclusion if it's working but i thought it would be fun little experiment.I chose Bing AI chat creative mode as my tool, as it seems to be most efficient free tool for this kind of stuff. I tried also google bard, while it had some insightful opinions about some matches, it didn't have any data about most of the fighters so it couln't make any predictions. Basically my prompt for ai was \"if these two would fight, who would win and how, and can you give me details how you came that conclusion\"I haven't check if the data is legit, as AI's have an issue of inventing things that doesn't exist (lying), you should take the results with the grain of salt. Prediictions doubly so. I myself did some small multi bets from these predicions. Not too much because i don't want to trust my money on this silly experiment, but some to have some skin in the game.Full details were too long and specific to post in here, they contained links to articles, records and statistics, fighting styles, advantages and disadvantages, etc, so i asked it to summarize it for me afterwards. But i put links to original long answers and they are most interesting part of this and definitely worth checking out.Links to full, detailed answer won't work immediately, you have to wait after a click a bit for them to appear in bing search page.I will update the results next to prediction recap at the end to see if any of these were even remotely correct. I'll do it Sunday, as i am offline whole Saturday.But here we go; summarized predictions about that fight night ->             Farid \"Ferocious\" Basharat vs Kleydson \"KR\" Rodrigues                                                    Bing AI:Quote- Farid Basharat and Kleydson Rodrigues are both undefeated fighters in the UFC bantamweight division.- They will fight each other on September 2, 2023 at UFC Fight Night.- I think Basharat will win by submission in the third round because he has more experience, more skills, and more physical advantages than Rodrigues.Link to full, detailed answer             Loosa \"The Last Ninja\" Ange vs Rhys \"Skeletor\" McKee                                                    Bing AI:Quote- Loosa Ange and Rhys McKee are both promising and exciting fighters in the UFC welterweight division.- They will fight each other on September 2, 2023 at UFC Fight Night.- I think McKee will win by knockout in the second round because he has more experience, more power, and more physical advantages than Ange.Link to full, detailed answer             Nora Cornolle vs Joselyne \"La Pantera\" Edwards                                                    Bing AI:QuoteNora Cornolle and Joselyne Edwards are both female fighters in the UFC bantamweight division.They will fight each other on September 2, 2023 at UFC Fight Night.I think Edwards will win by knockout in the first round because she has more experience, more power, and more physical advantages than Cornolle.Link to full, detailed answer             Zarah \"Infinite\" Fairn vs Jacqueline Cavalcanti                                                    Bing AI:Quote- Zarah Fairn and Jacqueline Cavalcanti are both bantamweight fighters who have never fought each other before.- Zarah Fairn is a tall and powerful striker who has a record of 6-5, but she has lost to some of the top featherweights in the UFC and missed weight in her last fight.- Jacqueline Cavalcanti is a well-rounded fighter who has a record of 5-1, and she has shown impressive performances in various promotions, such as LFA, UAE Warriors, and PFL.- I think Cavalcanti would win over Fairn by using her speed, versatility, and conditioning. She would be able to avoid Fairn's strikes, take her down, and finish her with a TKO or a submission.Link to full, detailed answer             Taylor \"Double Impact\" Lapilus vs Caolán \"THE DON\" Loughran                                                    Bing AI:Quote- Taylor Lapilus and Caolan Loughran are bantamweight fighters who will fight at UFC Fight Night 226 in Paris, France.- Lapilus is a former TKO Major League MMA Bantamweight Champion who has a record of 18-3-0. He is a well-rounded fighter who can finish his opponents with strikes or submissions.- Loughran is the current Cage Warriors Bantamweight Champion who has a record of 8-0-0. He is a powerful striker who has won five of his eight fights by knockout.- I think that Lapilus has a slight edge over Loughran in this fight because he has more experience, more tools, and home advantage.- I predict that Lapilus will win the fight by unanimous decision after three rounds of action. He will outpoint Loughran on the feet and avoid his submissions on the ground.Link to full, detailed answer             Morgan \"The Last Pirate\" Charriere vs Manolo \"Angelo Veneziano\" Zecchini                                                    Bing AI:Quote- Morgan Charriere and Manolo Zecchini are featherweight fighters who will fight at UFC Fight Night 226 in Paris, France.- Charriere has more experience, wins, and skills than Zecchini. He has never been knocked out or submitted.- Zecchini is also a good striker, but he has less diversity and defense. He has been knocked out and submitted once.- I think Charriere will win by KO/TKO in the second or third round, but Zecchini could also surprise him. Both fighters are talented and motivated.Link to full, detailed answer             William \"Jaguar\" Gomis vs Yanis \"The Desert Warrior\" Ghemmouri                                                    Bing AI:Quote- I think William Gomis will win the fight against Yanis Ghemmouri by knockout or decision.- Gomis has more experience, power, reach, and versatility than Ghemmouri.- Ghemmouri is a good grappler, but he will not be able to overcome Gomis's striking and defense.Link to full, detailed answerI asked follow up question, that in which round that knockout could would happen, and it said second round.             Volkan \"No Time\" Oezdemir vs Bogdan Guskov                                                    Bing AI:Quote- Volkan Oezdemir and Bogdan Guskov are both light heavyweight fighters who have impressive knockout power and striking skills.- Oezdemir has more experience, better defense, and more versatility than Guskov.- Oezdemir would win this fight by KO/TKO in the first or second round.Link to full, detailed answer             Benoit \"God of War\" Saint-Denis vs Thiago Moisés                                                    Bing AI:Quote- Benoit Saint-Denis and Thiago Moisés are both lightweight fighters who have different strengths and weaknesses.- Moisés has more experience, better striking, and comparable grappling to Saint-Denis.- Moisés would win this fight by decision or late stoppage.Link to full, detailed answer             Manon \"The Beast\" Fiorot vs Rose \"Thug\" Namajunas                                                    Bing AI:Quote- Manon Fiorot and Rose Namajunas are two top female fighters in the UFC who will fight in Paris on September 2, 2023.- Fiorot is a kickboxer with a 10-1 record and 5-0 in the UFC. Namajunas is a former champion with an 11-5 record and 2 wins over Zhang Weili.- I think Fiorot will win by decision because she has more size, strength, and momentum than Namajunas. Namajunas may have trouble with Fiorot's pressure and power.Link to full, detailed answer             Ciryl \"Bon Gamin\" Gane vs Serghei \"Polar Bear\" Spivac                                                    Bing AI:Quote- Ciryl Gane and Serghei Spivac are two heavyweight fighters who will fight in Paris on September 2, 2023.- Gane is a former title challenger who is good at striking, speed, and versatility. He has 11 wins and 2 losses.- Spivac is a rising contender who is good at grappling, wrestling, and durability. He has 15 wins and 2 losses.- The fight could end in different ways depending on their skills and strategies. Some possible outcomes are:    - Gane wins by knockout or decision using his striking and movement.    - Spivac wins by submission or decision using his wrestling and grappling.    - The fight ends in a draw or a no contest due to an even match or an unforeseen event.- This is not a prediction or a recommendation, but only a summary of some information I have found on the web. The actual outcome may vary.Link to full, detailed answerAs i asked for best guess, bing refused to take a guess, so i started a new session, where it for some reason guessed:QuoteCiryl Gane is the favorite to win the fight against Serghei Spivac. He has better speed, striking, and defense than Spivac.Serghei Spivac is the underdog in the fight. He has good grappling, wrestling, and submission skills. He has never been knocked out in his career.I think Ciryl Gane would win the fight by knockout or decision, but Serghei Spivac could also surprise him with his ground game and chin.Link to full, detailed answerI double checked with Google Bard AI and it agrees -> https://g.co/bard/share/9b83e86ea5b8It said either TKO or decision, i asked it to elaborate and it would estimate TKO happening in 4th or 5th round.------------------------------------------------------------------------------------------------------------Let's summarize every prediction:Farid Basharat vs Kleydson Rodrigues * Basharat will win by submission in the third round -  Result comes here Loosa Ange vs Rhys McKee * McKee will win by knockout in the second round -  Result comes here Nora Cornolle vs Joselyne Edwards * Edwards will win by knockout in the first round -  Result comes here Zarah Fairn vs Jacqueline Cavalcanti * Cavalcanti will win with a TKO or a submission. -  Result comes here Taylor Lapilus vs Caolán Loughran * Lapilus will win by decision -  Result comes here   Morgan Charriere vs Manolo Zecchini * Charriere will win by KO/TKO in the second or third round -  Result comes here William Gomis vs Yanis Ghemmouri * Gomis wins by knockout on 2nd round or decision. -  Result comes here Volkan Oezdemir vs Bogdan Guskov * Oezdemir wins by KO/TKO in the first or second round. -  Result comes here Benoit Saint-Denis vs Thiago Moisés * Moisés would win this fight by decision or late stoppage. -  Result comes here Manon Fiorot vs Rose Namajunas * Fiorot will win by decision -  Result comes here Ciryl Gane vs Serghei Spivac * Ciryl Gane wins by knockout in 4th or 5th round or decision -  Result comes here",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465271",
  "comments": [
    {
      "author": "Jating",
      "created_time": "September 01, 2023, 10:37:59 AM",
      "body": "Very interesting, we will see who will get the win and find out if AI can really predict games or fights.I check one sports bookies and this are the odds,Farid Basharat vs Kleydson Rodrigues   *   Basharat will win by submission in the third round   -   Basharat favorite, ML @1.25Loosa Ange vs Rhys McKee   *   McKee will win by knockout in the second round   -   McKee underdog @2.30Nora Cornolle vs Joselyne Edwards   *   Edwards will win by knockout in the first round   -   Edwards favorite ML @1.79 (but it's very close)Zarah Fairn vs Jacqueline Cavalcanti   *   Cavalcanti will win with a TKO or a submission.   - Cavalcanti favorite ML @1.25Taylor Lapilus vs Caolán Loughran   *   Lapilus will win by decision   -   Lapilus favorite ML @1.55 Morgan Charriere vs Manolo Zecchini   *   Charriere will win by KO/TKO in the second or third round   -   Charriere favorite ML @1.26William Gomis vs Yanis Ghemmouri   *   Gomis wins by knockout on 2nd round or decision.   -   Gomis favorite ML @1.43Volkan Oezdemir vs Bogdan Guskov   *   Oezdemir wins by KO/TKO in the first or second round.   -   Oezdemir favorite ML @1.51Benoit Saint-Denis vs Thiago Moisés   *   Moisés would win this fight by decision or late stoppage.   -   Moisés underdog @2.26Manon Fiorot vs Rose Namajunas   *   Fiorot will win by decision   -   Fiorot favorite ML @1.49Ciryl Gane vs Serghei Spivac   *   Ciryl Gane wins by knockout in 4th or 5th round or decision   -   Ciryl Gane favorite Ml @1.52So based on the predictions by AI, there are 2 underdogs that we need to watch out. So that is the fight that we should look as well and the underdogs are well over 2.3x. Maybe throw some money on them?It might be a good idea to do some parlays as well? What do you think?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "September 01, 2023, 10:54:38 AM",
      "body": "Quote from: Jating on September 01, 2023, 10:37:59 AM-cut-It might be a good idea to do some parlays as well? What do you think?Well i used small bets and did several combinations of multi bets with all of them. I even used exact rounds and winning methods with some of them. I can't recommend doing it as the winning change is less then slim, but it was for fun anyway and to keep my interest up on this.I have no expectations to win, but if i do, i would get my money back with pretty sweet multipliers.If i get decent results i will try this again, maybe with some other sport.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "September 01, 2023, 01:19:36 PM",
      "body": "This is very interesting I never believe in the accuracy of AI when it comes to sports betting, but since you posted it here we'll see if these AI can give better results than humans.This could be the new trend here in gambling discussions posting AI predictions against human predictions, if AI offer a good alternatives many gamblers will turn to using AI for their bets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tokeweed",
      "created_time": "September 01, 2023, 01:31:28 PM",
      "body": "I laughed at some of the fighter and match up info because some of them are wrong.  But interesting experiment...  All in all not a bad idea.    And if you can, keep records of wins and losses made by the bot if it made bets of 1 unit at every fight and see how it performs after 6 months or so.  Anything above 55% will show that it's a profitable strat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "September 01, 2023, 03:06:55 PM",
      "body": "This Bing has access to a lot of MMA data making the AI compare from sherdog to tapology.Cool to see an AI has the idea of which one will win over a bout and it suggests which round the fighter may win. Since this is a search engine, I was expecting g to see an ad related to Bookmaker but there seems none.OpenAI didn't have such a feat when I tried it months ago. I couldn't agree with a few of its predictions but the majority is okay.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "September 01, 2023, 08:41:43 PM",
      "body": "Quote from: coin-investor on September 01, 2023, 01:19:36 PMThis is very interesting I never believe in the accuracy of AI when it comes to sports betting, but since you posted it here we'll see if these AI can give better results than humans.Yes, and we gamblers never thought that AI can predict the fight as what humans do, I mean we look at everything when we do our analysis, like previous fights, the weight and others. So not sure how AI predicted this fight.But as what you have said, it's very interesting to see how the predictions will be or what will be the accuracy of AI.Quote from: coin-investor on September 01, 2023, 01:19:36 PMThis could be the new trend here in gambling discussions posting AI predictions against human predictions, if AI offer a good alternatives many gamblers will turn to using AI for their bets.Most likely there are already some sports bettors that have tried this before.But first time that we have heard this one here because the OP posted his experiment and then we will see how it goes to him and others who are going to look at this fight prediction and bet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "September 03, 2023, 10:01:29 PM",
      "body": "Farid Basharat vs Kleydson Rodrigues * Basharatwill win by submission in the third round - Sort of Correct - Farid Basharad won but by decision, not by submissionLoosa Ange vs Rhys McKee * McKee will win by knockout in the second round - Wrong - Loosa Ange wins by DecisionNora Cornolle vs Joselyne Edwards * Edwards will win by knockout in the first round -  Wrong - Nora Cornolle wins by decision Zarah Fairn vs Jacqueline Cavalcanti * Cavalcanti will win with a TKO or a submission. - Sort of Correct - Jacqueline Cavalcanti wins, but not by submission, but via DecisionBut this was obvious outcome anyway. so it doesn't count muchTaylor Lapilus vs Caolán Loughran * Lapilus will win by decision - Correct - Taylor Lapilus defeats Caolán Loughran by Decision. Hooray, one totally correct with a one that wasn't obvious! Morgan Charriere vs Manolo Zecchini * Charriere will win by KO/TKO in the second or third round - Sort of Correct - Morgan Charriere wins via KO/TKO, but in round 1William Gomis vs Yanis Ghemmouri * Gomis wins by knockout on 2nd round or decision. - Sort of Correct - William Gomis wins via KO/TKO, but in round 3Volkan Oezdemir vs Bogdan Guskov * Oezdemir wins by KO/TKO in the first or second round. - Sort of Correct - Volkan Oezdemir wins, but via submission in Round 1  Benoit Saint-Denis vs Thiago Moisés * Moisés would win this fight by decision or late stoppage. - Wrong - Benoit Saint-Denis wins via KO/TKO in round 2 Manon Fiorot vs Rose Namajunas * Fiorot will win by decision - Correct - Manon Fiorot defeats Rose Namajunas via 3 Round DecisionCiryl Gane vs Serghei Spivac * Ciryl Gane wins by knockout in 4th or 5th round or decision - Sort of Correct- Ciryl Gane defeats Serghei Spivac via KO/TKO, but in round 2Conclusion: I can't make any conclusions from this. I would need extraoridinary large sample size and a bot to make enough predictions.But it was a fun experiment and i lost money i experimented with, as i did multi bets with that i would have lost with only one error.Anyway, i'll add this data to my spreadsheet for the future and might do some other game next.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "September 04, 2023, 10:54:29 AM",
      "body": "Quote from: o48o on September 03, 2023, 10:01:29 PMConclusion: I can't make any conclusions from this. I would need extraoridinary large sample size and a bot to make enough predictions.But it was a fun experiment and i lost money i experimented with, as i did multi bets with that i would have lost with only one error.Anyway, i'll add this data to my spreadsheet for the future and might do some other game next.It's understandable if this is the first time that you've used AI but if you can continuously do this you can come out with a near-perfect prediction, There's a big possibility that many sports bettors are already using AI, and a few years this is going to be the new trend, this is why they create these AI as a tool for in-dept analysis.  I still don't think that you should rely everything on AI, it's good for comparison but there's nothing like a human analysis because we have what we call intuition and it has a bigger impact than AI analysis, I have proven that intuition sometimes plays a major role in our decision making.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "September 04, 2023, 12:08:46 PM",
      "body": "8/11 picked winners eh? That's a good deal I guess. I would have never had that many if I did it on my own. My take away on this is to consider the prediction on who would win but not put too much faith on how they win or what round the fight finishes. It's like \"safer\" to put your money on ML when using AI.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "September 04, 2023, 12:18:33 PM",
      "body": "Quote from: Yogee on September 04, 2023, 12:08:46 PM8/11 picked winners eh? That's a good deal I guess. I would have never had that many if I did it on my own. My take away on this is to consider the prediction on who would win but not put too much faith on how they win or what round the fight finishes. It's like \"safer\" to put your money on ML when using AI.this is what i am seeing here also about the results. if you won't consider the round or the method of winning, AI has high chance of getting it correct. so maybe if you want to use the AI predictions, just bet on who will be the winner and don't bet on other betting lines such as over/under, winning method and what round. i can say, that's high percentage of getting it right about the overall winner. and don't do multiple bets, maybe you can gain more profit via single bets here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "September 04, 2023, 05:53:18 PM",
      "body": "Quote from: AmoreJaz on September 04, 2023, 12:18:33 PMQuote from: Yogee on September 04, 2023, 12:08:46 PM8/11 picked winners eh? That's a good deal I guess. I would have never had that many if I did it on my own. My take away on this is to consider the prediction on who would win but not put too much faith on how they win or what round the fight finishes. It's like \"safer\" to put your money on ML when using AI.this is what i am seeing here also about the results. if you won't consider the round or the method of winning, AI has high chance of getting it correct. so maybe if you want to use the AI predictions, just bet on who will be the winner and don't bet on other betting lines such as over/under, winning method and what round. i can say, that's high percentage of getting it right about the overall winner. and don't do multiple bets, maybe you can gain more profit via single bets here.With the rate of 8/11, it's already enough to make money even if you just pick what the AI gives. No betting on which round or winning method. If in the next UFC 293 prediction of this AI will still have high rate, I will really believe this is one heck of a tool for non-MMA fans.Just test it with just $110 and bet $10 each. If the fighter is known as KO artist I guess you can try the winning method just to get more from the odds. I will closely watch it this weekend.UFC 293: Adesanya vs. StricklandMAIN EVENTIsrael Adesanya VS Sean StricklandCO-MAIN EVENTTai Tuivasa VS Alexander VolkovMAIN CARDManel Kape VS Felipe dos SantosJustin Tafa VS Austen LaneTyson Pedro VS Anton TurkaljPRELIMINARY CARDCarlos Ulberg VS Da Un JungJack Jenkins VS Chepe MariscalJamie Mullarkey VS John MakdessiNasrat Haqparast VS Landon QuiñonesBlood Diamond VS Charlie RadtkeShane Young VS Gabriel MirandaKevin Jousset VS Kiefer Crosbie",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}