{
  "id": "topic_5448161",
  "title": "BitcoinVN_News",
  "author": "BitcoinVN_News",
  "created_time": "April 09, 2023, 04:17:03 PM",
  "content": "A common question - especially after the Chainalysis report from 2022 which put Vietnam on top in terms of \"crypto adoption\" - put towards our direction is:- Are those data are real?- And if so, what are the underlying reasons for it?A partial reply to these rather complex issues can be found in the most recent guest essay by our guest author Del Elson.Del moved his life to Vietnam close to a decade ago and since then worked in Vietnam as country manager, CTO, project manager, solution architect and leader of several software and DevOps teams.QuoteCompanies that did continue development were forced to offshore.their development to countries like India, Mexico and Vietnam in order to continue to serve.their world-wide customer base as well as that in the USA.(oddly enough crypto tech could enter the USA but could never leave). Cryptography jobs in the USA dried up and so universities stopped. teaching.techniques because there was no market for them.Instant Bitcoin & Cryptocurrency ExchangeThe USA has never been able to climb out out of the hole it.dug for itself because for several years there was no work being done.or teaching of encryption technologies in the USA,.so when the restrictions loosened they were already 5 to 10 years.behind the rest of the world, which in internet time counts as millenia.The hole in cryptographic technology and research basically paved the way.for the current lack of cryptocurrency tech and research in the USA. Look at where the major crypto tech and blockchain projects are headquartered.these days — outside of the USA, because US software engineers.(and to an extent, mathematicians) lack the background to be useful.contributors to such projects.(Full essay source: https://news.bitcoinvn.io/vietnam-crypto-adoption-by-del-elson/ )",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448161",
  "comments": [
    {
      "author": "NeuroticFish",
      "created_time": "April 09, 2023, 04:25:56 PM",
      "body": "* There may be that the data is not correct, it's missing something or was misled (for example VPN may easily make people look as being from a different country).* There may be that the Americans are not so interested (as % of population) in crypto because they already have a decent standard of living even without the added benefit of bitcoin / crypto investments* There may be that in Asian countries people are more prone to risk (afaik they also gamble more than the rest)* There may be that in non-US countries people don't care so much of withholding this rather private information (where are you from, did you invest in bitcoin)Depending on how that data was collected some of my answers may not apply.----Imho it's more about the need. Somebody from Vietnam may just try to get 1$ more with crypto. Somebody from US may not bother or would not want to take the risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woodie",
      "created_time": "April 09, 2023, 05:04:48 PM",
      "body": "This data looks biased or is incomplete!Btw just looking at these numbers alone tells me its either this platform used here for the hackathon is not popular enough to invite more users to it or the platform  used as more users from certain regions and if i used the forum to tell the story Nigeria cant be sitting at the bottom but should be around were USA and india are not close to last!Unless these nations dont have individuals that can make it to a hackathon...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pezroly",
      "created_time": "April 09, 2023, 06:59:39 PM",
      "body": "These data are fake. Most Bitcoin users come from USA - https://originstamp.com/blog/the-top-10-countries-that-use-crypto-and-bitcoin-the-most/. And Vietnam is not far ahead in crypto adoption. Currently only Salvador and Central African Republic are far ahead in crypto adoption, look here https://coinmarketcap.com/legal-tender-countries/.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serveria.com",
      "created_time": "April 09, 2023, 07:46:33 PM",
      "body": "Quote from: BitcoinVN_News on April 09, 2023, 04:17:03 PMA common question - especially after the Chainalysis report from 2022 which put Vietnam on top in terms of \"crypto adoption\" - put towards our direction is:- Are those data are real?- And if so, what are the underlying reasons for it?A partial reply to these rather complex issues can be found in the most recent guest essay by our guest author Del Elson.Del moved his life to Vietnam close to a decade ago and since then worked in Vietnam as country manager, CTO, project manager, solution architect and leader of several software and DevOps teams.QuoteCompanies that did continue development were forced to offshore.their development to countries like India, Mexico and Vietnam in order to continue to serve.their world-wide customer base as well as that in the USA.(oddly enough crypto tech could enter the USA but could never leave). Cryptography jobs in the USA dried up and so universities stopped. teaching.techniques because there was no market for them.Instant Bitcoin & Cryptocurrency ExchangeThe USA has never been able to climb out out of the hole it.dug for itself because for several years there was no work being done.or teaching of encryption technologies in the USA,.so when the restrictions loosened they were already 5 to 10 years.behind the rest of the world, which in internet time counts as millenia.The hole in cryptographic technology and research basically paved the way.for the current lack of cryptocurrency tech and research in the USA. Look at where the major crypto tech and blockchain projects are headquartered.these days — outside of the USA, because US software engineers.(and to an extent, mathematicians) lack the background to be useful.contributors to such projects.(Full essay source: https://news.bitcoinvn.io/vietnam-crypto-adoption-by-del-elson/ )I think the issue is that most of the posters here have gotten something wrong. The OP merely states that the number of Bitcoin hackathon participants from Vietnam is significant (not the number of users/miners/hodlers or whatever). I guess this is more due to the fact that many programmers/developers are from Vietnam. Just check out Upwork or any other freelance website - most developers are from India, Vietnam etc. Has nothing to do with Bitcoin being popular in the country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "April 09, 2023, 07:52:38 PMLast edit: May 15, 2023, 10:51:02 AM by stompix",
      "body": "I love the image and the claim...\"90% of entrants are now outside of US\"Since the population of the US is still only 4.5% of the total population they still get twice as much representative per capita.So based on those percentages, Mexico might be the newest crypto hub, lol!QuoteThe hole in cryptographic technology and research basically paved the way.for the current lack of cryptocurrency tech and research in the USA. Look at where the major crypto tech and blockchain projects are headquartered.these days — outside of the USA, because US software engineers.(and to an extent, mathematicians) lack the background to be useful.contributors to such projects.And still, the US has the largest mining farms, hashrate, most Batms, a ton of companies running legally in the country, biggest investors, and still an influx of people from these crypto hubs that came into the US, funny enough they somehow love the evil decadent west more than their former countries.I don't see that many Indian and Vietnamese on this thing:https://buybitcoinworldwide.com/treasuries/QuoteA common question - especially after the Chainalysis report from 2022 which put Vietnam on top in terms of \"crypto adoption\" - put towards our direction is:- Are those data are real?- And if so, what are the underlying reasons for it?Mostly made-up things based on surveys and fake data reported by exchanges to boost their numbers, if those assumptions would be true then wound;t this map of business accepting crypto look flipped?This area should have 32 million people, 7% ownership, which makes 2 million crypto users and only....[img height-200]https://i.ibb.co/wSv7NNr/62063849.png[/img]But yeah, probably none of the 90 million crypto owners in India is keen on adding business to this list. Seems, hmm, normal!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "April 09, 2023, 07:55:46 PM",
      "body": "Different sites different statistics, and there is no way to verify if the statistics given in each site is correct.  So we can agree to disagree on this depending on how we believe the data stated on each site.  But in a logical thinking, although USA top Vietnam in terms of crypto adoption, Vietnam according to different sites[1][2][3] top many Western countries in term of crypto adoption.  Here[4] is a detailed explanation of why Vietnam is one of the leading countries in terms of crypto adoption.QuoteCrypto’s rising popularity in VietnamVietnam’s crypto adoption: Factors driving growth in Southeast Asia – Sep 2022Vietnam continues to rank among the top nations adopting cryptocurrencies. Analysts have attributed Vietnam’s dominance to relatively lax crypto taxes, limited access to financial services and a hedge against inflation. Additionally, as the birthplace of Axie Infinity, the game that arguably kicked started the ‘play-to-earn’ genre, Vietnam has become a hubspot for the thriving GameFi scene, with many crypto/GameFi startups flocking to the Southeast Asia nation Most Influential 2021: Trung Nguyen – Dec 2021Trung Nguyen and his GameFi’s success has bolstered the Vietnamese economy and industry, fueling local job creation and spurring a wave of startup innovation. SGGP: Vietnam has second highest rate of cryptocurrency use – April 2021Out of 74 countries in the Statista Global Consumer Survey, the second highest rate of cryptocurrency use in the survey was recorded in Vietnam while Nigerians were the most likely to say they used or owned cryptocurrency. There has been a recent boom of cryptocurrencies (bitcoin) in Vietnam as investors realize the potential of this currency, while the government and experts have constantly been warning of possible risks, including Cybercrime. Cryptocurrency has not been recognized as a legitimate means of payment in Vietnam.Surprisingly this article did not include Vietnam as one of the top 10 crypto countries by adoption.[1] https://triple-a.io/crypto-ownership-data/[2] https://worldcoin.org/articles/which-country-trades-the-most-cryptocurrency[3] https://originstamp.com/blog/the-top-10-countries-that-use-crypto-and-bitcoin-the-most/[4] https://triple-a.io/crypto-ownership-vietnam-2022/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "April 09, 2023, 08:00:21 PM",
      "body": "Quote from: BitcoinVN_News on April 09, 2023, 04:17:03 PM- Are those data are real?- And if so, what are the underlying reasons for it?Data is always real, according to reports and stats. To confirm that you can observe different reports from different sources sensory, the main reason for mass adoption could be by few main factors such as regulatory encouragement and economic situations of a country like, if it's in a developing phase then there will be fewer restrictions over cryptocurrency as this will open new doors to remittances from overseas workers. Because according to Lexology, the remittance fee was around 9% back in 2019 and now as of 2023 it will cost you around 60$ to 90$ according to Exiap. But by leveraging the crypto, the remittance fee has reduced to around $2-$8 max. There could be another factor, that is, Most of the citizens of Vietnam are young their ages range from 25 to 32 according to worldeconomics. How this could be a factor, we all know people of this age have a better idea of modern technology and they do know the importance of this chance and loss if they do not adopt it, as you also mentioned the USA has wasted time in millenia. but Vietnamese has not. Another factor is there government is promoting crypto, They also have plans to develop more blockchain-based projects in the time interval of 2022 to 2023 and this is a good sign towards its adoption, which ultimately is in favor of crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "April 09, 2023, 08:45:43 PM",
      "body": "I've thought of because of Axie Infinity's CEO is from Vietnam.  But AFAIK with that game even if they've got a Vietnamese CEO, that didn't really made a lot of adoption in that country. Whatever is this hackathon and data that are being presented, there's always something within it. Whether they're real or not but basically with these stats, it's just a comparison to other nations and looking at the number, why say far ahead than US. Is US the basis of the crypto adoption when most regulators there and exchanges have been hot on each other?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "April 10, 2023, 09:41:21 AM",
      "body": "The last news is the Operator of Chipmixer is Vietnam Guy this one can be indication that vietnam is leading crypto than western countries. Usually there is always Vietnam and China on Project related DeFi so this not shocked me. but this is good news tho",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "April 10, 2023, 01:15:54 PM",
      "body": "Quote from: NeuroticFish on April 09, 2023, 04:25:56 PM* There may be that the data is not correct, it's missing something or was misled (for example VPN may easily make people look as being from a different country).* There may be that the Americans are not so interested (as % of population) in crypto because they already have a decent standard of living even without the added benefit of bitcoin / crypto investments* There may be that in Asian countries people are more prone to risk (afaik they also gamble more than the rest)* There may be that in non-US countries people don't care so much of withholding this rather private information (where are you from, did you invest in bitcoin)Depending on how that data was collected some of my answers may not apply.----Imho it's more about the need. Somebody from Vietnam may just try to get 1$ more with crypto. Somebody from US may not bother or would not want to take the risk.This is definitely a good answer!Crypto companies that, to say briefly, rule the game, are based in China/Korea or in Western countries, so, Idk in what way is Vietnam superior in terms of adoption. Also, it's a matter of days if western countries want to implement bitcoin payment and ATMs everywhere. Western countries and some Asian countries are leader in cryptocurrencies, no one can deny that but usually, developing countries are the ones who try to catch with technological progression that comes from western/asian countries because they see it as an opportunity to attract investors and improve income. A great example of that attitude and strategy is El Salvador.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "April 10, 2023, 01:28:24 PM",
      "body": "Quote from: Pezroly on April 09, 2023, 06:59:39 PMThese data are fake. Most Bitcoin users come from USA - https://originstamp.com/blog/the-top-10-countries-that-use-crypto-and-bitcoin-the-most/. And Vietnam is not far ahead in crypto adoption. It's more like biased rather than fake, the article you provide aren't completely true because you can't verify if the data they used were legit or not.Not to mention if some people using mixer or VPN that will hide their real locations. We can't compare one country to another about the Bitcoin adoption because it's subjective, but we can know it if we're ever live there. Looking at how many business accept Bitcoin, Bitcoin ATMs installation, how normal is Bitcoin to random people etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ElmedoRator",
      "created_time": "April 10, 2023, 01:47:25 PM",
      "body": "It seems that the information from the OP is not very accurate about the adoption of cryptocurrencies, I just feel this is a country that also has a small highlight in crypto because there are also a number of projects quite prominent in the market. But the payment of transactions still depends on cash, I have also lived and worked in Vietnam for a while, and I just noticed that they have a very large number of internet users, and there are payment gateways. online is very effective, but it is well applied in big cities, and some localities have not really applied it. I also admit that the awareness of cryptocurrencies in Vietnam is huge, but a rather negative environment in terms of market approach. However, I also have a problem, the use of cryptocurrencies also faces many challenges, if their governments can come up with new policies and regulations to ensure the safety and protection of users. dissemination might be better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "April 10, 2023, 03:13:24 PM",
      "body": "Actually, it needs to be reviewed in terms of what bitcoin adoption is like in that country, it can be in the form of a trend of adoption by small businesses because regulations are friendly. But that doesn't mean it can boost the use of crypto and make it a priority currency, while crypto is just a payment option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}