{
  "id": "topic_5421083",
  "title": "Paslir",
  "author": "Paslir",
  "created_time": "November 15, 2022, 09:22:17 AM",
  "content": "I understand that the expectation is that between 10k-13k will be the Bitcoin value before it steady will go up. But could it be that at 16k it will hold and grow from there?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5421083",
  "comments": [
    {
      "author": "boyptc",
      "created_time": "November 15, 2022, 09:34:33 AM",
      "body": "Quote from: Paslir on November 15, 2022, 09:22:17 AMI understand that the expectation is that between 10k-13k will be the Bitcoin value before it steady will go up. But could it be that at 16k it will hold and grow from there?Just think of any possibility is there.We can't hold the market from here and there. Just be open to any possibility that's for sure can happen since bitcoin is volatile in nature. It can nosedive to $10k but it could also go back higher than the last ATH but, the matter on this one is that it will sure take a lot of time before it proceeds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paslir",
      "created_time": "November 15, 2022, 09:45:39 AM",
      "body": "Thanks for reply Boyptc. I will invest 5k and can do long term investment. So I estimate that in the long run, even today is a good time to invest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "November 15, 2022, 09:53:27 AM",
      "body": "Its entirely possible that bitcoin reached the bottom, but my gut feeling is telling me that we are not yet there, mainly because some other platform/exchange might be affected with what happened lately and that may unravel in coming months which could bring bitcoin even further down.While current entry price is certainly good (and timing the bottom is practically impossible), if you are not sure about going all in (or afraid that bitcoin may go down even more), you might consider using dollar cost average in order to have some funds ready if we dip lower. At least that's what I have been doing for quite some time and so far it worked like a charm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paslir",
      "created_time": "November 15, 2022, 10:01:43 AMLast edit: November 15, 2022, 10:12:05 AM by Paslir",
      "body": "Quote from: Rikafip on November 15, 2022, 09:53:27 AMif you are not sure about going all in (or afraid that bitcoin may go down even more), you might consider using dollar cost average in order to have some funds ready if we dip lower. Rikafip, thanks for your posting. What do you mean with dollar cost average?UPDATE: Found it on internet, so invest in small amounts over time instead of all at once!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "November 15, 2022, 10:12:41 AM",
      "body": "Quote from: Paslir on November 15, 2022, 10:01:43 AMRikafip, thanks for your posting. What do you man with dollar cost average?It is an investing method in which you divide the amount you plan to invest in several equal parts and you buy the asset in regular intervals, no matter the price. So for example, you mentioned that you want to invest $5k now; with DCA method you divide that amount to let's say 10 equal parts and every 2 weeks/month /etc you buy $500 worth of bitcoin. Thing is, many people try to time the market to buy at the bottom, which they usually fail (unless very lucky) or sometimes not buy at all as they missed it so instead worrying over that, you simply buy bitcoin at regular intervals. Way less hassle and worrying, and it works very well if you plan to hold for longer period of time and not buying for a quick flip.  Keep in mind that there is a chance that you may profit more if you go all in now, but another reason why I prefer DCA is because it helped me to be more disciplined when investing. Here is also an article about it https://www.investopedia.com/terms/d/dollarcostaveraging.asp",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paslir",
      "created_time": "November 15, 2022, 10:30:26 AM",
      "body": "Thanks Rikafip, can you credit users here and how?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "November 15, 2022, 10:41:28 AM",
      "body": "Quote from: Paslir on November 15, 2022, 10:30:26 AMThanks Rikafip, can you credit users here and how?Np. By credit I guess you mean merit, so here you can find the guide about it. If you have any further questions how forum works I suggest you to check pinned messages in Meta and Beginners & Help sections (especially focus on the latter) as we are kinda offtopic here. And yeah, welcome to the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "November 15, 2022, 11:48:22 AM",
      "body": "Quote from: Paslir on November 15, 2022, 09:22:17 AMI understand that the expectation is that between 10k-13k will be the Bitcoin value before it steady will go up. But could it be that at 16k it will hold and grow from there?No one knows, but based on experience, when we expect something, the opposite happened. Just like in the last bull run, we thought that $100k could be the highest, but we didn't reach that price.So expect the unexpected as others will say.And it's just a question on how you are going to cope if the price suddenly goes down to $10k-$13k levels, are you ready to buy more? or still wait still?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "November 15, 2022, 11:53:34 AM",
      "body": "Quote from: Paslir on November 15, 2022, 09:22:17 AMI understand that the expectation is that between 10k-13k will be the Bitcoin value before it steady will go up. But could it be that at 16k it will hold and grow from there?The possibility is there, we thought that $17,500 could be the bottom for this year and yet it was broken when we have an FTX collapsed.And so we still have the bearish market till next year, 2023, so who knows, maybe there will be another shake up due to some FUD or we will have another Terra Luna or FTX scenario that will put a dent on the market price. The sad thing is that it's not bitcoin's fault, but since we are all connected then we can't do anything about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "November 15, 2022, 11:53:49 AM",
      "body": "Quote from: Yaunfitda on November 15, 2022, 11:48:22 AMQuote from: Paslir on November 15, 2022, 09:22:17 AMI understand that the expectation is that between 10k-13k will be the Bitcoin value before it steady will go up. But could it be that at 16k it will hold and grow from there?No one knows, but based on experience, when we expect something, the opposite happened. Just like in the last bull run, we thought that $100k could be the highest, but we didn't reach that price.So expect the unexpected as others will say.And it's just a question on how you are going to cope if the price suddenly goes down to $10k-$13k levels, are you ready to buy more? or still wait still?if in case, we will hit rock bottom like 10k level, guess, a lot of whales will be buying that dip. and so eventually, the price will bounce back. but indeed, in this market, it is full of surprises. we can't exactly predict what will happen next. this will be another history in the making if in case we will go down to that price level. time to stash your satoshis before it is too late.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "November 15, 2022, 12:06:18 PM",
      "body": "I just don't expect a Bitcoin/crypto bull market before January 2025. Buckle up for a crypto winter in 2023 and 2024.I don't care about the BTC price going below 10K USD. Even 5K USD price bottom is possible, but there will be a price recovery, unless all crypto exchanges collapse as a house of cards and the crypto market returns back to the 2014-2017 \"glory days\". Selling during a period of panic/bear market/crypto winter is always a wrong move, but many traders simply need cash and they don't have any alternative other than selling their crypto. The global stock markets will be facing a winter as well. Big tech corporations had overpriced stocks for years and now their stocks are dropping like rocks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reid",
      "created_time": "November 15, 2022, 12:59:39 PM",
      "body": "It's possible to stay at this mark if it can survive the wave that is happening due to the FTX dump. If investors will decide to buy back their Bitcoin in a different exchange then we might even see it going back to 19-20k and it will stay there. Because for me, that is our bottom but recent event changed that. Have you ever thought of what if the FTX bankruptcy didn't happen at all? We can definitely be stagnant at 19k and all it takes is another good news to be in demand again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "edward500",
      "created_time": "November 15, 2022, 02:10:12 PM",
      "body": "What I have learned with bitcoin is if you think the rock bottom is 10K, it will just not reach 10K, but probably a little higher than that.I actually learned my lesson with this a few times with bitcoin since it was in the single digits.When bitcoin was $30, I was waiting to buy bit in at $1.00, it got to maybe $1.98 and never looked back.Then when bitcoin was $1000, I was thinking $100 was the right price when it tanked, but it never got there but close.This is why, if you think 10K is the rock bottom, Its probably only going to 15K. This is why I'm adding a lot more bitcoin from the last bitcoin I purchased for 23K, doubling my position almost.  I think things are just so bad right now, you have the economy tanking, the stock market tanking, there is so much fear with bitcoin. Everyone is very bearish. These are the best times to buy, I mean how much worse can things get?Yes, I'm scared as heck right now buying, but I've been through this enough to know that the best times to buy are when there is max fear and we have well more than max fear right now. Yes, the whales will pump bitcoin again very easily when things calm down globally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darewaller",
      "created_time": "November 16, 2022, 02:48:42 PM",
      "body": "Quote from: Reid on November 15, 2022, 12:59:39 PMIt's possible to stay at this mark if it can survive the wave that is happening due to the FTX dump. If investors will decide to buy back their Bitcoin in a different exchange then we might even see it going back to 19-20k and it will stay there. Because for me, that is our bottom but recent event changed that. Have you ever thought of what if the FTX bankruptcy didn't happen at all? We can definitely be stagnant at 19k and all it takes is another good news to be in demand again.I do agree that people who are acting quick to buy from these levels could definitely make a huge profit from it. Not that easy and wouldn't be really that amazing to do, but definitely going to help them in the short term for sure.We are definitely going to 20k levels and that means we are going to end up with a good profit when the time comes. That’s not going to be an easy task, it’s going to end up with a bit of a problem in the long run if you wait too long and miss that chance. I would suggest everyone to get bitcoin right here at this price so that they could make a good profit. Anyone who thinks it will go down even more and wait could end up with a big chance missed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "November 16, 2022, 04:33:31 PM",
      "body": "Quote from: Paslir on November 15, 2022, 10:01:43 AMUPDATE: Found it on internet, so invest in small amounts over time instead of all at once!It is good if you finally understand how to invest in bitcoin from time to time. It helps you to buy bitcoin at a much lower price, which gives you the opportunity to get more bitcoin when you can buy at a lower price. But you need to adjust your funds to be spread on many low prices and that means you need to analyze every bitcoin movement to find the time to buy bitcoin. For example, you can buy a few orders at $17k, $16k, $15k, $14k, and the last $10k (if this will happen). And once the target is reached, you can wait for the other target. And if the price increase, you need to wait until the price is down again. Maybe we will see many dips before the price starts a new rally and break the higher price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CageMabok",
      "created_time": "November 16, 2022, 04:39:57 PM",
      "body": "Quote from: Paslir on November 15, 2022, 09:22:17 AMI understand that the expectation is that between 10k-13k will be the Bitcoin value before it steady will go up. But could it be that at 16k it will hold and grow from there?That's definitely very possible since there's no particular reason for Bitcoin to rise from a price of $16K. As long as purchases can increase in the near future and investors will continue to enter the market to buy, an increase in the price of Bitcoin is definitely possible and there will be no obstacles if the demand for buying can continue to soar in Bitcoin. So the increase doesn't necessarily have to come down to a lower price than now, even though anything is still very possible to happen to Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "November 16, 2022, 05:14:24 PM",
      "body": "My question would be, where is all of this Bitcoin going to come from that will crash the market?  Exchanges have sold more BTC than they have, the largest miners are going bankrupt with no BTC on their books, and most fly by night retail investors have exited the market completely.  Until the US dumps their confiscated BTC or mtgox distributes the BTC they're sitting on, the market is basically just collapsing as users on exchanges sell their imaginary BTC at market prices.  At some point these entities are going to have to start buying BTC to make their customers whole again, even if it's in bankruptcy.  This crash won't last forever.  Just take custody of your BTC and wait it out at this point.  The time to sell was above $50K a year ago.  Selling now makes no sense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "November 16, 2022, 08:12:30 PM",
      "body": "Quote from: Paslir on November 15, 2022, 09:45:39 AMThanks for reply Boyptc. I will invest 5k and can do long term investment. So I estimate that in the long run, even today is a good time to invest. Good luck!You're right that even today, it's a good time to invest. The price of everything has gone done and you just have to pick what you want to pick but, make sure that you won't ignore bitcoin.There are analyses and speculations that it may go lower but it's all on you if you'll wait for that moment before buying or much better to buy now and just do the DCA.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheGreatPython",
      "created_time": "November 17, 2022, 08:50:01 PM",
      "body": "Quote from: CageMabok on November 16, 2022, 04:39:57 PMQuote from: Paslir on November 15, 2022, 09:22:17 AMI understand that the expectation is that between 10k-13k will be the Bitcoin value before it steady will go up. But could it be that at 16k it will hold and grow from there?That's definitely very possible since there's no particular reason for Bitcoin to rise from a price of $16K. As long as purchases can increase in the near future and investors will continue to enter the market to buy, an increase in the price of Bitcoin is definitely possible and there will be no obstacles if the demand for buying can continue to soar in Bitcoin. So the increase doesn't necessarily have to come down to a lower price than now, even though anything is still very possible to happen to Bitcoin.Why not? I think btc can rise in any given value. One example is when the bull run is starting. It's rise is also consistent even if the value is already high. $16k is a low value already and as you can see the price became stable on this level. I think there is no drops that will be recorded anymore but the price is only preparing to take off.Or maybe you mean is that there are no positive news right now that will trigger an upward movement? That can be true but there are always people who will start buying now because $16k was one of the bargain price many are waiting for. There's also a lot of encouraging posts and that helps people to buy instead of be scared of what have happened recently.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}