{
  "id": "topic_5416030",
  "title": "SOKO-DEKE",
  "author": "SOKO-DEKE",
  "created_time": "October 05, 2022, 01:41:17 PM",
  "content": "Hello! I am newbie and my purpose to be here to learn more about Bitcoin and I  believe I can provide strong security to my Bitcoin with this forum guidance. If a transaction happens and it verified on a blockchain and the miner receives Bitcoin for the proof of work does is the Bitcoin miner received count as another transaction that then itself has to verified  and add to ledger Or the transactions only verified and added to the ledger occured when Bitcoin is sent between and individuals rather than earned through mining?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416030",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "October 05, 2022, 01:52:01 PM",
      "body": "If I understood the question correctly. All transactions are recorded on the blockchain. See this recent block that was mined: https://www.blockchain.com/btc/block/757218Coinbase rewards (mining rewards) are all recorded on blockchain.All transactions are recorded on the blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mocacinno",
      "created_time": "October 05, 2022, 01:57:09 PM",
      "body": "I'll try to expand on the above answer:The miner creates a merkle tree of <1Mb of transactions from it's mempool ( <1 Mb excluding the witness data). He/she tries to use transactions with the highest fee (in sats/vbyte). It's pretty normal to see >2500 transactions/block.The input values minus the output values equals the fee of the transaction.The miner can add a coinbase transaction to his own address in the block he/she is solving. This one coinbase transaction can have a maximum value of the current block reward plus the SUM of ALL transactions in the valid block.So, to sum it up... Yes, the mining rewards are also payed to the miner as a transaction that is included in the very block the miner is trying to solve. However, it's not that every fee is payed to the miner as a seperate transaction. It's one transaction for the block reward and ALL the mining fees of EVERY transaction in the block he/she is trying to solve. And a coinbase reward for a block containing 2500 transactions doesn't have 2500 inputs, just one output (it can have several if the miner choses to), so the tx is pretty small aswell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "October 05, 2022, 02:14:21 PM",
      "body": "The miner just mines blocks that contain transactions. The one that pays them is included in that block. Each block is mined on average every 8-10 minutes. This also means transaction confirmations aren't instant (and normally take about 20-30 minutes to receive 3 or 4 confirmations if a competitive fee is paid).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "October 06, 2022, 09:04:49 AM",
      "body": "Quote from: SOKO-DEKE on October 05, 2022, 01:41:17 PMIf a transaction happens and it verified on a blockchain and the miner receives Bitcoin for the proof of work does is the Bitcoin miner received count as another transaction that then itself has to verified  and add to ledger Or the transactions only verified and added to the ledger occured when Bitcoin is sent between and individuals rather than earned through mining?About miners receiving coins:First of all, the miners in the way blockchain sees them are the solo miners and the pools. They don't receive reward for blocks they mine (see it as a competition), not just because they're working.A mining pool that managed to mine a block (i.e. add it to the ledger/blockchain) will receive the block reward and the transaction fees of the included transactions and all this is part of the coinbase transaction. (Here) it's not a separate transaction.The miners from the pool will get then coins based on the pool calculation and based on the amount of work they've done. The miners will - sooner or later - withdraw their earnings, clearly, as different transactions.But, coming back to the coinbase transaction, there is no separate transaction for paying the transaction fees, neither between the blockchain and the mining pool (the transaction fees are delivered in the same \"special transaction\" the block reward is also delivered - actually better wording would be claimed), nor between transaction sender and the mining pool.About transaction verification:A transaction, when it's sent, all the inter-connected nodes will verify it when they receive it. Ultimately, the miner node, depending on the fee used by the transaction, how busy the network is and other rules, will include the transaction into a block when it will mine it (keep in mind that blocks are mined at an average of 6/hour).When one sends transaction to another, the recipient will probably see it almost instantly, but that's an unconfirmed transaction which is safe to not take into consideration until it actually gets confirmations (without confirmations you can see it only as a promise - which can sometimes be an empty promise).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odolvlobo",
      "created_time": "October 06, 2022, 09:23:40 PM",
      "body": "Quote from: SOKO-DEKE on October 05, 2022, 01:41:17 PMIf a transaction happens and it verified on a blockchain and the miner receives Bitcoin for the proof of work does is the Bitcoin miner received count as another transaction that then itself has to verified  and add to ledger Or the transactions only verified and added to the ledger occured when Bitcoin is sent between and individuals rather than earned through mining?The block chain is the \"ledger\". A miner collects new transactions and places them into a block. These transactions have been \"added to the ledger\" when the block is added to the block chain.In addition to the new transactions, the miner is paid by including a transaction that sends the block reward to an address. This is called the \"coinbase\" transaction. Just like every other transaction, the coinbase transaction \"added to the ledger\" when the block is added to the block chain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}