{
  "id": "topic_5434806",
  "title": "ImThour",
  "author": "ImThour",
  "created_time": "January 15, 2023, 11:23:02 AM",
  "content": "Bitcoin 1 Week Chart and 1 Day Chart shows Hash Ribbon Buy Signal.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434806",
  "comments": [
    {
      "author": "dragonvslinux",
      "created_time": "January 15, 2023, 11:41:22 AM",
      "body": "Just noticed this today as well. Unsurprising given price is now back above estimated mining costs as hash rate consolidates at it's highs. It's a good sign nonetheless.Also forgot that last year the hash rate recovery never signalled a buy, as price never closed above the recovery price of $21.5K. This time there is clearly positive price action to back up such network growth.End of the week arrives today, so looks like this will be confirmed. Just another piece of the puzzle for a trend reversal by looks of it. Same signal currently flashing on Monthly time-frame as well I see.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "January 15, 2023, 04:10:27 PM",
      "body": "Quote from: dragonvslinux on January 15, 2023, 11:41:22 AMJust noticed this today as well. Unsurprising given price is now back above estimated mining costs as hash rate consolidates at it's highs. It's a good sign nonetheless.Also forgot that last year the hash rate recovery never signalled a buy, as price never closed above the recovery price of $21.5K. This time there is clearly positive price action to back up such network growth.End of the week arrives today, so looks like this will be confirmed. Just another piece of the puzzle for a trend reversal by looks of it. Same signal currently flashing on Monthly time-frame as well I see.Yeah, these (I call them, perhaps erroneously, fundamentals) are what always makes my juices flow much more than any market updates (FTX asset recovery for example) which I always feel have only temporary impact.What completely missed my radar was the absence of buy signals from hash rate recovery, which says a lot about using this indicator. If so, though, are we then pulling back when the indicator suggests a reversal?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "January 15, 2023, 09:02:58 PM",
      "body": "Quote from: buwaytress on January 15, 2023, 04:10:27 PMIf so, though, are we then pulling back when the indicator suggests a reversal?Technically it's a \"one way indicator\" ie UPOnly. Sometimes the capitulation signal arrives after price capitulates, as this is what causes hash rate to correct. Other times it can act as a reversal indicator when a capitulation signal occurs while price is bearish or trading sideways. It's probably about 50/50 in this sense. This is also as sometimes the capitulation signal occurs when hash rate is merely consolidating.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 15, 2023, 11:43:56 PM",
      "body": "heres a few things about using \"hash\" for a base value to guide the market above ityou need to take alot of real world details into account. yes small silly hobby miners react based on daily movements and their monthly bills.but they are part of the speculative market zone(above value)becasue there are many mining costs across the worldhowever. separating out the weak from the efficient..the most efficient mining ON THE PLANET is a separate indicator. it doesnt play by daily whims it has hardware that last a couple years before upgrading. it has electric contracts of 6-24 months. and so no matter the hashrate they still mine. as there is no cost benefit not to mine if they have contracts of electric for long periods. (they save nothing by stopping, they just waste time by not mining)if you can calculate their costs of a 6 month run based on last 6 months average hashrate. and last 6 months of coin rewards. then you can calculate the cost per coin baseline. which should 'step up' incremental each 6-24 months rather then pander to the daily whimsabove that base line. then you can start to build more short term indicatorsbut one thing is for sure $19,20,21 is not a base line.. the line is still near the 15 zone.. right now the most impacting indicator this week is the futures market. where there are alot of deals not wanting to see the price go above $21k before their futures contracts expire.. hence the artificial flatline on the spot market resisting prices going above $21k this week due to whale day trading/arbitraging to keep it down to ensure their larger futures contracts win.so enjoy those subtle hints",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "January 16, 2023, 07:36:31 AM",
      "body": "Thank you for this alert, and I personally believe that Bitcoin has entered into the long-term bullish phase, the bearish phase that dominated last week might be indeed over for now.I don't believe that there is still a trend/swing trading indicator/strategy that is yet to show GREEN for the bullish trend, and it's worth noting that the price action on the weekly chart calls for it. If you look at the last 8 preceding candles on the weekly chart you posted, the market was so sluggish and tarried so much with tight daily movements.It's now practical for a decisive breakout to cause a bullish confirmation across the market board after the decisive breaking of the peak of the sideways market last week.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "January 17, 2023, 11:46:28 AM",
      "body": "Quote from: franky1 on January 15, 2023, 11:43:56 PMit doesnt play by daily whims it has hardware that last a couple years before upgrading. it has electric contracts of 6-24 months. and so no matter the hashrate they still mine. as there is no cost benefit not to mine if they have contracts of electric for long periods. (they save nothing by stopping, they just waste time by not mining)I think it's becoming more complicated than that personally, even if the mining industry remains majoritively traditional. Take for example the hydrodams in Italy that are effectively weather-dependant miners during droughts (including winter), especially when gov subsidiaries are withdrawn. Not forgetting as well general energy demand, whereby if grids have excess electricity they are increasingly putting it into Bitcoin as opposed to expensive storage. While this is still the minority of the mining industry these hybrid models are becoming increasingly popular, so it's not 100% true that disposable miners are permanently used due to their short life span on fixed rate electricity. There's no need for an electricity contract when you own or have control of electricity, likewise if your produce it yourself with renewable energy, the latter we know is a sizeable chunk.It may seem mad that affiliated industries would only use miners maybe 25-50% of the time, but they've obviously done the math and realised that for example continuing to run a dam over winter, even if only using miners for a few months (rentals maybe?), or otherwise electrical grids also using them, is cost effective for them. So overall, cost of mining is becoming increasingly complex and thus effects hash rate. I see the argument that if say rented miners weren't at a dam over winter, they'd simply be somewhere else, but this doesn't factor in overall business expansion from these modern \"mobile\" mining companies.Quote from: franky1 on January 15, 2023, 11:43:56 PMif you can calculate their costs of a 6 month run based on last 6 months average hashrate. and last 6 months of coin rewards. then you can calculate the cost per coin baseline. which should 'step up' incremental each 6-24 months rather then pander to the daily whimsabove that base line. then you can start to build more short term indicatorsbut one thing is for sure $19,20,21 is not a base line.. the line is still near the 15 zoneI also don't think the average mining cost can accurately factor in renewable energy, as that's not really possible to easy to calculate, nor cost for hydrodams and electrical grids contribution, offsetting storage costs vs loss of gov subsidiaries vs operating costs and the rest. It seems to be a simplistic calculation based on average cost of electricity (globally) vs the average mining reward based on (total) hash rate . Clearly, it's not possible to calculate based on the wide range of different electrical costs in different countries based on what hash rate is contributed from which country with x cost, as this data isn't widely available.It's an extremely vague estimate that probably only applies to the hobby miners you refer to, if they were paying an average electrical cost with an averagely efficient miner - not much else. But whether this estimate is rising or falling is relevant, as for the \"part-time miners\" that I referenced, increased value of block rewards is an incentive to start mining, continue or reduce mining... Quote from: franky1 on January 15, 2023, 11:43:56 PM.. right now the most impacting indicator this week is the futures market. where there are alot of deals not wanting to see the price go above $21k before their futures contracts expire.. hence the artificial flatline on the spot market resisting prices going above $21k this week due to whale day trading/arbitraging to keep it down to ensure their larger futures contracts win.Not convinced about the artificial resistance around $21K. $21.5K is the previous macro lower high for many, so breaking through there would be an argument for the end of the bear market (even if others would claim that $25K remains a lower macro high). The futures market is likely respectful of this macro resistance for various reasons, rather than spot market respecting futures.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "January 18, 2023, 04:02:05 AM",
      "body": "The market does not revert from bearish to bullish after a HashRibon indicator changes its signal. There will be retest and wash outs on the market to kill people who believe that market will be bullish after all and over leverage. Retests (usually happen a few times) are helpful to wash out weak hand left overs.Like in 2020, nobody thought Bitcoin can fall to about $4,000 by breaking $6,000 price range that looked like a very solid bottom range for Bitcoin. With a single news from World Health Organization (WHO), it crashed a lot but more surprised, after that a V-shaped recovery occured. After that, bear market completed and Bitcoin officially started its big bull run in 2020 and 2021.Hash Ribbons are useful to say Miner Capitulation is bottom confirmation but after that, it can need a few months for a bull market start. Halving is months away in May 2024, we have one more year till the halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lixer",
      "created_time": "January 19, 2023, 11:41:41 AM",
      "body": "Quote from: hd49728 on January 18, 2023, 04:02:05 AMThe market does not revert from bearish to bullish after a HashRibon indicator changes its signal. There will be retest and wash outs on the market to kill people who believe that market will be bullish after all and over leverage. Retests (usually happen a few times) are helpful to wash out weak hand left overs.Like in 2020, nobody thought Bitcoin can fall to about $4,000 by breaking $6,000 price range that looked like a very solid bottom range for Bitcoin. With a single news from World Health Organization (WHO), it crashed a lot but more surprised, after that a V-shaped recovery occured. After that, bear market completed and Bitcoin officially started its big bull run in 2020 and 2021.Hash Ribbons are useful to say Miner Capitulation is bottom confirmation but after that, it can need a few months for a bull market start. Halving is months away in May 2024, we have one more year till the halving.\"To wash out weak hand leftovers\". I like how it sounds but this can be true. I also think that there are still some of them who are left. They can be a hindrance to our success, so they need to be killed first. There must be a reason for the crash we have last time and I don't think it's about the World Health Organization but are you referring to covid? If it is then I think covid had in fact help people to discover Bitcoin and other online livelihoods so it's not always a bad thing.We overcome the last bear and the price was badly beaten up last time so people should think 2022 is the worst but even if so, we still can pass it as long as we believe on ourselves and the cryptos that we hold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FUCKBSVFUCK",
      "created_time": "May 02, 2023, 08:15:43 AM",
      "body": "I had seen this post (Bitcoin Hash Ribbon Buy Alert)         The price has risen above 25,000 $ from yesterday but has not dropped below 27,000$     The \"Bitcoin Hash Ribbon\" button should be removed from my spam list of replies.    I will start updating my post with the most recent information.      Note: my spam/promotions list is in English, so I used the English version.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}