{
  "id": "topic_5448123",
  "title": "gospodin",
  "author": "gospodin",
  "created_time": "April 09, 2023, 09:30:57 AM",
  "content": "haberin içeriği burada yer alıyor: https://tr.cointelegraph.com/news/sushiswap-hackedbana da @goraset reis söyledi. ilk anda pancakeswap sanıp \"ilk defa hacklenme mi oldu?\" diye sordum ama sushi imiş ana konumuz. sanki daha önceleri bir kere daha çizik yemişti bu arkadaş. haberin içeriğinde şöyle bir kısım var:QuoteDeFi Llama'dan @0xngmi, yalnızca son dört gün içinde SushiSwap'te trade gerçekleştirenlerin etkilenmesi gerektiğini iddia ediyor. Ayrıca, tüm zincirlerde iptal edilmesi gereken sözleşmelerin bir listesini yayınladılar ve adreslerinizden herhangi birinin etkilenip etkilenmediğini kontrol etmek için bir araç oluşturdular.The Block Araştırma Analisti Kevin Peng, şu ana kadar 190 Ethereum adresinin sorunlu sözleşmeyi onayladığını açıklıyor. Bununla birlikte, Layer 2 Arbitrum'daki 2000'den fazla adresin kötü sözleşmeyi onayladığı görülüyor.edit: revoke işlemlerini unutmayın.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448123",
  "comments": [
    {
      "author": "Bthd",
      "created_time": "April 09, 2023, 01:25:06 PM",
      "body": "Merkeziyetsiz platformların bazılarının en büyük hatalarından birisi rekabette geri düşmemek uğruna hızlı hamleler yaparak güvenliği ikinci önceliğe atmak. Geliştirmeler gerekirse çok yavaşlatılmalı ancak etkilenebilecek kitle düşünüldüğünde sadece güvenli olduğundan emin olunduktan sonra uygulamadaki versiyona eklenmeli.Metamask'ın merkeziyetsiz platformlarla etkileşimde son güncelleme sonrasında harcama limitini kendinizin belirlemesine izin vermesi sorunu kısmen de olsa çözmekte faydalı. Bütün varlıkları riske etmek yerine sadece kendi belirlediğiniz limitlerde riske girmiş oluyorsunuz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "April 09, 2023, 02:14:30 PM",
      "body": "SushiSwap yaşadığı hack olayından son dört gün içinde SushiSwap ile etkileşime giren kullanıcılar etkilenmiş görünüyor. RouterProcessor2 problem bu sözleşmeden doğmuş şimdide bütün ağlarda bu sözleşmeyi iptal ettiler yada etmeye çalışıyorlar. OP belittiği gibi revoke yapmayı unutmayın umarım kayıp yaşayan olmamıştır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "April 09, 2023, 08:34:22 PM",
      "body": "Şu sıralar böyle hatalar çok oluyor maalesef, test aşamalarını çok hızlı geçiyorlar yeterli test işlemi yapılmadığından. Sushiswap gibi bir projenin bu işlerde daha dikkatli olmasını beklerdim çünkü kullanıcı kitlesi bakımından baya kullanan insan var.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wolwoo",
      "created_time": "April 09, 2023, 10:08:19 PM",
      "body": "hacklenmişse niye artmış   yüzde 2 artıda",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "April 10, 2023, 05:01:26 AM",
      "body": "Hatırladığım kadarıyla Sushiswap daha önce de hack olayı yaşamıştı. Son 1-2 hafta buraya bağlanıp işlem yapanlar cüzdanlarını revoke etmeli.https://revoke.cash/Bu site de yardımcı olabilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}