{
  "id": "topic_5449586",
  "title": "l3pox",
  "author": "l3pox",
  "created_time": "April 20, 2023, 02:03:19 PM",
  "content": "Ok, talvez a gente concorde que as democracias tem diversos problemas mas são a melhor forma de governo que encontramos até agora, ainda assim o que seria melhor do que 51% felizes e 49% tristes?Consenso.O problema é que é muito difícil articular consenso em grandes comunidades, já é impraticável com algumas centenas de pessoas, o que dirá com milhões.MAAAAS agora começam a surgir ferramentas interessantes de consenso, o próprio bitcoin é uma rede que se sustenta no consenso com liberdade total de saída, opt-in se quiser participar, tchau e benção se não quisero Balaji fala um pouco sobre isso no the Network State, sociedades criadas de baixo pra cima baseadas em consenso e com opcionalidade de saída.Isso é um ponto que tem estado bem presente em meus pensamentos ultimamente mas vim falar de outra coisa que toca nesse assunto de alguma forma:quanto risco à democracia vocês acreditam que as novas tecnologias de deepfake e AI apresentam?Num país que acredita em mamadeira de piroca, não duvido nada que as pessoas acreditem num vídeo que contenha a imagem de um candidato a presidência cometendo um ato ilegal, num vídeo pornô ou falando algo que não disse de verdade.A ideia desse post veio quando vi esse vídeo no instagram da paradigma:https://www.instagram.com/p/Cq3qa2UOUdu/Steve jobs, Trump e uma cantora famosa que eu nem sei quem é pelo rosto (Taylor swift?) falando bem do futuro curso delesobviamente e zoação e criado com AI, mas absurdamente convincente para alguém que não acredita em mamadeira de piroca, imagine para alguém que acredite (sei lá, minha vó...)o que acham?resta alguma esperança ou já era?minha maior curiosidade é: quando as democracias explodirem ficaremos com sistemas que dão mais ou menos liberdade para as pessoas?acredito que vai variar de país pra país mas infelizmente a tendência parece ser menos liberdade, no geral.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449586",
  "comments": [
    {
      "author": "Paredao",
      "created_time": "April 20, 2023, 05:09:46 PM",
      "body": "Perigo para a democracia ou perigo para qualquer coisa ? Imagine que isso não se aplique apena a celebridades e venha para o mundo comum. Imagine que um juiz considere como prova um vídeo ou uma imagem criada com Deep Fake ? Qualquer pessoa pode mandar seu desafeto para a cadeia por causa disso. Terão que se criados setores especiais nas policias cientificas para periciar se aquela imagem ou foto é realmente real. Imagina a trabalheira e o custo que isso poderá gerar. Fora a condenação de pessoas inocentes quando a pericia falhar. Algo muito preocupante.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "April 21, 2023, 07:01:12 AM",
      "body": "Claro que as Deep fakes são um perigo real para a humanidade.A maior parte dos vídeos e imagens que hoje aparecem, são feitas por amadores ou por experiencias de grupos organizados contra determinada coisa. Então as coisas acabam ainda a ser muito básicas e quase qualquer um pode perceber que não é verdade. Mas, se a coisa for muito bem feita, com um bom plano, dificilmente alguém conseguira detetar.Hoje ainda conseguimos fazer essa distinção, porque temos elementos 100% verdadeiros que conseguimos comparar. Mas dentro de alguns anos, com o melhorar da tecnologia, podemos a ter dificuldade de fazer comparações, porque já não conseguimos distinguir o que realmente não esta contaminado com o que esta.Vai ser muito complicado...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "April 21, 2023, 12:36:12 PM",
      "body": "A tecnologia está ficando cada vez mais braba, mesmo.Vi esses dias o trailer desse jogo que tem gráficos e mecanicas absurdas de realistas. Daqui a pouco não vai ter mais como distinguir um jogo ou cena 3D com um video de uma zona de guerra. Olha que absurdo: Unrecord - Official Early Gameplay TrailerAgora soma esse tipo de gráfico ultra-realista com a tecnologia deep fake, onde você já pode simular o rosto e voz de uma pessoa...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l3pox",
      "created_time": "April 21, 2023, 01:25:39 PM",
      "body": "Caraca. Absurdo mesmo o video TryNinjaExato. Além de riscos a democracia vai surgir toda uma nova gama de ataques de engenharia social por áudio ou videoAté que provavelmente em algum momento o “não. Confie, verifique.” Ou “confie, mas verifique.” Estar amplamente difundido. As custas de muitas perdas",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alexrossi",
      "created_time": "April 21, 2023, 03:05:14 PM",
      "body": "Me desculpem mas democracia nos países com problemas de pobreza nunca existiu de verdade.E' so ir no norte - nordeste, aonde em troca de uma pintura da fachada da casa (com uma propaganda, claro) se compram votos, ou até pagando contas medicas de desesperados.Eu diria que o proprio politico brasileiro com muito menos recursos, bem menos avançados de tecnologia sofisticada para fazer deep fake... ja colocou a democracia em risco. Mas isso è principalmente devido a pobreza de quem precisa logo de comida.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "April 21, 2023, 03:55:24 PM",
      "body": "Quote from: TryNinja on April 21, 2023, 12:36:12 PMVi esses dias o trailer desse jogo que tem gráficos e mecanicas absurdas de realistas. Daqui a pouco não vai ter mais como distinguir um jogo ou cena 3D com um video de uma zona de guerra. Realmente esses gráficos ultrarrealistas são surpreendentes. Mas... só quando o jogo sair é que acredito que eles se mantenham nesse nível. Já vi muito nos jogos e normalmente a diferença entre os vídeos em desenvolvimento são melhores do que o jogo em si. Mas, vamos ficar atentos. Quote from: alexrossi on April 21, 2023, 03:05:14 PMMe desculpem mas democracia nos países com problemas de pobreza nunca existiu de verdade.E' so ir no norte - nordeste, aonde em troca de uma pintura da fachada da casa (com uma propaganda, claro) se compram votos, ou até pagando contas medicas de desesperados. Mas isso é fake news... não é tão elaborado como as tecnologias hoje fazem, mas a finalidade é a mesma. Por isso, fica na mesma categoria.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "April 21, 2023, 07:59:41 PM",
      "body": "Quote from: joker_josue on April 21, 2023, 03:55:24 PMQuote from: alexrossi on April 21, 2023, 03:05:14 PMMe desculpem mas democracia nos países com problemas de pobreza nunca existiu de verdade.E' so ir no norte - nordeste, aonde em troca de uma pintura da fachada da casa (com uma propaganda, claro) se compram votos, ou até pagando contas medicas de desesperados. Mas isso é fake news... não é tão elaborado como as tecnologias hoje fazem, mas a finalidade é a mesma. Por isso, fica na mesma categoria.Acho que o @Alexrossi quis dizer outra coisa sobre a democracia. Aqui no Brasil ainda existe em muitos lugares a chamada compra de votos. É aquela história que o sujeito ganha um sapato e depois ganha o outro pé do sapato se o candidato que está comprando o voto for eleito. Isso é clássico no Brasil. Somos um País de miseráveis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alexrossi",
      "created_time": "April 22, 2023, 02:20:32 PM",
      "body": "^Paredao voce quase acertou o que eu quis dizerVoce da um whatsapp na mão de um cidadão que nao tem comida todos os dias, e em troca de mais comida ele è capaz de acreditar que a terra è plana. Sem deep fake o chatgpt, ou outra tecnologia de ponta.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "April 22, 2023, 05:24:32 PM",
      "body": "Quote from: alexrossi on April 22, 2023, 02:20:32 PMVoce da um whatsapp na mão de um cidadão que nao tem comida todos os dias, e em troca de mais comida ele è capaz de acreditar que a terra è plana. Sem deep fake o chatgpt, ou outra tecnologia de ponta.Infelizmente isso é fruto da falta de conhecimento e da necessidade extrema.O problema fica ainda mais grave, quando você consegue enganar pessoas genericamente informadas e com acesso a muita informação. Se chegares a um ponto é que até tens muita informação, mas é quase impossível distinguir o que é verdadeiro do que é falso, complica bastante.E o problema nem é tanto para a nossa geração, que ainda tem elementos que consegue validar se algo é verdadeiro ou falso. Mas a próxima geração poderá ter dificuldade, porque vai ter 1000 artigos verdadeiros e 5000 falsos, no meio dos 6000 artigos, como eles vão encontrar os 1000 verdadeiros? Não será fácil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "April 22, 2023, 06:17:09 PM",
      "body": "Quote from: alexrossi on April 22, 2023, 02:20:32 PM^Paredao voce quase acertou o que eu quis dizerVoce da um whatsapp na mão de um cidadão que nao tem comida todos os dias, e em troca de mais comida ele è capaz de acreditar que a terra è plana. Sem deep fake o chatgpt, ou outra tecnologia de ponta.Isso é a mais pura realidade brasileira. Teve-se a inclusão digital e não se teve o resto. A escola pública é um exemplo claro disso. Você tem exemplos raríssimos de escola pública de qualidade( Etecs, federais, colégio D. Pedro II no rio, dentre outros), mas a maioria esmagadora das escolas públicas são de péssima qualidade. Como ministrar aulas de física, química, biologia sem laboratórios. Muitos ainda acham que no Brasil é só a questão do salário miserável que são pagos aos professores das escolas públicas, mas tem o que é pior ao meu ver: A falta de equipamentos e estrutura básica nas escolas públicas brasileiras. Se o dinheiro público é desviado por corrupção, daí entramos em outra seara.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}