{
  "id": "topic_5398154",
  "title": "venus1100",
  "author": "venus1100",
  "created_time": "May 11, 2022, 10:05:06 AM",
  "content": "MEXC, 11 Mayıs 2022 11.30 (TSİ) tarihinde UST/USDT Vadeli İşlemlerini başlatıyor. UST/USDT, çapraz veya izole marjin modlarında 1-20 kat kaldıracı destekleyecektir. Hem MEXC uygulamasından hem web sitesinden hem de API üzerinden ulaşabilirsiniz.Yeni listelemeyi kutlamak için, kullanıcıların UST/USDT vadeli işlemlerinde alım satım yapmaya davet edildiği ve 7.000 USDT vadeli işlem bonusundan pay kazanma şansına sahip olduğu bir etkinlik başlatıyoruz!Etkinlik Dönemi: 11 Mayıs 2022 11.30 - 16 Mayıs 2022 11.30 (TSİ)Etkinlik Kayıt: https://forms.gle/a39bHRFjYyUici6AAEtkinliğe kaydolduktan sonra lütfen Telegram üzerinden müşteri hizmetleri (@KUTAY_MEXC) ile iletişime geçiniz. Etkinlik 1: Yeni Vadeli İşlemler Kullanıcı Ödülü - 2.000 USDT Değerindeki Bonustan Pay AlınEtkinlik süresince, ilk kez vadeli işlem yapan ve UST/USDT Vadeli İşlemlerinin birikmiş işlem hacmi en az 2000 USDT olan kullanıcılar, 10 USDT vadeli işlem bonusu alacaklardır. İlk 200 kullanıcı ile sınırlıdır.UST/USDT Vadeli İşlem Alım SatımıAyrıca \"Vadeli İşlemler Yeni Kullanıcı Ödülü\"ne aynı anda katılabilir ve aynı anda ekstra Vadeli İşlem bonusu kazanabilirsiniz.$1,000 Bonus Alın (Web): https://www.mexc.com/futures-activity/bonus$1,000 Bonus Alın (Mobil): https://m.mexc.me/futures/activity/bonus Etkinlik 2: UST/USDT Vadeli İşlem Yaparak 4.000 USDT'ye Kadar Bonus Kazanın!Etkinlik süresince, işlem hacmi 5.000 USDT'den fazla olan ilk 200 kullanıcı, 4.000 USDT vadeli işlem bonus ödülünden pay kazanabilirler:Sıralama                   Ödül (Vadeli Bonus)               Minimum İşlem Hacmi      1                                    1.000 USDT                    ≥ 500.000 USDT      2                                    500 USDT                       ≥ 300.000 USDT      3                                    100 USDT                       ≥ 100.000 USDT  4-200                       Kalan ödül havuzunu,                 ≥ 5.000 USDT                  kullanıcı başına 50 USDT vadeli işlem bonusu                      ile sınırlandırılmış, her kullanıcının işlem                           hacmine göre paylaşılmıştır.Etkinlik 3: Günlük Kazanç Ödülü, 1.000 USDT bonus ödülünü paylaşınEtkinlik süresi boyunca, 200 kullanıcı, kazançlarını UST/USDT Vadeli İşlemlerinde Resmi MEXC Vadeli İşlemler Telegram sayfasında paylaşarak 5 USDT Vadeli İşlemler Bonusu kazanma şansını yakalayabilirler.*Günlük kazanç ödülü, etkinlik süresi boyunca her gün talep edilebilir. Ekran görüntüsü aynı gün içinde alınmalıdır. En Yeni Etkinlikler:[MEXC Vadeli İşlemleri] 1.000 USDT’ye varan yeni kullanıcı Vadeli İşlemler bonusunuzu alın!Her Çarşamba-Cuma 5000 USDT Değerinde Bonusu Paylaşmak İçin Hemen Kaydolun >>> NotlarEtkinlik 1'deki bonus, yalnızca yeni vadeli işlem kullanıcıları veya mevcut kullanıcılar tarafından, aktifleştirilmiş vadeli işlem hesapları altında herhangi bir alım satım faaliyeti veya fon transferi olmaksızın kullanılabilir.Hem long hem de short pozisyonlardaki işlemler geçerlidir ve etkinlik katılımı için işlem hacmi dikkate alınacaktır.Ödüller, etkinlikten sonraki 7 iş günü içinde dağıtılır. Lütfen bu süre içinde kontrol sağlayınız.Sahte hacim yaratma ve her türlü hileli uygulama yasaktır. MEXC katılımcının ödülünü veya bir hile eylemi olarak kınanabilecek herhangi bir şüpheli faaliyetin uygunluğunu iptal etme hakkını saklı tutar. MEXC, ödülü iptal etme veya söz konusu kullanıcıların hesabını dondurma hakkını saklı tutar.MEXC, yukarıdaki etkinlik bilgileri için nihai yorumlama hakkını saklı tutar.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398154",
  "comments": []
}