{
  "id": "topic_5444735",
  "title": "Zele365",
  "author": "Zele365",
  "created_time": "March 13, 2023, 03:30:13 PM",
  "content": "Guys I need experienced help from someone who has already bet on these bookies.I'm curious about your experiences with them because I've heard a lot of negative comments about how they lock accounts, steal money, ask for a mountain of documents that are impossible to get and therefore you can't withdraw money from the account. I've read a lot of ugly comments about them, but I'm interested in who can honestly tell me with experience how you fared with those bookmakers?They are in the list:22 betmegapariuberlucky",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444735",
  "comments": [
    {
      "author": "ryzaadit",
      "created_time": "March 13, 2023, 04:17:28 PM",
      "body": "Never heard and never know.Most of us in \"Bitcointalk\" only know a casino site that provided a thread or some information here. Examples like Stake, my signature casino, and other casino who provided the information by creating a thread. Normal common, casino is acting like that. That's why never trusted centralized casino (website) who provided non-KYC feature or something like that, because is always based on term & condition they can ask you do that with some case.Some advice, always tried casino with a review or sharing experience by some people/user not because (Streamer, Youtuber, or random blog).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "marbet85",
      "created_time": "March 13, 2023, 05:38:06 PM",
      "body": "Quote from: Zele365 on March 13, 2023, 03:30:13 PMGuys I need experienced help from someone who has already bet on these bookies.I'm curious about your experiences with them because I've heard a lot of negative comments about how they lock accounts, steal money, ask for a mountain of documents that are impossible to get and therefore you can't withdraw money from the account. I've read a lot of ugly comments about them, but I'm interested in who can honestly tell me with experience how you fared with those bookmakers?They are in the list:22 betmegapariuberlucky22Bet, my experience:This is one of the worst bookmakers. After making the profit, of course, additional verification, first the second document, i.e. the Driving License, then Selfie with a card and their inscription, and finally, additionally, if I paid via e-wallet, a photo with open e-mail from them, wallet and face. They are sick in short.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "March 13, 2023, 06:16:47 PM",
      "body": "No one share experience with megapari yet?  Some o us might just be interested as well.This bookie is in the forum already are marketed here for weeks. I'm sure there are people who sign up just to try them out. If there aren't negative comments yet from the users of this forum about this bookie then maybe they are really up to building a good reputation in the bitcoin community. The rest of the casino seems unheard of here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Team_MegaPari",
      "created_time": "March 14, 2023, 11:47:49 AM",
      "body": "Hey. I am an official representative of the MegaPari gambling platform. We are concerned with the feedback shared in this thread. As far as I can see, what bothers you here is the KYC process that is requested before withdrawal. I have answered many questions regarding the KYC in our ANN thread, which you will find in my signature. The main problem here is that the process might take a longer time due to the low quality of pictures sent to the security department. They may lose in quality after uploading. We also do not ask for the KYC before deposit in order to let a player try the platform freely. The security department reserves the right to request the KYC at any time, but not necessarily after your first withdrawal request. Anyway, please follow our thread to find out more about the brand - FAQ, reviews, promos. Feel free to refer to me there once you have any questions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "March 14, 2023, 11:54:30 AM",
      "body": "Quote from: Zele365 on March 13, 2023, 08:39:11 PMI aksed because i want to play some table tennis matches and they are available on these bookies, but as i said i heard a lot of negative thoughts like marbet85 said… They asking hundred selfies eith documents from you,and ither sick things, even if you make profit, then you need to fight eith them to take your money outThere is one known bookie if you are interested. https://stake.com/sports/table-tennisI always bet on this sport too even though I don't really know the players. I just like the fast results of the game and the availability that can be put in a long parlay for a chance to hit a jackpot in a day.   High risk included of course. Just a suggestion in case you are still having trouble finding a trusted bookie. About the names you mentioned, I have seen them advertise their business here but never really tried them yet. So, I cannot help you out on that query.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "March 14, 2023, 12:08:28 PM",
      "body": "Haven't played on the mentioned casinos, so I didn't fell victims of this so called \"robbers\".In any case though, I will just like to be fair though, maybe it was just like a isolated case for the OP, or this casinos are scamming then we should stay away from it by any cost. For documentation, or the KYC itself, yeah, I know that it's really a pain and we even have a lot of threads about it. That's why most of the time I think that we have already or at least accept that KYC will be a thing for us, no matter we wanted to be 'psuedo-anonymous\" or doesn't want to submit our personal information to casinos or any crypto related services, i.e. exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "March 14, 2023, 01:58:58 PM",
      "body": "Quote from: Zele365 on March 14, 2023, 12:16:22 PMIt is not a problem to submit the basic documentation of your documents and a selfie, but what they are asking for is absurd and exceeds the limits of normality. When you make a profit at the bookmaker, you cannot pay out the money, during the payment they will inform you via email or website that you need to submit a selfie with 2-3 different backgrounds and with different clothes, then when you send it, you wait for their response, which takes 2-3 days. After that, they ask again for some new types of selfies with other documents and they just try to extract some kind of picture from you, which if you are not able to send, then you will never pay your money.It is clear to me that they do this in order to \"make sure\" that no one else is playing on that account, but if your account is from a friend or relative, you will certainly be able to take pictures of all the necessary documentation and pictures, but send someone 20-30 pictures of the documents with various types of selfies and other nonsense, it's still too much and it's embarrassing.This is just absurd. I've never experienced such or heard anyone undergo that many verification.It's quite clear that the casinos you're asking is not that popular here so you'll never get many feedback from forum members. You may as well try reading reviews from other gambling platforms such as casinoguru. I think they are pretty reliable when it comes to ratings. You can also read more complaints there.Megapari - questionnable reputation with 6/10 https://casino.guru/megapari-casino-reviewUberlucky - very good reputation with 8/10 https://casino.guru/uberlucky-casino-review22bet - very bad reputation with 3.7/10 https://casino.guru/22bet-Casino-review",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "March 14, 2023, 06:32:53 PM",
      "body": "Quote from: Yogee on March 14, 2023, 01:58:58 PM-snip-Forum explanation is should be more enough.I never trust any blog review, because could be there has some partnership between the site and casino to make their review good (Paid review). Like Trust Pilot, the casino can bought a fake review to boost their review.Looking online forum review (especially while there has some problem) can take a good note for people who want to play.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "March 14, 2023, 10:26:37 PM",
      "body": "Quote from: Zele365 on March 13, 2023, 03:30:13 PMGuys I need experienced help from someone who has already bet on these bookies.I'm curious about your experiences with them because I've heard a lot of negative comments about how they lock accounts, steal money, ask for a mountain of documents that are impossible to get and therefore you can't withdraw money from the account. I've read a lot of ugly comments about them, but I'm interested in who can honestly tell me with experience how you fared with those bookmakers?They are in the list:22 betmegapariuberluckyI never have played in any of them but if they are FIAT bookmakers this is a common practice from them.I for example personally have had my bet365 account locked once I won over 3000 Euro in total of my game play they closed my account with some really lame excuse.That is why I always play on well established casinos who do not give a damn how much one win and they pay it,some guy had put 117 Ethereum on a tennis game with an odd of over 3 and won it in 383 Ethereum saw this in the chat of the casino and this is a good casino,this is Stake which if you check the chat while playing slots there you will see a lot of such big wins.I don't feel the need of playing anywhere else if some casino satisfy all of my desires for gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "March 14, 2023, 11:04:56 PM",
      "body": "Quote from: Zele365 on March 13, 2023, 03:30:13 PMGuys I need experienced help from someone who has already bet on these bookies.I'm curious about your experiences with them because I've heard a lot of negative comments about how they lock accounts, steal money, ask for a mountain of documents that are impossible to get and therefore you can't withdraw money from the account. I've read a lot of ugly comments about them, but I'm interested in who can honestly tell me with experience how you fared with those bookmakers?They are in the list:22 betmegapariuberluckyNope, but that's likely because I've stuck with mostly mainstream, fiat currency and the biggest gambling sites in the past. However that is an important thing that you have to learn to gauge yourself - how big is the site or app. If you end up on some small, obscure site with broken or copied text, few games, struggle to find much info online about it and cannot find help from places like the support system, it is a very bad sign. In general, big sites are much less likely to scam you simply because they make so much money just from running an honest and upfront gambling site. It's bad for business for them to rip customers off, so unless you intentionally abuse them like trying to sign up for multiple accounts, you're never going to \"get robbed\" by them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "March 14, 2023, 11:22:19 PM",
      "body": "Quote from: Fortify on March 14, 2023, 11:04:56 PMQuote from: Zele365 on March 13, 2023, 03:30:13 PMGuys I need experienced help from someone who has already bet on these bookies.I'm curious about your experiences with them because I've heard a lot of negative comments about how they lock accounts, steal money, ask for a mountain of documents that are impossible to get and therefore you can't withdraw money from the account. I've read a lot of ugly comments about them, but I'm interested in who can honestly tell me with experience how you fared with those bookmakers?They are in the list:22 betmegapariuberluckyNope, but that's likely because I've stuck with mostly mainstream, fiat currency and the biggest gambling sites in the past. However that is an important thing that you have to learn to gauge yourself - how big is the site or app. If you end up on some small, obscure site with broken or copied text, few games, struggle to find much info online about it and cannot find help from places like the support system, it is a very bad sign. In general, big sites are much less likely to scam you simply because they make so much money just from running an honest and upfront gambling site. It's bad for business for them to rip customers off, so unless you intentionally abuse them like trying to sign up for multiple accounts, you're never going to \"get robbed\" by them.The list is not familiar to most of the gamblers. This is why if you have not much of knowledge in this industry, much better if you would engage with mainstream gambling platforms or simply sites with reputation in this industry 'coz they won't be in such recognition for nothing. There are many gambling platforms exiisting in online gambling industry but not all would be worthy engaging yourselves with. Most of the nrw ones are worrisome. Which is why sticking with the popular and old ones would be always a better idea especially if you are just here to make casual betting behavior. New sites are only catchy simply because of huge bonuses they offer but if that would be an exchange to less of a worry, then I'm fine with lower promotions and such.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "March 14, 2023, 11:22:38 PM",
      "body": "I haven't seen any accusation thread against megapari or is it because I have not often been visiting the scam accusations and reputation board maybe that's why I missed the ones raised against them (if there are any,). As for the rest I haven't tried to use them and now that you have brought them up in a topic like this I'm not sure if I'll ever be using them at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Quidat",
      "created_time": "March 14, 2023, 11:46:02 PM",
      "body": "Quote from: Zele365 on March 13, 2023, 03:30:13 PMGuys I need experienced help from someone who has already bet on these bookies.I'm curious about your experiences with them because I've heard a lot of negative comments about how they lock accounts, steal money, ask for a mountain of documents that are impossible to get and therefore you can't withdraw money from the account. I've read a lot of ugly comments about them, but I'm interested in who can honestly tell me with experience how you fared with those bookmakers?They are in the list:22 betmegapariuberluckyBasing up on the lists, then the only site i do heard of is Megapari and the rest is unknown or never heard of and for sure most people here does too.I havent checked out about Megapari despite on hearing it off but if we do compare about its reputation to those old and reputable bookies of this crypto space then it is really just that far off.The only site i do recommend when it comes to sports betting are these sites.-Sportsbet-Betcoin.ag-Stake-Nitrogensports",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "March 15, 2023, 12:04:35 AM",
      "body": "Quote from: Zele365 on March 13, 2023, 03:30:13 PMThey are in the list:22 betmegapariuberluckyI've never heard of these sites and I don't know why you're looking for a report about them when you yourself said you've read about \"problems\" involving these sites.I usually only bet on sites that have a good reputation, if there are any negative comments I'm already afraid.Really good are the sites that have topics here on Bitcointalk, and interact with users, this gives a lot of credit to the online casino.And you can be sure, we have a lot of good sites with excellent reputations here, so there is no reason for you to bet your money on something unknown and that already has some negative reviews.Stay safe!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "March 15, 2023, 02:02:57 AM",
      "body": "I don't have any experience with the casino on the list but I'm familiar with 22bet because I remember someone posted a scam accusation against them and megapari because they have a post here in the forum telling us about the nomination(of some kind) they got on a gambling award(not sure which gambling award it is). as for uberlucky, never heard of that sportsbook.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "March 15, 2023, 02:20:11 AM",
      "body": "I haven't tried these gambling platforms. I think I am only familiar with megapari among the sites listed. If there are accusations, read them especially the responses of the gambling platforms concerned. If they have no response and they simply leave issues unanswered, I think I would be discouraged from using their platform. Especially if there are many accusations against them. But to be safe, why not just choose those platforms that are quite clean and responsive? You have many options anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "March 15, 2023, 01:05:25 PM",
      "body": "Quote from: ryzaadit on March 14, 2023, 06:32:53 PMQuote from: Yogee on March 14, 2023, 01:58:58 PM-snip-Forum explanation is should be more enough.How can forum explanations be more than enough when none of us could really give a thorough review of the 3 casinos the OP is asking? You couldn't even give your own since you also don't know those casinos except maybe Megapari. That is the main reason why I suggested another platform.QuoteI never trust any blog review, because could be there has some partnership between the site and casino to make their review good (Paid review). Like Trust Pilot, the casino can bought a fake review to boost their review.Well that's on you. Did you even check casinoguru before you decided to group them with the not so worthy Trust Pilot? I think they have a fair rating system. The scores they gave to each casino doesn't look like boosted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "March 15, 2023, 01:30:17 PM",
      "body": "Quote from: Zele365 on March 13, 2023, 03:30:13 PMGuys I need experienced help from someone who has already bet on these bookies.I've used maybe 2-4 of the online crypto casino platforms that are here regularly and I'm still actively using them, as well as experience, betting, bookies and so on to be honest, until now I have never been robbed or stolen anything from me, but it's different from my losing bets, that's a common thing called a game, of course there are winners and losers.Problems that you often see accusations, negative comments about certain casinos/bookies that are here, I see cases that are mostly carried out by (beginners), members who are higher than that I rarely see problems.Two thoughts that come to mind on a case by case basis against bookmakers.1. Online casino rivals, with such accusations, the aim of bringing down the reputation of other casinos, but the opposite is happening.2. It really happened in certain cases, but with their own mistakes, such as multi-accounts, money laundering, cheating and so on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "March 15, 2023, 02:03:34 PM",
      "body": "Quote from: Zele365 on March 14, 2023, 11:52:27 AMI want to play on that bookmaker but i have friends who already fight with your administrators over 3 weeks and how he says he must send 100 selfies and other photos of documents to make withdraw his money and that is not normal reallyIt's better if you ask your friend to create an account in this forum to post a scam accusations thread or you can post behalf of your friend, we don't know if the story you're saying is true or not, it's ridiculous if it's true the casino asking to send 100 selfies lol.Megapari seems care with their reputation in this forum and they also have an active promotion too, so if it's still unresolved you need to post a scam accusation thread against Megapari to force them releasing the funds to your friend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}