{
  "id": "topic_5404080",
  "title": "randomuser22",
  "author": "randomuser22",
  "created_time": "June 25, 2022, 10:36:42 PM",
  "content": "hey all, i was looking to see if anyone can sell/send me some testnet btc. i am new and would love to use these to test some things out. I am looking for around 10 btc. thanks all",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404080",
  "comments": [
    {
      "author": "Stalker22",
      "created_time": "June 25, 2022, 11:48:38 PM",
      "body": "Quote from: randomuser22 on June 25, 2022, 10:36:42 PMhey all, i was looking to see if anyone can sell/send me some testnet btc. i am new and would love to use these to test some things out. I am looking for around 10 btc. thanks allTry contacting notblox1. He offers testnet coins to developers and people who need them, for free.Quote from: notblox1 on June 14, 2022, 11:53:30 PMMy Bitcoin testnet coins are available again, mostly for developers and people that really need them for some testing and real work.If you have some real use case for bigger amount of coins post your request and I will consider sending them to you for FREE, like always.Also, there are some faucets you can try. However, I don’t know if these are still working.Quote from: tranthidung on December 26, 2021, 02:18:27 AMTestnet Bitcoin has its use cases and it is not cheap to mine. So why did you ask for Testnet Bitcoin and up to 3 tBTC?Testnet Bitcoin. Activate, experience it, but don't trade and get scammedThere are few faucets for Testnet Bitcoin but you have to check them out yourself.https://tpfaucet.appspot.com/https://en.bitcoin.it/wiki/Testnet: Find out more in the Faucet section.https://testnet-faucet.mempool.cohttps://coinfaucet.eu/btc-testnethttps://tbtc.bitaps.comhttp://kuttler.eu/bitcoin/btc/faucet/http://bitcoinfaucet.uo1.net/https://tbtc.mocacinno.com/ (you can ping mocacino on the forum)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "saxydev",
      "created_time": "June 26, 2022, 06:34:22 AM",
      "body": "Quote from: randomuser22 on June 25, 2022, 10:36:42 PMhey all, i was looking to see if anyone can sell/send me some testnet btc. i am new and would love to use these to test some things out. I am looking for around 10 btc. thanks allI can send you 1 tbtc, but you will have to deposit into an escrow 1 mbtc for it. Once you are done testing and send back, you can get back your mbtc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d3bt3",
      "created_time": "July 04, 2022, 02:20:25 AM",
      "body": "Quote from: randomuser22 on June 25, 2022, 10:36:42 PMhey all, i was looking to see if anyone can sell/send me some testnet btc. i am new and would love to use these to test some things out. I am looking for around 10 btc. thanks allI got many, do you still need them? How much are they worth to you?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d3bt3",
      "created_time": "October 26, 2022, 01:08:03 PM",
      "body": "There's now a real life market for Testnet bitcoins (tBTC). At this exchange:   https://altquick.com/market/TestnetBitcoin    Curious to see if the free market will finally determine their \"worth\".Hoarders bring your stash!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}