{
  "id": "topic_5500388",
  "title": "Cryptohygenic",
  "author": "Cryptohygenic",
  "created_time": "June 19, 2024, 01:03:04 PM",
  "content": "As a beginner to this bitcoin market, I have understood that long term investing and holding is most beneficial to investors that short term holding.But I being a beginner, I might not be affordable to hold too long because I have read about investors holding their coins for over 4 years.Although I might be reprogrammed to long term investment in the future but I need to be practically convinced in reality based on what the market hold for Investors on long term and short terms.As being speculated of all cryptocurrencies, they are all volatile so I am set to take my profits whenever I can and then the outcome potentials while I am Investing in this bitcoin industry would determine if I will have to hold for long. I don't think I will listen to all that advices of holding longer. We are only here to make profits and face our today's challenges and also prepares for future challenges. So I don't think that investors on the short term goals are at the wrong side because the Speculation of long term holding is excessively making it feel like short term Investors are on the wrong decision",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5500388",
  "comments": [
    {
      "author": "sunsilk",
      "created_time": "June 19, 2024, 01:18:21 PM",
      "body": "You know what brother? just do your own thing and what you're planning as you invest in Bitcoin. It doesn't matter whether you hold for the long term or you short it for profits.Yes, we're all here for profits but it doesn't matter what your strategy is and that's based on your studies and patience as well.Don't compare yourselves to the others. If we're going to hold for long term, what is it for you? we don't just go with the crowds, we're doing this because that's our plan and we know what we are doing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zigabel",
      "created_time": "June 19, 2024, 01:41:58 PM",
      "body": "Quote from: Cryptohygenic on June 19, 2024, 01:03:04 PMAs a beginner to this bitcoin market, I have understood that long term investing and holding is most beneficial to investors that short term holding.But I being a beginner, I might not be affordable to hold too long because I have read about investors holding their coins for over 4 years.Although I might be reprogrammed to long term investment in the future but I need to be practically convinced in reality based on what the market hold for Investors on long term and short terms.As being speculated of all cryptocurrencies, they are all volatile so I am set to take my profits whenever I can and then the outcome potentials while I am Investing in this bitcoin industry would determine if I will have to hold for long. I don't think I will listen to all that advices of holding longer. We are only here to make profits and face our today's challenges and also prepares for future challenges. So I don't think that investors on the short term goals are at the wrong side because the Speculation of long term holding is excessively making it feel like short term Investors are on the wrong decision Even in the long term investment, except in cases where you don't have need for the money any soon enough then it will be okay for you to want to hold further even through the bitcoin cycle but beyond that, you can actually hold long enough for the bull market to peak after which you can exit and then make sure to wait for another potential profitable entry which will turn out to be that which you can actually get to make the most of at the time, the primary aim of every investor is to make some profits off their holdings, any other goal could be secondary to that which they whish to achieve wit their holdings on the investment. short term investors aren't make wrong decisions but its all dependent on what you whish to achieve with your investment and how long it will take to realize it, if you are able to realize the much you want in a short term, its very safe to exit and not wait or want to get more in the process which you may end up loosing probably.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Churchillvv",
      "created_time": "June 19, 2024, 01:50:55 PM",
      "body": "Well, nobody said short term investors are on the wrong side. We only have risk in the market and some risk are higher than others, we do prefer to take a risk that losses are lowered and profit are maximised. So if you prefer to go for the higher risk, it all depends on you and your level of risk tolerance. BTW the higher the risk the higher you are likely to get more rewards?. So the market is an open place, you are not limited to others opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "June 19, 2024, 02:11:31 PM",
      "body": "If you are planning for the short term you are doing it wrong. You're probably sitting on money that you may need in less than 4 years and that's why you want to gamble it to see if you can make a quick profit. I wish you luck but you look like a typical retail investor who invests at highs and sells at a loss out of fear.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helena Yu",
      "created_time": "June 19, 2024, 02:23:44 PM",
      "body": "Quote from: sunsilk on June 19, 2024, 01:18:21 PMYou know what brother? just do your own thing and what you're planning as you invest in Bitcoin. It doesn't matter whether you hold for the long term or you short it for profits.Yes, we're all here for profits but it doesn't matter what your strategy is and that's based on your studies and patience as well.Don't compare yourselves to the others. If we're going to hold for long term, what is it for you? we don't just go with the crowds, we're doing this because that's our plan and we know what we are doing.Well said, I don't understand why people need to follow or rely on someone else decision. It's fine for someone seeking for advice, he will get many replies with many different opinions. But, he's the one that need to choose which one is bad and which one is good for him.If someone can make money from trading and earn more than just holding Bitcoin for four years, I'd say it's better than hold Bitcoin. When was earn more than investing Bitcoin is a shame or a crime lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iranus",
      "created_time": "June 19, 2024, 03:00:24 PM",
      "body": "Quote from: Cryptohygenic on June 19, 2024, 01:03:04 PM So I don't think that investors on the short term goals are at the wrong side because the Speculation of long term holding is excessively making it feel like short term Investors are on the wrong decision Frankly speaking, the results are what we need to care about the most, so choosing to invest short-term or long-term, hold or trade...will depend on each person's choice and preferences. Each person will have different circumstances, different strengths and talents, no one is the same. So make the choices and methods that best suit you. In investment, if you can make a lot of profits from day trading or from short-term investments, even surpass those who are investing for the long term. Who dares to say that you are making a mistake? If those who have seen your results still stubbornly say that you are making mistakes, they are simply jealous of you, so ignore those people. You are investing in yourself, not in anyone else, so there is no need to imitate anyone or follow others, just do what you think is good for you and brings you the best results. But if your choice does not bring the expected success, you should listen to people's advice to make a better choice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "June 19, 2024, 03:01:57 PM",
      "body": "Quote from: Cryptohygenic on June 19, 2024, 01:03:04 PMSo I don't think that investors on the short term goals are at the wrong side because the Speculation of long term holding is excessively making it feel like short term Investors are on the wrong decisionShort-term holding is never necessarily 'wrong'. It's just up to you if you have an actual viable strategy for your short-term trade; because truth be told, like 95% of people are not really capable of trading hence why the default advice is to just hold long term.But you do you mate, it's your money. Make money? Good job! Lose money? Your fault.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "June 19, 2024, 03:06:47 PM",
      "body": "Do what works best for you in that situation, got to remember that not everyone has to do the same thing when it comes to investing, if you feel like you're getting overwhelmed by a long-term investment then don't do it but you have to understand though that you're going to need to be able to make some profit because it's a sad thing and a missed opportunity if you don't invest in bitcoin just because the long-term investment overwhelms you, that's not how you should do things.If you think that you can't do it long-term no matter the convincing, you can probably learn how to scalp the market, although the profits that you're going to get out of that is going to be not a lot, but if you've got the drive to do it, scalping might just be for you. Good luck on your investment journey.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "June 19, 2024, 03:32:45 PM",
      "body": "Quote from: Cryptohygenic on June 19, 2024, 01:03:04 PMAs a beginner to this bitcoin market, I have understood that long term investing and holding is most beneficial to investors that short term holding.No, that is a pure lie, it all depends on what you're good at and how you understand the need for going after the short or long market investment, some traders mostly make use of short term investment and that doesn't as well render the long term one useless or ineffective, we are to define the motive to what we want from the kind of investment we are aiming to take, this will also be acknowledged from the level of how experience we are in it.Quote from: Cryptohygenic on June 19, 2024, 01:03:04 PMBut I being a beginner, I might not be affordable to hold too long because I have read about investors holding their coins for over 4 years. That is why we have individual preference in making a bitcoin investment, some are only targeting the long-time investment as according to how they can afford to risk and wait patiently in other to earn from it, while some must engage on a short-term trade more frequently.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "June 19, 2024, 03:33:07 PM",
      "body": "Quote from: Cryptohygenic on June 19, 2024, 01:03:04 PMAs a beginner to this bitcoin market, I have understood that long term investing and holding is most beneficial to investors that short term holding.But I being a beginner, I might not be affordable to hold too long because I have read about investors holding their coins for over 4 years.You can hold if you have good plan for your investment and have good capital source for your investment as well as prepare money for your individual and family finance in future.You can not hold if you use all money to invest, then you will have to sell your coin when you need money to use or there will be emergency that forces you to sell your coin at any price, even you don't want to sell.Holding bitcoins for 4 years or more than that, is good to get profit.Are you ready for the Bitcoin bull market? What's your plan? Some ideas for youHODL bitcoins, you can do it! Look at HODL camp map to build up strong hands",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "June 19, 2024, 03:38:55 PM",
      "body": "Quote from: Cryptohygenic on June 19, 2024, 01:03:04 PMAs a beginner to this bitcoin market, I have understood that long term investing and holding is most beneficial to investors that short term holding.But I being a beginner, I might not be affordable to hold too long because I have read about investors holding their coins for over 4 years.Although I might be reprogrammed to long term investment in the future but I need to be practically convinced in reality based on what the market hold for Investors on long term and short terms.As being speculated of all cryptocurrencies, they are all volatile so I am set to take my profits whenever I can and then the outcome potentials while I am Investing in this bitcoin industry would determine if I will have to hold for long. I don't think I will listen to all that advices of holding longer. We are only here to make profits and face our today's challenges and also prepares for future challenges. So I don't think that investors on the short term goals are at the wrong side because the Speculation of long term holding is excessively making it feel like short term Investors are on the wrong decision as much as we have long time investors, so also we have short time investor in bitcoin investment. The short time investor don't really want to give in to too much volatility or wait long for any uncertainty with their investment, hence they get a certain percent of their return in investment, they will quickly take out their profit with an option to invest again maybe later in the future. The long time bitcoin investment, is that person that is ready to wait and go through all the rigorous uncertainty and volatility of the market just to get a huge return on his investments, or supposedly a person who just want to keep his bitcoin as an asset that will continue to yield profit for him and maybe pass it on to his children as his legacy. So depending on which side of the divide you want to fall in as an investor, is within your prerogative to choose what you want.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "June 19, 2024, 03:38:58 PM",
      "body": "Emphasis on the OP's use of the term \"cryptocurrency\" because the OP is referring to altcoins as well as bitcoin. When it comes to altcoins, short term gains should be booked and exited. They should not be held for the long term because most of them will do well for sometime and then go down to never come back up again, of course this applies to the ones not coming up to the top 10 list.The exact opposite is true for bitcoin. It is to be held for the long term and sold only case of emergency needs. I started with bitcoin when it costed ~600$/BTC and now it costs...well you see my point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blitzboy",
      "created_time": "June 19, 2024, 03:42:27 PM",
      "body": "Everyone talks about HODLing Bitcoin forever, right? And thats great, if you're already a billionaire. However, most people need to make their money work for them now. So, short-term trading maybe a solution, but risky one. You see, crypto, its an unstable place. It bucks, it kicks, it can throw you off if you're not careful. But if you learn to ride it, you can go places. Taking profits when you can, thats smart. Its knowing when to take a break. You dont want to get greedy, you want to build your wealth steadily.Long-term investing, thats like planting a tree. You gotta nurture it, protect it, and have faith it will grow. But not everyone has that luxury. Sometimes, you need to harvest the fruit now, to eat and to plant new seeds. Dont let anyone tell you one way is better than the other. Its about what works for you. Your money, your rules. Learn the market, trust your gut, and remember, the most important investment you can make is in yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "June 19, 2024, 03:49:15 PM",
      "body": "Quote from: Cryptohygenic on June 19, 2024, 01:03:04 PMI don’t think  I will listen to all that advices of holding longer.I think you actually want our opinions, if you didn’t you would not have opened the discussion if your mind was already made up. Whether you’re hodling for short term or long term make sure you invest only what you can afford to lose. Bitcoin is not a get rich quick scheme, the market is very volatile and it might take longer than you expect before you start seeing significant profits on your investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dezoel",
      "created_time": "June 19, 2024, 04:41:32 PM",
      "body": "Quote from: Don Pedro Dinero on June 19, 2024, 02:11:31 PMIf you are planning for the short term you are doing it wrong. You're probably sitting on money that you may need in less than 4 years and that's why you want to gamble it to see if you can make a quick profit. I wish you luck but you look like a typical retail investor who invests at highs and sells at a loss out of fear. Less than 4 years still looks long because if not, then we can just say less than a month but gambling it is not a good idea because what if we lose? So, it's better if we can just set aside it. If we still want to gamble, we can only use another funds which are not yet planned for something more important.A typical investor can also know what they are doing, so it's better to be specific and instead say that he is like a typical newbie or a weak-handed investor because he is doing it the wrong way. Investing has two types and that is short-term and long-term. There is nothing wrong in doing short-term investing as long as we know how to execute it well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gladitorcomeback",
      "created_time": "June 19, 2024, 05:08:49 PM",
      "body": "It would be wrong if someone says that short-term investment strategies or plans don't work because there are a lot of investors and traders in the market who are only making short-term investments or trades and they are earning good profits on their investments because it's all about one's understanding about the market and the practices they need to use.Someone who understands the market very well and knows when and in which direction it can move, can be pretty good with short-term trades because they will make their trades according to that, and those who don't have enough knowledge about it might prefer long-term investments.In general, Bitcoin tends to be more suitable for the long term because of its price going up gradually over a period while altcoins tend to be more volatile in short term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "liasbaa",
      "created_time": "June 19, 2024, 05:21:05 PM",
      "body": "You need to invest in Bitcoin for profit which is short or long term anyway. Your decision should definitely be Bitcoin. Most of the crypto market is full of fraud there Bitcoin can meet your expectations but long term DCAing method. Short term investment ideas are relatively less likely to pay off but buying during dips period can give you huge profits in future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptohygenic",
      "created_time": "June 19, 2024, 05:26:09 PM",
      "body": "Quote from: sunsilk on June 19, 2024, 01:18:21 PMYou know what brother? just do your own thing and what you're planning as you invest in Bitcoin. It doesn't matter whether you hold for the long term or you short it for profits.Yes, we're all here for profits but it doesn't matter what your strategy is and that's based on your studies and patience as well.Don't compare yourselves to the others. If we're going to hold for long term, what is it for you? we don't just go with the crowds, we're doing this because that's our plan and we know what we are doing.Yeah thanks! That is really based on individual goals of what we want and the strategies of how we can get it done.I also don't see senses of following the crowd in this investment space because everything about us differs and all that matters is how we can effectively make those goals done deals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z_MBFM",
      "created_time": "June 19, 2024, 05:32:59 PM",
      "body": "Quote from: Cryptohygenic on June 19, 2024, 01:03:04 PMAs a beginner to this bitcoin market, I have understood that long term investing and holding is most beneficial to investors that short term holding.But I being a beginner, I might not be affordable to hold too long because I have read about investors holding their coins for over 4 years.Although I might be reprogrammed to long term investment in the future but I need to be practically convinced in reality based on what the market hold for Investors on long term and short terms.As being speculated of all cryptocurrencies, they are all volatile so I am set to take my profits whenever I can and then the outcome potentials while I am Investing in this bitcoin industry would determine if I will have to hold for long. I don't think I will listen to all that advices of holding longer. We are only here to make profits and face our today's challenges and also prepares for future challenges. So I don't think that investors on the short term goals are at the wrong side because the Speculation of long term holding is excessively making it feel like short term Investors are on the wrong decision The price of Bitcoin or other crypto coins is not stable. This is why they need to be held for a long time. They are volatile and your coin price may go down or go up after investment as you don't know which way your coin price will move after investment so you should invest with the preparation of a long term holding. Like if the price of the coin drops you can hold it until it recovers and profit or if the price of the coin goes up immediately you can profit from them very quickly.    It will be better for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}