{
  "id": "topic_5460257",
  "title": "jozefpinter",
  "author": "jozefpinter",
  "created_time": "July 18, 2023, 08:43:30 PM",
  "content": "Lets say I want open a LONG position (Stop Limit) with following parameters:Entry price $100Stop Loss: -0.1%Take Profit: 0.5%Please notice: the order is not opened yet---I want move Stop Loss from -0.1% to +0.1%   1. Once the order is opened   2. Once the price reaches over $100 + 0.1% (so I won't suffer any losses)---To achieve this I use Stop Market order with adjusted Stop price (100 + 0.1%)CASE #1: Works only if the position is opened and the price is above 100 + 0.1%IMG 1: https://ibb.co/hgs2m3RCASE #2:    1. I can't use stop market order if the position is not opened   2. If the price reaches Stop Market from below it closes the position - I don't want this.IMG 2: https://ibb.co/fqKrqRC",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460257",
  "comments": [
    {
      "author": "Bitcoin_Arena",
      "created_time": "July 18, 2023, 11:21:08 PM",
      "body": "I am not sure if I completely understood what you are looking forAre you looking for something like A trailing stop loss?I think some platforms offer this kind of order, including certain bots. What exchange are you using?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jozefpinter",
      "created_time": "July 19, 2023, 01:03:13 AM",
      "body": "No, at all. I'm not looking for a trailing stop order type. My main goal is to assure that I won't suffer any loses. I want simply move Stop Loss from -0.1% to + 0.1% - somehow. I don't know how.I can do that with Stop Market order once the price is above +0.1%. But only if the price is above. Thats the issue.Edited:Actually, the trailing stop order type is something similar what I am looking for, but the trailing stop has a backup rate.I want limit potential loses and let some space for potential gains.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "July 19, 2023, 01:53:39 AM",
      "body": "Quote from: jozefpinter on July 19, 2023, 01:03:13 AMMy main goal is to assure that I won't suffer any loses.You only can be sure you won't suffer any loss if you don't trade. Because in the market, sometimes your orders will not be triggered at a right time when market has serious thing like Cascade effect. Orders only help you to reduce risk and minimize effects from such abnormal movements like Cascade effects when many orders will fail to be triggered.QuoteI want simply move Stop Loss from -0.1% to + 0.1% - somehow. I don't know how.I am not sure what you are looking for but let's see two following orders.Stop limit order and OCO (One-Cancel-the-Others) order",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jozefpinter",
      "created_time": "July 19, 2023, 02:43:40 AM",
      "body": "I never heard about OCO orders - I will check it.Stop Limit Order is similar to Stop Market - the issue is that if the price reaches STOP MARKET Price (or Stop Limit)IMG: https://imgbb.com/fqKrqRCIt will sell out my LONG position.I want sell out my LONG position only if the price fall dawn at the Stop Market (Stop Limit) price - from up to down.I don't want sell my LONG position when the price rises at the Stop Market price - from the bottom up",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "July 19, 2023, 07:39:34 AM",
      "body": "Quote from: BlackBoss_ on July 19, 2023, 01:53:39 AMStop limit order and OCO (One-Cancel-the-Others) orderOCO allows you to set both stop loss and take profit at the moment when the position is already open. It does not allow opening positions with built-in closing parameters. @jozefpinter I recommend spending 1 day on the basics of python, generate an API key on your exchange and enjoy any strategies you want. You can code everything.Or, if you are using binance futures (i dont know if its possible on other exchanges, definetly not available on binance spot) you can use this option:https://www.binance.com/en/support/faq/what-are-limit-tp-sl-orders-strategy-order-and-frequently-asked-questions-e1ee1738141c49718550fa9061be4bf3",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "July 19, 2023, 11:23:02 AM",
      "body": "Quote from: jozefpinter on July 19, 2023, 02:43:40 AMI want sell out my LONG position only if the price fall dawn at the Stop Market (Stop Limit) price - from up to down.If you have a running position and the price nearly hit the target price, you have to move your stop loss above your entry price if you want to avoid losses if ever the price went down. QuoteI don't want sell my LONG position when the price rises at the Stop Market price - from the bottom upOnce the Stop Market price is reached, your Stop Market price will stop functioning. In order to avoid selling at the stop market price, you have to move your target price higher than that. Note: Stop Market price is not your target price or take profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jozefpinter",
      "created_time": "July 19, 2023, 02:26:24 PM",
      "body": "I want in advance:1. Open Stop Limit Order with following parameters (Stop price, Price, Size, SL, TP) - Once the price reaches stop price, the position is opened (no problem).2. to move Stop Loss from -0,1% to +0.1% once the position is opened.NOTES:- I can move stop loss manually with stop market order once the position is opened and the current price is above the entry price +0.1% (no problem).- I want to open and close position in advance - two separate orders:Stop Limit order (to open a position) and Stop Market (to close a position)- in this situation, I can use Stop Market order only if: 1. the position is already opened, 2. the current price is above the stop market priceplease check the following images to understand the issue.IMG 1: https://ibb.co/hgs2m3RIMG 2: https://ibb.co/fqKrqRC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "July 19, 2023, 06:00:01 PM",
      "body": "I am not sure if this even exists, like not opened position? In any case, I would say maybe try to use a bot? That way you can tell the bot to just do what you want it to do after it buys something, that way when it buys something it would have that in its mind already and it will do what you ask him to do.Manually that might be a tough one, or even if the exchange has it, which I doubt any of them does, that could still be a hard one but if you are using a trading bot then you are doing something before actually buying any coin, and that way you can tell it to do whatever you want it to do before going into the market. There are a few good ones, I am not going to name them because it would be like marketing so I will refrain from that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}