{
  "id": "topic_5475572",
  "title": "GAM ACHEH",
  "author": "GAM ACHEH",
  "created_time": "November 26, 2023, 02:07:46 PM",
  "content": "Menurut Ethnologue, Indonesia memiliki 715 bahasa daerah dan merupakan negara pemilik terbanyak kedua setelah Papua Nugini dengan 840 bahasa daerah.Dari laporan penelitian, disebutkan setidaknya ada 18 bahasa daerah yang berada dalam kondisi terancam punah.Mengapa bahasa daerah bisa punah?Ada yang disebabkan oleh berkurangnya jumlah penuturnya karena penutur aslinya tinggal beberapa orang saja, tetapi ada pula bahasa-bahasa yang terdesak oleh pengaruh bahasa-bahasa daerah lain yang lebih dominan.alasan tersebut yakni gagalnya transmisi bahasa daerah dari orang tua kepada anak, adanya sikap negatif terhadap bahasa daerah, anggapan bahasa daerah tak bernilai ekonomi, kurangnya perhatian pemerintah daerah.Dalam hal ini kita perlu mendesak anak muda untuk menjaga/mencatat bahasa daerahnya agar generasi berikutnya bisa mempelajari atau setidaknya tau bahasa leluhurnya.Pemerintah daerah juga harus bertangung jawab dalam hal ini.Apa solusi terbaik untuk mencegah kepunahan bahasa daerah?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475572",
  "comments": [
    {
      "author": "khiholangkang",
      "created_time": "November 26, 2023, 02:27:42 PM",
      "body": "Secara garis besar bahwa kita kalah dalam peperangan budaya, mudahnya mendapatkan informasi dan mudahnya mengakses lingkungan di era digital, anak muda lebih tertarik pada sesuatu yang baru, dan menganggap kearifan lokal adalah sebuah hal yang kuno atau jadul termasuk bahasa, dan doktrin itu efektif untuk menarik para pemuda perlahan  menganggap bahwa bahasa asalnya itu tidak begitu penting untuk di dalami, mungkin hanya pada pengucapan aktivitas di lingkungan daerah saja.Jika kita perhatikan dalam pendidikan dari mulai paling terbawah, TK/PAUD hingga SMA yang di tekankan untuk di pelajari adalah bahasa Indonesia sementara bahasa daerah opsional, dan saya pikir hal ini juga menjadi salah satu langkah yang salah pemerintah jika bahasa daerah tidak di tekankan juga.Alasan terkuatnya saya sepakat dengan anda bahwa bahasa daerah di pandang tidak memiliki nilai ekonomi, padahal jika di pelajari lebih jauh mungkin bisa menjadi daya jual kemampuan berbahasa kita di daerah tersebut.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chigo",
      "created_time": "November 26, 2023, 02:56:41 PM",
      "body": "saya sih melihat fenomena ini sebenarnya di dasari oleh peran orang orang tua, misalnya di daerah daerah jawa, saya melihat masih banyak orang orang tua di sana yang memang melestarikan bahasa daerah mereka, berbeda dengan orang orang tua yang berada di kotasaya sebenarnya tidak begitu suka jika kita semua melupakan bahasa daerah kita yang sudah ada sejak jaman dulu dan sudah turun temurun di wariskan dan lebih mengutamakan bahasa indonesia secara penuh, bahasa daerah adalah kekayaan budaya jugapemerintah di berbagai daerah juga sebenarnya harus menjaga kelestarian bahasa wilayah mereka, aturan aturan juga harus di terapkan agar supaya bahasa daerah tidak punah secara perlahan lahan",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "November 26, 2023, 05:36:50 PM",
      "body": "Quote from: GAM ACHEH on November 26, 2023, 02:07:46 PMMengapa bahasa daerah bisa punah?Ga ada insentif untuk menggunakan bahasa daerah. Orang lebih suka belajar Bahasa Inggris -> terbuka lapangan pekerjaan di berbagai bidang, banyak konten menarik di Internet, dsb.Ujung-ujungnya cuan dan kenikmatan.Quote from: GAM ACHEH on November 26, 2023, 02:07:46 PMApa solusi terbaik untuk mencegah kepunahan bahasa daerah?  Apa untungnya mencegah kepunahan bahasa daerah?Kalau tidak ada cuan dan kenikmatan maka orang akan malas mengupayakan. Sehingga agar tidak punah harus ada insentif di situ.Ane kasih satu contoh kenapa banyak orang luar Jawa yang bisa (at least tau dikit) Bahasa Jawa? Salah satunya karena dulu ada Ketoprak Humor. Shownya bagus -> mata dan telinga pada ke situ.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reagansimms",
      "created_time": "November 27, 2023, 09:12:34 AM",
      "body": "Lunturnya minat (penutur aslinya) pada bahasa daerah mereka tergantung sikap dari penutur dalam membudidayakan bahasa daerah mereka pada generasi selanjutnya. Sebenarnya jika ditelusuri lebih dalam, banyak faktor yang menyebabkan bahasa daerah terancam punah. Akibat migrasi atau mereka berpindah tempat ke wilayah yang tidak umum menggunakan bahasa daerah, mereka mulai jarang menggunakan bahasa daerah, perkawinan beda suku juga menjadi sebab terancam punahnya bahasa daerah. Bahasa daerah perlu dijaga karena itu warisan dari nenek moyang suatu suku untuk menandakan darimana mereka berasal. Perlu ditingkatkan kesadaran untuk selalu melestarikan bahasa daerah masing-masing karena bisa berperan sebagai identitas mereka. Belajarlah dari etnis Cina yang ada di Indonesia, meski mereka tercatat sebagai generasi keempat dari garis keturunan yang telah berada di negari orang, mereka tetap melestarikan bahasa ibunya walaupun sangat jarang pulang ke tanah kelahiran nenek moyangnya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bangjoe",
      "created_time": "November 27, 2023, 01:12:42 PM",
      "body": "Quote from: mu_enrico on November 26, 2023, 05:36:50 PMQuote from: GAM ACHEH on November 26, 2023, 02:07:46 PMMengapa bahasa daerah bisa punah?Ga ada insentif untuk menggunakan bahasa daerah. Orang lebih suka belajar Bahasa Inggris -> terbuka lapangan pekerjaan di berbagai bidang, banyak konten menarik di Internet, dsb.Ujung-ujungnya cuan dan kenikmatan.Quote from: GAM ACHEH on November 26, 2023, 02:07:46 PMApa solusi terbaik untuk mencegah kepunahan bahasa daerah?  Apa untungnya mencegah kepunahan bahasa daerah?Kalau tidak ada cuan dan kenikmatan maka orang akan malas mengupayakan. Sehingga agar tidak punah harus ada insentif di situ.Ane kasih satu contoh kenapa banyak orang luar Jawa yang bisa (at least tau dikit) Bahasa Jawa? Salah satunya karena dulu ada Ketoprak Humor. Shownya bagus -> mata dan telinga pada ke situ.Ane sepakat dengan apa yang agan sampaikan pada akhirnya adalah masalah ekonomi, karena belajar bahasa daerah merasa hanya untuk di daerahnya saja dan sejak lahir mereka menggunakannya walaupun tidak sempurna (hanya sealakadarnya saja). Dengan bisa bahasa inggris & bahasa indonesia cakrawala ekonomi jauh lebih luas untuk di lihat dan di dapatkan, maka dari itu para generasi yang melek ekonomi mereka akan lebih tertarik pada bahasa yang bisa membawa mereka mendapatkan kehidupan lebih baik. bagi ane ini cukup sulit, jika kita memilih siapa yang bertanggung jawab akan mencegah kepunahan bahasa daerah jika sudut pandangnya adalah ekonomi, sekalipun upaya itu di lakukan tapi pandangan lain itu tidak bernilai besar untuk mendapatkan insentif.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "November 28, 2023, 01:11:44 AM",
      "body": "Quote from: GAM ACHEH on November 26, 2023, 02:07:46 PMApa solusi terbaik untuk mencegah kepunahan bahasa daerah?  Salah satunya di sekolah-sekolah harus dibuat kurikulum bahasa daerah. Dulu aku pernah tinggal di lampung, dimana banyak warganya mayoritas orang lampung, akan tetapi bahasa yang digunakan bukan bahasa lampung tapi bahasa Indonesia, dan bahkan Jawa karena bahasa lampung di sana \"kalahan\" alias tidak banyak dipakai oleh orang lampungnya sendiri dalam bertutur sehari-hari. Hal ini disebabkan karena berbaur atau bercampurnya orang lokal lampung dengan orang 'transmigrasi\" jawa sehingga ketika bercakap, bahasa yang digunakan itu bahasa Indonesia, bahkan Jawa. Pun, Orang tua mereka terkadang tidak lagi mengajarkan anaknya bahasa lampung sehingga ada orang yang asli lampung tapi tidak bisa berbahasa lampung asli.Ya hampir sama lah dengan medan, di kota tersebut tutur yang digunakan adalah bahasa Indonesia. Sedangkan di daerah lain, semisal Palembang, orang datangan harus tahu berbahasa palembang, karena tutur kata sehari-hari di sana itu bahasa palembang, jadi jika orang datangan tidak paham atau sama sekali tidak tahu bahasa palembang susah, karena dulu ketika saya naik taksi di palembang terkadang bingung, karena drivernya hanya bisa berbahasa palembang, ketika ku ajak berbahasa Indonesia, nangkapnya lambat, hingga hampir tersesat karena beda bahasa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MiauKitchen",
      "created_time": "November 28, 2023, 02:53:04 AM",
      "body": "Masalahnya untuk masalh ini banyak paktor sih,mulai dari paktor lingkungan,paktor pergaulan juga dan mungkin di sini peran orang tua juga penting, sepengetahuan saya untuk saat ini banyak peran orang tua yang mengganti bahasa daerah menjadi bahasa Indonesia, sehingga ketika anak bertumbuh yang mereka tau bahasa Indonesia,karena bahasa daerah nya tidak dipake,(dalam bahasa sehari-hari nya).Menurut saya juga karena untuk saat ini bahasa Indonesia memang dikedepankan dibanding bahasa daerah,misal kita pergi ke satu acara yang mana diacara itu orang berbahasa Indonesia,sedangkan kita misal dari sunda(udah pasti kan bahasa sehari-hari yang dipake bahasa sunda),mau tidak mau kita harus bisa menyesuaikan untuk berbahasa Indonesia yang baik dan benar.Tapi pesan nya untuk anak muda melenial jangan lah melupakan bahasa daerah kalian masing,mau bahasa daerah jawanya, daerah sundanya dllnya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "puloweh555",
      "created_time": "November 28, 2023, 04:46:52 AM",
      "body": "Quote from: GAM ACHEH on November 26, 2023, 02:07:46 PM Menurut Ethnologue, Indonesia memiliki 715 bahasa daerah dan merupakan negara pemilik terbanyak kedua setelah Papua Nugini dengan 840 bahasa daerah.Dari laporan penelitian, disebutkan setidaknya ada 18 bahasa daerah yang berada dalam kondisi terancam punah.Mengapa bahasa daerah bisa punah?Ada yang disebabkan oleh berkurangnya jumlah penuturnya karena penutur aslinya tinggal beberapa orang saja, tetapi ada pula bahasa-bahasa yang terdesak oleh pengaruh bahasa-bahasa daerah lain yang lebih dominan.alasan tersebut yakni gagalnya transmisi bahasa daerah dari orang tua kepada anak, adanya sikap negatif terhadap bahasa daerah, anggapan bahasa daerah tak bernilai ekonomi, kurangnya perhatian pemerintah daerah.Dalam hal ini kita perlu mendesak anak muda untuk menjaga/mencatat bahasa daerahnya agar generasi berikutnya bisa mempelajari atau setidaknya tau bahasa leluhurnya.Pemerintah daerah juga harus bertangung jawab dalam hal ini.Apa solusi terbaik untuk mencegah kepunahan bahasa daerah?  Kepunahan bahasa daerah itu jelas akan terjadi jika kita dan pemarintah kurangnya kesadaran dalam menjaganya dan melestarikannya. Kesadaran itu seringkali hanyut bersama dengan budaya baru yang mendominasi, seperti bahasa indonesia banyak anak muda atau gen z sekarang lebih pede dan bangga berbicara bahasa indonesia daripada bahaya daerah apalagi bisa berbicraa bahasa inggris mereka lebih pede lagi dan merasa keren. Berbicara menggunakan bahasa Indonesia memang diwajibkan diajarkan di Indonesia untuk meningkatkan jiwa persatuan masyarakat Indonesia yang memiliki banyak sekali suku dan bahasa tapi seharusnya pemerintah di setiap daerah harus mewajibkan di setiap sekolah menggunakan bahasa daerah masing-masing dan diajarkan di setiap daerah bila perlu masuk ujian nasional, pemerintah juga harus memberikan fasilitas untuk para pengajar. Karena yang terjadi sekarang, menjadi guru bahasa daerah rendah peminatnya karena tidak terlihat masa depan yang cerah di sana. Jadi tidak heran sekarang para genarasi muda terlihat tidak percaya diri kalau beberbicara bahasa daerah karena kurangnya edukasi pentingnya menjaga bhasa daerah.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "baenschi78",
      "created_time": "November 28, 2023, 06:13:49 AM",
      "body": "Quote from: GAM ACHEH on November 26, 2023, 02:07:46 PMApa solusi terbaik untuk mencegah kepunahan bahasa daerah?  Ada baiknya dalam forum keluarga tetap berbahasa daerah tapi saat di forum sosial berbicara bahasa Indonesia. Tetapi  baik juga jika memiliki anak sedari kecil kita sudah membiasakan berbahasa dengan bahasa daerah dan juga bahasa Indonesia. Dan kalau anak dari kecil diajak berbahasa lain selain 2 bahasa utama. misalkan bahasa Inggris, itu juga baik. Karna saat masih kecil anak ternyata cepat sekali untuk menyerap bahasa atau apapun yg diajarkan. Jangan malu dibilang ndeso dan jangan malu berbahasa daerah. Jangan sungkan bertegur sapa dengan bahasa daerah jika bertemu di manapun dengan sesama.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dewiana",
      "created_time": "November 28, 2023, 09:24:10 AM",
      "body": "Quote from: chigo on November 26, 2023, 02:56:41 PMsaya sih melihat fenomena ini sebenarnya di dasari oleh peran orang orang tua, misalnya di daerah daerah jawa, saya melihat masih banyak orang orang tua di sana yang memang melestarikan bahasa daerah mereka, berbeda dengan orang orang tua yang berada di kotasaya sebenarnya tidak begitu suka jika kita semua melupakan bahasa daerah kita yang sudah ada sejak jaman dulu dan sudah turun temurun di wariskan dan lebih mengutamakan bahasa indonesia secara penuh, bahasa daerah adalah kekayaan budaya jugapemerintah di berbagai daerah juga sebenarnya harus menjaga kelestarian bahasa wilayah mereka, aturan aturan juga harus di terapkan agar supaya bahasa daerah tidak punah secara perlahan lahanPola pikir moderen masyarakat saat ini sudah berubah akibat pengaruh digitalisasi, dan interaksi dengan masyarakat luar juga sudah aktif cepat. faktor urbanisasi besar-besar juga penyebabnya. sehingga dengan urbanisasi sudah berkumpul bermacam etnis dan suku sehingga ditempat tersbutlah mau tidak mau terpaksa mengunakan bahasa indonesia sebagai pemersatu, anak-anak juga di kota-kota juga sudah diasah bahasa indonesia",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "November 28, 2023, 10:38:51 AM",
      "body": "Quote from: GAM ACHEH on November 26, 2023, 02:07:46 PMDalam hal ini kita perlu mendesak anak muda untuk menjaga/mencatat bahasa daerahnya agar generasi berikutnya bisa mempelajari atau setidaknya tau bahasa leluhurnya.Tidak perlu mendesak anak muda untuk mempelajari bahasa daerahnya karena sejak kecil sudah berbicara bahasa daerah dilingkungan tempat tinggal.Anak muda perlu didesak untuk mempelajari bahasa dunia agar mudah membangun dan mempromosi budaya lokal kepada dunia. Desakan agar anak muda perlu mempelajari bahasa dunia karena untuk memudahkan mereka mendapatkan pekerjaan karena hidup bukan kebelakang tetapi kedepan.Quote from: GAM ACHEH on November 26, 2023, 02:07:46 PMPemerintah daerah juga harus bertangung jawab dalam hal ini.Pemerintah yang berperan sebagai pelaksana negara hanya perlu memfasilitasi ruang kepada anak muda untuk melakukan hal-hal yang mendorong mereka maju. Pemerintah tidak boleh memaksa karena kita negara demokrasi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Moneyprism",
      "created_time": "November 28, 2023, 06:45:54 PM",
      "body": "Quote from: Sarah Azhari on November 28, 2023, 01:11:44 AMQuote from: GAM ACHEH on November 26, 2023, 02:07:46 PMApa solusi terbaik untuk mencegah kepunahan bahasa daerah?  Salah satunya di sekolah-sekolah harus dibuat kurikulum bahasa daerah. Dulu aku pernah tinggal di lampung, dimana banyak warganya mayoritas orang lampung, akan tetapi bahasa yang digunakan bukan bahasa lampung tapi bahasa Indonesia, dan bahkan Jawa karena bahasa lampung di sana \"kalahan\" alias tidak banyak dipakai oleh orang lampungnya sendiri dalam bertutur sehari-hari. Hal ini disebabkan karena berbaur atau bercampurnya orang lokal lampung dengan orang 'transmigrasi\" jawa sehingga ketika bercakap, bahasa yang digunakan itu bahasa Indonesia, bahkan Jawa. Pun, Orang tua mereka terkadang tidak lagi mengajarkan anaknya bahasa lampung sehingga ada orang yang asli lampung tapi tidak bisa berbahasa lampung asli.Ya hampir sama lah dengan medan, di kota tersebut tutur yang digunakan adalah bahasa Indonesia. Sedangkan di daerah lain, semisal Palembang, orang datangan harus tahu berbahasa palembang, karena tutur kata sehari-hari di sana itu bahasa palembang, jadi jika orang datangan tidak paham atau sama sekali tidak tahu bahasa palembang susah, karena dulu ketika saya naik taksi di palembang terkadang bingung, karena drivernya hanya bisa berbahasa palembang, ketika ku ajak berbahasa Indonesia, nangkapnya lambat, hingga hampir tersesat karena beda bahasa. saya juga pernah 3 hari berada di palembang gan karen aaa kerjaan kemaren dan bahasa di sana cukup unik, ornag itu bilang wong kito galo, awal nya saya gak ngerti itu apa, ternyata itu pertanyaan untuk orang yang baru di sana, artinya orang kita palembang! kira2 begitu.saya telusuri kenapa orang orang di sana lebih menggunakan bahasa daerah mereka ketimbang bahasa indonesia, itu karena sejak lama bahkan di sekolah sekolah pun, penggunaan bahasa daerah wajib, bahkan mereka yang merantau ke palembang pun wajib paham bahasa asli sana.di berbagai daerah, penggunaan bahasa daerah sudah terlihat seperti kolot, makanya anak2 muda nya jarang menggunakan bahasa asli mereka, malu katanya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Juse14",
      "created_time": "November 28, 2023, 08:22:33 PM",
      "body": "Quote from: Moneyprism on November 28, 2023, 06:45:54 PMQuote from: Sarah Azhari on November 28, 2023, 01:11:44 AMQuote from: GAM ACHEH on November 26, 2023, 02:07:46 PMApa solusi terbaik untuk mencegah kepunahan bahasa daerah?  Salah satunya di sekolah-sekolah harus dibuat kurikulum bahasa daerah. Dulu aku pernah tinggal di lampung, dimana banyak warganya mayoritas orang lampung, akan tetapi bahasa yang digunakan bukan bahasa lampung tapi bahasa Indonesia, dan bahkan Jawa karena bahasa lampung di sana \"kalahan\" alias tidak banyak dipakai oleh orang lampungnya sendiri dalam bertutur sehari-hari. Hal ini disebabkan karena berbaur atau bercampurnya orang lokal lampung dengan orang 'transmigrasi\" jawa sehingga ketika bercakap, bahasa yang digunakan itu bahasa Indonesia, bahkan Jawa. Pun, Orang tua mereka terkadang tidak lagi mengajarkan anaknya bahasa lampung sehingga ada orang yang asli lampung tapi tidak bisa berbahasa lampung asli.Ya hampir sama lah dengan medan, di kota tersebut tutur yang digunakan adalah bahasa Indonesia. Sedangkan di daerah lain, semisal Palembang, orang datangan harus tahu berbahasa palembang, karena tutur kata sehari-hari di sana itu bahasa palembang, jadi jika orang datangan tidak paham atau sama sekali tidak tahu bahasa palembang susah, karena dulu ketika saya naik taksi di palembang terkadang bingung, karena drivernya hanya bisa berbahasa palembang, ketika ku ajak berbahasa Indonesia, nangkapnya lambat, hingga hampir tersesat karena beda bahasa. saya juga pernah 3 hari berada di palembang gan karen aaa kerjaan kemaren dan bahasa di sana cukup unik, ornag itu bilang wong kito galo, awal nya saya gak ngerti itu apa, ternyata itu pertanyaan untuk orang yang baru di sana, artinya orang kita palembang! kira2 begitu.saya telusuri kenapa orang orang di sana lebih menggunakan bahasa daerah mereka ketimbang bahasa indonesia, itu karena sejak lama bahkan di sekolah sekolah pun, penggunaan bahasa daerah wajib, bahkan mereka yang merantau ke palembang pun wajib paham bahasa asli sana.di berbagai daerah, penggunaan bahasa daerah sudah terlihat seperti kolot, makanya anak2 muda nya jarang menggunakan bahasa asli mereka, malu katanya.Ada berbagai alasan mengapa masyarakat sudah nampak jarang menggunakan bahasa daerah. Dan disini saya hanya akan menyebutkan dua saja ;Pertama, berkurangnya rasa peduli dan kecintaan masyarakat terhadap budaya dan daerahnya, sehingga mereka enggan untuk menggunakan bahasa daerahnya. Sementara itu ketika masyarakat sudah enggan untuk menggunakan bahasa daerah, maka daerah tersebut akan kehilangan identitasnya. Belum lagi ditambah dengan perkembangan zaman yang sudah tidak dapat terbendung lagi, hal ini menyebabkan bahwa bahasa daerah ini kurang cocok untuk digunakan pada saat ini. Bahkan tidak sedikit orang yang lebih berbangga diri menguasai bahasa asing dibandingkan dengan bahasa daerahnya. Dan sebetulnya hal ini juga tidak apa-apa, akan tetapi agar penggunaan bahasa daerah ini bisa terus bertahan dikalangan masyarakat, Maka terkait kesadaran masyarakat terhadap budaya dan bahasa ini perlu ditingkatkan kembali dan digemborkan kembali, agar bahasa daerah ini tidak hilang karena terus digerus oleh perkembangan zaman.Kedua, banyak orang yang menganggap bahwa bahasa daerah ini terlalu kasar, sehingga kurang elok untuk diajarkan dan didengar oleh anak-anak. Sehingga masyarakat lebih memilih untuk menggunakan bahasa nasional.Mempelajari bahasa asing itu perlu kita lakukan, agar kita juga bisa berkomunikasi dengan dunia luar, namun poin pentingnya, walaupun penguasaan bahasa asing ini penting, tapi sebagai putra daerah kita juga tidak boleh meninggalkan bahasa ataupun identitas daerah kita, hanya karena kita beralih tempat  tinggal diperkotaa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arjunmujay",
      "created_time": "November 28, 2023, 09:01:39 PM",
      "body": "Quote from: GAM ACHEH on November 26, 2023, 02:07:46 PM~Snip~Apa solusi terbaik untuk mencegah kepunahan bahasa daerah?  simpelnya gini gan, kebutuhan bahasa sekarang ini untuk lokal indonesia sendiri pasti memakai bahasa pemersatu bangsa. meskipun banyak sekali bahasa daerah seperti yang agan sebutkan, sudah pasti setiap orang akan lebih mempelajari bahasa indonesia untuk saling berkomunikasi antar daerah.untuk tingkatan lebih tinggi lagi, bahasa internasional yang dipakai berkomunikasi adalah bahasa inggris. sama kasusnya dengan bahasa pemersatu bangsa sudah pasti lebih dipelajari lagi untuk bisa berkomunikasi dengan orang luar. contohnya saja forum ini, meskipun pakai bantuan translator, itu sudah membuat kita belajar bahasa internasional.lalu kapan menggunakan bahasa daerah?kalau anda lihat orang tua yang punya anak atau anda sendiri memiliki anak, bahasa apa yang dipakai? kebanyakan ya pasti bahasa indonesia dengan maksud dan tujuan, anak kita dapat berkomunikasi dengan seluruh orang nusantara.melihat permasalahan diatas, bagi saya hal yang utama adalah tetap menggunakan bahasa daerah di lingkup keluarga. terutama pada anak, agar ada generasi penerus dan bahasa daerah masing-masing tidak punah.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dediadi",
      "created_time": "November 29, 2023, 04:34:16 PM",
      "body": "Quote from: mu_enrico on November 26, 2023, 05:36:50 PMQuote from: GAM ACHEH on November 26, 2023, 02:07:46 PMMengapa bahasa daerah bisa punah?Ga ada insentif untuk menggunakan bahasa daerah. Orang lebih suka belajar Bahasa Inggris -> terbuka lapangan pekerjaan di berbagai bidang, banyak konten menarik di Internet, dsb.Ujung-ujungnya cuan dan kenikmatan.Quote from: GAM ACHEH on November 26, 2023, 02:07:46 PMApa solusi terbaik untuk mencegah kepunahan bahasa daerah?  Apa untungnya mencegah kepunahan bahasa daerah?Kalau tidak ada cuan dan kenikmatan maka orang akan malas mengupayakan. Sehingga agar tidak punah harus ada insentif di situ.Ane kasih satu contoh kenapa banyak orang luar Jawa yang bisa (at least tau dikit) Bahasa Jawa? Salah satunya karena dulu ada Ketoprak Humor. Shownya bagus -> mata dan telinga pada ke situ.anak-anak sekarang suka bahasa indonesia dan bahasa asing bahkan ini manrik, karna indonesia salah penduduk terbesar di dunia, sehingga ada bahasa daerah kritis atau hampir punah. juga dipengaruhi oleh letak geografis sama jumlah penduduk yang sedikit.hal ini disebabkan oleh orang tuannya tidak mewariskan bahasa daerahnya kepada anak-anak mereka, jika kita lihat disebabkan faktor perkawinan antar suku sehingga saat dikaruniakan anak mereka mengajarkan bahasa indonesia kepada anak mereka, dipengaruhi juga oleh tempat dia sekolah atau lingkungan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Furious 7",
      "created_time": "November 29, 2023, 07:40:23 PM",
      "body": "Ini tidak serta merta kembali kepada kaum muda sebenarnya karena pada akhirnya peran orang tua juga penting tetapi memang untuk daerah yang saya tinggali sekarang meskipun pada akhirnya bahasa Indonesia juga banyak yang memakai karena ini adalah kepastian mengingat Bahasa Indonesia adalah bahasa persatuan tetapi disisi lain untuk Bahasa daerah juga tidak di tinggalkan karena sehari-hari saya masih menggunakan bahasa daerah dan bukan hanya saya tetapi mayoritas warga juga sama tergantung situasi dan kondisi. Hal ini membuktikan bahwa selain dari peran orang tua yang harus mengajarkan bahasa daerah hal ini juga harus dilihat dari faktor wilayah karena tidak saya rasa ini masih menjadi salah satu patokan yang bisa digunakan.Memang saat ini bahasa daerah terkadang terasingkan di beberapa daerah tetapi pada akhirnya kita juga tidak bisa melakukan apapun karena bahkan kita tahu bahwa terkadang bahasa indonesia atau mungkin sekarang bahasa inggris lebih bisa untuk mendatangkan keuntungan pada akhirnya. Bukan berarti saya senang dengan menipisnya bahasa tetapi ketika kita bersikap realistis keseimbangan antara bahasa yang digunakan juga penting untuk menunjang kehidupan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dickiy",
      "created_time": "November 29, 2023, 10:12:46 PM",
      "body": "Quote from: MiauKitchen on November 28, 2023, 02:53:04 AMMasalahnya untuk masalh ini banyak paktor sih,mulai dari paktor lingkungan,paktor pergaulan juga dan mungkin di sini peran orang tua juga penting, sepengetahuan saya untuk saat ini banyak peran orang tua yang mengganti bahasa daerah menjadi bahasa Indonesia, sehingga ketika anak bertumbuh yang mereka tau bahasa Indonesia,karena bahasa daerah nya tidak dipake,(dalam bahasa sehari-hari nya).Nah itu benar gan, saya pikir memang cukup banyak faktor yang bisa menjadi penyebab mengapa kaum muda lebih banyak berinteraksi atau menggunakan bahasa indonesia untuk mengobrol atau menyapa orang lain, dan dari beberapa faktor yang lebih memungkinkan yaitu dari segi lingkungan mereka termasuk dari pengaruh kedua orang tua mereka juga. Seperti yang agan bilang dan memang sesuai dengan fakta, di zaman modern ini lebih banyak orang tua yang mengajarkan anak - anaknya untuk berbahasa indonesia dari sejak kecil, jujur saya kurang tahu apa yang menjadi alasan utamanya tetapi mungkin para orang tua mengikuti perkembangan zaman yang sudah semakin modern ini. Maka tidak aneh dan jelas ketika anak itu tumbuh dewasa mereka lebih banyak menggunakan bahasa indonesia di banding bahasa daerahnya sendiri.Dan juga faktor lainnya yang menurut saya cukup berpengaruh yaitu dari faktor lingkungan, contohnya seperti kalau kita kerja di perantauan biasanya kita akan lebih sering menggunakan bahasa indonesia untuk bersosialisasi dengan orang lain, jadi intinya menurut saya menggunakan bahasa yang berbeda dan bukan bahasa asli dari daerah kita itu bukan sepenuhnya kesengajaan tetapi disisi lain ada beberapa hal lain seperti keadaan yang memaksa kita untuk menggunakan bahasa persatuan negara untuk menyesuaikan dengan keadaan, saya pikir ini alasan yang masuk akal sih.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GoldMagic",
      "created_time": "November 30, 2023, 04:17:32 AM",
      "body": "Quote from: Dewiana on November 28, 2023, 09:24:10 AMPola pikir moderen masyarakat saat ini sudah berubah akibat pengaruh digitalisasi, dan interaksi dengan masyarakat luar juga sudah aktif cepat. faktor urbanisasi besar-besar juga penyebabnya. sehingga dengan urbanisasi sudah berkumpul bermacam etnis dan suku sehingga ditempat tersbutlah mau tidak mau terpaksa mengunakan bahasa indonesia sebagai pemersatu, anak-anak juga di kota-kota juga sudah diasah bahasa indonesiaIya benar,karena kita sudah ada di era moderen,bukan tidak menghargai bahasa daerah,tapi misal orang kampung yang tinggal dikampung yang mayoritas menggunakan bahasa daerahnya,ketika si orang kampung ini pindah kekota udah pasti dari segi kehidupan pun berubah dan dari cara bicara pun berubah yang misal berbahasa Sunda otomatis pindah jadi Indonesia karena menyesuaikan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "November 30, 2023, 10:43:04 AM",
      "body": "Saya pikir kebanyakan anak muda bukan enggan berbahasa daerah, namun lebih kepada lingkungan yang memaksa mereka untuk tidak menggunakan bahasa daerahnya, contohnya orang-orang muda di yogya kebanyakan menggunakan bahasa jawa karena di lingkungan mereka kebanyakan orang menggunakan bahasa jawa, sedangkan di jakarta karena kebanyakan orang menggunakan bahasa indonesia makanya kebanyakan orang muda lebih memilih menggunakan bahasa indonesia dibandingkan dengan bahasa daerahnya. Apalagi kebanyakan orang tua jaman sekarang ini enggan untuk mengajarkan bahasa daerah kepada anak-anak mereka dan ditambah dengan budaya modernisasi yang semakin tinggi itu membuat banyak anak mudah menjadi lupa akan bahasa daerah mereka. Solusi terbaik untuk hal ini ya orang tua membiasakan berbahasa daerah kepada anak-anak mereka sejak bayi, karena bahasa itu soal kebiasaan jadi semakin sering anak berkomunikasi dengan bahasa daerah dengan orang tua mereka maka akan semakin paham mereka terhadap bahasa daerah mereka sendiri.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}