{
  "id": "topic_5528141",
  "title": "robertcarlyle",
  "author": "robertcarlyle",
  "created_time": "January 29, 2025, 07:35:40 PM",
  "content": "Would it be realistic for someone to have like 150 billion usd worth of bitcoin if they bought 1000 usd of it in late 2009 when 1 usd was worth like 1500 btc? If they kept it all these years until now, would this be feasibly realistic or exaggeration?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5528141",
  "comments": [
    {
      "author": "Dunamisx",
      "created_time": "January 29, 2025, 07:50:15 PM",
      "body": "It could be a reality experience if they have the bitcoin in possession since 2009 to date, its not a magic by any means, but how many people can we find holding right from that time till now without selling and buying taking place repeatedly, except for Satoshi and Hal Finney Bitcoin, while some will also be making their own history in some more years to come after buying and holding for a longer period.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "January 29, 2025, 07:57:48 PM",
      "body": "Quote from: robertcarlyle on January 29, 2025, 07:35:40 PMWould it be realistic for someone to have like 150 billion usd worth of bitcoin if they bought 1000 usd of it in late 2009 when 1 usd was worth like 1500 btc? Close to impossible if we use 2009.There were 7200 mined per day, assuming no satoshi it would still be the supply of 207 days, adding those coins adding coins that would be lost not sold the guy would still have to go into early 2010 to accumulate that when the price was already higher, not to mention he first jump to over 1 cnet for btc in June.So, highly unrealistic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batang_bitcoin",
      "created_time": "January 29, 2025, 08:04:13 PM",
      "body": "Quote from: robertcarlyle on January 29, 2025, 07:35:40 PMWould it be realistic for someone to have like 150 billion usd worth of bitcoin if they bought 1000 usd of it in late 2009 when 1 usd was worth like 1500 btc? If they kept it all these years until now, would this be feasibly realistic or exaggeration?Realistic and possible but think of the other circumstances as well. If you're on that someone's shoe and have seen the ATHs, for sure you've sold at comfortable prices that you think you've won over in the internet with something that people don't know yet on the early days. But 2009, that's too early. Moreover, in 2010 there have been purchases that did happened so if it's with the timeline, we can disregard that. But with the amount, it's possible that whoever is in that situation will sell a little by little every ATH that's been met.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "I_Anime",
      "created_time": "January 29, 2025, 08:29:11 PM",
      "body": "Quote from: robertcarlyle on January 29, 2025, 07:35:40 PMWould it be realistic for someone to have like 150 billion usd worth of bitcoin if they bought 1000 usd of it in late 2009 when 1 usd was worth like 1500 btc? If they kept it all these years until now, would this be feasibly realistic or exaggeration?It is possible, it all boils down to how long that particular investor was able to hold. Because their are folks who had nice amount of bitcoin but they sold it early due to some ATHs bitcoin undergo then before getting to where it is now. So alot folks emotions where put Into test and they fell for it by selling early, but there are chances, that some folks at there have hold their bitcoin for long till date , and they are some in this forum especially those in the WO thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robertcarlyle",
      "created_time": "January 29, 2025, 08:44:31 PM",
      "body": "But if someone bought 1000 usd of bitcoin new liberty standard december of 2009 when it was 1500 bitcoins for 1 usd, wouldnt that mean they would hace like roughly 1.5 million bitcoins as of right now and wouldnt that mean 105 billion usd?  Im confused here...?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batang_bitcoin",
      "created_time": "January 29, 2025, 09:43:57 PM",
      "body": "Quote from: robertcarlyle on January 29, 2025, 08:44:31 PMBut if someone bought 1000 usd of bitcoin new liberty standard december of 2009 when it was 1500 bitcoins for 1 usd, wouldnt that mean they would hace like roughly 1.5 million bitcoins as of right now and wouldnt that mean 105 billion usd?  Im confused here...?Don't get confused. No one buys Bitcoin at that year and when Bitcoin was in its infancy. Having that amount of Bitcoins is in likely possession of satoshi leaving that much. But in estimation says, that's only around 750,000 to 1,100,000 BTCs that we'll never know if it will move somewhere in the future but most likely it won't.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 29, 2025, 09:46:04 PMLast edit: January 29, 2025, 09:59:01 PM by franky1",
      "body": "Quote from: robertcarlyle on January 29, 2025, 07:35:40 PMWould it be realistic for someone to have like 150 billion usd worth of bitcoin if they bought 1000 usd of it in late 2009 when 1 usd was worth like 1500 btc? If they kept it all these years until now, would this be feasibly realistic or exaggeration?you had the numbers months ago(asked and answered) you could have done the math yourselfbut to answer todays question $1000 in 2010 is worth $3.4bill today due to bitcoin hoarding for 15 years. so no its not feasible because the open exchange market started at $1=33btc..only a lucky guy (laszlo(bitcoin pizza guy) got to have $1=333btc rate and no one got $1=1500btc rate (because people didnt purchase bitcoin 2009, people instead just got free btc from faucets)math:first purchase price of bitcoin was 10,000 for $30 (AKA 2 pizza) =$0.003/btcfirst exchange market price was $0.03$1000 to buy bitcoin at first exchange market price = 33,333btc, which today ($104k/btc) 33,333= $3,466,632,000...also to note 'robertcarlyle' you have already been asking these early day questions recently, why keep asking the same questionsQuote from: robertcarlyle on October 09, 2024, 06:48:12 PMIf someone in the u.s. bought 1000 usd worth of bitcoin on february 19, 2009, how much would that be worth today??",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robertcarlyle",
      "created_time": "January 29, 2025, 09:56:18 PM",
      "body": "So realistically it just wouldnt have happened by any means then?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 29, 2025, 10:06:32 PM",
      "body": "Quote from: robertcarlyle on January 29, 2025, 09:56:18 PMSo realistically it just wouldnt have happened by any means then?your your OP topic question was asking a question which in its parts has many meanings which can change the answerEG if you mean did real early adopters(many people) buy bitcoin a $1=1500btc.. the answer is noEG if you mean could a very lucky singular guy have gone back in time and took an opportunity to use new liberty standards offer.. well if time machines were realthe more feasible and realistic answer of proper opportunity of early adopters was the 2010 exchange rate of $1=33btc as the first reasonable, realistic, feasible opportunity to get coin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robertcarlyle",
      "created_time": "January 29, 2025, 11:12:19 PM",
      "body": "Look at this, https://postimg.cc/r0nBmpwtSo, what you guys are saying is that 1500 bitcoins for 1 usd isnt a literal amount then?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "January 29, 2025, 11:53:10 PM",
      "body": "Quote from: robertcarlyle on January 29, 2025, 07:35:40 PMWould it be realistic for someone to have like 150 billion usd worth of bitcoin if they bought 1000 usd of it in late 2009 when 1 usd was worth like 1500 btc? If they kept it all these years until now, would this be feasibly realistic or exaggeration?You already said it’s an exaggerated fact but, you’re not going to find people have that much in Bitcoin through those years till now. That’s not happening, that amount is way too high for a view point.Something I don’t understand though;How does such question stands to benefit you the OP or anyone else on the forum? I really mean to understand what joy or motivation could be derived from having to answer these because, I don’t get it at this end.The past is the past, let’s go forward.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 30, 2025, 12:10:51 AM",
      "body": "Quote from: robertcarlyle on January 29, 2025, 11:12:19 PMLook at this, https://postimg.cc/r0nBmpwtSo, what you guys are saying is that 1500 bitcoins for 1 usd isnt a literal amount then?do you know there are people on ebay today that advertise a standard british 50p coin for £250 ... and no one is buying it.. advertising a price is not the same as opportunity and evidence of people taking up the offerif you look at bitcoins (realistic) history you will see the notable events of:satoshi giving hal 10btc for free in jan 2009laszlo got 2 pizza for 10,000btc in 2010the first proper bitcoin exchange opened at a starting rate of $0.03/btc(with people buying at this rate)so if you are asking about a group of early adopters that realistically bought at, and took up an opportunity to buy coin at its cheapest openly available rate of the best opportunity, of a accessible exchange thats was used, then the numbers are that today they would be sitting on $3.4billionyour other numbers are not realistic opportunity of feasibility to have had early adopters take up the offer and hoardyour own words realistic",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robertcarlyle",
      "created_time": "January 30, 2025, 12:31:44 AM",
      "body": "But is 3.4 billion usd even realistic?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 30, 2025, 07:35:47 AMLast edit: January 30, 2025, 09:28:18 AM by franky1",
      "body": "Quote from: robertcarlyle on January 30, 2025, 12:31:44 AMBut is 3.4 billion usd even realistic?well there were people buying in 2010 (unlike your assumptions of 2009)there are logs on the blockchain of coin(not creator satoshi's stash) still held from 2010however most early adopters were selling in each ATH of 2013,2017, 2021.. so the amount of early adopters still holding and still have keys to sell bitcoin now, is a small amount. but far more odds of realistic feasibility compared to your 2009 assumptions of buyersalso to remind you the screenshot of the new liberty standard(you referenced before) was not showing an exchange rate based on sells already performed. it was actually a price valuation advert, based on calculating mining cost of most efficient CPU and calculating electric costs.. and then advertising his willingness to buy coin at that rate for his $100 desire limit of paypalbut from all history and people researching and looking at the past it doesnt appear anyone really took the offer and it was exchanges and bitcoin pizza in 2010 as the first real deals of realistic trades",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Judith87403",
      "created_time": "January 30, 2025, 09:12:46 AM",
      "body": "Quote from: I_Anime on January 29, 2025, 08:29:11 PMQuote from: robertcarlyle on January 29, 2025, 07:35:40 PMWould it be realistic for someone to have like 150 billion usd worth of bitcoin if they bought 1000 usd of it in late 2009 when 1 usd was worth like 1500 btc? If they kept it all these years until now, would this be feasibly realistic or exaggeration?It is possible, it all boils down to how long that particular investor was able to hold. Because their are folks who had nice amount of bitcoin but they sold it early due to some ATHs bitcoin undergo then before getting to where it is now. So alot folks emotions where put Into test and they fell for it by selling early, but there are chances, that some folks at there have hold their bitcoin for long till date , and they are some in this forum especially those in the WO thread. Those who sold their bitcoin due to some ATH bitcoin undergo back then probably it might be that it has gotten to their target so they decide to sell and use the profit to do whatever thing they Wish to do with it, of course is all about choice just as most people have decided to invest in bitcoin for short term. as long as they're making the right decision for themselves is fine probably trying to make things easier for themselves.Though most of those early investors who buy bitcoin in 2009 I think most of them was patient enough to hold on to it till 2017 why most early adopter sell their bitcoin earlier before then. Talking about leaving thier bitcoin untouched till this time without selling I don't think if that will be possible just imagine holding bitcoin for a decade without being tempted to sell, I still doubt it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bSpend",
      "created_time": "January 30, 2025, 09:26:00 AM",
      "body": "Quote from: robertcarlyle on January 29, 2025, 07:35:40 PMWould it be realistic for someone to have like 150 billion usd worth of bitcoin if they bought 1000 usd of it in late 2009 when 1 usd was worth like 1500 btc? If they kept it all these years until now, would this be feasibly realistic or exaggeration?It's not exaggerating because this is practically very possible to happen, though the chances of it happening is very low.It will be extremely difficult to find someone who will buy $1000 worth of bitcoin in 2009 and still keep all of it till today without having sold any part of it.The only way this can easily happen is - 1. when and if after buying the coins, the investor somehow forgets he or she ever bought bitcoin until this very moment - still have very low chances of happening.2. When and if after buying the coins, the investor loses access to their wallet by (maybe) misplacing their wallet's private key or seed phrase - high chances of this happening, infact, we have seen or heard stories of people who bought or mined alot of bitcoins in its early days, who today can't access the wallet where those bitcoins are stored.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 30, 2025, 09:32:15 AMLast edit: January 30, 2025, 09:47:59 AM by franky1",
      "body": "Quote from: bSpend on January 30, 2025, 09:26:00 AMIt's not exaggerating because this is practically very possible to happen, though the chances of it happening is very low.It will be extremely difficult to find someone who will buy $1000 worth of bitcoin in 2009 and still keep all of it till today without having sold any part of it.no one was really buying in 2009but yes in 2009 bitcoin was so new and people could solo mine with there cpu, and there was no real market/utility(apart from bug testing/experimenting) back then so no one would want to spend $1k on it in 2009, nor $100 nor $10.no one had the investment mindset in 2009, it was more code testing mindsetit wasnt until events like bitcoin pizza, alpaca socks, bitcoin cupcakes, silkroad, before people started viewing bitcoin as a currency and thus a investment asset. so 2009 it was a bug-tester coin and in 2010 it started as a currency/investment",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MamBp9",
      "created_time": "January 30, 2025, 10:28:04 AM",
      "body": "Quote from: batang_bitcoin link=topic=5528141.msg65006133#msg65006133 date=173818703Don't get confused. No one buys Bitcoin at that year and when Bitcoin was in its infancy. [/quoteWhen bitcoin was in its infancy no one knew about bitcoin and no one collected bitcoin because no noe knew what the future of bitcoin would be. At present, bitcoin is being used as a smart currency of the world which is creating a stir in the world. Bitcoin users say that the price of bitcoin may go above 1,50,000 dollar this year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LorresMayer",
      "created_time": "January 30, 2025, 01:12:48 PM",
      "body": "I remember stories about paying for a pizza for 100 or even 1000 btc back in the daywhat I time to be alive to invest it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}