{
  "id": "topic_5426722",
  "title": "jamie111",
  "author": "jamie111",
  "created_time": "December 08, 2022, 03:46:20 AM",
  "content": "Cainos Telegram: absdoalmy is a scammer - scammed for for only $5 on Azure Deal",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5426722",
  "comments": [
    {
      "author": "SFR10",
      "created_time": "December 10, 2022, 09:11:44 PM",
      "body": "Quote from: jamie111 on December 08, 2022, 03:46:20 AMCainos Telegram: absdoalmy is a scammer - scammed for for only $5 on Azure DealNo matter how many times you post this set of words in different threads, it's not going to add any weight to your post unless there's a piece of evidence to back it up!- Use the \"Scam Report Format\" to update/edit your post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "December 10, 2022, 10:39:47 PM",
      "body": "Quote from: jamie111 on December 08, 2022, 03:46:20 AMCainos Telegram: absdoalmy is a scammer - scammed for for only $5 on Azure DealTelegram usernames come and go especially in countries that use prepaid sim numbers we all know usernames can be changed in Telegram  and it will not hold weight here if you do not attach the Bitcointalk username so we can tag the guy, you also need to attach the transaction hash and screenshots of your conversation with the guy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "December 10, 2022, 10:45:58 PM",
      "body": "Quote from: jamie111 on December 08, 2022, 03:46:20 AMCainos Telegram: absdoalmy is a scammer - scammed for for only $5 on Azure DealDo yourself and us a favor and show us more the guy who scammed you will just change his username and he will be his next victim this is the right format to follow, if he does not have an account here and you just found him in the telegram it's a big lesson not to trust sellers on Telegram even if the deal is only worth $1.Code:[b][color=black]What happened:: [/color][/b][b][color=black]Scammers Profile Link: [/color][/b][b][color=black]Reference Link: [/color][/b][b][color=black]Amount Scammed: [/color][/b][b][color=black]Payment Method: [/color][/b][b][color=black]Proof of Payment: [/color][/b][b][color=black]PM/Chat Logs: [/color][/b][b][color=black]Additional Notes: [/color][/b]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Awaklara",
      "created_time": "December 11, 2022, 05:02:43 AM",
      "body": "I saw the post you made. you are just complaining about scammers from your first post from the beginning of the month.why don't you follow the format and also the concrete evidence?in your way like this, no one will empathize with your loss or case.no need to create a continuous thread without any changes. read suggestions from others. instead of making threads, you keep leaving. it becomes useless.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "December 11, 2022, 08:12:14 PM",
      "body": "Quote from: jamie111 on December 08, 2022, 03:46:20 AMCainos Telegram: absdoalmy is a scammer - scammed for for only $5 on Azure DealYou must commit to writing the format of the scam report and put proof that incriminates the other person, such as a link or hash of the transaction, screenshots, and the member’s link on the BTT forum, as the person you accuse after reading your topic can change his telegram username at any moment and it is easy not to reach him again, it was your mistake that you trusted him without guaranteeing your rights, I advise you to always deal through Escrow or a third party platform between you, it's okay, five dollars is not a big amount, but you should learn from your mistake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "December 11, 2022, 09:23:31 PM",
      "body": "Very poor scam reporting format by OP and all the users are left to try and guess who it isOP is it this CainosSeems to be using @absdoalmy as his telegramQuote from: Cainos on November 28, 2022, 07:02:47 AMPrices list in telegramMy telegram : @absdoalmy You are always advised to use escrow service when dealing with strangers on the web. I guess it's a lesson to learn",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Getmon",
      "created_time": "December 12, 2022, 02:00:05 PM",
      "body": "Bud, your report is incomplete. You should edit it and adhere to the suggested formats. Despite this, the account appears to be a newbie and creating a new one is easy. In Telegram, you can also change usernames indefinitely without problems.This is getting normal here in Bitcointalk, scammed by newbie accounts in the marketplace. Why do people trust a two week old account that has only posted twice? Generally, if you don't use reputable escrow services, you do not do business online.Recommended bitcointalk escrow services.A question that is a little off-topic. Why can't people who don't have Bitcointalk accounts see both positive and negative trusts?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}