{
  "id": "topic_5456574",
  "title": "Jet Cash",
  "author": "Jet Cash",
  "created_time": "June 16, 2023, 03:02:06 PM",
  "content": "I'm having trouble with deciding how to quote prices in Bitcoin. It's OK for domains, as I'm currently negotiating one sale for BTC 0.2. However, I want to start selling classic car parts, and I'm setting up a shopping site. So how do I quote a price for an itedm which is ( say ) £10. The current Bitcoin price would be 0.0005032273226268366 and Satoshi would be 50560.637930455334 ( prices taken from Coinbase, and may indicate price movement whilst I am posting ). Obviously I can round the amounts, and I would quote 50560 Satoshi, but that could frighten a buyer. The Bitcoin price of 0.0005 looks more manageable, but will probably confuse the buyer. Another alternative would be to quote the price in Sterling, and include a link to a conversion site such as coinbase or XE. Do any of you guys list low cost items in Bitcoin?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456574",
  "comments": [
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "June 16, 2023, 03:20:50 PM",
      "body": "Actually, both conversions into fiat are easy for every old Bitcoiner to know how to do, but in consideration of a new Bitcoiner who is not yet accustomed to the system, quoting in Bitcoin would be more familiar and can be a very easy thing to do. For me, I quote my price in Bitcoin, and for someone who doesn't know what the value would be in fiat, I would just ask them to multiply the price quote in Bitcoin by the current price of Bitcoin. Let's say someone wants to buy one piece of my future, which I decided to sell for 0.0012 BTC. I would just ask them to multiply BTC0.012 x $25600 = $307, which will give them the price in fiat. The reason why I quote in Bitcoin is also because most people don't know that Satoshi is also referred to as the smallest denomination of Bitcoin; they only thought that Satoshi is mostly referred only as the author of Bitcoin.Some customers might even ask a dumb question like, \"Why do you write 500,000 Satoshi? I thought Satoshi was the father of Bitcoin?\" (just saying). Most of my customers do ask some dumb questions, but I can't blame them because they don't know, and that's why they would ask.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "June 16, 2023, 03:22:14 PM",
      "body": "Using Satoshi unit is a pain in the ass for buyers because it usually shows large figure while most people preferred lower digit when buying things for easy understanding on price. BTC and mbtc is the best unit if you want to use on selling items online because it’s the most common units used by crypto services like exchange and gambling sites.I’ve done purchasing couple of items on a merchant that use by forum users here on marketplace. Using BTC will make it easy for buyers to understand the price instantly or do the conversion feature in fiat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "June 16, 2023, 03:23:38 PM",
      "body": "Good luck on your investment I believe it is going to be a very productive one, also I would not like to get you wrong. And I believe what you meant is that you are trying to place your price at £10 but you want to place it in Bitcoin.If that's the case then it's a bit complicated and still very simple in my own opinion, it's complicated in the sense that the Bitcoin price is very volatile and unstable. I believe you can place your price tag as £10 in the current value of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "June 16, 2023, 03:27:35 PM",
      "body": "@bitmover is one of the members who could help you with this since he has already created some useful tools that you can check out on his website -> https://bitcoindata.science/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "June 16, 2023, 03:33:11 PM",
      "body": "You can use three main units for Bitcoin: Bitcoin, satoshi and milibitcoin (mBTC). I believe these three units are enough for you to use from big to small values of your items because with these units, we will have two extremes (biggest, smallest units and one unit in the middle).1 mili-bitcoin = 0.001 BTC and this unit is a good unit in between bitcoin and satoshi units.[Did you know?] Bitcoin Table of Units",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "June 16, 2023, 03:33:48 PM",
      "body": "Using BTC or mBTC is better than using sat. Quote from: Jet Cash on June 16, 2023, 03:02:06 PMAnother alternative would be to quote the price in Sterling, and include a link to a conversion site such as coinbase or XE. Do any of you guys list low cost items in Bitcoin?This is a very good idea, estimating the price in Sterling and if the person wants to pay in bitcoin, he can click on the item to see the price in both BTC and Sterling.Quote from: Jet Cash on June 16, 2023, 03:02:06 PMDo any of you guys list low cost items in Bitcoin?You have the option to pay in Sterling, that should not be a problem because using bitcoin is just an alternative. You can also include lightning network payment if you can do that, this will encourage paying low price products in bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jet Cash",
      "created_time": "June 16, 2023, 04:00:32 PM",
      "body": "Thanks _act_ I forgot about lightning It makes sense to offer that for lower value items.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "June 16, 2023, 04:53:07 PMLast edit: June 16, 2023, 05:04:58 PM by bitmover",
      "body": "Quote from: Jet Cash on June 16, 2023, 03:02:06 PMI'm having trouble with deciding how to quote prices in Bitcoin. It's OK for domains, as I'm currently negotiating one sale for BTC 0.2. However, I want to start selling classic car parts, and I'm setting up a shopping site. So how do I quote a price for an itedm which is ( say ) £10. The current Bitcoin price would be 0.0005032273226268366 and Satoshi would be 50560.637930455334 ( prices taken from Coinbase, and may indicate price movement whilst I am posting ). Obviously I can round the amounts, and I would quote 50560 Satoshi, but that could frighten a buyer. The Bitcoin price of 0.0005 looks more manageable, but will probably confuse the buyer. Another alternative would be to quote the price in Sterling, and include a link to a conversion site such as coinbase or XE. Do any of you guys list low cost items in Bitcoin?You can use my API. I just added the endpoint which does exactly as you said.10 GBP = Code:https://bitcoindata.science/api/fiattobtc.php?fiatamount=10&currency=GBPDocs here. There are a few other options which might be useful for you:https://bitcoindata.science/bitcointalk-api.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "June 16, 2023, 05:09:03 PM",
      "body": "Quote from: Jet Cash on June 16, 2023, 03:02:06 PMI'm having trouble with deciding how to quote prices in Bitcoin. It's OK for domains, as I'm currently negotiating one sale for BTC 0.2. However, I want to start selling classic car parts, and I'm setting up a shopping site. So how do I quote a price for an itedm which is ( say ) £10. The current Bitcoin price would be 0.0005032273226268366 and Satoshi would be 50560.637930455334 ( prices taken from Coinbase, and may indicate price movement whilst I am posting ). Obviously I can round the amounts, and I would quote 50560 Satoshi, but that could frighten a buyer. The Bitcoin price of 0.0005 looks more manageable, but will probably confuse the buyer. Another alternative would be to quote the price in Sterling, and include a link to a conversion site such as coinbase or XE. Do any of you guys list low cost items in Bitcoin?If you create a trading site yourself, then you should not have any problems in which currency to indicate the price. Why choose between the two when you can combine them? I would prefer that next to classic auto parts I could see the price in $ (the choice depends on the market you are targeting. If internal, then £, if external, then $ is preferable) and BTC (bitcoin is more rumored than satoshi and looks not so repulsive to the buyer) at the same time. This will allow covering 2 categories of buyers at once: both beginners and old bitcoiners. If the technical possibilities for implementation allow, then the option when the price is indicated in $, the price is converted into BTC at the same time and displayed next to it, looks more interesting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "June 16, 2023, 08:23:02 PM",
      "body": "2015 adopter here & I still can’t get my head around denominating in sats. I much prefer to just say 0.3BTC for example rather than 30,000,000 satoshi. I know as time goes on & bitcoin becomes worth more & more (relative to fiat) that people will increasingly use satoshis rather than 0.3BTC for example but I don’t like it.I suppose I will have to move with the times but for now I will stick to what I use.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "June 17, 2023, 04:52:24 AM",
      "body": "Why choose between one or the other? Why not use both?We still live in a fiat dominated world and goods are priced in fiat. So your website should show the prices in terms of fiat (which is more stable too) and then include the conversion to bitcoin on the side. In addition you can provide the option to switch to a different representation of the value in bitcoin, satoshi, mili/micro satoshi, etc. So the customer can see the prices in what they feel more comfortable with because no matter what option you choose, some people will like it and some won't so it is better to have more options.The choice could also be stored in their account (assuming they make an account to purchase) or in a browser cookie if they don't so that it could be reapplied in future visits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 17, 2023, 08:01:38 AM",
      "body": "totally forgot about bitmovers api £10=had to put 'img' tabs and also sub it to make it look right on forum. but still useful. only issue is that when it gets added to shopping basket the total would need to be locked for ~an hour to honour the purchase at the seen price or that would annoy customers to see the price change every X minutes. where jetcash would have to take a hit on any variance during that timebut seeing as a full btc is $20,400-$20,800 today with a range (2%) most days.. equates to a £10.20p -£10.40p variance. its only % difference he has to manage profits or losses from..  so could just charge £12 to cover variance and also tx fee to ensure he receives £10 of valueat this momentmost btc wallets still measure in BTC not sat.. and so confusing a customer with sat whilst their wallet shows BTC is not helpful.. untill most wallets default to sat its best to stick with btc measures. just to not confuse customers whom may accidently not put the right number of decimals in when trying to convert from sat to btc if they see sat prices on websitesEG end up trying to pay 50000btc thinking a sat or btc are the same thing",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jet Cash",
      "created_time": "June 17, 2023, 08:35:08 AM",
      "body": "I've made some progress on this. I've installed Cube Cart on an experimental domain, and I can list in Sterling or Bitcoin. It does the conversion for me based on a value that I've loaded via the admin panel. This is not so good given the volatility of Bitcoin. I think the answer is to quote in Bitcoin as the default, and state that Sterling prices are just a guide, and contact me for the current Sterling price. As the main purpose of the site is to generate traffic, the price may not be as important for me as it would be for a normal shop. I don't really care if I don't make any sales.I haven't  worked out how to install the Bitcoin symbol yet as the ISO 4217 currency code is XBT, and most Bitcoiners use BTC. BTC can't be used because it starts with BT which is the code for Bhutan ( which doesn't use BTC ). I gather the Bitcoin Foundation is trying to remedy this. I'll also need to include an explanation of Bitcoin, and thus I will need to develop my Bitcoin Uncovered site thatg I've been talking about for years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "June 17, 2023, 08:52:17 AM",
      "body": "I am more used to the usage of decimals/Bitcoin than using the satoshi term in pricing. But whatever you're used to and just always quote the other one so you get to show both prices in both terms and pricing. And running that experiment on that domain, you'll see on how the traffic is reacting to the prices and how they will address it to you. I think you can take time until a month or two and see how demand goes and what they're addressing and which is more usable for your visitors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "June 17, 2023, 09:31:28 AM",
      "body": "I guess the option I always go for is using \"mBTC\". I used to think it wouldn't make sense but apparently sites are good enough (or Google) to easily translate for people what mBTC means. Bitcoin's been at a nice enough value for the past 4/5 years that 1 mbtc plus some decimals seem to be adequate.I know people aren't fans of mBTC (and I wasn't initially)...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "June 17, 2023, 10:45:37 AM",
      "body": "Quote from: Jet Cash on June 16, 2023, 03:02:06 PMThe current Bitcoin price would be 0.0005032273226268366 and Satoshi would be 50560.637930455334What's the point of so many decimals?QuoteI would quote 50560 Satoshi, but that could frighten a buyer. The Bitcoin price of 0.0005 looks more manageable, but will probably confuse the buyer.If this confuses the buyer, they probably shouldn't be using Bitcoin My personal preference: 0.5056 mBTC. I've liked this ever since I started with Bitcoin (1mBTC was about $0.20 at the time), and for years it's Electrum's default. It's the closest value to a dollar/euro/pound, and in most cases prevents having to count zeros.QuoteAnother alternative would be to quote the price in Sterling, and include a link to a conversion site such as coinbase or XE. Do any of you guys list low cost items in Bitcoin?That's what most websites do, but for those websites, Bitcoin is just one of many payment options. If you only accept Bitcoin, you could just as well show the Bitcoin price.Quote from: buwaytress on June 17, 2023, 09:31:28 AMI know people aren't fans of mBTCIs that an American thing?  Here, SI-units are pretty much standard for anything (mg, ml, mm, mmol, mBTC).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jet Cash",
      "created_time": "June 17, 2023, 02:27:24 PM",
      "body": "I can't really use mBTC because these carts seem to want you to use ISO codes, and Bitcoin is confusing enough for the uninitiated. I've got the cart switching quite freely now that I've got the conversion rate round the correct way. I had one item listed for XBT 34,950 which would be great if somebody would pay that. Unfortunately it isn't a box of pizzas. Things look really cheap when you see the price is 0.00034950.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "June 17, 2023, 03:02:37 PM",
      "body": "Quote from: Jet Cash on June 17, 2023, 02:27:24 PMI had one item listed for XBT 34,950 which would be great if somebody would pay that. Things look really cheap when you see the price is 0.00034950.If you can display price in two units like fiat currency value and in any of Bitcoin value (BTC, mBTC, satoshi), it will help the buyers a lot.Like you want to sell an item at $50 in fiat currency, you can add an equivalent amount in either BTC, mBTC or satoshi. It depends on technical settings at the site to display it and it is your barrier and restrict your choices.You can set up that item price in one fixed unit such as its will be always at $50 and the equivalent BTC, mBTC, satoshi will be changed and updated with Bitcoin price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "June 17, 2023, 06:35:14 PM",
      "body": "Quote from: LoyceV on June 17, 2023, 10:45:37 AMQuote from: buwaytress on June 17, 2023, 09:31:28 AMI know people aren't fans of mBTCIs that an American thing?  Here, SI-units are pretty much standard for anything (mg, ml, mm, mmol, mBTC).I never thought of it that way, but that could be it now that you mention it! I'm almost 100% SI-arranged. cm, mm, m, km. Back \"home\" we have completely different units (which is slowly phasing out anyway) which I had to get used to but never made sense even as a child. grams and metres for me, so maybe that's why mBTCs always made sense in my head",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}