{
  "id": "topic_5460098",
  "title": "straumat",
  "author": "straumat",
  "created_time": "July 17, 2023, 01:00:29 PM",
  "content": "Introducing Royllo Explorer: a search engine for Taproot Assets living on the Bitcoin blockchain (Now open source!).Think of it as a \"Google\" for Taproot Assets, providing you with a web interface and an API to search and discover these assets with ease.The Key features include:Search for Taproot assets and proofs using our user-friendly web interface.Add your proofs to our database to let the world discover and learn about your assets.Add universe servers to let us discover new data automatically (Work in progress).Build new applications, services, and tools effortlessly using our GraphQL API.Get started now by visiting our website at https://explorer.royllo.org or explore our codebase on GitHub at https://github.com/royllo/explorer.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460098",
  "comments": [
    {
      "author": "dkbit98",
      "created_time": "July 17, 2023, 04:23:56 PM",
      "body": "Quote from: straumat on July 17, 2023, 01:00:29 PMIntroducing Royllo Explorer: a search engine for Taproot Assets living on the Bitcoin blockchain (Now open source!).Is there any way to show list of all taproot assets?I tried searching for satoshi, theymos, bitcoin and I didn't receive any result.Cool to see this explorer is open source, but I hope it won't be used only for ordinals",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "straumat",
      "created_time": "July 17, 2023, 06:02:02 PM",
      "body": "Peoples have to add proof or universe but for the moment, Taproot Assets are not live on the bitcoin blockchain... we are on testnet !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sir Lagsalot",
      "created_time": "November 02, 2023, 06:09:49 AM",
      "body": "Hi straumat, any update on when this will work on mainnet?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}