{
  "id": "topic_5433427",
  "title": "alastantiger",
  "author": "alastantiger",
  "created_time": "January 08, 2023, 03:01:16 AM",
  "content": "Remember the first trading lesson you learned as a newbie? Did it come from a win or a loss? A loss teaches you about the reality of the market, protects you from becoming cocky, and humbles you. When you are a beginner trader, a small loss is not a terrible thing. Losses teach you proper trading risk management strategies and techniques and respect for the market and prepare you for long-term success.Remember the first lesson you learned as a beginner trader? Did it come from a loss or a win?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433427",
  "comments": [
    {
      "author": "adaseb",
      "created_time": "January 08, 2023, 04:09:24 AM",
      "body": "Yes this is true. You never remember your big wins only your big losers and this is why you can’t trade with demo or play money. Because it will seem too easy and give you a false sense of security. You need to experience loss to be able to learn from it.Hence it’s why it’s better trading with a small account than demo. Because the human emotion will be pretty much the same whether you lose $10 or $100. But if you trade with fake money then there is no emotion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "January 08, 2023, 04:30:57 AM",
      "body": "Losses in trading only teach that it is time to stop trading. Indeed, negative experiences have a more favorable effect on improving skills, but this is fraught with losses. From a pragmatic point of view, it is better to learn from the mistakes of others, and not from your own. This will be cheaper.My first lesson learned was: be careful.  After I clicked on the wrong order.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "January 08, 2023, 05:44:05 AM",
      "body": "I don't believe, \"You Learn More from Losses than from Wins\" because that's incorrect. One can learn both ways. In fact, I learnt more from my wins than I did from losses. You talked about losses like anyone wants to have them and then readjust from such. If there's anything losses will even do to beginners, it's to scare and discourage while introducing them to reality.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KupaCrypto",
      "created_time": "January 08, 2023, 06:11:29 AM",
      "body": "Quote from: Mpamaegbu on January 08, 2023, 05:44:05 AMI don't believe, \"You Learn More from Losses than from Wins\" because that's incorrect. One can learn both ways. In fact, I learnt more from my wins than I did from losses. You talked about losses like anyone wants to have them and then readjust from such. If there's anything losses will even do to beginners, it's to scare and discourage while introducing them to reality.Yes very correct, you can learn from losses and can also learn from your wins all still form part of experience, so we can say we learn from our past experience weather win or loss, but I think the one that makes us more carefulis the losses because you won't want to loose either your money or whatever resources that was invested in it. So it's safe to say we learn from both either losses or wins but losses makes us more careful so as not to loose for a second time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "January 08, 2023, 07:12:09 AM",
      "body": "Quote from: alastantiger on January 08, 2023, 03:01:16 AMRemember the first lesson you learned as a beginner trader? Did it come from a loss or a win?I could not remember but I noticed that I lost in trading, even than gambling. The first I go more into was gambling, later I go more into trading. I am not saying trading is gambling, they are different and I see trading to be promising, but with the right strategies, to be professional and to let professionalism be over emotion and impatience. You are not wrong, to learn from  losses would be the beginning of successful trading, beginners are even warned not to use the money they can not afford to lose to trade.But some traders can find themselves losing, they better go for long term trading or holding instead, after learn more about trading. Scalping and day trading is not for everyone, both are very risky, indicators can be deceiving because they are not completely accurate even when they seem they are very accurate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamifoud",
      "created_time": "January 08, 2023, 07:39:57 AM",
      "body": "Quote from: alastantiger on January 08, 2023, 03:01:16 AM...Remember the first lesson you learned as a beginner trader? Did it come from a loss or a win?Well, it is not really good to start trading with losses but at the same time, it teaches us how to be strong and makes us feel that trading is not easy. In this situation, we can assess ourselves if we are really fit for this area or something to find another because it was important to leave a comfort zone than push ourselves to something that we know we fail only. However, there is wrong with trying, whether we lose or win at least we did our best and learn something from it. And also to accept the fact that not all are destined to become successful traders either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "January 08, 2023, 08:10:34 AM",
      "body": "It was a loss. It's because I didn't stick to my strategy; I skipped one step, and I also expected the price to recover at that point, but instead, I'm losing more. If you win in a trade, it means that you predicted it in your analysis, and you have nothing to learn from it since you already know that the price was going that way at that time. But if you lose, you will check your strategy and analysis and find a reason as to why you lost, and that is the time you will learn something. It applies to all aspects of your life, which we will improve more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "January 08, 2023, 09:18:58 AM",
      "body": "I'm happier when I win though not that sad with losing because I know loses are part of trade. More especially with winning, it gives me more courage that I have done the right thing and that is why I have won so I begin to follow up the chart to see how to correct my past mistakes. I don't think loses are for learning rather winning is what will guide you not to record more loses and it shows you that you have actually corrected the mistakes when you see the win and by that you have learnt a thing or two adding to your trade strategy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "oaz7t",
      "created_time": "January 08, 2023, 10:40:54 AM",
      "body": "You either learn one lesson or first and last lesson in the trading based on how much you lost. The case is weird because it won't be easy for every person to be successful in the trading business. Some of the users grasping the trading at coolest level possible while some of them are taught lessons again and again but they keep failing. It's all about the personality to be honest. Moreover, recently the trend for getting into trading business has increased a lot and thus it is driving the tutoring classes about trading at alarming rates. The problem is all those people are not even capable of proper logics are entering into the trading and loosing their money in the process. Hope everyone take the decisions properly and learn from others rather than going in all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "January 08, 2023, 12:08:20 PM",
      "body": "Quote from: alastantiger on January 08, 2023, 03:01:16 AMRemember the first trading lesson you learned as a newbie? Did it come from a win or a loss? A loss teaches you about the reality of the market, protects you from becoming cocky, and humbles you. When you are a beginner trader, a small loss is not a terrible thing. Losses teach you proper trading risk management strategies and techniques and respect for the market and prepare you for long-term success.Remember the first lesson you learned as a beginner trader? Did it come from a loss or a win?If you keep winning, you are more likely to less appreciate it, become too overconfident in your skill that you refuse to want to learn more or even see any reason to. Winning always makes you relaxed. I agree that losses are sometimes important for the lessons that they bring and the reminder not to get too comfortable. Unfortunately, some people take losses with the wrong mindset, they don't see it as an opportunity to learn to become better, only as a discouragement that can make them stop trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "January 08, 2023, 01:04:58 PM",
      "body": "As a beginner in trading, some people usually benefit but also those who experience losses because they are inexperienced. Becoming a trader is difficult and requires a lot of preparation, including learning to analyze to determine when to enter and exit the market. And if we can learn from our losses, it will be easier to gain profits because we must always improve our ability to analyze the market if we want to profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "January 08, 2023, 01:42:17 PM",
      "body": "Quote from: m2017 on January 08, 2023, 04:30:57 AMLosses in trading only teach that it is time to stop trading. Stop so that there are no further losses and fix what went wrong. that is indeed good advice, not just stopping everything in trading.Quote from: m2017 on January 08, 2023, 04:30:57 AMIndeed, negative experiences have a more favorable effect on improving skills, but this is fraught with losses. From a pragmatic point of view, it is better to learn from the mistakes of others, and not from your own. This will be cheaper.My first lesson learned was: be careful.  After I clicked on the wrong order.Negative experiences when trading will give you more increased abilities than before. From the pragmatic point of view you mean, learning from other people's mistakes would be a good suggestion and you don't have to make mistakes yourself. many other people's experiences in this forum can be a lesson so you don't experience the same mistake. But some beginners only focus on what they learn in front of them, not seeing how other people go through some of these mistakes so they can apply it to themselves.At first, I also did the same thing as a beginner in general, but after doing some research, mistakes made by other people can be a warning not to make the same mistake and get through it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "January 08, 2023, 01:56:19 PM",
      "body": "Quote from: alastantiger on January 08, 2023, 03:01:16 AM(....)Remember the first lesson you learned as a beginner trader? Did it come from a loss or a win?For me, it's both. Trading is a very difficult and risky job because it needed real money before you can start.If you afford losses, make sure you always have extra funds so you can continue trading and that's the part you can say learn from your mistakes which are considered as learning from losses.At the same time, on every wins also, I believe you also got some lessons here and you will apply to your next trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CapGelatik",
      "created_time": "January 08, 2023, 01:58:53 PM",
      "body": "Quote from: michellee on January 08, 2023, 01:04:58 PMAs a beginner in trading, some people usually benefit but also those who experience losses because they are inexperienced. Becoming a trader is difficult and requires a lot of preparation, including learning to analyze to determine when to enter and exit the market. And if we can learn from our losses, it will be easier to gain profits because we must always improve our ability to analyze the market if we want to profit.That's absolutely true, so don't assume that trading is easy, it's a big mistake.knowledge and skills are very important things that need to be owned by trade,in trading we also do not try to stop learning",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GigaBit",
      "created_time": "January 08, 2023, 01:59:46 PM",
      "body": "Quote from: alastantiger on January 08, 2023, 03:01:16 AMRemember the first trading lesson you learned as a newbie? Did it come from a win or a loss? A loss teaches you about the reality of the market, protects you from becoming cocky, and humbles you. When you are a beginner trader, a small loss is not a terrible thing. Losses teach you proper trading risk management strategies and techniques and respect for the market and prepare you for long-term success.Remember the first lesson you learned as a beginner trader? Did it come from a loss or a win?A word is often heard that when people lose, they learn from it. Trading is a platform where the experienced are often loses many time. A new trader must take part in trading with proper education. Trading is not difficult but making profit is not so easy task. When a trader wants to trade, he has to trade with the knowledge of various things. He has to review recent events and history. Which is not easy to master. But when a trader makes a big loss, he does a lot of research, why he made a loss. That lesson is more useful than any other time for a new trader. Most of the trader lose during the beginner stage of trading life. I don't consider that time as loss but as the first step to gain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "January 08, 2023, 02:10:22 PM",
      "body": "Quote from: alastantiger on January 08, 2023, 03:01:16 AMRemember the first trading lesson you learned as a newbie? Did it come from a win or a loss?It usually is a win when you start trading. Because most people start trading in bull market. They are invited to join during very bullish time so their first trades would be wins that don't actually come from their good tradings. They are only lucky in a bullish time after that bearish time comes that is time where their trading skills will be tested. Luck does not help them in bear market.QuoteDid it come from a loss or a win?Win first, lose later and the cycle repeats until they realize it and change from trading to investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "January 08, 2023, 02:13:32 PM",
      "body": "Quote from: taufik123 on January 08, 2023, 01:42:17 PMBut some beginners only focus on what they learn in front of them, not seeing how other people go through some of these mistakes so they can apply it to themselves.Self experience is the best teacher to me, people don’t take lessons from others too serious than when they incur it more on themselves. I believe a person at loss will be careful going into same trading route again same goes to the profiters he either finds more alternatives to gain more profit or seek more ways to stay on the right track. Both are great lessons but a serial loser doesn’t learn a thing to me",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "onecall123",
      "created_time": "January 08, 2023, 02:25:45 PM",
      "body": "Quote from: alastantiger on January 08, 2023, 03:01:16 AM----Remember the first lesson you learned as a beginner trader? Did it come from a loss or a win?Losses are often the result of mistakes or failures, whereas wins may not require learning new skills. In other words, it may be true that the losses we suffer are more learning opportunities for us than the wins we enjoy. It takes time for me to make profits after I've survived losses. Ultimately, the smart thing to do is to make a profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "January 08, 2023, 02:32:13 PM",
      "body": "Quote from: alastantiger on January 08, 2023, 03:01:16 AMRemember the first trading lesson you learned as a newbie? Did it come from a win or a loss? A loss teaches you about the reality of the market, protects you from becoming cocky, and humbles you. When you are a beginner trader, a small loss is not a terrible thing. Losses teach you proper trading risk management strategies and techniques and respect for the market and prepare you for long-term success.Remember the first lesson you learned as a beginner trader? Did it come from a loss or a win?The first lesson that I learned as a beginner trader is to diversify my investments and not put my capital in one currency. The first trading for me came with a loss because I invested in one currency whose project failed after that. Yes, the loss was not great, but thanks to this loss, I learned the lesson, so there are no Free lessons that you must sacrifice and lose in order to learn. Losses play a role in making you more balanced in making your decisions and wiser because they teach you various strategies and techniques that make you win and gain in the long run profits that compensate you for what you lost, so trading is a win and a loss and each of us has cases of profit and loss but who stands firm for a long time and achieves gains, he is the one who learns from his mistakes, gains experience, and develops his skills.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}