{
  "id": "topic_5469891",
  "title": "Glaxe",
  "author": "Glaxe",
  "created_time": "October 10, 2023, 03:07:10 PM",
  "content": "We all know Binance is one of the best exchange in the world and there is a button called P2P Trade and there one can trade in their own local currency. I don't know how to do that so I'm asking for help from everyone. I hope you can explain me in detail.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469891",
  "comments": [
    {
      "author": "cryptoWODL",
      "created_time": "October 10, 2023, 03:13:32 PMLast edit: October 10, 2023, 03:25:30 PM by cryptoWODL",
      "body": "Quote from: Glaxe on October 10, 2023, 03:07:10 PMWe all know Binance is one of the best exchange in the world and there is a button called P2P Trade and there one can trade in their own local currency. I don't know how to do that so I'm asking for help from everyone. I hope you can explain me in detail.I am explaining to you very simply.First of all if you want to trade P2P you must Binance or Kucoin exchange there should be exchanges and even they should be verified so you can feel free to convert your dollars or different crypto currencies to your own local currency by going to the p2p option.Hopefully you will understand better if you follow these steps.I mention them for your understanding.If you want to trade Binance P2P then you must verify your exchange because without verification it is not possible to trade P2P.1. First you go to your Binance exchange then there you will see something like this.2. After this page is opened you will see wallet written below click on it.3. After clicking on the option to write the wallet, you will see the option to write the deposit.4. Clicking on the deposit button will open a page like this and a search button will appear.You just type the name of the currency you want to convert into your own money in the search button and then select that currency.I am giving an example, because if you want to deposit USDT then you have to select any network either BSC or Ethereum network.It goes without saying that the coins you deposit will have their own network and you must selecte that network before depositing.5. If your deposit is successful, you need to transfer them to Funding Wallet.You can do it like this.After clicking on the transfer button, your page will show like this and you will enter the currency you want to transfer here and click on the confirm button.6. Then you need to come back to your exchange's home page and you will see there is a button called P2P Trading and you click on that.7. P2P After clicking on, a page like this will show in front of you You will then click on the Sell button.After clicking you will see something like this.If you click on the page that I have marked on the page that you see, it will show the currency of different countries, from there you can select the currency of the country in which you live.8. After selecting your own country and currency you will come to this page and you will see it says select your payment method and click there to add your own account.Then you will see it written below sell with zero fee after clicking there when the buyer you sell to will pay you.Then you check it well and then release it.This way you can trade P2P on your Binance Exchange.I have discussed it in detail like this for ease of understanding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "October 10, 2023, 03:19:17 PM",
      "body": "Quote from: Glaxe on October 10, 2023, 03:07:10 PMWe all know Binance is one of the best exchange in the world and there is a button called P2P Trade and there one can trade in their own local currency. I don't know how to do that so I'm asking for help from everyone. I hope you can explain me in detail.Binance provides tutorials on every feature they have in a form of video or article which is available in their help center. You can use this article https://www.binance.com/en/blog/p2p/binance-p2p-newbie-guide-7428324997079645557 to learn the step by step procedure and to familiarize the P2P features.KYC is the number 1 requirements of Binance P2P since you are dealing with Fiat currency. Just a heads up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "October 10, 2023, 03:28:41 PM",
      "body": "Quote from: Glaxe on October 10, 2023, 03:07:10 PMWe all know Binance is one of the best exchange in the world and there is a button called P2P Trade and there one can trade in their own local currency.They are a big exchange but best, I don't know. They do some internal triggers to kill open positions of their users with leverages and futures.QuoteI don't know how to do that so I'm asking for help from everyone. I hope you can explain me in detail.In cryptocurrency, do your own research is very important because you should never trust anyone. Doing your own research and verifying any information you get from anyone. Trusting someone is not help you to avoid scam.Searching will give you some articles from Binance blog.How to trade with Binance P2PBinance P2P Newbie guideWhen you are asking this, you must afford to lose your money for your trading experience in P2P because during your trading, you will make mistakes, pay costs and improve yourself.Try to be careful with any step in trading can help you to avoid mistakes and losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God bless u",
      "created_time": "October 10, 2023, 03:30:35 PM",
      "body": "Quote from: Glaxe on October 10, 2023, 03:07:10 PMWe all know Binance is one of the best exchange in the world and there is a button called P2P Trade and there one can trade in their own local currency. I don't know how to do that so I'm asking for help from everyone. I hope you can explain me in detail.I think you you got it two methods, If you need image explanation, CryptoWodl make it for you, If you need video guide check binance video. Quote from: cryptoWODL on October 10, 2023, 03:13:32 PMI am explaining to you very simply.First of all if you want to trade P2P you must Binance or Kucoin exchange there should be exchanges and even they should be verified so you can feel free to convert your dollars or different crypto currencies to your own local currency by going to the p2p option.I appreciate your work, In 6 minutes you have explained full tutorial with image. Mind blowing work, If I were in your place maybe I spend more than hours. taking screenshot and then upload on the Talkimg site take lot of time and you also write all explanation with each image.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "October 10, 2023, 03:35:29 PM",
      "body": "Quote from: Glaxe on October 10, 2023, 03:07:10 PMWe all know Binance is one of the best exchange in the world and there is a button called P2P Trade and there one can trade in their own local currency. I don't know how to do that so I'm asking for help from everyone. I hope you can explain me in detail.Binance exchange isn't the best exchange in the world, it might be the most popular exchange but that doesn't make it the best. They're not the best in security, Binance exchange is a centralized exchange and when we want to trade P2P transaction, centralized exchange are not the best exchange we should be using instead we should using exchange that are decentralized. If you want to trade P2P and enjoy full decentralization make use of https://bisq.network. You can make use of Binance exchange for your regular trading if you'll be comfortable submitting your documents for KYC but if you're not comfortable and value your privacy, you should make use of other exchange that don't require KYC for trading and withdrawals. We have many decentralized exchange that you can use and they can be found here; https://www.coingecko.com/en/exchanges/decentralized",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "October 10, 2023, 03:38:57 PM",
      "body": "Quote from: Glaxe on October 10, 2023, 03:07:10 PMWe all know Binance is one of the best exchange in the worldThe biggest yes, but the best i doubt it.Quote from: Glaxe on October 10, 2023, 03:07:10 PM and there is a button called P2P Trade and there one can trade in their own local currency. I don't know how to do that so I'm asking for help from everyone. I hope you can explain me in detail.It is true it have some pseudo p2p network, to do p2p trades you need to enter to https://c2c.binance.com/ logged in your account.Select buy the token or coin that you want to buy, the currency that you want use (your local currencty)Select the best offer that fit your needs, check reputation of the seller and time of response. Select how much of that token or coin you want to buy and place an ORDERSend him the payment to the account that is listed in the page with your local bank, usually bank transfer are allowed, but this may vary from one country to another.wait for him to confirm the transactions.If there is some problem you always can request support from bianance.Regards!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "October 10, 2023, 03:43:19 PM",
      "body": "Rather — probably tell us which part of the P2P process you don't understand? If you go to Binance's P2P[1] page, it should be pretty straightforward. It's designed good enough in a way that almost anyone that can use a computer can easily go through the exchange process.[1] https://p2p.binance.com/en",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "October 10, 2023, 04:05:30 PM",
      "body": "Quote from: Glaxe on October 10, 2023, 03:07:10 PMWe all know Binance is one of the best exchange in the world and there is a button called P2P Trade and there one can trade in their own local currency. I don't know how to do that so I'm asking for help from everyone. I hope you can explain me in detail.The best in what criteria? Been the biggest or the most popular exchange doesn’t make it the best. The best will be an exchange that doesn’t require your personal data or the need to hold on to your funds like a traditional bank. Before you can get to use P2P on binance you need to be verified, the KYC verification requires your ID. so if you’re not ready to compromise your privacy by doing KYC I will advice you move to decentralized exchanges. Here are list of decentralized exchanges that do not require KYC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "October 10, 2023, 04:18:43 PM",
      "body": "Quote from: Glaxe on October 10, 2023, 03:07:10 PMWe all know Binance is one of the best exchange in the world and there is a button called P2P Trade and there one can trade in their own local currency. I don't know how to do that so I'm asking for help from everyone. I hope you can explain me in detail.First of all, the p2p trading feature on Binance is available for KYC verified users only and if you haven't completed your KYC already then you'll have to complete your KYC first. Once your KYC is completed then you click on this link Trade p2p Binance URL and then select your local currency from the available currencies and also select the payment method. Now that you have selected the above now you'll see the people who are offering their exchange services and place your trade. If you want to sell your crypto than click on the sell button and if you want to buy crypto then click on buy button. Once you decided that which route you wanna go then you should find all those merchants who are offering their buying and selling services and there you can place your buy or sell order with the merchants and once you sent or received the payment in your local currency then you can complete the trade and leave feedback.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin Smith",
      "created_time": "October 10, 2023, 04:23:54 PM",
      "body": "Quote from: CryptopreneurBrainboss on October 10, 2023, 03:35:29 PMBinance exchange isn't the best It is not best for P2P trades especially, where we can find lot of scams like fake payment proofs, funds transferred from hacked accounts and a lot others so who ever using p2p exchanges for crypto to fiat trades should be very careful while choosing the trading partner irrespective of the platform cause we are going to deal with another individual so we may have to share sensitive personal information with them if needed and that person is collecting those data with bad intention then we will have issues.Here is an article explains about Common Scams on Binance P2P|Protecting Yourself from Scammers on Binance P2P, so OP take a look at this before starting your p2p trading journey.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Antotena",
      "created_time": "October 10, 2023, 05:28:08 PM",
      "body": "Quote from: albert0bsd on October 10, 2023, 03:38:57 PMQuote from: Glaxe on October 10, 2023, 03:07:10 PMWe all know Binance is one of the best exchange in the worldThe biggest yes, but the best i doubt it.About been the best, you are right because Binance p2p is now for the big loaded traders, you cannot trade anything less than $10 on their spot trading and also their p2p required a volume of $10 above, so when you have anything below that amount will be considered as dust but that's too large.Kucoin and OKs offer more quantity as low as $1 in p2p and there are more of merchants that are ready to buy it. Binance have problem with downrating merchants that does not meet their requirements every week, if you don't make trades often, they may flash you down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "October 10, 2023, 05:42:00 PM",
      "body": "Quote from: cryptoWODL on October 10, 2023, 03:13:32 PM3. After clicking on the option to write the wallet, you will see the option to write the deposit.You did marvelously well with those screenshots shared. It's an effort worth commending, merit wise. Going forward, let me quickly add that Binance doesn't open deposit this day until new subscribers have done their KYC. It wasn't so in the past. I think I like it this way. So, no one accuses the exchange of withholding their funds as a result of incomplete KYC verification.Quote from: CryptopreneurBrainboss on October 10, 2023, 03:35:29 PMBinance exchange isn't the best exchange in the world, it might be the most popular exchange but that doesn't make it the best. They're not the best in security...I know your long running battle with CZ. Don't worry, I will work out a quiet dinner between you two to end this silent feud 😏QuoteIf you want to trade P2P and enjoy full decentralization make use of https://bisq.network.Bisq isn't phone friendly. You only get to enjoy using it on desktop/PC while a mobile phone can only be used just for monitoring trades but you can't get registered with it. So, what's the use? We all don't have PCs.Quote from: Bitcoin Smith on October 10, 2023, 04:23:54 PMHere is an article explains about Common Scams on Binance P2P|Protecting Yourself from Scammers on Binance P2P, so OP take a look at this before starting your p2p trading journey.While I ain't holding brief for Binance here but truth has to be said. Scam and it attempts aren't strange to other exchanges too. They all have a fair share of it. Besides, the article you pointed out was put out by the same exchange you're lampooning. For Binance to put up that article to warn users means it's aware of the monkey business that may be going on and wants its users to be armed with vital information. Are we still going to condemn Binance for that? Nope, of course.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "October 10, 2023, 05:53:47 PM",
      "body": "Quote from: cryptoWODL on October 10, 2023, 03:13:32 PMQuote from: Glaxe on October 10, 2023, 03:07:10 PMWe all know Binance is one of the best exchange in the world and there is a button called P2P Trade and there one can trade in their own local currency. I don't know how to do that so I'm asking for help from everyone. I hope you can explain me in detail.I am explaining to you very simply.First of all if you want to trade P2P you must Binance or Kucoin exchange there should be exchanges and even they should be verified so you can feel free to convert your dollars or different crypto currencies to your own local currency by going to the p2p option.Hopefully you will understand better if you follow these steps.I mention them for your understanding.If you want to trade Binance P2P then you must verify your exchange because without verification it is not possible to trade P2P.1. First you go to your Binance exchange then there you will see something like this.2. After this page is opened you will see wallet written below click on it.3. After clicking on the option to write the wallet, you will see the option to write the deposit.4. Clicking on the deposit button will open a page like this and a search button will appear.You just type the name of the currency you want to convert into your own money in the search button and then select that currency.I am giving an example, because if you want to deposit USDT then you have to select any network either BSC or Ethereum network.It goes without saying that the coins you deposit will have their own network and you must selecte that network before depositing.5. If your deposit is successful, you need to transfer them to Funding Wallet.You can do it like this.After clicking on the transfer button, your page will show like this and you will enter the currency you want to transfer here and click on the confirm button.6. Then you need to come back to your exchange's home page and you will see there is a button called P2P Trading and you click on that.7. P2P After clicking on, a page like this will show in front of you You will then click on the Sell button.After clicking you will see something like this.If you click on the page that I have marked on the page that you see, it will show the currency of different countries, from there you can select the currency of the country in which you live.8. After selecting your own country and currency you will come to this page and you will see it says select your payment method and click there to add your own account.Then you will see it written below sell with zero fee after clicking there when the buyer you sell to will pay you.Then you check it well and then release it.This way you can trade P2P on your Binance Exchange.I have discussed it in detail like this for ease of understanding.Quoted for the image to be visible.@OP, If you really want to make use of Binance, then I think you should adhere to these instructions dropped by cryptoWODL. They're a detailed explanation of the process you need to pass in order to complete a successful trade on Binance P2P. If there is any process that you have already passed, you don't need to repeat it, as sometimes you might have already made some deposit or passed through the KYC process. One thing I will like you to take note of is that when taking and executing trades on P2P, always be security cautious, as there are always some people who might appear to be good traders with a reputation, but deep down they are scammers, so always take note and confirm your payment is on your designated account before you release your coin to the buyer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "October 10, 2023, 05:58:08 PM",
      "body": "Quote from: Glaxe on October 10, 2023, 03:07:10 PMWe all know Binance is one of the best exchange in the world and there is a button called P2P Trade and there one can trade in their own local currency. I don't know how to do that so I'm asking for help from everyone. I hope you can explain me in detail.Once you click on P2P, you will see 2 options one is for sell, and one is for buy and first, you have to make sure what are you selling, whether it is USDT, BUSD, or BTC. Then in the filter section, you can select for the payment method, from which you have to send or receive the amount. Well, I do know that it would be hard for you to follow the steps written here by me or anyone. I would recommend you to watch a YouTube video because there you will get to know more and you will be safe from many mistakes. Such as how to react when you face any issue with receiving or sending the funds.https://www.youtube.com/watch?v=xnyzg_t_JgQ I don't know your language but I hope this will help you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "October 10, 2023, 06:11:59 PM",
      "body": "What I guess is you are confused when trying to sell something on P2P it says insufficient balance even if your account has funds am I right?That's the thing that I experienced before it does not work when trying to sell USDT or Bitcoin into cash even if you have funds in your account.If you are planning to sell something you will need to transfer your funds from your spot wallet to funding as already mentioned in the guide above.Also, don't forget to add your payment method and make sure you are Email, SMS and KYC verified all details should match your account if not no one will trade with you.Please read this \"Binance P2P Newbie Guide\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "October 10, 2023, 06:32:04 PM",
      "body": "Quote from: Glaxe on October 10, 2023, 03:07:10 PMWe all know Binance is one of the best exchange in the world and there is a button called P2P Trade and there one can trade in their own local currency. I don't know how to do that so I'm asking for help from everyone. I hope you can explain me in detail.I would like to recommend you find a local dealer and try to deal in cash because if there are some regulatory issues in your country think exchange may lead to some problems, some regulatory problems.On the other hand, be very careful while P2P trade on Binance, even though they've made it pretty secure but still spammer can trick you in. My motive is to guide you better as most of the members are just gonna guide you through the process. It is pretty simple you can even go through the Binance tutorials on how to trade securely using P2P.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "October 10, 2023, 09:17:48 PM",
      "body": "Quote from: CryptopreneurBrainboss on October 10, 2023, 03:35:29 PMQuote from: Glaxe on October 10, 2023, 03:07:10 PMWe all know Binance is one of the best exchange in the world and there is a button called P2P Trade and there one can trade in their own local currency. I don't know how to do that so I'm asking for help from everyone. I hope you can explain me in detail.Binance exchange isn't the best exchange in the world, it might be the most popular exchange but that doesn't make it the best. They're not the best in security, Binance exchange is a centralized exchange and when we want to trade P2P transaction, centralized exchange are not the best exchange we should be using instead we should using exchange that are decentralized.  That's true and I agree with it. Even Glaxe did say that Binance is ONE OF THE BEST exchange but I don't think it's true that it is one of the best exchange in the world but I'd rather say that it is one of the most popular exchange in the world where many people are using it. Here's a reason why I think binance will never be the best exchange which is that Binance is centralized and ask their customers for KYC which many people doesn't like.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "October 10, 2023, 10:35:17 PM",
      "body": "First, no exchange should be categorized as the best since the market is always revolving and if an exchange must be one of the best it must have a good customer support service. For the record, Binance is one of the crypto exchange platforms that have worse customer support.Having said that, Binance has everything you need about using their P2P exchange platform at their https://www.binance.com/en/blog/p2p/binance-p2p-newbie-guide-7428324997079645557",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "October 10, 2023, 11:59:02 PM",
      "body": "I've learned Binance P2P trading by watching a YouTube tutorial based on my local, in which you definitely understand the full details.Because you're using your local currency and which e-wallet or online bank you use. All links are provided above and I think you can do it yourself now and follow my suggestion. If you aren't sure or if it's your first time in Binance trading P2P, I suggest using a small amount for testing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}