{
  "id": "topic_5470718",
  "title": "Joeyp",
  "author": "Joeyp",
  "created_time": "October 17, 2023, 06:44:56 PMLast edit: October 18, 2023, 06:20:01 PM by Joeyp",
  "content": "There are local China subforums in Bitcointalk and Bitcoin have total ban in China, so forum admin probably will be arrested and transfered to China in future.Possible crime type - Bitcoin promoting to China people. What do you think ?China can say that Bitcointalk China subforums, which promote Bitcoin are not legal in their country and therefore have wide impact on China in unlegal way, which can be the crime according to Chinese criminal law. China as the state can ask to transfer persons from other countries in criminal cases, it depends from international agreements and local Chinese criminal law. USA for example, do not have direct extradition agreement with China, but can extradite case by case.In some cases based on residence country law, persons are not transfered, but that's exception. Each year there are hundreds of such cases between countries in the world. China is also Marxist–Leninist one-party socialist republic, so different political system, see here - https://en.wikipedia.org/wiki/China.What Is Extradition? Which countries have extradition treaties with the United States? - https://www.cfr.org/backgrounder/what-extradition",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470718",
  "comments": [
    {
      "author": "Nwada001",
      "created_time": "October 17, 2023, 06:51:41 PM",
      "body": "If there is anyone to be arrested, the Chinese government will first of all start by arresting their citizens who are on those China local boards.These are just some unnecessary things to think about. The forum is not restricted to anyone, and no government bans it from being accessed by its citizens, so nothing of the sort is ever going to happen, so relax and think about something else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "October 17, 2023, 06:53:52 PM",
      "body": "You must be joking. Bitcointalk is banned in Russia. Do you know that? People that are on this forum are benefiting than this forum is benefiting from them. Is that the reason a government of a country will do want you are talking about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "light_warrior",
      "created_time": "October 17, 2023, 06:54:44 PM",
      "body": "The Chinese government can't arrest anyone here because the forum is under US jurisdiction. But it can try to restrict access to its citizens, as the Russian government has done by restricting its citizens' access to the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Joeyp",
      "created_time": "October 17, 2023, 06:59:29 PM",
      "body": "Quote from: light_warrior on October 17, 2023, 06:54:44 PMThe Chinese government can't arrest anyone here because the forum is under US jurisdiction. But it can try to restrict access to its citizens, as the Russian government has done by restricting its citizens' access to the forum.China as the state can ask to transfer persons from other countries - USA, India, Russia etc. in criminal cases, it depends from international agreements.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shahzadafzal",
      "created_time": "October 17, 2023, 07:08:32 PM",
      "body": "Quote from: Joeyp on October 17, 2023, 06:44:56 PMThere are local China subforums in Bitcointalk and Bitcoin have total ban in China, so soon forum admin probably will be arrested and transfered to China. What you think ?  What you mean and what is the source your information? Please stop spreading rumors unless you have an authentic source. Speculation and rumors can often lead to unnecessary panic.I see Chinese board Moderator is Barcode_, by forum admin do you mean him? Before jumping to conclusions, it's crucial verify your sources and facts. As for the forum admin please clarify who you're referring to. If you mean Barcode_, who is the moderator of the Chinese board, then you should know moderation responsibilities are distinct from forum administration.Please let's promote a responsible approach to discussing such matters and ensure that we rely on verified sources for any claims made.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pokapoka124",
      "created_time": "October 17, 2023, 07:10:48 PM",
      "body": "And what do you suppose will be the criminal charge? No one is being forced to be on the forum, every person is here on his own accord and free will. We are not in china and unless a real crime is being committed by the administrators of the forum, I don’t think any government will be looking to prosecute anyone. I remember there was similar talk when Chipmixer was shut down. There’s no direct connection between the admin and companies who chose to advertise here, even forum staff do not wear certain signatures just so the forum can be protected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "October 17, 2023, 07:14:02 PM",
      "body": "Quote from: Joeyp on October 17, 2023, 06:44:56 PMThere are local China subforums in Bitcointalk and Bitcoin have total ban in China, so soon forum admin probably will be arrested and transfered to China. What you think ? I am extremely curious what made you think the forum admin will be transferred to China? As far as I know, running a forum that is free for everyone to use is not a crime. china banning Bitcoin and the forum having a Chinese local board does not mean the forum or admin is breaking any laws. again, I am really curious, what made you think the forum admin will be transferred to China? also, I've seen your previous threads and it is clear that you are targeting the admins, I am curious what exactly it is that you want from them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Joeyp",
      "created_time": "October 17, 2023, 07:17:34 PM",
      "body": "Quote from: Pokapoka124 on October 17, 2023, 07:10:48 PMAnd what do you suppose will be the criminal charge? No one is being forced to be on the forum, every person is here on his own accord and free will. We are not in china and unless a real crime is being committed by the administrators of the forum, I don’t think any government will be looking to prosecute anyone. I remember there was similar talk when Chipmixer was shut down. There’s no direct connection between the admin and companies who chose to advertise here, even forum staff do not wear certain signatures just so the forum can be protected. Criminal charge for forum admin can depend from local Chinese criminal law. And then China as state can start to operate through direct contacts between countries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "October 17, 2023, 07:34:34 PM",
      "body": "Quote from: Joeyp on October 17, 2023, 06:44:56 PMThere are local China subforums in Bitcointalk and Bitcoin have total ban in China, so soon forum admin probably will be arrested and transfered to China. What you think ?You seem confused about the difference between China as a country versus the Chinese language. A local board made for Chinese speakers does not automatically mean its just for people in China. Chinese is a major world language with speakers way outside of China itself and is even one of the official languages of the UN, so jumping to the conclusion that a Chinese language board must be for China specifically shows a misunderstanding of how widely used the Chinese language is, separate from the country. Besides, What about Taiwan? There are tons of Chinese speakers there, and its a totally separate country from mainland China, and they do not have a ban on Bitcoin as far as I know.  Quote from: Joeyp on October 17, 2023, 07:17:34 PMCriminal charge for forum admin can depend from local Chinese criminal law. And then China as state can start to operate through direct contacts between countries.To bring a criminal charge, you gotta have a good reason to believe they committed a criminal act. So, what kind of crime are we talking about here?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Joeyp",
      "created_time": "October 17, 2023, 07:45:34 PMLast edit: October 17, 2023, 08:12:15 PM by Joeyp",
      "body": "Quote from: Stalker22 on October 17, 2023, 07:34:34 PMQuote from: Joeyp on October 17, 2023, 06:44:56 PMThere are local China subforums in Bitcointalk and Bitcoin have total ban in China, so soon forum admin probably will be arrested and transfered to China. What you think ?You seem confused about the difference between China as a country versus the Chinese language. A local board made for Chinese speakers does not automatically mean its just for people in China. Chinese is a major world language with speakers way outside of China itself and is even one of the official languages of the UN, so jumping to the conclusion that a Chinese language board must be for China specifically shows a misunderstanding of how widely used the Chinese language is, separate from the country. Besides, What about Taiwan? There are tons of Chinese speakers there, and its a totally separate country from mainland China, and they do not have a ban on Bitcoin as far as I know.  Quote from: Joeyp on October 17, 2023, 07:17:34 PMCriminal charge for forum admin can depend from local Chinese criminal law. And then China as state can start to operate through direct contacts between countries.To bring a criminal charge, you gotta have a good reason to believe they committed a criminal act. So, what kind of crime are we talking about here?From China position, Taiwan is part of China. Crime type - depends from local Chinese criminal law.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ene1980",
      "created_time": "October 17, 2023, 07:53:10 PM",
      "body": "Quote from: Joeyp on October 17, 2023, 06:44:56 PMThere are local China subforums in Bitcointalk and Bitcoin have total ban in China, so soon forum admin probably will be arrested and transfered to China. What you think Cryptocurrency related transactions is illegal in China, what does it have to do with being an admin or an moderator in an online forum or even posting here. Are you high or something to think that anyone would get arrested for running an online forum .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "October 17, 2023, 08:40:18 PM",
      "body": "Quote from: Joeyp on October 17, 2023, 07:45:34 PMFrom China position, Taiwan is part of China. The PRC constitution defines Taiwan as part of its territory, but Taiwan is currently administered by the Republic of China (ROC), not the PRC.Its a complex issue, and if you are interested, you should read about it so I dont have to explain it to you. For now, it suffices to say that Taiwan has autonomy and its own laws compared to mainland China. This explains why in Taiwan there are many crypto-related businesses that operate quite legally even today, despite the Chinese ban on crypto.Quote from: Joeyp on October 17, 2023, 07:45:34 PMCrime type - we are talking about local Chinese criminal law.[/i]\"Chinese criminal law\" does not apply here. The Bitcointalk.org forum falls under US jurisdiction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vispilio",
      "created_time": "October 17, 2023, 08:57:32 PM",
      "body": "Quote from: Joeyp on October 17, 2023, 07:45:34 PMFrom China position, Taiwan is part of China. Crime type - depends from local Chinese criminal law.Quote from: Joeyp on October 17, 2023, 06:44:56 PMPossible crime type - Bitcoin promoting for China people. What do you think ? well maybe it's high time for you to not take official state positions so seriously and start living more dangerously,interests of a state might not always align with the best version of who you can be, in fact the two are guaranteed to clash very frequently these days...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "October 17, 2023, 08:58:08 PM",
      "body": "OP, you are just over thinking and in this case it isn't even necessary. The worst they will do is probably block it from being accessed by the Chinese Citizens just like what Russia did, but arresting the forum admin just because the Citizens signed up or can read through different forum thread is stupid to even think about.China has blocked a number of websites including Google, Facebook, WhatsApp, some since 2010 and Bitcointalk doesn't even future. Stop spreading unnecessary FUD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "October 17, 2023, 09:35:24 PM",
      "body": "Quote from: Joeyp on October 17, 2023, 06:59:29 PMQuote from: light_warrior on October 17, 2023, 06:54:44 PMThe Chinese government can't arrest anyone here because the forum is under US jurisdiction. But it can try to restrict access to its citizens, as the Russian government has done by restricting its citizens' access to the forum.China as the state can ask to transfer persons from other countries - USA, India, Russia etc. in criminal cases, it depends from international agreements. Yeah they can and they will be refused as that forum is not against USA law.Now if that forum section constantly promotes illegal shit like child sex which is not legal in USA 🇺🇸 or China 🇨🇳 the us may go after the person running the section.Some shit is not legal anywhere and the USA 🇺🇸 would likely say here is this pedophile that was promoting child sex in china 🇨🇳 and BTW you have a person in china 🇨🇳 doing something bad lets swap them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "October 17, 2023, 10:00:01 PM",
      "body": "Quote from: Stalker22 on October 17, 2023, 08:40:18 PMQuote from: Joeyp on October 17, 2023, 07:45:34 PMCrime type - we are talking about local Chinese criminal law.[/i]\"Chinese criminal law\" does not apply here. The Bitcointalk.org forum falls under US jurisdiction.And it is absolutely possible that two or more people living in the US, speak Chinese, so even on this forum they prefer to communicate in Chinese (native) rather than in English or another language.It's fascinating how scared people are, they expect the Chinese authorities to search for them around the world because they participated in the discussion about the \"forbidden\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "October 17, 2023, 10:09:22 PM",
      "body": "Quote from: Joeyp on October 17, 2023, 06:44:56 PMThere are local China subforums in Bitcointalk and Bitcoin have total ban in China, so forum admin probably will be arrested and transfered to China in future. Possible crime type - Bitcoin promoting for China people. What do you think ?I think this is stupid, and no admin wont be arrested, it's just your crazy fantasy, there are probably millions of chinese people who live outside China state borders.Don't you have anything better to do in your life than to write nonsense like this?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EFS",
      "created_time": "October 17, 2023, 10:17:49 PM",
      "body": "That's Chinese section, anyone living in the world who speaks Chinese can use it. Users in the Chinese section don't have to live in China. China may try to ban forum access, but that would be a useless sanction when everybody can have VPN access. Moderators or members who view the Chinese section don't have to identify themselves and say where they live. If Chinese authorities request this information, the forum is not obliged to share it, unless there is a valid legal reason from Admin's point of view.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "October 17, 2023, 10:29:43 PM",
      "body": "I knew this would happen, time to say our good byes to theymos before they take him away. Good thing we have each other's back in this community, so if they take him away, we will wave our hands and immediately appoint his second as the head admin, that means if you cut one head, more will grow. This is our slogan at \"decentralized revolution\"I miss the old days of \"China fud\" era, when they were the topic subject and were revered, now we consider them (manipulative politicians) nothing but a scarecrow.😉",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}