{
  "id": "topic_5460406",
  "title": "risingtide",
  "author": "risingtide",
  "created_time": "July 20, 2023, 05:33:45 AM",
  "content": "Digimint.finance is an exciting new NFT project where each Digimint NFT represents a share of our BTC mining farms' hashpower. This means you can start mining BTC just by staking the NFT without having to buy and host a mining rig. Our launch date is set for July 24, 2023. The genesis batch of 100 NFTs will be $100 each and will be selected from a whitelist. Join us in the Digimint Discord to get on the whitelist.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460406",
  "comments": [
    {
      "author": "risingtide",
      "created_time": "July 20, 2023, 07:05:41 PM",
      "body": "4 more days 🚀 🚀... jump into the whitelist while you still can -> https://discord.com/invite/MDPXnxFUEe",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "July 22, 2023, 09:00:04 AM",
      "body": "How is the whitelisting going, how many people are intersted?I checked out your website but couldn't find any information about how many S19 rigs you have. What's the total hash power? There is a document in Russian so I can't understand the content. Did you purchase the rigs from Moscow or a Moscow-based company?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "risingtide",
      "created_time": "July 25, 2023, 05:11:01 PM",
      "body": "Quote from: Pmalek on July 22, 2023, 09:00:04 AMI checked out your website but couldn't find any information about how many S19 rigs you have. What's the total hash power? Yes we have 69 mining rigs, mostly Antminer S19j Pro+ (122Th), for a total hash power of approximately 8.5 PH.You can check our stats on F2Pool.Quote Did you purchase the rigs from Moscow or a Moscow-based company?  Our rigs are shipped to us straight from the Bitmain warehouse.QuoteHow is the whitelisting going, how many people are intersted?We've sold about half of our initial 100 NFT run with approximately 24 hours left to go. Mint your own for 100 USDC on the Ethereum network: https://digimint.finance/Mint",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "July 25, 2023, 11:00:36 PM",
      "body": "Quote from: risingtide on July 25, 2023, 05:11:01 PMQuote from: Pmalek on July 22, 2023, 09:00:04 AMI checked out your website but couldn't find any information about how many S19 rigs you have. What's the total hash power? Yes we have 69 mining rigs, mostly Antminer S19j Pro+ (122Th), for a total hash power of approximately 8.5 PH.You can check our stats on F2Pool.Quote Did you purchase the rigs from Moscow or a Moscow-based company?  Our rigs are shipped to us straight from the Bitmain warehouse.QuoteHow is the whitelisting going, how many people are intersted?We've sold about half of our initial 100 NFT run with approximately 24 hours left to go. Mint your own for 100 USDC on the Ethereum network: https://digimint.finance/MintHopefully, its not another scam cloud mining with fake mining rigs and they only based it on script, if you did purchase these mining rigs better show the documents, you can hide the vital details and why there is no specific address of the location, its better to have a full Video on the mining room and the mining rigs, this is to erase doubts that you are hiding something and this is another cloud mining scheme based on Ponzi scheme.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "risingtide",
      "created_time": "July 26, 2023, 12:20:35 AM",
      "body": "Quote from: robelneo on July 25, 2023, 11:00:36 PMif you did purchase these mining rigs better show the documents, you can hide the vital details and why there is no specific address of the locationWell if anyone wants to visit our mining farms we have an open door policy, you just have to arrange a meeting with our site admin. And again, our mining rigs' output can be seen at https://www.f2pool.com/mining-user/b7810379711850792b7a365683629c67?user_name=digitalmintQuoteits better to have a full Video on the mining room and the mining rigs, this is to erase doubts that you are hiding something and this is another cloud mining scheme based on Ponzi scheme.There will be a live video feed of all of our mining farms up soon on our website. We're looking to expand in North America to have multiple distributed mining locations in addition to our Siberia location.You know what's a Ponzi: most of DeFi. We're looking to build a DeFi primitive that's not based on ponzinomics but rather backed by real, BTC producing mining machines. The best way is to mint your own and start earning rewards: https://digimint.finance",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}