{
  "id": "topic_5522586",
  "title": "legiteum",
  "author": "legiteum",
  "created_time": "December 12, 2024, 08:22:03 PM",
  "content": "Has anybody thought of this?El Salvador is a small, very poor country (average monthly income = $365). And they are a democracy. If you are an average citizen of El Salvador, you are probably thinking about the nice things you could get if your government sold all of that BTC at a huge profit (and yes, math: this isn't enough to make everybody there rich or something, but again, this country is a democracy, so...). I know El Salvador doesn't have a large percentage of the total Bitcoin supply, and them dumping it would only be a small bump on the market for a day or two, but I would reckon the psychological effects would be pretty huge. Of course you could argue that they would want to keep their BTC as an investment, given how much money they have already made on it, but why not invest in some other digital currency that has potential gains of 10x more? In other words, what if El Salvador is gripped by... mass-FOMO  .Something to think about...",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5522586",
  "comments": [
    {
      "author": "Synchronice",
      "created_time": "December 12, 2024, 08:34:54 PM",
      "body": "Quote from: legiteum on December 12, 2024, 08:22:03 PMHas anybody thought of this?El Salvador is a small, very poor country (average monthly income = $365). And they are a democracy. If you are an average citizen of El Salvador, you are probably thinking about the nice things you could get if your government sold all of that BTC at a huge profit (and yes, math: this isn't enough to make everybody there rich or something, but again, this country is a democracy, so...). I know El Salvador doesn't have a large percentage of the total Bitcoin supply, and them dumping it would only be a small bump on the market for a day or two, but I would reckon the psychological effects would be pretty huge. Of course you could argue that they would want to keep their BTC as an investment, given how much money they have already made on it, but why not invest in some other digital currency that has potential gains of 10x more? In other words, what if El Salvador is gripped by... mass-FOMO  .Something to think about...Dude, are you serious? Absolutely nothing will happen, they hold only 6000 Bitcoins. Germany sold 50 000 a few months ago and today we still got the price that's higher than 100K dollars. If I remember correctly, when the Germany sold them, there was a slight dump for a day or two and then price continued bull run.By the way, what nice things are you talking about? Government won't give money to people the way you think, they stay in the government's budget. Also, 6000 Bitcoin is nothing for a country that has a population of 6.5 million people.They don't invest in some other digital currency with high potential because they are very risky. El Salvador is the government with 6.5 million population, a country can't play with it's money like that because that decides the fate of millions of people. Think what will happen if they invest in any altcoin and that altcoin goes bankrupt. There is a very high chance for any altcoin to go bankrupt compared to Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "December 12, 2024, 08:36:25 PM",
      "body": "El Salvador should sell bitcoin and buy altcoins. So that the market will react and the price of bitcoin may fall for a day or two. I am not interested to discuss about if El Salvador selling bitcoin than to let you know, that will not stop bitcoin to get to all-time high.About buying altcoins, the country is not gambling but investing on good assets. Not pump and dump coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "December 12, 2024, 09:00:36 PM",
      "body": "Well the news might sent shockwaves to Bitcoin investors and it could case the price to go down, depends on the timing. It they sold on bear market (doesn't make sense), then it will really affect the price and cause another downward spiral. And if they sold in the bull run, maybe it will still have some effect but it's going to be negligible as the mentality of the investors are very different. We might see some minor corrections, but then there could be a lot of us going after that huge amount of Bitcoin and scope it from El Salvador. We've seen Bhutan who has reported sold 400 or more Bitcoin, but it didn't have that much effect on us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "South Park",
      "created_time": "December 12, 2024, 09:14:03 PM",
      "body": "Quote from: legiteum on December 12, 2024, 08:22:03 PMHas anybody thought of this?El Salvador is a small, very poor country (average monthly income = $365). And they are a democracy. If you are an average citizen of El Salvador, you are probably thinking about the nice things you could get if your government sold all of that BTC at a huge profit (and yes, math: this isn't enough to make everybody there rich or something, but again, this country is a democracy, so...). I know El Salvador doesn't have a large percentage of the total Bitcoin supply, and them dumping it would only be a small bump on the market for a day or two, but I would reckon the psychological effects would be pretty huge. Of course you could argue that they would want to keep their BTC as an investment, given how much money they have already made on it, but why not invest in some other digital currency that has potential gains of 10x more? In other words, what if El Salvador is gripped by... mass-FOMO  .Something to think about...El Salvador government buying and making bitcoin legal tender was huge back then, but circumstances change, with the small supply of coins available to it and how the support for bitcoin seems to be increasing, even if the government sold its coins nothing will happen, besides if this move were to be made now, the effects will be even smaller, since at this time the interest in bitcoin is probably at an ATH and it is unlikely it could diminish even a little if that move were to take place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alpha Marine",
      "created_time": "December 12, 2024, 09:15:43 PM",
      "body": "I've known you to be a person who truly believes Bitcoin is failing and you have never been able to give a valid point why you feel it's failing and other coins and their technology are overtaking it. It was just a few months ago that Germany sold about 50,000btc, by how many per cent did bitcoin dip and how many days did it take before it corrected? I know that you're not a person that gives Bitcoin its credit and that is cool because everybody is entitled to their opinions, but if you must have an opinion, you should use facts. El Salvador holds about 5,900btc so if a nation sold about 50k BTC and nothing happened, how much impact do you think 5900 will have? There's nothing deep to think about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mia Chloe",
      "created_time": "December 12, 2024, 09:16:17 PM",
      "body": "I've actually come to think of these scenarios before and I've noticed the truth is the problem of price drop that occurs is not mainly as a result of big firms selling only rather it's also as a result of FOMO. If you come to think of it, one of our biggest problems is the effect of FOMO and not how often big firms buy and sell. The rate at which scared investors selling off during news like this is what sums up to the effect of big firms selling making the intensity huge.Now back to the question, the fact is what will happen isn't going to be much different from what we see often. Immediately news of them intending to sell circulates, people rush to sell of due to FOMO and also trader rush to analyse for SELL setups and then you have price fall noticeably.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ginsan",
      "created_time": "December 12, 2024, 09:18:24 PM",
      "body": "Nothing will happen apart from El Savador losing its ownership.There will indeed be a slight impact where the market may be a little volatile and bitcoin will lose momentum where the selling power is greater because it is affected by El Savador but it is only temporary and possibly only a few days just like the case that happened for Germany some time ago.But after that nothing will happen where bitcoin will remain the same as before and the only sure loss is El Savador who released its ownership of bitcoin.Market sentiment will definitely follow a little but for a big sustainable impact to be honest I'm not sure so when saying what happens when El Savador releases its bitcoin then indeed in general it will not have any impact for the long term although for the short term it will have a little effect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "December 12, 2024, 09:19:03 PM",
      "body": "I don't think El Salvador has a good motivation to sell BTC. For one, BTC is legal tender there, so it can be spent directly, without the need to sell it. Moreover, Bitcoin is still growing, and El Salvador is probably expecting to benefit significantly from this growth in the future. But if that does happen, I agree that it won't have a major impact on the market. Symbolically, it won't look good. But in practice, we're talking about less than $1 billion worth of funds, which isn't enough for a price shift.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "December 12, 2024, 09:45:53 PM",
      "body": "Quote from: Synchronice on December 12, 2024, 08:34:54 PMDude, are you serious? Absolutely nothing will happen, they hold only 6000 Bitcoins.Yes, I know. I mentioned that in the OP. My question was more about the psychological effects. Quote from: Alpha Marine on December 12, 2024, 09:15:43 PMI've known you to be a person [...]Negative, I am a meat popsicle.Quote from: kryptqnick on December 12, 2024, 09:19:03 PMI don't think El Salvador has a good motivation to sell BTC. For one, BTC is legal tender there, so it can be spent directly, without the need to sell it. Um... what? When spend a currency, you... sell that currency. That is true for any currency. Trading it for some other currency or for some good or service doesn't matter.Also, El Salvador's \"legal tender laws\" don't really make any difference in terms of it's legality there as compared to almost every other country.QuoteMoreover, Bitcoin is still growing, and El Salvador is probably expecting to benefit significantly from this growth in the future. Bitcoin is capped at 21M coins. If you mean it's USD value, then maybe it will grow, or maybe it won't.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odusko",
      "created_time": "December 12, 2024, 10:02:18 PM",
      "body": "Quote from: Charles-Tim on December 12, 2024, 08:36:25 PMEl Salvador should sell bitcoin and buy altcoins. So that the market will react and the price of bitcoin may fall for a day or two. I am not interested to discuss about if El Salvador selling bitcoin than to let you know, that will not stop bitcoin to get to all-time high.About buying altcoins, the country is not gambling but investing on good assets. Not pump and dump coins. How much is El Salvador total Bitcoin worth that can trigger any significant change in the Bitcoin market, I don't believe we get to that level yet, El Salvador still have a long way to go in terms of Bitcoin accumulation and I must say that for a country that adopt Bitcoin as a currency, it means their will need a lot of Bitcoin reserves and build liquidity to have a placement in Bitcoin future trends, so selling off their Bitcoin should be the list on the table Right now, I don't think El Salvador will be willing to sell a bit out of their Bitcoin in the next two to three tenures of government to come, so Nyib the current president have nothing like selling the country Bitcoin on his list of to do in office list.I don't even think that this topic is worth discussing at this point in time, when we know that the level of external control of Bitcoin is quite low and much disregarded because of the many unpredictable Bitcoin market breakouts despite all the external factors pausing a threat to Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ambatman",
      "created_time": "December 12, 2024, 10:02:56 PM",
      "body": "Quote from: Synchronice on December 12, 2024, 08:34:54 PMDude, are you serious? Absolutely nothing will happen, they hold only 6000 Bitcoins. Germany sold 50 000 a few months ago and today we still got the price that's higher than 100K dollars. If I remember correctly, when the Germany sold them, there was a slight dump for a day or two and then price continued bull run. I think he is laying emphasis on the psychological impact. And I believe it would have a temporary impact negatively on the price Because they are like the face of a country taking Bitcoin as a strategic reserve. But once the US does make bitcoin their strategic reserve then they loss that advantage Because they loss that uniqueness they are currently enjoying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "December 12, 2024, 10:14:57 PM",
      "body": "Quote from: legiteum on December 12, 2024, 08:22:03 PMOf course you could argue that they would want to keep their BTC as an investment, given how much money they have already made on it, but why not invest in some other digital currency that has potential gains of 10x more? In other words, what if El Salvador is gripped by... mass-FOMO  .Something to think about...And same digital currency that could also make them lose 10x of their initial capital, right? Because one thing you just need to know while investing in crypto or digital currencies is that while intending to invest in a high volatile currency, let's not forget to always think about the negative and positive aspects of it, because if an asset is able to give you 10x to 20x within a short period of time, don't forget that that's the same way you could lose or win too. Hence, Bitcoin remains the best asset to invest in as a country, as they stand the chance of gaining gradually, which is far more better than keeping money in fiat currency in banks,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Orpichukwu",
      "created_time": "December 12, 2024, 10:35:40 PM",
      "body": "What will happen is nothing new to the market; it will just be another accumulator dumping their bitcoin and taking profit, and those who are not experienced will panic sell due to the fact that they will be calculating who will come next and what actually made them sell out their holdings, and after a short while it will all go back to normal as if such volume was never sold out. It is what it is. Another thing that will also happen is that they will transfer ownership of their holdings to some other investors who are interested in it. They sell, others buy, and like I said, it's nothing new to the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "finaleshot2016",
      "created_time": "December 12, 2024, 11:44:07 PM",
      "body": "Quote from: legiteum on December 12, 2024, 08:22:03 PM/Some people here say there's nothing will happen but let me say this, there will be a massive selling pressure even they're just holding a 6000 BTCs. A slightly market crash will happen because of the selling pressure but of course, because of the current situation in every country, some people/countries will take advantage of it, if they sell, someone will take that smooth dip just to be ahead and make profit. People will worry because some of them is making el salvador as a standard for holding bitcoin and you know that every country that made a bold mode in early BTC is very influential today. If they abandoned BTC and make a fud about it, it can be worse so that's why we need to be updated on every news. Don't belittle things, this is crypto, everything can happen and can caused by single entity and what I'm saying is also applicable to countries like China and US.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "December 13, 2024, 12:19:45 AM",
      "body": "Quote from: CryptoHeadlineNews on December 12, 2024, 10:14:57 PMAnd same digital currency that could also make them lose 10x of their initial capital, right? Maybe. Or maybe make the WIN 10x of their initial capital.QuoteBecause one thing you just need to know while investing in crypto or digital currencies is that while intending to invest in a high volatile currency, let's not forget to always think about the negative and positive aspects of it, because if an asset is able to give you 10x to 20x within a short period of time, don't forget that that's the same way you could lose or win too. Bitcoin can go down, too.QuoteHence, Bitcoin remains the best asset to invest in as a country, as they stand the chance of gaining gradually, which is far more better than keeping money in fiat currency in banks, How do you know this? Based on the performance of the last six months? That could reverse at any time. There's no cosmic law saying Bitcoin will keep going up forever and ever. It could become obsolete and go to zero. Who knows.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "December 13, 2024, 03:02:55 AM",
      "body": "We had experience this before, if El Salvador want to sell their coins, they go for it.German government sold their 50K coins that worth $3.5 Billion at that time it just made Bitcoin price drop from $62K to $55K, the amount German government have is 6x times more in $ than El Salvador who have around 6K coins that worth $600 Million now.I would say if Trump cancel the idea of Bitcoin reserve in the US, the impact would be much bigger than El Salvador sold all of their coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "December 13, 2024, 03:14:26 AM",
      "body": "Quote from: Apocollapse on December 13, 2024, 03:02:55 AMGerman government sold their 50K coins that worth $3.5 Billion at that time[/url] it just made Bitcoin price drop from $62K to $55K, the amount German government have is 6x times more in $ than El Salvador who have around 6K coins that worth $600 Million now.But Germany selling their BTC was pretty normal and expected. El Salvador is totally different, psychologically speaking.QuoteI would say if Trump cancel the idea of Bitcoin reserve in the US, the impact would be much bigger than El Salvador sold all of their coins.Trump could absolutely devastate the price of Bitcoin with even the slightest gesture. 2024 with the year the Bitcoin community connected Bitcoin's future to Trump.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoBuds",
      "created_time": "December 13, 2024, 03:34:07 AM",
      "body": "Quote from: legiteum on December 13, 2024, 03:14:26 AMQuote from: Apocollapse on December 13, 2024, 03:02:55 AMGerman government sold their 50K coins that worth $3.5 Billion at that time[/url] it just made Bitcoin price drop from $62K to $55K, the amount German government have is 6x times more in $ than El Salvador who have around 6K coins that worth $600 Million now.But Germany selling their BTC was pretty normal and expected. El Salvador is totally different, psychologically speaking.El Salvador became famous and respected in the crypto community because they were the first country to accept bitcoin as legal tender. But when it comes to their influence and impact on the market, they cannot be compared to whales like Tesla, Michael Saylor or blackrock because the market relies on the amount of bitcoin they hold to judge their influence. So their selling of bitcoins didn't even get much attention from the community, let alone cause panic, IMO.Bhutan is one of the countries that holds more bitcoin than El Salvador and they have sold bitcoin several times this year but do you see anyone interested or do many people know?Quote from: legiteum on December 13, 2024, 03:14:26 AMQuoteI would say if Trump cancel the idea of Bitcoin reserve in the US, the impact would be much bigger than El Salvador sold all of their coins.Trump could absolutely devastate the price of Bitcoin with even the slightest gesture. 2024 with the year the Bitcoin community connected Bitcoin's future to Trump.But rest assured, his recent moves show that he is serious about bitcoin and the idea of ​​making the United States the crypto hub of the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ale88",
      "created_time": "December 13, 2024, 03:59:50 AM",
      "body": "Quote from: legiteum on December 12, 2024, 08:22:03 PMHas anybody thought of this?El Salvador is a small, very poor country (average monthly income = $365). And they are a democracy. If you are an average citizen of El Salvador, you are probably thinking about the nice things you could get if your government sold all of that BTC at a huge profit (and yes, math: this isn't enough to make everybody there rich or something, but again, this country is a democracy, so...). I know El Salvador doesn't have a large percentage of the total Bitcoin supply, and them dumping it would only be a small bump on the market for a day or two, but I would reckon the psychological effects would be pretty huge. Of course you could argue that they would want to keep their BTC as an investment, given how much money they have already made on it, but why not invest in some other digital currency that has potential gains of 10x more? In other words, what if El Salvador is gripped by... mass-FOMO  .Something to think about...As other users have already pointed out, El Salvador only owns 6,000 bitcoins (give or take), I'm sure that just on this forum there are several users who own way more than that amount so, to answer your question, should El Salvador decide to sell all their bitcoin at once, well, nothing will happen. Absolutely nothing. And the same goes with the citizens, I mean why should they get \"nice things\"? That money won't be distributed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}