{
  "id": "topic_5410375",
  "title": "Korvinius",
  "author": "Korvinius",
  "created_time": "August 18, 2022, 02:15:01 PMLast edit: September 03, 2022, 10:03:50 AM by Korvinius",
  "content": "Anhydriteopened crypto-pyramidsDESCRIPTIONAnhydrite is an ecosystem that combines special software structures, which we call «Opened crypto-pyramids», the AnhyDEX decentralized platform and its own cryptocurrency — a token of the BEP-20 standard with the same name and the symbol ANH.Opened crypto-pyramidsIn Anhydrite, «Open crypto-pyramids» are used for mining new ANH coins, or, in short, Pyramid structures. Such a method of coining is accordingly called Pyramiding and, in this atypical use of NFTs, each pyramid is built from these special NFTs, which also gives uniqueness to their structure and the whole project.Let’s focus separately on Pyramids structures and the Pyramiding method. At first glance, one can make a false conclusion that some «pitfalls» are hidden here, as everyone knows well what a financial pyramid is:QuoteA financial pyramid is a financial structure that raises funds by promising investors super-high returns and pays dividends to early investors with money that comes from new investors.Despite the fact that there are many confirmed cases of fraud, new and new financial pyramids appear and there is always a large number of people who invest in them. The possibility of getting money easily looks attractive and makes people take risks.We decided not to take such risks and not to push our potential investors to take them either, so we took the structure of a financial pyramid and supplemented it with new opportunities and all safeguards that are written in smart contracts and cannot be changed.We managed to do this even better than we expected! As a result, we have turned the «plain evil» into a useful tool that provides an initial boost to the entire ecosystem, and also works as a cost regulator and a method of minting new Pyramiding coins.Anhydrite as a cryptocurrencyAnhydrite (ANH) — is a cryptocurrency with a self-regulating exchange rate that is in accordance with the Binance Coin (BNB) cryptocurrency. This became possible thanks to a new, unique coin minting system, which uses an atypical Pyramiding minting method.Thanks to the peculiarities of this method, the market rate of ANH will always move in parallel with the market rate of BNB to them, which provides interesting opportunities for trading and especially for arbitrage.QuoteWe did not mint hundreds of billions or even trillions of tokens as others do and then «burn» half of the total supply and pretend that they are working for the community and the development of the project, but in fact, holding billions of such tokens in their accounts waiting for the increase in their value.During the deployment of smart contracts, only 60 million ANH coins were created, part of which was transferred to developers as a reward, while the rest was directed to separate accounts and used for the needs of the project. There is no possibility of manual minting of coins, therefore, further minting occurs only automatically and in quantities that are economically justified and calculated according to a special formula. All new coins that are minted are placed in the accounts of «Open Crypto-Pyramids» and distributed by them as a reward for investors. Developers do not have access to these accounts and cannot influence the movement of Anhydrite cryptocurrency.Anhydrite gets additional practical value thanks to the AnhyDEX decentralized exchange platform, profitable farming, staking, tokens of the BEP-20 standard and some new additional features.ConclusionThe Anhydrite ecosystem is designed to have endless, autonomous functioning, which is fixed in smart contracts and cannot be changed or terminated. The owners and developers of the project have no influence on the distribution of values and also do not have access to the finances contained in the smart contract accounts. Since the deployment of the project, the developers become ordinary investors with the same rights and opportunities.For this reason, it can be confidently stated that Anhydrite is not another of the thousand existing tokens, which do not have any ideological or economic basis and that was only created for self-enrichment of the developers.Anhydrite is a complex ecosystem, a project which is designed to break stereotypes and prove that the impossible is possible and that what is often portrayed as «evil» can be turned into a useful and unique tool.Read the full description of the project here:  White Paper (en) | White Paper (ua) | White Paper (ru)CONTACTS:Website: https://anh.ink/Twitter: https://twitter.com/anh_inkFacebook: https://www.facebook.com/anhydrite.inkVK: https://vk.com/anhydriteTelegram: @anh_en | @anh_ua | @anh_it | @anh_es | @anh_ruEmail: support@anh.ink   Smart contracts:Anhydrite (ANH): 0x578b350455932aC3d0e7ce5d7fa62d7785872221Purple Pyramid (ANB): 0x15e584A1527EF01Dd0cF6C1D1d140cD5dE9D65cCGreen Pyramid (ANB): 0xF855294bd9573698380dFC4e25054b2FA9c57E9BYellow Pyramid (ANB): 0x586b3EbCAd926867B3C6329Fa6b1D79A74B50249Orange Pyramid (ANB): 0x0CB3765bC673Ecfc55Fa36Ced05aC83572313e21Red Pyramid (ANB): 0xD44DFd8230cF2A821F76C2B1F0679028ff7c084e",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410375",
  "comments": [
    {
      "author": "Korvinius",
      "created_time": "August 18, 2022, 02:18:19 PMLast edit: August 22, 2022, 12:10:19 AM by Korvinius",
      "body": "",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Korvinius",
      "created_time": "August 22, 2022, 12:10:42 AMLast edit: August 22, 2022, 07:39:44 PM by Korvinius",
      "body": "First CrowdsaleJust a few days ago, our team published an article on the Bitcointalk forum. None of us expected such a fast development of events as a result of this publication.But, the opposite happened and thanks to the interesting and unique idea of the project, its dissimilarity to any of the existing ones, on the same day we started receiving offers from various cryptocurrency exchanges. Currently, there are about ten offers from exchanges, some of them are in the TOP-20 of the CoinMarketCap and CoinGecko ratings. Negotiations are currently underway with the managers of these crypto-exchanges regarding the listing of the Anhydrite cryptocurrency.We did not plan to conduct an “initial coin offering” of Anhydrite, but this situation has changed our plans. Therefore, we decided to conduct the first, limited crowdsale, which will sell only 1 million ANH coins at a price 10 times lower than the one from which it is planned to start listing on centralized exchanges.How to purchase Anhydrite 10 times cheaper than its original cost?We have created a separate, special smart contract. To purchase ANH coins you don’t have to do any special actions, you only need to send any amount of BNB to the address of this smart contract and in return you will receive Anhydrite in the ratio of 1/10000, that is, for example, for 1 BNB - 10000 ANH.But, in addition to this, there is another bonus The Smart contract, which is responsible for distributing Anhydrite, also generates NFTs. For this reason, there are certain conditions for this Smart contract: when transferring to a smart contract address, if the transfer amount is 50, 5, 0.5 or 0.05 BNB, the Investor will additionally receive a special NFT, that is certificate token:50 BNB - GOLDEN FIRST INVESTOR CERTIFICATE5 BNB - SILVER  FIRST INVESTOR CERTIFICATE0.5 BNB - BRONZE FIRST INVESTOR CERTIFICATE0.05 BNB - COPPER FIRST INVESTOR CERTIFICATEIf the payment amount does not match the above, the required amount of Anhydrite will still be transferred to the investor’s address, but he will not receive the NFT certificate.When investing, you need to be careful and make sure that your wallet supports interaction with BEP-20 and BEP-721 tokens, otherwise you will not be able to get Anhydrite cryptocurrency and NFT certificates.These NFT certificates are realized only in the process of the first crowdsale, so their number is limited. Do not miss your chance to receive at least one of these NFTs because in the future, they will be quite valuable collectible tokens!How to invest? Transfer any amount of BNB to the Anhydrite First Fundraising Campaign (AFFC) smart contract address: 0x547Fc8bF64B80A2CE8391b91F2Ba8bF259d95Db8. In return you will receive Anhydrite cryptocurrency in your wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "M4DD",
      "created_time": "August 22, 2022, 08:36:35 PMLast edit: August 22, 2022, 08:46:57 PM by M4DD",
      "body": "Just bought the bronze one, already in my wallethttps://ibb.co/DLbbx8H",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MMOStars",
      "created_time": "August 30, 2022, 08:25:47 PM",
      "body": "Can I get a Super Bitconnect First Timer package please?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Korvinius",
      "created_time": "September 03, 2022, 09:56:17 AM",
      "body": "Our first Airdrop for the total amount of 2 million ANH is underway!Go to https://anh.ink/news#airdrop",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Korvinius",
      "created_time": "September 05, 2022, 03:05:57 PM",
      "body": "Information updates on BscScanWe have got some changes on BscScan. We update the information about the project, added the ANH icon, links to social media and the general description. From now on, our project can fully be considered unique! We have taken another step that brings Anhydrite closer to success!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Korvinius",
      "created_time": "September 12, 2022, 12:02:28 PM",
      "body": "We suggest everyone who wants to get Anhydrite for free to invite their friends or acquaintances to our discord server.Just create your own invitation link and distribute it https://discord.gg/mVwSkPpUQh, our bot keeps track of everyone who comes through your links. For each invitee that stays in our channel, you will receive ANH coins.Payments for the invitation will be made on the 30th of each month",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jovan85",
      "created_time": "September 13, 2022, 08:08:57 PM",
      "body": "Can you explain what exactly means : \"new, unique coin minting system, which uses an atypical Pyramiding minting method.\"And also :Purple Pyramid ,Green Pyramid, Yellow Pyramid, Orange Pyramid, Red Pyramid. What is the basic difference?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Korvinius",
      "created_time": "September 13, 2022, 08:20:14 PMLast edit: September 13, 2022, 08:43:54 PM by Korvinius",
      "body": "Quote from: jovan85 on September 13, 2022, 08:08:57 PMCan you explain what exactly means : \"new, unique coin minting system, which uses an atypical Pyramiding minting method.\" View WhitePaper namely TECHNICAL BLOCK - Anhydrite Cryptocurrency, Pyramids in the Anhydrite, Functions which change the blockchain. There will be difficulties, ask, I will answer.Quote from: jovan85 on September 13, 2022, 08:08:57 PMAnd also :Purple Pyramid ,Green Pyramid, Yellow Pyramid, Orange Pyramid, Red Pyramid. What is the basic difference? WhitePaper ECONOMIC BLOCK - it tells about the differences between the pyramids",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}