{
  "id": "topic_5473711",
  "title": "TheGitch",
  "author": "TheGitch",
  "created_time": "November 11, 2023, 01:28:58 PM",
  "content": "Hi everyone,I imported a bitcoin private key in Electrum and the balance is still 0 sats. I did the procedure many times, following the official documentation (link below) and the balance is still 0. https://bitcoinelectrum.com/importing-your-private-keys-into-electrum/I imported the public adress to create a \"watch only\" wallet, still in Electrum, and my balance is actually displayed. The public adress does contain some sats, for sure. I even confirmed this by importing my private key (the same one) in Bitcoin Core and it works perfectly.I'm using the portable version of Electrum, v 4.4.6 (latest).What am I missing ?Thank you in advance for your help",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473711",
  "comments": [
    {
      "author": "Zaguru12",
      "created_time": "November 11, 2023, 01:31:08 PM",
      "body": "Probably because you didn’t follow the instructions properly to prepend the address or specify the address type you want it to reflect. From the link you provided it possible you didn’t follow the 3rd instruction because it is the most important Thing there. Importing just the private key might have displayed just the legacy address (address starting with 1) and whereas the bitcoin is on another address type. That’s why when you import the address only it reflected. If it is a native segwit address put p2wpkh before the private key or click the info button to see more information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "November 11, 2023, 01:48:42 PM",
      "body": "Which character does the bitcoin address starts from? Is it 1, 3 or bc1?Use this format:For address that start from 1, paste:Quoteyour private keyOrQuotep2pkh: your private keyFor address that start from 3, paste:Quotep2wpkh-p2sh: your private keyFor address that start from bc1, paste:Quotep2wpkh: your private key",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheGitch",
      "created_time": "November 11, 2023, 01:56:20 PM",
      "body": "Quote from: Zaguru12 on November 11, 2023, 01:31:08 PMProbably because you didn’t follow the instructions properly to prepend the addressThat's exacty that. My bad. The import works perfectly. Thank to both of you for your help.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}