{
  "id": "topic_5406806",
  "title": "xzone",
  "author": "xzone",
  "created_time": "July 19, 2022, 07:56:37 AMLast edit: July 19, 2022, 08:31:38 AM by xzone",
  "content": "Ekonomimiz çok iyiye gidiyorken, ülke son yılların en büyük şahlanmasını yaşıyorken artan trafik sigortası ve kasko fiyatları da müthiş bir hızla yükseliyor.Son 1 yıl içerisinde araç fiyatlarında şöyle bir artış yaşadık:Örnek olması için herhangi bir gelişmiş ülkede araba kullanmayı yeni öğrenen 20 yaşında bir gence babası tarafından hediye edilen bir araç modelini ele alalım.2021 yılında Polo 1.0 TSI 95 PS DSG Comfortline 196.900 TL'den satılıyordu. Bu sene benzer bir paket olarak Polo 1.0 TSI 95 PS DSG Life 569.700 TL'den satılıyor. Ortalama 3 katlık bir fiyat artışı mevcut.Bu hesaplamayı yaparken elbette döviz kurunun artış miktarını göz önüne almak gerekir. Şimdi de trafik sigortası ve kasko fiyatlarını ele alalım.2021 yılında 820 TL'den yaptırılan trafik sigortası bu sene 1995 TL'ye yaptırılıyor. Kasko 920 TL'ye yapılıyorken bu sene çıkan en düşük fiyat 3565 TL. Trafik sigortası 2.5 kat artmışken kasko yaklaşık olarak 4 kat artmış. Araç fiyatlarındaki artış ise yaklaşık 3 kattı.Yıl geçtikçe hasarsızlık indirimi artması gerekiyor ve sürücü risksiz grupta yer almaya başlıyorken kaskonun bu kadar yüksek bir oran ile artması sizce normal mi? Aranızda maaşına 4 kat zam alan var mı? Sizin kasko ücretleriniz ne kadar çıktı?Bu arada 2 gün önce yapılan kabine toplantısında da şöyle bir şey konuşuldu QuoteEsasen ulaştırma yatırımlarımızın ülkemize ve milletimize katkısını ifade etmek için sadece şu rakamlar bile yeterlidir: Son 20 yılda ülkemizdeki araç sayısı, hani diyorlar ya ekonomik durum şöyle, ekonomik durum böyle, 8,5 milyondan, -araç sayısı veriyorum dikkat edin- 26 milyona çıkarak 3 kat artmıştır. Hani ekonomik sıkıntıdan bahsediyordun. Bakın rakam ortada, bu kadar korkunç bir rakama ulaşmış ve şu anda otomobil satış yerlerinde birinci el otomobil dahi bulmakta sıkıntı çekiyorlar ve ikinci elle işi idare etmeye çalışıyorlar.Kaynak: https://www.tccb.gov.tr/haberler/410/138752/-ogrenim-kredisi-geri-odemeleri-herhangi-bir-enflasyon-farki-veya-faiz-uygulamasi-olmaksizin-sadece-alinan-kredi-uzerinden-yapilacak-Bir taksicinin serzenişini okumuştum, sigorta 6000 lira kasko ise 19 bin lira çıkıyordu Egea aracı için. Ne kadar doğrudur bilemiyorum Edit: Konuyu okurken müzik dinlemek isteyenler için link: https://youtu.be/U3BU9i0SQRE",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406806",
  "comments": [
    {
      "author": "husdemba",
      "created_time": "July 19, 2022, 08:33:29 AM",
      "body": "Daha dün trafik sigortası ve kasko yaptırdım, lanet olsun diyip geçen seneyle kıyaslamamıştım. Şimdi açıp baktığımda görüyorum ki 416 lira olan trafik sigortam 1515 liraya, 946 lira olan kasko bedeli de 3300 liraya çıkmış. 2010 model hatchback bir arabadan bahsediyoruz. Sona iliştirdiğiniz cumhurbaşkanı açıklamasına artık söz diyecek mecalim kalmadı. İnsanların aklıyla dalga geçmeye devam ediyorlar. Ha ‘Kasko yaptırma o zaman?’ diyecekler varsa aracın en ufak bir parçasının maliyeti zaten 5000 liradan başlar. ‘Araç kullanma’ diyenler de olur. E ölelim o zaman ne diyeyim..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "July 19, 2022, 08:47:15 AM",
      "body": "Bu gidişle iki üç seneye trafikte kaskolu araç göremeyeceğiz. Yaşı 5’e kadar olan araçlar yine bir şekilde başına bir şey gelirse diye kasko yaptırıyor ama 10 yaşındaki arabalara 9-10 bandında kasko çıkıyor. Ben en son yaptırdığımda sigorta kasko 13 civarı rakam çıktı üstelik hasarsızlık indirimi de var. Bunun üç buçuğa yakını sigorta kalanı kasko. Kaskoyu ertelemek zorunda kaldım. Trafikte kaskosuz araçlar artıyor bence. Bu da cebimize maliyet olarak yansıyacak. Parça fiyatları arttı kabul ediyorum ancak yaşı büyük araçların kaskolarına ayrı hesaplama getirmeleri gerekiyor. Her ay %2.5 zam geliyor zaten. Arabanızı trafikte kurallara uyarak kullanın yüksek hızlardan kaçının. Kaskosuz araç o kadar fazla ki başımıza bir şey gelmez umarım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "July 19, 2022, 10:07:24 AM",
      "body": "Geçenlerde gördüm bmw'nin farları 65 bin lira olmuş örnek : https://bmgotomotiv.com/bmw-f32-lci-adaptive-led-far-takim-63118738707-63118738708-yeni-orjinal,483374.htmlbaşka bir önrmek : https://www.n11.com/urun/honda-civic-fc5-2017-2019-lamborghini-style-led-far-seti-lam-t-9612148Böyle bir ortamda sigorta fiyatlarının 10 kat artmaması bile çok iyi sayılır  basit bir farın 20 binliradan başlıyor olması doğal olarak bu fiyatları yukarı alacak sonuçta bunun işçiliğide olacak.Sanırım sıfır araçların kaskosu 15binden başlıyormuş çok normal.Normal olmayan bizim kazançlar.1 Milyonluk araçlara binmekte sıkıntı arkadaş başına birşey gelse aldın başa belayı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "July 19, 2022, 10:29:05 AM",
      "body": "Paramız değersizleştiği için bize her şey pahalı geliyor olayın aslı budur aslında. Sonuç olarak araç fiyatlarıda aşırı yükselince kasko değerleride artıyor. 2 Yıl önce aracımın kasko değeri 230-250 bin liraydı şimdi 650 bin olmuş geçen yıl indirimli olarak 3. kez kasko ve sigorta yaptırmıştım toplamda 2600 TL tutmuştu ekim ayında yaptırmıştım. Hasarsızlık indirimim devam ediyor 3 ay sonra bana nasıl bir fiyat çıkaracaklar emin değilim şimdiden birikim yapıp o dönemide kolay atlatmayı planlıyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bobita",
      "created_time": "July 19, 2022, 11:30:32 AMLast edit: July 19, 2022, 10:06:05 PM by bobita",
      "body": "Trafik ve özellikle kasko uçtu ama bunu \"....mın sigortacıları..\" diye açıklamak doğru değil, hemen belirteyim sigorta sektörüyle alakam yok ve geçen ay bir önceki yıla göre üçe katlayan (üstelik hasarsızlık indirimiyle) kaskonun acısını hala hissediyorum.Ancak yukarıda mandown örneğini vermiş, araç fiyatlarıyla beraber parça fiyatları da uçtu, sadece lüks markalar değil, hepsi için geçerli bu durum ve üretücüler oran olarak maliyetteki artışın çok üstünde arttırdılar fiyatları, dolayısıyla sigortalar da uçtu. Kendimden örnek vereyim, aracım kaskoluyken herhangi bir şey olduğunda yan sanayi parça istemem mesela, böyle olunca da hasar maliyetleri alıp başını gidiyor, doğal olarak da prime yansıyor. Ucuz kaskolar var ama ne ka ekmek, o ka köfte.Ayrıca şanlı milletimizin dünya ortalamasının üzerindeki sigorta üçkağıtlarının bedelini de aracını korumak isteyen enayiler olarak biz ödüyoruz.Bütün bu yazdıklarımdan sigorta firmaları mağdur sonucu çıkmasın, ama bizler doğrudan onlarla muhatap olduğumuz için günah keçisi olarak sadece onlara saldırıyoruz.Bazıları d(iye)emiyorlar ki, ülke yıllardır leş gibi yönetiliyor, eğitim, üretim, adalet kalmadı, azalan kaynakların çoğu hırsız siyasilerin cebine gidiyor, parasızlıktan elin götü boklu arabından para dileniyoruz ve bunlar daha iyi günlerimiz.Yani ektiğimizi biçiyoruz !!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "verbakalim",
      "created_time": "July 19, 2022, 03:00:44 PM",
      "body": "Geçen sene yapılmış olan ve halen süresi mevcutta var olan sigortalar içinde karşı tarafın hasarını karşılama klozu ve değerlerini kontrol ediniz. Geçen seneki bu değerler 50 bin ile 150 bin arasında değişiyor. Yeni değerler 750 binden başlıyor sanırım. Yani hasarlı bir kazaya karıştınız ve suç sizde. Karşınızdaki araç diyelimki mercedes. İşlem sonrası adam sizden değer kaybı istiyor sigorta eski orandan size ödeme yapıyor siz de üstünü cebinizden karşılıyorsunuz. Neden mi. Bir mercedes in bir kapısının sadece boyadan dolayı değer kaybı 350 bin tl den başlıyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "July 19, 2022, 03:19:30 PM",
      "body": "Aklıma gelmişken iki kelamda ben edeyim.Arkadaşlar sadece karşı tarafa ödeme yapan ve çekici hizmeti veren kasko seçenekleri var. Kasko yaptıramıyorsanız hadi kendi malınızı koruyamıyorsunuz bari karşıda oluşacak masraflar başınıza iş açmasın bu kasko tipi 600tl den mı ne baslıyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "July 19, 2022, 03:29:00 PM",
      "body": "Bir araç sahibi olmanın masrafları bu kadar fazla olamaz, iki sene önce aracımla vedalaşmak zorunda kaldım bir yandan şu rezaletlere bakınca iyiki de çıkarmışım diyorum. Sigortası, kaskosu ve mazotu derken arac sahipleri sadece arabaya calışacak duruma geldi. Kasko fiyatlarının çok fazla arttığını biliyordum fakat 4 katı nedir hocam ya bu fiyatlarla yakında kasko yaptıran kalmaz. Araçların yedek parça fiyatları da inanılmaz pahalı kasko yaptırsan yaptırmasan büyük ikilem..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "July 19, 2022, 04:08:46 PM",
      "body": "herkes artık milyonluk arabalara biniyor, doğal olarak sigorta masraflarının artmasında anormal bir durum yok. kaza geçmişi, sigortalılık süresi (bu da etkili diye biliyorum.), yaş, meslek, kaçıncı araba, şehir gibi bir sürü etmene bağlı olarak primler değişiyor. arabanın fiyatından bahsetmedim. kasko için mutlaka birden fazla yerden teklif alınız. ben mayıs başında yaptırdığım kaskonun aynısını birkaç gün sonra 2.000 lira daha ucuza buldum. dandik firma da değil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "July 19, 2022, 04:25:55 PM",
      "body": "Daha yeni yaptırdım, geçen sene 840 lira verdiğim trafik sigortasına bu sefer 2436 lira verdim. Benim maaşım 2 katı bile artmadı ama hayatımızda zorunlu olan kalemlerden sadece bir tanesindeki artışa bakın.Bu hale düşmemizin asıl sorumlularıyla, makul oranda artış yapmayan her kurum ya da şahıs benim gözümde içinde bulunduğumuz durumun mimarlarıdır.Kimlerin sorumlu olduğunu, ülkeyi bu hale kimlerin sürüklediğini biliyoruz oraya değinmeyeceğim artık.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "judas",
      "created_time": "July 19, 2022, 08:05:33 PM",
      "body": "Araç sahiplerinin kanayan yarası oldu bu konu gerçekten de. Zaten artık arabaya rahatça benzin koymak bile iyice zor hale gelmişken araba durduğu yerde bile sırf yük olmaya başladı. Artık o kadar fazla kişiyi görüyorum ki artık arabasını sırf bu yüzden satmayı düşünen ve hatta satan. Araba sahibi olmanın tam olarak bir lüks haline gelmesi için her şey yapılıyor adeta.Son 20 yılda araç sayısının katlanması konusu da ayrı garip bir olay. Her şeyi geçtim insanların nüfusu bu kadar yıl içerisinde ne kadar arttı ve ayrıca şu anki araç sahiplerinin çok büyük bir kısmı kaç senelik araçlara biniyorlar. Zamanında araba almak çok daha rahatken arabasını alanlar artık piyasayı gördükten sonra elindekini tutma amacındalar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "July 19, 2022, 08:29:03 PM",
      "body": "Geçen seneye göre sigorta ve kasko üç dört kat civarı arttı ama yaptırmıyorum deme şansınız yok çünkü 600 binlik araba 1 milyon oldu. Kaza yapsan gidip dışarıda özel servise götürmek hiç mantıklı değil artık onlarda da fiyatlar uçtu. Mecburen ödüyoruz çünkü arabanın başına bir şey gelse zarar çok daha büyük olur.Ben Mayıs ayında yeni zamlar gelmeden yenilemiştim 1198 TL trafik sigortası, 4500 TL civarı kasko bedeli ödedim. Araç yaş aldı diye kaskonun yıllar içinde düşmesi gerekiyorken zamlar yüzünden fiyatlar katlamaya devam ediyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "July 19, 2022, 09:07:51 PM",
      "body": "Ülkemizde her şey her geçen gün daha da kötüleşiyor ve buna hiçbirşey yapamıyoruz. Bu fiyatlar dünden pahalı yarından ucuz ancak olmaması gereken noktada fiyatlar bunlar abi. Elin amerikasında çocuk gitsin mustange binsin bizim ülkede çocuklar en fazla belediye otobüsüne metroya tramvaya binsin. Koyar abi bu fiyatları vermek cidden. Şuan öyle bir bıktım ki toplu taşıma araçlarını kullanmaktan ancak bu parayı bunlara yedirmek daha ağırıma gidiyor. Bu hükümet vatandaşına hayatını yaşatmamaya ant içmiş galiba.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "onko",
      "created_time": "July 19, 2022, 10:19:25 PM",
      "body": "17k tl kasko çıktı (sıfır kaza geçmişi, ev hanımı üzerine olan bir araç) ve ödemedim.kasko yok muska var, hadi buyrun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "July 20, 2022, 05:31:05 AM",
      "body": "Quote from: onko on July 19, 2022, 10:19:25 PM17k tl kasko çıktı (sıfır kaza geçmişi, ev hanımı üzerine olan bir araç) ve ödemedim.kasko yok muska var, hadi buyrun.17 bin lira 1 senelik kasko bedeli mi uçmuş bunlar ya bende kasko yaptırmayı düşünüyordum bu sene araca benim eski araca herhalde 5-6 bin lira kasko çıkar sizin araç kaç model hocam sanırım yeni modellere daha fazla kasko bedeli çıkıyor kasım ayı gibi sigorta zamanı geliyor herhalde sigorta uçar",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "July 21, 2022, 10:50:49 AM",
      "body": "Araç sigorta fiyatları çok yükselmedi de kasko fiyatları resmen tavana gidiyor. Aracın fiyatına göre 40 bin lira civarında da kasko yaptıranların var olduğunu duydum. Yakında MTV için de bir düzenleme gelip daha da artarsa şaşırmayın arkadaşlar. Eski dönemdeki araba sayısıyla şimdiki araba sayısını kıyaslayıp gelişmişlik ölçülüyor burada.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "July 21, 2022, 11:47:18 AM",
      "body": "Maaşına 4 kat zam alan kimse yoktur ama sigortasına, kaskosuna 4 kat fiyat veren herkes oluyor, araç Polo olmasına rağmen yüksek bedeller çıkıyor, daha yüksek olan kısımda yer alan arabaların fiyatlarını tahmin bile edemiyorum, kasko yaptırmayıp dua edeceğimiz zamanlar geliyor, sigortayı mecburen yine yaptıracağız,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bobita",
      "created_time": "July 21, 2022, 11:03:00 PM",
      "body": "Benim fikrim ne kadar artarsa artsın kasko ipe ipe yaptırılacak şeklinde. Çünkü iş sadece senin arabanla ilgili değil, haydi onun riskini aldın veya Allaha emanet ettin, bir kazada kusurlu çıkarsan ve karşı tarafta ciddi hasar olursa ne yapacaksın, zorunlu sigortanın vereceği 50-100 bin ile mi çözeceksin? Öyle Mercedes vb gibi lükslere de gerek yok, herhangi bir markanın yaşı küçük arabasını dağıtırsan yüzbinlerce lira mali mesuliyet çıkacak, belki kendi aracını satsan da karşılayamayacaksın, (rakamı atıyorum) onbin lira vermemek için üçyüz beşyüzbin liranın riski alınır mı?Ben kendi ruh halimi yazayım, araba fiyatları o kadar kudurdu ki kasko yenilerken ilk düşündüğüm olası kusurlu olduğum bir kazada karşı tarafın mesuliyeti haşırt the blackboard şeklinde girerse ne yapacağımdı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "July 22, 2022, 04:24:55 AM",
      "body": "Quote from: bobita on July 21, 2022, 11:03:00 PMBenim fikrim ne kadar artarsa artsın kasko ipe ipe yaptırılacak şeklinde. Çünkü iş sadece senin arabanla ilgili değil, haydi onun riskini aldın veya Allaha emanet ettin, bir kazada kusurlu çıkarsan ve karşı tarafta ciddi hasar olursa ne yapacaksın, zorunlu sigortanın vereceği 50-100 bin ile mi çözeceksin? Öyle Mercedes vb gibi lükslere de gerek yok, herhangi bir markanın yaşı küçük arabasını dağıtırsan yüzbinlerce lira mali mesuliyet çıkacak, belki kendi aracını satsan da karşılayamayacaksın, (rakamı atıyorum) onbin lira vermemek için üçyüz beşyüzbin liranın riski alınır mı?Ben kendi ruh halimi yazayım, araba fiyatları o kadar kudurdu ki kasko yenilerken ilk düşündüğüm olası kusurlu olduğum bir kazada karşı tarafın mesuliyeti haşırt the blackboard şeklinde girerse ne yapacağımdı.Sende haklısın abi mecburen kaskoyu ipe ipe yaptıracağız bugün olmasa da yarın başımıza bir sıkıntı gelirse en azından götü kurtarmış oluruz kaskoyla bu araba fiyatları arttı diye 1 yıllık kaskolar da uçmuş ama baksana kasko yerine muska sistemine herkes geçiş yapmış bir de benim eski arabanın kaskosuna baktıralım ne kadar diyecekler",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}