{
  "id": "topic_5457355",
  "title": "bitstonps",
  "author": "bitstonps",
  "created_time": "June 23, 2023, 09:05:00 PM",
  "content": "Hey Bitcointalk members.,I'm facing a problem with the Bitcoin Wallet (beta) on my Android device, which I downloaded from the Play Store. However, I'm here seeking help from the community, as I'm trying to assist a friend who's experiencing this issue.We want to  export the private key from the Bitcoin Wallet. We've managed to export the backup file and extract the seed phrase successfully.(openssl) The trouble arises when we attempt to import the seed phrase into Electrum and detect an existing account. Unfortunately, every time we try, we're met with the frustrating message \"No account exists!\". We have changed the path and all the parameters.Now, here's where it gets interesting. The Bitcoin addresses within the wallet are segwit addresses, \"bc1q\". All transactions are visible on these addresses without any problems -(Mobile). In an effort to resolve the issue, we've useed the Coleman BIP39 tool, using the m/84 path (bip84). Surprisingly, the tool generates different addresses that have never been used.To investigate further, we compared the legacy addresses (starting with \"1\") within the wallet app to the bip32 addresses on the tool, and they match perfectly. (which means that there is no problem with the seed and it is correct) However, when it comes to the segwit addresses, the correct ones don't show up. We've scoured the web for specific paths to try, but none of our attempts have been successful. Even when importing the wallet backup file onto another device, we encounter the same data as on the initial device.The only information we can gather from the app is the extended public key, which starts with \"z\".I'm reaching out to this community in the hopes of finding a solution to this problem and retrieving the correct used addresses. Any help or guidance would be immensely appreciated.Thank you all in advance for your support.Best regards,",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457355",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "June 23, 2023, 09:13:34 PM",
      "body": "Not all wallets are using the standard BIP39 derivation paths. Such wallets should be avoided.I checked Playstore and looked for Bitcoin wallet (beta) but I did not see it. If you are on the install page of the wallet on Playstore, you will see three dots at the upper right corner, click on it, you will see the share link. Post the share link on this thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitstonps",
      "created_time": "June 23, 2023, 09:50:28 PM",
      "body": "Quote from: Charles-Tim on June 23, 2023, 09:13:34 PMNot all wallets are using the standard BIP39 derivation paths. Such wallets should be avoided.I checked Playstore and looked for Bitcoin wallet (beta) but I did not see it. If you are on the install page of the wallet on Playstore, you will see three dots at the upper right corner, click on it, you will see the share link. Post the share link on this thread. Thabk you Charlee for the response Here is the link for the wallet from bitcoin orgplaystorehttps://play.google.com/store/apps/details?id=de.schildbach.wallet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "June 23, 2023, 10:04:35 PMLast edit: June 23, 2023, 10:18:46 PM by Charles-Tim",
      "body": "I have tested this wallet before. I do not like the wallet because it does not support seed phrase backup. The best you can do is to use the backup of the wallet to recover your coins. I mean the file backup. You can wait for other people to respond about the issue.It would have been good if seed phrase is not included but the option to backup the file without no encryption, but that is not possible on the wallet because the file backup has to be encrypted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitstonps",
      "created_time": "June 23, 2023, 10:06:59 PM",
      "body": "Quote from: Charles-Tim on June 23, 2023, 10:04:35 PMJ have tested this wallet before. Indio not like the wallet because it does not support seed phrase backup. The best you can do is to use the backup of the wallet to recover your coins. I mean the file backup. You can wait for other people to respond, maybe they can give you a guide to how to recover the wallet using seed phrase.I was able to get the correct seed ( 12 words) and I have tested using ian tool for BIP39 and it works and it shows the correct addresses for Legacy but not for the segwit (bc1q)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "June 23, 2023, 10:14:44 PM",
      "body": "Quote from: bitstonps on June 23, 2023, 10:06:59 PMI was able to get the correct seed ( 12 words) and I have tested using ian tool for BIP39 and it works and it shows the correct addresses for Legacy but not for the segwit (bc1q) Try and check for more than 20 addresses on iancoleman to know if you will find the address that you are looking for. You mean the wallet is not following the P2WPKH derivation path. Maybe, or maybe not. I do not know how to extract the seed phrase. I would have tested it and see if you are correct. Wait for others to comment. Hopefully other people can test that out. But I wonder the type of issue you or your friend has but not able to use the file backup directly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitstonps",
      "created_time": "June 23, 2023, 10:27:35 PM",
      "body": "Quote from: Charles-Tim on June 23, 2023, 10:14:44 PMQuote from: bitstonps on June 23, 2023, 10:06:59 PMI was able to get the correct seed ( 12 words) and I have tested using ian tool for BIP39 and it works and it shows the correct addresses for Legacy but not for the segwit (bc1q) Try and check for more than 20 addresses on iancoleman to know if you will find the address that you are looking for. You mean the wallet is not following the P2WPKH derivation path. Maybe, or maybe not. I do not know how to extract the seed phrase. I would have tested it and see if you are correct. Wait for others to comment. Hopefully other people can test that out. But I wonder the type of issue you or your friend has but not able to use the file backup directly.The issue that we have is that we want to import that wallet on ele.. and pump the fee for a transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "June 23, 2023, 11:33:10 PM",
      "body": "Quote from: bitstonps on June 23, 2023, 10:06:59 PMI was able to get the correct seed ( 12 words) and I have tested using ian tool for BIP39 and it works and it shows the correct addresses for Legacy but not for the segwit (bc1q) Have you checked the derivation path on the Iancoleman tool under \"BIP32 Derivation Path\" that's the correct derivation path that you need to use when importing the BIP39 seed into Electrum to get the correct legacy wallet.Also, in derived addresses on the left side, it should show the path of your BTC address and what derivation path your BTC address belongs. Look at the image below as a referenceOr alternatively, export the private key since you said you get the correct wallet using iancoleman then export the private key from that tool and import it to Electrum. Make sure that you use this tool on an offline PC or else it's not safe anymore to reuse that wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitstonps",
      "created_time": "June 23, 2023, 11:39:45 PM",
      "body": "Quote from: BitMaxz on June 23, 2023, 11:33:10 PMQuote from: bitstonps on June 23, 2023, 10:06:59 PMI was able to get the correct seed ( 12 words) and I have tested using ian tool for BIP39 and it works and it shows the correct addresses for Legacy but not for the segwit (bc1q) Have you checked the derivation path on the Iancoleman tool under \"BIP32 Derivation Path\" that's the correct derivation path that you need to use when importing the BIP39 seed into Electrum to get the correct legacy wallet.Also, in derived addresses on the left side, it should show the path of your BTC address and what derivation path your BTC address belongs. Look at the image below as a referencehttps://i.ibb.co/LnW07ZP/Screenshot-20230624-072952-Chrome.jpgOr alternatively, export the private key since you said you get the correct wallet using iancoleman then export the private key from that tool and import it to Electrum. Make sure that you use this tool on an offline PC or else it's not safe anymore to reuse that wallet.Hi there,I appreciate your response. Just to clarify, the legacy addresses in the Bitcoin wallet app are functioning correctly. I have verified this by cross-checking them with the results from the tool, and they match perfectly.However, the issue arises with the segwit addresses (starting with \"bc1q\"). Unfortunately, these segwit addresses do not align between the Bitcoin wallet app and the tool. This becomes significant as the funds are currently held in these segwit addresses.If there are any further insights or suggestions you can provide to help resolve this matter, I would greatly appreciate it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "June 23, 2023, 11:55:29 PM",
      "body": "Quote from: BitMaxz on June 23, 2023, 11:33:10 PMHave you checked the derivation path on the Iancoleman tool under \"BIP32 Derivation Path\" that's the correct derivation path that you need to use when importing the BIP39 seed into Electrum to get the correct legacy wallet.BIP32 defines the path to HD wallet. Legacy address derivation path is different.BIP32: m/0' for path to HD walletBIP44: m/44'/0'/0' for path to legacy addressesWhat he needs is BIP84: m/84'/0'/0' for native segwit, but he said the keys and addresses are different, while the same for legacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "June 24, 2023, 12:04:36 AM",
      "body": "Quote from: bitstonps on June 23, 2023, 11:39:45 PMI appreciate your response. Just to clarify, the legacy addresses in the Bitcoin wallet app are functioning correctly. I have verified this by cross-checking them with the results from the tool, and they match perfectly.However, the issue arises with the segwit addresses (starting with \"bc1q\"). Unfortunately, these segwit addresses do not align between the Bitcoin wallet app and the tool. This becomes significant as the funds are currently held in these segwit addresses.If there are any further insights or suggestions you can provide to help resolve this matter, I would greatly appreciate it.Ok, So what you want to recover is the native segwit that starts with \"bc1q\".Have you ever tried other ways to decrypt the backup file you can maybe able to decrypt it that only includes a private key?Here's the method that I want you to try \"[HOW-TO] Export Bitcoin private keys (in WIF) from Bitcoin Android (schildbach)\"This method only dumps private keys after decrypting the wallet backup from OpenSSL.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "June 24, 2023, 05:54:57 AMLast edit: June 24, 2023, 06:35:03 AM by nc50lc",
      "body": "Quote from: bitstonps on June 23, 2023, 09:05:00 PMThe trouble arises when we attempt to import the seed phrase into Electrum and detect an existing account. Unfortunately, every time we try, we're met with the frustrating message \"No account exists!\". We have changed the path and all the parameters.For your next attempts, consider the paths and script type combinations listed in the code below \"already tried\"since those are the derivation paths tested by using \"Detect Existing Accounts\".Link: github.com/spesmilo/electrum/blob/master/electrum/bip39_wallet_formats.json#L1By using that button, you've basically tried all standard and some non-standard derivation paths at account index 0 (and above if '0' is used).Your wallet must have its own unique Native SegWit derivation path that isn't in that list;or the SegWit wallet that you want to restore is at the second account index while the first isn't used yet.--update--I've been testing the app myself and figured out the SegWit derivation path to use in iancoleman's BIP39 tool:Do the same steps up to the derivation path selection.Now, go to \"BIP141\" tab.Change the derivation path into m/1'/0Then the script semantics into P2WPKHYour keys and SegWit addresses should be listed below.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}