{
  "id": "topic_5445311",
  "title": "btfoam",
  "author": "btfoam",
  "created_time": "March 17, 2023, 06:37:59 PM",
  "content": "I have run data analysis over millions of bets on this website.My conclusion - particularly compared to other casinos - is the house runs a subtle algorithm in place to manipulate the odds unbeknownst and against the customer. Below I have attached a screenshot of a loss I incurred today, but which also seems to happen on a regular basis.https://cdn.discordapp.com/attachments/1074147517266141215/1086356540040171631/lolwolf.pngI posted the last 29 bets, however there were 100 previous ones, so the odds are exponentially even lower than 0.0042%.Out of 29 bets of 50/50, only 4 hit below the 50 mark ❤️Effectively, whilst my bankroll moves up on other sites. On wolf.bet I'm habitually in red over multiple fronts spanning weeks of testing... It seems implausible, and impossible to surpass the house edge. To contrast my bets with other casinos, the occurrence on wolf.bet of such scenarios, is approximately 470% higher.I thought I would give the benefit of doubt, but just find myself laughing in disbelief and finally decided to report my own experience and findings.If you would like to view the data (over 4 million bets) you can message me.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445311",
  "comments": [
    {
      "author": "yahoo62278",
      "created_time": "March 17, 2023, 06:53:53 PM",
      "body": "Are the whole 4 million bets at x2? Did you change the seed during these 4 million bets? All on dice? I think we need more information if you are going to accuse a casino of manipulating their customers. Not calling you a liar, I would just like more data is all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btfoam",
      "created_time": "March 17, 2023, 07:56:22 PM",
      "body": "I've analysed my data and provided a sample.The onus shouldn't lie solely on the customer for evidence. Casinos need to start being more transparent and audited too.Look at the image I posted, I can count with one hand the times I've reached over 40% without a hit, and all of them seem to happen on wolf.bet.As a result I've had to drastically lower my stakes, only for this casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btfoam",
      "created_time": "March 24, 2023, 02:56:17 PM",
      "body": "Incurred another number of patterns again.No other dice site comes close to this.So their RNG algorithm is either accidentally skewed or purposefully rigged.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "March 24, 2023, 03:09:12 PM",
      "body": "So according to you wolf.bet is a scam, and primedice is a scam.And then you show a very small snip of your logs to prove a point.Put up or shut up as they say. There are legit scam casinos, but coming in with no real proof and accusing 2 that have only minor complaints vs others over the years is not going to get a lot of traction here.BUT we are supposed to believe the pump and trade bot that you sell is 100% legit: https://bitcointalk.org/index.php?topic=5326454   /  https://archive.is/6gsoV -Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kirito89",
      "created_time": "March 24, 2023, 03:48:14 PM",
      "body": "Since Wolfbet's dice game is also provably fair, that more or less means that results are set in stone regardless of your bet amount, payout, the moment you start gambling on a new seed.From what I see you weren't actually chasing a 2x multiplier and instead using dicebot to go for alterning multipliers each bet.  Regardless you've seemed to have stopped at a streak where you got aproximately 16 reds in a row, if the payout would've been 2 X ( it wasn't ).  A streak of 16 reds in a row on 2x multiplier theoretically over a large quantum of bets happens once in  65536 bets.    Considering you've stated you placed 4 million bets, this 16 streak of reds would've happened roughly about 61 times, so over a large span of bets it's actually not that rare.There's a tendency for gamblers to cry \"Scam\" whenever they come across a long streak of losses, while discarding long streaks of winning bets",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "March 26, 2023, 11:46:26 AM",
      "body": "Quote from: Kirito89 on March 24, 2023, 03:48:14 PMSince Wolfbet's dice game is also provably fair, that more or less means that results are set in stone regardless of your bet amount, payout, the moment you start gambling on a new seed.From what I see you weren't actually chasing a 2x multiplier and instead using dicebot to go for alterning multipliers each bet.  Regardless you've seemed to have stopped at a streak where you got aproximately 16 reds in a row, if the payout would've been 2 X ( it wasn't ).  A streak of 16 reds in a row on 2x multiplier theoretically over a large quantum of bets happens once in  65536 bets.    Considering you've stated you placed 4 million bets, this 16 streak of reds would've happened roughly about 61 times, so over a large span of bets it's actually not that rare.There's a tendency for gamblers to cry \"Scam\" whenever they come across a long streak of losses, while discarding long streaks of winning bets  Actually I am going with there is a tendency for SCAMMERS to cry \"Scam\" about other peoples things when they can. Makes them look more legit.Look at the OP just screaming scam against some casinos (yes the 1x is a scam we all know that) all while attempting to push his magical pumping service.But, yes you are also c100% orrect in the fact that gamblers do tend to scream scam when they loose.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}