{
  "id": "topic_5418903",
  "title": "gunhell16",
  "author": "gunhell16",
  "created_time": "October 31, 2022, 07:08:54 AM",
  "content": "5 things you should not do with your money to get rich or advance your lives1. Don't spend without a plan      - Many people don't care or just don't care about spending. They don't care if they have extra money or if they have money left over until       the end of the month. Then they will complain that they don't have any more money because they have no idea how and where they are       spending it. And how many times have you gone shopping or grocery shopping without a list, which ended up costing you more because       you didn't have a plan?         Because if you want to save something or have some money, you should keep having plans when it comes to what you buy.2. Don't brag about having a lot of money     - This is correct because it is your money where you can do whatever you want to do with your money. But whether we admit it or not,         being arrogant is also the reason for handling or mishandling our money.              \"2 things when you have a lot of money\"                      a. You make a new friend.                      b. You have a close relative.       - What do these two mean? When people know you have a lot of money, you are usually the one they turn to when it comes to financial matters such as borrowing, asking for help, and freeing up where you are always the best so on and so forth. But after all, there is nothing wrong if you are not forced and it springs from your will. In short, there is nothing wrong with helping, lending, or freeing.It's just that others who approach become abusive because it's not their own money and they don't care about the money you spend or use, Because they think it's okay not to pay you. After all, you have a lot of money based on their thinking, this is a reality that is happening in our time today. But they don't know that you were forced to do that and they don't know how hard you worked for it before you got it. Then in the end you will realize that the money you lent just went to nothing and just went to useless things or vices. There are also people to whom you give money who don't care about you, what is your current situation, or something else. Because these people only think about themselves and their interests.But you don't need to be greedy or selfish, as long as you always reach for a spring inside and from the heart so that it is not heavy on your will. And it doesn't hurt to be simple all the time. Also, you don't need to flaunt or show people that you have a lot of money because successful businessmen don't show off piles of money, they are just simple people with heavy pockets.3. Don't always buy something that loses value      - One of the major problems with what we spend over time is losing value or depreciating. Like you bought a phone or a car last year, but       I'm not saying that it's not a necessity, I don't mean it like that of course. What I want to convey is that you don't always have to keep up       with the trend, just because there is a new I phone that comes out, you will also buy such gadgets even if they are very expensive and it       will be a bit difficult to buy it, but it turns out that you are just forcing your own so you can keep up with the trend.      It's the same with the car because you'll need a down payment there, gas costs, maintenance, and other things that will be needed here       because if you don't do it, you'll surely sell it at a low value.4. Don't waste money on useless things      - Like most of us, there are still many addicted to spending on useless things. One of the good examples of this is that others may be       inclined to go with friends who only do happenings and you keep up with your troops knowing that they have a lot of money unlike you or       us which is not like that. Just like buying a high brand of coffee to drink in coffee shops just to be able to socialize and have a big time,       you might not lose or die if you reduce the time you buy this kind of expensive coffee brand. Because you know that your budget is also       hurting your pocket. And we know that there is also one that is cheaper and it's the same coffee, so let's just be practical for now. And       there are many other things that we can reduce the things that we spend money on for nothing.5. Don't invest suddenly     - In my experience, I have also participated in this type of investment without thinking immediately or doing research because I was just      carried away by the hype. It's just like the \"Get rich quick\" where your 1k$ will turn into 10k$ after 3 days, things like that. Just like before      the rise of cryptocurrency projects, there were a lot of them but in the end, they turned out to be scams, but I don't blame them all      because there are legit crypto projects and there are others that are just scams or shitcoins, this is just an example.     But I'm not saying that you shouldn't invest in crypto, I think we shouldn't make a hasty decision so that our capital doesn't go to waste.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418903",
  "comments": [
    {
      "author": "Majestic-milf",
      "created_time": "October 31, 2022, 11:59:01 AM",
      "body": "Money is hard to get but a lot easy to spend, and this becomes bad if there's no laid out plan of how much one aims to spend. There's a part the op mentioned which is quite true of money; it has the tendency to get you a new friend or a close relative as of course, you're valuable when you have something to offer. Applying frugality in spending helps to curb unnecessary waste and helps save money as spending unnecessarily would quickly run one into a lifestyle of dependency and debt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dickiy",
      "created_time": "October 31, 2022, 01:02:13 PM",
      "body": "Quote from: gunhell16 on October 31, 2022, 07:08:54 AM5 things you should not do with your money to get rich or advance your lives1. Don't spend without a plan      - Many people don't care or just don't care about spending. They don't care if they have extra money or if they have money left over until       the end of the month. Then they will complain that they don't have any more money because they have no idea how and where they are       spending it. And how many times have you gone shopping or grocery shopping without a list, which ended up costing you more because       you didn't have a plan?         Because if you want to save something or have some money, you should keep having plans when it comes to what you buy.2. Don't brag about having a lot of money     - This is correct because it is your money where you can do whatever you want to do with your money. But whether we admit it or not,         being arrogant is also the reason for handling or mishandling our money.              \"2 things when you have a lot of money\"                      a. You make a new friend.                      b. You have a close relative.       - What do these two mean? When people know you have a lot of money, you are usually the one they turn to when it comes to financial matters such as borrowing, asking for help, and freeing up where you are always the best so on and so forth. But after all, there is nothing wrong if you are not forced and it springs from your will. In short, there is nothing wrong with helping, lending, or freeing.It's just that others who approach become abusive because it's not their own money and they don't care about the money you spend or use, Because they think it's okay not to pay you. After all, you have a lot of money based on their thinking, this is a reality that is happening in our time today. But they don't know that you were forced to do that and they don't know how hard you worked for it before you got it. Then in the end you will realize that the money you lent just went to nothing and just went to useless things or vices. There are also people to whom you give money who don't care about you, what is your current situation, or something else. Because these people only think about themselves and their interests.But you don't need to be greedy or selfish, as long as you always reach for a spring inside and from the heart so that it is not heavy on your will. And it doesn't hurt to be simple all the time. Also, you don't need to flaunt or show people that you have a lot of money because successful businessmen don't show off piles of money, they are just simple people with heavy pockets.3. Don't always buy something that loses value      - One of the major problems with what we spend over time is losing value or depreciating. Like you bought a phone or a car last year, but       I'm not saying that it's not a necessity, I don't mean it like that of course. What I want to convey is that you don't always have to keep up       with the trend, just because there is a new I phone that comes out, you will also buy such gadgets even if they are very expensive and it       will be a bit difficult to buy it, but it turns out that you are just forcing your own so you can keep up with the trend.      It's the same with the car because you'll need a down payment there, gas costs, maintenance, and other things that will be needed here       because if you don't do it, you'll surely sell it at a low value.4. Don't waste money on useless things      - Like most of us, there are still many addicted to spending on useless things. One of the good examples of this is that others may be       inclined to go with friends who only do happenings and you keep up with your troops knowing that they have a lot of money unlike you or       us which is not like that. Just like buying a high brand of coffee to drink in coffee shops just to be able to socialize and have a big time,       you might not lose or die if you reduce the time you buy this kind of expensive coffee brand. Because you know that your budget is also       hurting your pocket. And we know that there is also one that is cheaper and it's the same coffee, so let's just be practical for now. And       there are many other things that we can reduce the things that we spend money on for nothing.5. Don't invest suddenly     - In my experience, I have also participated in this type of investment without thinking immediately or doing research because I was just      carried away by the hype. It's just like the \"Get rich quick\" where your 1k$ will turn into 10k$ after 3 days, things like that. Just like before      the rise of cryptocurrency projects, there were a lot of them but in the end, they turned out to be scams, but I don't blame them all      because there are legit crypto projects and there are others that are just scams or shitcoins, this is just an example.     But I'm not saying that you shouldn't invest in crypto, I think we shouldn't make a hasty decision so that our capital doesn't go to waste.Are you rich?I think what you say is not fundamental in managing finances. and what you say is universal because it doesn't give any specific formulation.1. Everyone has a plan whenever they spend money even a few minutes before.2. Basically humans have to be simple but sometimes we have to be arrogant to keep the financial principles we hold. 3. I think we should follow the trend but not always even though the value will be lost but if it is a must in running our business why don't we buy it? where everyone has an android phone yes, we only use landlines and how can we accelerate our business expansion if we are still using vehicles from the 90s?4. If indeed the goal is to build relationships with those who have a lot of money so that we know the business they run and we can study, eat and drink coffee in places that are quite draining on our wallets, it doesn't matter if the goal is to expand relationships and strengthen connections for development ourselves and our business.5. Maybe you mean FOMO where everyone buys because a lot of people talk about it and buy it. is a natural thing when we start to dive into the world of investment, but after a long time I think it is necessary to understand what is called risk management from various aspects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cozytrade",
      "created_time": "October 31, 2022, 01:27:25 PM",
      "body": "Sometimes we have to buy useless things or invest money in unproductive actions. This is necessary but not mandatory. Getting rich is not about how you spend your money it's about how you manage your funds. What you are talking about is some advice that you should not do if you are rich. For managing funds, you need to have basic economic knowledge. You have to understand the difference between assets and liabilities. I can assure you that 80%of  people do not know the difference between assets and liabilities so they invest their money into liabilities by thinking that they are investing in assets. You can spend your money on whatever shit you want or for any pleasure you may like. But spending your assets to do that will be unwise. I want to go on vacation not by selling my bitcoin, gold, or land. I would do that with the profits I made from my investment. One thing I always keep in minds is that \"Assets can only be sold to buy new assets\". That's how our investment will circulate from one asset to another and increase in size.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "October 31, 2022, 01:40:08 PM",
      "body": "Quote from: gunhell16 on October 31, 2022, 07:08:54 AM1. Don't spend without a plan  Because if you want to save something or have some money, you should keep having plans when it comes to what you buy.Making plans or spending money without a budget can be very bad for your money. The rich are very meticulous with money. One of the wisest things I have heard about money discipline to get rich is also not to spend money before it comes. That is, as much as possible, you should avoid borrowing money to buy things or buy something with the promise to pay later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "burugcrypto",
      "created_time": "October 31, 2022, 02:13:19 PM",
      "body": "In my PoV, 1 - Never do impulsive purchases2-  Never purchase something which you can't afford 3 - Never be greedy or foolish",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "October 31, 2022, 02:15:46 PM",
      "body": "Investing is the only way to grow your money. It has to be through banks or renowned financial institutes who offer short and long term investment opportunities. For example, banks will offer schemes which can be from simple FD to 5 year % growth plan associated with loans which can save up to 10-15% flat on the taxes yearly. Well it may sound crazy but there are such financial advices for the rich people who wants to stay rich!And it is also for those who want to become rich. The more you invest the more you get back. Money has to be free flowing and always locked up in growing schemes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mauser",
      "created_time": "October 31, 2022, 02:46:41 PM",
      "body": "Good summary of things we should avoid doing with our money. I wouldn't go so far to say  that these are the main reason that we are not becoming rich, because even when we follow all points it's not guaranteed that we will become rich one day. To be rich is very hard to achieve and it requires a lot of luck in my opinion. Having a well paid job is a good start, and even then it's going to take a long time. I like your 4. Point the most:Quote 4. Don't waste money on useless thingsSaving money and controlling our spending habits is  good way to get our personal finances in order. I learned this myself the hard way. It happened so often in the past that I see something on TV and wanted to have it myself immediately, only to find out after a month that I didn't really need it in the first place. That's why I wait now 3 months before buying everything bigger, and if I survive the 3 months without much hassle than I don't really need it and will not make the purchase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "October 31, 2022, 04:41:14 PM",
      "body": "Quote from: gunhell16 on October 31, 2022, 07:08:54 AM5 things you should not do with your money to get rich  All the five points OP has just discussed are very vital points that can help anyone to be prudent financially. But these points are not necessarily the ways to become rich. Riches can be acquired when one identifies and maximize opportunities that are available from time to time. The point that was raised by the author would assist anyone to use the resources at our disposal in a manner that reduces unnecessary expenses. Some people are in debt not because they don't have access to enough resources but because they are spending more on their wants instead of basic needs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "October 31, 2022, 05:36:39 PM",
      "body": "I can add another one, spend time with successful people so that you can learn from them. Do not do exactly what they do, because they have disposable income and that means they can take more risk than you can, but you can learn the mindset of a rich person.I know many many rich people who do not have a higher spending monthly than I do, they live a very comfortable life while doing it, but they do not really end up spending a lot at all times. Even Elon Musk doesn't spend \"that\" much money on regular life, that's what we should aim at. If you do not spend more than 5k per month (which is a lot I know) as a billionaire, then we can spend less as regular people, do not aim at \"things\", aim at success and spend your money for that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "freedomgo",
      "created_time": "October 31, 2022, 06:13:12 PM",
      "body": "Quote from: Majestic-milf on October 31, 2022, 11:59:01 AM Money is hard to get but a lot easy to spend, and this becomes bad if there's no laid out plan of how much one aims to spend. There's a part the op mentioned which is quite true of money; it has the tendency to get you a new friend or a close relative as of course, you're valuable when you have something to offer. Applying frugality in spending helps to curb unnecessary waste and helps save money as spending unnecessarily would quickly run one into a lifestyle of dependency and debt.  It’s not bad to spend sometimes especially if you know it would be useful to you but in most cases, learn to spend mostly on your budget so you will never be financially broken in the end. Although there are times you get influenced with your friends to spend on luxury things like they do, that’s fine as long as you never adopt it and you stay low key and frugal in all your expenses. That way, you will get to save and earn more especially if you insert doing some good and profitable investments like crypto do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "October 31, 2022, 06:27:02 PM",
      "body": "I doubt even if you do these 5 things religiously you will still get rich   Richness doesn't come with excessive strictness, it comes with being smart and having the right opportunity.1. Don't spend without a plan - as much as people want to live by their budget it is not that easy because of the unexpected issues that will come that will require spending money that you didn't plan for.2. Don't brag about having a lot of money - this is kind of both side imo, some people brag about their wealth and keeps making money, while others brag and find themselves in a tight situation, so I don't think this directly affect you from being rich.3. Don't always buy something that loses value - I have different views on this, except you want to only buy branded and designer items I don't know what else you will be buying that will always have value. Any other item you will buy that is not a designer with a name tag will definitely lose value because it becomes a used item and the value will not be as that of new.4. Don't waste money on useless things - only when you don't have the money you will see it as useless, if you do your views will be different. E.g some people will perceive going to a club and having a great time with friends useless way of spending money, while others will see it as a very important aspect of their life, likewise, someone will see buying a vintage bottle of wine for $300 (for example) wastage of money, someone else sees the important because of the value attached to it. 5. Don't invest suddenly - I do agree but do not waste too much time waiting for a divine sign before investing because then it will be too late.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jemzx00",
      "created_time": "October 31, 2022, 06:45:46 PM",
      "body": "Nope, I don't agree with all these 5 things that one should do to become rich. For the first, third, and fourth things that you've listed there doesn't really make you rich if you do it. It's not always a matter of saving but rather being able to find ways to earn more is much more important to focus on. If you can afford it then you should buy it and if ever you can't then try to find ways for you to do so. Having much more income coming in rather than just saving and being able to buy things that you want is better.For the second as well as the fifth thing, it depends. Yes, you should not flaunt your money publicly however having publicity being known for having enough funds would likely provide you more clients as well as potential partners. Also, time is important in most investment and you should not always wait too much before investing, sometimes it is much more profitable if you will be able to invest early.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "October 31, 2022, 07:05:59 PM",
      "body": "Quote from: freedomgo on October 31, 2022, 06:13:12 PMQuote from: Majestic-milf on October 31, 2022, 11:59:01 AM Money is hard to get but a lot easy to spend, and this becomes bad if there's no laid out plan of how much one aims to spend. There's a part the op mentioned which is quite true of money; it has the tendency to get you a new friend or a close relative as of course, you're valuable when you have something to offer. Applying frugality in spending helps to curb unnecessary waste and helps save money as spending unnecessarily would quickly run one into a lifestyle of dependency and debt.  It’s not bad to spend sometimes especially if you know it would be useful to you but in most cases, learn to spend mostly on your budget so you will never be financially broken in the end. Although there are times you get influenced with your friends to spend on luxury things like they do, that’s fine as long as you never adopt it and you stay low key and frugal in all your expenses. That way, you will get to save and earn more especially if you insert doing some good and profitable investments like crypto do.You can not control your fate. Sometimes we get into situations when we have to think out of our budget. Most people spend their money thinking about a few months ahead of them. They are still broke financially. It is not overspending or carelessness about our money that makes people broke financially. It is a lack of economical knowledge. If you do not know how to manage your money then hire a professional for that. Never keep your money ideal in the bank or in your home. Always reinvest in different assets. That's the way of getting out of the rate race.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vaskiy",
      "created_time": "October 31, 2022, 09:34:28 PM",
      "body": "My list of things one should do to get rich1. Don't borrow to spend, try to limit your spending within your earnings.2. Don't expect getting rich in the short term, getting rich is long process. Few might be lucky.3. Spend on luxury investment (car, mansion etc) after making yourself rich.4. Allocate specific percentage from the earning for investment & savings.5. Make a spending chart which will let you identify the mistakes happening on your process.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "November 01, 2022, 01:26:21 PM",
      "body": "Quote from: mm2543363580 on October 31, 2022, 09:05:41 PMQuote from: DVlog on October 31, 2022, 07:05:59 PMQuote from: freedomgo on October 31, 2022, 06:13:12 PMQuote from: Majestic-milf on October 31, 2022, 11:59:01 AM Money is hard to get but a lot easy to spend, and this becomes bad if there's no laid out plan of how much one aims to spend. There's a part the op mentioned which is quite true of money; it has the tendency to get you a new friend or a close relative as of course, you're valuable when you have something to offer. Applying frugality in spending helps to curb unnecessary waste and helps save money as spending unnecessarily would quickly run one into a lifestyle of dependency and debt.  It’s not bad to spend sometimes especially if you know it would be useful to you but in most cases, learn to spend mostly on your budget so you will never be financially broken in the end. Although there are times you get influenced with your friends to spend on luxury things like they do, that’s fine as long as you never adopt it and you stay low key and frugal in all your expenses. That way, you will get to save and earn more especially if you insert doing some good and profitable investments like crypto do.You can not control your fate. Sometimes we get into situations when we have to think out of our budget. Most people spend their money thinking about a few months ahead of them. They are still broke financially. It is not overspending or carelessness about our money that makes people broke financially. It is a lack of economical knowledge. If you do not know how to manage your money then hire a professional for that. Never keep your money ideal in the bank or in your home. Always reinvest in different assets. That's the way of getting out of the rate race.I really like the point 1 - where the OP has mentioned dont spend without the planIf you do a home work before purchase - it will save time - money and energy all And this hit me hard. I am the consumer who does a grocery without a list and doesn't care if it will go over the budget as I think it is only once a month, and I end up buying irrelevant things. Last month hit us hard since we overspent on things, and we had to borrow money from others which is a very big lesson learned. This month I will practice making a list before going to the store. In addition to your list, spending money on alcoholic drinks and cigarettes could impact your budget; if you can stop or minimize it, that would be better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "November 01, 2022, 02:10:15 PMLast edit: November 01, 2022, 03:11:15 PM by Mr. Magkaisa",
      "body": "Quote from: xSkylarx on November 01, 2022, 01:26:21 PMQuote from: mm2543363580 on October 31, 2022, 09:05:41 PMQuote from: DVlog on October 31, 2022, 07:05:59 PMQuote from: freedomgo on October 31, 2022, 06:13:12 PMQuote from: Majestic-milf on October 31, 2022, 11:59:01 AM Money is hard to get but a lot easy to spend, and this becomes bad if there's no laid out plan of how much one aims to spend. There's a part the op mentioned which is quite true of money; it has the tendency to get you a new friend or a close relative as of course, you're valuable when you have something to offer. Applying frugality in spending helps to curb unnecessary waste and helps save money as spending unnecessarily would quickly run one into a lifestyle of dependency and debt.  It’s not bad to spend sometimes especially if you know it would be useful to you but in most cases, learn to spend mostly on your budget so you will never be financially broken in the end. Although there are times you get influenced with your friends to spend on luxury things like they do, that’s fine as long as you never adopt it and you stay low key and frugal in all your expenses. That way, you will get to save and earn more especially if you insert doing some good and profitable investments like crypto do.You can not control your fate. Sometimes we get into situations when we have to think out of our budget. Most people spend their money thinking about a few months ahead of them. They are still broke financially. It is not overspending or carelessness about our money that makes people broke financially. It is a lack of economical knowledge. If you do not know how to manage your money then hire a professional for that. Never keep your money ideal in the bank or in your home. Always reinvest in different assets. That's the way of getting out of the rate race.I really like the point 1 - where the OP has mentioned dont spend without the planIf you do a home work before purchase - it will save time - money and energy all And this hit me hard. I am the consumer who does a grocery without a list and doesn't care if it will go over the budget as I think it is only once a month, and I end up buying irrelevant things. Last month hit us hard since we overspent on things, and we had to borrow money from others which is a very big lesson learned. This month I will practice making a list before going to the store. In addition to your list, spending money on alcoholic drinks and cigarettes could impact your budget; if you can stop or minimize it, that would be better.- Like you Sir, I was also struck by what OP said about going grocery shopping without a list, there is some truth in what he said that I often end up buying things I didn't plan when I go to the grocery store, and my wife often fights and scolds me for not it's necessary, I just buy it, as long as it's in my mind because it will be needed unexpectedly but eventually it won't be used and it's just stored.So thanks for OP's reminder on that, knowing that most of us here on this forum experience something like that, maybe I should start training myself to carry a list so I can maximize grocery shopping.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GideonGono",
      "created_time": "November 01, 2022, 02:22:48 PM",
      "body": "Quote from: gunhell16 on October 31, 2022, 07:08:54 AM5 things you should not do with your money to get rich or advance your lives1. Don't spend without a plan      - Many people don't care or just don't care about spending. They don't care if they have extra money or if they have money left over until       the end of the month. Then they will complain that they don't have any more money because they have no idea how and where they are       spending it. And how many times have you gone shopping or grocery shopping without a list, which ended up costing you more because       you didn't have a plan?         Because if you want to save something or have some money, you should keep having plans when it comes to what you buy.2. Don't brag about having a lot of money     - This is correct because it is your money where you can do whatever you want to do with your money. But whether we admit it or not,         being arrogant is also the reason for handling or mishandling our money.              \"2 things when you have a lot of money\"                      a. You make a new friend.                      b. You have a close relative.       - What do these two mean? When people know you have a lot of money, you are usually the one they turn to when it comes to financial matters such as borrowing, asking for help, and freeing up where you are always the best so on and so forth. But after all, there is nothing wrong if you are not forced and it springs from your will. In short, there is nothing wrong with helping, lending, or freeing.It's just that others who approach become abusive because it's not their own money and they don't care about the money you spend or use, Because they think it's okay not to pay you. After all, you have a lot of money based on their thinking, this is a reality that is happening in our time today. But they don't know that you were forced to do that and they don't know how hard you worked for it before you got it. Then in the end you will realize that the money you lent just went to nothing and just went to useless things or vices. There are also people to whom you give money who don't care about you, what is your current situation, or something else. Because these people only think about themselves and their interests.But you don't need to be greedy or selfish, as long as you always reach for a spring inside and from the heart so that it is not heavy on your will. And it doesn't hurt to be simple all the time. Also, you don't need to flaunt or show people that you have a lot of money because successful businessmen don't show off piles of money, they are just simple people with heavy pockets.3. Don't always buy something that loses value      - One of the major problems with what we spend over time is losing value or depreciating. Like you bought a phone or a car last year, but       I'm not saying that it's not a necessity, I don't mean it like that of course. What I want to convey is that you don't always have to keep up       with the trend, just because there is a new I phone that comes out, you will also buy such gadgets even if they are very expensive and it       will be a bit difficult to buy it, but it turns out that you are just forcing your own so you can keep up with the trend.      It's the same with the car because you'll need a down payment there, gas costs, maintenance, and other things that will be needed here       because if you don't do it, you'll surely sell it at a low value.4. Don't waste money on useless things      - Like most of us, there are still many addicted to spending on useless things. One of the good examples of this is that others may be       inclined to go with friends who only do happenings and you keep up with your troops knowing that they have a lot of money unlike you or       us which is not like that. Just like buying a high brand of coffee to drink in coffee shops just to be able to socialize and have a big time,       you might not lose or die if you reduce the time you buy this kind of expensive coffee brand. Because you know that your budget is also       hurting your pocket. And we know that there is also one that is cheaper and it's the same coffee, so let's just be practical for now. And       there are many other things that we can reduce the things that we spend money on for nothing.5. Don't invest suddenly     - In my experience, I have also participated in this type of investment without thinking immediately or doing research because I was just      carried away by the hype. It's just like the \"Get rich quick\" where your 1k$ will turn into 10k$ after 3 days, things like that. Just like before      the rise of cryptocurrency projects, there were a lot of them but in the end, they turned out to be scams, but I don't blame them all      because there are legit crypto projects and there are others that are just scams or shitcoins, this is just an example.     But I'm not saying that you shouldn't invest in crypto, I think we shouldn't make a hasty decision so that our capital doesn't go to waste.Sad to say but been there done that,And experience is really the best teacher I would make sure to avoid those things again in the future.This post kind a hit me hard hope that I've read this a couple of years before maybe this could have change me somehow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "awik p",
      "created_time": "November 01, 2022, 02:53:03 PM",
      "body": "Quote from: mm2543363580 on October 31, 2022, 09:05:41 PMQuote from: DVlog on October 31, 2022, 07:05:59 PMQuote from: freedomgo on October 31, 2022, 06:13:12 PMQuote from: Majestic-milf on October 31, 2022, 11:59:01 AM Money is hard to get but a lot easy to spend, and this becomes bad if there's no laid out plan of how much one aims to spend. There's a part the op mentioned which is quite true of money; it has the tendency to get you a new friend or a close relative as of course, you're valuable when you have something to offer. Applying frugality in spending helps to curb unnecessary waste and helps save money as spending unnecessarily would quickly run one into a lifestyle of dependency and debt.  It’s not bad to spend sometimes especially if you know it would be useful to you but in most cases, learn to spend mostly on your budget so you will never be financially broken in the end. Although there are times you get influenced with your friends to spend on luxury things like they do, that’s fine as long as you never adopt it and you stay low key and frugal in all your expenses. That way, you will get to save and earn more especially if you insert doing some good and profitable investments like crypto do.You can not control your fate. Sometimes we get into situations when we have to think out of our budget. Most people spend their money thinking about a few months ahead of them. They are still broke financially. It is not overspending or carelessness about our money that makes people broke financially. It is a lack of economical knowledge. If you do not know how to manage your money then hire a professional for that. Never keep your money ideal in the bank or in your home. Always reinvest in different assets. That's the way of getting out of the rate race.I really like the point 1 - where the OP has mentioned dont spend without the planIf you do a home work before purchase - it will save time - money and energy all sometimes what we don't realize is that we buy goods not based on needs but desires, so there will be a lot of additional expenses that are not really needed. sometimes we find it difficult to control it because of wrong thinking without any control. The need for cigarettes in a month is indeed quite large, if we can control it then cigarette money can be more useful at least we can invest from that part, and it will be useful in the future",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jody.Drummer",
      "created_time": "November 01, 2022, 04:16:05 PM",
      "body": "Quote from: awik p on November 01, 2022, 02:53:03 PMsometimes what we don't realize is that we buy goods not based on needs but desires, so there will be a lot of additional expenses that are not really needed. sometimes we find it difficult to control it because of wrong thinking without any control. The need for cigarettes in a month is indeed quite large, if we can control it then cigarette money can be more useful at least we can invest from that part, and it will be useful in the futureThis happens due to the prestige that has surrounded us and this is one of the characteristics of humans that is actually difficult to change because we are always trying to appear better and more prominent than others.Even though it's not all like that but things like this still happen for most people, it's definitely experienced this.I personally try to buy something based on function not based on prestige because this indirectly can also train us to be able to manage finances.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}