{
  "id": "topic_5462847",
  "title": "Jerrknight",
  "author": "Jerrknight",
  "created_time": "August 10, 2023, 10:00:08 PM",
  "content": "Hey, i wanted to know about this cryptocurrency siteBitcoinkoin/.com(remove /)If any of you use this website, can you tell me about it, like how it works Or anything you know about this websiteIt’ll be really helpful thanks",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462847",
  "comments": [
    {
      "author": "peter0425",
      "created_time": "August 11, 2023, 02:51:51 AM",
      "body": "Quote from: Jerrknight on August 10, 2023, 10:00:08 PMHey, i wanted to know about this cryptocurrency siteBitcoinkoin/.com(remove /)If any of you use this website, can you tell me about it, like how it works Or anything you know about this websiteIt’ll be really helpful thankswhy not check it for yourself? lol that will not bring trick to us  because we knew your intention hehe",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DYING_S0UL",
      "created_time": "August 11, 2023, 04:31:17 AM",
      "body": "Quote from: Jerrknight on August 10, 2023, 10:00:08 PMHey, i wanted to know about this cryptocurrency siteBitcoinkoin/.com(remove /)If any of you use this website, can you tell me about it, like how it works Or anything you know about this websiteIt’ll be really helpful thanksDon't you know about how to use a browser? Lol. You can't just post any links and tell the users to check. It could be a malicious site or fake site. We could get hacked. Who knows! Check yourself bro if you are so eager to learn about the site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jerrknight",
      "created_time": "August 11, 2023, 09:48:29 AM",
      "body": "Quote from: peter0425 on August 11, 2023, 02:51:51 AMQuote from: Jerrknight on August 10, 2023, 10:00:08 PMHey, i wanted to know about this cryptocurrency siteBitcoinkoin/.com(remove /)If any of you use this website, can you tell me about it, like how it works Or anything you know about this websiteIt’ll be really helpful thankswhy not check it for yourself? lol that will not bring trick to us  because we knew your intention hehePlease use your tiny brain again, i have clearly mentioned on the post, “if any of you is using this website” i didnt said that register on the website and check, so kindly stop making your own assumptions and refrain from posting further.Quote from: DYING_S0UL on August 11, 2023, 04:31:17 AMQuote from: Jerrknight on August 10, 2023, 10:00:08 PMHey, i wanted to know about this cryptocurrency siteBitcoinkoin/.com(remove /)If any of you use this website, can you tell me about it, like how it works Or anything you know about this websiteIt’ll be really helpful thanksDon't you know about how to use a browser? Lol. You can't just post any links and tell the users to check. It could be a malicious site or fake site. We could get hacked. Who knows! Check yourself bro if you are so eager to learn about the site. If you got a browser and a internet, not to mis-use it, make it worth it. Check my post again, i have only asked from them who are using, not the new ones.As the website is asking for deposit first, so only asking from them who are using.Do some actual work rather then posting on someone else?s post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}