{
  "id": "topic_5446335",
  "title": "cafter",
  "author": "cafter",
  "created_time": "March 26, 2023, 06:41:49 AMLast edit: March 27, 2023, 12:58:10 PM by cafter",
  "content": "i want to ask what is exactly a price chart (chart we see while trading) some people say that the candles are formed by smart money (intuitional trader, trader's with big capital who want liquidity and always look for stoplosses of major trader's ) or the candles are totally random and some people says the chart is form by human emotion, explain what is exactly a chart including all that above points (totally random or moves according to smart money and not random)means, all movement are totally random? or previously anyone can determine were will the market going, EDIT: many of your not understood what i am telling here^ because of my english.I was asking that the chart formed was formed according to institutions and people with big capital.., or institutions also don't know what will going to happen in next hour.[in regular days..(no big news no FED problems)] and , many movements while breakout, breakdown, crossing of MA's are works exactly according to TA for sometimes, because many many bots are trading, so that quick movement we see is because of bots?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446335",
  "comments": [
    {
      "author": "Bollexz1",
      "created_time": "March 26, 2023, 06:51:28 AM",
      "body": "The importance of candlesticks in a trading chart is used by traders to determine possible price movement based on past patterns. It shows four price points (open, close, high, and low) throughout the period the trader specifies. This has certainly nothing to do with human emotion and neither is it a drawn diagram. It is there for a purpose and there is a basic definition of your worry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "March 26, 2023, 08:29:25 AM",
      "body": "Charts consist of information about the price of a coin, it does not show if some traders are emotional traders or trading to liquidate other traders trading fund. A coin with high marketcap would be hard to manipulate, that is why it is better to go for such type of coin, like bitcoin.Quote from: cafter on March 26, 2023, 06:41:49 AMi want to ask what is exactly a price chart (chart we see while trading) some people say that the candles are formed by smart money (intuitional trader, trader's with big capital who want liquidity and always look for stoplosses of major trader's ) or the candles are totally random and some people says the chart is form by human emotion, explain what is exactly a chart including all that above points (totally random or moves according to smart money and not random)Some traders are good and do not trade with emotion, while some traders have very little emotion, while some traders are just newbies and they will make many mistakes they can learn from. The chart consists of the information about a coin price. Like if you use the candle stick chart, each candles consists of the opening, closing, highest price for the time range used and the lowest price for the time range used. Quote from: Bollexz1 on March 26, 2023, 06:51:28 AMThe importance of candlesticks in a trading chart is used by traders to determine possible price movement based on past patterns. It shows four price points (open, close, high, and low) throughout the period the trader specifies. This has certainly nothing to do with human emotion and neither is it a drawn diagram. It is there for a purpose and there is a basic definition of your worry.On some exchanges, the candle stick chart can also consist of price change percentage, number of transactions, the volume for the time range chosen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cafter",
      "created_time": "March 26, 2023, 08:44:35 AM",
      "body": "and why it's hard to manipulate the price of a coin which have high marketcap,  because marketcap doesn't matter much, only a calculated number,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "March 26, 2023, 09:10:40 AM",
      "body": "The trading chart says a lot. Like its happening due to what people are doing mixed up. Its just a guide on some trader to what is happening on particular timeframe. It has 5minute 30mins 1hr 1week and so on. They just record the potential movement and its magnitude of money in and out which shows thru red and green candle stick relatively to its price and certain parameters. Its very helpful display on trading, Im sure theres a lot of meaning to this but ones can grasp the idea of it little by little. Hope my explanation helps you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "March 26, 2023, 11:50:28 AM",
      "body": "Quote from: cafter on March 26, 2023, 08:44:35 AMand why it's hard to manipulate the price of a coin which have high marketcap,  because marketcap doesn't matter much, only a calculated number, Well, market cap is simply the total value of all the coins in circulation multiplied by the current market price. So, while market cap is an important metric for measuring a cryptocurrency's overall value, it doesn't necessarily determine the coin's price movements. However, coins with a high market cap are less susceptible to price manipulation because they have a more significant number of investors and a more extensive trading volume. It's much harder to manipulate the price of a coin when there are more buyers and sellers involved in the market. Let's say we have two cryptocurrencies, Crypto A and Crypto B.Crypto A has a market cap of $1 billion and a trading volume of $50 million.Crypto B has a market cap of $500 million and a trading volume of $100 million.Even though Crypto A has a higher market cap, its lower trading volume makes it more susceptible to manipulation. On the other hand, Crypto B has a lower market cap but a higher trading volume, making it less vulnerable to price manipulation. So, it's important to consider both market cap and trading volume when evaluating the potential of a cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "March 26, 2023, 12:01:18 PM",
      "body": "Market trends can be determined using technical analysis, whether the trend is in the long term (from 4 years to 6 years) or the medium term or even for daily trading, and the accuracy of trend determination increases by using more technical analysis indicators in addition to increasing the time period.As for knowing what is happening during the last hour, projects are just an illustrative means and are not used for prediction, but rather for determining the direction.It is impossible to know exactly what is going on with the charts, even the analyzes are speculation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "borovichok",
      "created_time": "March 26, 2023, 12:56:34 PM",
      "body": "Quote from: cryptoaddictchie on March 26, 2023, 09:10:40 AMThe trading chart says a lot. Like its happening due to what people are doing mixed up. Its just a guide on some trader to what is happening on particular timeframe. It has 5minute 30mins 1hr 1week and so on. They just record the potential movement and its magnitude of money in and out which shows thru red and green candle stick relatively to its price and certain parameters. Its very helpful display on trading, Im sure theres a lot of meaning to this but ones can grasp the idea of it little by little. Hope my explanation helps you. Traders make profits mere looking at the chart because some knows already what the market have for us while others are confused and they are easily deceived by the chart movements. Using smaller timeframes are meant for scalpers not long-term traders. The chart formulation is based on the season of the market, we witnessing a small bull run up but it's a glitch inother to trick traders into falling for it, I've seen such chart formulation several times and I've learnt from my mistakes. Possibly, a uptrend is coming into existence in the coming weeks and we should prepared our minds for the bull ahead but we shouldn't place all our minds on it because the chart is always ready to go against plans already analysed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "March 26, 2023, 02:34:06 PM",
      "body": "Quote from: cafter on March 26, 2023, 06:41:49 AMi want to ask what is exactly a price chart (chart we see while trading) some people say that the candles are formed by smart money (intuitional trader, trader's with big capital who want liquidity and always look for stoplosses of major trader's ) or the candles are totally random and some people says the chart is form by human emotion, explain what is exactly a chart including all that above points (totally random or moves according to smart money and not random)Candles are not formed just randomly because every candle you see on your chart represent an information. It tells you what is happening in the market and not just a random outcome. This is the reason that studying the candlesticks is important and that is why they all have names, check babypips.com for more on candlesticks. Therefore you can determine emotions of trader collectively through the candlesticks that is when the market is dull, indecisive etc, all can be observed through candlesticks. But there is something that you can learn by your self in the market especially when the market is intentionally chasing stop losses and this to me is that time the market begins to wrongly sell instead of buy or wrongly buying instead of selling. At such time, you can just stay outside so as not to burn your capital in stop loss because no sooner than later, the market will reverse into the normal direction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "March 26, 2023, 05:12:46 PM",
      "body": "Market cap is just one of many factors to consider when investing in cryptocurrencies. It's still possible for whales or large investors to manipulate the price of a coin, even if it has a high market cap. For example, whales with a significant amount of money can create artificial demand by buying up large quantities of the coin, which can drive up the price. Or, they can then sell their coins at a profit, causing the price to drop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oceat",
      "created_time": "March 26, 2023, 05:51:52 PM",
      "body": "I don't want to list everything but if you have some free time you can read them all on that site since they do have some search bar.All the information you needed are all in there so feel free to read and explore everything since it's not enough if you ask people here about almost everything in trading.https://www.investopedia.com/terms/c/candlestick.asphttps://www.investopedia.com/trading/candlestick-charting-what-is-it/https://www.investopedia.com/terms/p/price-action.aspCandlesticks were just used to do some technical analysis for traders so that they can read/predict what's the possible price. Emotion has nothing to do with the chart but it all depends on the trader themselves whether they have to let their emotions control them or suppress those feelings and proceed with the goal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "March 26, 2023, 07:57:19 PM",
      "body": "The market is currently holding its position and I think it's normal. 2 weeks ago market pushed back a lot of price recovery and after that market is still holding the recovery which can be considered as a positive attitude of the investors. For future developments in the market, the following point may be worth discussing as somehow EU countries are trying to service with their economic problems and control the crypto-related projects.✮ Upcoming Intrest rate developments in US✮ Law enforcement developments on the crypto-related projects✮ CDS of the Banks✮ Inflation policies related to developments all over the world",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "March 26, 2023, 08:37:58 PM",
      "body": "Quote from: cafter on March 26, 2023, 06:41:49 AMsome people says the chart is form by human emotionWhere have you heard about this? I don't think that they know what they're saying. We become emotional whenever we see charts that are not in our favor but it's not being formed by emotions, charts don't rely on people's emotions.Quote from: cafter on March 26, 2023, 06:41:49 AMmeans, all movement are totally random? or previously anyone can determine were will the market going, We can say that it's a yes but there are factors that affect these charts and one of it is about the news that are circulating about that crypto you're following and looking on its chart.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "March 26, 2023, 09:33:43 PM",
      "body": "Quote from: Oshosondy on March 26, 2023, 08:29:25 AM-cut-Actually if i understand correctly what OP is trying to say, he/she is referring to patterns human emotions will cause to price and market activity.Let's take for example Elliot Wave tehnical analysis style. It looks for patterns in crowd psychology and that's exactly studying emotions of everyone involved in the market.Listening your own emotions can be very enlighting as you can pretty much assume that if you are experienced trader. That most of the people are going to experience more fear later then you and more greed later than you. That's helpful to know when you are placing your orders",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamifoud",
      "created_time": "March 26, 2023, 09:48:31 PM",
      "body": "Quote from: cafter on March 26, 2023, 06:41:49 AMmeans, all movement are totally random? or previously anyone can determine were will the market going,Everything that happens on the market has been recorded and this chart will show us what is recently happen. People make use of this to speculate what might happen tomorrow and the following days but definitely, this won't assure that this will be the exact event to happen. We do have not to be fully reliant on the chart as it only tells on the past but no tools that will tell us about the future. The market is volatile which means that everything is unpredictable despite having these trading tools on our computers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "March 26, 2023, 10:52:36 PM",
      "body": "Quote from: cafter on March 26, 2023, 08:44:35 AMand why it's hard to manipulate the price of a coin which have high marketcap,  because marketcap doesn't matter much, only a calculated number, Maybe what you meant to say is why is it hard to manipulate a high trading volume coins. Like you said, marketcap does not matter so much because it's the product of the circulating supply of a coin x the price of the coins.And even if a coin has a very high marketcap, if the trading volume is very low or if the liquidity is low in the order books, that coin price can easily get manipulated by even small buy or sell orders",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shinratensei_",
      "created_time": "March 26, 2023, 11:21:54 PM",
      "body": "chart always formed randomly and it could be manipulated, moreover the chart that you see is just like recording of the past activities related with some assets and commodities.it also determines at what price point in the previous transaction the assets is priced. so that you could know how much your assets actually worth. It's good for analysis if you're trader but honestly if you're just gonna invest. what matters most is whether the entry that you're making have significantly lower price point than compared with past trades. also, it's harder to manipulate if trading volume is high, not because the market capitalization.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "March 27, 2023, 01:07:50 AM",
      "body": "Quote from: cafter on March 26, 2023, 06:41:49 AM(....)means, all movement are totally random? or previously anyone can determine were will the market going, I don't think so, because it is based on the market. For me, the market is not random, it is driven by people/institutions who are trading.Even if there are a lot of trading bots, they are still considered as volume, so these candlesticks may random to you but they are made based on the trading data which always consists of buyers and sellers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "@sriyan",
      "created_time": "March 27, 2023, 12:52:43 PM",
      "body": "Quote from: cafter on March 26, 2023, 06:41:49 AMi want to ask what is exactly a price chart (chart we see while trading) some people say that the candles are formed by smart money (intuitional trader, trader's with big capital who want liquidity and always look for stoplosses of major trader's ) or the candles are totally random and some people says the chart is form by human emotion, explain what is exactly a chart including all that above points (totally random or moves according to smart money and not random)means, all movement are totally random? or previously anyone can determine were will the market going, EDIT: many of your not understood what i am telling here^ because of my english.I was asking that the chart formed was formed according to institutions and people with big capital.., or institutions also don't know what will going to happen in next hour.(in regular days.., no big news no FED problems ) and many movements while breakout, breakdown, crossing of MA's are works exactly according to TA for sometimes, because many many bots are trading, so that quick movement we see is because of bots?Don't worry about the price movements. What we can do is analyze the volume of the different time frames. So then you can get a clear picture of the movement of the market. Another thing is those movements depend on the crypto market news.  So don't too much depend on the patterns and the strategies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Timmzzy",
      "created_time": "June 10, 2023, 09:37:03 AM",
      "body": "since we all know what trading the financial markets is all about, i basically see price chart as information being put out there for everyone to see whats happening in the market, where we have a set of people BUYING and SELLING, the use of stop loss is using as a means for you not to loss all your capital trying to make gains.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}