{
  "id": "topic_5470621",
  "title": "DT_MEMBER",
  "author": "DT_MEMBER",
  "created_time": "October 17, 2023, 02:16:09 AM",
  "content": "On Monday, the crypto-focused media outlet Cointelegraph disseminated false information via social media platform X and its Telegram channel, triggering a more than 10% spike in bitcoin (BTC) value against the U.S. dollar.https://www.talkimg.com/images/2023/10/17/Rh9to.jpegThe digital currency briefly touched $29,900 per coin before plunging to $28,100 per unit once the news was debunked. Cointelegraph, despite issuing an apology, was too late to prevent the market upheaval that resulted in the obliteration of $78.92 million worth of short positions.source",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470621",
  "comments": [
    {
      "author": "mk4",
      "created_time": "October 17, 2023, 03:05:23 AM",
      "body": "Already being discussed here as it's already been pointed out by DdmrDdmr.tl;dr Cointelegraph intern screwed up, and journalists on various crypto news sites were hilariously careless as they blindly just follow follow suit without even confirming the news first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "October 17, 2023, 06:52:02 AMLast edit: October 17, 2023, 09:45:22 AM by Faisal2202",
      "body": "Quote from: DT_MEMBER on October 17, 2023, 02:16:09 AMOn Monday, the crypto-focused media outlet Cointelegraph disseminated false information via social media platform X and its Telegram channel, triggering a more than 10% spike in bitcoin (BTC) value against the U.S. dollar.The digital currency briefly touched $29,900 per coin before plunging to $28,100 per unit once the news was debunked. Cointelegraph, despite issuing an apology, was too late to prevent the market upheaval that resulted in the obliteration of $78.92 million worth of short positions.sourceI don't know what to say, but for me, it is good, I made some profit, and of course, it was not good for those who did short trade. Markets sometimes make sudden moves, and to be honest, I still have not read any news from Cointelegraph about the SEC approving the ETFs. And I am not going to check it now, just enjoy the market. Well, I also did not realize that BTC touched $29k because whenever I saw the price, it was around $28.4k, but it is good to know that approvals of such ETFs have a big impact on the market.Edit: I just checked, the ATH of yesterday was $30k not $29kIt's just like the Pi coin because we have seen its potential, and when listed by unofficial sources, we at least get the idea that if it were listed by the original sources, then it would touch $300 per coin easily. I just took it as an example.News outlets are really misusing their power, either they have done it on purpose or by mistake, but many people have lost millions of dollars. But I am quite shocked to see that those who short trade or long trade don't use stop limits, stop losses, etc. Because the market was around $26.5k and reached $29k, which is a big pump. Those guys should have stopped their trades even before BTC reached $28k.And I am still confused. If the fake news is the main cause, then why is BTC still at $28k, and why is it not coming down? People might have taken the short trades again because they knew the market would come down. What do you have to say about this?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "headingnorth",
      "created_time": "October 17, 2023, 11:29:59 AM",
      "body": "Maybe they spread the false news on purpose to liquidate the short sellers? Haha in that case they are doing the Hodlers a favor. Only idiots short bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "October 17, 2023, 11:35:55 AM",
      "body": "Quote from: DT_MEMBER on October 17, 2023, 02:16:09 AMOn Monday, the crypto-focused media outlet Cointelegraph disseminated false information via social media platform X and its Telegram channel, triggering a more than 10% spike in bitcoin (BTC) value against the U.S. dollar.The digital currency briefly touched $29,900 per coin before plunging to $28,100 per unit once the news was debunked. Cointelegraph, despite issuing an apology, was too late to prevent the market upheaval that resulted in the obliteration of $78.92 million worth of short positions.sourceQuoting for reference.Yeah, it's a fake news as what we say, but the good news is that the price really went up, and so far we are at $28,4xxx. So it really put a spike on the price, and it seems that it has sustained the run despite it being exposed as not so true news.Clearly, this is some form of manipulations from big entities, so in this market that we live in, \"bad publicity is still publicity'\". And I think this is the nature of crypto related media though, news are not verified and they are put up for click bait.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "October 17, 2023, 06:09:28 PM",
      "body": "Its a positive sign that the ETF approval will cause bitcoin to spike up even more when they decide not to spread fake news anymore, I think this is all planned out to liquidate some people in the market again, Cointelegraph will just apologise and things will go back to it's old way like nothing happened, a minute of silent for all those who got liquidated by this fake news, I really feel your pain. Manipulation like this will always show up in a bear market and that's where news have most impact on the market the most compare to a bull market, so be on the lookout as more manipulation like this will unfold, do not be too quick to react to news about crypto. Cointelegraph is also ruining their reputation as this news was able go get the best of people because it's coming from Cointelegraph, most people instantly believe it without looking for another source, also Coinmarketcap skilled the same news as this was how I read it online before even knowing that it's originally from Cointelegraph.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "October 18, 2023, 02:25:00 AM",
      "body": "Quote from: Kemarit on October 17, 2023, 11:35:55 AMQuote from: DT_MEMBER on October 17, 2023, 02:16:09 AMOn Monday, the crypto-focused media outlet Cointelegraph disseminated false information via social media platform X and its Telegram channel, triggering a more than 10% spike in bitcoin (BTC) value against the U.S. dollar.The digital currency briefly touched $29,900 per coin before plunging to $28,100 per unit once the news was debunked. Cointelegraph, despite issuing an apology, was too late to prevent the market upheaval that resulted in the obliteration of $78.92 million worth of short positions.sourceQuoting for reference.Yeah, it's a fake news as what we say, but the good news is that the price really went up, and so far we are at $28,4xxx. So it really put a spike on the price, and it seems that it has sustained the run despite it being exposed as not so true news.Clearly, this is some form of manipulations from big entities, so in this market that we live in, \"bad publicity is still publicity'\". And I think this is the nature of crypto related media though, news are not verified and they are put up for click bait.Not so surprising as this has become one of the common nature here in the cryptocurrency market...as it would sometimes be easy to make and distribute unverified news that can move the market to go up or down. Anyway, let's take this as a good news as Bitcoin seems to be enjoying the pump and staying there for now. Congrats then to those who made some money with the upswing and better luck next time to those who experienced the other side of the coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "October 18, 2023, 02:46:41 AM",
      "body": "Was Cointelegraph the root source of that wrong information? I think I read it from another tweet first before Cointelegraph posted their own tweet. But that's not just the interesting thing about this event. I think the more interesting thing about what happened is the realization on how the price could actually move in strides with a false news. This is how reactive Bitcoin could be. It can change a lot due to something that is unverified like FUD, fake news, etc. I wonder who the players in the market are that they are quick to make orders based on a piece of information that is not solid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "October 18, 2023, 03:11:24 AM",
      "body": "It's unfortunate to hear about the impact of misleading information on the Bitcoin market. This has a far-reaching effect when false news spreads. I feel bad for the short traders who were liquidated over the fake news, but I also think it's important to learn from this experience and should be more careful about where they get their information and be more skeptical of any news that seems too good to be true.It's a reminder of the importance of verifying information from multiple reliable sources before reacting to news, as the market can be extremely volatile.Do you think there should be stricter regulations to prevent such incidents? Or do you believe it’s part of the risk that comes with trading in such markets?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "October 18, 2023, 04:21:56 AM",
      "body": "Quote from: Fundamentals Of on October 18, 2023, 02:46:41 AMWas Cointelegraph the root source of that wrong information? I think I read it from another tweet first before Cointelegraph posted their own tweet. But that's not just the interesting thing about this event. I think the more interesting thing about what happened is the realization on how the price could actually move in strides with a false news. This is how reactive Bitcoin could be. It can change a lot due to something that is unverified like FUD, fake news, etc. I wonder who the players in the market are that they are quick to make orders based on a piece of information that is not solid. No the root source was apparently somebody that confirmed it was approved but they never stated the actual source. It was more like “trust me bro”.After they tweeted it got picked up by many other news sites and even hit Bloomberg. And for a moment they assumed they were correct until finally blackrock themselves said it was still pending review. Pretty sure some traders made some good profits who claimed this fake news going both ways.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "October 18, 2023, 06:17:21 AM",
      "body": "Quote from: headingnorth on October 17, 2023, 11:29:59 AMMaybe they spread the false news on purpose to liquidate the short sellers? Haha in that case they are doing the Hodlers a favor. Only idiots short bitcoin.Well, that..... or they pulled a Elon Musk with his Twitter posts about Shiba and Dodgecoin.    Now, they are blaming an Intern for this mess and probably going to sack the person for it.  It just shows us how the media can misuse it's power for whatever agenda that they are pushing. In any way.. the damage is done and some people lost and gained some money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "October 19, 2023, 01:21:52 AM",
      "body": "I read after this comes out after cointelegraph makes everyone rekt. https://cointelegraph.com/news/clarification-sharing-false-spot-bitcoin-etf-newsThey do apologize \"We are incredibly grateful for the support and trust you have placed in our publication over the last 10 years. We strive to deliver the most thoughtful, engaging and impactful news affecting the cryptocurrency space.Earlier today, during routine coverage, Cointelegraph’s social media team posted a message on X without prior editorial approval stating that the United States Securities and Exchange Commission had approved BlackRock’s iShares spot Bitcoin exchange-traded fund, or ETF. This was false, the result of misinformation. The news lead originated from an unconfirmed screenshot posted by an X user who claimed it was from the Bloomberg Terminal.\"Quote from: mk4 on October 17, 2023, 03:05:23 AMtl;dr Cointelegraph intern screwed up, and journalists on various crypto news sites were hilariously careless as they blindly just follow follow suit without even confirming the news first.I mean by watching the news what the heck, they should keep their main Twitter clean not give it to the intern or publish it without approval. It means that almost everyone has access to the account right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "October 19, 2023, 01:39:57 AM",
      "body": "Quote from: dansus021 on October 19, 2023, 01:21:52 AMI read after this comes out after cointelegraph makes everyone rektThey do apologize \"We are incredibly grateful for the support and trust you have placed in our publication over the last 10 years. We strive to deliver the most thoughtful, engaging and impactful news affecting the cryptocurrency space.I mean by watching the news what the heck, they should keep their main Twitter clean not give it to the intern or publish it without approval. It means that almost everyone has access to the account right?They made a shit show and after that, they simply made an apology and everything will be fine for everyone.Not everyone keeps their minds calm and make good decisions after making such news. Some greed people can make their bets with leverages on Margin tradings or Futures trading and they would have been rekted on exchanges already. Will Cointelegraph make any compensation financially to their victims?They did not and believed that an official apology would be enough to heal financial losses of many people who trust their news website for a long time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "October 19, 2023, 03:56:11 AM",
      "body": "With bitcoin etf approval guesses it’s always like this. I remember during the 2016 approval of the Gemini etf there was someone who said they have great knowledge that it’s approved.They said that why would they meet so and so at the Gemini office it they weren’t going to approve it. They wrote a post and many blindly followed it and all of a sudden it got rejected last minute.This has been going on for years. So when the etf is finally approved, it will be hard to believe unless the news comes out of the sec.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "October 19, 2023, 12:41:02 PM",
      "body": "We cannot always do without the effect of fake news, we are the ones that should know how we take in those news feed whenever they are coming, we need to use a verified means to know how true they are before we start spreading fake news causing the stir in the crypto environment, We should also know this that wether there's fake news or not, wether the ETF was approved or not, bitcoin market will always remain the same and it's rises or falls will continue to base on it demands and supply.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WillyAp",
      "created_time": "October 19, 2023, 12:54:37 PM",
      "body": "Quote from: mk4 on October 17, 2023, 03:05:23 AMAlready being discussed here as it's already been pointed out by DdmrDdmr.tl;dr Cointelegraph intern screwed up, and journalists on various crypto news sites were hilariously careless as they blindly just follow follow suit without even confirming the news first.The press seem to have no editor any more or that function was deleted. Speeling, Grammar, false information. Journalist would have been suspended for it 50 years ago.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Haunebu",
      "created_time": "October 19, 2023, 12:59:14 PM",
      "body": "It shook the market in a big way though the silver lining is that BTC is still trading in the $28K range instead of falling downwards into the $26K range or something which surprised me honestly speaking.It feels like a lifetime since BTC breached the $30K point sadly since it's been behaving like a stablecoin stuck in between $20K - $30K for a long time now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DooMAD",
      "created_time": "October 19, 2023, 01:07:42 PM",
      "body": "Meh.  It's the risk you take trading on rumours.  The media clearly don't exclusively report facts and haven't done so for some time.  Don't blindly trust anything published, whether it's in physical print or digital.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "October 19, 2023, 01:37:42 PMLast edit: October 19, 2023, 02:07:13 PM by Rikafip",
      "body": "Quote from: Haunebu on October 19, 2023, 12:59:14 PMIt shook the market in a big way though the silver lining is that BTC is still trading in the $28K range instead of falling downwards into the $26K range or something which surprised me honestly speaking.People know that its just a matter of time before SEC approved bitcoin ETFs so I guess those that buy it don't bother selling it. On top of that, halvening is coming. Quote from: Haunebu on October 19, 2023, 12:59:14 PMIt feels like a lifetime since BTC breached the $30K point sadly since it's been behaving like a stablecoin stuck in between $20K - $30K for a long time now.I don't know why it feels like a lifetime for you since the last time BTc went over 30k was only few months ago and if you have a feeling like that, it may mean that you are maybe following bitcoin price too much. Instead, its way more productive to see this period as an opportunity to acquire as much bitcoin as possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "October 19, 2023, 01:51:06 PM",
      "body": "I've missed the initial Cointelegraph news, but everyone makes mistakes, and it's really important to be able to admit being wrong and apologize for it. To be honest, I don't see much harm coming from this situation for the market. Perhaps Bitcoin will return to the pre-news level soon, but even that will be okay. So far, however, it's still retaining a higher price level, which is even better. What is correct is that the ETF approval chance is considered very likely, even though that Cointelegraph report has clearly jumped the gun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}