{
  "id": "topic_5456364",
  "title": "BioMoh",
  "author": "BioMoh",
  "created_time": "June 14, 2023, 07:51:04 PMLast edit: June 14, 2023, 09:27:16 PM by BioMoh",
  "content": "Made a webpage to collect all the RSI data 4H 1D 1W time frames in 2 tables for a fast scalping trading still working on 1min 5min 15min 30min also gonna add more in indicators like MA EMA BOLL VOL MACD and many others ... but that will need advanced servers and much dev works and the data gonna be server sided so no loading will be needed  , also auto pointers to tell which pairs is a hunt at the time but that would cost around 50kwebsite is : https://tradehunter.info/if anyone need a free access please pm me  donations r welcome",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456364",
  "comments": [
    {
      "author": "jeraldskie11",
      "created_time": "June 14, 2023, 09:12:00 PM",
      "body": "I don't think so if the idea is going to work. The RSI is a free indicator that can be used in a variety of exchanges. When you adjust the time frame, the RSI values will change as well. It's a little odd for me not to see the actual RSI indicator, but I can still comprehend by looking at the data. I think this will be difficult to understand for newbie traders that usually utilize RSI in their charts. However, I admire what you're doing because it allows us to see multiple RSI on a single page.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BioMoh",
      "created_time": "June 14, 2023, 09:30:06 PM",
      "body": "gonna add more indicators but still in dev ,will take some time what indicators you like to add to bring from all pairs and compare ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UchihaSarada",
      "created_time": "June 15, 2023, 01:36:52 AM",
      "body": "Quote from: jeraldskie11 on June 14, 2023, 09:12:00 PMI don't think so if the idea is going to work. The RSI is a free indicator that can be used in a variety of exchanges. When you adjust the time frame, the RSI values will change as well. It's a little odd for me not to see the actual RSI indicator, but I can still comprehend by looking at the data. I think this will be difficult to understand for newbie traders that usually utilize RSI in their charts.You can use RSI if you want to find signals for investment. Because with investment taste, you don't need signals which are too quick to show what's going on the market.With investment, you need a longer vision and RSI can give you confirmation for what happened a little bit time ago. You will join a market after it has confirmation for a trend, it is a little bit late but safer.With quicker indicators, you will response quickly with the market but those indicators match for trading more than investment. They can be not accurate too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "June 15, 2023, 08:16:26 AM",
      "body": "Quote from: BioMoh on June 14, 2023, 09:30:06 PMgonna add more indicators but still in dev ,will take some time what indicators you like to add to bring from all pairs and compare ?tradingview works well, so development in that direction is very difficult, many develop strategies based on these tools for technical analysis, but as I mentioned to you, what is the benefit that you are trying to deliver in the end? Based on that, you can determine what you are trying to develop.In general, tables are not an attractive option, so focus on charts.Give results and present them in a simple and unassuming manner.Give the user simple predictive information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "June 15, 2023, 09:21:57 AM",
      "body": "Quote from: BioMoh on June 14, 2023, 09:30:06 PMgonna add more indicators but still in dev ,will take some time what indicators you like to add to bring from all pairs and compare ?I have some questions for you that will direct other users visiting this thread1. What is the reason for this work you are doing?2. When you say it will cost 50k , are you expecting to get the money from users?3. Is the subscription free or how do you plan the subscription?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BioMoh",
      "created_time": "June 15, 2023, 07:04:58 PM",
      "body": "Quote from: palle11 on June 15, 2023, 09:21:57 AMQuote from: BioMoh on June 14, 2023, 09:30:06 PMgonna add more indicators but still in dev ,will take some time what indicators you like to add to bring from all pairs and compare ?I have some questions for you that will direct other users visiting this thread1. What is the reason for this work you are doing?2. When you say it will cost 50k , are you expecting to get the money from users?3. Is the subscription free or how do you plan the subscription?1. to hunt the perfect pair at the triggered indicator trade like if rsi in 5min + 15min  all in oversold zone so maybe its a chance for a fast scalping trade also like for KDJ MA EMA and so on .. that i want add more so im getting ideas from here  2. around 50k for the dev quality work + socket APIs access fees from all exchanges + prober hosting , not expecting that much from users but gonna add ads 3. still trying to figure out how the subs gonna work , thinking to do it for free for now",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BioMoh",
      "created_time": "June 15, 2023, 07:10:05 PM",
      "body": "Quote from: hugeblack on June 15, 2023, 08:16:26 AMQuote from: BioMoh on June 14, 2023, 09:30:06 PMgonna add more indicators but still in dev ,will take some time what indicators you like to add to bring from all pairs and compare ?tradingview works well, so development in that direction is very difficult, many develop strategies based on these tools for technical analysis, but as I mentioned to you, what is the benefit that you are trying to deliver in the end? Based on that, you can determine what you are trying to develop.In general, tables are not an attractive option, so focus on charts.Give results and present them in a simple and unassuming manner.Give the user simple predictive information.for example you have a pair that hit RSI on 4h 1d 1w under 20 , that is oversold and maybe a chance for a quick buy or long for a quick scalping so instead of opening a pair by pair in the exchange and look at all the 3 times frames at every click i just show all the work in a table rsi indicator is just a start and going to add more indicators so im taking the suggestions",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "teosanru",
      "created_time": "June 15, 2023, 07:13:38 PM",
      "body": "Quote from: BioMoh on June 14, 2023, 07:51:04 PMMade a webpage to collect all the RSI data 4H 1D 1W time frames in 2 tables for a fast scalping trading still working on 1min 5min 15min 30min also gonna add more in indicators like MA EMA BOLL VOL MACD and many others ... but that will need advanced servers and much dev works and the data gonna be server sided so no loading will be needed  , also auto pointers to tell which pairs is a hunt at the time but that would cost around 50kwebsite is : https://tradehunter.info/if anyone need a free access please pm me  donations r welcome  Does it makes sense to check Technical indicators of a coin which is actually pegged and there are people who control it's supply? Also it's a very obvious thing that when BTC's RSI will go into an oversold zone USDT's RSI will always move up towards the over bought zone. So why should we see the stablecoin chart and not the crypto chart?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BioMoh",
      "created_time": "June 15, 2023, 08:45:39 PM",
      "body": "its free now for everyone",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "June 16, 2023, 01:19:11 PM",
      "body": "Quote from: BioMoh on June 14, 2023, 07:51:04 PM~snipped~Generally, nobody likes to hear they should pay for what they can get for free by simply hitting their keyboard online. If you're asking users here for donations for indis that are free by default, then you're more likely not getting anyone. If you want to sell indis, why not work your trading plan and code it into an indi by yourself. Also, I don't think there's anything as oversold or overbought positions when it comes to trading. What looks oversold or over bought to you, judging from the type of indicator you've may look nowhere close to it from another's perspective.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}