{
  "id": "topic_5405347",
  "title": "merticinak",
  "author": "merticinak",
  "created_time": "July 06, 2022, 06:04:07 AM",
  "content": "Bitstamp, Aktif Olmayan Hesaplardan Ücret AlacakKripto para borsaları, yaşadıkları zor durumları geride bırakmak için yeni iş modelleri duyurmaya devam ediyor. Kripto borsası Bitstamp, aktif olmayan hesaplardan ücret almaya başlayacağını duyurdu.Bitstamp, Yeni Kullanıcı Ücreti Kararını AçıkladıKripto para borsalarının günlük işlem hacimlerinin düşmesi, kripto para borsaları üzerindeki baskıyı artırıyor. Kripto borsası Bitstamp, aktif olmayan kullanıcılarından maliyeti telafi etmek için ücret almaya başlayacağını belirtti. Şirket tarafından yayımlanan blog gönderisinde, son 12 ayda platformda işlem yapmayan, para yatırmayan ve hesap bakiyesi 200 doların altında olan kullanıcılardan “Hareketsizlik Ücreti” alınacağı duyuruldu. Şirket bu tür hesaplardan aylık 10 Euro talep edeceğini açıkladı. Şirket tarafından yapılan açıklamada, yeni uygulamanın 1 Ağustos 2022 tarihinden itibaren devreye gireceği ve şirketin ABD kullanıcılarının bu uygulamadan muaf olacağı açıklandı. Şirket açıklamasında “Bitstamp müşterilerinin çoğu “Hareketsizlik Ücretinden” etkilenmez ifadesini kullandı. Şirket açıklamasında devamında şu ifadeleri kullandı:\"Ücretleri kimse sevmiyor (biz de sevmiyoruz!) ama sistemimizde etkin olmayan hesaplar bulundurmak bir maliyettir ve tüm müşterilerimiz için harika hizmetler sunabilmeye devam edebilmek için Hareketsizlik Ücretini uygulama konusunda zor bir karar aldık.\"Kaynak:BTCHaber",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405347",
  "comments": [
    {
      "author": "Pierre 2",
      "created_time": "July 06, 2022, 09:13:18 AM",
      "body": "Resmen ölüm fermanını imzalamış hayatımda bu kadar saçma bir karar duymadım. İnsanlar banka aidatlarından sıkılıp bıkmıştı. Kripto para borsalarının bir işlevi de bankalardan kaçış olmaktaydı. Şimdi adamlar bitcoin birazcık düştü diye maliyetlerin altından kalkamıyoruz açıklaması yapıyor. Bu olayın Türkiye de kafelerde uygulanan işgal parası saçmalığından hiçbir farkı yok bana göre.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "July 07, 2022, 03:32:15 AM",
      "body": "hareketsiz hesapların çoğu da aslında zarar yazan kullanıcılara ait hesaplar... ayı piyasasında çarpılan ve \"zarar kes\" nedir bilmeyen küçük yatırımcılar genellikle hesaplarını nadasa bırakarak psikolojik açıdan rahatlamayı seçiyor. ben cep telefonundan borsa uygulamasını silerek kendini ekrandan uzak tutmaya çalışan insanlar tanıyorum.bitstamp bu uygulaması ile aslında piyasadan darbe yemiş kullanıcıların neredeyse tamamına ikinci bir darbe indiriyor. bu yüzden habere konu olan düzenlemeyi kötü bir uygulama olarak değerlendiriyorum. bitstamp kullanıcısı değilim, eğer bitstamp kullanıcısı olsaydım kesinlikle yatırımlarımı başka bir borsaya taşırdım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jotunheimr",
      "created_time": "July 10, 2022, 02:19:58 AM",
      "body": "gördüğüm en saçma şey olabilir gerçekten, patlayacak gibi duruyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gerceklerisoyleyen",
      "created_time": "July 10, 2022, 06:09:46 PM",
      "body": "Quote from: Pierre 2 on July 06, 2022, 09:13:18 AMResmen ölüm fermanını imzalamış hayatımda bu kadar saçma bir karar duymadım. İnsanlar banka aidatlarından sıkılıp bıkmıştı. Kripto para borsalarının bir işlevi de bankalardan kaçış olmaktaydı. Şimdi adamlar bitcoin birazcık düştü diye maliyetlerin altından kalkamıyoruz açıklaması yapıyor. Bu olayın Türkiye de kafelerde uygulanan işgal parası saçmalığından hiçbir farkı yok bana göre.Diğer tüm borsalarda aynı şeyi yaparsa ne yapacan mecbur ödeyeceksin. Bence cogu borsa birgün böyle birşey yapabilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "July 11, 2022, 02:24:07 PM",
      "body": "Bitstamp veri saklama masraflarını bahane ederek hareketsizlik ücreti adı altında saçma bir ücret almak yerine belirlediği sürenin üzerinde hareketsiz kalan ve bakiyesi boş olan hesapları silebilir. Bu çok daha adil bir çözüm olur. Kullanıcı bitstamp üzerinde işlem gerçekleştirdiğinde ömür boyu abonelik sözleşmesi imzalamıyor, normal şartlar altında o ücreti alamazlar. Muhtemelen amaçladıkları şey aktif olmayan kullanıcıların cüzdanlarındaki bakiyeleri hareketsizlik ücreti adı altında sıfırlamak, bu ücretlendirme değil kılıfına uydurulmuş dolandırıcılık girişimidir. Kullanıcılara verilerinin silineceği tarihi belirten bir bilgilendirme yaparsınız önemsiyorlarsa zaten borsa üzerindeki varlıklarını boşaltırlar daha sonra kullanıcıya ait veriler silinerek bahsedilen yük ortadan kaldırılmış olur.Quote from: Gerceklerisoyleyen on July 10, 2022, 06:09:46 PMDiğer tüm borsalarda aynı şeyi yaparsa ne yapacan mecbur ödeyeceksin. Bence cogu borsa birgün böyle birşey yapabilir.Ortada çok büyük bir pasta varken ve bu pastadan dilim kapmaya çalışan yüzlerce borsa girişimi varken hiç biri kullanıcılara adil olmayan bir ödemeyi dayatamaz. Dayatan borsalar da küçülerek yok olmaya mahkum olurlar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Balmain",
      "created_time": "July 11, 2022, 05:30:25 PM",
      "body": "Bu stratejiyle para kazanmayı yada tasarruf etmeyi mi planlıyorlar kripto ekonomisinde çok tezat bir uygulama kararı almışlar, yakın zamanda bu karardan dönerlerse kendilerinin hayrına olur yoksa yakın zamanda böyle bir borsa olmaz hacim olarak içine düşüş içerisine girerler ardından patlak verirler. Senin hizmetini kullanmam başka merkezi borsa kullanır yatırımcıda. Sanki piyasada teklermiş gibi düşünüyorlar herhalde.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "September 22, 2022, 05:47:53 PM",
      "body": "Quote from: Gerceklerisoyleyen on July 10, 2022, 06:09:46 PMDiğer tüm borsalarda aynı şeyi yaparsa ne yapacan mecbur ödeyeceksin. Bence cogu borsa birgün böyle birşey yapabilir.diğer tüm borsalar aynı şeyi yaparsa kullanıcıların tercihini marka değeri gibi faktörler belirler ve bu durumda binance gibi başat borsalar yine en çok kullanılan borsalar olurlar. başka borsalar sinek avlarken akıllarına rekabet etme fikri gelirse bu saçma uygulamanın kendilerine zarar verdiğini düşünerek komisyonları daha düşük seviyeye çekmeyi ya da tamamen yok etmeyi akıl edebilirler ve pastadan pay kapmayı başarabilirler. :)rekabet olmasaydı sosyal adaleti sağlayamazdık, ekonomik kazanımlar verimsiz olurdu ya da maksimum fayda elde edilemeyeceği için belirsiz bir zeminde şekillenirdi. iyi ki bitstamp saçma sapan bir tercihte bulunduğu için diğer borsalar onu takip etmek gibi bir hataya düşmüyor. :)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lboss",
      "created_time": "September 30, 2022, 07:06:51 PM",
      "body": "Quote from: merticinak on July 06, 2022, 06:04:07 AMBitstamp, Aktif Olmayan Hesaplardan Ücret AlacakKripto para borsaları, yaşadıkları zor durumları geride bırakmak için yeni iş modelleri duyurmaya devam ediyor. Kripto borsası Bitstamp, aktif olmayan hesaplardan ücret almaya başlayacağını duyurdu.Bitstamp, Yeni Kullanıcı Ücreti Kararını AçıkladıKripto para borsalarının günlük işlem hacimlerinin düşmesi, kripto para borsaları üzerindeki baskıyı artırıyor. Kripto borsası Bitstamp, aktif olmayan kullanıcılarından maliyeti telafi etmek için ücret almaya başlayacağını belirtti. Şirket tarafından yayımlanan blog gönderisinde, son 12 ayda platformda işlem yapmayan, para yatırmayan ve hesap bakiyesi 200 doların altında olan kullanıcılardan “Hareketsizlik Ücreti” alınacağı duyuruldu. Şirket bu tür hesaplardan aylık 10 Euro talep edeceğini açıkladı. Şirket tarafından yapılan açıklamada, yeni uygulamanın 1 Ağustos 2022 tarihinden itibaren devreye gireceği ve şirketin ABD kullanıcılarının bu uygulamadan muaf olacağı açıklandı. Şirket açıklamasında “Bitstamp müşterilerinin çoğu “Hareketsizlik Ücretinden” etkilenmez ifadesini kullandı. Şirket açıklamasında devamında şu ifadeleri kullandı:\"Ücretleri kimse sevmiyor (biz de sevmiyoruz!) ama sistemimizde etkin olmayan hesaplar bulundurmak bir maliyettir ve tüm müşterilerimiz için harika hizmetler sunabilmeye devam edebilmek için Hareketsizlik Ücretini uygulama konusunda zor bir karar aldık.\"Kaynak:BTCHaberhttps://blog.bitstamp.net/post/bitstamp-cancels-plans-to-charge-inactivity-fee/Ücretten vazgeçmiş. Konuyu kilitleyebilirsek güzel olur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Red Pie",
      "created_time": "October 10, 2022, 07:51:43 PM",
      "body": "Quote from: Lboss on September 30, 2022, 07:06:51 PMQuote from: merticinak on July 06, 2022, 06:04:07 AMBitstamp, Aktif Olmayan Hesaplardan Ücret AlacakKripto para borsaları, yaşadıkları zor durumları geride bırakmak için yeni iş modelleri duyurmaya devam ediyor. Kripto borsası Bitstamp, aktif olmayan hesaplardan ücret almaya başlayacağını duyurdu.Bitstamp, Yeni Kullanıcı Ücreti Kararını AçıkladıKripto para borsalarının günlük işlem hacimlerinin düşmesi, kripto para borsaları üzerindeki baskıyı artırıyor. Kripto borsası Bitstamp, aktif olmayan kullanıcılarından maliyeti telafi etmek için ücret almaya başlayacağını belirtti. Şirket tarafından yayımlanan blog gönderisinde, son 12 ayda platformda işlem yapmayan, para yatırmayan ve hesap bakiyesi 200 doların altında olan kullanıcılardan “Hareketsizlik Ücreti” alınacağı duyuruldu. Şirket bu tür hesaplardan aylık 10 Euro talep edeceğini açıkladı. Şirket tarafından yapılan açıklamada, yeni uygulamanın 1 Ağustos 2022 tarihinden itibaren devreye gireceği ve şirketin ABD kullanıcılarının bu uygulamadan muaf olacağı açıklandı. Şirket açıklamasında “Bitstamp müşterilerinin çoğu “Hareketsizlik Ücretinden” etkilenmez ifadesini kullandı. Şirket açıklamasında devamında şu ifadeleri kullandı:\"Ücretleri kimse sevmiyor (biz de sevmiyoruz!) ama sistemimizde etkin olmayan hesaplar bulundurmak bir maliyettir ve tüm müşterilerimiz için harika hizmetler sunabilmeye devam edebilmek için Hareketsizlik Ücretini uygulama konusunda zor bir karar aldık.\"Kaynak:BTCHaberhttps://blog.bitstamp.net/post/bitstamp-cancels-plans-to-charge-inactivity-fee/Ücretten vazgeçmiş. Konuyu kilitleyebilirsek güzel olur.Saçmalıktı zaten hocam. neden aylık 10 euro ücret alsın ki? o borsayı o adamlar bir daha hiç kullanmazlar. bir de abd müşterileri bundan muaftır saçmalığı nedir? birine karşı aldığın bir tavrı tüm ülke üyelerine karşı almalısın. arada pozitif ayrımcılık yapılamaz, yapmamalısın. neyse ki isabetli bir düşünce ile vazgeçmişler sonunda.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "October 10, 2022, 08:18:27 PM",
      "body": "Quote from: Red Pie on October 10, 2022, 07:51:43 PMSaçmalıktı zaten hocam. neden aylık 10 euro ücret alsın ki? o borsayı o adamlar bir daha hiç kullanmazlar. bir de abd müşterileri bundan muaftır saçmalığı nedir? birine karşı aldığın bir tavrı tüm ülke üyelerine karşı almalısın. arada pozitif ayrımcılık yapılamaz, yapmamalısın. neyse ki isabetli bir düşünce ile vazgeçmişler sonunda. Amerikan vatandaşları genellikle denetimler yada izinler konusunda dünyanın geri kalanından farklı statüde olduğu için başlangıçta onları hariç tutmuş olabilirler. Bir Türk kullanıcıdan ekstra ücret talep edildiğinde hiç kimsenin bunun hesabını sormayacağını bildikleri için problem yok. Pozitif ayrımcılıktan ziyade bir zorunluluk olabilir.Borsalar arası rekabet bu kadar yüksek seviyedeyken kullanıcılardan inaktiflik için ücret talep etmek bilinçli olarak yarışın dışında kalmak demekti. Yanlış değişiklikten vazgeçmiş olmaları iyi olmuş.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "November 29, 2022, 10:17:14 AM",
      "body": "Etkin olmayan bir hesabın nasıl bir maliueti olabilir ki sanki blockchain'deki bakieyeleri pezevenkler kendi cebinde taşıyor. Bana göre açıklamalarının türkçesi şu kardeşim bizde bakiyelerinizle üç beş birşeyler yapıyoruz ama bugün yarın siz bakiyeyi almak istediğinizde bu bizde olmayabilir. Biz bunun altında kalkamayız diyor.Diğer türlü veritabanında duran bir verinin nasıl bir maliyeti olabilir. Salak herifler adamlar sana gelmiş üye olmuş bedava müşterin kapındayken kapı önüne koymanın başka bir açıklaması olamaz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "December 01, 2022, 12:44:21 PM",
      "body": "Uzun süre hareket etmeyenlerin coinlerini borsada bekletmesi çok yanlış bi davranış. Borsa hacklenebilir. Ve varlıklar sıfırlanabilir. Hodl edilen coin delist edilebilir. Delist edilen coinler bazen cüzdana yansıtılmıyor. Support ile iletişime geçmeniz gerekiyor. Binance'ın support'u bile çok yavaş. Ötekiler daha yavaş. Bi keresinde supoorttan günlerce cevap beklediğimi hatırlıyom. Bu risklerle karşılaşmaktansa coinlerimizi private key'ine sahip olduğumuz cüzdanlara çekmeliyiz. Hiç sorun yaşamayız o zaman. Hem de ücret talep etseler bile paramıza el koyamazlar. Çünkü siz ücret ödemek istemeseniz de otomatik çekim yapabilirler. Kriptoparaların felsefesinden ayrıldıkça sorunlar yumak gibi büyüyor farkındaysanız.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}