{
  "id": "topic_5473233",
  "title": "PrivacyG",
  "author": "PrivacyG",
  "created_time": "November 07, 2023, 02:58:05 PM",
  "content": "Pretty much self explanatory.  How do you do it?Here is my way.  I mostly pushed away and pulled out of relationships with people who seem to stand against my beliefs.  Instead of convincing them I just moved on.  I found that a lot of those who do not believe in my choice of investment and think I will fail are the same people who never listen.  Know it alls who rather put you down and disregard your feelings with no logical reasoning.  Sometimes it feels like they envy you or some thing.I believe this is a healthy way of handling your environment.  Keep negativity outside your bubble.  Only keep close to you people who give you the ambition and optimism to continue.  Not sure how many of you believe in this.  But manifesting negativity has always brought negative outcome in my life.  Surrounding myself by positive thoughts and positive people has brought a strong source of light all the time.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473233",
  "comments": [
    {
      "author": "Fivestar4everMVP",
      "created_time": "November 07, 2023, 03:08:34 PM",
      "body": "Well, you asked and answered yourself, and your answer is completely the same thing I would do if I find myself in the same shoe.Actually, I've been in this very same situation on several occasions in my life, it's probably the reason why I don't actually have physical friends who I roll with or chill out with, my major friends happen to be people online I've never meet before, but sure plan to meet someday, and why, simple, because they believe in what I believe in, we share not just opportunities with each other, but also share ideas, help one another in terms of need and so, yeah, we trust ourselves that much.I can't keep people who do not believe in what I believe in as friends, what exactly are we going to be discussing when we sit to have a chat if not arguing all the time, I cant keep such people around me as friends, for example, when we are supposed to be discussing on what strategies we must to make sure we make maximum profit from the coming bitcoin bull run, we will rather be arguing if bitcoin is legit or a scam, simply because they do not believe in bitcoin, I avoid such people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "November 07, 2023, 03:45:02 PM",
      "body": "Quote from: PrivacyG on November 07, 2023, 02:58:05 PMPretty much self explanatory.  How do you do it?It's my money and I'll do what I want with it! When folks start lecturing me, I just remind myself why I got into crypto in the first place.  Ive done my research, and I truly believe in it, and  the average joe probably doesn't understand Bitcoin like I do.  As more and more corporations and big investors get on board, perceptions will start to change.  For now the haters can laugh while I fill my digital wallets.  I get why some people think it's sketchy or unreliable.  But it's my decision, and I gotta trust my gut.  My portfolio, my choice.  I know the risks and I believe the reward is worth it.  The world is adapting and so am I.  You gotta get ahead of the curve or get left behind these days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "November 07, 2023, 03:52:42 PM",
      "body": "Quote from: PrivacyG on November 07, 2023, 02:58:05 PMPretty much self explanatory.  How do you do it?Here is my way.  I mostly pushed away and pulled out of relationships with people who seem to stand against my beliefs.  Instead of convincing them I just moved on.  I found that a lot of those who do not believe in my choice of investment and think I will fail are the same people who never listen.  Know it alls who rather put you down and disregard your feelings with no logical reasoning.  Sometimes it feels like they envy you or some thing.You don't needd to convince anyone.What would you think if someone is trying to convince you to buy some stock? A friend could be telling you that buying tesla is amazing, that it is revolutionary and so on... and lots of people made money and so on. But you don't care.It is just annoying Let people do whatever they wish with their money. It is their business,  not yours.You can share your feelings and opinions   , specially if people are curious and interested about it. But don't try to push",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "November 07, 2023, 03:57:07 PM",
      "body": "Quote from: PrivacyG on November 07, 2023, 02:58:05 PMPretty much self explanatory.  How do you do it?Less talk on my side and I’m just living with the benefits of Bitcoin to me. I believe on action speaks louder than voice. I have a lot of profit from Bitcoin investments which I use to purchase some properties that I can’t purchase using my salary alone without my Bitcoin investment. I never tell anyone how I get my property but they knew that I invest on Bitcoin since I invited them before but they didn’t accept it seriously.They are now the one keep asking me how to invest but I never talk to them seriously too since I don’t want to be blame if Bitcoin incurred loses to them. I just let them DYOR on their own and I’m happy to become their inspiration on why they will enter Bitcoin even though we don’t interact directly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "November 07, 2023, 03:59:13 PM",
      "body": "You don't need to forcedly convince anyone, once or twice is enough. The fact bitcoin hits new ATH from time to time is a strong proof how bitcoin investments will change someone's financial status in the long run from those past few years stats.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "November 07, 2023, 04:05:04 PM",
      "body": "Simply wait for me to make some good profits, convert them to Fiat, buy something cool and show off, and let them know It's a gift from Bitcoin.That's how they will understand and will believe, however, they will have to wait for a complete cycle which is the fee they pay for not believing in you.Also, you can never force anyone to invest or believe in something. Imagine someone else forcing you to buy stocks of AAPL? Haha.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "November 07, 2023, 04:05:16 PM",
      "body": "Rule #1 don't talk money / finances with people unless they ask 1st.Rule #2 if they argue / disagree with what they say explain rule #1 that they asked 1st.Rule #3 then state, 'what I am doing works for what I need and what I am doing at the moment, if you disagree that is your right, but for now I am not going to change'Rule #4 if they keep talking....change the subject.And the most important rule.....never talk about how much $ / BTC / whatever you have.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "November 07, 2023, 04:09:57 PM",
      "body": "Quote from: PrivacyG on November 07, 2023, 02:58:05 PMInstead of convincing them I just moved on.I believe this is a healthy way of handling your environment.  Keep negativity outside your bubble.  Only keep close to you people who give you the ambition and optimism to continue.  Not sure how many of you believe in this.  But manifesting negativity has always brought negative outcome in my life.  Surrounding myself by positive thoughts and positive people has brought a strong source of light all the time.Just move on with those people.You don't have to try too much to convince them anything. You can try, only one time and if they don't believe in what you said, let's move on. They have own brains to gain knowledge, and if they don't do this, don't believe in Bitcoin like you, it's not your business.But if some days they come back, knock your doors and ask you to teach them about Bitcoin, how to invest in Bitcoin, you know, it's the time. The time to take profit because a new all time high, a top of big bull run of cryptocurrency market will be nearly touched soon or already touched.Because when those people come back, mostly they don't have believe, don't change, it is mostly because they become greed but as Warren Buffet said \"Be greed when others are fearful and be fearful when others are greed\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "November 07, 2023, 04:16:34 PM",
      "body": "I don't remember informing non bitcoin investors about my investment in bitcoin. Personally, I discuss bitcoin with bitcoin users. Being discouraged can be bad for people who wish to hold bitcoin. Since, they'll always hold us back from investing into bitcoin, because they fail understand how it works. It's not conducive to tell them about our moves in the first place. Hence, for those who open up to others about their moves in bitcoin, it's important to follow Op's advise. As not taking our choice can be detrimental to us on the long run, when we've seen that their advises only made us to lose out on huge profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "November 07, 2023, 04:21:15 PM",
      "body": "Quote from: DaveF on November 07, 2023, 04:05:16 PMRule #1 don't talk money / finances with people unless they ask 1st.And the most important rule.....never talk about how much $ / BTC / whatever you have.This two rules are termed the golden rule to a be a successful bitcoiner. I have in the past been saying out this rule that it is bad flaunting around your bitcoin holdings or bitcoin knowledge many naive people or rather bitcoin FUDsters would certainly use this against you and there many people that say no it’s bad because one isn’t advocating for bitcoin with this attitude of keeping mute until people ask. It is, bitcoin is strong enough to advertise it self and with the ever growing crisis of the fiat many by themselves will come towards to embrace bitcoin. It is even much easier to educate people who bring the subject matter themselves than you presenting it. Speak about bitcoin to only interested people and stay away from FUDsters it would even protect you more against physical assault like hacks or kidnappings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "November 07, 2023, 04:52:30 PM",
      "body": "Quote from: Fivestar4everMVP on November 07, 2023, 03:08:34 PMI can't keep people who do not believe in what I believe in as friends, what exactly are we going to be discussing when we sit to have a chat if not arguing all the time, I cant keep such people around me as friends, for example, when we are supposed to be discussing on what strategies we must to make sure we make maximum profit from the coming bitcoin bull run, we will rather be arguing if bitcoin is legit or a scam, simply because they do not believe in bitcoin, I avoid such people. You actually can keep friends with divergent views and opinions. Well, maybe, I should've said I could. I've friends who have heard of Bitcoin but aren't keen on pursuing an investment in it. I don't have any ish with friends like that, provided they aren't talking down on my business. Everyone knows their boundaries and how to keep them and then we're good. Anything short of that, or any of them trying to convince me otherwise will definitely result in me keeping them at arms length. It's that simple.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "November 07, 2023, 04:53:13 PM",
      "body": "This is a classic problem that keeps happening with people who seem to be successful with Bitcoin, but those who don't know think it's done fraudulently, by betting or something like that and they try to deny all that success. I myself as a crypto activist who has been active since 2016 feel a lot of different perspectives or judgments on myself because I can buy anything using crypto or Bitcoin. I get noticed and talked about every day, thinking I'm a bookie and stuff like that. Negative accusations began to appear, and until then I explained that I was a crypto activist who was active in the forum and became an investor and trader. They didn't even care about that explanation and still assumed I was making money the wrong way.Dealing with people like that is better to keep quiet, do our work, and continue to grow until they become very jealous, and in the end, many want to join and start an investment or join this forum. But in the end, they can't do it. Working in crypto or something like that is a choice, no need to listen to what others say.They are just jealous of the success that has been achieved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "November 07, 2023, 04:56:42 PM",
      "body": "You did well OP, there is no point staying around such people, if you pretend as if you want to be with them and listen to them, they will end up discouraging you about Bitcoin, I've lost lot of friends who turn me into laughing stock because I was so focused on Bitcoin, they called me names behind my back and that's because I couldn't further my studies while they can. When things gets better I just ignore them, and now they are the ones feeling hurt because they are been ignored by me, someone who cares about our friendship planned to settle things between us but they never changed, they still goes their old way, now it's not about me wasting my time on Bitcoin, it's not about Bitcoin dying one day and nothing left for me to fall back on..Sometimes you just happen to have enemies as your friend, you won't know until you start doing better than them, that's when they will reveal their true form to you, instead of them joining me, they choose to hate on me, and there is a saying that goes like this.If you can't beat them, you have to join them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alani123",
      "created_time": "November 07, 2023, 04:58:09 PM",
      "body": "This isn't something one should have to cope with. I believe in my financial decisions and know I've taken risks to an extent that my financial situation can afford me to. Being in bitcoin since 2013 I was criticized for supporting this industry when all you would hear about it on the news was about criminality and terrorism. Bitcoin has come to be much more accepted since then but... What you do with your own money is your own thing. If people can't accept your freedoms maybe they're the problem. It's your responsibility to care for yourself, sure. But so long as you are capable of taking care of yourself perfectly well, it's no one else's business to criticize you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "November 07, 2023, 05:11:01 PM",
      "body": "Quote from: PrivacyG on November 07, 2023, 02:58:05 PMPretty much self explanatory.  How do you do it?Don't really care about those in the surrounding environment when it comes to decisions made, including decisions about choosing investments. Those who know me are in the Bitcoin interaction space every day even though his view is a little condescending, I don't care about it.My life, I live it. Regarding social matters, I do what is appropriate for living in the surrounding environment.I choose Bitcoin, that's my decision. They didn't choose Bitcoin, that's their right.If they finally came to me and asked to explain everything about Bitcoin being my choice, I would wonder how far they wanted it from me.Privacy related to my Bitcoins, I will always keep them confidential.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "November 07, 2023, 05:16:29 PM",
      "body": "I have same issues with these guys and of all people they are the ones who actually are financially unstable. In-laws are the worse and they keep bugging me to buy land that I have no idea of handling and I'm not even from that place. And then kept asking about my plans and when I told them I planned to start mining coins, the frown on their faces showed they were not with me.Thank god I never have to talk to them. I stay away from those guys. All the while I learned they had a dispute over land with their relatives. This man has never bought land in his entire life but managed to wait for his old ma to die and get his inheritance to which they now have disputes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "November 07, 2023, 05:25:22 PM",
      "body": "I cope very fine around people who don't believe in BTC, and the fact that i believe in BTC and they don't, doesn't mean they don't believe in me personally, they just don't believe in my choice of BTC. I do not try to talk about BTC to them or convince them to buy, the few times we talked about it, it was they who asked me to explain what BTC is, which i did but they lost interest very early. Everyone must not believe or use BTC, there are things that people in my circle use and believe in, which i don't; that is life and i don't think things like these should come in the way of personal relationships.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BITCOIN4X",
      "created_time": "November 07, 2023, 05:25:34 PM",
      "body": "Stay away, yes, I will stay away from those who do not have support for what I am fighting for. Bitcoin is both a currency and an investment asset that has the possibility of generating returns. They have absolutely no right to veto me leaving bitcoin unless bitcoin is illegal to own and invest in under the law, but since bitcoin is legal then I don't think they have any right to change my interests.Of course we don't need to be enemies because they don't support what we are fighting for, simply put; they never take any responsibility for our future, success and failure. Only ourselves are fully responsible for the future, success and failure while trying and praying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "November 07, 2023, 05:36:16 PM",
      "body": "I don't think I have to stay away from people who aren't adept of Bitcoin investment, neither live inside a bubble. That sounds pretty unhealthy and extremist. People can have their own views on Bitcoin that are completely different from mine and still be very optimistic and friendly ones who I enjoy being together. We will just not touch on Bitcoin subject with each other. I respect them and they respect me.After all, I don't think Bitcoin is an ideology or lifestyle that influence a relationship so deeply. It's a digital currency or asset and this isn't the kind of thing which has potential to prejudice a good relationship between friends or relatives.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}