{
  "id": "topic_5441395",
  "title": "Nheer",
  "author": "Nheer",
  "created_time": "February 27, 2023, 10:56:51 AM",
  "content": "Every bitcoin transaction's history is recorded in a ledger. Maintaining a copy of the blockchain and routinely scanning for new transactions and blocks to validate are required by a node.-What duties must a node perform in order to be regarded a complete network node?-How do nodes pass information or communicate with each other across the bitcoin network. -Also need assistance in understanding how peers of the bitcoin type are able to confirm transactions without keeping a complete copy of the bitcoin ledger.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441395",
  "comments": [
    {
      "author": "Yamane_Keto",
      "created_time": "February 27, 2023, 03:51:49 PM",
      "body": "Quote from: Nheer on February 27, 2023, 10:56:51 AM-What duties must a node perform in order to be regarded a complete network node?you can run full node software on any hardware but running it on weak hardware, may cuz some problems, so you need Minimum HW requirements and stable internet connection.you may find more here https://github.com/bitcoinbook/bitcoinbook/blob/develop/ch03.asciidocRegarding the question in the title, when the block is mined, the miners add all the unconfirmed transactions in the mempool with a total that does not exceed max block size and thus you get one confirmation. Mining more blocks above it increases the number and so on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "February 27, 2023, 07:51:46 PM",
      "body": "Quote from: Yamane_Keto on February 27, 2023, 03:51:49 PMwhen the block is mined, the miners add all the unconfirmed transactions in the mempool with a total that does not exceed max block sizeThere is no requirement for miners to add as many unconfirmed transactions as they can fit in to their block, and indeed, there is no requirement for miners to add any transactions at all other than the coinbase transaction to their block. It is not that rare to see empty blocks being mined which contain only the coinbase transaction and nothing else. There have been two such blocks within the last 24 hours - 778,469 and 778,448.Usually this happens when a miner finds a block very soon after receiving the previous block. They have not yet fully verified the previous block, so rather than have their equipment sitting idle they simply attempt to mine an empty block for a few seconds until they have verified the previous block and updated their UTXO sets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Macadonian",
      "created_time": "February 28, 2023, 01:29:37 AM",
      "body": "Quote from: Nheer on February 27, 2023, 10:56:51 AM-What duties must a node perform in order to be regarded a complete network node? It has to have a copy of the complete Blockchain up to date which it will send and recieve from other nodes to make sure that it is exactly the same this verifies that the Blockchain is consistent and there is no one exploiting to trying to change the consensus. When transactions are made it has to compare them to to other nodes. It has to broadcast new transactions to other nodes as well as its most recently downloaded blocks to ensure that it has the same copy as other nodes. Any thing less then this means it is a partial node. Nodes have to be connected to the internet but you can do it with VPN or Tor if you wish.Quote from: Nheer on February 27, 2023, 10:56:51 AM-How do nodes pass information or communicate with each other across the bitcoin network. They send information directly to other nodes and not to a centralized server so your node needs to allow sending data to other nodes and receive other date. It then validates them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "February 28, 2023, 10:39:44 AM",
      "body": "Quote from: Macadonian on February 28, 2023, 01:29:37 AMWhen transactions are made it has to compare them to to other nodes.This does not happen. When a transaction is broadcast to a node, a node will attempt to verify it against its own code and protocols. If it is successfully verified, then the node will broadcast it to other nodes. These other nodes will perform the same internal verification before broadcast it on. At no point does a node compare the transaction to other nodes and ask for their feedback.Quote from: Macadonian on February 28, 2023, 01:29:37 AMIt has to broadcast new transactions to other nodes as well as its most recently downloaded blocks to ensure that it has the same copy as other nodes.Again, nodes don't compare their recent blocks to other nodes. They simply receive a new block, attempt to verify it, and if it verifies successfully then add it to their chain. This is how chain splits can happen when 2 or more equally valid blocks are mined at the same height. If nodes compared their chains to each other then there would have to be some mechanism for resolving the split before the next block is mined, which there isn't (and indeed, can't be in a decentralized system).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}