{
  "id": "topic_5438595",
  "title": "dkbit98",
  "author": "dkbit98",
  "created_time": "February 07, 2023, 09:29:22 PMLast edit: May 03, 2024, 08:39:18 AM by dkbit98",
  "content": "Trezor just announced they are starting to test CoinJoin with their devices, and they called everyone who owns Trezor Model T to participate if they want!They didn't post more information about this, but judging by questions asked in their form this will happen in February, and you need to send them your email address (use alternative temp email for this).You will receive invitation to join a Google Meets conference call on test day., and Trezor claims they will delete this record when testing ends, within 30 days at the latest.Dates and times for testing are:- February 15, 15:00 UTC- February 22, 17:00 UTChttps://satoshilabs.typeform.com/coinjointestingAccording to information I saw on Trezor github page, you will have to download latest Trezor Suite v23.2.1 pre-release that have option to test CoinJoin with Bitcoin testnet.https://github.com/trezor/trezor-suite/releasesIt sucks that Trezor Model One is not enough for CoinJoin, but I would like to see explanation why we can't use Model One.This is what Trezor support said about this on reddit:QuoteAt the moment Trezor Model One does not support CoinJoin, as we are still exploring options of the implementation.https://www.reddit.com/r/TREZOR/comments/10w0jfx/comment/j7kuzv1I will use this topic to post all the information from Trezor testing, and people who join this testing can write their own experience.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5438595",
  "comments": [
    {
      "author": "OROBTC",
      "created_time": "February 07, 2023, 09:51:49 PM",
      "body": "...That's interesting as well as very good news dkbit98.I'd be interested to hear comments and results after their testing is done.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "February 08, 2023, 01:33:01 AM",
      "body": "I was eagerly expecting to finally be able to test the coinjoin functionality but I have got no Trezor Model T.  I hope Satoshilabs can find a solution to give support to its original model, it would be a pity if they started to neglect it right when the most exciting parts of this technology are supposed to be at the reach of those with a tight budget.thanks for bringing this information, though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "February 08, 2023, 05:11:56 AM",
      "body": "Sounds like interesting news and also a bit of a strange change of direction for a company who obliged to give users the opportunity to denonymise themselves in the Netherlands a few years back with one of their updates (only took them a few days to decide to roll that back). Quote from: Hispo on February 08, 2023, 01:33:01 AMI was eagerly expecting to finally be able to test the coinjoin functionality but I have got no Trezor Model T.  I hope Satoshilabs can find a solution to give support to its original model, it would be a pity if they started to neglect it right when the most exciting parts of this technology are supposed to be at the reach of those with a tight budget.It sounds like it'll become available on both soon enough. I'd be happy with the idea model T gets it a few months (3-6) before the one gets it (it's not like we're paying a subscription or anything either for these updates).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "February 08, 2023, 09:41:46 PM",
      "body": "Quote from: Hispo on February 08, 2023, 01:33:01 AMI hope Satoshilabs can find a solution to give support to its original model, it would be a pity if they started to neglect it right when the most exciting parts of this technology are supposed to be at the reach of those with a tight budget.I don't think they are neglecting Trezor One model, but coinjoin transactions need more processing power with memory and model One is getting old for that.It's more likely they are going to focus on supporting new generation Trezor hardware wallet and Trezor Model T, but I wouldn't mind if they release Trezor model Two with small upgrades.I am certainly not going to buy Trezor Model T for more than $200 just because of new CoinJoin feature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "February 09, 2023, 06:04:02 PM",
      "body": "Model One does not even support Monero.  I doubt it will handle Coin Joins properly.  It seems like it can pretty much only handle the very basics before its hardware throttles.Interesting addition to Trezors.  Coin Joins in their Suite next to Tor would be a very useful utility.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "February 09, 2023, 08:54:03 PM",
      "body": "Quote from: dkbit98 on February 07, 2023, 09:29:22 PMIt sucks that Trezor Model One is not enough for CoinJoin, but I would like to see explanation why we can't use Model One.The only thing that I could find by browsing their repo was the following issue that implied having conflicts with something: Quote from: https://github.com/trezor/trezor-suite/issues/6609CoinJoin account and all related functionality will be available for Trezor T only, not for Trezor One.Prevent all potential conflicts.Quote from: dkbit98 on February 08, 2023, 09:41:46 PMbut I wouldn't mind if they release Trezor model Two with small upgrades.Based on this \"pull request\", I think their upcoming model that \"I mentioned in the past\" might actually be the improved version of Model One.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "February 10, 2023, 01:03:56 AM",
      "body": "Quote from: dkbit98 on February 08, 2023, 09:41:46 PMQuote from: Hispo on February 08, 2023, 01:33:01 AMI hope Satoshilabs can find a solution to give support to its original model, it would be a pity if they started to neglect it right when the most exciting parts of this technology are supposed to be at the reach of those with a tight budget.I don't think they are neglecting Trezor One model, but coinjoin transactions need more processing power with memory and model One is getting old for that.It's more likely they are going to focus on supporting new generation Trezor hardware wallet and Trezor Model T, but I wouldn't mind if they release Trezor model Two with small upgrades.I am certainly not going to buy Trezor Model T for more than $200 just because of new CoinJoin feature.Even though it makes sense from a development and financial point of view they focus in the news generation, some people (like me) spending over 200$ for a cold wallet is a bit out of the budget...Still have some hope they may eventually find a way so I won't let out if the privacy party.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "February 10, 2023, 10:54:02 AMLast edit: February 10, 2023, 05:13:57 PM by dkbit98",
      "body": "Quote from: PrivacyG on February 09, 2023, 06:04:02 PMModel One does not even support Monero.  I doubt it will handle Coin Joins properly.  It seems like it can pretty much only handle the very basics before its hardware throttles.You are right and I was thinking the same thing, but I was not expecting ancient Trezor One device to be one trick pony If I was in Trezor team I would make new device with similar price (code name Trezor2) that could do everything like Trezor model T but in same old Trezor One package.This should be possible with upgraded processor and small design changes, but I would still keep Trezor One active for firmware updates.Quote from: SFR10 on February 09, 2023, 08:54:03 PMBased on this \"pull request\", I think their upcoming model that \"I mentioned in the past\" might actually be the improved version of Model One.I think this new Trezor model R is going to be their new generation wallet with their own secure element, and I am sure it's going to be much more expensive than current wallets they are offering.Quote from: Hispo on February 10, 2023, 01:03:56 AMEven though it makes sense from a development and financial point of view they focus in the news generation, some people (like me) spending over 200$ for a cold wallet is a bit out of the budget...I could agree with you few years ago, but with raging inflation and increased prices of everything we saw in last few years, $200 today is not the same like $200 few years ago.And if someone is holding several Bitcoins than I see no reason why this amount of money would be such a big problem, but then again I always remember this meme:EDIT:Dates and times for Trezor CoinJoin testing are:- February 15, 15:00 UTC- February 22, 17:00 UTC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "February 11, 2023, 01:36:51 AM",
      "body": "Quote from: dkbit98 on February 10, 2023, 10:54:02 AMQuote from: Hispo on February 10, 2023, 01:03:56 AMEven though it makes sense from a development and financial point of view they focus in the news generation, some people (like me) spending over 200$ for a cold wallet is a bit out of the budget...I could agree with you few years ago, but with raging inflation and increased prices of everything we saw in last few years, $200 today is not the same like $200 few years ago.And if someone is holding several Bitcoins than I see no reason why this amount of money would be such a big problem, but then again I always remember this meme:...I agree with your point of view, but what I say I said it from the perspective of someone that already owns a Trezor model One. I am not sure if it would be worth it to pay over 200$ for some extra features. It sounds more suitable for someone who plans to purchase a Trezor for the fist time.Perhaps, as months and years pass by, Switching to a Model T will make even more sense, specially if more features are added, for now, the most tempting thing on model T is support on monero.Also, weirdly enough, we have not heard anything on Satoshilab's new generation of wallets yet...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "March 15, 2023, 08:00:11 PM",
      "body": "Anyone using Trezor hardware wallet should go ahead and install latest update for Trezor Suite v23.3.2, and update firmware for Trezor Model One v1.12.1.Note that firmware update won't show up until you first update Trezor Suite, but good news is that Model One could support Coinjoin after this update.Trezor added support for Ledger Live legacy derivation path, and they fixed several bugs related with fees in this update:https://github.com/trezor/trezor-suite/releaseshttps://trezor.io/learn/a/trezor-device-firmware-update-march-2023",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "March 18, 2023, 01:12:50 AM",
      "body": "Quote from: dkbit98 on March 15, 2023, 08:00:11 PMAnyone using Trezor hardware wallet should go ahead and install latest update for Trezor Suite v23.3.2, and update firmware for Trezor Model One v1.12.1.Note that firmware update won't show up until you first update Trezor Suite, but good news is that Model One could support Coinjoin after this update.Trezor added support for Ledger Live legacy derivation path, and they fixed several bugs related with fees in this update:https://github.com/trezor/trezor-suite/releaseshttps://trezor.io/learn/a/trezor-device-firmware-update-march-2023I was about comment on this the other day, but you were way faster than me.I am happy to see that Satoshilabs is at least willing to try and implement this feature on Trezor one as well, and it makes sense, since for obvious reasons, the model one is by far their most popular product.  No all their user base is willing/able to jump onto the next generation of HW. Eager to see how it goes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "March 18, 2023, 09:18:26 AM",
      "body": "Quote from: dkbit98 on March 15, 2023, 08:00:11 PMbut good news is that Model One could support Coinjoin after this update.Considering that we're talking about one of the oldest HWs out there and their \"previous statement\", I'm surprised they're trying to make it also work on the T1 [other so-called popular brands (cough...Led, cough...ger) should take note].Quote from: dkbit98 on March 15, 2023, 08:00:11 PMhttps://trezor.io/learn/a/trezor-device-firmware-update-march-2023It seems that they forgot to mention how the \"QR Code for Bech32 addresses\" now appears on the tiny screen of Model one... Because of incompatibility issues with some apps and wallets, they had to change the upper-case Bech32 addresses into lowercase and this resulted in having more complex QR codes [a bit harder to scan] on that tiny screen [not sure why there are such issues for something that it's case-insensitive].I've already labeled this address to not use it in the future, so I'm not worried about privacy matters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "March 31, 2023, 02:42:41 PM",
      "body": "Quote from: Hispo on March 18, 2023, 01:12:50 AMI was about comment on this the other day, but you were way faster than me.I am happy to see that Satoshilabs is at least willing to try and implement this feature on Trezor one as well, and it makes sense, since for obvious reasons, the model one is by far their most popular product.  I still have no confirmation that is is actually going to work properly but it's really amazing that ancient device and first ever hardware wallet can do everything you need from device like this.Now let's compare that with other poplar brand that always change size of their apps, retire devices like old dirty socks all the time, collect bunch of money to introduce new shitcoins...I am not saying Trezor is perfect and I don't recommend anyone to buy this device in 2023, but I really like how they are handling things.Quote from: SFR10 on March 18, 2023, 09:18:26 AMIt seems that they forgot to mention how the \"QR Code for Bech32 addresses\" now appears on the tiny screen of Model one... Because of incompatibility issues with some apps and wallets, they had to change the upper-case Bech32 addresses into lowercase and this resulted in having more complex QR codes [a bit harder to scan] on that tiny screen [not sure why there are such issues for something that it's case-insensitive].I guess we need external screen add-on for Trezor One, preferably FullHD IPS",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "April 04, 2023, 07:50:28 PM",
      "body": "Quote from: dkbit98 on March 31, 2023, 02:42:41 PMQuote from: Hispo on March 18, 2023, 01:12:50 AMI was about comment on this the other day, but you were way faster than me.I am happy to see that Satoshilabs is at least willing to try and implement this feature on Trezor one as well, and it makes sense, since for obvious reasons, the model one is by far their most popular product.  I still have no confirmation that is is actually going to work properly but it's really amazing that ancient device and first ever hardware wallet can do everything you need from device like this.Now let's compare that with other poplar brand that always change size of their apps, retire devices like old dirty socks all the time, collect bunch of money to introduce new shitcoins...I am not saying Trezor is perfect and I don't recommend anyone to buy this device in 2023, but I really like how they are handling things.Well, I hope it works because that would be the icing on the cake for a device like the Trezor One.  I like how Satoshilabs manage their products and keep the updates coming for the old device, one must wonder how long it will take for them to stop supporting it. On one hand, they take advantage for marketing purposes the fact this is the \"original hardware wallet\", on the other hand if the market in the future does not longer demand the model one, then they may find themselves forced to focus on newer generations.In my opinion the selling point is the relatively cheap price for the reputation and reliability it offers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wind_FURY",
      "created_time": "April 07, 2023, 10:38:19 AM",
      "body": "Quote from: OROBTC on February 07, 2023, 09:51:49 PM...That's interesting as well as very good news dkbit98.I'd be interested to hear comments and results after their testing is done.Me too! Although, I'm curious how they're going to implement CoinJoin in their wallet-suite when it's officially released. Will they accept the trade-off and have the same implementation as Wasabi Wallet did to avoid problems with government, or will they accept ALL outputs through their coordinator?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "April 12, 2023, 04:43:06 PMLast edit: April 12, 2023, 05:18:34 PM by OmegaStarScream",
      "body": "Trezor just announced that they are officially launching CoinJoins a week from now (19th of April) which should work with the Trezor One model [2] just fine.[1] https://twitter.com/Trezor/status/1646154374605938688[2] https://twitter.com/Trezor/status/1646171007550468096",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "April 12, 2023, 05:23:23 PM",
      "body": "That are awesome news and will make it way harder to track Bitcoin. Bitcoin mixers are good, but coinjoin that has a lot of users is still way better in my oppinion. Would love to see other wallet manufacturers to jump on that train and implement coin join also in their existing wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "April 12, 2023, 08:36:31 PM",
      "body": "Quote from: OmegaStarScream on April 12, 2023, 04:43:06 PMTrezor just announced that they are officially launching CoinJoins a week from now (19th of April) which should work with the Trezor One model [2] just fine.I received email from Trezor today and they are starting with CoinJoins from April 19th.It would be amazing to have oldest and first ever hardware wallet with this feature, but they made a mistake and Trezor One won't be supporting CoinJojn from this release  They didn't gave any further explanation why and when they will fix this, but i expect more details about it on April 19th.https://twitter.com/Trezor/status/1646229506535964673",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "April 14, 2023, 06:01:20 PM",
      "body": "I just saw their Twitter announcement about the upcoming coinjoin implementation and wanted to share it here, but the news is already out.I took a look at the comments to see what the general mood among the users are. One guy called Chris Blec asked them straight if Chainalysis will have their say in the coinjoin process, but Trezor didn't feel like replying. Another funny comment says that Chainalysis is coming on 19 April to Trezor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}