{
  "id": "topic_5423467",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "November 26, 2022, 11:47:58 PM",
  "content": "Quote(Bloomberg) -- FTX’s viral Super Bowl ad featured multiple versions of a deeply skeptical Larry David. In light of the cryptocurrency exchange’s collapse, his fellow celebrities might have done well to heed his advice.The creator of Seinfeld and Curb Your Enthusiasm is among the slew of stars being sued for promoting FTX’s services and products. The lawsuits allege they lured unsophisticated investors into the debacle.Legal experts say the celebrities’ prominence and wealth make them a juicy target for investors looking to recover some of their losses, with the company and co-founder Sam Bankman-Fried essentially broke. FTX put itself and more than 100 affiliates into bankruptcy proceedings this month, shielding them from suits. The promoters, who aren’t in bankruptcy court, have no such protection. “A lawsuit against celebrities will generate a ton of money, because they will all settle,” said John Reed Stark, former chief of the US Securities and Exchange Commission’s Office of Internet Enforcement. “It’s one thing to make your fans buy your T-shirt with your face on it. It’s another to tout something that causes them to lose their life savings.”At least three lawsuits have been filed since FTX’s implosion, including one that seeks to represent “thousands, if not millions, of consumers nationwide.” Tom Brady, Gisele Bundchen, Stephen Curry, Shaquille O’Neal and businessman and TV personality Kevin O’Leary are also among the defendants.The celebrities could be liable if the investors can prove they failed to disclose that they were being paid to promote the crypto exchange or had invested in the company, or were hawking unregistered securities. The pending lawsuits are in federal court in Miami and San Francisco.The stars’ representatives didn’t respond to requests for comment on the lawsuits.FTX’s sudden collapse cost US investors more than $11 billion, according to the Miami lawsuit filed Nov. 15. The platform, with 5 million users worldwide, traded more than $700 billion of crypto last year. “The celebrities’ liability hinges mainly on whether the products they promoted are securities,” said Shane Seppinni, who represents people suing over alleged corporate abuse and who isn’t involved in the FTX cases. If FTX’s yield-bearing accounts, which pay interest on crypto holdings, are found to be securities, “then the celebrities who promoted them could be on the hook for big damages,” he said.To determine whether a given item constitutes a security, courts tend to fall back on the Howey Test. It gets its name from a 1946 Supreme Court decision defining a security as “an investment of money in a common enterprise with profits to come solely from the efforts of others.” If the item in question meets that definition, the court held, then it doesn’t matter “whether the enterprise is speculative or nonspeculative, or whether there is a sale of property with or without intrinsic value.” The Texas State Securities Board’s director of enforcement, Joseph Rotunda, filed a declaration last month that the yield-bearing accounts are an offering of unregistered securities. And promoting securities without disclosing the source, nature or amount of compensation would violate securities law. On Monday, Rotunda said his office was scrutinizing the payments the celebrities received and any disclosures made.“We are taking a close look at them” as part of the regulator’s broader probe into FTX’s failure, he said.Brady and Bundchen joined the company’s $20 million ad campaign in 2021 and made a commercial -- “FTX. You In?” -- showing them urging acquaintances to join up. They also took equity stakes in FTX Trading Ltd., according to the Miami complaint.O’Leary, of ABC’s Shark Tank and CNBC’s Money Court, was both an investor in and a paid spokesman for FTX. He and tennis star Naomi Osaka, who has also been sued, both promoted FTX’s interest-bearing accounts, in which Elliott Lam, a Canadian living in Hong Kong, invested and lost $750,000, according to his proposed class action lawsuit in San Francisco.David’s comic persona and quirky role in the Super Bowl ad may prove oblique enough to beat the litigation, legal experts said. The commercial featured him as a skeptic of other inventions, such as the Sony Walkman and, earlier, the wheel. “Don’t be like Larry,” the ad cautioned. It made FTX one of the most retweeted brands during the game, lawyers for the investor in the Miami complaint said. But the only allegation about the comedian “is that Larry David appeared in a commercial,” said attorney Brian Levin. “I don’t see how that, in and of itself, would give rise to liability.”Stark, the former SEC internet enforcement chief, finds “the irony” that David played characters in the ad who keep saying no -- including to FTX -- “glaring.” “There’s enough celebrities to choose from,” he said. “I’d probably leave him off, so as not to muddy the waters.”As the impact of FTX’s fall unfolds, more lawsuits are expected to roll in against Bankman-Fried and celebrity endorsers from the US and elsewhere, including South Korea, Singapore and Japan, where many of the investors are based, said attorney Demetri Bezaintes. The law firm that filed the Miami complaint filed another proposed class action suit in South Florida a week later.This isn’t the first time celebrities have found themselves in hot water over crypto promotions. Kim Kardashian and Floyd Mayweather Jr. were sued in Los Angeles over their promotion of the EthereumMax token. In a tentative ruling on Nov. 7, the judge dismissed the lawsuit, saying the defendants hadn’t promoted the tokens as a security.Kardashian agreed last month to pay $1.3 million, and not to tout digital assets for three years, to settle SEC claims that she broke the rules by promoting the token without disclosing that she was being paid. Mayweather and music producer DJ Khaled were accused of violating securities laws by failing to disclose payments they received to promote initial coin offerings on social media in 2018. Both settled with the SEC, with Mayweather paying more than $600,000 and Khaled dropping more than $150,000.https://www.msn.com/en-us/money/companies/from-tom-brady-to-shaq-ftxs-celebrity-promoters-may-be-on-the-hook-for-damages/ar-AA14sMzh....Not certain how this will play out. If nothing else, I hope this encourages celebrities to do a better job screening and vetting platforms they endorse. The lawsuit against Kim Kardashian and Floyd Mayweather Jr for promoting ethereummax as a security was thankfully dropped. As ETH was not classified as a security during the time when either celebrity endorsed it.Celebrities promoting crypto platforms dates back to the ICO days. Floyd Mayweather Jr. was involved in ICOs. Mike Tyson owned bitcoin ATMs at one point in time. Could liability in these cases become a hot topic in the future? There was a case in years past where Oprah Winfrey promoted a brazilian faith healer who was later exposed for being involved in human trafficking. There appears to not be much liability for promoting those types of scams of illegal projects. While liability for promoting other things could be somewhat disproportionate in distribution.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5423467",
  "comments": [
    {
      "author": "adaseb",
      "created_time": "November 27, 2022, 05:24:29 AM",
      "body": "I don’t think they have a case here.In the past some celebrities like Kardashian were sued because they advertised a product and didn’t state that they were being paid to promote it. These tv commercials are completely different because obviously you know they were being paid to promote it. So I don’t think they will have much of a case. Sbf basically fooled many people and it’s not surprisingly that celebrities didn’t know about his true colors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "November 27, 2022, 06:43:03 AM",
      "body": "I don't think it is practically possible! These people are just a bunch of celebrities and not business mogul. So there's no way for them to know how an exchange is being handled or where they are investing their money. It's not their job to be honest! A brand needs to create trust and aspirational values and hence they approach celebrities to promote their platform or services. Celebrities do it for money! They have no control on the business. So it's very wrong if legal charges is thrown on them. Regardless whether an asset is a security or a commodity or whatever it is! It's not good to target celebrities just because they have promoted a product or service which later turned bad. They are not GOD, so there's no way for them to know what the future holds!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "November 27, 2022, 11:11:10 AM",
      "body": "The most important thing is HOW FTX was promoted by those celebrities. As some sort of \"magical investment\" that guarantees profits or as a normal financial business? In the first case, this can be seen as an misleading advertisement. Misleading the FTX investors and traders with false promises is more than enough for a lawsuit. However, the blame should be put predominantly on the FTX marketing team, not on the celebrities, because they simply got paid to participate in a bunch of commercials. I don't think that Tom Brady or Shaq knew that FTX was actually a big pile of shit before promoting the company.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "November 27, 2022, 11:40:49 AM",
      "body": "QuoteThe celebrities could be liable if the investors can prove they failed to disclose that they were being paid to promote the crypto exchange or had invested in the company, or were hawking unregistered securities. The pending lawsuits are in federal court in Miami and San Francisco.These lawsuits are most likely frivolous and based on the astronautically low chance that one of these celebrities had inept lawyers/agents who didn't tell their clients that they're required to disclose the entities they advertise. Granted they followed proper law and disclosed they were getting compensated, they should not be held liable. Sets up bad precedents to target advertisers if they themselves were not knowingly advertising something fraudulent. It's not merely enough that they should've known, but that they actually did know. Of course, anyone with any common sense of how these exchanges work would realize the FTX was being run by children and was bound to collapse at some point. Additionally, consumers also should stop providing patronage to companies for the sole reason of celebrity endorsement. It's nonsense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "November 27, 2022, 04:04:20 PM",
      "body": "I think these celebrities that endorses scams and potential projects that will turn into a nightmare don't do they research. It's like that they've been given a figure and they're in awe with that amount so they accept the job offer for endorsing those projects.There's certainly wrong with those celebrities that have made it with those advertisements that later on turned into false projects. While these scammers capitalizes them by just feeding them with an amount that they won't refuse, these lawsuits that have been filed for the first ones will serve as a warning for those that might also take the same path.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "November 27, 2022, 04:11:13 PM",
      "body": "I'm saddened by what they experienced. Imagine it, FTX was reputable way before this blow-up and misuse of the funds they have and having the issues with the other companies that SBF has and all those. Many people probably have a lot of trust because it was reputable before in terms of its image. After all, they are doing a lot for the crypto community by helping other firms, etc. It's just that there are deeper problems with their situation, and now it has come up; the consequences should be on SBF because it's his fault, to begin with. Celebrities probably become more cautious with representing any crypto-related things, but it's believable. It's going to be complex and unpredictable with what's going to happen. Adopting crypto with the masses would be even more complicated with everything happening.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}