{
  "id": "topic_5447342",
  "title": "SunshineFreedom",
  "author": "SunshineFreedom",
  "created_time": "April 03, 2023, 06:14:38 AM",
  "content": "When I send a transaction with Electrum Wallet, how do I view my outgoing bitcoin wallet address?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447342",
  "comments": [
    {
      "author": "nc50lc",
      "created_time": "April 03, 2023, 06:21:04 AM",
      "body": "Do you mean the address where you've sent bitcoins to?If so, Go to 'History' tab, double-click on the transaction (not on the 'description' row or it'll edit it) and the \"Outputs\" without yellow highlight are the address(es) where you've sent bitcoins.Or the address used as inputs?If so, those are the \"Inputs\" of the outbound transaction.If you mean \"Receiving Addresses\", you can enable the tab in \"Show->View Addresses\" and an 'Addresses' tab will show up containing a list of your 'receiving' and 'change' addresses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SunshineFreedom",
      "created_time": "April 03, 2023, 12:13:32 PM",
      "body": "Bob sends 1 Bitcoin to Mary on Electrum WalletWho does Mary think the Bitcoin came from?  What address does she think is Bob's?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "April 03, 2023, 12:59:10 PM",
      "body": "Quote from: SunshineFreedom on April 03, 2023, 12:13:32 PMWho does Mary think the Bitcoin came from?Mary shouldn't reuse addresses, so if she gave the address to Bob, she knows the Bitcoin came from Bob.QuoteWhat address does she think is Bob's?Play around on a few block explorers, I think that will answer your questions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "April 03, 2023, 10:34:17 PM",
      "body": "Quote from: SunshineFreedom on April 03, 2023, 06:14:38 AMWhen I send a transaction with Electrum Wallet, how do I view my outgoing bitcoin wallet address?This is the same as question if you called someone on a phone what is his phone number... you can't send someone bitcoin unless you know receiving/outgoing bitcoin address.You can easily see everything in Electrum wallet tabs, addresses, transactions, balance, etc.Quote from: SunshineFreedom on April 03, 2023, 12:13:32 PMWho does Mary think the Bitcoin came from?  What address does she think is Bob's?What's up with all this weird questions after waking up from 2022?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SunshineFreedom",
      "created_time": "April 04, 2023, 12:06:24 AM",
      "body": "Right, that's what I'm asking.  What is the address/phone number it's sent from?  Under addresses tab, I thought these are my receiving addresses, what's the outgoing?Because if I look at the outputs on the blockchain, it's a bunch of addresses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "IIrik11",
      "created_time": "April 04, 2023, 05:47:43 AM",
      "body": "Quote from: SunshineFreedom on April 04, 2023, 12:06:24 AMRight, that's what I'm asking.  What is the address/phone number it's sent from?  Under addresses tab, I thought these are my receiving addresses, what's the outgoing?Because if I look at the outputs on the blockchain, it's a bunch of addresses.you receive 1 bitcoin in address 1u sent half a bitcoin to someone else, the outgoing address was address 1 which u received 1 bitcoin to.but u only sent half a bitcoin, so the half bitcoin which is still urs would be in a change address.when u send the next time, this change address will be the one u send from.the outgoing address (source) can only be which contains the coins.not the empty address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "April 04, 2023, 06:52:45 AM",
      "body": "Quote from: SunshineFreedom on April 04, 2023, 12:06:24 AMRight, that's what I'm asking.  What is the address/phone number it's sent from?  Under addresses tab, I thought these are my receiving addresses, what's the outgoing?Because if I look at the outputs on the blockchain, it's a bunch of addresses.Look at the inputs instead of the outputs.What's your angle? In the past year, you've opened several topics trying to sell Bitcoin and altcoins, and now you make it look like you don't even understand the basics of a Bitcoin transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "April 04, 2023, 07:34:31 AM",
      "body": "Quote from: SunshineFreedom on April 03, 2023, 06:14:38 AMWhen I send a transaction with Electrum Wallet, -snip-Quote from: SunshineFreedom on April 03, 2023, 12:13:32 PMBob sends 1 Bitcoin to Mary on Electrum WalletWho does Mary think the Bitcoin came from?  What address does she think is Bob's?So you're Bob in this scenario, then the answer is the second part of my original reply.In Electrum, it's in the transaction details' list of inputs.If Mary is also using Electrum, she wouldn't have to guess since her receiving addresses should have green highlight,the non-highlighted address(es) should be Bob's unless he's used some sort of coin control, CoinJoin or custodial wallets, etc.In Bob's Electrum, he'll also see highlighted addresses (green: receiving / yellow: change) that'll differentiate his receiving and change addresses from the unrelated ones.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "April 04, 2023, 10:55:32 PM",
      "body": "Quote from: SunshineFreedom on April 03, 2023, 12:13:32 PMBob sends 1 Bitcoin to Mary on Electrum WalletWho does Mary think the Bitcoin came from?  What address does she think is Bob's?Every transaction successfully made on the Electrum wallet it will automatically change and generate a new address, there's an \"input\" and \"output\" address, and it will generate another address after the transaction.  If Bob will reuse the same address you can easily determine the transaction that comes from him, so focus on the \"output\" transaction because that is how you'll determine where it comes from.  Electrum Wallet has this more privacy feature and the reason I liked it most. You can check the transaction ID through blockchair.com you'll see there the Senders and the Recipients addresses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abdussamad",
      "created_time": "April 05, 2023, 11:57:13 AM",
      "body": "There are no from addresses in bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "April 05, 2023, 12:52:48 PM",
      "body": "Quote from: SunshineFreedom on April 03, 2023, 12:13:32 PMWho does Mary think the Bitcoin came from?  What address does she think is Bob's?Ask Bob the txid, then just look at the input address(es) from that transaction in tx-explorer. It can consist of 1 or more addresses but still in one txid. If Mary doesn't receive any bitcoins other than Bob at the same time or after, then the last bitcoin Mary received was from Bob.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "April 05, 2023, 06:09:21 PM",
      "body": "Quote from: SunshineFreedom on April 04, 2023, 12:06:24 AMRight, that's what I'm asking.  What is the address/phone number it's sent from?  Under addresses tab, I thought these are my receiving addresses, what's the outgoing?You are asking bunch of hypothetical questions that don't make any sense, and if you continue doing this I will have to ignore you.Quote from: LoyceV on April 04, 2023, 06:52:45 AMWhat's your angle? In the past year, you've opened several topics trying to sell Bitcoin and altcoins, and now you make it look like you don't even understand the basics of a Bitcoin transaction.It looks like severe case of amnesia or account changing hands to me, but I would be much more worried if he was higher ranked account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "April 05, 2023, 08:38:01 PM",
      "body": "Quote from: SunshineFreedom on April 04, 2023, 12:06:24 AMRight, that's what I'm asking.  What is the address/phone number it's sent from?  Under addresses tab, I thought these are my receiving addresses, what's the outgoing?Because if I look at the outputs on the blockchain, it's a bunch of addresses.Wallets typically show only receiving addresses by default, as displaying anything else would not make much sense.As for \"outgoing\" addresses, they are essentially the same as the receiving address, but with an unspent transaction output (UTXO) from previous transactions. If you want to see the sender's address for a specific transaction, you can use one of the blockchain explorers, such as blockchair.com.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "April 05, 2023, 10:44:11 PM",
      "body": "Quote from: SunshineFreedom on April 03, 2023, 12:13:32 PMBob sends 1 Bitcoin to Mary on Electrum WalletQuote from: SunshineFreedom on April 04, 2023, 12:06:24 AMBecause if I look at the outputs on the blockchain, it's a bunch of addresses.For you the sender (Bob): the addresses you see in the outputs field are the recipient address (Mary's) and your change address.For the recipient (Mary): to know the address(es) of the sender, she needs to copy the transaction ID and look it up on any blockexplorer. The sender's address(es) is listed in the inputs field.Note: there is no way for Mary to be 100% sure that the sender is Bob unless he is the only one she gave her address to or if he signs a message with the sending address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}