{
  "id": "topic_5468246",
  "title": "Bitstackerslacker",
  "author": "Bitstackerslacker",
  "created_time": "September 27, 2023, 03:45:27 AM",
  "content": "Just a question, anybody who used KYC during LBC operation all those trades under that person's name is usually filed in their database ready for request from the tax man aka IRS or HMRC (if British)Now that local bitcoin is dead....I remember it gave people an option to delete their account. If some one did. Does that now mean any trades during its operation are not recoverable by the tax man?Since technically nobody would be able to answer the request from LBC since no employees and the account information people had a chance to delete just before it shutdown.does that mean any record requested from a tax office is now a dead end?Asking for a friend ofc ofc",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468246",
  "comments": [
    {
      "author": "zasad@",
      "created_time": "September 27, 2023, 11:40:35 AM",
      "body": "Quote from: Bitstackerslacker on September 27, 2023, 03:45:27 AMJust a question, anybody who used KYC during LBC operation all those trades under that person's name is usually filed in their database ready for request from the tax man aka IRS or HMRC (if British)Now that local bitcoin is dead....I remember it gave people an option to delete their account. If some one did. Does that now mean any trades during its operation are not recoverable by the tax man?Since technically nobody would be able to answer the request from LBC since no employees and the account information people had a chance to delete just before it shutdown.does that mean any record requested from a tax office is now a dead end?Asking for a friend ofc ofcI will try to explain to you the principle of declaring and paying taxes.If you received income under your law, you would be required to file a tax return and pay taxes.If you want to cheat your tax office and reduce your tax or not pay tax at all, because they won't be able to check your income due to the closure of the exchange, then you need to be sure of this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstackerslacker",
      "created_time": "September 27, 2023, 08:44:15 PM",
      "body": "Quote from: zasad@ on September 27, 2023, 11:40:35 AMQuote from: Bitstackerslacker on September 27, 2023, 03:45:27 AMJust a question, anybody who used KYC during LBC operation all those trades under that person's name is usually filed in their database ready for request from the tax man aka IRS or HMRC (if British)Now that local bitcoin is dead....I remember it gave people an option to delete their account. If some one did. Does that now mean any trades during its operation are not recoverable by the tax man?Since technically nobody would be able to answer the request from LBC since no employees and the account information people had a chance to delete just before it shutdown.does that mean any record requested from a tax office is now a dead end?Asking for a friend ofc ofcI will try to explain to you the principle of declaring and paying taxes.If you received income under your law, you would be required to file a tax return and pay taxes.If you want to cheat your tax office and reduce your tax or not pay tax at all, because they won't be able to check your income due to the closure of the exchange, then you need to be sure of this.The entire point of this post is asking what happens to KYC when the business goes bust and there is no employees and if they delete accounts do they delete KYC information. Alot of exchanges going bust and I'm curious",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HeRetiK",
      "created_time": "September 28, 2023, 08:53:33 AM",
      "body": "Quote from: Bitstackerslacker on September 27, 2023, 08:44:15 PMThe entire point of this post is asking what happens to KYC when the business goes bust and there is no employees and if they delete accounts do they delete KYC information. Alot of exchanges going bust and I'm curious Businesses are often required to keep documents a certain amount of years even after going out of operation, though to what extend will vary from country to country.Regardless of that, even if a defunct company deletes your KYC data, it doesn't necessarily mean that it is gone. It could still be stored in a government database somewhere or other third parties -- sometimes KYC gets outsourced to other companies so these might still have copies. And of course there's always the possibility of a data breach.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "September 28, 2023, 09:33:47 AM",
      "body": "Quote from: Bitstackerslacker on September 27, 2023, 08:44:15 PMQuote from: zasad@ on September 27, 2023, 11:40:35 AMQuote from: Bitstackerslacker on September 27, 2023, 03:45:27 AMJust a question, anybody who used KYC during LBC operation all those trades under that person's name is usually filed in their database ready for request from the tax man aka IRS or HMRC (if British)Now that local bitcoin is dead....I remember it gave people an option to delete their account. If some one did. Does that now mean any trades during its operation are not recoverable by the tax man?Since technically nobody would be able to answer the request from LBC since no employees and the account information people had a chance to delete just before it shutdown.does that mean any record requested from a tax office is now a dead end?Asking for a friend ofc ofcI will try to explain to you the principle of declaring and paying taxes.If you received income under your law, you would be required to file a tax return and pay taxes.If you want to cheat your tax office and reduce your tax or not pay tax at all, because they won't be able to check your income due to the closure of the exchange, then you need to be sure of this.The entire point of this post is asking what happens to KYC when the business goes bust and there is no employees and if they delete accounts do they delete KYC information. Alot of exchanges going bust and I'm curious I understand you, but if you want to play games with your tax office, then you must be a professional and be sure that the tax office does not have data from Local Bitcoins.First, find out how many years the deadline for a tax crime expires in your country.And if you consider the fact that LocalBitcoins was registered in Europe (Finland) and you made exchanges with KYC and to your bank cards, which is very unreasonable. Then you need to have more compelling excuses if government agencies ask you questions.In Russia there are gaps in the laws, and if I work on the exchange with my KYC data, but there are no bank transfers to my bank accounts, then I can say that my data was stolen and I am innocent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "October 03, 2023, 09:06:49 AM",
      "body": "Quote from: Bitstackerslacker on September 27, 2023, 08:44:15 PMThe entire point of this post is asking what happens to KYC when the business goes bust and there is no employees and if they delete accounts do they delete KYC information. Alot of exchanges going bust and I'm curious Rest assured that any KYC data or personal documents submitted to exchanges will be a copy of it in the hands of the government and they will not delete it for a long time, most likely never. All this data is stored and used whenever needed.Even exchanges or services that claim to be decentralized collect information about you through your browser such as IP and other information and use it upon request.Remember the MetaMask incident how they blocked Russian users when the Russian-Ukrainian war started even though they were claiming that they did not have access to user data. And also the Chipmixer incident.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "October 04, 2023, 05:07:46 PM",
      "body": "It's not always a matter of information availability. The government may know that a citizen has income, but in order to hold the citizen accountable there must be a procedure in accordance with the law. In my country, tax inspectors usually scare a citizen and ask him to agree to a fine, but when citizens come there with lawyers, the conversation is completely different.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "October 05, 2023, 12:05:46 AM",
      "body": "Quote from: Bitstackerslacker on September 27, 2023, 08:44:15 PMThe entire point of this post is asking what happens to KYC when the business goes bust and there is no employees and if they delete accounts do they delete KYC information. Alot of exchanges going bust and I'm curious I'm not sure what exactly happens in other countries, but I have a suspicion that defunct business in my country likely sold their data to other parties. My phone number which was never used in other businesses suddenly got spammed by a lot of people. I'm pretty sure crypto businesses are more aggressive with it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "October 05, 2023, 07:09:53 AM",
      "body": "Quote from: Bitstackerslacker on September 27, 2023, 03:45:27 AM-snip-does that mean any record requested from a tax office is now a dead end?For some time they must have kept all archives of the user's activities. They also will not escape regulatory scrutiny and inspection before actually closing the company. But their policies may not allow regular users to contact them again post-closure without being accompanied by someone from enforcement or a law firm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "October 05, 2023, 07:30:44 AM",
      "body": "Quote from: Bitstackerslacker on September 27, 2023, 08:44:15 PMThe entire point of this post is asking what happens to KYC when the business goes bust and there is no employees and if they delete accounts do they delete KYC information. Alot of exchanges going bust and I'm curious Exchanges are usually offloading their KYC verification services to third party providers, who I'm sure have a data retention policy for a minimum number of years.I am not suspecting the case to be any different from LocalBitcoins, as the government could still subpoena whoever was handling KYC for LocalBitcoins for any individual's documents should they need them for whatever reason.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "October 05, 2023, 12:22:12 PM",
      "body": "Quote from: NotATether on October 05, 2023, 07:30:44 AMQuote from: Bitstackerslacker on September 27, 2023, 08:44:15 PMThe entire point of this post is asking what happens to KYC when the business goes bust and there is no employees and if they delete accounts do they delete KYC information. Alot of exchanges going bust and I'm curious Exchanges are usually offloading their KYC verification services to third party providers, who I'm sure have a data retention policy for a minimum number of years.I am not suspecting the case to be any different from LocalBitcoins, as the government could still subpoena whoever was handling KYC for LocalBitcoins for any individual's documents should they need them for whatever reason.Of course, I don’t know what powers your tax inspectors have, but as a rule, in order to carry out such operations, the tax office needs to create new departments and train people, and this procedure must comply with the law. In Russia, for example, initiative is punishable, and if the prosecutor’s office receives many complaints from citizens about violation of the law from such an initiative, then the author of the initiative and his assistants will have to take early retirement or look for work elsewhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "October 06, 2023, 01:16:38 AM",
      "body": "This is just my opinion but I think when you delete your account it means you delete the entire data from the companies you associate with but they keep the KYC data. I have a story, I installed an app to get a promo in my local coffee shop, and after I got the promo I tried to cheat by deleting all of my data there is button in app to delete all data from their server, uninstall the app install again and use the same number but the app seems know that I ever registered and in your case they might delete all the transaction data but retain their KYC user data.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "October 06, 2023, 12:37:25 PM",
      "body": "Quote from: dansus021 on October 06, 2023, 01:16:38 AMThis is just my opinion but I think when you delete your account it means you delete the entire data from the companies you associate with but they keep the KYC data. I have a story, I installed an app to get a promo in my local coffee shop, and after I got the promo I tried to cheat by deleting all of my data there is button in app to delete all data from their server, uninstall the app install again and use the same number but the app seems know that I ever registered and in your case they might delete all the transaction data but retain their KYC user data.Most likely, the application contains a database of numbers that have already been used to participate in the promotion. One phone number without first and last name cannot be considered personal data.But scammers manage to use even this data to deceive people, posing as employees of that coffee shop.But with crypto exchanges and exchange services everything is much more complicated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "October 06, 2023, 01:36:58 PM",
      "body": "Quote from: HeRetiK on September 28, 2023, 08:53:33 AMQuote from: Bitstackerslacker on September 27, 2023, 08:44:15 PMThe entire point of this post is asking what happens to KYC when the business goes bust and there is no employees and if they delete accounts do they delete KYC information. Alot of exchanges going bust and I'm curious Businesses are often required to keep documents a certain amount of years even after going out of operation, though to what extend will vary from country to country.Regardless of that, even if a defunct company deletes your KYC data, it doesn't necessarily mean that it is gone. It could still be stored in a government database somewhere or other third parties -- sometimes KYC gets outsourced to other companies so these might still have copies. And of course there's always the possibility of a data breach.Beyond that since they did do business in a lot of countries and they went though the process of getting licensed in those countries they more then likely are following those rules. If country 'X' says all records must be saved for 5 years then anyone who registered from that country has their data sitting someplace for 5 years.If country 'Y' says all records must be saved for 7 years then anyone who registered from that country has their data sitting someplace for 7 years.As others have pointed out there are 3rd party businesses who do this for you. Somewhere buried in the T&C there was probably something about this.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "October 06, 2023, 02:09:01 PM",
      "body": "Also remember that kyc info has value.Here is a case of what I mean:So I work in Finland for Local bitcoin exchange and have access to it , \"the kyc data base.\"Pretend that  10,000 USA names were on the list.The USA is 7 years for fraud.  The USA pays a 10% bounty on tax cheat money recovered.Since I see the USA list and I now we are going out of business I copy the list. I know have 10,000 names and kyc I can sell to the USA and legally make money . (in Terms of USA law) maybe not in terms of Finnish law.So I am holding the list and living in Finland Russia is acting crazy crazy and I am only 26 years old. I say fuck this bring my list to the USA and make a deal.All of the above is not known to be real but it could be real.At the op if you are a USA citizen and the amounts are big (100K) you should be a bit paranoid.I can not speak for other countries but I know a bit about USA .I would think 2029 or 2030 you could stop worrying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "October 07, 2023, 01:30:46 AM",
      "body": "Quote from: zasad@ on October 06, 2023, 12:37:25 PMMost likely, the application contains a database of numbers that have already been used to participate in the promotion. One phone number without first and last name cannot be considered personal data.But scammers manage to use even this data to deceive people, posing as employees of that coffee shop.But with crypto exchanges and exchange services everything is much more complicated.Well, that actually makes sense, so they probably have my data with my phone number in it on their promotional database. But is this considered as transactional data since they keep it to use that in future. In crypto or other industries, this might more complicated I searched on the internet and didn't find about what happened to our personal data when things like this happened. But I did find article about \"On Protecting Customer Data: What Happens After Bankruptcy?\" By Plixer. They found cases \"According to a Naked Security article by John E. Dunn, Canadian computer and electronics retailer Netlink Computer Inc (NCIX) declared bankruptcy late last year. NCIX abandoned a lot of its equipment. In August, Privacy Fly researcher Travis Doering found that someone was selling the equipment on Craigslist.The equipment comprised hundreds of pieces of hardware that in total held 13 terabytes of data. The data included 385,000 database records containing names, email addresses, phone numbers, and account passwords. 258,000 records included full credit card payment details.And that’s not all.\" - https://www.plixer.com/blog/protect-customer-data-after-bankruptcy/in this thread, I do believe that LocalBitcoins still has your data",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "October 07, 2023, 01:04:22 PM",
      "body": "Quote from: dansus021 on October 07, 2023, 01:30:46 AMQuote from: zasad@ on October 06, 2023, 12:37:25 PMMost likely, the application contains a database of numbers that have already been used to participate in the promotion. One phone number without first and last name cannot be considered personal data.But scammers manage to use even this data to deceive people, posing as employees of that coffee shop.But with crypto exchanges and exchange services everything is much more complicated.Well, that actually makes sense, so they probably have my data with my phone number in it on their promotional database. But is this considered as transactional data since they keep it to use that in future. In crypto or other industries, this might more complicated I searched on the internet and didn't find about what happened to our personal data when things like this happened. But I did find article about \"On Protecting Customer Data: What Happens After Bankruptcy?\" By Plixer. They found cases \"According to a Naked Security article by John E. Dunn, Canadian computer and electronics retailer Netlink Computer Inc (NCIX) declared bankruptcy late last year. NCIX abandoned a lot of its equipment. In August, Privacy Fly researcher Travis Doering found that someone was selling the equipment on Craigslist.The equipment comprised hundreds of pieces of hardware that in total held 13 terabytes of data. The data included 385,000 database records containing names, email addresses, phone numbers, and account passwords. 258,000 records included full credit card payment details.And that’s not all.\" - https://www.plixer.com/blog/protect-customer-data-after-bankruptcy/in this thread, I do believe that LocalBitcoins still has your dataAny data is a valuable commodity for which other people will pay money, so projects will store data and logs.But from a legal point of view, for the government to use this data, it must have a legal basis.And the older the data, the more difficult it is for tax authorities to carry out audits, because the statute of limitations expires.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "October 20, 2023, 01:55:30 PM",
      "body": "I am not sure about Finland, but in my country, every company is legally liable to keep the data for 7 years. Within these 7 years, any government authorities can seek information from the company and they are legally liable to provide such information to the government. So better check your local law what it says. Honestly, I have never received an email from LBC to delete my data. I am wondering if anyone else has received it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "October 21, 2023, 01:00:38 PM",
      "body": "Quote from: avikz on October 20, 2023, 01:55:30 PMI am not sure about Finland, but in my country, every company is legally liable to keep the data for 7 years. Within these 7 years, any government authorities can seek information from the company and they are legally liable to provide such information to the government. So better check your local law what it says. Honestly, I have never received an email from LBC to delete my data. I am wondering if anyone else has received it? When a company operates, it is obliged to comply with the laws of the country, but what happens after the company closes? By law, there is a period when tax inspectors check the company before closing. And then who is obliged to store this data?I think in any country you can come up with a way to bypass any laws or minimize fines.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}