{
  "id": "topic_5469404",
  "title": "internetional",
  "author": "internetional",
  "created_time": "October 06, 2023, 11:33:48 AMLast edit: October 06, 2023, 12:13:48 PM by internetional",
  "content": "10101 - это площадка для торговли инверсными фьючерсами на BTC/USD, не требующая вносить депозит. Для участия в торгах нужно лишь открыть платёжный канал к ноде 10101 в сети Молния (Lightning Network) и внести в этот канал сатоши в количестве, достаточном для обеспечения открытых позиций. При открытии позиции сатоши блокируются в канале до момента закрытия. Блокируются они у обоих участников сделки: и у того, кто купил фьючерс, и у того, кто продал его. При закрытии позиции заблокированные сатоши распределяются между сторонами в зависимости от разницы между ценой закрытия и ценой открытия. Цену определяет оракул Olivia: https://github.com/LLFourn/olivia . Точнее, не то чтобы определяет - просто берёт готовую цену индекса BTC с биржи BitMEX.Экспирация фьючерсов происходит каждую неделю, но можно их продлевать хоть до бесконечности, превращая тем самым в бессрочные свопы. Можно даже использовать позицию «шорт» как своего рода синтетический стейблкоин - почти так, как я фантазировал год назад: Quote from: internetional on December 21, 2022, 05:39:54 AMТо есть по-настоящему надёжный стейблкоин можно было бы организовать примерно так.1. Я перевожу свои сбережения в биткоины. 2. Я иду на децентрализованную обменную площадку. 3. Там я ищу желающих купить бессрочные свопы на BTC/USD. 4. Найдя покупателя, я открываю с ним что-то вроде платёжного канала, в который и я, и он помещаем наши биткоины.  5. При изменении курса BTC/USD сатошики в канале перемещаются в ту или иную сторону. Курс растёт - сатошики понемногу переходят к покупателю. Курс падает - сатошики понемногу перетекают ко мне. Для этого нужен оракул курса.6. Если кому-то понадобится закрыть часть позиции, то он может на той же децентрализованной площадке продать часть ключей от этого канала. Это, пожалуй, самый сложный момент. Я вижу процедуру как-то так. Сейчас курс 16000, это значит, что если размер контракта - 1 доллар, то при открытии шорт-позиции на 1 биткоин продаётся 16000 контрактов, и к каждому из них генерируется отдельный ключ-NFT (всего 16000 ключей). Далее эти ключи можно кому угодно передавать, и новый владелец будет обладать правами на соответствующую часть канала, открытого на этапе 4. Именно эти ключи и являются стейблкоинами. То же самое и с ключами на позицию лонг: только они будут не стейблкоинами, а чем-то вроде «токенов с плечом».7. Шорт не ликвидируется никогда, а в случае ликвидации лонга канал нужно переоткрывать с другим покупателем.Этапы 3-7 автоматизированы, т.е. для обычного пользователя незаметны.Основное различие между моей фантазией и реализацией 10101 состоит в том, что для закрытия позиции нужна сделка с тем же контрагентом, с которым ты эту позицию открывал. Никаких «ключей-NFT» здесь нет. Но для удобства пользователей сделано так, что второй стороной сделки по созданию «синтетического стейблкоина» всегда является сама платформа. Насколько я понимаю, клиент открывает на платформе шорт 1:1, а владельцы платформы хеджируются на Битмексе.Но это неточно. Да и вообще, всё здесь пока неточно. Проект находится на стадии закрытой беты, и детали известны только тем, кто попал в группу тестирующих. Может быть, на форуме есть такие? Расскажите,как там всё на самом деле! Особенно интересуют комиссии и объёмы.Я запросил доступ. Если дадут - расскажу подробнее.Пока же мне известно лишь следующее: - исходный код платформы доступен на Github;- для торговли используется приложение, работающее в iOS и Android;- есть сайт 10101.finance, на котором можно подать заявку на участие в тестировании платформы;- есть блог 10101.substack.com, где можно узнать о проекте чуть больше;- есть аккаунт проекта в Nostr (npub1c40rwav67rtl4pmy56wa8vhh8cynlm0zvhr96mcnd5xat74ldxmsm8ttqy), где особо ничего не публикуется.Я читал, что в будущем они планируют многое перенести в Nostr, в том числе даже сделать там децентрализованную книгу ордеров. Поэтому, наверное, имеет смысл на них там подписаться.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469404",
  "comments": [
    {
      "author": "internetional",
      "created_time": "October 07, 2023, 01:31:36 PM",
      "body": "Доступ к торгам мне не дали, зато я прочитал в их телеграм-чате важное пояснение админа:Quote from: https://t.me/get10101/1/1508Also note, that you are not having a direct dlc channel with any other user, but always with 10101. 10101 facilitates in the background. So your short order could be taken by somebody else than your long order.Это меняет дело. Получается, что закрывать позицию можно и не с тем контрагентом, с которым ты её открывал. Если Алиса покупает фьючерс, а Боб его продаёт, то технически Алиса покупает у 10101, а 10101 покупает у Боба. Потом, когда Алиса захочет продать, и на платформе будет ордер на покупку от Васи, технически Алиса продаст бирже, а биржа продаст Васе.Значит, можно торговать фьючерсами практически так же, как мы привыкли это делать на обычных CEХ.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "internetional",
      "created_time": "October 09, 2023, 11:02:18 AM",
      "body": "10101 начал потихоньку продвигать свой стейблкоин (в англоязычных текстах такой тип привязки стоимости активов к доллару всё чаще называют не stablecoin, а stablesats; я думаю, что и тут рано или поздно перейдут на этот термин, а пока я пишу по старинке «стейблкоин»). Для него придумали название - PEGZ. Сейчас ищут UX/UI дизайнеров для разработки дизайна хранения и перевода этих пегзов. Почитать об этом можно тут: https://bolt.fun/story/pegz-how-far-have-we-got-1-lightning-stablecoin--1102",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "internetional",
      "created_time": "October 11, 2023, 02:09:07 PMLast edit: November 20, 2023, 06:08:34 PM by internetional",
      "body": "Я получил доступ и теперь могу поделиться более подробной информацией. Вот на что я обратил внимание в первую очередь.1. При первом запуске приложения требуется указать адрес электронной почты. Я установил приложение на два устройства, указав один и тот же адрес. При этом два кошелька, созданные в разных экземплярах приложения, никак не связаны друг с другом. У них разные сид-фразы, и пополнение одного из них никак не отражается на другом. Следовательно, можно создать множество «аккаунтов» с одним и тем же адресом электронной почты.2. Сид-фраза даётся, но она бесполезна. В кошельке есть кнопка Backup (именно она и показывает сид-фразу), но нет кнопки Restore. Попытался я по этой сид-фразе импортировать кошелёк в приложение BlueWallet, попробовал разные пути деривации, но ни один из них не дал мне ключей от того адреса, который используется для пополнения кошелька 10101. Так что терять устройство нельзя. В случае потери восстановить доступ к своим деньгам будет негде.3. Для начала работы предлагается открыть канал одного из трёх видов.Small требует внесения в канал не менее 60К сат, ёмкость канала при этом 200К сат.Medium требует внесения не менее 385К сат, а ёмкость канала - 1,5М сат.Large требует внесения не менее 760К сат, а ёмкость канала - 3М сат.У меня сразу возник вопрос. Что если открыть канал Small, сразу пополнить его на 200К сат, открыть минимальную позицию на фьючерсах, дождаться, когда она выйдет в плюс хотя бы на один сатоши, и попытаться её закрыть? Как 10101 выплатит мне мою прибыль? Она же в канал не поместится! Вся ёмкость канала будет заполнена теми сатошами, которые были изначально внесены! Надо будет задать этот вопрос службе поддержки. На скриншоте видно, что заявленная плата за открытие канала - 10К сат. На самом деле при внесении более 1М сат откусывается 1%. То есть если внесёте 3М сат, заплатите комиссию 30К. Для меня оптимальный вариант такой: внести миллион и открыть канал Large (т.е. ёмкостью три миллиона). Получается, что я плачу 10К сат и получаю канал со входящей ликвидностью 2М сат и исходящей ликвидностью 1М сат. По-моему, неплохая цена за такой вариант. 4. На торгах фьючерсами доступны только рыночные ордера и нет книги заявок. Видимо, 10101 выступает в роли брокера какой-то биржи (скорее всего, BitMEX): открывает позицию на бирже каждый раз, когда мы открываем её в приложении. А зарабатывает на разнице комиссий. Комиссия BitMEX - 0,075%, а комиссия 10101 за каждую сделку - 0,3%.5. Размер ордера указывать не очень удобно: нужно либо ввести объём позиции в долларах, либо размер маржи в сатошах с учётом выбранного плеча. Я нашёл для себя такой выход. Если хочу открыть лонг на 10000 сатоши, то - выбираю плечо x1;- ввожу 10000 в поле Margin;- в поле Quantity автоматически появляется нужный мне размер позиции в долларах;- я передвигаю ползунок плеча до нужного мне значения (например, x5);- размер позиции в долларах остаётся тем же самым, а меняется лишь размер маржи;- нажимаю Buy.  На скриншотах это выглядит так: Мой вердикт.До тех пор, пока не появится возможность восстановления кошелька из сид-фразы, пользоваться 10101 опасно. Потеряешь устройство - потеряешь все деньги.Комиссии кусаются, но в то же время понятно, за что ты их платишь: за возможность торговать фьючерсами без потери контроля над биткоинами, выделенными для торговли.ИМХО, в первую очередь 10101 в нынешнем виде должен быть интересен таким трейдерам, которые хотели бы торговать фьючерсами на BTC/USD на биржах типа BitMEX, но не хотели бы доверять им свои биткоины и свои персональные данные.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "internetional",
      "created_time": "October 12, 2023, 05:54:07 PM",
      "body": "Я уточнил в поддержке и узнал, что сид-фраза не совсем бесполезна. С её помощью можно восстановить доступ к адресам кошелька, но хитрым способом. Там используются нестандартные пути деривации, поэтому сначала нужно сконвертировать сид-фразу в другой формат при помощи специальной утилиты (https://github.com/get10101/bip39-to-bip32), а потом уже можно будет восстановить доступ через другой кошелёк (служба поддержки предлагает использовать Sparrow Wallet, который точно понимает нужный формат).Но таким образом восстанавливается доступ только к средствам на цепочке. Всё, что было на молнии, останется недоступным. И придётся просить службу поддержки принудительно закрывать канал (с выплатой нехилой комиссии), чтобы деньги попали на наш адрес и стали доступны через Sparrow Wallet. Такая организация восстановления доступа говорит о том, что называть 10101 стопроцентно некастодиальным нельзя. Если потеряешь телефон с приложением, то без разрешения 10101 деньги, внесённые в канал, вернуть невозможно. Более того, я заметил, что в приложении не реализованы никакие функции для работы с каналом. Невозможно сделать бэкап, невозможно инициировать принудительное закрытие. Есть только кнопка кооперативного закрытия (по обоюдному согласию). Даже в ситуации, описанной выше, или в любой другой ситуации закрытия по инициативе 10101, разработчики приложения могут транслировать в сеть устаревшее состояние канала (например, состояние, когда у нас ещё не было прибыли или даже был убыток), и мы ничего не сможем этому противопоставить. Поэтому при принудительном закрытии канала в самом худшем случае мы рискуем получить обратно минимальную сумму, которая когда-либо в истории торгов была у нас на балансе. А в случае отказа в принудительном закрытии мы можем и вообще ничего не получить (но и 10101 тоже в этом случае не увидит своих денег,оставшихся в канале).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "internetional",
      "created_time": "October 13, 2023, 10:53:46 AMLast edit: October 13, 2023, 04:03:40 PM by internetional",
      "body": "Quote from: internetional on October 11, 2023, 02:09:07 PM3. Для начала работы предлагается открыть канал одного из трёх видов.Small требует внесения в канал не менее 60К сат, ёмкость канала при этом 200К сат.Medium требует внесения не менее 385К сат, а ёмкость канала - 1,5М сат.Large требует внесения не менее 760К сат, а ёмкость канала - 3М сат.У меня сразу возник вопрос. Что если открыть канал Small, сразу пополнить его на 200К сат, открыть минимальную позицию на фьючерсах, дождаться, когда она выйдет в плюс хотя бы на один сатоши, и попытаться её закрыть? Как 10101 выплатит мне мою прибыль? Она же в канал не поместится! Вся ёмкость канала будет заполнена теми сатошами, которые были изначально внесены! Надо будет задать этот вопрос службе поддержки.Задал вопрос. Оказалось, что я неправильно понимал, какой ёмкости канал отрывается в каждом случае. На самом деле всё обстоит так:- при открытии канала Small можно внести от 60К до 200К, а 10101 внесёт 100К;- при открытии канала Medium можно внести от 385К до 1,5М, а 10101 внесёт 750К;- при открытии канала Large можно внести от 760К до 3М, а 10101 внесёт 1,5М.Иными словами, за 10К - 30К комиссии я могу получить канал ёмкостью до 4,5М со входящей ликвидностью до 1,5М.  Есть лимит на максимальный объём открытой позиции. Для канала Small он рассчитывается так:min (100K*2; ВЛ*2), где ВЛ - это входящая ликвидность в канале на текущий момент.Для канал Medium вместо 100К нужно подставить в формулу 750К, а для канала Large - 1,5М.Учтите, что эти расчёты дают размер позиции в сатошах, а в приложении объём рассчитывается в долларах. Как быстро подобрать нужный объём, я написал в одном из сообщений выше:Quote from: internetional on October 11, 2023, 02:09:07 PMЕсли хочу открыть лонг на 10000 сатоши, то - выбираю плечо x1;- ввожу 10000 в поле Margin;- в поле Quantity автоматически появляется нужный мне размер позиции в долларах;- я передвигаю ползунок плеча до нужного мне значения (например, x5);- размер позиции в долларах остаётся тем же самым, а меняется лишь размер маржи;- нажимаю Buy.  Ещё хочу добавить, что одновременно разрешается иметь не более одной открытой позиции. Если нужно изменить объём позиции, придётся закрывать её полностью и открывать новую позицию нужного объёма. Это и неудобно, и затратно в плане комиссий.Впрочем, всё развивается. Напомню, что проект сейчас на стадии закрытой беты, и использовать его имеет смысл только в целях тестирования. Хотя, конечно, странно, что тестирование проводят в основной сети, а не в тестнете. И последний нюанс. Экспирация фьючерсов в 10101 происходит в нестандартное время: по воскресеньям в 15:00 GMT.Пока, наверное, это всё, что я могу рассказать. Буду ждать допиливания и релиза.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "internetional",
      "created_time": "October 14, 2023, 10:47:11 AMLast edit: October 15, 2023, 07:53:36 AM by internetional",
      "body": "Quote from: internetional on October 13, 2023, 10:53:46 AMПока, наверное, это всё, что я могу рассказать. А нет, есть ещё одно любопытное наблюдение. Вчера в 15:00 по Гринвичу, то есть за двое суток до экспирации фьючерса, приложение уведомило о возможности продления. Я нажал на уведомление, собираясь узнать стоимость ролловера, но ролловер состоялся сразу, без дополнительных подтверждений, а никаких финансовых изменений при этом не произошло. Надо будет проверить при закрытии позиции, не будет ли списана комиссия за ролловер. Но если её нет, то получается, что тут возможен бессрочный своп без фандинга. Это достаточно редкое предложение. Я аналогичные условия видел только на xm.com, но там полностью кастодиальный депозит, а тут нет.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "internetional",
      "created_time": "October 21, 2023, 10:07:06 AM",
      "body": "Фьючерсы на 10101 превратились в бессрочные свопы. Формально экспирация есть (в воскресенье в 15:00 GMT), но, чтобы она состоялась, нужно не запускать приложение в течение двух суток, предшествующих экспирация. В противном случае, как только зайдёте в приложение, сразу же произойдёт ролловер. Это необычно, но удобно. Ничего неприятного ролловер с собой не несёт, поэтому пусть себе происходит в таком полуавтоматическом режиме.Разработчики принимают пожелания по новым функциям и по изменению имеющихся:  https://x.com/get10101/status/1715428375626478005",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "internetional",
      "created_time": "October 22, 2023, 12:02:22 PM",
      "body": "10101 изменили форму открытия позиции. Теперь объём позиции в биткоинах указать невозможно. Объём позиции рассчитывается только а количестве контрактов, то есть в долларах. Это навело меня на некоторые размышления.Один из основных продуктов 10101 - \"синтетический доллар\" PEGZ. Мне кажется, что для массовой аудитории слова \"синтетический доллар, обеспеченный шорт-позицией по фьючерсам на биткоины,\" звучат жутко непонятно. А что если назвать это по-другому?Чтобы стало понятнее, можно вспомнить, для чего вообще нужен фьючерс. В любом учебнике можно прочитать, что люди покупают фьючерс в том случае, когда они намерены в будущем приобрести некий актив, а цену на него хотят зафиксировать сейчас. Теперь зададимся вопросом: кто те люди, которым может быть интересен \"синтетический доллар PEGZ\"? 1. У этих людей есть биткоины.2. Эти люди планируют в будущем обменять эти биткоины на доллары.3. Они хотят зафиксировать цену уже сейчас, чтобы быть уверенными в получении нужного количества долларов, независимо от будущих колебаний курса.Возвращаемся к сути фьючерса, и становится понятно, что этим людям для решения их задачи нужно купить фьючерс на доллары. Но стоп! Ведь примерно это мы и видим теперь в интерфейсе 10101. Нам предлагают фьючерс, объём которого рассчитывается в долларах, но почему-то он называется фьючерсом на биткоины, и почему-то предлагается не купить его, а продать.Если это фьючерс на биткоины, то и объём его надо рассчитывать в биткоинах. А если объём рассчитывается в долларах, то никакой это не \"синтетический доллар, обеспеченный шорт-позицией\", а самый обычный фьючерс на доллары.Вот что такое PEGZ.PEGZ - это фьючерс на доллары.Когда мы блокируем в DLC-канале наши биткоины и получаем взамен PEGZ, мы покупаем фьючерсы на доллары.Если в будущем кто-то станет принимать PEGZ как средство платежа, это будет платёж фьючерсами на доллары.Вот только, чтобы всё стало так просто и понятно, нужно сделать следующее:- поменять местами кнопки BUY и SELL;- называть торгуемых фьючерсы не \"инверсными фьючерсами на биткоины\", а самыми обычными фьючерсами на доллары;- ну и сделки совершать не по курсу биткоина к доллару, а по курсу доллара к биткоину.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "internetional",
      "created_time": "October 26, 2023, 09:12:42 AM",
      "body": "Обнаружилась ещё одна неожиданная особенность некастодиальных фьючерсов 10101.После очередного обновления приложения получилось так, что я не могу в новой версии закрыть позицию, которая была открыта в старой. Я сообщил об этом разработчикам, они нашли ошибку и предложили мне закрыть позицию на их стороне. Я как-то даже не ожидал, что у них есть такая возможность. С одной стороны, всё вроде бы нормально: если я могу закрыть позицию в одностороннем порядке, то и возможность второй стороны DLC-канала сделать то же самое не должна вызывать у меня возражений. Но всё-таки это совсем не то, чего ждёшь, когда открываешь позицию по фьючерсам. Особенно на площадке, которая предлагает использовать фьючерсы в качестве «синтетических долларов». Вот открою я шорт, чтобы зафиксировать сумму в долларах, а 10101 будет иметь возможность в любой момент закрыть мой шорт, и весь смысл «синтетического доллара» PEGZ тогда пропадает. Некастодиальных решений ищут те, кто не хочет полагаться на милость владельцев платформы. А тут в ряде аспектов приходится им довериться.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "internetional",
      "created_time": "October 30, 2023, 08:30:03 AM",
      "body": "Я вчера проверил, как происходит экспирация фьючерса. Для этого пришлось двое суток не заходить в приложение, чтобы автоматически не запустился ролловер. Экспирация прошла чётко, взяли комиссию 0,3%. Я уточнил у разработчиков: комиссия за ликвидацию тоже составляет 0,3%. Таким образом, любое открытие позиции и любое закрытие облагается одинаковой комиссией. То есть в целом комиссия за сделку на две стороны составит 0,6%. Пожалуй, это не так уж и плохо для среднесрочных позиций. Если открываешь лонг на Битмексе, то теряешь около 1% в месяц на фандинге. И ещё около 0,1% на открытии-закрытии. А тут всего 0,6% - и держи хоть до следующего ATH.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "internetional",
      "created_time": "November 20, 2023, 06:16:40 PM",
      "body": "Разработчики четыре дня назад написали о нововведениях:- изменение размера позиции,- восстановление кошелька (в том числе платёжного канала и открытых позиций).Я ждал-ждал, когда эти нововведения появятся в приложении, но так и не дождался. Разработчики в чате пишут, что новая версия уже на проверке в магазинах приложений. Но как-то долго она проверяется. Боюсь, как бы магазины приложений не запретили 10101 за поддержку «платежей мимо кассы». Ведь, когда я покупаю фьючерс в приложении 10101, 30% от покупки не идут Гуглу или Эпплу. А они такого не любят.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "internetional",
      "created_time": "November 22, 2023, 05:47:39 PM",
      "body": "Обновление наконец-то появилось в магазинах приложений (почему-то одновременно и в Аппсторе, и в Плей-Маркете). Обещанной функции восстановления кошелька я в нём не нашёл, а вот изменение объёма позиций стало доступно. Кроме того, заявлено, что это PUBLIC BETA. То есть теперь любой желающий может загрузить себе приложение 10101 и попробовать поторговать фьючерсами в некастодиальном режиме.Но у меня есть два предостережения.1. В приложении всё ещё много багов. Новые баги выявляются почти каждый день. Разрабы - молодцы, стараются быстро всё исправлять. Тем не менее, 10101 пока рекомендую использовать только с целью тестирования их уникальной услуги.2. Обратите внимание, что это не декс. Сейчас 10101 - это лишь шаг на пути к дексу. Во всех ваших сделках второй стороной будет являться команда 10101. Все ваши платёжные каналы будут открыты к их нодам. Если их ноды по какой-то причине навсегда уйдут в офлайн, вы можете потерять все биткоины, которые хранили в кошельке 10101.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "internetional",
      "created_time": "December 22, 2023, 11:56:08 AM",
      "body": "Quote from: internetional on October 26, 2023, 09:12:42 AMПосле очередного обновления приложения получилось так, что я не могу в новой версии закрыть позицию, которая была открыта в старой. Я сообщил об этом разработчикам, они нашли ошибку и предложили мне закрыть позицию на их стороне. Я как-то даже не ожидал, что у них есть такая возможность. С одной стороны, всё вроде бы нормально: если я могу закрыть позицию в одностороннем порядке, то и возможность второй стороны DLC-канала сделать то же самое не должна вызывать у меня возражений. Но всё-таки это совсем не то, чего ждёшь, когда открываешь позицию по фьючерсам. Особенно на площадке, которая предлагает использовать фьючерсы в качестве «синтетических долларов». Вот открою я шорт, чтобы зафиксировать сумму в долларах, а 10101 будет иметь возможность в любой момент закрыть мой шорт, и весь смысл «синтетического доллара» PEGZ тогда пропадает.Сегодня эту тему подняли в чате 10101 в телеграме. Стало ясно, как на неё смотрят разработчики:Quote from: https://t.me/get10101/1/3254force closing a channel will certainly always be possible as nobody has to trust the counterparty to collaborate. However collaboratively closing (if possible) is always preferable over force closing.Всегда нужно иметь в виду возможность того, что ваш канал будет принудительно закрыт. А вместе с ним - и открытая в нём торговая позиция. Звучит неприятно, но я сам столкнулся с этим на практике, и это оказалось не так страшно. Мой канал принудительно закрылся в субботу, а срок экспирации фьючерса, купленного в нём, - следующее воскресенье. Это означает, что только в следующее воскресенье деньги из канала будут распределены между сторонами в соответствии с курсом на момент экспирации. То есть практически невозможна ситуация, когда твоя позиция закрылась, а ты не узнал об этом. Всегда есть время, чтобы к предстоящему закрытию подготовиться.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "internetional",
      "created_time": "January 22, 2024, 08:04:45 AM",
      "body": "Quote from: internetional on November 20, 2023, 06:16:40 PMРазработчики четыре дня назад написали о нововведениях:- изменение размера позиции,- восстановление кошелька (в том числе платёжного канала и открытых позиций).Я ждал-ждал, когда эти нововведения появятся в приложении, но так и не дождался.Обе эти функции реализованы. Но восстановление кошелька доступно только при первом запуске приложения. Поэтому, если нужно что-то восстановить, придётся удалять приложение и устанавливать его заново. Кроме того, разработчики просят прибегать к этому только как к крайней мере. Мотивируют это так:Quote from: https://t.me/get10101/1189/3539we have reached some size limits in the past when creating a backup of ln / dlc files. So I'd adivice to generally use that feature only as a last resort.. If you intend to only restore your on-chain wallet you should be fine, though.Я не понял, что это за лимиты. Но суть в том, что для восстановления доступа к биткоинам, которые находятся на первом слое, всё должно сработать, а с Молнией могут возникнуть проблемы.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "internetional",
      "created_time": "March 17, 2024, 06:52:55 PM",
      "body": "Оказывается, я тут забыл сообщить, что 10101 больше не работает с Молнией. Теперь между клиентом и оператором торгов открывается изолированный канал, не связанный с сетью Молния. Для ввода денег в канал и для вывода нужны транзакции на блокчейне. А позиции открываются и закрываются операциями, которые проводятся внутри канала: моментально и без комиссий майнерам. Комиссия платится только оператору: 0,3% за исполненный ордер. Кстати, фандинга на фьючерсах по-прежнему нет. Я уже писал, что обычно на нём теряется около 1% в месяц (если говорить о лонге), а тут можно заплатить 0,3% за открытие лонга и потом 0,3% за закрытие, и это окупится меньше чем за три недели удержания позиции.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Julien_Olynpic",
      "created_time": "May 15, 2024, 11:15:39 AM",
      "body": "Quote from: internetional on March 17, 2024, 06:52:55 PMОказывается, я тут забыл сообщить, что 10101 больше не работает с Молнией. Теперь между клиентом и оператором торгов открывается изолированный канал, не связанный с сетью Молния. Для ввода денег в канал и для вывода нужны транзакции на блокчейне. А позиции открываются и закрываются операциями, которые проводятся внутри канала: моментально и без комиссий майнерам. Комиссия платится только оператору: 0,3% за исполненный ордер. Кстати, фандинга на фьючерсах по-прежнему нет. Я уже писал, что обычно на нём теряется около 1% в месяц (если говорить о лонге), а тут можно заплатить 0,3% за открытие лонга и потом 0,3% за закрытие, и это окупится меньше чем за три недели удержания позиции. Топик интересный, но было бы познавательнее просмотрить инфу о бирже в формате одного объёмного обзора. Что-то я в сети такой инфы не нашёл, но может плохо искал. Про них кто-то делал добросовестный обзор? Ну или ты сделай с обзором всех фишек, плюсов и минусов. Я так понимаю, платформа перспективная. Единственно, фьючи с экспирацией через неделю, как-то не очень много.Кстати, 10101.art - это тоже их сайт или это сторонняя компания с похожим названием?https://10101.art/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "internetional",
      "created_time": "May 15, 2024, 11:44:54 AM",
      "body": "Quote from: Julien_Olynpic on May 15, 2024, 11:15:39 AMТопик интересный, но было бы познавательнее просмотрить инфу о бирже в формате одного объёмного обзора. Что-то я в сети такой инфы не нашёл, но может плохо искал. Про них кто-то делал добросовестный обзор? Ну или ты сделай с обзором всех фишек, плюсов и минусов. Я так понимаю, платформа перспективная.Пока трудно такой обзор делать, потому что платформа не устоялась ещё. Шатает её туда-сюда. Какие-то особенности появляются, какие-то исчезают. Я пока не могу вычленить сердцевину, которая точно не изменится, и от которой можно было бы выстраивать такой обзор. Quote Единственно, фьючи с экспирацией через неделю, как-то не очень много.Они автоматически (и пока бесплатно) пролонгируются ещё на неделю, если открыть приложение в период с 15:00 GMT пятницы до 15:00 GMT воскресенья. Экспирация происходит, только если про открытую позицию забыть. Это чтобы освобождались деньги у координатора сделок.QuoteКстати, 10101.art - это тоже их сайт или это сторонняя компания с похожим названием?Не они. Просто похожее название.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "internetional",
      "created_time": "June 04, 2024, 06:20:36 PM",
      "body": "Quote from: internetional on March 17, 2024, 06:52:55 PMОказывается, я тут забыл сообщить, что 10101 больше не работает с Молнией. Теперь между клиентом и оператором торгов открывается изолированный канал, не связанный с сетью Молния. Для ввода денег в канал и для вывода нужны транзакции на блокчейне. А позиции открываются и закрываются операциями, которые проводятся внутри канала: моментально и без комиссий майнерам. Комиссия платится только оператору: 0,3% за исполненный ордер.Молния потихоньку возвращается. Сейчас открытие канала можно оплатить инвойсом, а не только ончейн-транзакцией. Внести деньги в канал можно тем же инвойсом. Это пока не совсем нативная поддержка Молнии. Сейчас получается, что мы передаём команде проекта свои сатоши и просим оплатить этими сатошами открытие канала, а остаток внести в сам канал. То есть с момента оплаты инвойса до момента открытия и пополнения канала у нас нет контроля над нашими деньгами. Но команда обещает работать над этим дальше и прийти к полной некастодиальности.Выводить деньги из канала пока можно только путём его закрытия (ончейн-транзакцией).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "internetional",
      "created_time": "August 07, 2024, 09:40:35 AM",
      "body": "Максимальный депозит на 10101 увеличен до 6М сат. Ещё столько же в торговый канал добавляет координатор площадки. Итого ёмкость торгового канала теперь может составлять 12М сат.Каждый пользователь может иметь только один торговый канал. Это означает, что- максимальный объём сделки при плече х1 эквивалентен 6М сат, а при плече х5 - 30М сат;- максимальная прибыль, полученная от торговли, может составить 6М сат (больше просто неоткуда, ведь координатор со своей стороны канала выставляет обеспечение, не превышающее этой суммы);- максимальный убыток от торговли может составить 6М сат.Докинуть маржи в канал не получится. Если уже внесли 6М, то всё.Но можно установить приложение на несколько устройств, и на каждом из них будет свой канал. Берём 17 устройств, и мы уже можем рисковать целым биткоином.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}