{
  "id": "topic_5446620",
  "title": "JamesDaniel90",
  "author": "JamesDaniel90",
  "created_time": "March 28, 2023, 10:56:41 AM",
  "content": "I have decided I have too many altcoins in my portfolio and want to convert up to half of them into Bitcoin but I am waiting for the next pump like we saw in January to do this as don't want to convert while my altcoins are 20% down. I have only been in crypto last 12 months so not that experienced when it comes to understanding cycles. Do we have any idea when the next altcoin season is due?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446620",
  "comments": [
    {
      "author": "@sriyan",
      "created_time": "March 28, 2023, 11:28:58 AM",
      "body": "Quote from: JamesDaniel90 on March 28, 2023, 10:56:41 AMI have decided I have too many altcoins in my portfolio and want to convert up to half of them into Bitcoin but I am waiting for the next pump like we saw in January to do this as don't want to convert while my altcoins are 20% down. I have only been in crypto last 12 months so not that experienced when it comes to understanding cycles. Do we have any idea when the next altcoin season is due? My assumption is it already started. I know the market is dumped now. But it will retest the support line and go to the (Bitcoin)100K in the next three months. All the altcoins are following bitcoin. So you can get more profits within the next three months.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "raidarksword",
      "created_time": "March 28, 2023, 12:10:28 PM",
      "body": "The same answer would be the next halving and next bull market seasons as well. Bitcoin have a rough year due to many FUD with the SEC, bank runs, FTX collapse and much more. That's why we are facing the difficulty to stood up and it's because bear sentiments are very strong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fvb",
      "created_time": "March 28, 2023, 12:26:48 PM",
      "body": "Quote from: JamesDaniel90 on March 28, 2023, 10:56:41 AMI have decided I have too many altcoins in my portfolio and want to convert up to half of them into Bitcoin but I am waiting for the next pump like we saw in January to do this as don't want to convert while my altcoins are 20% down. I have only been in crypto last 12 months so not that experienced when it comes to understanding cycles. Do we have any idea when the next altcoin season is due? If you have a lot of altcoins in your Metamask wallet, then I can advise you to find and read information about the future airdrop from the wallet. On Twitter, they are dispersing the information that Metamask will make a snapshot on March 31st. I can't say what the airdrop will be exactly, but now I'm looking for all the information about it and if you find something new on this topic, write here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "siedemtrzy",
      "created_time": "March 28, 2023, 12:35:11 PM",
      "body": "Quote from: @sriyan on March 28, 2023, 11:28:58 AMQuote from: JamesDaniel90 on March 28, 2023, 10:56:41 AMI have decided I have too many altcoins in my portfolio and want to convert up to half of them into Bitcoin but I am waiting for the next pump like we saw in January to do this as don't want to convert while my altcoins are 20% down. I have only been in crypto last 12 months so not that experienced when it comes to understanding cycles. Do we have any idea when the next altcoin season is due? My assumption is it already started. I know the market is dumped now. But it will retest the support line and go to the (Bitcoin)100K in the next three months. All the altcoins are following bitcoin. So you can get more profits within the next three months. My assumption that if it started it may end pretty soon. Binance seems shacky right now and the whole market responded to it a bit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "March 28, 2023, 12:35:59 PM",
      "body": "The real altcoin season will not happen before 2024-2025. I don't think that if altcoins recovered to their previous prices or even gave x2-x5 profit, it can be called a full-fledged altcoin season. A full-fledged altcoin season was, for example, in 2021, when almost all altcoins that entered the market made huge profits. It is worth waiting for such period, and all these small trends are just tiny earnings. Better to hold on to altcoins until the next global bull run, the market is recovering now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FirmWars",
      "created_time": "March 28, 2023, 12:50:12 PM",
      "body": "Judging with past bull markets I believe that altcoins will only start doing well after a Bitcoin halving, so be expecting the best in 2024 after Bitcoin halving, now is the time ti start buying your coins because next year they would have gotten more costly already, I think present value ain't going to last.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "masulum",
      "created_time": "March 28, 2023, 01:21:41 PM",
      "body": "Quote from: FirmWars on March 28, 2023, 12:50:12 PMJudging with past bull markets I believe that altcoins will only start doing well after a Bitcoin halving, so be expecting the best in 2024 after Bitcoin halving, now is the time ti start buying your coins because next year they would have gotten more costly already, I think present value ain't going to last.But you have to be observant in choosing which altcoin to choose for the long-terms (at least until the next bullrun). There are many altcoins stuck in the 2021 bullrun period. Even some of these altcoins are far below the 2017 ATH. This is not a coincidence, but there is a possibility developer team did not carry out developments that could improve prices with their innovations. I'm sire this kind of altcoin will definitely be found in the next bullrun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "southerngentuk",
      "created_time": "March 28, 2023, 01:39:55 PM",
      "body": "Quote from: JamesDaniel90 on March 28, 2023, 10:56:41 AMI have decided I have too many altcoins in my portfolio and want to convert up to half of them into Bitcoin but I am waiting for the next pump like we saw in January to do this as don't want to convert while my altcoins are 20% down. I have only been in crypto last 12 months so not that experienced when it comes to understanding cycles. Do we have any idea when the next altcoin season is due? First of all I see you also many newcomers to the market being led by vague and impractical conceptual information. You've known this market for 12 months and the things you see about it and the things you hear from someone match up or just a misinformation.First of all let's re-learn the basics of bitcoin, about altcoins see how they are related in the market. And reassessing what stage the market is in, I see many people still seem to be stuck because they don't have the initiative to research everything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "March 28, 2023, 01:55:54 PM",
      "body": "Quote from: JamesDaniel90 on March 28, 2023, 10:56:41 AMI have decided I have too many altcoins in my portfolio and want to convert up to half of them into Bitcoin but I am waiting for the next pump like we saw in January to do this as don't want to convert while my altcoins are 20% down. I have only been in crypto last 12 months so not that experienced when it comes to understanding cycles. Do we have any idea when the next altcoin season is due? It's hard to give financial advice for anyone because it is related to money, profit and loss.Bitcoin has long ride from $16,000 to $28,000 and I don't know that will it be able to rise more to $30,000 or nearly $40,000. Honestly I don't know and you know that when Bitcoin has falls, no chance for altcoins to rise. People can think Bitcoin finally falls and it is still in a bear market, will they use their money to buy altcoins or they will cash out Bitcoin to stable coins or fiat currencies and wait for discount prices of both Bitcoin and altcoins.I really think that altcoins will be in another bloodbath before a new altcoin season.I don't advise you to buy, hold or sell your altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JamesDaniel90",
      "created_time": "March 28, 2023, 02:01:56 PM",
      "body": "I will keep holding for now. I have a couple of altcoins that are in profit but they are my more main ones I am confident in so ok holding those.I will just wait for the altcoins that I have that are down to pump again - I took some profits in the January pump but should have taken more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoknightt",
      "created_time": "March 28, 2023, 02:02:52 PM",
      "body": "cryptocurrencies are very difficult to predict in the future, guessing at the moment is difficult. if you still have savings, in my opinion, you should hold on and taste the bitterness ahead of the 2024 BTC halving. there is a possibility that the tipping point of the coin will decrease or increase in value.remember the slogan don't panic sell!!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jacafbiz",
      "created_time": "March 28, 2023, 02:04:52 PM",
      "body": "The thing is that the whole talk of Altcoin season is premature, it won't exist until the next Bitcoin bull run. The issue now is that with what is happening in the world presently coupled with the war the US regulators are waging against Crypto it is difficult to say this cycle won't be different. But with all indications, it seems we have bottomed out, if there is any pullback, it is a great opportunity to buy for a long-term hold. One thing to note, not all the Altcoins that did well in the last bull market will perform well in the next, reason being that there are a lot of bag holders waiting to dump and exit the market",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "samcrypto",
      "created_time": "March 28, 2023, 02:07:08 PM",
      "body": "Quote from: JamesDaniel90 on March 28, 2023, 10:56:41 AMI have decided I have too many altcoins in my portfolio and want to convert up to half of them into Bitcoin but I am waiting for the next pump like we saw in January to do this as don't want to convert while my altcoins are 20% down. I have only been in crypto last 12 months so not that experienced when it comes to understanding cycles. Do we have any idea when the next altcoin season is due? Over diversified is not good after all, if you have the chance to lower your losses better to do it now.The market is still on the sideway trend and a possible downtrend, so wait for another signal before you make actions.Altcoins season can happen any time and there's no exact date for this, try to analyze the trend of Bitcoin and Altcoins, usually one will go on the opposite trend though most of the time its more on a Bitcoin, so be mindful about this and analyze wisely.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "March 28, 2023, 02:24:15 PM",
      "body": "Quote from: JamesDaniel90 on March 28, 2023, 10:56:41 AMI have decided I have too many altcoins in my portfolio and want to convert up to half of them into Bitcoin but I am waiting for the next pump like we saw in January to do this as don't want to convert while my altcoins are 20% down. I have only been in crypto last 12 months so not that experienced when it comes to understanding cycles. Do we have any idea when the next altcoin season is due?  Just keep holding those shitcoins. You might never actually see any bullruns on them in the next 20years but there is always hope for betterment. Use this as a lesson to never invest in altcoins again and only focus on bitcoin. You never know which shitcoins owners have gone bankrupt or have sold their project to someone else.Altcoins will usually follow the trend of bitcoin. So a good market is to keep track of bitcoin's next bullrun you will see the altcoins rising again. But the chances that every altcoin you hold will become back to a break even price is low.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JamesDaniel90",
      "created_time": "March 28, 2023, 02:35:24 PM",
      "body": "Quote from: TheUltraElite on March 28, 2023, 02:24:15 PMQuote from: JamesDaniel90 on March 28, 2023, 10:56:41 AMI have decided I have too many altcoins in my portfolio and want to convert up to half of them into Bitcoin but I am waiting for the next pump like we saw in January to do this as don't want to convert while my altcoins are 20% down. I have only been in crypto last 12 months so not that experienced when it comes to understanding cycles. Do we have any idea when the next altcoin season is due?  Just keep holding those shitcoins. You might never actually see any bullruns on them in the next 20years but there is always hope for betterment. Use this as a lesson to never invest in altcoins again and only focus on bitcoin. You never know which shitcoins owners have gone bankrupt or have sold their project to someone else.Altcoins will usually follow the trend of bitcoin. So a good market is to keep track of bitcoin's next bullrun you will see the altcoins rising again. But the chances that every altcoin you hold will become back to a break even price is low.Just a few weeks ago all the altcoins I held were in profit. They may not all go back to being in profit again but the majority will.There are hundreds of altcoins and the majority I hold in the the current top 40 so as soon as Bitcoin gets near $30k I will be in profit again - I am just not sure how long that will be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mozzart",
      "created_time": "March 28, 2023, 02:46:59 PM",
      "body": "Quote from: JamesDaniel90 on March 28, 2023, 10:56:41 AMI have decided I have too many altcoins in my portfolio and want to convert up to half of them into Bitcoin but I am waiting for the next pump like we saw in January to do this as don't want to convert while my altcoins are 20% down. I have only been in crypto last 12 months so not that experienced when it comes to understanding cycles. Do we have any idea when the next altcoin season is due? I think it’s worth waiting for when bitcoin goes into a very confident growth and drags the rest of the market with it. But not all altcoins will grow as much, it’s important that by this moment your portfolio of tokens is prepared. You can count on the growth of projects from the top 100 or even 50.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "March 28, 2023, 03:05:36 PM",
      "body": "Quote from: JamesDaniel90 on March 28, 2023, 10:56:41 AMDo we have any idea when the next altcoin season is due? It's most likely before the pump of bitcoin, you'll hear people say that it could happen by the end of this year but nothing is certain for this year. But what's certain is that by next year bitcoin will have its halving and that will lead again for the price of it to pump which will lead to altcoin season again. The cycle sometimes isn't being followed and we don't know if that's going to be the exact time that it will pump.Once the bull run is activated, all of the efforts being done during this phase through accumulation will be paid off.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "March 28, 2023, 03:08:40 PM",
      "body": "There's no more altcoin season because Bitcoin is unbeatable, the only way altcoins can overtake Bitcoin was on 2017/2018, but Ethereum still not able to beat Bitcoin despite Bitcoin price is dump and Ethereum is rising. Nowadays most of altcoins are scam and only created for money purpose, the cycle never end and that's make an investor will not hold altcoins for a long time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Psynthax",
      "created_time": "March 28, 2023, 03:16:46 PM",
      "body": "always look out for bitcoin season first, it's the bane of altcoin bullruns generally after bitcoin is rising high, altcoins will follow, you can see the pattern from the chart not too long ago when bitcoin rising from $23k to $27k and altcoins are all following and increase massively.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}