{
  "id": "topic_5446360",
  "title": "Alphakilo",
  "author": "Alphakilo",
  "created_time": "March 26, 2023, 01:05:03 PM",
  "content": "I really need a clarification on this. Is chasing looses in gambling same as looking for closure because i recently read an article on reddit where the poster said that he will gamble untill he wins just to look for closure. I have been thinking about this for sometime now because closure has the same characteristics with chasing looses which is even when the gambler is loosing he will still be gambling just to recover all his looses.Source:https://www.reddit.com/r/gambling/comments/120jc8a/should_i_gamble_until_i_win_so_that_i_can_have_a/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=3&utm_content=share_button",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446360",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "March 26, 2023, 01:09:40 PM",
      "body": "If you gamble and you lose, best not to gamble at that time again, because it can bring you more losses. You want to close the losses by winning little or you want to win all back can take more money from you. Gamble responsibly.Forget about the loss, do not gamble again for that time, have good quality mindset back before gambling. Do not count what you lose as losses, use little amount you can afford to lose to gamble.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "March 26, 2023, 01:22:46 PM",
      "body": "Chasing losses for closure? That's just a silly justification to me. Any person who thinks that way is already considered a gambling addict in my book and is only finding absurd reasons why he keeps on betting. I can confidently say that there will be no closure even after he manages to get a winning streak. He will still gamble his winnings until he loses again. The cycle continues......",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "March 26, 2023, 01:30:44 PM",
      "body": "You are better off calling for some help[1] if you think that chasing loses would justify the closure in terms of gambling! Come on mate, its 2023, you can't just ruin your life because of some stupid reddit post.[1] https://www.reddit.com/r/problemgambling/wiki/index/#wiki_resources",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "March 26, 2023, 01:37:27 PM",
      "body": "Quote from: Alphakilo on March 26, 2023, 01:05:03 PMI really need a clarification on this. Is chasing looses in gambling same as looking for closure because i recently read an article on reddit where the poster said that he will gamble untill he wins just to look for closure. I have been thinking about this for sometime now because closure has the same characteristics with chasing looses which is even when the gambler is loosing he will still be gambling just to recover all his looses.Source:https://www.reddit.com/r/gambling/comments/120jc8a/should_i_gamble_until_i_win_so_that_i_can_have_a/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=3&utm_content=share_buttonI don't think chasing loses will bring any benefit to a gambler.Gamblers who keep playing,do so for a reason,they are still expecting to hit that huge jackpot or big win otherwise without any objective and motivation closing up on gambling is really easy.To make it further look good most casinos offer you benefits the longer you play with them,with rakeback which is giving you something back for every bet you make at that casino,so if you win,you get some small amount on top of it from rakeback,if you lose,you have that rakeback as a consolation prize.Different strategies keep people gambling but the main one is to hit a huge jackpot or a huge payout.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Peanutswar",
      "created_time": "March 26, 2023, 01:38:19 PM",
      "body": "When people take a good profit they keep chasing more and we know how gambling works not all the time it's your lucky day if you win already a good profit why not call this a day and not just keep being greedy. Once you get to lose all those winnings that are the time you'll chase those losses and instead you get satisfied because you are getting greedy you keep going on it to chase and make your losses double Set a plan stick to it and gambling activities always have a limit. Be a responsible gambler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "March 26, 2023, 02:14:38 PM",
      "body": "Quote from: Alphakilo on March 26, 2023, 01:05:03 PMI really need a clarification on this. Is chasing looses in gambling same as looking for closure because i recently read an article on reddit where the poster said that he will gamble untill he wins just to look for closure. I have been thinking about this for sometime now because closure has the same characteristics with chasing looses which is even when the gambler is loosing he will still be gambling just to recover all his looses.Source:https://www.reddit.com/r/gambling/comments/120jc8a/should_i_gamble_until_i_win_so_that_i_can_have_a/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=3&utm_content=share_buttonAccording to me, finding closure is when the gambler wants to make even with the losses and then exit.Chasing losses is the process to finding closure. As simple as that.But this is something which we should avoid at all times because we eventually end up losing more instead of finding closure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "March 26, 2023, 02:18:56 PM",
      "body": "Quote from: Yogee on March 26, 2023, 01:22:46 PMChasing losses for closure? That's just a silly justification to me. Any person who thinks that way is already considered a gambling addict in my book and is only finding absurd reasons why he keeps on betting. I can confidently say that there will be no closure even after he manages to get a winning streak. He will still gamble his winnings until he loses again. The cycle continues......I second that this is just a way to make people believe that he has reason to continue this is the first time I encounter such a word in gambling, if you cannot stop from chasing your losses, you are a gambling addict no ifs no buts and you just want to defend your action so people will not think that you are addicted to gambling and you cannot be stopped from playing until you lose everything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "March 26, 2023, 02:35:56 PM",
      "body": "Quote from: Alphakilo on March 26, 2023, 01:05:03 PMI really need a clarification on this. Is chasing looses in gambling same as looking for closure because i recently read an article on reddit where the poster said that he will gamble until he wins just to look for closure.He needs closure after a loss and he decides the best way to do so is by pursuing his losses, that is a bad decision already in itself. Gambling unfortunately does not know who needs closure or not, gambling shows no mercy and cares less for someone who has even lost, he will keep loosing until he understands that closure is gotten by accepting losses made already and not chasing after them in gambling. If he decides to keep chasing closure by trying to win, he will loose and simply become frustrated or even depressed by his actions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doell",
      "created_time": "March 26, 2023, 02:46:13 PM",
      "body": "Quote from: pawanjain on March 26, 2023, 02:14:38 PMQuote from: Alphakilo on March 26, 2023, 01:05:03 PMI really need a clarification on this. Is chasing looses in gambling same as looking for closure because i recently read an article on reddit where the poster said that he will gamble untill he wins just to look for closure. I have been thinking about this for sometime now because closure has the same characteristics with chasing looses which is even when the gambler is loosing he will still be gambling just to recover all his looses.Source:https://www.reddit.com/r/gambling/comments/120jc8a/should_i_gamble_until_i_win_so_that_i_can_have_a/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=3&utm_content=share_buttonAccording to me, finding closure is when the gambler wants to make even with the losses and then exit.Chasing losses is the process to finding closure. As simple as that.But this is something which we should avoid at all times because we eventually end up losing more instead of finding closure.Which means there is no difference from those words, when lose the gambler will play again to find a win and then closure it. That's right, we must avoid this. My experience is when chasing losses will always lose, rarely find a win to close it especially in slot games.  I personally gambling only with money which can afford to lose, if lose I must be to stop and then continue when want to gambling again next weeks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CarnagexD",
      "created_time": "March 26, 2023, 02:47:38 PM",
      "body": "Quote from: Alphakilo on March 26, 2023, 01:05:03 PMI really need a clarification on this. Is chasing looses in gambling same as looking for closure because i recently read an article on reddit where the poster said that he will gamble untill he wins just to look for closure. I have been thinking about this for sometime now because closure has the same characteristics with chasing looses which is even when the gambler is loosing he will still be gambling just to recover all his looses.Source:https://www.reddit.com/r/gambling/comments/120jc8a/should_i_gamble_until_i_win_so_that_i_can_have_a/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=3&utm_content=share_buttonThey are certainly not the same. You can try again, like once, just to see if you'll win for the last time but not until just you actually win because what if it took you to bet all of your available fund? I think it is not a worthy closure at all. Chasing losses is completely different from finding closure in your lose. You can have closure without spending too much time and money to earn it back. You can learn not to do the same mistake again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "March 26, 2023, 02:48:59 PM",
      "body": "it means this person has lost a lot of money because he will continue to gamble to find victory, to be honest it looks sad when he sees someone addicted to gambling to the point of high curiosity, I guarantee he will not be able to return all that has been lost after all chasing him will not finding that closure, I thought it would slowly kill him and the only way was to get someone to stop him",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "March 26, 2023, 02:56:43 PM",
      "body": "Quote from: Alphakilo on March 26, 2023, 01:05:03 PMI really need a clarification on this. Is chasing looses in gambling same as looking for closure because i recently read an article on reddit where the poster said that he will gamble untill he wins just to look for closure. I have been thinking about this for sometime now because closure has the same characteristics with chasing looses which is even when the gambler is loosing he will still be gambling just to recover all his looses.I don't think you can classify a Reddit post as an article. It's like referring to some threads on this forum as news. Just take a look at that thread and you can see more or less the same comment about OP's decision. It is clear that OP is addicted to gambling and he probably won't quit until something worse happens, which is unfortunate.If you share the same opinion as him, I suggest you take a break and rethink it. You can't get closure by keep gambling your money away, if you already lose too much then stop and quit, look for jobs, and save/invest your money in BTC or other things. That is arguably better than spending your money continuously without thinking about your life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "March 26, 2023, 03:13:31 PM",
      "body": "Quote from: Alphakilo on March 26, 2023, 01:05:03 PMI really need a clarification on this.We often see cases like that, in this case it can be said for those who lose big in betting, frustration, disappointment, emotional the main basis for those who say so is closing and chasing victory.I conclude in this discussion, if they are lucky, maybe they can do a closing, but not sure what they say, it's just lust and emotional talk, if they win at gambling, I'm sure they will still bet and will spend the winning money again.Remember, the world of gambling has the most advanced tools to hypnotize its customers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "March 26, 2023, 03:24:44 PM",
      "body": "Quote from: Alphakilo on March 26, 2023, 01:05:03 PMI really need a clarification on this. Is chasing looses in gambling same as looking for closure because i recently read an article on reddit where the poster said that he will gamble untill he wins just to look for closure. I have been thinking about this for sometime now because closure has the same characteristics with chasing looses which is even when the gambler is loosing he will still be gambling just to recover all his looses.That just means that he will gamble until he losses everything, he just makes up a word so people will understand, closure can be used in a relationship but never in gambling the guy is coining or inventing new words so those who are chasing their losses will just say I want to continue playing not to chase my losses but only for closure.We all know excessive gamblers will find a way or say unusual words so they can get support on why they should continue gambling even if they are losing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "March 26, 2023, 03:25:55 PM",
      "body": "It is always very risky to keep on gambling if you have limited funds. If you are not some sort of investor billionaire, or youtuber, or holding owner etc you obviously have limited funds. If you feel like you are addicted to gambling and enjoying fun, its best to play with low amount of cash so at least you would lose less. But if you keep trying to cover your losses everyday it will never help you. Only very lucky gamblers can achieve success in such situation. Sometimes its best thing to leave table or close browser and go for walk in sunny weather. This is how I see.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "March 26, 2023, 03:29:52 PM",
      "body": "Quote from: Alphakilo on March 26, 2023, 01:05:03 PMI really need a clarification on this. Is chasing looses in gambling same as looking for closure because i recently read an article on reddit where the poster said that he will gamble untill he wins just to look for closure. I have been thinking about this for sometime now because closure has the same characteristics with chasing looses which is even when the gambler is loosing he will still be gambling just to recover all his looses.Closure is different from chasing losses. Chasing losses is just the will of the gambler to play more just to recover loss while closure is a way to end gambling session win or lose.I usually do closure using a set amount of win or lose whichever comes first. Setting chasing loss as closure on gambling is suicide because the tendency for a gambler to increase risky bet is high because they want to recover quickly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "March 26, 2023, 03:41:31 PM",
      "body": "Finding closure and chasing losses are both sides of a coin. They are the same symptoms of gambling problem. Any gambler who thinks he or she needs to find closure after a loss is merely living in denial of their addiction. the person needs urgent help. People just like to throw fancy words around to mask their addiction. If you lose log out and find an outdoor activity to do. If you find out you are gambling above your budget, log out and find someone else to talk to. Don't find closure. Don't chase losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "March 26, 2023, 03:45:05 PM",
      "body": "chasing your losses and looking for closure are basically the same. the real question is, would he really quit once he got his \"closure\"? the fact that he wants \"closure\" in order to stop gambling already shows how much he can't control himself, I won't be surprised if he stops gambling even if he wins back some of his winnings. if you check the dude's account on Reddit he clearly has a gambling addiction. the dude needs help. also after checking his post history, the dude clearly has a gambling addiction(he admitted it himself) so I think when he says he wants closure in order to quit, he is just making an excuse to justify and continue his gambling instead of rehabilitating himself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "March 26, 2023, 03:49:03 PM",
      "body": "Quote from: joniboini on March 26, 2023, 02:56:43 PMIt is clear that OP is addicted to gambling and he probably won't quit until something worse happens, which is unfortunate.how did you come to that conclusion if you don't know OP personally, you don't know anything about his life, you don't know anything about his gaming history, maybe OP is asking these questions because he intends to create a book? maybe OP is asking these questions because at his college or at his work he was told to do research on this topic or maybe OP chose this topic as a finalization course in college and for that reason he is asking questions. My point is that just because the guy asked these questions doesn't mean he's a gambling addict.Quote from: Alphakilo on March 26, 2023, 01:05:03 PMI really need a clarification on this. Is chasing looses in gambling same as looking for closurein my opinion the two things are the same things, they just have different names but action and intention are the same. I'll give you an example: a person deposits 100$, takes 10$, loses, takes another 10$ and loses, repeats this cycle until he has 10$, then says: \"I'll keep playing until I have 100$ and then I give up!\". now comes another person who deposits 100$, bets 10$ and loses, bets 10$ again and loses, repeats this cycle until he has 10$ and then says: \"I will continue playing to recover my losses and I will make profits\". in both cases they will play until they lose everything, they will sell everything they have, they will steal and lie and in the end they will end up in a rehab clinic for gambling addicts. always look at gambling as fun",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}