{
  "id": "topic_5461729",
  "title": "albon",
  "author": "albon",
  "created_time": "August 01, 2023, 09:05:09 PM",
  "content": "مرحباً أصدقائى الكرام,أكد مؤسس بينانس CZ على خطته لإدراج العديد من العملات المستقرة على منصة بينانس الرائدة ومعرفة أي منها سوف ينجو من الصراعات التنظيمية، وأن فريقه يعمل على إدراج عملة مستقرة خوارزمية جديدة مقابل الدولار، وأنتقد CZ عملة تثير المستقرة وهي أكبر عملة مستقرة في السوق يوم الإثنين الماضي في إحدى جلساته على تويتر وقال أنها تفتقر للشفافية وأنها لم تقدم تقرير تدقيق حتى الآن وعلى حد قوله إنها تشبه الصندوق الأسود نظراً للمخاطر التي تثار حولها، وحذر CZ أيضا من العملات المستقرة وخصائص المخاطرة المتنوعة التي تتمتع بها، وقد نشر تغريدة ساخرة من قبل قائلا أيضاً إن البتكوين أشد استقراراً من العملات المستقرة الحالية، الجدير بالذكر أن منصة بينانس بدأت بالتخلي عن عملة تثير المستقرة في إكتتاباتها الحديثة فعلي سبيل المثال عملة SEI وعملة CYBER متاحة أمام عملات TUSD و FDUSD المستقرتان و BNB فقط.للإستماع لجلسة سبيس وما قاله مؤسس بينانس: https://twitter.com/binance/status/1685976178006351873المصدر: https://cointelegraph.com/news/changpeng-zhao-cz-binance-stablecoin-strategy-tether-busd",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461729",
  "comments": [
    {
      "author": "yhiaali3",
      "created_time": "August 02, 2023, 04:31:09 AM",
      "body": "Quote from: albon on August 01, 2023, 09:05:09 PMأكد مؤسس بينانس CZ على خطته لإدراج العديد من العملات المستقرة على منصة بينانس الرائدة ومعرفة أي منها سوف ينجو من الصراعات التنظيمية، وأن فريقه يعمل على إدراج عملة مستقرة خوارزمية جديدة مقابل الدولار، وأنتقد CZ عملة تثير المستقرة وهي أكبر عملة مستقرة في السوق يوم الإثنين الماضي في إحدى جلساته على تويتر وقال أنها تفتقر للشفافية وأنها لم تقدم تقرير تدقيق حتى الآن وعلى حد قوله إنها تشبه الصندوق الأسود نظراً للمخاطر التي تثار حولها، وحذر CZ أيضا من العملات المستقرة وخصائص المخاطرة المتنوعة التي تتمتع بها، وقد نشر تغريدة ساخرة من قبل قائلا أيضاً إن البتكوين أشد استقراراً من العملات المستقرة الحالية، الجدير بالذكر أن منصة بينانس بدأت بالتخلي عن عملة تثير المستقرة في إكتتاباتها الحديثة فعلي سبيل المثال عملة SEI وعملة CYBER متاحة أمام عملات TUSD و FDUSD المستقرتان و BNB فقط.شكرا لك أخي. لم أسمع عن عملة SEI وعملة CYBER ولا أدري هل عملات جديدة أم قديمة؟ لذلك أجريت بعض البحث، لكن لفت انتباهي فيديو على اليوتيوب يقوم بالترويج لربح مجاني  من بينانس للعملتين SEI و CYBER كل ساعة لكن بشرط أنه يجب أن تكون تمتلك أصول في المنصة بثلاثة عملات BNB و TUSD و FUDSD. لا أعرف إن كان الفيديو صحيح لأن حسابي محظور في بينانس. لكن إذا صح الفيديو فهذا يؤكد أن بينانس بدأت عمليا بدعم هذه العملات.على كل حال خطوة جيدة من بينانس لدعم العملات المستقرة ، هذه الخطوة تساعد في التقليل من مخاطر المركزية بسبب تنوع الخيارات ويمكن أن تكون بمثابة غربال للعملات المستقرة أيضا حيث في النهاية ستصمد العملة الأقوى والمقبولة تنظيميا. لكن ما أثارني أن CZ ينتقد عملة تثير المستقرة وأنها تفتقر إلى الشفافية وهي نفس التهمة التي تم توجيهها إلى عملته المستقرة BUSD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "August 02, 2023, 06:59:03 PM",
      "body": "جميع العملات التي يطلق عليها تسمية \"عملات مستقرة\" هي في الأصل ليست مستقرة و لا علاقة لها بالاستقرار في مفهومه الشمولي. تقع تسميتها بالعملات المستقرة نظرا لارتباطها مع قيمة 1 دولار ثابتة على اعتبار ان الدولار عملة مستقرة. لكن أهم نقطة في هذا المنطق و التي تنسف مفهوم الاستقرار تماما هي ان تلك العملات يجب ان تستمد قيمتها من احتياطي ثابت من الدولار على نفس عدد الوحدات التي يقع اصدارها. الثابت لدينا ان اي هيئة او طرف يود اصدار عملات مستقرة مدعومة بالدولار ان يوفر الاحتياطي الكافي لذلك و لكن ليس هناك اي اثباتات من اي من تلك الهيئات انها فعلا تمتلك احتياطيات من العملة الصعبة بعدد قيمة ما تنتجه من وحدات و حتى لو كلفت طرفا للقيام بذلك لاضفاء مزيد من الشفافية فان ليس هناك ما يضمن نزاهة العملية أصلا.حصلت العديد من الكوارث منذ قررت المنصات اصدار هذه العملات و كانت جميعها تقريبا تتمحور حول اكتشاف ان العملة يتم انتاجها من العدم حرفيا و لا يتم توفير اي احتياطي مقابلها. كل قيمتها تستمدها من ثقة المستخدمين بالمنصة او المنصات التي تدعم تلك العملة.ان كان هذا يعني شيئا فهو يعني ان تلك العملات هي اكثر خطورة من غيرها، و ان سعرها الثابت لا يمنعها من الانهيار و هو ما حصل مع شبكة لونا السنة الماضية و عملات اخرى تم احراق جزء منها او الغاء دعمها على ازواج التبادليات على منصات التداول.لا انصح بالوثوق بكل هذا حتى لو كان يصدر من بينانس لانه لا ننسى ان بينانس هي شركة استثمارية و كل مخططاتها هي لزيادة ارباحها بالدرجة الأولى حتى لو كان على حساب المستخدمين قليلي الخبرة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "August 02, 2023, 11:57:11 PM",
      "body": "شكرا على نشر الخبر اخي. للأمانة لم أكن على علم بهذا الموضوع من قبل.سواء كانت عملة تيثر مستقرة او غير مستقرة (و هي الأكثر استقرار حاليا غم سخرية صاحب منصة بينانص منها) و سواد كانت شفافة او غير شفافة، الأمر الأكيد هو أن استغناء منصة بينانص عن هذه العملة و عدم دعمها سيكون بداية نهاية المنصة رغم كل البدائل التي سيتم طرحها.عملة تيثر، رغم كونها مركزية و كل مساوئها و رغم كل الشبهات التي تحوم حولها الا انها تبقى العملة الاقوى برأيي بعد عملة البيتكوين. هي بالتأكيد العملة الأكثر استخداما من قبل مستخدمي العملات الرقمية و خاصة المبتدئين و المستخدمين العاديين سواءا احبابنا ذلك او كرهنا.بصراحة استغرب مثل هذه التصريحات من مدير تنفيذي لمنصة بحجم منصة بينانص!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "August 03, 2023, 07:40:25 PM",
      "body": "Quote from: khaled0111 on August 02, 2023, 11:57:11 PMشكرا على نشر الخبر اخي. للأمانة لم أكن على علم بهذا الموضوع من قبل.سواء كانت عملة تيثر مستقرة او غير مستقرة (و هي الأكثر استقرار حاليا غم سخرية صاحب منصة بينانص منها) و سواد كانت شفافة او غير شفافة، الأمر الأكيد هو أن استغناء منصة بينانص عن هذه العملة و عدم دعمها سيكون بداية نهاية المنصة رغم كل البدائل التي سيتم طرحها.عملة تيثر، رغم كونها مركزية و كل مساوئها و رغم كل الشبهات التي تحوم حولها الا انها تبقى العملة الاقوى برأيي بعد عملة البيتكوين. هي بالتأكيد العملة الأكثر استخداما من قبل مستخدمي العملات الرقمية و خاصة المبتدئين و المستخدمين العاديين سواءا احبابنا ذلك او كرهنا.بصراحة استغرب مثل هذه التصريحات من مدير تنفيذي لمنصة بحجم منصة بينانص! أنا صراحة إستغربت من الأمر لماذا كل هذه السخرية خصوصاً أن عملة التيثر المستقرة لديها تاريخ كبير في سوق التشفير، لكن كما أشارت أخي ربما ستكون بداية نهاية منصة بينانص إذا تم حذف هذه العملة بكل تأكيد سيكون له تأثير كبير لأغلب الأزواج كما أن أغلب متداولي العملة الرقمية يعتمدون كثيراً على هذه العملة أثناء تداولات اليومية و الأسبوعية لأنها الملاذ الأمين أثناء الإنزلاقات القوية.أم أن هذا الخبر أتى بعدما أخذت إجراءات معينة في حق العملة من طرف لجنة الأوراق المالية حاولت البحث و لم أجد أي سبب لهذا. على الأغلب في حالة تتفيذ حكم بحق التيثر سيتوجه أغلب المتداولين إلى منصات بديلة تدعم عملة التيثر.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "August 04, 2023, 06:50:39 PM",
      "body": "Quote from: Ulven on August 03, 2023, 07:40:25 PMQuote from: khaled0111 on August 02, 2023, 11:57:11 PMشكرا على نشر الخبر اخي. للأمانة لم أكن على علم بهذا الموضوع من قبل.سواء كانت عملة تيثر مستقرة او غير مستقرة (و هي الأكثر استقرار حاليا غم سخرية صاحب منصة بينانص منها) و سواد كانت شفافة او غير شفافة، الأمر الأكيد هو أن استغناء منصة بينانص عن هذه العملة و عدم دعمها سيكون بداية نهاية المنصة رغم كل البدائل التي سيتم طرحها.عملة تيثر، رغم كونها مركزية و كل مساوئها و رغم كل الشبهات التي تحوم حولها الا انها تبقى العملة الاقوى برأيي بعد عملة البيتكوين. هي بالتأكيد العملة الأكثر استخداما من قبل مستخدمي العملات الرقمية و خاصة المبتدئين و المستخدمين العاديين سواءا احبابنا ذلك او كرهنا.بصراحة استغرب مثل هذه التصريحات من مدير تنفيذي لمنصة بحجم منصة بينانص! أنا صراحة إستغربت من الأمر لماذا كل هذه السخرية خصوصاً أن عملة التيثر المستقرة لديها تاريخ كبير في سوق التشفير، لكن كما أشارت أخي ربما ستكون بداية نهاية منصة بينانص إذا تم حذف هذه العملة بكل تأكيد سيكون له تأثير كبير لأغلب الأزواج كما أن أغلب متداولي العملة الرقمية يعتمدون كثيراً على هذه العملة أثناء تداولات اليومية و الأسبوعية لأنها الملاذ الأمين أثناء الإنزلاقات القوية.أم أن هذا الخبر أتى بعدما أخذت إجراءات معينة في حق العملة من طرف لجنة الأوراق المالية حاولت البحث و لم أجد أي سبب لهذا. على الأغلب في حالة تتفيذ حكم بحق التيثر سيتوجه أغلب المتداولين إلى منصات بديلة تدعم عملة التيثر.ان يكون لديها تاريخ كبير في سوق التشفير او ان تكون الاكثر استعمالا لا يعني ابدا انها امنة بما يكفي او انه لا يمكن التشكيك بها و التخلي عنها ان لزم الأمر. أنا أكاد أكون متأكدا انه حتى لو تم التخلي تماما (استبعد ذلك تماما) عن عملة usdt من منصة بينانص فان هذا لن يشكل نقطة ضعف المنصة و لا اعتقد انشعبيتها تتراجع. المتداولون يستخدمون العملات المستقرة عموما لتجميد ارصدتهم اثناء فترات الهبوط الحاد في الاسعار و هذا يمكن القيام به خارج المنصة اي باستخدام منصة اخرى و يمكن استخدام عملات اخرى اكثر استقرارا مثل عملة DAW التي كنا تحدثنا عنها سابقا.عملة usdt هي من اكثر العملات استخداما، هذا صحيح. و لكن هذا ليس فقط على بينانس لأننا لو دقنا النظر قليلا فسنجد ان المستخدمون اصبحوا يستعملونها حتى في المعاملات اليومية فيما بينهم و هنا فانهم يستفيدون من خدمات التحويل المجاني على بينانس و الذي لا تستفيد بينانس منه شيئا. يعني ما الذي سيدفع بينانس الى التشبث في عملة تعمل على عدة شبكات في نفس الوقت (تعقيدات تقنية) و تثار حولها شبهات خطيرة عن امكانية تجميدها في اي لحظة او انهيارها تماما و ايضا تنافس عملتها الرئيسية على شبكتها busd و ايضا هناك مخاطر من تتبعات جزائية بسبب الدعم؟المتداولون على بينانس يحتاجون الى عملة مستقرة و يمكن لbusd ان تقوم بالمهمة.بينانس توفر امتيازات مهمة للمستخدمين و لا اعتقد ابدا ان تنهار بسبب تخليها عن احدى ازواج العملات.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}