{
  "id": "topic_5451103",
  "title": "Porfirii",
  "author": "Porfirii",
  "created_time": "May 03, 2023, 02:01:52 PMLast edit: March 16, 2025, 10:56:39 AM by Porfirii",
  "content": "Autor: joker_josueHilo en inglés:  TalkImg.com - Image hosting for BitcoinTalkWWW.TALKIMG.COMPresento un nuevo servicio de alojamiento de imágenes, especialmente diseñado para BitcoinTalk y toda su comunidad.Tras unos pocos años de notar cómo muchas imágenes no aparecen correctamente en el foro o cargan muy lentamente, sin mencionar las imágenes que dejan de aparecer tras unos pocos meses o años, nació el proyecto TalkImg. Propósito  _____________________Proporcionar un servicio de alojamiento dedicado para el foro BitcoinTalk que sea útil y práctico para todo el mundo.La intención es que las imágenes permanezcan disponibles en el foro, y tengan una carga rápida. Funcionalidades ________________- Todas las imágenes que se suban solo pueden ser usadas en el foro (salvo petición del usuario; podrá permitirse tras la valoración por parte de joker_josue).- Solo se permitirá subir imágenes en los formatos admitidos por el foro (JPG, JPEG, PNG, GIF).- Las imágenes deben tener un tamaño máximo de 2,5MB.- Una vez subidas, las imágenes no se pueden borrar (a menos que se use el enlace generado en el momento de subirlas, que solo está disponible en ese momento).- No se permiten imágenes NSFW.- No se llevará a cabo ningún registro de usuario (solo se guardará la IP para controlar el spam).- Toda la información EXIF será borrada por el sistema al cargar.- Opción en el código de añadir el BBCode con la altura y anchura de imagen correspondiente (simplemente elige \"BBCode full fix HxW\").- nuevo Subida a través de enlace, aplicándolas mismas reglas para subir archivos. (Suspendido Temporalmente) Largo Plazo  ___________________Tengo varios años de experiencia con galerías online, y en base a dicha experiencia espero mantener en línea este proyecto durante el mayor tiempo posible. Por supuesto, no podemos predecir el futuro, pero en lo que de mí dependa, este proyecto será mantenido por muchos, muchos años. Servidor  _______________________El servidor dedicado de TalkImg está situado en Países Bajos, y consiste en discos NVMe SSD que garantizan las mejore velocidades de lectura y escritura. Utiliza software LiteSpeed Web Server, que garantiza un mejor rendimiento. Y con procesadores AMD EPYC, por lo que toda la información se procesa tan rápido como es posible. Este servicio está garantizado para los próximos años, con la capacidad de expandirse cuando fuera necesario. Cuenta ________________________Este servicio está ideado para su uso exclusivo en BitcoinTalk, y en este sentido solo los usuarios del foro pueden tener una cuenta en TalkImg, por esa razón la opción de creación de cuentas no está activa para el público general. Los usuarios que quieran tener una cuenta deberían contactar con joker_josue por PM para solicitarlo. La solicitud será evaluada y si se aprueba se creará la cuenta. Copias de Seguridad _____________- El servidor realizará diariamente copias de seguridad automáticas y las conservará hasta 30 días.- Una vez a la semana se creará un ZIP con todas las nuevas imágenes subidas desde la última semana, que estarán disponibles para su descarga durante 15 días, aquí: talkimg.com/tempbackups/nuevo Herramienta ZIP ____________Herramienta de apoyo, que permite imágenes ZIP mayores de 2,5MB. La compresión se lleva a cabo usando funcionalidades PHP, que pueden reducir significativamente la calidad de la imagen. La imagen se carga, convierte y envía a TalkImg automáticamente, proporcionando el enlace/BBCode para poser ser usado en el foro. Esta herramienta está todavía en fase BETA, y puede que tenga algunos fallos.Acceso: Herramienta Zip de Imágenes - TalkImgnuevo Estadísticas ________________Datos estadísticos totales, desde que comenzó el proyecto (28 de abril de 2023):                                                                      Imágenes: 172.970Espacio de Disco: 51.4GBÚltima actualización: 15/03/2025Estadísticas mensuales:[Primeros 15 días][May'23][Jun'23][Jul'23][Ago'2023][Sep'2023][Oct'2023][Nov'2023][Dic'2023][Ene'2024][Feb'24][Mar'24][Primer Año][Abr'24][May'24][Jun'24][Jul'24][Ago'24][Sep'24][Oct'24][Nov'24][Dic'24][Ene'25][Feb'25] Donaciones y Anuncios  ______________El proyecto debería mantenerse en base a donaciones de la comunidad y con anuncios similares a las campañas de firmas del foro.The project should be supported by donations from the community and with advertisements similar to the forum signature campaigns.- Donaciones: Quien quiera contribuir al proyecto puede realizar sus donaciones en Bitcoin a la dirección: bc1qhwnncpdd8gfzqwjkk9n052wf7g9mvks3xaa7qa o a la dirección Lightning: talkimg@wallets.fyoumoneypod.com.- Anuncios: Solo habrá un anuncio en la pantalla de Inicio, similar al que tenemos hoy en día en nuestras firmas. Si el administrador de alguna campaña quiere posicionar un anuncio en TalkImg, por favor, que contacte conmigo. Próximamente  _________________- Sistema de conversión automática de archivos. (sin fecha programada)- Posibilidad de definir el tamaño (alto o ancho) de la imagen en BBCode. (sin fecha programada) Más Detalles ___________________El sitio es administrado por joker_josue, que lo mantendrá y proporcionará soporte completo a los usuarios.Espero vuestra opinión y sugerencias; este servicio ha sido realizado para la comunidad y para servir mejor a la comunidad.Espero que este proyecto dure el mayor tiempo posible, tanto si tiene una gran aceptación como si no. Por tanto, todas las imágenes subidas estarán disponibles para siempre. Enlaces, Scripts y Add-ons  _______TalkImgTérminos y CondicionesPolítica de Privacidadnuevo Estado del Servicio TalkImgnuevo Herramienta Zip de Imagen - TalkImgFirma Promoción TalkImg###[Add-on] Añadir un botón para subir una imagen directamente del foro - Creado por TryNinja[Script] de Imgur a TalkImg - arregla automáticamente tus imágenes rotas - Creado por TryNinjaSi desarrollas un script o add-on que es público, házmelo saber y actualizaré la lista.nuevo Eventos  ___________________TalkImg Awards - Imagen del Año 2023 | patrocinado por BC.Game / Icarus Secciones Locales _______________Este tema* es el único que dará soporte a los usuarios de TalkImg, y siempre tendrá información oficial sobre el proyecto.Pero aquí tenéis una lista de los temas traducidos a las secciones locales:العربية (Árabe) Kavelj22Bahasa Indonesia (Indonesio) dansus021Bengalí roksana.heeAlemán cyganEspañol  PorfiriiNigeria (Naija)  ChilwellPakistán (Urdu) JunaidAziziFilipinas PeanutswarPolaco cyganPortugués joker_josueRuso zasad@Rumano GazetaBitcoinTurco mindrustSi realizas alguna traducción, házmelo saber para actualizar la lista.*Nota del traductor: Se refiere al hilo original en inglés.Traducción ofrecida a iniciativa de:",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451103",
  "comments": [
    {
      "author": "Hispo",
      "created_time": "May 04, 2023, 12:25:45 AM",
      "body": "Tremendo proyecto, cuando aprendí a subir imágenes siempre tenía que usar imgur por era el único servicio del que tenia conocimiento que ofreciese el link con el formato BBcode. Pero por algún motivo (probablemente debido a la ubicación de mi IP) siempre se me hacía muy engorroso acceder a esa página y manipularle.Ya he venido usando desde hace un tiempo otro servicio, pero creo que le daré una oportunidad a esta iniciativa naciente de los usuarios del foro mismo.  Deberían de haber incluido otro tipo de direcciones para donaciones, con lo congestionada que está la red no dan ganas de dar un pequeño aporte.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "May 04, 2023, 10:20:33 AM",
      "body": "Quote from: Hispo on May 04, 2023, 12:25:45 AMTremendo proyecto, cuando aprendí a subir imágenes siempre tenía que usar imgur por era el único servicio del que tenia conocimiento que ofreciese el link con el formato BBcode. Pero por algún motivo (probablemente debido a la ubicación de mi IP) siempre se me hacía muy engorroso acceder a esa página y manipularle.Ya he venido usando desde hace un tiempo otro servicio, pero creo que le daré una oportunidad a esta iniciativa naciente de los usuarios del foro mismo.  Deberían de haber incluido otro tipo de direcciones para donaciones, con lo congestionada que está la red no dan ganas de dar un pequeño aporte.  Sí, yo también le daré una oportunidad. Hay algunas imágenes que las cuelgo directamente en una cuenta de GitHub que yo controlo, y eso lo seguiré haciendo; pero para imágenes más \"generales\" digamos, para las que venía usando imgBB (como tú imgur), empezaré a usar este nuevo servicio exclusivo para el foro.La verdad es que hacía falta que alguien atajara este problema. En mis propios hilos lo he sufrido, pero es que el foro está lleno de mensajes de imágenes con letras en rojo de que no se han podido cargar, a nada que se revisan posts de hace unos meses o pocos años. Comentaba Frankuestein que le había supuesto un pequeño dolor de cabeza tratar de rescatar varias de las imágenes posteadas en el hilo de chistes en español, y muchas de ellas se quedaron en el limbo para siempre.En cuanto a la dirección para donaciones, bueno, siempre se puede poner un fee muy pequeño y esperar que se descongestione la red. Me imagino que habrá algún miembro generoso que aportará lo suficiente como para que al administrador del sitio no le salga pérdidas (encima del tiempo dedicado), pero si además consigue tráfico y un buen patrocinador puede que las donaciones se queden como algo anecdótico.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "May 08, 2023, 12:14:33 AM",
      "body": "Quote from: Porfirii on May 04, 2023, 10:20:33 AMQuote from: Hispo on May 04, 2023, 12:25:45 AMTremendo proyecto, cuando aprendí a subir imágenes siempre tenía que usar imgur por era el único servicio del que tenia conocimiento que ofreciese el link con el formato BBcode. Pero por algún motivo (probablemente debido a la ubicación de mi IP) siempre se me hacía muy engorroso acceder a esa página y manipularle.Ya he venido usando desde hace un tiempo otro servicio, pero creo que le daré una oportunidad a esta iniciativa naciente de los usuarios del foro mismo.  Deberían de haber incluido otro tipo de direcciones para donaciones, con lo congestionada que está la red no dan ganas de dar un pequeño aporte.  Sí, yo también le daré una oportunidad. Hay algunas imágenes que las cuelgo directamente en una cuenta de GitHub que yo controlo, y eso lo seguiré haciendo; pero para imágenes más \"generales\" digamos, para las que venía usando imgBB (como tú imgur), empezaré a usar este nuevo servicio exclusivo para el foro.La verdad es que hacía falta que alguien atajara este problema. En mis propios hilos lo he sufrido, pero es que el foro está lleno de mensajes de imágenes con letras en rojo de que no se han podido cargar, a nada que se revisan posts de hace unos meses o pocos años. Comentaba Frankuestein que le había supuesto un pequeño dolor de cabeza tratar de rescatar varias de las imágenes posteadas en el hilo de chistes en español, y muchas de ellas se quedaron en el limbo para siempre.En cuanto a la dirección para donaciones, bueno, siempre se puede poner un fee muy pequeño y esperar que se descongestione la red. Me imagino que habrá algún miembro generoso que aportará lo suficiente como para que al administrador del sitio no le salga pérdidas (encima del tiempo dedicado), pero si además consigue tráfico y un buen patrocinador puede que las donaciones se queden como algo anecdótico.Eso es algo de lo que me he dado cuenta también al navegar en las participaciones más antiguas del foro en busca que temas interesantes de los tiempos cuando Bitcoin no era tan grande como lo es ahora y siempre me consigo de cara con esas letras rojas que se llevan parte del contexto o información que años atrás enriquecieron el debate.La verdad con lo importante que es el almacenamiento de información del foro para muchos de los usuarios más prominentes de por aquí, yo hubiese adivinado que ya le encontrarían solución al guardado externo de las imágenes compartidas, de alguna forma.Pero comprendo que un bot de notificaciones o una base de datos de texto son cosas mucho más fáciles de implementar que algo para guardar imágenes de forma masiva.En fin, veremos como le va a esta nueva opción.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "May 08, 2023, 11:33:38 AM",
      "body": "Quote from: Hispo on May 08, 2023, 12:14:33 AMQuote from: Porfirii on May 04, 2023, 10:20:33 AMQuote from: Hispo on May 04, 2023, 12:25:45 AM<...><...>Eso es algo de lo que me he dado cuenta también al navegar en las participaciones más antiguas del foro en busca que temas interesantes de los tiempos cuando Bitcoin no era tan grande como lo es ahora y siempre me consigo de cara con esas letras rojas que se llevan parte del contexto o información que años atrás enriquecieron el debate.La verdad con lo importante que es el almacenamiento de información del foro para muchos de los usuarios más prominentes de por aquí, yo hubiese adivinado que ya le encontrarían solución al guardado externo de las imágenes compartidas, de alguna forma.Pero comprendo que un bot de notificaciones o una base de datos de texto son cosas mucho más fáciles de implementar que algo para guardar imágenes de forma masiva.En fin, veremos como le va a esta nueva opción.  Por fin he probado este servicio esta mañana y es tan fácil de usar o más que otras alternativas como las que mencionábamos al inicio de este hilo. No me he fijado si da la opción de arrastrar la imagen, pero es tan sencillo como dar a un botón, seleccionar el archivo y darle a subir, y automáticamente te da el link con el BBcode ya incluido para que no haya ni que darle al botoncillo correspondiente. No hace falta registrarse en la web, aunque se puede hacer, supongo que para acceder a un historial de imágenes subidas.Finalmente no he posteado la imagen en cuestión: era una prueba de que un newbie no era lo que pretendía ser, pero al final me ha sido más cómodo y efectivo reportarlo a un moderador antes que seguirle la corriente. Pero bueno, me ha servido para probar el servicio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "May 24, 2023, 07:08:15 PMLast edit: May 25, 2023, 12:16:15 AM by famososMuertos",
      "body": "Creo que este buen servicio es otro \"salvavidas\" a la permanencia en SMF del foro, vale mencionar como siempre salen estas soluciones de la misma comunidad, ya que 2 usuarios más han dado una mano a este proyecto/foro y ellos mismos han creado sus alternativas/soluciones para la situación presentada.Ya use el servicio, funciona, es una maravillosa alternativa, por el momento solo lo voy a usar para imágenes 100% originales o que no tengan problema de copyright o estén en ese limbo, leí las TOC de este proyecto, son por cierto muy simples de leer. El tema de CR o el asunto de derechos de autor, no debería tener nada asociado en la complejidad, pero es la gran variable para quien host las imágenes y en general de cualquier proyecto. Hoy somos nosotros, pero se viene el resto, usuarios de Internet, alojamiento gratis de imágenes tiene muchos seguidores o quizás decir mejor fans al uploads. Recordar que admin también esta en lo suyo buscando una solución viable para todos, no solo desde el punto de tener una imagen visualizada sino que involucre el aspecto de privacidad. Al menos lo tomo como un aspecto a solucionar.Edit:Ya para las antiguas imágenes enlazadas a Imgur se arreglaron, ahora se puede visualizar nuevamente pero ya no podrá hacerse para nuevas imágenes que quiera subir a IMGUR.Por ahora en el hilo en cuestión del admin, buscan sugerencias además de la que se menciona aquí.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "May 25, 2023, 12:23:01 AM",
      "body": "Quote from: famososMuertos on May 24, 2023, 07:08:15 PMCreo que este buen servicio es otro \"salvavidas\" a la permanencia en SMF del foro, vale mencionar como siempre salen estas soluciones de la misma comunidad, ya que 2 usuarios más han dado una mano a este proyecto/foro y ellos mismos han creado sus alternativas/soluciones para la situación presentada.Ya use el servicio, funciona, es una maravillosa alternativa, por el momento solo lo voy a usar para imágenes 100% originales o que no tengan problema de copyright o estén en ese limbo, leí las TOC de este proyecto, son por cierto muy simples de leer. El tema de CR o el asunto de derechos de autor, no debería tener nada asociado en la complejidad, pero es la gran variable para quien host las imágenes y en general de cualquier proyecto. Hoy somos nosotros, pero se viene el resto, usuarios de Internet, alojamiento gratis de imágenes tiene muchos seguidores o quizás decir mejor fans al uploads. Recordar que admin también esta en lo suyo buscando una solución viable para todos, no solo desde el punto de tener una imagen visualizada sino que involucre el aspecto de privacidad. Al menos lo tomo como un aspecto a solucionar.Edit:Ya para las antiguas imágenes enlazadas a Imgur se arreglaron, ahora se puede visualizar nuevamente pero ya no podrá hacerse para nuevas imágenes que quiera subir a IMGUR.Por ahora en el hilo en cuestión del admin, buscan sugerencias además de la que se menciona aquí.Para ser honesto con ustedes, nunca había tomado en consideración la cuestión de los derechos de autor en el momento de utilizar estos host de imágenes para usarlas en el foro de forma ilustrativa. Osea, siempre me he tomado el tiempo de dar a saber la fuente original de la imagen a través de un link o del nombre de la web. Pero me acabas de recordar con tu post, que efectivamente si el autor de la imagen quisiera, esa persona pudiese enviar un request al compañero que mantiene la web para solicitar una baja de la imagen.En el caso del compartir noticias y a fines, no creo que haya problema, porque al fin y al cabo a las noticias les gusta que les difundan, genera tráfico.Pero considerando que muchas de las fuentes que usamos por aquí son de webs comunes, como Cointelegraph o quizá Yahoo, siempre está el chance de que por algún motivo envíen una carta de remoción masiva. De nuevo, no cuento con que pase, pero la posibilidad no es 0%.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "May 29, 2023, 09:34:07 PM",
      "body": "Si en efecto no solo es el uso de terceros, algunas de las imágenes o cosas que hago a veces caen en esa opinión, en todo caso, es al Hosting de imágenes  al que nos referimos no a los enlaces de paginas webs, entonces parece algo simple, pero es como el hecho de antaño de bajarse un mp3. hay un derecho de uso, el artista. Pero el download lo hace tan fácil que tal cosa se pierde en la practica pero no en la realidad.Las IMG, no son diferentes y es un criterio de usuario usar leyenda o citar las fuentes cuando realmente lo merezcan, hay un random de imágenes que no lo necesitan, pero algunas si, por condiciones de CC y/o un caso por criterio propio aunque el autor no lo pida. Bueno tiene sentido para mi y tampoco es algo que se de mucho encontrar ese tipo de imágenes, al menos que estés en el nicho de fotografías, pero hay sitios que te puedes encontrar con imágenes que valen $500 el derecho de uso y quizás las puedes usar anónimamente, pero si estas en un país donde los derechos de autor se respetan aplican estas leyes \"olvidas\" en el salvaje oeste de la Internet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "May 31, 2023, 02:10:03 PM",
      "body": "Pues, en principio, y como precaución, os haré caso y usaré este servicio principalmente para imágenes originales (mías). Aunque parece difícil que el uso de imágenes de terceros pueda suponer un problema real para el foro, mejor evitar futuros riesgos y tratar de ser 100% pulcros.Ya vi que para las imágenes de IMGUR antiguas se ha buscado una solución (incluso se creó un script pero parece que ya no es necesario), pero para las futuras, mientras la administración del foro no se pronuncie de otro modo, trataré de usar el servicio de TalkImg.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "June 20, 2023, 11:33:37 AM",
      "body": "Quote from: Porfirii on May 31, 2023, 02:10:03 PMPues, en principio, y como precaución, os haré caso y usaré este servicio principalmente para imágenes originales (mías). Aunque parece difícil que el uso de imágenes de terceros pueda suponer un problema real para el foro, mejor evitar futuros riesgos y tratar de ser 100% pulcros.Ya vi que para las imágenes de IMGUR antiguas se ha buscado una solución (incluso se creó un script pero parece que ya no es necesario), pero para las futuras, mientras la administración del foro no se pronuncie de otro modo, trataré de usar el servicio de TalkImg.Creo que si este nuevo servicio u opcion para el alojamiento de imagenes en el foro solo fuese a utilizarse con imagenes de creación propia, entonces el volumen de imagines subidas por unidad de tiempo sería bastante baja. Admitamos que la mayoría de las personas que usan alojadores de imagines para compartirlas en el foro con aquellos que toman de una fuente diferente (dando los creditos necesarios) en pro de hacer más didactica la información que quieren transmitir a los demás. Algo asi, como para evitar los muros de texto que a todo mundo desagrada.Si el autor original de la imagen tiene problemas con la difusión de su contenido (aunque igualmente se le hayan dado los creditos) solo se le da de baja a esos materiales en específicos y nada paso.Creo que así suelen funcionar esa clase de mercados de alojamiento de imagenes, roms, y contenido respaldado, creo yo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "June 20, 2023, 08:20:35 PM",
      "body": "Quote from: Hispo on June 20, 2023, 11:33:37 AMQuote from: Porfirii on May 31, 2023, 02:10:03 PMPues, en principio, y como precaución, os haré caso y usaré este servicio principalmente para imágenes originales (mías). Aunque parece difícil que el uso de imágenes de terceros pueda suponer un problema real para el foro, mejor evitar futuros riesgos y tratar de ser 100% pulcros.-snip--snip-Si el autor original de la imagen tiene problemas con la difusión de su contenido (aunque igualmente se le hayan dado los creditos) solo se le da de baja a esos materiales en específicos y nada paso.Creo que así suelen funcionar esa clase de mercados de alojamiento de imagenes, roms, y contenido respaldado, creo yo.Habida cuenta que estoy viendo que me va a costar bastante más hacerlo que decirlo (lo de solo subir imágenes originales mías), creo que te haré caso y voy a reconsiderar eso de ser tan estricto. Compartir todo tipo de imágenes no deja de ser una práctica común en Internet, que en la mayoría de ocasiones se hace indebidamente pero que haciéndolo bien, dando los créditos como dices, no debería dar ningún problema.Y si, aún cuando finalmente hubiera un problema, si la solución es tan sencilla como una petición de cease and desist como dirían los gringos, pues se da de baja y listo.De todos modos, al menos siempre que puedo, intento compartir los links a las imágenes originales; pero eso conlleva el riesgo que todos conocemos del mensaje de error si por algún motivo le pasa algo a la imagen original o al servidor en que se aloja.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "March 31, 2024, 09:55:26 AM",
      "body": "OP actualizado con los cambios más recientes en TalkImg.com.Me alegra ver cómo esta solución para el problema de las imágenes del foro sigue usándose",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "March 31, 2024, 01:03:13 PM",
      "body": "Quote from: Porfirii on March 31, 2024, 09:55:26 AM<…> Me alegra ver cómo esta solución para el problema de las imágenes del foro sigue usándose <…>Yo me sigo resistiendo, por ciertos principios, a arreglar las imágenes históricas que tenga sobre imgur. Soy consciente de las alternativas que hay, y los scripts para acelerar el proceso de migración, pero sigo en mis trece de que el Foro debería intentar buscar una solución global, atendiendo a la enorme cantidad de imágenes que hay ahora no visualizables (aunque sí se puede seguir sus enlaces) de miles de cuentas, gran parte de ellas además inactivas a fecha de hoy. Una suerte de cabezonería…",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darbitmobilerecovery",
      "created_time": "April 03, 2024, 04:01:32 PM",
      "body": "Quote from: DdmrDdmr on March 31, 2024, 01:03:13 PMQuote from: Porfirii on March 31, 2024, 09:55:26 AM<…> Me alegra ver cómo esta solución para el problema de las imágenes del foro sigue usándose <…>Yo me sigo resistiendo, por ciertos principios, a arreglar las imágenes históricas que tenga sobre imgur. Soy consciente de las alternativas que hay, y los scripts para acelerar el proceso de migración, pero sigo en mis trece de que el Foro debería intentar buscar una solución global, atendiendo a la enorme cantidad de imágenes que hay ahora no visualizables (aunque sí se puede seguir sus enlaces) de miles de cuentas, gran parte de ellas además inactivas a fecha de hoy. Una suerte de cabezonería…Disculpa que no termine de enteder a que te referis.Te referis al hecho de que el foro debiera empezar a tener su propio hosteo de imagenes y no depender de uno externo, sea cual fuere este?. De ser asi estoy de acuerdo, aunque desconozco los costos y problemas extra de administración que esto podria ocasionarle al administrador. Si igual por las dudas para evitar el Spam se podria indicar una cuota de imagenes por semana por usuario.Respecto a talkimg lo único que no me termina de gustar es que a diferencia de otros servicios no nos da la posibilidad de que las fotos sean temporales. En imgbb uno puede seleccionar de que se borren después de un determinado tiempo, cosa que sirve cuando son imágenes superfluas. Lógicamente que después si las borran o no queda en la buena fe de la empresa, pero yo creo que si en pos de ahorrarse espacio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "April 03, 2024, 05:49:15 PM",
      "body": "Quote from: darbitmobilerecovery on April 03, 2024, 04:01:32 PM<…>Digamos que me hubiese gustado que el foro encontrase una solución que sirviese para todas las cuentas (pasadas, presentes, futuras), y no sólo para aquellas personas que están activas, se mueven por Meta, tienen interés en usar un servicio que está circunscrito al foro (sin ser del foro propiamente), y se decidan a arreglar su histórico de imágenes por sí mismo (con o sin script de soporte). Si no he perdido el hilo al contexto, la no visualización de imágenes se ciñe no obstante a las hospedadas en imgur (no sé si sucede en alguna otra plataforma), dado que imgur no permitía que las imágenes se viesen a través de proxy (Bitcointalk hace de proxy). Esto quiere decir que la alternativa era que el navegador del usuario accediese a imgur para obtener las imágenes, con la consiguiente pérdida de privacidad (imgur podría \"ver\" las IPs de cualquiera que visualice una imagen de imgur desde Bitcointalk).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "April 03, 2024, 07:40:49 PM",
      "body": "Quote from: darbitmobilerecovery on April 03, 2024, 04:01:32 PMRespecto a talkimg lo único que no me termina de gustar es que a diferencia de otros servicios no nos da la posibilidad de que las fotos sean temporales. En imgbb uno puede seleccionar de que se borren después de un determinado tiempo, cosa que sirve cuando son imágenes superfluas. Lógicamente que después si las borran o no queda en la buena fe de la empresa, pero yo creo que si en pos de ahorrarse espacio.El hecho de que no sea posible hacer que las imágenes sean temporales significa que las imágenes nunca dejarán de ser visibles en el foro. El servicio fue diseñado para el foro Bitcointalk, y con el objetivo principal de eliminar problemas con la visualización de imágenes, las cuales eran eliminadas después de un tiempo, dejando los temas completamente desorganizados.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "April 04, 2024, 04:57:26 AMLast edit: April 09, 2024, 02:27:26 PM by Porfirii",
      "body": "Quote from: joker_josue on April 03, 2024, 07:40:49 PMQuote from: darbitmobilerecovery on April 03, 2024, 04:01:32 PMRespecto a talkimg lo único que no me termina de gustar es que a diferencia de otros servicios no nos da la posibilidad de que las fotos sean temporales. En imgbb uno puede seleccionar de que se borren después de un determinado tiempo, cosa que sirve cuando son imágenes superfluas. Lógicamente que después si las borran o no queda en la buena fe de la empresa, pero yo creo que si en pos de ahorrarse espacio.El hecho de que no sea posible hacer que las imágenes sean temporales significa que las imágenes nunca dejarán de ser visibles en el foro. El servicio fue diseñado para el foro Bitcointalk, y con el objetivo principal de eliminar problemas con la visualización de imágenes, las cuales eran eliminadas después de un tiempo, dejando los temas completamente desorganizados.Claro, he pensado algo parecido cuando he leído el comentario de darbitmobilerecovery: puede ser útil o práctico hablando en general que las imágenes se borren al de un tiempo; pero en bitcointalk en particular (y TalkImg es específica para este foro) no tiene mucho sentido dicha función, si lo que se quiere evitar es precisamente que las imágenes no desaparezcan ni con el pasar de los años.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darbitmobilerecovery",
      "created_time": "April 05, 2024, 05:58:25 PM",
      "body": "Quote from: joker_josue on April 03, 2024, 07:40:49 PMQuote from: darbitmobilerecovery on April 03, 2024, 04:01:32 PMRespecto a talkimg lo único que no me termina de gustar es que a diferencia de otros servicios no nos da la posibilidad de que las fotos sean temporales. En imgbb uno puede seleccionar de que se borren después de un determinado tiempo, cosa que sirve cuando son imágenes superfluas. Lógicamente que después si las borran o no queda en la buena fe de la empresa, pero yo creo que si en pos de ahorrarse espacio.El hecho de que no sea posible hacer que las imágenes sean temporales significa que las imágenes nunca dejarán de ser visibles en el foro. El servicio fue diseñado para el foro Bitcointalk, y con el objetivo principal de eliminar problemas con la visualización de imágenes, las cuales eran eliminadas después de un tiempo, dejando los temas completamente desorganizados.Gracias joker por pasarte a comentar! Si imagine que viene por ahi la cuestión y apoyo que asi sea, solo lo decía para imágenes que realmente no tienen ningún valor a largo plazo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "May 26, 2024, 11:23:43 AM",
      "body": "Bump.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "October 07, 2024, 03:10:39 PM",
      "body": "He visto que la página tiene una opción, no se si es nueva o siempre ha estado ahí presente, pero como sabemos la imagen debe tener un tamaño de 2.5MB, Talkimg ofrece la opción de reducir el tamaño de la imagen sin que lo tengas que hacer antes, en mi caso me sucede a veces, por si acaso en el futuro alguien le sucede que la imagen no se visualiza adecuadamente.https://www.zip.talkimg.comDe nuevo, gracias por este aporte, y en época de bajo \"fee /sat/vB, siempre se puede mandar unos Satoshi a este proyecto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}