{
  "id": "topic_5459948",
  "title": "Zogporyasubratva",
  "author": "Zogporyasubratva",
  "created_time": "July 15, 2023, 09:19:02 PM",
  "content": "Hello bitcoin community, how are you? I hope you are well. I open thread because I have a doubt, I have never mined with fpga, only with others like cpu and one or another asic, because you need a more powerful hardware to mine this currency, I would just like to know how I could mine with fpga either any cryptocurrency. I don't know how to import the algorithm, nor if it is possible to mine with a cyclone 10 model 10CL016YU484C8G. I was hoping someone will help me thank you very much.I was told that you might be able to help me here, thank you very much.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459948",
  "comments": [
    {
      "author": "FP91G",
      "created_time": "July 16, 2023, 12:11:39 PM",
      "body": "Quote from: Zogporyasubratva on July 15, 2023, 09:19:02 PMHello bitcoin community, how are you? I hope you are well. I open thread because I have a doubt, I have never mined with fpga, only with others like cpu and one or another asic, because you need a more powerful hardware to mine this currency, I would just like to know how I could mine with fpga either any cryptocurrency. I don't know how to import the algorithm, nor if it is possible to mine with a cyclone 10 model 10CL016YU484C8G. I was hoping someone will help me thank you very much.I was told that you might be able to help me here, thank you very much. Each fpga manufacturer for miners has coin mining software. This is worth checking out before buying. There are also paid versions of the software that give a higher hashrate and the ability to mine more coins.Try asking here   https://voskcointalk.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zogporyasubratva",
      "created_time": "July 16, 2023, 11:24:47 PM",
      "body": "Thank you very much gentleman for your help, I will ask there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "July 19, 2023, 01:47:22 PM",
      "body": "Quote from: Zogporyasubratva on July 16, 2023, 11:24:47 PMThank you very much gentleman for your help, I will ask there. Please post a link to your discussion on another forum. I am very interested in what can be mined on FPGA on Intel chips and is there any universal software for mining on similar FPGA on the same chips. So we will be able to calculate the cost of this device for mining, although it is made for other tasks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zogporyasubratva",
      "created_time": "July 21, 2023, 08:29:30 AM",
      "body": "Hello gentleman of course here it is in case you didn't get it or didn't see it https://voskcointalk.com/If you wish I can share with you what I have been able to research. I have not only intel but xilinx especially an artix 7 XC7A100T-2FGG484I. And I am commanding to make a fpga as 6 processors I'm just waiting for the software and that kind of stuff (how to carry out the mining if I have not very clear, but as it goes there I am investigating).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "July 28, 2023, 10:37:51 PM",
      "body": "I’m also curious about this. I often see people making crazy claims about their FPGA miners and for a time I experienced the power of being a first mover with an FPGA on Bitcoin’s blockchain. It was great. I still have the 10+ year old Butterfly Labs FPGA miners. I wonder if anyone has ever repurposed them for anything else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}