{
  "id": "topic_5418608",
  "title": "Houssem_Tz",
  "author": "Houssem_Tz",
  "created_time": "October 28, 2022, 08:58:19 AM",
  "content": "In recent years, we have seen a rapid expansion of digital currencies. At the same time, we cannot deny that the situation of the global economy is fragile.In this context, economic growth will continue to slow down and inflation will continue to accelerate. Overall, the economic and monetary risks have increased significantly.The NoMarkUp and TunCoin projects were born in this context, as de-banking becomes a major issue for millions, billions of human beings. We have developed a set of solutions based on blockchain technologyTunCoin is a crypto-currency token based on the Binance Smart Chain (BSC) created by the team for the development of three projects:1/ TUN: The issuance of an intuitive digital token to simplify commercial and financial exchanges.2/ NoMarkUp corporation: The creation of an innovative international Web3.0 e-commerce corporation based fundamentally on Blockchain technology and smart-contracts.3/ NoMarkUp foundation: The launch of our foundation, whose mission will be the implementation and monitoring of our CSR strategy (Corporate Social Responsibility) our CSR strategy aims to consider our global performance from the three angles of economic, societal and especially environmentalJoin us!Sincerely.Our social networks :Twitter: https://twitter.com/TunCoin_OffiFacebook: https://www.facebook.com/TunCoin.officiel/Reddit: https://www.reddit.com/r/TunCoin/Telegram: https://t.me/Tuncoin_officielYoutube: https://www.youtube.com/channel/UCS_X48jXRezBE_-bIMECw0AMedium: https://medium.com/@tuncoin.offi",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418608",
  "comments": [
    {
      "author": "Houssem_Tz",
      "created_time": "November 07, 2022, 11:27:17 AM",
      "body": "Join Our Twitter https://twitter.com/TunCoin_Offi",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Houssem_Tz",
      "created_time": "November 10, 2022, 08:15:25 AM",
      "body": "Here we go !!We humbly present our white paperhttps://tuncoin.io/wp/white_paper_tuncoin_v1.pdf",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TunCoin",
      "created_time": "December 21, 2022, 06:52:43 PM",
      "body": "https://tuncoin.io/produit/tuncoin/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}