{
  "id": "topic_5476961",
  "title": "Disruptivas",
  "author": "Disruptivas",
  "created_time": "December 07, 2023, 09:06:13 PM",
  "content": "O mundo cripto já não é mais como antigamente.Censura aos mixes, censura as transações no ETH, censura no Bitcoin...Mais de 70% de todos os validadores do Ethereum estão compliance com as sanções impostas pelo Escritório de Controle de Ativos Estrangeiros (OFAC). As sanções ganharam força depois das questões do Tornado Cash. Desde então, o número de validadores da rede censurando transações atingiu o ponto em que mais de 2/3 da rede não processar transações do Tornado Cash.No caso da mineracão POW, acho que pagando mais pelas taxas, essas transações seriam aprovadas.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476961",
  "comments": [
    {
      "author": "TryNinja",
      "created_time": "December 07, 2023, 11:43:02 PM",
      "body": "Site pra quem quiser acompanhar: https://www.mevwatch.info/A rede já está nesse estado há um belo tempo (lembro até que teve essa discussão aqui), porém a porcentagem de validadores que censuram transações pela lista da OFAC esteve ABAIXANDO constantemente desde aquela época. De um ATH de 79% para os atuais 32%, uma bela melhora causada pelo open-source desses relays.Na prática não há de fato censura plena. O que pode acontecer é a sua tx demorar mais pra ser aprovada, pois você deve esperar que um relay amigável aceite-a.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Prancheiro",
      "created_time": "December 08, 2023, 12:03:16 PM",
      "body": "Quando houve o hack da The DAO, especula-se (e até pode ser que já seja público) que os órgãos e agentes fizeram uma pressão na Ethereum Foundation e consequentemente no Vitalik (que não deixa de ser a cara da rede) para que \"resolvessem\" o problema, dado que isso era possível, para evitar problemas legais face o dinheiro de muita gente que havia sido \"roubado\".Não à toa apoiaram o lado de reescrever o passado da blockchain no fork!Fico pensando se o mesmo seria aplicável à rede Bitcoin. Tudo bem que existe uma centralização em termos de uso do Bitcoin Core, mas se houver um ataque coordenado das instituições, me parece mais fácil de a própria rede (programadores) criarem versões do Bitcoin Core livres, ou seja, sem regras de censura a blocos / transações / sats.Quote from: TryNinja on December 07, 2023, 11:43:02 PM...uma bela melhora causada pelo open-source desses relays.Na prática não há de fato censura plena. O que pode acontecer é a sua tx demorar mais pra ser aprovada, pois você deve esperar que um relay amigável aceite-a.TryNinja, quando você fala relay, seria um nó da rede ethereum eventualmente anônimo que está disposto a validar tal transação?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fazu",
      "created_time": "December 08, 2023, 02:49:47 PM",
      "body": "Vamos encontrar outros caminhos, no worries",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l3pox",
      "created_time": "December 08, 2023, 03:40:54 PM",
      "body": "Quote from: Prancheiro on December 08, 2023, 12:03:16 PMQuando houve o hack da The DAO, especula-se (e até pode ser que já seja público) que os órgãos e agentes fizeram uma pressão na Ethereum Foundation e consequentemente no Vitalik (que não deixa de ser a cara da rede) para que \"resolvessem\" o problema, dado que isso era possível, para evitar problemas legais face o dinheiro de muita gente que havia sido \"roubado\".Não à toa apoiaram o lado de reescrever o passado da blockchain no fork!Fico pensando se o mesmo seria aplicável à rede Bitcoin. Tudo bem que existe uma centralização em termos de uso do Bitcoin Core, mas se houver um ataque coordenado das instituições, me parece mais fácil de a própria rede (programadores) criarem versões do Bitcoin Core livres, ou seja, sem regras de censura a blocos / transações / sats.Quote from: TryNinja on December 07, 2023, 11:43:02 PM...uma bela melhora causada pelo open-source desses relays.Na prática não há de fato censura plena. O que pode acontecer é a sua tx demorar mais pra ser aprovada, pois você deve esperar que um relay amigável aceite-a.TryNinja, quando você fala relay, seria um nó da rede ethereum eventualmente anônimo que está disposto a validar tal transação?o infinite machine narra com detalhes a história do The Dao, não acho que teve pressão de órgãos e agentes não, a rede era muito pequena ainda para issoé uma boa teoria da conspiração mas não parece realo Vitalik e os devs da época viram que essa seria a melhor forma mesmo, mas nunca aconteceria algo assim no estado atual da rede, como a gente vê mesmo com hacks milionários.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "December 08, 2023, 03:47:18 PM",
      "body": "Quote from: Prancheiro on December 08, 2023, 12:03:16 PMQuando houve o hack da The DAO, especula-se (e até pode ser que já seja público) que os órgãos e agentes fizeram uma pressão na Ethereum Foundation e consequentemente no Vitalik (que não deixa de ser a cara da rede) para que \"resolvessem\" o problema, dado que isso era possível, para evitar problemas legais face o dinheiro de muita gente que havia sido \"roubado\".Não à toa apoiaram o lado de reescrever o passado da blockchain no fork!Fico pensando se o mesmo seria aplicável à rede Bitcoin. Tudo bem que existe uma centralização em termos de uso do Bitcoin Core, mas se houver um ataque coordenado das instituições, me parece mais fácil de a própria rede (programadores) criarem versões do Bitcoin Core livres, ou seja, sem regras de censura a blocos / transações / sats.Na época do DAO cerca de 14% do ETH da rede foi roubado. Claro que a situação se agravou por ter muito dinheiro de investidores, devs, etc... mas fico imaginando, inicio da rede, 1/10 de tudo roubado, no contexto de que 1 ETH -> 1 voto, será que essa situação no Bitcoin resultaria em: \"nossa, fizemos cagada, mas não tem o que fazer\"?Quote from: Prancheiro on December 08, 2023, 12:03:16 PMTryNinja, quando você fala relay, seria um nó da rede ethereum eventualmente anônimo que está disposto a validar tal transação?Relay nesse contexto seria um terceiro que fica entre os usuários da rede e os validadores. Ele é o responsável por construir os blocos de forma que o validador possa inclui-lo e lucrar o máximo possível. Quando falam em MEV, pagar para ter uma transação incluida no lugar X do bloco Y, de forma que se possa \"sanduichar\" alguem, é através de um relay que isso acontece.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "December 08, 2023, 06:22:27 PM",
      "body": "Quote from: TryNinja on December 07, 2023, 11:43:02 PMSite pra quem quiser acompanhar: https://www.mevwatch.info/A rede já está nesse estado há um belo tempo (lembro até que teve essa discussão aqui), porém a porcentagem de validadores que censuram transações pela lista da OFAC esteve ABAIXANDO constantemente desde aquela época. De um ATH de 79% para os atuais 32%, uma bela melhora causada pelo open-source desses relays.Na prática não há de fato censura plena. O que pode acontecer é a sua tx demorar mais pra ser aprovada, pois você deve esperar que um relay amigável aceite-a.Caramba!!Que boa notícia. Eu tinha ficado bem triste com a notícia na verdade. Mas não tinha feito o MÍNIMO que era buscar o dado. Confiei na matéria. Obrigada por compartilhar o link com os dados da censura real time, realmente feliz em saber que a censura está caindo e não subindo.  Olhando o MEV WATCH, fiquei com uma curiosidade. Tem uma % de censura, que vai de 100% a 5% no menor level. Como estamos falando de ''apenas uma lista'', no caso a lista da OFAC, tu sabe o que/qual parametros são usados pelos validadores? Eu imaginava que era mais binária, aceita ou não aceita. Seu comentário sobre ''censura plena'' é um ponto interessante.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}