{
  "id": "topic_5460587",
  "title": "Eternad",
  "author": "Eternad",
  "created_time": "July 21, 2023, 05:00:01 PM",
  "content": "May alam ba kayo na trusted telegram group para sa P2P exchange? May group kasi ako dati na kay Elyacim galing sa Binance P2P na nagooffer ng P2P exchange sa telegram. Balak ko sana gamitin ito para sa mga minimal PwP transaction ko instead n padaanin ko pa sa Binance.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460587",
  "comments": [
    {
      "author": "Beparanf",
      "created_time": "July 21, 2023, 06:44:15 PM",
      "body": "Quote from: Eternad on July 21, 2023, 05:00:01 PMMay alam ba kayo na trusted telegram group para sa P2P exchange? May group kasi ako dati na kay Elyacim galing sa Binance P2P na nagooffer ng P2P exchange sa telegram. Balak ko sana gamitin ito para sa mga minimal PwP transaction ko instead n padaanin ko pa sa Binance. Halos lahat ng P2P exchange group na alam ko sa telegram ay nawala na or naging puro scam na. Hindi na kasi indemand yung ganitong kalakaran dahil sobrang risky na mag send first. Mas ok pa din talaga yung P2P exchange kagaya ng Binance dahil may escrow na magpro2tekta ng funds both party.Mag post ka nlng ng trade offer mo dto. Baka meron need ng micro transactions sa crypto na pwede sayo makipag trade sa fiat. My trust score naman tayo dito kaya madali mo ma filter mga scammer dahil wala naman mangsscam sayo na high rank sa maliit na halaga lamang.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bisdak40",
      "created_time": "July 21, 2023, 10:03:38 PM",
      "body": "Quote from: Beparanf on July 21, 2023, 06:44:15 PMMag post ka nlng ng trade offer mo dto. Baka meron need ng micro transactions sa crypto na pwede sayo makipag trade sa fiat. My trust score naman tayo dito kaya madali mo ma filter mga scammer dahil wala naman mangsscam sayo na high rank sa maliit na halaga lamang.Ito rin sana ang isu-suggest ko kay OP dahil marami naman siguro tayong mga kababayan na tutulong kung sakali man may manghingi ng ganitong klaseng tulong dahil kung sa Binance kasi ay medyo magastos sa transaction fees. Huwag na masyadong mag-alala kung malaman yong tunay na pangalan mo dahil kung sa Gcash mo ito idaraan ay hindi naman ilalagay na Gcash yong boung pangalan natin kayan safe pa rin yong hindi gutong malaman yong pangalan nila.Try to post your offer OP baka makatulong tayo dyan, huwag na sa telegram dahil puros scam doon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "July 22, 2023, 01:22:07 PM",
      "body": "Maraming salamat sa suggestion guys. Actually gusto ko din talaga mag post nalang dito kaso napapansin ko lng na hindi active masyado ang pamilihan section natin kaya baka matagalan lang kung papadaanin ko pa dito while sa telegram ay sobrang bilis ng communication sa trade. Gagawa ako ng P2P trading thread natin dito sa Pamilihan board once need ko na ulit magpa cashout sa gcash gamit ang BTC ko sa upcoming payment ko this week sa campaign.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bttzed03",
      "created_time": "July 22, 2023, 01:53:52 PM",
      "body": "Kung may coins.ph account ka pa, pwede na rekta trading sa coins pro gamit mobile app. Pwede na yan para sa maliliit na trades since wala naman sila minimum amount. Pagkakaalam ko zero trading fees for USDT-PHP at USDC-PHP, 0.25% maker fee at 0.30% taker fee para sa ibang pairs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bhadz",
      "created_time": "July 23, 2023, 03:10:17 PM",
      "body": "Quote from: Eternad on July 22, 2023, 01:22:07 PMMaraming salamat sa suggestion guys. Actually gusto ko din talaga mag post nalang dito kaso napapansin ko lng na hindi active masyado ang pamilihan section natin kaya baka matagalan lang kung papadaanin ko pa dito while sa telegram ay sobrang bilis ng communication sa trade. Hindi talaga masyadong active, kaya ako todo active ako dito kahit papano kaso parang ang hirap i-up kung oonti lang talaga pumupunta dito sa mismong local natin. Mabilis sa telegram kaso wala kasi silang feature na escrow at mas mahirap magtiwala sa mga trade diyan, mas mainam na sa mismong mga p2p market ka na.Quote from: Eternad on July 22, 2023, 01:22:07 PMGagawa ako ng P2P trading thread natin dito sa Pamilihan board once need ko na ulit magpa cashout sa gcash gamit ang BTC ko sa upcoming payment ko this week sa campaign.Nice, para dagdag active ulit dito sa thread natin at para na din sa iba na gusto mag trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}