{
  "id": "topic_5463542",
  "title": "hafiztalha",
  "author": "hafiztalha",
  "created_time": "August 16, 2023, 11:53:26 PM",
  "content": "Hello All Community!Recently, Sei Mainnet was launched and which is base on Blockchain project. Their testnet had end few days ago and they had launch an airdrop for early users. Just a few min ago, claiming link was live. As we all know whenever an airdrop happens there are lot of scammers who create various scam and phishing sites to steal funds by hacking wallets. To avoid such scammers and always get the claiming link from the official account of the project and also recently a verified account sharing Pishing sites.  Original Claiming Link:  https://app.sei.io/ Pishing Site Link: never click Code:https://sei-airdrop.com/ Scammer Profile Link: https://twitter.com/sunil_agarwa?t=Yvf7KbJKJY4cA1JThkEDiA&s=09",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463542",
  "comments": [
    {
      "author": "EarnOnVictor",
      "created_time": "August 17, 2023, 01:32:25 AM",
      "body": "People should be wiser by now, it's almost the same pattern these scammers are using. @ScamVirus also posted a warning on SEI airdrop 2 weeks ago but a different scam site (https://bitcointalk.org/index.php?topic=5462041.0).Following the official sites or trusted media outlets that redirect to the official sites is the solution.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "August 17, 2023, 08:12:47 AM",
      "body": "Quote from: EarnOnVictor on August 17, 2023, 01:32:25 AMPeople should be wiser by now, it's almost the same pattern these scammers are using. @ScamVirus also posted a warning on SEI airdrop 2 weeks ago but a different scam site (https://bitcointalk.org/index.php?topic=5462041.0).twitter aka X make scam easier, they buy the blue badge and the number of followers, and suddenly you have something legal that some people can believe.when they search for news, the first thing they search for is in those applications that show the accounts that are documented with the blue badge first and have a large number of followers, so scam succeeds.Even Google searches can be faked bu scam ads or showing scam site first, you should search well before clicking on any link.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nheer",
      "created_time": "August 17, 2023, 12:58:51 PM",
      "body": "Quote from: Husires on August 17, 2023, 08:12:47 AMQuote from: EarnOnVictor on August 17, 2023, 01:32:25 AMPeople should be wiser by now, it's almost the same pattern these scammers are using. @ScamVirus also posted a warning on SEI airdrop 2 weeks ago but a different scam site (https://bitcointalk.org/index.php?topic=5462041.0).twitter aka X make scam easier, they buy the blue badge and the number of followers, and suddenly you have something legal that some people can believe.when they search for news, the first thing they search for is in those applications that show the accounts that are documented with the blue badge first and have a large number of followers, so scam succeeds.Even Google searches can be faked bu scam ads or showing scam site first, you should search well before clicking on any link.The concept that the blue badge can be purchased bothers me alot, it has been quite challenging to spot ordinary people wearing the blue badge because only influencers and famous people could obtain the blue badge. People are more likely to comply with requests when they see an account with the blue tick because they assume it is real. We should discourage people from purchasing this badge, and we should use greater caution when interacting with accounts that have many followers and the blue badge. Scammers take use of every channel available, and this Twitter scam seems more ideal because they can quickly win people over by spending a little money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "August 17, 2023, 02:41:02 PM",
      "body": "Account has been suspended, it seems that twitterX support cares a little more about scams now.Quote from: Nheer on August 17, 2023, 12:58:51 PMThe concept that the blue badge can be purchased bothers me alot,Musk's concept of supporting free speech on his platform turned out to be successful, and the priority was people who subscribed to thee badge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "August 19, 2023, 10:13:58 AM",
      "body": "Quote from: rat03gopoh on August 17, 2023, 02:41:02 PMAccount has been suspended, it seems that twitterX support cares a little more about scams now.I think it is because of the many reports they've received but we know TwitterX, like Facebook they are not going to take action if there are no mass reports, sometimes their action is late because the scammers have already scammed a lot of users, people should moderate their greed and do their research first, a profitable airdrop is very rare and scammers think that they can many newbies because of SEI's popularity.If a popular platform is going to launch an airdrop it should come first from its official homepage and then on its social media accounts, if it's not on its homepage don't just believe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "August 19, 2023, 02:38:09 PM",
      "body": "Quote from: coin-investor on August 19, 2023, 10:13:58 AMand scammers think that they can many newbies because of SEI's popularity.It's not about scammers thinking; it's about scammers using newbies greed against them. After some of the popular airdrops that give free luck to thousands of people, airdrops like that of Uniswap and Arbitrary that just happened recently, newbies have been wanting to explore any opportunities that they see about trending projects and airdrops. It's only a few people that usually do some kind of research about a particular project to determine if they are truly doing airdrops or not, or if the link they get from some sort of random social media user is legit or not. They are always in a hurry to participate in order for the slot to not be filled before their entry. If people can learn how to DYOR, the rate of people falling into scam traps will reduce, and the scammers might as well reduce the resources they spend on tools as it will turn out not to be profitable to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "August 21, 2023, 11:23:17 PM",
      "body": "It is good that Sunil Agarwal's account has been restricted. This phishing domain, which is seven days old, also has been down, and this is the result of reports and complaints submitted by positive people to protect as many newbies as possible who still do not know the difference between a phishing domain and a legitimate one. Indeed, there was an airdrop for the SEI project. Of course, scammers took the opportunity to disinform SEI communities, mislead and deceive them, especially Twitter, through accounts impersonating the SEI name, and by DMing people who ask for help on how to claim airdrop coins, they send them malicious links and phishing domains, They also publish tweets continuously and mention many Twitter user accounts to trap them. Unfortunately, Twitter is now free of censorship and is full of bots, spam, and chaos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "August 21, 2023, 11:56:23 PM",
      "body": "Quote from: albon on August 21, 2023, 11:23:17 PMUnfortunately, Twitter is now free of censorship and is full of bots, spam, and chaos.It's going to make things worst and that's why everyone needs to be more careful when they're focused on the airdrops there. Good thing that account was already flagged down but we don't know if another account will emerge and will try to verify itself and will make another looking legitimate airdrop from SEI or any other project that has taken the spotlight lately because of how successful their launching was. Having these criteria for having a blue checkmark makes it easier for these scammers to stay on this platform, X/Twitter.  Quote from: https://help.twitter.com/en/managing-your-account/about-twitter-verified-accountsEligibility criteria for the blue checkmarkOnly accounts actively subscribed to X Premium are eligible to receive the blue checkmark.Our team uses an eligibility criteria on when the checkmark is given to ensure we maintain the integrity of the platform. Your account must meet the following criteria to receive or retain the blue checkmark: Complete: Your account must have a display name and profile photoActive use: Your account must be active in the past 30 days to subscribe to X PremiumSecurity: Your account must have a confirmed phone numberNon-Deceptive:Your account must have no recent changes to your profile photo, display name, or username (@handle)Your account must have no signs of being misleading or deceptiveYour account must have no signs of engaging in platform manipulation and spamAs we look at the bottom part of non-deceptive. I wonder if they really are filtering all of these subscribed to their premium/blue checkmark. Because it looks easy for them to get verified and this is giving the idea for other scammers that they can do that and imitate and fool people with the use of other known projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sopiandi",
      "created_time": "August 22, 2023, 05:36:30 AM",
      "body": "SEI NOT WORK is #SeiScamProject scammer in 2023",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "August 22, 2023, 11:33:40 AM",
      "body": "Quote from: sopiandi on August 22, 2023, 05:36:30 AMSEI NOT WORK is #SeiScamProject scammer in 2023What exactly are you talking about? Could you provide more context or details about the situation?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blckhawk",
      "created_time": "August 22, 2023, 02:08:49 PM",
      "body": "At this point, everyone should know by now especially those that have been in the crypto space for a long time that they should be careful of airdrops from new tokens introduced especially if you've known about that airdrop on X/Twitter, most likely it's going to be a scam to steal your money and preying on your gullibility and greediness. Nice catch OP.Quote from: EarnOnVictor on August 17, 2023, 01:32:25 AMPeople should be wiser by now, it's almost the same pattern these scammers are using. @ScamVirus also posted a warning on SEI airdrop 2 weeks ago but a different scam site (https://bitcointalk.org/index.php?topic=5462041.0).Following the official sites or trusted media outlets that redirect to the official sites is the solution.The problem with these is that people are still falling for this because everyday there's new people being introduced to crypto and we all know about newbies that don't have guidance, they'll likely fall victim to scams as most scammers are good at sweet talking newbies and newbies are looking for guides to help them and anything that comes to them, they'll likely welcome it not knowing if it's a scam or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hafiztalha",
      "created_time": "August 22, 2023, 02:45:04 PM",
      "body": "Quote from: FatFork on August 22, 2023, 11:33:40 AMQuote from: sopiandi on August 22, 2023, 05:36:30 AMSEI NOT WORK is #SeiScamProject scammer in 2023What exactly are you talking about? Could you provide more context or details about the situation?I think this ussr seems to be talking about the rewards which is given to early users. They are wondering why the rewards were so small and are comparing it to recent Airdrops like Sui, ARB and Aptos where a significant number of wallets received Airdrops (100k to 1 million wallets) after thorough verification. But SEI project gave Airdrops to around 7 million wallets and each wallet received $2 to $20+ worth of tokens. This is clearly mentioned in their articlehttps://blog.sei.io/atlantic_rewards/They acknowledge that these airdrops attract bots and suggest that if the project had given airdrop to verified wallets then everyone get good profit",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shasan",
      "created_time": "August 30, 2023, 11:16:58 PM",
      "body": "I think there are more scam sites regarding the airdrop. If we search on Google we can see a lot of results with the name of sei airdrop. And if anyone are not aware about the original site then there is a high chance to be scammed. Though all the sites are not scammed many sites can be used for link building and so on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}