{
  "id": "topic_5446539",
  "title": "betzus",
  "author": "betzus",
  "created_time": "March 27, 2023, 07:13:14 PM",
  "content": "guys i have searched a lot but could not found source where to send money to add photo to my topic . actually i did not yet opened my topic yet . i just want photo to be on my topic. please help me on how to do it . as i know it costs some mmbbtcs to add photos to topic post.thank you and dont be very strict to me if i opened this topic on wrong place.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446539",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "March 27, 2023, 07:17:50 PM",
      "body": "I think you're referring to the copper membership[1] which you can find here[2]Or by going to MORE (near the logout button) -> Buy copper membership).After that, you just need to upload the image somewhere and post the link between img tags, like this:Code:[img]http://IMG_URL.jpg[/img][1] https://bitcointalk.org/index.php?topic=2385104[2] https://bitcointalk.org/index.php?action=credit;promote",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uche6215",
      "created_time": "March 27, 2023, 07:32:17 PM",
      "body": "Quote from: betzus on March 27, 2023, 07:13:14 PMguys i have searched a lot but could not found source where to send money to add photo to my topic . actually i did not yet opened my topic yet . i just want photo to be on my topic. please help me on how to do it . as i know it costs some mmbbtcs to add photos to topic post.thank you and dont be very strict to me if i opened this topic on wrong place. Omegastarscream has already shown you how to add an image to your thread already but this is not supposed to be the first question you should ask on this forum and even if you know how to post an image on your thread it will be of no use to you because I believe that you most have to be a jr member rank before posting an image on your thread so, please do your self a favor by learning about bitcoin first before any other thng.  Thanks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LeGaulois",
      "created_time": "March 27, 2023, 08:16:47 PM",
      "body": "You say you've searched a lot. Yet, the result is on the top if you use the \"Search\" featurehttps://cse.google.com/cse?cx=016660200577587308545%3Aesf40ml9aag&ie=UTF-8&q=how+to+add+image&sa=Google+search#gsc.tab=0&gsc.q=how%20to%20add%20image&gsc.page=1And there are multiple topics answering your question. Sorry but you haven't searched a lot and perhaps not at all.And to add, such topic should be in the \"Beginners and Help\" board but not in \"Service Discussion\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 27, 2023, 11:38:10 PM",
      "body": "Quote from: uche6215 on March 27, 2023, 07:32:17 PMOmegastarscream has already shown you how to add an image to your thread already but this is not supposed to be the first question you should ask on this forum and even if you know how to post an image on your thread it will be of no use to you because I believe that you most have to be a jr member rank before posting an image on your thread so, please do your self a favor by learning about bitcoin first before any other thng.  Thanks. The OP question is legitimate, as despite being a newbie member, the forum has the ability to pay for the option to add images.Asking this question is not to say that the OP doesn't know what Bitcoin is.He probably wants to share some service or information, and plans to do it using images, I don't know. But, the question is valid, despite being a bit repetitive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "March 28, 2023, 01:17:54 AM",
      "body": "Remember to do this step, if you buy a copper membership.Quote from: theymos on November 11, 2017, 06:01:16 AMQuote from: Quickseller on November 11, 2017, 03:54:09 AMIs “copper member” displayed when someone pays the fee? If so do they retain he title after they have sufficient activity to become a “member”? Once you have it, you get the choice:If you don't afford to buy it, you will have to rank up to Junior Member to display images with bbcode.FAQ: Everything you need to know about forum 'activity, account ranks and meritMeanwhile if you don't afford to buy it or can not rank up to Jr. member, you can leave that image bbcode link in your post, other members can quote it to show the image.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shahzadafzal",
      "created_time": "March 28, 2023, 01:48:39 AM",
      "body": "Quote from: betzus on March 27, 2023, 07:13:14 PMguys i have searched a lot but could not found source where to send money to add photo to my topic . actually i did not yet opened my topic yet . i just want photo to be on my topic. please help me on how to do it . as i know it costs some mmbbtcs to add photos to topic post.thank you and dont be very strict to me if i opened this topic on wrong place. I guess you mean where to send money for the copper membership?If so then on the below link you should see the unique BTC address with required amount to buy your Copper membership.https://bitcointalk.org/index.php?action=credit;promoteOnce payment is done you will be able to add photos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "March 28, 2023, 07:31:56 AM",
      "body": "since OmegaStarScream shared a link to copper membership and you plan to post a thread with images in it, then I just want to add that if you want to make the images clickable I suggest following this tutorial [Tutorial] How to add image, resize image and make image clickableQuote from: uche6215 on March 27, 2023, 07:32:17 PMOmegastarscream has already shown you how to add an image to your thread already but this is not supposed to be the first question you should ask on this forum and even if you know how to post an image on your thread it will be of no use to you because I believe that you most have to be a jr member rank before posting an image on your thread so, please do your self a favor by learning about bitcoin first before any other thng.  Thanks. there is nothing wrong with the OP's first question here in the forum. there are no criteria on what news member's first question should be in the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Suzume",
      "created_time": "March 28, 2023, 08:53:15 AM",
      "body": "@betzus you are newbie that's the reason you can't post photo. If you post photo that photo will not visible to other until someone one quote your post images..  If you want to post images you have to buy copper membership or you have to rank up newbie to jr.member .  If you want to buy copper member you can buy it here https://bitcointalk.org/index.php?topic=2385104Here is the basic of posting images",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "March 28, 2023, 12:39:44 PM",
      "body": "Quote from: betzus on March 27, 2023, 07:13:14 PMguys i have searched a lot but could not found source where to send money to add photo to my topic . actually i did not yet opened my topic yet . i just want photo to be on my topic. please help me on how to do it . as i know it costs some mmbbtcs to add photos to topic post.thank you and dont be very strict to me if i opened this topic on wrong place. You're on the right place, it could also be asked on the beginners and help section as well, being a newbie, all you needed to do us to purchase a copper membership to enable you to post an avatar, you can as well make this possible if you get to a jr member rank without buying a copper membership, all you need is to get a single merit and have the required activities for a jr member rank, you can post image then without requesting for any assistance for getting it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "betzus",
      "created_time": "March 29, 2023, 10:27:48 AM",
      "body": "i am wearing now paid membership but when trying to open new topic with image and i hit preview it says   bitcointalk.org image proxy invalid image",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "betzus",
      "created_time": "March 29, 2023, 10:29:58 AM",
      "body": "done. thanks guys to you all for your best help.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "March 29, 2023, 10:31:29 AM",
      "body": "Quote from: betzus on March 29, 2023, 10:27:48 AMi am wearing now paid membership but when trying to open new topic with image and i hit preview it says   bitcointalk.org image proxy invalid imageIf it doesn't work: try a different image host.Test this:Code:[img width=178 height=162 alt=Image loading...]https://loyce.club/other/Report.png[/img]It should show:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "March 29, 2023, 04:33:40 PM",
      "body": "Quote from: betzus on March 29, 2023, 10:27:48 AMi am wearing now paid membership but when trying to open new topic with image and i hit preview it says   bitcointalk.org image proxy invalid imageI am seeing that you have uploaded the image and it's visible on your thread so now it's not a problem for you but in case you can upload them here https://postimages.org/ as you will find different links to copy the BBcode to paste in your post which can help you.So now you are good to go I would also suggest lock the topic if you don't have anything else to ask because it would no fun in discussing it further.You will find the lock topic option at the bottom of this thread if you want.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "youdacapt",
      "created_time": "March 29, 2023, 05:38:42 PM",
      "body": "Quote from: betzus on March 27, 2023, 07:13:14 PMguys i have searched a lot but could not found source where to send money to add photo to my topic . actually i did not yet opened my topic yet . i just want photo to be on my topic. please help me on how to do it . as i know it costs some mmbbtcs to add photos to topic post.thank you and dont be very strict to me if i opened this topic on wrong place. For me, i use Postimg Website always and it works like magic. All you have to do is copy the Hotlink for forums Link.It works like magic",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "March 29, 2023, 09:53:41 PM",
      "body": "Quote from: betzus on March 29, 2023, 10:27:48 AMi am wearing now paid membership but when trying to open new topic with image and i hit preview it says   bitcointalk.org image proxy invalid imageI shared a link to a tutorial on how to post images on this forum yesterday, I suggest you check it out. the tutorial also shows how to resize the images and how to make them clickable.Quote from: acroman08 on March 28, 2023, 07:31:56 AMI suggest following this tutorial [Tutorial] How to add image, resize image and make image clickable",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "March 30, 2023, 01:51:26 PM",
      "body": "Quote from: youdacapt on March 29, 2023, 05:38:42 PMFor me, i use Postimg Website always and it works like magic. All you have to do is copy the Hotlink for forums Link.I have already mentioned above the same image hosting site to upload images and copy the link in your post.Earlier I was using imgbb but there was some issues due to which the same error of invalid proxy was displayed instead of images but find the alternative which worked really good for me without any problem till now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}