{
  "id": "topic_5402006",
  "title": "danadc",
  "author": "danadc",
  "created_time": "June 09, 2022, 11:19:14 PM",
  "content": "Este artículo es de opinión pero quise traerlo para debatir sobre lo que piensan,para mi es un activo que puede ser usado como refugio seguro \"temporal\" cuando en el mundo ocurren  eventos muy sobresalientes,en la pandemia uno de los mercados que se recuperó rápido fué el de BTC,para muchos es un activo de riesgo,pero para los más arriesgados lo es cuando meten dinero y no ven sus ganancias,es asi cuando compraron en más de 60000dólares y esperaban el precio a 100000dólares.QuoteEl mercado Bitcoin se compone principalmente de mineros, exchanges, inversores y traders. El lucro es la motivación principal. Se compra hoy aspirando vender más adelante a un mejor precio. Bitcoin es un Wall Street en esteroides. actualmente el precio del BTC está entre los 29000 y 30000 dólares,qué puede pasar si las cosas salen mal y hay muchos metiendo dinero,o ¿tendrán la buena suerte de comprar ahorita y vender en 100000 dólares?Según el artículo,los grandes inversores hacen esto:QuoteNormalmente, los inversores, en periodos de miedo e incertidumbre, se vuelven más conservadores. Esto, por lo general, implica que se refugian en el dólar, en los bonos del Tesoro (EEUU), en el oro y en las compañías defensivas más consolidadas en busca de estabilidad. Eso lo hacen mientras evitan los sectores más especulativos de la economía como el sector crecimiento/tecnológico para escapar de la volatilidad. Irónicamente, no es extraño que los inversores en periodos difíciles buscan refugio en Papá Estado. Nos guste o no. Fuente: https://es.cointelegraph.com/news/bitcoin-safe-haven-or-risk-assetesto me toma por sorpresa porque deberían buscar refugio en el oro,en una caída del dólar o el euro ellos igual perderán,en el oro no.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402006",
  "comments": [
    {
      "author": "DdmrDdmr",
      "created_time": "June 10, 2022, 05:26:29 AM",
      "body": "Lo del calificativo de \"seguro\" al lado de \"refugio\" es lo que me cuesta aceptar. Que bitcoin pueda tener tintes de valor refugio vale, aunque es discutible, y siempre sujeto a parámetros de plazos de tiempos indeterminados a los cuales mucha gente particular o inversores no se pueden acoger. Por otro lado, es tradicionalmente un activo de riesgo. Sin adentrarnos con argumentos maximalistas, a mí no se me ocurriría recomendar a la gente de mi entorno invertir en él de manera encarecida por esta faceta de su naturaleza, luego mi percepción claramente lo ve como un activo de riesgo. No obstante, como he indicado antes, el eje del tiempo y el poder aguantar sin fecha concreta en el horizonte es clave.Claro que también depende de las latitudes en las cuales nos encontremos (por aquello de la inflación), el momento en el tiempo, y el portafolio particular de cada cual, el cual nos da mayor o menor margen de juego y tolerancia a los periodos de incertidumbre.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "June 10, 2022, 06:18:54 AM",
      "body": "En última instancia que sea de riesgo o seguro depende de varias cosas.Yo creo que es bastante seguro porque con la adopción que hay a día de hoy, ya no hay vuelta atrás, el bitcoin ha venido para quedarse. Hace 10 años uno podía pensar si el bitcoin sobreviviría o moriría en el intento. Otro motivo por el que lo veo bastante seguro es por el límite a su producción, por su naturaleza deflacionaria, pues el resto de monedas fiat son inflacionarias y diría que todos o casi todos los activos financieros también (puedes minar más oro, hacer ampliaciones de capital de una empresa, etc). Pero aquí la seguridad es solo a largo plazo, a mínimo un ciclo (4 años) vista.Lo de riesgo tiene bastante que ver con la volatilidad, y aquí entra bastante el conocimiento que se tenga. No es lo mismo meter todo tu patrimonio en bitcoin porque has visto al Youtuber de turno y te has creido que llegará a los 200.000 dólares en un año (para comerte una bajada del 50% en pocos meses) que hacer pequeñas compras regulares dentro de una cartera de inversión diversificada.De la misma manera podríamos hacer una analogía con la bolsa, pues hay quien la percibe como de riesgo y hay quien la percibe como segura. Siguiendo con la analogía no es lo mismo quien pone todo su patrimonio en una empresa que empieza pensándose que va a pegar el pelotazo que quien va haciendo aportaciones regulares a un fondo indexado.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}