{
  "id": "topic_5461458",
  "title": "FirmWars",
  "author": "FirmWars",
  "created_time": "July 30, 2023, 08:39:28 AM",
  "content": "With the way things are going, Bitcoin will become more valuable in the future.Few bear markets have happened in past and many have learnt their mistakes Some don't play with their dollar cost averaging..Emotions aren't present only with crypto, it's general something in our lives. Volatility can't be erased in Bitcoin.But one thing is very certain in this life, we all can't make it, if it's this easy everyone in the world will become a millionaire or billionaire.If your dream comes true, it doesn't make others useless or lazy, we just all can't get lucky, some will fail and some will win.Before you say that I am talking trash, Bitcoin investment is like taking from some and feeding others, what this mean is someone is buying from you when you are dumping, it's like the world shape, it goes around.So instead of showing off how successful you have become always remember that you don't get there alone, it happened through the help of others that bought from you. So try as much as possible to help those that are in need in your surroundings, or help others that are living far away from you, you can do this anonymously too if you think it's not safe, this is the right way to bring back into the community.Remember, some things are unexplainable in this world and there are things that are beyond human understanding. Happy Sunday",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461458",
  "comments": [
    {
      "author": "Nwada001",
      "created_time": "July 30, 2023, 08:58:33 AM",
      "body": "Quote from: FirmWars on July 30, 2023, 08:39:28 AMBefore you say that I am talking trash, Bitcoin investment is like taking from some and feeding others, what this mean is someone is buying from you when you are dumping, it's like the world shape, it goes around.describing bitcoin this way makes it appears like ponzi scheme, as the investment of new commers are what is being used to pay the already existing customers on the platform, at the end of the day if they don't get new sign-up and people ready to fall victim of their scheme, you realize that the platform willl short down, where there are always people who pay for the rich of others, others get rich using the downfall of the next person, At the end of the day their is always a a winner and a losser.But when it comes to bitcoin, We will always have those who are willing to buy and those who are willing to sell, and the value is determined by what the masses are willing to pay for it and based on its demand in the market.Selling at any particular time is a choice; the same is also applicable to buying. If you decide to sell when the price is dumping and you happen to record some losses, that's on you, and the mistake that you made yourself shouldn't be shifted to others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lorence.xD",
      "created_time": "July 30, 2023, 09:09:41 AM",
      "body": "Quote from: FirmWars on July 30, 2023, 08:39:28 AMSo instead of showing off how successful you have become always remember that you don't get there alone, it happened through the help of others that bought from you. Well there's nothing wrong for you being proud for your efforts in becoming successful, but always remind that you need to limit sharing your achievements online since it might be threat that could risk your safety. For sure we're not only one who's being part of the market that anyone could take advantage some would lose and some would win. But as a person who took effort to study Bitcoin for years and invested almost all of their savings, it's okay to be proud for yourself but no need to brag just stay humble there's more blessings to come as long as were consistent.QuoteSo try as much as possible to help those that are in need in your surroundings, or help others that are living far away from you, you can do this anonymously too if you think it's not safe, this is the right way to bring back into the community.Yes, in research in helping others would have a great impact not only to the person that you've helped but also to yourself as human being. The great feeling that the fact you helped someone that could also change their life. I don't know why I hate some people online where they posting that they helped someone just to gain likes, if their motive is to give inspiration to others then it's valid for me. As long as you know to yourself that you're doing the good thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "July 30, 2023, 09:18:59 AM",
      "body": "Quote from: FirmWars on July 30, 2023, 08:39:28 AMSo instead of showing off how successful you have become always remember that you don't get there alone, it happened through the help of others that bought from you. So try as much as possible to help those that are in need in your surroundings, or help others that are living far away from you, you can do this anonymously too if you think it's not safe, this is the right way to bring back into the community.Utopia post. OP, if I have a lot of money (for example), do you think I should give it to the poor? How many? Poverty is incurable. Sometimes people themselves are to blame for their poverty, and it is difficult to help everyone. In the same way, how to talk about help and how to provide help are very different things.I know that people need to be helped, but I always resent such oratory speeches. Helping loved ones is a matter of course, which is not even worth teaching.It is wrong to talk about people who bought Bitcoin or something from me as helpers, benefactors, and so on. Two parties were interested in the purchase, that is, an equal sign. No one put a gun to anyone's head.Therefore, the creation of such beautiful posts in such an upbringing manner also looks very cloying, as if you know something that is not obvious to others.No offense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "July 30, 2023, 09:29:30 AM",
      "body": "So, what you're trying to say is we should give our money to other people? you can start by yourself, just give all of your money to the people who need it. I bet you wouldn't and you're still accumulating Bitcoin in order to get rich or financial freedom.Giving a fish to a man only make him able to eat for a day, but teaching him how to catch a fish will surely make him able to survive without your help anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PIMPdev",
      "created_time": "July 30, 2023, 09:35:28 AM",
      "body": "Quote from: Despairo on July 30, 2023, 09:29:30 AMSo, what you're trying to say is we should give our money to other people? you can start by yourself, just give all of your money to the people who need it. I bet you wouldn't and you're still accumulating Bitcoin in order to get rich or financial freedom.Giving a fish to a man only make him able to eat for a day, but teaching him how to catch a fish will surely make him able to survive without your help anymore.Agree. I mean, perhaps I'd donate to some charity, I've done it already, but I couldn't give too much. But I'm not gonna just give money to the people even if I become a millionaire. No one gave me that (besides my parents, of course), and that's the easiest way to stop being a millionaire.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "July 30, 2023, 09:45:26 AM",
      "body": "So far, Bitcoin hasn't been around long enough to assess the bear market frequency and volatility. After reaching a high point at the very end of 2013, the bear market lasted till the beginning of 2017, and the price significantly improved during the last quarter of 2017. Then there was a bear market till the last quarter of 2020, followed by a great 2021. Since then, we've been in another bear market for a year and a half, and it may well last for another year and a half. So it doesn't seem to me that the bear markets are getting less frequent, or that Bitcoin is getting more stable, to be honest.Putting that aside, I think that the op is right that it's good to help others when possible, bring something back to the community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mvdheuvel1983",
      "created_time": "July 30, 2023, 10:03:38 AM",
      "body": "Quote from: FirmWars on July 30, 2023, 08:39:28 AMBefore you say that I am talking trash, Bitcoin investment is like taking from some and feeding others, what this mean is someone is buying from you when you are dumping, it's like the world shape, it goes around.You are not talking trash. Nevertheless, there is a need to remind you that there are 21million Bitcoins that was created. Currently, humans who mine Bitcoins have mined 19 million Bitcoins and there is left only 2 million BTC. Technically, when we buy Bitcoin it doesn't necessarily mean that we are buying from people who are \"dumping it\". Because even as I write this at least 800 bitcoins would be mined today. Read it here - https://www.blockchain-council.org/cryptocurrency/how-many-bitcoins-are-left/QuoteSo instead of showing off how successful you have become always remember that you don't get there alone, it happened through the help of others that bought from you. Not entirely correctQuoteSo try as much as possible to help those that are in need in your surroundings, or help others that are living far away from you, you can do this anonymously too if you think it's not safe, this is the right way to bring back into the community.It is not compulsory. I think this is a moral obligation to always give back. Whether it is Bitcoin, stocks or any other investments. It is a moral human obligation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "July 30, 2023, 10:06:38 AM",
      "body": "If that is how the market works then that is how we need to accept it. If everyone started to buy then that is what converts into the Demand and thus makes that particular thing valuable. If no one bought or no one sold then how do you think the market value will appreciate Or depreciate over the course of time? This is what gives the real meaning to the money market or basically, anything that is associated with the price tag!If I am publishing my success saga about Bitcoin then that should be motivating to others and not demotivating as per the tone of your post. I think it's completely fine to publish the articles that depicts the success path, the struggles, the entire start to end story so as to understand how Bitcoin could be changing over the course.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ICYNOTE2023",
      "created_time": "July 30, 2023, 10:41:52 AM",
      "body": "Quote from: FirmWars on July 30, 2023, 08:39:28 AMWith the way things are going, Bitcoin will become more valuable in the future.Few bear markets have happened in past and many have learnt their mistakes Some don't play with their dollar cost averaging..Emotions aren't present only with crypto, it's general something in our lives. Volatility can't be erased in Bitcoin.But one thing is very certain in this life, we all can't make it, if it's this easy everyone in the world will become a millionaire or billionaire.If your dream comes true, it doesn't make others useless or lazy, we just all can't get lucky, some will fail and some will win.Before you say that I am talking trash, Bitcoin investment is like taking from some and feeding others, what this mean is someone is buying from you when you are dumping, it's like the world shape, it goes around.So instead of showing off how successful you have become always remember that you don't get there alone, it happened through the help of others that bought from you. So try as much as possible to help those that are in need in your surroundings, or help others that are living far away from you, you can do this anonymously too if you think it's not safe, this is the right way to bring back into the community.Remember, some things are unexplainable in this world and there are things that are beyond human understanding. Happy Sunday Your reflection on the nature of Bitcoin investment and the importance of empathy and giving back to the community is thoughtful and commendable. Indeed, the world of cryptocurrency investment, including Bitcoin, is characterized by volatility, risk, and the potential for both gains and losses. It's essential for investors to approach it with caution, understanding that not everyone will achieve the same level of success.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "July 30, 2023, 10:49:36 AM",
      "body": "Quote from: Nwada001 on July 30, 2023, 08:58:33 AMQuote from: FirmWars on July 30, 2023, 08:39:28 AMBefore you say that I am talking trash, Bitcoin investment is like taking from some and feeding others, what this mean is someone is buying from you when you are dumping, it's like the world shape, it goes around.describing bitcoin this way makes it appears like ponzi scheme, as the investment of new commers are what is being used to pay the already existing customers on the platform, at the end of the day if they don't get new sign-up and people ready to fall victim of their scheme, you realize that the platform willl short down, where there are always people who pay for the rich of others, others get rich using the downfall of the next person, At the end of the day their is always a a winner and a losser.But when it comes to bitcoin, We will always have those who are willing to buy and those who are willing to sell, and the value is determined by what the masses are willing to pay for it and based on its demand in the market.Selling at any particular time is a choice; the same is also applicable to buying. If you decide to sell when the price is dumping and you happen to record some losses, that's on you, and the mistake that you made yourself shouldn't be shifted to others.Bitcoin is not a ponzi scheme but it can also be said that the bitcoin market is like a battleground. That means everyone will compete for the victory on their side, there will never be a win-win situation as many people think. Many people have the misconception that just investing in bitcoin and holding it for a long time will make you rich without losers. So who will buy bitcoin at a high price so we can take profits if there are no losers? After all, bitcoin is also a tool for us to make profit, winning or losing depends on the level of each person.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tw0.625",
      "created_time": "July 30, 2023, 10:55:41 AM",
      "body": "Quote from: FirmWars on July 30, 2023, 08:39:28 AMWith the way things are going, Bitcoin will become more valuable in the future.Few bear markets have happened in past and many have learnt their mistakes Some don't play with their dollar cost averaging..Emotions aren't present only with crypto, it's general something in our lives. Volatility can't be erased in Bitcoin.But one thing is very certain in this life, we all can't make it, if it's this easy everyone in the world will become a millionaire or billionaire.DCA is a good strategy. But what is your DCA goal in Bitcoin? 1, 2.625, 5, 10, 100, 666, 1000 Bitcoin?... That is question.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "komisariatku",
      "created_time": "July 30, 2023, 12:01:14 PM",
      "body": "Bitcoin is not a ponzi scheme, So profit or loss is in our hands and we have the choice to buy or sell bitcoins. Maybe some people are unlucky because they buy bitcoin when the price is expensive and sell it when the price is cheap, but that's their own fault, if he is strong enough to hold bitcoin maybe the price of bitcoin will rise again, as we know the price of bitcoin always reaches a new ATHSo investing in bitcoin must understand the market and know when to buy and when to sell. It's complicated, and you need some knowledge in bitcoin trading. This is totally different from what you describe. If you don't want complicated analysis, then buy and hold bitcoins for a long time, then you will most likely be profitable",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "July 30, 2023, 12:01:22 PM",
      "body": "Quote from: FirmWars on July 30, 2023, 08:39:28 AMIf your dream comes true, it doesn't make others useless or lazy, we just all can't get lucky, some will fail and some will win.Lucky? People who had any success or wealth out of luck are extremely rare if they exist at all and they definitely won't keep such success or wealth.Any solid success or wealth is acquired through hard work and experience.QuoteBefore you say that I am talking trash, Bitcoin investment is like taking from some and feeding others, what this mean is someone is buying from you when you are dumping, it's like the world shape, it goes around.You are assuming that people \"buy\" and \"dump\" bitcoin, which is a wrong assumption. Many people \"earn\" and \"spend\" bitcoin like any other currency.QuoteSo try as much as possible to help those that are in need in your surroundings, or help others that are living far away from you, you can do this anonymously too if you think it's not safe, this is the right way to bring back into the community.Your preface makes no sense but I agree with this. You should always try to help others however you can. It is not always financial aid either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johann Sebastian Block",
      "created_time": "July 30, 2023, 12:08:04 PM",
      "body": "Quote from: FirmWars on July 30, 2023, 08:39:28 AM...So instead of showing off how successful you have become always remember that you don't get there alone, it happened through the help of others that bought from you. So try as much as possible to help those that are in need in your surroundings, or help others that are living far away from you, you can do this anonymously too if you think it's not safe, this is the right way to bring back into the community.Remember, some things are unexplainable in this world and there are things that are beyond human understanding. Happy Sunday The community needs more of this, thank you! In addition, for those not so quick to help others, there is money to be made by helping others, i.e. \"It is one of the beautiful compensations of this life that no one can sincerely try to help another without helping himself.\" ~Charles D. Warnerand>> \"It is literally true that you can succeed best and quickest by helping others to succeed\" ~Napoleon Hill <<< Happy Sunday (and every day) to you also.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "July 30, 2023, 12:58:38 PM",
      "body": "It depends to what do you wanna do to your money. I am sure that each of us have some charities to help in any way and form that we want to or we have our obligations and help that we're passing to the loved ones that we've got.IMHO, we don't need to remind people that they should help whenever they've made a profit. We're grateful and passing all the good deeds that we receive in other forms that we're capable of. So, this is like minding our business and we've also took the risk and whatever reward we get from investing in Bitcoin, we deserve it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "July 30, 2023, 02:04:17 PM",
      "body": "Bitcoin is far from what you are describing, and that's why I believe you are talking about Ponzi scheme, if this is how you view Bitcoin you are wrong.Someone needs to show how the world works to OP, there was a man in my street, I met him years ago in that street and few guys there are telling me how rich he was, I asked what happened and they said he helped so many people that he ended up broke, and the cruel part is none of those he helped try to help him back.He got a bad sickness and he eventually lost his life, see OP, you can't keep helping people, you will end up broke and they won't help you in return, apart from money, haven't you learn that you can't satisfy people? You did this they tell you is wrong and some will say it's right, you did other thing people will curse you and some will pray for you. If I have to help I will pick few numbers of people, probably friends or in the family and that's it. The world is more cure that you think, even you helping others can put you in greater risk than when you don't do anything for anyone, it's better to stay hidden when you have money, than to come out and start helping people, more trouble will come visiting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Latviand",
      "created_time": "July 30, 2023, 02:13:38 PM",
      "body": "If I'm being honest OP, I don't think that there's a lot of forum users that have giving back to the community first thing on their mind, I'm pretty sure that they would probably let their inhibitions loose and splurge on themselves first, do you know how many times they've sacrificed their desire just so they can buy more bitcoin? I'm sure that they will satisfy themselves first and we're living in an indifferent and selfish generation so I don't think we would see that much charity happening that involves people that becomes successful in bitcoin. I mean look at the other posts, they try to justify not being a charitable person when they become successful says a lot about why you're wish that people will help when you become successful will not come true, those that say so otherwise are liars.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "July 30, 2023, 02:42:19 PM",
      "body": "Quote from: FirmWars on July 30, 2023, 08:39:28 AMBut one thing is very certain in this life, we all can't make it, if it's this easy everyone in the world will become a millionaire or billionaire.Every one cannot become rich from cryptocurrency.Quote from: FirmWars on July 30, 2023, 08:39:28 AMSo instead of showing off how successful you have become always remember that you don't get there alone, it happened through the help of others that bought from you. You did not get there alone, but you made the decision to stay committed that the help rendered to you becomes visibly profitable.Quote from: FirmWars on July 30, 2023, 08:39:28 AMSo try as much as possible to help those that are in need in your surroundings, or help others that are living far away from you, you can do this anonymously too if you think it's not safe, this is the right way to bring back into the community.Do not try to do too much to help people when you are not yet in a position to, everyone will be okay without you. If you try to help someone when you are not yet in a comfortable position to do so, you risk your own self.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ever-young",
      "created_time": "July 30, 2023, 02:50:53 PM",
      "body": "Quote from: FirmWars on July 30, 2023, 08:39:28 AMIf your dream comes true, it doesn't make others useless or lazy, we just all can't get lucky, some will fail and some will win.  This is true, but their will definitely be something to show off for those who are actually working hard to make it to the top, everyone will not get their at ones but their will be something to show that one is trying and not just folding hand's Quote So instead of showing off how successful you have become always remember that you don't get there alone, it happened through the help of others that bought from you.  That's not entirely true, as one we all help one another to climb up, but our success depends on how much sacrifice we are willing to pay in terms of chasing our dream. Quote So try as much as possible to help those that are in need in your surroundings, or help others that are living far away from you, you can do this anonymously too if you think it's not safe, this is the right way to bring back into the community.Helping is a choice and not compulsory as helping those who have two hands and leg too much is a way of encouraging laziness, as they might no fine it interesting to work out something for them self again. Remember that a dashed out money seems like a waste on the economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}