{
  "id": "topic_5465377",
  "title": "Best-mary",
  "author": "Best-mary",
  "created_time": "September 02, 2023, 09:29:58 AM",
  "content": "So, I don't want to waste anyone's time complaining about the indecisive movement in the market because we all see it.In a nutshell, Bitcoin ETF news isn't just about Bitcoin. It also has an impact on other crypto coins. Two days ago when was checking my chart I noticed the massive shake-up of the entire crypto scene because of the SEC announcement of postponing seven proposed traded funds. Now, I just want to know how y'all do it this period. I know Diversification is a smart strategy, but it won't completely shield anyone from the waves created by big Bitcoin news. While some trade it anyway because why not? So, what else do y'all do? do you trade it or just keep watching the market movement?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465377",
  "comments": [
    {
      "author": "_act_",
      "created_time": "September 02, 2023, 09:33:58 AM",
      "body": "Do you not know that without bitcoin, altcoins are dead. Check bitcoin price and most altcoins price, you will see how altcoin prices can increase when bitcoin price is increasing, and decrease when bitcoin price is decreasing. But this does not change the fact that some altcoins may become dead coin and some may not reach ATH.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "September 02, 2023, 09:40:30 AM",
      "body": "Quote from: _act_ on September 02, 2023, 09:33:58 AMDo you not know that without bitcoin, altcoins are dead.Thousands of altcoins already dead even Bitcoin is still there, alive.QuoteCheck bitcoin price and most altcoins price, you will see how altcoin prices can increase when bitcoin price is increasing, and decrease when bitcoin price is decreasing. But this does not change the fact that some altcoins may become dead coin and some may not reach ATH. Sometimes, Bitcoin rises, altcoin falls that is painful for newbies who believe altcoins will help them rich.One more painful experience is whenever Bitcoin falls, altcoins fall dramatically deeper than Bitcoin. If Bitcoin falls 3%, altcoins mostly fall 10% or 15%. I have one topic about it too.Bitcoin pumps/ dumps and altcoin price actions (2013 - 2020)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "September 02, 2023, 09:55:55 AM",
      "body": "Quote from: Best-mary on September 02, 2023, 09:29:58 AMI know Diversification is a smart strategy, but it won't completely shield anyone from the waves created by big Bitcoin news.That's why diversification should be between assets that are not intrinsically linked to one another, diversification into BTC and altcoins is not so recommended because it defeats the reason for diversification. After buying BTC, buy other unrelated assets, like gold, real estate, etc.Quote from: Best-mary on September 02, 2023, 09:29:58 AMSo, what else do y'all do? do you trade it or just keep watching the market movement?So much news lately about BTC etf's, there was a slight upward movement in the prices of crypto after the news of Grayscale's victory against the sec as to whether they can convert their grayscale BTC trust into a BTC spot etf, but the sec still holds the final decision on the approval of any spot etf in the U.S., and they have delayed that decision, making prices to fall back down. Nothing changes for BTC in itself, as regards speculation you may want to continue buying BTC because a spot etf approval in the U.S. may happen very soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "September 02, 2023, 10:07:25 AM",
      "body": "Quote from: Best-mary on September 02, 2023, 09:29:58 AMSo, I don't want to waste anyone's time complaining about the indecisive movement in the market because we all see it.In a nutshell, Bitcoin ETF news isn't just about Bitcoin. It also has an impact on other crypto coins. Two days ago when was checking my chart I noticed the massive shake-up of the entire crypto scene because of the SEC announcement of postponing seven proposed traded funds. Now, I just want to know how y'all do it this period. I know Diversification is a smart strategy, but it won't completely shield anyone from the waves created by big Bitcoin news. While some trade it anyway because why not? So, what else do y'all do? do you trade it or just keep watching the market movement?I am not a trader, so I don't care much about crypto news because most of them only spread FUD. Every long-term investor is more concerned about his investment strategies, hence it will be better not to make decisions based on the actions of the SEC and others. I didn't clearly understand your idea on diversification but I would prefer to diversify my investment to areas outside the crypto industry. This is because altcoins are not trustworthy like Bitcoin. Some persons are fortunate to have gained from investing in altcoins but many people have lost fortunes. I don't trade so I keep my head straight avoiding the noise of the SEC and unfriendly government because I have confidence that Bitcoin will overcome all these setbacks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "September 02, 2023, 10:40:53 AM",
      "body": "Quote from: Best-mary on September 02, 2023, 09:29:58 AMSo, what else do y'all do? do you trade it or just keep watching the market movement?Everyone knows that seeing the big adoption going to happen with the Halving time getting closer so they will do more active Bitcoin accumulation. Because it's important to remember that the Bitcoin ETF and the 7 major institutions poured funds of approximately $12 million - $15 million, if only 10% of it went into Bitcoin, then it would be easy for us to guess the direction in a big spike in a short time. So what I am doing today no matter what the price of Bitcoin is because the scenario will still exceed expectations.Regarding altcoins, I personally don't really pay much attention to it because all altcoins are trash, don't you think?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "September 02, 2023, 10:55:24 AM",
      "body": "Quote from: _act_ on September 02, 2023, 09:33:58 AMDo you not know that without bitcoin, altcoins are dead. Check bitcoin price and most altcoins price, you will see how altcoin prices can increase when bitcoin price is increasing, and decrease when bitcoin price is decreasing. But this does not change the fact that some altcoins may become dead coin and some may not reach ATH. I can give you examples when the price of altcoins falls or does not change, but the price of bitcoin rises. Then altcoins from the top 50 are bought for expensive bitcoin and a pump occurs, then the overflow goes to other altcoins and the crappiest projects grow, and then the hamsters remain long-term hodlers of useless altcoins. This is exactly how manipulators work. \"The show must go on\" (C).___my opinion about ETFhttps://bitcointalk.org/index.php?topic=5464432.msg62778682#msg62778682",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 02, 2023, 11:08:06 AMLast edit: September 02, 2023, 12:21:36 PM by franky1",
      "body": "here's a basic economics lessonif you check the price charts of many coins and see that (too)many altcoins shadow trace the wiggles of a bitcoin market but at a different ratio. it means that altcoin has no independent community/sentiment of its own price discoveryi do find it funny there are ALOT of altcoins that look like-for-like the same wiggles of bitcoins market.. which just goes to prove they dont have their own market sentiment/community of price discoveryyes they are priced at a different ratio but thats because they have a different base value underlying the market bottom to prop up the priceusually if you can also work out the most efficient mining/minting cost of each altcoin(the underlying value) and if the market price of that altcoin is at a premium to its value rather than being near value, whilst also shadow tracing bitcoin. that again is even worse case for that altcoins sustainability because its being artificially held up to a speculative high premium compared to its value purely due to bitcoin arbitragefor instance. check out ethereums chart wiggles compared to bitcoin (99% similar wiggles)yet when ethereum changed from PoW to PoS its base mining/minting cost dropped by 20x, yet its market speculations price did not drop by 20x. thus is at a premium of speculatively 95% pure speculation and 5% value but still shadow tracing bitcoins wiggles, due to lack of its own community sentiment to change its own market. which is not good for ethereum.it is not strange, but is worrying how many altcoins just shadow trace bitcoins market wiggles. and should be concerning to people that want to think that they are diversifying in a altcoin, yet that altcoin has no independent price discovery sentiment. because then its not really diversifying.. its just changing a denomination of the same market[sentiment], until that smaller denomination is removed from the sector",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptoababe",
      "created_time": "September 02, 2023, 12:24:28 PM",
      "body": "Quote from: dzungmobile on September 02, 2023, 09:40:30 AMSometimes, Bitcoin rises, altcoin falls that is painful for newbies who believe altcoins will help them rich.One more painful experience is whenever Bitcoin falls, altcoins fall dramatically deeper than Bitcoin. If Bitcoin falls 3%, altcoins mostly fall 10% or 15%. I have one topic about it too.Bitcoin pumps/ dumps and altcoin price actions (2013 - 2020)Most newbies believe Altcoins will Make them rich truly. But not only them. And this is because bitcoin marketcap and price looks too big for them while they know that bitcoin is for long term. So not only newbies are investing in some coins to make them get quick money. I think",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "September 02, 2023, 12:42:32 PM",
      "body": "Altcoins have mostly moved with bitcoin in the past until today; and I don't see that changing any time soon.In the first place — if you want to diversify, you don't buy other altcoins; you buy other assets in different sectors like stocks, real estate, treasury bills, etc. Buying other cryptocurrencies to hedge your bitcoin bet is simply and provably a dumb move.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "September 02, 2023, 04:12:24 PM",
      "body": "Quote from: Best-mary on September 02, 2023, 09:29:58 AMSo, I don't want to waste anyone's time complaining about the indecisive movement in the market because we all see it.In a nutshell, Bitcoin ETF news isn't just about Bitcoin. It also has an impact on other crypto coins. Two days ago when was checking my chart I noticed the massive shake-up of the entire crypto scene because of the SEC announcement of postponing seven proposed traded funds. Now, I just want to know how y'all do it this period. I know Diversification is a smart strategy, but it won't completely shield anyone from the waves created by big Bitcoin news. While some trade it anyway because why not? So, what else do y'all do? do you trade it or just keep watching the market movement?The thing is that, the entire cryptocurrency market is a chain and Bitcoin is the sole propeller of this market and at such alot of mechanism and percentage of the market conditions rely much on Bitcoin and whatever happens to Bitcoin ve it in form of regulation Sec decisions or ETF delays it make general impact on the entire cryptocurrencies market.The only advantage is choosing Bitcoin as your investment/asset places you on a path that gives you peace and confidence to hold for the long term, and no matter what the market conditions are then it causes less panic for Bitcoin holder since they know that the price will eventually rebound back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptoababe",
      "created_time": "September 03, 2023, 08:50:17 PM",
      "body": "Quote from: Iamcrypticguy on September 02, 2023, 12:51:55 PMSomething like this. https://www.bitget.com/support/articles/12560603797099I think with this, one can diversify thier trades while earning because If Bitcoin experiences any drop or increase in price, other assets may perform differently and the best thing is to take advantage of that by making short-term trades while keeping a close eye any news.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}