{
  "id": "topic_5441036",
  "title": "odolvlobo",
  "author": "odolvlobo",
  "created_time": "February 23, 2023, 11:53:54 PM",
  "content": "A couple of years ago, yield farming was the next big thing, but I no longer see it mentioned anywhere. What happened to it? Did the players lose all of their money and slink back into the darkness?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441036",
  "comments": [
    {
      "author": "GreatArkansas",
      "created_time": "February 24, 2023, 01:36:20 AM",
      "body": "I believe this is still a thing, yield farming also is one of the trend platforms on every chain network especially now that there are a lot of new networks, layer 2 or layer 1.With the trend of NFT, I believe some volume from yield farming also transitioned to the NFT market.Consider also the current market condition which is I believe most of the TVL of every DeFi platform decreased due to the bear market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "February 24, 2023, 02:15:20 AM",
      "body": "Quote from: odolvlobo on February 23, 2023, 11:53:54 PMA couple of years ago, yield farming was the next big thing, but I no longer see it mentioned anywhere. What happened to it? Did the players lose all of their money and slink back into the darkness?I think it is a mutation of Staking, Masternode to DeFi 2.0 and maybe we will see Yield farming returns in cryptocurrency with DeFi 3.0.A big challenge to prevent its return is regulatory attacks of governments against stable coins, staking like there are some news recent weeks. Personally I don't believe in Yield farming because to have good Yield farming model, they must have healthy capital flow from input to output. Like what we saw with DeFi 2.0, it is broken and output will be bigger than input after a few months of operations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "February 24, 2023, 03:04:37 AM",
      "body": "Quote from: odolvlobo on February 23, 2023, 11:53:54 PMA couple of years ago, yield farming was the next big thing, but I no longer see it mentioned anywhere. What happened to it? Did the players lose all of their money and slink back into the darkness?I guess the fact that we are in the bear market last year affected the popularity not just Yield Farming, but also staking because both of them are kind of similar, but wasn't being talked too much or mentioned or the internet.Anyway, I think it's still a thing, but not as big as it was a few years ago where investors are putting all of their money in these DeFi platforms despite the risk of them losing their money, and just literally wait for their profit. Maybe in the next bull run, it might become popular again, but who knows.I, personally didn't try to do Yield Farming (because of the risk of it, and don't have funds for it) though I taught of investing on top DeFi platforms at the time where it was at his peak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "February 24, 2023, 03:46:01 AM",
      "body": "Yes many people are lose their money on yield farming because they're got tricked with the huge return in their token equivalent. Many DEFI projects are offering insane return in short time, like 1,000x - 10,000x per year and many people think if they invest for $1, they will get $1,000 - $10,000 after a year. But it doesn't like that because the developer mint the new token out of thin air, since only the supply keep increase, it make the token price keep decrease.There's also a whitepaper from FSB where they want to control and mitigate the risk of DEFI projects The FSB brings more regulations worldwide for this summer: More MICA",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BinhTrader",
      "created_time": "February 24, 2023, 06:54:27 AM",
      "body": "1/ Yield farming is not for people with little money. If you have little money, don't play.2/ Yield farming is not for the uninitiated. If you're low tech, don't play.3/ Yield farming is another ponzi. Play must understand. If you don't understand, don't play.4/ Yield farming in 100 has 98 scams and 2 good . Players must be studied carefully. If you don't have time to study it thoroughly, don't play.5/ The right strategy I think will be: NOT going to farm, NOT buying and holding, but BUY & FLIP & carefully manage capital & always prioritize cash first and then calculate what to calculate. .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "February 24, 2023, 02:12:36 PM",
      "body": "Quote from: odolvlobo on February 23, 2023, 11:53:54 PM...What happened to it? Did the players lose all of their money and slink back into the darkness?They earned tokens like the way it should be but the fiat value of those tokens sunk. You can also add the fact that rates were reduced so it wasn't that attractive anymore.The hacks and exploits on different staking platforms from various networks also didn't help. I know there's a thread by created and updated zasad on that if you want to check them out.You could say that players probably thinks the risks outweighs the benefits.  Quote from: hd49728 on February 24, 2023, 02:15:20 AM....A big challenge to prevent its return is regulatory attacks of governments against stable coins, staking like there are some news recent weeks.No doubt. I expect this to happen more often in the next couple of years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "February 24, 2023, 02:37:24 PM",
      "body": "Quote from: odolvlobo on February 23, 2023, 11:53:54 PMA couple of years ago, yield farming was the next big thing, but I no longer see it mentioned anywhere. What happened to it? Did the players lose all of their money and slink back into the darkness?Nothing differents on providing liquidity for any pool in farm. Yield farming is best on pairing with a good match or both not moving drastically. Cause they got a huge apr and insane fees on usage, but its quite hard to know which pairing has a very stable movement. Defi really good maybe timing is needed for it like now very low market movement. Some yield are definitely worth risking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "February 24, 2023, 07:26:31 PM",
      "body": "Quote from: odolvlobo on February 23, 2023, 11:53:54 PMA couple of years ago, yield farming was the next big thing, but I no longer see it mentioned anywhere. What happened to it? Did the players lose all of their money and slink back into the darkness?I am still farming in several different places, but i guess the reason you don't hear the term often anymore as it used to be EVERYTHERE, as every site wanted to hop in on that.Now it isn't attracting people in as a hype term. People change their advertisement tactic between trends, from Farming to, NFT to L2ZK etc. It's same with NFTs, hype died a little, but the product stayed. People soon won't be adding NFTs as a main attraction for their marketing even if they offer NFT services.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "February 24, 2023, 08:34:45 PM",
      "body": "When most of the hacks have came to these yield farming platforms, I guess investors have the idea on what they should avoid. But then, the staking has came although it's been really there even before these yield farming projects and platforms have came.It's just more became significant since after the merge for Ethereum have happened. Quote from: alexforneus on February 24, 2023, 07:35:54 AMIt's not intresting to farm stables because of very low yeild. Others pairs are too risky, looks like people understand that Those that have tremendous and crazy yield percentages, they're the riskiest and the newbies might thought that they're the most profitable places where they can yield their assets. As for these stable coins to get yield, they're realistic percentages and gains.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "February 24, 2023, 09:13:04 PM",
      "body": "I had achieved great earnings approximately two years ago, if I'm not mistaken. I can't recall if it was 2021 or 2020. Anyway, it used to be extremely profitable; it still is, but not as much. I used to chase higher APYs and so on, but I haven't bothered for quite a while. After the Iron incident on Polygon and with Terra USD going to zero, I practically stopped messing with it and stuck with Bitcoin. I occasionally stake stablecoins, such as BUSD and USDT, but apart from that, I'm not sure that I'll proceed to anything of greater importance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "February 26, 2023, 08:58:46 AM",
      "body": "Quote from: odolvlobo on February 23, 2023, 11:53:54 PMA couple of years ago, yield farming was the next big thing, but I no longer see it mentioned anywhere. What happened to it? Did the players lose all of their money and slink back into the darkness?Of course yield farming is still a thing and i also think that is still one of the biggest and most used features in the world of Defi. The reason why it is not talked so much about anymore in my opinion is simply the fact, that it is already an established thing now in the world of crypto and nothing new anymore. Given the fact, that crypto is still a lot based around of hype, which is a bad thing by the way in my opinion, it is just normal that yield farming is not being talked about so much anymore.Just recently though a lot of yield farms launched on the arbitrum chain and the first few ones give early investors a really good profit. Now of course all the copycat projects are coming that are just in for a quick buck as it always is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "February 26, 2023, 09:23:25 AM",
      "body": "Yes, but not really. There are some which allows you to do yield farming, it is still something that is true in pancakeswap for example, and probably dozens of others that copied it, but at the end of the day it is not really as profitable as it used to be, it is a bit different and I would suggest staying away from it if I can.Yield farming was just a hype in the crypto world because it was new and exciting at the time, a new way to make money and not just by investing but also a source of income at the same time. Passive income is the number one thing people love in investment and yield farming provided that. However since the bear market, they are not loved all that much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "X-ray",
      "created_time": "February 26, 2023, 02:38:23 PM",
      "body": "The era for yield farming token already ended since a bunch of scammers were massively launching their own yield farming token with non-sense APY. The only legit tokens that still survive. It's not a thing now. Many people are aware if using legit yield farming platform like uniswap, pancake or something else that have a good reputation is enough rather than trying to pour more money into the scammers who were offering \"turn your 1 USD to the more than 1 millions USD in a year with millions % of APY\"There have been many blockchains being launched but i rarely saw new legit yield farming platforms that were coming along with those blockchains.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "February 28, 2023, 05:00:21 AM",
      "body": "In the last year many got burnt with yield farming and staking. Originally many of these yields were crazy high and just not sustainable. What good is a 1000% apr if your token loses 99% of its value after a few months.Then we had all those lending platforms go bust. Many people weren’t even investing in Bitcoin or Ethereum they just sent their money over because it paid more interest than a savings account. Even Gemini got caught in the crossfire because Genesis defaulted on Those loans.Many got burnt and many are staying out of it now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitgolden",
      "created_time": "March 01, 2023, 02:44:51 PM",
      "body": "Quote from: adaseb on February 28, 2023, 05:00:21 AMIn the last year many got burnt with yield farming and staking. Originally many of these yields were crazy high and just not sustainable. What good is a 1000% apr if your token loses 99% of its value after a few months.Then we had all those lending platforms go bust. Many people weren’t even investing in Bitcoin or Ethereum they just sent their money over because it paid more interest than a savings account. Even Gemini got caught in the crossfire because Genesis defaulted on Those loans.Many got burnt and many are staying out of it now.The biggest issue was that when something is profitable, then everyone wants to get involved, and when everyone does, the return drops. If 100 dollars are given out to 100 people who put up 1 dollars, then they all get another dollar back, if 1000 people joins then they are not going to get 1 dollars that will be 0.1 dollars instead, we had millions of people going into it.So all in all, it became less and less profitable anytime people got in. I have literally seen stablecoin farmers who got less returns than banks, dude put your money in the bank if you are fine with that, you would be making more profit, but yet they invested anyway and ruined everything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}