{
  "id": "topic_5464022",
  "title": "Chareal",
  "author": "Chareal",
  "created_time": "August 21, 2023, 09:19:16 AMLast edit: September 29, 2023, 07:04:24 AM by Chareal",
  "content": "Tomiwagmi Next Generation of memes.Join a meme journey, with Tomiwagmi. While the reign of dogs has had its days witness as Tomiwagmi rises to seize its deserved position of greatness.ABOUT TOMIWAGMI PROJECT In the evolving world of cryptocurrency, where innovation meets entertainment, a game changer has emerged; TOMIWAGMI. But don’t let its lightheartedness deceive you,Tomiwagmi is not just another meme coin. It’s a project that aims to revolutionize how we perceive currencies combining fun, usefulness and real world applicationOUR MISSIONTOMIWAGMI offers something groundbreaking; a freelancing platform where transactions are facilitated by the TOMIWAGMI token. This tackles a standing challenge in the freelance industry – the complexities and limitations of payment methods. With TWG freelancers can now receive payments efficiently securely and with fees paving the way, for an borderless marketplace.WHY TOMIWAGMI PROJECT TOMIWAGMI is not your regular token following the meme coin trend. It carries a vision that goes beyond crypto norms. TOMIWAGMI seeks to bridge the gap, between freelance platforms and the expanding cryptocurrency landscape. Conceived by minds this project represents innovation by reimagining how freelance platforms function.REWARDING OUR HOLDERSTOMIWAGMI Token is an auto liquidity and auto Buyback reward token. A percent of all buys and sells will auto generate liquidity and also sends token automatically to holders wallet. You just have to simply hold $TWG with ease and without taking any risk.TOKEN DETAILSToken Name: TOMIWAGMISymbol: TWGDecimal: 18Total Supply: 10,000,000,000Contract: 0x3362bF8c39d87C25d1Be1F69364088Bf25EDd2EDLaunched: 29/08/2023TOKENOMICS✅ Public Sales. 25%✅ CEX Listing. 20%✅ Team. 15%✅ DEX Liquidity. 10%✅ Product Development 10%✅ Marketing and Promotion. 10%✅ Airdrop  5%✅ Reserve 5%USEFUL LINKS  Telegram Group: https://t.me/TomiwagmiTelegram Channel: https://t.me/TWG_CHANNELWebsite: https://tomiwagmi.com/Twitter: https://twitter.com/tomiwagmiEmail : admin@tomiwagmi.comJoin Our Ongoing Airdrop Below  Airdrop Link",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464022",
  "comments": [
    {
      "author": "Chareal",
      "created_time": "August 23, 2023, 05:35:41 AM",
      "body": "Airdrop Link: https://taskon.xyz/campaign/detail/8965",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chareal",
      "created_time": "September 29, 2023, 06:48:25 AM",
      "body": "Discover Tomiwagmi Project Join our exclusive presale on Pinksale ⚪️Welcome to join a meme journey, with Tomiwagmi. While the reign of dogs has had its days witness as Tomiwagmi rises to seize its deserved position of greatness. TomiWagmi Token $TWG not just another meme coin a meme token that merges entertainment, fun, utility, and real-world use. Bridging the gap between freelancing platforms and the crypto. Transaction Tax: 3.5% on both buying and selling1) Liquidity Fee (1%): This will will be charged on both buy and sell and placed back to add more liquidity in that base pair2) Marketing Fee (0.5%): This will be charged on every transaction and used for more marketing of the project.3) Burn Fee (1%): The fee will be Burned on every transaction and immediately deducted from total supply.4) Rewarding Fee (1%): This fee is charged on both buy and sell, it automatically convert to USDT and spread on all TWG holders according to their holding power. Pinksale KYC  ✅ Contract Audited ✅ Potential x10    ✅ Liquidity  locked ✅ Team tokens locked  ✅ Coinstore, P2B listing secured   ✅Starting Sept 29 2023 16:00 (UTC)Buy Presale from Pinksale https://www.pinksale.finance/launchpad/0xeC8ed9f8ef0616c8284DBF727ad60Dc13d3F7A57?chain=BSC&refId=0xF0E29DABA16dF0D114bf0eF1D7CaA0219d4a528bWebsite: https://tomiwagmi.comTelegram: https://t.me/Tomiwagmi Don't Miss the Launch! Secure your TWG tokens in the presale for a brighter crypto future.[/size]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}