{
  "id": "topic_5452069",
  "title": "daisyfrank",
  "author": "daisyfrank",
  "created_time": "May 09, 2023, 09:14:30 AM",
  "content": "In general, Bitcoin is a digital currency that is not controlled by any bank or government. Though, Bitcoins can be useful in trading goods, services, and other currencies.If you do a Bitcoin trading then you can make more online money with this factor. Here are the benefits of investing in Bitcoin trading:1. You can easily make online money with Bitcoin.2. Bitcoin trading is very safe and secure because it has been created with all the security checks in place3. If you know how to use Bitcoin trading successfully then you can definitely generate more online money.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452069",
  "comments": [
    {
      "author": "tabas",
      "created_time": "May 09, 2023, 09:31:20 AM",
      "body": "Quote from: daisyfrank on May 09, 2023, 09:14:30 AMIf you do a Bitcoin trading then you can make more online money with this factor. You have no idea how these words will make someone scared for the decision and experience of others. This sounds like a ponzi when someone who's aware of ponzi's get introduced to bitcoin through trading. No offense but that does really sound off. And these factors that you've mentioned, really confirms that it gives confidence to most people especially the newbies but it's not the way to go. Don't make it look like trading Bitcoin is easy money and can be done and learned overnight that's new to it.Quote from: daisyfrank on May 09, 2023, 09:14:30 AM1. You can easily make online money with Bitcoin.2. Bitcoin trading is very safe and secure because it has been created with all the security checks in place3. If you know how to use Bitcoin trading successfully then you can definitely generate more online money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "May 09, 2023, 09:43:34 AM",
      "body": "You are new to this forum as well as to Bitcoin itself; therefore, I did expect you to learn before drawing such a conclusion about what you have less knowledge about.Quote from: daisyfrank on May 09, 2023, 09:14:30 AM1. You can easily make online money with Bitcoin.2. Bitcoin trading is very safe and secure because it has been created with all the security checks in place3. If you know how to use Bitcoin trading successfully then you can definitely generate more online money.All you're talking about is money and online money; who says Bitcoin is a get-rich-quick scheme?There is risk involved in Bitcoin and crypto trading, and you need enough knowledge to understand them; therefore, I recommend you do some research on Bitcoin here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "May 09, 2023, 10:52:13 AM",
      "body": "Quote from: daisyfrank on May 09, 2023, 09:14:30 AMSnippedThere are many benefits that comes in through bitcoin trading but first of all you need to move your thread to the appropriate board for more information on this area of discussion, this post belong to trading discussion board, back to the benefits of trading bitcoin, we must not only talk about the benefits without going through the challenges as well in other not to make it enticing for intending trader that there's no risk at all in trading, though you may not loose your entire investment while trading like other online schemes do but there are periods one could also experience low profitability while trading, though this is not common but one must always prepare for the worst coming.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "May 09, 2023, 11:02:49 AM",
      "body": "Quote from: daisyfrank on May 09, 2023, 09:14:30 AMbenefits of investing in Bitcoin tradingInvest and trading are different. Invest in Bitcoin trading, what is your implication?Quote1. You can easily make online money with Bitcoin.Are you sure? Life is not rosy.The market is not rosy and it is a zero-sum game that means if you get profit, you get it from someone else and there are other people who lose money, pay for your profit.Quote2. Bitcoin trading is very safe and secure because it has been created with all the security checks in placeTrading is very risky. How did you claim it is safe?Security is about how you store your bitcoins, not how you trade it.Quote3. If you know how to use Bitcoin trading successfully then you can definitely generate more online money.It is very hard to manage it successfully. Not many traders are successful and able to earn profit from trading.Learn tradingAwesome crypto tradingStop loss orderStop limit order",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "big kid",
      "created_time": "May 09, 2023, 11:07:22 AM",
      "body": "Quote from: daisyfrank on May 09, 2023, 09:14:30 AMIn general, Bitcoin is a digital currency that is not controlled by any bank or government. Though, Bitcoins can be useful in trading goods, services, and other currencies.If you do a Bitcoin trading then you can make more online money with this factor. Here are the benefits of investing in Bitcoin trading:1. You can easily make online money with Bitcoin.2. Bitcoin trading is very safe and secure because it has been created with all the security checks in place3. If you know how to use Bitcoin trading successfully then you can definitely generate more online money.You can make money online with Bitcoin, but it's not easy at all. Trading is not safe, even if you know what are you doing, Any trading is a risk. I don't know if you're a newbie that doesn't understand anything or if are you trying to promote your article from the link. I'd say both.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Etranger",
      "created_time": "May 09, 2023, 11:10:04 AM",
      "body": "Quote from: hd49728 on May 09, 2023, 11:02:49 AMQuote from: daisyfrank on May 09, 2023, 09:14:30 AMbenefits of investing in Bitcoin tradingInvest and trading are different. Invest in Bitcoin trading, what is your implication?I agree, investing and trading are totally different activities and strategies. OP used a completely incorrect formulation, in my opinion. Investing in bitcoin suggests buying bitcoin with the goal of long-term preservation of the value of the asset, as well as with the hope that its price will increase in the future. Bitcoin trading, on the other hand, means buying and selling bitcoin in order to profit from short-term changes in its price. Traders usually make a large number of trades to increase their profits, unlike investors, who can make only a few purchases and sales for the entire time, the time interval between which can reach several years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gallar",
      "created_time": "May 09, 2023, 11:43:50 AM",
      "body": "Quote from: daisyfrank on May 09, 2023, 09:14:30 AMIn general, Bitcoin is a digital currency that is not controlled by any bank or government. Though, Bitcoins can be useful in trading goods, services, and other currencies.If you do a Bitcoin trading then you can make more online money with this factor. Here are the benefits of investing in Bitcoin trading:1. You can easily make online money with Bitcoin.~What does it mean to earn easy money?You need to know, even though bitcoin is indeed the king of all cryptos, it has become one of the most promising investment assets and its decentralized system. But still, it's not that easy to get profits via bitcoin. Of course it will require focus, hard work, patience, and high seriousness to be able to achieve at least some profit. Many forum members have mentioned several times that investing in bitcoin is not a get-rich-quick scheme or an easy way to get money. So you have to start fixing your mind about the view of investing in bitcoin. Not that your view is completely wrong, but that kind of thinking is not quite right when it comes to bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z390",
      "created_time": "May 09, 2023, 11:51:43 AM",
      "body": "What do you mean by investing in Bitcoin trading? there's nothing to invest to here, all you need to do is learn how to trade and pick a good trading strategy that you like, if you have the money and you don't have the brain you will end up losing all your money, trading is not something you can rush into, you need the knowledge first, it's like going to school and you need to be serious about it ..Bitcoin trading is not always safe and secure 1. If you use the wrong exchange for trading your bitcoin will never be yours again, there are many scam trading platforms in the crypto space today.2. You can easily lose money if you don't know what you are doing, the chart is a very tricky thing and even trading experts do lose their money too, how come someone who knows not much about trading won't love their money? It's easy to lose money in trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "May 09, 2023, 12:49:09 PM",
      "body": "Quote from: daisyfrank on May 09, 2023, 09:14:30 AMIn general, Bitcoin is a digital currency that is not controlled by any bank or government. Though, Bitcoins can be useful in trading goods, services, and other currencies.If you do a Bitcoin trading then you can make more online money with this factor. Here are the benefits of investing in Bitcoin trading:1. You can easily make online money with Bitcoin.2. Bitcoin trading is very safe and secure because it has been created with all the security checks in place3. If you know how to use Bitcoin trading successfully then you can definitely generate more online money.The problem with bitcoin is that it still can't directly be used as the way to pay for things. The overall cryptocurrency system depends heavily on fiat banks, which allow transferring BTC to USD (or other fiat and crypto). The way for btc to become truly free currency are the development of digital products which allow using BTC directly in payments, and the increase in the amount of business projects which accept payments in BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Texac",
      "created_time": "May 09, 2023, 01:06:26 PM",
      "body": "Quote from: daisyfrank on May 09, 2023, 09:14:30 AMIn general, Bitcoin is a digital currency that is not controlled by any bank or government. Though, Bitcoins can be useful in trading goods, services, and other currencies.If you do a Bitcoin trading then you can make more online money with this factor. Here are the benefits of investing in Bitcoin trading:1. You can easily make online money with Bitcoin.2. Bitcoin trading is very safe and secure because it has been created with all the security checks in place3. If you know how to use Bitcoin trading successfully then you can definitely generate more online money.are you a newbie? this is the mistake of most of the new entrants to the market.  I don't have the best advice or lesson for you, I just want to tell you, making money by investing in bitcoin is not easy, making money in this market is not easy either. it can be said that it is more difficult to make money in real life because of volatility, and scams... many things will make you lose money than make easy money. knowledge is what you need, not a hasty investment when you don't have any knowledge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "May 09, 2023, 02:13:39 PM",
      "body": "I wondered how to invest in bitcoin trading because investing and trading are different. Investing in bitcoins is buying bitcoins and holding those bitcoins for the short, medium or long term.While trading bitcoins is buying and selling bitcoins for profit. But both of them can make money. The difference is that if in investing, you have to hold it for a while, while in trading, you can make a profit for the day.But it is not easy to profit from trading because you need to learn a lot about trading. This includes knowing when you can trade from the results of the analysis you did.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wend",
      "created_time": "May 09, 2023, 02:50:04 PM",
      "body": "It is true that many people have become rich by investing or trading bitcoin. But that doesn't mean everyone who invests in bitcoin becomes rich. As far as I know, there are more losers than winners in this market. I don't blame you for being a newbie, but you need to eliminate the idea that bitcoin is a get-rich-quick place without hard work. If you invest with this mindset, you will soon become food for others. I will not advise you to do anything because to grow up, everyone needs to experience and pay the price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crptomagma",
      "created_time": "May 18, 2023, 07:31:21 PM",
      "body": "Yeah I agree with you that trading Bitcoin is secure and safe but when it comes to quick money making I don't agree with u totally, for an individual to trade and make money in Bitcoin you first of all need knowledge and experience",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "May 18, 2023, 07:41:11 PM",
      "body": "You make it like it's easy to make money trading Bitcoin when most of the traders nowadays are wiped. The Spot traders are just holding not even trying to buy more this time because of the recent regulation hearing and crackdown. It's not easy at all.Of course, you can only rip the benefits of trading Bitcoin when you know you can win trades, if not then just hold your coins as you will still benefit through it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "May 18, 2023, 08:30:38 PM",
      "body": "One of the primary methods of making money with Bitcoin is through trading. While there is also the option of earning by holding onto your Bitcoin, this is still considered a form of trading. However, it's important to note that making money through Bitcoin trading is not as easy as some might think. It's not a simple task that guarantees quick and effortless profits. If it were, everyone would be a millionaire by now. There are significant risks involved, including the potential for losing money.For instance, if you accumulate Bitcoin and the price subsequently starts to decline, you may need to wait patiently for the price to rise again in order to turn a profit. It requires resilience and patience to make money from Bitcoin trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "May 18, 2023, 08:37:10 PM",
      "body": "QuoteYou can easily make online money with Bitcoin.Another one who thinks that you buy Bitcoin just to make easy money.That's not how it's done, bro. You buy Bitcoin to be part of an idea that was initially created by satoshi. It's not a pump and dump. It's a real asset ranked among the Top 50 market-cap assets on Earth. Just like how people buy stock to support their company, people in this space buy Bitcoin to support the idea. If you think it's easy money, I would wait for you to become a millionaire this year. Its easy right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "May 18, 2023, 09:55:45 PM",
      "body": "Quote from: daisyfrank on May 09, 2023, 09:14:30 AM1. You can easily make online money with Bitcoin.You're right, one can make more money with bitcoin and same way loose more money as well if care is not taken because there are things that are expected of each investors or trader to do in ensuring they are more closer to making profits than loosing money than they expect.Quote from: daisyfrank on May 09, 2023, 09:14:30 AM2. Bitcoin trading is very safe and secure because it has been created with all the security checks in placeThere's no risk in trading bitcoin since it can never be like other cryptos or tokens that always create fear and panic over their investments, but we must be deliberate in everything we do while trading.Quote from: daisyfrank on May 09, 2023, 09:14:30 AM3. If you know how to use Bitcoin trading successfully then you can definitely generate more online money.This is absolutely true, aside from trading, you could also generate money just by holding bitcoin for some time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "May 18, 2023, 10:42:06 PM",
      "body": "Quote from: daisyfrank on May 09, 2023, 09:14:30 AM1. You can easily make online money with Bitcoin.This is not a get rich quick scheme, thus generating money online with bitcoin, as you've stated, makes no logic, and you may need to provide more explanations for people to understand your claim about how easy it is to generate money with bitcoin online.Quote2. Bitcoin trading is very safe and secure because it has been created with all the security checks in placeBitcoin is a decentralized currency with all the necessary protection, but the truth is that if you don't safeguard your wallet privacy, you'll be doomed and robbed of your coin if you accidentally leak out your seed phrase or if it is stolen.Quote3. If you know how to use Bitcoin trading successfully then you can definitely generate more online money.This is not something I will argue with because it has worked for many people also. All of this is determined by your drive and how well you can trade and profit in the face of market volatility and trading challenges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bushdark",
      "created_time": "May 18, 2023, 10:58:15 PM",
      "body": "I am not that surprised seeing a newbie write on benefits of investing in Bitcoin when it is very obvious that the market is volatile and one should take extra caution when investing in Bitcoin. Bitcoin is not just a coin we can trade when we enter the market without taking a rigorous study in how everything works. The goal should not be to make profits as fast as possible but to first seek for the understanding of the cryptocurrency market or else, one will go into trading and end up losing all there funds because they are too desperate to learn the necessary things that is needed to know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}