{
  "id": "topic_5433712",
  "title": "decentrasoft",
  "author": "decentrasoft",
  "created_time": "January 10, 2023, 06:02:47 AM",
  "content": "I have issues with an instagram account which has a 2FA with a phone that I have no longer access to. I have the password and also I have access to the email that is linked to the profile. The profile is related to my car and I have only one photo of me with it in a collaboration with my personal profile. Feel free to contact me via DM if you can help.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433712",
  "comments": [
    {
      "author": "Techdev",
      "created_time": "January 10, 2023, 06:14:57 AM",
      "body": "Unable to dm you, your settings. Hit me up on Telegram:@ElevatedWarrior",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "January 10, 2023, 06:46:26 AM",
      "body": "Are you paying bitcoin for the service you are asking? Kindly mention it, because the very content of this thread isn't related to bitcoin which will make the thread to subject for moving to somewhere else or to the trashcan. For account recovery, you should message instagram support if you needed help instead or someone else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decentrasoft",
      "created_time": "January 10, 2023, 06:54:17 AM",
      "body": "Quote from: PX-Z on January 10, 2023, 06:46:26 AMAre you paying bitcoin for the service you are asking? Kindly mention it, because the very content of this thread isn't related to bitcoin which will make the thread to subject for moving to somewhere else or to the trashcan. For account recovery, you should message instagram support if you needed help instead or someone else.Yes, I pay in crypto. I've contacted instagram support many times for a month now and there is no response. That's why I'm asking for help here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "January 10, 2023, 06:58:36 AMLast edit: January 10, 2023, 07:16:16 AM by PX-Z",
      "body": "Quote from: decentrasoft on January 10, 2023, 06:54:17 AMYes, I pay in crypto. Mention this on the OP to avoid confusion, if you are paying bitcoin or any altcoin particularly.Quote from: decentrasoft on January 10, 2023, 06:54:17 AMI've contacted instagram support many times for a month now and there is no response. That's why I'm asking for help here.Then try to follow up them in everyday basis, because i see no reason how someone here can help when it regards to instagram account recovery especially lost 2fa issue. I also see no article related to 2fa recovery except when you have a backup code on the 2fa which based on opening this thread you don't have.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decentrasoft",
      "created_time": "January 10, 2023, 07:04:12 AM",
      "body": "Quote from: PX-Z on January 10, 2023, 06:58:36 AMQuote from: decentrasoft on January 10, 2023, 06:54:17 AMI've contacted instagram support many times for a month now and there is no response. That's why I'm asking for help here.Then try to follow up them, because i see no reason how someone here can help when it regards to instagram account recovery especially lost 2fa issue.I've contacted them 17 times in December. There support is useless they don't even respond. I've done it through the app, via email, contacted them via chat in there verified instagram account \"instagramforbusiness\" also",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "January 10, 2023, 07:14:20 AM",
      "body": "I see that their support is a trash by googling same issue as yours. And  i found this reddit thread[1] on how you can communicate their support and recover your account. Hope this helps.[1] https://www.reddit.com/r/Instagram/comments/opj2dv/got_my_account_back_after_2fa_issue_and_disabled/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decentrasoft",
      "created_time": "January 10, 2023, 07:41:19 AM",
      "body": "Quote from: PX-Z on January 10, 2023, 07:14:20 AMI see that their support is a trash by googling same issue as yours. And  i found this reddit thread[1] on how you can communicate their support and recover your account. Hope this helps.[1] https://www.reddit.com/r/Instagram/comments/opj2dv/got_my_account_back_after_2fa_issue_and_disabled/Thank you! I will try the solutions provided and I will reply to this topic with an update",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decentrasoft",
      "created_time": "January 17, 2023, 08:04:37 AM",
      "body": "Let me bump the topic again. I've tried the reddit option, but the success was the same as contacting instagram support via the support options from the app or in a fewer words - nothing. If somebody provides recovery solutions or has some contact with instagram moderator or support, I'm willing to pay whatever it costs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}