{
  "id": "topic_5495599",
  "title": "alani123",
  "author": "alani123",
  "created_time": "May 07, 2024, 07:07:41 AM",
  "content": "Apr. 24: Samourai Wallet Founders Arrested and Charged With Money LaunderingPrivacy wallet devs arrested for... Developing a privacy wallet. One was unfortunate enough to be arrested in the U.S. and the other will be facing an extradition battle. Apr. 30: Binance founder Changpeng Zhao sentenced to 4 months in prison after plea dealCZ Got sentenced to a jail sentence in spite of him having made a very extensive plea deal with the feds only to avoid jail. He had even given up his role as CEO. CZ had willingly come to the U.S. to stand trial and he still didn't manage to avoid a sentence even though he fully cooperated. Albeit a small sentence it goes to show how ferocious feds can be. May 1: DOJ charges ‘Bitcoin Jesus’ with $48 million tax fraud, seeks extraditionEarly bitcoin supporter and investor Roger Ver, who had rescinded his U.S. citizenship and was traveling on a Saint Kitts passport he had bought, was recently arrested abroad. Now the feds are seeking his extradition.  May 2: Wasabi Bitcoin privacy mixing service to shut down starting June 1, zkSNACKs cites legal certainty concernsAnother prominent privacy wallet shut down its privacy component proactively in light of developments from the U.S. pursuing action against privacy wallet developers.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5495599",
  "comments": [
    {
      "author": "MusaMohamed",
      "created_time": "May 07, 2024, 07:19:03 AM",
      "body": "FED, DOJ, SEC can do anti-Bitcoin, anti-cryptocurrency actions and can do some regulations to serve their fights against this market but they must now, by doing such fights, they are fighting against their citizens.I believe there is no absolute freedom for citizens or absolute power from the governments to do every regulatory actions they want. Because in Western and developed countries, citizens, the people can use their voice and votes to fight for their freedom and rights.Even in the US. Congress, not all politicians are against Bitcoin and cryptocurrency and they will fight for this market and for their political future too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "May 07, 2024, 07:29:27 AM",
      "body": "Sec in various countries need to do more in terms of regulations if their ever want to create an enabling and secured cryptocurrency environment that allow wide spread adoption of this 21st century technology, because by doing that, it will reduce the chances of individual firm CEOs from committing all manar of criminal acts such as money laundering which is prominent within the cryptocurrency space today most especially centralized firms.Currently the government in my view is taking a wrong approach at least in the case of my country sec vs cryptocurrency regulations, government need to be pro active because that is the only way they can stop those crimes before their happen in the cryptocurrency Industry,  and with good regulatory the government will draft a formidable framework that allow free flow of taxation from. Cryptocurrency ventures like exchange and other services within the cryptocurrency space.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Moreno233",
      "created_time": "May 07, 2024, 07:48:08 AM",
      "body": "If you look deeper into this whole action of the authorities, one thing is common which is the fight against privacy. The authorities are desperately doing their best to eliminate anything privacy as it has to do with finance because the moment they lose control of finance, their powers might seem diminished. A part of me have the feeling that most of the allegations against mixers might be fabricated because there was little evidence to support the fact that mixers were used to launder illegal funds. Even if they were, from time immemorial, conventional payment systems have been used for money laundering, terrorism financing, human trafficking, drugs and others but we have not heard of any of the channels being shutdown for the same purpose. Why then are privacy related system being targeted? In many countries, Bitcoin and exchanges are being blamed for the devaluation of their currency and collapse of their economy, a baseless statement from government that have either lost touch of reality or are obviously trying to kill Bitcoin as they see same as a treat. I do not really know what the future look like for Bitcoin as it has to do with privacy. By the way, Theymos was right in his decision to ban mixers here, he saved this forum from the authorities even though many people will think otherwise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "May 07, 2024, 08:49:53 AM",
      "body": "The case with binance and cz does not have anything to do with BTC, cz was guilty of money laundering and the other offences he was charged with, he paid fines of a large amount and is going to stay in prison for four months, so that is that. I have always said that centralized exchanges and custodial services are into a lot of shady things, and prosecuting them can serve as a deterrent to others.However, there is an obvious attack against BTC, through privacy options that service bitcoiners and also anything that enhances privacy. The government isn't even going to stop here, many countries want to launch their cbdc's, so what better way than to attack BTC's fungibility and in turn promote their own digital currencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "May 07, 2024, 09:27:24 AM",
      "body": "Seems like crackdown on wallet with in built privacy tools is already end because Mercury wallet stopped their operation since the last year and Sparrow Wallet had stopped the CoinJoin feature around 2 weeks ago.Quote from: MusaMohamed on May 07, 2024, 07:19:03 AMEven in the US. Congress, not all politicians are against Bitcoin and cryptocurrency and they will fight for this market and for their political future too.Sure they're not against Bitcoin and cryptocurrency, as we can see many Bitcoin naysayers now invest in Bitcoin, but... they won't support privacy rights.Quote from: Moreno233 on May 07, 2024, 07:48:08 AMA part of me have the feeling that most of the allegations against mixers might be fabricated because there was little evidence to support the fact that mixers were used to launder illegal funds. Even if they were, from time immemorial, conventional payment systems have been used for money laundering, terrorism financing, human trafficking, drugs and others but we have not heard of any of the channels being shutdown for the same purpose. Why then are privacy related system being targeted? Government: Trust me bro.Because in conventional payment systems, the government can get a share from the money laundering, terrorism, human traffic, drug etc. They won't shutdown their service since it would affect their earnings and people's trust, instead they will say it's \"human error\" if they missed to frozen criminals' funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shield132",
      "created_time": "May 07, 2024, 10:13:52 AM",
      "body": "Quote from: alani123 on May 07, 2024, 07:07:41 AMApr. 30: Binance founder Changpeng Zhao sentenced to 4 months in prison after plea dealCZ Got sentenced to a jail sentence in spite of him having made a very extensive plea deal with the feds only to avoid jail. He had even given up his role as CEO. CZ had willingly come to the U.S. to stand trial and he still didn't manage to avoid a sentence even though he fully cooperated. Albeit a small sentence it goes to show how ferocious feds can be. May 1: DOJ charges ‘Bitcoin Jesus’ with $48 million tax fraud, seeks extraditionEarly bitcoin supporter and investor Roger Ver, who had rescinded his U.S. citizenship and was traveling on a Saint Kitts passport he had bought, was recently arrested abroad. Now the feds are seeking his extradition.  These two FED actions aren't against Bitcoin and crypto, they are against Fraudsters. Changpeng Zhao and Roger Ver are very shady people. Changpeng Zhao has been letting people launder money on his Binance, he also has been helping Chinese users to bypass KYC restrictions, in overall, a very shady business practice.The majority of this forum members also know who Roger Ver is. He is a guy that for some reason which I don't know, owns Bitcoin.com domain and uses this privilege to lie to people, promotes Bitcoin Cash over the original Bitcoin and does many shady things. It's good that these two people got in trouble but it drives me crazy how CZ only got to spend 4 months in prison.Actions against Samouri Wallet Founders and Wasabi privacy mixing service are definitely an action against Bitcoin, cryptocurrencies and our privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelockg",
      "created_time": "May 07, 2024, 10:32:57 AM",
      "body": "Somehow, the crypto ecosystem needs some form of regulation to some extent so people that comes into the system don't use it decentralized nature as an excuse for abusing it and using it to carry out evil agenda.What the FED are doing is a two sided narrative, on the one hand, they are trying to paint a picture that the crypto ecosystem can't be totally void of there regulation and by so doing they tend to infringe on the privacy of her users and deny them of some key fundamental rights they have to carry out there financial transactions the way they want to. On the order hand, which to some extent isn't bad is that  they might want to fetch out the bad eggs from the system so as to discourage whoever might have any intention of using crypto in a way that will be dangerous to the society.But this is just too much for most persons that are just joining th system not long ago. In my region, we've been denied access to the use of binance, a major threat has been issued out to delist our currency from major exchanges and while thier hasn't been an outright ban on crypto in general, the laws and regulations that's now affecting all crypto users generally sena to become a major source of discouragement for all crypto enthusiast.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Felicity_Tide",
      "created_time": "May 07, 2024, 10:41:49 AM",
      "body": "Quote from: Z-tight on May 07, 2024, 08:49:53 AMThe case with binance and cz does not have anything to do with BTC, cz was guilty of money laundering and the other offences he was charged with, he paid fines of a large amount and is going to stay in prison for four months, so that is that. I have always said that centralized exchanges and custodial services are into a lot of shady things, and prosecuting them can serve as a deterrent to others.I actually thought the SEC was trying to bring down Binance in the first place, but I literally didn't believe the money laundering charges. I think centralized exchanges place themselves in such positions where things can go against them at any point in time. Lately, I have learned that these agencies are literally after everything related to crypto, whether centralized or decentralized. Which means they also disturb exchanges(centralize) that are under their(SEC's) supervision.QuoteHowever, there is an obvious attack against BTC, through privacy options that service bitcoiners and also anything that enhances privacy. The government isn't even going to stop here, many countries want to launch their cbdc's, so what better way than to attack BTC's fungibility and in turn promote their own digital currencies.I think the government has realized that cryptocurrency will succeed no matter how tough they act on it. However, they are still very interested in their no privacy policy, which would surely give them information on everyone using Bitcoin and others. Privacy is surely the right of everyone and it's not negotiable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alani123",
      "created_time": "May 07, 2024, 12:15:20 PM",
      "body": "Another piece of news that was glanced over by most is that the DTCC will not be considering BTC and any crypto ETFs as collateral, in their own words giving those assets a 100% haircut for collateral purposes:https://www.dtcc.com/-/media/Files/pdf/2024/4/26/B20002-24.pdfThis news came on April 26 and started to apply from April 30. This means that any holder of crypto ETFs can no longer use them as a margin hedge. Obviously it's bad news for institutional investors. The DTCC might not be a federal agency but it's the closest thing there can be to a state organization as the U.S. is one of the few countries where central clearing houses are private and aren't associated with the government and the state. So it's a very authoritative decision by the main organization affecting such transactions in traditional financial markets. There was no explanation as to why this happened but it's not too unlikely that there was some behind the scenes FED involvement to make this happen after crypto ETFs stared getting official approval.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "May 07, 2024, 12:53:06 PM",
      "body": "It's weird that FUD spreaders aren't celebrating with all these negative news, I guess there's not a lot of people out there that's taking them seriously nowadays that it's not worth their time to be a hater of bitcoin anymore. It's such a surprising thing too that they're actively moving against crypto again, really crazy that they're suddenly hostile with bitcoin and crypto again, I do hope though that this will only strengthen the community though. The arrest of Roger Ver is one of the biggest one in my opinion, $48m alleged fraud? Wow! Suddenly they're doing all of this now? They really must need Ver's wealth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "May 07, 2024, 12:53:20 PM",
      "body": "Quote from: Felicity_Tide on May 07, 2024, 10:41:49 AMI think the government has realized that cryptocurrency will succeed no matter how tough they act on it. However, they are still very interested in their no privacy policy, which would surely give them information on everyone using Bitcoin and others. Privacy is surely the right of everyone and it's not negotiable.They have scrutinized exchanges and companies that have been all-out for crypto. It's for sure that they're seeing where this is heading and that's to greater success of Bitcoin. And it's not just about the possible success of Bitcoin but also it includes our privacy. They're violating our rights to privacy but even with that, they're telling who's the boss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "May 07, 2024, 12:59:40 PM",
      "body": "\"They\" have always been against Bitcoin, or more precisely against the idea that BTC basically represents - which is a decentralized cryptocurrency, and when you mention those words (decentralized cryptocurrency) to any of the politicians/bankers, their pressure immediately rises and they start behaving strangely. What is happening right now is obviously a coordinated action towards all tools that have the possibility of mixing BTC, although this happened before to a somewhat lesser extent. I don't see anything strange in that, it is more than logical behavior of people who are obsessed with controlling everything and everyone.Also, in the last few days, two well-known mixers have \"disappeared\", apparently in an attempt not to become a target. Obviously, a very clear message is being sent - \"we will kill your privacy sooner or later\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "May 07, 2024, 02:09:01 PM",
      "body": "Quote from: alani123 on May 07, 2024, 12:15:20 PMAnother piece of news that was glanced over by most is that the DTCC will not be considering BTC and any crypto ETFs as collateral, in their own words giving those assets a 100% haircut for collateral purposes:The US has many other trust companies registered with the U.S. Federal Reserve System. The country also has five other registered clearing agencies besides the Depository Trust Company (DTC). If they decide not to accept BTC and other cryptocurrencies as collateral, others will take it. When an organisation has an anti-Bitcoin Board of Directors, it will do everything to give the sector a bad reputation. Quote from: Z-tight on May 07, 2024, 08:49:53 AMThe case with binance and cz does not have anything to do with BTC, cz was guilty of money laundering and the other offences he was charged with, he paid fines of a large amount and is going to stay in prison for four months, so that is that. I have always said that centralized exchanges and custodial services are into a lot of shady things, and prosecuting them can serve as a deterrent to others.I am not a fan of centralised platforms but it is worth noting that the government is also attacking them directly or indirectly. The government keep making new laws to make their operation difficult. The scope of what is money laundering keeps expanding every day. These new regulations are strategies to push these crypto service providers out of business. An example is the closing of many Bitcoin ATMs in the UK because of regulatory infringements. The Bitcoin ATM operators could not renew their licences because the process has become rigorous.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "May 07, 2024, 02:27:29 PM",
      "body": "Quote from: Z-tight on May 07, 2024, 08:49:53 AMThe case with binance and cz does not have anything to do with BTC, cz was guilty of money laundering and the other offences he was charged with, he paid fines of a large amount and is going to stay in prison for four months, so that is that. As cryptocurrency is growing we can’t expect for the government to turn a blind eye into everything they see. That’s why we are seeing a spike of cases wherein any crypto-related personas are being sued and arrested left and right. However even though some of these cases just like with cz’s who has nothing to do with bitcoin ir crypto itself, we can not deny that the government might be taking this as a win against crypto.QuoteHowever, there is an obvious attack against BTC, through privacy options that service bitcoiners and also anything that enhances privacy. The government obviously goes against bitcoin and giving up control and privacy to us citizens so I am sure that they are alarmed and trying to learn about crypto as much and as quick as possible.QuoteThe government isn't even going to stop here, many countries want to launch their cbdc's, so what better way than to attack BTC's fungibility and in turn promote their own digital currencies.They will do anything so that the ball is still in their court. We shall see how it all plays out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "May 07, 2024, 03:54:37 PM",
      "body": "These actions are not against \"bitcoin and crypto\", they are clearly against mixers, which they are clearly coming after.And their concern is money laundering and tax evasion, not people holding and trading crypto, which millions do every day and are under no risk of prosecution.This is not, repeat not a crackdown on cryptocurrencies.You can debate whether the government should be cracking down on anonymized services that allow transactions that are impossible to be tracked by a government with a valid subpoena, but that is all they are targeting here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "May 07, 2024, 04:13:40 PM",
      "body": "US and it's enforcement authorities are furious as they have realised that they cannot control crypto at all. So they are targetting businesses like Binance. Mixers are different story. But I was surprised to see CZ getting 4 months of imprisonment. It's high time that crypto businesses move out of US completely stop rendering services to the US customers. They will eventually Target all businesses built around crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "May 07, 2024, 05:01:31 PM",
      "body": "They may be anti-privacy but they may want Bitcoin.In some wallets that make the decision to stop Coinjoin services do not want to get unwanted things like Wasabi.I think certain parties want to control Bitcoin in such a way that they continue to look for loopholes as they have and are doing.Initially on the mixer and on the services related to it.Another possibility in my opinion, they would stop everything they are doing if they could control Bitcoin like they control the fiat financial system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "May 07, 2024, 05:07:31 PM",
      "body": "It's government against Bitcoin users's privacy, against Bitcoin's through nature of decentralization, and against platforms that promote and support privacy. The government loves transparency, and since they can't get a hold of everything they want to know, plus the fact that money laundering cases are now becoming popular with cryptocurrency,. It's nothing new that the government hates a system that is not transparent; they always want to oversee everything, and this is going to continue as they will not also rest. I also saw a post stating that two mixers were recently suspended too. I don't know how true that is, but it could be true because of the other mixers that have been banned in the past.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Natsuu",
      "created_time": "May 07, 2024, 05:20:59 PM",
      "body": "Quote from: Maus0728 on May 07, 2024, 12:53:06 PMIt's weird that FUD spreaders aren't celebrating with all these negative news, I guess there's not a lot of people out there that's taking them seriously nowadays that it's not worth their time to be a hater of bitcoin anymore. It's such a surprising thing too that they're actively moving against crypto again, really crazy that they're suddenly hostile with bitcoin and crypto again, I do hope though that this will only strengthen the community though. The arrest of Roger Ver is one of the biggest one in my opinion, $48m alleged fraud? Wow! Suddenly they're doing all of this now? They really must need Ver's wealth.And as for me I leverage this type of news. Because FUD news, charges from known Exchanges, New Government policies, for me it only creates price manipulation. It manipulates participants of Bitcoin and cryptocurrency by putting in negative stance in the market. Those news creates fear that would push emotions of many investors or hodler. They may get convinced to sell their position. And it's nothing new, Crypto space has been in many negative issues before but still BTC is in a very bullish market sentiment especially after adapting to changes in the halving season.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}