{
  "id": "topic_5474312",
  "title": "SeriouslyGiveaway",
  "author": "SeriouslyGiveaway",
  "created_time": "November 16, 2023, 02:20:08 PM",
  "content": "Today I used the Electrum wallet today, and when I tried to send Bitcoin to an exchange, I noticed a notification indicating that the transaction status was not confirmed. It's been almost a day now, and surprisingly, none of the three transactions I initiated have been completed. I'm a bit concerned about this delay. I double-checked the details, and the status still shows as unconfirmed. I even verified the transaction IDs on the blockchain explorer, but there's no progress. I'm wondering what might be causing the holdup.Transaction 1: I used default fee the wallet recommends Transaction 2+3 : I increased fee basing on this website: https://mempool.space/And now, 3 transactions haven't yet been confirmed Right now, I'm really confused, I don't know if I did something wrong or if my wallet is defective? Looking forward to receiving your help, how can I complete the transaction?[/list]",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474312",
  "comments": [
    {
      "author": "LucyFurr",
      "created_time": "November 16, 2023, 02:24:39 PM",
      "body": "Please check the second transaction it should be confirmed by now since the fee used is more than enough to be included in the last few blocks that were mined.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "November 16, 2023, 02:37:54 PM",
      "body": "More or less the issue is you are doing a CPFP If you look at https://mempool.space/tx/c2d38a9d12d6de50b1ea6b75f506457cdc94ab0c9f62b69a8df6db17f2cff310The effective fee rate is only 67.3 sat/vb since you are covering the older 20 sat/vb tx With you need about 190 sat / vb at the moment so you are going to have to wait it out or *massively* bump the fee.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "November 16, 2023, 02:38:43 PM",
      "body": "The network is so congested now and the fee rate used for the first transaction is very low. The second transaction is using the fund received in the first transaction as change and the third transaction is spending the fund received in the second transaction.As long as the parent is unconfirmed, the child can't be confirmed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "November 16, 2023, 02:43:58 PM",
      "body": "The transaction No 1 has a very transaction fee and its change is where transaction No 2 is spending from. So that means the first transaction needs to first get confirmed. The second transaction has 105.1sats/byte which is lower than the transaction in the current mempool and that needed to bump the parent transaction (transaction 1). The second transaction is acting as the parent transaction for transaction 3 and the fee (233sats/byte) is actually enough to complete that transaction but I don’t think it is enough to confirm the last two parent transactions (transaction 1 and 2). My little advice is to bump the first transaction using RBF and see if it will get confirmed first. Then you can spend from it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "November 16, 2023, 02:58:13 PM",
      "body": "Quote from: Zaguru12 on November 16, 2023, 02:43:58 PMMy little advice is to bump the first transaction using RBF and see if it will get confirmed first. Then you can spend from it.With doing so, the two other transactions would be invalidated. If OP wants  all three transactions to be confirmed fast, he/she must bump the fee rate of the third transaction. The network is so congested now and the required fee rate for getting fast confirmation is now around 170 sat/vbyte. The total (virtual) size of the transactions is 1192 vbyte. This means the fee rate required for these three transactions to be confirmed fast is now around 200,000 satoshi. The total fee that has been paid for the first and second transactions is 36,244 satoshi and this means that around 160,000 satoshi needs to be paid for the third transaction. If the fee rate of the third transaction is bumped to around 850 sat/vbyte, all three transactions will be probably confirmed fast.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "November 16, 2023, 04:53:48 PM",
      "body": "Quote from: SeriouslyGiveaway on November 16, 2023, 02:20:08 PM~Right now, I'm really confused, I don't know if I did something wrong or if my wallet is defective? Looking forward to receiving your help, how can I complete the transaction?It seems like you tried using CPFP (Child-pay-for-parent) instead of RBF (Replace-by-fee) on that first transaction, which was probably not the right move.  No biggie, here is what you can do now: Option 1 is to RBF the original transaction and  that will cancel out the other two.  Option 2 is to RBF only the last one.  That will get all three confirmed, but you will need a massive fee to cover everything.  Not sure if it is worth it.   Or Option 3 - just chill and wait for the network congestion to clear up.  I see the effective fee rate on that third transaction is 67.3 sats/vB so it should go through once things calm down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "November 16, 2023, 06:20:50 PM",
      "body": "Quote from: Stalker22 on November 16, 2023, 04:53:48 PMIt seems like you tried using CPFP (Child-pay-for-parent) instead of RBF (Replace-by-fee) on that first transaction, which was probably not the right move.  No biggie, here is what you can do now: The second and third transactions increased the effective fee rate of the first transaction and they can be considered as CPFP transactions, but that's not why OP made those transactions. If OP had used CPFP option on electrum, those transactions would include only one receiving address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "November 16, 2023, 11:21:54 PM",
      "body": "Quote from: Stalker22 on November 16, 2023, 04:53:48 PMOr Option 3 - just chill and wait for the network congestion to clear up.  I see the effective fee rate on that third transaction is 67.3 sats/vB so it should go through once things calm down.  In my opinion, this is the best thing to do right now. There is no need to bump the fees. The sent amounts are not worth it.No on is going to pay in fees more than what he is going to spend.According to mempool, transactions paying less than 25sats/vbyte are being purged. So, it's just a matter of time before the first transaction gets dropped and all the other transactions become non-valid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "November 17, 2023, 01:21:13 AM",
      "body": "Quote from: khaled0111 on November 16, 2023, 11:21:54 PMIn my opinion, this is the best thing to do right now. There is no need to bump the fees. The sent amounts are not worth it.No on is going to pay in fees more than what he is going to spend.Joining fee race when mempools are congested is a lesson all newbies have to learn but I agree that it is unnecessary when a transaction value is too small. Joining the race, using too high fee rate, will make transaction fee consumes most of a transaction value, it is waste of money.QuoteAccording to mempool, transactions paying less than 25sats/vbyte are being purged. So, it's just a matter of time before the first transaction gets dropped and all the other transactions become non-valid. OP can wait for like 14 days that are default setting for memory expiration time in most of mempools, then OP can re-broadcast a new transaction with possible better fee rate next two weeks. Congestion from Ordinals will die with time and OP also can wait for chances in weekends to have cheaper fee rates than other days of week.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SeriouslyGiveaway",
      "created_time": "November 17, 2023, 01:24:18 AM",
      "body": "I appreciate all your help. I've figured out where my issue lies. It seems my first transaction had a mistake in choosing CPFP instead of RBF with a fee that was too low, resulting in the two subsequent transactions not being confirmed. Maybe I should have waited for the network fees to drop. Once again, thank you all so much for your assistance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "November 17, 2023, 05:57:23 AM",
      "body": "Quote from: SeriouslyGiveaway on November 17, 2023, 01:24:18 AMMaybe I should have waited for the network fees to drop.Or you could've used \"coin control\" features because the intended 0.00013281BTC output can be paid by any one of those 7 inputs used.That way, it wouldn't be expensive to bump the fee rate effectively or you can even initially set a high fee rate without resulting with a very high absolute fee.Here's how to use coin control: bitcoinelectrum.com/how-to-spend-specific-utxos-in-electrum/Additionally, you can also freeze UTXO in the coins/address tab.For your information, it used all those \"unnecessary\" inputs because of Electrum's privacy feature that made it spend all the available UTXO referenced to the same address so that it wont be linked with other UTXO in the future.Given that, also use coin control in order not to do so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "November 17, 2023, 06:23:12 AM",
      "body": "I would go against the advice being given above and I would completely replace the first transaction with a new transaction.First, two of your transactions are sending coins to the same address. This is unnecessary and you will end up spending a lot of extra fees given the current state of the mempool.Secondly, your first transaction uses 7 inputs when any one would be sufficient. Again, given the current state of the mempool, now is not the time to be consolidating UTXOs. This is even more pertinent since you are using a 2-of-3 multi-sig and your first transaction is rather large at 815 vbytes.And thirdly, given the fee rate of your first transaction is as low as it is many nodes will have already dropped it as they will have exceeded the default limits, and so any RBF of the subsequent transaction or any further CPFP may not even be accepted by many nodes since they do not know about the unconfirmed parent any more.I would spend one of the inputs used in the first transaction, and only that input, to send the ~0.00013 to the exchange as you were trying to do. Your transaction will end up being around 192 vbytes, and you will need a fee of around 150 sats/vbyte, which will be around 29,000 sats in total. However, as well as your transaction actually being confirmed, you will save the over 80,000 sats you have already spent in fees, and you will avoid creating even more change outputs in your wallet which will need consolidated again in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "November 17, 2023, 08:14:46 AM",
      "body": "Quote from: SeriouslyGiveaway on November 17, 2023, 01:24:18 AMI appreciate all your help. I've figured out where my issue lies. It seems my first transaction had a mistake in choosing CPFP instead of RBF with a fee that was too low, resulting in the two subsequent transactions not being confirmed. Are you saying you did CPFP for your first transaction?With doing CPFP, electrum sends the fund received in the unconfirmed transaction to one of your own addresses, but the address bc1qcr2ntkxyg5aep2qv35wrdpsydzzwa34rwfs6xf which was used as receiving address in second and third transactions doesn't belong to your wallet. To add to o_e_l_e_o's post:If you want to make a new transaction including only 1 input, you need to connect to a server which doesn't have your transaction in its mempool. If electrum is displaying status of your transaction as unconfirmed, try connecting to different servers until the status changes to local. Some nodes should have dropped your transaction from their mempool while some other should still have it. Right click on your local transaction and select \"Remove\". After that you will need to use coin control to make a transaction with only 1 input.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "November 17, 2023, 12:51:34 PM",
      "body": "Quote from: khaled0111 on November 16, 2023, 11:21:54 PMQuote from: Stalker22 on November 16, 2023, 04:53:48 PMOr Option 3 - just chill and wait for the network congestion to clear up.  I see the effective fee rate on that third transaction is 67.3 sats/vB so it should go through once things calm down.  In my opinion, this is the best thing to do right now. There is no need to bump the fees. The sent amounts are not worth it.No on is going to pay in fees more than what he is going to spend.According to mempool, transactions paying less than 25sats/vbyte are being purged. So, it's just a matter of time before the first transaction gets dropped and all the other transactions become non-valid. You can no longer rely on that, there are nodes that have TXs in them for months on end now and it's been shown that some miners will never drop TXs.You can't assume that 300mb / 2 weeks is going to get it out of the mempool just the defaults. -Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "November 17, 2023, 02:33:11 PM",
      "body": "Quote from: o_e_l_e_o on November 17, 2023, 06:23:12 AMI would go against the advice being given above and I would completely replace the first transaction with a new transaction.The advice isn't about performing something to the existing transaction since it's never even mentioned in my reply.It's for information and an idea that he can follow in his future transactions to save on fees.Notice that I followed-up his \"should have\" scenario with another \"could've\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "November 17, 2023, 03:22:10 PM",
      "body": "Quote from: nc50lc on November 17, 2023, 02:33:11 PMThe advice isn't about performing something to the existing transaction since it's never even mentioned in my reply.I wasn't referring to your reply, but rather to the general advice in the thread regarding bumping the child transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}