{
  "id": "topic_5474649",
  "title": "Jamestown70",
  "author": "Jamestown70",
  "created_time": "November 19, 2023, 11:08:16 AM",
  "content": "Nigerian higher institution student now lack the zeal to read and do a proper research because of ai presently now ai is now the Messiah to many Nigerian students which I see as a threat if not is been done the thing about it is that most of the time it pops out wrong answers mean while if you did not study it will think it's correct, Nigerian student before now we're known to be very very intelligent not minding our semi failed educational system we have here its very easy for Nigeria's to bag first class and many other honors outside Nigeria because we do study hard for it but I doubt in 10 years time if we will be able to say this again because of the high rate of student turning to this Ai thing basically I see it helpful a little bit but I will still encourage you to still  study so you wouldn't be taken unaware with wrong answers.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474649",
  "comments": [
    {
      "author": "Hatchy",
      "created_time": "November 19, 2023, 11:21:27 AM",
      "body": "Quote from: Jamestown70 on November 19, 2023, 11:08:16 AMNigerian higher institution student now lack the zeal to read and do a proper research because of ai presently now ai is now the Messiah to many Nigerian students which I see as a threat if not is been done the thing about it is that most of the time it pops out wrong answers mean while if you did not study it will think it's correct, Nigerian student before now we're known to be very very intelligent not minding our semi failed educational system we have here its very easy for Nigeria's to bag first class and many other honors outside Nigeria because we do study hard for it but I doubt in 10 years time if we will be able to say this again because of the high rate of student turning to this Ai thing basically I see it helpful a little bit but I will still encourage you to still  study so you wouldn't be taken unaware with wrong answers.Well so far, Nigeria have been tagged one of the country with most brilliant students all over the world. A lot of our students when been challenged with students from other countries, comes out with outstanding results to show forth. This intelligence has emaciated from the hard educational system in the country. Nigerian students are taught the hard way in other for them to be stronger and better in the job market. So far, Nigeria produces more than a million graduates each year from various universities who are experts in their various field of study. The invention of Ai technology, which we all know is still under it's development stage has helped in somany ways but still it lacks accuracy. A reasonable and brilliant student wont need Ai to do his research. There are lots of data over the internet that you can research on for better understanding of your projects. A student who always depends on ai tech to do his works will eventually fail because the ai produces false responds more often and only someone with sound knowledge will be able to tell or clarify false information. The ai can still be of help, but they should learn not to abuse it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "November 19, 2023, 01:45:10 PM",
      "body": "From basic schools to tertiary institutions, there are several tests and examinations that students must pass before they are finally certified. Phones and other devices that can help the students to have access to AI are not allowed during examinations. But what I think is that AI can make learning easier but not a threat to education or educational system.Quote from: Hatchy on November 19, 2023, 11:21:27 AMWell so far, Nigeria have been tagged one of the country with most brilliant students all over the world. I have not heard about this before. Can you point me to a valid source about this. Most countries that I know are considered in this category are from Europe and Asia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Justbillywitt",
      "created_time": "November 19, 2023, 02:41:34 PM",
      "body": "To me AI is a treat to humanity not just the educational sector as you have pointed out. There is no doubt that AI was manufactured for some obvious reasons but the truth is soon AI will be a real treat to human existence. This is not just peculiar to Nigeria but the world at large. I know that there are student's who will still do well on their own in this AI era. But let's look at the larger picture here what will happen when the AI will start taking our jobs in the banking sector, military, construction industry, Aviation etc. And you know our government don't like where they will spend money, they will start dropping human service and replacing them with AI machines. AI is a danger that is coming up gradually. When our jobs are taken away the rate crimes will increase in our society. There was a report I saw somewhere that Robots was seen controlling traffic in Lagos, I don't know how truth that is but soon it will take over. But I am happy that such machines don't have a space here in bitcointalk. Personally I don't like AI technology.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Makus",
      "created_time": "November 19, 2023, 03:23:42 PM",
      "body": "To talk the major truth, ai na one of the thing wey dey make our students of nowadays lazy well well, just like wattin Justbillywitt talk say this matter no be only for the educational sector e for dey worry, e dey also affect almost every part of our live. E get one seminar wey I partake concerning Ai projects for the engineering field and wattin dem been dey tell us na be say, dem wan use Ai take replace human being for their work, just imaging the kind of disaster wey dem dey plan, yes e fit make their calculation dey more accurate oo, I give Ai that credit but dem go first gats sack people papa from work first and by so doing dem dey increase unemployment rate for the country. Then when we talk about the educational sector, students of nowadays na soso AI text generator dem take dey write their school project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "November 19, 2023, 03:43:20 PM",
      "body": "I can't say anything about the use of AI in the present day educational system. But that can still be controlled by lecturers if they really want to do that. In my days, internet was there but we didn't rely on the internet but we read to accumulate knowledge and passed all the papers. But ChatGTP is a new technology that come to the educational system and it is very fast in producing answers so students are now relaxing in their houses and submit home work and browse in exam halls. As we don talk am before, ChatGTP or AKA AI e no go fit take over human position. There are many stories to narrate on this matter but make we no go there for now but in some other days. The students dey use AI from e every thing because the lecturers themselves are very lazy to cross check students work. Now look at it. AI only produce one answer and if a lecturer give a question in exam and he checked the question in AI and anyone who uses AI he will know . And Mark those ones according to the AI answer. And list those names so next time students will not do it again. And another one again AI brain is not expanded so there is no way im go take over human brain. Human think wider and robot or AI think. Human brain is still the best.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Amphenomenon",
      "created_time": "November 19, 2023, 07:31:37 PM",
      "body": "Quote from: Jamestown70 on November 19, 2023, 11:08:16 AMNigerian higher institution student now lack the zeal to read and do a proper research because of ai presently now ai is now the Messiah to many Nigerian students which I see as a threat if not is been done the thing about it is that most of the time it pops out wrong answers mean while if you did not study it will think it's correct, Nigerian student before now we're known to be very very intelligent not minding our semi failed educational system we have here its very easy for Nigeria's to bag first class and many other honors outside Nigeria because we do study hard for it but I doubt in 10 years time if we will be able to say this again because of the high rate of student turning to this Ai thing basically I see it helpful a little bit but I will still encourage you to still  study so you wouldn't be taken unaware with wrong answers.This is not entirely true, Nigerian students have always been like this some have always been serious (and still is) while others have always been using underlying means (examination malpractice) to pass exams including Waec and higher institutional exams. Also some institutional students sometimes may go and buy research, projects or seminar topics instead of the doing it themselves and miss the main essence of the research, project or seminar.  All these have been existing before the adoption of AI, using AI doesn't mean you are not studying and even in researching without AI, there are chances of getting false information on the site you visit. That is why it is always advisable not to just accept anything just because a site, someone or Ai said its correct (you need to verify from other sources before accepting it) when doing your own research which is not just constraining to bitcoin or crypto investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Miles2006",
      "created_time": "November 19, 2023, 09:16:13 PM",
      "body": "AI standing as a threat to Nigeria education system sounds funny, op is actually right, students nowadays use AI to pass exams, Assignments, projects. But let's look at those students grade, check well those students using AI for exams their grade no better pass other student grade, I don observe this thing tire even students who are involved in examination malpractice their grade no better pass other student grade, one thing with a brilliant child when you're brilliant you're brilliant you don't need an AI to pass exams and assignment.I see AI as a modern technology there's nothing bad with Ai the primary purpose of AI is to make decision and perform human task but cannot take the place of humans. Most students use the internet for research to acquire more knowledge that's not bad. But why people dey abuse AI, the wrong use of AI dey very bad and risky cause we cannot put all our trust on a robot and AI. Just like what you mentioned and students dey really make use of AI during Assignment but before AI come student dey buy knowledge with money so without AI students go still get another source, for me any student wey dey use AI or money to pass exam or project na dull student.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rachael9385",
      "created_time": "November 19, 2023, 09:20:59 PM",
      "body": "Quote from: Jamestown70 on November 19, 2023, 11:08:16 AMNigerian higher institution student now lack the zeal to read and do a proper research because of ai presently now ai is now the Messiah to many Nigerian students which I see as a threat if not is been done the thing about it is that most of the time it pops out wrong answers mean while if you did not study it will think it's correct, Nigerian student before now we're known to be very very intelligent not minding our semi failed educational system we have here its very easy for Nigeria's to bag first class and many other honors outside Nigeria because we do study hard for it but I doubt in 10 years time if we will be able to say this again because of the high rate of student turning to this Ai thing basically I see it helpful a little bit but I will still encourage you to still  study so you wouldn't be taken unaware with wrong answers.The use of an A.I is becoming so alarming in our society today and I believe it is making so many students, as you already said, be lazy in terms of learning and also writing text or in exams, which is not a good idea to do so.I can show a photo of an A.I. am on my WhatsApp. I normally use it, mostly when I am confused or am bored, because it keeps me company most times.If you read clearly, you will see our discussion.I am not against the use of an A.I, people should use it in a good way and not abuse it (like using it to cheat at school).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbamoni",
      "created_time": "November 19, 2023, 10:11:06 PM",
      "body": "AI is the new advance technology, and it has been adopted by so many individuals in various countries. I don't see it as something that will hinder education rather something that will improve and facilitate the process of learning in our country. I am certain if someone is not educated, he/she cannot use any AI tool. I take someone who has knowledge on how to use the internet and the AI tools. Student use AI for negative reasons but as well there are some students who use it in a positive way. They use it to make more research on a particular topic without having to surf the internet for a long time. The AI tool has access to all the permitted information's on the internet and makes it easier for one to ask and get those answers.Quote from: rachael9385 on November 19, 2023, 09:20:59 PMQuote from: Jamestown70 on November 19, 2023, 11:08:16 AMNigerian higher institution student now lack the zeal to read and do a proper research because of ai presently now ai is now the Messiah to many Nigerian students which I see as a threat if not is been done the thing about it is that most of the time it pops out wrong answers mean while if you did not study it will think it's correct, Nigerian student before now we're known to be very very intelligent not minding our semi failed educational system we have here its very easy for Nigeria's to bag first class and many other honors outside Nigeria because we do study hard for it but I doubt in 10 years time if we will be able to say this again because of the high rate of student turning to this Ai thing basically I see it helpful a little bit but I will still encourage you to still  study so you wouldn't be taken unaware with wrong answers.The use of an A.I is becoming so alarming in our society today and I believe it is making so many students, as you already said, be lazy in terms of learning and also writing text or in exams, which is not a good idea to do so.I can show a photo of an A.I. am on my WhatsApp. I normally use it, mostly when I am confused or am bored, because it keeps me company most times.If you read clearly, you will see our discussion.I am not against the use of an A.I, people should use it in a good way and not abuse it (like using it to cheat at school). Before this AI came out a lot of students were still using other means to cheat in the examination hall and other way, I don't know why we now put all the blames on the AI. Anyone who is going to cheat will do it whether AI or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samlucky O",
      "created_time": "November 19, 2023, 11:05:21 PM",
      "body": "Quote from: rachael9385 on November 19, 2023, 09:20:59 PMQuote from: Jamestown70 on November 19, 2023, 11:08:16 AMNigerian higher institution student now lack the zeal to read and do a proper research because of ai presently now ai is now the Messiah to many Nigerian students which I see as a threat if not is been done the thing about it is that most of the time it pops out wrong answers mean while if you did not study it will think it's correct, Nigerian student before now we're known to be very very intelligent not minding our semi failed educational system we have here its very easy for Nigeria's to bag first class and many other honors outside Nigeria because we do study hard for it but I doubt in 10 years time if we will be able to say this again because of the high rate of student turning to this Ai thing basically I see it helpful a little bit but I will still encourage you to still  study so you wouldn't be taken unaware with wrong answers.The use of an A.I is becoming so alarming in our society today and I believe it is making so many students, as you already said, be lazy in terms of learning and also writing text or in exams, which is not a good idea to do so.I can show a photo of an A.I. am on my WhatsApp. I normally use it, mostly when I am confused or am bored, because it keeps me company most times.If you read clearly, you will see our discussion.I am not against the use of an A.I, people should use it in a good way and not abuse it (like using it to cheat at school).My brother this matter wey ona bring here na serious matter o. The rate of exam malpractice using Ai no be small thing. But sometimes I no dey too blame the students. Because when I been dey school, no matter wetting you write for exam, lectural go collect sorting. although no be all but %80 of them. The government no dey treat the lecturers well, and oyibo man say na were person dey work naim him dey chop. But as Nigeria na fail project according to one of our thread, naim cause the problem when government fail to treat lecturers well them no also care to how the students do all what dey need na money. You do your thing I do my thing we go our ways naim wetting school don turn. Wetting I dey try talk be say our lecturers naim dey help our Nigerian youth to do malpractice, because emagine you wey Sabi book like mad go write exam finish but because you no buy lecturer hand-out and also no pay for sorting him nak you carry over, how you go take use your brain to write exam again. you go see am as pointless to read again when people wey dey do malpractice dey get 4.3 CGPA and you wey Sabi book they come out with lower class how you go take focus to read? Were as your money and malpractice go push you. Nigeria curruption dey affect every sector of the economy. Even to graduate for School now don be problem. Emagine person wey enter school at the age of 25year due o strike you ft graduate when you don't reach 33 to 34 years. my brother if you check am well you no go blame the students o. Because even people wey dey rule us no even Sabi rulership. no be bad thing to use AI, but make e no come become habit because if e don master you even 1+1 you go wan ask AI.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DubemIfedigbo001",
      "created_time": "November 20, 2023, 06:34:57 PM",
      "body": "From my perspective, AI is an asset to the Nigerian student rather than a tragedy. The same people that now use AI for their assignments, projects and examinations blindly are the people that use human AI ( pay fellow students) earlier to get those things done. AI helps us a lot in researches, its a research tool and not a delivery tool. Its so sad that people know very well how to abuse things.But let's be honest, its easy to spot write-ups direct from AI. Intelligent and hardworking Lecturers whom go through students assignments or tests before awarding marks wastes no time in marking down script suspected to be powered directly by AI. Its Easy to detect, the way AI organizes answers and the grammatical construction is near perfect and no human brain, talkless of students under exam condition can exhibit such expertise within the short exam time frame. Its just so sad that most lecturers are careless and this now gives rise to the abuse of AI. If These erring students are constantly failed and punished, others will be discouraged in its usage. Just like the forum here made up of hard working people whom will point out its use even before you finish posting it and there's severe consequences to that which has led to members avoiding it at all costs. If this can be replicated in our education system, I'm sure we wouldn't be having this discussion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Orpichukwu",
      "created_time": "November 20, 2023, 07:22:26 PM",
      "body": "The use of AI for educational purposes is good so far. What I can say is that the technology comes with advantages and disadvantages. Those who want to use it will choose what they can use it for, and it is not the fault of the developers or the technology but that of the person who has chosen to use it in whatever way they want. I have come across testimonials of people who have been able to pass some exams and pass through some interviews as a result of using the AI to study and prepare themselves for exams. There are also students who have been using it for easy examination malpractice. Even when they said mobile is restricted, they still find a means to smuggle it, which is their own personal problem and not that of the AI. For my own personal view, the use of AI can help a fast learning system. I have used it for school assignments a few times, which was helpful, and it also provided me with some mathematical solutions to some issues. This is the way I have chosen to make use of it, so the educational system if being affected is not because of AI, but because the student's not wanting it to be better and finding it lazy to read with or without it. There has always been malpractice in the Nigerian educational system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "November 20, 2023, 07:45:07 PM",
      "body": "AI has made life easy for students because they are not longer in that pressure on how to make researches and how to do their own academy assignments on their own. What I know id that as long as it is not an online exam, it will be hard for students to cheat with AI. Examination malpractise is what cannot be stopped when the educational system is corruptThere are ways that you will put your question that AI wouldn't be able to generate the right answer to that question because it is confusing. Although from my observation AI has made many student lazy because they know how to get their assignments and project work done easily but that doesn't mean that when it comes to human brain work to think and discuss that AI can do that. If lectures finds out that students uses AI to pass their exam, the he should give them an oral test on the topic. I think that it is only an online exam that can be written by AI.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rachael9385",
      "created_time": "November 20, 2023, 08:27:29 PM",
      "body": "Quote from: Orpichukwu on November 20, 2023, 07:22:26 PMThe use of AI for educational purposes is good so far. What I can say is that the technology comes with advantages and disadvantages. Those who want to use it will choose what they can use it for, and it is not the fault of the developers or the technology but that of the person who has chosen to use it in whatever way they want. Wonderful talk, this nah the main Koko, and as you talk am nah so e dey, especially we way be Nigerians, we like to dey abuse things because we they misuse things they way wey be say those way even create am self no imagine am to be, like the way you talk am already, everybody get watin em won use the AI for, some pipo dey mostly use am do bad things like to they cheat for school during exam and text, while some they use am for good purpose like to do their own research Incase of any thing way them find difficult, and still many pipo dey use an for both good and bad.QuoteI have come across testimonials of people who have been able to pass some exams and pass through some interviews as a result of using the AI to study and prepare themselves for exams. There are also students who have been using it for easy examination malpractice. Even when they said mobile is restricted, they still find a means to smuggle it, which is their own personal problem and not that of the AI.I love AI because it make things easier for us, mostly we students, I am not saying this because I am abusing it by using it to cheat at school.However, you can browse about ELO MUSK or click here to know about him, this guy has an  AI sunglasses that can  perform extremely nice for everyone, now imagine how that sunglasses can cost, with that sunglasses you can ask of anything that is on the internet and you will get the exact things you are looking for at Google.QuoteFor my own personal view, the use of AI can help a fast learning system. I have used it for school assignments a few times, which was helpful, and it also provided me with some mathematical solutions to some issues. This is the way I have chosen to make use of it, so the educational system if being affected is not because of AI, but because the student's not wanting it to be better and finding it lazy to read with or without it. There has always been malpractice in the Nigerian educational system.Moreover, I think we blacks are always lazy of reading, so it is not a new thing if most of us are using an AI at school in terms of learning and we shouldn't use it to cheat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Makus",
      "created_time": "November 21, 2023, 05:30:02 AM",
      "body": "Well said mr DubemIfedigbo001 its so sad knowing that even our Nigerian lecturers also help in the promotion of Ai unknowingly by not doing their duties properly, you see when we talk about corruption in our country, we are talking about everything inside the  country, meaning nothing is left out. And because of this same corruption many lecturers seem to just use this opportunity to extract money from their student without proper check on their writings. This things dey vex me well well because I get broder wey dey complain almost every week say dem wan buy this and that or dem wan pay for something, las las dem go graduate and dem go still tag university as school wey no get good educational quality. We no say AI come to help us oo, but the abuse naim be the thing wey dey very bad wey we dey do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hewlet",
      "created_time": "November 22, 2023, 05:35:21 AM",
      "body": "Quote from: Jamestown70 on November 19, 2023, 11:08:16 AMNigerian higher institution student now lack the zeal to read and do a proper research because of ai presently now ai is now the Messiah to many Nigerian students which I see as a threat if not is been done the thing about it is that most of the time it pops out wrong answers mean while if you did not study it will think it's correct, Nigerian student before now we're known to be very very intelligent not minding our semi failed educational system we have here its very easy for Nigeria's to bag first class and many other honors outside Nigeria because we do study hard for it but I doubt in 10 years time if we will be able to say this again because of the high rate of student turning to this Ai thing basically I see it helpful a little bit but I will still encourage you to still  study so you wouldn't be taken unaware with wrong answers. What you should understand is that good things can get into the wrong hands and abuse become totally inevitable. For the students that know what they are doing, AI is an added advantage to them while studying and for some critical questions you might not be able answer, if you bring it to Chatgp for instance, you might just get some guide that will help you understand it. Those that use AI in the exams have always involved themselves in exams malpractice before AI even can on board so they only saw a better way of involving in there malpractice. Personally, the AI has been of great help to me both while I was in school and even now that I have joined the circular society. Sometimes I might have an idea that I want to develop but it might not be all that refined and organised at first sight what I do is that I just go to the AI and communicate the idea to it and get response from it and I add whatever additional information it has given me to what I already know. If we embrace the benefit and good things that technology brings, we will know that it is definitely here for our good and not the other way round.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "November 22, 2023, 09:10:46 PM",
      "body": "Quote from: Jamestown70 on November 19, 2023, 11:08:16 AMNigerian higher institution student now lack the zeal to read and do a proper research because of ai presently now ai is now the Messiah to many Nigerian students which I see as a threat if not is been done the thing about it is that most of the time it pops out wrong answers mean while if you did not study it will think it's correct, Nigerian student before now we're known to be very very intelligent not minding our semi failed educational system we have here its very easy for Nigeria's to bag first class and many other honors outside Nigeria because we do study hard for it but I doubt in 10 years time if we will be able to say this again because of the high rate of student turning to this Ai thing basically I see it helpful a little bit but I will still encourage you to still  study so you wouldn't be taken unaware with wrong answers.Just like they say, \"there two sides to a coin\" I think the same applies to the use of Ai to Nigerian students and as long as the world keeps changing in terms of technological advancement then such things are bound to happen for example, several decades ago when there were no search engines like Google and the likes of them, as we now have them you would notice that people depended more on books for information and to also carry out research, but that is not the case anymore as it is far more easier than it's used to be to get information or to do a research, so rather than criticize the system one should look at the brighter side and the advantage and ease that accompanies Ai. Under British standard phones are allowed in classrooms during lectures so a student log into the internet to get information during classes, what an innovation having information at your finger tips, in as much as the risk of getting wrong information in the process, I think Ai is one the best innovation of the 21century.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "November 23, 2023, 08:14:53 PMLast edit: November 23, 2023, 08:54:46 PM by CryptoHeadlineNews",
      "body": "Quote from: Jamestown70 on November 19, 2023, 11:08:16 AMNigerian higher institution student now lack the zeal to read and do a proper research because of ai presently now ai is now the Messiah to many Nigerian students which I see as a threat if not is been done the thing about it is that most of the time it pops out wrong answers mean while if you did not study it will think it's correct, Nigerian student before now we're known to be very very intelligent not minding our semi failed educational system we have here its very easy for Nigeria's to bag first class and many other honors outside Nigeria because we do study hard for it but I doubt in 10 years time if we will be able to say this again because of the high rate of student turning to this Ai thing basically I see it helpful a little bit but I will still encourage you to still  study so you wouldn't be taken unaware with wrong answers.This month will be making it a complete one year since the famous A.I chatbot tool ChatGPT-3.5 developed by OpenAI got launched in November 2022, and hence made research very easy, which could be done in few seconds. So if our university students might have decided not to take studies serious simply because of the presence of A.I which they could use in providing solutions to questions on few seconds, when it comes to writing promotional exams is a moment that will tell if a student have been reading or not, as it will always tell on the outcome of the result. Note: A.I were created to be a tool of last resort while making research, and not to be the primary tool.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Youngkhngdiddy",
      "created_time": "November 24, 2023, 07:53:34 PM",
      "body": "Quote from: Jamestown70 on November 19, 2023, 11:08:16 AMNigerian higher institution student now lack the zeal to read and do a proper research because of ai presently now ai is now the Messiah to many Nigerian students which I see as a threat if not is been done the thing about it is that most of the time it pops out wrong answers mean while if you did not study it will think it's correct, Nigerian student before now we're known to be very very intelligent not minding our semi failed educational system we have here its very easy for Nigeria's to bag first class and many other honors outside Nigeria because we do study hard for it but I doubt in 10 years time if we will be able to say this again because of the high rate of student turning to this Ai thing basically I see it helpful a little bit but I will still encourage you to still  study so you wouldn't be taken unaware with wrong answers.   What's been the most recent act of students is the reliance on AI tools in most schools works, tests, assignments and exams. It's not the educational systems fault though because it's just a clear evidence that technology is most definitely gradually taking over the space. Although the system is poor and way behind the standard and most recent guideline of education in the world and there really has to be an upgrade. In their defense, I bet that it's not just Nigerian students that make use of AI tools for their school work but the issue is Nigeria students have over maximized it's use that they now feel so lazy to sit back and think for themselves, the solutions to every problem from school as an assignment or test or exam.   They put their full reliance on AI and as always, AI saves the day. The school's system is poor no doubt which on the other hand causes this full reliance on AI, if Nigeria's education should focus a higher percentage of their energy on practical examples, I believe the students would have more insight on the knowledge trying to be passed on to them. But the absence of this practical real life examples, just leaves them to imagining possibilities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}