{
  "id": "topic_5410904",
  "title": "Market Spaace",
  "author": "Market Spaace",
  "created_time": "August 23, 2022, 08:37:27 AM",
  "content": "Hi guys,Market Spaace is a mobile app where people can buy and sell physical goods with cryptocurrency. The platform is currently being trailed as a private BETA in Melbourne, Australia, and we are looking to market the platform to the wider Australian public. While you can sell any (legal) item, we focus on these categories:Luxury items (Gucci, Prada, Burberry)Electronics & Crypto miners (Currently have PS5 for retail price on the platform)CBD Products (CBD oils for example)Soon we will be selling luxury properties and rentals as well. Our team includes: CEO & CTO, Advisors, COO, Growth strategist, and some devs. We're looking for a marketer/marketers who can help us market our platform to the wider public. Our site will be undergoing a lot of changes in the coming weeks (in terms of branding as well as removing features such as crypto cloud mining) but you can learn more here: www.marketspaace.com",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410904",
  "comments": [
    {
      "author": "Little Mouse",
      "created_time": "August 23, 2022, 09:01:39 AM",
      "body": "I can see \"Earn up to 8% APY on crypto asset\". May I know what's that referring to? As you are a marketplace, where's the connection between that and offering APY and also cloud mining. It’s not a good example IMO.On a side note- Why are you only focusing on Australian GEO? You can target globally or have plan in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "August 23, 2022, 01:23:09 PM",
      "body": "- You were unlucky to choose a domain name, repeating a letter is not a good thing even if the domain name is unique. - There is no F.A.Q page - Can you prove your address[]? Or provide any data such as a commercial register, tax number and others. - Terms of use page[1] is general and not for a company that has a real commercial registry.[] 84 Altona Street, Melbourne, Victoria 3031[1] https://marketspaace.com/terms-and-condition",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Market Spaace",
      "created_time": "August 23, 2022, 02:04:04 PM",
      "body": "Quote from: Little Mouse on August 23, 2022, 09:01:39 AMI can see \"Earn up to 8% APY on crypto asset\". May I know what's that referring to? As you are a marketplace, where's the connection between that and offering APY and also cloud mining. It’s not a good example IMO.On a side note- Why are you only focusing on Australian GEO? You can target globally or have plan in the future.Hey yes, thanks for asking. The APY is for helping users to earn and then can put that towards purchases on our platform or cash out to bank account. As for cloud mining, yes agreed, we are actually removing that feature, it was originally part of one of the ways we helped users to earn earnings, similar to APY, but we agreed it was too complicated (hence why it won't be displayed on site soon). As for Australian GEO, yes planning to open in other countries soon but due to compliances requirements and platform complexities, handling in Australia first. Quote from: hugeblack on August 23, 2022, 01:23:09 PM - You were unlucky to choose a domain name, repeating a letter is not a good thing even if the domain name is unique. - There is no F.A.Q page - Can you prove your address[]? Or provide any data such as a commercial register, tax number and others. - Terms of use page[1] is general and not for a company that has a real commercial registry.[] 84 Altona Street, Melbourne, Victoria 3031[1] https://marketspaace.com/terms-and-conditionHi there! Yup our site will be undergoing lots of maintenance soon, FAQ and terms is part of what will be updated in the coming weeks, this site was just a placeholder.As for the company information feel free to take the company name at the bottom of the site and a Google search will give you the info you need or I can PM you any further details you need  Do let me know if either of you guys are or know marketers",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "August 23, 2022, 06:29:27 PM",
      "body": "Quote from: Market Spaace on August 23, 2022, 02:04:04 PMAs for cloud mining, yes agreed, we are actually removing that feature, it was originally part of one of the ways we helped users to earn earnings, similar to APY, but we agreed it was too complicated (hence why it won't be displayed on site soon). cloud mining, seriously? I still see that option on the siteyou offer a lot here, but in fact, you offer almost nothing. if we ignore cloud mining (although that has already marked you as suspicious and prone to fraud), on the basis of which you promise \"up to 8% APY on crypto assets and use for purchases or bank cashout\"? how will you provide that interest?Quotemore than 50% cheaper than typical seller fees charged by eBay, Amazon and Etsy.how accurate is that, are there any defined conditions?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Market Spaace",
      "created_time": "August 23, 2022, 11:26:29 PM",
      "body": "Quote from: examplens on August 23, 2022, 06:29:27 PMQuote from: Market Spaace on August 23, 2022, 02:04:04 PMAs for cloud mining, yes agreed, we are actually removing that feature, it was originally part of one of the ways we helped users to earn earnings, similar to APY, but we agreed it was too complicated (hence why it won't be displayed on site soon). cloud mining, seriously? I still see that option on the siteyou offer a lot here, but in fact, you offer almost nothing. if we ignore cloud mining (although that has already marked you as suspicious and prone to fraud), on the basis of which you promise \"up to 8% APY on crypto assets and use for purchases or bank cashout\"? how will you provide that interest?Quotemore than 50% cheaper than typical seller fees charged by eBay, Amazon and Etsy.how accurate is that, are there any defined conditions?Hi man, I mentioned in the first message on the thread, we are updating our website in the coming weeks (there's lots of things to update, because the entire site is being updated, it's not cloud mining alone that is changing on the site) and this feature won't be one we're advertising, because we're not going ahead with it.Our listing of our site here isn't for public launch & promotion, it's more so to give an idea of what we're doing/working up to, to any potential marketers because we are looking for marketers. Currently we're in the process of fundraising for our startup, and should close our round soon, which is another reason why we're looking for potential hires. The interest is provided by our payments provider actually, they are a well established presence in crypto & payments, if you want more details, PM me I'll give you the details.As for the seller fees yes it's accurate, no defined conditions here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "August 24, 2022, 03:06:06 PM",
      "body": "Quote from: Market Spaace on August 23, 2022, 02:04:04 PMAs for cloud mining, yes agreed, we are actually removing that feature, it was originally part of one of the ways we helped users to earn earnings, similar to APY, but we agreed it was too complicated (hence why it won't be displayed on site soon). You still haven't removed the cloud mining. This is a big No for genuine crypto investors when they see it, especially this statement \"we also offer cloud mining to mine Bitcoin from your phone. \"We both know it's not possible for anyone to mine ETH using a phone not to mention BTC.I will advise you to put a loyalty reward for users of your ecosystem instead of cloud mining.Having said that, most e-commerce always comes from up to the bottom. What's the plan for your ecosystem to prevent this?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fortunecrypto",
      "created_time": "August 24, 2022, 03:21:47 PM",
      "body": "Since you are looking to target a specific country then a social media group or sites specific to Australia is where you should offer your service and products, the lack of team information is a big question who are the people running this project, you can't be anonymous if you are offering products like smartphone and other items, and you want to follow big marketplace like Amazon?QuoteWe wish to stand as an alternative to eBay and Amazon and provide a simple, fresh, fun, new way to trade online.You cannot be like them if you cannot tell people your capability and your credentials",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trooover",
      "created_time": "August 24, 2022, 10:37:35 PM",
      "body": "Hey man! I just saw your message about advisoring about the marketing, clients and revenue of the projectMy name is Roman, I?m working with marketing for the destiny. I?m working with marketing, influencers and sales for my entire life. We made 5.5m$ if revenue from our online-products in one year. The whole marketing is built by me. And soon I?ll go to Asia crypto week with my friends, so I could introduce your product to big boys.Let?s discuss what can we do together. Text me in telegram https://t.me/trooover",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}