{
  "id": "topic_5447454",
  "title": "execijutiere",
  "author": "execijutiere",
  "created_time": "April 03, 2023, 08:34:36 PM",
  "content": "Binance CEO'su CZ için kırmızı bülten çıkarıldığı söylentileri var.https://twitter.com/whalechart/status/1642983142494724097Binance’da yatırımı olanlar dikkat etsin",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447454",
  "comments": [
    {
      "author": "Bthd",
      "created_time": "April 03, 2023, 11:04:24 PM",
      "body": "Quote from: execijutiere on April 03, 2023, 08:34:36 PMBinance CEO'su CZ için kırmızı bülten çıkarıldığı söylentileri var.https://twitter.com/whalechart/status/1642983142494724097Binance’da yatırımı olanlar dikkat etsinŞimdilik saçma bir söylentiden fazlası değil gibi görünüyor. Cobie'nin yayınladığı hash üzerinden dalga dalga yayılmış olsa da bunu geç kalmış 1 Nisan şakası olarak nitelendirirse kimse gülmeyecek. Kesin olmayan bir bilgiyi bu şekilde yayıyor olmak doğrudan manipülasyon olduğu için Cobie'de çeşitli suçlamalarla karşı karşıya kalabilir. Borsada para tutanlar her zaman dikkatli olmak zorunda fakat dikkatsiz olan kişiler. Dikkatli olmaları için interpolün CZ'yi aramasına gerek yok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "execijutiere",
      "created_time": "April 03, 2023, 11:07:50 PM",
      "body": "Quote from: Bthd on April 03, 2023, 11:04:24 PM interpolün CZ'yi aramasına gerek yok. Interpol CZ’yi arıyormuş da CZ açmıyormuş telefonu yeni şarj etmiş https://twitter.com/cz_binance/status/1643016206083936262",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "April 04, 2023, 03:12:30 PM",
      "body": "şu an fud ya da 1 nisan şakası olarak bakıyor insanlar ama genelde böyle bir boktan espri sonrası olaylar gerçeğe dönüşüyor. ha interpol tarafından aransa böyle elini kolunu sallaya sallaya rahat dolaşmaz. en azından ben böyle düşünüyorum. (mutlaka rahat gezenler ile ilgili örnek vardır.) borsada vurkaç yaptığım az bir para var ama sonunda onu da bana çektirecekler. olan yine benim döner parama olacak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "April 05, 2023, 02:40:52 AM",
      "body": "iddianın sıcaklığı söz konusuyken uyarıcı olmak amacıyla böyle bir başlık açmanız doğru ama olayın kofti olduğu ortaya çıktı. yani, bence başlığı düzenlerseniz hem kriptopara yatırımcıları açısından faydalı olur hem de kötü niyetli kişiler tarafından dolaşıma sokulmuş asılsız bir iddianın yayılmasına dolaylı yoldan katkı sunmamış olursunuz. beleşe cz avukatlığı yapmak gibi bir amacım yok, birkaç bnb verse de onun avukatlığını yapmam ama iddialar büyük oranda yalan çünkü interpol'ün listesinde cz için oluşturulmuş bir kayıt yok. https://www.interpol.int/en/How-we-work/Notices/View-Red-Notices",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}