{
  "id": "topic_5418876",
  "title": "Fishy001",
  "author": "Fishy001",
  "created_time": "October 30, 2022, 11:22:35 PM",
  "content": "Fucking love this game. Always play maximum bet numbers 28 29 30 31 32 34 35 36.I hit first time 36 with their maximum bet and won 150 usd.Wgat are your favorute numbers?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418876",
  "comments": [
    {
      "author": "yahoo62278",
      "created_time": "October 31, 2022, 12:05:41 AM",
      "body": "https://bitcointalk.org/index.php?topic=5418798.0 What happened to you quitting? It hasn't even been a week yet since you said you were quitting. Guess I was right and you need the attention.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fishy001",
      "created_time": "October 31, 2022, 12:34:51 AMLast edit: October 31, 2022, 12:48:09 AM by Fishy001",
      "body": "Quote from: yahoo62278 on October 31, 2022, 12:05:41 AMhttps://bitcointalk.org/index.php?topic=5418798.0 What happened to you quitting? It hasn't even been a week yet since you said you were quitting. Guess I was right and you need the attention... respect me . I dont need the attention.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "October 31, 2022, 12:54:16 AM",
      "body": "Congrats on the wins 150 is still alot to some and any win counts imo, roulette gives such big pay outs but also high risk I would tend to agree its best to be careful and take some off the table to keep good habits.  If you intend to cut down for this year I think sports betting is the ideal place for disciplined bets vs odds etc.  Money management is the game within the game.   I watch people play Roulette and it makes my head spin too lol  despite the pacing they give to players, its moving too fast to fully enjoy or figure out which numbers I want to place as Im too indecisive but to watch its ok.  My only advice is to pay any bills off before you gamble and play the game so any win or loss is free and clear for you.   Keep crypto separate, I think it can have that advantage from gambling plain cash",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chato1977",
      "created_time": "October 31, 2022, 12:57:51 AM",
      "body": "Quote from: Fishy001 on October 31, 2022, 12:34:51 AMQuote from: yahoo62278 on October 31, 2022, 12:05:41 AMhttps://bitcointalk.org/index.php?topic=5418798.0 What happened to you quitting? It hasn't even been a week yet since you said you were quitting. Guess I was right and you need the attention... respect me . I dont need the attention.Why edit your post?  when you said that you did not mean totally quitting gambling and just with High risk? but it does not sounds like when you created the recent post hereQuote from: Fishy001 on October 30, 2022, 06:20:54 AM Huge profit decide to quit gambling until 2023.so maybe we will respect you when you only make post with true meaning than just making successful gambling bets but not putting complete details with Photos of your wins.I respect your post of course , but had some clues about what had Yahoo says .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fishy001",
      "created_time": "October 31, 2022, 12:58:47 AMLast edit: October 31, 2022, 01:18:42 AM by Fishy001",
      "body": "Quote from: STT on October 31, 2022, 12:54:16 AMCongrats on the wins 150 is still alot to some and any win counts imo, roulette gives such big pay outs but also high risk I would tend to agree its best to be careful and take some off the table to keep good habits.  If you intend to cut down for this year I think sports betting is the ideal place for disciplined bets vs odds etc.  Money management is the game within the game.I watch people play Roulette and it makes my head spin too lol  despite the pacing they give to players, its moving too fast to fully enjoy or figure out which numbers I want to place as Im too indecisive but to watch its ok.  My only advice is to pay any bills off before you gamble and play the game so any win or loss is free and clear for you.   Keep crypto separate, I think it can have that advantage from gambling plain cash. Fron today im free of debts. Gambling allow you more freedom and new source of income to solve problems and pay your debts.Also Pass your time. Connect with new people at the cazino and have fun.Roullete my favorite game before 1 week i didnt know to play",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Heartilly",
      "created_time": "October 31, 2022, 01:23:34 AM",
      "body": "Quote from: Fishy001 on October 30, 2022, 11:22:35 PMFucking love this game. Always play maximum bet numbers 28 29 30 31 32 34 35 36.I hit first time 36 with their maximum bet and won 150 usd.Wgat are your favorute numbers?Next time, discussions like that are more appropriate to post here:https://bitcointalk.org/index.php?board=228.0Congratulations on the win though. I will assume you made that winning in a physical casino, right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitterguy28",
      "created_time": "October 31, 2022, 03:18:55 AM",
      "body": "I love roulette , I keep trying to win big but not that luck as OP , Congrats mate and I have been seeing your continues wins in this section , sometimes I think you are not just lucky but you truly understand gambling?   anyway sharing strategy will help us also to earn from your  luck",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "October 31, 2022, 04:15:36 AM",
      "body": "I just commented on your previous thread about pausing to gamble and I thought you’d have enough profit already, well that’s gambling it’s really hard to quit especially if you are winning. Congrats for another win anyway better not to say that you will stop to gamble until the end of he year because it seems that you can’t commit on that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "October 31, 2022, 04:32:28 AM",
      "body": "Quote from: yahoo62278 on October 31, 2022, 12:05:41 AMhttps://bitcointalk.org/index.php?topic=5418798.0 What happened to you quitting? It hasn't even been a week yet since you said you were quitting. Guess I was right and you need the attention.You mean, a day. It wasn't even a day since his last thread and now sharing his winnings like not understanding the temporary quitting until 2023 is.I mean that's really great, a win is always great, sharing it and hearing people congratulates you. Just don't make look yourself like a fool, talking like quitting then here again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "October 31, 2022, 04:52:52 AM",
      "body": "Yeah, I thought you quit by anyhow, congrats to your win.Me? I just bet on the red and black usually. However, if I wanted to get that 1:36 win, then I usually bet numbers around 0, take note its single 0 and not the 00 because it's harder to win as the odds is higher.And you mentioned though that this is your first time to play roulette? so probably beginners luck, I guess.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "October 31, 2022, 04:58:40 AM",
      "body": "As expected, once a person tasted the sweetness of victory he will always comeback no matter how he planned to quit.  Quote from: Fishy001 on October 31, 2022, 12:58:47 AM. Fron today im free of debts. Gambling allow you more freedom and new source of income to solve problems and pay your debts.I quite agree if you are in the green but once a series of red hits you, I don't know if you can still say this line.  Congratulation on the win, I hope you continue to get the upper hand but don't be swayed by the illusion that gambling is a stable source of income or profit.  There is always this law of average, if that hits you I wish it won't be that devastating.Quote from: crzy on October 31, 2022, 04:15:36 AMI just commented on your previous thread about pausing to gamble and I thought you’d have enough profit already, well that’s gambling it’s really hard to quit especially if you are winning. Congrats for another win anyway better not to say that you will stop to gamble until the end of he year because it seems that you can’t commit on that. I also commented on that thread but I assume that it was a temporary quitting but it hasn't been a week and @OP is already engaged in gambling.  So I guess his statement is good for quitting that session not entirely the whole days left of 2022.Quote from: Fishy001 on October 30, 2022, 06:20:54 AM Huge profit decide to quit gambling until 2023.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "October 31, 2022, 05:55:09 AM",
      "body": "If it weren't for the OP occasionally posting proof of his bets, I'd say he makes up all the stories while I eat Doritos and drink Monster in his mum's basemen.Quote from: Fishy001 on October 31, 2022, 12:34:51 AMQuote from: yahoo62278 on October 31, 2022, 12:05:41 AMhttps://bitcointalk.org/index.php?topic=5418798.0 What happened to you quitting? It hasn't even been a week yet since you said you were quitting. Guess I was right and you need the attention.. respect me . I dont need the attention.Sure, sure, that's why you're always telling us about your life and your bets.Haven't you ever played poker before? We need fish like you, there are not many at the tables nowadays.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fishy001",
      "created_time": "October 31, 2022, 06:08:10 AMLast edit: October 31, 2022, 06:26:08 AM by Fishy001",
      "body": "Quote from: Poker Player on October 31, 2022, 05:55:09 AMIf it weren't for the OP occasionally posting proof of his bets, I'd say he makes up all the stories while I eat Doritos and drink Monster in his mum's basemen.Quote from: Fishy001 on October 31, 2022, 12:34:51 AMQuote from: yahoo62278 on October 31, 2022, 12:05:41 AMhttps://bitcointalk.org/index.php?topic=5418798.0 What happened to you quitting? It hasn't even been a week yet since you said you were quitting. Guess I was right and you need the attention.. respect me . I dont need the attention.Sure, sure, that's why you're always telling us about your life and your bets.Haven't you ever played poker before? We need fish like you, there are not many at the tables nowadays.I dont play poker is a game for boring ass players like you.I make my money fast i. Mma fightd Roullete or blackjack and quit for hookers night. not stay hours and fold 200 hands .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "October 31, 2022, 06:12:13 AM",
      "body": "Quote from: Fishy001 on October 31, 2022, 06:08:10 AMI dont play poker is a game for boring ass players like you.I make my money fadt i. Roullete or blackjack and quit not stay hours and fold 200 hands.Sure, sure, you make money in EV- games. What is clear from what you say is that sometimes you have played online, because that is what happens today, the tables are very tight, people multitable and if they do not get good hands they fold, fold and fold again. This in turn, causes fish like you to not have a good experience and find the game boring, so they go to play roulette or other games to \"win\" money. Typical.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fishy001",
      "created_time": "October 31, 2022, 06:14:58 AMLast edit: October 31, 2022, 06:32:14 AM by Fishy001",
      "body": "Quote from: Poker Player on October 31, 2022, 06:12:13 AMQuote from: Fishy001 on October 31, 2022, 06:08:10 AMI dont play poker is a game for boring ass players like you.I make my money fadt i. Roullete or blackjack and quit not stay hours and fold 200 hands.Sure, sure, you make money in EV- games. What is clear from what you say is that sometimes you have played online, because that is what happens today, the tables are very tight, people multitable and if they do not get good hands they fold, fold and fold again. This in turn, causes fish like you to not have a good experience and find the game boring, so they go to play roulette or other games to \"win\" money. Typical. i bet that i can beat you in 1-1 in poker too. Pm me and we can arrange game in 7xl ill whoop your ass and  i will lill your entire banlroll from you.Im good in poker judt find it boring. But ill love to take your money and post another victory.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "October 31, 2022, 07:01:54 AM",
      "body": "I'm not a person who plays roulette often because it's a luck based game where I rarely win.But you are very lucky to play gambling and I think maybe you are someone who often gets lucky in gambling games. But I hope you are not too happy with the results you get because there will be times when you get lost and usually, the defeat will only get bigger if you can't control yourself.Congratulations on your win in the game of roulette and I hope you can withdraw the winnings and enjoy it with your friends.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "October 31, 2022, 07:22:32 AM",
      "body": "Quote from: Fishy001 on October 31, 2022, 12:34:51 AMQuote from: yahoo62278 on October 31, 2022, 12:05:41 AMhttps://bitcointalk.org/index.php?topic=5418798.0 What happened to you quitting? It hasn't even been a week yet since you said you were quitting. Guess I was right and you need the attention... respect me . I dont need the attention.Well I guess for those who have replied to his thread, we says that it's going to be hard for him to quit.Congrats though, I also bet on roulette from time to time, and again, from what I said in the past, it's the quadrant that I bet. For example, numbers like 5,10,23,24, then 11,36,13. Usually that is the number that I bet.Sometimes corner number, column bet, and then classic Black or Red.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "October 31, 2022, 07:33:21 AM",
      "body": "Quote from: Fishy001 on October 31, 2022, 12:34:51 AMQuote from: yahoo62278 on October 31, 2022, 12:05:41 AMhttps://bitcointalk.org/index.php?topic=5418798.0 What happened to you quitting? It hasn't even been a week yet since you said you were quitting. Guess I was right and you need the attention... respect me . I dont need the attention.He's right on the first and on the second you cannot quit and you need attention, where's the proof so we'll not question your intention that you just need attention, better edit your first discussion that you cannot quit, it's very rare for gamblers to quit when they won a huge amount, I bet there will be more posts about your experience because you love it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "October 31, 2022, 09:00:20 AM",
      "body": "I've never played roulette but it's nice to hear you're back to playing gambling as you said in the previous thread will stop gambling, I expected as a true gambler there is no stopping as long as luck and victory are still on our side, congratulations on your victory",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}