{
  "id": "topic_5403678",
  "title": "Symmetrick",
  "author": "Symmetrick",
  "created_time": "June 22, 2022, 08:02:00 PMLast edit: November 30, 2023, 01:03:57 AM by Symmetrick",
  "content": "ㅤ",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403678",
  "comments": [
    {
      "author": "coupable",
      "created_time": "June 22, 2022, 08:12:45 PM",
      "body": "According to what I think, this was expected to happen with the approaching date of the next halving, which will undoubtedly represent the expected occasion for the price to recover.The issue of losing confidence in Bitcoin after its price collapse seems to me an unrealistic idea because Bitcoin is not Luna or any other centralized network. Then, the market takes advantage of bearish periods to have an opportunity to acquire more of bitcoin and to invest in it. Also the investment opportunity to be open to a larger number of users, while periods of recovery represent the season of taking profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "June 22, 2022, 09:13:21 PM",
      "body": "Quote from: Ratimov on June 22, 2022, 08:02:00 PMAre you ready to see $10,000 Bitcoin this year or early next year?If you would have been asking in April, I would have been saying \"no, this time it's different, you know...\"Now I would not be surprised if the price falls to 10k this year. Next year it should be at least at 20k though.At least this is how I read the historical data.But: this time the ATH was not so high and we even had two ATH and maybe, just maybe, the low will not be as low as it used to be. Just thinking... or hoping?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "June 22, 2022, 09:49:38 PMLast edit: June 22, 2022, 10:12:23 PM by stompix",
      "body": "Quote from: Ratimov on June 22, 2022, 08:02:00 PMAre you ready to see $10,000 Bitcoin this year or early next year?Hmm, I'm living on the second floor, and just right in front I've planted a few lilac trees that will cushion the jump, I don't have any drugs and pills other than some aspirin and some from indigestion (small kid in the house so we avoid storing these), no rope, no soap, no gun permit...really not prepared.But, there are 874 job openings around me as I browse the section now, including at the bitcoin's most beloved fast-food chain Mcdonald's, so bring it on!  Quote from: Ratimov on June 22, 2022, 08:02:00 PMBut those same people have apparently never analyzed bitcoin historical data..In this capitulation event, bitcoin only fell (I don't know if it's appropriate to say this when it comes to such a loss in value ) by 73%.Statistics or percentages, you can play with them how you want depending on what you want to achieve. For example, Bitcoin dropped from $32 to $2, in that drop $210 million in possible wealth turned into $14 million, right now, well, just $900 billion evaporated from the Lambo dreams. A rough math says something like ~5000x more theoretical profits gone?   So, which one was worse?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0ne",
      "created_time": "June 22, 2022, 10:09:34 PM",
      "body": "I've prepared myself to experience any level of market decline. For now the market have been growing within specific limits. The price have been in hard fluctuation and after such fluctuation there is more of decline than progress in the market. This indicates that the price will crash further.This major drop can happen as a long term process. However this year we'll experience it, it it is to happen. The falling year we can expect regular growth considering the halving that is being scheduled for the year 2024",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "June 22, 2022, 10:52:57 PM",
      "body": "More likely we might see this price late this year or mid next year.And so why not? another good buying opportunity right? Although this might be a record low as we haven't seen the price going down way low than the previous all time high but we did see in already. So I wouldn't be surprised if we touch on this level in this bear market. We've been talking about \"super cycle\", wherein the price could go high and breaking the 4 year cycle. But we should be taking into account \"super bear cycle\", like this one, if the price hits $10k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "June 22, 2022, 11:27:48 PM",
      "body": "Quote from: n0ne on June 22, 2022, 10:09:34 PMI've prepared myself to experience any level of market decline. For now the market have been growing within specific limits. The price have been in hard fluctuation and after such fluctuation there is more of decline than progress in the market. This indicates that the price will crash further.This major drop can happen as a long term process. However this year we'll experience it, it it is to happen. The falling year we can expect regular growth considering the halving that is being scheduled for the year 2024Same here, been saying that we are in a bear market already since January so we should expect the worst. Maybe there will be some that don't want to accept if we go this low, but we should prepare ourselves for the worst as this is too early to see the price decline -70% from our all time high last November last year. So there is a possibility that we will see the price going low that $17k and it's possible that a further crash to $10k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelvinid",
      "created_time": "June 22, 2022, 11:27:58 PM",
      "body": "I don't feel like I'm ready but if that will come, I humbly accept the truth and huge deduction of my holding. However, this never makes me cry and worried coz I don't make a stupid sell option rather than sit back and off my notification from crypto. But, I don't even think about $10k by now - I don't make myself too negative yet. We're getting low again after in a short uptrend, kinda be moving back low possible to $18k first, then $15k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "June 22, 2022, 11:55:08 PM",
      "body": "If your mind is conditioned to expect fall, you're ready. With $10.000/BTC, the more whales are bound to become bigger as retail investors will be compelled to sell particularly to those who bought believing the speculation to bounce quickly.I'm more into believing that $17.000 was the bottom. If it dives to $13.000, it will quickly recover back to $20.000 in a week or two. The question is will you buy back if it happens this year because its a long way still going to halving date. And anything can happen as recession comes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "June 23, 2022, 01:53:46 AM",
      "body": "Same as you my guess is 10K, there is huge support there if the price break the 10K i dont know what next but the think is crypto bear will happen for long long time atleast after halving    but what i hope is atleast we go 30K first so we can take profit a little",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "June 23, 2022, 02:24:34 AM",
      "body": "Quote from: Kelvinid on June 22, 2022, 11:27:58 PMI don't feel like I'm ready but if that will come, I humbly accept the truth and huge deduction of my holding. However, this never makes me cry and worried coz I don't make a stupid sell option rather than sit back and off my notification from crypto. I guess this is what the purpose of this thread, to remind us specially those who can't accept it. The possibility is there that the price will go on a downward spiral to $10k.Quote from: dansus021 on June 23, 2022, 01:53:46 AMSame as you my guess is 10K, there is huge support there if the price break the 10K i dont know what next but the think is crypto bear will happen for long long time atleast after halving    but what i hope is atleast we go 30K first so we can take profit a little $8k might be the next support. But yeah, we still have 6 months before the end of 2022. Maybe we will see the price bouncing back first to $30k. And then last 2 months we might see it free falling again up to next year and one more leg down for us to see in the $10k range.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "June 23, 2022, 03:10:43 AM",
      "body": "I think a great indicator that we might not see $10K and perhaps bottomed at $17K is seeing all these $10K predictions all over bitcointalk and Twitter.Back when we were at $69K, people were calling for $100K and now at $20K people are calling for $10K. Most likely the herd will be wrong and it will bottom out before that somewhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "June 23, 2022, 03:14:10 AM",
      "body": "I can only hope that we're going to get further market wipeouts. I can stack at better prices, and more useless cryptocurrencies die out.I'm really clueless though. I'd say there's a good chance that we've bottomed if we're in normal market conditions, but macro's kinda bad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "June 23, 2022, 03:17:19 AM",
      "body": "Yeah, $10,000+ if ever we will experience the around -85% loss from its all-time-high.But my hope is the 2013 drop, which is not reached above -80%.For me, the loss we experience right now which is already -73% is already huge. Today is already different from the past, volume and other companies are already here, and trading volume is already huge right now which to me is really different from the previous bear market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "June 23, 2022, 04:33:37 AM",
      "body": "Ready not ready I have to be prepared, because anything can happen to bitcoin and if the bitcoin price continues to fall and reach below 15k, there is a possibility that 10k will materialize.and there's nothing to worry about if that happens because I can't do anything about it either, let alone do something stupid to sell it that I didn't have in mind.maybe what i'm ready to do is have a lot of patience and also make a few more buys and hope 10k is the lowest price and if it keeps going down i'll leave it for a while and come back once there's any sign of improvement. And I also still believe bitcoin will bounce back and I think this is just a test of how hard I can wait and be patient.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "June 23, 2022, 07:48:38 AM",
      "body": "Quote from: GreatArkansas on June 23, 2022, 03:17:19 AMYeah, $10,000+ if ever we will experience the around -85% loss from its all-time-high.That drop could be a dream (for those who wanted to buy more cheap and discounted bitcoin again), or a nightmare, wanted to buy but no capital to begin with, cringe worthy moment as it once in a life time offer.Quote from: GreatArkansas on June 23, 2022, 03:17:19 AMBut my hope is the 2013 drop, which is not reached above -80%.For me, the loss we experience right now which is already -73% is already huge. Today is already different from the past, volume and other companies are already here, and trading volume is already huge right now which to me is really different from the previous bear market.For me it's still the miners though, if they are selling right now then it's a bad indication that we might really haven't seen the bottom yet and possible to see $10k even if everyone is onboard (government, whales, institutional investors...)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lornadane",
      "created_time": "June 23, 2022, 10:01:25 AM",
      "body": "Kalou I wouldn't be prepared to see the price of bitcoin fall too far like that.$10k is a terrible bitcoin price for me.There will be many investors who feel they have lost their money if the price of bitcoin drops to the point of $ 10 thousand and of course they will be torn apart again.Hopefully the worst thing will never happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kadal Ijo",
      "created_time": "June 23, 2022, 10:01:27 AM",
      "body": "In order not to be stressed and depressed we must be prepared with all conditions, when we buy Bitcoin, the thing we think is profit and loss, the last time I bought Bitcoin is when the price is around $ 24700, many experts believe that at that time it was the lowest price, but the price continued to drop Although now it rises again, if one day the price drops below $ 10k, of course I'm ready, the first thing is when the price is $ 15k then I will sell 75% My Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "June 23, 2022, 10:54:28 AM",
      "body": "Quote from: Kadal Ijo on June 23, 2022, 10:01:27 AMIn order not to be stressed and depressed we must be prepared with all conditions, when we buy Bitcoin, the thing we think is profit and loss, the last time I bought Bitcoin is when the price is around $ 24700, many experts believe that at that time it was the lowest price, but the price continued to drop Although now it rises again, if one day the price drops below $ 10k, of course I'm ready, the first thing is when the price is $ 15k then I will sell 75% My Bitcoin.Not really know how much you invested on Bitcoin, but selling 75% of your coins if it touch $15K isn't sound a wise idea since Bitcoin high unlikely died or goes below $10K and so on. I'm more optimism the price would slightly recover and we might see another dump, this called as a bull trap. But you need to consider if it's okay to sell at $15K since it's your right with your coins.Quote from: adaseb on June 23, 2022, 03:10:43 AMI think a great indicator that we might not see $10K and perhaps bottomed at $17K is seeing all these $10K predictions all over bitcointalk and Twitter.I still think the bottom might be $13K-$15K if it's happen, I'm not expecting it will dump till $10K since it's too far.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "June 23, 2022, 11:33:45 AM",
      "body": "Quote from: lornadane on June 23, 2022, 10:01:25 AMKalou I wouldn't be prepared to see the price of bitcoin fall too far like that.$10k is a terrible bitcoin price for me.There will be many investors who feel they have lost their money if the price of bitcoin drops to the point of $ 10 thousand and of course they will be torn apart again.Hopefully the worst thing will never happen.It would only be terrible for people that have been over-invested and have no capital for buying dips. On the other hand, if you're always making sure you have enough capital to deploy, a crash to $10,000 would be a godsend if you're long-term bullish on bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}