{
  "id": "topic_5519850",
  "title": "kotajikikox",
  "author": "kotajikikox",
  "created_time": "November 19, 2024, 02:48:50 AM",
  "content": "Robert Kennedy Jr. says he has put most of his wealth into bitcoin. He was once running to be the president as third party but later on withdrew and joined to support Trump instead. If anyone is to be praised for being pro-bitcoin, it should be him. He’s been advocating for bitcoin even before the campaign.What I really like about this guy is that he said he bought each of his children 2 bitcoins. Not only is he investing for his future but also for the future of his children. I also would reach a point where I can afford to buy my children at least a bitcoin each. He says he’s fully committed to bitcoin. This means he believes in it as much as he says. No hesitation. What about you, did you put most of your money into bitcoin too? What are your thoughts about buying your children bitcoins as well?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5519850",
  "comments": [
    {
      "author": "jcojci",
      "created_time": "November 19, 2024, 04:25:32 AM",
      "body": "No, I don't invested most of my money in Bitcoin because I still needs that money to fills my daily needs and for other urgent situations. I only use some portion of my saving to invests in Bitcoin because that is what I can afford. I know having Bitcoin as the main investment will be the best thing that I can do but I need to be ready with anything that can happen such as worst economic situation which can makes every needs increase of the price. But I prepare some Bitcoins for my children and their future so they can use that when they are grow up including to survive if the situation really becomes worsen than now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "November 19, 2024, 04:41:58 AM",
      "body": "I think it’s a great idea to start investing in Bitcoin for future generations. But, like any investment, it requires careful consideration and planning. I personally haven’t gone as far as putting most of my wealth into Bitcoin, but I’m certainly exploring ways to integrate it into my portfolio in a balanced way. It’s about finding that sweet spot between security and growth, while also educating future generations on how to manage these types of assets.I think the decision to commit to Bitcoin, whether for yourself or your children, comes down to your own convictions and financial goals. But it’s hard to ignore the potential long-term benefits of integrating Bitcoin into your wealth-building strategy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helena Yu",
      "created_time": "November 19, 2024, 04:47:00 AM",
      "body": "Where's actually his address? he's a popular person, there's no way for him to stay anonymous.I'm also fully committed in Bitcoin, if not 100%, we could say 99% because the 1% is fiat, for me to buy something or pay bills in my country. I don't like to give \"money\" as a gift,  it's pointless and this will make people can't appreciate your gift, instead they judge your gift based on how much the money you spent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoBuds",
      "created_time": "November 19, 2024, 05:33:29 AM",
      "body": "I also saw this news yesterday and this makes me more confident that the Trump administration will be a crypto friendly administration and the future of crypto will be better under him. Not only Robert Kennedy Jr, the Trump administration has a lot of politicians who support bitcoin and that is a good thing we expect. To be honest I am investing most of my money in bitcoin but not all, I still keep some money in the bank for emergencies and daily expenses. Currently, I have no intention of diversifying into other assets because my capital is not large and I don't think diversification will be good for my situation. As for using bitcoin as an inheritance for children, I think anyone who invests in bitcoin has thought about this even if they don't have children yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Japinat",
      "created_time": "November 19, 2024, 07:07:17 AM",
      "body": "He claims he invested most of his wealth in Bitcoin but reports show his investment is only between $100,001 and $250,000.... When you compare that to his $15 million net worth, it’s just 1.6% at most. So, how is that \"most of his wealth\"?Honestly, I don’t trust this guy. https://beincrypto.com/robert-kennedys-bitcoin-holdings-conflict-interest-debate/QuoteRobert Kennedy Bitcoin Holdings Under the MicroscopeKennedy’s recent financial disclosure that his family holds bitcoin in a brokerage account has created a conflict of interest debate. A report by CNBC recently revealed that his investments are valued between $100,001 and $250,000. Robert F. Kennedy, Jr. has an estimated net worth of $15 million, according to Forbes. 1",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maslate",
      "created_time": "November 19, 2024, 07:34:15 AM",
      "body": "Quote from: Japinat on November 19, 2024, 07:07:17 AMHe claims he invested most of his wealth in Bitcoin but reports show his investment is only between $100,001 and $250,000.... When you compare that to his $15 million net worth, it’s just 1.6% at most. So, how is that \"most of his wealth\"?Honestly, I don’t trust this guy. https://beincrypto.com/robert-kennedys-bitcoin-holdings-conflict-interest-debate/QuoteRobert Kennedy Bitcoin Holdings Under the MicroscopeKennedy’s recent financial disclosure that his family holds bitcoin in a brokerage account has created a conflict of interest debate. A report by CNBC recently revealed that his investments are valued between $100,001 and $250,000. Robert F. Kennedy, Jr. has an estimated net worth of $15 million, according to Forbes. 1Those amounts refer to what's in his brokerage account. The latest update is that he bought 2 Bitcoins each for his 7 kids, bringing his total to 14 BTC. At $91,000 per Bitcoin, that's $1,274,000. However, it's still not the majority of his wealth invested in Bitcoin. So he hasn't really put most of his wealth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "November 19, 2024, 07:59:34 AM",
      "body": "I simply want to remind everyone that Bitcoin is not a magic that fights inflation. I'll tell you how the price goes up, to be sure that it's not some sort of magic. When you invest, when I invest, when millions of people invest in a small, limited pool (I mean 21 Million supply), the price goes up but once we start cashing out, the price will go down. The one who cash outs Bitcoin, is the winner.If the USA invests in Bitcoin in order to repay its debt, this is what will happen in reality. The USA invests in Bitcoin, millions of people also invest in Bitcoin, some other countries invest in Bitcoin. Now there is a big pool of money, the USA decides to cash out Bitcoins and receive fiat, the price will significantly fall but the USA will receive its money. Do you wanna know what happened in reality? The USA took your money, the money that you invested. People can do the same if they cash out before the USA cash outs.So, I want to say that Bitcoin won't automatically fight inflation, it's impossible. When there is a winner, there is a loser, that's the balance in nature.Quote from: jcojci on November 19, 2024, 04:25:32 AMNo, I don't invested most of my money in Bitcoin because I still needs that money to fills my daily needs and for other urgent situations. I only use some portion of my saving to invests in Bitcoin because that is what I can afford. I know having Bitcoin as the main investment will be the best thing that I can do but I need to be ready with anything that can happen such as worst economic situation which can makes every needs increase of the price. But I prepare some Bitcoins for my children and their future so they can use that when they are grow up including to survive if the situation really becomes worsen than now.I'm on a boat with you. I'd really love to invest most of my money in Bitcoins but that's not possible because I still need some savings in cash. Bitcoin is volatile, if there is an emergency case, I would not wish to be the one who bought when price was high and sold when the price was low but at the moment I'm changing this situation for better or for worse because I believe that the Bull market is here, it's not going down anytime soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fikrett",
      "created_time": "November 19, 2024, 09:32:11 AM",
      "body": "Quote from: Synchronice on November 19, 2024, 07:59:34 AMI simply want to remind everyone that Bitcoin is not a magic that fights inflation. I'll tell you how the price goes up, to be sure that it's not some sort of magic. When you invest, when I invest, when millions of people invest in a small, limited pool (I mean 21 Million supply), the price goes up but once we start cashing out, the price will go down. The one who cash outs Bitcoin, is the winner.If the USA invests in Bitcoin in order to repay its debt, this is what will happen in reality. The USA invests in Bitcoin, millions of people also invest in Bitcoin, some other countries invest in Bitcoin. Now there is a big pool of money, the USA decides to cash out Bitcoins and receive fiat, the price will significantly fall but the USA will receive its money. Do you wanna know what happened in reality? The USA took your money, the money that you invested. People can do the same if they cash out before the USA cash outs.So, I want to say that Bitcoin won't automatically fight inflation, it's impossible. When there is a winner, there is a loser, that's the balance in nature.I agree with you, albeit, it will be done in such a way that the price won't be going that low on a whim of the US and others - it will be done with regulations intact, so that BTC won't become something that is just manipulated by the fingers of those big guys in the suits  But, surely - as time goes on, more and more big influential people with the bags ready are seeing what BTC may give them - stability and prosperity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "john_egbert",
      "created_time": "November 19, 2024, 09:35:41 AM",
      "body": "Quote from: Synchronice on November 19, 2024, 07:59:34 AMQuote from: jcojci on November 19, 2024, 04:25:32 AMNo, I don't invested most of my money in Bitcoin because I still needs that money to fills my daily needs and for other urgent situations. I only use some portion of my saving to invests in Bitcoin because that is what I can afford. I know having Bitcoin as the main investment will be the best thing that I can do but I need to be ready with anything that can happen such as worst economic situation which can makes every needs increase of the price. But I prepare some Bitcoins for my children and their future so they can use that when they are grow up including to survive if the situation really becomes worsen than now.I'm on a boat with you. I'd really love to invest most of my money in Bitcoins but that's not possible because I still need some savings in cash. Bitcoin is volatile, if there is an emergency case, I would not wish to be the one who bought when price was high and sold when the price was low but at the moment I'm changing this situation for better or for worse because I believe that the Bull market is here, it's not going down anytime soon.It is surely not going down before the correction starts Surely, to get into BTC and crypto as a whole - more funds are needed, those funds that are big enough to gain something from them and so that if you lose some of them, you wouldn't feel it affecting your daily life. We all play that game to gain the most knowledge and profit from the crypto space, so let's do it responsibly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "November 19, 2024, 10:40:22 AM",
      "body": "Quote from: kotajikikox on November 19, 2024, 02:48:50 AMHe says he’s fully committed to bitcoin. This means he believes in it as much as he says. No hesitation. What about you, did you put most of your money into bitcoin too? What are your thoughts about buying your children bitcoins as well? If you believe in Bitcoin, you need to invest your capital in Bitcoin first, invest for yourself. If possible, you can reserve part of your bitcoin for your children. It's your bitcoin first, and when time comes, it's your bitcoin like their inheritance from you.I don't see right idea to buy bitcoin for your children, while I am unsure that you are a Bitcoin investor or not, and whether you manage your finance well and healthy enough. Because if your individual and family finance is not too good, it's hard to avoid touching these bitcoins, either yours or your children. If you are a Bitcoin investor, you need to only invest money you can afford to lose it, and reserve money for other things like bills, emergency because you and your family surely need it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "November 19, 2024, 10:54:30 AM",
      "body": "I don't know if he truly bought BTC for his children, but it is good to teach your children about finance, even if you don't buy them BTC, they should understand finance and different types of investment, of which BTC is one of them. I don't know much about Robert Kennedy Jr, but if he says he has put most of his wealth in BTC, then that is his choice, i don't care if he is telling the truth and it is even good publicity for BTC either way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "November 19, 2024, 11:07:16 AM",
      "body": "Quote from: kotajikikox on November 19, 2024, 02:48:50 AMRobert Kennedy Jr. says he has put most of his wealth into bitcoin. He was once running to be the president as third party but later on withdrew and joined to support Trump instead. If anyone is to be praised for being pro-bitcoin, it should be him. He’s been advocating for bitcoin even before the campaign.What I really like about this guy is that he said he bought each of his children 2 bitcoins. Not only is he investing for his future but also for the future of his children. I also would reach a point where I can afford to buy my children at least a bitcoin each. He says he’s fully committed to bitcoin. This means he believes in it as much as he says. No hesitation. What about you, did you put most of your money into bitcoin too? What are your thoughts about buying your children bitcoins as well? I'm a little bit of skeptical here, yeah he might say that he is fully committed on Bitcoin but I doubt that he has put most of his fortunes on BTC. Sometimes we really have to take with a grain of salt of what this politicians do, just to be in power, they will say everything very positive to attract media and so they will be sensationalized in the news. It's good if he is speaking truthfully, but I for me, nah, he could be a pro-Bitcoin without putting all his money on it.As for his children that is good to hear. I mean even us regular and average but educated investors know that Bitcoin could be used as a inheritance, so if we have investment already, we can withdraw some for the education of our children.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "November 19, 2024, 11:20:59 AM",
      "body": "Quote from: Z-tight on November 19, 2024, 10:54:30 AMI don't know if he truly bought BTC for his children, but it is good to teach your children about finance, even if you don't buy them BTC, they should understand finance and different types of investment, of which BTC is one of them. I don't know much about Robert Kennedy Jr, but if he says he has put most of his wealth in BTC, then that is his choice, i don't care if he is telling the truth and it is even good publicity for BTC either way.Do you know his year of birth and the age of his children? Judging by the information on the Internet, he should have not only children but also grandchildren. Six children who once had two bitcoins each? His children have long been self-sufficient people, capable of making their own decisions about the benefits of Bitcoin. The future of children should worry parents; this is undeniable, but I doubt that this candidate has all his funds transferred to Bitcoin. Such statements always get a lot of fans who blindly follow their idols.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BABY SHOES",
      "created_time": "November 19, 2024, 11:54:06 AM",
      "body": "Quote from: jcojci on November 19, 2024, 04:25:32 AMNo, I don't invested most of my money in Bitcoin because I still needs that money to fills my daily needs and for other urgent situations. I only use some portion of my saving to invests in Bitcoin because that is what I can afford. I know having Bitcoin as the main investment will be the best thing that I can do but I need to be ready with anything that can happen such as worst economic situation which can makes every needs increase of the price. But I prepare some Bitcoins for my children and their future so they can use that when they are grow up including to survive if the situation really becomes worsen than now.Same... that I also do not invest all savings in bitcoin, but invest in bitcoin defensively and this is part of the income in bitcoin so this is a long-term plan.No matter how bad it is fiat we still need it for daily needs ... this cannot be denied that fiat is still very much needed, while bitcoin as an investment that expects long-term profits.Currently still not planning to buy bitcoin for children, this is still small so he doesn't know anything about bitcoin ... I am more focused on building this investment also for the future of children.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "November 19, 2024, 11:58:05 AM",
      "body": "Quote from: lovesmayfamilis on November 19, 2024, 11:20:59 AMDo you know his year of birth and the age of his children? Judging by the information on the Internet, he should have not only children but also grandchildren.Like i said earlier, i don't know much about RFK Jr, but checking the internet now, i see that he is 70 years old, so his children are not young, and yeah he has grandchildren. Even if his children do not understand BTC or care about it, they would surely not reject it if their father offers to give it to them, they can even sell it immediately after receiving it.Quote from: lovesmayfamilis on November 19, 2024, 11:20:59 AMThe future of children should worry parents; this is undeniable, but I doubt that this candidate has all his funds transferred to Bitcoin. Such statements always get a lot of fans who blindly follow their idols.I also doubt that he transferred most of his wealth into BTC, but who cares, it is good publicity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Finestream",
      "created_time": "November 19, 2024, 12:37:32 PM",
      "body": "Quote from: lovesmayfamilis on November 19, 2024, 11:20:59 AMDo you know his year of birth and the age of his children? All About Robert F. Kennedy Jr.’s 6 Children1- Robert Francis “Bobby” Kennedy III, 402- Kathleen Alexandra “Kick” Kennedy, 363- Conor Richardson Kennedy, 304- Kyra LeMoyne Kennedy, 295- William Finbar “Finn” Kennedy, 266 - Aidan Caohman Vieques Kennedy, 23",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "November 19, 2024, 12:48:03 PM",
      "body": "Quote from: kotajikikox on November 19, 2024, 02:48:50 AMRobert Kennedy Jr. says he has put most of his wealth into bitcoin. He was once running to be the president as third party but later on withdrew and joined to support Trump instead. If anyone is to be praised for being pro-bitcoin, it should be him. He’s been advocating for bitcoin even before the campaign.I remember that there was also someone who had ran for president that likes Bitcoin too, I've forgotten the name of that guy but I think that was Yang. But the same as RKJ, he has withdrawn from the race as well.Quote from: kotajikikox on November 19, 2024, 02:48:50 AMWhat I really like about this guy is that he said he bought each of his children 2 bitcoins. Not only is he investing for his future but also for the future of his children. I also would reach a point where I can afford to buy my children at least a bitcoin each. We can do that to our children and I think the ones that we're saving right now could be meant for them. If we don't spend them for the upcoming days and cycles, it only means that we're saving them for our kids. Those that haven't done yet can DCA.Quote from: kotajikikox on November 19, 2024, 02:48:50 AMHe says he’s fully committed to bitcoin. This means he believes in it as much as he says. No hesitation. What about you, did you put most of your money into bitcoin too? What are your thoughts about buying your children bitcoins as well? We're free not to answer this question so that others won't know if we've invested all that we've got to Bitcoin. But to generically answer that question, I think that most of us did and for our children, maybe we're all going there as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "icalical",
      "created_time": "November 19, 2024, 01:19:48 PM",
      "body": "I personally wouldn't praise any politician, doesn't matter what they said or done about Bitcoin. But since Robert Kennedy Jr, has big platform and many followers, announcing that he gave Bitcoin tho his children could be followed by his follower and this means there will be more people enter into Bitcoin. But that is a big if, whether he is actually doing that, I mean we all know that politician would do anything, and lying is not out of the table. Don't get me wrong, I don't have anything against Robert Kennedy Jr, I am not even a US citizen, I am just concern that Bitcoin community is taken advantage by politician to gain popularity without actually care about Bitcoin or blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzwaafu11",
      "created_time": "November 19, 2024, 01:43:21 PM",
      "body": "Quote from: kotajikikox on November 19, 2024, 02:48:50 AMHe says he’s fully committed to bitcoin. This means he believes in it as much as he says. No hesitation. What about you, did you put most of your money into bitcoin too? What are your thoughts about buying your children bitcoins as well? I invest in bitcoin too, but not most of my money because I have a lot to cover, and also I keep emergency funds in case anything happens. I suppose I have reserved funds that won’t touch my bitcoin investment. Howrvrt bitcoin investment is like a future investment that you won’t be touched anytime soon, so it’s good if he is committed to bitcoin. However, buying bitcoin for my children I feel like is a wise decision because it’s a future investment that you are doing for them ahead of their lives. We believe that bitcoin will be bigger than it’s currently worth right now, which means the children will enjoy their wealth in the future. It’s never a bad idea if we have money and invest for our children.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}