{
  "id": "topic_5477690",
  "title": "Riginac111",
  "author": "Riginac111",
  "created_time": "December 13, 2023, 08:37:30 AM",
  "content": "From the beginning I was wondering why people spam and I have not find any reason, do we think that spamming have any important effects to our account or its something that is being done intentional or unintentional, do we think from the theory of personification  what causes a spamming is when theirs a particular quota that we have to ascertain that make some of us to spam in order to complete our weekly quota or it's something that is being done willingly.Do you know that base on a research and observation in the forum I have not seen a clear advantage of spamming, and I have not seen any new accounts that is not in a signature campaign that is being tag because of spamming or have a challenge of spamming before why?So I think that majorly the people that spam mostly is people that is controlling a numerous of account's and whenever they have a different account's they start writing a low quality post, I don't know if any one have observed that before, that what causes a low quality of posts and spamming might be due to alts, its better time to spread this information so that my own mates in the forum will not have same mindset  of spamming and low writing style.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477690",
  "comments": [
    {
      "author": "Churchillvv",
      "created_time": "December 13, 2023, 08:51:39 AM",
      "body": "Your not alone on this most people have noticed it too and I created a thread in meta board for people express themselves on areas of the forum that is slacking which one of the response that enjoy most was from nutildah where he said almost same thing you have noticed. Quote from: nutildah on December 07, 2023, 05:46:24 AMWell, for starters they should stop creating alt accounts by the dozen. Instead, they should focus on writing quality posts from their main account. Focus on actually learning something so they can actually contribute something of substance. And maybe even improve their financial situation in ways outside of sig campaign earnings. But they won't do it, because they can get away with writing shitposts from 2-4 different accounts and get paid for them. What they don't realize is that the earning potential from one high rank account is worth more than 4-20 low rank accounts, but they don't care; they came here for the easy money, not to work hard or smart.  I think you should have said this there too, spamming is most triggered by trying to meet up with the quota for sig campaigns especially with alts accounts. I wouldn't say much because nultidah has said it all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "December 13, 2023, 08:56:51 AM",
      "body": "I can not generalize all reasons of spam but there are some common reasons likeSpam to meet post quote in bounties that surely do not look for quality of posts from bounty hunters.Spam to troll.Spam with hope to get merit.Spam to fish merit in local communities.Spammers mostly are restricted to rank up by merit system as it was designed for this purpose. They only can rank up if they farm merit, buy merit from dark market or successfully beg merit from merit sources.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obim34",
      "created_time": "December 13, 2023, 09:05:21 AM",
      "body": "Another reason I can come up with is trying to fit in where we are not supposed to, i know for sure am not well acquainted with the knowledge of blockchain and it's network system and if someone is asking a question regarding that aspect I do not need to give any response because I know nothing concerning it but most people will claim to have the knowledge when they have nothing or very little knowledge that is required and go about contradicting the questions being asked and most times go off from the topic being raised.It is better to first get the clearer picture and understanding of what is to be discussed and indulge in it with detail information that is required.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "December 13, 2023, 10:24:08 AM",
      "body": "QuoteWhy do we spam Does it matter at all? The more important question for me is \"why do most forum members not respond to spam?\" If everyone were to report at least 5 posts they consider spam every day, it would quickly become clear to most spammers that such a method of communication is not worth it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ruttoshi",
      "created_time": "December 13, 2023, 11:02:40 AM",
      "body": "Spamming is not done by only forum members in signature campaign but also newbies who want to comment on topics that they have no idea on, because they want to be noticed. It is better that you don't comment on discussion that you have no idea on and let go of it. Sometimes it is better read than post.Spamming is also done to farm merits, but the one that baffles me most are those members with different alts that spam, if they can't make quality post with those alts, it means that they are not qualified to have an alt, so they should only stick to one account to bring out the best in them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "icalical",
      "created_time": "December 13, 2023, 12:41:24 PM",
      "body": "There are two aspects when you are questioning the 'Why?', First is the Motivation, people who just spamming on their post do that to increase their activity count and finally rank-up, (hoping they will get some merits by spamming, which is almost impossible). Now, this motivation seems just like everyone motivation in this forum, to rank up, but then there is the second aspect Reason, tho everyone is motivated to rank up, not everyone want/could do the effort, some are just blatantly lazy and posting spam because they simply don't wan't put some thought or research, the other reason is not every is good enough to deliver their thought into writing form, or most of they time they just have language barrier because English is not their first language. If one of those aspects is not occur in someone minds then they won't be spamming, if they don't have motivation to rank up they won't just spamming, they will still post some weird stuff but it won't be as much as if they are spamming. If they are motivated to rank up, but they aren't lazy even though they have language barrier, they will learn to overcome any obstacle to finally reach the level when they aren't spamming anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "leonair",
      "created_time": "December 13, 2023, 12:42:06 PM",
      "body": "Quote from: Riginac111 on December 13, 2023, 08:37:30 AMFrom the beginning I was wondering why people spam and I have not find any reason, do we think that spamming have any important effects to our account or its something that is being done intentional or unintentional, do we think from the theory of personification  what causes a spamming is when theirs a particular quota that we have to ascertain that make some of us to spam in order to complete our weekly quota or it's something that is being done willingly.Spamming is mainly done by most users without realizing it.  Because they don't know enough about this forum, the posts they make have the appearance of spamming.  Others post too quickly to meet the signature requirement, which is considered spamming.  Spammers don't care if their posts are spamming.  Again there are some users who keep spamming to down this forum.  So everyone's reason for spamming is not always the same",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DYING_S0UL",
      "created_time": "December 13, 2023, 05:18:47 PM",
      "body": "Just click \"Report to moderator\" and move on. Spammers will always spam and there isn't anything anyone can do. There is no \"why do people do this\", \"why do people do that\". They just do. This forum believes in free speech and as long as the privilege to write anything (according to rules) is given to the users, spammers will continue spamming. It's like smoking knowing it causes cancer. So rather than asking \"why\" we should start reporting spams. If you report a decent amount of spams, I can't remember exactly, 350-400 reports maybe, you'll get a statistics where it shows how many of your reports were good, bad or unhandled.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "December 13, 2023, 06:35:46 PM",
      "body": "Quote from: Riginac111 on December 13, 2023, 08:37:30 AMSo I think that majorly the people that spam mostly is people that is controlling a numerous of account'sOnce a person nake a post that is off topic or contains nothing to learn or figure out about, that post should be regarded as spamming, posting indescriminately is termed spamming as well.Spammers don't have time to control alt accounts, some don't even realized that they are spamming, what they do is the reflection of the way they use their normal daily lives.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "December 13, 2023, 06:51:51 PM",
      "body": "Quote from: Riginac111 on December 13, 2023, 08:37:30 AMFrom the beginning I was wondering why people spam and I have not find any reason, do we think that spamming have any important effects to our account or its something that is being done intentional or unintentional, do we think from the theory of personification  what causes a spamming is when theirs a particular quota that we have to ascertain that make some of us to spam in order to complete our weekly quota or it's something that is being done willingly.Hmm, OP I'm not sure about the context of inspiration to discuss this topic but I would like to say that most spamming happens in informational topics because some repetitive content exchange or being in discussion makes it look like spamming, TBH yes people do prefer filling the weekly quota somehow, but the natural content can be identified with the pattern of writing.A natural poster never posts the shity, step-to-step procedural information, he always prefers to guide with his experiences, quoting past events, engaging the discussion mostly. On my end, I try to put forward my view first on any topic, I use some informal sentences as well to engage someone in the discussion, Haha, I know the motive of the topic is to discuss spamming not praising ourselves, but removing ( I & A ) from above can convert it into how to avoid spamming.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "December 13, 2023, 07:24:34 PM",
      "body": "Quote from: Lucius on December 13, 2023, 10:24:08 AMQuoteWhy do we spam Does it matter at all? The more important question for me is \"why do most forum members not respond to spam?\" If everyone were to report at least 5 posts they consider spam every day, it would quickly become clear to most spammers that such a method of communication is not worth it. Mods rarely if ever delete one-liners, posts that add nothing to the conversation or posts with grammar so poor that they are incomprehensible. So many users have given up on reporting anything that is not advertisement spam with links or completely off-topic.And you are right, the motivation behind spam doesn't matter, because we can't change it. Strict moderation is the only solution - those who would get banned once or twice would be more careful or would just leave the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alastantiger",
      "created_time": "December 13, 2023, 11:13:25 PM",
      "body": "People spam for several reasons and some of them are facilitated by the forum.When a thread has past 15 pages and obvious everything reasonable has been discussed. That is there is no new perspective on it but the thread remains open. This will encourage spamming. Signature campaign post requirements which includes bonus pay for extra posts also leads to spamming. Therefore even when you do not want to do it consciously, it is done unintentionally. Newbies spam unintentionally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "December 14, 2023, 01:15:38 PM",
      "body": "Quote from: Riginac111 on December 13, 2023, 08:37:30 AMFrom the beginning I was wondering why people spam and I have not find any reason, do we think that spamming have any important effects to our account or its something that is being done intentional or unintentional, do we think from the theory of personification  what causes a spamming is when theirs a particular quota that we have to ascertain that make some of us to spam in order to complete our weekly quota or it's something that is being done willingly.Spamming means a lot of things and I think it's done intentionally. the forum is a place to interact and share ideas bit when it becomes a plan where people want to do what they like because of the privilege they get, then it becomes so annoying. Like you will see a newbie that is supposed to learn rules, focus on ranking start doing a line of posts and do that frequently just to get people attentions or trill just because he/she thinks the forum has lots of traffic. You will see many of them posts referral links and back links to get traffics to other websites.QuoteDo you know that base on a research and observation in the forum I have not seen a clear advantage of spamming, and I have not seen any new accounts that is not in a signature campaign that is being tag because of spamming or have a challenge of spamming before why?So I think that majorly the people that spam mostly is people that is controlling a numerous of account's and whenever they have a different account's they start writing a low quality post, I don't know if any one have observed that before, that what causes a low quality of posts and spamming might be due to alts, its better time to spread this information so that my own mates in the forum will not have same mindset  of spamming and low writing style.The forum has thousands people coming here, most of the time I think people spam to get others attention to do something like maybe begging since it's a bitcoin forum and money are been discussed, go to the Bounty board where people are paid penny to shit posts, they will do that to suit there agenda for small money that can't do subscribe to any cable.It's because you are focus on ranking, from the rank you will understand when an account is spamming or making an engagement in the Forum. We have plenty of some newbies and from their interactions you will know their worth even without ranking up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "December 14, 2023, 02:07:27 PM",
      "body": "Quote from: Riginac111 on December 13, 2023, 08:37:30 AM I don't know if any one have observed that before, that what causes a low quality of posts and spamming might be due to alts, its better time to spread this information so that my own mates in the forum will not have same mindset  of spamming and low writing style.Even if you have one account you're still going to spam or break the forum rules I have seen countless newbies' useless posts here and posting successive posts or posting malware and plagiarism, if these are alt they know that they can get their account banned, we cannot conclude that because you have an alt account you will spam the forum, its on the posters, and not on circumstances.Spam happens because the poster is in a hurry to make a post without fully understanding the discussions because of this he is off-topic, and he is not reading all the other replies so his post becomes irrelevant to the topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "December 14, 2023, 02:26:02 PM",
      "body": "Quote from: Riginac111 on December 13, 2023, 08:37:30 AMFrom the beginning I was wondering why people spam and I have not find any reason, do we think that spamming have any important effects to our account or its something that is being done intentional or unintentional, do we think from the theory of personification  what causes a spamming is when theirs a particular quota that we have to ascertain that make some of us to spam in order to complete our weekly quota or it's something that is being done willingly.Do you know that base on a research and observation in the forum I have not seen a clear advantage of spamming, and I have not seen any new accounts that is not in a signature campaign that is being tag because of spamming or have a challenge of spamming before why?So I think that majorly the people that spam mostly is people that is controlling a numerous of account's and whenever they have a different account's they start writing a low quality post, I don't know if any one have observed that before, that what causes a low quality of posts and spamming might be due to alts, its better time to spread this information so that my own mates in the forum will not have same mindset  of spamming and low writing style.if you are bother with spams on forum then you can simply click the report to moderator button then report and let the mod handle that issue if they gonna delete it or let those post stay. Also don't get bother with it since those people will gain mainly affected on what they are doing so focus on your own and create more quality post that them since it will give you a lot of advantage since if your post is worth to read then you provably go rank up first than those people who spam in forum.Also you don't need to stress yourself for speculating about that or any scenario that came up on your mind since if you are suspected that person is doing that because of the reason you have mentioned then you have  those threads tackling those issue and maybe its good to discuss all of that matter on the right threads.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "December 14, 2023, 02:50:00 PM",
      "body": "Quote from: Riginac111 on December 13, 2023, 08:37:30 AMSo I think that majorly the people that spam mostly is people that is controlling a numerous of account's and whenever they have a different account's they start writing a low quality post, I don't know if any one have observed that before, that what causes a low quality of posts and spamming might be due to alts, its better time to spread this information so that my own mates in the forum will not have same mindset  of spamming and low writing style.You have to show proof that is the case, you're just speculating you're using the word might, there could be a case like that, but there's also a case of one account who failed to read the rules or does not know the word spam because it's his first time posting in a forum, I'm not taking a side. but if you do not want not to spam the forum take some time to read the flow of the conversion so you'll have an idea of what to post, or better if you do not fully understand the topic just skip.Spam happens because of a lack of understanding about the discussion, more newbies are guilty of spam here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "December 14, 2023, 04:29:07 PM",
      "body": "Quote from: hatshepsut93 on December 13, 2023, 07:24:34 PMMods rarely if ever delete one-liners, posts that add nothing to the conversation or posts with grammar so poor that they are incomprehensible. So many users have given up on reporting anything that is not advertisement spam with links or completely off-topic.I think that the status of our reports depends on at least two factors, the first of which is our assessment of whether something is spam, and the way we report it. The post can be reported as spam, signature spam, low value post, repetitive content - and it is always necessary to provide as much information (links) as possible in the report. Another thing we have to keep in mind is the fact that not all mods have the same opinion about the same thing, which means that some will delete a reported post, while others may mark it as a \"bad report\".Quote from: hatshepsut93 on December 13, 2023, 07:24:34 PMAnd you are right, the motivation behind spam doesn't matter, because we can't change it. Strict moderation is the only solution - those who would get banned once or twice would be more careful or would just leave the forum.I agree, from personal experience I can say that week after week I report posts by the same members who spam one and the same thing, and they are still active, which is definitely something that should not be allowed. Such things can definitely be very discouraging for all those who want to do something good for the forum, so it can seem to them that they are really just wasting their time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "December 14, 2023, 04:31:13 PM",
      "body": "OP's question misses the mark.  Spam's been around as long as folks have been talking on the net.  Spammers will keep on spamming no matter what - and there's nothing can make them quit completely, except maybe making it a pain for them to keep going and  best thing is just tap \"Report to moderator\" and leave it to mods.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "December 14, 2023, 06:02:13 PM",
      "body": "Quote from: Riginac111 on December 13, 2023, 08:37:30 AMSo I think that majorly the people that spam mostly is people that is controlling a numerous of account's and whenever they have a different account's they start writing a low quality post, I don't know if any one have observed that before, that what causes a low quality of posts and spamming might be due to alts, its better time to spread this information so that my own mates in the forum will not have same mindset  of spamming and low writing style.You catch it right, it is one of the many reasons behind people doing spamming here on Bitcointalk. and you don't have to remain in doubt because many cases have been reported before and spamming was the main reason which have helped spam busters to catch them. For example, the writing style, the usage of AI which gives some words or group of words in a pattern that is being used at more than one accounts which indicates that the owner of these two posts might be the same. Doubt like these should not meant to be hundred percent real.Many people have created alternative accounts and tried to do there hard to accept in a campaign and when they selects in one they just try to make posts to fulfill there quota and to do that they make irrelevant posts, or AI generated posts etc. But this is not the only reason behind spamming, many people don't know the rules of this forum and have been caught using single line or single word posts and have given the tag of spamming the forum, and there are those who are only making irrelevant posts or trying phishing attacks on newbies just to earn extra bucks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}