{
  "id": "topic_5454949",
  "title": "yslyv",
  "author": "yslyv",
  "created_time": "June 03, 2023, 08:38:58 AM",
  "content": "Az önce internette gezinirken istenmeyen sms ve aramaların e-devlet üzerinden çok basit bir şekilde engellenebileceğini öğrendim.Bu sonu gelmeyen reklam sms'leri ve zırt pırt gelen aramalar çok rahatsız edici olabiliyor.  Muhtemelen bileniniz vardır ama bilmeyenler için gene de paylaşıyorum. 1. E-devlete giriyoruz2. Arama kısmına \"Ticari Elektronik Yönetim Sistemi\" yazıp aratıyoruz.3. Yeni iletişim adresi ekle diyoruz4. Telefon numaramızı ekleyip gelen onay kodu ile onaylıyoruz.5. \"İletişim Adresi Listesi\" ne tıklıyoruz.6. Gelen listeden istemediğiniz hizmet sağlayıcıları onay düzenle deyip engelliyoruz.Ve artık bizi rahatsız edemiyorlar.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454949",
  "comments": [
    {
      "author": "Hvdv",
      "created_time": "June 03, 2023, 05:16:14 PM",
      "body": "Hocam bu çok değerli konu için teşekkürler. Girip bazı numaraları engelleyen birisi olarak aslında bu tam çözüm değil. Çünkü bu Türkiye’de kayıtlı şirketlerden gelen smsleri engellemek adına faydalı. Bize gelen kaçak iddaa siteleri, kumar siteleri, bilimum rahatsız edici sitelerin hiç biri bu sistemde görünmüyor. Bu yüzden onları hala tek tek engellemek gerekecek",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "June 03, 2023, 05:47:44 PM",
      "body": "Paylaşım için teşekkürler hocam. Bir ara sanki yine böyle bir şey paylaşılmıştı ama unutmuşum. Sizin açtığınız konuyla tekrar bakayım dedim. Önemli bir şey aslında bu. Her gün istemediğimiz numaralardan gelen onlarca SMS ve aramalar yüzünden duyarsızlaşıyoruz. Önemli bir telefon beklerken bir bakıyorsun bu numaralar aramış. Böyle olunca gereken önemi de gösteremiyoruz bizi arayan kişilere. En azından böylece izin yetkisiyle oto kontrolü sağlamış olacağız.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mustang Shelby",
      "created_time": "June 03, 2023, 07:08:35 PM",
      "body": "E devleti aktif olarak kullanmaya başlıyoruz galiba. 2023 senesinde artık bir çok hizmeti e-devlet ile halletmek en doğru hamle olur. Dijitalleşen dünyada e-devlet önemli bir yer ediniyor. Bu uygulamaların sayısı artmalı muhakkak. İstenmeyen bir çok kısa mesajı ve sesli aramayı engellemek bizler için daha rahat bir yaşantı için gerekli olabilecek bir şeydir. Bu hizmeti burada paylaştığınız için teşekkürler hocam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "June 03, 2023, 07:43:44 PM",
      "body": "Bu ilk çıktığında da başlık açılmıştı, ben forumdan öğrenmiştim. https://iys.org.tr/ diye sitesi de var. Şimdi tekrar kontrol ettim ve arama izninin 'Ret' olmasına rağmen beni arayan 3 kurum fark ettim. Örneğin Denizbank. Sms onayı açık, arama ret. Ama hala arıyorlar ve kredi teklif ediyorlar. Tamam kardeşim anladık, istemiyorum kredi mredi.Ayrıca benim gibi Kızılay'dan sms istemeyenler varsa bu iys olayında onun izinlerinin olmadığını görecektir. Yani buradan izni kaldıramıyoruz. Sms atıp da izni kaldıramıyoruz. Sadece çağrı merkezini arayıp müşteri temsilcisiyle konuşup uzun uğraşlar sonucu engelleyebiliyoruz. Ultra saçma bir durum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "June 03, 2023, 07:58:10 PM",
      "body": "Birini engellesek başkası ortaya çıkıp arıyor, günde 10 kere tanımadığımız numaralardan haber alır olduk ya sms atıyorlar ya arıyorlar. Yaz ayları gelince klima bakım onarım için, kışın bahis siteleri üşüşüyor. Bildiğim kadarıyla onlar bu sistem ile engellenemiyor çünkü normal operatörlerden oluşturulmuş numaralar ile aramayı tercih ediyorlar.E-Devlet ne kadar geliştirilirse ve böyle kolaylıklar sağlanırsa o kadar iyi olacak. Bu hizmetlere gerçekten ihtiyacımız var",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yslyv",
      "created_time": "June 03, 2023, 08:04:47 PM",
      "body": "Quote from: püsür on June 03, 2023, 07:43:44 PMBu ilk çıktığında da başlık açılmıştı, ben forumdan öğrenmiştim. ben o başlığı kaçırmışım, bilseydim onu uplardım. E-devlette böyle bir şey olduğunu görünce başlığı açtım hemen  Quote from: xzone on June 03, 2023, 07:58:10 PMYaz ayları gelince klima bakım onarım için, kışın bahis siteleri üşüşüyor. \"telekom altyapısı ile sınırsız fiber internet\" diye başlayan spam aramalarını her hafta istisnasız alıyorum. gına geldi gerçekten.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "June 03, 2023, 09:01:30 PM",
      "body": "Gün içerisinde o kadar çok istemediğim çağrı alıyorum ki bu numara dağıtanlara sövesim geliyor arayanlara değil. Numaralar olduğu için engel yediklerini de biliyorlar düzenli olarak yeni numaralardan arıyorlar en çokta internet alt yapısı için aranıyorum. Engellemekle uğraşırsam daha çok uğraşırım gibi geliyor bana bu yüzden uğraşmam özellikle bir numarayı kafama takarsam o zaman kullanırım herhalde. Bu arada sanki daha önce konusuna denk gelmiştim emin olamadım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "onurgozupek",
      "created_time": "June 05, 2023, 05:47:44 AM",
      "body": "Quote from: yslyv on June 03, 2023, 08:38:58 AMVe artık bizi rahatsız edemiyorlar.Sizi hayal kırıklığına uğratmak istemem ama e-devlette (yani İleti Yönetim Sistemi'nde) yer alan markaların tamamı \"SMS listesinden çıkma\" seçeneğine sahip. Yani IYS olmasa da o markalardan SMS almama imkanınız var.Oysa, bizi asıl rahatsız edenler yasa dışı bahis siteleri, ilaç satıcıları, düşük ölçekli çakma ürün satan e-ticaret siteleri ya da siyasi partiler, politikacılar. Bunları engellemenin bir yolu da yok ne yazık ki...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "June 05, 2023, 05:50:13 AM",
      "body": "Quote from: onurgozupek on June 05, 2023, 05:47:44 AMQuote from: yslyv on June 03, 2023, 08:38:58 AMVe artık bizi rahatsız edemiyorlar.Sizi hayal kırıklığına uğratmak istemem ama e-devlette (yani İleti Yönetim Sistemi'nde) yer alan markaların tamamı \"SMS listesinden çıkma\" seçeneğine sahip. Yani IYS olmasa da o markalardan SMS almama imkanınız var.Oysa, bizi asıl rahatsız edenler yasa dışı bahis siteleri, ilaç satıcıları, düşük ölçekli çakma ürün satan e-ticaret siteleri ya da siyasi partiler, politikacılar. Bunları engellemenin bir yolu da yok ne yazık ki...Bu firmaların çoğu zaten ileti almak istemiyorsanız şunu yaz şuraya yolla şeklinde mesaj sonunda belirtiyorlar hocam haklısınız bu yüzden aslında formalite bir hizmet gibi görülebilir bizi asıl rahatsız edenleri tek tek saymışsınız ve katılıyorum işin kötü yanı artık basit bir mağazada alışveriş yaparken bile sizden kişisel bilgilerinizi paylaşma onayı istiyorlar buna telefon ile başlıyorlar bir kaçıyla tartıştım ben bunu istemiyorum nasıl bize dayatırsınız diye sonra her yerden sms geliyor bıktık vallahi",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}