{
  "id": "topic_5476760",
  "title": "Saheedu",
  "author": "Saheedu",
  "created_time": "December 06, 2023, 12:23:45 PM",
  "content": "I have some coins on an address I created using mycelium wallet and I tried importing it to Trust wallet it worked but my balance was not displaying, I did the same for Exodu wallet and same thing happened. I need your help, which wallet can I use to import address from my mycelium wallet that is going to display my balance for me. I’d have use mycelium but my device is faulty and they don’t have a laptop version making everything more difficult for me to figure out.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476760",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "December 06, 2023, 12:30:48 PM",
      "body": "You need to import the backup seed with the right derivation path.Can you still able to access the Mycelium wallet even if the device is faulty?Because you should be able to find the right derivation path of your address under the balance tab if not try to import your wallet to Electrum wallet.Also, take note it's not a good idea to import your wallet into an online device, and multiple wallet software it's not safe anymore you should transfer them to the new wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "December 06, 2023, 12:41:13 PM",
      "body": "Not my work but a handy guide to importing your seed phrase into electrum: https://medium.com/brute-brothers/step-by-step-guide-restore-your-mycelium-seed-phrase-to-electrum-8b785be1b384Importing your seed into other wallets will be similar they all have a restore seed option.Do not tell anyone your seed / give anyone access to it.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saheedu",
      "created_time": "December 06, 2023, 01:18:28 PM",
      "body": "Quote from: BitMaxz on December 06, 2023, 12:30:48 PMYou need to import the backup seed with the right derivation path.Can you still able to access the Mycelium wallet even if the device is faulty?Because you should be able to find the right derivation path of your address under the balance tab if not try to import your wallet to Electrum wallet.Yes, I can access it. I?ll try and see if I can find the derivative path you talked about if I can?t find it I?ll respond here to let you know. QuoteAlso, take note it's not a good idea to import your wallet into an online device, and multiple wallet software it's not safe anymore you should transfer them to the new wallet.The reason I wanted a new wallet was because of the increase of fee and mycelium does not support lightning network I don?t want to spend $13 for a $30 coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "December 06, 2023, 01:33:15 PM",
      "body": "Quote from: Saheedu on December 06, 2023, 01:18:28 PMThe reason I wanted a new wallet was because of the increase of fee and mycelium does not support lightning network I don?t want to spend $13 for a $30 coin. Even if you import and switch to other wallets that support lightning network you still need to pay a transaction fee when opening a channel and $30 in BTC is not enough to open a lightning channel. Electrum requires 200/msat to open a channel.If I were you I wouldn't make any transactions today because the current network is congested even if you switch to any wallet it will ask for a high transaction fee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "December 06, 2023, 01:59:20 PM",
      "body": "Neither Trustwallet not Exodus is supporting lightning network. Both are also both close source wallet. The are not recommendable.What character did you wallet address start from? Is it 1, 3 or bc1? It can not be bc1. Trustwallet is only supporting bc1.I can recommend you to import your seed phrase on Electrum. If you tell us the character the address start from, we can tell you how to import it on other wallets like Electrum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saheedu",
      "created_time": "December 06, 2023, 02:08:00 PM",
      "body": "Quote from: Charles-Tim on December 06, 2023, 01:59:20 PMNeither Trustwallet not Exodus is supporting lightning network. Both are also both close source wallet. The are not recommendable.What character did you wallet address start from? Is it 1, 3 or bc1? It can not be bc1. Trustwallet is only supporting bc1.I can recommend you to import your seed phrase on Electrum. If you tell us the character the address start from, we can tell you how to import it on other wallets like Electrum.I have seen all three in my mycelium but I used “bc1” to receive my coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "December 06, 2023, 02:24:09 PM",
      "body": "Quote from: Saheedu on December 06, 2023, 02:08:00 PMI have seen all three in my mycelium but I used “bc1” to receive my coin. You supposed to see your coin on Trustwallet and Exodus. Likely you imported awrong seed phrase. Mycelium is supporting other coins (altcoin). Maybe you have altcoin instead.This is how you will import the seed phrase on Electrum:On mobile Click on standard wallet -> I already have a seed. Input your seed phrase and click on Electrum at the top right corner and click on BIP39 and click on next. The derivation path is native segwit (p2pwsh). Legacy for addresses that start from 1Wrapped segwit for addresses that start from 3bc1 is native segwit which is what you will select as I explained above.On desktop Electrum, after you input the seed phrase, you will click on 'option' to select BIP39.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "December 06, 2023, 02:34:23 PM",
      "body": "Quote from: Saheedu on December 06, 2023, 01:18:28 PMThe reason I wanted a new wallet was because of the increase of fee and mycelium does not support lightning network I don?t want to spend $13 for a $30 coin.With such low value, I'd use Ian Coleman's site, and import just the funded private key into Electrum. Onces fees are lower, send the funds to a new (HD) Electrum wallet.After this, consider your Mycelium seed compromised and never use it again.Quote from: Saheedu on December 06, 2023, 02:08:00 PMI have seen all three in my mycelium but I used “bc1” to receive my coin.My (default) Mycelium uses m/84'/0'/0'/0/1.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "December 06, 2023, 03:41:17 PM",
      "body": "Quote from: Saheedu on December 06, 2023, 12:23:45 PMI have some coins on an address I created using mycelium wallet and I tried importing it to Trust wallet it worked but my balance was not displaying, I did the same for Exodu wallet and same thing happened.  The reason for this is the derivation path which is used by trustwallet m/84'/0'/0'/0/0 while Mycelium wallet is m/44'/0'/0'/0, the easiest solution is to list the seeds for Electrum and the balance will appear but since you have listed the seeds for closed source wallets, it is better to transfer your balance to a new address when the transaction fees are low.https://developer.trustwallet.com/developer/wallet-core/integration-guide/wallet-core-usage",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "December 06, 2023, 03:52:54 PM",
      "body": "Quote from: Yamane_Keto on December 06, 2023, 03:41:17 PMThe reason for this is the derivation path which is used by trustwallet m/84'/0'/0'/0/0 while Mycelium wallet is m/44'/0'/0'/0See what OP posted: Quote from: Saheedu on December 06, 2023, 02:08:00 PMI have seen all three in my mycelium but I used “bc1” to receive my coin. That is m/84'/0'/0'",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "December 07, 2023, 09:43:58 AM",
      "body": "Quote from: Saheedu on December 06, 2023, 01:18:28 PMYes, I can access it. I?ll try and see if I can find the derivative path you talked about if I can?t find it I?ll respond here to let you know. Go to \"three dots menu->Settings\", then enable \"Show address path\".After that, when you go to balance tab and toggle your address, the derivation path will be displayed below it.When importing the backup seed, wallets usually take the derivation path up to the 'account_index' which is the last number with ' symbol in Mycelium's displayed derivation path.Although that depends on the wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}