{
  "id": "topic_5454143",
  "title": "BD Crypto",
  "author": "BD Crypto",
  "created_time": "May 26, 2023, 08:50:37 PM",
  "content": "I am used to read forum posts and replies from everyone. Because I know that Knowledge is Power. I try to gather knowledge from every users who share. First of all I want to say that every board in this forum are useful in their way. Specially local boards are also very much effective because some users aren't used to use English and they feel comfort to discuss in their native language. But for me the most favorite board is Beginners & Help. Why this one? 1. Because this is the best place where new users can learn and ask about crypto. This board is the perfect example of helping nature. In this board everyone are helpful and they are always helping newcomers by giving valuable advises and information.2. If you just read the threads of this board you will get enough knowledge and maybe you can also find the solution in the reply section. As an example you are scrolling and saw that someone asked about the best crypto wallets. You will get the proper advise about it with some additional information from users who replied.3. New users are valuable in crypto and they should start a good crypto journey. There are hackers and scammers everywhere in crypto to trap newcomers. So they need some information and advices about how they should avoid scammers. These types of useful information and advises can be founded in this board. I just shared my experience and you are welcome to share your opinions. And best wishes for every newcommers in this forum, in crypto world.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454143",
  "comments": [
    {
      "author": "Stalker22",
      "created_time": "May 26, 2023, 08:59:52 PM",
      "body": "I agree! The Beginners & Help board is an incredibly valuable resource for new users who are just starting to learn about cryptocurrency. It was an important starting point for me, and I continue to enjoy coming back here. It is good to know there are still people who are willing to help out others in need, especially when it comes to something as technical as cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "May 26, 2023, 09:19:57 PM",
      "body": "Let’s just simply say the board is living up to its purpose. From the name of the board it was certainly made to render help to not just beginners but also others that lack knowledge in some certain areas. Although most at times some newbies spam a lot here with recycling of things that have been dealt with before, which has actually stopped or limited the number of high ranking or knowledgeable members engaging here, it has still been like a solution board to almost every problem regarding bitcoin and it’s likes been it technical or just discussions. It is also one of my favorite boards on the forum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "May 26, 2023, 09:31:07 PM",
      "body": "Yeah I agree, this board is also one of my favourites, even if it's not my favourite.I like the fact that anyone can come and ask questions here without any pressure, and that a lot of the members take the time to give very clear explanations. I appreciate it when experts - I mean experts from a technical point of view - simplify complex concepts and things for beginners.This board taught me a lot when I was just a lurker on this forum, just browse through the pages, go back in time, and you'll find some extremely interesting questions/topics. It's one of the best resources available on this forum. Sometimes you didn't even thought about the question posted before reading it here, but you learn something new and interesting in the answers, and this is totally cool!Quote from: BD Crypto on May 26, 2023, 08:50:37 PM3. New users are valuable in crypto and they should start a good crypto journey. There are hackers and scammers everywhere in crypto to trap newcomers. So they need some information and advices about how they should avoid scammers. These types of useful information and advises can be founded in this board. Absolutely, and this is how (at least it does a good part IMO) the whole ecosystem is becoming stronger years after years. More people and beginners will have access to good advices and knowledge, the less they will be ripped off, and more active users will be using BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "May 26, 2023, 09:35:35 PM",
      "body": "None of the Bitcointalk forum boards are not very useful or educational in terms of Bitcoin knowledge. Software and hardware wallet boards are very educational, as is the Bitcoin discussion board too, which has indeed been my favorite board. I can't forget that the beginners and help boards have also been the root of every one who hits the forum for the first time, unless for some Alt accounts who already know their way around the forum and those who also don't read so well and can mistakenly create topics in boards where they're not supposed to. The Beginers board is where one can ask any questions and get a lot of information or links to other relevant information, but it also applies to other boards if you really visit them. But Beginers board is also a favorite board for me after Bitcoin discussion board.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "May 26, 2023, 11:58:08 PM",
      "body": "Beginners and Help board is my favourite board.I have reasons why I like this board and that same reason is why I went to the technical board during my newbie days to inform the guys there to try and visit BH board most times.The reasons I frequent this board; I love to write articles for newbies, in order words I love to teach genuine newbies how to be successful in the forum because it is very challenging in the initial, especially when as a newbie you meet some higher ranked bully members.I also see here as the orientation board of the forum, so Beginners should begin here and depending on how they are groomed that is how they will fare in the forum at large.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shamm",
      "created_time": "May 27, 2023, 01:45:06 AM",
      "body": "Maybe most of us here in forum like this board ,(beginners and help)  as we all know that we all came here, I mean that from our newbie days we learned a lot of things here in this board one of those are the topics made by our forum mates like tutorial threads also some of our need to know are already takled in this board all we need is to search it and then read. Also some newbie who came this forum their first post is in this thread asking for help what they need to do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tech30338",
      "created_time": "May 27, 2023, 02:10:22 AM",
      "body": "Quote from: BD Crypto on May 26, 2023, 08:50:37 PMI am used to read forum posts and replies from everyone. Because I know that Knowledge is Power. I try to gather knowledge from every users who share. First of all I want to say that every board in this forum are useful in their way. Specially local boards are also very much effective because some users aren't used to use English and they feel comfort to discuss in their native language. But for me the most favorite board is Beginners & Help. Why this one? 1. Because this is the best place where new users can learn and ask about crypto. This board is the perfect example of helping nature. In this board everyone are helpful and they are always helping newcomers by giving valuable advises and information.2. If you just read the threads of this board you will get enough knowledge and maybe you can also find the solution in the reply section. As an example you are scrolling and saw that someone asked about the best crypto wallets. You will get the proper advise about it with some additional information from users who replied.3. New users are valuable in crypto and they should start a good crypto journey. There are hackers and scammers everywhere in crypto to trap newcomers. So they need some information and advices about how they should avoid scammers. These types of useful information and advises can be founded in this board. I just shared my experience and you are welcome to share your opinions. And best wishes for every newcommers in this forum, in crypto world.As a beginner or don't have lots of information acquire it is important to go where you are comfortable, the reason why is to not be overwhelm with information where you are not be able to process it since you don't have knowledge about it, also as stated beginners & help section, it is more likely that in that section, help and answer questions, and also i have seen it is where other share information more often, also experience, member told me that this is where newbies should start, maybe after 3-6 months you should by then know a bit more, but its also recommended to check other sections if you have other things to know like mining, and bitcoin discussion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "May 27, 2023, 02:58:34 AM",
      "body": "That's the reason why this board is called beginners and help. It serves its purpose when there's new in crypto field. Even though this is the board where most of the newbies post and ask questions but this is also the board where higher rankd post something too which the purpose or goal is to share it to newbies so that they will also learn new things that they haven't know yet or wanted to know if it's something that higher ranks shared in this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mamesso",
      "created_time": "May 27, 2023, 03:29:02 AM",
      "body": "Very appropriate, The Beginners & Help board is a suitable place for newbies who have just joined the forum to add to their knowledge. I define The Beginners & Help board as a school where Newbies study, everything they need can be found here as long as they are not too lazy to read and embarrassed to ask questions. At The Beginners & Help board you can educate yourself starting from the basics, newbies who have just joined are always directed here to learn basic knowledge about forums and Cryptocurrency, especially Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "May 27, 2023, 04:23:39 AM",
      "body": "Those users who use forums know very well that ideally, every forum should have a similar section. And that is where you need to start your journey.It would be correct to make a redirect for newbies who have just registered on the forum. In this way, they would be able to get better suggestions for using the forum and, moreover, in an easier way.But unfortunately, this place is not popular and attentive reading among some because, if you look closely, every second newcomer is in a hurry to create a separate topic with questions that are discussed thousands of times.The motto for newbies after arriving in this section should be, \"If you want to achieve something, read, search, and only after that ask and create a new topic.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "John Abraham",
      "created_time": "May 27, 2023, 04:30:27 AM",
      "body": "Quote from: BD Crypto on May 26, 2023, 08:50:37 PMI just shared my experience and you are welcome to share your opinions. And best wishes for every newcommers in this forum, in crypto world. Beginners & Help is the best section to learn. But the board is not only for Beginners. You cannot finish learning everything. No matter how much you learn, You will still find new things to learn. However, I won't suggest that anyone only stick to the Beginners and Help section. It would help if you explored more boards like Development & Technical Discussion, Mining and Bitcoin Technical Support to learn different things. I know coding is not my cup of tea. Still, I try to play a little in my spare time in case I can understand anything. Beginner and Help section is best if you want to learn more about the forum system. But, For different technical things like Mining, Wallets, Software related issues, You need other boards to get help from experts. For a long time, I was stuck to the WO thread and did not explore the forum as I was suggested by someone to speculate on Bitcoin. Back in the old days, People used to share their predictions there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 27, 2023, 10:09:49 AM",
      "body": "Quote from: BD Crypto on May 26, 2023, 08:50:37 PMBut for me the most favorite board is Beginners & Help. Why this one?Probably because you are still learning. Once you are done with beginners way of learning, other boards will likely be your favourite.Quote from: BD Crypto on May 26, 2023, 08:50:37 PM1. Because this is the best place where new users can learn and ask about crypto.It depends on how the newbies are. Some newbies like to know more about bitcoin wallet, they prefer to asked questions related to that on bitcoin technical boards. Some prefer to ask the question on beginners and help but later moved to one of the technical boards by a moderator.Quote from: BD Crypto on May 26, 2023, 08:50:37 PM2. If you just read the threads of this board you will get enough knowledge and maybe you can also find the solution in the reply section.Also you get knowledge on other board that you find interesting.Quote from: BD Crypto on May 26, 2023, 08:50:37 PM3. New users are valuable in crypto and they should start a good crypto journey. What you do not know is that many of the related topics about avoiding hackers and scammers are on technical board too, also on scam accusations. Some topics remain in beginners and help, but some are moved to the appropriate board at times.Beginners and help is good for newbies, very friendly for them. But as newbies are becoming established, they see other boards interesting as well. Most boards on bitcoin boards are very useful for me in a way I can not just consider this to be discussed about beginners and help alone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gallar",
      "created_time": "May 27, 2023, 12:11:15 PM",
      "body": "The beginner board & help on this forum is definitely a starting point for beginners who will ask questions or seek information when they want to start investing or trading in the crypto market. Because in this beginner & help board there are always lots of threads of information and direct conversations from experts and beginners in the crypto field, who certainly have discussions related to knowledge about the crypto world. So it's not wrong for you to mention that this beginner & help board is your favorite board in this forum. Because I personally also got a lot of important lessons on this board, when I first joined this forum. But what I feel is that it's not just the starter & help boards that are interesting, all the boards in this forum are all very interesting to discuss and the content is very informative. Because sometimes there are also beginners who join this forum, but rarely discuss on this board, and directly on other boards. So actually even if you are a beginner, not all of them are active on this beginner & help board. Because the other boards in this forum like the one I wrote about, are very interesting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zilon",
      "created_time": "May 27, 2023, 01:52:57 PM",
      "body": "Quote from: BD Crypto on May 26, 2023, 08:50:37 PM3. New users are valuable in crypto and they should start a good crypto journey. There are hackers and scammers everywhere in crypto to trap newcomers. So they need some information and advices about how they should avoid scammers. These types of useful information and advises can be founded in this board. Vulnerable you meant yeah, not just new users but also negligent long time crypto enthusiast who keep over looking basic knowledge about how the crypto ecosystem operates. It takes one who knows what this scammers know or who understands how to detect a potential scammer to avoid been scammed and this is one of the key things been discussed almost every now and then on the B&H board. Every starter who skips the B&H board are always the most vulnerable because no one escapes the basics without falling victim of attacks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "May 27, 2023, 02:34:09 PM",
      "body": "Quote from: Stalker22 on May 26, 2023, 08:59:52 PMI agree! The Beginners & Help board is an incredibly valuable resource for new users who are just starting to learn about cryptocurrency. It was an important starting point for me, and I continue to enjoy coming back here. It is good to know there are still people who are willing to help out others in need, especially when it comes to something as technical as cryptocurrency. That's why it's named beginners and help it's meant to help members here in the forum kick start their journey in this ecosystem.I am a graduate of the beginners and help, I spent lots of time on this board in my beginners days and I still till this day come here for useful helps also, but many newbies are fast to skip this board and rather go for bounty section or waste their time try to get into signature campaigns and do anything (mostly the wrong things) for the merit.I have made some very helpful post as at that time here on this board.https://bitcointalk.org/index.php?topic=5210940.msg53386209#msg53386209https://bitcointalk.org/index.php?topic=5242171.msg54265063#msg54265063https://bitcointalk.org/index.php?topic=5244777.msg54331547#msg54331547https://bitcointalk.org/index.php?topic=5252307.msg54534387#msg54534387",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z390",
      "created_time": "May 27, 2023, 03:10:12 PM",
      "body": "The beginners and help section is very very good please for sending or passing vital information to all newbies on this forum and it is also a section where you can get a straight up answer if you're confused about the forum but let me tell you, there are other sections that are very very informative like the Bitcoin and Altcoin mining section on the forum, which is where I learn how to mine cryptocurrency and how to set up one of the most profitable mining Farm.The thing is, it depends on what you're looking for and most informations are not present in the beginners and help section on the forum only,  but if teaching newbies various things is your main focus then the beginners and help section is the best place for someone like you but I refuse to accept that it is the best section on this forum.Assuming you want to teach somebody on the forum about crypto mining and just because your information is straight pointing to newbies on the forum doesn't mean that you should post such in the beginners and help section, I believe this kind of post belongs in the mining section and if you don't move it the forum moderators remove it for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BITCOIN4X",
      "created_time": "May 27, 2023, 06:41:47 PM",
      "body": "For the purposes of learning and knowledge, I think this begginers and help board is worth visiting as often as possible. I also cover things on this board quite often, answer some questions and this is the 3rd board which is my favorite board so far.I know there are several similar and possibly repeated threads created by newbies, and this was probably one of the previously discussed issues on begginers & help boards. I have 8% of total posts on the Beginner and Help boards so far, so I know what these boards are for beginners.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "May 27, 2023, 07:09:11 PM",
      "body": "Quote from: Stalker22 on May 26, 2023, 08:59:52 PMI agree! The Beginners & Help board is an incredibly valuable resource for new users who are just starting to learn about cryptocurrency. It was an important starting point for me, and I continue to enjoy coming back here. It is good to know there are still people who are willing to help out others in need, especially when it comes to something as technical as cryptocurrency. The beginners and help section is like the frequently asked questions (FAQ) option for newbies. They will get to know about Bitcoin operations and the forum if they read the information in the section. In my early days, I visited the section often because it seems like it has all the answers that were in my mind. And in this section, the senior members are less harsh to newbies because they understand that they are in the section to learn. Another wonderful feature is that it gives members the privilege of asking relevant questions. Due to the freedom and privilege the section offers some newbies have started to misuse the opportunity. Sometimes you see a newbie starting lecture threads. Some of them will want to teach you how to get merit, meanwhile, they have gotten none. Some of them want to teach you how to write quality posts while their posts seem very substandard. Others will want to teach members how to abide by the rules of the forum while they are habitual plagiarism.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "May 27, 2023, 07:45:20 PM",
      "body": "The beginnings & help board is the general board for everyone in the forum.  It it mainly design for newbies to ask questions and the knowledgeable ones to answer the questions from the newcomers. This is the board that newbies learn most of the things in the forum. And also if a Senior Members (legendary Members) want to share their thoughts and other crypto related activities to newbies and for the general public, they would come here and create the thread for everyone to see and participate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}