{
  "id": "topic_5467652",
  "title": "joker_josue",
  "author": "joker_josue",
  "created_time": "September 22, 2023, 12:15:21 AM",
  "content": "Following the topic I created about PM titles, I had the idea of creating a small tutorial on how to use PMs on the forum.I never had any problems using the forum's personal messaging system, because I adapted its features and functionalities (however few they may be). Many people probably already know these tips that I'm going to share, but I believe they can be useful, and help everyone to be able to use the forum's PM system in the best way.Basic pointsTo effectively use PM, two important points must be kept in mind. Understanding them is half the way to making everything simpler.- Messages are listed sequentially, regardless of the subject or who sent them. Listed from oldest to newest.- Automatically all received messages are in Inbox. In turn, shipments go to Outbox.How to organize yourselfThe best way to do this is to focus on the index at the top of the page, which lists all the messages, and then click on the messages you want to read. It is in the index that you can see whether the messages in a given conversation are followed or not. This way, even if you receive messages from other users, between conversations, you know which ones are linked to a subject/user and which are linked to another subject/user. In turn, messages having specific titles can help carry out this analysis.Avoiding saving messages that are not very relevant helps to keep a message box clean and organized. Sometimes a message at the end of a conversation with a simple \"Thank you\" has no file relevance and can be deleted.And the biggest help is using the label system (I'll talk about it next).Use LabelsOne of the great advantages of using labels is that you can divide the PM you receive by different categories, themes, user, etc. This will help you avoid having your inbox full of messages from several conversations at the same time. This is because, by assigning a label to a message, you will be able to remove the message from the inbox. If you immediately assign a label to the beginning of a conversation, and continue with this assignment, you will keep your inbox freer and it will be easier to manage the PMs you receive.But how does this work? Let's see with images.1. Enter the labels tab.Here you can create, edit and delete labels. Create all the ones you think are appropriate for your use, and create them according to the conversations you have.2. There are two ways to assign a label.2.1. Select the message in the index and select a label:2.2. Choose the label in the message itself:3. To remove the message from the inbox, you must first assign a label, and then using the same drop list, click to remove from the inbox:4. To access the message lists for each label, simply use the side menu:How to start/reply to a PMLast, but equally important, is the way we have conversations. This can help those who receive our response to organize themselves while reading it. This is because we must bear in mind that the other user with whom we are communicating may be having several conversations at the same time via PM.In this sense, I recommend two things:- Whenever you start a conversation, assign a subject (aspect discussed in the topic already mentioned at the beginning).- When replying, quote the last message received. Attention: this is not to quote the entire conversation! It's just from the last message received. This will allow the other user to quickly understand the topic and point of the conversation we are having.I hope this tutorial is useful for organizing your personal message box here on the forum.Do you have any more tips? Share!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467652",
  "comments": [
    {
      "author": "Sexylizzy2813",
      "created_time": "September 22, 2023, 01:02:57 AM",
      "body": "I really recommend your first topic about PM title to those who have no idea such a thing do exist or need to be done when dropping a PM.From this topic, this is another wonderful exposure, at least it still gives more ideas or steps to follow on how to use the pm better than stressing those who receive pms.But I think we still have those who doesn't take instructions even when you get them arrested they still find it hard to follow simple protocol, even if they make it comporsary. Well it will take time for it to get use to some users, let's see how it goes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hg_away",
      "created_time": "September 22, 2023, 11:45:33 AM",
      "body": "Today I learned something new, but wouldn't it be easier to use search by username feature? You can search using the username and customize the display, whether the results are first or last, or Show full message in results.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "September 22, 2023, 07:02:43 PM",
      "body": "I found this guide to be really useful. There are one or two Pms I revert back to very often to access links in them and I struggle some of the time to locate them as the message list grows longer and it gets buried beneath several other messages.Labels will really help to categorize them into High, medium and low priority.Quote from: hg_away on September 22, 2023, 11:45:33 AMToday I learned something new, but wouldn't it be easier to use search by username feature? You can search using the username and customize the display, whether the results are first or last, or Show full message in results.Searching does not replace labels. It functions similar to the watchlist for threads which does not affect searches made.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 23, 2023, 12:01:33 AM",
      "body": "Quote from: hg_away on September 22, 2023, 11:45:33 AMToday I learned something new, but wouldn't it be easier to use search by username feature? You can search using the username and customize the display, whether the results are first or last, or Show full message in results.The search function can also be interesting, as long as you know the user you want to search for, or the terms used in the conversation.One more reason, why it's good for PMs to have a specific title.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "September 23, 2023, 02:02:23 AM",
      "body": "I.....cannot believe I never noticed or was ever made aware of the labeling function for messages.  OP, my heartfelt thanks to you--my inbox is loaded with two types of PMs: requests for post history reviews (and I'll get back on them soon, y'all) and some thoughtful ones from members I respect.  The rest just get deleted, which you suggested doing ASAP and rightfully so.After 8 years here, it's like I've only ever used this forum for reading and typing.  I don't know why I never pay attention to the little features it has that make being here a little bit easier.  Grrr.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sexylizzy2813",
      "created_time": "September 23, 2023, 06:49:18 AM",
      "body": "Quote from: The Sceptical Chymist on September 23, 2023, 02:02:23 AMI.....cannot believe I never noticed or was ever made aware of the labeling function for messages.  OP, my heartfelt thanks to you--my inbox is loaded with two types of PMs: requests for post history reviews (and I'll get back on them soon, y'all) and some thoughtful ones from members I respect.  The rest just get deleted, which you suggested doing ASAP and rightfully so.After 8 years here, it's like I've only ever used this forum for reading and typing.  I don't know why I never pay attention to the little features it has that make being here a little bit easier.  Grrr.Are you going to beat yourself on that?Is really funny that this is coming from you S.C. You're a busy person in this Forum and I don't expect you to know every features hanging out in the Forum. Remember you have so much running through your mind is just to take it easy and one step at a time, you're not getting old please .I believe by now you find it easier to relate with some of those features, well thanks to OP I learnt something from his previous thread and also this one. And remember, we learn everyday.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}