{
  "id": "topic_5407868",
  "title": "autumnleaf",
  "author": "autumnleaf",
  "created_time": "July 28, 2022, 03:05:49 AM",
  "content": "Hey guys, I have just read about this \"Plagiarism\" thing in this forum that could make your account Ban. I am just wondering if by referencing and supporting my post, maybe I can use \"insert quote\" rather posting \"source link\" like this :Quote from: Greg WalkerBitcoin is an electronic payment system created in 2009. It allows you to send money to anyone in the world, and you don’t need to ask anyone’s permission to create an account.vshttps://learnmeabitcoin.com/By using insert quote, i think you can highlight the text to everyone rather than posting a source link which can be a time consuming to find the quoted text. By the way maybe i am wrong, but is there any difference?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407868",
  "comments": [
    {
      "author": "PowerGlove",
      "created_time": "July 28, 2022, 03:27:24 AMLast edit: July 28, 2022, 03:55:11 AM by PowerGlove",
      "body": "Quote from: autumnleaf on July 28, 2022, 03:05:49 AMQuote from: Greg WalkerBitcoin is an electronic payment system created in 2009. It allows you to send money to anyone in the world, and you don’t need to ask anyone’s permission to create an account.vshttps://learnmeabitcoin.com/If you're repeating something that someone on the forum has written, then use \"quote\" (preferably a proper one, with timestamp and message link).If you're repeating something that someone outside the forum has written, then provide a source link. You can use \"quote\" for that too, just make sure it has a link (when possible) and not only an author (like in your example).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "July 28, 2022, 03:32:03 AM",
      "body": "Quote from: autumnleaf on July 28, 2022, 03:05:49 AMI am just wondering if by referencing and supporting my post, maybe I can use \"insert quote\" rather posting \"source link\" like this :Both are fine.QuoteBy using insert quote, i think you can highlight the text to everyone rather than posting a source link which can be a time consuming to find the quoted text. By the way maybe i am wrong, but is there any difference?This is the point.It is not only time saving for readers because readers don't want to spend their time to find and differentiate what is your opinion and what you got from other sources. If you don't clearly use 'Insert quote', you try to trap readers and somewhat unofficially try to make your post like original one with most of content is from yourself. By doing this, it looks like you are trying to hide original authors and what they wrote.[TIPS] to avoid plagiarism[GUIDE] Plagiarism and how to avoid it.[Tips] Posting techniqueUser Script: Automatically remove nested quotes v1.1.1Post formatting (video)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "July 28, 2022, 03:36:14 AM",
      "body": "You should combine it, sometime there's some users think quoting a message without adding the source aren't enough, so you need to quote the part that you want to use in your post and add the original source. If you're quoting an users in this forum, you only need to click the quote button, the forum will directly produce the clickable link.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "July 28, 2022, 04:12:32 AM",
      "body": "Links and quotes are not equally the same, so use them properly. Quotes are used when you write something, in the exact words, that is coming from somebody else. I think it is not enough that you just provide the source link. How would the reader know which words are coming from you and which ones are not? If you're paraphrasing, however, then perhaps it is enough that you provide the source link. But just make sure that you're not making it appear as if the idea or opinion is yours and not from somebody else. Also, when you quote somebody, provide the source. How would people know if that person really said that if you're not providing the source? We would want to know if the source is legit and confirm that whoever said that really said so. Otherwise, it would so easy to put words in someone else's mouth. But, of course, especially these days, this doesn't apply to widely popular quotes like one from Aristotle, for example. Quote from: tranthidung on July 28, 2022, 03:32:03 AMQuote from: autumnleaf on July 28, 2022, 03:05:49 AMI am just wondering if by referencing and supporting my post, maybe I can use \"insert quote\" rather posting \"source link\" like this :Both are fine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "autumnleaf",
      "created_time": "July 28, 2022, 04:18:43 AM",
      "body": "This is really helpful as i am now able to use proper quotes with timestamp and message link as mention by @PowerGloveExampleQuote from: DireWolfM14 on September 25, 2018, 12:53:23 PMPlagiarism, simply stated is the act of taking somebody else’s work and attempting to portray it as your own.  This can be done orally or in print, music, art, expression, or video.  For the purpose of this article I’ll focus on printed plagiarism.  Obviously that’s the concern here on the forum due it being… uh, well, you know, a forum.Thanks for the links and tips! I seem know how to use this two things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "July 28, 2022, 05:10:30 AM",
      "body": "With your first  quote example, source: Greg Walker you can freely make it as a hyperlink directly to the website of your source. Many have doing that since its easy to go directly on your reference. But putting up link is also okay as far as I noticed.Plagiarism is indeed a grave violation here so forgotting to do this might lead your account to a temp or permanent ban.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bttzed03",
      "created_time": "July 28, 2022, 05:26:07 AM",
      "body": "Quote from: autumnleaf on July 28, 2022, 03:05:49 AMQuote from: Greg WalkerBitcoin is an electronic payment system created in 2009. It allows you to send money to anyone in the world, and you don’t need to ask anyone’s permission to create an account.vshttps://learnmeabitcoin.com/Just combine them to keep it simple.Quote from: https://learnmeabitcoin.com/Bitcoin is an electronic payment system created in 2009. It allows you to send money to anyone in the world, and you don’t need to ask anyone’s permission to create an account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "July 28, 2022, 05:37:01 AM",
      "body": "If it is plagiarism? Both are not plagiarism. But there are just times quote will be good, there are times just adding link can be good, there are also just times that using both quote and link can be good. Using any means you are not plagiarizing, but people just prefer to see the link to what you quote.Quote from: autumnleaf on July 28, 2022, 03:05:49 AMBy using insert quote, i think you can highlight the text to everyone rather than posting a source link which can be a time consuming to find the quoted text. By the way maybe i am wrong, but is there any difference?You mean time consuming to find the link to the quoted text? Not plagiarizing, but that is just the reason you can as well include the link to the quote in the quote.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "July 28, 2022, 09:05:09 AM",
      "body": "Quote from: autumnleaf on July 28, 2022, 03:05:49 AM<…>The source link is the absolute must, since that is the real pointer to where the information is originated. It can be either included as a link, or as part of the header of the quote, although I believe I’ve seen the former more than the latter by a mile. It should ber precise, and not pointing generically to a website or an name as in the OP.The quotes normally refer extracts (of that source or forum posts for example) and are a good way of visually showing what is verbatim from a given source, from what is your own text, though not everyone follows this scheme (some do not quote and just paste the text +add source link, which is not worth much overall).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "July 28, 2022, 11:04:33 AM",
      "body": "Quote from: autumnleaf on July 28, 2022, 03:05:49 AMBy the way maybe i am wrong, but is there any difference?Both method can be used to prevent Plagiarism accusation. I use both depending on how i write a post/reply/thread, although i share direct link for both quote and url link rather than name of the author.Code:[quote author=https://bitcointalk.org][/quote]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "July 28, 2022, 12:34:32 PM",
      "body": "For me both works depending on the writing style and how I want to share the information but using some external resources a source link is necessary so users can read about it in detail and credits goes to the orginal author saving your from plagiarism on forum as well.But sometimes you can highlight point in quote that shares something useful and readers can focus on that part only.So you can say we can use them both in combination to improve our post quality keeping up the forum rules.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bullrun2024bro",
      "created_time": "July 28, 2022, 01:30:25 PM",
      "body": "Quote from: autumnleaf on July 28, 2022, 03:05:49 AM~To be safe and to show the reader that you are quoting, you should do the following:QuoteThis is a quote.+Source: Link to external website/article or whatever you are quoting.You probably won't get banned if you only use one of the above. Nevertheless, without the quote tag the impression might stand that the writing is yours, when in fact it is a quote. Be honest and quote reasonably. You owe that to the author of the text.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "July 28, 2022, 04:52:10 PMLast edit: July 28, 2022, 09:30:05 PM by PX-Z",
      "body": "Quoting a forum post will be depending on the user posting style. Both you mentioned are acceptable as everyone said.When i quote some phrase in external websites I always use the quote feature and put the text inside then copy the website url as the author.Code:[quote author=https://twitter.com]Text here...[/quote]I only use this for few words or paragraphs. For longer text just copy the whole words then put a \"Source: URL\" in the end",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "July 28, 2022, 05:54:14 PM",
      "body": "Because plagiarism is a main violation with the most severe consequences, I will stick to the safest citation/quote method, which is to include a reference link where readers can generally review the source of the citation which is also provided with a timestamp and name of the author. I think, just copying the link is easier and faster than typing the quote information manually.The OP's method may be used if the sources are only available on non-internet media.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "July 28, 2022, 07:25:53 PM",
      "body": "Quote from: autumnleaf on July 28, 2022, 03:05:49 AM but is there any difference?It is best you always use the two if possible because of your readers. Whenever I go through a post and see a quoted sentence or paragraph, I usually take it to mean that that is what the writer is trying to point out for whatever purpose of the discussion. For persons like myself that like to read further to really understand what a writer who is quoting someone is trying to express, it is proper to include a link for extensive reading.It aids reading/understanding and engagement to your post plus it will cost you nothing to do it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "July 28, 2022, 07:30:12 PM",
      "body": "Quote from: autumnleaf on July 28, 2022, 03:05:49 AMBy the way maybe i am wrong, but is there any difference?Well, the way you did it is one way to do it, but that, I think is not actually the best way.The rule of plagiarism states that, if you post a content that's not originally yours, you should include the source link, that is the link to the original post.It is not a necessity that you must insert a quote on a whole post or article as a means of referencing the source.Quotes are only used to highlight some part of a post or article to make that part stand out.But in a case where you decide to insert a quote on an article or post, you can make the quote header carry or link to the source where the text you quoted was gotten from, for example -Quote from: https://learnmeabitcoin.comBitcoin is an electronic payment system created in 2009. It allows you to send money to anyone in the world, and you don’t need to ask anyone’s permission to create an accountCode: [quote author=https://learnmeabitcoin.com]Bitcoin is an electronic payment system created in 2009. It allows you to send money to anyone in the world, and you don’t need to ask anyone’s permission to create an account[/quote]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "July 28, 2022, 07:43:10 PM",
      "body": "If you are going to quote something from another site then it's fine and much better since we can read it right away instead of just giving the source link. If you are going to write using your own words about a topic and then provide a source link to let them check about what you write then it's also fine. If you quoting then it is much better if you also include the source link.Example:Quote from: Greg WalkerBitcoin is an electronic payment system created in 2009. It allows you to send money to anyone in the world, and you don’t need to ask anyone’s permission to create an account.Source:https://learnmeabitcoin.com/Instead of this one which only the source link that is given or provided.https://learnmeabitcoin.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "July 28, 2022, 08:33:38 PM",
      "body": "Quote from: autumnleaf on July 28, 2022, 04:18:43 AMThanks for the links and tips! I seem know how to use this two things.There is actually one another method that no one has mentioned yet. You can put both the author and the clickable source link in your quotes, like this:Quote from: Greg WalkerBitcoin is an electronic payment system created in 2009. It allows you to send money to anyone in the world, and you don’t need to ask anyone’s permission to create an accountCode:[quote=\"[url=https://learnmeabitcoin.com]Greg Walker[/url]\"]Bitcoin is an electronic payment system created in 2009. It allows you to send money to anyone in the world, and you don’t need to ask anyone’s permission to create an account[/quote]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "July 29, 2022, 11:25:34 PM",
      "body": "Quote from: FatFork on July 28, 2022, 08:33:38 PMThere is actually one another method that no one has mentioned yet. You can put both the author and the clickable source link in your quotes, like this:/...Code:[quote=\"[url=https://learnmeabitcoin.com]Greg Walker[/url]\"]Bitcoin is an electronic payment system created in 2009. It allows you to send money to anyone in the world, and you don’t need to ask anyone’s permission to create an account[/quote]Never thought that it will work in this way after all this years lol. Although i think some or most people here doesn't know this thing too as i never saw someone made a quoted post the same like this aside from you. Another knowledge unlock.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}