{
  "id": "topic_5420255",
  "title": "Thiagofelipe",
  "author": "Thiagofelipe",
  "created_time": "November 09, 2022, 09:31:05 PM",
  "content": "As criptomoedas tinham um segundo dia de fortes quedas nesta quarta-feira (9), com investidores desconfiando da estabilidade do setor e da saúde financeira da corretora FTX, apesar dos planos de um acordo de resgate da rival maior Binance.A Binance assinou um acordo não vinculante na terça-feira ( para comprar a unidade fora dos Estados Unidos da FTX para ajudar a cobrir uma “crise de liquidez” na rival.Será que com todas essas noticias negativas aumenta as chances de vermos bitcoin abaixo de 14 mil dolarés?Fonte: https://www.cnnbrasil.com.br/business/criptomoedas-caem-apos-acordo-entre-ftx-e-binance-assustar-investidores/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420255",
  "comments": [
    {
      "author": "TryNinja",
      "created_time": "November 10, 2022, 01:51:25 AM",
      "body": "Calma lá, faltou umas etapas ai. O pessoal não ficou com medo de um “acordo” entre as exchanges. A FTX foi pega sendo insolvente e sofreu um bank run. Como a segunda maior exchange do mundo, pilar do ecossistema junto à Binance, se provou uma fraude, claro que o mercado caiu.Depois disso, eles pediram para a Binance salvá-los, mas a transação não seguiu em frente pois o buraco da FTX é muito grande. Ai sim o mercado desabou se vez.Estamos discutindo isso nesse tópico: https://bitcointalk.org/index.php?topic=5419938",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "November 10, 2022, 12:40:57 PM",
      "body": "Quote from: TryNinja on November 10, 2022, 01:51:25 AMCalma lá, faltou umas etapas ai. O pessoal não ficou com medo de um “acordo” entre as exchanges. A FTX foi pega sendo insolvente e sofreu um bank run. Como a segunda maior exchange do mundo, pilar do ecossistema junto à Binance, se provou uma fraude, claro que o mercado caiu.Eu havia lido que a ftx era a terceira, após a coinbase.De qualquer forma, hoje não faz mais diferença.a ftx nem aparece mais no coinmarketcap.com https://coinmarketcap.com/rankings/exchanges/Agora binance, coinbase, Kraken e kucoin,  as maiores nessa ordem.. Coingecko tb tirou a frxhttps://www.coingecko.com/en/exchanges",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}