{
  "id": "topic_5400973",
  "title": "bonfire66",
  "author": "bonfire66",
  "created_time": "June 01, 2022, 12:31:34 PM",
  "content": "Пост про гарантию, экспертов, экологию, профессионалов, юристов и специалистов. Все эти понятия, термины, в текущей современности и реальности уже конкретно и полностью дискредитированы. Окончательно и абсолютно. Лично я, когда вижу данные слова в тексте (а еще хуже, в названии статьи), или в тексте ролика,  меня тут же тянет блевать жидким блевом. Именно и только так. И ни как иначе. Потому что в современной реальности НЕТ больше таких понятий, как:- гарантия, потому что никто никогда ничего не гарантирует. Точнее, всегда врут, что якобы что-то гарантируют, но когда наступает гарантийный случай, тут же выясняется, что случай, оказывается, отнюдь не гарантийный и вас шлют вежливо нах. - экспертиза, потому что в жизни каждого эксперта рано или поздно наступает период, когда ему предлагают определенную сумму денег, и он подписывает фальшивое экспертное заключение.- экология – скажите «привет» тысячам (миллионам?) гектаров сгоревших лесов в Сибири за последние годы. Причем, эти леса сгорели абсолютно безнаказанно, типа ну так и надо было. А в Москве при этом запросто могут эвакуировать и оштрафовать автомобиль, который хотя бы одним колесом заехал в грязь, именуемую «обочиной».- профессионалы – это люди, которые никогда ни за что не отвечают, хотя весьма бодро могут безнаказанно нести любой бред и ересь, и им за это ничего не будет. Хочу, блин, быть профессионалом! Пусть меня научат! И дадут диплом профессионала! Кто крайний в очереди за такими дипломами? А? Я за вами буду!- юристы – это вообще шлак цивилизованного общества. Нарыв и гнойник. Паразиты, которые врут направо и налево, лишь бы заключить с вами контракт, взять с вас деньги, ничего не сделать, а потом вас кинуть. - специалисты – те, кто на самом деле не имеют никакой специализации, а просто тупо делают свою работу. Например, что-то чинят. Или ремонтируют, или строят. Опять же: нет никакой гарантии, что они сделают это правильно, а самый справедливый на свете суд затем встанет на правильную сторону добра, а отнюдь не на сторону зла. Специалисты – это просто НИКТО. Просто люди, которые делают какую-то работу, но не отвечают за нее никак. - справедливость – абсолютно утопичный фантастический термин, который существует разве что в воображении писателей-фантастов и продажных журналистов. Да, наверное, что-то подобное иногда происходит в этом мире. Крайне редко. Но это больше похоже на байки, приколы и прибаутки из интернета, пересказанные через десятые уши, чем на реальные свидетельства о том, что это когда-то было реальной правдой.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400973",
  "comments": [
    {
      "author": "xandry",
      "created_time": "June 01, 2022, 05:40:59 PM",
      "body": "Вы же вроде в Турции жили ещё, там это всё тоже применимо?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "June 03, 2022, 03:01:04 PM",
      "body": "Не знаю про Турцию. Если брать страны, где я успел пожить и поработать - то на первом месте будет Германия, на втором - Индия, на третьем, кажется, Турция и Бельгия. И еще Латвия. Чтобы понять жителей других стран надо нормально уметь говорить на иностранных языках, а у меня с этим проблема. С языками. Три штуки и все в пассиве.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}