{
  "id": "topic_5399994",
  "title": "DdmrDdmr",
  "author": "DdmrDdmr",
  "created_time": "May 24, 2022, 01:04:51 PM",
  "content": "No lo había visto difundido realmente, y me he topado con la campaña a través de un artículo que citaba como el Gobierno de Uruguay daba cancha a la difusión de la campaña en su página web, si bien la campaña parece que ya se lanzó a finales de marzo 2022 en su globalidad.La campaña involucra la participación de policía y fiscalía de Argentina, Bolivia, Chile, Colombia, Costa Rica, Ecuador, ElSalvador, España, Guatemala, Honduras, México, Panamá, Paraguay, Perú, Portugal, República Dominicana y Uruguay. Su objetivo es concienciar a los ciudadanos acerca de las principales tipologías de estafas que hay en la criptoesfera, e informar de los canales para su denuncia.Más allá de la gracia de la campaña para explicar los distintos tipos de timos a través de monedas inventadas falsas (ver los enlaces más abajo), lo interesante es ver reflejados los canales oficiales para las denuncias, algo que no tenía del todo claro cuáles eran. Por ejemplo, en España se trataría de interpelar denuncia a través de los siguientes canales:QuoteDenuncia presencial en dependencias policialesDenuncia telefónica062Mediante e-mailciberestafas@guardiacivil.orgEn la página webwww.guardiacivil.esVer:https://www.fakecoins.org/wp-content/uploads/2022/03/Nota-de-Prensa-Campana-FakeCoins-es.pdfhttps://www.fakecoins.org",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5399994",
  "comments": [
    {
      "author": "Hispo",
      "created_time": "May 24, 2022, 11:21:06 PM",
      "body": "Irónicamente, a diferencia de los crímenes tradicionales a los que hemos estado acostumbrados toda la vida, los crímines de robos de fondos mediante criptomonedas son combatidos de forma más efectiva mediante la prevención/educación que mediante la denuncia y la posible acción de las autoridades. Todos sabemos porque, es un tema de jurisdicción y de rastreo de fondos, simplemente se trata de operaciones que para la mayoría de los gobiernos no es posible atender a menos de que se trate de un caso muy extraordinario.Por ahora, lo mejor es educar a la población en general, darles una lista comprensible de las \"red-flags\" y quizá disminuir la liquidez de los fondos robados (en los exchanges), aunque personalmente esta última medida no sería muy efectiva y estaría expuesta a posibles abusos de las autoridades para marcar fondos o direcciones que no necesariamente están involucradas en crímines.Les daré un ejemplo aplicado de esto:Hace unas semanas hice un retiro desde Binance a una dirección externa y pasó algo que no había visto antes: antes de permitirme hacer los pasos de verificación del retiro, tuve que responder una encuesta que basicamente les hacia descartar que yo estuviese retirando fondos para participar en: un esquema Ponzi, suplantación de identidad (alguien haciendose pasar por el equipo de Binance), promoción falsa de Binance, etc.Obviamente, respondí de forma correcta lo que estaba haciendo, un simple retiro y pude continuar con normalidad. Nosé que sucede si se responde de forma insatisfactoria, pero me parece una buena iniciativa por parte del exchange para reducir (aunque sea un poco) el volumen de las transferencias a direcciones de los típicos timadores de criptoactivos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "May 25, 2022, 10:20:31 AM",
      "body": "Quote from: Hispo on May 24, 2022, 11:21:06 PM<…>Curioso lo que comentas de Binance, pero por lo que veo, uno debería \"saber\" qué es un Ponzi, poder identificar una promoción falsa, etc. Probablemente, la mayoría de los que retiren para participar de éstas no sea consciente de que están participando en los citados tipos de engaños. Cuanto menos, no obstante, si debería servir como elemento que le puede hacer reflexionar a más de uno, e indagar mejor antes de proceder. Algo es algo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "May 25, 2022, 02:16:11 PM",
      "body": "Quote from: DdmrDdmr on May 25, 2022, 10:20:31 AMQuote from: Hispo on May 24, 2022, 11:21:06 PM<…>Curioso lo que comentas de Binance, pero por lo que veo, uno debería \"saber\" qué es un Ponzi, poder identificar una promoción falsa, etc. Probablemente, la mayoría de los que retiren para participar de éstas no sea consciente de que están participando en los citados tipos de engaños. Cuanto menos, no obstante, si debería servir como elemento que le puede hacer reflexionar a más de uno, e indagar mejor antes de proceder. Algo es algo.Creo que lo que sucede es, que a parte de existir personas que son algo crédulas en cuanto a las \"maravillosas\" ofertas que puedan ofrecerles, está el hecho de que Bitcoin y las criptomonedas en general son un tema que puede estar algo mitificado en la mente colectiva, en especial cuando a ganancias se refiere. Esto puede llevar a los recién iniciados en las criptomonedas a crearse una expectativas grandes acerca de las oportunidades de profit que tendrán al entrar a este mundo, como resultado, un 5% diario no les suena para nada descabellado, después de todo, antes de abrirse una cuenta en un exchange cada vez que escuchaban de Bitcoin o leían una noticia la mayoría de las veces de trataba de como tal persona se hizo millonario gracias a comprar BTC relativamente temprano o como BTC ayudo a otra persona a jubilarse joven, aunado a la alta volatilidad en comparación con los activos tradicionales, todo este cúmulo de características puede llevar a alguien inexperto a pensar erroneamente que las reglas que aplican sobre los activos tradicionales (en forma de rendimiento) no son las mismas para los criptoactivos. También el mito de las transacciones difíficles de rastrear y el uso ilícito que tuvo Bitcoin en sus inicios no hace más que alimentar el esoterismo que podría percibir un novato sobre Bitcoin y otras cripto, elevandole sobre las banderas rojas que cualquier persona que se ha palpado de algo de experiencia vería con facilidad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "May 26, 2022, 02:33:33 PM",
      "body": "De forma relacionada, aunque en otro plano de actores involucrados, he visto varias compañías del ámbito cripto están detrás del apoyo a una nueva plataforma para la denuncia social (que no a las autoridades) de criptoestafas. La plataforma, Chainabuse, está apoyada por empresas tales como Binance, Circle, TRM, Solana, Civic, AAVE, OpenSea y Hedera. La plataforma veo que realmente ya lleva unos meses en marcha, y tiene como idea ser una plataforma para denunciar públicamente casos en múltiples criptomonedas (a diferencia de webs más focalizadas como bitcoinabuse). Ver: https://www.chainabuse.com/abouthttps://www.cripto247.com/comunidad-cripto/binance-y-circle-lanzan-chainabuse-una-plataforma-para-denunciar-estafas-cripto-219608/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "May 26, 2022, 02:48:38 PM",
      "body": "Quote from: DdmrDdmr on May 26, 2022, 02:33:33 PMDe forma relacionada, aunque en otro plano de actores involucrados, he visto varias compañías del ámbito cripto están detrás del apoyo a una nueva plataforma para la denuncia social (que no a las autoridades) de criptoestafas. La plataforma, Chainabuse, está apoyada por empresas tales como Binance, Circle, TRM, Solana, Civic, AAVE, OpenSea y Hedera. La plataforma veo que realmente ya lleva unos meses en marcha, y tiene como idea ser una plataforma para denunciar públicamente casos en múltiples criptomonedas (a diferencia de webs más focalizadas como bitcoinabuse). Ver: https://www.chainabuse.com/abouthttps://www.cripto247.com/comunidad-cripto/binance-y-circle-lanzan-chainabuse-una-plataforma-para-denunciar-estafas-cripto-219608/Muy interesante plataforma, creo que será una excelente referencia para los usuarios que tienen dudas sobre si un proyecto es legítimo o no.Y sería interesante si los que reportan abusos pudieran generar un ingreso con sus reportes, o por lo menos que tuvieran un perfil con su direcciones para recibir propinas por parte de la comunidad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "June 14, 2022, 01:48:35 PM",
      "body": "Dejo apuntado aquí la posibilidad de querellarse a través de plataformas como la Asociación de Afectados por Inversiones en Criptomonedas (AAIC) en España, donde intentan presentar demandas colectivas como estrategia para conseguir mayor fuerza.Hoy he visto una noticia donde se indica que la asociación anterior había logrado un acuerdo mediante el cual se había llegado a resarcir a los afectados por fraude, so riesgo de condena penal de los defraudadores. Vale que esto va a valer para casos contados, pero es algo a tener presente.Ver:https://www.lainformacion.com/juridico/estafa-criptomonedas-bitcoin-recuperar-dinero/2868686/https://www.asociacionafectadoscriptomonedas.es/las-estafas-con-criptomonedas-tienen-remedio-por-primera-vez-un-grupo-de-afectados-empieza-a-recuperar-su-dinero/https://www.asociacionafectadoscriptomonedas.es/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}