{
  "id": "topic_5410541",
  "title": "Queentoshi",
  "author": "Queentoshi",
  "created_time": "August 19, 2022, 10:03:02 PM",
  "content": "Do you think the world population was considered during the creation of bitcoins? Was the intention to create enough bitcoins that could serve the entire world population should it be generally adopted, since it is what we all hope for, can the 21 million bitcoins be enough for the entire world population if it is generally adopted? As at 2009 when cryptocurrency began use, the estimated world population was 6,898,305,908, Currently 2022, the estimated world population is now  7,975,105,156. That an estimated additional 1,076,799,248 persons in a space of 13 years. We know this number will not become smaller as the population will continue to increase regardless of setbacks in forms of the pandemic, war etc Will general adoption really work?https://www.macrotrends.net/countries/WLD/world/population",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410541",
  "comments": [
    {
      "author": "franky1",
      "created_time": "August 19, 2022, 11:06:18 PM",
      "body": "there are only 190,000 tonnes of goldis that enough for everyoneanswer of course yes. no one needs or wants a whole tonne.no one needs a whole BTCeach btc can be divided into 100,000,000 parts (a sat)same as how if 1btc is considered \"a tonne\" 1btc can be considered as 1000x of 0.001btcwhere that 0.001btc is like 1kgwhere 0.000,001btc is like 1gramso if most people have devices or tooth filings to have a gram of gold. with alot more to spareeach person can have 100satwith alot to spare",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "August 19, 2022, 11:45:17 PM",
      "body": "That's why from time to time, it's become tougher to own a whole number of Bitcoin, it always matters on fractions, and the more it will becomes expensive it will become the lesser amount in fractions that you can able to collect. Sats or millisats will become a valuable fraction on that day.But I have a doubt not all become holders, there will surely be short-time holders that will anytime sell their Bitcoin in a short period of time and can't able to hold it in a long run.Quote from: franky1 on August 19, 2022, 11:06:18 PManswer of course yes. no one needs or wants a whole tonne.no one needs a whole BTCeach btc can be divided into 100,000,000 parts (a sat)I tend to agree and there's someone who created a thread of Bitcoin table unit which I thought before sats is the smallest fraction of Bitcoin. Quote from: GreatArkansas on April 11, 2020, 04:49:23 PMBITCOIN TABLE OF UNITS|Unit|Abbreviation|Decimal (BTC)|Alternate Names|Info|||msat|0.00000000001|millisatoshi|Payment channel value (Lightning Network, thanks DdmrDdmr)|||sat|0.00000001|satoshi|Blockchain value|||sat|sat|satoshi|Blockchain||bitcoin-bong|TBCᵇ|0.00000001   ||0.0001 tonal||||0.0000001|finney|||bitcoin-mill|TBCᵐ|0.00000016||0.001 tonal||micro-bitcoin|μBTC|0.000001|bit|Frequent||bitcoin-san|TBCˢ|0.00000256||0.01 tonal||bitcoin-ton|TBCᵗ|0.00004096||0.1 tonal||bitcoin|TBC|0.00065536||Tonal base unit||milli-bitcoin|mBTC|0.001|millibit, millie|Occasional||centi-bitcoin|cBTC|0.01|bitcent|Formerly frequent||deci-bitcoin|dBTC|0.1||Rare||san-bitcoin|ˢTBC|0.16777216|100 tonal|||bitcoin|BTC|1|coin|SI base unit||mill-bitcoin|ᵐTBC|2.68435456||1000 tonal||deca-bitcoin|daBTC|10||||bong-bitcoin|ᵇTBC|42.94967296||1,0000 tonal||hecto-bitcoin|hBTC|100||Rare||kilo-bitcoin|kBTC|1,000||Rare in context||mega-bitcoin|MBTC|1,000,000||Rare in context||tam-bitcoin||2,814,749.76710656|1,0000,0000 tonal|Rare in context|LEGEND: green  - Frequently used.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "August 19, 2022, 11:52:37 PM",
      "body": "Quote from: Queentoshi on August 19, 2022, 10:03:02 PM. We know this number will not become smaller as the population will continue to increase regardless of setbacks in forms of the pandemic, war etc Will general adoption really work?https://www.macrotrends.net/countries/WLD/world/populationPeople can use satosbis, and even sub satoshis. Fractions of a Satoshi are already in reality in lightning network.  A simple fork would make this a reality in on chain transactions,  if necessary  It is not necessary now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "August 20, 2022, 01:04:33 AM",
      "body": "Quote from: Queentoshi on August 19, 2022, 10:03:02 PMDo you think the world population was considered during the creation of bitcoins? Was the intention to create enough bitcoins that could serve the entire world population should it be generally adopted, since it is what we all hope for, can the 21 million bitcoins be enough for the entire world population if it is generally adopted?Why do they think bitcoin is for all populations?, what do they attention? I know what they mean, they want to introduce something which is more better than bitcoin with only 21 Millions supply, but they always forget that supply will always be enough if split into another units like cents, grams, and satoshi. For now, we look1 bitcoin = ... same as gold, long time ago,,, 1-kilogram gold = ...but as time as go onNow, people make calculation1 Gram gold =.. So, for bitcoin Next 10-20 years we can see, 1 satoshi = ...Understand?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "August 20, 2022, 01:49:49 AM",
      "body": "To answer this question, you should readHow is the 21 Million Bitcoin Cap Defined and Enforced?Creating more Bitcoin in total supply does not create value and reduce the total supply does not automatically result in higher value. You can find altcoins with less than 21M in total supply but they don't have higher value than Bitcoin.I meanInflation: Increasing total supply ~ value decreaseDecrease supply like some altcoins # value increase",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "August 20, 2022, 02:06:01 AM",
      "body": "everyone already said it just like gold and can each person can hold couple of satoshi and that is very true . but the fact is that currently is very hard to collect even 1 btc   because the price is crazy and the current circulating supply already scattered all over the place and the Dormant address still pretty much hold lot of coin and don't forget to people who lost their key or burned the btc so people will get less satoshi maybe 1 satoshi even worth a lot. the btc become like rare earth material",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "August 20, 2022, 03:22:23 AM",
      "body": "There could literally be one Bitcoin in the entirety of existence, mined in fractions. The finite number of Bitcoin doesn't actually matter. Same principle of supply and demand would apply to any number of coins as long as the supply is fixed. There would just be a greater value attributable to a smaller fraction of coin. Owning a whole Bitcoin doesn't actually mean anything, your purchasing power is what matters. If you own 1/1000000th of a Bitcoin with only 1 BTC in circulation, but that fraction of coin allows you the same purchasing power as 200 kg. gold, then does it matter how small that fraction is?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "August 20, 2022, 05:52:32 AM",
      "body": "8 billion people, but about half of them are children so they would not get any money to begin with, for family reasons. So you're actually looking at just 4 billion people.We don't actually know at which halvening will the current supply produce a value that's enough for the world economy. We can only find this out empirically, by going through each and every halvening in sucession.Once we do identify an equilibrum though, I'm of the opinion we should hardfork and shut the halvenings off before they become destructive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "August 20, 2022, 06:27:52 AM",
      "body": "All I can say is that 21M is not enough for everyone even if we make it 100M BTC it may still not be enough for everyone to have 1BTC. We believe crypto is for the unbanked but not everyone even have access to the internet. We could say the latecomers will have satoshis, it's still not going to make the wealth distribution fair.They could just have the altcoins, they are not very expensive as of now or maybe meme coins make sense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "samuraijin",
      "created_time": "August 20, 2022, 03:15:19 PM",
      "body": "Quote from: dansus021 on August 20, 2022, 02:06:01 AMeveryone already said it just like gold and can each person can hold couple of satoshi and that is very true . but the fact is that currently is very hard to collect even 1 btc   because the price is crazy and the current circulating supply already scattered all over the place and the Dormant address still pretty much hold lot of coin and don't forget to people who lost their key or burned the btc so people will get less satoshi maybe 1 satoshi even worth a lot. the btc become like rare earth material If the supply is truly distributed to everyone then of course the price of Bitcoin will increase sharply, but this is on the contrary the price of bitcoin continues to decline, what happens, if we have the determination to collect bitcoin you can play trading if you have capital or can visit freebitco.in to get some Satoshi, although it's quite a bit if you are patient to collect it then you will feel like getting 1 BTC in a year, that's if you are a patient person..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "August 20, 2022, 03:18:44 PM",
      "body": "Quote from: Queentoshi on August 19, 2022, 10:03:02 PMDo you think the world population was considered during the creation of bitcoins? Was the intention to create enough bitcoins that could serve the entire world population should it be generally adopted, since it is what we all hope for, can the 21 million bitcoins be enough for the entire world population if it is generally adopted? As at 2009 when cryptocurrency began use, the estimated world population was 6,898,305,908, Currently 2022, the estimated world population is now  7,975,105,156. That an estimated additional 1,076,799,248 persons in a space of 13 years. We know this number will not become smaller as the population will continue to increase regardless of setbacks in forms of the pandemic, war etc Will general adoption really work?https://www.macrotrends.net/countries/WLD/world/populationYou don’t have to own a whole bitcoin to be able to use it. You can own satoshis and still use bitcoin just fine. Bitcoin is highly divisible. So when the adoption grows, people will be using satoshis instead of whole coins. In fact, it is already happening. Lots of bitcoin users don’t have a bitcoin at all. Most users only own satoshis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.right85",
      "created_time": "August 20, 2022, 03:42:23 PMLast edit: August 20, 2022, 03:53:59 PM by Mr.right85",
      "body": "Quote from: franky1 on August 19, 2022, 11:06:18 PMthere are only 190,000 tonnes of goldis that enough for everyoneanswer of course yes. no one needs or wants a whole tonne.no one needs a whole BTCeach btc can be divided into 100,000,000 parts (a sat)same as how if 1btc is considered \"a tonne\" 1btc can be considered as 1000x of 0.001btcwhere that 0.001btc is like 1kgwhere 0.000,001btc is like 1gramso if most people have devices or tooth filings to have a gram of gold. with alot more to spareeach person can have 100satwith alot to spareI am out of smerit else, this analogy ought to have gotten a few even though it might have meaned nothing to you. Your response to this is precise and some worth speaks my mind in a way I won't have said it but surely, a lot better by using calculations and another relatively scares commodity.In response to OP, if we try to quantify and value bitcoin based on its market price today, its surely not going to be enough but, there is no where in all of this where it becomes compulsory that everyone most own or use bitcoin.The scarcity of bitcoin today is relatively due to it serving for a store of value as an asset which remains a shift from its original intent and this could change in years.To a point where the least sat 0.0000001 could come with some actual value that could serve a great need. It's a phase and we are getting there, slowly but surely.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "August 20, 2022, 04:13:12 PM",
      "body": "I think whether it's enough for everyone depends on the purpose, kinds of usage and what we mean by 'everyone'. And I honestly don't think an additional billion of people makes a big difference here either.If you mean enough for everyone to have a bit of money in Bitcoin, then yeah, it's enough. If you mean for everyone to have at least a tenth of Bitcoin, then no, not enough. But since Bitcoin is satoshis, and the price of Bitcoin grows with the increasing demand, 21 million BTC is enough if we remember those things, Moreover, everyone never uses anything. If it's money, we can exclude children, for example (at least to a certain age). If it's Bitcoin, we can exclude all those who don't have access to the Internet and to a digital device (smartphone or laptop). It also shrinks the number of actual potential users by quite a lot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cloudfir3e",
      "created_time": "August 20, 2022, 04:18:18 PM",
      "body": "Quote from: Queentoshi on August 19, 2022, 10:03:02 PMDo you think the world population was considered during the creation of bitcoins? Was the intention to create enough bitcoins that could serve the entire world population should it be generally adopted, since it is what we all hope for, can the 21 million bitcoins be enough for the entire world population if it is generally adopted? As at 2009 when cryptocurrency began use, the estimated world population was 6,898,305,908, Currently 2022, the estimated world population is now  7,975,105,156. That an estimated additional 1,076,799,248 persons in a space of 13 years. We know this number will not become smaller as the population will continue to increase regardless of setbacks in forms of the pandemic, war etc Will general adoption really work?https://www.macrotrends.net/countries/WLD/world/populationif general global adoption were to occur then the supply of bitcoins would definitely run out.you don't need to worry about that because if the general adoption is successful and the bitcoin supply runs out automatically its value will soar continuously if the demand is increasing and in 1 bitcoin it can be shared or held by several people if the value of 1 bitcoin itself is so high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "August 20, 2022, 06:36:19 PM",
      "body": "At 8 billion people and 21 million BTC that's 0.002625 per person or 262500 satoshis. That's more satoshis per person than USD per person currently. And in Lightning Network it's possible to have units smaller than Satoshis. And also it's possible to upgrade the protocol to divide Bitcoin into smaller units than satoshi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AakZaki",
      "created_time": "August 20, 2022, 08:41:15 PM",
      "body": "Quote from: samuraijin on August 20, 2022, 03:15:19 PMIf the supply is truly distributed to everyone then of course the price of Bitcoin will increase sharply, but this is on the contrary the price of bitcoin continues to decline, what happens, if we have the determination to collect bitcoin you can play trading if you have capital or can visit freebitco.in to get some Satoshi, although it's quite a bit if you are patient to collect it then you will feel like getting 1 BTC in a year, that's if you are a patient person..The best way to collect bitcoins consistently is by mining. Freebitcoin only gives a few satoshi and even then it is still limited. and trading must also really be able to do analysis so that the plan to collect bitcoin can be carried out. Mining is the best way but you have to use a mining rig which is certainly quite expensive to be able to mine a lot of bitcoins.bitcoin is currently still distributed to everyone who knows about bitcoin and some bitcoin wallets that can no longer be opened with large amounts will certainly become bitcoins that can't be taken anymore.21 million bitcoins will not be fully distributed properly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "|MINER|",
      "created_time": "August 20, 2022, 09:05:04 PM",
      "body": "Quote from: Queentoshi on August 19, 2022, 10:03:02 PM~snip~If you ask me this question, my answer would be little diplomatic and that is that bitcoin is not enough for everyone and this is one of the reasons why bitcoin is so successful. As the use of Bitcoin continues to increase day by day, it will continue to become valuable, as gold already is.  \"Not enough for everyone \"Maybe because of this Bitcoin will one day reach a value what  we can't even imagine right now",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "August 20, 2022, 09:21:42 PM",
      "body": "I wouldn't even focus on trying to divide bitcoin by number of people in the world because it's pointless. You won't find a single technology in this world that every single person uses and that includes the Internet, telephone, cars and electricity.There are people who live without power, there are people who live without phones, there are people who never held a dollar or euro, there are people who never will and will die somewhere in East Russia, milking a cow or plowing a field without being aware that there are people who mine a decentralized currency Bitcoin doesn't have to be enough for everyone but I'm sure it will be enough for those who choose to use it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DoublerHunter",
      "created_time": "August 20, 2022, 09:31:15 PM",
      "body": "Quote from: |MINER| on August 20, 2022, 09:05:04 PMQuote from: Queentoshi on August 19, 2022, 10:03:02 PM~snip~If you ask me this question, my answer would be little diplomatic and that is that bitcoin is not enough for everyone and this is one of the reasons why bitcoin is so successful. As the use of Bitcoin continues to increase day by day, it will continue to become valuable, as gold already is.  \"Not enough for everyone \"Maybe because of this Bitcoin will one day reach a value what  we can't even imagine right now^Why not?It was already said above that we can even own satoshi and that will become valuable soon and it could be the transaction through the lightning network since the value of miner fee will become expensive too. As of now, we have 19,127,162 BTC circulating supply and I think that amount will be more and we divided it into a fraction number. So it is not 21 million BTC.You have it if you can afford to buy it, that is the right answer, not the amount of BTC that is to be accumulated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}