{
  "id": "topic_5417857",
  "title": "JamesDaniel90",
  "author": "JamesDaniel90",
  "created_time": "October 21, 2022, 06:57:04 AM",
  "content": "I started buying Gala in January at 30p and it has recently dropped below 3p for the first time in over a year and I am wondering if I should keep DCA or cool off for a bit? I have always believed it had great potential however at a 95% drop since its all time high it has got me wondering why such a drop? I know we are in a bear market but there are not many others that have dropped 95% and I am beginning to doubt if it is going to be as big as I thought it would be. I have been buying weekly since the crash in June which has now given me an average buy of £0.055 which is pretty good but I have always thought Gala would reach £2 next bull run minimum but am not so sure now. Just wondering what everyone thinks on this project and its potential in the next bull run?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417857",
  "comments": [
    {
      "author": "Crypt0Gore",
      "created_time": "October 21, 2022, 08:39:35 AM",
      "body": "Gala is a very good project, I trust the project more than other play to earn games because it works just like the Steam Platform, one problem though, Gala games have a massive total supply and I don't like it, right now I only have 5000 Gala in my wallet but I believe the project will lose more value in the long bear market, let your entry point matter the most, this is what will define how many X you will make in next bull market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Weebz",
      "created_time": "October 21, 2022, 08:46:04 AM",
      "body": "is this only Bep20?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blawpaw",
      "created_time": "October 21, 2022, 10:42:26 AM",
      "body": "Quote from: JamesDaniel90 on October 21, 2022, 06:57:04 AMI started buying Gala in January at 30p and it has recently dropped below 3p for the first time in over a year and I am wondering if I should keep DCA or cool off for a bit? I have always believed it had great potential however at a 95% drop since its all time high it has got me wondering why such a drop? I know we are in a bear market but there are not many others that have dropped 95% and I am beginning to doubt if it is going to be as big as I thought it would be. I have been buying weekly since the crash in June which has now given me an average buy of £0.055 which is pretty good but I have always thought Gala would reach £2 next bull run minimum but am not so sure now. Just wondering what everyone thinks on this project and its potential in the next bull run?I guess metaverse coins are the next big thing. I have been buying a few of them, namely, mana, Gala, Sand, Hero, and a few more. I believe these will get me some profits as 2023 will be the year of metaverse coins. Remember that the halving is coming soon and it will affect cryptos prices. Check out more iinformation about Meta coins:https://www.gobankingrates.com/investing/crypto/best-metaverse-coins/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "October 21, 2022, 10:48:01 AM",
      "body": "Really hard to give financial advise mate, but I will say that Gala is one project that I'm looking for in this bear market and wanted to invest.So the decision is still up to you, if you really think that there is a potential, then by all means continue to DCA.Or look for other projects, explore and diversify your portfolio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "October 21, 2022, 10:48:59 AM",
      "body": "Quote from: JamesDaniel90 on October 21, 2022, 06:57:04 AMI have been buying weekly since the crash in June which has now given me an average buy of £0.055 which is pretty good but I have always thought Gala would reach £2 next bull run minimum but am not so sure now. Just wondering what everyone thinks on this project and its potential in the next bull run?Lucky that you still have funds for that. Actually buying now is lile saving your potential future later on. Some didnt realize that buying tokens right now with great potentiap is a steal. We dont know when or how long the next bull market will come but we can see how mad it is when it got here. Some unexpected tokens are flying literally ans who knows these metaverse platform could be a key to or bull triggers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "irhact",
      "created_time": "October 21, 2022, 10:55:30 AM",
      "body": "Quote from: JamesDaniel90 on October 21, 2022, 06:57:04 AMJust wondering what everyone thinks on this project and its potential in the next bull run?I was a big fan of gala but after understanding how the project will operate in future, I started thinking twice about investing in it and thank goodness I didn't buy. Gala works on bringing new gaming project which is good news but this projects they Introduced will have their own individual tokens which means the success of this new gaming projects won't affect the price of gala directly. This new games can success while leaving gala behind so why invest in gala instead of buying this new gaming projects they launching and profit more.Gala would only rise on hype as there isn't any utilities for the gala tokens. The developers didn't think it through before taking the decision of not making gala the main tokens of the new games they're working on. This is very surprising to me as the gala team is full of very smart individuals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "October 21, 2022, 11:17:26 AM",
      "body": "The whole metaverse project or hype though has been put into a standstill.Even Facebook itself has suffered huge losses developing their own metaverse, in the billions of dollars. So its hard what to advise the OP, whether to stop buying Gala or continue to DCA and wait till the bull run and see how big his profits will be.He has to weigh-in everything, just saying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JamesDaniel90",
      "created_time": "October 21, 2022, 11:24:50 AM",
      "body": "Hi , I will continue to DCA but not as heavy as I have been in recent months.I didn’t expect Gala to fall below 3p this fast so now that it has I think it will go below 2p by December and that is where I will start buying more again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JamesDaniel90",
      "created_time": "October 21, 2022, 02:14:09 PM",
      "body": "Quote from: 5W-KILO on October 21, 2022, 01:28:30 PMQuote from: JamesDaniel90 on October 21, 2022, 11:24:50 AMHi , I will continue to DCA but not as heavy as I have been in recent months.I didn’t expect Gala to fall below 3p this fast so now that it has I think it will go below 2p by December and that is where I will start buying more again. It looks like you are new to crypto, altcoins always lose more value as we go deep into a bear market, it gets stronger and stronger until things start changing, it's going to be a long-term bear market so buying too early is not cool but the present price is worth every penny.I started investing into crypto in January this year. I am aware we are in a bear market and these prices are normal however dropping 95% is a big drop compared to others. I feel if it was a strong a project as I thought it was it wouldn't be dropping this fast.Hopefully it will all work out in the end and it does reach new all time high in 2024-2025.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "October 21, 2022, 02:17:37 PM",
      "body": "Gala is one the few project that benefit on the metaverse hype including sandbox and decentraland but this hype is already over and the previous ATH price is just artificial pump coming from the metaverse hype. I doubt that this tokens will reach again that peak since it’s total circulating supply is already flooding the market compared before. DCA is good but if you are already losing many times since you start doing that then cool down for a while and start buying again once the price is recovering along with the general trend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JamesDaniel90",
      "created_time": "October 21, 2022, 02:21:32 PM",
      "body": "Quote from: dimonstration on October 21, 2022, 02:17:37 PMGala is one the few project that benefit on the metaverse hype including sandbox and decentraland but this hype is already over and the previous ATH price is just artificial pump coming from the metaverse hype. I doubt that this tokens will reach again that peak since it’s total circulating supply is already flooding the market compared before. DCA is good but if you are already losing many times since you start doing that then cool down for a while and start buying again once the price is recovering along with the general trend.Why would I buy when the price is recovering and not now when it is 95% down from ATH ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "October 21, 2022, 03:12:28 PM",
      "body": "https://www.coingecko.com/en/coins/galaWith the red line, I marked the price, above which the price will usually not rise until the majority of unsuccessful investors sell at a loss. I don’t see the point in selling a coin with discounts of 90% or more. You have become a long-term investor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "October 21, 2022, 05:14:38 PM",
      "body": "Every coin is going down since were on a bear market and I believe that this is one of the best time to do buy since most of the coins are -90% below their all time high. I believe that you are planning to become a long term investor, Doing DCA now is what I suggest. Gala has a great potential since they are doing metaverse thing and there are some speculations that metaverse coins are one of the trend that could happen on the next bull market. Sooner or later, I will purchase some metaverse coin to be ready incase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "October 21, 2022, 07:21:03 PM",
      "body": "Quote from: abel1337 on October 21, 2022, 05:14:38 PMEvery coin is going down since were on a bear market and I believe that this is one of the best time to do buy since most of the coins are -90% below their all time high. I believe that you are planning to become a long term investor, Doing DCA now is what I suggest. Gala has a great potential since they are doing metaverse thing and there are some speculations that metaverse coins are one of the trend that could happen on the next bull market. Sooner or later, I will purchase some metaverse coin to be ready incase.Before any purchase, you need to carefully study the tokenomics of the project, the schedule for unlocking coins and analyze possible manipulations with the price of the token. If this token is interesting to the manipulator and he sold a lot in the bull market, now his task is to buy more tokens for a lower price. If the manipulator is not interested in this token, then the price may not change for a long time or fall.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "October 21, 2022, 07:44:31 PM",
      "body": "Go back to the roots and reasons why you bought that in the first place. Look at it if you still have the same reason why you think you have to hold it.The situation that it has got right now, proves that no matter how high a project goes, the dump and bear market can also pull it down as much as it can.And when the bull run comes, nobody knows if this token will also be part of the tokens that will surge just like the bull run that we've got, it's unknown and hard to predict if we're looking at current situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$crypto$",
      "created_time": "October 21, 2022, 08:16:33 PM",
      "body": "Quote from: TravelMug on October 21, 2022, 11:17:26 AMThe whole metaverse project or hype though has been put into a standstill.Even Facebook itself has suffered huge losses developing their own metaverse, in the billions of dollars. So its hard what to advise the OP, whether to stop buying Gala or continue to DCA and wait till the bull run and see how big his profits will be.He has to weigh-in everything, just saying.I've heard this news that the metaverse project has now decreased a lot of interest so I guess this is hype in the beginning where they always boast about the metaverse but in the end have to accept the fact that tokens have to fall even more due to lack of interest from investors, maybe because there Its news Facebook has suffered losses from the Metaverse project so this is not on the lyrics anymore.My suggestion is that the OP should leave shitcoins and switch to investing in BTC, it would be better, especially if he did DCA, it would potentially be on Bitcoin compared to shitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "October 21, 2022, 09:10:50 PM",
      "body": "Quote from: abel1337 on October 21, 2022, 05:14:38 PMEvery coin is going down since were on a bear market and I believe that this is one of the best time to do buy since most of the coins are -90% below their all time high. I believe that you are planning to become a long term investor, Doing DCA now is what I suggest. Gala has a great potential since they are doing metaverse thing and there are some speculations that metaverse coins are one of the trend that could happen on the next bull market. Sooner or later, I will purchase some metaverse coin to be ready incase.Metaverse projects are not done yet, I still see good potential for them to rise again so buying GALA at a cheaper price is always a good idea, GALA is one of the pioneer with Metaverse, we might see them more expensive in the future. GALA is continuously growing, they keep on updating their platform because they believe on their project and they don’t want just to die yet without trying. GALA will be great again, if I have the extra money I wont hesitate to buy this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "October 21, 2022, 09:49:18 PM",
      "body": "The project performed well last year, but buying at 30 cents was a huge mistake for several reasons. 30 cents is only 60% loss of value, new altcoins very often fall to 90-98% of their last ATH. This is exactly the beginning of the redemption of the bottom of the coin. Usually in such ranges the coin goes into a long flat and accumulates, and then the growth starts. Never buy altcoins in a bear market that are down only 50-80% of their tops. They are bound to fall even lower.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "October 21, 2022, 09:54:08 PM",
      "body": "Quote from: JamesDaniel90 on October 21, 2022, 06:57:04 AMI started buying Gala in January at 30p and it has recently dropped below 3p for the first time in over a year and I am wondering if I should keep DCA or cool off for a bit? I have always believed it had great potential however at a 95% drop since its all time high it has got me wondering why such a drop? I know we are in a bear market but there are not many others that have dropped 95% and I am beginning to doubt if it is going to be as big as I thought it would be. I have been buying weekly since the crash in June which has now given me an average buy of £0.055 which is pretty good but I have always thought Gala would reach £2 next bull run minimum but am not so sure now. Just wondering what everyone thinks on this project and its potential in the next bull run?After seeing the downward trajectory of that coin for more than a year my recommendation is that you decide already how much money you want to invest in that coin, invest that money in it and then forget about it, the coin is already trading for a price 96% lower than its all time high, doing DCA makes no sense when its value is already that low, now I do not really know if the coin will get to your desired levels during the next bull run, but if the coin is still around by that time there is a chance that it could happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}