{
  "id": "topic_5471371",
  "title": "Mr_HoDL58",
  "author": "Mr_HoDL58",
  "created_time": "October 23, 2023, 05:14:03 PM",
  "content": "IntroductionWhat is Pactus?Pactus is a Blockchain focused on decentralizationPactus is built on the principle that a fair and transparent system can only be achieved through decentralization. Unlike many other blockchain platforms, Pactus aims to eliminate the potential for centralization and manipulation by removing the need for delegation and miners. This allows anyone to become a part of the ecosystem and ensures that the platform remains truly decentralized.Pactus is user-friendly Pactus aims to create a user-friendly blockchain that can be easily used by anyone, not just tech experts. Our protocol is designed to be simple, easy to maintain, and develop. Pactus offers a simple GUI application that makes it easy for users to run a node.Pactus uses a percentage-based fee modelTransaction fees are calculated based on a percentage model with a minimum and maximum fee. These parameters provide greater control over the fee structure and prevent overpaying or underpaying. The percentage-based model ensures fairness and predictability, and can be adjusted through consensus among all validators.Testnet-2: A New Chapter for Pactus Blockchain!We are thrilled to announce the launch of Testnet-2, a pivotal step in our mission to create a faster, safer, and more stable blockchain. Your unwavering support and active participation has been invaluable.Testnet-2 Launch Discover what Testnet-2 brings to the table and get ready to be part of the future of blockchain. Learn more: https://pactus.org/2023/10/15/testnet-2-launched.htmlTestnet-2 DetailsValidators participating in Testnet-2 will receive rewards of up to 100PAC on the Mainnet launch. The calculation will be based on [Total Stakes] / 10. Please note that only stakes by the first validator will be counted.How to ParticipatePlease visit our Github repository and install the latest version of Pactus v0.15.1. We have supported the majority of operating systems and have GUI and CLI available. Github: https://github.com/pactus-project/pactus/releases/tag/v0.15.1After you have installed the latest software and your node is fully synced, please head on over to our discord and register using your Discord ID through our Discord bot and receive 100 TestPAC.Discord: https://discord.gg/H5vZkNnXCuDisclaimerTestPAC is designated exclusively for Testnet use and cannot be converted to PAC. This same method will be used for the distribution of PAC in the future, so please ensure the security of your Discord ID.If you have any questions or need help to install, our Discord friendly admins will be glad to assist you. We hope you enjoy using the Pactus Discord Bot and look forward to seeing you on Testnet-2!LinksWebsite - https://pactus.orgGithub - https://github.com/pactus-projectOfficial Block Explorer - https://pacscan.org/Community Developed Block Explorer - https://explorer.codeblocklabs.com/pactus/Discord - https://discord.gg/H5vZkNnXCuTwitter - https://x.com/pactuschain/Telegram - https://t.me/pactusblockchainBest Regards,Team Pactus",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471371",
  "comments": [
    {
      "author": "MMOStars",
      "created_time": "October 24, 2023, 03:02:38 AM",
      "body": "Change your logo, who ever made it literally stole it off digibyte, if it's AI generated, get a new 1. https://www.google.com/search?q=digibite+logo&oq=digibite+logo&gs_lcrp=EgZjaHJvbWUyBggAEEUYOTIJCAEQABgNGIAEMgoIAhAAGIYDGIoFMgYIAxBFGEDSAQgyMzc1ajBqMagCALACAA&sourceid=chrome&ie=UTF-8",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr_HoDL58",
      "created_time": "October 25, 2023, 01:05:26 AM",
      "body": "New update has just been released. v0.15.2If you are running v0.15.1 please update to latest v0.15.2 with link below.https://github.com/pactus-project/pactus/releasesBest Regards,Team Pactus",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr_HoDL58",
      "created_time": "October 26, 2023, 01:36:17 PM",
      "body": "Final CountdownWe thank you for your oustanding support. Pactus now has a total of 469 validators.Only 31 more spaces available. If you wish to become a validator, time is of the essence.Best Regards,Team Pactus",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr_HoDL58",
      "created_time": "October 27, 2023, 01:10:01 PM",
      "body": "500 Validators Reached & Campaign Closed We wanted to take a moment to express our immense gratitude to each and every one of you. In just 11 days, we've reached a fantastic milestone – 500 validators strong! This incredible achievement wouldn't have been possible without your unwavering support and dedication. With 500 slots filled, the Testnet-2 500 Validators Campaign is now closed.For those who didn't manage to join, we extend our heartfelt thanks for your interest. While the campaign is full for now, please stay connected with us for the latest updates. We might extend the campaign in the future, or more exciting opportunities could arise. We're not certain about the specifics, but what's important is to keep you as part of our community. We value each one of you, and we don't want you to miss out on any future endeavors.Our dedicated team will continue to monitor and enhance the network to ensure you all have the best experience. Your trust means the world to us, and we're committed to delivering the best.We also want to remind everyone of the importance of keeping your nodes running. By doing so, you contribute to the stability and growth of the network and also enjoy increasing rewards.If you have any questions, thoughts, or simply want to chat, don't hesitate to reach out to our friendly Team. We're here to help and engage with you.Discord - https://discord.gg/H5vZkNnXCuBest Regards,Team Pactus",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davidjonesss",
      "created_time": "October 27, 2023, 05:19:12 PM",
      "body": "Quote from: Mr_HoDL58 on October 25, 2023, 01:05:26 AMNew update has just been released. v0.15.2If you are running v0.15.1 please update to latest v0.15.2 with link below.https://github.com/pactus-project/pactus/releasesbloxd ioBest Regards,Team PactusHow about Pactus 0.15.0? Do I need update?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}