{
  "id": "topic_5415632",
  "title": "ChiBitCTy",
  "author": "ChiBitCTy",
  "created_time": "October 01, 2022, 07:09:02 PM",
  "content": "🎃 Fall is upon us here in the US, and with fall comes Halloween and pumpkin EVERYTHING (pie, lattes, candles, candies, even canned ham pumpkin spam lol).   I proposed a bitcoin pumpkin carving contest a few years ago and got some participation/feedback but kind of posted it too late and nothing materialized of it ( https://bitcointalk.org/index.php?topic=5192115.msg52727116#msg52727116 ). So with that said, I wanted to get an interest check and see how many people would be interested in participating. I would put up some pretty cool prizes for the winner. Im not 100% sure yet what I would put up prize wise, but I can promise it would be worth your time, plus , it’s fun! I know pumpkins don’t grow all over the world so any other type of gourds would be acceptable as well (or doing a mix of both even, be creative!). If there’s enough interest I will follow up with an official thread..so what say you .. 🎃 Other types of gourd examples",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415632",
  "comments": [
    {
      "author": "Kryptowerk",
      "created_time": "October 01, 2022, 08:03:54 PM",
      "body": "Just wanna say, love the idea. My next few weeks are just so incredibly packed so not sure if I can participate.If there's enough interest and participants and some cool ideas coming up I would maybe throw in one or two tiny prizes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MoparMiningLLC",
      "created_time": "October 01, 2022, 08:12:49 PM",
      "body": "What if I 3dprint one?I abhor Halloween and never celebrate it but a 3d printed one with bitcoin theme might be fun",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptogreatdane",
      "created_time": "October 01, 2022, 09:38:05 PM",
      "body": "Yessssssss.. I love Halloween. I take a week off of work every year and set up an outdoor haunted house at my place. Give out the full size candy bars and everything. So needless to say im in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptogreatdane",
      "created_time": "October 01, 2022, 09:39:36 PM",
      "body": "Quote from: MoparMiningLLC on October 01, 2022, 08:12:49 PMWhat if I 3dprint one?I abhor Halloween and never celebrate it but a 3d printed one with bitcoin theme might be fun  What! No Halloween. You must spend all this time getting your santa suit ready and the reindeer ready?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSlyy",
      "created_time": "October 02, 2022, 04:55:21 AM",
      "body": "Considering I was not on the bitcointalk forums initially when I carved this pumpkin in 2017, I see now is my chance to finally show it off in the correct community!  I will not be carving a bitcoin themed pumpkin this year, but here's some motivation for those who are partaking!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JanEmil",
      "created_time": "October 02, 2022, 06:30:50 AMLast edit: October 02, 2022, 12:15:07 PM by JanEmil",
      "body": "Have no skills but will try to make a BTC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Remsjack",
      "created_time": "October 02, 2022, 08:20:59 AM",
      "body": "You know what? That’s a great idea, count me in",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bullion-n-BTC",
      "created_time": "October 02, 2022, 03:39:21 PM",
      "body": "I’m in for sure",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChiBitCTy",
      "created_time": "October 02, 2022, 05:51:44 PM",
      "body": "Quote from: MoparMiningLLC on October 01, 2022, 08:12:49 PMWhat if I 3dprint one?I abhor Halloween and never celebrate it but a 3d printed one with bitcoin theme might be funI like the idea but only if it were in conjunction with carving a pumpkin. That’s the one rule, has to include a physical pumpkin/gourd. Quote from: Kryptowerk on October 01, 2022, 08:03:54 PMJust wanna say, love the idea. My next few weeks are just so incredibly packed so not sure if I can participate.If there's enough interest and participants and some cool ideas coming up I would maybe throw in one or two tiny prizes.Kryptowerk that would be great, but even better if you participate!!Looks like we’ve got some decent feedback and interest. A few more and I’ll write up the announcement thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Suzuki Matt",
      "created_time": "October 02, 2022, 06:29:39 PM",
      "body": "Wow this is such a cool idea. I have literally never carved a pumpkin so I wont be participating but will definitely be watching this is so cool. Great Idea!!! If I had some merit I would give you some.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "October 02, 2022, 07:18:01 PM",
      "body": "Quote from: Suzuki Matt on October 02, 2022, 06:29:39 PMWow this is such a cool idea. I have literally never carved a pumpkin so I wont be participating but will definitely be watching this is so cool. Great Idea!!! If I had some merit I would give you some. Me neither Matt, but I will definitely participate in this for sure.@ChiBitCTy I assume any type of squash as per the image in the OP?Along with carving a pumpkin or suitable squash I will be cooking a spicy Mexican squashand bean Bitcoin soup . . . hopefully...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oasisman",
      "created_time": "October 06, 2022, 10:50:14 AM",
      "body": "The kind of pumpkin we have here in PH.I have not tried carving before, but I would love to try it this time and would also like to participate. I can draw both traditional and digital, so this competition kinda challenged my artistry lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChiBitCTy",
      "created_time": "October 07, 2022, 04:02:33 PM",
      "body": "Quote from: Oasisman on October 06, 2022, 10:50:14 AMThe kind of pumpkin we have here in PH.I have not tried carving before, but I would love to try it this time and would also like to participate. I can draw both traditional and digital, so this competition kinda challenged my artistry lol. Yeah these would definitely work. I want people to get creative. The only rule is that there has to be a pumpkin or gourd of some type included. What you want to do in conjunction with that is up to you. 3D printed stuff, NFTs, etc etc.I will set up the announcement thread tomorrow. Again I will have some cool prizes! Hopefully more people will be interested in jump in!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}