{
  "id": "topic_5476435",
  "title": "Junoto",
  "author": "Junoto",
  "created_time": "December 04, 2023, 03:31:44 AM",
  "content": "I have seen many cases of fraudulent projects on this forum https://bitcointalk.org/index.php?board=83.0What I want to ask you is how many times have you been caught in a scam project?And what factors deceived you?Please share your experience with me so that I can be careful in the world of cryptocurrency.Thanks.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476435",
  "comments": [
    {
      "author": "BabyBandit",
      "created_time": "December 04, 2023, 04:51:05 AM",
      "body": "Scamming is something the most of us hate and with all right to do so! I give all my respect and power to the scam hunters on the internet, myself have never been scammed here or been involved in a scam.Since I am a active P2P trader I have been scammed sometimes tho, never on this platform but on other ones where P2P-trading is the main thing. But I have added a thinking into everything. That I never should allow myself to get fooled twice in the same way. I always remember the things to not do. So have I get scammed? Yes. Have I get scammed the same way twice? Never.. It's very sad but you cant trust anyone on the internet when it involving money, always play your hand safe!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "December 04, 2023, 05:26:14 AM",
      "body": "The worst scams in my opinion are phishing scams and the scams going on on twitter.Phishing is bad because if you use Coinbase or Kraken or any decent exchange you might get an alert from them and think it’s legit. You will click it without thinking and get sent to a phishing website. This is because they spam everyone even people not in crypto and eventually run into people that use the exchange and fall for it.Twitter is second because they got those fake, send 1 BTC and get back 2 BTC which are pretty convincing. Because if you check the block explorer you will see people send them BTC and get back double, however it just bots and eventually someone will fall for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Litzki1990",
      "created_time": "December 04, 2023, 05:44:01 AM",
      "body": "So far we have come to know about many scams and many scams have been discussed in this forum. The biggest fraud I have seen and known is the SBF fraud. The fraud committed by FTX is considered to be one of the biggest frauds ever. Investors have lost huge amounts of money due to this scam and many investors have lost confidence in crypto platforms and exchanges. Mixer campaigns have cheated but those cheats are nothing compared to the FTX cheat because the FTX cheat is one of the biggest cheats I have ever seen. SBF was heavily penalized for this massive fraud even though investors did not get their money back due to his conviction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "December 04, 2023, 07:04:10 AM",
      "body": "Quote from: Junoto on December 04, 2023, 03:31:44 AMI have seen many cases of fraudulent projects on this forum https://bitcointalk.org/index.php?board=83.0What I want to ask you is how many times have you been caught in a scam project?You mean how many times have you been scammed? We can all be scammed, but the more we know, the more expensive it is to scan us, but in the end, it is not shameful to be scammed, and it is stupid to be scammed in the same way over and over again.As for the worst scam, it is the social attacks and Ponzi schemes in which your friend tells you that you will become rich and invest your money, and suddenly you discover that you and your friend have been defrauded, and their danger is that they may cause social problems in addition to scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "December 04, 2023, 08:37:34 AM",
      "body": "Scammers are everywhere and they don't stop their scam activities because it already becomes their scam habit. They love it, addict it and will not stop scamming others.If you are not too greed, even you don't have basic or deep technical knowledge, you can avoid scam. People were scammed not mostly because they don't have knowledge or experience but mainly because they were too greed. When they were too greed, they will be led by scammers and lose money.Scam common scam types.Collection of comprehensive guides on identify and avoid scam projects",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "December 04, 2023, 01:55:28 PM",
      "body": "Quote from: Junoto on December 04, 2023, 03:31:44 AM~Please share your experience with me so that I can be careful in the world of cryptocurrency.Thanks.I can't remember the last time I got scammed TBH. I don't know if I got scammed even when I was still a newbie or not.Maybe I can consider that I got scammed when I invested in those new projects (ICOs) and ended up as a failed project. I guess that's the one part that I got scammed, but aside from that, I never get scammed by these stupid scammers. What I did is before investing, I already watched numerous Youtube videos, and read some threads here regarding tips and tricks on how not to get scammed. At that time, lots of scam projects were emerging, and most of them had the red flags that I just watched or read. Until now, whenever I see new projects, I always think that they are a scam at first because nowadays, investing in new projects is very hard because the chances of you getting scammed are at their highest. Though I've missed many opportunities not to invest in new projects because I'm always hesitant, I'm not feeling any regret at all.There are many ways for a scammer to scam you. Most of them are very common especially if you've seen lots of them already. Learn more about how these scammers are doing, and you will not get scammed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "terrific",
      "created_time": "December 04, 2023, 02:05:50 PM",
      "body": "Quote from: Junoto on December 04, 2023, 03:31:44 AMAnd what factors deceived you?This was long time ago and I've been with the herd that where people go, I also go. I've learned my mistake and that's not to be reliant to everyone.A crowd that says that something is good to invest, it could have been the same people all over again that's being shilled to the community.So don't be too gullible when you're an investor and it's not always a good day to invest when you have just found a new project, as we say, DYOR.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "traderethereum",
      "created_time": "December 04, 2023, 03:01:17 PM",
      "body": "I don't really remember how many times I got caught in a scam project because I don't want to feel sad remembering it. Just let the scam project go and we have to look for other, more promising projects. What often happens is that there is no payment when the time comes for payment because the developer and his team run away with the investor's money.We can't do anything because it's beyond what we expected. After all, the scam project can happen anytime and anywhere without us knowing. Even BM didn't know that their project would later become a scam and they would also become victims.We can only be careful in choosing the project and always look for information from many places and compare it. And if necessary, we can also find out through the official channels of the project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "December 04, 2023, 05:56:21 PM",
      "body": "Quote from: Junoto on December 04, 2023, 03:31:44 AMI have seen many cases of fraudulent projects on this forum https://bitcointalk.org/index.php?board=83.0What I want to ask you is how many times have you been caught in a scam project?And what factors deceived you?Please share your experience with me so that I can be careful in the world of cryptocurrency.Thanks.In order to avoid scams, always deal with oldest sites, or sites with good feedbacks or reputations. These types of sites hardly to any scams. The scams are mostly seen with new sites. These new sites offer attractive promotions or offers, for which many newbies fall for them and hence get scammed. So basically you need to be careful yourself in order to be saved from scams. I haven’t been scammed till now by God’s grace, but yes that doesn’t mean I won’t remain careful any longer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "December 04, 2023, 06:03:27 PM",
      "body": "It’s so amusing for me to see this topic because I was just scammed yesterday, you can’t imagine the amount of scammers and the different ways and types of scam online. Just in here, Bitcointalk forum you may find many scammers that are trying to phish and steal your wallet, steal you BTT account or even have access to your device.Some methods are old school and easy to notice and catch, but some methods are very tricky and manipulative, in some point scam is something that made think how people can be smart just for money. Starting here from the perfect looking projects they build and design to trick people, one time they made me download their good looking web3 game combined with a virus or a code that stole my wallet keys and assets inside.I wish one day we have topics with all lessons and warnings explaining all the scam methods and how to avoid being a victim before it’s late. Some people are dealing with millions of dollars and their life savings so imagine they get stolen by a scammer?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "December 04, 2023, 06:10:59 PM",
      "body": "Quote from: Junoto on December 04, 2023, 03:31:44 AMI have seen many cases of fraudulent projects on this forum https://bitcointalk.org/index.php?board=83.0What I want to ask you is how many times have you been caught in a scam project?And what factors deceived you?Please share your experience with me so that I can be careful in the world of cryptocurrency.Thanks.Many times before but due to my participation on bounty campaigns which I failed to cash out my tokens before the project turns to scam because I have high hope that it will be successful.But for a scam project that I purchased, I guess I have one time when I purchase LUNA the moment it initially dump the price from 100$ to 5$. I thought it will still recover until my 4K$ turns to penny when LUNA price goes beyond zero and airdrop to a much worst LUNC token.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Timmzzy",
      "created_time": "December 04, 2023, 06:13:22 PM",
      "body": "Quote from: Junoto on December 04, 2023, 03:31:44 AMI have seen many cases of fraudulent projects on this forum https://bitcointalk.org/index.php?board=83.0What I want to ask you is how many times have you been caught in a scam project?And what factors deceived you?Please share your experience with me so that I can be careful in the world of cryptocurrency.Thanks.I only do projects that comes from BOUNTYPORTAL, BOUNTY DETECTIVE, JCHAMPAIGNS, BRANBOSS, WAPINTER aside these ones I just mentioned every other projects or bounty campaigns that's not managed by these ones I mentioned I don't do them...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Assface16678",
      "created_time": "December 04, 2023, 10:44:23 PM",
      "body": "Quote from: AbuBhakar on December 04, 2023, 06:10:59 PMQuote from: Junoto on December 04, 2023, 03:31:44 AMI have seen many cases of fraudulent projects on this forum https://bitcointalk.org/index.php?board=83.0What I want to ask you is how many times have you been caught in a scam project?And what factors deceived you?Please share your experience with me so that I can be careful in the world of cryptocurrency.Thanks.Many times before but due to my participation on bounty campaigns which I failed to cash out my tokens before the project turns to scam because I have high hope that it will be successful.But for a scam project that I purchased, I guess I have one time when I purchase LUNA the moment it initially dump the price from 100$ to 5$. I thought it will still recover until my 4K$ turns to penny when LUNA price goes beyond zero and airdrop to a much worst LUNC token.Well, that's unfortunate. I guess many of us here experience something similar to yours: getting scammed by a project, and it can be seen in the situation here. Anyway, now that you've experienced it, I'm sure you know how to avoid it if you find another project. It's safer to join a project with many participants or a trusted project, like those projects or, let's say, signature campaigns that do a lot of rounds of projects. Honestly, I still don't encounter being scammed because before they do, I know that they are not trustworthy, and before I join, I conduct research and background checks on the project because I don't like wasting my time and effort on something that doesn't benefit me. So even though there are sections here in bitcointalk that flagged those scams, there are still many users here being scammed, and not just here in this forum. I'm sure many are being scammed outside of this forum, and in relation to crypto currency, as many have malicious intents, take the opportunity, so it will depend on how secured and careful we are.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "December 05, 2023, 01:02:28 AM",
      "body": "If I'm not wrong, you're asking if one of us have been scammed? as for me, not yet and I hope it stays that way.The trick is to: 1. Play it safe as much as possible, in short, stick to what has been effective for a long time, then the chances of getting duped will be less likely. 2. Be informed of the blatant scams. There are a shit ton of these that keep on popping up but they're the easiest to avoid IMO because they're formulaic e.g. too good to be true returns, obscure AF, unsustainable business model, unprofessional, etc.3. Make an effort to improve your personal security and privacy as they're all correlated in some ways.Lasty, try to always ask here if you're not sure!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "December 05, 2023, 05:23:28 AM",
      "body": "Quote from: Junoto on December 04, 2023, 03:31:44 AMI have seen many cases of fraudulent projects on this forum https://bitcointalk.org/index.php?board=83.0What I want to ask you is how many times have you been caught in a scam project?And what factors deceived you?Please share your experience with me so that I can be careful in the world of cryptocurrency.Thanks.The biggest scam is the ICO where developers get huge amounts of money from investors and use that money to pump the market and dump tokens/coins that they hold on the market so that the price drops very deeply and after that they just throw away their project without ever realizing what has been mentioned in the whitepaper, and the developer will repeat with a new project using a different name and photo, I don't remember how many people lost in the ICO but that is stupidity that has happened in the crypto world because of the many ICO coins maybe only 1% are still there with good development.Caution is important but you are very likely to get scammed because fraudsters will use new methods, never trust people we know in the online world especially if they promise hundreds of percent profits because that is the most common fraud.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "December 05, 2023, 06:30:39 AM",
      "body": "The issue is that some pushed themselves into scam projects either by the advert they see in other social media platforms such as twitter, Instagram, Facebook and telegram and telegraph, most especially in twitter where cryptocurrency influencers and investment influencers will come in to ensure that they deceived you, so I believe that what makes people to be a victim of scam is because of the information they obtain and secondly when you are desperate to achieve something else you will be easily been scammed.Myself I have escape many scam and that is what makes me I have not recorded any scam or be a victim of scam before, whenever you see a scammer you will know, even in cryptocurrency projects like altcoins projects you will know that this is a scam, the reason while some of us doesn't detect scam is that we are desperate to venture into that or into what we see or what we heard of something without test running or investigate the stuff first...in any thing I'm doing I ensure I have make a proper consultation or research about the thing before I venture into it. So in summary we can be scam when we are desperate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peter0425",
      "created_time": "December 05, 2023, 12:28:37 PM",
      "body": "Quote from: Junoto on December 04, 2023, 03:31:44 AMI have seen many cases of fraudulent projects on this forum https://bitcointalk.org/index.php?board=83.0What I want to ask you is how many times have you been caught in a scam project?And what factors deceived you?Please share your experience with me so that I can be careful in the world of cryptocurrency.Thanks.Never that I become one (at least not from investing ok? as it was your question all about?) i was being scammed by Airdrop and some ICO bounty in the past in which the dev did not pay us for our works, and others have pays us but with their trash token that did not reached the exchange meaning has no meaning at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Junoto",
      "created_time": "December 05, 2023, 12:43:44 PM",
      "body": "Quote from: Strongkored on December 05, 2023, 05:23:28 AMQuote from: Junoto on December 04, 2023, 03:31:44 AMI have seen many cases of fraudulent projects on this forum https://bitcointalk.org/index.php?board=83.0What I want to ask you is how many times have you been caught in a scam project?And what factors deceived you?Please share your experience with me so that I can be careful in the world of cryptocurrency.Thanks.The biggest scam is the ICO where developers get huge amounts of money from investors and use that money to pump the market and dump tokens/coins that they hold on the market so that the price drops very deeply and after that they just throw away their project without ever realizing what has been mentioned in the whitepaper, and the developer will repeat with a new project using a different name and photo, I don't remember how many people lost in the ICO but that is stupidity that has happened in the crypto world because of the many ICO coins maybe only 1% are still there with good development.Caution is important but you are very likely to get scammed because fraudsters will use new methods, never trust people we know in the online world especially if they promise hundreds of percent profits because that is the most common fraud.This is very beneficial for my future, if I check your profile, you have joined this forum since 2015. I'm sure you've experienced and come a long way. May I ask for advice so that I can be like you and how to improve on this forum, considering that I am still a beginner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Peanutswar",
      "created_time": "December 05, 2023, 12:51:04 PM",
      "body": "During my newbie era I was so curious about a lot of things and of course, being a newbie before you want to gain knowledge by joining in different discussions related, to forums, channels and of course there are some scam projects right there that they keep promoting, once you invest in being a late comer, or getting trapped with your asset while seeing the price of the coin you bought to them getting dump I experience these too that's why I avoid that before you can see those scam projects telling that they can double your money instantly and make an ROI in just a week without hassle, people expecting this as crypto being easy to earn why they commit here like the story of other people but not as always it happens. Sooner or later you'll recognize scam projects with their actions and promotions now getting wise is a must in investing not all projects promote a good long-term profit. Even using social media now hack accounts promoting give away of coins once you make deposit old strategy still there's a lot of victim giving awareness to newbies is a must why people keep posting here to avoid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}