{
  "id": "topic_5464704",
  "title": "krishnaverma",
  "author": "krishnaverma",
  "created_time": "August 27, 2023, 03:25:02 AM",
  "content": "OnlyFans invested some of its profits in Ethereum. As a result, they have collected over $45 million as dividends so far. Very cool strategy I think and more companies should follow this to increase they revenue and  profits. What is your opinion about this ? Sourcehttps://www.standard.co.uk/business/onlyfans-owner-collects-485-million-in-dividends-invests-in-ethereum-after-revenues-top-1-billion-cryptocurrency-b1102770.html",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464704",
  "comments": [
    {
      "author": "Tytanowy Janusz",
      "created_time": "August 27, 2023, 05:58:14 AM",
      "body": "Quote from: krishnaverma on August 27, 2023, 03:25:02 AMOnlyFans invested some of its profits in Ethereum. As a result, they have collected over $45 million as dividends so far. Very cool strategy I think and more companies should follow this to increase they revenue and  profits. What is your opinion about this ? It's hard to assess without knowing the size of the investment and the paper loss/profit. Currently, staking pays 3.3% per year, which is less than weekly volatility on ETH. 3.3% APY is less than US bonds currently pay, and the ETH price has been falling for almost 2 years, so the entire investment is probably in the red.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandji02",
      "created_time": "August 27, 2023, 07:09:23 AM",
      "body": "I think that's kinda funny. On one hand, I can't respect those who uses OnlyFans on both sides of it. On the other hand, it's a good marketing for crypto and more money that flows into the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "August 27, 2023, 07:49:48 AM",
      "body": "That’s awesome, he is a very smart guy. I don’t have an account but obviously I’m aware of what it is. That guy must be so wealthy, good luck to him though. Shame he didn’t buy bitcoin though, that’s one thing I’d say he could do better with his business plans.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "August 27, 2023, 08:03:17 AM",
      "body": "The content of the article did not mention the investment they made, the investment period, and when they bought or sold, but the source says he has collected some $485 million in dividends since the start of last year, and the amount that was mentioned is $45 million, so I assume they invested about 10% of the money which they collected in Ethereum.QuoteIn its accounts the company said it had invested some of its capital into the cryptocurrency Ethereum.Why Ethereum, I mean Bitcoin is better.If all companies did this and invested 10%, then Bitcoin could easily reach the capacity of the gold market, reaching 10 trillion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dbshck",
      "created_time": "August 27, 2023, 08:12:34 AM",
      "body": "Quote from: krishnaverma on August 27, 2023, 03:25:02 AMOnlyFans invested some of its profits in Ethereum. As a result, they have collected over $45 million as dividends so far. Very cool strategy I think and more companies should follow this to increase they revenue and  profits. What is your opinion about this ? Sourcehttps://www.standard.co.uk/business/onlyfans-owner-collects-485-million-in-dividends-invests-in-ethereum-after-revenues-top-1-billion-cryptocurrency-b1102770.htmlSurprisingly smart move there, and it could actually be a boost for the whole crypto scene. More companies are starting to realize that cryptocurrencies like Bitcoin and Ethereum are solid investments and can hold value well. A few years ago it was just MicroStrategy making all the noise about them buying millions of Bitcoin. Now, others are joining in, even if they're not throwing in as much money as Saylor. The crypto market could definitely use some fresh funds, especially after taking hits from defaults and frauds like FTX. These new investments from companies outside the crypto space might be just the thing it needs.On a different note, I'm kinda amazed that OF has an annual revenue of over a billion dollars with a profit margin of over 50%. What a business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "August 27, 2023, 08:26:14 AM",
      "body": "The information of OnlyFans annual report can be seen at: https://find-and-update.company-information.service.gov.uk/company/10354575/filing-history. Its owner did not get a whopping $485 million in dividends mainly due to Ethereum's investment. This is truly exaggerated news and falsifies Ethereum's investment contribution to the company's financial report where in fact, their business is the one truly thriving.Quote from: Tytanowy Janusz on August 27, 2023, 05:58:14 AMIt's hard to assess without knowing the size of the investment and the paper loss/profit. Currently, staking pays 3.3% per year, which is less than weekly volatility on ETH. 3.3% APY is less than US bonds currently pay, and the ETH price has been falling for almost 2 years, so the entire investment is probably in the red.Indeed, they got impairment losses.https://find-and-update.company-information.service.gov.uk/company/10354575/filing-history/MzM5MDY3MzE3MWFkaXF6a2N4/document?format=pdf&download=0. See pages 31 and 44 where they list the ETH investment as an intangible asset.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "August 27, 2023, 07:07:44 PM",
      "body": "Quote from: Tytanowy Janusz on August 27, 2023, 05:58:14 AMQuote from: krishnaverma on August 27, 2023, 03:25:02 AMOnlyFans invested some of its profits in Ethereum. As a result, they have collected over $45 million as dividends so far. Very cool strategy I think and more companies should follow this to increase they revenue and  profits. What is your opinion about this ? It's hard to assess without knowing the size of the investment and the paper loss/profit. Currently, staking pays 3.3% per year, which is less than weekly volatility on ETH. 3.3% APY is less than US bonds currently pay, and the ETH price has been falling for almost 2 years, so the entire investment is probably in the red.Maybe the investment is in the red now, but if they are sticking the staking rewards and not cashing out then this could be an incredibly profitable move for the company. However, you are right. They probably lost at least 200 million dollars from this investment at current valuations just doing a quick guess while looking at the numbers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "August 27, 2023, 07:24:56 PM",
      "body": "Quote from: Husires on August 27, 2023, 08:03:17 AMThe content of the article did not mention the investment they made, the investment period, and when they bought or sold, but the source says he has collected some $485 million in dividends since the start of last year, and the amount that was mentioned is $45 million, so I assume they invested about 10% of the money which they collected in Ethereum.QuoteIn its accounts the company said it had invested some of its capital into the cryptocurrency Ethereum.Why Ethereum, I mean Bitcoin is better.If all companies did this and invested 10%, then Bitcoin could easily reach the capacity of the gold market, reaching 10 trillion.I guess it's a matter of preference. and what you are looking from the asset.  ETH could be freaking huge in the future when it has a monopoly as a platform for dapps.But \"if everyone invested into bitcoin, it would moon\" isn't really optimal way to look potential valuation. It could be said about any investment and it's more of hopeful thinking. Nothing that has happened so far doesn't suggest altcoins would go away. In fact quite an opposite. And you have to admit that this was a good investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "August 27, 2023, 08:43:56 PM",
      "body": "I think I remember him as I say him on a TikTok video about the guy who makes content about asking people what they do for a living. I just can't remember if he has said something about crypto. But $45M is certainly a huge amount of money just for the dividends so I can't imagine how much was the capital. Usually with these CEOs/owners, they're just expanding their wealth and invests it somewhere that could generate them more money. As his platform keeps on making money and became a popular platform for the adults, he's just free to invest anywhere all of his wealth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "krishnaverma",
      "created_time": "August 28, 2023, 03:17:32 AM",
      "body": "Quote from: Husires on August 27, 2023, 08:03:17 AMThe content of the article did not mention the investment they made, the investment period, and when they bought or sold, but the source says he has collected some $485 million in dividends since the start of last year, and the amount that was mentioned is $45 million, so I assume they invested about 10% of the money which they collected in Ethereum.QuoteIn its accounts the company said it had invested some of its capital into the cryptocurrency Ethereum.Why Ethereum, I mean Bitcoin is better.If all companies did this and invested 10%, then Bitcoin could easily reach the capacity of the gold market, reaching 10 trillion.Yes, the article I linked focuses more on the revenue of the company and not the money they invested to earn dividends.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "August 28, 2023, 12:10:39 PM",
      "body": "Quote from: vv181 on August 27, 2023, 08:26:14 AMIndeed, they got impairment losses.https://find-and-update.company-information.service.gov.uk/company/10354575/filing-history/MzM5MDY3MzE3MWFkaXF6a2N4/document?format=pdf&download=0. See pages 31 and 44 where they list the ETH investment as an intangible asset.As I was expecting such services, they will not achieve huge profits from side investments, while their primary investment is still attractive to many. What is surprising is that they continue to invest and do not sell their share after all these declines. If all companies did that and put only 5% of their net worth, it would be a point. real change in price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "August 28, 2023, 01:21:16 PM",
      "body": "Quote from: krishnaverma on August 27, 2023, 03:25:02 AMOnlyFans invested some of its profits in Ethereum. As a result, they have collected over $45 million as dividends so far. Very cool strategy I think and more companies should follow this to increase they revenue and  profits. What is your opinion about this ? Sourcehttps://www.standard.co.uk/business/onlyfans-owner-collects-485-million-in-dividends-invests-in-ethereum-after-revenues-top-1-billion-cryptocurrency-b1102770.htmlThat is really nice. Someone is actually paying off the books and investing their money into other portfolios. This gives more space for the money to grow since this way they are having additional business apart from the principal business which is OnlyFan. Many companies do not believe in investing one business's revenue into the other because it can collapse the company's assets for that micro economic circle. It's true in the marketing language but obviously OnlyFan seems to be making huge progress by going out of the box. Overall my opinion is fantastic about the strategy of OnlyFans. They had plenty of money, they re-invested it boldly into the other market and they gained huge revenue out of it. That is definitely a perfect win for them. I believe they did not invest in Bitcoin because Bitcoin is being a slow mover right now and hasn't shown much progress this year. Definitley they had all the thoughts before investing into an altcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AakZaki",
      "created_time": "August 28, 2023, 04:21:48 PM",
      "body": "The founder of Onlyfans is smart enough to invest brand assets into crypto ETH, it will be multi-benefit, let alone enter into ETH at a price that is still affordable. It's no wonder why they chose ETH because ETH is the king of Altcoins which is in second place after Bitcoin. $45m is a huge amount and it will be a driving force for crypto adoption especially in the ETH ecosystem. Maybe later there will be payments using ETH or other crypto on Onlyfans",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "August 28, 2023, 05:03:10 PM",
      "body": "Haha, now we are waiting for ETH integration as payment for viewing nude photos. Not a bad ETH adoption, as the service is insanely popular all over the world. It only remains to calculate how many OnlyFans subscribers need such kind of payment as cryptocurrency payment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "August 30, 2023, 03:08:25 PM",
      "body": "Quote from: Husires on August 28, 2023, 12:10:39 PMQuote from: vv181 on August 27, 2023, 08:26:14 AMIndeed, they got impairment losses.https://find-and-update.company-information.service.gov.uk/company/10354575/filing-history/MzM5MDY3MzE3MWFkaXF6a2N4/document?format=pdf&download=0. See pages 31 and 44 where they list the ETH investment as an intangible asset.As I was expecting such services, they will not achieve huge profits from side investments, while their primary investment is still attractive to many. What is surprising is that they continue to invest and do not sell their share after all these declines. If all companies did that and put only 5% of their net worth, it would be a point. real change in price.Certainly, besides noting they are on impermanent losses there is not any causality with the amount of the recent dividend they got. OnlyFans' main business is a creator marketplace, not an investment firm. That should be clear enough. This thread made OP surely misleading.One thing interesting take is that OnlyFans were once adopted NFT into its platform back in 2022. I do not know how the current implementation and usage of it within the platform, but that case may suggest the reason why the company diversifies its capital to Ethereum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PIMPdev",
      "created_time": "August 30, 2023, 03:31:19 PM",
      "body": "Quote from: Xal0lex on August 28, 2023, 05:03:10 PMHaha, now we are waiting for ETH integration as payment for viewing nude photos. Not a bad ETH adoption, as the service is insanely popular all over the world. It only remains to calculate how many OnlyFans subscribers need such kind of payment as cryptocurrency payment.Imagine OnlyFans adopting ETH and it skyrockets. I wouldn't even be surprised.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "August 30, 2023, 05:18:02 PM",
      "body": "Ain't Michael Saylor doing the same thing with his MicroStrategy company? It does work according to him as long as you have the right number of invested cryptocurrencies and of course the money. I think he explained it well with one of his interviews and I actually learned a lot of things from that. A big chunk of the investors money are all going to Bitcoin and I believe most of his investors agreed at what he did.From taxations to other things that cryptocurrencies can do unlike just letting it die with fiat. There's really a huge difference and I think OnlyFans did the right thing too if ever they made a more money by investing in Ethereum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "September 04, 2023, 08:31:03 AM",
      "body": "Quote from: danherbias07 on August 30, 2023, 05:18:02 PMAin't Michael Saylor doing the same thing with his MicroStrategy company? It does work according to him as long as you have the right number of invested cryptocurrencies and of course the money. I think he explained it well with one of his interviews and I actually learned a lot of things from that. A big chunk of the investors money are all going to Bitcoin and I believe most of his investors agreed at what he did.From taxations to other things that cryptocurrencies can do unlike just letting it die with fiat. There's really a huge difference and I think OnlyFans did the right thing too if ever they made a more money by investing in Ethereum. I haven't heard that microstrategy had ever bought ETH. Saylor was/is a huge bitcoin maxi whale that bought like 30k btc when it was only under $4 per btc.It's true that he reportedly has said that he regrets not investing to eth instead. And apparently doesn't like other BTC maxis anymore. And i can totally understand why he regrets it especially now when he could stake eth. If he would sell his bitcoin, it would take forever if he doesn't want to crash the market, but if he would buy eth with his profits he could gain probably hundreds of millions dollars per year just by staking it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": ".gustafson",
      "created_time": "September 04, 2023, 09:27:06 AM",
      "body": "Smart move, indeed! Crypto investments can be a golden goose. It's a smart way to make your money work for you. 💰",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}