{
  "id": "topic_5460341",
  "title": "MaxMueller",
  "author": "MaxMueller",
  "created_time": "July 19, 2023, 02:20:50 PM",
  "content": "Da sich hier im Forum ja schon einige mit ChatGPT intensiver auseinandergesetzt haben (ich hab mich da noch nicht rangewagt), möchte ich mal eine Konkrete Aufgabenstellung geben:Schreibe eine Anleitung wie man mit Hilfe von ChatGPT eine Strategie in Tradingview aufsetzen lassen kann, die idealerweise folgenge Kriterien erfüllt:- geschrieben in PineScript Version=5- Backtestbar, d.h. Trades in Tradingview werden platziert (-> short und long Condition) - Im Live-betrieb werden für platzierte Trades auch Alarme ausgegeben- Strategie sollte auf mindestens 2 Indikatoren basieren (z.B. RSI + BB)- Strategie sollte zumindest grundlegendes Risiko- bzw. Moneymanagement skizzieren (TP, SL, Safety Orders, etc.)Als Prämie setze ich bis zu 1mBTC + 10 Merits aus, wobei ich mir vorbehalte die Beträge je nach Erfüllungsgrad der einzelnen Punkte nicht voll auszureizen. Ich freue mich auf den Input.  Belohnungen auf Beiträge werden so lange vergeben bis der Topf alle ist, also bekommt ggf. nicht nur der 1. was ab.Edit: die Prämie wird nach meinem Gutdünken auf alle bis 1.8. abgegebenen Beiträge verteilt. Denke so lässt sich der Nutzen für die Community maximieren.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460341",
  "comments": [
    {
      "author": "sam00",
      "created_time": "July 19, 2023, 09:04:21 PM",
      "body": "Mit ChatGPT habe ich schon einige Erfahrung gesammelt, mit Tradingview hingegen noch keine Das Problem bei ChatGPT ist ja, dass es einem eigentlich nur zuarbeitet. Man sollte sich hier auf keinen Fall darauf verlassen, dass das, was es einem so ausgibt auch wirklich korrekt ist. Ne Bewerbung schreiben lassen, ist ein gutes Beispiel. Man weiß ja prinzipiell was gut/schlecht ist aber einem fehlt teilweise die Kreativität oder Lust, lange Anschreiben zu verfassen. ChatGPT nimmt einem das einfach ab und im Anschluss korrigiert man ggf. einzelne Formulierungen, die einem nicht so gut gefallen.Nutzt man nun ChatGPT für eine Anleitung für eine Sache, mit der man sich selbst noch nicht auskennt, kann man ja nicht mal nachvollziehen, ob da nicht irgend ein fataler Fehler drin steckt. Diese Bounty ist aber jetzt ein Anlass, mich mal mit Tradingview auseinander zu setzen, um dann mein Wissen in Verbindung mit ChatGPT zu teilen.Ein Anreiz noch: Ich würde mich hierbei nicht nur auf ChatGPT fokussieren. ChatGPT ist ein Sprachmodell, das Informationen aus dem Internet auf Grund von Wahrscheinlichkeitsanalyse für den Nutzer zusammenfasst (grob vereinfacht beschrieben).Mittlerweile gibt es unzählige KI/AI Werkzeuge, die die Aufgabe vielleicht noch besser lösen könnten. Vielleicht stößt da ja jemand auf einme noch bessere Alternative.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "July 20, 2023, 12:28:09 AM",
      "body": "Erneut ein interessantes Gewinnspiel. Da ich keine Ahnung vom Coden habe, muss ich leider passen, finde die Idee aber trotzdem gut. Dennoch hat mich das Gewinnspiel auf eine Idee gebracht, nämlich ChatGPT ein paar Fragen für das Trading zu stellen. Und ChatGPT ist zielich schlau. Schaut, was es dazu schreibt: Wenn man bedenkt, dass ChatGPT immer extrem schwammig antwortet (bEidE seiTeN), ist diese Antwort dann doch eine ziemlich deutliche Abfuhr gegen die technische Chartanalyse...Merit reiche ich nach an euch beide.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "July 20, 2023, 01:31:14 PM",
      "body": "Jetzt habe ich mich mal bei Tradingview registriert und ChatGPT angeschmissen.Meine Erfahrungen bisher (der untenstehende Code ist von ChatGPT erstellt worden und zur besseren Lesbarkeit in ein Code-Block eingefügt, um keine seitenlagen Zitate hier zu posten):Ich habe ChatGPT mehr oder weniger einfach einen Ausschnitt aus dem OP geschickt und prompt kam das erste Skript dabei raus.Code://@version=5strategy(\"RSI + Bollinger Bands Strategy\", overlay=true)// Einstellungen für RSIrsi_length = input(14, title=\"RSI Length\")// Einstellungen für Bollinger-Bänderbb_length = input(20, title=\"BB Length\")bb_mult = input(2.0, title=\"BB Standard Deviation\")// Einstellungen für Moneymanagementrisk_per_trade = input(1.0, title=\"Risk per Trade (%)\") / 100take_profit_multiplier = input(2.0, title=\"Take Profit Multiplier\")stop_loss_multiplier = input(1.5, title=\"Stop Loss Multiplier\")// Berechnung des RSIrsi_value = rsi(close, rsi_length)// Berechnung der Bollinger-Bänderbasis = sma(close, bb_length)dev = bb_mult * stdev(close, bb_length)upper_band = basis + devlower_band = basis - dev// Bedingungen für Long- und Short-Tradeslong_condition = crossover(rsi_value, 30) and close > upper_bandshort_condition = crossunder(rsi_value, 70) and close < lower_band// Alarme für Long- und Short-Trades im Live-Betriebalertcondition(long_condition, title=\"Long Trade\", message=\"Long Trade - Entry\")alertcondition(short_condition, title=\"Short Trade\", message=\"Short Trade - Entry\")// Berechnung der Positionsgröße basierend auf dem Risiko pro Traderisk_amount = strategy.equity * risk_per_tradeposition_size = risk_amount / abs(close - close[1])// Take Profit und Stop Loss Levelstake_profit_level = strategy.position_avg_price * take_profit_multiplierstop_loss_level = strategy.position_avg_price * stop_loss_multiplier// Eröffnen von Long- und Short-Positionenif (long_condition)    strategy.entry(\"Long\", strategy.long, qty=position_size)    strategy.exit(\"Long TP/SL\", \"Long\", limit=take_profit_level, stop=stop_loss_level)if (short_condition)    strategy.entry(\"Short\", strategy.short, qty=position_size)    strategy.exit(\"Short TP/SL\", \"Short\", limit=take_profit_level, stop=stop_loss_level)// Sicherheitsstopp, um eine offene Position zu schließen, wenn der Kurs stark in die falsche Richtung läuftsecurity_stop = close * 0.95strategy.exit(\"Security Stop\", \"Long\", stop=security_stop)strategy.exit(\"Security Stop\", \"Short\", stop=security_stop)Quelle: ChatGPTDie Erklärung zum Skript selbst noch:Quote1. Die Strategie verwendet den RSI und die Bollinger-Bänder, um Long- und Short-Trades zu identifizieren.2. Im Live-Betrieb werden Alarme ausgegeben, wenn ein Long- oder Short-Trade platziert wird.3. Das Moneymanagement wird durch das Risiko pro Trade festgelegt, wodurch die Positionsgröße berechnet wird.4. Take Profit und Stop Loss Levels werden als Multiplikatoren des Eintrittspreises festgelegt.5. Es gibt auch einen Sicherheitsstopp, um eine offene Position zu schließen, wenn der Kurs stark in die falsche Richtung läuft. Quelle: ChatGPTSouverän wie ChatGPT das eben so präsentiert, habe ich es bei Tradingview eingefügt und mir sind erst einmal Syntaxfehler entgegen gesprungen Nachdem ich ChatGPT dann zwei mal darauf hingewiesen habe, dass der Code Syntaxfehler enthält (beim ersten Mal wurde nur ein Teil korrigiert), war dieser erst mal fehlerfrei.Beim kompilieren des Codes wurden noch noch zwei Warnungen angezeigt, dass die Alarme so nicht funktionieren würden im Strategie-Tester.Die Spannung war zu dem Zeitpunkt groß. Ich wollte sehen, ob die Strategie nun einen Millionengewinn eingefahren hat oder ob ich pleite wäre Ernüchternd war dann die Meldung, dass schlicht und ergreifend keine Trades platziert wurden.Ab dem Zeitpunkt habe ich ChatGPT noch 5 mal darauf hingewiesen, dass mit der Strategie keine Trades platziert werden und auch immer mal noch versucht, sinnvolle Informationen zur Verfügung zu stellen, die eventuell fehlen könnten.Das finale Skript sah dann irgendwann so aus:Code://@version=5strategy(\"RSI + Bollinger Bands Strategy\", overlay=true)// Einstellungen für RSIrsi_length = input(14, title=\"RSI Length\")// Einstellungen für Bollinger-Bänderbb_length = input(20, title=\"BB Length\")bb_mult = input(2.0, title=\"BB Standard Deviation\")// Einstellungen für Moneymanagementrisk_per_trade = input(1.0, title=\"Risk per Trade (%)\") / 100take_profit_multiplier = input(2.0, title=\"Take Profit Multiplier\")stop_loss_multiplier = input(1.5, title=\"Stop Loss Multiplier\")// Berechnung des RSIrsi_value = ta.rsi(close, rsi_length)// Berechnung der Bollinger-Bänderbasis = ta.sma(close, bb_length)dev = bb_mult * ta.stdev(close, bb_length)upper_band = basis + devlower_band = basis - dev// Bedingungen für Long- und Short-Tradeslong_condition = rsi_value < 30 and close > upper_bandshort_condition = rsi_value > 70 and close < lower_band// Eröffnen von Long- und Short-Positionenif (long_condition)    strategy.entry(\"Long\", strategy.long)if (short_condition)    strategy.entry(\"Short\", strategy.short)// Sicherheitsstopp, um eine offene Position zu schließen, wenn der Kurs stark in die falsche Richtung läuftsecurity_stop = close * 0.95strategy.exit(\"Security Stop\", \"Long\", stop=security_stop)strategy.exit(\"Security Stop\", \"Short\", stop=security_stop)// Take Profit und Stop Loss Levelstake_profit_level = close + (close - close[1]) * take_profit_multiplierstop_loss_level = close - (close - close[1]) * stop_loss_multiplierstrategy.exit(\"Long TP/SL\", \"Long\", limit=take_profit_level, stop=stop_loss_level)strategy.exit(\"Short TP/SL\", \"Short\", limit=take_profit_level, stop=stop_loss_level)Quelle: ChatGPTAuch hier kein einziger Trade.Dann ist mir der Kragen geplatzt und ich habe ChatGPT folgendes gefragt:QuoteHast du überhaupt keine Ahnung, wie Tradingview funktioniert? Selbst nach dem 10. Versuch platziert deine Strategie keine Trades.Gefühle wurden keine verletzt aber leider war es das dann mit der Strategie.Ich habe nur noch folgende Antwort erhalten:QuoteEs tut mir leid für die entstandenen Unannehmlichkeiten und Missverständnisse. Als KI-Modell habe ich keinen Zugriff auf Live-Plattformen wie Tradingview, daher kann ich die Strategie nicht in Echtzeit testen. Ich habe mein Bestes getan, um die Strategie basierend auf den Informationen, die Sie mir zur Verfügung gestellt haben, zu verbessern....Quelle: ChatGPTMeine Erfahrung spiegelt genau das, was ich im oberen Beitrag schon vermutet hatte, wieder :/Durch meine fehlende Erfahrung mit Tradingview bin ich nicht in der Lage, die Informationen von ChatGPT überhaupt zu verifizieren oder sinnvoll zu nutzen.@Turbatuluk vielleicht kannst du an der Stelle das Skript mal bei dir testen und bemerkst, dass nur eine kleine Einstellung gefehlt hat. Bitte beteilige mich dann aber auch an den Millionengewinnen, falls es die gibt",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxMueller",
      "created_time": "July 20, 2023, 03:52:49 PM",
      "body": "Quote from: sam00 on July 20, 2023, 01:31:14 PM@Turbatuluk vielleicht kannst du an der Stelle das Skript mal bei dir testen und bemerkst, dass nur eine kleine Einstellung gefehlt hat. Bitte beteilige mich dann aber auch an den Millionengewinnen, falls es die gibt Quote from: sam00 on July 20, 2023, 01:31:14 PMCode:// Bedingungen für Long- und Short-Tradeslong_condition = rsi_value < 30 and close > upper_bandshort_condition = rsi_value > 70 and close < lower_bandProbier mal das hier: long_condition = rsi_value < 30 and close < lower_bandshort_condition = rsi_value > 70 and close > upper_bandIch würde sagen die erste ChatGPT Strategie steht!   Von den Millionengewinnen sind wir noch etwas entfernt, aber das hätte ich bei BB+RSI auch nicht ernsthaft erwartet. Fehlen noch die Alarme und die Dokumentation des Chats (im Mittelpunkt steht ja die Anleitung nicht die Strategie).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "July 20, 2023, 04:09:08 PM",
      "body": "Quote from: Turbartuluk on July 20, 2023, 03:52:49 PMProbier mal das hier: long_condition = rsi_value < 30 and close < lower_bandshort_condition = rsi_value > 70 and close > upper_bandNa da waren es am Ende doch nur zwei kleine, vertauschte Zeichen. Freut mich echt, dass die Strategie dann syntaxtechnisch in Ordnung ist. Mir werden jetzt auch einige Trades (wenn auch hauptsächlich rot) angezeigt aber wir können daraus schließen, dass es mit ein wenig Eigenleistung möglich ist, sich ein Grundgerüst von ChatGPT bauen zu lassen.Quote from: Turbartuluk on July 20, 2023, 03:52:49 PMIch würde sagen die erste ChatGPT Strategie steht!   Von den Millionengewinnen sind wir noch etwas entfernt, aber das hätte ich bei BB+RSI auch nicht ernsthaft erwartet. Fehlen noch die Alarme und die Dokumentation des Chats (im Mittelpunkt steht ja die Anleitung nicht die Strategie).  Die Anleitung werde ich natürlich nachreichen. Das habe ich noch nicht im Detail gemacht, weil ich ja noch nicht wusste, ob die Strategie überhaupt funktionieren würde bzw. ob der Code korrekt ist.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxMueller",
      "created_time": "July 20, 2023, 05:02:38 PM",
      "body": "Quote from: sam00 on July 20, 2023, 04:09:08 PMNa da waren es am Ende doch nur zwei kleine, vertauschte Zeichen. Freut mich echt, dass die Strategie dann syntaxtechnisch in Ordnung ist. Mir werden jetzt auch einige Trades (wenn auch hauptsächlich rot) angezeigt aber wir können daraus schließen, dass es mit ein wenig Eigenleistung möglich ist, sich ein Grundgerüst von ChatGPT bauen zu lassen.Genau das! Proof of concept: check....Eventuell kannst du ja auch noch ausprobieren ob der auch autoview kennt und dann die Alarme gleich in der Autoview Syntax ausgeben kann.... das wäre natürlich Mega!  Aber ansonsten dürfte das auch jetzt schon die Hürde für den copytrading Wettbewerb deulich absenken: https://bitcointalk.org/index.php?topic=5459849.msg62551046#msg62551046Freut mich, genau das Ergebnis was ich mir erhofft hatte.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "July 21, 2023, 09:52:53 AM",
      "body": "Quote from: Turbartuluk on July 20, 2023, 05:02:38 PMGenau das! Proof of concept: check....Eventuell kannst du ja auch noch ausprobieren ob der auch autoview kennt und dann die Alarme gleich in der Autoview Syntax ausgeben kann.... das wäre natürlich Mega!  Ich habe ChatGPT mal zu Autoview befragt und die Erweiterung scheint ihm auch bekannt zu sein. Hier weiß ich jetzt gerade nicht, wie die Syntax aussehen müsste oder was man sich hier erhoffen würde, weshalb ich gerade kein Beispiel geben kann.Wie angekündigt, teile ich hier mal meinen genauen Dialog mit ChatGPT oder eher meine Anweisungen. Die Antworten von ChatGPT enthalten dann den Code und jedes Mal noch ein bisschen Text drum herum, der uns aber nicht so sehr interessiert.Ich setze einfach mal voraus, dass ihr euch bei ChatGPT registriert habt und einen neuen Dialog startet.Meine erste Anfrage war dann der gekürzte Ausgangsbeitrag von Turbatuluk:Code:Schreibe eine Anleitung für eine Strategie in Tradingview, die idealerweise folgenge Kriterien erfüllt:- geschrieben in PineScript Version=5- Backtestbar, d.h. Trades in Tradingview werden platziert (-> short und long Condition)- Im Live-betrieb werden für platzierte Trades auch Alarme ausgegeben- Strategie sollte auf mindestens 2 Indikatoren basieren (z.B. RSI + BB)- Strategie sollte zumindest grundlegendes Risiko- bzw. Moneymanagement skizzieren (TP, SL, Safety Orders, etc.)An dieser Stelle könnte man dann auch mal andere Indikatoren verwenden/testen oder schon genauer spezifizieren, was man möchte.Daraufhin gab es dann den ersten Entwurf. Diesen habe ich bei Tradingview eingefügt und das kompilieren hat nicht geklappt, weil Syntaxfehler enthalten waren.Ab dem Punkt gilt es eigentlich einfach nur, ChatGPT zu sagen, was nicht funktioniert und um Nachbesserung zu bitten.Meine Anweisungen sahen dann jeweils so aus:Code:Die Syntax ist leider nicht ganz richtig.Die Funktionen rsi, sma, stdev, crossover, crossunder und abs werden als falsch angezeigt. Bitte korrigiere das Skript.Code:Du verwendest immer noch crossover, crossunder und abs in dem Skript. Bitte überarbeite es dahingehend.Code:Die Syntax stimmt nun. Es wurden aber keine Trades platziert durch diese Strategie. Bitte korrigiere das nochmal.Code:Es wurden wieder keine Trades platziert.Code:Es werden immer noch keine Trades platziert.Folgende Warnungen werden noch angezeigt:14:58:40 Warnung für 30:1 'alertcondition()' has no effect inside strategies.14:58:40 Warnung für 31:1 'alertcondition()' has no effect inside strategies.Code:Auf Tradingview erscheint immer noch folgende Fehlermeldung:Vorsicht! Diese Strategie hat im Testbereich keine Orders erstellt.Code:Die Strategie soll für das BTC/USD Tradingpaar sein und es werden immer noch keine Trades platziert.Mit jeder Anweisung wurde das Skript ein wenig überarbeitet aber letztlich waren ja die größer/kleiner Zeichen nur falsch.Im Grunde ist es auch nicht viel mehr. Ich habe hier keine besonderen Formulierungen verwendet und einfach umgangsprachlich geschrieben, was ich möchte und was eben nicht funktioniert hat.Wenn etwas nicht stimmt, lässt man ChatGPT einfach nachbessern und müsste dann evtl. selbst nochmal einen Feinschliff machen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxMueller",
      "created_time": "July 22, 2023, 08:25:35 PM",
      "body": "Quote from: sam00 on July 21, 2023, 09:52:53 AM~Das sieht ja jetzt echt nicht mega kompliziert aus, muss ich mir chatGPT wohl doch mal installieren... Die Kombination mit autoview sähe dann etwa so aus:Code:alertcondition(Kaufe_DCA_wenn, title=\"BTC_DCA\", message=\"b=buy e=kraken q=0.1 s=XXBTZEUR t=limit fp=26.000\" )Also der alarm wird in pinscript geschrieben aber der Text den der Alarm ausspuckt entspricht der Autoview Syntax.In dem Fall hier:Limit Order zum Kauf auf Kraken von 0.1 BTC zum Kurs 26k EUR pro BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxMueller",
      "created_time": "July 24, 2023, 08:01:06 PM",
      "body": "Ich hab heute mal einen Scalper mit ChatGPT gebaut. Muss sagen das rumprobieren hat richtig spaß gemacht, nur das Fehler korrigieren war nervig, weil GPT gefühlt jedes mal einen neuen Fehler eingebaut hat....Am Ende bin ich dann aber trotzdem bei einer Strategie gelandet, die im Backtest irgendwie zu gut aussieht:690 Trades in 7 Tagen und dabei 120% Gewinn scheint mir dann doch zu schön um wahr zu sein. Glaube ich muss da mal tagsüber nochmal drüber schauen, wenn mein Hirn nicht schon matsche ist...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "July 25, 2023, 09:56:14 AM",
      "body": "Quote from: Turbartuluk on July 24, 2023, 08:01:06 PMIch hab heute mal einen Scalper mit ChatGPT gebaut. Muss sagen das rumprobieren hat richtig spaß gemacht, nur das Fehler korrigieren war nervig, weil GPT gefühlt jedes mal einen neuen Fehler eingebaut hat....Am Ende bin ich dann aber trotzdem bei einer Strategie gelandet, die im Backtest irgendwie zu gut aussieht:690 Trades in 7 Tagen und dabei 120% Gewinn scheint mir dann doch zu schön um wahr zu sein. Glaube ich muss da mal tagsüber nochmal drüber schauen, wenn mein Hirn nicht schon matsche ist...    Stark @Turbatuluk!120% Gewinn in 6 Tagen wären wirklich sehr schön, wenn das auch live funktionieren würde.Ich gebe mich mit 5% Gewinnbeteiligung für meine grandiose Anleitung zu frieden Das verschlimmbessern nervt ein wenig ja. Man will einen Fehler korrigieren lassen und bekommt unter Umständen einfach einen neuen/anderen.Bin aber sehr gespannt auf ein Update zu der Strategie.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxMueller",
      "created_time": "July 25, 2023, 10:16:17 AM",
      "body": "Quote from: sam00 on July 25, 2023, 09:56:14 AM120% Gewinn in 6 Tagen wären wirklich sehr schön, wenn das auch live funktionieren würde.Ich gebe mich mit 5% Gewinnbeteiligung für meine grandiose Anleitung zu frieden Das verschlimmbessern nervt ein wenig ja. Man will einen Fehler korrigieren lassen und bekommt unter Umständen einfach einen neuen/anderen.Bin aber sehr gespannt auf ein Update zu der Strategie.Naja, ich gehe erstmal davon aus, dass die Strategie dann aus irgendwelchen Gründen sowieso wieder nicht funktioniert und das irgendein \"Bug\" im Backtesting ist. Live würde ich das dann auch erstmal nur mit $100 Konto testen, also die Gewinnbeteiligung hielte sich da in Grenzen...Aber bisher stehst du mangels anderer Bewerber bei 0,7mBTC Prämie. Bei den Alarmen fehlt noch eine schöne Lösung und beim Risiko- bzw. Moneymanagement ist mir aufgefallen, dass zwar eine variable risk_per_trade definiert, diese aber später nirgends verwendet wurden. Das hat GPT bei mir gestern nämlich auch gemacht. Was das verschlimmbessern angeht, können wir den Faden ja dahingehend erweitern, dass die Anweisungen an GPT möglichst präzise und eindeutig sein sollen, damit GPT im Idealfall direkt eine richtige Lösung ausspuckt. Dann muss man nicht viel korrigieren und die Ergebnisse sind leichter reproduzierbar (bei zu vielen Fehlerkorrekturen mit z.T. anderer Wortwahl werden ggf. andere Verschlimmbesserungspfade genommen).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxMueller",
      "created_time": "July 25, 2023, 09:40:29 PM",
      "body": "Quote from: Turbartuluk on July 24, 2023, 08:01:06 PMIch hab heute mal einen Scalper mit ChatGPT gebaut. Muss sagen das rumprobieren hat richtig spaß gemacht, nur das Fehler korrigieren war nervig, weil GPT gefühlt jedes mal einen neuen Fehler eingebaut hat....Tatsächlich war da noch ein bisschen KI-Grütze drin, logische Fehler, Bedingungen für SL/TP ohne Sinn und Verstand. Also im Grunde muss man schon jeden einzelnen Schritt von GPT noch kontrollieren.Aber immerhin muss man nicht mehr selbst recherchieren, warum ein Syntaxfehler einer ist und wie er behoben werden kann. Das macht GPT in wenigen Sekunden/Minuten. So macht das arbeiten / optimieren echt Spaß! Konnte sogar noch bissl was rausholen.  Strategie läuft jetzt erstmal bei Tradingview im live-modus, werde da mal noch bis nächste Woche warten.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "July 26, 2023, 06:58:12 AM",
      "body": "Quote from: Turbartuluk on July 25, 2023, 10:16:17 AMNaja, ich gehe erstmal davon aus, dass die Strategie dann aus irgendwelchen Gründen sowieso wieder nicht funktioniert und das irgendein \"Bug\" im Backtesting ist. Live würde ich das dann auch erstmal nur mit $100 Konto testen, also die Gewinnbeteiligung hielte sich da in Grenzen...Aber bisher stehst du mangels anderer Bewerber bei 0,7mBTC Prämie. Bei den Alarmen fehlt noch eine schöne Lösung und beim Risiko- bzw. Moneymanagement ist mir aufgefallen, dass zwar eine variable risk_per_trade definiert, diese aber später nirgends verwendet wurden. Das hat GPT bei mir gestern nämlich auch gemacht. Was das verschlimmbessern angeht, können wir den Faden ja dahingehend erweitern, dass die Anweisungen an GPT möglichst präzise und eindeutig sein sollen, damit GPT im Idealfall direkt eine richtige Lösung ausspuckt. Dann muss man nicht viel korrigieren und die Ergebnisse sind leichter reproduzierbar (bei zu vielen Fehlerkorrekturen mit z.T. anderer Wortwahl werden ggf. andere Verschlimmbesserungspfade genommen).   Das mit der Gewinnbeteiligung war natürlich nur ein Spaß Bezüglich des Risiko-Managements hat ChatGPT uns wohl beide ausgetrickst. Man könnte jetzt schreiben, dass es das noch mit rein nehmen soll aber dann entstehen wahrscheinlich wieder neue Fehler.Ich glaube, dass eine Anweisung, welche keine Fehler produziert, so nicht existiert. ChatGPT kann das ja nicht live testen und muss daher von dem Benutzer, also uns, immer wieder dahin gehend korrigiert werden.Sobald man dann eine neue Strategie testen möchte, kommen wieder neue Fehler auf.Quote from: Turbartuluk on July 25, 2023, 09:40:29 PMStrategie läuft jetzt erstmal bei Tradingview im live-modus, werde da mal noch bis nächste Woche warten.Dann bin ich mal gespannt!Wenn du 100€ reinsteckst und wirklich schnelle 100% Gewinn machst, kannst du ja den Einsatz wieder rausziehen und das Ganze dann so weiterlaufen lassen. Eventuell würde ich noch hinzufügen, dass das Portfolio niemals unter 50% vom ATH fallen darf. Falls dann mal der große Fehler kommt, verliert man nicht gleich alles. Also das wäre zumindest mein Risiko-Management",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxMueller",
      "created_time": "July 26, 2023, 08:51:22 AM",
      "body": "Quote from: sam00 on July 26, 2023, 06:58:12 AMBezüglich des Risiko-Managements hat ChatGPT uns wohl beide ausgetrickst. Man könnte jetzt schreiben, dass es das noch mit rein nehmen soll aber dann entstehen wahrscheinlich wieder neue Fehler.Ja, genauso war es bei mir... mit 2x verschlimmbessern waren die dann aber auch weg....Hab das moneymanagement jetzt rausgeschmissen, also die variable Positionsgröße jetzt durch einen fixen Betrag in USD ersetzt. Siehe da, der exorbitante Gewinn ist auf ein deutlich realistischeres Maß von \"nur\" ~3% in 7 Tagen zusammengeschrumpft. Mit anderen Worten: beim GPT Moneymanagement (in Verträgen, Lots und Pips) hat er die Werte falsch berechnet und mal eben mit 50x mehr Geld gehandelt als zugewiesen war. Da der Tradingview Backtest kein Abgleich mit der Equity macht ist das dort nicht aufgefallen. Quote from: sam00 on July 26, 2023, 06:58:12 AMIch glaube, dass eine Anweisung, welche keine Fehler produziert, so nicht existiert. ChatGPT kann das ja nicht live testen und muss daher von dem Benutzer, also uns, immer wieder dahin gehend korrigiert werden.Sobald man dann eine neue Strategie testen möchte, kommen wieder neue Fehler auf.Das schon, aber es geht ja nicht nur um Syntaxfehler. Teilweise schmeißt der bei Überarbeitungen Sachen raus die schon funktionieren und gar nicht verändert werden sollten.Also was die reinen Syntaxfehler angeht bin ich wieder zu Pinescript Version=4 zurück gegangen. Offenbar liegen da deutlich mehr daten vor, sodass GPT da reibungsloser coden kann.Was die Logik bzw. den Aufbau der Strategie angeht, hab ich am Anfang immer die komplette Strategie in GPT kopiert. Da sind wie gesagt dann immer mal wieder Abschnitte \"verschwunden\" was ich meist erst ein paar Iterationen später bemerkt habe. Also da ist es empfehlenswert entweder die eingabe bei GPT (auftrag zur erstellung einer Strategie) immer zu kopieren und zu präzisieren / anzupassen oder aber nur die Bereiche zu kopieren, die auch tatsächlich verändert werden sollten. Am besten halt wirklich bei jeder Iteration prüfen was GPT verändert hat und ob er das sollte.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "July 27, 2023, 11:32:39 AM",
      "body": "Quote from: Turbartuluk on July 26, 2023, 08:51:22 AMHab das moneymanagement jetzt rausgeschmissen, also die variable Positionsgröße jetzt durch einen fixen Betrag in USD ersetzt. Siehe da, der exorbitante Gewinn ist auf ein deutlich realistischeres Maß von \"nur\" ~3% in 7 Tagen zusammengeschrumpft. Mit anderen Worten: beim GPT Moneymanagement (in Verträgen, Lots und Pips) hat er die Werte falsch berechnet und mal eben mit 50x mehr Geld gehandelt als zugewiesen war. Da der Tradingview Backtest kein Abgleich mit der Equity macht ist das dort nicht aufgefallen. Schade für das Ergebnis aber gut zu wissen, wodurch die (angeblichen) enorm hohen Gewinne entstanden sind Bin trotzdem gespannt, wie der Bot auf mehrere Wochen oder Monate funktionieren wird/würde.Quote from: Turbartuluk on July 26, 2023, 08:51:22 AMWas die Logik bzw. den Aufbau der Strategie angeht, hab ich am Anfang immer die komplette Strategie in GPT kopiert. Da sind wie gesagt dann immer mal wieder Abschnitte \"verschwunden\" was ich meist erst ein paar Iterationen später bemerkt habe. Also hast du immer ein neuen Dialog geöffnet und die Ausgangsfrage leicht abgeändert bzw. präzisiert nochmal gestellt?Wenn du nämlich im gleichen Chatfenster bleibst, antwortet ChatGPT auch anders, wie in einem neuen Chat.Das mit dem Überprüfen ist auf jeden Fall wichtig. Ich habe bisher auch immer nur die Grobarbeit von ChatGPT erledigen lassen. 90% der Arbeit in 10% der Zeit von ChatGPT und den Rest dann überarbeiten/anpassen war bisher immer ganz hilfreich.Da es hier aber ja darum geht, eine so gute Anleitung für das Erstellen von Strategien zu schreiben, sind die Ansprüche anders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxMueller",
      "created_time": "July 30, 2023, 05:38:17 AM",
      "body": "Quote from: sam00 on July 27, 2023, 11:32:39 AMSchade für das Ergebnis aber gut zu wissen, wodurch die (angeblichen) enorm hohen Gewinne entstanden sind Bin trotzdem gespannt, wie der Bot auf mehrere Wochen oder Monate funktionieren wird/würde.Ja, ich bin da auch eher beruhigt dass es sowas einfaches und plausibles war.... Im forward testing bei tradingview sah es dann trotzdem vielversprechend aus, also denke mal ich werd nach dem Urlaub ins live testing mit bissl spielgeld einsteigen.... Da wird es dann nochmal kritisch, weil slippage und spread dazu kommen und ich auch mal schauen muss ob die Strategie auf unterschiedlichen Börsen auch unterschiedlich gut/schlecht läuft....Was GPT angeht hatte ich alles in einem Chat laufen. Denke es ist auch nicht nötig jedes mal nen neuen zu starten, weil es ja nur darum geht zu vermeiden, dass einzelne Abschnitte/Funktionalitäten ungewollt rausgelöscht werden.Ich hatte aber die zweite Variante gewählt und nur den Teil vom Code kopiert wo Änderungen vorgenommen werden sollten. Da ist die Überprüfung des Codes dann quasi auch gleich mit drin gewesen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "July 30, 2023, 10:00:17 AM",
      "body": "Quote from: Turbartuluk on July 30, 2023, 05:38:17 AMJa, ich bin da auch eher beruhigt dass es sowas einfaches und plausibles war.... Im forward testing bei tradingview sah es dann trotzdem vielversprechend aus, also denke mal ich werd nach dem Urlaub ins live testing mit bissl spielgeld einsteigen.... Da wird es dann nochmal kritisch, weil slippage und spread dazu kommen und ich auch mal schauen muss ob die Strategie auf unterschiedlichen Börsen auch unterschiedlich gut/schlecht läuft....Was GPT angeht hatte ich alles in einem Chat laufen. Denke es ist auch nicht nötig jedes mal nen neuen zu starten, weil es ja nur darum geht zu vermeiden, dass einzelne Abschnitte/Funktionalitäten ungewollt rausgelöscht werden.Ich hatte aber die zweite Variante gewählt und nur den Teil vom Code kopiert wo Änderungen vorgenommen werden sollten. Da ist die Überprüfung des Codes dann quasi auch gleich mit drin gewesen.Wird in Tradingview gar kein Spread eingerechnet und keine Handelsgebühren?Dadurch würde ja jeder Handel nochmal ein kleines bisschen was kosten, wodurch du nach mehreren Hundert Trades ja vielleicht sogar in den Verlust rutscht.Da bin ich gespannt, wie es sich live auf einer Börse schlägt.Okay das klingt gut und muss wahrscheinlich einfach im Einzelfall überprüft/getestet werden, wie es eben passt",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxMueller",
      "created_time": "July 30, 2023, 11:06:21 AM",
      "body": "Quote from: sam00 on July 30, 2023, 10:00:17 AMWird in Tradingview gar kein Spread eingerechnet und keine Handelsgebühren?Dadurch würde ja jeder Handel nochmal ein kleines bisschen was kosten, wodurch du nach mehreren Hundert Trades ja vielleicht sogar in den Verlust rutscht.Da bin ich gespannt, wie es sich live auf einer Börse schlägt.Spread wird im Backtest regelmäßig nicht berücksichtigt. Da müsste man im grunde immer 2 Kerzen für Bid/Ask abspeichern und dann müssten die Strategien noch sagen auf welche Daten sie zugreifen wollen. Da tradingview ja eher einsteigerfreundlich gehalten ist, kann ich mir nicht vorstellen, dass das mit drin ist.... Slippage müsste man dann sogar noch das orderbook mit abspeichern, damit man die slippage kalkulieren kann, das ist in den Daten ganz sicher nicht drin....Beides macht aber bei liquiden pairs/Börsen nur einen minimalen Unterschied und wird eher interessant wenn man illiquiditäten ausnutzt, weil es dann schon mal die Strategie verhageln kann.Die fees sind aber glaube schon mit drin, jedenfalls ist die Strategie im backtest auf kraken deutlich profitabler als auf anderen Börsen. Hatte ja eigentlich geplant den livetest auf kucoin zu machen, da muss ich mal schauen ob das was wird...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "willi9974",
      "created_time": "July 30, 2023, 12:29:10 PM",
      "body": "Sehr interessant was ihr macht. Hab auch schon das eine oder andere Script in Perl und Python schreiben lassen. Läuft recht gut wenn man mit älteren Daten zufrieden ist, also nicht das allerneueste braucht.Bin gespannt wie eure Geschichte weiter geht und ob ihr auch mal produktiv mit realem Geld handelt",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}