{
  "id": "topic_5413342",
  "title": "Disruptivas",
  "author": "Disruptivas",
  "created_time": "September 13, 2022, 01:07:56 AM",
  "content": "Hoje eu tive uma surpresa incrível em um evento de cripto que fui, descobrindo que os brasileiros não são só líderes em adoção, mas também em construção. Primeiro com a fingerprints DAO, n sabia, mas eles são hoje uma das maiores coleções de NFTs do mundo e receberam aporte da a16z eeeeee............ Que um dos criadores do cryptokitties e do Top shot, é brasileiro. Ele contou todo processo e história da criação do kitties. Foi realmente surpreendente. Mais algum brasileiro que vocês conhecem que estão a frente de projetos mundialmente famosos?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413342",
  "comments": [
    {
      "author": "TryNinja",
      "created_time": "September 13, 2022, 05:01:32 AM",
      "body": "Imediatamente soube que eu não conheço um único brasileiro por trás de um protocolo DeFi, uma empresa focada em crypto, uma blockchain, etc... mas ai parei para pensar e percebi que eu também não consigo dizer de onde são aqueles que estão por trás de todos os projetos que eu conheço. Lição de moral: tem tanto anon por aqui que muitos deles podem ser brasileiros e nós nem saberiamos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 13, 2022, 07:07:40 AM",
      "body": "Quote from: TryNinja on September 13, 2022, 05:01:32 AMLição de moral: tem tanto anon por aqui que muitos deles podem ser brasileiros e nós nem saberiamos. Depois de quase 10 anos a lidar com comunidades cripto, essa é uma grande realidade.Muitos encaram o anonimato que o Bitcoin permitiu, para reformular toda a sua vida, e só procurar esse anonimato. São muito fechados no seu círculos de amigos/conhecidos, e não se gostam de misturar. Preferem envolver-se nas comunidades internacionais do que locais, e tudo é para desconfiar.Eu sindo o mesmo dos Portugueses, acho que existe por ai muito projeto com portugueses envolvidos, mas que é difícil de os \"encontrar\".E já aconteceu, eu ver um projeto, desconfiar que é PT ou BR, investigar e por vezes é mesmo, apesar de não ser fácil chegar a essa conclusão.Também não conheço ninguém de forma pessoal, e virtualmente conheço o TryNinja, Bitmover e a Disruptivas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "September 15, 2022, 06:04:30 PM",
      "body": "Mas gente, não são casos de pessoas anônimas. Claro que tem esse caso, mas acho que o problema é que muitas vezes os influencers se tornam pessoas muito públicas e muito mais vistas do que os builders, sabe? Agora que ser influencer é uma profissão, a atenção realmente é monopolizada por esse grupo, de forma que várias pessoas mtmrmt fodas e não anonimas, mas que n são influencers, não são vistos. O que acho uma pena gigantesca",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "September 16, 2022, 02:24:29 AM",
      "body": "Quote from: joker_josue on September 13, 2022, 07:07:40 AMDepois de quase 10 anos a lidar com comunidades cripto, essa é uma grande realidade.Muitos encaram o anonimato que o Bitcoin permitiu, para reformular toda a sua vida, e só procurar esse anonimato. São muito fechados no seu círculos de amigos/conhecidos, e não se gostam de misturar. Preferem envolver-se nas comunidades internacionais do que locais, e tudo é para desconfiar.Exato, essa é a maravilha de poder construir um império com suas ideias brilhantes, expor soluções para o mundo e ainda assim se manter na segurança do anonimato que as criptos proporcionam.Também acredito que temos muitos gênios escondidos no Brasil por trás de grandes projetos criptos, pessoas \"normais\" que devem levar um segundo trabalho \"normal\" em alguma empresa de tecnologia só para disfarçar mesmo",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "September 16, 2022, 07:34:26 AM",
      "body": "Quote from: Disruptivas on September 13, 2022, 01:07:56 AMMais algum brasileiro que vocês conhecem que estão a frente de projetos mundialmente famosos? Eu lembro que antigamente tinha um brasileiro no projeto Stellar.Acho que esse Ronaldo lemos aquihttps://www.stellar.org/foundation/teamMas eu já vi outros como dev em diversos projetos. Tem muito brasileiro dev.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "September 16, 2022, 09:30:43 AM",
      "body": "Boa, vou olhar ele. Mas, mais do que devs, queria uns nomes que sejam mais tomadores de decisões, brasileiros C levels nessas empresas. Até tô pensando em começar uma série, talvez em vídeo ou em podcast entrevistando essas pessoas, buscando suas histórias, momentos de sucesso, a perspectiva delas de o que fizeram pra dar certo, quais erros elas não cometeram novamente e etc. Até queria saber o que acham da idéia, se acham que seria válido.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 16, 2022, 01:30:34 PM",
      "body": "Quote from: alegotardo on September 16, 2022, 02:24:29 AMTambém acredito que temos muitos gênios escondidos no Brasil por trás de grandes projetos criptos, pessoas \"normais\" que devem levar um segundo trabalho \"normal\" em alguma empresa de tecnologia só para disfarçar mesmo Quantos!  No meu trabalho, alguns clientes pagam com cartão, e só os topo quando puxam do cartão Crypto.com ou Binance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "September 17, 2022, 12:04:42 AM",
      "body": "Sim gente, sem dúvida existem milhares de anonimos nesse mundo cripto. Mas igualmente existem pelo menos centenas de brasileiros não anonimizados a frente de projetos muuuuuito importantes para o setor, mas que por estarem a frente de projetos gringos, acabam interagindo pouco com a comunidade brasileira. Mas qual o ponto aqui? Vemos sempre sempre as noticias do brasil sendo lider em uso de tecnologia, mas enquanto somos lembrados só por usar, continuamos reproduzindo no mercado cripto as mesmas dinamicas do mercado tradicional no desenvolvimento da economia brasileira, importando tudo o que vale e simplesmente prostituindo nossa atenção. E ai a galera de fora, não é capaz nunca nem de ler um video traduzido, pq nao é considerado válido qualquer outro conteudo ou conhecimento que nao aquele produzido pela  Europa/EUA. Síndrome de vira-lata não é comigo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "September 20, 2022, 09:53:49 AM",
      "body": "Quote from: Disruptivas on September 17, 2022, 12:04:42 AMMas qual o ponto aqui? Vemos sempre sempre as noticias do brasil sendo lider em uso de tecnologia, mas enquanto somos lembrados só por usar, continuamos reproduzindo no mercado cripto as mesmas dinamicas do mercado tradicional no desenvolvimento da economia brasileira, importando tudo o que vale e simplesmente prostituindo nossa atenção. E ai a galera de fora, não é capaz nunca nem de ler um video traduzido, pq nao é considerado válido qualquer outro conteudo ou conhecimento que nao aquele produzido pela  Europa/EUA. Síndrome de vira-lata não é comigo. Concordo contigo Brasileiros são super capazes.O negócio é que no gera esses brasileiros atuam em projetos lá fora,  onde é mais fácil abrir e fechar empresas, existem menos dificuldades em criar empresas de tecnologia e etc... daí esses dev brasileiros em geral atuam muito mais fora do que aqui.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "September 24, 2022, 10:58:34 AM",
      "body": "Quote from: bitmover on September 20, 2022, 09:53:49 AMQuote from: Disruptivas on September 17, 2022, 12:04:42 AMMas qual o ponto aqui? Vemos sempre sempre as noticias do brasil sendo lider em uso de tecnologia, mas enquanto somos lembrados só por usar, continuamos reproduzindo no mercado cripto as mesmas dinamicas do mercado tradicional no desenvolvimento da economia brasileira, importando tudo o que vale e simplesmente prostituindo nossa atenção. E ai a galera de fora, não é capaz nunca nem de ler um video traduzido, pq nao é considerado válido qualquer outro conteudo ou conhecimento que nao aquele produzido pela  Europa/EUA. Síndrome de vira-lata não é comigo. Concordo contigo Brasileiros são super capazes.O negócio é que no gera esses brasileiros atuam em projetos lá fora,  onde é mais fácil abrir e fechar empresas, existem menos dificuldades em criar empresas de tecnologia e etc... daí esses dev brasileiros em geral atuam muito mais fora do que aqui.Isso sem dúvida, mas a medida que cada vez mais as equipes são interdisciplinares e todo mundo trabalha com pessoas de todos os lugares, acho que faz cada vez mais sentido também que as pessoas sejam reconhecidas pelos seus países de origem e que isso volte de alguma forma para o incentivo ao desenvolvimento desses locais e não que a atenção fique unicamente voltada ao local em que o protcolo está sendo desenvolvido.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 24, 2022, 03:55:31 PM",
      "body": "Quote from: Disruptivas on September 24, 2022, 10:58:34 AMIsso sem dúvida, mas a medida que cada vez mais as equipes são interdisciplinares e todo mundo trabalha com pessoas de todos os lugares, acho que faz cada vez mais sentido também que as pessoas sejam reconhecidas pelos seus países de origem e que isso volte de alguma forma para o incentivo ao desenvolvimento desses locais e não que a atenção fique unicamente voltada ao local em que o protcolo está sendo desenvolvido. E porque não deixar de ser relevante o local onde esta a ser feito o projeto ou a nacionalidade de quem esta envolvido?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "September 24, 2022, 04:01:06 PM",
      "body": "Quote from: joker_josue on September 24, 2022, 03:55:31 PME porque não deixar de ser relevante o local onde esta a ser feito o projeto ou a nacionalidade de quem esta envolvido?Acho que é pelo mesmo motivo que temos uma aba portuguesa Joker. Se você é empreendedor no setor cripto, parcerias e contatos são super importantes. Ninguém constrói nada sozinho. E tende a ser mais fácil lidar com pessoas de culturas próximas, tanto pela questão da língua, quanto dos problemas mesmo.Exemplo, eu estou super próxima do movimento ReFi global, e temos parcerias com eles, mas as parcerias recorrentes tendem a ser da comunidade de ReFi do Brasil. Acho realmente importante conhecer os empreendedores brasileiros, tende a ser mais acessível.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}