{
  "id": "topic_5460899",
  "title": "sherrylove",
  "author": "sherrylove",
  "created_time": "July 24, 2023, 02:12:28 PM",
  "content": "Is there an good site for Chinese.So far a lot of sites(gambling )  with bitcoin is not friendly to Chinese,Because they need (google verify).and you know the google is blocked in China.so any site is friendly to Chinese？Thank you .",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460899",
  "comments": [
    {
      "author": "rdluffy",
      "created_time": "July 24, 2023, 02:24:36 PM",
      "body": "You can try https://duelbits.com/There's chinese language and you can register with your e-mail, steam or metamask (there's also google register option, but you can chose which one is better for you)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "July 24, 2023, 02:27:11 PM",
      "body": "I don't see China as one of the countries banned by default in crypto gambling platforms that I'm familiar with but some game providers blacklist China though. Is online gambling even allowed there? I'm reading some blogs that it's illegal so you may have to move from the mainland to HK where laws are more lax towards online gambling and Google is accessible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sherrylove",
      "created_time": "July 24, 2023, 02:40:06 PM",
      "body": "Quote from: Yogee on July 24, 2023, 02:27:11 PMI don't see China as one of the countries banned by default in crypto gambling platforms that I'm familiar with but some game providers blacklist China though. Is online gambling even allowed there? I'm reading some blogs that it's illegal so you may have to move from the mainland to HK where laws are more lax towards online gambling and Google is accessible. illegal in China",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "July 24, 2023, 03:02:59 PM",
      "body": "Quote from: sherrylove on July 24, 2023, 02:40:06 PMQuote from: Yogee on July 24, 2023, 02:27:11 PMI don't see China as one of the countries banned by default in crypto gambling platforms that I'm familiar with but some game providers blacklist China though. Is online gambling even allowed there? I'm reading some blogs that it's illegal so you may have to move from the mainland to HK where laws are more lax towards online gambling and Google is accessible. illegal in ChinaGambling is illegal in China but Chinese people are gambling:https://www.johnnybet.com/best-online-casinos-in-china#_QuoteOnline Gambling in ChinaOnline gambling in China follows the same rules as gambling in a street shop and rules of traditional gambling still apply. Therefore, it is illegal to operate online gambling sites in the country or to provide gambling services in China.Some internet service providers will even block foreign gambling websites to stop Chinese people accessing them and placing bets.However, online gambling remains a huge business in China and some online gambling websites are happy to welcome Chinese players and will even offer them support in Chinese, thus encouraging them to join the gambling site.We do not recommend trying to place bets at online casinos in China, even if you are just visiting the country. Still there are many people risking gambling at online casinos in china even as we speak, in 2023 the market is actually expected to grow considerably. There are several online casinos which aren't based in China (meaning no penalties for gambling there), that welcome players from China. Let's see some examples.If I should recommend a casinos, https://livecasino.io is good. There are some other gambling sites that can be used too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "July 24, 2023, 03:20:13 PM",
      "body": "Quote from: sherrylove on July 24, 2023, 02:12:28 PMso any site is friendly to ChineseAs far as I know their bitstarz.com casino site has a Chinese language feature, you can see below.bitstarz.comQuoteGeneral Information•    Year founded - 2014•    License - Curacao eGaming•    Language - English, Chinese, Japanese, Korean, Spanish, Portuguese, French, German, Italian, Russian, Turkish, Vietnamese.Note: i have never played on the bitstarz.com site, this is only as information as you ask, all at your own risk, look for some additional information before registering and playing there.However, if you can speak Japanese, of course I advise you to visit gambling sites: Roobet.com, maybe it's better and can be relied on, but all your actions and considerations are what you are, we only provide what we know and you discuss here.Good luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "July 24, 2023, 04:45:12 PM",
      "body": "OP does have good English grammar, you can surely navigate your way on English casinos.There are VPN-friendly bitcoin casinos that you can play around with, you can use the IP from somewhere of course and you get the freedom. BC game and bitcasino afaik are among those casinos.  This is something that's crazy about China, they illegalized gambling but a lot of these Chinese are gamblers themselves. They even have casinos operated by Chinese everywhere but not in their mainland.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "July 24, 2023, 06:45:08 PM",
      "body": "Quote from: bittraffic on July 24, 2023, 04:45:12 PMOP does have good English grammar, you can surely navigate your way on English casinos.There are VPN-friendly bitcoin casinos that you can play around with, you can use the IP from somewhere of course and you get the freedom. BC game and bitcasino afaik are among those casinos.  This is something that's crazy about China, they illegalized gambling but a lot of these Chinese are gamblers themselves. They even have casinos operated by Chinese everywhere but not in their mainland.You are correct that some online casinos may be accessible via VPNs (Virtual Private Networks), which can allow users to bypass geo-restrictions and access websites that are blocked in their country. However, it's important to be aware that using a VPN to access online gambling sites may be against the terms of service of both the VPN provider and the casino website. Additionally, it may be illegal or restricted in some jurisdictions, so users should be cautious and informed about the legal implications of using VPNs for such purposes.Quote from: Yogee on July 24, 2023, 02:27:11 PMI don't see China as one of the countries banned by default in crypto gambling platforms that I'm familiar with but some game providers blacklist China though. Is online gambling even allowed there? I'm reading some blogs that it's illegal so you may have to move from the mainland to HK where laws are more lax towards online gambling and Google is accessible.Regarding China's stance on gambling, it is true that gambling is mostly illegal on the mainland, with some exceptions such as state-run lotteries and limited gambling zones in Macau. However, many Chinese citizens still engage in gambling activities through online platforms, overseas casinos, or gambling destinations like Macau. The popularity of gambling among Chinese nationals has led to the growth of gambling services specifically targeted at Chinese customers, even if those services are based outside of China.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aikidoka",
      "created_time": "July 24, 2023, 07:19:01 PM",
      "body": "Quote from: Ulven on July 24, 2023, 06:45:08 PMYou are correct that some online casinos may be accessible via VPNs (Virtual Private Networks), which can allow users to bypass geo-restrictions and access websites that are blocked in their country. However, it's important to be aware that using a VPN to access online gambling sites may be against the terms of service of both the VPN provider and the casino website. Additionally, it may be illegal or restricted in some jurisdictions, so users should be cautious and informed about the legal implications of using VPNs for such purposes.That's correct. Anyone who's using a VPN to access a gambling site puts their own account at risk of being restricted or even facing worse consequences. Most gambling casino websites do not allow the use of VPNs even though it may be a good alternative for people who can't gamble in China.I think the casino suggested by rdluffy is pretty good and worth a try for the OP. I hope it works fine for him",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "July 24, 2023, 08:55:40 PM",
      "body": "Quote from: sherrylove on July 24, 2023, 02:12:28 PMIs there an good site for Chinese.So far a lot of sites(gambling )  with bitcoin is not friendly to Chinese,Because they need (google verify).and you know the google is blocked in China.so any site is friendly to Chinese？Thank you . Google verify? Are you talking about mandatory google 2fa that some casinos have? Surely there any chinese equivalents in chinese app marketplaces? https://www.maketecheasier.com/google-authenticator-alternatives/If you are talking about what casinos allow/disallow China. I don't even know, but i wouldn't recommend VPN if you are a citizen of restricted country unless you want to endanger your money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "harizen",
      "created_time": "July 24, 2023, 11:42:55 PM",
      "body": "Quote from: sherrylove on July 24, 2023, 02:12:28 PM`snip`I think it's you who are most knowledgeable compare to us in terms of dealing with the gambling-related laws in your country. Therefore, I know you can do the search yourself. Even if we mentioned gambling sites that support users from your country, what if you will face a possible sanction there if you are caught doing online gambling?Maybe it's good if you also consider asking your fellow community at your local section for a much better response.https://bitcointalk.org/index.php?board=30.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "X-ray",
      "created_time": "July 24, 2023, 11:54:37 PM",
      "body": "It's very hard to get a friendly site for you. The problem is mostly websites were using google verify. The possible thing for you to bypass it through the use cloudflare warp but this may require you to pay some money caused by GFW was impacting all of the free plan customers. I do know how strict your country is. I saw that so many chinese users were using cloud flare warp to bypass something like google verification but since china was making GFW become even stricter and it was impacting so many cloud flare users. I think you are very familiar with GFW.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "July 25, 2023, 10:12:43 AM",
      "body": "Looks like @OP should really look into it himself, as we can only suggest casino sites. He needs to try them one by one until he finds a casino that suits him. It might take him a while but it's worth it, especially if he really wants to gamble using crypto. But be careful. There are crypto casinos that end in scam, so we always recommend choosing only trusted casinos. And if he wants to gamble using big money, he has to be prepared if the casino asks him to do KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "QueenVera",
      "created_time": "July 25, 2023, 10:45:58 AM",
      "body": "Quote from: sherrylove on July 24, 2023, 02:12:28 PMIs there an good site for Chinese.So far a lot of sites(gambling )  with bitcoin is not friendly to Chinese,Because they need (google verify).and you know the google is blocked in China.so any site is friendly to Chinese？Thank you .  It's not a bad idea to try getting information from the forum but sometimes the best information or knowledge is gotten from research made by ourselves, according to research China is one of the countries where gambling was originated from and therefore would have their own online gambling sites, since the gambling system have gone digital and China is not left out when it comes to digitalisation. Though your country might not be bitcoin friendly but there should be other gambling and online casino sites that could gamble with your local Fiat currency and then when you make profit from it you could use your profits from those sites to invest in Cyptocurrencies your country is in support of, also since google is blocked with China you could try making research of sites that's supports other browsers apart from Google like Metamask and so forth, or better still move to a neighbour country that favours use of Google and bitcoin in various gambling sites.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jostorres",
      "created_time": "July 25, 2023, 11:15:33 AM",
      "body": "Quote from: bittraffic on July 24, 2023, 04:45:12 PMOP does have good English grammar, you can surely navigate your way on English casinos.There are VPN-friendly bitcoin casinos that you can play around with, you can use the IP from somewhere of course and you get the freedom. BC game and bitcasino afaik are among those casinos.  This is something that's crazy about China, they illegalized gambling but a lot of these Chinese are gamblers themselves. They even have casinos operated by Chinese everywhere but not in their mainland.I wouldn't recommend him doing that, he should find a platform that specifically allows people from China to use the platform because even if a casino is VPN-friendly, they wouldn't accept his KYC verification when asked since he is from somewhere that is not supported by the casino, so instead of depositing money and getting it stuck, he should do some research and find a platform that best suits him based on his condition and regulations of the country.And sometimes, casinos can cause issues for users that are using VPNs to access the platform, and even if they don't, there will surely be issues when he goes for withdrawal and they ask him to verify his identity which he can't complete if they don't have China as one of the countries where their platform is accessible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Casdinyard",
      "created_time": "July 25, 2023, 08:11:59 PM",
      "body": "Isn't gambling made illegal in China? Let alone cryptocurrency? Are you sure you're gonna risk getting caught and facing sentence over few hours of excitement and burning money? You can't use VPNs either cause most casinos as said earlier by the people in here, asks for identification details, and when they find out you're not really living from where your IP address is at you'd for sure get banned. I think the best you can do is go in sanctioned and licensed casinos in your country or Hongkong instead of risking yourself for temporary entertainment. Piece of advice only, don't take it negatively cause if anything we're just looking out here for you. There are much safer ways for you to go about your gambling aspirations that do not involve breaking the law.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ralle14",
      "created_time": "July 27, 2023, 01:26:52 AM",
      "body": "I'd suggest visiting BTCGOSU and look at the reviews of the casinos they have on their list because their site would notify you if your country is supported for each casino.Quote from: YOSHIE on July 24, 2023, 03:20:13 PMAs far as I know their bitstarz.com casino site has a Chinese language feature, you can see below.That casino is no good for OP since it's included in this thread (list of casinos to avoid).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "July 27, 2023, 08:35:28 AM",
      "body": "well, i'm sorry that my post is just a bad news post for you, but i hope you see my post as being a warning to be careful in the choice you make, let's get to the point, all casinos will ask for kyc eventually, there's no choice for that matter, if you live in china then you cannot use casinos, even if they use VPN when they ask you for kyc then the casino would close your account and you would lose any money that was in the casino, no doubt that would not be a good thing. If you are a Chinese citizen and you don't live in China then you would have to go through kyc.but it is necessary to see if the laws of china, on the banning of cryptocurrencies do not cover its citizens who live abroad, one thing is for china to ban casinos and another thing is for china to ban cryptocurrencies, you have to what is the scope of these prohibitions , if they only apply to citizens who are living in China, I have seen some Chinese exchange owners have no problem running their exchanges outside of China, so I assume the bans only apply to residents of China, so if you live in china so don't use casino and don't use cryptocurrencies",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "July 27, 2023, 08:47:43 AM",
      "body": "Gambling is banned in China? Damn, I don't even know this until now, but I haven't seen any one casino that ban China citizen, I would have recommend VPN but it's not needed at all, try few casinos that are available on this forum first and see like Livecasino.io and Fortunejack or even Roobet, I am certain they put no restriction on China citizens.If you are still feeling concerned then use a premium VPN like ExpressVPN, you can keep to one IP address using this VPN, I believe that is very important because online casinos don't like using different IPs and location, so adjust the settings and stick with a location with same IP address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "July 28, 2023, 10:20:55 AM",
      "body": "Quote from: sherrylove on July 24, 2023, 02:12:28 PMIs there an good site for Chinese.So far a lot of sites(gambling )  with bitcoin is not friendly to Chinese,Because they need (google verify).and you know the google is blocked in China.so any site is friendly to Chinese？Thank you . If you are planning to play from mainland China, drop the plan. Due to the unfriendly government policies in China, all online casinos have banned Chinese players. That's a default rule. So even if you manage to play and win, the casino companies may reject your withdrawal request citing policy violation. You can't take any legal step against them. So better drop the plan of online gambling unless you are planning to operate from a gambling friendly nation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}