{
  "id": "topic_5423086",
  "title": "Husires",
  "author": "Husires",
  "created_time": "November 25, 2022, 12:13:26 PM",
  "content": "I think most of you have read this news, is it true that Coinbase has a reserve (including customer funds) of about 2 million bitcoins? And with all the recent bankruptcies, is there enough people to keep all those bitcoins at coinbase online account?This is about 9% of total bitcoins",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5423086",
  "comments": [
    {
      "author": "stompix",
      "created_time": "November 25, 2022, 12:34:39 PM",
      "body": "Quote from: Husires on November 25, 2022, 12:13:26 PMAnd with all the recent bankruptcies, is there enough people to keep all those bitcoins at coinbase online account?No idea what you're asking here, how many people does it take to keep the coins secure, or how many people are using Coinbase in order for it to have 2 million coins in reserves? But in any case, yeah there are enough!Anyhow, it has been known for years Coinbase had at least 1 million coins in storage before the last bull run, so two million now with people fleeing from other exchanges might not be impossible. Also, those two million coins are not just coins on the exchange, some of them are from the Coinbase Custody program and that piece of the pie might be the bigger one, it's aimed at investors with big pockets that pay to keep their coins safe!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "November 25, 2022, 04:55:31 PM",
      "body": "Adding to what @stompix said Coinbase also runs the crypto back end for a few brokerages and other businesses. So yes it's a lot of money, but not 'theirs' they are just holding it for other people.So you have1) Direct customers like you and me2) Custody customers 3) People who have BTC through their broker and don't even know it's Coinbase holding the funds4) Businesses that are using their services like Coinbase commerce so it's just 'passing through' but still held by Coinbase.Either way, it's a ton of coins. And that is just the BTC, makes you wonder how much ETH and everything else thy are sitting on.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "November 26, 2022, 03:23:02 PM",
      "body": "Quote from: Husires on November 25, 2022, 12:13:26 PMis it true that Coinbase has a reserve (including customer funds) of about 2 million bitcoins?It doesn't matter. Coinbase own some bitcoin. That is no surprise to anyone.The only question which matters, and which cannot be answered in a truly trustless way, is what do Coinbase have on their books? Holding 2 million bitcoin is insufficient if they have liabilities of 3 million bitcoin across their customers. As DaveF has pointed out, this doesn't just include individual users but also business entities and affiliated entities such as brokers and Coinbase Commerce. Do Coinbase hold a lot of bitcoin? Yes. Does that mean Coinbase aren't fractional reserve? Absolutely not.So it doesn't matter. Any coins on Coinbase are not yours and continue to be at risk, regardless of the balance of their wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "November 26, 2022, 11:39:32 PM",
      "body": "There are some questions that have in my mind right now about revealing this reserve Bitcoin.Based on the report that I've read, they have 73 million verified users so it's not surprising they have that large amount under their custody. Now, I think they are affected by the FTX drama, by revealing this balance sheet people think that they aren't on the same side of the FTX drama about bankruptcy.I think there's hidden agenda with this revealing balance sheet, to avoid not getting FUD by their users and remain calm not to withdraw their coins on Coinbase.  But at least people have an awareness now that keeping their Bitcoin on the centralized exchange is very risky same case on FTX.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "November 28, 2022, 10:23:59 PM",
      "body": "Didn't CZ mention Coinbase in this context recently?Looks like he finished with FTX and he is moving to next exchange target now...I don't think all that Bitcoin is owned by them, and they are keeping good amounts of coins from other people.Coinbase exist since early days of Bitcoin, so it's normal to expect they also have a lot of Bitcoin in their portfolio, and I don't think they can go bankrupt that easy, unless they do it on purpose.I will never understand people who keep all their Bitcoin on centralized exchanges, but there are many who are still doing this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "November 29, 2022, 11:09:26 AM",
      "body": "When an exchange boasts about their reserve because things aren't doing good with the surroundings that they're also part of. It's likely that the bigger portion of it isn't theirs but from the reserve of their users/depositors.Look at how the impact goes on about being transparent on how much they've got and they're putting it all quick in the media to show that they're far from collapsing.But, for me, I don't want to put my trust and confidence on them. It should be everyone must take caution if we're talking about them and those that still haven't learned the lesson must be careful with their moves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "November 29, 2022, 11:39:52 AM",
      "body": "Quote from: dkbit98 on November 28, 2022, 10:23:59 PMDidn't CZ mention Coinbase in this context recently?Looks like he finished with FTX and he is moving to next exchange target now...I don't think all that Bitcoin is owned by them, and they are keeping good amounts of coins from other people.Coinbase exist since early days of Bitcoin, so it's normal to expect they also have a lot of Bitcoin in their portfolio, and I don't think they can go bankrupt that easy, unless they do it on purpose.I will never understand people who keep all their Bitcoin on centralized exchanges, but there are many who are still doing this.It's easy to understand people that do. We have been trained for years to leave our money in banks, use brokerages to hold our stocks and so on.Centralized exchanges are just the progression of that. What I don't get is that after so many have imploded that NEW people still do it.Drawing an arbitrary line, say a week after FTX imploded, there were still people posting about not just using them for trading and pulling their coins off ASAP for no reason I fully admit someone paid me back a bunch of money in ETH that I thought I was never going to see. So I have it sitting there with a trade open for a fair amount more then it came in at. But there are people leaving funds on 3 tier no name exchanges because they don't know how and don't want to know how to do self custody.Why? Well IMO as I said, because they have been taught that you leave your cash in the bank and your stocks in the brokerage so why not leave your coins on an exchange.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "November 29, 2022, 11:55:04 AM",
      "body": "Quote from: dkbit98 on November 28, 2022, 10:23:59 PMand I don't think they can go bankrupt that easy, unless they do it on purpose.They were very recently caught out by the bear market and had to lay off 20% of their workforce in order to cut costs. If a company which has been involved in bitcoin for years is not prepared for the price of bitcoin to be volatile, then I wonder what else they are not prepared for.Quote from: DaveF on November 29, 2022, 11:39:52 AMBut there are people leaving funds on 3 tier no name exchanges because they don't know how and don't want to know how to do self custody.But the likes of FTX and BlockFi were not tier 3 no name exchanges. These were some of the biggest exchanges and biggest platforms in crypto, which is exactly the justification many are using for the fact that they still have coins on the likes of Coinbase or Binance. \"Oh, *insert chosen exchange here* is different. It's well regulated/fully backed up/insured/too big to fail/some other meaningless platitude.\" Are your coins on any centralized exchange? Then start working on the assumption that you own nothing, because there is a very high chance that that will very soon be true unless you withdraw them.Quote from: DaveF on November 29, 2022, 11:39:52 AMWell IMO as I said, because they have been taught that you leave your cash in the bank and your stocks in the brokerage so why not leave your coins on an exchange.As I was just saying in another thread, it's a triumph of centralized exchanges' marketing departments that they have convinced people that they are too stupid to write down 12 words on a piece of paper.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}