{
  "id": "topic_5447927",
  "title": "dk0x",
  "author": "dk0x",
  "created_time": "April 07, 2023, 11:46:53 AMLast edit: April 07, 2023, 01:01:13 PM by dk0x",
  "content": "ПРОДАЕМ ГОТОВОЕ РЕШЕНИЕ ПОД КЛЮЧТорговый робот НА АВТОМАТЕ делает 1-3% на депозит в ДЕНЬ.БИЗНЕС МОДЕЛЬ (пессимистический сценарий):Представим себе, что рынок замер в боковике и бот показывает минимальные значения прибыли):Стоимость подключения - 25.000 руб (единоразово)Стоимость аренды серверов - 3.500 руб (ежемесячно)Итого первоначальных затрат - 28.500 рубСтартовый депозит, которым будет оперировать бот, предположим = 100.000 руб. Такой размер депозита позволит получать от 30.000 руб прибыли в месяц.Вы можете внести на депозит как больше, так и меньше, но имеет смысл от 100.000 руб, иначе будет риск - не отбить аренду серверов.Допустим, вы хотите быстро выйти в прибыль и депозит ваш первоначальный будет равен 100.000 руб.Получаем следующие цифры:Первый месяц:расходы -28.500 руб. доходы 30.000, вышли в плюс, отбили затраты на подключение и аренду.Депозит вы можете в любой момент вывести обратно, он ваш, поэтому со второго месяца - мы уже считаем, что вы имеете чистую прибыль.Предположим, вы снимаете свою прибыль регулярно и оставляете только первоначальный депозит, чтобы быстрее вернуть обратно все свои деньги.При такой стратегии - с четвертого месяца вы вернете сумму, которую изначально вкладывали и далее продолжите работать вообще без каких либо рисков. С минимальными рисками, но надо учитывать то что в любом деле есть риски и мы это осознаем (спасибо Ratimov за то что указал на нашу ошибку в описании)Второй месяц:расходы -3.500 руб.доходы 30.000,чистая прибыль 26.500 руб.Третий месяц:расходы -3.500 руб.доходы 30.000 руб.чистая прибыль 26.500 руб.Четвертый месяц:расходы -3.500 руб.доходы 30.000 руб.чистая прибыль 26.500 руб.Таким образом, после четвертого месяца - вы отбили все вложения, включая депозит. Точка безубыточности пройдена.Все деньги полностью вернулись к Вам и депозит на прежнем уровне, причем все это пассивно и без вашего участия.Далее вы можете уже оставлять депозит и не выводить его, чтобы начал работать сложный процент.По формуле сложного процента депозит растет уже намного быстрее, но на всякий случай - рекомендуем выводить регулярно прибыль и не жадничать!Немного о том, как работает Робот:Отличается от других тем, что подстраивается под живой рынок, над его кодом непрерывно трудится целая команда разработчиков, постоянно прогоняются новые конфиги для разных монет, отбираются наиболее прибыльные и выкатываются в работу.Бот постоянно совершенствуется, за два года было пройдено более 1500 пересчетов конфигураций и найдены наиболее прибыльные и устойчивые.Бот скальпирует рынок, открывая микро сделки лонг и шорт на фьючерсных и на спотовых рынках, подстраиваясь под каждый тренд, расширяет сетку ордеров, переоткрывается, усредняется и в итоге, почти не рискуя, делает стабильную прибыль.Алгоритм выдерживает сильные колебания рынка, мы специально не останавливали даже когда штормило до 50% за сутки на волатильных парах, с pump & dump, чтобы максимально оптимизировать защитные стратегии.Бот всегда выступает Маркетмейкером, работает только с лимитными ордерами. Делает много маленьких прибыльных позиций внутри дневного графика, оперируя при том всегда небольшим количеством ликвидности.Взаимодействие с ботом происходит через API биржи, на вашей стороне настраивается ключ и дальше выбираются уже интересующие валютные пары.Бот легален с точки зрения биржи, алгоритмический трейдинг на них поддерживается и аккаунт не заблокируют.Баланс всегда на вашем аккаунте, прав на вывод средств бот не имеет, только торговля в зависимости от баланса.Торги идут 24/7 (в выходные разумеется менее активно, чем в будние дни, но торговля идет постоянно).Отличное решение для пассивного дохода с полным контролем на вашей стороне.Канал в телеграмме https://t.me/+ouyUn-8cPexlODcy в нем есть дополнительная информация а так же контакты для связи.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447927",
  "comments": [
    {
      "author": "dk0x",
      "created_time": "April 07, 2023, 12:10:43 PM",
      "body": "Quote from: Ratimov on April 07, 2023, 12:07:48 PMQuote from: dk0x on April 07, 2023, 11:46:53 AMПервый месяц:расходы -28.500 руб. доходы 30.000, вышли в плюс, отбили затраты на подключение и аренду.Депозит вы можете в любой момент вывести обратно, он ваш, поэтому со второго месяца - мы уже считаем, что вы имеете чистую прибыль.Предположим, вы снимаете свою прибыль регулярно и оставляете только первоначальный депозит, чтобы быстрее вернуть обратно все свои деньги.При такой стратегии - с четвертого месяца вы вернете сумму, которую изначально вкладывали и далее продолжите работать вообще без каких либо рисков.Второй месяц:расходы -3.500 руб.доходы 30.000,чистая прибыль 26.500 руб.Третий месяц:расходы -3.500 руб.доходы 30.000 руб.чистая прибыль 26.500 руб.Четвертый месяц:расходы -3.500 руб.доходы 30.000 руб.чистая прибыль 26.500 руб.Казалось бы, бот несет золотые яйца, зачем вообще кого-то искать для того, чтобы поднять денег? Берем деньги в кредит, продаем имущество, запускаем множество ботов, раскидываем туда деньги и фармим. Через 4 месяца, ба-бах, и все потраченное вернули, а бот дальше фармит. Бесплатный умножитель бабла, но спасибо честным людям, что как только находят ультра козырные способы заработка денег, то всенепременно спешат им поделиться с нами, простыми работягами, которые ищут тут себе что заработать. Мой большой респект таким людям.Я понимаю ваши сомнения, мы такое слышим постоянно Тем не менее все работает и кто хочет- тот зарабатывает, если у вас есть какие-то сомнения в работе робота то можем предоставить статистику работы!И да, вас никто не тянет силком, можете не пользоваться продуктом",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dk0x",
      "created_time": "April 07, 2023, 12:21:20 PM",
      "body": "Quote from: Ratimov on April 07, 2023, 12:15:44 PMQuote from: dk0x on April 07, 2023, 12:10:43 PMТем не менее все работает и кто хочет- тот зарабатывает, если у вас есть какие-то сомнения в работе робота то можем предоставить статистику работы!И да, вас никто не тянет силком, можете не пользоваться продуктом Я не сомневаюсь в ваших способностях. Действительно, кто хочет - заработает, бот никогда не ошибается и проверен уже на дистанции в 8 лет (ну как минимум 2 полноценных рыночных цикла в крипте), чтобы уж наверняка не называть погрешность громким словом СТАБИЛЬНОСТЬ. А еще мне понравилось, что, оказывается, бывает трейдинг без каких-либо рисков. Безрисковый трейдинг, вот так дела. Ну спасибо, что делитесь таким граалем, мир не без добрых людей.Мы опираемся на исторические данные по всем торговым парам и проводим анализ работы робота на дистанции 1200 торговых дней (какие бы были показатели у робота если бы он работал N дней с момента запуска исходя из прошлой динамики торгов), у робота есть функция стоп-лосс и реентри. Конечно в моменте робот может показать отрицательную доходность, но в итоге на дистанции робот действительно стабильно приносит доход.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dk0x",
      "created_time": "April 07, 2023, 12:33:21 PM",
      "body": "Quote from: Ratimov on April 07, 2023, 12:31:59 PMQuote from: dk0x on April 07, 2023, 12:21:20 PMМы опираемся на исторические данные по всем торговым парам и проводим анализ работы робота на дистанции 1200 торговых дней (какие бы были показатели у робота если бы он работал N дней с момента запуска исходя из прошлой динамики торгов), у робота есть функция стоп-лосс и реентри. Конечно в моменте робот может показать отрицательную доходность, но в итоге на дистанции робот действительно стабильно приносит доход. Не вводите людей в заблуждение, говоря, что в этом всём действе нет никаких рисков. Любой трейдинг и любая инвестиция - это всегда риск, чем меньше таймфрейм, тем риска больше. Любая спекулятивная деятельность, основанная на краткосроках, АПРИОРИ является высокорисковым занятием. Без рисков торговля и инвестиции бывают только на бумаге. Я могу поверить в то, что кто-то научился извлекать из рынка 3% в день. С опытом и грамотной стратегией это можно осуществить, не прям стабильно каждый день, в среднем, за какой-то промежуток времени, но я никогда не поверю никому, кто говорит, что та или иная торговля не содержит в себе никаких рисков. Это пиздаболия 100%-ная.Тут с вами согласен, риски есть в любом деле! Всегда! Я к вам прислушаюсь и исправлю описание для того чтобы в дальнейшем таких вопросов не возникало",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}