{
  "id": "topic_5419574",
  "title": "Bttzed03",
  "author": "Bttzed03",
  "created_time": "November 06, 2022, 02:51:02 AMLast edit: January 09, 2023, 02:08:51 PM by Bttzed03",
  "content": "May libreng offer ang DICT para sa Programming, Machine learning, HTML and CSS, robots, cloud services, at digital literacy courses. In case may oras kayo magdagdag ng skill o may kakilalang naghahanap, magandang opportunity ito. Napansin ko in demand ang mga ganitong skill lalo na abroad.Sources:https://www.facebook.com/ILCDBuDICT/posts/pfbid02tr2xcDERwVxMAE4subyW7kfRdMexSEmawvhak4NzVATKNtwVptJTWt1h8jqNntGglhttps://www.facebook.com/ILCDBuDICT/posts/pfbid02qVrkYdg3TbT3ppwhsS77AGvJNXVFMNRrXP7urUT29K6sSzLk7FuWU1HFbC7s616Zl",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5419574",
  "comments": [
    {
      "author": "Jemzx00",
      "created_time": "November 09, 2022, 01:01:34 PM",
      "body": "Curious lang ako, yung mga ganitong courses na available for free ay usable or pwedeng gamitin as references sa resume natin kapag nag-apply? Most company kasi na nakita kong hiring ay naghahanap ng either IT graduates or may mga experience sa mga programming languages with certifications. Most of the time rin, ang hinahanap nila ay yung certicates like CCNA, AWS at iba pang paid certificates na high value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "November 09, 2022, 09:49:51 PM",
      "body": "Quote from: Jemzx00 on November 09, 2022, 01:01:34 PMCurious lang ako, yung mga ganitong courses na available for free ay usable or pwedeng gamitin as references sa resume natin kapag nag-apply? Most company kasi na nakita kong hiring ay naghahanap ng either IT graduates or may mga experience sa mga programming languages with certifications. Most of the time rin, ang hinahanap nila ay yung certicates like CCNA, AWS at iba pang paid certificates na high value.Usually kapag free events walang certificate na binibigay pero you can try to join naman and nothing to lose here but more on gaining experience, maganda ito especially if exposed ka sa ganitong industry. Maraming inooffer na mga free courses si DICT as they continue to adopt and develop technologies as well, medyo di nga lang ito align sa aking course kaya baka mahirapan lang ako to understand the topic. Sana magkaroon den sila ng basic course for Blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jemzx00",
      "created_time": "November 10, 2022, 04:59:39 AM",
      "body": "Quote from: Johnyz on November 09, 2022, 09:49:51 PMQuote from: Jemzx00 on November 09, 2022, 01:01:34 PMCurious lang ako, yung mga ganitong courses na available for free ay usable or pwedeng gamitin as references sa resume natin kapag nag-apply? Most company kasi na nakita kong hiring ay naghahanap ng either IT graduates or may mga experience sa mga programming languages with certifications. Most of the time rin, ang hinahanap nila ay yung certicates like CCNA, AWS at iba pang paid certificates na high value.Usually kapag free events walang certificate na binibigay pero you can try to join naman and nothing to lose here but more on gaining experience, maganda ito especially if exposed ka sa ganitong industry. Maraming inooffer na mga free courses si DICT as they continue to adopt and develop technologies as well, medyo di nga lang ito align sa aking course kaya baka mahirapan lang ako to understand the topic. Sana magkaroon den sila ng basic course for Blockchain. Actually, maraming mga free courses na nagbibigay ng mga certificates kapag natapos mo yung course like sa Cisco, marami silang free courses rin kaso most of the time, yung CCNA or yung paid courses yung hinahanap ng mga recruitment. Pero sabagay kahit hindi magamit as reference yung certificate, atleast may dagdag knowledge rin about sa mga computer languages.  About sa blockchain courses, pwede mo i-check yung mga bank like Unionbank at kahit yung DOST dahil nagooffer sila ng courses sa blockchain at cryptocurrencies pero mostly basic at general knowledge lang din.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "November 16, 2022, 09:59:11 PM",
      "body": "Meron ba dito na nakasubok na magenroll for this free course?Curious lang den ako kung possible ba ito kahit hinde ka naman kagalingan and gusto mo lang talaga matutunan ito. Sana magkaroon pa sila ng maraming courses about blockchain technology, alam ko marame ren dito ang interesado kaya lang limited resources lang talaga yung iba. Medyo mahal ang robotics course as far as I know, kaya ok ang opportunity na ito.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bhadz",
      "created_time": "December 01, 2022, 09:37:11 PM",
      "body": "Quote from: Jemzx00 on November 09, 2022, 01:01:34 PMCurious lang ako, yung mga ganitong courses na available for free ay usable or pwedeng gamitin as references sa resume natin kapag nag-apply? Oo naman, malaking edge din yung mga ganitong certificates pero magkaiba pa rin ang certification ng ibang organization at company lalo na related sa IT. Certificate kasi given lang kapag natapos mo yung course pero yung certification or IT certified, yan talaga yung may exam tapos magbabayad ka pa para lang maka-take ng exam. Mas may edge pa rin yung mga IT certification tulad ng nasabi mo CCNA, AWS, Azure at iba pa. Hindi lang DICT nagbigay nitong free sponsorship pati rin Globe.Quote from: crzy on November 16, 2022, 09:59:11 PMMeron ba dito na nakasubok na magenroll for this free course?Curious lang den ako kung possible ba ito kahit hinde ka naman kagalingan and gusto mo lang talaga matutunan ito. Sana magkaroon pa sila ng maraming courses about blockchain technology, alam ko marame ren dito ang interesado kaya lang limited resources lang talaga yung iba. Medyo mahal ang robotics course as far as I know, kaya ok ang opportunity na ito.Walang blockchain, ok yang course na yan. Wala naman mawawala sayo, magaling ka man o hindi, matalino ka man o hindi, lahat yan pasok dyan at mga videos lang yan na papanoorin mo tapos may mga materials kang sasagutan at babasahin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}