{
  "id": "topic_5471360",
  "title": "Zanab247",
  "author": "Zanab247",
  "created_time": "October 23, 2023, 03:57:58 PM",
  "content": "Greetings my fellow Naija LB users, I brought this topic to seek for good advice from this forum so that I will not miss it in life because, I keep hearing this statement that opportunity come but once but I don't know if my opportunity has come through this plan on ground. I came out from a popular community in my state where we use to do memorial burial every 4 years to honor our late father and, to  troll a big party that will make the childrens, youths, chiefs, Royal highness, government officials and politicians to be on ground on that memorial burial to join us to honor our super Hiro and, we use to entertain everyone in that burial with different foods and different drinks. We the children of my late father, we use to contributed #200,000 each in every 4 years to carry out the burial memorial activities and we are 5 in numbers that are alive which the total amount of money we used to spend for the burial is #1,000,000, and we have concluded to increase the money to #500,000 each since the price of commodities has increased higher in the country. And the burial memorial is coming up December 10th 2024 to make it 4 years and we have contributed #1,500,000 to finance the burial and they appointed me to hold the money till December 1st before the family will begin to use the money for the burial, and the money will be send to my account this month end. And I like BTC investment, I feel like investing the money in BTC since it will take like 9 months before they will demand for the money for the burial and, it look like my opportunity has come. Is it an opportunity for me to blow? Or my opportunity has not yet come? What is your advice to me on this.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471360",
  "comments": [
    {
      "author": "Obim34",
      "created_time": "October 23, 2023, 05:39:14 PM",
      "body": "Yunno eh... Sometimes making decision is hard to some level, and I think at this point it is best for you to carry out this decision by yourself. In any of your decision making it only affects you at the very end be it positively or you facing the consequences.But if I am to be in your very shoes I wouldn't touch a dime from the money, we all have love for Bitcoin and will want to invest more and more as we can but in this case were the money was not raised by you and neither was it given to you as a present but to be used in celebration of memorial service of your late father give him the accode respect cos u never know how the market might turn out to be, maybe positive or even negative never can predict Bitcoin, so I suggest you always be at the safer side",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "October 24, 2023, 11:25:29 AM",
      "body": "Well e dey dicey with the story wey you drop follow am. We all know say btc this time around na good investment, almost like sure profit taking before or close to next year December but you need to dey careful make debt no follow you. Na how you go take pay back the money be the koko, abi you dey federal job  I don look your account, you still dey member rank but if to say your rank high pass like that and you dey for very long campaign wey you still believe no go end anytime soon, I for say make you run am with some part of the money at least with 1m or 1.2m and lock the rest for account wey you no go touch, so that you go dey pay your weekly pay enter there and before you know you don utilize am as opportunity. But since you no dey campaign, no invest am.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odohu",
      "created_time": "October 24, 2023, 12:04:23 PM",
      "body": "Quote from: Zanab247 on October 23, 2023, 03:57:58 PMGreetings my fellow Naija LB users, I brought this topic to seek for good advice from this forum so that I will not miss it in life because, I keep hearing this statement that opportunity come but once but I don't know if my opportunity has come through this plan on ground. I came out from a popular community in my state where we use to do memorial burial every 4 years to honor our late father and, to  troll a big party that will make the childrens, youths, chiefs, Royal highness, government officials and politicians to be on ground on that memorial burial to join us to honor our super Hiro and, we use to entertain everyone in that burial with different foods and different drinks. We the children of my late father, we use to contributed #200,000 each in every 4 years to carry out the burial memorial activities and we are 5 in numbers that are alive which the total amount of money we used to spend for the burial is #1,000,000, and we have concluded to increase the money to #500,000 each since the price of commodities has increased higher in the country. And the burial memorial is coming up December 10th 2024 to make it 4 years and we have contributed #1,500,000 to finance the burial and they appointed me to hold the money till December 1st before the family will begin to use the money for the burial, and the money will be send to my account this month end. And I like BTC investment, I feel like investing the money in BTC since it will take like 9 months before they will demand for the money for the burial and, it look like my opportunity has come. Is it an opportunity for me to blow? Or my opportunity has not yet come? What is your advice to me on this.This is a very serious temptation my dear. The recent momentum in Bitcoin is pointing to the fact that the next bull run will be massive and if you take this chance, that might earn you more than $2k if everything goes right. But if you ask me, I will say you should follow my first rule of investment... never invest what you cannot afford to loose because nothing is guaranteed. Even though we are optimistic that next year will be great for Bitcoin, we are not sure how things will pan out. The bull run can linger until 2025 thereby putting you at the risk of damaging your reputation. So, I will advise you to weigh the advantages and disadvantages. Unless perhaps you are credit worthy in the sense that you can source for the funds by the time it is needed should anything go south. Else, I will advise you to apply DCA to build your Bitcoin portfolio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adams0001",
      "created_time": "October 24, 2023, 01:27:11 PM",
      "body": "Quote from: Zanab247 on October 23, 2023, 03:57:58 PMGreetings my fellow Naija LB users, I brought this topic to seek for good advice from this forum so that I will not miss it in life because, I keep hearing this statement that opportunity come but once but I don't know if my opportunity has come through this plan on ground.Opportunity comes but once, but it is not with this money that you will invest in bitcoins because if anything happens to the money, they will hold you responsible because it is similar to a loan because they gave you the money and you will return it back when needed, investors invest money that they can afford to lose because no one knows how he will be in the next 9 months you said,  Because the price can change at any time, I cannot advise you to invest that money in bitcoin because it is not only you who has the money and no one can predict bitcoin's volatile, that will say the price will rise in the next one month or weeks but if you are a federal worker or a business person and you know you can get the money back in the 9 month even if the market does not go well, I can say you are good to invest the money but I notice you are not a worker yet because if you are a federal employee or business partner, you will not creat this thread because you will be investing in bitcoin with your earnings, Because you stated that you like Bitcoin so you should find another way to get money that you can afford to lose without getting discouraged when the market goes bad, because any investment is a risk you either make money or lose, so don't use burial money to invest because no one can predict what will happen in the coming months.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Broadanbig",
      "created_time": "October 24, 2023, 02:33:32 PM",
      "body": "Omo this one no be that kind opportunity you dey think say e be o. This your talk sef no be wetin person go hear finish come Jones o. E no bad to invest in Bitcoin o but OP hmm if e happen nobody go hear this story wey you see et Yan like this so. If you are  conversant with Bitcoin slogans I believe you must have heard about the \"investment with what you can afford to lose\" and \" invest with your spare cash \"  there is a reason why these slogans metamorphosed and as such, one should know that Bitcoin is a volatile asset which which can take one unawares. If I would advise you, this money resulted as a family contributions from your siblings and your reputation is at stake if anything should happen to that funds but in the long run, if you are financially capable to make available such amount of money when needed without being under pressure then you can but if not, avoid being tempted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zanab247",
      "created_time": "October 24, 2023, 05:18:49 PM",
      "body": "Quote from: Gozie51I don look your account, you still dey member rank but if to say your rank high pass like that and you dey for very long campaign wey you still believe no go end anytime soon, I for say make you run am with some part of the money at least with 1m or 1.2m and lock the rest for account wey you no go touch, so that you go dey pay your weekly pay enter there and before you know you don utilize am as opportunity. But since you no dey campaign, no invest am.Bro u just hit d point and Wetin dey my mind concerning dis money, I dey think say na opportunity for me to blow to start a good life, and Wetin u talk here na pure true becus if d market price remain low through out next year my secret we open for market and it will make my family members to curse me for such behavior. I don take your advice bro, show say my opportunity never come b dat.Quote from: Adams0001I cannot advise you to invest that money in bitcoin because it is not only you who has the money and no one can predict bitcoin's volatile, that will say the price will rise in the next one month or weeks but if you are a federal worker or a business person and you know you can get the money back in the 9 month even if the market does not go well, I can say you are good to invest the money but I notice you are not a worker yet because if you are a federal employee or business partner, you will not creat this thread because you will be investing in bitcoin with your earnings, Because you stated that you like Bitcoin so you should find another way to get money that you can afford to lose without getting discouraged when the market goes bad, because any investment is a risk you either make money or lose, so don't use burial money to invest because no one can predict what will happen in the coming months. I think my eyes dey open dey see some good advice here, I nor b government employee or business person but I b politician , and d season we dey tak dey make money from president and senators don past wen I for say I fit use politics money replace if d market price remain low till den. I no wan break d trust my family people have for me becus I no b only person wey dey around d village but dey chose me to hold d money becus dey trust me well well, and if dey hear say I put d money for BTC without their consent, it will make dem see me as a bad person and anybody wey go hear d matter no go support me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rachael9385",
      "created_time": "October 24, 2023, 05:39:00 PM",
      "body": "Yes nah true way you talk, say opportunity come but once, yes nah true but that one no mean say nah ever opportunity way pipo get nai them go cuk head put, e get some way dey hold pipo down for front, after e favour you finish e go fit still hold you down.To use something way no be yours take do waytin you no even get guarantee nah wrong verdict, but if nah your own you fit make good use of am, even though say you lose am, you alone no go fit do anything to your self rather than to vex small.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "October 24, 2023, 05:46:49 PM",
      "body": "This na good opportunity level out for you to invest for bitcoin hugely but d inside am in the sense that nobody no be only your money you go take run the bitcoin investment, other people(your family menber) money d inside am. And em no d make sense make peso use money meant for an important thing or borrowed money to invest for bitcoin no matter what. As the matter be so, if I am to be in your situation. Wetin I go do na to use my own money as em hard reach to run the bitcoin investment, other than using our family contribution meant for something important to run am. I am making such suggestion because of anything wey good or bad that comes up from the bitcoin investment na only me em go hit on, no be to another peso. As the crypto market d so, peso no fit predict wetin go fit happen in 9 months time. Even at that, you no know whether something important go fit come up for your family in short time, and your family members wan utilize the money wey you hold at hand to solve the matter first before any other thing since the celebration na 9 months time(they can think of making another contribution before then). Maybe when them go ask you for the money, bitcoin don decrease or never skyrocket for skyrocket for price as you expect am to. To be at the safe side for this matter. Em better make you use your own contributed money to invest for bitcoin sothat anything wey go rise from your bitcoin investment na only you em go hit on, no be on everyone. Family money no be wetin dem d carry to make investment without their concept because their matter long",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EluguHcman",
      "created_time": "October 24, 2023, 06:50:22 PM",
      "body": "Undergoing on this thought seems gambling.My dear, if you can contribute to such amount of money for memorial service then you can raise a capital by yourself to Invest on Bitcoin.Bitcoin is not prioritized to a must of investing with a huge capital , no minimum and no maximum so it is absolutely not advisable to take such a risk. It is a risk because cryptocurrency is a volatility digital currency that if flexible to a rise and fall as inflations and deinflations though 9 months as mentioned is a long way with a probability to succeed but prevention is better of taking that cures.This is not a matter of overcoming the fear of loosing as a business orientation.Else I would ask you to convince your people if you can realize such total amount of total contributions and invest it on Bitcoin with a drafted intense not to continue levying yourselves anymore if only you can Invest the fund that in every 4 years at the approach of the memorial ceremony, you can make a withdrawal of a specific amount as from profits of the long-term investment and as years after years you can all say goodbye to the annual contribution.Imagine if you could invest #1M on Bitcoin investment for a whole 4 year. Oh damn. That definitely would bring an end to your individual annual contributions for up fronts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DubemIfedigbo001",
      "created_time": "October 24, 2023, 07:39:23 PM",
      "body": "you don't invest in any venture with borrowed money. Worse of it all, this money is entrusted into your hands for the commemoration of your dad passing. It is a very challenging decision you are about to make and there are certain things you've to note.Bitcoin is not an ordinary investment, it has no definite ROI, you have to wait patiently for the bull run whenever it will occur to make profits.Short term investment in bitcoin is risky as bitcoin has a very volatile nature and is suitable for long term investment.Investing in bitcoin with funds that are not yours are never advisable as we do not trust the markets and may lead to debts.the best advice I can give you since you want to make gains with the money is to lock it in a fixed deposit account for the period of its stay under your custody and you can enjoy the little gain that comes from it. It may be small compared to what you can get if bitcoin experiences a bull run, but it has a definite ROI and your funds are safe from depreciating, and you are sure of pulling it out when needed. you might now use the profits, maybe for the first six months to invest in bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "October 24, 2023, 09:46:06 PM",
      "body": "Quote from: Gozie51 on October 24, 2023, 11:25:29 AMWell e dey dicey with the story wey you drop follow am. We all know say btc this time around na good investment, almost like sure profit taking before or close to next year December but you need to dey careful make debt no follow you. Na how you go take pay back the money be the koko, abi you dey federal job   for this business nothing sure oh nah just base on how BTC son take stay for long more than a decade nah make people mind just strong for the currency but inno still mean say the tin sure finish.Money wey no be your own no try am at all to reason use am invest for bitcoin weda sure or no sure profit the risk nah yeyeh risk. I dey always tell people say bitcoin no dey run, calm down use ur own money wen you get am invest make u for get rest of mind while investing.If this op go fit get #1.5M take do contributions for late papa memorial then him supposed to get more than that amount as him own money for bank account so make him use him own money take invest BTC, no use contribution money it is not an opportunity but stupidity cos if kasala gas naw u go just regret onto shame say nah you do wetin papa memorial no hold. You sef op reason am",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Richbased",
      "created_time": "October 24, 2023, 10:29:44 PM",
      "body": "Quote from: Zanab247 on October 23, 2023, 03:57:58 PMGreetings my fellow Naija LB users, I brought this topic to seek for good advice from this forum so that I will not miss it in life because, I keep hearing this statement that opportunity come but once but I don't know if my opportunity has come through this plan on ground. I came out from a popular community in my state where we use to do memorial burial every 4 years to honor our late father and, to  troll a big party that will make the childrens, youths, chiefs, Royal highness, government officials and politicians to be on ground on that memorial burial to join us to honor our super Hiro and, we use to entertain everyone in that burial with different foods and different drinks. We the children of my late father, we use to contributed #200,000 each in every 4 years to carry out the burial memorial activities and we are 5 in numbers that are alive which the total amount of money we used to spend for the burial is #1,000,000, and we have concluded to increase the money to #500,000 each since the price of commodities has increased higher in the country. And the burial memorial is coming up December 10th 2024 to make it 4 years and we have contributed #1,500,000 to finance the burial and they appointed me to hold the money till December 1st before the family will begin to use the money for the burial, and the money will be send to my account this month end. And I like BTC investment, I feel like investing the money in BTC since it will take like 9 months before they will demand for the money for the burial and, it look like my opportunity has come. Is it an opportunity for me to blow? Or my opportunity has not yet come? What is your advice to me on this.My advice is just that irrespective of the fact that some risk is worth taking and investing money on bitcoin isn't a bad idea as well I will say whenever you want to take risk in this life let it be what you own as in what is total yours, don't jeopardize others people's interest to your own interest because in this life, the future is unpredictable and moreover despite the fact that bitcoin is a volatile asset isn't enough reason for you to take money that doesn't belong to you alone for trading that's just my candid advice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.suevie",
      "created_time": "October 24, 2023, 10:51:03 PM",
      "body": "For me, I think there need not to  any special opportunity to know it is your time because I actually feel that any opportunity you come across is the one for you, so utilizing the opportunities that come your way is probably the best thing that any man could do for himself because I believe everyone in this world actually gets more than one opportunity so it's just a matter of how well you actually utilize am and turn it to a life changing opportunity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "October 24, 2023, 11:19:49 PMLast edit: October 25, 2023, 02:00:02 PM by Gozie51",
      "body": "Quote from: Lida93 on October 24, 2023, 09:46:06 PMQuote from: Gozie51 on October 24, 2023, 11:25:29 AMWell e dey dicey with the story wey you drop follow am. We all know say btc this time around na good investment, almost like sure profit taking before or close to next year December but you need to dey careful make debt no follow you. Na how you go take pay back the money be the koko, abi you dey federal job   for this business nothing sure oh nah just base on how BTC son take stay for long more than a decade nah make people mind just strong for the currency but inno still mean say the tin sure finish.Money wey no be your own no try am at all to reason use am invest for bitcoin weda sure or no sure profit the risk nah yeyeh risk. I dey always tell people say bitcoin no dey run, calm down use ur own money wen you get am invest make u for get rest of mind while investing.If this op go fit get #1.5M take do contributions for late papa memorial then him supposed to get more than that amount as him own money for bank account so make him use him own money take invest BTC, no use contribution money it is not an opportunity but stupidity cos if kasala gas naw u go just regret onto shame say nah you do wetin papa memorial no hold. You sef op reason am Most of us go dey talk no use loan money invest for btc or borrow money take invest. What of if the person get means to dey pay the money small small while the investment dey run into majority just like I give instance already.Although I been advise op against it because maybe him no get where to take pay back but truely na opportunity dey him face like that (if he has a way to start gathering it back) if he can wait for the bull incase e no really happen for 2024.Talking about the loan to invest, we know sabi say many wealthy people dey borrow money take do business and business go dey move under loan while Dem pay and collect bigger cash again self. Na that one make when some wealthy people die, their business go collapse because bank go collect their money one way or the other.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzwaafu11",
      "created_time": "October 24, 2023, 11:56:50 PM",
      "body": "Quote from: Zanab247 on October 23, 2023, 03:57:58 PMfore the family will begin to use the money for the burial, and the money will be send to my account this month end. And I like BTC investment, I feel like investing the money in BTC since it will take like 9 months before they will demand for the money for the burial and, it look like my opportunity has come. Is it an opportunity for me to blow? Or my opportunity has not yet come? What is your advice to me on this.Even though you indicate an opportunity when it comes to bitcoin investment, we don’t classify this as an opportunity. But ignorance or negligence—how can you pack the money that is not your own and invest in bitcoin, or is it because you see the price of bitcoin is pumping? Don’t be deceived by the current market. The bitcoin market is unpredictable, mate. You need to understand that this investment has a high degree of risk that involves losing your money. So what if you invest this money and they now ask for it? Unfortunately, the bitcoin market dumps. How will you do? Are you going to take another loan to complete their loan?However, people say we should invest in the amount we can afford to lose, so let me ask you: Are you going to be able to lose 1.5 million naira? Nah, mate, so you need to think about the move you are about to take. Don’t make any careless moves in the market. Wait for your time to get money and invest. Don’t use money that you are not the owner of to invest in bitcoin. It may be a big problem.Quote from: Gozie51 on October 24, 2023, 11:19:49 PMMost of us go dey talk no use loan money invest for btc or borrow money take invest. What of if the person get means to dey pay the money small small while the investment dey run into majority just like I give instance already.Borrowing money when you have a means of paying it back is not bad. I think the reason why people say we shouldn’t use loan money and invest in bitcoin is because when you take a loan and invest thinking that the market will pump in a short period of time to pay back that loan, that’s the problem, but having the means to pay back not until you wait for the market to pump is not bad since your investment will remain there for a long period of time without bothering on how to pay back the loan.QuoteTalking about the loan to invest, we know sabi say many wealthy people dey borrow money take do business and business go dey move under loan while Dem pay and collect bigger cash again self. Na that one make when some wealthy people die, their business go collapse because bank go collect their money one way or the other.That type of business you are talking about is not the same as crypto investment. My reason is that those are physical businesses that they can set aside a specific amount that they will be paying back to where they took the loan from because, as the business grows, every single thing they buy and sell in the store will be profitable, unlike crypto investment, where when you invest, you will leave it there for a long period of time till you get your money back with profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "October 24, 2023, 11:58:19 PM",
      "body": "Quote from: Gozie51 on October 24, 2023, 11:19:49 PMMost of us go dey talk no use loan money invest for btc or borrow money take invest. What of if the person get means to dey pay the money small small while the investment dey run into majority just like I give instance already.Although I been advise op against it because maybe him no get where to take pay back but truely na opportunity dey him face like that (if he has a way to start gathering it back) if he can wait for the bull incase e no really happen for 2024.Talking about the loan to invest, we know sabi say many wealthy people dey borrow money take do business and business go dey move under loan while Dem pay and collect bigger cash again self. Na that one make when some wealthy people die, their business go collapse because banks go collect their money one way or the other.It's not wrong to take a loan to invest in Bitcoin,  but what is wrong is that taking a loan to invest in Bitcoin without any stable means of payback and depending on that Bitcoin investment as the repayment back up, is a bad investment approach that can put the investor under pressure and place you in an unfavourable position if the market goes against your predictions or below the bought price. Taking a loan is not a bad financial step,  because many of the today's successful companies many start on funded loans from banks and today they can clear the debt and continue in business,  so first you have to place some things in position before you apply for any loan such things as alternative and stable source for repayment of the loans and having to look away from the Bitcoin investment for a long time,  if all this are in place,  then the loans should be consider to be a positive one,  but if other way around that means that it in the negatives all together.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Egii Nna",
      "created_time": "October 25, 2023, 06:46:29 AM",
      "body": "Quote from: Zanab247 on October 23, 2023, 03:57:58 PMGreetings my fellow Naija LB users, I brought this topic to seek for good advice from this forum so that I will not miss it in life because, I keep hearing this statement that opportunity come but once but I don't know if my opportunity has come through this plan on ground. I came out from a popular community in my state where we use to do memorial burial every 4 years to honor our late father and, to  troll a big party that will make the childrens, youths, chiefs, Royal highness, government officials and politicians to be on ground on that memorial burial to join us to honor our super Hiro and, we use to entertain everyone in that burial with different foods and different drinks. We the children of my late father, we use to contributed #200,000 each in every 4 years to carry out the burial memorial activities and we are 5 in numbers that are alive which the total amount of money we used to spend for the burial is #1,000,000, and we have concluded to increase the money to #500,000 each since the price of commodities has increased higher in the country. And the burial memorial is coming up December 10th 2024 to make it 4 years and we have contributed #1,500,000 to finance the burial and they appointed me to hold the money till December 1st before the family will begin to use the money for the burial, and the money will be send to my account this month end. And I like BTC investment, I feel like investing the money in BTC since it will take like 9 months before they will demand for the money for the burial and, it look like my opportunity has come. Is it an opportunity for me to blow? Or my opportunity has not yet come? What is your advice to me on this.Hmm, this is an opportunity and also not an opportunity because there are two things here when thinking of any step in life: you have to look at the positive side and the negative side to compare which one is more important. The two things are that you are trying to risk your siblings, your family, and also your community reputation, and secondly, you are trying to invest and increase your financial status. If you could remember a great bitcoin proverb, “invest what you can afford to lose,\" which means if you can find a solution to repay that money even though you end up losing the money in bitcoin, then you are good to go, but if you know that this money will be hard for you to return, my brother, forget about investing more in bitcoin for now and find small amounts to start investing; it will be better than using that money that belongs to the burial of your father, and I can also say to you that if any of your family members hear about this thinking of yours, they will organise a meeting purposely because of you because we Nigerians have respect for our culture, norms, and tradition, and believe so, please, when taking a decision, you have to think wisely; if not, you will jump into a run conclusion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HajiBagi",
      "created_time": "October 27, 2023, 11:04:39 AM",
      "body": "Quote from: Broadanbig on October 24, 2023, 02:33:32 PMOmo this one no be that kind opportunity you dey think say e be o. This your talk sef no be wetin person go hear finish come Jones o. E no bad to invest in Bitcoin o but OP hmm if e happen nobody go hear this story wey you see et Yan like this so. If you are  conversant with Bitcoin slogans I believe you must have heard about the \"investment with what you can afford to lose\" and \" invest with your spare cash \"  there is a reason why these slogans metamorphosed and as such, one should know that Bitcoin is a volatile asset which which can take one unawares. If I would advise you, this money resulted as a family contributions from your siblings and your reputation is at stake if anything should happen to that funds but in the long run, if you are financially capable to make available such amount of money when needed without being under pressure then you can but if not, avoid being tempted.That's the fact, sometimes person no go see say opportunity come one in a time say him wan use am, na better risk you wan put yourself like this so, the reason why I said na better risk be say you also know that bitcoin is not the kind of thing that you will always believed that it will continue popping up, you fit use the money invest in bitcoin make E no favor you at end because if you invest and and during the time on doing the celebration or your siblings ask about the money and bitcoin you invest your money price come down and if you sell at that moment the money will not be complete till you went and add to it how will you do? Although you make a wise decision by saying you want to invest the money in bitcoin but sometimes family matters is very risky most especially when it comes to matter of money.Quote from: Gozie51 on October 24, 2023, 11:25:29 AMWell e dey dicey with the story wey you drop follow am. We all know say btc this time around na good investment, almost like sure profit taking before or close to next year December but you need to dey careful make debt no follow you. Na how you go take pay back the money be the koko, abi you dey federal job  Nice one na waiting I dey try explain be this, anybody wey wan try this kind thing supposed think, make the person think say debt no go come follow am, this kind opportunity no be that kind opportunities wey I they always see say if person get am him go fit survive and even make something from it, this opportunity na two things person go dey expect, whether good or bad, because bitcoin fit price fit go down make you no see am sell, and at the last debt Don come your head and money na for una dad burial ceremony wey una dey do every four years, my brother you gast think before getting yourself involve in something wey no good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartGold01",
      "created_time": "October 27, 2023, 01:29:06 PM",
      "body": "You are not yet serious with your life.. first reading your message it doesn't sound real though it could be real but from your statement you said every 4 years in December is the memorial and now you said the money will be requested in 9 months time which December is just 2 months time to come, even though is next year December we still have about 14 Months time to come then how come about 9 months time before the memorial.Well leave that aside, why would you want to go utter the money set for your father's memorial burial? Does this shows a good example of a good child or showing a good example of a good child where your people entrust the money in your custody and you want to go touch the money for a personal gain and interest. Okay come to think of this, what if you used the whole money to buy bitcoin and it crashes to - 50 percent before the memorial day what would you do or do you have to blame the devil for luring you into buying bitcoin or what tell me?Sometimes we often makes a great mistake that would caused serious enemity between our sister and brothers within our families just because of money, why not just go look for your personal funds and invest into bitcoin than just looking for a general funds that was contributed for something very important than just trying to be smart to make profit from people who contribute their money into your hands. Well if it's a dream please kindly wakeup from that dream and think of something much better than putting your hope to become rich with other people's funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}