{
  "id": "topic_5494422",
  "title": "Oshosondy",
  "author": "Oshosondy",
  "created_time": "April 27, 2024, 07:13:36 AM",
  "content": "Some weeks back or probably some months back, wallet of Satoshi was removed from Google Playstore and App store for United States citizens not to be able to access it. No reason stated.It is now Phoenix wallet which is one of the best custodial lightning wallets for bitcoin. No reason also stated for removing the lightning wallet from the Google Playstore and App store for United States citizens not to be able to access it.I guess these lightning wallets are targeted one after the other but we do not know the reason. Is it because Chainanalysis were unable to trace the lightning transactions or the wallet developers are not cooperating with the United States to make lightning transactions on their channels less private?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5494422",
  "comments": [
    {
      "author": "Davidvictorson",
      "created_time": "April 27, 2024, 07:30:54 AM",
      "body": "Their goal is to crush Bitcoin and bring it to their feet. The attack is both external and internal. And trust me they won't stop until their aim of regulating Bitcoin is achieved. By the way if these apps aren't available on the play store and app store for US citizens isn't it going to be available on the official websites of software?I guess I am behind on the Chainanalysis news. Kindly reply this with the link so I can get properly informed on it. Thanks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "April 27, 2024, 07:31:32 AMLast edit: April 27, 2024, 04:09:18 PM by Upgrade00",
      "body": "Phoenix wallet was non-custodian the last time I checked. Is that an error or they've made changes to their mode of operation?The United States are shutting down all privacy platforms that are available. Controlling the flow of money is their biggest strength, these channels gives people an alternative system to use, moving amounts they cannot trace or regulate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "April 27, 2024, 07:45:12 AM",
      "body": "Quote from: Davidvictorson on April 27, 2024, 07:30:54 AMTheir goal is to crush Bitcoin and bring it to their feet. The attack is both external and internal. And trust me they won't stop until their aim of regulating Bitcoin is achieved. By the way if these apps aren't available on the play store and app store for US citizens isn't it going to be available on the official websites of software?I guess I am behind on the Chainanalysis news. Kindly reply this with the link so I can get properly informed on it. Thanks.Most likely their reason, they see the growing activists that are fighting for the rights of people that have been using bitcoin and cryptocurrency and they don't know how to control it besides the limiting on the usage of bitcoin, trying to make the use of it as claustrophobic as it can be for the people so they can get discouraged from using it and eventually making bitcoin less and less valuable as the people that want to use it aren't or can't use it because of the limits imposed by the government, it's probably a high time that the people fight back because bitcoin's worth fighting for you know, if that were to happen in my country, I don't think that not speaking up is the right choice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "April 27, 2024, 07:50:56 AM",
      "body": "Quote from: Davidvictorson on April 27, 2024, 07:30:54 AMI guess I am behind on the Chainanalysis news. Kindly reply this with the link so I can get properly informed on it. Thanks.About United States taken down Phoenix? This is a link that you can read about it https://news.bitcoin.com/acinq-to-withdraw-phoenix-wallet-from-us-markets-amid-regulatory-concerns/Quote from: Upgrade00 on April 27, 2024, 07:31:32 AMPhoenix wallet was non-custodian the last time I checked. Is that an error of they've made changes to their mode of operation?It is not noncustodial.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helena Yu",
      "created_time": "April 27, 2024, 08:38:11 AM",
      "body": "In short they want their citizen to use centralized exchange, they might allow non custodial wallet usage, but only for closed source wallet that created by it's exchange e.g. Coinbase, Bitget. This year is really bad for privacy users (in United States) since they keep attack privacy tools and tightening their laws.Quote from: https://protos.com/phoenix-wallet-to-be-removed-from-us-app-store-after-samourai-crackdown/“recent announcements from US authorities cast a doubt on whether self-custodial wallet providers, Lightning service providers, or even Lightning nodes could be considered Money Services Businesses and be regulated as such.” This was followed by the Federal Bureau of Investigation issuing a warning in which it informed users that it had begun ‘operations’ on a variety of unregistered crypto firms that it believed were money services businesses and told users that they may experience ‘financial disruptions.’ Quote from: https://protos.com/fbi-warns-it-may-cause-financial-disruptions/Specifically, the alert warns against using any money services businesses (MSB) that are not appropriately registered, and further highlights the risk of those “that do not collect know your customer (KYC) information from customers.”",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mia Chloe",
      "created_time": "April 27, 2024, 08:40:11 AM",
      "body": "Bitcoin is the most decentralized crypto currency and it also is the best and most popular one . In addition to all these,  Bitcoin has the highest value of all the crypto currencies, all these make it the top Crypto currency. In fact these are part of the reasons why the governments are skeptical about fully legalizing Bitcoin in some countries with the main issues being that Bitcoin is decentralized therefore even if the government legalizes it they still won't have fully control over it.And just like you mentioned Oshosondy, sometimes people use Bitcoin for illegal transactions making it difficult for the government to track them. Those custodial wallets were used to replace the ones that were removed so that user will probably just use the custodial wallets since they are unable to install Satoshi wallets.In all I guess making use of a VPN would still allow you access the wallet that were removed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "April 27, 2024, 11:10:59 AM",
      "body": "Quote from: Oshosondy on April 27, 2024, 07:13:36 AMSome weeks back or probably some months back, wallet of Satoshi was removed from Google Playstore and App store for United States citizens not to be able to access it. No reason stated.It is now Phoenix wallet which is one of the best custodial lightning wallets for bitcoin. No reason also stated for removing the lightning wallet from the Google Playstore and App store for United States citizens not to be able to access it.I guess these lightning wallets are targeted one after the other but we do not know the reason. Is it because Chainanalysis were unable to trace the lightning transactions or the wallet developers are not cooperating with the United States to make lightning transactions on their channels less private? It's because they have questioning the US about the recent take-down of Samourai and for them, it is not clear,https://twitter.com/acinq_co/status/1783878732865740940So before they could be the next target, they just decided to shut it down for their US customers unless it's very clear where they LN wallet will fall, on what category from the United States.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Catenaccio",
      "created_time": "April 27, 2024, 11:56:24 AM",
      "body": "Quote from: Oshosondy on April 27, 2024, 07:13:36 AMSome weeks back or probably some months back, wallet of Satoshi was removed from Google Playstore and App store for United States citizens not to be able to access it. No reason stated.People will not have that problems if they choose open source non custodial wallets too use.No only because government ask Google or any company to delist, block it from their application store, using a close source wallet is not recommended.[List] Open-source Lightning wallets",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hazink",
      "created_time": "April 27, 2024, 12:11:10 PM",
      "body": "The answer to the question is really simple: if you are not licensed by the US government, they don't want you to operate anything that can transmit money around, since crypto currency has been generally accepted as money, not like the old days when they saw it as something that wouldn't succeed.  The US government wants to be in control of whatever service their citizens are making use of, which can allow them to send or receive payment. Any service that can be proven to a money transmitter is either getting a corporation license or the three-letter US agency will come right after you.  Now I think they have succeeded in getting most of the centralised exchanges under their control and watch, so what's left next is self-custodial services. Don't be surprised when they go after Metamask and other web wallets that US citizens are allowed to make use of, as the SEC has already declared Metamask to be an unlicensed broker-dealer, so the next step is to get it shut down whenever they want.  The SEC, FBI, and other government agencies that are responsible for the regulation and attack on crypto firms are all doing this because they feel crypto currency and other services that offer privacy are obstructing them from having full monetarily control over their citizens finances. Like I said before, these people just make the rules to suit them and come after anything that poses a threat to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legendbtc",
      "created_time": "April 27, 2024, 01:24:19 PM",
      "body": "Quote from: Helena Yu on April 27, 2024, 08:38:11 AMIn short they want their citizen to use centralized exchange, they might allow non custodial wallet usage, but only for closed source wallet that created by it's exchange e.g. Coinbase, Bitget. This year is really bad for privacy users (in United States) since they keep attack privacy tools and tightening their laws.Quote from: https://protos.com/phoenix-wallet-to-be-removed-from-us-app-store-after-samourai-crackdown/“recent announcements from US authorities cast a doubt on whether self-custodial wallet providers, Lightning service providers, or even Lightning nodes could be considered Money Services Businesses and be regulated as such.” This was followed by the Federal Bureau of Investigation issuing a warning in which it informed users that it had begun ‘operations’ on a variety of unregistered crypto firms that it believed were money services businesses and told users that they may experience ‘financial disruptions.’ Quote from: https://protos.com/fbi-warns-it-may-cause-financial-disruptions/Specifically, the alert warns against using any money services businesses (MSB) that are not appropriately registered, and further highlights the risk of those “that do not collect know your customer (KYC) information from customers.”Not only the US government, I believe that other governments will also imitate and follow what the US government is doing because no government wants to lose control of its citizens. The more decentralization and privacy spread, the more governments will tighten things up and even ban and eliminate anything they think will harm them.  America was once considered the country with the best human rights in the world, where an ordinary citizen could sue the president but no one dared to speak out against what the government was doing. It can be seen that ultimately neither privacy nor decentralization can escape government.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "April 27, 2024, 02:58:28 PM",
      "body": "I won't be surprised if US will be taking down or bringing regulations for every crypto address should be connected with the KYC because they're not interested in people having privacy and the reason they say is money laundering but they're afraid of tax revenue cuts or decentralised monetary system started taking the path they didn't expect at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "April 27, 2024, 03:18:36 PM",
      "body": "Most probably they won't holders to sell for the institution's Bitcoin ETF custodian. It's just Coinbase has the right to hold their BTC all the rest are illegal.Seem ahead of time but this is going to end up in confiscating their BTC since those users who submitted KYC can be tracked and they will find these users and take their BTC. No kidding, lol it could happen. But of course, it will be like offering the holders a price for selling the BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "April 27, 2024, 03:25:39 PM",
      "body": "Quote from: Oshosondy on April 27, 2024, 07:13:36 AMSome weeks back or probably some months back, wallet of Satoshi was removed from Google Playstore and App store for United States citizens not to be able to access it. No reason stated.It is now Phoenix wallet which is one of the best custodial lightning wallets for bitcoin. No reason also stated for removing the lightning wallet from the Google Playstore and App store for United States citizens not to be able to access it.I guess these lightning wallets are targeted one after the other but we do not know the reason. Is it because Chainanalysis were unable to trace the lightning transactions or the wallet developers are not cooperating with the United States to make lightning transactions on their channels less private? This isn't their first attempt on Bitcoin network to see that every other elements attached to it have been crippled before the main launch of attack on the bitcoin itself, since they cannot achieve regulating the network, all they feels like doing are these, whereas I expect them to be the highest users to keep encouraging others to continue with the use and adoption of bitcoin globally, we shouldn't care much about them or the raging attacks they are mounting because everything will soon fade as it doesn't work effectively on a decentralized network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "April 27, 2024, 04:06:26 PM",
      "body": "Quote from: Oshosondy on April 27, 2024, 07:50:56 AMQuote from: Upgrade00 on April 27, 2024, 07:31:32 AMPhoenix wallet was non-custodian the last time I checked. Is that an error of they've made changes to their mode of operation?It is not noncustodial.They are non-custodial wallet and open source, their lightning node is also considered as non-custodial.Quote from: cryptomaniac_xxx on April 27, 2024, 11:10:59 AMSo before they could be the next target, they just decided to shut it down for their US customers unless it's very clear where they LN wallet will fall, on what category from the United States.Seems like it, and also precautions to avoid getting sued, get a warrant, and any worst outcome to their service. Which is really absurd decision for the US government for being ignorant of what the lightning technology is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "April 27, 2024, 04:15:16 PM",
      "body": "Quote from: Oshosondy on April 27, 2024, 07:50:56 AMQuote from: Upgrade00 on April 27, 2024, 07:31:32 AMPhoenix wallet was non-custodian the last time I checked. Is that an error of they've made changes to their mode of operation?[/size]It is not noncustodial.I'll put them somewhere in the middle. They claim to be non custodial on their website and have done so for many years, but to function as a lightening network wallet they do have some levels of custody.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "April 27, 2024, 07:52:03 PM",
      "body": "Quote from: Upgrade00 on April 27, 2024, 04:15:16 PMI'll put them somewhere in the middle. They claim to be non custodial on their website and have done so for many years, but to function as a lightening network wallet they do have some levels of custody.I am not so familiar with the lightning network. One time I wanted to get accustomed to it, then I realized that one had to open and close channels which  could be costly or something along those lines. I gave upCould it be that the rest of the wallet is noncustodial, but then the part that has lightning network integration is custodial to some degree?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "April 27, 2024, 08:09:03 PM",
      "body": "United States has been very aggressive against crypto platforms and that's the reason why most crypto platforms want to exit the US market so they could be safe from the sanctions that they might get if they continue providing their services to US citizens.That means the only platforms will remain working in US who completely agree with the rules of the United States. The ones who doesn't follow the rules and regulations of the US will either get seized or they'll get penalties.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "April 27, 2024, 08:18:35 PM",
      "body": "Quote from: Oshosondy on April 27, 2024, 07:50:56 AMAbout United States taken down Phoenix?The united states have done nothing against Phoenix or ACINQ!They haven't taken anything down, you can see that even their LN channels are still working in the US being hosted in the US.https://mempool.space/lightning/node/03864ef025fde8fb587d989186ce6a4a186895ee44a926bfc370e2c366597a3f8fQuote from: Oshosondy on April 27, 2024, 07:13:36 AMNo reason also stated for removing the lightning wallet from the Google Playstore and App store for United States citizens not to be able to access it.ACINQ, owners of Phoenix have explained that themselves:QuoteRecent announcements from US authorities cast a doubt on whether self-custodial wallet providers, Lightning service providers, or even Lightning nodes could be considered Money Services Businesses and be regulated as such.ACINQ has no MSB license, if the government identifies them as MSB they don't want to risk operating without one, so they are pulling out before they acquire one!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "April 27, 2024, 08:24:35 PMLast edit: April 28, 2024, 09:31:57 AM by Mate2237",
      "body": "Quote from: Oshosondy on April 27, 2024, 07:50:56 AMQuote from: Upgrade00 on April 27, 2024, 07:31:32 AMPhoenix wallet was non-custodian the last time I checked. Is that an error of they've made changes to their mode of operation?It is not noncustodial.I just checked the wallet just now because of the argument and I discovered that Phoenix wallet is purely non custodial wallet which also open source. And why I know that it is a non custodial wallet because after downloading the wallet app. I clicked \"create new wallet\" and as I clicked, straight to the interface of the wallet with the option of receive and send and I clicked on the receive the the public key was shown to me.And on the home page of the wallet I clicked on setting, then clicked again on recover seed. And the seed phrase display on the screen. Therefore there is no argument here again it is purely a non custodial wallet. And look at the app on my phone desktop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}