{
  "id": "topic_5413607",
  "title": "Anonohmon",
  "author": "Anonohmon",
  "created_time": "September 14, 2022, 11:32:50 PM",
  "content": "If the US and Russia get on better relations, will the new Russian government hand over people activists like Edward Snowden? He chose Russia because Russia and the US are not friendly now, so, he knew the treacherous US government would not be able to get him to give him a kangaroo court.  2nd question. Where do you think Snowden might try to go if the Russians ever change their mind about keeping him there but don't actively hand him over? What other countries might not hand him over? China? Iran? maybe Serbia?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413607",
  "comments": [
    {
      "author": "Moneyprism",
      "created_time": "September 15, 2022, 03:46:56 PM",
      "body": "snowden might be deported if putin steps down and russian legislation changes the rules regarding migration.. it's possible that the countries you mentioned above are snowden's destinations.. but i think as long as russia is still having problems with america it's unlikely that snowden will be deported",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "September 15, 2022, 07:54:41 PM",
      "body": "Russians still hate the West and Putin decided to take Snowden in to show USA the middle finger. Russians want the war to end and they don't want sanctions but it's not like they love the US and are hiding this only because they're under Putin's boot. Maybe some other country would take him, because a way he represents defiance and heroism. Many countries hate the CIA and that includes Russia, not only Putin's supporters. While they're at it, they could also deport agent Yanukovych back to Ukraine kick out that troll Steven Seagal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "September 15, 2022, 08:24:49 PM",
      "body": "Given that Snowden's entire life basically revolves around dodging the US government, I'm sure he has plans in place where he can relocate and I would think it's likely he already has.  If he gets caught, it will mean the end of his life as a free man (if you want to call him a free man now).  It's not like he's going to wake up one day and be shocked that he may have to find a new place to hide.  This is a guy that worked for the government.  He knows more than we do about the creepy things they do to their enemies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "September 15, 2022, 09:13:56 PM",
      "body": "During the tenure of Donald Trump, relations with Russia were stable. Despite this, the Snowden case was not brought up on the table. Snowden's status is not linked to President Putin's survival or stepping down, just as the stability between the two countries is not linked to the presidents.Snowden could be received by China or Turkey. And in the worst case, I expect that he will remain in Russia to protect Russian intelligence, especially since he still keeps other files that have not been published on WikiLeaks yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "September 15, 2022, 10:36:57 PM",
      "body": "I wonder why we mention possible countries Snowden would relocate to Iike China, Serbia and the rest should Russia wake up one morning and decide to become friends with the US. The question is, will there ever be a possibility of that happening? Because to be honest, Russia is just being \"civil\" to some extent with them because them and the EU are major patrons of their oil. In Snowden's case, his open defiance of America shows he cares less what the American government would do to him and for him to have leaked information, it shows he's not going to be one of the yesmen of the CIA. At least someone is not happy with the way these bodies who are responsible for upholding the truth and  exposing crime are infact  the ones perpetuating crime.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "September 16, 2022, 08:40:13 PM",
      "body": "Quote from: Anonohmon on September 14, 2022, 11:32:50 PMIf the US and Russia get on better relations, will the new Russian government hand over people activists like Edward Snowden? Edward Snowden will die of old age before the West and Russia establish a working relationship.And that includes Putin dying of natural causes and a new Russian government installment. There is no repairing the broken relations. It will be like this for decades.Quote from: Anonohmon on September 14, 2022, 11:32:50 PMWhat other countries might not hand him over? China? Iran? maybe Serbia?Snowden is safe.Hypothetically, let's say it was not Snowden and it was the next NSA leaker that wanted to seek asylum. The question is which one of these countries is least likely to extradite to the U.S. Iran and China maybe, but then you'd have to live in Iran or China...I'd take my chances being caught by the feds in the U.S.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "September 17, 2022, 03:33:38 AM",
      "body": "Quote from: Moneyprism on September 15, 2022, 03:46:56 PMsnowden might be deported if putin steps down and russian legislation changes the rules regarding migration.. it's possible that the countries you mentioned above are snowden's destinations.. but i think as long as russia is still having problems with america it's unlikely that snowden will be deportedEdward Snowden's alleged crime could attract life imprisonment or a death sentence. His fate if Putin leaves power would be determined by the government or person that took over power from Putin. If the new government becomes friendly with the US then there is every possibility that he might be extradited to the US where he would face the charges levied against him. The only countries that Edward Snowden would move to are those that are too friendly with the United States. It was alleged that he applied for political asylum in twenty-one different countries, hence he is well grounded in seeking refuge. Prime Minister Viktor Orbán might give him the opportunity to stay in Hungary or he might even consider going to North Korea if he has limited or no other options.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "September 17, 2022, 05:24:49 PM",
      "body": "If Snowden's situation is simply that he is a citizen of Russia, and is without plans to move out immediately when necessary, who knows what might happen? It could be that the new regime might not be at all tolerable of former US citizens.Ukraine Carrying out Assassinations in MoscowQuote from: https://www.armstrongeconomics.com/world-news/war/ukraine-carrying-out-assassinations-in-moscow/He [Putin] was not harmed. They are claiming that the first car of the convoy was blocked by an ambulance, but the second car made a slight detour and did not stop. A loud bang was supposedly heard from Putin's car, but it continued and arrived safely at the president's residence.They further claimed that the body of a man was then found driving the ambulance. They have reported that the head of the president's bodyguards and several other people have been suspended and are in custody. Nobody has been named and there is no other news service that has reported this claim.When we look at our models, the real higher volatility and the turning point in Russia appear to be in October, which is also a Panic cycle in the ruble. What we do see is that the Ukrainians carried out assassination hits in Russia. They have been trying to target Putin to kill him without success so far. They tried to kill Aleksandr Dugin with a car bomb, but they killed his daughter Darya Dugina. This is the car bombing of a pro-Putin supporter in Moscow. The sheer hatred between Ukrainian and Russians is legendary and as such the likelihood of this ever reaching peace is unlikely.My sources continue to suggest that removing Putin will escalate things, not stop them. The hardliners will seize power and that will not be good going into 2023. Claiming they have Putin on the run is not going to win the day in Ukraine. It runs the risk of really escalating things for the hardliners in Moscow are criticizing Putin for being too soft on Ukraine. He for the first time started to attack their power grid. The hardliners will push for a serious attack against Ukraine rather than just securing the Donbas....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anonohmon",
      "created_time": "October 05, 2022, 11:57:38 PM",
      "body": "Quote from: Zlantann on September 17, 2022, 03:33:38 AMQuote from: Moneyprism on September 15, 2022, 03:46:56 PMsnowden might be deported if putin steps down and russian legislation changes the rules regarding migration.. it's possible that the countries you mentioned above are snowden's destinations.. but i think as long as russia is still having problems with america it's unlikely that snowden will be deportedEdward Snowden's alleged crime could attract life imprisonment or a death sentence. His fate if Putin leaves power would be determined by the government or person that took over power from Putin. If the new government becomes friendly with the US then there is every possibility that he might be extradited to the US where he would face the charges levied against him. The only countries that Edward Snowden would move to are those that are too friendly with the United States. It was alleged that he applied for political asylum in twenty-one different countries, hence he is well grounded in seeking refuge. Prime Minister Viktor Orbán might give him the opportunity to stay in Hungary or he might even consider going to North Korea if he has limited or no other options.   Hopefully the Russians are never friendly with the USA. I dont suspect they ever will be with the US probably forever having a very hostile and aggressive foreign policy. So long as the CIA is not able to somehow do a coupe and not only overthrow Putin, but every other anti US/NATO member of the Russian government. If anything, there are more hardliners even more aggressive than Putin who probably wouldn't mind taking his place. I wonder what Snowden will do now that he is a Russian citizen and can be called to join the military? Having him work in Russian cyber security might help Russia combat some of the issues they've been facing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iroh",
      "created_time": "October 09, 2022, 08:36:00 PM",
      "body": "Edward Snowden, now a Russian citizen has all the rights and privileges if any, of any citizen of Russia and therefore can’t be deported. Besides, even if some miracle happens and Putin isn’t president anymore, it’s highly unlikely the west and Russia would become buddies just yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "October 17, 2022, 10:21:05 AM",
      "body": "Another fact to consider is this; will Putin hand over power? I think it has been established that he is a dictator and to give up such will take the intervention of either a higher level of power or if nature takes its course and he kicks the bucket because he has been in power for at least 22yrs and is not looking to hand over soon. Edward has been granted citizenship and is now a bonafide Russian as it is so uprooting him  if Putin should retire from office would take a lot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}