{
  "id": "topic_5398713",
  "title": "Ojima-ojo",
  "author": "Ojima-ojo",
  "created_time": "May 14, 2022, 10:21:29 PM",
  "content": "Just want to ride on the bandwagon so I pend down my first post here, just to register my presence on the bitcointalk community, I spent a good number of days reading through the forum to get familiarized with how things are done here before making this official announcement. Good to see you guys around.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398713",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "May 14, 2022, 10:39:18 PM",
      "body": "No question asked, no anything contributed. Then, why this post? I hope you can understand before this thread is removed by one of our moderators. Posting consecutively is also against one of the rules of Bitcointalk.Quote from: mprep on July 21, 2014, 05:27:51 PM32. Posting multiple posts in a row (excluding bumps and reserved posts by the thread starter) is not allowed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "May 14, 2022, 10:48:31 PM",
      "body": "Welcome to the forum.Sticky threads into this board are good for you to read before moving on, especially about forum rules. To stake your address, please place it in the following thread like any other user (only bitcoin addresses are allowed).Hope you are comfortable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "May 14, 2022, 11:00:16 PMLast edit: May 14, 2022, 11:18:52 PM by Ojima-ojo",
      "body": "Quote from: Charles-Tim on May 14, 2022, 10:39:18 PMNo question asked, no anything contributed. Then, why this post? I hope you can understand before this thread is removed by one of our moderators. Posting consecutively is also against one of the rules of Bitcointalk.Quote from: mprep on July 21, 2014, 05:27:51 PM32. excluding bumps and reserved posts by the thread starterWith the right interpretation of that rule, I have the right to reserve that space since it falls between the premises of that law number 32 if its interpretation is different from my conviction then let the moderator do the final justice to that space. You did an excellent job by pointing that out mate. Comment deleted as I signed message on the right thread for further quoting to enhance security of my account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}