{
  "id": "topic_5450682",
  "title": "Ledway",
  "author": "Ledway",
  "created_time": "April 30, 2023, 07:45:23 AM",
  "content": "Looking at the basic fact about the limit of bitcoin according to the protocol for the bitcoin network,it was design with a limit of 21 million coin.   My question now is are cryptocurrency miners be unable to generate new bitcoin after it reach the 21 million coin limit?Since there are over 19.15 million bitcoins in circulation if am not mistaken.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450682",
  "comments": [
    {
      "author": "aoluain",
      "created_time": "April 30, 2023, 07:52:11 AM",
      "body": "NoThe limitation of Bitcoin to 21,000,000 is one of its strongest features. It is differentto FIAT currency in that miners or anyone else cannot decide to \"print\" more Bitcoin justbecause they want another 100.This is one of the features which gives Bitcoin its value, it is not an inflationary currency.Do you think there would be so much interest in Bitcoin if its supply could be easily manipulatedand the total quantity changed so easily, then it really would be funny internet Monopoly money,worth nothing.FIAT - really easy to print more as desiredGOLD - unknown limit to its supply",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "April 30, 2023, 08:05:13 AM",
      "body": "Don't think new Bitcoin is generated by the miners as much as they want, they're mine new Bitcoin which still not being mined on the network.I'd say the 19+ Million Bitcoins which has been mined can be call as circulated because not all Bitcoins can be accessed and traded, the circulated Bitcoin is less than the total of current supply.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sayeds56",
      "created_time": "April 30, 2023, 08:14:35 AMLast edit: April 30, 2023, 08:29:18 AM by Sayeds56",
      "body": "Quote from: Ledway on April 30, 2023, 07:45:23 AMLooking at the basic fact about the limit of bitcoin according to the protocol for the bitcoin network,it was design with a limit of 21 million coin.   My question now is are cryptocurrency miners be unable to generate new bitcoin after it reach the 21 million coin limit?Since there are over 19.15 million bitcoins in circulation if am not mistaken. You are correct that the maximum limit of maximum Bitcoin is 21 Million, and miners won't be able to generate new Bitcoin, once this limit is reached, as well as they won't be receiving any block reward, but they will continue receiving fee for verifying the transactions even after all Bitcoins are mined. The limit of 21 Million is set in the code which can only be changed with a hard fork, which would require agreement of the community.The limited supply of 21 Million is the core strength of Bitcoin, and that is the reason it is considered anti-inflationary and hedge against fiat currencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "April 30, 2023, 08:19:46 AM",
      "body": "Quote from: Ledway on April 30, 2023, 07:45:23 AMLooking at the basic fact about the limit of bitcoin according to the protocol for the bitcoin network,it was design with a limit of 21 million coin.   My question now is are cryptocurrency miners be unable to generate new bitcoin after it reach the 21 million coin limit?Since there are over 19.15 million bitcoins in circulation if am not mistaken. The 21 million is the hard cap for Bitcoin mining once that amount is reached then no one will be able to mine any more bitcoins. The answer to your question is yes after they mined all 21 million bitcoins they will not be able to mine a single more Bitcoin.In current date and time almost 19 million bitcoins has been mined so far, but you should keep in mind that Bitcoin halving happens every four years that reduces the amount of mined bitcoin to half. It is estimated by many experts that all Bitcoins will be mined around year 2140, and most of us won't live to see that day.The next halving will take place in 2024 and with that the mining reward will reduce to 3.125 bitcoin per block and the halving will continue in that way after every four years until it reaches the end at year 2140. Just imagine what will be the expected price of a Bitcoin in that year. Those who invest in Bitcoin today would have rich generations with that investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "April 30, 2023, 08:49:41 AM",
      "body": "Quote from: Sayeds56 on April 30, 2023, 08:14:35 AMThe limit of 21 Million is set in the code which can only be changed with a hard fork, which would require agreement of the community.It may worth mentioning that there is no \"21 millions\" in bitcoin code. The total supply of approximately 21 millions (exactly 20,999,999.9769 BTC) comes from the initial block reward of 50 BTC and halving each 210,000 block.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "April 30, 2023, 08:55:27 AM",
      "body": "Quote from: Sayeds56 on April 30, 2023, 08:14:35 AMThe limit of 21 Million is set in the code which can only be changed with a hard fork, which would require agreement of the community.The limited supply of 21 Million is the core strength of Bitcoin, and that is the reason it is considered anti-inflationary and hedge against fiat currencies.This kind of forking will be hard since we need a consensus of 95% and with the number of bitcoin adopters increasing daily it will not be easy to achieve. Let’s take the bitcoin diamond hard forked form the blockchain for example, it was supposed to address the 21 million limit of bitcoin and it was increased 10 times (210 million) but today the price signifies that bitcoiners do not accept this kind of consensus. So even in future I doubt there will be a fork that will actually solve this limitation problem because it is one of the most important factors that makes bitcoin unique.Quote from: SamReomo on April 30, 2023, 08:19:46 AMThe next halving will take place in 2024 and with that the mining reward will reduce to 3.125 bitcoin per block and the halving will continue in that way after every four years until it reaches the end at year 2140. Just imagine what will be the expected price of a Bitcoin in that year. Those who invest in Bitcoin today would have rich generations with that investment.To explain more, the bitcoin blockchain adds new block every 600 seconds (10 minutes) and after 210,000 blocks have been added it is when the reward is halved which is approximately every fours years. What some people are worried about is that the transaction fee will not be enough for miners when bitcoin mining fees stop coming. Yes today the fees are not that high but with bitcoin adoption growing fast before 2140 there will be more people using bitcoin for daily transactions which will significantly increase the fees. Also not many of the current miners will still continue as the cost of mining is getting expensive daily",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "April 30, 2023, 10:12:22 AM",
      "body": "Quote from: Ledway on April 30, 2023, 07:45:23 AMLooking at the basic fact about the limit of bitcoin according to the protocol for the bitcoin network,it was design with a limit of 21 million coin.   My question now is are cryptocurrency miners be unable to generate new bitcoin after it reach the 21 million coin limit?Since there are over 19.15 million bitcoins in circulation if am not mistaken. The keyword was already said, limit. No longer possible to generate new bitcoins after it's been reached. But you don't worry about that because it's estimated that it will be more than a hundred years until the last bitcoin will be mined. So, we're no longer here anymore and that's likely.While the answer to your question is, miners will work just to confirm transactions by that time if Bitcoin still exists by that year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ledway",
      "created_time": "April 30, 2023, 10:16:06 AM",
      "body": "Quote from: passwordnow on April 30, 2023, 10:12:22 AMQuote from: Ledway on April 30, 2023, 07:45:23 AMLooking at the basic fact about the limit of bitcoin according to the protocol for the bitcoin network,it was design with a limit of 21 million coin.   My question now is are cryptocurrency miners be unable to generate new bitcoin after it reach the 21 million coin limit?Since there are over 19.15 million bitcoins in circulation if am not mistaken. The keyword was already said, limit. No longer possible to generate new bitcoins after it's been reached. But you don't worry about that because it's estimated that it will be more than a hundred years until the last bitcoin will be mined. So, we're no longer here anymore and that's likely.While the answer to your question is, miners will work just to confirm transactions by that time if Bitcoin still exists by that year.that's an interesting point too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "April 30, 2023, 10:26:58 AM",
      "body": "The only thing that would happen is the price of bitcoins will surely rise after that and there will be no manipulation of the production of bitcoins because of its unique technology unlike fiat they can fake and print as much as they want without being noticed and that's their way of crashing an economy of a country just like the old era. Bitcoins will not be like that and the only problem is the altcoins that keep producing and disappearing at the same time. if only people will focus on bitcoins they would never really care about the collapse of altcoins because it was never a part of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "May 01, 2023, 12:38:05 PM",
      "body": "Quote from: Ledway on April 30, 2023, 10:16:06 AMQuote from: passwordnow on April 30, 2023, 10:12:22 AMQuote from: Ledway on April 30, 2023, 07:45:23 AMLooking at the basic fact about the limit of bitcoin according to the protocol for the bitcoin network,it was design with a limit of 21 million coin.   My question now is are cryptocurrency miners be unable to generate new bitcoin after it reach the 21 million coin limit?Since there are over 19.15 million bitcoins in circulation if am not mistaken. The keyword was already said, limit. No longer possible to generate new bitcoins after it's been reached. But you don't worry about that because it's estimated that it will be more than a hundred years until the last bitcoin will be mined. So, we're no longer here anymore and that's likely.While the answer to your question is, miners will work just to confirm transactions by that time if Bitcoin still exists by that year.that's an interesting point too.Yeah, interesting and yours as well. Any thought that you're having is valid but I don't think that most of us will still be alive by that time. Even if I'm also a bitcoin believer and holder, we don't know if by that time bitcoin is still a thing. But as of now, it's here to stay and we're all looking forward to its future. It's good to know about such situations and about these things but then after knowing what will happen by that time, it's best to have that focused thought into accumulation and that's much better for us to get back on track and that's to accumulate as many bitcoins as we can. It may not be a whole bitcoin but you're doing your thing and you've got a progress.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "May 01, 2023, 02:02:49 PM",
      "body": "Quote from: Ledway on April 30, 2023, 07:45:23 AMLooking at the basic fact about the limit of bitcoin according to the protocol for the bitcoin network,it was design with a limit of 21 million coin.   My question now is are cryptocurrency miners be unable to generate new bitcoin after it reach the 21 million coin limit?Since there are over 19.15 million bitcoins in circulation if am not mistaken. The answer is No! Miners will not be able to generate more Bitcoin once all 21 million Bitcoins are mined. At the current pace, it is expected that the last bitcoin will be mined in 2140. You and I won't be here to see that day. Here is a nice article you may want to read,https://www.blockchain-council.org/cryptocurrency/how-many-bitcoins-are-left/This limited supply is actually a guard against inflation. So it is expected to see a huge jump in value as the time goes by.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "May 01, 2023, 02:15:55 PM",
      "body": "Quote from: Ledway on April 30, 2023, 07:45:23 AM   My question now is are cryptocurrency miners be unable to generate new bitcoin after it reach the 21 million coin limit?Since there are over 19.15 million bitcoins in circulation if am not mistaken. There won't be any more bitcoin to be mined after the 21 million cap has been completely reached by the miners. These are not intended to work that way; rather, the software was created that way before the miners came on board. Only the 21 million bitcoins will be usable after they have all been mined, and miners will only be rewarded for validating transactions into the blockchain. Even if the reward had significantly decreased by that point, it would still be worthwhile given how much the price of bitcoin would have increased. And given how expensive mining equipment is become, we might also see a decline in the number of miners.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sayeds56",
      "created_time": "May 01, 2023, 02:45:13 PMLast edit: May 01, 2023, 02:59:08 PM by Sayeds56",
      "body": "Quote from: Ndabagi01 on May 01, 2023, 02:15:55 PMEven if the reward had significantly decreased by that point, it would still be worthwhile given how much the price of bitcoin would have increased. And given how expensive mining equipment is become, we might also see a decline in the number of miners.In my onion, all Bitcoin (21 Million) are mined the miners may charge higher fee for validating the transactions because this  will be only source of their income as mining rewards will diminish. It is also possible that number of miners will decrease as there won't be much revenue in mining activity, however it could be potentially offset by increase in Bitcoin price overtime. It would be interesting to see how things shape up in Bitcoin network in the long term and how miners adapt to the decreasing mining rewards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "May 01, 2023, 02:51:23 PM",
      "body": "Quote from: Ledway on April 30, 2023, 07:45:23 AMLooking at the basic fact about the limit of bitcoin according to the protocol for the bitcoin network,it was design with a limit of 21 million coin.   My question now is are cryptocurrency miners be unable to generate new bitcoin after it reach the 21 million coin limit?Since there are over 19.15 million bitcoins in circulation if am not mistaken. They generate Bitcoin through the the transaction fee payment. If minting of new token is what you are describing then it’s not possible due to the max supply. Bitcoin will never complete those 21M in circulation since some of them is already dormant due to lost access on private key or the owner die. But boy, it will take so much time to completely mine the last piece of Bitcoin since the difficulty increase every halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "May 01, 2023, 03:04:50 PM",
      "body": "Quote from: Ledway on April 30, 2023, 07:45:23 AMLooking at the basic fact about the limit of bitcoin according to the protocol for the bitcoin network,it was design with a limit of 21 million coin.   My question now is are cryptocurrency miners be unable to generate new bitcoin after it reach the 21 million coin limit?Since there are over 19.15 million bitcoins in circulation if am not mistaken. When it comes to the discussion about bitcoin supply, always have it in mind that it is limited to this total supply of 21 million and when everything is completely mined and in circulation, it will remain volatile and people will decide on the buying or selling rate for it, since it's a decentralized network, bitcoin cannot be affected by inflation unlike the USD that have always been printed out from time to time and this is one of the ways fiat encourages inflation and bitcoin doesn't because political leaders will always print the traditional currency in excess and inflate the economy through, unregulated policies, miners will depend on transaction fee for their own reward because there will be no more blocks to be mined or rewarded for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "May 01, 2023, 03:24:50 PM",
      "body": "Miners can't mint new Bitcoin and that is what makes Bitcoin different from all other currencies including fiat and altcoins who's owners can mint new coins just to satisfy their desire thereby lowering the value of those coins. Bitcoin is unique and it has a limited total supply of 21 million Bitcoin, and nothing more, miners just contribute to the network by hashing already existing Bitcoin that has not yet been broadcast on the public ledger network called blockchain and the get paid in fees, aside from that, bitcoin miner has no control over bitcoin and no one does. If the total 21 Million Bitcoins is mind what will be left is the value of each bit will increase just like the reflection of what we are seeing with the price of Bitcoin getting increasingly high, that static circulating supplies is where the value of Bitcoin is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "duckalis",
      "created_time": "May 01, 2023, 03:47:35 PM",
      "body": "Mining itself as a way of earning will cease. There’s speculation that the end of BTC mining will lead to a loss of interest from miners. But we shouldn’t forget that there are still fees paid on BTC transactions as an incentive. It’s the payments that will allow the system to survive, because once all the coins are mined, the price of BTC will rise dramatically, at least that’s what should happen in the long term. Even in the absence of mining and rewards, miners will still have a financial interest in keeping the blockchain safe and working.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "May 01, 2023, 04:42:11 PM",
      "body": "Those who have succeeded in maintaining an investment Bitcoin portfolio may not encounter much issues once it reaches its limit, because they would have enough to trade to those who need it. I also believe that persons who have had experience mining or using Bitcoin would try to explore altcoins and this would create new opportunities for crypto currency and ease the much reliance of Bitcoin. I don't see Bitcoin dying out after it reaches its limit though, because the leaders must have a well thought out plan on how to keep Bitcoin in continuity, even if miners stop mining. What happens to those countries who have adopted it as legal tender, like El Salvador and likes? What also happens to those who have the intention of making it a legal tender?Bitcoin leaders might even produce physical Bitcoin cash for physical trades and transactions. Time will tell eventually, but I doubt it would die out after it reaches its limit of 21million.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "May 05, 2023, 07:14:09 PM",
      "body": "Quote from: Ledway on April 30, 2023, 07:45:23 AMLooking at the basic fact about the limit of bitcoin according to the protocol for the bitcoin network,it was design with a limit of 21 million coin.   My question now is are cryptocurrency miners be unable to generate new bitcoin after it reach the 21 million coin limit?Since there are over 19.15 million bitcoins in circulation if am not mistaken. Bitcoin has limited supply of 21 million but still not total btc in circulation and will be mined gradually upto 2140. Once the supply is reached, there will be no way for miners to generate more new bitcoin. In 2009 for the first time every miner will earned 50 bitcoin as a reward of adding new block to Blockchain, then 25 bitcoin in 2012, then 12.5 in 2016, 6.25 in 2020, and there will be next halving in 2024, by the time the block rewars get to 0btc which is estimated to be in 2140 and then it will be the end of btc mining.I have also one question regarding miner benefit after btc mine limit reached, will these mine machine can be used to mine other coins or these will he useless after 21 million reached?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}