{
  "id": "topic_5458503",
  "title": "HoferBit",
  "author": "HoferBit",
  "created_time": "July 04, 2023, 02:20:06 AM",
  "content": "文/胡翌霖 2013年6月29日原文链接 https://yilinhut.net/2013/07/29/4842.html从我开始买入比特币已经整三个月了，从第一笔1160元1个币的价位买了0.06个币，最低时在372元买了0.5个币，总的来说成本价大概在650元，然后买矿机消耗了5个币，买股票赚了5个币，各种低买高卖和博彩总体来说大约收支持平。这段时间写了一系列比特币相关文章，还在巴比特上开设了专栏，在中文比特币圈子里有了不错的传播，同时在微博上也开始大量关注比特币相关信息，涨粉不少。不过我的老朋友老读者中似乎还很少有被我忽悠加入比特币世界的，这有点让我失望……无论如何，买入比特币一方面是一个避险投资，另一方面也是一项学术实践，这一实践能够把我从科学史、技术哲学、媒介现象学等领域学到的东西串联起来，让我本人非常兴奋。当然，买亏了别怪我，我始终只是建议拿出闲钱中无关痛痒的一小部分，比如1%~10%的存款，赔光了也不至于伤筋动骨的。现在比特币市价在100美元之下（注：这篇文章断断续续写了个把礼拜，现在还是这个价…），也就是说比我的成本价650元低了不少，那么有些人可能会说：还好我之前没听忽悠，不然岂不赔了。但事情并不是这样的。一方面，只有我开始持有比特币，才能进行一系列进一步的探索和实践，股票、博彩、期货等等，只是观望的话总是难以展开深入的了解（后面我会逐一介绍）。另一方面，我的650元成本价并不是一次性投入的，而是跌一点买一点，慢慢积累起来的。任何投资都不能入场即满仓，更不能持有我一定要抢到最低价的心理。分批买入，在大多数时间都留有余地，对下跌的风险有所觉悟，这是必要的心态。现在如果再下跌，我仍然会很高兴地继续买入。对于尚未持币的新手来说，比特币价格下跌才是更好的事情，这意味着我们的入门成本变低了。要注意我毕竟是在鼓吹大家买比特币，而不是鼓吹靠比特币赚人民币。衡量投资是否成功的标准是比特币的增加，想通这一点很重要。用比特币衡量收益，首先就将破除对“矿机”的误解。许多中国人投资比特币的第一件事并不是囤比特币，而是买矿机，这让我非常捉急。无论如何，如果你被我忽悠而对比特币产生兴趣，那么我必须负责任地告诉你：现在不要买矿机，市面上大部分矿机都不值得买，不用听报价就知道一定不要买，无论现货还是期货——因为中国有太多小白推高价格，逐利的商家不可能大发善心地贱卖给你，除非是通过私人关系买到别人回本后发善心半卖半送给你的矿机，或者像我这样，为了好玩、实践以及装X的目的买一台小小的USB矿机。下面我就谈一谈对比特币挖矿的理解，顺路谈几款山寨币（NMC、LTC、PPC、XPM），因为山寨币所做的主要也都在于对挖矿模式的调整。 一、挖矿：维护网络的可靠性，兼论买矿机的不靠谱性为什么矿机不值得买？什么是矿机？我稍微讲解一下。当然，细致的介绍请自行搜索，我只是讲一讲我所理解的关键点。首先比特币的本质是一个无中心的记账系统。每一个完整的比特币钱包都保存有比特币发明以来的所有交易记录——目前来说已经达到10G之巨，当然普通使用者可以选用不带完整数据的简化版乃至在线钱包（如blockchain）。而只有我掌握相应地址的钥匙，可以动用自己的余额给其它地址发送货币。所谓的发送货币并不是一对一地发送一段数据，因为如果只是对接受者一个人发送数据的话，那么我同时也可以对另一个人发送同一段数据，谁来确认第一段数据合法而第二段数据不合法呢？也就是说，当我发送一笔钱之后，收款方应当知道我拥有发送这笔钱的能力，但其他所有人也应当立刻知道我已失去了向他们发送同一笔钱的权利。这怎么做到呢？中心化的货币很简单，只需要由一个核心权威来审核每一笔交易就行了，但去中心化怎么做呢？比特币的方案是每一笔交易都同时向整个网络发布信息：“张三给李四发送了X个币”。那么整个网络的其他人立刻要做两件事，第一是确认这条消息的确是由拥有相 应钥匙的人发出的，别人可以在不知道这一钥匙的情况下确认我发出的信息的确经过特定的钥匙解密，这一过程如何实现是密码学方面的问题，在此不多说了；第二是确认我的账户里的确有足够的余额，这是根据有史以来的所有交易记录推算出来的。如果通过了确认，那么整个10G账目本就将再增添一条信息。但任何货币都需要面对一个问题：防止伪造。如果我发送了超出余额的量，而我的同谋者作弊，帮助我确认这一发送是合法的，那怎么办。显然，在中心化的体系中，我们可以把裁决权交给某个权威，但在去中心化的网络结构下，没有人有绝对的裁决权，当出现有人说合法有人说不合法时，最终胜出的只能是“多数”。如果超过50%都验证通过了，那么那些少数的异常者就会被排除。然而问题是，什么的50%？所有用户的50%？但我一个人可以开很多台电脑，在每台电脑上跑很多个程序，同时操纵无限个“用户”，网络货币又不可能挨个检验使用者是否是活人，靠什么来界定50%呢？比特币的解决方案是：靠运算能力。比特币规定，所有记账者都需要进行一场运算竞争，每个参与者要以某种特定的算法对一段时间内的账目表进行打包，两个人如果对账目有分歧的话，打出来的包当然会不同，他们互相不承认，而其它承认某个包的参与者会沿着这一个包继续打下一个包，以此类推，最终分歧会表现为不同的分支，作弊的人只能在错误的账目分支后面继续打包下去。那么一个中立的参与者会选择哪个分支呢？选择总的打包难度最大的那一支。每一次打包都是一个运算竞赛的结果，我们可以知道这个包是在多少难度下被完成的，于是就可以计算出某条分支上所经历的总难度。而运算竞赛的难度会随着参与者的增多而变难——比特币设计为无论参与者总的运算能力有多高，运算竞赛的难度总是会不断调整，以使得大约每10分钟才有一个包被算出来。也就是说，在参与者更多的主链上，竞赛的难度会越来越难，以至于算力较弱的作弊者不可能完成同样强度的账目分支。简而言之，比特币世界的所谓50%取决于整个网络的运算能力，一小撮脱离主流的作弊者——无论他们设置了多少虚拟账户，他们的运算能力毕竟受到物理的限制，要完成作弊——所谓“51%攻击”——必须在现实中布置庞大的计算设备才有可能达成。这件事情听起来非常困难，事实上现在比特币全网总算力已经超过全球五百强超级计算机算力总和的好多倍了。但51%攻击的危险是确实存在的，这是由于比特币矿业开始走向集中化规模化（稍后细说），现在业界老大烤猫公司（中国的哦）已经能够占据全网的20%~30%，而除比特币之外的许多后起的密码币更是经常处于或者有些已经经历过51%攻击了。不过51%攻击并没有想象的那么可怕，事实上许多后起的密码币（国内一般称作山寨币，都是对比特币进行模仿和改动创造出的，后面细说）有许多经过51%攻击仍然存活，FTC最近经历过51%后价格不降反升，有人把51%说成山寨币的“成人礼”，顶过这一考验才算成熟。比特币本身也并非没有出现过故障，就在今年比特币的某次软件升级后，旧版本不认新版本生成的新币，造成了比特币网络的严重分裂，但这个问题很快得到了修补，比特币的汇率也在短暂腰斩之后很快恢复了回来。如果比特币网络真的面临51%攻击的危机，也是随时可能通过升级软件进行防止，但现在还没有必要。总之，所谓挖矿就是争夺记账权的这一算力竞争活动，意义在于保障比特币交易的安全性。但参与者消耗算力参与比赛有什么好处呢？比特币的设计是，每次第一个成功打包一笔账目的人，可以奖励一笔新生货币，外加这笔账目里包含的所有税费。新生货币的奖励是逐渐减少的，前4年每打包一区块（约每10分钟）奖励50个币，之后每4年减半，最后趋近于0。不过同时，由于比特币交易的日趋活跃，交易中产生的税费可能日渐增多，参与挖矿的竞争者总是能够得到好处的。如果没有好处，没有人会参与，但如果没有成本，参与将失去控制。计算设备的购置和维护以及设备运行所消耗的电力就是参与挖矿的成本。总的来说，挖矿的收益应当趋近于挖矿的成本，略微高出一点。顺便说一下，最近由于新的ASIC矿机的出现大大降低了挖矿成本，因此比特币行情的下跌压力较大。不过随着大量新矿机正在和即将投入运转，挖矿的产出也将迅速变低（因为每10分钟全世界获得的挖矿奖励是一定的，参与者多意味着获奖率变低），因此相对而言挖矿成本又会很快飙升（挖矿成本是相对于产出而言的，也就是每挖出一个币所需投入的成本，这一成本长期而言应当接近于一个币）。什么是ASIC矿机？简单来说，这是一个专门设计来进行比特币记账计算的机器，除了挖矿之外什么都干不了。但由于这种定向设计，使得它的运算效率相当之高。最近几个月一方面比特币的行情暴涨，另一方面矿机革命让挖矿成本降低，所以在某一个时期内挖矿形成暴利，挖矿者和矿机生产者把挖矿所得再投产新矿机，迅速扩大规模。但依靠挖矿而获得暴利的投资者，仅限于在专业矿机新发明之初的那批敢于为下赌的人，但现在早已错过了那个时期，现在你再有胆魄，也不可能通过买矿机暴利，甚至几乎不可能收回本钱（当然，你还可能通过卖矿机暴利），真想赌博的话不如去玩中本聪骰子。现在买矿机不叫赌博而叫送钱。整个比特币网络在一定时间内给予所有矿工的奖励是基本恒定的，现在是每10分钟25币，也就是每小时150币。那么有100台相同的矿机参与，每台就能平均分到1.5币，10000台的话就是0.015。随着参与人数之增多，投产矿机的增多，单位计算力能够获取的奖励就越来越少。而且按照现在的情况，以及在可预见的将来的情况，挖矿的难度将是呈指数增长的，前两个月就增加了一倍左右，也就是说收入减半。如果按照这一趋势发展下去（事实上下半年的增速更可能扩大），现在花1个币买1G/s的算力也几乎不能回本，更何况许多厂家开出的八月乃至九月份的期货矿机也要高于这个价。为什么不能回本呢？道理很简单，因为递减的等比数列之和是收敛的。1+1/2+1/4+1/8+1/16+……=2，这是中学就应当知道的数学常识，但许多人忘记了这一点，或者压根没有去想。也就是说，如果挖矿产出每两个月减半，那么某一个固定的算力在所有时间内能够挖出的币就大致等于开挖头两个月的产出的一倍，或者开挖之前两个月同等算力的产出。当然，这没有考虑到真实的比特币全网算力增长可能出现停滞的情况，但也没有考虑到算力进一步加速暴涨，或者矿机损坏，矿机商跳票等情况。有人说我看好比特币，所以我买入矿机。这是搞反了。比特币发展得越好，参与者越多，矿机就越难以回本。只有指望比特币网络陷入停滞，矿机才能回本。又有人说，虽然比特币的产出少了，但将来比特币如果升值的话，我不是也回本了吗？这就是我开头说的，被法币迷惑的错觉了。现在花2个币买一个矿机，汇率是一个币500人民币，最终挖出了1个币，却涨到10000人民币，那岂不是赚大了？这种想法很搞笑：投入2个币收获1个币竟然说赚了。现在买入2个币，过一年，过两年都还是2个币，2＞1，这恐怕是婴儿都知道的常识，但在许多矿机投资者那里却丧失了。矿机市场在中国已呈爆炸式发展，许多靠谱的不靠谱的团队都做起了矿机生意，烤猫以令人咋舌的高价买现货矿机，但毕竟还算靠谱的公司——毕竟价格是市场定的，卖高价还脱销我有什么办法？难道要指望商人大发善心自觉少赚一点吗？现在还在做期货矿机一般都是不靠谱的了。但真正荒谬的是算力出租——我不卖矿机了，而是号称在部署机房，让顾客购买已部署的计算能力，例如1G算力出租一年卖多少钱，然后消费者免去了机器的调配、管理、维护等等工序，连电费都帮你包了，就是把相应算力的挖矿产出每个礼拜打给你。多好的方案啊，简直是为中国小白们量身定做的。一些提出较早的类似服务宣传的还是“矿机租赁”，而且需要上缴8%左右的产出，而新近的一些公司则直接按“算力”售卖，而且不需要抽成，甚至还有提供帮你兑换成人民币支付的服务。你只要交完钱坐享其成就可以了。哪有这样的好事？理论上讲，同样的算力，买一个矿机自己去维护，显然不如买算力让别人帮你包圆。但问题出在哪呢？问题在于，商家压根不需要部署哪怕一台矿机，就拿顾客给的钱还给顾客就可以了。显然，你的投入是回不了本的，你投了2个币，我这周给你0.1X个币，你心想很好，20周回本。后几周收入下降了一点，但两个月就超过0.5个币了嘛，不过几个月后可能就每次只能收到0.0X个了，甚至大半年后可能只有0.00X个，最后一整年你可能总共只收到1个币，剩下的就是商家毫无成本的净赚……如果你真想买，我也能提供这一服务，给我13个币我卖你10G算力一年期~我之所以说这么多矿机的骗局，是因为我确实对许多中国人投入矿机深感痛心。固然其中有一些活该被坑死的投机客，但还有不少其实是出于良好愿望的参与者，他们一方面看好比特币，另一方面希望做长线的，收益细水长流的投资。但这恰恰是错误的。看好比特币并希望长线投资的方式应当是囤币，而不看好比特币或希望短线博弈的人才应该去买矿机。许多购买矿机的人不知道他们做的是与意愿相反的选择。这也难怪，因为在通胀的法币体系中，没有人会把持有货币看作一种长线投资，而一台“印钞机”的收益当然是长期的，人们宁愿买一只下蛋的鸡而不是一篮子鸡蛋。这种想法的初衷是好的，但在比特币这里，我们的观念必须做出调整了。痛心归痛心，对于新近入场的许多小白投资者，我也并没有多少同情心。之前在某个卖算力的淘宝店里看到许多成交记录和好评记录，赫然看到有好评者说：“老板真好啊，耐心教我怎么装比特币客户端……”@#$#^%#$……大哥，你连比特币客户端怎么装都没搞好，就跑过来花上千乃至上万大洋买矿机了？所以说这样的人用普通话实在缺乏恰当的形容词——“小白”只是指不明就里的无知者，但非但无知还特别无畏地冲在被宰第一线的，我只能用上海话来形容：耸头（冲头、葱头）。这种人就是活该被宰啊。 二、山寨币：探索不同的挖矿机制我们已经说明，“挖矿”是比特币网络得以维系的运行机制，而现在比特币矿业已进入了专业化的时代。试图对比特币进行改进的努力也一直都在进行，当然一种方式是通过基金会和开源社区的努力，维护比特币本身的版本更新——至今比特币已经发布到0.8.3，大大小小的改进早已做了不少。同时，另一些人直接对比特币的源代码进行修改，发布出一个个新币种来，这些新币种也都基于比特币的思路：去中心化的分布式网络结构，通过整个网络共同验证并记录每一笔交易的方式维持整个交易系统，而维护网络的参与者有机会得到新币和交易税作为奖励——绝大部分新币种都沿用了这样的模式，只是在某些方面作出了不同的调整。因此这些新币被中国人称作“山寨币”，外国人当然没有这样好用的词汇啦，他们管这些币叫“Alternate cryptocurrencies”，直译过来是“替代的密码货币”。考虑到山寨币的贬义，“密码币”作为中性的称呼也许更恰当一些。但事实上绝大多数山寨币连山寨都不配称，只能叫“克隆币”。典型的就是我们中国人的杰作，中国币（CNC）、元宝币（YBC）、龙币、宇宙币，其中有许多奇葩我就不多介绍了。这些币只是把比特币或者前人改进过的币种的源代码拿过来，改几个参数，比如每几分钟产生一个块啊，每个块奖励给矿工多少币啊，币的总量和产出速度啊之类。甚至有一字不改换个名字就上线的。其中有些开发者只是出于娱乐精神好玩一把，但另一些开发者，特别是最近中国冒出来的大量新币种，简单说都是为了坑钱——中国的冲头太多了，国外的也不少。很多人的心态是：我没赶上比特币刚发明的时候，那时候挖矿不就赚大了吗？那么现在也得让我从“原始股”开始抓起。我们可以看“元宝币”的宣传语非常典型地刻画了这种心态：“比特币已经在短短的两年内风靡了全世界，并在逐渐破坏旧的和重建新的金融秩序。最早得知并相信比特币的人如今已经成为了巨富。但是，比特币现如今面临着创始人所没有预料到的挑战，随着ASIC专业矿机的出现，对于普通用户来说，挖矿越来越困难，甚至连电费都无法收回，比特币进一步推广的动力已经逐渐丧失。 比特币早期的大户大都集中在国外，中国用户因为语言的关系，已经错过了比特币早期升值最快的阶段，只能站在高位上接盘；层出不穷的山寨币让人眼花缭乱，甚至一不小心就受骗上当，血本无归…”这个理由听起来还真有那么一点道理，当年比特币是用英文发布在国外论坛的，我们没看到，错过了，这不怪我们，这不公平。现在重新来过，咱中国人自己搞一套~但是这真的不公平吗？事实上比特币在英语国家也长期处于小众地位，而中文圈内的引介也好几年前就有了，目前比特币持有量名列世界前茅甚至数一数二的人物也在中国。俄罗斯等非英语国家在比特币的早期发展中也较为领先。任何新事物的出现总会有一些人先遇到，这并不是什么问题。而且，接触得更早有些时候未必更加占优，事实上早期比特币玩家很多都是挖出了几块矿后觉得没意思就把软件卸了，这些币就永远地丢失了，另一些早期用户看到比特币从一文不值到值得点钱乃至翻了几十倍时早就出手抛售了，反而是稍晚进入的，例如李笑来之类，才赚了大钱。当然，你说咱们偌大个中国也搞一个自己的币出来玩玩，我也支持。但弄出一个完全抄袭复制的东西丢人现眼有什么意义？然后要么是操纵市场，卷钱走人，最好的情况也就是给泛滥成灾的山寨币谱系增添一个垃圾，岂不是给中国人丢人现眼？冠名“中国币”的那一款已经坑了不少人，有望摘得坑爹币桂冠了，不知道元宝币能否后来居上~",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458503",
  "comments": [
    {
      "author": "HoferBit",
      "created_time": "July 04, 2023, 02:21:32 AM",
      "body": "下面我只谈几种除了微调参数，还包含某些实质改变的币种： 1.域名币——副产品模式Namecoin（NMC）可能是最早的一款山寨币，它选择依附于比特币网络，采取“混合挖矿”模式，即可以一边挖比特币，一边同时挖一些域名币。早期的几款山寨币都采取了混合模式，因为当时比特币也处于较早前的阶段，挖矿并没有呈现明显的暴利，也没有太多的竞争，对密码币感兴趣的人当然会优先去挖比特币，没有明显的理由让他们放弃比特币改挖另一种币。所以混合挖矿模式，也就是作为比特币的“副产品”这一定位，是比较可取的方案。所谓域名币一般译作“名币”，但其实这里的Name是域名之名，所以为了直观且通顺，我觉得不妨译作“域名币”。这提示出这一币种的一大创意在于，它还进一步提供了一个“副产品”——一套去中心化的域名系统。我们说互联网是去中心化的，但事实上互联网的某些方面仍然存在某些不可忽视的“中心”，比如域名系统。我们要注册一个域名，就不得不去投靠域名提供商，在根本上各种域名是由ICANN这一国际组织主持分配的。虽然它名义上独立于美国政府，但事实上各国的域名都得服从中央政府的管理，而且ICANN本身也很难保证公平中立，无论如何，域名的分配仍然是一个自上而下的层级结构，而去中心化的非网络结构。受比特币理念的激发，域名币利用比特币所设计的模式维护一套域名系统：每一个参与者都保存有全部的域名所有权和指向的记录，而每一次新注册域名或变更时也会向全网络发布，得到51%的认可的变动会被记录下来。这51%仍然是与比特币一样的以计算力为准，参与验证的工作量将有机会得到一定数量域名币的奖励，而当我注册或续费域名时，则要消耗相应的域名币。这一套机制非常巧妙地解决了域名的去中心化问题，传统上注册域名总是要向某个单位注册，而在这里我们不向某个中心，而向整个网络注册。当然注册并不是任意的，需要消耗域名币，而这域名币是参与维护网络的奖励，或者当然也可以用其它货币向其他用户购得。现在域名币支持.bit域名，当然这种域名不属于通用的互联网域名系统，而是需要特殊的方式（通过域名币网络或代理服务器）才能访问。这个机制是绝妙的，唯一的问题是它发明得太晚了，主流的域名分配体制已经发展得足够充实和普及，以至于难以脱离，没有特别的理由多费周折使用一套额外的系统。所以域名币网络中的域名至今也罕人问津，我还注册到了philo.bit和510.bit两个域名。最近的客户端更新大大方便了域名注册，可能会吸引一些新注册，但这套域名系统目前还看不到普及的前景。除非ICANN被曝出难以想象的丑闻，否则人们仍然会信任它的服务。另外，域名币因为“有用”，所以其价值恐怕不会有太多的飙升，因为它总是应当维持在域名的花销让人可以接受的限度之内。当然开源软件的开发者可以在升级软件时调整域名售价，但这早晚会引起分歧。因此我对域名币的升值前景并不是太看好。但作为第一种流行的山寨币，而且极富创意，域名币是值得尊重的。域名币的系统也提示我们，在比特币的思路下衍伸出来的副产品，未必总是货币，也可以是其它各种去中心化的网络系统。例如新近出现的去中心化即时通讯系统比特信就是一例，这一系统保证通讯不会经过或保存在某一个中心服务器中，也不会被人截取和监听。 2.莱特币——抵制挖矿专业化不过现在山寨币中坐上头把交椅的，或者说密码币中的老二，无疑是莱特币（Litecoin，LTC） 。顾名思义，莱特币号称是轻量版的比特币，相对比特币而言，其区块生成速度更快，确认交易的时间也就更短一些，莱特币的总量为比特币的四倍——这些基本上是简单地改改参数，在莱特币之后，针对区块生成间隔和货币总量等数值换一换，就可以做出另一个新币来。最大的不同是，莱特币与比特币采用了不同的加密算法，比特币是SHA256，莱特币则是scrypt。其实这两种算法也很难说有更可靠或更安全之分，主要区别在于后者计算时需要使用大量内存。顺便说一下，莱特币并不是第一款使用scrypt算法的山寨币，第一款是tenebrix，但开发者不太厚道，公开发布前自己先挖了几百万币，这种行径在开源的系统中当然是隐瞒不了的，而且在开源社区中遭人唾弃。然后莱特币的作者只是简单地复制了tenebrix的源代码重新发布，改名fairbrix，唯一的区别就在于不预先挖矿。但此币在推出后马上就遭到了51%攻击，最后也被废弃。开发者痛定思痛，这次先在开源社区做足预热再发布，这就是莱特币，其实是第三款scrypt山寨币了。我们发现，其实莱特币的技术含量并不是特别高，本身主要只是改了算法，而且这一改动也是直接拷贝过来的。当然在日趋火热之后开发者团队还是做了非常积极的维护工作的，但总的来说创新精神并不是特别强，莱特币的火热在我看来主要还是时势使然。启用新算法，在当时是针对GPU（显卡）挖矿的出现。比特币最初只是利用CPU来进行算力竞赛的，后来有人发现利用GPU，特别是ATI显卡计算的话，效率可以提高上百倍。这便开启了比特币矿业史上第一次“军备竞赛”，挖矿显卡一时间炙手可热，一些人开始特意购置大批显卡布置强大的挖矿组，而只靠CPU挖矿几乎可以忽略不计。而在scrypt算法下 ，GPU虽然也有更高的效率，但CPU的产出还不至于忽略不计，本来已被技术革命淘汰的一批老矿工找到了新的寄托，莱特币可谓应运而生。而最近，随着比特币ASIC专业矿机的出现，scrypt算法又一次被追捧，今年新出的山寨币已经没有再使用SHA256算法的了。因为ASIC矿机是为挖比特币量身定制的，除了计算SHA256算法之外什么都做不了，当然也就没法挖scrypt算法的山寨币了。因此，当ASIC矿机再一次把显卡的效率也远远地甩在身后的时候，被技术革命淘汰的第二批老矿工也投入了scrypt的怀抱。因此我们可以理解scrypt算法之所谓被人青睐，简言之是对挖矿“专业化”的抵制。这种心态可以理解，但如果把它作为莱特币的一项特别优势来看待，我并不同意。事实上，无论哪种算法，早晚都会趋于专业化，就好比无论哪种运动或游戏的竞赛，如果它发展得足够好，奖金足够高，那么早晚都会出现专业运动员和职业队伍，而经过定向训练的专业运动员的竞争力一定会把业余选手甩在身后。要避免专业运动员的出现，要么就只能不停地变换竞赛规则，要么就得保持该竞赛始终不那么火热。也就是说，专业化的出现恰恰是比特币足够火热，以及趋于成熟的标志。scrypt算法目前难以制造专业矿机表面上说只是由于内存配件价格过高的关系，而如果莱特币继续火热，大幅升值，那么内存根本不会构成制造专业矿机的障碍。复制了比特币机制的密码学货币的挖矿机制基本都是在一定时间内有固定的产出，也就是说随着参与者增多，单一参与者的收益一定会摊薄，收益将变得可有可无，最终专业化、规模化的矿工将成为维护网络的主力。这并不是所谓背离比特币初衷的事情，去中心化并不表示一定要夷平任何层级结构和角色分配，就好比互联网也并不必要每台电脑都做服务器。大部分普通人只是网络的接入者，而并不需要担负维持网络的责任。随着比特币的发展，大部分人首先应该是比特币的使用者，而不是贡献者。普通用户，特别是设备过时的普通用户，被比特币挖矿业淘汰是一个正常的趋势，这标志着比特币从最初爱好者小圈子内的新奇玩物，开始进入普及和实用的阶段了。早期参与者支持比特币的主要方式是挖矿，而现在的参与者如果要支持比特币，那么最好的方法就是来使用它，扩大它的流通范围。而对全民挖矿时代恋恋不舍，只是一种不成熟的表现。我并不完全否认新算法的意义，事实上在比特币网络已然足够成熟的时候，新生的山寨币恐怕不得不采取新的算法，以保证较难受到51%攻击以及对老玩家的吸引力，所以scrypt几乎成了近期新出山寨币的标配。但是必须指出的是，这种创新本质上不算是创新，而只是在比特币矿业革命之时顺应了一部分老玩家的恋栈心理罢了。简言之是过渡时期的产物。当然，莱特币赶上了天时人和，占据了极大的成功，出于惯性，它的地位很可能还将保持下去。但是就我更关注思想，而不是利润的哲学立场来看，莱特币并没有多大意思。我现在也在用显卡挖scrypt系的山寨币，然后立即换成比特币，目前来说比直接挖比特币要多赚一些。现在新出了多币自动矿池，如https://www.multipool.in/，它会自动监视所有山寨币在市场上的汇率（与比特币交易）和全网挖矿难度，自动选择产出价值最高的币种来挖。另一家矿池http://middlecoin.com/还可以自动兑换成比特币发送报酬，有好显卡的朋友还是可以挖挖的，但是当然不要为了挖矿特地去买显卡。 3.点点币——股权模式，节能与通胀PPcoin（PPC），Peer-to-Peer，点对点币。其实比特币显然也是“P2P”货币，所以其实作者Sunny King并没有给这款币起一个独特的名字。但Sunny King无疑是所有山寨币作者中最认真的一个，他最近又开发了一款素数币，采取了和比特币和点点币都不同的进路，稍后再说。和比特币的创造者中本聪一样，Sunny King开发的新币首先都会给出一份白皮书，或者说一篇论文，这一点非常重要，这意味着这一新货币首先是一种思想，其开源程序是对一种理论探索的实践，而不仅仅是复制或跟风。而其它大多数山寨币，无非是在前人基础上改改参数，根本写不出什么论文来，顶多只能提供百科介绍页面（wiki）罗列一下各条参数，更无从论证这一新币的意义在哪里，究竟在探索什么。无论Sunny King其人如何，就冲这两篇论文，我就尊敬他，相信他与那些只为圈钱的山寨币开发者不是一个级数上的人物。点点币主要的创新是全新的“股权证明（Proof of Stake）”模式。相对于比特币的“工作量证明（Proof of Work）”，点点币采用PoS+PoS的模式来确认交易。之前我已经讲过了，比特币不是通过中心化的机构，而是通过全网络的51%来确认交易的合法性。而所谓51%，在比特币那里由计算能力而定，矿工们参与算力竞赛，最终以“工作量”为奖励的基准。而在点点币这里，初期仍然以工作量证明为主，而等到网络中持有的点点币日渐增多，将逐步变为股权证明为主，也就是说，按照参与者持有的货币数量来决定发言权。在PoS模式中，51%不是由算力，而是由持币量决定的。而通过PoS参与维护交易网络的报酬也按照持币量的比例分配，大致相当于年利率1%。这样一来就有了几个“好处”。首先是51%攻击的成本更高了，不但要占据全网过半的计算力，更要占有过半的货币量才行，随着时间的发展这将越来越难以企及。第二，随着总持币量的增加，算力竞赛的收益将递减，因此长远来说挖矿业的“军备竞赛”不会无止境持续下去，因此维护点点币网络将是非常“节能”的。第三，年利率1%左右意味着点点币的总量并没有一个固定的上限，但又不会被某个中央机构任意滥发，通胀是微量和可预期的（事实上黄金也有大概每年1%的增加，但基本上我们仍然把它看做通缩的）。之所以把“好处”打上引号，是因为所谓好处总有相对性，我并不认为点点币的这些改进的思路是无效的或徒劳的，但也未必说这些改进一定让点点币比比特币更优越。在之前的文章中我已提过，我不认为光靠比特币一家就能够统治货币世界。去中心化是网络时代的特性，但多元化也是。如果说未来的货币系统是一个生态体系，那么只有位于相同生态位的货币才会你死我活地进行生存竞争，而模式不同、定位不同乃至价值观不同的货币，将会占据不同的生态位，而这些不同的物种才是有可能共生共荣的。而在不同的位置上，衡量好坏的标准也不一样，比如猎豹当然比树懒跑得快，但这并不证明猎豹这一物种比树懒优越，而跑得快对于猎豹来说是优点，但放在树懒身上却未必是优点。即便是黄金的时代，银币和铜币也都作为补充与之长期共存。黄金也未必是适合做主要货币的最佳元素，黄金的地位也有其天时地利人和的种种偶然因素，但即便将来发现了更优越的金属，也不必把黄金的地位替换掉。事实上没有哪一个物种是完美的，也很难说有一种金属用作货币是最完美的，例如黄金虽然各方面性质优异但是过于稀缺以至于其开采太容易被垄断，日常小额交易也不太便利，而铜钱产量较 多且分散，但又容易泛滥且容易掺假，白银则相对平衡一些。如此各有长处各有缺陷的多种货币共存，相互平衡或此消彼长，这才构成一个完整的货币生态。所以，我们可以把点点币的节能、微通胀等特性视作其优点，但并不是说在比特币那里一定存在相应的“缺点”。那么比特币是否确实有严重缺陷呢？当然比特币并不完美，但一些问题未必是必须修正的。首先说因为算力竞争而面临的算力垄断的可能性，这是确实存在的，但在经济学和全网维护者的自发调节下并不容易做到，而这种危机感的始终悬临有时候也会起到积极的促进作用。其次是耗能问题，必须承认这是一个大问题，长远来讲，比特币的成本应当趋近于其挖矿产出，而一旦比特币的价值进一步飙升，那么其挖矿成本也将无限飙涨。但每台挖矿设备本身的成本和电费消耗是一定的，将来要耗费更多台相同的设备才能挖出同样的矿，这就意味着挖出同样的矿所耗费的能源将会不断上升。这一机制并不是没有坏处的，挖矿投入和产出根据市场规律达到某种平衡，随着比特币新币产量的减少和货币价值的趋稳，挖矿业不会总是像最近这样爆发式扩张，一方面挖矿投入仍然会不断增加，但幅度不会过于离谱，随着技术进步降低计算设备的能耗，总的能源消耗也不至于失去控制。应该说在可预见的将来比特币交易网络的维持始终会比任何一国的法币体系的维持节能环保得多。但在将来呢？如果竞争对手不是法币体系而是其它密码币呢？ 那么，仅在“节能”这一点上，比特币的确是弱项。这就好比树懒肯定比猎豹节能，关键在于它采取了不同的生存模式。点点币要达到节能的效果，必须使用股权证明，年利率的模式，而这些模式并一定比比特币优越。微通胀的特性又怎样呢？由于点点币通胀的新币完全是通过类似“存款”的机制获得而不是首先通过无中生有的贷款，所以这种通胀不太会泛滥成灾。而比特币总量趋近于定值，由于存在钱包丢失的情况，事实上长远来说比特币的总量是不断下降的。当然，总量恒定或下降都不会影响货币的实用性。哪怕世界上只剩下一百枚比特币，数字货币极易拆分，所以照样能够很好地流通。但长远来说，总量不断减少确实会有某些问题，假设比特币能通行数百年，数百年后可能大半的币都遗失了，当然无论剩下50%还是10%，这个货币体系仍然能照常运转。但是也许突然一个考古发现从故纸堆里发现出一个大钱包的密钥，比如李笑来据说接近总量1%的纸钱包。而现在的1%可能在八百年后就变成10%了，结果是考古发现当年突发10%的通胀。这样一来，随着时光流逝，比特币将越来越让人担忧，而且人们事实上不知道那些几十年不使用的货币究竟是被有意地囤积、暂时被遗忘，还是被永久地遗失了。这使得人们对比特币总量的估计越来越不可靠。这方面点点币就没有问题，因为1%的年利率事实上是需要始终开启客户端参与网络维护才能获得的，闲置和遗弃的币并不会自动增长。当然这实在是太过杞人忧天了。互联网时代的节律以十年为跨度，百年乃至千年后时代早就变过无数次了。到那个时候，甚至可能就在几十年后，由于量子计算的发展，整个基于密码学的数字货币都将被全盘颠覆（也包括传统金融世界），如果幸存下来，比特币也将经历无数的修订和改进，现在就开始谈论百年跨度的缺陷并没有太大实际意义。不过，毕竟有理论上的意义，因此点点币的探索和实验当然是非常有意义的。4.素数币——有科学价值的挖矿素数币（Primecoin，XPM）是Sunny King近期发布的新币，这款币的发布被我赶上了，我在发布后第一天就参与挖矿，挖得300枚。后来该币受到了极大关注，这300枚币一度可以卖到超过5个比特币（将近三千大洋），而现在也大约能卖得2个比特币。可惜我以更低一点的价格卖出了100多币，剩余近200币收藏观望。很明显我白捡了一个便宜。这也并非撞大运，我事先就看好这一币的前景。这倒不是说我对素数币的意义真的特别认同，首先我相信无论素数币解决的是否是比特币的一个缺陷，但至少的确有许多人认为它是缺陷，就像有许多人认为矿机专业化是缺陷那样。既然有人支持，那么它就会值钱。素数币解决的仍然是比特币挖矿的“耗能”问题，解决的方案不是减少耗能，而是试图让耗能变得有意义。事实上比特币是全球最大的分布式计算项目之一（应该没有之一吧），全网算力早已超过世界500强超级计算机总和的数倍。这么大的运算能力仅仅为了维护比特币网络本身，是不是太浪费了呢？而其它分布式计算项目，有的在计算蛋白质折叠，有的在寻找引力波，有的在搜索外星人，做的是各种科学工作。那么比特币网络坐拥如此庞大的算力，如果能做一些科学计算，该有多好呢？但鱼与熊掌不能兼得，本来挖矿是为了维护交易的安全可靠，而采用计算随机的密码的方式来比拼算力，但如果竞赛的题目不是随机的解密，而是特定科学问题，那么可能更容易出现作弊的情况。不过是否可能在保证安全性的同时获得一点科学效应呢？ 我想还是有可能的。一种办法可以是像域名币那样的副产品模式：既然可以混合挖矿，在挖比特币的同时做一些与比特币无关的域名币计算，那么当然也有可能附加其它计算。不过这不需要开发另一套货币，而是可以在比特币基础上开发一个附加应用来实现，然后由某个矿池来主持科学项目，这是完全有可能的。即便只是比特币算力的一个零头，也足以让其它许多分布式计算项目眼红。（当然目前的问题是专业矿机只能进行SHA256计算，可能莱特币等还在用电脑挖的scrypt系货币更适合做类似的事）。另一种更彻底的方式就是专门开发一套新币了。寻找蛋白质等需要有专门机构来设计和安排的具体研究项目似乎不太适合去中心化的模式，而数学问题似乎更加适合。素数币顾名思义，旨在寻找大质数。同时由于素数分布的随机性、不可预见性，又有可预计的分布概率，用寻找素数证明工作量，似乎是个可行的方案。当然素数币本身的技术设计未必完美，例如它寻找素数的方法似乎是不完备的，有一定程度的例外，而且在数学上似乎也不是最好的素数算法。具体的原理我不清楚，但估计是为了在寻找素数和货币验证这两项原本不相干的任务之间达成平衡而做了许多妥协。但我认为不必过早苛责素数币的不完善，毕竟它首先是一篇论文，是一种新思路，其次才是沿着这一思路进行的实验。尽管有诸多妥协，但它确实把网络货币与科学计算嫁接起来了。在此基础上，我们可以期待它的进一步发展。比如说，之前提到的作为副产品提供一些科学计算的附加应用，附加在比特币或莱特币上，都不如附加在素数币上更名正言顺。甚至我设想这种“额外科学计算”可以被嵌入素数币本体之内：网络上任何的参与者都可以发布某项计算课题，只要这一课题是可以以一定的规则进行分布式计算，并且其难度是可预估的，研究者可以发布问题和悬赏，矿工们根据赏金和难度的收益率决定是否参与计算，而参与计算的矿工将根据工作量得到悬赏者支付的奖金。在没有人悬赏时，矿工们则继续处理素数问题。而问题的答案既可以向全网公开，也可以以加密的形式解出，只有悬赏者自己的私钥才能查看。这样一来，一种真正分布式的分布计算系统成为可能。当然这一设计在技术上恐怕还有许多问题，但素数币是打开思路的第一步。bitcoin:1411wgvec6AKWa5cp7sYqNdo8bq6T4xpe6?label=yilinhut",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}