{
  "id": "topic_5423423",
  "title": "SatoPrincess",
  "author": "SatoPrincess",
  "created_time": "November 26, 2022, 09:57:13 PMLast edit: November 26, 2022, 10:07:53 PM by SatoPrincess",
  "content": "How time flies, today marks my  first ever crypto meeting  I attended as a newbie. I have been to several crypto meetups and seminars since then. The crypto event was sponsored by FTX, this was the first time I heard about them. It was well organized, they had over 500 persons in attended and I bet you over 80% downloaded the FTX trading app that day. The first speakers who I think were an ambassador for FTX spoke at length about the exchange, explaining how they work, what they provide and why they were better than others in the market positioning themselves to beginners as the number 1 destination for buying and selling cryptocurrencies. Looking back at this moment, it’s scary that a giant in crypto such as FTX turned out to be a fraud. At first I thought it was just competition between two big players Binance and FTX, but as things began to unravel in the following days, it became clear that there weren’t going to survive this one.Reading the news about FTX fallout, I found something that’s most interesting, it was reported that the company were not selling real bitcoin or ethereum on their platform but an IOU. It begs to question what other exchanges are operating like this? Crypto exchange Binance has released its new proof-of-reserve system that provides evidence that the exchange holds the digital assets it says it does. I do feel a sentimental attachment to FTX, regardless of that I wouldn’t trust centralized exchanges with $0.01. KEY TAKEAWAYS* Within hours of filing for bankruptcy, FTX said it was the victim of “unauthorized transactions” and that it would move its digital assets to cold storage for security purposes: As far as we know this information could be bull and FTX is trying play the Mt gox card. We all know what happened in 2014. FTX may just be trying to use that method to hide their shady dealings and lack of proper risk management as a company. * Centralized Exchanges are supposedly regulated, that’s why some people feel at ease using because they are like banks sort of, so it beats me what the U.S. Securities and Exchange Commission (SEC) and other regulators were doing when FTX were playing with customers funds. How did FTX pass the books?* Crypto meetings and seminars are great and should focus on crypto discussions only not company promotions.  Be careful if they start promoting a crypto, a project or company.  Sometimes it can become a Ponzi show and speakers start talking of steps to wealth and so on. Do not get too excited by the testimonies you hear at such meetings that you invest blindly. Don’t be persuaded or feel pressured to join, do your due diligence and make your own judgement.* Question everything. Even if you’re a newbie, do not take everything you hear at a seminar, YouTube channel or discord without hesitation or reservation. Treat every new information with caution as it may very well affect the decisions you take concerning your crypto investments. * The events that have occurred throughout the years across different crypto era Mt Gox in 2014, now FTX in 2022 has taught crypto investors that this CEXs cannot be trusted and we have come to realize the importance of using decentralized exchanges. https://www.investopedia.com/what-went-wrong-with-ftx-6828447https://medium.com/@CryptoSavingExpert/binance-releases-proof-of-reserves-for-its-bitcoin-holdings-1ca82ff5a9ba",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5423423",
  "comments": [
    {
      "author": "jackg",
      "created_time": "November 26, 2022, 10:42:05 PM",
      "body": "I remember watching videos about bitconnect and a lot of those meetings, conferences and seminars were with huge audiences and people on the team that were over excited about the product (that was a ponzi scheme).It's hard in this space to work out what's a company and what isn't. I've seen good lectures given on decentralised protocols but you can prove they're decentralised because their devs don't hold many coins, some debs (like eth) have quite a high percentage iirc and quite a lot of control so I don't know whether I'd quite consider that decentralised anymore.Don't fall into the trap of thinking you can trust a company in the cryptospace. Binance's proof or resurve bs could become a way to cause a crash at some point (perhaps if regulators start rejecting them and ask them to withdraw their services from that country)...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "November 26, 2022, 11:01:52 PMLast edit: November 26, 2022, 11:14:10 PM by Accardo",
      "body": "Indeed cryptocurrency meetings that's only focused on trading on a specific exchanges is quite incomplete. I prefer watching developer's conferences where varieties of blockchain project teams, each, come to teach people how they operate, and their long term aim. The trading niche is speculative and uncertain. People must stay watchful regarding trading especially newbies. The meeting you attended was a sponsored meeting by FTX more like an advertisement for the exchange. And many fell prey to this marketing strategy because no one could predict correctly what's next in the market. When venturing into the cryptocurrency market one must expect the unexpected; at first nobody could predict this FTX bankcrupcy, Luna crash and other hassles that affects investors and traders. Its our duty to stay updated and abide by the rules, do your own research and own your keys. Like you said; people relax with the impression that exchanges are under a serious regulation. Thereby, trusting their funds on the hands of these exchanges. In a nutshell, those who don't research always fall victim to the disputes of this ever volatile cryptocurrency market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "November 27, 2022, 03:29:59 AM",
      "body": "Quote from: SatoPrincess on November 26, 2022, 09:57:13 PM-snip-* The events that have occurred throughout the years across different crypto era Mt Gox in 2014, now FTX in 2022 has taught crypto investors that this CEXs cannot be trusted and we have come to realize the importance of using decentralized exchanges. Even so MT.Gox remains the only Centralized Exchange (CEX) that collapsed and resulted in many losses. Mt.Gox operated from 2011 to 2014 and managed to control 46% of the crypto market from 2010 to 2014 because nothing was as popular as Mt.Gox anymore. and FTX controls only 13% of the crypto market from 2019 to 2022.The biggest hack that happened to Mt.Gox harmed around 478 users with a total loss of 25,000 BTC and Mt.Gox itself declared bankruptcy losing 850,000 BTC due to the hack.The impact of FTX has not been as strong as that experienced during Mt.Gox, but even so, the short-term impact is currently being felt strongly in terms of trust in the Centralized Exchange. Negative sentiment resulted in investors continuing the bear market and many assets being liquidated.Even big companies like Chainalysis are one of FTX's investors and are currently also affected. Blockchain analysis company has a long relationship with FTX and in 2019 the two collaborated to change the AML (anti-money laundering) system and Know Your Customer (KYC).Apart from Chainalysis, there are around 53 companies that have been confirmed to have business partnerships with FTX in early 2022.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}