{
  "id": "topic_5400790",
  "title": "Question:",
  "author": "blue Snow",
  "created_time": "May 31, 2022, 12:04:21 AM",
  "content": "The Premier League season 2022/2023 starts on 6th august 2022 and finishes on 28 May 2023, the schedule will be released on 16th June 2022.The team for this session:ArsenalAston VillaBournemouthBrentfordBrighton & Hove AlbionChelseaCrystal PalaceEvertonFulhamLeicester CityLiverpoolManchester CityManchester UnitedNewcastle UnitedNottingham ForestSouthamptonTottenham HotspurWest Ham UnitedWolverhampton WanderersUEFA Champions League:Manchester CityLiverpoolChelseaTottenham HotspurUEFA Europa League:ArsenalManchester UnitedUEFA Europa Conference League:West Ham UnitedPromotion Team:FulhamNottingham ForestBournemouth*Drop your favorite team in reply and don't forget pool on top.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400790",
  "comments": [
    {
      "author": "Spack17",
      "created_time": "June 01, 2022, 11:58:56 PM",
      "body": "It is very difficult to make this choice right now. Injuries during the season are a big factor. In addition, the transfer season needs to end to say something more clearly. For now, we can only guess with our feelings. My prediction is that Manchester City will be champions next season. I think they will not win the trophy in the Champions League again, but they will be champions in the Premier League.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "June 22, 2022, 12:36:11 AM",
      "body": "Quote from: Spack17 on June 01, 2022, 11:58:56 PMIt is very difficult to make this choice right now. Injuries during the season are a big factor. In addition, the transfer season needs to end to say something more clearly. For now, we can only guess with our feelings. My prediction is that Manchester City will be champions next season. I think they will not win the trophy in the Champions League again, but they will be champions in the Premier League. you can make the first vote for Manchester City, which is already in the opening thread.now we are in the transfer session, we can begin bet after all transfers are complete and kick off on 6th august 2022. but if someone has a favorite team and sure is the next premier league title, feel free to drop your team in pool.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "June 22, 2022, 03:04:13 AM",
      "body": "It's the usual Manchester City and Liverpool unless they start trading their core players. I don't really see other teams challenging these two clubs. Chelsea is still in the process of recovery after what the UK Government did to their Russian owner while Spurs will continue to struggle for a top four spot. I don't think there's a need to explain why Man United or Arsenal won't be champions anytime soo hehe.It's nice to see Fulham back to top flight again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mamesso",
      "created_time": "June 22, 2022, 08:59:16 AM",
      "body": "I think the race for the Premier League title will be dominated by Liverpool and Manchester City, these two teams are also very active in the transfer market in preparation for the start of the new season. Manchester United and Chelsea can pose a threat, but both teams are still recovering. Roman Abramovich has just left Chelsea who is known to be very loyal to spending his money to strengthen the club, while Manchester United ended the season imperfectly.On the other hand Arsenal and Tottenham can be dark horse teams in the Premier League, coupled with abundant money from Newcastle after being acquired by the prince of Saudi Arabia. So it is not wrong if the EPL is called the best league in the world, because the EPL has a lot of big clubs, interestingly the more big clubs, the more big matches will be presented.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oluwa-btc",
      "created_time": "June 22, 2022, 09:59:13 AM",
      "body": "Quote from: Yogee on June 22, 2022, 03:04:13 AMIt's the usual Manchester City and Liverpool unless they start trading their core players. I don't really see other teams challenging these two clubs. Chelsea is still in the process of recovery after what the UK Government did to their Russian owner while Spurs will continue to struggle for a top four spot. I don't think there's a need to explain why Man United or Arsenal won't be champions anytime soo hehe.It's nice to see Fulham back to top flight again.It's the premier league, I'm sure they won't repeat what they have done for the past season this time around, era's and good times also comes to an end, reasons to why it is the most competitive league around the world no hype and horn tooting when it comes to that aspect not even the media found responsible for giving the premier league what it's achieved today.Tottenham Hotspur! Don't look down that side this time around, Antonio Conte is an ambitious Coach and will always win something big when he does visits a new club, good examples are, Juventus, Chelsea, Inter Milan, now it's over to the London side, a big limitation to achieve he's desired goals will be from Daniel Levey. That's only when he fails to sign quality players. They need to get another defender and possibly some attacking midfielder that comes from the bench to change games.They're my tip for the new season, still keeping an open mind for Manchester United, but right I'm currently replicating Romelu Lukaku ( I'll be on loan to the London side giving them my support until Manchester United gets into a good shape )Chelsea loosing a big figure ( Mariner ) I wonder what will be the outcome when she finally leaves, although, good things also comes to an end. She'll be missed when it comes to getting deals done for Chelsea during the transfer window market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "June 22, 2022, 10:55:20 AM",
      "body": "From the present situation with the ongoing transfer market still open, Manchester city right now has a supperb team and what a team needs to also be the next English premier League champions, having boosted their team with a credible strike like Erling Harland and other players which is likely to join the team and with the formidable team they've already got for now there's no team ahead of Manchester city for me to choose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bering",
      "created_time": "June 22, 2022, 01:27:36 PM",
      "body": "Talking about the favourite i'm a Liverpool fans even since Gerard as a captain i always support this team and last season Liverpool had good achievement because can reach to the final match from 3 different competitions and fight til end of season with Manchester City for race title but a bit dissapointed for me because from 4 possibilities to win the trophies Liverpool only win FA Cup and Carabao cup but next season i have high expectation for them especially after the arrival of new players such as Darwin Nunez, Fabio Carvalho and Calvin Ramsay so i wish Liverpool can get champion league trophy or get premier league title",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "June 22, 2022, 02:16:20 PM",
      "body": "In the 2022/2023 Premier League standings, as I know from the total clubs that will compete next year, some of them have maneuvered/transferred their top players, like: Man City and Liverpool, in my opinion, this is more interesting to talk about.Although some analyzes say certain clubs will stay, like Man City, I personally am not convinced by that analysis, There are many predictions that analyze Newcastle United, Man United can get into the top six or five, I think this prediction is a bit contrary to what has happened on the field so far.I just analyzed that in the 2022/2023 English League tournament, the next strongest club/team to enter the top four are: Tottenham, Arsenal, Chelsea and Liverpool, this is just my current analysis, of course the certainty could change until the last five/sixth after the remaining clubs.For sure I have a good chance to bet on the upcoming Premier League, of course I will update until the semi-finals and determine my favorite club to win the Premier League 2022/2023.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "June 22, 2022, 02:23:50 PM",
      "body": "It is usually a battle between Manchester city and Liverpool. Although transfer is still going on, man city may lift the cup this season because of the calibre of players they are retaining. Manchester United doesn't look serious for the trophy with the bad performance they had last season except they have some good changes especially in defence line up. Tottenham is still going to struggle to show her head in the top four. As usual we know how the English premier League turns out, just between the big names.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "June 23, 2022, 05:28:42 AM",
      "body": "So far, Liverpool and ManCity is still in a top pool as favorite with 3 votes eachQuote from: YOSHIE on June 22, 2022, 02:16:20 PMI just analyzed that in the 2022/2023 English League tournament, the next strongest club/team to enter the top four are: Tottenham, Arsenal, Chelsea and Liverpool, this is just my current analysis, of course, the certainty could change until the last five/sixth after the remaining clubs.I respect your choice, everyone can be filled out their favorite team even if it's different from what others choose without defending the champion on the list. Is this mean Manchester City isn't in the top 4? or are those names only your favorite champion?Quote from: Yogee on June 22, 2022, 03:04:13 AMIt's nice to see Fulham back to top flight again.their achievements are not so much, they have achievements as Intertoto champion 2002. besides that, Fulham was the only runner-up Uefa Europa league (2010) and FA cup (1975). This is different from another promotion club, Nottingham Forest F.C premier league title (1978), FA Cup (1898, and 1959), Uefa Super Cup (1979), and final Champion league (1979 and 1980",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rozak",
      "created_time": "June 23, 2022, 05:39:51 AM",
      "body": "after a very exciting last season. this season my favorite is still Liverpool. despite failing to win the Premier League trophy last season from Man City, this season Liverpool will not let their guard down.several other strong teams have also cleaned up. apart from Liverpool, I believe the dominance of Man City will remain at the top of the standings. The two teams will continue to be fiercely competitive. I hope there will be competitors from other teams for more exciting competitions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Razmirraz",
      "created_time": "June 23, 2022, 06:17:45 AM",
      "body": "Quote from: YOSHIE on June 22, 2022, 02:16:20 PMI just analyzed that in the 2022/2023 English League tournament, the next strongest club/team to enter the top four are: Tottenham, Arsenal, Chelsea and Liverpool, this is just my current analysis, of course the certainty could change until the last five/sixth after the remaining clubs.It is possible that Tottenham, Arsenal, Chelsea and Liverpool will dominate the top four in the 2022/2023 season, I also do not exclude the Manchester Duo, especially Manchester City who are the defending champions. The Citizens have won the Premier League six times in the last 10 years, while Manchester United are undergoing a major overhaul after being knocked out of the top four. Newcastle which suddenly became a rich club, can also transform into a star-studded club, of course the club owner has the same ambitions as Manchester City and PSG in terms of trophy acquisition. For me, it is very difficult to analyze which club will dominate the big four, because the Premier League has more than six big teams.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "June 23, 2022, 07:10:33 AM",
      "body": "Quote from: Yogee on June 22, 2022, 03:04:13 AMIt's the usual Manchester City and Liverpool unless they start trading their core players. I don't really see other teams challenging these two clubs. Chelsea is still in the process of recovery after what the UK Government did to their Russian owner while Spurs will continue to struggle for a top four spot. I don't think there's a need to explain why Man United or Arsenal won't be champions anytime soo hehe.It's nice to see Fulham back to top flight again.Do not mind my take on Fulham. I think Fulham just come to play in English Primer League this season and relegate again, I do not see any potential in the club yet that will not let the club relegate.Is Sadio Mané still in Liverpool? The last time I checked, he is leaving Liverpool for Bayern and he has joined Bayern. Also Liverpool may sign good new players as well though, but the transfer window is still open and I can not just know how English Premier League will look like this coming season. Likely Manchester City and Liverpool may be competing but it can surprise us that another top club may also be able to have good competition with them, although I am not thinking such club to be Arsenal or Tottenham.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mia_houston",
      "created_time": "June 23, 2022, 09:06:25 PM",
      "body": "Quote from: rozak on June 23, 2022, 05:39:51 AMafter a very exciting last season. this season my favorite is still Liverpool. despite failing to win the Premier League trophy last season from Man City, this season Liverpool will not let their guard down.several other strong teams have also cleaned up. apart from Liverpool, I believe the dominance of Man City will remain at the top of the standings. The two teams will continue to be fiercely competitive. I hope there will be competitors from other teams for more exciting competitions.Without intending to underestimate other teams, but I suspect that if the title competition next season is no different from what happened in the 2021/22 season, namely between Liverpool and Manchester city, now these two teams are two teams that are quite active in strengthening their squad in the transfer market now, while teams like chelsea, manchester united actually look very passive and we haven't seen any real changes in their squad, while arsenal and tottenham might as usual continue to compete to reach the top 4 and I think nothing more, but indeed Among the 20 teams competing next season, I'm curious to see how newcastle performs in its second season after the new ownership.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "June 23, 2022, 09:21:33 PM",
      "body": "Quote from: mia_houston on June 23, 2022, 09:06:25 PMWithout intending to underestimate other teams, but I suspect that if the title competition next season is no different from what happened in the 2021/22 season, namely between Liverpool and Manchester city, The two teams you mentioned finished last season on a very good note, continuing with such form this coming season is highly likely, but they will have to do well to maintain the first and second spots on the table. I expect many teams, Arsenal, Chelsea, Tottenham, Newcastle and even Manchester United to start superbly. Arsenal my team has been actively involved in this transfer market, Injury challenges has always been a problem to us, But with Arteta's signing to offer us many options on the bench, I still see hope for us, maybe this season will be our season to once again be champions of England.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notblox1",
      "created_time": "June 23, 2022, 09:47:04 PM",
      "body": "I think this could be season for Liverpool to win premier League title, but it depends on transfers they and other teams make this summer.I know what teams won't win title and that is Chelsea, Manchester United, but they have good chance for Champions league spots or other titles like FA cup.My favorite teams are usually underdogs that have smart attacking play style, and I always like good surprises.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "June 24, 2022, 01:24:05 AM",
      "body": "Quote from: _act_ on June 23, 2022, 07:10:33 AMIs Sadio Mané still in Liverpool? The last time I checked, he is leaving Liverpool for Bayern and he has joined Bayern. Also Liverpool may sign good new players as well though, but the transfer window is still open and I can not just know how English Premier League will look like this coming season. Likely Manchester City and Liverpool may be competing but it can surprise us that another top club may also be able to have good competition with them, although I am not thinking such club to be Arsenal or Tottenham.I admit Sadio Mane is gone and Liverpool gets who can replace him, Darwin Nunez. But we still don't know how effective this guy being replaced by Mane's position is, as I know Salah is a little bit selfish on front, If Nunez can't understand and be selfish too will ruin Klopp's scheme. Tottenham is might be a serious competitor, After Conte took over a coach, they play more effectively and efficiently, but if they don't get what Conte wants such as a Player who can be filling up a weak position, I believe it will the same as last session.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bering",
      "created_time": "June 24, 2022, 03:28:24 AM",
      "body": "Quote from: blue Snow on June 24, 2022, 01:24:05 AMQuote from: _act_ on June 23, 2022, 07:10:33 AMIs Sadio Mané still in Liverpool? The last time I checked, he is leaving Liverpool for Bayern and he has joined Bayern. Also Liverpool may sign good new players as well though, but the transfer window is still open and I can not just know how English Premier League will look like this coming season. Likely Manchester City and Liverpool may be competing but it can surprise us that another top club may also be able to have good competition with them, although I am not thinking such club to be Arsenal or Tottenham.I admit Sadio Mane is gone and Liverpool gets who can replace him, Darwin Nunez. But we still don't know how effective this guy being replaced by Mane's position is, as I know Salah is a little bit selfish on front, If Nunez can't understand and be selfish too will ruin Klopp's scheme. Tottenham is might be a serious competitor, After Conte took over a coach, they play more effectively and efficiently, but if they don't get what Conte wants such as a Player who can be filling up a weak position, I believe it will the same as last session.Nunez more likely as finisher but Mane real position is left winger so these players have different style and position and cannot be compared but indeed last season after Diaz arrived Klopp change Mane position to center striker but that's not too effective because he hasn't score a lot goals from that position and next season Liverpool strategy may have 3 forward players for each games that Salah in the right position then Diaz in the left and Nunez as the finisher so i'm confident he will be adapt with Klopp strategies and create more goals next season",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "June 25, 2022, 02:08:38 AM",
      "body": "Quote from: bering on June 24, 2022, 03:28:24 AMQuote from: blue Snow on June 24, 2022, 01:24:05 AMQuote from: _act_ on June 23, 2022, 07:10:33 AMIs Sadio Mané still in Liverpool? The last time I checked, he is leaving Liverpool for Bayern and he has joined Bayern. Also Liverpool may sign good new players as well though, but the transfer window is still open and I can not just know how English Premier League will look like this coming season. Likely Manchester City and Liverpool may be competing but it can surprise us that another top club may also be able to have good competition with them, although I am not thinking such club to be Arsenal or Tottenham.I admit Sadio Mane is gone and Liverpool gets who can replace him, Darwin Nunez. But we still don't know how effective this guy being replaced by Mane's position is, as I know Salah is a little bit selfish on front, If Nunez can't understand and be selfish too will ruin Klopp's scheme. Tottenham is might be a serious competitor, After Conte took over a coach, they play more effectively and efficiently, but if they don't get what Conte wants such as a Player who can be filling up a weak position, I believe it will the same as last session.Nunez more likely as finisher but Mane real position is left winger so these players have different style and position and cannot be compared but indeed last season after Diaz arrived Klopp change Mane position to center striker but that's not too effective because he hasn't score a lot goals from that position and next season Liverpool strategy may have 3 forward players for each games that Salah in the right position then Diaz in the left and Nunez as the finisher so i'm confident he will be adapt with Klopp strategies and create more goals next seasonThat good scheme, Nunez has good as a finisher same as his position at Benfica. but If Kloop still uses the same scheme as the previous session it can be easy to read and if I guess in this first season Nunez will have a constraint communicating with other players becuase still have problem with language. He also doesn't understand how fierce premier league.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}