{
  "id": "topic_5474720",
  "title": "OROBTC",
  "author": "OROBTC",
  "created_time": "November 20, 2023, 12:00:34 AM",
  "content": "...Libertarian candidate Javier Milei has just won as the next president of Argentina.  He apparently likes BTC.  This is good news for us in Bitcoinland, but also good for Argentina (assuming he governs as he said he would).More details:  https://edition.cnn.com/2023/11/19/world/argentina-vote-milei-massa-nov-19/index.htmlFunny how CNN does not mention that...ZH link:  https://www.zerohedge.com/political/preview-argentinas-consequential-election-sunday",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474720",
  "comments": [
    {
      "author": "Hispo",
      "created_time": "November 20, 2023, 12:50:35 AM",
      "body": "I heard.I have many friends who are from Argentina and most of them are happy to know they will have a different kind of government from what they have experimented for so long.When comes to Bitcoin, only time will tell whether he will actually favor Bitcoin adoption in the country and also some alternative FIAT, in order to protect the Argentinian people from inflation, how knows... This may be the person Argentina needed in order to face such crisis, though I feel skeptical when comes to politicians who promises to fix macroeconomics. One must understand what made people in that country to take such choice instead of Massa. They cannot expect to get different results by electing the same people over and over again, I guess.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandji02",
      "created_time": "November 20, 2023, 02:44:13 AM",
      "body": "That's great. And it actually not just represents how government will treat Bitcoin, but also what people want. And seeing how most of the country is for Bitcoin feels good and inspiring.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pinggoki",
      "created_time": "November 20, 2023, 03:05:56 AM",
      "body": "Congratulations to him and his party and hopefully they will deliver what they've promised to the Argentinians because that's what should matter the most above everything that we wish about him being a fan of bitcoin. Now that we got the formalities out of the way, I still have some doubts that it's a big help to bitcoin because there's not much that OP has given to support us on that fact, sure he loves bitcoin but what does that translate to when it comes to policy making because the president's personal interests shouldn't be the one that's taking a priority but if there's a support in the senate or whatever the policymakers group is called in Argentina supports the president in policies that will benefit bitcoin then I don't have any problem and my doubts would be gone about him winning the election. I do hope though that we will see Argentina adopt bitcoin because of their inflation rate constantly going up, I think that bitcoin is going to really help their economy because it's already proven in individual scale that you can save yourself from inflation by moving your money in bitcoin plus there's also the growth of your investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "November 20, 2023, 03:51:03 AM",
      "body": "Political pundits said Javier Milei is the Argentine version of Donald Trump and he has come up with various radical policies which include the dollarization of the country, cutting government spending through the reduction of ministries from 18 to 8 and he usually speaks well about Bitcoin. Argentina has an economy that is battered by inflation and other challenges which means that Javier Milei has a lot of work to do to bring back the nation to its past glory. His positive stance on Bitcoin is a good omen for the community because it will lead to more awareness and adoption. Argentina is the third biggest economy in Latin America which means more publicity and more business opportunities for Bitcoin businesses. But politicians cannot be trusted because they always fail to fulfill campaign promises.  In most cases, these campaign promises are to gain public support and nothing more. Time will tell if he has good intentions for Bitcoin or if he just used to coin to gain support from young voters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "November 20, 2023, 03:52:23 AM",
      "body": "I don't think he's necessarily for bitcoin(neutral as far as I know), but he thinks central banks are a scam lol. Knowing that their currency has like 150% annual inflation(as far as I know), whatever decision he's going to make, one thing's for sure it's going to be very interesting to see this all unfold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "November 20, 2023, 03:53:07 AM",
      "body": "The right wing loons seem to be happy about this guy. Sounds like he's a reality-denying far right nut job. Sounds like this is going to be disastrous for Argentina unfortunately. A little bit more Bitcoin acceptance should never take precedence over the well-being of a nation. Let's not be silly \"bitcoin is all that matters\" people guys. Far right wingers taking over any country is never a good thing. Hopefully Argentina gets through this time, the way the US had to with Trump and Brazil had to with Bolsonaro, not to mention plenty of other countries suffering under right wing extremism. Let's keep Bitcoin and politicians separate, and not support bad people just because they might like Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "November 20, 2023, 04:03:09 AM",
      "body": "Quote from: pinggoki on November 20, 2023, 03:05:56 AMI still have some doubts that it's a big help to bitcoin because there's not much that OP has given to support us on that fact, sure he loves bitcoin but what does that translate to when it comes to policy making because the president's personal interests shouldn't be the one that's taking a priority but if there's a support in the senate or whatever the policymakers group is called in Argentina supports the president in policies that will benefit bitcoin then I don't have any problem and my doubts would be gone about him winning the election.Argentina is a presidential republic so yes they have senators bitcoin can help in improving one’s economic status but as a whole bitcoin can help open up transactions from country to country in a more convenient and less hassle way this might also be a good news for the btc community as Argentina has one of the largest population in south america just behind Colombia and Brazilfor now he plans on utilizing the usd as their currency and still no plans regarding btc time can only tell if he makes true to his promises",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "November 20, 2023, 04:08:08 AM",
      "body": "Quote from: thecodebear on November 20, 2023, 03:53:07 AMThe right wing loons seem to be happy about this guy. Sounds like he's a reality-denying far right nut job. Sounds like this is going to be disastrous for Argentina unfortunately. A little bit more Bitcoin acceptance should never take precedence over the well-being of a nation. Let's not be silly \"bitcoin is all that matters\" people guys. Far right wingers taking over any country is never a good thing. Hopefully Argentina gets through this time, the way the US had to with Trump and Brazil had to with Bolsonaro, not to mention plenty of other countries suffering under right wing extremism. Let's keep Bitcoin and politicians separate, and not support bad people just because they might like Bitcoin.Ramaswamy or RJK is not winning any polls. they may have the balls to say stuff and sound like a dem with common sense but they are not winning.i'm not following Argentina politics but is Milie a populist that can make BTC  a legal tender in the country?its been said the inflation in Argentina is as worse as Turkeyi inflation.but because they need a stable price of commodities, its still reasonable to use USD along with BTC like El Salvador.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FinneysTrueVision",
      "created_time": "November 20, 2023, 04:36:33 AM",
      "body": "When asked about Bitcoin he showed great understanding about how it works. This doesn't necessarily mean that he supports Bitcoin, although opportunistic crypto publications have chosen to push a narrative that almost makes it sound like he's a Bitcoin maximalist. His libertarian beliefs align with many who are bitcoiners and to them his words can be seen as evidence that Bitcoin is gaining acceptance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "November 20, 2023, 04:41:30 AM",
      "body": "I like to judge the actions of politicians, not their words, especially since Argentina is a large country and it is difficult for one person to change anything related to the economic situation in a country with one of the highest inflation rates in the world.I have no information about the political situation in Argentina, but after reading the cnn.com report (which may be biased as Trump was mentioned several times), it seems that the man is making a lot of promises.Quote from: FinneysTrueVision on November 20, 2023, 04:36:33 AMWhen asked about Bitcoin he showed great understanding about how it works. This doesn't necessarily mean that he supports Bitcoin, although opportunistic crypto publications have chosen to push a narrative that almost makes it sound like he's a Bitcoin maximalist. Even if it were, with this hyperinflation and the people who want to see quick results, they will not risk this option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "November 20, 2023, 04:46:37 AMLast edit: November 20, 2023, 05:08:10 AM by pakhitheboss",
      "body": "I do not think the Argentinian government under the new President would make Bitcoin a legal tender. There are too many issues that first have to be resolved by the new President. Argentina is one of the biggest debtors of the IMF which totals around $46 billion. Do you think they would allow the new President to make Bitcoin a legal tender? The whole Argentinian economy is indirectly controlled by IMF. It is too early to celebrate for now I think we need to wait and watch.One thing I am certain that the news of his winning did help the Bitcoin price pump once again. If we get another positive news then it could touch 40k this time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "November 20, 2023, 05:55:36 AM",
      "body": "Congratulations, firstly, to the Argentine people for obtaining the appropriate choice, and secondly, congratulations to the Bitcoin lovers in Argentina, because choosing a president of the country who loves Bitcoin will be in their interest, and they will certainly receive many facilities in their work.What is important is that the new president does not abandon his promises and adopt an opposite policy. We are always accustomed to politicians saying things during election campaigns and then doing the opposite after they win.I look forward to the day when we see the demise of these old governments that understand nothing about Bitcoin and technology and be replaced by young governments who know the true value of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "November 20, 2023, 05:58:59 AM",
      "body": "This could be treated as a different impact on how the new president will act according to the promises he made during the elections. Is there a summarized version of his promises during the campaigning period? Specifically towards the crypto adoption in the country?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "November 20, 2023, 06:07:50 AM",
      "body": "Quote from: mk4 on November 20, 2023, 03:52:23 AMI don't think he's necessarily for bitcoin(neutral as far as I know), but he thinks central banks are a scam lol. Knowing that their currency has like 150% annual inflation(as far as I know), whatever decision he's going to make, one thing's for sure it's going to be very interesting to see this all unfold.Below is the reason why people say Milei is pro Bitcoin, actually whoever wins is pro Bitcoin Sometime become an opposition is a good strategy to get people's heart because they see you're in their side, so even though become a president means you're join the centralized system, but they believe the president will try to change and develop the central banks to not become scam anymore.Quote from: https://twitter.com/BTC_Archive/status/1720414657255444978🇦🇷 Argentina's 2 remaining Presidential candidates:Sergio Massa - Wants to mine #Bitcoin with excess natural gas.Javier Milei - Says #Bitcoin can eliminate the central bank.Argentina's economy is 20x bigger than El Salvador's.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hyudien",
      "created_time": "November 20, 2023, 06:20:32 AM",
      "body": "Quote from: OROBTC on November 20, 2023, 12:00:34 AM...Libertarian candidate Javier Milei has just won as the next president of Argentina.  He apparently likes BTC.  This is good news for us in Bitcoinland, but also good for Argentina (assuming he governs as he said he would).I don't know Javier Milei until I know that he likes Bitcoin, it's just that his task is now quite difficult to recover the Argentine economy from inflation, improve economic growth which is the main target and to accelerate this growth Argentina needs to take decisions that are a little riskier than usual. Adopting Bitcoin can be done like El Salvador, which is now a respected and economically stable country.Is that what many people expect?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "November 20, 2023, 07:17:25 AM",
      "body": "We should not get too excited about what a central government can do for Bitcoin. They are generally geared towards profits and how to boost of their national currency or enrich their own pockets. Whatever steps they take in the process is a means to an end. Liberal governments are good for bitcoins growth but it has gotten this far without much of that.It also remains to be seen what policies he effects while in office. I will personally be pleased if he at least does not effect any anti Bitcoin policy even if he does nothing in favor of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "November 20, 2023, 10:23:20 AM",
      "body": "That, indeed, is glad tidings for Bitcoin loving Argentines; both those living in the country and outside it. It transcends to even our community here as we already can feel the positive vibe. I don't want to share any pessimism of what the newly elected president, Javier Milei, may do right or wrong as that will distract the excitement in the air of his victory. This is worth celebrating because it's a win for Bitcoin and digital economy. Definitely, his policies will further deepen exposure for Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "November 20, 2023, 10:38:47 AM",
      "body": "This is great news for Argentinians in general just basically to have a new governmentin power, it can only get better going forward.Quote from: Mpamaegbu on November 20, 2023, 10:23:20 AMThat, indeed, is glad tidings for Bitcoin loving Argentines; both those living in the country and outside it.Thats massive for Argentinian Bitcoiners. Hopefully he can deliver on what peopleexpect and if he does do something with Bitcoin it will be massive. Hopefully his ideas about Bitcoin and central banks were not pre electorial hot air.This is Forbes' headline QuoteJavier Milei Wins Argentine Presidency With Pro-Bitcoin And Anti-Central Bank Agendahttps://www.forbes.com/sites/digital-assets/2023/11/20/javier-milei-wins-argentine-presidency-with-pro-bitcoin-and-anti-central-bank-agenda/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "November 20, 2023, 11:18:33 AM",
      "body": "Javier Milei has shown so much concern on bitcoin because he knows the potential of bitcoin and I am happy that he has won the presidential election. This will be a relief for the citizens. There is a statement that he made about using bitcoin.QuoteJavier Milei - Says #Bitcoin can eliminate the central bank.I don't know how he thinks of achieving this because we all know that there is no way that bitcoin can replace fiat because they both work hand-in-hand. Even in El Savador, Bukele didn't get rid of their fiat currency. This makes me wonder if Javier Milei is only a politician that is after buying the mind of his people so that they can vote him into power. Politicians are desperate when it promising heaven and earth just to win elections, and after they have won, they will deviate from their promises. Sven Satoshi didn't make bitcoin to replace fiat. Let him think on how to revive Argentina economy first and not replacing central bank with bitcoin. I will be very glad and excited if he can keep to his words on bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}