{
  "id": "topic_5468929",
  "title": "BADecker",
  "author": "BADecker",
  "created_time": "October 02, 2023, 05:38:52 PM",
  "content": "There are so many factions and governments and groups promoting things that could turn into a global coup, that it's hard to determine which, if any of them, have any real power. Or is it all a plan between them all to act together.Just wanted to thank the FBI or CIA or whomever it was that came up with the term 'conspiracy theory'. Makes it easier to focus on real conspiracies by using that term.We're in the Middle of a Global Coup - Here's How We Stop Ithttps://www.lewrockwell.com/2023/10/joseph-mercola/were-in-the-middle-of-a-global-coup-heres-how-we-stop-it/In this interview board-certified internist and biological warfare epidemiologist Dr. Meryl Nass discusses the dangers posed by the World Health Organization's upcoming pandemic treaty and the International Health Regulation (IHR) amendments. She also wrote about this in a recent article titled \"The WHO's Proposed Treaty Will Increase Manmade Pandemics.\"1\"I've been reading the different drafts of the amendments and the Pandemic treaty that have been put forward,\" she says. \"They're a mix of things, different ideas put forward by the different [member] countries. And then there's a group within the WHO that tries to harmonize them, and also make sure that what the WHO wants is in them.I had finally read through, line by line, the June 2nd, most recent draft of a pandemic treaty, and it had things that were much worse and more explicit in it than before, and I felt compelled to start writing about it....",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468929",
  "comments": [
    {
      "author": "Gyfts",
      "created_time": "October 04, 2023, 01:07:56 AM",
      "body": "Is WHO to blame for the reactions to pandemics? Let them bring whatever resolutions and amendments to bear. It was the populace that quivered in fear over a virus with a 99% survival rate. It's almost like we asked for it.A \"pandemic treaty\" isn't to fear, it's your fellow man that allows the bureaucracy to take over.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "October 04, 2023, 10:21:21 AM",
      "body": "So, you are implying that a non governmental organization like the World Health Organization could somehow overcome the power of locals governments and sovereign countries.  I do not think it should work like that.As far as I understand, that organization is supposed to offer recommendations and protocols the countries worldwide are supposed to choose if it is suitable for populations. If the WHO was some kind of entity which was able to govern over presidents and prime ministers, there would not be people and entire communities doing things which are disapproved by them, like in Africa with all the folk medicine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "October 04, 2023, 03:49:15 PM",
      "body": "Quote from: Hispo on October 04, 2023, 10:21:21 AMSo, you are implying that a non governmental organization like the World Health Organization could somehow overcome the power of locals governments and sovereign countries.  I do not think it should work like that.As far as I understand, that organization is supposed to offer recommendations and protocols the countries worldwide are supposed to choose if it is suitable for populations. If the WHO was some kind of entity which was able to govern over presidents and prime ministers, there would not be people and entire communities doing things which are disapproved by them, like in Africa with all the folk medicine.Country and local governments are made up of people, some of whom want complete control. The Covid scare has given more governments more control than any other operation, ever. So, by agreement of government leaders - who are misusing their authority - and by election from these government people, the WHO has been given authority.The agreements are rather secretive. But they are being brought out into the open so that the people will think that they must obey, because their government authorized it.More than any other countries in the world, it is written right into the laws of the US, Britain, Canada, and Australia - common law - that the people have control over their governments. The trouble is that the people don't know how to use their control. Often they attempt to use it the wrong way. If they don't figure out how, their countries' laws might be changed so that they lose their authority.Everything is done by agreement. A government doesn't get set in place without agreements of and between people. Same with the WHO being set in authority.Consider a simple hostage situation... one captor and one hostage. The captor says to the hostage, \"Do what I tell you, or I will shoot you dead.\" The hostage either lives or dies by agreement with the captor. Maybe the captor was lying. Or maybe his gun didn't have any bullets. Even then, the whole thing was settled by agreement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iBaba",
      "created_time": "October 05, 2023, 11:33:00 PM",
      "body": "Whether WHO or not. It is individuals and governments that have come together to form such decisions which becomes an adverse effects on the global population of people. It is almost always a situation of putting the world power countries above the third world countries. It is always about how the bourgeois will become more powerful above the poor people and so on. When diseases like pandemics or epidemics are created and infested into the people, the end goal of such situations boils down to the ability of big companies to be able to sell out druhs, vaccines amongst other equipments. It used to be another system being compromised to give a leeway to the aristocrats. At most times, it used to be a collaboration of such membeer countries or the collaboration with other leaders of impoverished nations most of which work as puppets against their countrymen and women.How do you then expect the world to be at peace. When policies are created every day to strengthen those ties in acquiring more wealths and affluence at the expense of lives snd health of the people. Then, goes back to provide solutions to such man-made problems through interventions and vaccinations in the case of viruses. When are we ever going to staop witnessing such pandemics when most of those diseases are man made.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "October 06, 2023, 05:40:23 PM",
      "body": "^^^ But don't worry. Since Jesus died on the cross for the sins of the whole world, and then arose to life again to show His power, and His victory over evil, He is in complete control.He might be allowing the evil people of the world to take over the world temporarily, just so He has those jokers all in one place when He returns to take over the One-World-Government.I mean, they are doing work for Him without even knowing it. Since they are forming the OWG, He won't have to do it when He returns. When He comes back and takes over, He will be able to judge everybody fairly and with freedom, since... He knows all things, even though He allows people to have complete freedom.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phu Juck",
      "created_time": "October 19, 2023, 08:12:00 PM",
      "body": "Hamas caucusWe don't need Hamas caucus.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}