{
  "id": "topic_5438403",
  "title": "Ulven",
  "author": "Ulven",
  "created_time": "February 06, 2023, 06:58:20 PM",
  "content": "قرأت لتو مقال على موقع  بتكوين نيوز يذكر فيه عن قبول المدفوعات بالبتكوين لإحدى محالات pick n pay المشهورة في جنوب إفريقيا للبيع بالتجزئة قبول الدفع بالبتكوين و يدعم أيضاً شبكة البرق ما يتيح الفرصة للمستهلك الدفع بالبتكوين مع رسوم منخفظة.هل تعتقد أن مثل هذه المبادرة ستساهم في توسيع الفكرة إلى نطاق أوسع ليشمل قطاعات إقتصادية مختلفة في بلد جنوب إفريقيا؟ و هل سيكون لهذا الحدث رؤية أخرى من طرف المجتمع الإفريقي حول مدى تأثير البتكوين في تنمية قطاعات مختلفة في القارة السمراء.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5438403",
  "comments": [
    {
      "author": "yhiaali3",
      "created_time": "February 09, 2023, 01:57:04 AM",
      "body": "في الحقيقة نرى تبني البيتكوين يزداد يوما بعد يوم في جميع أنحاء العالم والحمد لله. أرى في الفترة الأخيرة نشاط ملحوظ حول ازدياد تبني البيتكوين والكريبتو بشكل عام في أفريقيا والدول العربية، هذا يسعدنا بالطبع لأنها كانت خطوة متأخرة قليلا. طبعا أخي ألفين من الغني عن القول أن أي تبني جديد سوف يساهم في ازدياد نمو الوعي وثقافة كريبتو في المجتمع وبالتالي قبول المجتمعات شيئا فشيئا للبيتكوين. لكن أيضا نقول أن التبني ليس بمثل هذه السهولة لأنه يحتاج إلى بنية تحتية مناسبة وستظهر العديد من المشاكل في البداية، لذلك نجاح التبني لأي محل أو مؤسسة سيشجع بقية الشركات على اتخاذ هذه الخطوة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "February 09, 2023, 04:26:47 PMLast edit: February 12, 2023, 03:56:04 PM by Kavelj22",
      "body": "تقريبا افريقيا الجنوبية هي احدى الاقتصاديات القليلة المزدهرة في افريقيا (بالاضافة لامثلة اخرى قليلة) و هو ما سيسهل عملية ادماج البيتكوين في المنظومة الداخلية. ليس من السهل  تعميم التجربة على جميع قطاعات الاقتصاد او ان يشمل هذا المبادلات الخارجية. انما برأيي هي خطوة جيدة ستحفز دولا عديدة للاحتذاء بنفس المثال.افريقيا الجنوبية تحتل مراتب متقدمة في التصنيفات العالمية و سنرى تأثير هذا التبني على اقتصادها.من جهة اخرى ليس متوقعا ان يكون لهذا تأثير ملحوظ على الاقتصاد بما ان المبادرين بالعملية هم باعة بالتجزئة و اغلب الظن ان يكونوا من تجار السوق الموازية الذين يتاجرون بالسلع المهربة. هذا سيسهل عليهم عمليات التبادل ايضا مع المزودين الذين في معظهم لا يتشجعون كثيرا لاستعمال العملات المحلية ان لم تكن من العملات الرئيسية بالاضافة الى صعوبة القيام بتحويلات.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "February 09, 2023, 04:32:55 PMLast edit: February 12, 2023, 03:59:40 PM by Kavelj22",
      "body": "Quote from: Ulven on February 06, 2023, 06:58:20 PMقرأت لتو مقال على موقع  بتكوين نيوز يذكر فيه عن قبول المدفوعات بالبتكوين لإحدى محالات pick n pay المشهورة في جنوب إفريقيا للبيع بالتجزئة قبول الدفع بالبتكوين و يدعم أيضاً شبكة البرق ما يتيح الفرصة للمستهلك الدفع بالبتكوين مع رسوم منخفظة.هل تعتقد أن مثل هذه المبادرة ستساهم في توسيع الفكرة إلى نطاق أوسع ليشمل قطاعات إقتصادية مختلفة في بلد جنوب إفريقيا؟ و هل سيكون لهذا الحدث رؤية أخرى من طرف المجتمع الإفريقي حول مدى تأثير البتكوين في تنمية قطاعات مختلفة في القارة السمراء.ليس متوقعا ان يكون لهذا تأثير ملحوظ على الاقتصاد بما ان المبادرين بالعملية هم باعة بالتجزئة و اغلب الظن ان يكونوا من تجار السوق الموازية الذين يتاجرون بالسلع المهربة. هذا سيسهل عليهم عمليات التبادل ايضا مع المزودين الذين في معظهم لا يتشجعون كثيرا لاستعمال العملات المحلية ان لم تكن من العملات الرئيسية بالاضافة الى صعوبة القيام بتحويلات.تقريبا افريقيا الجنوبية هي احدى الاقتصاديات القليلة المزدهرة في افريقيا (بالاضافة لامثلة اخرى قليلة) و هو ما سيسهل عملية ادماج البيتكوين في المنظومة الداخلية. ليس من السهل  تعميم التجربة على جميع قطاعات الاقتصاد او ان يشمل هذا المبادلات الخارجية. انما برأيي هي خطوة جيدة ستحفز دولا عديدة للاحتذاء بنفس المثال.افريقيا الجنوبية تحتل مراتب متقدمة في التصنيفات العالمية و سنرى تأثير هذا التبني على اقتصادها.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "February 09, 2023, 08:00:01 PM",
      "body": "Quote from: Ulven on February 06, 2023, 06:58:20 PMهل تعتقد أن مثل هذه المبادرة ستساهم في توسيع الفكرة إلى نطاق أوسع ليشمل قطاعات إقتصادية مختلفة في بلد جنوب إفريقيا؟ و هل سيكون لهذا الحدث رؤية أخرى من طرف المجتمع الإفريقي حول مدى تأثير البتكوين في تنمية قطاعات مختلفة في القارة السمراء.هذا خبر جيد لكن لا أعتقد أنه يمكن  للفكرة أن تتوسع لوحدها خاصة في بلد مثل افريقيا الجنوبية و الذي حتى و ان كان يعتبر قوة اقتصادية م أين مازالت لا توجد فيه هنالك قوانين واضحة حول العملات المشفرة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "February 09, 2023, 08:50:07 PM",
      "body": "Quote from: OmegaStarScream on February 09, 2023, 08:00:01 PMQuote from: Ulven on February 06, 2023, 06:58:20 PMهل تعتقد أن مثل هذه المبادرة ستساهم في توسيع الفكرة إلى نطاق أوسع ليشمل قطاعات إقتصادية مختلفة في بلد جنوب إفريقيا؟ و هل سيكون لهذا الحدث رؤية أخرى من طرف المجتمع الإفريقي حول مدى تأثير البتكوين في تنمية قطاعات مختلفة في القارة السمراء.هذا خبر جيد لكن لا أعتقد أنه يمكن  للفكرة أن تتوسع لوحدها خاصة في بلد مثل افريقيا الجنوبية و الذي حتى و ان كان يعتبر قوة اقتصادية م أين مازالت لا توجد فيه هنالك قوانين واضحة حول العملات المشفرة.فعلاً هذا ما لاحظته رغم التبني في البلد إلا التشريعات و القوانين بخصوص هذا المجال غير واضحة، و لكن رغم ذلك أعتقد أن فكرة التبني ستلاحقها بدون شك قوانين و تشريعات، كما تناولنا في موضوع منفصل حول سباق الدول على وضع تشريعات قانونية و جعل التشفير قانونيا، ربما في حالة نجاح هذه الحكومات سيسهل المسألة على الوافدون الجدد من خلال نسخ القوانين من هذه البلدان و لصقها.Quote from: yhiaali3 on February 09, 2023, 01:57:04 AMفي الحقيقة نرى تبني البيتكوين يزداد يوما بعد يوم في جميع أنحاء العالم والحمد لله. أرى في الفترة الأخيرة نشاط ملحوظ حول ازدياد تبني البيتكوين والكريبتو بشكل عام في أفريقيا والدول العربية، هذا يسعدنا بالطبع لأنها كانت خطوة متأخرة قليلا. طبعا أخي ألفين من الغني عن القول أن أي تبني جديد سوف يساهم في ازدياد نمو الوعي وثقافة كريبتو في المجتمع وبالتالي قبول المجتمعات شيئا فشيئا للبيتكوين. لكن أيضا نقول أن التبني ليس بمثل هذه السهولة لأنه يحتاج إلى بنية تحتية مناسبة وستظهر العديد من المشاكل في البداية، لذلك نجاح التبني لأي محل أو مؤسسة سيشجع بقية الشركات على اتخاذ هذه الخطوة.نعم أخي يحيى هذا هو حال كما أشارنا في العديد من المناسبات على أن البتكوين سيواجه العديد من التحديات و قد شهدنا ذلك سابقاً إلا أن البتكوين نجح في تجاوز العديد من الإختبارات، كما أنني أعتقد البتكوين سيبقى صامداً ما دام جمهور يؤيده.Quote from: Kavelj22 on February 09, 2023, 04:26:47 PMتقريبا افريقيا الجنوبية هي احدى الاقتصاديات القليلة المزدهرة في افريقيا (بالاضافة لامثلة اخرى قليلة) و هو ما سيسهل عملية ادماج البيتكوين في المنظومة الداخلية. ليس من السهل  تعميم التجربة على جميع قطاعات الاقتصاد او ان يشمل هذا المبادلات الخارجية. انما برأيي هي خطوة جيدة ستحفز دولا عديدة للاحتذاء بنفس المثال.افريقيا الجنوبية تحتل مراتب متقدمة في التصنيفات العالمية و سنرى تأثير هذا التبني على اقتصادها.صحيح من جيد مراقبة تأثير التبني على قطاعات الإقتصادية المختلفة في البلاد، لكن إفريقيا لا تملك البنية المرغوبة فيها إلى حد الآن لهذا سيكون من جيد إصدار تصريحات من طرف الحكومة حينها سنعلم مدى إمكانات لهذا البلد.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "February 09, 2023, 10:17:30 PM",
      "body": "من الجيد ان نرى المزيد من الاقبال على دعم البيتكوين والعملات المشفرة بشكل عام خصوصا في البلدان التي تعاني من الانظمة المالية الفاشلة وبعيدا عن القوانين والمشاكل التي ربما ستطول على هذا البائع سوف يستفيد الطرفين من هذا الامر من حيث سرعة المعاملة وتجاوز محدودية البنوكلكن يبقى هناك بعض الاشخاص التي ربما لاتفهم هذا الامر أو لا تعيش الواقع نرى هذا التعليق الذي تم وضعه في المقالة Code: Until BTC stabilizes in price using it to buy things is a horrible idea. Seconds after you buy something it can go up and you overpaid a tonمثال هذا الشخص انه اعتبر البيتكوين وسيلة للتداول فقط و مفهومه خاطئ تماما فاذا كنت متخوفا من السعر المتحرك للبيتكوين لن تتمكن من الاستفادة منه ابدا بالاضافة الى ان معظم الدول الافريقية تعاني من تسقيف استخراج الاموال من البنك فمثلا العامل الذي يتقاضى اجر شهري واراد شراء اشياء تفوق السقف المسموح يوميا او اسبوعيا فيحب عليه الانتظار تلك المدة لكي يقوم بشراء ما يريده واذا كان الباعة يدعمون العملات المشفرة سيسهل عليه الامر كثيرا ربما يبقى هذا الامر غير قانوني مع الاسف في عديد بلداننا الافريقية لكن التعاون بين الافراد وهو بالفعل ما جعل البيتكوين يتطور ويصل الى ما وصل اليوم وبدأت العديد من البلدان في الخضوع",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "February 10, 2023, 08:37:10 PM",
      "body": "Quote from: GxSTxV on February 09, 2023, 10:17:30 PMلكن يبقى هناك بعض الاشخاص التي ربما لاتفهم هذا الامر أو لا تعيش الواقع نرى هذا التعليق الذي تم وضعه في المقالة Code: Until BTC stabilizes in price using it to buy things is a horrible idea. Seconds after you buy something it can go up and you overpaid a tonمثال هذا الشخص انه اعتبر البيتكوين وسيلة للتداول فقط و مفهومه خاطئ تماما فاذا كنت متخوفا من السعر المتحرك للبيتكوين لن تتمكن من الاستفادة منه ابدا بالاضافة الى ان معظم الدول الافريقية تعاني من تسقيف استخراج الاموال من البنك فمثلا العامل الذي يتقاضى اجر شهري واراد شراء اشياء تفوق السقف المسموح يوميا او اسبوعيا فيحب عليه الانتظار تلك المدة لكي يقوم بشراء ما يريده واذا كان الباعة يدعمون العملات المشفرة سيسهل عليه الامر كثيرا ربما يبقى هذا الامر غير قانوني مع الاسف في عديد بلداننا الافريقية لكن التعاون بين الافراد وهو بالفعل ما جعل البيتكوين يتطور ويصل الى ما وصل اليوم وبدأت العديد من البلدان في الخضوعأعتقد ان الفكرة في التعليق صحيحة الى حد كبير  و هي تطرح اكبر اشكالية تواجه المتحمسين لنشر البيتكوين في الاعمال الصغيرة اليومية. الاقبال على الاستثمار في البيتكوين من خلال التداول او التخزين طويل الامد هو ما حقق الانتشار الذي نراه اليوم لان البيتكوين فعليا ليس مستخدما كثيرا كعملة للدفع او كنظام دفع بما ان البلوكشين توفر الخاصيتين معا (عملة مع نظام دفع).هؤولاء الباعة في افريقيا الجنوبية قاموا بخطوة جبارة نتمنى ان يتم تأطيرها من طرف مؤسسات الدولة لانه لا معنى ان تقبل مدفوعات البيتكوين فقط في السوق السوداء.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}