{
  "id": "topic_5499583",
  "title": "OlegChernenkov",
  "author": "OlegChernenkov",
  "created_time": "June 11, 2024, 11:30:01 AM",
  "content": "Hello friends!I am creating this post to ask for help and advice.I learned about Bitcoin back in 2010, but a computer was too expensive for me then.In 2017, I studied how Ethereum mining works, took out a loan and put together a small farm.I lived quietly, but then I met a girl who eventually took my apartment and car (And I had to return to live with my parents.Three years later I got married, we took out a mortgage on the apartment. But later I was fired from work, where I killed my back and knees(I started to study cryptocurrencies again, but all the options without investments give very little money.Now my wife says that she is tired of me being poor.But I can’t get another job due to health problems or they just tell me “We’ll call you back” and silence ((I read a channel where people have thousands of bitcoins that have been preserved from old times.Even 1 bitcoin would solve all my problems, I would close the loan, get divorced calmly, and not listen to screams and swearing every day(I am almost 40 years old, everything I had, everything I saved, everything was taken by my ex-girlfriend.At current prices and times, I will no longer be able to save up for an apartment.My life is a real hell(I wrote to Vitaly Buterin, Nick Spanos, Justin Sun, the hacker Gummo, but only Vitaly answered and told me to buy Ether and that’s it(But there is no money(I understand that without money you are nothing, but I don’t know where to get it(I dream about a Suzuki Jimny, about a trip to Iceland, but I understand that life is not endless and may end, but dreams will remain so.After all, Satoshi Nakamoto invented Bitcoin so that people would help each other, and corrupt banks and officials could not take anything.Guys, I am writing from the bottom of my heart, without deception, my life is really a mess and I don’t know how to find a way out(Maybe someone can help?I'm very tired... from hopelessness, from the thought that every new day does not bring relief... I don't know what to do next ((After all, it’s just money, but with its help you can make the life of one person on Earth a little happier....",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5499583",
  "comments": [
    {
      "author": "AGD",
      "created_time": "June 11, 2024, 11:46:55 AM",
      "body": "https://bitcoinerjobs.com/https://www.upwork.com/freelance-jobs/bitcoin/https://cryptocurrencyjobs.co/bitcoin/https://cryptocurrencyjobs.co/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "glendall",
      "created_time": "June 11, 2024, 03:08:24 PM",
      "body": "My advice is not much, stop complaining, and never look at other people's achievements as regretseveryone can and can have happiness as long as you can be enthusiastic about everything and have principles for progress and successIf you only complain and look at other people's achievements without innovation, you will always stay where you are without any progress",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "June 11, 2024, 03:16:58 PM",
      "body": "Quote from: OlegChernenkov on June 11, 2024, 11:30:01 AMsnipHere is my advice for you, don't get worried about your past, focus on the present and the future plans you have, if you have money, then you can achieve most of your dreams and become more successful in life, people also think about how they can live up with someone who is not going to be a liability on them, you can really start from somewhere with bitcoin investment, had it been you had invested and hold ever since your first experience in crypto, you couldn't have been broke anymore by now, but all you can do is in fixing up the future by investing now and hold, when you make it, even those that have left you will by then be regretting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MeGold666",
      "created_time": "June 11, 2024, 03:54:39 PM",
      "body": "Quote from: OlegChernenkov on June 11, 2024, 11:30:01 AMAfter all, Satoshi Nakamoto invented Bitcoin so that people would help each other...No, it was created for financial independence from third-parties - not to give out money to \"less fortunate\" aka lazy people.Playing on peoples emotions is a very evil thing to do.Maybe instead of cyber-begging you should try invest this time in getting more knowledge ? it costs nothing.If I gave every beggar a dollar, today I would be a beggar myself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "June 11, 2024, 04:45:01 PM",
      "body": "Quote from: AGD on June 11, 2024, 11:46:55 AMhttps://bitcoinerjobs.com/https://www.upwork.com/freelance-jobs/bitcoin/https://cryptocurrencyjobs.co/bitcoin/https://cryptocurrencyjobs.co/These are actually good sites to look for a job, but if the op has no skill to offer on these platforms then these won't be of much help to him but it is still a good post. Thanks for sharing it with us. Although we can start making money online with few skills and some good communication skills and yeah with some luck too. I hope OP would find some job I don't know where he lives, I mean I thought people mostly living in Europe countries don't have to struggle about finding a job. Did I over imagined it, as most of the students from my country prefer to get scholarship of European countries and speaking of BTC job only, not so many people try to learn BTC related skills, but the least we can search for non tech job some sites you have mentioned did have the non tech category but most of the job ads on these sites are from big crypto platforms, I mean one would hesitate to apply there haha.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "June 11, 2024, 08:50:51 PM",
      "body": "Quote from: OlegChernenkov on June 11, 2024, 11:30:01 AMAfter all, Satoshi Nakamoto invented Bitcoin so that people would help each otherI must have missed that part in the Bitcoin whitepaper. Be that as it may, as stated in the forum rules, begging is not allowed on the forum. I suggest you visit the links given by AGD, hopefully you will be able to get a remote job that can pay you in bitcoins. Quote from: OlegChernenkov on June 11, 2024, 11:30:01 AMGuys, I am writing from the bottom of my heart, without deception, my life is really a mess and I don’t know how to find a way out There is a saying in the Bitcoin community:  do not trust, verify. Bitcointalk members take this seriously and since there is no way to verify your story, I doubt you will be getting any help here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "June 11, 2024, 09:23:28 PM",
      "body": "Quote from: MeGold666 on June 11, 2024, 03:54:39 PMQuote from: OlegChernenkov on June 11, 2024, 11:30:01 AMAfter all, Satoshi Nakamoto invented Bitcoin so that people would help each other...No, it was created for financial independence from third-parties - not to give out money to \"less fortunate\" aka lazy people.Playing on peoples emotions is a very evil thing to do.Maybe instead of cyber-begging you should try invest this time in getting more knowledge ? it costs nothing.If I gave every beggar a dollar, today I would be a beggar myself.Just this evening somebody was begging me for money for transportation to a place. But he didn't know that I just trekked from that place to my present location. I just looked at him and told him to use his foot instead of begging. Op claims that he can't get a job due to health issues but that's not the general situation. Even the blind still have what they can do to earn a living. I suggest Op seek other jobs that will be suitable for his health problems. Op is lucky to be in this type of situation because many people are facing the worst situations. Some people don't have a wife, job, or home, yet they are not begging.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batang_bitcoin",
      "created_time": "June 11, 2024, 09:58:51 PM",
      "body": "You got married with your wife and you have a promise to each other that you'll be in health, in good and in poor and only death will separate you. But into common days, it's more important to survive than to fulfill a promise, right? I can't blame you and your wife, both have a situation that's hard to deal with but I pray for your recovery and hopefully soon you'll be a on a better situation than of this one. Try to find jobs online and work remotely or gain some IT skills that will be able to help you out land a better paying job.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cpu6502",
      "created_time": "June 11, 2024, 10:11:10 PM",
      "body": "Quote from: OlegChernenkov on June 11, 2024, 11:30:01 AMsnipTrust me, 1 BTC isn't going to solve your problems.Anyway your planning divorce, so there's 0.5 BTC gone already.See, just creates more problems.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "June 11, 2024, 10:13:23 PM",
      "body": "That's a really sad story right there, I don't know about you guys but that seems to be like a genuine ask for help @AGD did a good job already of teaching you to fish though, now it's up to OP how they plan to deal with it. I think that you'd be able to get through this OP, I'm sure of that because as long as you're alive, I think that you'd be able to turn your life around, maybe don't focus too much on the part where you're going to need cryptocurrency as your only way out of the hardship that you're facing now, take a step back and try to make sure that you're doing some observation on how you can do things that would help you get out of that situation, sometimes we're moving so fast that we end up not seeing the big picture.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GbitG",
      "created_time": "June 11, 2024, 11:04:32 PM",
      "body": "Quote from: OlegChernenkov on June 11, 2024, 11:30:01 AM~snip~Hmm that stinks!But I am unable to understand that these beggars open the topic every day and think that Bitcoin members are fools By telling similar stories, etc. they will be deceived and give us money for free. . But OP, if this kind of view is yours too, then I think you will not be able to stay long on this forum, you will be banned for spamming articles very soon.  Every new day there is one or another person who thinks that BitcoinTalk is only a spam stop, that we will become rich by spamming here or telling false stories, but in fact it is not so. There are no blind, deaf, or helpless people here, but they know well those who beg for money. So stay away from these types of people, they are nothing less than spammers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "June 12, 2024, 03:53:51 AM",
      "body": "I'm not sure what kind of help you are looking for here. You possess an old account (from 2017) so you should already know nobody is going to pay you anything. You should also already know ways to earn bitcoin, the pros and cons, the rise and falls, etc. After all your account has been around from before the peak in 2017 and you should have experienced the big fall, the potentials to earn money and the subsequent rise and its potentials. That experience is more than enough to tell you what you can and cannot do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hewlet",
      "created_time": "June 12, 2024, 03:55:13 AM",
      "body": "I'm truly sorry for your sad experiences in life and I can only imagine what it means for all your properties to be taken away from you by someone you call your own girl friend. It's life and the highest we can do in this case is to advice you to take it as it it has already happen and find a way to pull yourself together. Don't know your health challenge but I do know that health issues could be a serious hindrance that could prevent one from following most dreams and doing most jobs and the best option to consider in this context would most likely be to look out for remote jobs you could be doing from the comfort of your home that will help you get your feet back and then you can figure out life from that spot.Like AGD has recommended, search out for freelancing jobs on the site he provided or do your personal research on and off this platform to see if you would see jobs that will pay you well, I know there are remote jobs that will accept you, if your location is within the states and I'm just wishing the best ot luck out there.Quote from: AGD on June 11, 2024, 11:46:55 AMhttps://bitcoinerjobs.com/https://www.upwork.com/freelance-jobs/bitcoin/https://cryptocurrencyjobs.co/bitcoin/https://cryptocurrencyjobs.co/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Uhwuchukwu53",
      "created_time": "June 12, 2024, 06:34:20 AM",
      "body": "Quote from: glendall on June 11, 2024, 03:08:24 PMMy advice is not much, stop complaining, and never look at other people's achievements as regretseveryone can and can have happiness as long as you can be enthusiastic about everything and have principles for progress and successIf you only complain and look at other people's achievements without innovation, you will always stay where you are without any progressYes I concur it's not wrong to regret on one mistake but the regret become foolishness when one still remains static on that mistake by refusing to take bold step that will leads to the change if that mistake, admiring people progress should have been a lessons and dream to become such people or be greater than them but where one only speculate without action it's more harmful as it's better no to than regretting because more regret can leads to early grave as depression will over take the heart.Best thing to do when one realize that a wrong step has been taken is to take preventive measure and identify the courses of such and take a new leave to achieve your success, good planing help as many lack this which leads to many regret as they may over view those who has planned already from the beginning and worked towards them how their success aligned.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OlegChernenkov",
      "created_time": "June 12, 2024, 08:38:34 AM",
      "body": "There is no way I came here just to beg.I just asked if someone could help.I earned my own money all my life, but almost all my money went towards this life.If I saved something, then problems appeared and the money went there.I have never lived in luxury, I don’t dream of buying the most expensive phone with Bitcoin.Just 1 coin, yes, could help a lot.I don't envy those who were able to hold Bitcoin for so many years.I’m just very tired, in my city a salary of $300 is considered acceptable. And no one wants to pay more.I don't know English and I'm writing through Google Translate(It’s just very scary to realize that life is passing.And in the pursuit of money, all dreams collapse.I don't even have anything to sell to invest.Even if they take me somewhere, there will still be no free money left.That's what's scary.I read how some project comes out and people get a lot, or after spinning several thousand dollars in volume, they are rewarded. Or, having received some kind of NFT, they sell it for a very high price.But I don’t understand why I can’t do anything (Where investments are needed, I cannot do it.And where there are no investments, they give at most a couple of dollars and that’s all.I don't understand why the Cryptocurrency gods are deaf to my prayers((",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "June 12, 2024, 09:32:32 AM",
      "body": "Do you think that if someone give you 1 BTC, that would immediately solve all your problems? I don't thinks so because your greedy mind will tell you to used 1 BTC for other things that are not your main problem. You will not know the process you have to go through to have satoshis become 1 Bitcoin.There are many ways you can do to own Bitcoin. This forum have many projects that can helps you to earns tokens or coins that you can sell to get a profit. If you want to earn something from crypto, you have to be willing to learn more.By participating in these projects, you can get rewards which can provide a way for you to make a profit. These profits will help you to be able to own Bitcoin so that later you can change your life for the better. No pain no gain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "June 12, 2024, 09:34:20 AM",
      "body": "Quote from: OlegChernenkov on June 12, 2024, 08:38:34 AMeditedJust 1 coin, yes, could help a lot.editedSometimes the community can gather together behind a cause, but very often the ones behind the initiative get no direct benefit other than doing the right thing, in this case you are asking for a full bitcoin just to solve your problems, which at the current prices it is a little bit more than 67k, which no matter where you live is a massive amount of money and I doubt you could get even a small portion of it.Quote from: OlegChernenkov on June 12, 2024, 08:38:34 AMeditedI read how some project comes out and people get a lot, or after spinning several thousand dollars in volume, they are rewarded. Or, having received some kind of NFT, they sell it for a very high price.But I don’t understand why I can’t do anything (Where investments are needed, I cannot do it.And where there are no investments, they give at most a couple of dollars and that’s all.I don't understand why the Cryptocurrency gods are deaf to my prayers((You have been around since 2017 so you must know very well what is going on, those people took a massive risk that could have easily go against them, and they were lucky enough for things to go their way, in a way this is no different than a person using all their money to try to win the lottery and succeeding against all odds.Long term success comes from careful planning, acquiring the right skills for years and making all kind of sacrifices to get the money needed to invest on the right assets, and this is not something that can be acquired in a few weeks or months, even if you dedicated your whole time towards this goal, and it is definitely not something that you can get by praying to a bunch of nonexistent gods.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HajiBagi",
      "created_time": "June 12, 2024, 09:54:55 AM",
      "body": "Quote from: glendall on June 11, 2024, 03:08:24 PMMy advice is not much, stop complaining, and never look at other people's achievements as regretseveryone can and can have happiness as long as you can be enthusiastic about everything and have principles for progress and successIf you only complain and look at other people's achievements without innovation, you will always stay where you are without any progressLooking at other people’s achievements as regret is one of the best things that discourage someone from becoming what they want to become in the future, never see your condition and think that it is the for you, many people have past experiences that they think they can’t survive but they survive and their past have become like a dream to them, continue with your cryptocurrency journey and very soon you will achieve what you want to achieve, believe in yourself don’t believe in others, we are the same human doesn’t mean that we are the same in what we do and we will achieve the same thing.No matter how bad the situation is take it as what has been planned to happen for you, without a lesson we will not learn, focus on what you put on your mind and god is there for us all the time, if you have any ideas of buying bitcoin I will advise you to invest your money and some of the savings you have to invest in bitcoin or any other thing that can make you bounce back and even your wife that is tired of you will surely respect you and give you the respect you deserve as a man.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "June 12, 2024, 10:43:08 AM",
      "body": "Quote from: OlegChernenkov on June 12, 2024, 08:38:34 AMI don't understand why the Cryptocurrency gods are deaf to my prayers((Because we don't believe what you say and we have no obligation to help you just because we are cryptocurrency investors. Why don't you make money with your own hands? Why do you spend time online and ask people to help you by donating to you? That just proves you're a lazy person. If a person is really in difficulty and needs help, they will ask for advice to have a job that brings income, not blatantly ask for money. Because no matter how much money you ask for, one day you will spend it all if you are lazy and refuse to work. I agree that life is getting more difficult and many people are at the brink but I don't think people will easily believe and help you just because you say you are having trouble.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}