{
  "id": "topic_5466873",
  "title": "DiversiCrypto",
  "author": "DiversiCrypto",
  "created_time": "September 15, 2023, 08:53:40 AM",
  "content": "Hello dear founder! Best regards I am looking for new opportunities and if at any time your team could be interested in a loyal servant to create content and contribute to the online presence of the brand, I would like to introduce my services as an SMM specialized in the ecosystem Blockchain.—----------—----------~ Growth and content about features and news for your project:▪️ Threads on Twitter accompanied by quality content such as short videos or graphic designs (2 per week).▪️ Events on Twitter and Telegram such as giveaways and airdrops.▪️ Constant announcements on sites dedicated to the Blockchain ecosystem and my platforms:- Twitter: https://twitter.com/Luisenriquepl (+5000 followers).- Telegram: https://t.me/DiversiCripto (+500 subs)- Facebook: https://www.facebook.com/profile.php?id=100088851870218&mibextid=LQQJ4d (+450 followers)▪️ Constant growth in their communities and platforms.~ Average growth in 30 days creating content and recommending your project:▪️ Communities - Telegram / Discord: from 400 to 1500 users, minimum 30% activity and interaction.▪️ Social Networks - Twitter / Instagram / Reddit / Facebook: from 1500 to 3000 followers, minimum 30% activity and interaction.—----------—----------Investment: 140usd / Service duration: 30 days.—----------—----------I have good job skills and 4 years of experience in the blockchain ecosystem. If you are looking for a content creator for your Blockchain project, do not hesitate to contact me. I am excited to work with you and watch your project grow.For more information:- Discord: mikeleonett.btc",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466873",
  "comments": [
    {
      "author": "DiversiCrypto",
      "created_time": "September 15, 2023, 07:58:08 PM",
      "body": "I can make a thread about your project accompanied by quality content such as graphic designs or short videos and promote them on my communication channels with the aim of also attracting users to your Discord, Telegram and Twitter X community.The cost per publication is 30USDT - the publications may be about a special feature, some update or news about your specific project/platform/crypto.You can check references of my work on my Twitter profile X in the post. Thank you very much for your time, I wish you an excellent day and success in your project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}