{
  "id": "topic_5434330",
  "title": "adaseb",
  "author": "adaseb",
  "created_time": "January 11, 2023, 10:02:05 PM",
  "content": "Listening to the FTX Bankrupcy hearing and its seems positive on many notes.*They located almost $5B in liquid assets. Not including the locked SOL tokens which might be worth alot if SOL goes up in value in the near future.*They also located almost another $5B of other investments, most likely these are the companies that SBF invested in*They agreed to redact all the customer names (for now)They are also thinking of rebooting the FTX exchange since they believe it can be profitable with all the fees. Once its stable and has good volume they will sell the business. So with the $8-10B in liabilities it should be enough to make the exchange solvent again, just like MtGox.The feed went private for some reason so I can't provide a link but maybe the archive will be reposted on Youtube in a few hours by someone.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434330",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "January 11, 2023, 10:07:06 PM",
      "body": "If not for what happened about Binance sales of its FTT token that resulted to panic and leading to the exchange hack, the exchange might not have been hacked. FTX is also under new management now. Other exchanges are not safer than FTX, why not use it again? But do not leave your coins on an exchange, it is not your key which means it is not your coin that you have full control over.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TrustedBitcoiner",
      "created_time": "January 11, 2023, 10:16:52 PM",
      "body": "does this mean that regardless of weather or not ftx comes back online customers will get the majority of their funds back?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "January 11, 2023, 10:35:41 PM",
      "body": "Quote from: TrustedBitcoiner on January 11, 2023, 10:16:52 PMdoes this mean that regardless of weather or not ftx comes back online customers will get the majority of their funds back?That’s the part that I am puzzled because if it goes online then obviously everybody will withdraw everything. So who knows how it will work.Maybe bring it online but with a haircut or for only new deposits? I don’t know. I am very surprised they even suggested this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fatunad",
      "created_time": "January 11, 2023, 10:59:25 PM",
      "body": "Affected users or investors would only be just simply minding on getting their funds or investment back and on the time that it would happen then im 101% sure that they would flock and stay away with this company.If i were to ask then i wouldnt really be trusting up the second time.Once trust been broken then it would be hardly to be given back.They have done something which is something that shouldnt be done.You cant assure that it wont be happening on the second time.I cant blame out for those affected users or investors to have that final decision or even into those potential customers.They might be showing off on things that should be done but it wont really be that enough.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "January 11, 2023, 11:06:25 PM",
      "body": "Quote from: Fatunad on January 11, 2023, 10:59:25 PMAffected users or investors would only be just simply minding on getting their funds or investment back and on the time that it would happen then im 101% sure that they would flock and stay away with this company.same sentiments here. they would just get their money as fast as they can, once they are allowed to. after that, most likely, they won't go back again to this platform. one is more than enough to get rekt. a hard lesson for those who were holding funds on this exchange. nobody saw it coming about the ftx drama. but the big question here is that - would ftx allow their former user to just withdraw their coins?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "January 11, 2023, 11:07:11 PM",
      "body": "Quote from: Fatunad on January 11, 2023, 10:59:25 PMAffected users or investors would only be just simply minding on getting their funds or investment back and on the time that it would happen then im 101% sure that they would flock and stay away with this company.All FTX has to do is to offer 10cents in some home-baked token like Binance is doing and an army of shills will be born all chanting #SBAFU and praising how trustable this exchange is that managed to come back alive and even offer a few cents to newbies. For god's sake, people re still buying terra tokens and if available they would still buy bitconnect or onecoin, people still gamble on 1xbit and they still trade on yobit!As for FTX itself, I don't know, John Ray has a solid reputation in recovering funds, and seems like he's doing a great job, but he doesn't have the same experience in keeping them alive, so most of the time is liquidation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "January 11, 2023, 11:31:39 PM",
      "body": "Quote from: adaseb on January 11, 2023, 10:35:41 PMQuote from: TrustedBitcoiner on January 11, 2023, 10:16:52 PMdoes this mean that regardless of weather or not ftx comes back online customers will get the majority of their funds back?That’s the part that I am puzzled because if it goes online then obviously everybody will withdraw everything. So who knows how it will work.Maybe bring it online but with a haircut or for only new deposits? I don’t know. I am very surprised they even suggested this.Imagine if they bring it back but all accounts will have 0 balance or blocked withdrawals. That would be a bad day for all the former FTX users. I'd say bringing back FTX is a bad idea and it's not going to work. The exchange has a reputation similar to Mt.Gox. Whenever you mention it people will ask if that's the scam that everyone's talking about. Why would anybody deposit money there if there are many other exchanges to choose from? Do you know that saying? Fool me once, shame on you...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kawetsriyanto",
      "created_time": "January 12, 2023, 01:31:03 AM",
      "body": "QuoteFTX Exchange might be brought back online - Would you use it again?I used CEX for trading, not for saving funds/coins. So, why not use FTX again?I am sure they will improve their services and they will be more transparent to customers. As long as FTX looks fine to use, I personally will use it for trading. I'm sure all CEXs have the same chance to experience the problem as FTX.Quote from: Charles-Tim on January 11, 2023, 10:07:06 PMFTX is also under new management now.They are trying to increase public trust with a new management. Quote from: Charles-Tim on January 11, 2023, 10:07:06 PMOther exchanges are not safer than FTX, why not use it again? But do not leave your coins on an exchange, it is not your key which means it is not your coin that you have full control over. Indeed. All CEXs have the same risks as FTX.That's why not recommended to keep funds/coins for a long time there. We only trade coins there, send back coins to private wallets whenever trading is over and send the funds (fiats) to bank accounts. Although it seems a bit complicated but it is the safest way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "January 12, 2023, 04:32:28 AM",
      "body": "Quote from: Fatunad on January 11, 2023, 10:59:25 PMAffected users or investors would only be just simply minding on getting their funds or investment back and on the time that it would happen then im 101% sure that they would flock and stay away with this company.If i were to ask then i wouldnt really be trusting up the second time.Once trust been broken then it would be hardly to be given back.They have done something which is something that shouldnt be done.You cant assure that it wont be happening on the second time.I cant blame out for those affected users or investors to have that final decision or even into those potential customers.They might be showing off on things that should be done but it wont really be that enough.It wouldn’t be run by SBF anymore. It would be run by new management and eventually later if it succeeds and has good revenue it would be sold to another company. And then someone like Binanace or Coinbase or someone else would buy it.Obviously nobody would trust the exchange anymore if it was run the by same clowns. But if it had different management then people might regain trust. The brand is basically the only thing of value. If MtGox came back online many would use it because of the popularity of the name.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "January 12, 2023, 04:59:19 AM",
      "body": "Quote from: adaseb on January 12, 2023, 04:32:28 AMQuote from: Fatunad on January 11, 2023, 10:59:25 PMAffected users or investors would only be just simply minding on getting their funds or investment back and on the time that it would happen then im 101% sure that they would flock and stay away with this company.If i were to ask then i wouldnt really be trusting up the second time.Once trust been broken then it would be hardly to be given back.They have done something which is something that shouldnt be done.You cant assure that it wont be happening on the second time.I cant blame out for those affected users or investors to have that final decision or even into those potential customers.They might be showing off on things that should be done but it wont really be that enough.It wouldn’t be run by SBF anymore. It would be run by new management and eventually later if it succeeds and has good revenue it would be sold to another company. And then someone like Binanace or Coinbase or someone else would buy it.Obviously nobody would trust the exchange anymore if it was run the by same clowns. But if it had different management then people might regain trust. The brand is basically the only thing of value. If MtGox came back online many would use it because of the popularity of the name. They can promote FTX but it's always going to be remembered by users. This is the same as the casinos with scam accusations, there will be doubts about it which is why FTX may have to prove and refund the investors who lost money. Rebuilding the reputation will not just cost money.It's easier to develop a new exchange without so much money needed probably less than $10M compared to an exchange that even the teens today will remember how badly it crashed the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zaki12",
      "created_time": "January 12, 2023, 07:48:39 AM",
      "body": "in terms of price and volatility bitcoin and other crypto are very risky, but in terms of exchange, the policies of centralized exchanges that are fraudulent and incompetent, most often make investors lose. because of that, one that is safe, keep it in a cold wallet, and always research in advance about the exchange that we are going to invest our money in, especially for a long time.I think FTX should have a campaign to restore investor confidence in FTX and convey that it is returning user assets due to the freezing that was carried out some time ago. if not, how can it be rationalized that bitcoin and crypto are the best and safest investment places at FTX, if at any time crypto and exchange dramas are bankrupt again?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "laurenB7742",
      "created_time": "January 12, 2023, 09:48:14 AM",
      "body": "Quote from: adaseb on January 11, 2023, 10:35:41 PMQuote from: TrustedBitcoiner on January 11, 2023, 10:16:52 PMdoes this mean that regardless of weather or not ftx comes back online customers will get the majority of their funds back?That’s the part that I am puzzled because if it goes online then obviously everybody will withdraw everything. So who knows how it will work.Maybe bring it online but with a haircut or for only new deposits? I don’t know. I am very surprised they even suggested this.If they don't intend to return the money to the old customer, then they better not have the plan to do business again as they are definitely scammers, and there is no guarantee that they won't scam us once again. Moreover, we have many better exchanges to choose from, why use an exchange that doesn't return old customers? I've never used it and don't intend to, I'm pretty good with binance. So if it comes back, I would be glad they could refund the customer before even thinking about rebuilding the reputation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Going Up",
      "created_time": "January 12, 2023, 09:59:18 AM",
      "body": "Quote from: adaseb on January 11, 2023, 10:02:05 PMListening to the FTX Bankrupcy hearing and its seems positive on many notes.*They located almost $5B in liquid assets. Not including the locked SOL tokens which might be worth alot if SOL goes up in value in the near future.*They also located almost another $5B of other investments, most likely these are the companies that SBF invested in*They agreed to redact all the customer names (for now)They are also thinking of rebooting the FTX exchange since they believe it can be profitable with all the fees. Once its stable and has good volume they will sell the business. So with the $8-10B in liabilities it should be enough to make the exchange solvent again, just like MtGox.The feed went private for some reason so I can't provide a link but maybe the archive will be reposted on Youtube in a few hours by someone.\"...make the exchange solvent again, just like MtGox.\" The nervous investors are hoping for much better than MtGox! When Gox finally became \"solvent\" that was in terms of USD and Bitcoin had exploded in terms of fiat value. The old-timers here know all too well Huge amounts of BTC were permanently stolen from MtGox customers. Calling MtGox solvent is a bit like saying you enjoyed the band that wouldn't stop playing while the Titantic sank.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "January 12, 2023, 10:10:22 AM",
      "body": "Quote from: AmoreJaz on January 11, 2023, 11:06:25 PMQuote from: Fatunad on January 11, 2023, 10:59:25 PMAffected users or investors would only be just simply minding on getting their funds or investment back and on the time that it would happen then im 101% sure that they would flock and stay away with this company.same sentiments here. they would just get their money as fast as they can, once they are allowed to. after that, most likely, they won't go back again to this platform. one is more than enough to get rekt. a hard lesson for those who were holding funds on this exchange. nobody saw it coming about the ftx drama. but the big question here is that - would ftx allow their former user to just withdraw their coins? Ftx new ownership should also be aware of this sentiment. They will surely prepare for it if they will return. They cannot just return and release every coin for withdrawal, it will be a suicidal mission.They could return and release some percentage of one's fund, like 30% for withdrawal and lock the remaining 70% even if by promising small amount of RoI like as if you are Stakingyoir coin. With this strategy, they will tem the urge to withdrawal all funds and with time and the emergence of bonuses for keeping your funds, people will start trusting the company again. You never can imagine how funny and forgetful humans are.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "January 12, 2023, 12:02:59 PM",
      "body": "I agree that funds should be returned to as many people as possible, but I do not agree that FTX should ever start functioning again after everything that happened. Their reputation is completely destroyed and I don't see any good reason for anyone to try to change it. Although I can agree with @stompix that some people will never learn and that they will always have some kind of sympathy even for the one who more than obviously scam them. Still one's free will to believe in good fairies and elves, just don't whine when the same thing happens to you again.Fool me once, shame on you; fool me twice, shame on me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "January 12, 2023, 12:23:46 PM",
      "body": "Quote from: adaseb on January 11, 2023, 10:35:41 PMQuote from: TrustedBitcoiner on January 11, 2023, 10:16:52 PMdoes this mean that regardless of weather or not ftx comes back online customers will get the majority of their funds back?That’s the part that I am puzzled because if it goes online then obviously everybody will withdraw everything. So who knows how it will work.Maybe bring it online but with a haircut or for only new deposits? I don’t know. I am very surprised they even suggested this.It will be hard to trust them again. Imagine them bringing it all back and then allow only deposits just like you said then this will create more doubts to their self acclaimed sincerity. You can’t reck some set of people and expect others to just run back and trust you. Should they give back some funds to the old investors then they might have a chance but someone like me will just get my funds off it and stay away from it. The least will be to just trade on it and get almost all funds from it. I will take the cost risk of transferring funds off and on it during trading only, even if it is daily. But they can’t have this trust back again",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "January 12, 2023, 12:32:13 PM",
      "body": "They should refund first the affected customers before they even think of bringing it back online again. I think I wouldn't trust them again if ever they come back, there are other exchanges out there to use to. It may come back again for a reason but it's expected most will not trust them again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "January 12, 2023, 12:36:05 PM",
      "body": "Quote from: adaseb on January 11, 2023, 10:02:05 PM*They located almost $5B in liquid assets. Not including the locked SOL tokens which might be worth alot if SOL goes up in value in the near future.*They also located almost another $5B of other investments, most likely these are the companies that SBF invested in*They agreed to redact all the customer names (for now)I'm wondering if this asset can be recovered easily without losing the investment value since most of the project connected to SBF is already suffering a huge loss due to the dump of token price. I'm not a user of FTX but due to the loss of the current user then it will be very hard to trust them again even with new management. There's no guarantee that they can refund 100% of the existing users' funds while their company is now dependent on public acceptance. They might suffer Bittrex's fate that users lost confidence after a series of the bad decisions by the management.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvell1",
      "created_time": "January 12, 2023, 12:54:34 PM",
      "body": "Quote from: Lucius on January 12, 2023, 12:02:59 PMI agree that funds should be returned to as many people as possible, but I do not agree that FTX should ever start functioning again after everything that happened. Their reputation is completely destroyed and I don't see any good reason for anyone to try to change it. Although I can agree with @stompix that some people will never learn and that they will always have some kind of sympathy even for the one who more than obviously scam them. Still one's free will to believe in good fairies and elves, just don't whine when the same thing happens to you again.Fool me once, shame on you; fool me twice, shame on me.I think if it goes back online, it may no longer gain the trust of the old investors who witnessed its demise. But with the way @stompix mentioned and the market is always full of new players, chances are it will continue to be trusted and used. I see people quickly forget, easily ignore everything, and just give them a little profit, they will no longer remember what happened. What I hope after recovering 5 billion, they can refund the victim rather than thinking about going online again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}