{
  "id": "topic_5419372",
  "title": "Darker45",
  "author": "Darker45",
  "created_time": "November 04, 2022, 02:32:26 AMLast edit: November 06, 2022, 02:32:28 AM by Darker45",
  "content": "Are you familiar with this? Or has anybody here been actually charged for having his/her crypto gambling account inactive for several months? The monthly charge could be as high as 15% of the remaining balance. Or, worse, the entire balance could be withheld by the platform itself. Although it could be for security's sake and be returned upon request, who knows what conditions or perhaps KYC information they would require just to have your money back?  For the sake of discussion, let's set aside the fact that one shouldn't leave money in gambling account wallets. Do you think this policy is fair? This is similar to a bank policy that requires accounts to have transactions every now and then or be active or else dormancy fees could be charged. But this feels weird to a gambling platform. What happens to seasonal gamblers who don't mind leaving money in their account wallets? One could only be betting during annual work breaks or vacation or during annual sports championship events. Say, the NBA playoffs, The International, and others. Edit:As suggested, and probably for the interest of a better discussion, I'm quoting here a post of mine which mentioned a few crypto gambling platforms that are actually implementing certain policies pertaining to funds of inactive and dormant accounts. Quote from: Darker45 on November 05, 2022, 02:59:54 AMThanks for all your responses!Honestly, I was surprised when I encountered this. Although I have been gambling for some time already, I have to admit I really wasn't familiar with this. So it isn't surprising either to find out that many of you, including old gamblers, are also surprised with this specific term. But it's there in many crypto gambling platforms. Inactive accounts could be charged for being inactive. They could be permanently closed. Not only that, it could mean that all money left is permanently taken away. So if you frown that your inactive account is being charged for up to 15% monthly, you'd surely be aghast to know that other platforms could simply take everything away. Roobet:QuoteYou acknowledge that the Company may close your account if you did not log into it for 365 days (one year), and all remaining Roollion (funds/money) in the Iron Pouch (wallet) will be permanently lost. (*red mine)Bitcasino:QuoteWe reserve the right to close player accounts that have been inactive for more than 12 months. In case your account has deposited funds after the 12-month inactive period, we reserve the right to use the remaining deposited funds for administrative costs for closing the account.Sportsbet:QuoteIf you do not use your account that has deposited funds for 3 months, you will receive a notice from us. If you do not use your deposits after our notice within 1 month, we reserve the right to deduct monthly administrative costs from your deposit remaining on your account. The administrative cost may be up to 15% from your deposited funds remaining on your account. After 180 days we may remove the balance from your account to increase security on the funds.CryptoGames:QuoteIf you do not access your Account for any consecutive period of 180 days, we reserve the right to shut down such and retain any associated funds.These are just a few examples of crypto gambling platforms that implement what I'm talking about. Please note, though, that while some close accounts, others only suspend accounts, and they could then be reactivated upon request. In this regard, I'm also happy to share that I've encountered at least one platform that do not do this. Betfury:QuoteBetFury does not block or suspend Inactive accounts (an account that has not been used for a long period of time). I'm now interested to open another thread comparing top crypto gambling platforms' policies on dormant or inactive accounts, especially on how they would handle funds left in wallets. This might matter to some gamblers who are unfamiliar with these terms and, like me, seasonal bettors and have the tendency to leave a certain amount in their gambling wallets for easy betting anytime. This may also significantly matter to those who are comparing and considering which platform to use.[/size]",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5419372",
  "comments": [
    {
      "author": "Strongkored",
      "created_time": "November 04, 2022, 04:47:36 AM",
      "body": "So far haven't experienced it, even just found one casino that implements it, a new casino that just had a thread on this forum but unfortunately I forgot the name and thread so I can't include the info here.I think it's unfair, especially the high fees as you mentioned 15%, and if there is a casino that has rules like that there will be many users who will be trapped because we know that many players don't carefully read every rule at the casino, especially if the casino doesn't warns first  the players that the funds in their accounts will decrease due to long periods of inactivity.So far, I have seen the opposite, the casino gives free balances to player accounts that have been inactive for a long time to attract them back to being active",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "November 04, 2022, 05:27:31 AM",
      "body": "Quote from: Strongkored on November 04, 2022, 04:47:36 AMSo far haven't experienced it <...>I haven't either. I usually bet what I deposit. I usually lose it, and if I win I withdraw it. When I've had a bankroll it's because I played constantly, almost every day, so they wouldn't have been able to apply the fee, and that's the first news I've had.Quote from: Darker45 on November 04, 2022, 02:32:26 AMThe monthly charge could be as high as 15% of the remaining balance. <...> For the sake of discussion, let's set aside the fact that one shouldn't leave money in gambling account wallets. Do you think this policy is fair? This is similar to a bank policy that requires accounts to have transactions every now and then or be active or else dormancy fees could be charged.In the case of 15% per month it does not seem fair to me. But one the casino is free to impose its rules and we are free to deposit in that casino or not. What happens is that most people don't read the ToS and can find themselves with the surprise after a while without betting that they are left with 0 in their account.Besides, it seems to me that this is going to become generalised. Hopefully there are casinos that prefer to distinguish themselves by not charging these fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fortunecrypto",
      "created_time": "November 04, 2022, 06:03:27 AM",
      "body": "Quote from: Darker45 on November 04, 2022, 02:32:26 AMAre you familiar with this? Or has anybody here been actually charged for having his/her crypto gambling account inactive for several months? Before commenting here I checked some of the casinos where I have an inactive account and there are no changes to my balancemaybe just got lucky I'm playing in casinos that are not charging fees on dormant accountsQuoteThe monthly charge could be as high as 15% of the remaining balance. Or, worse, the entire balance could be withheld by the platform itself. Although it could be for security's sake and be returned upon request, who knows what conditions or perhaps KYC information they would require just to have your money back?  Are their casinos that implement this, this is the first time I stumble this information so gamblers will be warned if the casinos they are playing are charging fees QuoteFor the sake of discussion, let's set aside the fact that one shouldn't leave money in gambling account wallets. Do you think this policy is fair? It's not fair you should only lose money from betting not from your account being dormant if you have $200 in your account then for some reason like being away from the internet for several months then you lose almost half or all your balance if they charge 15% which is very high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "November 04, 2022, 06:08:34 AM",
      "body": "I don't think I've ever experienced fees for leaving money in my casino wallet (which I often do). I find the idea rather weird really, I know it's a way to force users to spend their money on gambling but it's a blatantly obvious move by casinos, unlike say enticing them with bonuses and promotions instead. 15% is rather steep as well as a fee imo. If I were to pick between two negatives, I'd rather let them lock it till I log in again and submit the necessary documents that prove that I am the owner of the said account or by just simply sending a signed message, if that was accepted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitinity",
      "created_time": "November 04, 2022, 06:38:28 AM",
      "body": "Never heard about a crypto casino charge a fee to their users due to inactivity. Have you experienced it? If so, would you mind to reveal the name of the casino so we can check it and it can be a good warning for others as well? Frankly speaking, it does not make sense if casino charge a fee for dormant accounts as casino is not a bank and players should not use casino as a place to keep/save our money. I tried to check some casinos where I used to play but I did not find a term in those casinos related fee for dormant accounts. Most casinos will only lock/delete dormant accounts but the casino will inform the users first by email.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "November 04, 2022, 06:50:33 AM",
      "body": "I'm the sixth members who commented that there are no casinos I've known that charge for a dormant account and I'm glad that none of the casinos I'm playing and have played do not do such a thing, it's not fair casinos can easily lose the trust of people, I wonder if we have one I'm always checking terms of new casinos and even old ones and they do not have this in their terms if I have one playing I will not let my balance idle the 15% is just too high you are already losing without you doing anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "November 04, 2022, 08:28:03 AM",
      "body": "Quote from: Darker45 on November 04, 2022, 02:32:26 AMAre you familiar with this? Or has anybody here been actually charged for having his/her crypto gambling account inactive for several months? The monthly charge could be as high as 15% of the remaining balance. Or, worse, the entire balance could be withheld by the platform itself. Although it could be for security's sake and be returned upon request, who knows what conditions or perhaps KYC information they would require just to have your money back?  For the sake of discussion, let's set aside the fact that one shouldn't leave money in gambling account wallets. Do you think this policy is fair? This is similar to a bank policy that requires accounts to have transactions every now and then or be active or else dormancy fees could be charged. But this feels weird to a gambling platform. What happens to seasonal gamblers who don't mind leaving money in their account wallets? One could only be betting during annual work breaks or vacation or during annual sports championship events. Say, the NBA playoffs, The International, and others. I had my account dormant for a long time in one of the reputable casinos here in the forum,they have kept sending me emails to be active or that my account will be disabled,I was careless to respond and in the end my account was disabled.I contacted them and they immediately re activated my account when I asked them so.They or any other casino I do not believe asks us 15% balance as a fee for our account to be active and I think they are not any bank and should not do this,they can continue with disabling accounts after a long time of inactivity.Of course my wallet was empty but I would agree in the disabling my account after a long period of inactivity even if I had money there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "November 04, 2022, 08:38:45 AM",
      "body": "Damn, I was not aware of this kind of policy from some gambling platforms. I have some, but it's not usually huge amount that I left since June, (the end of NBA games), and was not frequently betting until this October or at the start of the regular season.So far I didn't get this treatment though, it's just the same, deposit some on my account and bet as usual. And I would say that this is a bad policy indeed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "November 04, 2022, 08:45:38 AM",
      "body": "Quote from: Darker45 on November 04, 2022, 02:32:26 AMAre you familiar with this? Or has anybody here been actually charged for having his/her crypto gambling account inactive for several months? Never really heard of it nor experienced it. Maybe it is on the terms and agreement upon registration, you should've read it (which most of us failed for sure LOL). But as I said, that would  be a counterpart for the gambling site. Instances are, a gambler temporarily quit then decided to comeback, theses fees would more likely discourage and push him to just moge into other gambling platform, so I don't really get the point of doing so. Gambling games or activities are accessible to every gambling site so why would they imply something that would somehow destroy the interest of a player to stay on their site. I only have one assumption if this is true; that gambling site gave huge rewards or bonuses such as needing to play for months continuously to make use of the sign up bonus (perhaps as an example, which is evident to online games -battle pass thingy), and management use 'penalties' to compensate for those reward. Just my guess.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "November 04, 2022, 08:49:28 AM",
      "body": "Quote from: Yaunfitda on November 04, 2022, 08:38:45 AMSo far I didn't get this treatment though, it's just the same, deposit some on my account and bet as usual. And I would say that this is a bad policy indeed.It's a bad policy indeed I don't have any casino that does this, there are unavoidable circumstances like when you have a big bankroll, then you are cut off or you have an emergency that you cannot come back for several months like surgery after you come back you just find out that you are down 70% of your bankroll because of several months of activity, you will be disappointed and will give this casino a bad rating and post these on platforms like Bitcointalk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "November 04, 2022, 09:25:16 AM",
      "body": "Quote from: Darker45 on November 04, 2022, 02:32:26 AMFor the sake of discussion, let's set aside the fact that one shouldn't leave money in gambling account wallets. Do you think this policy is fair? No, I don't think this is a fair policy from casino itself. Sometimes we really left dust amounts on certain casinos and forget about it over time, but charging like 15% for keeping your money in their custody? That is very wrong, indeed.So I guess it's good that you open up this thread and probably gamblers will be more aware that we shouldn't left any money in our gambling wallet, maybe we can forget it. But the moment we remember and try to withdraw it after a long time, we might be for a big surprised.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "November 04, 2022, 10:03:26 AM",
      "body": "I even just found out there is a fee because our account has been inactive for several months. But what if the account has no balance at all? Will the casino still ask the person to pay a monthly fee?This is not good for seasoned gamblers who only gamble if they want to gamble and leave gambling if they don't have time to gamble. But I hope casinos don't implement this because KYC has made many of us object to submitting our documents to the casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "November 04, 2022, 11:52:30 AM",
      "body": "Quote from: Darker45 on November 04, 2022, 02:32:26 AMDo you think this policy is fair?in my opinion, yeah, it's fair. if banks do it why can't theyQuote from: Darker45 on November 04, 2022, 02:32:26 AMThis is similar to a bank policy that requires accounts to have transactions every now and then or be active or else dormancy fees could be charged. But this feels weird to a gambling platform. What happens to seasonal gamblers who don't mind leaving money in their account wallets? One could only be betting during annual work breaks or vacation or during annual sports championship events. Say, the NBA playoffs, The International, and others. simply don't leave money on your gambling account. I rarely gamble and I only have small amounts of money when gambling and I still feel weird leaving money(that I think is large enough) in my gambling account. gamblers should make it a habit not to leave money in a gambling account for a long time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "November 04, 2022, 12:02:15 PM",
      "body": "Quote from: Darker45 on November 04, 2022, 02:32:26 AMAre you familiar with this? Or has anybody here been actually charged for having his/her crypto gambling account inactive for several months? The monthly charge could be as high as 15% of the remaining balance. Or, worse, the entire balance could be withheld by the platform itself. Although it could be for security's sake and be returned upon request, who knows what conditions or perhaps KYC information they would require just to have your money back?  For the sake of discussion, let's set aside the fact that one shouldn't leave money in gambling account wallets. Do you think this policy is fair? This is similar to a bank policy that requires accounts to have transactions every now and then or be active or else dormancy fees could be charged. But this feels weird to a gambling platform. What happens to seasonal gamblers who don't mind leaving money in their account wallets? One could only be betting during annual work breaks or vacation or during annual sports championship events. Say, the NBA playoffs, The International, and others. I find it fair and not weird at all even if it's from a gambling platform. As we all know, each of them has its own house rules and we have no choice but to follow what's written there. I haven't experienced that because AFAIK when you've got a dormant account, it's likely that they will just terminate it and the funds will automatically be owned by them. IIRC, it's somewhere written on their rules so just to be sure, be read if the casino you've got a dormant account has an specific rule about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "November 04, 2022, 12:21:09 PM",
      "body": "Quote from: acroman08 on November 04, 2022, 11:52:30 AMQuote from: Darker45 on November 04, 2022, 02:32:26 AMDo you think this policy is fair?in my opinion, yeah, it's fair. if banks do it why can't theyQuote from: Darker45 on November 04, 2022, 02:32:26 AMThis is similar to a bank policy that requires accounts to have transactions every now and then or be active or else dormancy fees could be charged. But this feels weird to a gambling platform. What happens to seasonal gamblers who don't mind leaving money in their account wallets? One could only be betting during annual work breaks or vacation or during annual sports championship events. Say, the NBA playoffs, The International, and others. simply don't leave money on your gambling account. I rarely gamble and I only have small amounts of money when gambling and I still feel weird leaving money(that I think is large enough) in my gambling account. gamblers should make it a habit not to leave money in a gambling account for a long time.Every place has its own rules. We already accept these rules when betting there. I also think this policy is fair. The rules are clearly stated. I don't think gamblers will leave money in their accounts anyway. At least very few do. After all, their goal is to have fun and make money. When the fun is over you have to take your money and go. There is no point in keeping your money on the platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doell",
      "created_time": "November 04, 2022, 12:45:08 PM",
      "body": "I am familiar with this policy, before I register always read the ToS not always 15% depending on the website gambling platform. IMO this is unfair, if the bank is reasonable because we save money but in gambling we just want to have fun. That's policy doesn't make us happy, indeed its better don't keep money on any platform for a long term including gambling, anyway we have a crypto wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "November 04, 2022, 02:38:24 PM",
      "body": "Quote from: Darker45 on November 04, 2022, 02:32:26 AMAre you familiar with this? Or has anybody here been actually charged for having his/her crypto gambling account inactive for several months? i have a small amount of funds on a gambling site almost a few years not accessing my account anymore, but i tried to access it recently and i see that the funds are not decreasing, i guess not all gambling sites charge a monthly fee, even though i have accessed my gambling account and it turns out I violated the TOS now my account can't play there anymore, so I left it and asked to delete my account then create another new account, not all gambling sites have the same policy this is my lesson to read the TOS in the future don't leave the account so long let alone leave money in it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jemzx00",
      "created_time": "November 04, 2022, 02:56:44 PM",
      "body": "Nope, I'm not familiar with that kind of policy to any gambling platform that I've been to. Also, I have never experienced it myself even after I've created accounts to different gambling platforms way back. Since, I've only gambled to few gambling sites however I mostly try a lot of gambling website as well and I have not received any notification about dormancy on any of those.For me, I don't think it's fair that gambling platforms should charge their gamblers or users any fees for account inactivity. Banks do this since they are a financial institution, and their users can receive a few interests on their funds on their account which is not applicable on gambling institutions.Anyways, since we are on a topic about account dormancy, I have received a recent email from a trading platform about it. They are notifying me to log-in unto my account to make it active or else they'll charge me 5$ account dormancy fee monthly and will be subjected to KYC. Has anyone received such an email from any trading platform that you're not active on?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Scripture",
      "created_time": "November 04, 2022, 03:00:09 PM",
      "body": "Quote from: Darker45 on November 04, 2022, 02:32:26 AMDo you think this policy is fair? This is not fair though, it's like forcing the gambler to play on the site even if they are not ok with the site anymore.With this, better to understand the terms and conditions first so you can know if the site have this kind of rules and you can prepare just in case you are going to leave the site for a longer time. In banks you can just open another account if your previous account becomes dormant, maybe this should also apply to gambling site since their priority is to get more players and charging them with a huge fees might discourage them to come back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}