{
  "id": "topic_5447839",
  "title": "Ever-young",
  "author": "Ever-young",
  "created_time": "April 06, 2023, 03:40:39 PM",
  "content": "Is their anything wrong with wearing signature code and avatar for project that don't have ANN thread here or any form of relation with this forum ? I was discussing with with a client some times last week regarding how advertising works on this forum, and a question was asked if they could design a signature for their project and I wear it on my profile, still left the question on answered.. just wanted to confirm first if their is anything wrong in doing that.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447839",
  "comments": [
    {
      "author": "bullrun2024bro",
      "created_time": "April 06, 2023, 03:57:06 PM",
      "body": "Quote from: Ever-young on April 06, 2023, 03:40:39 PMIs their anything wrong with wearing signature code and avatar for project that don't have ANN thread here or any form of relation with this forum ? As long as the signature does not violate the forum rules, you can use whatever signature you want.However, from a marketing perspective, it certainly makes sense to open an ANN thread and introduce the project. However, this is not obligatory.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "April 06, 2023, 03:57:34 PM",
      "body": "Yes, you can put anything you want more or less in your signature. BUT, you (and they) may get a lot of backlash. As to what they are hiding, and why they don't want to have a discussion here. And so on.The best that I can say is that it would look 'off' if it's crypto related. Even if it's just a small announce thread with some info. However, if you are selling something like coffee cups and not taking crypto, nobody is going to think anything about the fact that you are not discussing / having an announcement here. But, then why would you be advertising here. Look at it from that point of view.The other side of it is that it might actually be good for a non crypto project. Just something different may actually get more eyes on it since it is different.So, nothing wrong, but without more info can't say it's 'right' either.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "April 06, 2023, 04:09:55 PM",
      "body": "Quote from: Ever-young on April 06, 2023, 03:40:39 PMIs their anything wrong with wearing signature code and avatar for project that don't have ANN thread here or any form of relation with this forum ? I think its fine. Maybe if the links attached to the signature is have something like referrals or click bait it might be not allowed. But for sure even without the Ann thread it could work as long as you are putting up a nice signature and appropriate on your rank.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "April 06, 2023, 04:11:30 PM",
      "body": "It should be that such signature code and avatar doesn't have a record of being scam because that project can not be tracked if there anything that comes up, usually it should be a signature that has ann thread if there is any issues or problems to solve from it participants. For instance, there are some gambling site that are running signature campaign and if any of them have an issue they easily boiled down to their thread to Lodge the complain maybe the project owner would take it up from there rather than those without being registered here. But there's nothing wrong wearing it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "April 06, 2023, 04:25:07 PM",
      "body": "To the extent that I am aware of it, there is nothing wrong with wearing your signature; in fact, you are allowed to wear anything on your signature space; it all belongs to you, so you can do whatever you want with it. But, you should mind what you wear, in order not to tarnish the reputation of your account. If projects don't have an ANN thread here or any form of representative yet you are wearing their signature and advertising them about, whatever issue or scam accusations are brought upon the project, you will be held responsible to respond and solve the issue, and if it's not properly solved you might likely be held responsible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "leonair",
      "created_time": "April 06, 2023, 04:27:16 PM",
      "body": "Quote from: Ever-young on April 06, 2023, 03:40:39 PMIs their anything wrong with wearing signature code and avatar for project that don't have ANN thread here or any form of relation with this forum ? You can wear any signature or avatar you want on your personal account without any problem. In that case if no ANN, Bounty, Signature Campaign of that project is posted in this forum then there is no problem.  Because you have personal freedom to use your personal accountQuoteI was discussing with with a client some times last week regarding how advertising works on this forum, and a question was asked if they could design a signature for their project and I wear it on my profile, still left the question on answered.. just wanted to confirm first if their is anything wrong in doing that. Even if you are contracted with a company and wear that company's signature, it will not cause any problem. But in one case you must make sure that the project is not a scam project. If it is a scam project and you promote it then your account may be get red tagged from DT members.  But if that project is not a scam project then you can promote it as you like",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "April 06, 2023, 04:28:48 PM",
      "body": "Quote from: Ever-young on April 06, 2023, 03:40:39 PMIs their anything wrong with wearing signature code and avatar for project that don't have ANN thread here or any form of relation with this forum ? I was discussing with with a client some times last week regarding how advertising works on this forum, and a question was asked if they could design a signature for their project and I wear it on my profile, still left the question on answered.. just wanted to confirm first if their is anything wrong in doing that. There’s nothing wrong. Actually most of the signature code attached the link of the website outside the forum because the main goal of signature and avatar is to channel the traffic from the forum to the website you are promoting. Forum has less restrictions when it comes to signature space since you can attached referral link on it which you can’t do on your post.Just make sure that the signature you are promoting doesn’t violate the forum rules and not SCAM to make sure that DT won’t tag you for advertising shady project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "April 06, 2023, 04:29:41 PM",
      "body": "Quote from: Ever-young on April 06, 2023, 03:40:39 PMIs their anything wrong with wearing signature code and avatar for project that don't have ANN thread here or any form of relation with this forum ? No, but why wouldn't they provide an ANN thread here for more information regarding the project? QuoteI was discussing with with a client some times last week regarding how advertising works on this forum, and a question was asked if they could design a signature for their project and I wear it on my profile, still left the question on answered.. just wanted to confirm first if their is anything wrong in doing that. Your signature space is yours, and you have control over it, which is why most of us use it to promote projects whose services we are confident in.Some projects may put your account at risk, especially if they are scam projects, similar to how 1XBit signature participants' accounts were flagged for promoting a scam project. Make sure you do thorough research on the project, and you'll be fine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "April 06, 2023, 04:30:03 PM",
      "body": "Quote from: cryptoaddictchie on April 06, 2023, 04:09:55 PMMaybe if the links attached to the signature is have something like referrals or click bait it might be not allowed.It is allowed in your signature space or at your profile page.It is only not allowed in your posts.Quote from: mprep on July 21, 2014, 05:27:51 PM4. No referral code (ref link) spam. [1]Quote from: Hyphen(-) on April 06, 2023, 04:29:41 PMSome projects may put your account at risk, especially if they are scam projects, similar to how 1XBit signature participants' accounts were flagged for promoting a scam project. Make sure you do thorough research on the project, and you'll be fine.However it is allowed and forum does not moderate scam.Only forum community discourage advertising (in signature) for scam projects. DT members will tag you if you do it and ignore their warnings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ever-young",
      "created_time": "April 06, 2023, 05:01:18 PM",
      "body": "Quote from: Hyphen(-) on April 06, 2023, 04:29:41 PMQuote from: Ever-young on April 06, 2023, 03:40:39 PM~snip~ No, but why wouldn't they provide an ANN thread here for more information regarding the project? Quote~Snip~Your signature space is yours, and you have control over it, which is why most of us use it to promote projects whose services we are confident in.Some projects may put your account at risk, especially if they are scam projects, similar to how 1XBit signature participants' accounts were flagged for promoting a scam project. Make sure you do thorough research on the project, and you'll be fine.Probably they are not yet ready for big advertisement, I'm currently working with them on discord and telegram as a moderator, so far so could there is no form of scam tagged to them, but I never can tell what's on there mind since am not part of the team but just a hired moderator.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "April 06, 2023, 05:25:43 PM",
      "body": "Quote from: Ever-young on April 06, 2023, 03:40:39 PMIs their anything wrong with wearing signature code and avatar for project that don't have ANN thread here or any form of relation with this forum ? The forum in itself does not have any relationship with any signature campaign, neither does the forum run its own signature campaign. It is for business brands that want advertisement, they just simply hire a good campaign manager and run their campaign. If the project you are discussing with only wants you to advertise them, the advertisement would not be effective because only 1 member is wearing their signature.Quote from: Ever-young on April 06, 2023, 05:01:18 PMProbably they are not yet ready for big advertisement, I'm currently working with them on discord and telegram as a moderator, so far so could there is no form of scam tagged to them, but I never can tell what's on there mind since am not part of the team but just a hired moderator. You cannot be so sure of them, since they have no Ann thread, campaign manager or brand representative here, have it in mind that if only you wear the signature on the forum, you represent all of that to them here, and if they turn out to be a scam, all the backlash would be on you and your reputation here will be ruined totally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "April 06, 2023, 05:56:44 PM",
      "body": "Can't imagine what's the motive behind this but if you or your team is expecting to get a lot of clicks through the signature space, from one user, I think that will be a total waste of money. Signature campaign marketing work here as a form of building the community, and brand image and it works in long. There are a lot of projects which have run campaigns for a few weeks and they didn't get the expected clicks lol. It doesn't work that way. You need time to let people know the brand and only after that, it will work. If they are expecting to test with one account for few weeks, let me assure you that they will get almost nothing out of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "salad daging",
      "created_time": "April 06, 2023, 06:04:06 PM",
      "body": "Quote from: Ever-young on April 06, 2023, 03:40:39 PMIs their anything wrong with wearing signature code and avatar for project that don't have ANN thread here or any form of relation with this forum ? It doesn't matter, it's your signature space, so feel free to use it if you want to use a project signature that you recognize even if there is no relationship in the forum or there is no ANN.If you're the only one using the signature then it won't have a big impact on the project except by opening a signature campaign.The important thing is to read the forum rules shown by @tbct_mt2Quote from: Ever-young on April 06, 2023, 05:01:18 PMProbably they are not yet ready for big advertisement, I'm currently working with them on discord and telegram as a moderator, so far so could there is no form of scam tagged to them, but I never can tell what's on there mind since am not part of the team but just a hired moderator. Because the forum is not a moderation scam then it will be your right and also the team, if they are not ready for a big ad then don't ever force it, if you just want to make an ANN it's good because I see several projects also do that but without running a signature campaign.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gladitorcomeback",
      "created_time": "April 06, 2023, 06:58:24 PM",
      "body": "Quote from: Ever-young on April 06, 2023, 03:40:39 PMIs their anything wrong with wearing signature code and avatar for project that don't have ANN thread here or any form of relation with this forum ? I was discussing with with a client some times last week regarding how advertising works on this forum, and a question was asked if they could design a signature for their project and I wear it on my profile, still left the question on answered.. just wanted to confirm first if their is anything wrong in doing that. No issue at all as long as the the signature not promoting the project which are against rules of this forum such as Ponzi schemes or something scam. You are free to wear anything. many compaigns manager are wearing their own specific compaign management signature to attract client. before accepting in paid signature I also created my own signature for own local board signature and was wearing for one month.  I hope you find many comments helpful here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "April 06, 2023, 07:10:23 PM",
      "body": "Quote from: Ever-young on April 06, 2023, 03:40:39 PMIs their anything wrong with wearing signature code and avatar for project that don't have ANN thread here or any form of relation with this forum ? it's only wrong not to have ANN here. through ANN it would certainly be better popularized than through signatures in your account. if you are not particularly active, the probability that your signature will have any effect is very small, while in the ANN thread, users would have the chance to get to know the project better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "April 06, 2023, 07:40:58 PM",
      "body": "If the project is genuine you wear the signature on it and I have seen some forum users that do the same for their project or website.Quote from: tbct_mt2 on April 06, 2023, 04:30:03 PMQuote from: cryptoaddictchie on April 06, 2023, 04:09:55 PMMaybe if the links attached to the signature is have something like referrals or click bait it might be not allowed.It is allowed in your signature space or at your profile page.It is only not allowed in your posts.Yes, you're right and I have seen a lot of casinos using the referral link in their ANN thread and signature code since it's not spam. It is not against the forum rules. There are a lot of misconceptions about the use of referral links on this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "April 06, 2023, 07:42:24 PM",
      "body": "Quote from: Gladitorcomeback on April 06, 2023, 06:58:24 PMNo issue at all as long as the the signature not promoting the project which are against rules of this forum such as Ponzi schemes or something scam.Unfortunately, this is not correct. If you read the forum's rules (although unofficial ), you are not going to find any rule that prohibits promoting scams! No member has been banned for doing such thing but they most certainly will have their accounts red painted. Take the 1xshit sig campaign as a concrete example. This is the explanation why scams are not moderated:Quote from: mprep on July 21, 2014, 05:27:51 PM19. Possible (or real) scams and Trust ratings are not moderated (to prevent moderation abuse).However, posting a link to a malware (on sig. space or anywhere else on the forum) is considered a violation of the rules and will result in getting your account banned.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "April 06, 2023, 10:21:12 PM",
      "body": "Yes.....you can add anything you want as a signature or an avatar.But ofcourse, yunno this is a crypto site so if you're actually creating ads for something unrelated to it, then that's simply gonna look wierd.Secondly, you're not paid for whatsoever you choose to advertise for yourself as that's the only space you've got for ads.....maybe you've known that's already, maybe I have to tell you again.Whatever you're advertising should also have an introduction/announcement thread which is otherwise called the \"ANN THREAD\"... anyone would wanna have a little orientation on whatsoever it is before following any link to a site outside BTT.Sandra 🧑‍🦰",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "April 06, 2023, 11:22:51 PM",
      "body": "Quote from: Ever-young on April 06, 2023, 03:40:39 PMIs their anything wrong with wearing signature code and avatar for project that don't have ANN thread here or any form of relation with this forum ? There is nothing wrong wearing avatar or signature code assuming it does not break any of the unofficial rule of the forum.  This is the beauty of this forum, we are free to do anything as long as it abide by the rules.Quote from: Ever-young on April 06, 2023, 03:40:39 PMI was discussing with with a client some times last week regarding how advertising works on this forum, and a question was asked if they could design a signature for their project and I wear it on my profile, still left the question on answered.. just wanted to confirm first if their is anything wrong in doing that. Just let them know about the forum's unofficial list of rules  in order to avoid future troubles or best know it yourself so that you can explain to them clearly.Also take note of this reply:Quote from: khaled0111 on April 06, 2023, 07:42:24 PMQuote from: Gladitorcomeback on April 06, 2023, 06:58:24 PMNo issue at all as long as the the signature not promoting the project which are against rules of this forum such as Ponzi schemes or something scam.Unfortunately, this is not correct. If you read the forum's rules (although unofficial ), you are not going to find any rule that prohibits promoting scams! No member has been banned for doing such thing but they most certainly will have their accounts red painted. Take the 1xshit sig campaign as a concrete example. This is the explanation why scams are not moderated:Quote from: mprep on July 21, 2014, 05:27:51 PM19. Possible (or real) scams and Trust ratings are not moderated (to prevent moderation abuse).However, posting a link to a malware (on sig. space or anywhere else on the forum) is considered a violation of the rules and will result in getting your account banned. Scams and frauds are not regulated but if you wanted your service to proliferate, It is advisable that you should take reputable projects to advertise in this forum and avoid those that have the tendency to scam people.  Advertisng scams and fraud project will not only hinder your service but also can make your account bombarded with red trust from concern members and DTs",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}