{
  "id": "topic_5464488",
  "title": "Stepstowealth",
  "author": "Stepstowealth",
  "created_time": "August 24, 2023, 11:09:02 PM",
  "content": "Is it just for aesthetics? or does trading on a big screen have an effect on the outcome of your trade. I often see that professional traders have created a work space for themselves where they invest heavily into hardware and big monitor screens. So I wonder if trading on bigger monitor screen has a better effect on trading because I think that with the big screens a trader will be able to make better analysis. Is this my opinion correct or is there no special effect that trading on big screen has?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464488",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "August 24, 2023, 11:20:15 PM",
      "body": "No special effect than to have better trading experience because big screens are better than smaller screens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mvdheuvel1983",
      "created_time": "August 24, 2023, 11:23:11 PM",
      "body": "It doesn't matter for the professional trader who already has the skill and knows just what to look for on the screen. But for the beginner trader who needs to learn about technical analysis and see the full screen so as to get conversant with the details, screen size matter alot. There is also a small group of people for whom whether they be beginners or not their trading is not affected by the monitor screen size",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "August 24, 2023, 11:25:59 PM",
      "body": "Most of them do it, so they can be able to carry out Technical Analysis or view multiple charts at ago, but it has less to do with the outcome of the trade. It has more to do with convenienceI personally know how hard it is to analyze charts using a mobile phone. So I use my PC to analyze charts and then if I am to use a mobile phone. I only open or close a position using it. Ever tried opening trading view on a mobile phone? It sucks!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kaimoure",
      "created_time": "August 25, 2023, 01:47:04 AM",
      "body": "it's not only for aesthetics. trading with a wide monitor gives you better experience in trading since you can have a larger size of chart. I'm trading with a triple monitor setup since I'm trading with different coins. Also monitor size give you space if you're going to use multiple screen windows has that feature where you can split your screen with different tabs. It doesn't have affect the outcome of your trade but gives you more insights with the move of the market. You can use big monitor if you have a lot of budget but if you're starting on trading only you can start with only what you can afford. before I only use 24 inch monitor the basic one but now im using 32 inch wide monitor and 2 extra 24 inch curve monitor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stadus",
      "created_time": "August 25, 2023, 01:51:19 AM",
      "body": "It's more convenient with big screens, especially if you are a day trader. It could be helpful in that case. It's like having better tools that can lead to better results. If you are serious about trading and considering it as a full-time job or venture, investing in that kind of setup is essential. As for me, I use my laptop and it works for me, but I'm not a big-time trader.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "August 25, 2023, 02:46:00 AM",
      "body": "Quote from: Oshosondy on August 24, 2023, 11:20:15 PMNo special effect than to have better trading experience because big screens are better than smaller screens.Bigger is better but screens only need to be big enough. We don't actually need to use oversize screens just for trading and think such screens are helpful for our trading and positively increase our trading accuracy and profit.Our profit is from our entries and exits which are determined by our knowledge, experience and patience to keep up our discipline for position open and closing. If we don't have enough factors, only an oversize screen is useless and can not help us to increase our profit.Bigger screens potentially affect our emotion more that will cause more bad decisions and also negatively affect our eye-sights in long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "August 25, 2023, 03:56:46 AM",
      "body": "Quote from: Stepstowealth on August 24, 2023, 11:09:02 PMIs it just for aesthetics? or does trading on a big screen have an effect on the outcome of your trade. I often see that professional traders have created a work space for themselves where they invest heavily into hardware and big monitor screens. So I wonder if trading on bigger monitor screen has a better effect on trading because I think that with the big screens a trader will be able to make better analysis. Is this my opinion correct or is there no special effect that trading on big screen has?This is about practicality, there are some people out there which trade on their smartphones, however the screen of any smartphone is smaller than a monitor, so you risk reading the price wrong and as a consequence making a mistake, and depending on how bad you read the price the magnitude of the mistake can be smaller or bigger.So instead of taking such a risk trading using a big screen is recommended, also if you trade several markets you could even use several monitors, now this will only save you a few seconds as you can always switch desktops with ease, but when execution is key and a few seconds can be the difference between winning and losing then it is better to get more monitors to aid you as a trader.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "@sriyan",
      "created_time": "August 25, 2023, 04:09:30 AM",
      "body": "Quote from: Stepstowealth on August 24, 2023, 11:09:02 PMIs it just for aesthetics? or does trading on a big screen have an effect on the outcome of your trade. I often see that professional traders have created a work space for themselves where they invest heavily into hardware and big monitor screens. So I wonder if trading on bigger monitor screen has a better effect on trading because I think that with the big screens a trader will be able to make better analysis. Is this my opinion correct or is there no special effect that trading on big screen has?If you are a trader, you need to check the charts clearly and analyze them. If you have a small screen, it will be really difficult to check the chart and see the overall view. But if you have a big monitor, you can clearly see the overall action and the history.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "August 25, 2023, 04:22:59 AM",
      "body": "You can answer it by yourself, what device you're currently use to access this forum? PC, cellphone or iPad? If you have two devices, try to use both of them to post in this forum, which one is more convenient and better for you? same happen with a small monitor and big monitor, you will feel different and know which one is better for your productivity. A big monitor itself will not increase your profit in trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "August 25, 2023, 05:19:21 AM",
      "body": "I think the use of such a large monitor will be multitasking showing several windows simultaneously, this means it must be supported by a high CPU specification.I personally am not a trader who is said to be a pro, so I don't really need a large monitor size as long as there are no special needs, the most important thing is comfort when viewing it longer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "August 25, 2023, 07:49:49 AM",
      "body": "Quote from: Stepstowealth on August 24, 2023, 11:09:02 PMIs it just for aesthetics? or does trading on a big screen have an effect on the outcome of your trade. I often see that professional traders have created a work space for themselves where they invest heavily into hardware and big monitor screens. So I wonder if trading on bigger monitor screen has a better effect on trading because I think that with the big screens a trader will be able to make better analysis. Is this my opinion correct or is there no special effect that trading on big screen has?A big monitor will bring you extra x2 when trading any crypto pair. I am sure that a big monitor is an element of convenience and comfort for traders during their work, as they spend a lot of time analyzing the state of the cryptomarket. Bigger monitor size = more information can fit. You can also trade behind a small monitor (look at the old movies - in those days, they also somehow traded for profit, right) and at first, it makes no sense for traders, when they are just starting their activities, to spend money on big and expensive monitors. In the end, you can always connect several smaller monitors and the effect will be close to large sizes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "August 25, 2023, 08:10:09 AM",
      "body": "Lol. It's solely due to the fact that bigger and more monitors means you can see the charts in a clearer manner, and that you can fit more charts in those bigger screens. You don't necessarily fit one chart in one single big screen — you can divide them into smaller pieces using certain websites and/or software.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "August 25, 2023, 08:38:41 AM",
      "body": "I see where you are coming from. The social media is filled with users showing off their large monitors and RGB lights which are promoted and shows trading going on. This is a narrative that is done by many social media jerks. The objective is to induce a sense of greed for money through these aesthetics and equipment that most people may not be able to afford.I trade mainly from my smartphone or laptop but I make decent amounts every month in fiat and bitcoin. Most decent traders keep their spending on devices to a necessary amount and not luxury so work on trading not your computers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "August 25, 2023, 12:09:37 PM",
      "body": "Monitor size really matters for me since you can clearly see all the information you need to see in the chart. If you have a big monitor, your eyes will be relax and no need to be near in the computer just to see small details in the chart. It's also good to see multiple charts in one monitor. So it would be better if your monitor is big, that is trader's dream. However, no matter the size of the monitor it's doesn't affect your trading because you can both make analysis. For you to know, I have friend who can still make profit in trading even though he is only using phone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shivansps",
      "created_time": "August 25, 2023, 12:59:20 PM",
      "body": "Quote from: Stepstowealth on August 24, 2023, 11:09:02 PMIs it just for aesthetics? or does trading on a big screen have an effect on the outcome of your trade. I often see that professional traders have created a work space for themselves where they invest heavily into hardware and big monitor screens. So I wonder if trading on bigger monitor screen has a better effect on trading because I think that with the big screens a trader will be able to make better analysis. Is this my opinion correct or is there no special effect that trading on big screen has?I think it's individual. For me personally, the monitor matters. More of some details may be visible on a large monitor. For some people, monitor size doesn't matter. I think that there is not much difference, but for example, some operations are difficult to carry out from the phone. Therefore, the larger the monitor, the better for me. Also, if you carry out any analysis of graphs, then this can be done better using a large monitorIn my experience, the more experienced a person is in trading, the more monitor he has, and sometimes even several monitors - two or three for better analysis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "August 25, 2023, 01:30:41 PM",
      "body": "Quote from: Stepstowealth on August 24, 2023, 11:09:02 PMIs it just for aesthetics? or does trading on a big screen have an effect on the outcome of your trade. I often see that professional traders have created a work space for themselves where they invest heavily into hardware and big monitor screens. So I wonder if trading on bigger monitor screen has a better effect on trading because I think that with the big screens a trader will be able to make better analysis. Is this my opinion correct or is there no special effect that trading on big screen has?Yes, that is you can see the charts bigger but instead of buying a monitor for thousands of dollars they can simply use the split monitors which will do the same work for much less cost but when they have money they don't know where they are spending.In some case, they simply do it to show off their workplace like a studio for them and we can see the same kind of attitude with gamers.Apart from this there is no positives for using big screen and regular screen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "August 25, 2023, 02:32:41 PM",
      "body": "Quote from: Stepstowealth on August 24, 2023, 11:09:02 PMIs it just for aesthetics? or does trading on a big screen have an effect on the outcome of your trade. I often see that professional traders have created a work space for themselves where they invest heavily into hardware and big monitor screens. So I wonder if trading on bigger monitor screen has a better effect on trading because I think that with the big screens a trader will be able to make better analysis. Is this my opinion correct or is there no special effect that trading on big screen has?With or without a big screen trading system, you can make a profit off the market when you trade the right way, however, one thing differential that it does is that during market analysis using a big screen PC, helps the trader to see the bigger picture of the trending market and helps traders make better trading decisions and thereby enhancing their trading experience only if you are already a good or profitable trader.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kawetsriyanto",
      "created_time": "August 25, 2023, 03:20:13 PM",
      "body": "Quote from: Stepstowealth on August 24, 2023, 11:09:02 PMIs it just for aesthetics? or does trading on a big screen have an effect on the outcome of your trade. I often see that professional traders have created a work space for themselves where they invest heavily into hardware and big monitor screens. So I wonder if trading on bigger monitor screen has a better effect on trading because I think that with the big screens a trader will be able to make better analysis.No, a bigger screen won't have a significant impact on the outcome of trading. Knowledge, experience, and good mentality are the big factors that can bring impacts on the outcome. Professional traders use big monitor, top hardware, and decorate their work space to make them more comfortable in trading. They must spend a lot of time to trade daily, they will make the work space to be as comfort as possible. So, it is very clear that there is nothing to do between the size of monitor with the outcome of trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "August 25, 2023, 06:49:22 PM",
      "body": "Quote from: Stepstowealth on August 24, 2023, 11:09:02 PMIs it just for aesthetics? or does trading on a big screen have an effect on the outcome of your trade. I often see that professional traders have created a work space for themselves where they invest heavily into hardware and big monitor screens. So I wonder if trading on bigger monitor screen has a better effect on trading because I think that with the big screens a trader will be able to make better analysis. Is this my opinion correct or is there no special effect that trading on big screen has?Well, a true craftsman or journeyman must have the right tools inorder to excel at their craft. Same goes to those who have made a career out of trading from their homes. We see cases of traders having to customize their living space by fitting in  aesthetics and furnitures that makes the environment comfortable, gamers do same too. In my opinion, the screen size has little to do with affecting trading, but it such can help one feel more atuned to the environment and easily spot and monitor different trade zones and timelines in one go.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}