{
  "id": "topic_5400568",
  "title": "THANOSMINING",
  "author": "THANOSMINING",
  "created_time": "May 29, 2022, 01:53:05 AM",
  "content": ";)Hello everyone, about the repair of the Avalon hash board, I have shared a tutorial for everyone to refer to, I hope it will be helpful to my friends!It mainly explains how to repair hash board of Canaan Avalon A10 series, suitable for AvalonMiner A1066, A1066pro, A1026, A1046, A1047 and other models.A10 series hash board introduction:1. The positive pole of the power supply and the negative pole of the power supply: connect the positive pole and the negative pole of the power supply;2. JamLink communication: communicate with MM;3. Main chip: ASIC chip.4. Isolated chip unit5. Boost and follower circuithttps://thanosmining.com/u_file/2205/26/photo/Avalon1066102610461047HashBoardRepairTutorial13-54f2.jpgA10 series hash board test fixture introduction (official test fixture):1. Connect the positive and negative poles of the power supply of the hash board;2. Connect the JamLink data cable of the hash board;3. It is recommended to install the tooling bottom plate (insulation);4. MM board with test script program;5. Kosebao adjustable power interface cable;6. Connect the USB to serial port, connect the USB to the computer, and the hash board test information can be read out through the serial port debugging tool.https://thanosmining.com/u_file/2205/26/photo/Avalon1066102610461047HashBoardRepairTutorial14-16c0.jpgTest fixture connection method:1. The main circuit power interface of Gaussian power supply, in which black is the main output negative pole, and red is the main output positive pole;2. Negative interface of the main circuit power supply of the hash board;3. The positive interface of the main circuit power supply of the hash board;4. JamLink data protocol interface of hash board;5. USB to serial port, the interface is defined as:TX=TXDRX=RXDGND=GND6. Gospo power supply 12VSB and IIC interface (2x4 interface).————————————————————Testing method:①Judge the status of the hash board, judge the status of the hash board according to the status of the indicator light of the test fixture, and judge whether it needs repair.A green light indicates that the hash board is healthy and does not require repair.A red light indicates that the hash board is abnormal and needs to be repaired.②Connect the computer screen through the serial port to determine whether there is a problem with the Hash board, first set the serial port software debugging parameters:The serial port debugging tool needs to set the serial port number, and the baud rate is set to 115200, the data bit is 8, and the stop bit is 1.Through the serial port debugging tool, check the LOG information of the hash board running on the computer, as shown in the figure:https://thanosmining.com/u_file/2205/26/photo/Avalon1066102610461047HashBoardRepairTutorial3-0daf.jpgAmong them, the number of asic counts is 120 chip, and the test fixture is on red, indicating that the test loop is not working and needs to be repaired. The 9th item in the above figure + 7 items + 6 items = total item 22, indicating that there are problems with these three indicators , need to be checked and repaired one by one.The following figure is the error code comparison table：https://thanosmining.com/u_file/2205/26/photo/Avalon1066102610461047HashBoardRepairTutorial4-c4e5.jpgError code explanation:1=Failed to enumerate ASIC chip2=Test timeout4=CKL signal error5=RI signal error in gate state6=RI signal error at configured frequency7=ASIC chip BIN information error8=ASIC chip batch number error9=ASIC chip voltage error10=The difference between the maximum and minimum temperature of the ASIC chip is relatively largeThe software can scan the chip, but the chip does not work, the voltage item will display 0, and a comma will appear after each voltage value.If the chip voltage value is not scanned, the software will automatically fill in 0. At this time, it will be automatically divided into 3 strings, and a comma will be automatically added after each 3 values. When repairing, it is necessary to check the adjacent chip at the 0 position, jiyou may be 0 position or the adjacent chip is not working.https://thanosmining.com/u_file/2205/26/photo/Avalon1066102610461047HashBoardRepairTutorial5-a009.jpgHash board voltage test:First of all, it is necessary to test the impedance of the power supply on the Hash board. The resistance values are shown in the following table. If there is a short circuit, you need to check the part of the circuit to see if there is any burnout or welding short circuit. After the impedance test is completed, the power-on test is performed to test the power supply voltage of the entire Hash board. The test position and test voltage value are as follows:https://thanosmining.com/u_file/2205/26/photo/Avalon1066102610461047HashBoardRepairTutorial6-aa00.jpgThe measured position and voltage values are:Test powerTest locationVoltage valueImpedance valueMains supply voltage\"-\" at the black clip&Vcore+11.15V2ΩBoost circuit voltage\"-\" at the black clip & the left end of C39916.28V≥60kΩFollow circuit voltage\"-\" at the black clip & U98 pin412.95V≥400Ω————————————————————ASIC chip detection:If the voltage test passes, you need to test the ASIC chip of the hash board. Take A10 as an example, there are 40 groups of chips connected in series on the Hash board, each group of chips is composed of 3 chips in parallel, each chip includes three power supplies and 4 groups of signals: Vcore, VTOP and VDDIO, the signals are: CKin, Cin, Rin, Din and CKout, Cout, Rout, Dout.Each group of chips is composed of three chips in parallel. The VDDIO and VTOP of each group of chips are powered by 1.8V-LDO and 0.75V-LDO respectively. There will be VDDIO and VTOP test points next to each group of chips, which can be tested Voltage value.As follows:Type - Voltage valueVcore=280mVVDDIO=1.8VVTOP=0.75VSignal test:When there is a problem with the hash board, it is necessary to test the signals of the chips on the hash board and the power supply of IO and TOP. The signals of the chips on the hash board are connected in series, and the signals of each chip are CK, C, R, D, Each chip needs to be tested for output signals.https://thanosmining.com/u_file/2205/26/photo/Avalon1066102610461047HashBoardRepairTutorial7-cc98.jpgThe enlarged picture, the red box is the test point of the ASIC chip:https://thanosmining.com/u_file/2205/26/photo/Avalon1066102610461047HashBoardRepairTutorial12-435d.jpg————————————————————Signal transmission direction of Avalon Hash board:Each group of signals includes four signals: CK, D, R, and C:CK: the working clock of the chip, the frequency is 25MHz;D: The transmission data signal of the chip;R: the reset pin of the chip;C: The transmission clock signal of the chip.https://thanosmining.com/u_file/2205/26/photo/Avalon1066102610461047HashBoardRepairTutorial8-278d.jpg———————————————————Test the waveform with an oscilloscope to determine whether the chip is abnormalThe oscilloscope settings are:AC position;The amplitude is set to 1.00V/div;The frequency is set to 500ns/div.The waveform of the CK signal, the frequency is 25MHz, the amplitude is 1.5V-1.8Vhttps://thanosmining.com/u_file/2205/26/photo/Avalon1066102610461047HashBoardRepairTutorial9-b69d.jpgC waveform, frequency 5MHz, amplitude 1.5V-1.8Vhttps://thanosmining.com/u_file/2205/26/photo/Avalon1066102610461047HashBoardRepairTutorial10-de26.jpgD waveform, the amplitude is 1.5V-1.8Vhttps://thanosmining.com/u_file/2205/26/photo/Avalon1066102610461047HashBoardRepairTutorial11-0060.jpgFor the chip with abnormal waveform, please use a multimeter to test its voltage and resistance value. When it is determined that the ASIC chip is damaged, please replace the ASIC chip by yourself.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400568",
  "comments": [
    {
      "author": "Ray Garraty",
      "created_time": "June 22, 2022, 09:38:05 AM",
      "body": "QuoteFor the chip with abnormal waveform, please use a multimeter to test its voltage and resistance valueCan you provide resistance values for A3205 chip?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}