{
  "id": "topic_5473579",
  "title": "mv1986",
  "author": "mv1986",
  "created_time": "November 10, 2023, 08:19:48 AM",
  "content": "Von Email: cryptopia-offer@mail.principalityofcogito.comQuoteImportant UpdateDear Cryptopia Account HolderYou will have received recently an offer from Cogito to buy your coin holding in Cryptopia. Following a few questions through our help desk we have put together a few key answers to questions.1. The agreement to purchase your coins for C500 Cog is a purchase regardless of your coin value under $500. So if you have $499 worth of coins you get C500, if you have $2 worth of coins you get C500. So you have nothing to lose.2. If you have more than $500 worth of coins , you will receive C500 straight away and then a top up of Cog once we get the reconciled value from the liquidator.3. You don't have to have successfully completed the liquidator’s verification process to be able to accept the offer.4. Cog is a digital currency that can only be used in the Cogito economy. It is not able to be converted to fiat or moved to any exchange. The Cogito Metaverse is growing every day with many opportunities being developed all the time. Shortly there will be investments available; and in many countries there is a growing number of businesses accepting Cog.5. The Cogito offer is specifically structured for those people who may have such a small amount it is not worth the effort or the verification process was too hard for a variety of reasons.6. We are in court in New Zealand for four days starting 13th November to sort the distribution of coins and get some clarity on the process of the Cogito agreement. So time is against everyone, if you are going to accept now would be a good time to do it.7. We believe now Cogito is the single largest coin holder by value and so we do have strong standing in the courts in New Zealand.8. If you accept the offer and change your mind you have a 7 day cooling off period.The link to selling your coins is here : https://principalityofcogito.com/cryptopiaformRegardsMartin Braine LLBIn House LawyerPrincipality of CogitoPs : If you have any questions please free to contact us once logged in to CogitoMetaverseIch habe diese ominöse Email erhalten und dachte beim ersten Lesen, dass das zumindest orthografisch mehr oder weniger hinhaut und nicht unbedingt von irgendeinem russischen Hacker stammen muss. Nun muss ich dazu sagen, dass ich gerade nicht die Motivation habe, da irgendwas nachzulesen und in Erfahrung zu bringen, was das überhaupt sein soll. Falls es hier also jemanden gibt, der da irgendwie irgendwas weiß, dann lasst es uns mal wissen.Die Email-Adresse klingt natürlich höchst vertrauenswürdig!  Bisschen wie \"cryptopia-offer@kingofnigeria.com\"Hat noch irgendwie die Nachricht bekommen?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473579",
  "comments": [
    {
      "author": "kalihunter",
      "created_time": "November 10, 2023, 12:46:29 PM",
      "body": "I also get such e-mail. I think its fake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "November 10, 2023, 05:28:51 PMLast edit: November 10, 2023, 06:31:22 PM by Lafu",
      "body": "Quote from: mv1986 on November 10, 2023, 08:19:48 AMFalls es hier also jemanden gibt, der da irgendwie irgendwas weiß, dann lasst es uns mal wissen.Hat noch irgendwie die Nachricht bekommen? Eventuell auch mal die Augen offen halten und in den entsprechenden Threads mehr lesen !Habe bezüglich dies und des neuen Updates von Cryptopia bereits am 3 November in den dafür geeigneten Cryptopia Topic geschrieben.Kann hier alles nach gelesen werden : Informationen und News für Cryptopia Users !Eigentlich ist es unnötig deswegen einen neuen Topic zu eröffnen.Die Email ist eine Scam masche und es handelt sich um den selben Typ der auch schon bei Cryptopia Rescue dabei war.Kann aber alles in meinem Topic nachgelesen werde.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mv1986",
      "created_time": "November 10, 2023, 08:12:02 PM",
      "body": "Quote from: Lafu on November 10, 2023, 05:28:51 PMQuote from: mv1986 on November 10, 2023, 08:19:48 AMFalls es hier also jemanden gibt, der da irgendwie irgendwas weiß, dann lasst es uns mal wissen.Hat noch irgendwie die Nachricht bekommen? Eventuell auch mal die Augen offen halten und in den entsprechenden Threads mehr lesen !Habe bezüglich dies und des neuen Updates von Cryptopia bereits am 3 November in den dafür geeigneten Cryptopia Topic geschrieben.Kann hier alles nach gelesen werden : Informationen und News für Cryptopia Users !Eigentlich ist es unnötig deswegen einen neuen Topic zu eröffnen.Die Email ist eine Scam masche und es handelt sich um den selben Typ der auch schon bei Cryptopia Rescue dabei war.Kann aber alles in meinem Topic nachgelesen werde.Das war nicht, weil ich irgendwas in irgendeiner Weise überlese oder ignoriere, sondern einfach, weil es von dem Zeitpunkt des Erhalts der Email den Weg hierher finden sollte. Ich schätze Deinen Einwand. Für alle Informationen: Informationen und News für Cryptopia Users !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}