{
  "id": "topic_5532956",
  "title": "Becassine",
  "author": "Becassine",
  "created_time": "February 22, 2025, 02:51:32 AM",
  "content": "I haven't seen anything elsewhere on the forum about the phenomenal Bybit hack that has just taken place. The hackers are said to be from the Lazarus group, and they are allegedly reselling the fruit of the thefts. Evidently a massive withdrawal of cryptos is taking place right now, while Bybit's funds would be sufficient to cover the losses. You can follow this infernal saga on X.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5532956",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "February 22, 2025, 02:53:35 AM",
      "body": "People have been discussing about it on this forum many hours agohttps://bitcointalk.org/index.php?topic=5532906.msg65090671#msg65090671",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "headingnorth",
      "created_time": "February 22, 2025, 03:50:19 AM",
      "body": "Ethereum getting hacked again for the ten thousandth time is a very normal thing for shitcoins. And yet there are still plenty of idiots buying it up. Altcoins are a security nightmare and are the hackers paradise, but they will never run out of victims.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "February 22, 2025, 06:10:32 AM",
      "body": "Quote from: headingnorth on February 22, 2025, 03:50:19 AMEthereum getting hacked again for the ten thousandth time is a very normal thing for shitcoins.  Ethereum is not a shitcoin. Don’t try to change the definition of a shitcoin. You may not like ethereum but it’s definitely not comparable to actual shitcoins.Besides, it’s ByBit that got hacked not ethereum itself. They just got accessed to a cold wallet of bybit and took ethereum and transferred it somewhere else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "February 22, 2025, 06:15:59 AM",
      "body": "Quote from: kotajikikox on February 22, 2025, 06:10:32 AMQuote from: headingnorth on February 22, 2025, 03:50:19 AMEthereum getting hacked again for the ten thousandth time is a very normal thing for shitcoins.  Ethereum is not a shitcoin. Don’t try to change the definition of a shitcoin. You may not like ethereum but it’s definitely not comparable to actual shitcoins.Besides, it’s ByBit that got hacked not ethereum itself. They just got accessed to a cold wallet of bybit and took ethereum and transferred it somewhere else.Ethereum is 100% a shitcoin.  Everything other than Bitcoin is.  If it doesn't have a fixed supply, it is a shitcoin.  If it doesn't have Proof of Work.  Shitcoin.  Saying it wasn't Ethereum that got hacked shows you're missing the entire point.  The Ethereum Foundation is voting whether or not to rollback their blockchain again.  It's highly likely we're going to end up with a 3rd Ethereum chain.  I hope that President Trump is watching all this unfold and realizes what a terrible idea it is for the United States to buy anything other than BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "headingnorth",
      "created_time": "February 22, 2025, 06:51:13 AM",
      "body": "Quote from: kotajikikox on February 22, 2025, 06:10:32 AMQuote from: headingnorth on February 22, 2025, 03:50:19 AMEthereum getting hacked again for the ten thousandth time is a very normal thing for shitcoins.  Ethereum is not a shitcoin. Don’t try to change the definition of a shitcoin. You may not like ethereum but it’s definitely not comparable to actual shitcoins.Besides, it’s ByBit that got hacked not ethereum itself. They just got accessed to a cold wallet of bybit and took ethereum and transferred it somewhere else.Ok then, ethereum is just the platform from where countless memecoins/shitcoins and NFTs were launched from. As for ethereum itself, let's take a look. To me the definition of a shitcoin is very simple: Shitcoin has a founder Shitcoin has a ruling foundationShitcoin had a pre-mineShitcoin was started with venture capitalShitcoin is controlled by an executive teamShitcoin is controlled by a CEOShitcoin is controlled by insidersShitcoin has a roadmap and marketing teamShitcoin has a websiteShitcoin has a paid dev teamShitcoin supply is unlimited or near unlimitedGuess what? Ethereum meets all the above criteria! Hence it is undeniably a shitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "February 22, 2025, 10:08:46 AM",
      "body": "I want to share my thoughts for those who may not be aware.I believe the biggest mistake made by the founder of Ethereum was transitioning from proof of work (PoW) to proof of stake (PoS). In my opinion, this decision has been detrimental to the cryptocurrency space.If Ethereum had remained a PoW system, I think the price wouldn't be as stagnant as it is now. Additionally, the blockchain would be even more secure than it currently is.It's disheartening to see that, after Satoshi Nakamoto set a solid example for future founders, many have chosen to pursue different paths in order to stand out. However, nothing surpasses the principles of proof of work and decentralization.Without these two elements, I believe a project lacks value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jstyler",
      "created_time": "February 22, 2025, 10:09:59 AM",
      "body": "i actually think the bybit hack is a symptom of a larger issue, proof of stake's lack of decentralization and vulnerability to 51% attacks is a major problem, we need to learn from our mistakes and stick to the tried and true PoW consensus algorithm",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "February 22, 2025, 10:33:34 AM",
      "body": "Crypto market doesn’t seem to care too much, a slight dip but Bitcoin is still in the same range it’s been in for a couple of weeks. Nothing to be concerned about & I feel we will start to move up soon & leave this $95,000 to $100,000 range behind. Strong hands always win in the end, eyes on the prize.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jstyler",
      "created_time": "February 22, 2025, 10:34:16 AM",
      "body": "not surprised bybit got hacked by lazarous, they've been quiet for a while, had this coming. market doesn't care, bitcoin still strong, bulls stay calm, strong hands win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bSpend",
      "created_time": "February 22, 2025, 11:17:48 AM",
      "body": "Quote from: Becassine on February 22, 2025, 02:51:32 AMI haven't seen anything elsewhere on the forum about the phenomenal Bybit hack that has just taken place. The hackers are said to be from the Lazarus group, and they are allegedly reselling the fruit of the thefts. Evidently a massive withdrawal of cryptos is taking place right now, while Bybit's funds would be sufficient to cover the losses. You can follow this infernal saga on X.  You could have atleast pointed your readers to the bybit's official handle on X for them to begin from there, some one who's not active or does not have crypto X may find it hard to locate this news.But anyways, it's a very sad event for bybit, and I am actually happy the hackers went for bybit, knowing fully well they are capable of containing the loss, for if it had been any other exchange aside Binance and Coinbase, we may likely be waving goodbye to a crypto business by now, while users will be left to count their loses.But again, still a very unfortunate incident, and I pray bybit is able to recoup their loses soon, I have some funds on the exchange, glad they choose not to let the incident affect their users ❤️",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "February 22, 2025, 12:22:45 PM",
      "body": "These hackers just need a small loop hole and they will penetrate into what seem to have tight security. I don't expect that it would be possible to hack a strong exchange like bybit, at least with the evident of what has happened to other exchange that failed due to hack incident, bybit should be smart enough to take every precautions that would have prevented this from happening.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Josefjix",
      "created_time": "February 22, 2025, 12:47:12 PM",
      "body": "Quote from: Dr.Bitcoin_Strange on February 22, 2025, 12:22:45 PMThese hackers just need a small loop hole and they will penetrate into what seem to have tight security. I don't expect that it would be possible to hack a strong exchange like bybit, at least with the evident of what has happened to other exchange that failed due to hack incident, bybit should be smart enough to take every precautions that would have prevented this from happening. It can't be possible to always stay vigilant no matter what, staff and devs are vulnerable to any external attacks from hackers coming in form of business negotiations or something similar, you can't always detect and know it immediately because it's hard to be extra careful.Binance and other top tier exchange has faced many hack challenges, so Bybit can't be exempted because they have lots of workers passing information knowingly or unknowingly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "February 22, 2025, 01:06:55 PM",
      "body": "Today it's the Lazarus group, tomorrow it is another hacking group. Discussing this with anyone, I'd say it is not about the group because there will always be these hackers and scammers. The focus should be on yourself and what you do with the cyber security information you know and how you protect yourself. This is not the first time we have heard it said that not your keys, not your coins or don't save your crypto in a CEX. Focus on yourself and your security online.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "February 22, 2025, 01:48:23 PM",
      "body": "Quote from: OgNasty on February 22, 2025, 06:15:59 AMQuote from: kotajikikox on February 22, 2025, 06:10:32 AMQuote from: headingnorth on February 22, 2025, 03:50:19 AMEthereum getting hacked again for the ten thousandth time is a very normal thing for shitcoins.  Ethereum is not a shitcoin. Don’t try to change the definition of a shitcoin. You may not like ethereum but it’s definitely not comparable to actual shitcoins.Besides, it’s ByBit that got hacked not ethereum itself. They just got accessed to a cold wallet of bybit and took ethereum and transferred it somewhere else.Ethereum is 100% a shitcoin.  Everything other than Bitcoin is.  If it doesn't have a fixed supply, it is a shitcoin.  If it doesn't have Proof of Work.  Shitcoin.  Saying it wasn't Ethereum that got hacked shows you're missing the entire point.  The Ethereum Foundation is voting whether or not to rollback their blockchain again.  It's highly likely we're going to end up with a 3rd Ethereum chain.  I hope that President Trump is watching all this unfold and realizes what a terrible idea it is for the United States to buy anything other than BTC.Agree and I don't care much about what going to happen on Bitcoin rather than thinking about Ethereum. Since price movement of Bitcoin is important. And we can see that there's no much big effect happen so we can say that everything is fine despite of those hacking incident happen with Bybit.Don't know if there's need to change back from their original network but for sure Bitcoin people and those voting could help the ecosystem. But lets see what will happen on those actions they do since maybe we can see some changes of sentiments and people might think that Ethereum is not a shitcoin but rather a good alternative one. Its bad idea for them to buy different alts and they better focus on Bitcoin to eliminate those huge risk to lose a lot of money from possible fast dump on shitcoin's scene.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "February 22, 2025, 02:48:56 PM",
      "body": "When the tension of this hack would have risen more would have been if peradventure Bybit's owner had said that they couldn't cover the stolen money of $1.5b from the Lazarus group for the time being. Time is what they needed to do that. So far nothing of such has been said, except the Bybit CEO promising to cover the losses, no cause for alarm to think otherwise because Bybit exchange has everything in control as the identity of one of the Lazarus group has been revealed by the FBI, as he is being declared wanted by FBI Quote from: virasog on February 22, 2025, 09:41:55 AM",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "February 22, 2025, 03:01:09 PM",
      "body": "Quote from: Charles-Tim on February 22, 2025, 02:53:35 AMPeople have been discussing about it on this forum many hours agohttps://bitcointalk.org/index.php?topic=5532906.msg65090671#msg65090671Another thread about Bybit hack.Bybit ETH multisig cold wallet got hacked.Maybe there will be more threads about Bybit from people who did not search, did not read, but only want to create their own threads for discussion on something trendy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zadicar",
      "created_time": "February 22, 2025, 03:21:35 PM",
      "body": "Quote from: Marykeller on February 22, 2025, 02:48:56 PMWhen the tension of this hack would have risen more would have been if peradventure Bybit's owner had said that they couldn't cover the stolen money of $1.5b from the Lazarus group for the time being. Time is what they needed to do that. So far nothing of such has been said, except the Bybit CEO promising to cover the losses, no cause for alarm to think otherwise because Bybit exchange has everything in control as the identity of one of the Lazarus group has been revealed by the FBI, as he is being declared wanted by FBI Quote from: virasog on February 22, 2025, 09:41:55 AMI have seen this post by FBI on which there is 3 of these hackers been by FBI, on which i could say that they are that fast now on making up such action. Wondering on how these hackers been that directly been traced up. Usually these exchange hacks incidents do really have on the same patterns at the time where bull run cycle is nearby or happening on which basing up into those previous cycle or runs then we arent just that seeing one but possible multiple exchange hacks incidents on which this is really that not shocking anymore. These are the common signs that we are near bull run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "February 22, 2025, 03:54:09 PM",
      "body": "Quote from: Becassine on February 22, 2025, 02:51:32 AMI haven't seen anything elsewhere on the forum about the phenomenal Bybit hack that has just taken place. The hackers are said to be from the Lazarus group, and they are allegedly reselling the fruit of the thefts. Evidently a massive withdrawal of cryptos is taking place right now, while Bybit's funds would be sufficient to cover the losses. You can follow this infernal saga on X.  I sympathize with everyone who was a victim but it becomes another lesson to those who have refused to learn that storing on CEX is bad, and to those who also have no idea about it because of their newness to cryptocurrency. This is very discouraging to those who are not strong willed and will likely quit cryptocurrency with this kind of news accepting to stay with traditional banks because they have a place they can go to complain when thinmgs like this happen to them. I'm grateful for the person who introduced me to cryptocurrency because I was well warned about all this both from the person and from members of this forum. I think guidance is a very important side of learning cryptocurrency and for anybody new in cryptocurrency who we introduce to it we should take it a personal responsibility to make sure that they do not fall victim to this kind of issues by educating them properly on how to store their cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "February 22, 2025, 04:39:37 PM",
      "body": "I read this news just now in tradingview this could be the reason why the price drop a lot but I was also expecting for price drop around $99k.The news is all about ETH but why some people pointing to BTC price crash recently?It should be Ethereum only who will suffer much about this recent hacked and as we can see BTC still dominates them.What I think is its just a FUD to make sure the price around $99k would crash. Look at the pattern on the chart.And it seems that Bybit is fine with what happened, and they can refund all stolen funds to their customers 1:1.The weird part is how? Look how Bybit earn from their trading site? They only earn from trading fees, which is relatively small in comparison to the stolen amount of 1.4 billion. Sorry but I feel this is FUD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}