{
  "id": "topic_5427280",
  "title": "tech30338",
  "author": "tech30338",
  "created_time": "December 09, 2022, 12:27:20 AM",
  "content": "Isang Senador ang nagsabi na isang Casino ang crypto, dahil sa mga investment daw na naluluge or tinataya ng mga ito at kapag nagkamali ay magsasara, maaring hindi pa masyadong naiintindihan ng butihing senador ang kanyang sinasabi, pero para sa akin isa itong investment na kung saan meron talaga itong risk lahat naman ng investment ganun, kasi pagsinabi mo na wala itong risk at malaki ang return iyon ay isang scam, ikinumpara pa nya ito sa FTX kung saan mababalitaan natin na ito ay naluge.kaya nga sinabi ng mga matagal na sa crypto invest at your own risk diba sana wag sya maglabas ng ganetong statement kasi nakakasira ito, lalo na at di naman ganun kalalim ang kaalaman sa blockchain, anu ang masasabi ninyo?ito ang link ng kanyang pahayag: https://www.gmanetwork.com/news/money/economy/853335/gatchalian-warns-uninformed-vs-investing-in-crypto-calls-it-a-glorified-casino/story/?fbclid=IwAR2ayKDrXJNZadP27zPiUyWhtpi2kDNUDnlaPNX886EF-uCYgOHgiuxHEvI",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5427280",
  "comments": [
    {
      "author": "blockman",
      "created_time": "December 09, 2022, 12:54:28 AM",
      "body": "Kulang siya sa kaalaman sa crypto kaya ganyan yung impression niya. Wala namang bago sa tingin ko sa naiisip niya kasi ang normal lang na ganyan ang tingin niya sa crypto kasi may risk, nagagamit sa mga scam at yung sikat pa na issue ngayon sa FTX. Pero sana, mas lawakan pa niya ang research niya kasi ganyan din naman ang pera natin na peso, nagagamit sa scam, sa casino at wag niya sana i-generalize na ang crypto ay isang exchange tulad ng comparison niya sa FTX kasi magkaiba yun. Parang sa atin lang, Philippine peso saka stock market exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tech30338",
      "created_time": "December 09, 2022, 01:51:21 AM",
      "body": "Quote from: blockman on December 09, 2022, 12:54:28 AMKulang siya sa kaalaman sa crypto kaya ganyan yung impression niya. Wala namang bago sa tingin ko sa naiisip niya kasi ang normal lang na ganyan ang tingin niya sa crypto kasi may risk, nagagamit sa mga scam at yung sikat pa na issue ngayon sa FTX. Pero sana, mas lawakan pa niya ang research niya kasi ganyan din naman ang pera natin na peso, nagagamit sa scam, sa casino at wag niya sana i-generalize na ang crypto ay isang exchange tulad ng comparison niya sa FTX kasi magkaiba yun. Parang sa atin lang, Philippine peso saka stock market exchange.Yan din sir ang masasabi ko sa kanya medyo kulang pa ang information na alam nya about crypto, dahil sa mga ganyang paglalahad minsan kaya napapasama din ang crypto sa mata ng madaming tao, oo ginagamit din ang crypto for casino pero as payment, ganun din naman ang pera ang pagkakaiba lang nahahawakan ung pera natin, so tingin ko kailangan nya muna na pagaralang mabuti bago siya magbigay ng ganyang pagsapubliko para naman sa kapakanan ng lahat din",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "December 10, 2022, 04:49:45 AM",
      "body": "Quote from: tech30338 on December 09, 2022, 01:51:21 AMQuote from: blockman on December 09, 2022, 12:54:28 AMKulang siya sa kaalaman sa crypto kaya ganyan yung impression niya. Wala namang bago sa tingin ko sa naiisip niya kasi ang normal lang na ganyan ang tingin niya sa crypto kasi may risk, nagagamit sa mga scam at yung sikat pa na issue ngayon sa FTX. Pero sana, mas lawakan pa niya ang research niya kasi ganyan din naman ang pera natin na peso, nagagamit sa scam, sa casino at wag niya sana i-generalize na ang crypto ay isang exchange tulad ng comparison niya sa FTX kasi magkaiba yun. Parang sa atin lang, Philippine peso saka stock market exchange.Yan din sir ang masasabi ko sa kanya medyo kulang pa ang information na alam nya about crypto, dahil sa mga ganyang paglalahad minsan kaya napapasama din ang crypto sa mata ng madaming tao, oo ginagamit din ang crypto for casino pero as payment, ganun din naman ang pera ang pagkakaiba lang nahahawakan ung pera natin, so tingin ko kailangan nya muna na pagaralang mabuti bago siya magbigay ng ganyang pagsapubliko para naman sa kapakanan ng lahat dinOk lang yung ganyang ideya na meron siya kung ano ang crypto at tingin ko maganda naman hangarin niya. Yun nga lang, need pa niya mag research para mas lalo pa siyang magkaroon ng background kahit sa pinakasimple lang pagdating sa crypto.Kasi mami-mislead niya ang mga tao kaya hindi rin maganda na kapag konti palang knowledge mo tapos magmumukhang expert at tingin mo alam mo na lahat, lalo na public figure siya at senador pa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jemzx00",
      "created_time": "December 11, 2022, 07:51:20 PM",
      "body": "Quote from: blockman on December 10, 2022, 04:49:45 AMQuote from: tech30338 on December 09, 2022, 01:51:21 AMYan din sir ang masasabi ko sa kanya medyo kulang pa ang information na alam nya about crypto, dahil sa mga ganyang paglalahad minsan kaya napapasama din ang crypto sa mata ng madaming tao, oo ginagamit din ang crypto for casino pero as payment, ganun din naman ang pera ang pagkakaiba lang nahahawakan ung pera natin, so tingin ko kailangan nya muna na pagaralang mabuti bago siya magbigay ng ganyang pagsapubliko para naman sa kapakanan ng lahat dinOk lang yung ganyang ideya na meron siya kung ano ang crypto at tingin ko maganda naman hangarin niya. Yun nga lang, need pa niya mag research para mas lalo pa siyang magkaroon ng background kahit sa pinakasimple lang pagdating sa crypto.Kasi mami-mislead niya ang mga tao kaya hindi rin maganda na kapag konti palang knowledge mo tapos magmumukhang expert at tingin mo alam mo na lahat, lalo na public figure siya at senador pa.Para sakin yung pahayag about sa crypto ay may magandang hangarin naman medjo pangit lang kung paano nya sinabi. Sa pagkakaintindi ko, generally ni-warn nya yung mga new investors sa pagpasok sa crypto industry lalo na kung wala kang definite background knowledge or any research tungkol dito. Yung pag-compare nya naman sa Crypto as Gambling ay slightly appropriate naman dahil sa sobrang volatile ng kahit anong cryptocurrency kaya yung mga gantong klaseng investment ay na-iinterpret as gambling dahil sa sobrang laking risk na nakapaloob sa paginvest dito. Still, Bitcoin o kahit anong crypto ay hindi gambling rather investment sila na sobrang volatile at too risky lalo na sa mga baguhan pa lang.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chaser15",
      "created_time": "December 11, 2022, 09:42:28 PM",
      "body": "Quote from: blockman on December 10, 2022, 04:49:45 AMOk lang yung ganyang ideya na meron siya kung ano ang crypto at tingin ko maganda naman hangarin niya. Yun nga lang, need pa niya mag research para mas lalo pa siyang magkaroon ng background kahit sa pinakasimple lang pagdating sa crypto.Kasi mami-mislead niya ang mga tao kaya hindi rin maganda na kapag konti palang knowledge mo tapos magmumukhang expert at tingin mo alam mo na lahat, lalo na public figure siya at senador pa.Kabayan di para mag-komento ng ano-ano yan si Sen. Win ng di alam ang sinasabi niya. Di ako panatiko niya o isang supporter pero isa yan sa mga matatalinong Senador. Di yan para magbigay lang ng haka-haka sa isang official na panayam. Tama naman sya, bakit papasok sa crypto ang isang tao di naiintindihan ang pinapasok niya? In general naman most tokens ay crap. Di naman sya nagsalita ng negative about Bitcoin specifically. Mas maganda ng ganyan ang sabihin niya kasi kung seryoso ang tao na pasukin ang crypto, malalaman din nila thru proper research kung ano talaga ang puwede nilang iexpect sa pag-invest sa crypto.Nakakasira sa crypto iyong statement niya? Para niyo na rin sinabi na walang sariling pag-iisip ang mga tao. Teka, ilan beses na ba nagkaroon ng negative image ang crypto dito sa bansa? Ang dami na diba pero nag grow pa rin ang crypto adoption dito sa atin. Tama lang na ang makiinvolve  lang dito sa crypto eh iyong naiintindihan ang pinapasok nila.Sa last statement niya, malinaw ang sabi niya na wag papasok kung di naiintidihan ang mga bagay-bagay. Wala siyang sinabing wag mag-invest sa crypto in general na tipong hate niya ang crypto to the point na aggressive sya na iconsider ang crypto.Si OP naman kasi patola. Dapat ang title ng topic is, Sen. Gatchalian nagbabala sa pagpasok ng pera sa crypto or something na malapit dyan. Di naman highlight ng statement niya iyong crypto as a type of casino. Lawakan ang isip.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lienfaye",
      "created_time": "December 12, 2022, 01:18:59 AM",
      "body": "Quote from: Jemzx00 on December 11, 2022, 07:51:20 PMPara sakin yung pahayag about sa crypto ay may magandang hangarin naman medjo pangit lang kung paano nya sinabi. Sa pagkakaintindi ko, generally ni-warn nya yung mga new investors sa pagpasok sa crypto industry lalo na kung wala kang definite background knowledge or any research tungkol dito. Yung pag-compare nya naman sa Crypto as Gambling ay slightly appropriate naman dahil sa sobrang volatile ng kahit anong cryptocurrency kaya yung mga gantong klaseng investment ay na-iinterpret as gambling dahil sa sobrang laking risk na nakapaloob sa paginvest dito. Still, Bitcoin o kahit anong crypto ay hindi gambling rather investment sila na sobrang volatile at too risky lalo na sa mga baguhan pa lang. Well, para sakin may point naman si Senator kasi anything na wala kang assurance sa outcome ay similar sa gambling. Ang crypto ay speculative asset, risky talaga kaya hindi nababagay sa mga taong walang alam. Hindi lang maganda yung pagkahalintulad nya sa casino at sa FTX exchange, kasi kahit sino na makabasa ng sinabi nya eh madidiscourage ng mag invest sa crypto dahil sa isa itong glorified casino ayon sa kanya.Kaya importante talaga na alam mo ang pinapasok mo at nagsi search tayo kung ano ang totoo. Kasi kung mag rely ka lang sa sabi-sabi ng iba eh hindi mo malalaman ang totoo kapag nag invest ka sa Bitcoin (o crypto in general).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "December 30, 2022, 02:48:23 PM",
      "body": "Sa pagkaka intindi ko sa statement nya ay sinabi nyang glorified casino or kagaya ng isang casino ang crypto dahil sa mga recent downfall scenario na nangyari sa crypto kagaya ng FTX at Luna which is my point naman sya as non-crypto user upang mabigyan ng babala yung mga bago palang papasok sa crypto. Hindi natin maikakaila na malaki talaga ang risk sa crypto investment dahil nga hindi ito regulated at karamihan sa mga developer ay anonymous kaya madali silang nakaka exit scam.I think fair naman yung statement nya considering na nagbibigay lang sya ng babala sa mga newbie since law maker sya ng Pilipinas. Pero clearly na wala talaga silang alam sa crypto technicality at nagbabase lang sa mga news since tamad silang magresearch bago magbigaynng comment para magbigay ng advice sa public. In short mema lang para masabing nagtra2baho sila.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "December 30, 2022, 07:35:28 PM",
      "body": "Quote from: Coin_trader on December 30, 2022, 02:48:23 PMI think fair naman yung statement nya considering na nagbibigay lang sya ng babala sa mga newbie since law maker sya ng Pilipinas. Pero clearly na wala talaga silang alam sa crypto technicality at nagbabase lang sa mga news since tamad silang magresearch bago magbigaynng comment para magbigay ng advice sa public. In short mema lang para masabing nagtra2baho sila.Maaaring makasama ito para sa atin kase yung mga legislator naten ay wala pang sapat na kaalaman about crypto at baka gumawa sila ng batas basta basta without understanding kung ano ba talaga ang crypto. Ok magbigay ng babala pero sana magkaroon den sila ng plano to educate ang mga pinoy kase isa ren ito sa dahilan kung bakit marami paren ang nabibiktima mga mga scam project. Sana maging active pa si BSP when it comes to crypto kase sila naman talaga ang nakakaalam ng crypto at kung makakabuti ba ito para sa bansa naten.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "carlisle1",
      "created_time": "January 01, 2023, 08:37:32 PM",
      "body": "Quote from: Johnyz on December 30, 2022, 07:35:28 PMQuote from: Coin_trader on December 30, 2022, 02:48:23 PMI think fair naman yung statement nya considering na nagbibigay lang sya ng babala sa mga newbie since law maker sya ng Pilipinas. Pero clearly na wala talaga silang alam sa crypto technicality at nagbabase lang sa mga news since tamad silang magresearch bago magbigaynng comment para magbigay ng advice sa public. In short mema lang para masabing nagtra2baho sila.Maaaring makasama ito para sa atin kase yung mga legislator naten ay wala pang sapat na kaalaman about crypto at baka gumawa sila ng batas basta basta without understanding kung ano ba talaga ang crypto. Ok magbigay ng babala pero sana magkaroon den sila ng plano to educate ang mga pinoy kase isa ren ito sa dahilan kung bakit marami paren ang nabibiktima mga mga scam project. Sana maging active pa si BSP when it comes to crypto kase sila naman talaga ang nakakaalam ng crypto at kung makakabuti ba ito para sa bansa naten.Sang ayon ako sa sinabi mo na meron talagang impact itong statement na to dahil nga mambabatas sya at yung mga taong katulad nya na hindi pa ganun kalawak ang kaalaman sa crypto eh mag iisip din na kagaya nya.Kailangan talaga ang BSP na makialam dito lalo na sila naman talaga ang meron kaalaman kahit kaunti patungkol sa industrya ng crypto.Sa ngayon, dapat mas maging masinop sa pera ang mga newbies, hindi talaga natin alam san manggagaling ang mga scammers na gagamitinang crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "January 01, 2023, 09:36:45 PM",
      "body": "Magiging gambling lang ito once na pumasok ka dito ng walang alam and with that statement, mukhang wala pa syang alam masyado sa cryptocurrency at nakakabahala ito. Kung sa tingin nila na isa itong casino at sugal, baka ito pa ang maging dahilan para paghigpitan nila ang mga Pinoy to transact using cryptocurrency. Sana ay mapalawak pa ang kaalaman ni Sen. Gatchalian para naman maiwasan ang ganitong misenterpretation sa cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "January 01, 2023, 11:03:23 PM",
      "body": "Mukhang iba ang pagkakaintindi ni Sen. Gatchalian sa cryptocurrency ah.  Medyo nakakatawa dahil isipin mo isa siya tao na may mataas na pinag-aralan, at hindi man lang nya madifferenctiate ang pagkakaiba ng casino at cryptocurrency.  I got the point where he is heading pero mali naman yata iyong term na ginamit nya to describe cryptocurrency.  Pwede pang sabihin nya na ang investment sa cryptocurrency ay isang tulad ng pagsusugal, but to labe cryptocurrency as casino... mukha yatang to the extreme na ang pageexagerate niya to the point na wala ng sense ang sinasabi nya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peter0425",
      "created_time": "January 10, 2023, 05:25:38 AM",
      "body": "Quote from: tech30338 on December 09, 2022, 12:27:20 AMIsang Senador ang nagsabi na isang Casino ang crypto, dahil sa mga investment daw na naluluge or tinataya ng mga ito at kapag nagkamali ay magsasara, maaring hindi pa masyadong naiintindihan ng butihing senador ang kanyang sinasabi, pero para sa akin isa itong investment na kung saan meron talaga itong risk lahat naman ng investment ganun, kasi pagsinabi mo na wala itong risk at malaki ang return iyon ay isang scam, ikinumpara pa nya ito sa FTX kung saan mababalitaan natin na ito ay naluge.kaya nga sinabi ng mga matagal na sa crypto invest at your own risk diba sana wag sya maglabas ng ganetong statement kasi nakakasira ito, lalo na at di naman ganun kalalim ang kaalaman sa blockchain, anu ang masasabi ninyo?ito ang link ng kanyang pahayag: https://www.gmanetwork.com/news/money/economy/853335/gatchalian-warns-uninformed-vs-investing-in-crypto-calls-it-a-glorified-casino/story/?fbclid=IwAR2ayKDrXJNZadP27zPiUyWhtpi2kDNUDnlaPNX886EF-uCYgOHgiuxHEvIMalaya syang sabihin kahit anong gusto nya lalo nat medyo nagpapasikat yong senador dahil sa planong pag angat ng posisyon sa susunod na eleksyon , tama din naman na magbigay sya ng warning basta wag lalabas na sinisiraan nya ang crypto market dahil madami tayong mga tataliwas sa pangarap nyang maluklok sa mataas.noon pananaw ko din na paang sugal ang crypto investment pero now na nawala kona ang pagiging greed sa kikitain?pwede na nating sabihin na hindi talaga to sugal instead dapat lang may kaalaman ka at hindi buwaya sa kitaan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oasisman",
      "created_time": "January 21, 2023, 07:43:22 AM",
      "body": "Quote from: Coin_trader on December 30, 2022, 02:48:23 PMI think fair naman yung statement nya considering na nagbibigay lang sya ng babala sa mga newbie since law maker sya ng Pilipinas. Pero clearly na wala talaga silang alam sa crypto technicality at nagbabase lang sa mga news since tamad silang magresearch bago magbigaynng comment para magbigay ng advice sa public. In short mema lang para masabing nagtra2baho sila.Very unfortunate but true yan bro. Pero you cannot properly warn the public lalo na pag wala kang alam kung ano talaga ang cryptocurrency. Generally kasi, pag sinabing crypto unang una pumapasok sa isip nila is investment scam. Well, dahil na rin sa mga pinag babalita dati na mga scammers at ang ginagamit nilang dahilan was cryto/Bitcoin trading which was not true, dahil yung ginagawa talaga ng mga taong yun was ponzi scheme and was not actually trading. At yung huling sentence bro is also very very true lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "carlisle1",
      "created_time": "January 21, 2023, 08:28:52 AM",
      "body": "Quote from: Oasisman on January 21, 2023, 07:43:22 AMQuote from: Coin_trader on December 30, 2022, 02:48:23 PMI think fair naman yung statement nya considering na nagbibigay lang sya ng babala sa mga newbie since law maker sya ng Pilipinas. Pero clearly na wala talaga silang alam sa crypto technicality at nagbabase lang sa mga news since tamad silang magresearch bago magbigaynng comment para magbigay ng advice sa public. In short mema lang para masabing nagtra2baho sila.Very unfortunate but true yan bro. Pero you cannot properly warn the public lalo na pag wala kang alam kung ano talaga ang cryptocurrency. Generally kasi, pag sinabing crypto unang una pumapasok sa isip nila is investment scam. Well, dahil na rin sa mga pinag babalita dati na mga scammers at ang ginagamit nilang dahilan was cryto/Bitcoin trading which was not true, dahil yung ginagawa talaga ng mga taong yun was ponzi scheme and was not actually trading. At yung huling sentence bro is also very very true lol. Sinabi mo pa, kasi kung ginawa muna nila ung trabaho nila before sila nagbigay ng opinyon siguro hindi ganun yung magiging pananaw nilapatungkol sa industryang ito.Pero wala ka naman ng magagawa kasi yun ang pumasok sa utak nila, something na talagang mapapanganga ka na lang if may alamka sa crypto tapos makakabasa ka ng ganito na generalized yung pag bira sa crypto.Ikaw na lang mag aadjust para sa sinasabi nilang trabaho nila. hahaha",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "January 22, 2023, 10:44:37 PM",
      "body": "Sa pangkalahatan, maaari itong tukuyin bilang \"crypto,\" ngunit upang maging tiyak, hindi tama na tukuyin ang Bitcoin bilang isang pamumuhunan sa pagsusugal maliban kung ikaw ay may kaalaman tungkol dito. Mayroong milyun-milyong cryptocurrencies, at ang karaniwan sa mga ito ay mga scam lamang. Ang ilang mga indibidwal ay maaaring nakaranas ng mga seryosong scam sa ilang malilim na proyekto, ngunit hindi nito ginagawang scam ang Bitcoin.Quote from: https://www.gmanetwork.com/news/money/economy/853335/gatchalian-warns-uninformed-vs-investing-in-crypto-calls-it-a-glorified-casino/story/?fbclid=IwAR2ayKDrXJNZadP27zPiUyWhtpi2kDNUDnlaPNX886EF-uCYgOHgiuxHEvIBinalaan ni Senador Sherwin Gatchalian noong Huwebes ang publiko na laktawan ang pamumuhunan sa crypto kung hindi nila naiintindihan ang konsepto sa likod ng mga digital na pera.Idinagdag niya na ang mga cryptocurrencies ay hindi pa kinokontrol sa Pilipinas.IMO, sinusubukan lamang ng senador na protektahan ang interes ng mga tao, dahil sinabi niya sa kanila na lumayo sa crypto kung wala silang anumang pang-unawa tungkol sa kung paano gumagana ang digital currency. Maaari akong sumang-ayon na ang ilang mga tao ay hindi talaga alam ang konsepto ng crypto, kaya nagkakaroon sila ng mga pagkalugi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "January 24, 2023, 03:18:45 PM",
      "body": "Quote from: Coin_trader on December 30, 2022, 02:48:23 PMI think fair naman yung statement nya considering na nagbibigay lang sya ng babala sa mga newbie since law maker sya ng Pilipinas. Pero clearly na wala talaga silang alam sa crypto technicality at nagbabase lang sa mga news since tamad silang magresearch bago magbigaynng comment para magbigay ng advice sa public. In short mema lang para masabing nagtra2baho sila.I tend to disagree kasi kung may kaalaman ka sa crypto at ang potential nito, I don't think na maikukumpara mo ito sa isang casino lamang. He's citing it wrong, kasi technically, lalo na kung Bitcoin or mga crypto ang pag-uusapan na may halaga para sa tao, hindi lang ito maikukumpara sa isang casino. Maybe the senator has just enough knowledge kaya niya nabitawan ang mga salitang ito or just citing sa mga negative effects sa mundo ng crypto. Kung hindi rin niya maintindihan yung technology, baka huwag naring magkomento tungkol rito na lalo lang maglalagay sa alanganin sa adoption ng crypto. Malaking tao sila at maimpluwensiya kaya yung mga binibitawan nila ay pwedeng makapaniwala sa karamihan, which is limited din lang naman ang kaalaman nila. Just my two cents.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qwertyup23",
      "created_time": "January 26, 2023, 11:57:05 PM",
      "body": "Quote from: tech30338 on December 09, 2022, 12:27:20 AMkaya nga sinabi ng mga matagal na sa crypto invest at your own risk diba sana wag sya maglabas ng ganetong statement kasi nakakasira ito, lalo na at di naman ganun kalalim ang kaalaman sa blockchain, anu ang masasabi ninyo?ito ang link ng kanyang pahayag: https://www.gmanetwork.com/news/money/economy/853335/gatchalian-warns-uninformed-vs-investing-in-crypto-calls-it-a-glorified-casino/story/?fbclid=IwAR2ayKDrXJNZadP27zPiUyWhtpi2kDNUDnlaPNX886EF-uCYgOHgiuxHEvIIto yung problema if nag rerelease ng statement ang isang senator na wala naman masyadong alam sa space na to pero napaka laking influence ang nagagawa niya. Siguro he is referring to alternate coins where may gumagawa ng isang project, tapos magkakaroon ng isang rug and pull after makakuha na ng malaking capital.This is borderline crazy given that he is a senator- a person sitting in a very highly prestigious and important position since sila gumagawa ng batas. This speaks of his character where nag sasabi siya agad ng isang statement pero hindi niya agad iniintindi muna. If these are the ones creating are laws, then ano na mangyayare sa bansa naten?Though pwede rin naman na ang pahayag niya ay isang general statement, still, mas maayos sana kung pinag aralan niya ito at cinategorize niya ng mas maigi yung sinabi niya kasi nagiging sobrang misleading din ito.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "January 27, 2023, 12:09:05 PM",
      "body": "Quote from: chaser15 on December 11, 2022, 09:42:28 PMQuote from: blockman on December 10, 2022, 04:49:45 AMOk lang yung ganyang ideya na meron siya kung ano ang crypto at tingin ko maganda naman hangarin niya. Yun nga lang, need pa niya mag research para mas lalo pa siyang magkaroon ng background kahit sa pinakasimple lang pagdating sa crypto.Kasi mami-mislead niya ang mga tao kaya hindi rin maganda na kapag konti palang knowledge mo tapos magmumukhang expert at tingin mo alam mo na lahat, lalo na public figure siya at senador pa.Kabayan di para mag-komento ng ano-ano yan si Sen. Win ng di alam ang sinasabi niya. Di ako panatiko niya o isang supporter pero isa yan sa mga matatalinong Senador. Di yan para magbigay lang ng haka-haka sa isang official na panayam. Tama naman sya, bakit papasok sa crypto ang isang tao di naiintindihan ang pinapasok niya? In general naman most tokens ay crap. Di naman sya nagsalita ng negative about Bitcoin specifically. Mas maganda ng ganyan ang sabihin niya kasi kung seryoso ang tao na pasukin ang crypto, malalaman din nila thru proper research kung ano talaga ang puwede nilang iexpect sa pag-invest sa crypto.Nakakasira sa crypto iyong statement niya? Para niyo na rin sinabi na walang sariling pag-iisip ang mga tao. Teka, ilan beses na ba nagkaroon ng negative image ang crypto dito sa bansa? Ang dami na diba pero nag grow pa rin ang crypto adoption dito sa atin. Tama lang na ang makiinvolve  lang dito sa crypto eh iyong naiintindihan ang pinapasok nila.Sa last statement niya, malinaw ang sabi niya na wag papasok kung di naiintidihan ang mga bagay-bagay. Wala siyang sinabing wag mag-invest sa crypto in general na tipong hate niya ang crypto to the point na aggressive sya na iconsider ang crypto.Si OP naman kasi patola. Dapat ang title ng topic is, Sen. Gatchalian nagbabala sa pagpasok ng pera sa crypto or something na malapit dyan. Di naman highlight ng statement niya iyong crypto as a type of casino. Lawakan ang isip. Katulad mo din naman, di rin ako suporter niya at para sa akin maganda naman ang hangarin yun nga lang. Bago siya mag bitaw ng salita kasi mostly words na binibitaw niya bilang mambabatas ay hindi haka haka lang dapat. Ok naman na magbigay ng opinyon pero mas maganda yung maging informative yung sasabihin niya na may back up ng research at facts.Wala rin namang mali sa sinabi mo at sinabi niya at tingin ko wala rin namang mali sa sinabi ko, pero mas maganda kapag may mga statement na ganyan dahil public figure, mas mainam na may research siyang pinagbabasehan para rin sa kapakanan ng lahat na di pa maalam sa crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Scripture",
      "created_time": "January 30, 2023, 07:07:27 PM",
      "body": "Quote from: blockman on January 27, 2023, 12:09:05 PMKatulad mo din naman, di rin ako suporter niya at para sa akin maganda naman ang hangarin yun nga lang. Bago siya mag bitaw ng salita kasi mostly words na binibitaw niya bilang mambabatas ay hindi haka haka lang dapat. Ok naman na magbigay ng opinyon pero mas maganda yung maging informative yung sasabihin niya na may back up ng research at facts.Wala rin namang mali sa sinabi mo at sinabi niya at tingin ko wala rin namang mali sa sinabi ko, pero mas maganda kapag may mga statement na ganyan dahil public figure, mas mainam na may research siyang pinagbabasehan para rin sa kapakanan ng lahat na di pa maalam sa crypto.Dahil siguro sa risk na dala nito kaya ito nasabe, pero kung paglalaanan talaga ito ng oras at panahon panigurado, mabilis lang nila ito maiintindihan and for sure, magkakaroon pa sila ng mga ideas to create a law that can protect everyone. Ok naren na nakuha naten yung atensyon nila pero sana mas maging open sila. Maraming institution ang willing tumulong to spread the right knowledge, and hopefully mangyare na ito para magkaroon na ng mass adoption dito sa Pinas and make crypto legal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}