{
  "id": "topic_5467733",
  "title": "Disruptivas",
  "author": "Disruptivas",
  "created_time": "September 22, 2023, 05:20:04 PM",
  "content": "E se o bitcoin é uma ''arma monetária'' vazada do laboratório de segurança dos Estados Unidos?Nic Carter e Daniel Roberts defendem a teoria de 'hipótese do vazamento do laboratório do Bitcoin'. Basicamente, a ideia é que o Bitcoin foi vazado a partir de um projeto interno de P&D da NSA que foi encerrado e que um pesquisador - um dos autores chamava OKAMOTO Tatsuaki - achou que era bom demais para ser abandonado e decidiu lançá-lo secretamente.O projeto que teria sido a base pro bitcoin é um whitepaper de 1996, chamado  ''HOW TO MAKE A MINT: THE CRYPTOGRAPHY OF ANONYMOUS ELECTRONIC CASH'' (traduzindo: como criar uma casa da moeda) e um dos autores chamava  \"Tatsuaki Okamoto\" https://twitter.com/danroberts0101/status/1702440110002729356",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467733",
  "comments": [
    {
      "author": "Paredao",
      "created_time": "September 22, 2023, 08:12:30 PM",
      "body": "Eu acredito que isso possa ser verdade. Já tinha ouvido falar de uma história parecida. Que o Bitcoin tinha sido criado por agencias norte-americanas para facilitar o rastreio do dinheiro de origem ilícita e dos inimigos do povo norte-americano. Sei que parece ser uma \"lenda urbana\", mas que pode ser verídico, isso pode.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "September 22, 2023, 08:19:25 PM",
      "body": "É bem interessante essa hipótese, e não é a primeira vez que ouço falar. Já ouvi outras vezes que a NSA ou a própria CIA poderia ter \"criado\" o BitcoinNão podemos afirmar que é ou não porque não conhecemos o criador do Bitcoin, então qualquer hipótese é válida nesse casoParticularmente eu acho difícil, pode ser aqueles casos que junta-se as informações que ajuda a teoria e exclui as outras, e novamente, minha opinião é que foi um pequeno grupo que criou o Bitcoin E se isso for verdade, acham que mudaria drasticamente o mercado? Que as pessoas iriam desacreditar e parar de usar o BTC?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 23, 2023, 08:54:22 AM",
      "body": "Por acaso nunca tinha ouvido falar nessa teoria. Mas, não deixa de ser uma teoria valida.Será que foi por isso que o Satoshi ficou algo incomodado, quando uns co programadores, aceitou ir falar com as agencias US sobre o Bitcoin?Alias, alguns dizem que foi isso que motivo o Satoshi ter decidido se afastar do fórum e do projeto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "September 23, 2023, 11:34:03 AM",
      "body": "Quote from: joker_josue on September 23, 2023, 08:54:22 AMPor acaso nunca tinha ouvido falar nessa teoria. Mas, não deixa de ser uma teoria valida.Será que foi por isso que o Satoshi ficou algo incomodado, quando uns co programadores, aceitou ir falar com as agencias US sobre o Bitcoin?Alias, alguns dizem que foi isso que motivo o Satoshi ter decidido se afastar do fórum e do projeto.  Pensei nisso também quando li a história.Acho que um dos aspectos que mais me ''pega'' nessas teorias da conspiração é que o número de pessoas que podem ser o satoshi não é tão grande. Quantas pessoas estavam estudando sobre criptografia  e tinha super acesso a tecnologias digitais na década de 80/90? Acho que o grupo de possibilidadades de pessoas que podem ser o Satoshi não é maior do que 1.000 pessoas. Claro que ele pode ser alguem que nunca se expos e por isso, é um nome não considerado nesses 1.000.  Mas dos Okamotos aos Hal Finney, não tem tantas pessoas que podem ser",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "September 23, 2023, 11:45:44 AM",
      "body": "Curioso pois pelo que pesquisei OKAMOTO Tatsuaki continua sendo uma pessoa bem pública e que ainda participa de muitos projetos e pesquisas. Para quem tiver interesse na formação, publicações e prêmios do possível Satoshi: https://www.rd.ntt/e/organization/researcher/fellow/f_001.htmlNo currículo dele não cita o projeto ou qualquer participação em algo vinculado aos EUA, mas não sei se seria algo que seria divulgado.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Loganota",
      "created_time": "September 23, 2023, 07:32:12 PM",
      "body": "Interessante a teoria. Obrigado por compartilhar. Nesse caso eu penso em 2 linhas, uma que eu não acho que essa história é muito plausível porque não vejo muito bem um motivo para que as agências do EUA criassem uma moeda digital centralizada já que boa parte do poder que eles detém vem da emissão de dólar.Mas de outro lado é possível mesmo que o Bitcoin seja um projeto descontinuado que alguém foi até o fim e publicou. Até bateria com a teoria de que foi um grupo de pessoas que o desenvolveu. Mas sinceramente não acho muito plausível porque, sinceramente, passou de 2 pessoas que sabem um segredo, ele já não é um segredo mais. Alguém com certeza já teria vazado alguma informação.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 23, 2023, 09:05:58 PM",
      "body": "Quote from: Loganota on September 23, 2023, 07:32:12 PMMas de outro lado é possível mesmo que o Bitcoin seja um projeto descontinuado que alguém foi até o fim e publicou. Até bateria com a teoria de que foi um grupo de pessoas que o desenvolveu. Mas sinceramente não acho muito plausível porque, sinceramente, passou de 2 pessoas que sabem um segredo, ele já não é um segredo mais. Alguém com certeza já teria vazado alguma informação.A menos que todos os envolvidos já tiveram \"assidentes\" fatais.  Se calhar o Satoshi foi o único que escapou... mas, também desapareceu misteriosamente...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "September 24, 2023, 12:31:46 PM",
      "body": "Quote from: Loganota on September 23, 2023, 07:32:12 PMInteressante a teoria. Obrigado por compartilhar. Nesse caso eu penso em 2 linhas, uma que eu não acho que essa história é muito plausível porque não vejo muito bem um motivo para que as agências do EUA criassem uma moeda digital centralizada já que boa parte do poder que eles detém vem da emissão de dólar.Mas de outro lado é possível mesmo que o Bitcoin seja um projeto descontinuado que alguém foi até o fim e publicou. Até bateria com a teoria de que foi um grupo de pessoas que o desenvolveu. Mas sinceramente não acho muito plausível porque, sinceramente, passou de 2 pessoas que sabem um segredo, ele já não é um segredo mais. Alguém com certeza já teria vazado alguma informação.Mas em relação ao seu primeiro ponto, de não ver motivo para uma agência do EUA criar uma moeda digital, essa parte da história é um fato. Havia essa pesquisa e a própria agencia divulgou esse paper, sobre um sistema de criptografia para criação de moedas digitais anonimas. Aqui, entra um pouco as várias histórias que conhecemos sobre projetos que são criados pra um propósito e depois vão evoluindo. Essas agencias precisam estudar todo tipo de coisa até pra entender os riscos, visto que é uma agencia focada em segurança.Agora sobre mais de duas pessoas saberem, concordo. Acho um pouco dificil que um segredo como esse se mantenha em segredo por muito tempo se for envolvida  várias pessoas",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "September 24, 2023, 07:13:01 PM",
      "body": "Quote from: Loganota on September 23, 2023, 07:32:12 PM as agências do EUA criassem Não subestime o poder de \"criação' das agencias norte-americanas. Dinheiro para isso é que não falta para elas criarem o que quiserem. Me lembro da historia da criação do LSD durante a chamada guerra fria. Não sei se até hoje eles admitem ou não, a criação dessa famosa droga pela CIA ( agencia de inteligência norte-americana)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Loganota",
      "created_time": "September 24, 2023, 10:55:18 PM",
      "body": "Quote from: Disruptivas on September 24, 2023, 12:31:46 PMMas em relação ao seu primeiro ponto, de não ver motivo para uma agência do EUA criar uma moeda digital, essa parte da história é um fato. Havia essa pesquisa e a própria agencia divulgou esse paper, sobre um sistema de criptografia para criação de moedas digitais anonimas. Aqui, entra um pouco as várias histórias que conhecemos sobre projetos que são criados pra um propósito e depois vão evoluindo. Essas agencias precisam estudar todo tipo de coisa até pra entender os riscos, visto que é uma agencia focada em segurança.Agora sobre mais de duas pessoas saberem, concordo. Acho um pouco dificil que um segredo como esse se mantenha em segredo por muito tempo se for envolvida  várias pessoas Quote from: Paredao on September 24, 2023, 07:13:01 PMQuote from: Loganota on September 23, 2023, 07:32:12 PM as agências do EUA criassem Não subestime o poder de \"criação' das agencias norte-americanas. Dinheiro para isso é que não falta para elas criarem o que quiserem. Me lembro da historia da criação do LSD durante a chamada guerra fria. Não sei se até hoje eles admitem ou não, a criação dessa famosa droga pela CIA ( agencia de inteligência norte-americana)Estou precisando ir mais atrás dessas notícias então. Não tinha conhecimento desses fatos. De todo modo, pelas discussões que haviam pelos cypherpunks creio que seria algo natural de acontecer em algum momento.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "September 24, 2023, 11:28:25 PM",
      "body": "Então.. o Bitcoin realmente parece ser bom demais para ter sido criado apenas por uma única mente brilhante.Os EUA já provaram, vide fatos históricos, que é capaz de invenções grandiosas para conseguirem o que quer e mudar o rumo da humanidade.Mas, seria hirônico ver que aquilo que era pra ser ser uma arma dos EUA hoje na verdade é uma pedra no sapato deles, vide as inúmeras tentativas de tentar barrar o seu progresso.De toda forma, podemos ver que o Bitcoin pouco mudou desde que foi concebido... várias melhorias mas o seu core se mantém intacto. E se realmente essa teoria for verdade, louvado seja esse hacker que vazou o programa Bitcoin, pois ele está melhor hoje descentralizado do que se estive sido lançado pelas mãos de um governo, com aquela blackdoor marrota.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 25, 2023, 06:32:05 PM",
      "body": "Quote from: alegotardo on September 24, 2023, 11:28:25 PMDe toda forma, podemos ver que o Bitcoin pouco mudou desde que foi concebido... várias melhorias mas o seu core se mantém intacto. E se realmente essa teoria for verdade, louvado seja esse hacker que vazou o programa Bitcoin, pois ele está melhor hoje descentralizado do que se estive sido lançado pelas mãos de um governo, com aquela blackdoor marrota.Talvez, por não ser possível criar essa tal blackdoor no Bitcoin, que as agencias do governo desistiram dele. E alguém envolvido, aproveitou.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "September 28, 2023, 03:22:08 PM",
      "body": "Quote from: alegotardo on September 24, 2023, 11:28:25 PMEntão.. o Bitcoin realmente parece ser bom demais para ter sido criado apenas por uma única mente brilhante.Os EUA já provaram, vide fatos históricos, que é capaz de invenções grandiosas para conseguirem o que quer e mudar o rumo da humanidade.Mas, seria hirônico ver que aquilo que era pra ser ser uma arma dos EUA hoje na verdade é uma pedra no sapato deles, vide as inúmeras tentativas de tentar barrar o seu progresso.De toda forma, podemos ver que o Bitcoin pouco mudou desde que foi concebido... várias melhorias mas o seu core se mantém intacto. E se realmente essa teoria for verdade, louvado seja esse hacker que vazou o programa Bitcoin, pois ele está melhor hoje descentralizado do que se estive sido lançado pelas mãos de um governo, com aquela blackdoor marrota.Acho que mesmo se tiver sido criado por uma pessoa, não é ''resultado do trabalho de uma pessoa.'' Se considerarmos as referencias bibliográfica, está ali os outros trabalhos que ajudaram. Ele juntou as peças sozinho apenas. Mas eu não acho estranho a ideia de ter algo com um vazamento vindo de alguma agencia bem importante nessas pesquisas. Não necessariamente diretamente, mas de alguma coisa.  Imagina só, se alguém pode criar algo que te incomoda, você mesmo é uma otima opção kkkkPensando mais sobre a tese e lendo os pontos de vocês, pra mim parece ter um senso lógico.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}