{
  "id": "topic_5447904",
  "title": "Alik Bahshi",
  "author": "Alik Bahshi",
  "created_time": "April 07, 2023, 08:21:04 AM",
  "content": "Alik BakhshiTurkic language and Azerbaijan        The Parliament of Moldova made a bold decision to rename the state language from \"Moldovan\" to \"Romanian\". \"Those who for decades told us that we, the citizens of the Republic of Moldova, speak the 'Moldovan' language, and not Romanian, pursued only one thing: to divide us,\" President Maia Sandu wrote. Russia, having torn away part of Romania, gave it the name Moldova This is how the Moldavian people and the Moldavian language appeared. Although in fact the population of the so-called Moldavia is Romanians and their language is Romanian. A similar, and even, I would say more confusing, situation has developed in Azerbaijan, for a full understanding of which without resorting to a distant the past of the two most numerous peoples of the Middle East, namely the Turks and Persians (Iranians), is indispensable.    The Iranians are the mighty Persian Empire (the power of the Achaemenids), which existed from 646 to 329 BC, revived again, after the empire of Alexander the Great and the Seleucid Empire, the Parthian kingdom from 250 BC. - 227, which stopped the advance of the Roman Empire to the East, and the last Sasanian Empire 227 - 651, which fell as a result of the Arab conquests and the formation of the Arab Caliphate. It should be noted that since then the Iranians have lost power within their state for many centuries until the Islamic Revolution and the expulsion of the last Shah of Iran, Mohammed Reza Pahlavi, from the country.        The penetration of the Seljuk Turks, which began especially actively in 1036, eventually led to the collapse of the Arab Caliphate. In 1055, Togrul-bek deposed the Caliph of Bagdat and became the sultan of Baghdad, and the state of the Ottomans began to emerge in Asia Minor. In 1256, the Middle East region was invaded by the Mongols with the formation of the Turkic-Mongol Hulagunid Empire (1256 - 1335) with its capital in Tabriz. An important point for understanding the future situation considered in this article, namely, the state languages of the Hulagenid Empire are Turkic and Farsi (Persian). However, traditionally, Farsi continues to be used exclusively in oriental poetry.    In the future, the Khulagunid dynasty is replaced by the Timurids. A talented military leader, who did not know defeat, of Turkic-Mongol origin, Timur (demir, from the Turkic \"iron\"), known in Europe under the name Tamerlane, creates the Great Turan empire (1370-1507) with its capital in Samarkand.     Timur becomes the ruler of the entire East. He defeats the army of the Ottoman Sultan Bayazet, his campaign against Khan Tokhtamysh ends with the complete defeat of the Golden Horde and the pursuit of Tokhtamysh to the borders of Moscow. After this campaign, the \"Golden Horde\" will no longer recover and will subsequently become easy prey for the Moscow principality. In my opinion, the main misfortune of the Turks, and this can be traced throughout their history, is the constant internecine hostility, which ultimately affected their inability to resist enemies.    After the death of Timur, his empire disintegrates and two Turkic unions of Ak-Koyunlu and Kara-Koyunlu appear at war with each other, the difference of which was that the first were Sunnis, and the second Shiites. The internecine war ends with the victory of Ak-Koyunlu, who turned their aspirations to the Ottoman state, which had grown stronger by that time, but were defeated. Over time, in the state of Ak-Koyunlu, as a result of an internal struggle, power passes to the Turkic dynasty of the Safivids, who professed Shiite Islam. The Safavid Empire (1501-1736), also known in history as the Kyzylbash state.    In the Middle East, two powerful, eternally opposing each other, Turkic states are being formed - the Sunni - the Ottoman Empire and the Shiite - the Safavid Empire, in which Turkic and Farsi are the state languages.      It is important to note that the Turkic-speaking population in the Safavid Empire was mostly concentrated in its northwestern region, which in ancient times was called Antropatena, preserved, but transformed for thousands of years into the name Azerbaijan, and the name Azeri is assigned to the Turkic population of this historical and geographical area, in Russian version of Azerbaijanis.     If the power in the Ottoman Empire throughout its entire historical path was in the hands of the Ottoman dynasty, then this cannot be said about the territory located to the east. The power of the Safivid dynasty passed to the vizier and regent of the last Shah from the Safavids to Nadir Shah from the Turkic Afshar family, who turned out to be an insane despot, known for bloody repressions against his subordinates, who brought Persia to a political and economic crisis due to continuous wars with neighbors. As a result of a conspiracy of court khans, Nadir Shah was killed in 1747, after which a leapfrog of shahs of the Afshar dynasty began. The political crisis, detrimental to the country, continued until 1795.The situation in Persia stabilized with the accession of the new Turkic Qajar dynasty (1795-1925), but this dynasty was not lucky in that Persia had to resist the Russian Empire in its intentions to conquer the Caucasus. Russia, seizing lands, brutally cracked down on indigenous peoples, the conquest of the Kuban was accompanied by the complete expulsion of the Nogais, some of whom fled to Dagestan, the other part escaped to Turkey. The lands were distributed to the Cossacks who served in the Russian army. So, Kuban Cossacks, Terek Cossacks with their numerous villages appeared on the occupied lands. Having conquered the North Caucasus, the Russians invaded Persia. As a result of the Russian-Persian war of 1804-1813, the Gulistan peace treaty was signed between the Russian Empire and Persia (the village of Gulistan in Karabakh), according to which Georgia, Dagestan, and the following khanates departed for Russia: Baku, Karabakh, Ganja, Shirvan, Sheki, Derbent , Cuban, Talysh.   The military successes of Russia in the wars with Persia were facilitated by the constant enmity between the Azerbaijani khanates. It should be noted that although the Shah of Turkic nationality exercised the central power in Persia, the Turkic khanates of Azerbaijan, formally submitting to the Shah, waged endless wars among themselves. I have already pointed out that constant rivalry is the scourge of the Turks throughout their history. True, there were attempts by individual khans to unite them, but they all ended in failure. So the last and most significant of them, undertaken by Fatali Khan, also failed. The only representative of the Turkic state with a strong central power is the Ottoman Empire, which existed for more than 6 centuries.    Russia did not stop there and in 1826 resumed the war with Persia, which ended in 1828 with the Turkmenchay peace treaty, according to which the Yerevan and Nakhichevan khanates were transferred to Russia, and a new border was established along the Araks River. The remaining 12 Azerbaijani khanates remained in Persia. Thus, the Azerbaijani khanates and people find themselves in different states.               The Russians called the local population of the occupied territory the Caucasian Tatars, because of the similarity of the language with the Kazan Tatars. The population defined themselves as Turks or Azeri (Azerbaijan is a historical and geographical region), and the language - Turkic (Turk Dili), in Russian Turkish. There was no state of Azerbaijan, there was no Azerbaijani nationality and the definition of the language as the Azerbaijani language. Moscow, for political reasons, in order to hide the proximity of the Turkic population of the occupied territory with the Turks living in Turkey and Iran, gave the name of the formed Soviet Republic as Azerbaijan, the people were Azerbaijani and, accordingly, the language became Azerbaijani, although the local population called Turkic for centuries.      The slogan \"One people - two states\", voiced by Presidents Erdogan and Aliyev, means one thing - the Turkic people live both in Turkey and in Azerbaijan, and the language of this people is Turkic. By the way, the Arabs also have several states, and their language is Arabic, there is no separate Egyptian language, or Jordanian.      In my opinion, it would be nice to restore historical justice and return the Turkic language to the Turkic people of Azerbaijan, as is done in Moldova, which returned the Romanian language to the people.     Returning the status of the Turkic language to the people of Azerbaijan will be an important step for the Union of Turkic States.(1)   1. One language, one Motherland. https://alikbahshi.livejournal.com/16879.html       1.04.2023   Original with maps: https://alikbahshi.livejournal.com/95415.html",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447904",
  "comments": []
}