{
  "id": "topic_5436571",
  "title": "Susano",
  "author": "Susano",
  "created_time": "January 24, 2023, 08:28:34 AM",
  "content": "Some people say bitcoin is like spiritual assumptions I was reading some Bitcoin stuff online and this headline caught my attention: \"Is Bitcoin a religion? If not, it soon could be\" I thought to myself that maybe some people indeed Bitcoin functioning like some form of faith while already not believing the current financial and economic set-up established by our government a long time ago.But honestly, since I have my own religious beliefs too, I can not be easily carried away by any religious and emotional appeals, and I realize that there can be many people like me who might not like the idea of bringing Bitcoin into the religious realm.Now, bringing into the world said that, do you think there can be advantages to Bitcoin if we start linking it to religious matters?Or it might be but not the same religion that we commonly know. Religion means the practice of believing in something influential. I assume Bitcoin will be god's in this case. It would be false if idolization is necessary",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436571",
  "comments": [
    {
      "author": "Nwada001",
      "created_time": "January 24, 2023, 08:55:58 AM",
      "body": "A similar thread which talk about Bitcoin and prophecy  was created before. It about a Pst. who testify of praying for a brother to get higher profit and financial freedom from Bitcoin and it works for him.. Those are just mere conscident, Bitcoin has nothing to do with religious beliefs, if not 1 Pst, can just wake up one morning and Prophesy for the downfall of Bitcoin and it will miraculously happen. As a Christian I believe in Prophecy and at thesame time I know the limit to which I believe Prophecy can reach. Crypto has nothing to do with prophecy, it's just predict watch you chart and leave the rest, if it works in your favor fine, if not hold on to it till it hits your target.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "January 24, 2023, 10:13:37 AM",
      "body": "Quote from: Susano on January 24, 2023, 08:28:34 AMSome people say bitcoin is like spiritual assumptions I was reading some Bitcoin stuff online and this headline caught my attention: \"Is Bitcoin a religion? If not, it soon could be\" I thought to myself that maybe some people indeed Bitcoin functioning like some form of faith while already not believing the current financial and economic set-up established by our government a long time ago.But honestly, since I have my own religious beliefs too, I can not be easily carried away by any religious and emotional appeals, and I realize that there can be many people like me who might not like the idea of bringing Bitcoin into the religious realm.Now, bringing into the world said that, do you think there can be advantages to Bitcoin if we start linking it to religious matters?Or it might be but not the same religion that we commonly know. Religion means the practice of believing in something influential. I assume Bitcoin will be god's in this case. It would be false if idolization is necessaryIt could be considered a religion to people who see it as a god that should be served or worship. It's not a religion to people who see it as currency/system created to serve and obey people, which it is happy to do. I'm among the latter group and believe it can serve you more if you understand it really well and make sure it's developed/used in a way that is according to its principles or good for the people it serves.  If for example you say let's strickly follow this building code/standard when building a house for a human, it doesn't mean you are serving or seeing the building as a God that should be believed in and trusted, but you are strickly following a standard that helps keep the building safe for humans to live in. Same as Bitcoin. Sometimes when you insist that people adhere to the principles it's built on they tend to see it that as a religion or think you serving it.    It's mostly about the humans/participants which Bitcoin is happy & designed to serve. And that's why it obeys simple task like send/recieve money. By the way, freedom to practice your true religion within the Bitcoin space doesn't make Bitcoin a religion or religious group.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}