{
  "id": "topic_5404809",
  "title": "Hamza2424",
  "author": "Hamza2424",
  "created_time": "July 01, 2022, 04:09:49 PM",
  "content": "Gaming Industry is too big far away from the Cinematic Industry but now Both of these Industries are Getting NFT involved as Digital mode of payment bookings and all that.But Gaming is Something more impressive where Games Bringer like Marvel, DC can just Boom the NFT Worldwith their games as they have characters with complete Origin Story and audience demand, Games Like MK ( Mortal Kombat ) Injustice 2 can Bring NFT Gaming to next level. I am sure in crypto future that will be Practical.Just Imagine games we play we can sell their Characters and also Buy them trade them which has awesome stories linked with heart's and how much money can they make and community can make by obtaining cards and then selling them on a new Marketplace.Example Looks at these Characters how cool that will be if its an NFT can played, Buyed & Sold traded with limited edition and Supply.Excited to see the future of the gaming as i have imagined much more Explain but i think I don't need to boorrr the community we all know how nfts works and for games you can check personally",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404809",
  "comments": [
    {
      "author": "81coin",
      "created_time": "July 14, 2022, 11:07:18 PM",
      "body": "Actually, putting together online gambling and NFT is a very promising idea, I wish more casinos could implement it in life",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btcbeograd",
      "created_time": "July 15, 2022, 12:12:53 AM",
      "body": "Yep, and the possibilities are immense! Profile pics, NFT as prizes, virtual tournaments and many more",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jimysanders",
      "created_time": "January 06, 2023, 11:53:39 AM",
      "body": "As for me, this idea looks quite interesting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Voloviko",
      "created_time": "January 15, 2023, 02:32:11 PM",
      "body": "In fact, there are a lot of Nft games and their number is growing every day, I think it's good that you can monetize your time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dariona",
      "created_time": "January 15, 2023, 04:38:13 PM",
      "body": "I think that NFTs have not lost their relevance and they will still bring a lot of profit. Not financial advice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xCryptoManiaX",
      "created_time": "January 18, 2023, 03:09:03 PM",
      "body": "I doubt that big games will implement NFTs anytime soon. Too much fraud around those. Even Steam with their CS:GO marketplace is having a hard time of stopping fraud. For example check this article: https://www.zdnet.com/article/valve-says-that-nearly-all-csgo-key-resales-are-being-used-to-launder-money/Now lets give an example. Even if Steam does make NFTs, they would still want to sell them on a centralized marketplace (the Steam marketplace) so they can control the items and any fraud. Turning them into NFTs would only add another layer of complexity and it is pretty pointless to do that. You can still sell your skins for real money, why would they add NFTs to the mix?If any other developer is going to add tradeable items to their game, I do believe that they will go with the same option - centralized marketplace. This is the only way they can have control over the items. Turning them into NFTs? I don't see a reason to do that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ashslm",
      "created_time": "February 08, 2023, 01:45:57 PM",
      "body": "Totally agreed! Gaming is one of those things thats in all of us as no matter the age, race, nationality etc., similar to laughter. Gaming in my opinion is and forever will be the most valuable market on the planet and implementing blockchain with gaming (in this case NFT's) is in todays time I think really a bold and brave move, not for the scared. Neighter is gaming gonna die, neighter is blockchain going away, they will just merge it's own paths with enough allowed time and I'm super happy for that! Unless in the meantime some new technology comes along which is even more complex than blockchain and changes everything again, which if it does happen, well Hurray! Let's go gaming and crypto!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}