{
  "id": "topic_5477453",
  "title": "coin-investor",
  "author": "coin-investor",
  "created_time": "December 11, 2023, 03:04:12 PM",
  "content": "Have you wrapped up every session you mean you allocate specific hours on your session and to hit the hour where you should log off you made a wrap-up of your session even though you still have a huge bankroll like you spend 30 minutes wrapping up your bets.I usually spend 20 minutes going down to my excitement level so when I log out I feel more relaxed How about you do you wrap up your sessions and how many minutes or hours and do you think it's ok to do a wrap-up?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477453",
  "comments": [
    {
      "author": "livingfree",
      "created_time": "December 11, 2023, 03:08:15 PM",
      "body": "No idea if that's the same of what I do like having my own time freely, I log off any time I want and I log in any time that I want to.Quote from: coin-investor on December 11, 2023, 03:04:12 PMI usually spend 20 minutes going down to my excitement level so when I log out I feel more relaxed Does this change whenever that excitement you've got doesn't give you the feeling of being more relaxed? We change moods quickly right, so what happens if you're on a losing streak.Does that feeling changes when you log out?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "December 11, 2023, 03:12:29 PM",
      "body": "Quote from: coin-investor on December 11, 2023, 03:04:12 PMHow about you do you wrap up your sessions and how many minutes or hours and do you think it's ok to do a wrap-up?I usually gamble with specific target in mind before I play. It’s either I’m playing with target profit or to hit some milestone such as VIP level, promotion and other challenges offer by the casino. I usually have a time limit because that will make me time conscious which affects my decision making while playing. It’s very hard to follow a specific time limit when playing because you typically can’t track time since you are busy on the game.I admire someone who can wrap up his game on his target time without feeling incomplete or unsatisfied regardless of the result.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Churchillvv",
      "created_time": "December 11, 2023, 03:13:28 PM",
      "body": "Imho I don't try to wrap up any session in my gambling times, I just discipline myself not to return to it when am done. As soon as I exhaust my set outside money for gambling for the day weather it ended with excitement or sadness I just log off and go about my other activities. If I'm tempted to go back to it I just pick up my drawing tools and start playing around with drawing it gets me off the mode to go back again. Even if I have a huge bankroll I just maintain the the set capital per day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "December 11, 2023, 03:18:25 PM",
      "body": "I do a wrap-up but not 30 minutes or even an hour the excitement will come if I have a long wrap-up, it only takes me 10 minutes the longest and I don't extend even if I have a winning run you have to stick to your habit if you want to control your addiction, I think wrapping up is good as long as you control your emotions and you are not tempted to extend your session further.But there are times that you did not have to wrap up because you are so disappointed that you just want to log off or you've just won a big amount and you just want to cash out and enjoy your winning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeilLostBitCoin",
      "created_time": "December 11, 2023, 03:20:42 PM",
      "body": "I don't typically have this kind of mindset. I am the type of gambler who continues playing until I win the desired amount of money. If I happen to lose all the money in my account, then I immediately stop gambling. However, there are times when I'm not in the mood to bet, and in those cases, I usually log out without considering whether I'm winning or losing. Next time I win at gambling, I will use your method to save my winnings instead of risking losing them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "December 11, 2023, 03:23:50 PM",
      "body": "Who do you report to?For a very organized maybe it satisfies him to have a spreadsheet of all his bets and then reflect on where his bad decisions are.  I'm not that person. But before sleeping I would still be thinking I could have won this and that. If all I was playing during the night was just dice and slot, there is nothing to think about, it's all just luck all I do is look into my balance and do the usual face palm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "December 11, 2023, 03:29:24 PM",
      "body": "Quote from: coin-investor on December 11, 2023, 03:04:12 PMHave you wrapped up every session you mean you allocate specific hours on your session and to hit the hour where you should log off you made a wrap-up of your session even though you still have a huge bankroll like you spend 30 minutes wrapping up your bets.I usually spend 20 minutes going down to my excitement level so when I log out I feel more relaxed How about you do you wrap up your sessions and how many minutes or hours and do you think it's ok to do a wrap-up?I wish I had some feature for myself like this one where to be able to stop and reflect for a moment and think about the wrap up of my statistics data so far.Unfortunately I keep playing like crazy a lot of times playing up to 5 AM which means that I want to win at all costs something I don't suggest to anyone.I think we should be all be able to get a wrap up for our session which would help us make the right decision on what to do next.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oilacris",
      "created_time": "December 11, 2023, 03:34:29 PM",
      "body": "Quote from: coin-investor on December 11, 2023, 03:04:12 PMHave you wrapped up every session you mean you allocate specific hours on your session and to hit the hour where you should log off you made a wrap-up of your session even though you still have a huge bankroll like you spend 30 minutes wrapping up your bets.I usually spend 20 minutes going down to my excitement level so when I log out I feel more relaxed How about you do you wrap up your sessions and how many minutes or hours and do you think it's ok to do a wrap-up?There's no specific time i should say or with the duration on the time i do make out those kind of wrap ups or simply having those break time. As long i dont make myself get tiredand dont be able to bust up my entire balance or something that i dont really have anything to be doing something then duration would really be much longer.So far i dont mind much about the breaking up as long i do have the money. You should really have that kind of control because on the time that you do find yourself havinga fatigue then this is where issues do came from. So better you should really know on when to stop and have some break or wrap up same as you said.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "December 11, 2023, 03:34:59 PM",
      "body": "It's good when you can follow your urge to do a wrap-up, gambling is an emotional activity sometimes you are lost in what's happening to your bankroll because of unexpected loss, I prefer to call my version winding down after my allocated time is almost over I just wind down by taking a break so when I come back I am fully aware that I need to finish my session at this hour.It's better to have this habit, it just means that you have control over what you're doing and you are not addicted to gambling and letting the games control your emotions and time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "December 11, 2023, 04:52:03 PM",
      "body": "In my case, I only place sports bets, and as I only place bets on leagues in European countries such as Serie A, Bundesliga, Ligue 1, Premier League, La Liga and Portuguese League and in these leagues the games have been taking place on the weekends, they They start on Friday and end on Monday, I also bet on the European Champions League and Europa League and Conference League and Boxi and UFC games. so these games or fights, although there are many that take place on weekends, for example in the premier league there are more than 10 games that take place between Friday and Monday, so I would say that in total there are more than 50 games that take place between Friday fair to mondaybut I choose games that when I bet will have a greater chance of being successful and that have good odds so that when I win, even if I lose on the next bet I will still be in profit. This means that I look at the odds and results of the two teams in the last 5 games and then decide whether to move forward with more analysis or stop. and when I already have the ideal teams to bet on and I place a bet, I don't go into the casino after I leave, but in the case of Bundesliga and Portuguese league games, which are games that are broadcast on stake, I watch on stake, but I'm happy because I only place sports bets, because with that I don't spend every day at the casino and maintain my self control",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dewi Aries",
      "created_time": "December 11, 2023, 05:07:01 PM",
      "body": "Quote from: robelneo on December 11, 2023, 03:34:59 PMIt's good when you can follow your urge to do a wrap-up, gambling is an emotional activity sometimes you are lost in what's happening to your bankroll because of unexpected loss, I prefer to call my version winding down after my allocated time is almost over I just wind down by taking a break so when I come back I am fully aware that I need to finish my session at this hour.It's better to have this habit, it just means that you have control over what you're doing and you are not addicted to gambling and letting the games control your emotions and time.Finishing and then leaving immediately is a better choice, don't care about the results of the session you are doing, because basically gambling can always make you not okay whether it's in a winning or losing condition, or the point and simply put is \"winning becomes addictive and losing becomes curious\" that is usually experienced by gamblers especially for addicts. So as I said above it's better to finish it immediately and go to do other activities or whatever, because obviously as you said that it is very likely that they will get lost deeper when it turns out that the final result is not what they expected and they cannot accept that result.In the end, emotions get the best of them and uncontrollable things are very likely to be done in that condition based on considerations that are not based on awareness and healthy thinking. On the other hand you have a pretty good habit in terms of approaching gambling by always being firm on the limits you have set to leave immediately when your gambling time is up. That is worth emulating, because the fact is that the longer you are involved in gambling sessions it will only make things run out of control especially if you are unable to accept all possible risks and in addition the bookie will always win, by immediately finishing then indirectly you will be far from addiction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "December 11, 2023, 05:43:18 PMLast edit: December 11, 2023, 05:56:52 PM by AmoreJaz",
      "body": "Quote from: robelneo on December 11, 2023, 03:34:59 PMIt's good when you can follow your urge to do a wrap-up, gambling is an emotional activity sometimes you are lost in what's happening to your bankroll because of unexpected loss, I prefer to call my version winding down after my allocated time is almost over I just wind down by taking a break so when I come back I am fully aware that I need to finish my session at this hour.It's better to have this habit, it just means that you have control over what you're doing and you are not addicted to gambling and letting the games control your emotions and time.i wrap up my game not because of the allocated time but because of the status of my bankroll. in every session, i already have my set amount to what extent do i need to spend. and if in case i go overboard, i still have that maximum amount that i can stretch out. if that has been met as well, it means, i need to call it a day no matter what. because if i will just follow my desires, it means, i am breaking what i set to myself for that session, and high likely, it will be detrimental to my funds because i won't stop. in this situation, high likely that i will be chasing already for my losses because i already have reached to my over over limit of boundaries.to curb such desire of continuing the game and breaking my limits, i have to think of the following so as to remind myself about possible repercussions of my actions :-basic expenses such as bills that won't be paid if i lost more than what i allocated for the session-possible debts that i will incur at the end of the month -time that i will spend to my kids if i will continue playing at my heart's desire-unfinished projects and so not meeting deadlines-impact of my stubbornness to my family life, my mental health, my financials",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "December 11, 2023, 06:06:50 PM",
      "body": "Quote from: coin-investor on December 11, 2023, 03:04:12 PMHave you wrapped up every session you mean you allocate specific hours on your session and to hit the hour where you should log off you made a wrap-up of your session even though you still have a huge bankroll like you spend 30 minutes wrapping up your bets.I usually spend 20 minutes going down to my excitement level so when I log out I feel more relaxed How about you do you wrap up your sessions and how many minutes or hours and do you think it's ok to do a wrap-up?I wrap up my session after a big win, or after i have used my daily budget. I have daily budget now instead of monthly or weekly budget. This way i don't need to wait a week if i blow my weekly budget in one day, or even worse, wait 29 or so days when i blow my monthly gaming budget in first day. This makes me bet smaller sums (if i am not winning big), but i don't mind as it's not just for winnings to me. It's a fun past time and daily budget reminds me of my goals.I don't have any time limit for myself. I just use free time that's best suited for gambling. Only rule is that gambling can't come before family events or over anything i've pre-planned or promised to others. Rest of it if me time, and for me to use as i please. If i want to use that for gambling, it's ok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "December 11, 2023, 06:40:12 PM",
      "body": "Quote from: coin-investor on December 11, 2023, 03:04:12 PMHow about you do you wrap up your sessions and how many minutes or hours and do you think it's ok to do a wrap-up?Hours? You spend hours wrapping up a bet? How long does your whole session last if you need more than an hour to quit? I rarely do that because I don't gamble actively anymore. This means that I place my sports bets and forget about them until the day of the event. I don't stay on gambling sites contemplating my odds, I no longer have time for that and I rarely play cards as well because it takes too much time. I've seen people who play slot machines all day long and they eat and drink while doing it but this isn't how life is supposed to be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "December 11, 2023, 07:04:37 PM",
      "body": "I'd rather leave immediately and never come back rather than contemplate on the session and think of things that I could have done differently to score a win. I play for an hour and after that time, I leave - no looking back, no regrets, no contemplation whatsoever. This is way easier since you don't have to think what happen and you can move on for the rest of your day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Antotena",
      "created_time": "December 11, 2023, 07:22:42 PM",
      "body": "Quote from: coin-investor on December 11, 2023, 03:04:12 PMHave you wrapped up every session you mean you allocate specific hours on your session and to hit the hour where you should log off you made a wrap-up of your session even though you still have a huge bankroll like you spend 30 minutes wrapping up your bets.I usually spend 20 minutes going down to my excitement level so when I log out I feel more relaxed How about you do you wrap up your sessions and how many minutes or hours and do you think it's ok to do a wrap-up?Anytime I'm playing casino games like Aviator, I give it all my time.and attention but there is this thing about gambling I don't joke with. It's hunger, I don't bet when I'm hungry because I know that's when I lose a lot because I will probably be making losses, so regardless of 30 minutes I have to play and gamble, once I feel sign of hunger, I will pause and give it a rest and then come back and continue from where I stopped earlier.For bookies, I don't do anything like that because I used my spare time to do selection of my games and the moments I'm done picking all my favorite matches. I stake immediately and move into something reasonable, the only time I go back to check is usually when the matches are over, that's what I do everytime I bet and I don't waste time, if there is no win for that day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "letteredhub",
      "created_time": "December 11, 2023, 07:52:31 PM",
      "body": "Quote from: coin-investor on December 11, 2023, 03:04:12 PMI usually spend 20 minutes going down to my excitement level so when I log out I feel more relaxed  @op This mode o yours is it determined by the results of your gambling for the day be it losses or winnings you still retain same excited mode? Cause as an experienced gambler with a few year of been in the industry I have had different modes and they are usually influenced by the outcome of my bets.As for wrapping up, I just wrap up in any way the mode goes it could be quick or slowly so the times used  could vary.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mvdheuvel1983",
      "created_time": "December 11, 2023, 08:11:19 PM",
      "body": "I have to say that you are a better and more organized gambler than I am. I am having a thought now to start doing this. I do the normal thing like watching my bankroll and not playing for more than the allocated time. However, there are days when I get carried away and go out of the plan I have. And it happens when there is a distraction from within the home or out side. Therefore wrapping up because a fight between my will and my gambling self.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "December 11, 2023, 08:23:23 PM",
      "body": "Quote from: coin-investor on December 11, 2023, 03:04:12 PMHow about you do you wrap up your sessions and how many minutes or hours and do you think it's ok to do a wrap-up?my decision on this depends on the kind of games am playing at the moment and the time frame i have towards each section, gambling is not what i can just start without having a plan towards how i wanted to enjoy the best moments out of it, in this i do ensure that i make in game i know that am being able to wrap up thesame time and day i expected, I've seen some spending more than two days while some a week or more, but in my own case, i may not have the enough patience needed to deal with it long extension on playing games.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}