{
  "id": "topic_5459552",
  "title": "ruferium",
  "author": "ruferium",
  "created_time": "July 12, 2023, 02:06:59 PMLast edit: July 16, 2024, 05:31:13 PM by ruferium",
  "content": "--",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459552",
  "comments": [
    {
      "author": "vv181",
      "created_time": "July 12, 2023, 03:26:00 PM",
      "body": "Quote from: ruferium on July 12, 2023, 02:06:59 PMAs an amateur developer, I am taking small steps towards designing an imaginary universe where wallets can exist and operate entirely on smart contracts. Some wallet(address/account) is a smart contract. And wallets do operate (interact) with smart contracts. It is just how it works.Quote from: ruferium on July 12, 2023, 02:06:59 PMBy holding ownership of all in-game materials on smart contracts, I aim to eliminate events like hacking and data loss. A smart contract may be able to govern the in-game materials, but it has no direct consequence it would eliminate hacks possibility.Quote from: ruferium on July 12, 2023, 02:06:59 PMThe more decentralized, the better. ~Once smart contracts are deployed, they should be beyond the control of the owner. If you build on top of the questionable decentralization degree of some cryptocurrencies, you will hardly be able to achieve it with your smart contract.Also, how/in what way do you verifiable ensure that the owner has no direct control?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "July 13, 2023, 02:04:38 AM",
      "body": "Quote from: ruferium on July 12, 2023, 02:06:59 PMI have created Stake and Trade Smart Contracts (still in the testing phase). A 0.1% commission is deducted from every transaction in the Trade Smart Contract and transferred to users who stake their tokens. How long should the stake duration be? I desire it to be 360 days with a base value.Imo, this shouldn't even be a thing at early stage, your first task should be to get customers for your wallet, second on to give token a value and later bother with staking/mining thing and make sure rewards are distributed properly that no free fall happens to your token. By the way, there are plenty established wallets available, why should users choose yours? Do you plan to audit smart contracts?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "July 13, 2023, 05:50:17 AM",
      "body": "Quote from: ruferium on July 12, 2023, 02:06:59 PMFind Reasons to Burn the Tokens!Dude. its not how it works. A good example of how a token should be released is uniswap or 1inch. They both first built a usability that became a market leader and then monetized it by creating a token and giving it away to those who used it before it became widely used.Burning tokens should come from the profits that the entity generates from its utility, which people want to use because they need it. And not an artificial creation as an additional fee when investing/selling, or as an element of a junk game made on a whim, which everyone will get bored of in 1 day. currently, large professional studios have a problem to attract players for longer, let alone someone who invents a game as an addition to the token.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "July 13, 2023, 11:04:20 AMLast edit: July 13, 2023, 11:14:43 AM by Tytanowy Janusz",
      "body": "Quote from: ruferium on July 13, 2023, 10:50:27 AMYou're right. The key here is to spread it out over time and make people see it as an additional job. Smart contracts will gain value for them through the orders they place. I am trying to build a system where they can handle all their transactions and continue with their lives by dedicating a maximum of 10 minutes per day. I leave its popularity to time.but you try to achieve this through various mechanisms that redistribute the money invested in the project to the investors of the project. You don't magically create capital that way, you know that? So in order for some percentage of your investors to see this as an extra payoff for 10 minutes of work a day, the other part of your investors will have to be willing to pay someone (random guy from internet) an extra paycheck for 10 minutes of work, and I assure you, there are no such people among people with money. Hence the project will not work and you can only qualify it as ponzi shame as there is no real use case that could build value in long run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "July 13, 2023, 12:45:37 PM",
      "body": "Quote from: ruferium on July 13, 2023, 10:50:27 AMQuote from: libert19 on July 13, 2023, 02:04:38 AMQuote from: ruferium on July 12, 2023, 02:06:59 PMI have created Stake and Trade Smart Contracts (still in the testing phase). A 0.1% commission is deducted from every transaction in the Trade Smart Contract and transferred to users who stake their tokens. How long should the stake duration be? I desire it to be 360 days with a base value.Imo, this shouldn't even be a thing at early stage, your first task should be to get customers for your wallet, second on to give token a value and later bother with staking/mining thing and make sure rewards are distributed properly that no free fall happens to your token. By the way, there are plenty established wallets available, why should users choose yours? Do you plan to audit smart contracts? The problem here is that I don't view them as customers.\"Why should they choose me?\" is a valid question. But why should they choose them?There are thousands of \"shit\" projects out there. Produce, hold pre-sales, create pools, and dump... No, I don't want to do all that.There may be shit projects but popular wallets are free ones, people use them because it full-fills their needs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaCryptoRaccoon",
      "created_time": "July 13, 2023, 12:52:51 PM",
      "body": "Here are some good resources to get you started The web3 development platform AlchemyEssential APIs, SDKs and tools to build and scale your app with easehttps://www.alchemy.com/This is a good place to start they have lots of good documentation and guides to help you get started.OpenZeppelin Wizardhttps://docs.openzeppelin.com/contracts/4.x/wizardGreat way to learn how to deploy contracts in a safe manner lots of good documentation also.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "July 14, 2023, 05:41:24 AM",
      "body": "Quote from: ruferium on July 13, 2023, 12:03:36 PMThank you for your criticism.In general, we can label the market as a Ponzi scheme, as you put it. Everyone is making or losing money from each other's pockets.When I buy shares of an example MMM company, behind the shares is a company that has 60,000 different products that it sells all over the world. People buy these products because they need them, not in the hope that they will sell when price of self-adhesive wall hooks pump. Of the profits the company generates, it pays me a 6% dividend. this is investing and you won't tell me it's ponzi schame.Quote from: ruferium on July 13, 2023, 12:03:36 PMIf there were currently $100 million inside, would you still call it a Ponzi scheme?Yes, money is important.Of cours i would. LUNA had $30B marketcap and UST had another $19B before it collapsed. Bernie Madoff went to jail in 2008 for 150 year because of a $20B ponzi.Quote from: ruferium on July 13, 2023, 12:03:36 PMI mentioned the idea of a science fiction-themed role-playing game as a use case for the token. If there were currently $100 million inside, would you still call it a Ponzi scheme?do you think you can make a \"science fiction-themed role-playing game\" with enough popularity to justify a capitalization of $100 million? So, for example, 500,000 copies sold at $20 in 1 year, which gives a P/E of 10, not including production costs (1 mln copies including marketing, distribution costs etc.)? Because thats the only use case you plan to have.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "July 15, 2023, 11:07:59 AM",
      "body": "Quote from: ruferium on July 14, 2023, 01:38:27 PMWhat I am aiming to do with my ideas is to create smart contracts centered around production, providing dividend income to wallet holders. I understand your concerns regarding the nature of production. Essentially, we are sharing our thoughts with a couple thousand lines of code, and isn't that a product in itself?In order to provide dividend income to wallet holders you have to generate profit. Produce stuff that someone wants to use. Not buy just to sell later on in hope of profit. But buy for use.Giving dividends for solving unnecessary tasks from newly generated tokens from the air and then, to avoid inflation, tax movements on the token to burn them is just a redistribution of funds from one investor to another not a dividend.Moving tokens from place to place does not magically produce wealth.Quote from: ruferium on July 14, 2023, 01:38:27 PMIt seems there may be a misunderstanding about the nature of the project. The game is not solely focused on making profits or generating a high market capitalization. It revolves around the interaction of assets functioning on smart contracts. By engaging with a smart contract, you become part of the game. The rest is the storyline and gameplay.For example, when you sign the mining smart contract for the token, you earn 1 RUFE per second. In addition to that, there are various smart contracts within the game that offer tasks, production, exploration, and both player versus environment (PvE) and player versus player (PvP) interactions. All of these actions and transactions take place on the blockchain, adhering to predefined conditions and rules. However, who would want to be a token miner and build a grand station, right? :/So what's the use case that will build a project value in a long run?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}