{
  "id": "topic_5494738",
  "title": "SickDayIn",
  "author": "SickDayIn",
  "created_time": "April 29, 2024, 11:23:53 PM",
  "content": "As per the article for further reading: https://cointelegraph.com/news/samourai-wallet-not-guilty-plea-bail-releasedKeonne Rodriguez, one of the co-founders of Samurai Wallet has pleaded not guilty to conspiracy to operate an unlicensed money-transmitting business and money laundering. The condition of his bail include: (1) prevented from engaging in “any cryptocurrency transactions, directly or indirectly,” without prior approval from the court.(2) travel restricted to parts of New York and Pennsylvania when not confined to his home.The first condition of his bail seems insane, he is restricted from engaging in any cryptocurrency transactions, even indirectly. The US government will be like a hawk at the moment keeping an eye on his cryptocurrency assets. It's a sad day, the US is not a safe place for cryptocurrency holders. How enforceable is his conditions of bail, and what are your thoughts on it? What precedent does this bail condition set for the future of cryptocurrency and Bitcoin projects founded from the USA?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5494738",
  "comments": [
    {
      "author": "AB de Royse777",
      "created_time": "April 30, 2024, 12:14:21 AM",
      "body": "Quote from: SickDayIn on April 29, 2024, 11:23:53 PMAs per the article for further reading: https://cointelegraph.com/news/samourai-wallet-not-guilty-plea-bail-releasedKeonne Rodriguez, one of the co-founders of Samurai Wallet has pleaded not guilty to conspiracy to operate an unlicensed money-transmitting business and money laundering. The condition of his bail include: (1) prevented from engaging in “any cryptocurrency transactions, directly or indirectly,” without prior approval from the court.(2) travel restricted to parts of New York and Pennsylvania when not confined to his home.Pleaded not guilty but they took away the freedom from him. Financially and socially he is in their custody.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "April 30, 2024, 12:21:37 AMLast edit: April 30, 2024, 12:32:20 AM by franky1",
      "body": "Quote from: SickDayIn on April 29, 2024, 11:23:53 PMThe condition of his bail include: (1) prevented from engaging in “any cryptocurrency transactions, directly or indirectly,” without prior approval from the court.(2) travel restricted to parts of New York and Pennsylvania when not confined to his home.The first condition of his bail seems insane, he is restricted from engaging in any cryptocurrency transactions, even indirectly. The US government will be like a hawk at the moment keeping an eye on his cryptocurrency assets. It's a sad day, the US is not a safe place for cryptocurrency holders. How enforceable is his conditions of bail, and what are your thoughts on it? What precedent does this bail condition set for the future of cryptocurrency and Bitcoin projects founded from the USA?if an american was found to be laundering euros, yen or rupees then its not insane to prevent them using directly or indirectly other currencies/forexif caught using such their bail could be revoked and he placed in custody/jail til trialits not precedent its just same laws that apply to other currency crimes also not excluded from bitcoinmany people think by using bitcoin creates some immunity from fiat laws.. sorry to inform you but normal laws still apply no matter what the currency is'bitcoin projects' oh come on we all know the use of certain things are for mixing and mixing is even promoting itself as a use for launderingno need to obfuscate it and pretend its just a 'bitcoin project', pretending this case puts all bitcoin projects under threat, the obvious clarity of this case shows it relates to mixing and laundering.. so why do people here try masquerading it as a general threat of all bitcoin utility, when in fact its clear its targeted directly for laundering/mixing",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SickDayIn",
      "created_time": "April 30, 2024, 04:37:37 AM",
      "body": "Quote from: franky1 on April 30, 2024, 12:21:37 AM'bitcoin projects' oh come on we all know the use of certain things are for mixing and mixing is even promoting itself as a use for launderingno need to obfuscate it and pretend its just a 'bitcoin project', pretending this case puts all bitcoin projects under threat, the obvious clarity of this case shows it relates to mixing and laundering.. so why do people here try masquerading it as a general threat of all bitcoin utility, when in fact its clear its targeted directly for laundering/mixingThat is true, maybe \"bitcoin projects\" was not the correct term to be used here. Mixing and obfuscating the source of coins can be used for legitimate purposes, for privacy, however there is no doubt that a significant portion of Samurai Wallet users would have had the intention of laundering their coins from the proceeds of illicit activity, which is the issue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peter0425",
      "created_time": "April 30, 2024, 05:35:11 AM",
      "body": "Quote from: SickDayIn on April 29, 2024, 11:23:53 PMThe first condition of his bail seems insane, he is restricted from engaging in any cryptocurrency transactions, even indirectly. Heh to me this seems a bit too much. He even has a monitoring device which he has to keep with him at all times. The US justice system has made free a lot of worse criminals. The only difference of his situation compared to if he was in jail is that he get to see his loved ones at least and be able to eat anything he wants as well as entertain himself with other media privileges.The clause that he can not participate in any crypto activities might be mute. I mean he is a rich man and a man with a lot of connections I am sure. I wouldn’t be so worried about him.QuoteWhat precedent does this bail condition set for the future of cryptocurrency and Bitcoin projects founded from the USA?As cryptocurrency becomes more prevalent and mainstream we can expect the government to be more strict and try to regulate as much of cryptocurrency activities as they can. Even if technically there’s really no illegal activity happening I am sure they can make up one or two.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "April 30, 2024, 07:17:40 AM",
      "body": "The government and regulators have always failed to deal with the money laundering in banks and in centralized institutions. Thieves, bandits, terrorism financing extremists will have money in banks but they are unable to deal with it. Cyber criminals are successfully able to collect fiat from their scammed victims. These so called regulators know just less than 1% of these fiat crimes but they can go against what is after crypto privacy is what they like. They are failures.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "April 30, 2024, 07:59:39 AM",
      "body": "Quote from: SickDayIn on April 29, 2024, 11:23:53 PMThe first condition of his bail seems insane, he is restricted from engaging in any cryptocurrency transactions, even indirectly. The US government will be like a hawk at the moment keeping an eye on his cryptocurrency assets. It's a sad day, the US is not a safe place for cryptocurrency holders. Sadly, Keonne's life will not be the same anymore, everything he does at this point will be watched, monitored and screened. Since he hasn't been convicted, the government has no right to seize his funds. The authorities must have taken records of all his crypto assets and addresses, and in other to discourage him from trying to spend or move them to a new address, they added the condition as part of his bail terms.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JollyGood",
      "created_time": "April 30, 2024, 08:56:07 AM",
      "body": "The US government has been clamping down on crypto related businesses for a long time and this is Court case seems to be yet another signal to people involved in the crypto sphere that they can be targeted.In this particular case, I was not aware of a case against Samurai Wallet founders but it could be designed to informing creators, owners, coders and contributors to mixing facilitators that they will eventually be targeted.As for the bail conditions, they will be difficult to adhere to but given a choice between jail or bail the decision is an easy one.Quote from: SickDayIn on April 29, 2024, 11:23:53 PMWhat precedent does this bail condition set for the future of cryptocurrency and Bitcoin projects founded from the USA?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MeGold666",
      "created_time": "April 30, 2024, 10:24:39 AMLast edit: April 30, 2024, 10:58:50 AM by MeGold666",
      "body": "There would be no need for mixing (laundering) if Bitcoin had privacy on protocol level.Next thing that will happen is this people who laundered money on mixing services will switch to DEX and the government will have no other option than to force mining companies to use their black list that could be automatically updated through chain analysis companies that are known to flag coins without having 100% certainty.Your Bitcoin could be frozen forever when this happens.I wouldn't be surprised if they also imposed rules on mining companies for transaction amounts, so you will need to ask for permission to send larger amount of BTC.Government agencies will attack privacy on every weak spot.They will do everything they can to control it as much as possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AHOYBRAUSE",
      "created_time": "April 30, 2024, 10:45:24 AM",
      "body": "1m$ bond sounds fairly low considering first news said he would be facing 25 years + as well.If I was him I would run, run as fast as the wind.Sure running is an admission of guilt pretty much but if I had a window of opportunity and a necessary rainy day fund to pay for the future I would use it.It's really sad how hard the US government ( such as other as well ) are going hard against crypto related services. Sure they can always say it's because they offer a platform to launder dark net funds but still, it's not like they can be responsible for what's happening in the world.Anyway, RUN Keonne RUN!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "April 30, 2024, 01:40:15 PM",
      "body": "The restrictions are fairly standard. The question comes down to how much leeway the judge and courts give him. If he asks to go to someplace outside of his travel limit they can easily say yes. But they still want to know where he is. Same with crypto transactions. If he can show that he has crypto that has nothing to do with Samurai at all and needs to sell it to have some income they could come down hard and say no, or just let him sell.I can see them restricting BTC transactions until he could really prove that it did not come from anything having to do with Samurai.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "April 30, 2024, 01:51:05 PM",
      "body": "Quote from: AB de Royse777 on April 30, 2024, 12:14:21 AMPleaded not guilty but they took away the freedom from him. Financially and socially he is in their custody. I mean look at it this way, you're still facing trial and you're basically buying the privilege of not sleeping in a holding cell with all that steel bed, I think that it's fair in a way. As much as we like to say that this is a show of taking away of someone's freedom, we want to see through this thing without any problems right? Maybe my opinion would change if there's new information that will come to light like there's a conspiracy behind all of this to try and make it so that he's getting the most subtle but unfair treatment of them all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "April 30, 2024, 02:00:29 PM",
      "body": "Quote from: SickDayIn on April 29, 2024, 11:23:53 PMThe condition of his bail include: (1) prevented from engaging in “any cryptocurrency transactions, directly or indirectly,” without prior approval from the court.(2) travel restricted to parts of New York and Pennsylvania when not confined to his home.Do we actually think this are going to remain as it has been said or not.Quote from: SickDayIn on April 29, 2024, 11:23:53 PMThe first condition of his bail seems insane, he is restricted from engaging in any cryptocurrency transactions, even indirectly. The US government will be like a hawk at the moment keeping an eye on his cryptocurrency assets.What if someone else close to him have access to is account or wallet and can initiate any form of transaction on his behalf and then no one knows.Quote from: SickDayIn on April 29, 2024, 11:23:53 PMIt's a sad day, the US is not a safe place for cryptocurrency holders.Am not supporting his act neither against it to an extent, but this is the advise i have, if you're into crypto, then try as much as possible to find yourself being located in a country that permits for free zone crypto, where you will have no government related challenges and regulations concerning your crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MeGold666",
      "created_time": "April 30, 2024, 02:21:57 PM",
      "body": "Quote from: DaveF on April 30, 2024, 01:40:15 PMI can see them restricting BTC transactions until he could really prove that it did not come from anything having to do with Samurai.So much for the \"Bitcoin censorship resistance\", it can't be restricted on the blockchain (for now, see my previous comment) but it can be restricted by law because the minute this funds move, he will end in jail.Wouldn't be a problem if the transactions were private (encrypted) and not transparent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "April 30, 2024, 09:13:34 PM",
      "body": "Quote from: SickDayIn on April 29, 2024, 11:23:53 PMWhat precedent does this bail condition set for the future of cryptocurrency and Bitcoin projects founded from the USA?I am glad to know they did not decide to make him guilty, this indicates that something is not very serious, they just trying hard to get something to hold onto so that they could seize another crypto-related platform and could seize all of there funds and then sell them when the price will increase in the bull run. I am assuming that till bull run or ATH these US authorities will be motivated to provide protection to crypto users from these malicious actors 🙄😶🙄 Well, the restrictions are no doubt hard but they are still better than declaring him a prisoner, as he can still live his good life outside the cell, he can meet people it would be like enjoying a smartphone and internet free world, he can do good things in his this time, but no doubt everyone must have a family to fill there stomachs, I hope he would have enough resources to manage all these things. USA is not anymore for crypto users and crypto miners as the tax, and seizures has made living there more difficult.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pixie85",
      "created_time": "April 30, 2024, 10:00:37 PM",
      "body": "Nowadays you need a license to make software. Next thing you're going to need a license to trade with other people. -hey man, I have a bike for sale-wait, I want that, just give me a month I have to apply for a purchaser's licenseFucking clown world!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}