{
  "id": "topic_5434622",
  "title": "Disruptivas",
  "author": "Disruptivas",
  "created_time": "January 13, 2023, 06:52:04 PM",
  "content": "Nessa semana vivemos no setor financeiros a queda de uma gigante do varejo. A Americanas desabou depois de descobrirem o ''malabarismo contábil'' da empresa. Basicamente, eles colocavam as dívidas que tinham com o banco como dívidas com os fornecedores, o que ajudava na busca de novos créditos e em ''amenizar'' a situação financeira. A queda das Americanas afetou vários fundos brasileiros (que tinham hiper exposição a ação), afetou fundos fora do Brasil e levantou questões sobre a auditoria de outras empresas do Varejo, que que os auditores da Americanas são também os auditores da Magalu. No final do dia, a situação é extremamente parecida com aquela vivida em cripto e talvez, vejamos que no final do dia, as auditorias ou regulações não servem de nada para proteção dos consumidores. E, assim como no caso da FTX, estão falando de como isso pode afetar outras empresas do grupo de bilionários que são donos das Americanas, que envolve AMBEV por exemplo.Acho que vale acompanharmos a situação para fins de aprendizados e comparaçãoes",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434622",
  "comments": [
    {
      "author": "TryNinja",
      "created_time": "January 13, 2023, 07:49:17 PM",
      "body": "É… a auditora da Americanas é uma das big 4, ou seja, uma empresa que você passa o olho e pensa ser top de linha, 100% confiável e infalível. Se eles deixaram passar f*cking R$ 20 bilhões (de uma empresa que vale menos que isso), o que mais podem ter deixado passar por ai?Acaba que nem com uma auditoria você pode ter certeza da qualidade de um terceiro. Exchanges, stablecoins, projetos… nada está realmente a salvo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "January 14, 2023, 09:36:44 AM",
      "body": "Essa questão das auditorias é sempre muito subjetivas. Existe muita forma de mascarar as coisas, e nas sucessivas crises e quedas de grandes empresas, a questão que depois surge é sempre: \"como as auditorias não detetaram isto antes?\"Por isso, cada vez fica mais difícil em saber em quem confiar, porque no meio de tudo isto, existe muito dinheiro e interesses envolvidos.É o problema de se tornar grande e ficar-se orgulhoso, custa depois admitir que se errou na gestão e de grande vai voltar a ser pequeno. Quando isso acontece, só geram problemas atras de problemas, sendo este o resultado final.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "January 14, 2023, 10:47:19 AM",
      "body": "Quote from: Disruptivas on January 13, 2023, 06:52:04 PMNessa semana vivemos no setor financeiros a queda de uma gigante do varejo. A Americanas desabou depois de descobrirem o ''malabarismo contábil'' da empresa. Basicamente, eles colocavam as dívidas que tinham com o banco como dívidas com os fornecedores, o que ajudava na busca de novos créditos e em ''amenizar'' a situação financeira. Eu vi uma live com o ulrich que explica melhor essa situação.Tentando resumir o que eu entendi, não é eles não viram um buraco de 20bi.Quando vc compra parcelado, a americanas não pode pagar o fornecedor a vista. Mas o fornecedor tem contas a pagar.Daí a americanas faz uma divida com o banco só pra pagar o fornecedor a vista , da sua conta parcelada.E no balanço eles colocavam essa dívida como para fornecedores.  É um erro  , mas não é tão absurdo qt parece a primeira vista.Está mais para um erro, e isso não acredito que vai quebrar a empresa.Diferente da ftx que foi crime e fraude.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "January 14, 2023, 11:33:05 AM",
      "body": "Quote from: bitmover on January 14, 2023, 10:47:19 AMDiferente da ftx que foi crime e fraude.Duvido muito que não tenham encontrado esse erro em talvez décadas da empresa. E essas últimas semanas com o anúncio do novo CEO tem muito cara de pump&dump com insider trading.https://twitter.com/meninribeiro/status/1613706874011979776https://economia.uol.com.br/noticias/redacao/2023/01/13/socios-da-americanas-venderam-acoes-antes-da-revelacao-de-rombo-de-r-20-bi.htmhttps://www.cartacapital.com.br/economia/mpf-vai-apurar-indicios-de-insider-trading-na-venda-de-acoes-da-americanas/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "January 14, 2023, 12:03:47 PM",
      "body": "Quote from: TryNinja on January 14, 2023, 11:33:05 AMQuote from: bitmover on January 14, 2023, 10:47:19 AMDiferente da ftx que foi crime e fraude.Duvido muito que não tenham encontrado esse erro em talvez décadas da empresa. E essas últimas semanas com o anúncio do novo CEO tem muito cara de pump&dump com insider trading.https://twitter.com/meninribeiro/status/1613706874011979776https://economia.uol.com.br/noticias/redacao/2023/01/13/socios-da-americanas-venderam-acoes-antes-da-revelacao-de-rombo-de-r-20-bi.htmhttps://www.cartacapital.com.br/economia/mpf-vai-apurar-indicios-de-insider-trading-na-venda-de-acoes-da-americanas/O caso é totalmente diferente da ftx. Lê novamente meu post ou assiste a live do ulrich que você vai entender melhor.É como a Disruptivas falou, muda apenas a facilidade/dificuldade para fazer novos empréstimos bancários e máscara a real dificuldade da empresa.Mas não muda em nem 1 centavo a disponibilidade de caixa da empresa e o tamanho da dívida. Isso foi falado no comunicado oficial.Quote“foram detectadas inconsistências em lançamentos contábeis redutores da conta fornecedores realizados em exercícios anteriores, incluindo o exercício de 2022. Numa análise preliminar, a área contábil da Companhia estima que os valores das inconsistências sejam da dimensão de R$ 20 bilhões na data-base de 30/09/2022. A Companhia estima que o efeito caixa dessas inconsistências seja imaterial.”https://alianzo.com.br/r20-bilhoes-de-inconsistencias-contabeis-das-americanas-irao-afetar-o-caixa-ou-nao-entenda/  Os caras venderem as ações antes do comunicado não muda o motivo da crise e só muda o assunto",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "January 14, 2023, 12:08:33 PM",
      "body": "Quote from: bitmover on January 14, 2023, 12:03:47 PMO caso é totalmente diferente da ftx. Lê novamente meu post ou assiste a live do ulrich que você vai entender melhor.Não tenho tempo para ver uma live de 40 min, mas abri o canal dele e dei de cara com esse “shorts” ainda mais recente: https://youtu.be/aOOR_nP8RA0Dívidas de 40 bilhões e pedido de recuperação judicial.E insider trading, se comprovado, também é crime. Capaz de terem propositalmente escondido o buraco (e agora o novo CEO não aguentou).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "January 14, 2023, 01:44:19 PM",
      "body": "Quote from: bitmover on January 14, 2023, 10:47:19 AMEu vi uma live com o ulrich que explica melhor essa situação.Tentando resumir o que eu entendi, não é eles não viram um buraco de 20bi.Quando vc compra parcelado, a americanas não pode pagar o fornecedor a vista. Mas o fornecedor tem contas a pagar.Daí a americanas faz uma divida com o banco só pra pagar o fornecedor a vista , da sua conta parcelada.E no balanço eles colocavam essa dívida como para fornecedores.  É um erro  , mas não é tão absurdo qt parece a primeira vista.Está mais para um erro, e isso não acredito que vai quebrar a empresa.Diferente da ftx que foi crime e fraude.Não acho que isso tenha sido o motivo da queda da empresa. Claramente foi fruto de muita ma gestão.Mas a compra parcelada não era suportada por uma instituição de credito? Era a própria Amercianas que fazia? Estranho...Por cá, também tem muita loja que faz isso, mas normalmente é via uma instituição de credito, o cliente fica com divida na empresa do credito e não com a loja.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "January 14, 2023, 05:07:44 PM",
      "body": "Ontem eu vi uma informação do Barsi que deixa a situação ainda mais ''interessante''. Ele disse que já viu mais de 40 grandes empresas de varejo quebrarem. E que a Via Varejo foi uma das que ele salvou, injetando vários milhões. Ele disse que o modelo é simplesmente não funciona. Pra varejo crescer, precisa injetar muito dinheiro, ai começa oferecer crédito, galera super ruim de pagamento, ai entra uma concorrente. Pra tu não deixar ela te vencer, tu precisa de mais crédito e fica nessa até quebrar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "January 14, 2023, 05:41:08 PM",
      "body": "Quote from: Disruptivas on January 14, 2023, 05:07:44 PMOntem eu vi uma informação do Barsi que deixa a situação ainda mais ''interessante''. Ele disse que já viu mais de 40 grandes empresas de varejo quebrarem. E que a Via Varejo foi uma das que ele salvou, injetando vários milhões. Ele disse que o modelo é simplesmente não funciona. Pra varejo crescer, precisa injetar muito dinheiro, ai começa oferecer crédito, galera super ruim de pagamento, ai entra uma concorrente. Pra tu não deixar ela te vencer, tu precisa de mais crédito e fica nessa até quebrar. Resumindo, a forma que trabalham não é sustentável Agora com certeza pode começar uma caça às bruxas nessas gigantes do varejo, também tem Magazine Luiza, MercadoLivre, Ponto frio entre outras, não duvido nada começarem a encontrar \"erros\" e surgir notícias piores ainda.Nada que não estamos acostumados com cripto  Mas a situação é um pouco preocupante pois tem muita gente que trabalha para o grupo, funcionários e entregadores por exemplo.Um caso curioso, tenho um conhecido que já prestou alguns serviços para as Americanas recentemente, e me disse que eles demoram um bocado para realizar os pagamentos, um boleto de 45 dias por exemplo, pagaram em 6 meses...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "January 14, 2023, 06:21:38 PM",
      "body": "Quote from: joker_josue on January 14, 2023, 01:44:19 PMMas a compra parcelada não era suportada por uma instituição de credito? Era a própria Amercianas que fazia? Estranho...Por cá, também tem muita loja que faz isso, mas normalmente é via uma instituição de credito, o cliente fica com divida na empresa do credito e não com a loja.Também achei estranho. O cliente paga parcelado em 10x, a operadora arca com os riscos e repassa o dinheiro completo para a Americanas mediante uma taxa de processamento (que aumenta conforme a quantidade de parcelas e tempo do pagamento). A Americanas pega esse dinheiro e paga o fornecedor.Só faz sentido pegar emprestado do banco se as taxas são melhores por lá do que antecipando o pagamento da compra parcelada (geralmente você recebe em 30-45 dias… por ai). E mesmo sem antecipar, eles deveriam receber o valor cheio em 1-2 meses, quitando a dívida com o banco. De onde que sai 20 bilhões daí?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "January 15, 2023, 07:41:51 AM",
      "body": "Exato TryNinja. Não faz sentido dizer que isto é \"culpa\" do cliente que não paga o credito. Existe questões maiores que essas.Outro ponto que eu notei, é que por exemplo o site deles é tipo marketplace, género uma Amazon. Qualquer empresa/loja pode vender os seus produtos no seu site. Quando é assim, eles não tem de comprar o produto nem fazer stocks, visto que isso esta na responsabilidade da empresa vendedora, eles apenas gerem o dinheiro e as encomendas.Sinceramente, a ideia de credito não é a mais correta para justificar o sucedido. Fizerem asneira na gestão da empresa, e agora querem passar a culpa para os consumidores. Daqui a pouco estão a dizer que não tem dinheiro, porque as pessoas não tem ido comprar as suas lojas ou tem de comprado pouco.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "January 15, 2023, 11:31:16 AM",
      "body": "Quote from: joker_josue on January 15, 2023, 07:41:51 AMOutro ponto que eu notei, é que por exemplo o site deles é tipo marketplace, género uma Amazon. Qualquer empresa/loja pode vender os seus produtos no seu site. Quando é assim, eles não tem de comprar o produto nem fazer stocks, visto que isso esta na responsabilidade da empresa vendedora, eles apenas gerem o dinheiro e as encomendas.Joker, só te explicando um pouco melhor sobre a Americanas, ela é uma loja até que antiga já, tem mais de 50 anos (pesquisei aqui a fundação, e é de 1929)Tem mais de 1700 lojas físicas espalhadas pelo país, é uma loja de departamentos, onde vende um pouco de tudo.Com o passar dos anos ela foi investindo nas vendas online, expandindo bastante sua logística, tem seu aplicativo de pagamento, se fundiu com outras lojas online como Submarino e Shoptime e fazem parte de um grupo chamado B2W, em resumo, é uma loja muito conhecida e tradicional da maioria dos brasileiros, tanto fisicamente quanto online.Algum tempo atrás eles começaram com o Marketplace que é isso que você está citando, como a Amazon, além de ter também parcerias com mercados e até lanchonetes como o MC Donalds em algumas cidades, então a empresa é bem grande e atinge muitos setores diferentes. Por isso chamou tanta atenção esse rombo de 20 bilhões que encontraram.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "January 15, 2023, 11:42:57 AM",
      "body": "As Americanas e seus irmãos (Submarino, Shoptime..) realmente são gigantes. Quem lembra dos meus posts sobre os super cashbacks do aplicativo AME? Foi tudo pela Americanas, rsrs. Panela, cadeira, aspirador, maquina de barbear,… tudo por 91% de desconto. Celular eu comprei 4x Samsung S21 por R$ 1100 cada (e vendi por R$ 1700). Comprei iPhone pra revender, Apple Watch, fonte de computador e várias outras coisas. Eles fizeram uma verdadeira liquidação. Talvez queriam angariar mais caixa “emprestado” (o cashback não dá pra sacar direto) para a virada do ano? Faz sentido, já que as maiores promoções foram até o dia 31 de Dezembro. Outra coisa é que roubar doce das Americanas era uma verdadeira tradição brasileira (conheço muita gente que fe isso, e ainda mais na internet). Devem ter contribuído com o rombo nessas décadas…",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "January 15, 2023, 11:44:43 AM",
      "body": "Quote from: joker_josue on January 14, 2023, 01:44:19 PMNão acho que isso tenha sido o motivo da queda da empresa. Claramente foi fruto de muita ma gestão.Bem, aí é achar que todos os jornais do país tão mentindo  Isso q tá em todos os jornais.QuoteMas a compra parcelada não era suportada por uma instituição de credito? Era a própria Amercianas que fazia? Estranho...Por cá, também tem muita loja que faz isso, mas normalmente é via uma instituição de credito, o cliente fica com divida na empresa do credito e não com a loja.Mas o ponto é justamente esse. A instituição de crédito é o banco.Eles chamaram de dívida com o banco de dívidas c fornecedores . Esse foi o problema que gerou tudo.Isso gera problemas contábeis, de rating, de alavangaem, etc.Os bancos quand vão emprestar dinheiro pra empresa  olham o quanto de dívida com bancos a empresa tem. Se ela diz que deve 20bi pra fornecedores em vez de 20 bi pros bancos, isso gera facilidade pra ela.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "January 15, 2023, 10:48:25 PM",
      "body": "Quote from: bitmover on January 15, 2023, 11:44:43 AMMas o ponto é justamente esse. A instituição de crédito é o banco.Eles chamaram de dívida com o banco de dívidas c fornecedores . Esse foi o problema que gerou tudo.Mas, quem devia ficar com a divida é o banco e não a loja. Ou seja, a loja apenas é o intermediário de credito, entre o cliente e o banco. Bem, pelo menos é assim que funciona aqui na Europa. A loja recebe o dinheiro na hora da compra, depois conforme o que ficar acordado, o cliente fica a pagar as contas a instituição de credito/banco. A loja nunca mais vai lidar com essa situação.Por isso, a meu ver isso foi um ato muito má gestão. Quem tudo quer ganhar, tudo perde.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "January 16, 2023, 01:45:51 AM",
      "body": "Quote from: joker_josue on January 15, 2023, 10:48:25 PMMas, quem devia ficar com a divida é o banco e não a loja. Ou seja, a loja apenas é o intermediário de credito, entre o cliente e o banco. Bem, pelo menos é assim que funciona aqui na Europa. A loja recebe o dinheiro na hora da compra, depois conforme o que ficar acordado, o cliente fica a pagar as contas a instituição de credito/banco. A loja nunca mais vai lidar com essa situação.No mundo todo isso é assim. É o modelo de negócios de todos os emissores de cartão (visa, mm, discover, elo, …).Detalhe que ter um adiantamento para pagar fornecedores não explica R$ 40b em débito.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "January 16, 2023, 07:57:38 AM",
      "body": "Quote from: TryNinja on January 16, 2023, 01:45:51 AMDetalhe que ter um adiantamento para pagar fornecedores não explica R$ 40b em débito. Alem disso, normalmente os fornecedores destas grandes empresas recebem em 60-90 dias.Será que eles não andaram a usar o dinheiro para pagar fornecedores, para fazerem investimentos que correram mal?A empresa não vai fechar e vai continuar a ser grande. Mas é pena quando vemos empresas dessas, com uma administração que geriu muito mal, algo tão simples como deixar as coisas trabalhar normalmente que o dinheiro entra.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "January 16, 2023, 10:41:28 AM",
      "body": "Quote from: joker_josue on January 15, 2023, 07:41:51 AMExato TryNinja. Não faz sentido dizer que isto é \"culpa\" do cliente que não paga o credito. Existe questões maiores que essas.O ponto não é esseVoces estão misturando as coisas. Voces estao misturando risco de crédito com quem recebe o dinheiro.Quote from: TryNinja on January 16, 2023, 01:45:51 AMQuote from: joker_josue on January 15, 2023, 10:48:25 PMMas, quem devia ficar com a divida é o banco e não a loja. Ou seja, a loja apenas é o intermediário de credito, entre o cliente e o banco. Bem, pelo menos é assim que funciona aqui na Europa. A loja recebe o dinheiro na hora da compra, depois conforme o que ficar acordado, o cliente fica a pagar as contas a instituição de credito/banco. A loja nunca mais vai lidar com essa situação.No mundo todo isso é assim. É o modelo de negócios de todos os emissores de cartão (visa, mm, discover, elo, …).joker comprou um celular Samsumg a 12x sem juros nas americanas. Dividiu no cartão de crédito. Se o joker nao pagar, ele da calote no cartão e nao nas americanas.O cartão não paga a vista pras americanas, ele paga em 12x pras Americanas.Mas as americanas paga a vista pra samsung. Ela nao pode pagar em 12x pra Samsung, ela recebeu apenas 1 parcela.Entenderam? Dá onde vem esses 11x que estão faltando?Nesse ponto que rola uma nova dívida com o banco, que ela chama de dívida com os fornecedores mas não é.Não me atualizei se tiveram novidades sobre isso no fds, mas até sexta essa que era a sitauçãoQuoteDetalhe que ter um adiantamento para pagar fornecedores não explica R$ 40b em débito. Só mudou o ticker da dívida. Nao apareceram 40b que nao existiam antes  Diferente da FTX, que apareceram novos Bi de divida toda hora.Quote▶️ Forfait: na tradução para o português, risco sacado. É uma linha de crédito que faz uma triangulação entre a empresa, seus fornecedores e uma instituição financeira.Ao contratar o risco sacado, a companhia pede ao seu banco que ele realize o pagamento de uma compra com o fornecedor.Assim, o banco quita o contrato em nome da companhia, que passa a dever para o banco com a cobrança de juros.Pelo que se sabe até o momento, a Americanas fez contratação de risco sacado, mas as operações não foram registradas devidamente nos balanços contábeis.https://g1.globo.com/economia/noticia/2023/01/13/americanas-veja-o-glossario-do-caso-e-entenda-termos-como-forfait-covenants-e-debentures.ghtmlÉ isso que ta em todos os jornais. Não foi o cashback do ninja que quebrou a empresa kkkk isso é meme de instagram.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "January 16, 2023, 11:27:37 AM",
      "body": "Quote from: bitmover on January 16, 2023, 10:41:28 AMVoces estão misturando as coisas. Voces estao misturando risco de crédito com quem recebe o dinheiro.joker comprou um celular Samsumg a 12x sem juros nas americanas. Dividiu no cartão de crédito. Se o joker nao pagar, ele da calote no cartão e nao nas americanas.O cartão não paga a vista pras americanas, ele paga em 12x pras Americanas.Mas as americanas paga a vista pra samsung. Ela nao pode pagar em 12x pra Samsung, ela recebeu apenas 1 parcela.Olha, até onde eu sei você está errado. É exatamente o contrário que acontece.Comprador parcela 12x100Americanas recebe 1200 (menos taxas)Comprador vai pagando o cartão 12x100As Americanas definitivamente não precisam esperar 12x para “quitar” o fornecedor (ou nesse caso, pegar um empréstimo em 12x com o banco).Se esse fosse o caso, NENHUM comerciante ia sobreviver aceitando cartão de crédito. Você compra algo, a lojinha só termina de receber em 12 meses? Creio fortemente que não.No lado do menor comerciante, todo mundo que conheço usa maquininha e bota pea receber em 1 dia ou 30-45 dias.O trabalho da VISA/MM é exatamente tomar esse risco e pagar na hora ou em um curto prazo ao comerciante.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}