{
  "id": "topic_5447579",
  "title": "Greggry",
  "author": "Greggry",
  "created_time": "April 04, 2023, 04:28:25 PM",
  "content": "According Samson Mow; Some people hate Bitcoin with an intensity that doesn’t make sense. You need to ask yourself why, and what exactly Bitcoin threatens for them to behave in this manner.I think some people needs to understand that bitcoin is no man's business concerns. After all nobody is using another man's money to invest. Bitcoin could be greater with time, let's leave the hates about bitcoin.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447579",
  "comments": [
    {
      "author": "Nwada001",
      "created_time": "April 04, 2023, 04:48:12 PM",
      "body": "The same way humans have natural haters, so does Bitcoin. Another thing is that when one cannot subdue you, he is left with two options: either to hate you or to embrace you. Most people will definitely choose to hate you, but that does not mean that their hatred is going to in any way hinder your progress in life. The same thing is applicable to Bitcoin: the more the hate from both small and influential people, the stronger we are getting. They have been doing the hater job for years, which is why Bitcoin has been returning them the favor by growing stronger day after day. And that's okay for us Bitcoiners; we don't care about the hate anymore. More haters will definitely emerge and cause little fuds, but they still can't actually achieve anything from it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "April 04, 2023, 04:57:06 PM",
      "body": "There's a few major reasons why people unreasonably hate Bitcoin. All of them involve a lack of education on the subject.Some people hate it because of mining and they read about how much energy Bitcoin uses and they think it is terrible. If they understood more about PoW and the enormously positive things it can do for the energy industry and renewable energy they would change their mind.Some people hate it because they simply don't understand what it is for. They don't understand that it is organically growing from a single person to mass adoption and it will take time for it to actually be used for buying things. They just see it currently isn't really used to buy things so they think it is useless and must just be useful for criminals or something. They also are under the illusion that money is only something that the government issues so they think Bitcoin must be some kinda of illegal thing or scammy thing pretending to be money.Some people hate it because of the hype and price appreciation. I think this is most people. There are people out there who just hate anything that has a lot of hype because in their mind they equate \"hype\" with \"fake\". So they think Bitcoin is just a hype bubble. And for similar reasons people hate it because it has appreciated in value so much and most people simply think anything that appreciates as much as Bitcoin must be all hype or a scam. People are used to stocks, and the public can't invest in stocks until an IPO at which point the private investors have likely already made thousands of percent on their investments, but during all that time the public doesn't get to see that price appreciation. So they are used to investments they are allowed to view and see as things that have usually already gone through most of their price appreciation. If Bitcoin were a stock it probably wouldn't have IPO'd until like $10k or $20k so those first millions of percent in gains would have been hidden from the public eye, and people would be much less obsessed with hating it because it gains so much in value.Finally there's the crypto bros who are all about crypto apps and random tokens and NFT images and useless meme coins and all that stuff. They hate Bitcoin because someone told them its \"old tech\" and they believed the lie, and the idea of apps is easier for them to understand than the much broader idea of money. They think an app is better than money cuz money is too basic an idea so one of these app tokens must inevitably replace Bitcoin cuz they have an app. It's just classic \"small thinking\". And they also get caught in the crypto-promoted idea that number of transactions is all that matter so they just desperately buy anything that has lots of transaction capacity and think Bitcoin is \"old tech\" because it doesn't. Just a basic lack of understanding of the point of blockchain tech.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pokapoka124",
      "created_time": "April 04, 2023, 07:54:50 PM",
      "body": "It’s obvious the why governments hate it. They are afraid of the revolution it may bring, and how bitcoin can upset the class system. For regular people who say they hate bitcoin, that’s mostly as a result of the information they have been fed by the media and big tech. When you listen to those who are anti-bitcoin share their opinion on the subject, you can tell they do not understand the difference between bitcoin and other cryptocurrencies. Sometimes I think these guys only talk about crypto scams, FTX scandal, mt gox e.t.c and refer to them as bitcoin scams to win their argument. Everything negative that happens in the crypto industry is heaped on bitcoin. I think if more people understood the difference between bitcoin, altcoins and exchanges, a lot of narratives out there would change.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "April 04, 2023, 08:24:03 PM",
      "body": "Using my locality as an example I have noticed the resentment for bitcoin and Crypto-currency has reduced. This isn’t to say that it’s been eliminated but it’s not as it use to be.This shows the world is developing and more people has started to find out the more benefits Crypto-currency offers them. I think the adoption level of Bitcoin would scale up in year to come.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "April 04, 2023, 08:32:45 PM",
      "body": "It is normal for Bitcoin to have someone who hates it as in all things this too is organic.  Even if there is a mass planetary adoption there will always be those who hate it.  People are stupid by nature, that's all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bushdark",
      "created_time": "April 04, 2023, 08:40:54 PM",
      "body": "It is not our business if they keep hating Bitcoin. What ever could be there reason is not our business, all I know is that there hatred against Bitcoin will not do anything to the market even now that it looks like the market is bearish and is about to go bullish. We still don't care what people or the government thinks about us that are cryptocurrency investors, when the market goes bullish more we will be making more money into our portfolio and those haters would still be there crying while we are making more money like we don't earn anything. Live is good when you are a crypto investor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ever-young",
      "created_time": "April 04, 2023, 08:44:04 PM",
      "body": "The most effective haters that Bitcoin has right now are those in the public financial sector (the banking system). They don't just hate Bitcoin because they want to hate it; they hate it because Bitcoin's features are gradually opening the eyes of people against the banking policy. Since they can compete with it, they have to find a way to destroy it. Bitcoin is the greatest trait to the government fiat and banks. So they definitely have thousand of reasons to backup the hatred.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "April 04, 2023, 08:50:39 PM",
      "body": "Quote from: Greggry on April 04, 2023, 04:28:25 PMAccording Samson Mow; Some people hate Bitcoin with an intensity that doesn’t make sense. You need to ask yourself why, and what exactly Bitcoin threatens for them to behave in this manner.I think some people needs to understand that bitcoin is no man's business concerns. After all nobody is using another man's money to invest. Bitcoin could be greater with time, let's leave the hates about bitcoin.I'm sure that if you could investigate you will notice that the majority of people who hates Bitcoin do that out of ignorance, or sees it as another major scam because truly the only haters Bitcoin has are the Government & Central banks who want to always be in control of the masses money, which Bitcoin takes away from them through its decentralized blockchain technology. But the funniest thing is that Bitcoin doesn't give a damn, because the more they hate, the more they indirectly expose Bitcoin to more people (adventurous) who might be hearing of it for the first time and as such wish to give it a try, causing an increase in it's price value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CageMabok",
      "created_time": "April 05, 2023, 08:10:17 AM",
      "body": "Quote from: Greggry on April 04, 2023, 04:28:25 PMAccording Samson Mow; Some people hate Bitcoin with an intensity that doesn’t make sense. You need to ask yourself why, and what exactly Bitcoin threatens for them to behave in this manner.Maybe they have their own reasons for that, but maybe those who behave like that are because of a desire that hasn't been fulfilled through Bitcoin so they choose to hate Bitcoin which is basically nothing wrong. To me this is a very ridiculous behavior because when someone hates Bitcoin, it is almost as if he hates money which basically does nothing wrong. So this is ridiculous, because maybe he is not smart enough in sorting out problems so he has to spread hatred with digital objects created by humans.QuoteI think some people needs to understand that bitcoin is no man's business concerns. After all nobody is using another man's money to invest. Bitcoin could be greater with time, let's leave the hates about bitcoin.It's no longer the time to hate new things or things like Bitcoin because whatever the problem, good technology and one that can help everyone make things easier will continue to be as popular as Bitcoin has been. So now is no longer the time to spread hatred, but now is the time to continue to take advantage of conditions by seeing opportunities that can occur and also trying to increase investment in several places.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Arenga pinnata",
      "created_time": "April 05, 2023, 08:27:54 AM",
      "body": "Quote from: Greggry on April 04, 2023, 04:28:25 PMAccording Samson Mow; Some people hate Bitcoin with an intensity that doesn’t make sense. You need to ask yourself why, and what exactly Bitcoin threatens for them to behave in this manner.I think some people needs to understand that bitcoin is no man's business concerns. After all nobody is using another man's money to invest. Bitcoin could be greater with time, let's leave the hates about bitcoin.Don't be weird about things like that, because in any case there are always those who like it and those who don't like it.That's human nature, diverse and always have different thoughts.and bitcoin is an example, many people like bitcoin, but some people still don't like it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "April 05, 2023, 08:45:53 AM",
      "body": "Quote from: mendace on April 04, 2023, 08:32:45 PMIt is normal for Bitcoin to have someone who hates it as in all things this too is organic.  Even if there is a mass planetary adoption there will always be those who hate it.  People are stupid by nature, that's all.That's insulting, you can't say that people who accept bitcoins are smart people who hate bitcoins or don't use bitcoins are stupid. Everyone has different views on life and different ways of seeing things, not just because they don't think like us, they're stupid. They do not like it for their own reasons, or they are people who do not like innovation, not ready to accept new things. Those people need more time. Like your parents, just because they don't like bitcoin doesn't mean they're dumber than you, they're the ones who gave birth to you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "April 05, 2023, 08:50:33 AM",
      "body": "Quote from: Greggry on April 04, 2023, 04:28:25 PMAccording Samson Mow; Some people hate Bitcoin with an intensity that doesn’t make sense. You need to ask yourself why, and what exactly Bitcoin threatens for them to behave in this manner.The behavior isn't on the basis of awareness of their knowledge. You know that the media of interest people have changed the bitcoin narrative which has turned the public's view negatively as if bitcoin should be fought.QuoteAfter all nobody is using another man's money to invest.Yeah, but people prefer to patronize others especially to save from investment scams even though they've never dealt with one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "April 05, 2023, 09:01:37 AM",
      "body": "Quote from: fuguebtc on April 05, 2023, 08:45:53 AMQuote from: mendace on April 04, 2023, 08:32:45 PMIt is normal for Bitcoin to have someone who hates it as in all things this too is organic.  Even if there is a mass planetary adoption there will always be those who hate it.  People are stupid by nature, that's all.That's insulting, you can't say that people who accept bitcoins are smart people who hate bitcoins or don't use bitcoins are stupid. Everyone has different views on life and different ways of seeing things, not just because they don't think like us, they're stupid. They do not like it for their own reasons, or they are people who do not like innovation, not ready to accept new things. Those people need more time. Like your parents, just because they don't like bitcoin doesn't mean they're dumber than you, they're the ones who gave birth to you.I don't mean this but only that some people have understood well the value and the possibilities that Bitcoin could open up but think that it can harm their finances because they cannot detach themselves from centralized banks and the illusion of traditional financial markets.  All this makes them look stupid here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PIMPdev",
      "created_time": "April 05, 2023, 09:02:38 AM",
      "body": "Quote from: fuguebtc on April 05, 2023, 08:45:53 AMQuote from: mendace on April 04, 2023, 08:32:45 PMIt is normal for Bitcoin to have someone who hates it as in all things this too is organic.  Even if there is a mass planetary adoption there will always be those who hate it.  People are stupid by nature, that's all.That's insulting, you can't say that people who accept bitcoins are smart people who hate bitcoins or don't use bitcoins are stupid. Everyone has different views on life and different ways of seeing things, not just because they don't think like us, they're stupid. They do not like it for their own reasons, or they are people who do not like innovation, not ready to accept new things. Those people need more time. Like your parents, just because they don't like bitcoin doesn't mean they're dumber than you, they're the ones who gave birth to you.I agree with you. Yeah, it definitely applies to some people, but generalization is a bad thing in any way and leads to worse things. It's better to just focus on yourself and do the best you can.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "borovichok",
      "created_time": "April 05, 2023, 09:55:22 AM",
      "body": "Quote from: fuguebtc on April 05, 2023, 08:45:53 AMThat's insulting, you can't say that people who accept bitcoins are smart people who hate bitcoins or don't use bitcoins are stupid. Everyone has different views on life and different ways of seeing things, not just because they don't think like us, they're stupid. They do not like it for their own reasons, or they are people who do not like innovation, not ready to accept new things. Those people need more time. Like your parents, just because they don't like bitcoin doesn't mean they're dumber than you, they're the ones who gave birth to you.There are limited number of people that have a clear idea of what Bitcoin is all about and they invest in it inother to generate passive income at the end of the day. It's existence in crypto is competitive because there's more projects far better when the bull comes. Bitcoin have high rate of dislikes, not because it's not profitable but they have their reasons varies. Bitcoin is a top project and a solid foundation in crypto, we can't do the comparison between the prehistoric and the modern because the world is adapting fast to the new modern era.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "April 05, 2023, 11:17:59 AM",
      "body": "I think it's less hate and more fear. They do not understand it, and they fear it since it's something that may change the way things are. And they fear the change too.There is not much you can really do about it.Using cars as as=n example:If you look back today some people fear / hate electric cars. Decades ago, people feared / hated the fact the the government was taking away their leaded gas for their cars. Before that people feared / hated the modest safety requirements that were being introduced. Going all the way back people feared cars and fought against them since the horse was all the transportation they needed.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "April 05, 2023, 12:15:50 PM",
      "body": "We are humans, we love and hate for no reason, have you ever been in love with someone and you are asked why and the only answer you got is ' I don't know why \"? It is the same thing with hate, that's why humans can never be a perfect beings, we are not made to love only, we cause disaster to even the earth, mother earth that did nothing hateful to us, this is normal human nature. Bitcoin is a threat, I think you need to go understand why, think about the duty of the government for once, or just pretend to be the government, you will understand why you need to hate Bitcoin The Law and Government are in control of everything, except for the decentralized digital currency, called Bitcoin, why wouldn't they be mad for not being able to be in control? By the way, of something that works better than Fiat? Fiat that they keep printing at all times.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "April 05, 2023, 12:23:31 PM",
      "body": "Quote from: Greggry on April 04, 2023, 04:28:25 PMAccording Samson Mow; Some people hate Bitcoin with an intensity that doesn’t make sense. You need to ask yourself why, and what exactly Bitcoin threatens for them to behave in this manner.I think some people needs to understand that bitcoin is no man's business concerns. After all nobody is using another man's money to invest. Bitcoin could be greater with time, let's leave the hates about bitcoin.Hate will remain, and it's everywhere not just to bitcoin. And to say that there have been no person that invests with someone's money, you're wrong with that. We'll never know how many people have invested money that's owned by another person. But I do know that it should go that far for someone to get invested into bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "April 05, 2023, 12:43:13 PMLast edit: April 05, 2023, 01:37:24 PM by 348Judah",
      "body": "Quote from: Greggry on April 04, 2023, 04:28:25 PMAccording Samson Mow; Some people hate Bitcoin with an intensity that doesn’t make sense. You need to ask yourself why, and what exactly Bitcoin threatens for them to behave in this manner.I think some people needs to understand that bitcoin is no man's business concerns. After all nobody is using another man's money to invest. Bitcoin could be greater with time, let's leave the hates about bitcoin.Until we all begins to see bitcoin with the same value and manner if approach we give to fiat, people won't stop saying all sort of garbage about bitcoin because they never tried it and always ready to confuse those using it, we need to understand that bitcoin is a currency and this also double as an asset to us in which fiat currency cannot stand the gap to that, many people have succeeded and live changing for good with bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}