{
  "id": "topic_5411299",
  "title": "Lucius",
  "author": "Lucius",
  "created_time": "August 26, 2022, 09:53:35 AM",
  "content": "User DigitalMonk recently started his digital adventure on this forum and nothing seemed overly suspicious until he opened the following thread How to buy and sell Bitcoin? (archived) in which, as a complete ignoramus who does not know what Bitcoin or blockchain is, he claims the following \"For this purpose I have setup an Offshore Bitcoin transaction platform.\"Accordingly, @LoyceV expressed his doubts, and @DaveF created a flag, and I reported several of his topics in the Bitcoin discussion, which were all marked as bad. Considering the possible bad intentions of this user and the obvious thread spamming with questions that have already been answered hundreds of times and that definitely belong to the low-value topic, I want to warn you not to waste your time answering his questions.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411299",
  "comments": [
    {
      "author": "LoyceV",
      "created_time": "August 26, 2022, 10:03:12 AM",
      "body": "Just another poor guy who's bored on the internet, and hopes someone will use him as a middleman because it is \"completely anonymous and secure\".He's on my Ignore list now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "August 26, 2022, 02:07:51 PM",
      "body": "Quote from: LoyceV on August 26, 2022, 10:03:12 AMJust another poor guy who's bored on the internet, and hopes someone will use him as a middleman because it is \"completely anonymous and secure\".He's on my Ignore list now.There are quite a few people on my ignore list, but sometimes you just see the crap coming from some accounts and feel they need a tag. Some of it is probably based on my mood but I would like to think that having a few neg tags and a flag or 2 will stop someone from getting scammed by them. Can't hurt, the odds of posters like this ever going legit are small and if they do feedback can be changed and flag support can be withdrawn.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "August 26, 2022, 02:40:09 PM",
      "body": "I have followed up this user and I discovered one thing about him. This user has different version of life, he claims to be a monk, he also claimed to be running something related to charity and also well involved in bitcoin. But when posting, he seems to forget the version he presented to the forum and as such his real life version keeps interfering with his forum fake version. This user can therefore not be trusted, I have no option than to support the flag raised against him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "August 26, 2022, 04:04:13 PM",
      "body": "Quote from: KingsDen on August 26, 2022, 02:40:09 PM~snip~I know that there are AI that can already communicate very well in the online world and I remember that there was a discussion about it on the forum posted by @fillippone more than 2 years ago, so I wonder if this post is somewhat right when it claims that this member is actually an AI?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "August 26, 2022, 04:25:36 PM",
      "body": "Quote from: Lucius on August 26, 2022, 04:04:13 PMI wonder if this post is somewhat right when it claims that this member is actually an AI?I don't think so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "August 26, 2022, 06:53:54 PM",
      "body": "Quote from: LoyceV on August 26, 2022, 04:25:36 PMQuote from: Lucius on August 26, 2022, 04:04:13 PMI wonder if this post is somewhat right when it claims that this member is actually an AI?I don't think so.Not an AI, his words are very much connected at every point in the communication. Just that he believes that he has some kind of  super-powers in the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "August 26, 2022, 06:55:07 PM",
      "body": "Quote from: LoyceV on August 26, 2022, 10:03:12 AMJust another poor guy who's bored on the internet, and hopes someone will use him as a middleman because it is \"completely anonymous and secure\".He's on my Ignore list now.I hope you're right, but that thread seems far more nefarious than mere boredom would explain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "August 26, 2022, 08:37:39 PM",
      "body": "The scammers! They come in all different colors, don't they?The profile deserves the flag raised, warning newbies to keep away from the con artist and his bullshit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "September 01, 2022, 02:44:11 PM",
      "body": "Digital Monk Troll is at it again! The self-proclaimed Bitcoin ambassador has started a thread to appoint himself as an official representative of the cryptocurrency, which he claims will earn him $160,000 per year. A Job for Life: Bitcoin Ambassador - Salary: US $160,000 DollarsWhat's more, there is also this:Quote from: DigitalMonk on September 01, 2022, 12:34:07 PMI will also appoint another 300 Bitcoin Ambassadors who are interested to work in the Bitcoin Embassy in a Official capacity. If any one want to become a Bitcoin Ambassador and work with me as a fellow Bitcoin Ambassador then you are invited to contact me. Do not worry about who is going pay the salary to the 300 Bitcoin Ambassadors ? That is my duty to find money to pay you for your work as an official Bitcoin Ambassador. There will be a budget for each Ambassador who will be commissioned to go to a foreign country and work closely with government and central Bank. Although I was initially willing to give this member the benefit of the doubt for asking those newbie questions, it is now clear that this is just a troll account or someone with some serious medical issues. Whatever the case may be, I think it is time for the mods to take some kind of action here. This person clearly has no interest in helping anyone or learning anything, and is just here to troll.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "September 01, 2022, 03:07:59 PM",
      "body": "Quote from: FatFork on September 01, 2022, 02:44:11 PMDigital Monk Troll is at it again! The self-proclaimed Bitcoin ambassador has started a thread to appoint himself as an official representative of the cryptocurrency, which he claims will earn him $160,000 per year. A Job for Life: Bitcoin Ambassador - Salary: US $160,000 DollarsWhat's more, there is also this:Quote from: DigitalMonk on September 01, 2022, 12:34:07 PMI will also appoint another 300 Bitcoin Ambassadors who are interested to work in the Bitcoin Embassy in a Official capacity. If any one want to become a Bitcoin Ambassador and work with me as a fellow Bitcoin Ambassador then you are invited to contact me. Do not worry about who is going pay the salary to the 300 Bitcoin Ambassadors ? That is my duty to find money to pay you for your work as an official Bitcoin Ambassador. There will be a budget for each Ambassador who will be commissioned to go to a foreign country and work closely with government and central Bank. Although I was initially willing to give this member the benefit of the doubt for asking those newbie questions, it is now clear that this is just a troll account or someone with some serious medical issues. Whatever the case may be, I think it is time for the mods to take some kind of action here. This person clearly has no interest in helping anyone or learning anything, and is just here to troll.Quote from: DigitalMonk on September 01, 2022, 01:45:38 PMHey ! As you sow, so shall you reap. I am trying to promote Bitcoin officially and few of you disturbing me. For what reason you are disturbing a Digital Monk who has just decided to beco.e become the first official Bitcoin Ambassador for taking Bitcoin in the next stage ? As you can see, it only amuses him. A sick troll who will only increase his bullshit the more we react to him.He has a negative tag, and also has a flag, everything that the community could do to warn about the adequacy of this person has been done.There is only one way out, ignoring his posts, or regularly reporting to moderators. While we feed him, he enjoys.I think that any normal person will always avoid various jerks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "September 01, 2022, 04:11:56 PM",
      "body": "Quote from: DireWolfM14 on August 26, 2022, 06:55:07 PMI hope you're right, but that thread seems far more nefarious than mere boredom would explain.  Still haven't slept yet, and earlier today when I was even more maniacally deprived of it I wrote this in that thread he created about a new section:Quote from: The Pharmacist on August 31, 2022, 10:52:35 PMI'll give credit to OP for being a newbie who's very passionate and inquisitive about bitcoin (I'm trying to just take his posts and rank at face value and not assume he's an alt account).  Based on his post history, this looks to be a genuine request to improve the forum and not some ignorant noob, although it would have been much better had he indeed noticed the Trading Discussion section, among others, which will probably suit him just fine.I chose my words very carefully, because for whatever reason I had an itch in my gut that was telling me that taking this dude at face value might be the wrongest of wrong actions.  I've been fooled by fools, cretins, halfwits, lobotomy cases, humans with knives, various animals with either charm or claws, and I don't ever see that trend having an inflection point in my favor.  Oh well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "September 01, 2022, 05:11:16 PM",
      "body": "Quote from: The Pharmacist on September 01, 2022, 04:11:56 PMQuote from: DireWolfM14 on August 26, 2022, 06:55:07 PMI hope you're right, but that thread seems far more nefarious than mere boredom would explain.  Still haven't slept yet, and earlier today when I was even more maniacally deprived of it I wrote this in that thread he created about a new section:Quote from: The Pharmacist on August 31, 2022, 10:52:35 PMI'll give credit to OP for being a newbie who's very passionate and inquisitive about bitcoin (I'm trying to just take his posts and rank at face value and not assume he's an alt account).  Based on his post history, this looks to be a genuine request to improve the forum and not some ignorant noob, although it would have been much better had he indeed noticed the Trading Discussion section, among others, which will probably suit him just fine.I chose my words very carefully, because for whatever reason I had an itch in my gut that was telling me that taking this dude at face value might be the wrongest of wrong actions.  I've been fooled by fools, cretins, halfwits, lobotomy cases, humans with knives, various animals with either charm or claws, and I don't ever see that trend having an inflection point in my favor.  Oh well.Nope, I would just file him under nutjob troll and move on. I don't think he is going to be able to scam people at this point no matter how hard he tries,His lack of knowledge along with general troll like posts will probably keep most people away but you never know. May be able to waste some peoples time but that should be about it.Disappointed that more people are using neutral feedback instead of negative, but so be it. -Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "September 01, 2022, 05:19:20 PM",
      "body": "Quote from: DaveF on September 01, 2022, 05:11:16 PMDisappointed that more people are using neutral feedback instead of negative, but so be it. I think that it's not negative feedback he needs, instead reporting for trolling.This way he should face at least a temporary ban.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "September 02, 2022, 03:05:06 PM",
      "body": "Quote from: DaveF on September 01, 2022, 05:11:16 PMDisappointed that more people are using neutral feedback instead of negative, but so be it. I am very careful with negative feedback, and in this case (so far) it did not seem to me that the user in question deserved it, although there is a very fine line between the fact that you use negative feedback and some other neutral feedback. @NeuroticFish is on track with what I agree with, although some mods disagreed with a few of my reports. However, the option is to ignore or report to the moderator, and I agree that we should not enter into discussions with him because it makes no sense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "September 02, 2022, 08:38:14 PM",
      "body": "Quote from: DaveF on September 01, 2022, 05:11:16 PMDisappointed that more people are using neutral feedback instead of negative, but so be it. I don't use feedback on that user, but I have support the Active flags what you made in his profile.After I read the topic created by DigitalMonk on this one: A Job for Life: Bitcoin Ambassador - Salary: US $160,000 Dollars then I can really think that he really is a person with a high level of delusion. I'm untrusted with what he said, he forgot that bitcoin doesn't need someone like him to be a brand ambassador.Now it seems that this suits him [~].",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DooMAD",
      "created_time": "September 04, 2022, 03:27:50 PM",
      "body": "Certainly doesn't strike me as being of sound mind.  Totally irrational nonsense being spewed in this topic:  https://bitcointalk.org/index.php?topic=5412217.msg60881430#msg60881430",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "September 05, 2022, 08:32:52 AM",
      "body": "There is something seriously wrong with that guy. The movie Split with James McAvoy comes to mind. Maybe it's multiple personality disorder. We have one person who is trying to learn about Bitcoin, another one who is an official Bitcoin ambassador working out of the official embassy of Bitcoin (in Narnia or some please like that), and a third one who developed an offshore trading platform and wants to talk to Satoshi (probably to teach him about Bitcoin). The best thing to do is to simply ignore him and let him get sick of the forum and leave.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iron Fist",
      "created_time": "September 05, 2022, 10:19:09 AM",
      "body": "Quote from: Pmalek on September 05, 2022, 08:32:52 AMThere is something seriously wrong with that guy. The movie Split with James McAvoy comes to mind. Maybe it's multiple personality disorder. We have one person who is trying to learn about Bitcoin, another one who is an official Bitcoin ambassador working out of the official embassy of Bitcoin (in Narnia or some please like that), and a third one who developed an offshore trading platform and wants to talk to Satoshi (probably to teach him about Bitcoin). The best thing to do is to simply ignore him and let him get sick of the forum and leave.  Whatever he is, he's doing a very convincing job at trolling. Some of the things he says are out of place, they're totally irrelevant to the conversation and aren't things you'd expect to hear someone say in everyday life. Either he's a multiple personality disorder patient who takes his other personalities out for a spin online or... maybe a bit farfetched… but, Is it possible that it might be an AI or a bot of some kind?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "September 05, 2022, 10:34:50 AM",
      "body": "Quote from: Iron Fist on September 05, 2022, 10:19:09 AMEither he's a multiple personality disorder patient who takes his other personalities out for a spin online or... maybe a bit farfetched… but, Is it possible that it might be an AI or a bot of some kind?Or just 2 different people sharing the same account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}