{
  "id": "topic_5450086",
  "title": "FloDu66",
  "author": "FloDu66",
  "created_time": "April 25, 2023, 08:13:04 AM",
  "content": "Good morning,What cable are you using for the power supply?Personally until today use a C19 / 3×1.5 mm² 16 A power cable, however it has started to blacken and burn the electrical outlet. By educating me more deeply, by telling me that it needed 3 × 2.0 mm² of 20 A, unfortunately all the searches done on Google or even chatGPT, impossible to find one of its diameters there.Hence my question, what cable are you using?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450086",
  "comments": [
    {
      "author": "DaveF",
      "created_time": "April 25, 2023, 11:18:15 AM",
      "body": "With the obligatory unless you have just about free power you are loosing money every day you run that miner.1) Search for C19 12AWG (12 AWG is a little bit over 2mm for 10AWG which is larger still) don't look for the amps or 2mm since the wire gauge thickness is not in exact mm2) Where are you located? That is going to matter here in the US there are a bunch of options to get them, other places there might not be as many.3) Take look at https://tripplite.eaton.com/products/power-cords~5  get some part numbers and search from there.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "April 25, 2023, 02:39:21 PM",
      "body": "3 × 2.0 mm² of 20 A that you mention is the recommended one if you use below on the recommended it would cause overloaded that can melt wires. Even on Antminer units, you should use the higher gauge to avoid this issue.Another thing is it's just a size you need to look for 13AWG or above.Unless even you use a higher gauge cord and the cord still melts and burns there's another reason why it burns/melts like shorted PSU or loose connection that can cause the wire to heat up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FloDu66",
      "created_time": "April 25, 2023, 04:50:56 PM",
      "body": "The cable I'm looking for apparently doesn't exist, I don't really know how to do it without taking risks. Those who have a similar machine a little over 3000 W, how do you power your machines (excluding those who have 2 outgoing cables)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "April 25, 2023, 09:55:56 PM",
      "body": "You do not say where you are. But, here in the US just about every hardware store will sell 10 / 3 (10 AWG 3 Conductor cable) and you can then buy the ends and make it yourself. Even amazon sells it:https://www.amazon.com/GearIT-Portable-Power-Cable-Feet/dp/B0BGMXHV8C/?th=1https://www.amazon.com/BLUEXIN-adapter-Rewirable-Connector-adaptor/dp/B07CWPQY6J    (that's a 16A / 20A) end but you should be able to get a 20A with a bit of looking.You may have to hunt but they are out there, once again in the US. Also look at granger.com and a few other places.But, as BitMaxz says. There might be another issue.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "April 25, 2023, 11:02:16 PM",
      "body": "Quote from: DaveF on April 25, 2023, 09:55:56 PMYou do not say where you are. But, here in the US just about every hardware store will sell 10 / 3 (10 AWG 3 Conductor cable) and you can then buy the ends and make it yourself. I believe him because none of those cables are available in my country, even the connectors are not up for the task when powering my power-hungry what miners (15-16amps).OP you are going to need to buy the cable online, I do have a great source in China but they won't sell small quantities so just get it online if you can.Quote from: BitMaxz on April 25, 2023, 02:39:21 PM3 × 2.0 mm² of 20 A that you mention is the recommendedSorry but recommended by who? The recommended wire size for his 3.3kw load on 220v is 2.5 mm2 60c (at least that's the case in the U.S), Whatsminer, however, will ship their 3.3-3.4kw gears with 2mm2 cables which anyone who follows the code would not use, you will run into an issue with your insurance company if shit hits the fan, also it doesn't have to be 3x, since the ground wire could be made smaller and I have seen such cables many times, searching for 3x something for cables online is usually a bad idea, the correct search term is 19C 2.5mm2 power cord.So to make a long story short for OP.The minimum is 2.0mm2 for your load (it will work, won't get hot, and it's ok in some countries, not ok in some).The Perfect is 2.5mm2((it will work, won't get hot, okay in ALL countries).Oh, and if you are going to shop on U.S based store, the 2.5mm2 is called 14AWG.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FloDu66",
      "created_time": "April 27, 2023, 09:54:26 AM",
      "body": "Impossible to find the suitable cable, nor the components to be able to manufacture it myself. Knowing that it is used in Europe",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hymperion",
      "created_time": "April 27, 2023, 10:18:22 AM",
      "body": "you can try here if you where in europe:https://www.fs.com/it/c/power-cords-1343?page=1&plug-type=23709",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}