{
  "id": "topic_5419617",
  "title": "Babydogeloncoin",
  "author": "Babydogeloncoin",
  "created_time": "November 06, 2022, 01:14:02 PM",
  "content": "Babydogeloncoin new gemhttps://poocoin.app/tokens/0xc7086cd4dff0653aa62dfb0e5535235b0784f9d9",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5419617",
  "comments": [
    {
      "author": "TastyChillySauce00",
      "created_time": "November 07, 2022, 11:56:37 PM",
      "body": "I just wanna tell you the truth. Dogelon already exist in the market and that was a shitty project with no utility and nothing to be offer. It was only using shillers to fool others while your token has even more shittiest than dogelon caused by i guess you do know that if dogelon was a scam token and then you are forking scam token. It was not even a new gem but it's a new scam token. Forking the scam token was the dumbest thing that i have ever seen as an old crypto users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "November 08, 2022, 08:20:39 AM",
      "body": "I have tried to search little information about this project but i couldn't find any useful info please would you be willing to share more information instead of just sharing poocoin tracker.What are you project information, media handles or possibly the whitepaper.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "November 08, 2022, 08:18:29 PM",
      "body": "Too much for another meme coin, everyone should give up with that attitude for being hopeful for another meme coin. Well, another miracle might happen for these coins but don't be hopeful that the same thing might just as the popular meme coins that have been before.What's next if this coin didn't become successful? BabyDogeCoinElonCoin and so on and so forth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ararbermas",
      "created_time": "November 09, 2022, 03:32:26 AM",
      "body": "A new gem for a newbie that don't have any significant information about the projects. Lol stop believing on such way mate because these days meme coins is nothing especially if they are new in the market and still don't have progress and data that can prove they are very promising in the future , they're unpredictable tbh so always too good to be true before jumping in any projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitterguy28",
      "created_time": "November 09, 2022, 07:35:37 AM",
      "body": "Quote from: Adbitco on November 08, 2022, 08:20:39 AMI have tried to search little information about this project but i couldn't find any useful info please would you be willing to share more information instead of just sharing poocoin tracker.What are you project information, media handles or possibly the whitepaper. actually another Shitcoin that will eventually scam investors , look at OP's activities here?https://bitcointalk.org/index.php?action=profile;u=3515435;sa=showPostsPosting multiple same thread but never care putting anything that will have our interest aside from Name dropping.this project will again for newbies that knows nothing but greediness .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "November 09, 2022, 03:10:24 PM",
      "body": "I think this isn't funny, and I do not think that this is a shitcoin. You know why? Because, people who think that dogecoin is legit, or shiba is legit, thinks this is funny. I believe dogecoin is a shitcoin, I believe shiba is a shitcoin as well, and yet so many millions of people disagree with me and keep on investing into those, and yet somehow find this one not real?It’s obvious that this is a troll project, nobody will invest, or at least not that many people will, but the reality is that, this project is as \"legit\" as doge or shiba, it’s a meme thing and shouldn't get a dime from your pocket and you invest into those and not into this, they are the same.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wheelz1200",
      "created_time": "November 09, 2022, 10:44:59 PM",
      "body": "Quote from: Babydogeloncoin on November 06, 2022, 01:14:02 PMBabydogeloncoin new gemhttps://poocoin.app/tokens/0xc7086cd4dff0653aa62dfb0e5535235b0784f9d9Are you people serious with this garbage?  Baby doge elon coin?  Do people really sink real money into projects with names so rediculous?  What is the point of building these coins besides to steal money from people?  I'd seriously like to know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "November 09, 2022, 11:24:37 PM",
      "body": "Quote from: el kaka22 on November 09, 2022, 03:10:24 PMI think this isn't funny, and I do not think that this is a shitcoin. You know why? Because, people who think that dogecoin is legit, or shiba is legit, thinks this is funny. I believe dogecoin is a shitcoin, I believe shiba is a shitcoin as well, and yet so many millions of people disagree with me and keep on investing into those, and yet somehow find this one not real?It’s obvious that this is a troll project, nobody will invest, or at least not that many people will, but the reality is that, this project is as \"legit\" as doge or shiba, it’s a meme thing and shouldn't get a dime from your pocket and you invest into those and not into this, they are the same.Yes, just because those coins have gained the support from a lot of people it does not change their nature at all, they are shitcoins and they are as legitimate as the thousands of shitcoins we have in the market, now about the coin in particular being promoted by the OP the only thing I can say that this is probably one of most uninspired attempts to try to hype a coin I remember, at least in the many previous attempts I have seen the people behind the coin do the best they can to hype their coin, but in this case the attempt to promote it is so weak that I will be surprised if a single person invest their money in this useless coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tygeade",
      "created_time": "November 10, 2022, 06:41:35 AM",
      "body": "Quote from: bitterguy28 on November 09, 2022, 07:35:37 AMQuote from: Adbitco on November 08, 2022, 08:20:39 AMI have tried to search little information about this project but i couldn't find any useful info please would you be willing to share more information instead of just sharing poocoin tracker.What are you project information, media handles or possibly the whitepaper. actually another Shitcoin that will eventually scam investors , look at OP's activities here?https://bitcointalk.org/index.php?action=profile;u=3515435;sa=showPostsPosting multiple same thread but never care putting anything that will have our interest aside from Name dropping.this project will again for newbies that knows nothing but greediness .That’s not really shocking, look at the name. I remember back in ICO periods there was a guy who started an ICO and just straight up said \"buy something to X ico\" whoever he was, forget his name so said X instead.And people actually invested 200k+ into it, not because they really wanted to give him that much money, maybe a few did, but because they believed maybe this would go viral and the price of that coin would skyrocket as well. Obviously it did not, but that dude got 200k+ dollars. I am guessing that its quite similar subject here as well, it’s a shitcoin but all meme tokens are shitcoins in my eye, so he probably hopes people would fall for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "savetheFORUM",
      "created_time": "November 10, 2022, 05:56:22 PM",
      "body": "Quote from: aubert on November 07, 2022, 11:56:37 PMI just wanna tell you the truth. Dogelon already exist in the market and that was a shitty project with no utility and nothing to be offer. It was only using shillers to fool others while your token has even more shittiest than dogelon caused by i guess you do know that if dogelon was a scam token and then you are forking scam token. It was not even a new gem but it's a new scam token. Forking the scam token was the dumbest thing that i have ever seen as an old crypto users.  That was dogelon but this coin here was babydogelon. Though that doesn't justify as a new coin. These coins with \"baby\" \"Elon\" and  \"doge\" on their names are all shitcoin and their era was over.OP is very late to share this coin here. I don't know if he is the creator of this or he is the one who lost money on this coin. He hopes that the coin can recover by sharing it here and then using the term \"gem\" but I don't think he can convince the people on here. The real gem are the coins with real potential. They have solid use cases but are simply lack on exposure. It could be budget problems. This is why hunting them is not easy but very worth it once found.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "November 11, 2022, 09:02:37 AM",
      "body": "Sentence always used by shitscoinsHow can it be said that gem even to provide adequate information about the roadmap, developer and all important things that should be known by potential investors is not available at all.Your coin creation only aims to profit from the world of crypto there will be no important things that are useful in its development",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "November 19, 2022, 09:19:24 AM",
      "body": "Quote from: wheelz1200 on November 09, 2022, 10:44:59 PMQuote from: Babydogeloncoin on November 06, 2022, 01:14:02 PMBabydogeloncoin new gemhttps://poocoin.app/tokens/0xc7086cd4dff0653aa62dfb0e5535235b0784f9d9Are you people serious with this garbage?  Baby doge elon coin?  Do people really sink real money into projects with names so rediculous?  What is the point of building these coins besides to steal money from people?  I'd seriously like to know.-I don't know how could project like this will even gain single investor , when the name itself is like created by toddlers  Elon  will not collaborate with this kind  of introduction , and mature enough to seek for something better than using His name for possible scamming.even if this is the last project remains? never that I will put a single cent for sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "November 19, 2022, 03:39:33 PM",
      "body": "I prefer to buy Dogecoin over that coin because at least Dogecoin still has the potential to increase higher than the new coin. But it seems he prefers the new coin over looking for coins that already have a good position in the market. We can only advise him not to invest in new coins that do nothing but pumping and dumping. So be careful if you want to stay invested in the coin and use the money you can afford.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shinratensei_",
      "created_time": "November 20, 2022, 04:14:56 PM",
      "body": "It seems like that new shiller from another shit token was attacking again. this has been a year since some shit tokens were actively using their shillers army to make various advertisement about their garbage tokens but that doesn't seem to be useful at all. I think that this token have the same fate like dogelon. it's already abandoned and so many people felt disappointed with their decision to support this scam token. gamblers are still buying the scam token like that",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "November 22, 2022, 10:34:53 PM",
      "body": "The creators of this shithcoin apparently thought that if you put in the name well-known words in the memcoin world, be it doge, elon, inu, etc., it should suddenly become a new gem. The project is essentially a copy of copies of thousands of similar memcoins, so this is not another gem, this is another shithkoin with no future. The market will give birth to thousands more similar projects and every founder of such a shithcoin will think that this is the next gem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "babygun",
      "created_time": "November 22, 2022, 11:17:08 PM",
      "body": "Quote from: btc78 on November 19, 2022, 09:19:24 AMI don't know how could project like this will even gain single investor , when the name itself is like created by toddlers  Elon  will not collaborate with this kind  of introduction , and mature enough to seek for something better than using His name for possible scamming.even if this is the last project remains? never that I will put a single cent for sure.You would be surprised how many people will still invest in scam projects like this... People don't do their research, think they can get rich quickly, get greedy and will invest in projects like this. In 99.5% of the times they will loose all their money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Quidat",
      "created_time": "November 22, 2022, 11:51:21 PM",
      "body": "Quote from: babygun on November 22, 2022, 11:17:08 PMQuote from: btc78 on November 19, 2022, 09:19:24 AMI don't know how could project like this will even gain single investor , when the name itself is like created by toddlers  Elon  will not collaborate with this kind  of introduction , and mature enough to seek for something better than using His name for possible scamming.even if this is the last project remains? never that I will put a single cent for sure.You would be surprised how many people will still invest in scam projects like this... People don't do their research, think they can get rich quickly, get greedy and will invest in projects like this. In 99.5% of the times they will loose all their money.One of the main reasons on why scammers and fraudsters do make out money on this market is on creating something which is really tied up on the current trend on which there are fools specially newbies and greedy ones who do really continue on buying up these coins even its really just too obvious that these are just scam ones.People should really be that careful because these are just moneygrabs.Some do really love to play with fire and most of the time they get burnedand surprisingly they never ever learn. lol",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "November 23, 2022, 05:11:29 AM",
      "body": "Quote from: babygun on November 22, 2022, 11:17:08 PMQuote from: btc78 on November 19, 2022, 09:19:24 AMI don't know how could project like this will even gain single investor , when the name itself is like created by toddlers  Elon  will not collaborate with this kind  of introduction , and mature enough to seek for something better than using His name for possible scamming.even if this is the last project remains? never that I will put a single cent for sure.You would be surprised how many people will still invest in scam projects like this... People don't do their research, think they can get rich quickly, get greedy and will invest in projects like this. In 99.5% of the times they will loose all their money.I may not be surprised mate because I know that there are greedy people here that still interested in projects like this and that is not a good idea .let them lost with their investment and let us be safe to not investing in something stupid like this.try not to be lured by this scammers because they are not concern to what would be the outcome of our trust.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AzamNurWahid",
      "created_time": "November 23, 2022, 05:49:30 AM",
      "body": "Quote from: btc78 on November 23, 2022, 05:11:29 AMQuote from: babygun on November 22, 2022, 11:17:08 PMQuote from: btc78 on November 19, 2022, 09:19:24 AMI don't know how could project like this will even gain single investor , when the name itself is like created by toddlers  Elon  will not collaborate with this kind  of introduction , and mature enough to seek for something better than using His name for possible scamming.even if this is the last project remains? never that I will put a single cent for sure.You would be surprised how many people will still invest in scam projects like this... People don't do their research, think they can get rich quickly, get greedy and will invest in projects like this. In 99.5% of the times they will loose all their money.I may not be surprised mate because I know that there are greedy people here that still interested in projects like this and that is not a good idea .let them lost with their investment and let us be safe to not investing in something stupid like this.try not to be lured by this scammers because they are not concern to what would be the outcome of our trust.Yes... it's better for us to invest in coins that already have value, such as eth and bnb, in unpredictable times like today.  We should never play around with investments that result in spending the funds we have",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}