{
  "id": "topic_5397955",
  "title": "jerry0",
  "author": "jerry0",
  "created_time": "May 09, 2022, 11:44:22 PM",
  "content": "Say you want to send a small amount of crypto say 5 dollars usd worth... with the lowest fee possible... how much is it terms of usd wise to send BTCBCHLTCat the moment?What site do you check?  Saw one site that shows sending these are the average fees.  Accurate?BTC  0.000058 BTC ($1.81)BCH  0.000018 BCH ($0.0042) LTC  0.00018 LTC ($0.014)Know you can adjust the sending fees on nano ledger for sending btc such as for low, medium or high.  But if you were to send BCH or LTC, what would you input for the sending fee?  Does the lowest fee you put still fast for BCH and LTC?  Always heard LTC is very fast.  Because if that is the case, why would anyone use BTC to send 5 dollars to someone or a site if they can use BCH or LTC and pay a penny?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5397955",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "May 09, 2022, 11:57:42 PM",
      "body": "For Bitcoin, you can use https://mempool.space/ and the 0.000058 BTC($1.81) is very expensive than the calculation on mempool which is around $0.04.And the transaction fee also depends on the size of the transactions if use the segwit wallet you can pay cheaper than using a legacy wallet.If you are looking for a site where you can get recommendations about fees you can use https://blockchair.com/ and check every explorer BCH and LTC for fee estimator or recommendation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jerry0",
      "created_time": "May 10, 2022, 12:09:36 AM",
      "body": "Got those fee numbers from another site.okay so btc sending fees right now are very low if you choose low or medium priority.  How do you check what was the low/medium/high sending fees previously like say hours earlier or week earlier.  Can you check that with mempool or its always a current sending fee now?What exactly do you click on to check current BCH and LTC sending fees?  So basically from highest to lowest in fees... its always BTC, LTC and then BCH?  LTC seem to always be few cents from what i recall?  But BCH is at most one cent always?  So if you were to send small amounts to someone... say 5 dollars or less, it makes sense to use BCH or LTC usually?  Because even as low as the BTC sending fee is now... normally its bit higher?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "May 10, 2022, 01:25:10 AM",
      "body": "Quote from: jerry0 on May 10, 2022, 12:09:36 AMokay so btc sending fees right now are very low if you choose low or medium priority.  It depends on the wallet you used, if you use closed source wallet or a wallet with bad fees estimator, they will charge more than it's needed. Moreover if you use exchange, don't surprised they charge above $10.QuoteHow do you check what was the low/medium/high sending fees previously like say hours earlier or week earlier.  Can you check that with mempool or its always a current sending fee now?You can check it on the mempool and click the specific time you wanted to see https://jochen-hoenicke.de/queue/#BTC,24h,weight the fees isn't depends on the network alone. Addresses type, input, output, etc also the factors.QuoteSo if you were to send small amounts to someone... say 5 dollars or less, it makes sense to use BCH or LTC usually?  Because even as low as the BTC sending fee is now... normally its bit higher?  Yeah, why not? (but I wouldn't hold scam coin e.g. BCH) however if you've learn LN network and done set up it, you can send Bitcoin with cheaper fees like LTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jerry0",
      "created_time": "May 10, 2022, 01:48:51 AM",
      "body": "LN i assume is lightning network.  Don't have clue about this.  But if i were to send btc from nano ledger and its in segwit... that is okay?Well i want to know if it make sense to get LTC instead if i would send LTC to someone and don't want to pay a lot on fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lornadane",
      "created_time": "May 10, 2022, 03:02:42 AM",
      "body": "Quote from: jerry0 on May 10, 2022, 01:48:51 AMLN i assume is lightning network.  Don't have clue about this.  But if i were to send btc from nano ledger and its in segwit... that is okay?Well i want to know if it make sense to get LTC instead if i would send LTC to someone and don't want to pay a lot on fees.Of course it makes sense because the shipping fee is also not too expensive so I think you will get it back. But if you go through the nano ledger, I don't know because it has a different system.Try it maybe you will wait for a change in the procedure or the system so that you get a cheaper fee too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "May 10, 2022, 03:05:05 AM",
      "body": "Transaction fee only makes sense for you if you store your coins in non custodial wallets. If you store your coins on exchanges, you won't be able to customize fee rates. Exchanges usually charge very expensive withdrawal fees and they don't mind to change it when fee on networks is cheaper.They set up a static withdrawal fee and very rarely update it. Usually they only update it if they want to increase withdrawal fee on their platforms.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "May 10, 2022, 09:19:51 AM",
      "body": "Quote from: jerry0 on May 10, 2022, 12:09:36 AMHow do you check what was the low/medium/high sending fees previously like say hours earlier or week earlier. It doesn't matter what it was in the past. You can't go back into the past and send your transaction a week ago. Previous data can also not be used to foretell the future.    Quote from: jerry0 on May 10, 2022, 01:48:51 AMWell i want to know if it make sense to get LTC instead if i would send LTC to someone and don't want to pay a lot on fees. How are you going to get that LTC? You need to buy it somewhere, right? An exchange maybe? Exchanges have trading fees + they have withdrawal fees. Not to mention minimum trading amounts. Chances are you wont even be able to exchange such a small amount or even withdraw it if it's below the withdrawal limit. It makes no sense exchanging $5 worth of BTC for LTC because you will pay the same or maybe even more in fees.Are you going to buy it with a credit card or your bank account? There are fees there as well + a cut by the platform you are buying at because no service is free.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jerry0",
      "created_time": "May 10, 2022, 06:40:30 PM",
      "body": "Going to get tiny amount of LTC... think between 25 and 50 dollars from a site.  They do not charge any fees at all.  Reason is because they are a gambling site and they charge no fees at all.  Don't believe they allow a 5 dollar withdraw and minimum is at least 25 or 50 dollars.After i receive the LTC, i will do a 5 dollar LTC transfer to someone because i want to order something.  Then probably make few more 5 dollar LTC purchases later on.  So based on that, i want to know what is the best way for me to save on transaction costs.  Or should i just use btc to order something and pay the sending fees that way?  The reason why i want to use LTC is because if i use btc to pay that person or site, couldn't they see my transaction history of my btc from my nano ledger s?  Thus i want to stay more anonymous... so i figure since if i pay them with LTC, well that wallet would have at most 50 dollars and if they want to check my wallet history later on, well it won't have much there.  Does that make sense?  So since i use a nano ledger s for btc, wouldn't there be some privacy issues because if i send say 5 dollars worth of btc... they could see... hey my previous receiving transaction was say me receiving around 2000 usd worth of btc?Now i do use a new receiving address each time i receive btc... so would privacy and transaction history be visible to the person i would send btc to?  Now if this is a new btc wallet on say electrum for example... and say i receive 50 dollars worth of btc... then send 5 dollars to the other person, well i don't care much because they could see i only had one transaction and its 50 dollars only.  Thus i want to show the wallet i send btc or ltc from is like from an everyday spending wallet... as oppose to holding wallet.  So thoughts on this?So i want to not only save money on sending costs... but i want privacy.  i want to either send btc or ltc from an address where if you check the history, you don't see more than say 50 dollars total going through that address.  But ltc seem to be always cheap as a penny.What should i do here?  Don't mind even a mobile wallet on my iphone for this as i want the wallet that im sending from to be like a spending wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "May 11, 2022, 12:18:21 PM",
      "body": "How many confirmations are required for BCH and LTC? And would these coins be able to meet these low fees if their network was just as crowded as Bitcoin?The reason for the low fees for these currencies is that they have a lot of empty blocks and therefore if they witness an expansion like what happened in Bitcoin only these \"low fees\" will collapse.Don't forget that you can use the Lightning Network and you will get very low fees and faster confirmations than most altcoins.All this if we ignore price fluctuations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "masterrex",
      "created_time": "May 11, 2022, 12:38:28 PM",
      "body": "Quote from: jerry0 on May 09, 2022, 11:44:22 PMSay you want to send a small amount of crypto say 5 dollars usd worth... with the lowest fee possible... how much is it terms of usd wise to send BTCBCHLTCat the moment?What site do you check?  Saw one site that shows sending these are the average fees.  Accurate?BTC  0.000058 BTC ($1.81)BCH  0.000018 BCH ($0.0042) LTC  0.00018 LTC ($0.014)Know you can adjust the sending fees on nano ledger for sending btc such as for low, medium or high.  But if you were to send BCH or LTC, what would you input for the sending fee?  Does the lowest fee you put still fast for BCH and LTC?  Always heard LTC is very fast.  Because if that is the case, why would anyone use BTC to send 5 dollars to someone or a site if they can use BCH or LTC and pay a penny?Yeah, I made a transaction recently with both coins BCH and LTC from a non-costudial wallet, and based on my experience I can say that those transaction fees were accurate in both coins, But bitcoin transaction fees were slightly higher compared to that input. I guess it depends on your wallet because in my wallet there are three options while sending it was slow, fast and standard so I can say it depends on your choice of input.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "|MINER|",
      "created_time": "May 11, 2022, 04:05:17 PM",
      "body": "Quote from: jerry0 on May 09, 2022, 11:44:22 PMSay you want to send a small amount of crypto say 5 dollars usd worth... with the lowest fee possible... how much is it terms of usd wise to send BTCBCHLTCat the moment?It depends on which wallet you are using  if you use custodial wallet then use FTX exchanger so that you don't have to pay any transaction fees . And if it's about non-custodial wallet then in my opinion It would be wise to select a light coin for a 5$ transaction.  Although currently Bitcoin is also only takes a few cents to transact.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypto Library",
      "created_time": "May 11, 2022, 04:24:43 PM",
      "body": "Quote from: jerry0 on May 09, 2022, 11:44:22 PMSay you want to send a small amount of crypto say 5 dollars usd worth... with the lowest fee possible... how much is it terms of usd wise to send I will always choose lite coin for the lowest gass fee in transaction if I use a non-custodial wallet (like Trust wallet). But I don't think you're talking about a non-Castidial wallet . If you are you using any exchanger then you should take lite coin for lowest gass in transaction. There is one more option in my opinion which is polygon it's cost the lowest gass fee ever I seen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jerry0",
      "created_time": "May 12, 2022, 03:23:22 AM",
      "body": "Can use nano ledger wallet or electrum or maybe electrum ltc but need to download and verify electrum ltc so kind of don't want to do that.Want to send about 5 dollars worth to someone.  Have windows pc, iphone etc.Do you recommend just install ltc app on nano ledger since i have no ltc there?  Thing is i want to make sure it is private where the person i send any coin to... whether btc or ltc... can't check the transaction history.  What would you suggest then?  Trust wallet on iphone?  Again it won't be more than 50 dollars worth of ltc or btc or bch that i want to keep in this wallet.  its meant to buy some things online.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MinMan",
      "created_time": "May 12, 2022, 01:43:01 PM",
      "body": "I really wouldn't prefer any of these at all. I would prefer LTC if given a choice, because I do not want to hold BCH in my wallet ever, and btc is just more expensive, but why not pick stuff like SOL for example? Or matic? Or even doge if you want to, like pick something that is cheap and not these options?There are tons of places, I used Avax for example recently and it was so cheap that it was fractions of a single cent, it was basically free and it was nearly instant as well, it reached my wallet in under a minute, it was like 30 seconds or something. So, I really doubt that these three would matter in a talk about a 5 dollar transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheGreatPython",
      "created_time": "May 13, 2022, 01:33:39 PM",
      "body": "Quote from: jerry0 on May 09, 2022, 11:44:22 PMWhat site do you check?  Saw one site that shows sending these are the average fees.  Accurate?BTC  0.000058 BTC ($1.81)BCH  0.000018 BCH ($0.0042) LTC  0.00018 LTC ($0.014)I don't know other sites to check fees other than https://ethgasstation.info/ but I think this one is only for eth. It is important for me to check the fees in eth before transacting because the fees in eth can go really high and sometimes can go low but not really that low as when compared to other crypto coins. Not sure if the fees you gathered above is legit but I think they are high enough especially in btc. The last time I transacted using btc I only pay less than a dollar. For the ltc, I remember I pay 0.00000555 for the fees. Bch fees are also lowered than 0.0042.Quote from: jerry0 on May 09, 2022, 11:44:22 PMKnow you can adjust the sending fees on nano ledger for sending btc such as for low, medium or high.  But if you were to send BCH or LTC, what would you input for the sending fee?  Does the lowest fee you put still fast for BCH and LTC?  Always heard LTC is very fast.  Because if that is the case, why would anyone use BTC to send 5 dollars to someone or a site if they can use BCH or LTC and pay a penny?You can just copy the value's above for bch and ltc if you are unsure if what to input. Just don't input a really low value because the transaction can get stuck forever. Values shown above are still cheaper than in btc anyway and obviously low fee means slow but yes ltc is much faster than btc and bch, it's just not all are a fan of altcoins that is why they stick on btc and also they are rich enough to pay high fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "May 14, 2022, 05:54:35 PM",
      "body": "Blockchair has a tool to compare blockchain with many information and transaction fee is one of given info.https://blockchair.com/compareWhen you use altcoin blockchain to save transaction fee, you take risk with a weaker blockchain. Bitcoin blockchain is the biggest and safest to use for transaction. Faster and cheaper should not be your priority when you pick a chain to use.https://howmanyconfs.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "May 14, 2022, 09:41:44 PM",
      "body": "Quote from: jerry0 on May 12, 2022, 03:23:22 AMCan use nano ledger wallet or electrum or maybe electrum ltc but need to download and verify electrum ltc so kind of don't want to do that.Want to send about 5 dollars worth to someone.  Have windows pc, iphone etc.Do you recommend just install ltc app on nano ledger since i have no ltc there?  Thing is i want to make sure it is private where the person i send any coin to... whether btc or ltc... can't check the transaction history.  What would you suggest then?  Trust wallet on iphone?  Again it won't be more than 50 dollars worth of ltc or btc or bch that i want to keep in this wallet.  its meant to buy some things online.Well, seems that you know what to do. If that's comfortable for you to just download ltc to your ledger then that's good. Whether big or small amount, that should be enough for you.But to mind you, you'll have to connect it from time to time if ever you'll do transactions.So if you're worried about having no history then just use any multi wallet like trust wallet if you'll use it to send to someone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}