{
  "id": "topic_5460466",
  "title": "PytagoraZ",
  "author": "PytagoraZ",
  "created_time": "July 20, 2023, 02:29:10 PM",
  "content": "One of the restrictions on this forum is off-topic discussion. So what if I create a discussion thread where the rules in the discussion thread allow off-topic discussion. Is that okay?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460466",
  "comments": [
    {
      "author": "Cantsay",
      "created_time": "July 20, 2023, 02:31:45 PM",
      "body": "I believe there is a dedicated board for off-topic thread, so if you ever feel the need to create a thread that allows off-topic discussion then you should probably do it there.But I can't really think of what good a topic like that is going to bring tho.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "July 20, 2023, 02:33:04 PM",
      "body": "You can go to off-topic board for off-topic discussion. Off-topic discussions are not restricted.But make sure you check all other boards to know if your topic can be on one of them. Most people on this forum consider off-topic board to be a place to spam, but there are good discussions there sometimes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PytagoraZ",
      "created_time": "July 20, 2023, 02:40:48 PM",
      "body": "Quote from: _act_ on July 20, 2023, 02:33:04 PMYou can go to off-topic board for off-topic discussion. Off-topic discussions are not restricted.But make sure you check all other boards to know if your topic can be on one of them. Most people on this forum consider off-topic board to be a place to spam, but there are good discussions there sometimes.I forgot there was an off-topic boardBut it's very quiet there. I'm not sure anyone wants to discuss there. I myself also just realized that there is an off-topic board after more than a month in this forum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "July 20, 2023, 03:04:32 PM",
      "body": "Quote from: PytagoraZ on July 20, 2023, 02:29:10 PMOne of the restrictions on this forum is off-topic discussion. So what if I create a discussion thread where the rules in the discussion thread allow off-topic discussion. Is that okay?Off topic posts and off topic board are different.Off topic posts mean you write posts which don't discuss on issue of that topic, it's off topic and should be deleted. Off topic posts can be deleted by moderators through reports from forum users or by a topic author in self moderated threads.Quote from: mprep on July 21, 2014, 05:27:51 PM2. No off-topic posts.Topics which belongs to Off-topic boards can be moved to that board through user reports too.Off-topic board:Quote from: mprep on July 21, 2014, 05:27:51 PMOff-topic - \"Other topics that might be of interest to bitcoiners\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "July 20, 2023, 03:16:23 PM",
      "body": "Quote from: Cantsay on July 20, 2023, 02:31:45 PMBut I can't really think of what good a topic like that is going to bring tho.Most times what I will classify as an off topic thread is seen in politics and society board, sometimes in the economics board. Meanwhile there are some topics that are totally off in the context of the forum. This means there is no situable board in BTT to accommodate such a topic. E.G Heath benefits of high libido  My dad's memory loseBut there is also another form of off topic. This happens when the conversation is flowing and one user suddenly digresses the discussion. Op, now you have gotten answers, you may consider to lock the thread as usual",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "July 20, 2023, 04:52:10 PM",
      "body": "Quote from: PytagoraZ on July 20, 2023, 02:40:48 PMI forgot there was an off-topic boardBut it's very quiet there. I'm not sure anyone wants to discuss there. I myself also just realized that there is an off-topic board after more than a month in this forumThere is also  serious discussion  board on the forum to have some sensible talks but newbies are restricted to participate in them so similarly we have off topic discussion board where you can have that kind of regular discussion apart from crypto stuff as well but it depends on you how you want to start a discussion there.There are few threads recently created and some have replies to last year threads as well because not too many members cares to engage in these discussions and have main focus on main general boards for relatable topics to market but you are free to have discussion in the designated board.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "July 20, 2023, 05:30:14 PM",
      "body": "Quote from: PytagoraZ on July 20, 2023, 02:40:48 PMQuote from: _act_ on July 20, 2023, 02:33:04 PMYou can go to off-topic board for off-topic discussion. Off-topic discussions are not restricted.But make sure you check all other boards to know if your topic can be on one of them. Most people on this forum consider off-topic board to be a place to spam, but there are good discussions there sometimes.I forgot there was an off-topic boardBut it's very quiet there. I'm not sure anyone wants to discuss there. I myself also just realized that there is an off-topic board after more than a month in this forumIt depends on what kind of off-topic thing you want to discuss. If you want to discuss something like 'What kind of music do you listen?' then you should open thread in Off-topic board but if your question is something like 'How to change SSD on my laptop', while still looks off-topic, you can ask similar questions in Beginners & Help board or in Bitcoin Mining board.I guess, some off-topic questions can be asked in Serious discussion board and Ivory Tower child board.By the way, Reddit is definitely a better place for off-topic questions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "July 20, 2023, 05:35:12 PM",
      "body": "Quote from: PytagoraZ on July 20, 2023, 02:29:10 PMOne of the restrictions on this forum is off-topic discussion. So what if I create a discussion thread where the rules in the discussion thread allow off-topic discussion. Is that okay?Why you will need to create a thread that you allow off-topic. What will be the impact of the off-topic post regarding to your thread? Just simply create your thread on the Off-topic board  since it can be considered as off-topic in general if there's a general rule that allows off-topic chat.Can you give a good example on the use case of your inquiry?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "July 20, 2023, 06:53:19 PM",
      "body": "This is according to my understanding of the forum rules: you cannot create a topic with local rules that conflict with the global rules of the forum.  Imagine if someone could make a topic in which plagiarism, or begging, or spam is allowed according to local rules.  That wouldn't make much sense. I think the same thing applies to off-topic discussion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "July 20, 2023, 07:38:31 PM",
      "body": "Quote from: FatFork on July 20, 2023, 06:53:19 PMThis is according to my understanding of the forum rules: you cannot create a topic with local rules that conflict with the global rules of the forum.You technically can if you self moderate the thread. Anyone commenting in a self moderated thread is going with the local rules of the author of the thread and it comes with this message; This is a self-moderated topic. If you do not want to be moderated by the person who started this topic, create a new topic.I am not aware if mods still delete replies on self moded threads that contradicts the local rules the OP stated.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "July 21, 2023, 08:22:27 AM",
      "body": "Quote from: PytagoraZ on July 20, 2023, 02:40:48 PMQuote from: _act_ on July 20, 2023, 02:33:04 PM...I forgot there was an off-topic boardBut it's very quiet there. I'm not sure anyone wants to discuss there. I myself also just realized that there is an off-topic board after more than a month in this forumyou are wrong, the off-topic section has the most posts than the section begginer & help section or Meta section The most important requirement for the topic that you create to be noticed by other members is that the topic must have great appeal - is a topic that is currently being hot discussed - will not result in spam postings or repeated answers, in essence you must have good literacy skills good and active in your posts so that the posters don't get bored in the posts you make.other than that, don't make topics that have actually been made by other members but have sunk in for a long time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "July 21, 2023, 08:30:44 AM",
      "body": "If your topic is too off-topic or it have a zero value it will be deleted or closed.off-topic does not mean spam, but an important topic and not directly related to bitcoin or altcoin, such as cyber security.Quote from: un_rank on July 20, 2023, 07:38:31 PMI am not aware if mods still delete replies on self moded threads that contradicts the local rules the OP stated.It is Self-moderated, the management and deletion of any reply that does not violate Bitcointalk rules is up to you, and you can delete any comment.Anywhere, if the reply violates the terms of the forum, mods can delete it. Therefore, if you put a local rule that says plagiarism is allowed, mods will ignore it, as there is a rule in the forum that prevents it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "July 21, 2023, 09:00:29 AM",
      "body": "Quote from: tbct_mt2 on July 20, 2023, 03:04:32 PMTopics which belongs to Off-topic boards can be moved to that board through user reports too.Off-topic board:Quote from: mprep on July 21, 2014, 05:27:51 PMOff-topic - \"Other topics that might be of interest to bitcoiners\"Whenever I visit the board, I end up reporting some \"insubstantial topics\", which then get deleted. There's rarely anything interesting for Bitcoiners.Quote from: Eternad on July 20, 2023, 05:35:12 PMWhy you will need to create a thread that you allow off-topic.It makes no sense. There's no discussion possible if people respond with completely irrelevant statements (example: \"I just had coffee with my breakfast.\").",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "July 21, 2023, 09:22:22 AM",
      "body": "Quote from: PytagoraZ on July 20, 2023, 02:40:48 PMBut it's very quiet there. I'm not sure anyone wants to discuss there. I myself also just realized that there is an off-topic board after more than a month in this forumYeah it is the place most signature campaigners are least interested in. lolYou're not guaranteed a high-quality response even if you bring up a quality topic, but that doesn't mean it's impossible. The hint is, you have to arrange more general words that are easy for LQ-posters to understand too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "July 21, 2023, 09:38:30 AM",
      "body": "Quote from: PytagoraZ on July 20, 2023, 02:29:10 PMOne of the restrictions on this forum is off-topic discussion. So what if I create a discussion thread where the rules in the discussion thread allow off-topic discussion. Is that okay?Of course yes, there is a board for off topic and any off topic thread should be done there. I see off topic board as a joker board and it is irrelevant to me.That is why you see that moderator will delete your thread when it is off topic from the discussion because there is an off topic board where, you are suppose to post it. If you are on off topic board,you can post nonsense and nobody will report or delete your post. But when you do that in other boards,you have done wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "July 21, 2023, 10:09:31 AM",
      "body": "Quote from: un_rank on July 20, 2023, 07:38:31 PMQuote from: FatFork on July 20, 2023, 06:53:19 PMThis is according to my understanding of the forum rules: you cannot create a topic with local rules that conflict with the global rules of the forum.You technically can if you self moderate the thread. Anyone commenting in a self moderated thread is going with the local rules of the author of the thread and it comes with this message; This is a self-moderated topic. If you do not want to be moderated by the person who started this topic, create a new topic.I am not aware if mods still delete replies on self moded threads that contradicts the local rules the OP stated.- Jay -I'm not 100% sure, but I don't think you can create a thread that violates forum rules, even if it's self-moderated. I don't have a specific example, but I believe moderators remove posts from self-moderated threads as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "July 21, 2023, 02:12:11 PM",
      "body": "Quote from: PytagoraZ on July 20, 2023, 02:29:10 PMOne of the restrictions on this forum is off-topic discussion. So what if I create a discussion thread where the rules in the discussion thread allow off-topic discussion. Is that okay?Off topic posts is different from Off-topic topics which you wants to discuss about.Off topic posts aren't allowed and to know what is off-topic anything that you posts on any thread that is irrelevant to the Topic and what OP is talking about can be reported and should be deleted.Whereas if you want to talk about movies, or something that has nothing to do with crypto currencies can be posted in Off-topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sexylizzy2813",
      "created_time": "July 21, 2023, 03:24:50 PM",
      "body": "I never thought one can create a topic on off-topic, I thought is when a user create a topic and if the topic is not up to standard that it would be moved to that section (OFF-TOPIC).But why would one create a topic that's not seen as important, not informative or even related to Bitcoin? What's the reason for creating what people won't find interesting? If a user always creates topics that are seen as  OFF-TOPIC  can that user be seen as a serious person on this Forum?🙄 If yes then why start up an OFF-TOPIC thread?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "July 21, 2023, 03:26:57 PM",
      "body": "Reading the OP's latest replies, one can see that he is very concerned about replies on off-topic that deviate from the topic. But if you look closely at the behavior of the OP himself, he often violates these rules himself, answering here and there with completely useless posts.Some people have made a remark to him, to which he practically does not react.Quote from: CYBER_COWBOY on July 19, 2023, 03:22:19 AMQuote from: PytagoraZ on July 19, 2023, 02:14:45 AMQuote from: asbani on July 19, 2023, 01:37:27 AMI finally managed to surpass 30 posts after 9 yrs in the forums. This feels like a feat to me and I shall celebrate the rank up. They say 30+posts will rank you up but I don't know where to see my ranking up.Oh god, that is a proud achievement and deserves to be celebrated. 9 years for 30 posts is something extraordinary. I hope to be as good as you. What you do is so totality that you need 9 years just to make 30 posts. Let's celebrate your achievement    Stop making fun of others please, this is internet if you want to be cool be it IRL otherwise you will be the one that people laugh at, just a free tip!I would rather be inactive like that then a merit begger like you & maybe the can't spend 14 hours / day like you here.Have a great day / CC!Quote from: examplens on July 19, 2023, 11:59:07 AMQuote from: CYBER_COWBOY on July 19, 2023, 03:22:19 AMQuote from: PytagoraZ on July 19, 2023, 02:14:45 AM..Stop making fun of others please, this is internet if you want to be cool be it IRL otherwise you will be the one that people laugh at, just a free tip!I would rather be inactive like that then a merit begger like you & maybe the can't spend 14 hours / day like you here.Have a great day / CC!As this is a self-moderated topic, maybe the OP BitcoinGirl.Club, could check the discussion, there seems to be a lot of trolling and spam posts that should be deleted.OP, do you need a buzzy topic to get everyone's attention? But you're only good at trolling, right? Therefore, the question of creating such a topic worries me the most.Quote from: PytagoraZ on June 09, 2023, 12:38:28 AMTapi berdasarkan saran dari temenku si lebih baik main-main di local board dan di board other. di local untuk menjalin kedekatan, di other-pun sama (karena di sana tidak masuk dalam hitungan signature). Tidak ada yang akan memberikan merit secara cuma-cuma kepada orang yang tidak di kenal.Saya liat agan sering di childboard gambling.. Ngapain gan, kebanyakan yg komentar disana cuma formalitas buat tugas signature. Kecuali agan suka dengan gambling.Eh kok gini ya.. maaf gan, tidak seharunya newbie kasih masukan ke seorang jr.membertranslation:Quote from: PytagoraZ on June 09, 2023, 12:38:28 AMBut based on my friend's advice, it's better to play on the local board and on other boards. on the local to establish closeness, on the other it's the same (because it's not included in the signature count). No one will give merit for free to people who are not known.I see you are often on childboard gambling.. What are you doing, bro, most of the comments there are just formalities for signature assignments. Unless you like gambling.Eh, how come it's like this... I'm sorry, bro, a newbie shouldn't give input to a jr. member",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}