{
  "id": "topic_5425166",
  "title": "cygan",
  "author": "cygan",
  "created_time": "December 02, 2022, 03:31:25 PM",
  "content": "from december 15, the darts world championship starts again at alexandra palace in london. as usual, the tournament will be played at the 'ally pally' in london. 96 players have qualified for the highlight at the end of the year, and for the first time even three women will play. the only 18-year-old Beau Greaves as well as the 'queen of the palace' Fallon Sherrock and Lisa Ashton have qualified again.the bookmakers see Michael van Gerwen as the biggest favorite in front. then follows the world champion of 2021, Gerwyn Price, the finalist of 2022, Michael Smith, and only then defending champion Peter Wright.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5425166",
  "comments": [
    {
      "author": "CoinEraser",
      "created_time": "December 03, 2022, 04:48:46 PM",
      "body": "I'm already looking forward to the upcoming darts world championship. I don't have any favorites to win this year, but I'm hoping for some exciting games and, above all, a great and interesting final. As in the past few years, there is again a total of £2,500,000 in prize money, with the winner receiving a whopping £500,000 of the money. Let's see who can look forward to the prize money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "December 07, 2022, 02:43:28 PM",
      "body": "Quote from: CoinEraser on December 03, 2022, 04:48:46 PM✂As in the past few years, there is again a total of £2,500,000 in prize money, with the winner receiving a whopping £500,000 of the money. Let's see who can look forward to the prize money.  not only this, but the loser in the final gets £200,000. For the semifinals there will be £100,000 reward for each player and whoever throws a nine-darter (a leg with only nine darts) will also receive £100,000 as a bonus",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LTU_btc",
      "created_time": "December 07, 2022, 11:41:26 PM",
      "body": "Thanks for making this topic, I'm already waiting for competition. This year it will be very good time to watch darts because there won't be any football at the same time - World Cup will end next week and if I'm not mistaken, club football will resume on Christmas.I don't have any favorite this year, but i expect that it will be between usual suspects and we won't see new faces reaching last rounds. Like always, I will support my countrymen Lucky D - Darius Labanauskas.In recent years it was common Fallon Sherrock competing with men, so, it will be something new to see even 3 women playing. It would be nice to see more women able to compete on such high level.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "December 09, 2022, 12:36:08 PM",
      "body": "Quote from: LTU_btc on December 07, 2022, 11:41:26 PM✂it will be something new to see even 3 women playing. It would be nice to see more women able to compete on such high level.that would definitely be better and maybe also nice to look at, if the women would also look attractive and we wouldn't always watch dart players with big bellies throwing... and maybe this time there will be a dart player who can cause a surprise and thus make a new name for himself in the group of favorites.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CoinEraser",
      "created_time": "December 14, 2022, 11:14:01 PM",
      "body": "Quote from: cygan on December 07, 2022, 02:43:28 PMnot only this, but the loser in the final gets £200,000. For the semifinals there will be £100,000 reward for each player and whoever throws a nine-darter (a leg with only nine darts) will also receive £100,000 as a bonus That's not bad. Participation is definitely worth it.  Tomorrow it finally starts and there are daily matches until January 3rd. Only on the christmas holidays and new year's eve there is no match, but I think that's perfectly ok. I'm already looking forward to tomorrow's first 4 matches and have already chilled a few beers. Hopefully this championship will be more fun than the soccer world cup this year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yayayo",
      "created_time": "December 15, 2022, 08:06:33 PM",
      "body": "We are about to start again with the darts world championship. In the past, much more attention was paid to it in the run-up to this tournament. This is undoubtedly because the World Cup is still running parallel to this tournament. Nice to see that darts legend Raymond van Barneveld can participate in the tournament again, after he had already announced twice before that he wanted to stop. Van Gerwen is suddenly the top favorite with the bookmakers again, probably due to his last tournament victory 2 weeks ago. In it we saw his old level. I think the first rounds start tomorrow.ya.ya.yo!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CoinEraser",
      "created_time": "December 15, 2022, 11:57:35 PMLast edit: December 16, 2022, 12:21:37 AM by CoinEraser",
      "body": "The first day of the PDC World Darts Championship is over. Peter Wright, the reigning champion won his first match as expected with no problems. Tomorrow we can look forward to 8 more matches.  These are the results from day one:Round 1:Round of 64:Source: https://www.sport1.de/daten/darts-sport/pdc-darts-wm/live-ticker",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "December 17, 2022, 06:39:30 AM",
      "body": "and here are the results from day 2 where there were two last-leg decidersthe german Florian Hempel wins a last-leg decider to end an epic tussle with Keegan Brown (england) and Michael Smith (england) makes light work of Nathan Rafferty (northern ireland), winning nine legs out of nine to reach round three.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "December 18, 2022, 08:33:05 AM",
      "body": "on the third day, Dimitri Van den Bergh was able to achieve the highest finish in the tournament with 164 in the duel against Lourence Ilagan.and in the afternoon session there was an incredible result for Alan Soutar who knocked 24th seed Daryl Gurney out of the pdc world championship",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qory",
      "created_time": "December 18, 2022, 06:07:18 PM",
      "body": "So far, few surprise shutdowns have been seen. But that often happens in the first round. The tension will only start in round 3, because then you will see some players facing each other with the necessary status. For example, the draw shows that Price would sometimes face van Barneveld in the 3rd round. Certainly not a walk over for Price, who managed to lose no less than 2x to van Barneveld last month. Odds for the tournament victory are 3.50 for van Gerwen. So that is the real favorite for this tournament. However, it has been volatile in recent years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wildan88",
      "created_time": "December 18, 2022, 06:12:57 PM",
      "body": "Quote from: qory on December 18, 2022, 06:07:18 PMSo far, few surprise shutdowns have been seen. But that often happens in the first round. The tension will only start in round 3, because then you will see some players facing each other with the necessary status. For example, the draw shows that Price would sometimes face van Barneveld in the 3rd round. Certainly not a walk over for Price, who managed to lose no less than 2x to van Barneveld last month. Odds for the tournament victory are 3.50 for van Gerwen. So that is the real favorite for this tournament. However, it has been volatile in recent years.Van Gerwen is no longer as good as he once was. Then he won 90% of all tournaments in which he participated. Only the last tournament he showed his absolute form at times. Too bad it came so late. A female contestant also participated, but she seemed to be eliminated quite quickly in the first round. So you can see that darts is really more of a men's sport, also at this world championship. Players like gary Anderson and Peter Right should also not be ignored from the tournament victory.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nasipadang",
      "created_time": "December 18, 2022, 06:57:43 PM",
      "body": "Quote from: wildan88 on December 18, 2022, 06:12:57 PMQuote from: qory on December 18, 2022, 06:07:18 PMSo far, few surprise shutdowns have been seen. But that often happens in the first round. The tension will only start in round 3, because then you will see some players facing each other with the necessary status. For example, the draw shows that Price would sometimes face van Barneveld in the 3rd round. Certainly not a walk over for Price, who managed to lose no less than 2x to van Barneveld last month. Odds for the tournament victory are 3.50 for van Gerwen. So that is the real favorite for this tournament. However, it has been volatile in recent years.Van Gerwen is no longer as good as he once was. Then he won 90% of all tournaments in which he participated. Only the last tournament he showed his absolute form at times. Too bad it came so late. A female contestant also participated, but she seemed to be eliminated quite quickly in the first round. So you can see that darts is really more of a men's sport, also at this world championship. Players like gary Anderson and Peter Right should also not be ignored from the tournament victory.Van Gerwen has not even shown anything at all in recent years. You could attribute it to corona, but in the year before Corona it was not good either. And we're talking about 4 years ago already. He will certainly want revenge for last year, when he and a few compatriots were infected with Covid19 and were therefore not allowed to participate in the World Cup. It can go crazy. In the first few rounds I expect van Gerwen to come through. There are also players in the draw that I have never heard of. But the Order of Merit is not a normal ranking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qory",
      "created_time": "December 18, 2022, 08:48:59 PM",
      "body": "I also saw little-known names pass by for today's schedule. Perhaps Van Den Berg from Belgium was the most famous. I thought he would have a free lap in the 1st round because of his performance last year. But with the Order of Merit only the prize money of the last 2 counts?! year. Adrian Lewis is already out again. That was a big player about 10 years ago. He was always close to the favorite role to become champion and was actually in the small group of outsiders. I don't know what his pattern in life is like now, but he seems to have said goodbye to the darts world a bit this way. A resurrection of van Barneveld has made a big impression in the darts world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "December 19, 2022, 05:07:05 PM",
      "body": "the match of the tournament so far was yesterday's the duel in the evening session between the two englishmen Scott Williams and Ryan Joyce.Ryan Joyce averaged nearly 112 for much of the match, but S. Williams remained so consistent to secure a 3-1 winin addition there was a total of 17x 180🍻",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "December 20, 2022, 02:21:41 PM",
      "body": "here are the results of the fifth day (don't get confused in the graph of the sixth day, this is a mistake of the creator) on monday afternoon, Danny 'the Mullet' Jansen moved on as well as the 'goldfinger' Lewy Williams sniffed a nine-darter - and Simon Whitlock squandered a 2-0 lead against José de Sousa. and in the evening session Steve Beaton lost deservedly against Danny van Trijp, also Geert Nentjes had to admit defeat to the crowd carried newcomer Leonard Gates. the second debutant David Cameron could surprise as well, while favorite Gerwyn Price fulfilled his compulsory task with some start-up time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "December 21, 2022, 10:40:14 AM",
      "body": "on yesterday's day 6 there was only the evening sessionthe 'queen of ally pally' Fallon Sherrock started very well in the duel vs. Ricky Evans and took the first set, but then finally lost 1-3 after sets.all other results you can see in the graphic below",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "December 22, 2022, 07:02:57 AM",
      "body": "big wins for Gabriel Clemens and Michael van Gerwen on the evening session of day seven, with Marvyn King squeezing through and Stephen Bunting seeing off Leonard Gateshere's all the results from another marathon day of darts at 'ally pally'",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CoinEraser",
      "created_time": "December 22, 2022, 02:07:54 PM",
      "body": "Thank you for your updates here in the thread @cygan. Unfortunately I can't see many matches, but that's how I stay up to date. Is there an overview somewhere on the net of how many nine-darters have been thrown and by whom? Unfortunately I couldn't find any.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "December 22, 2022, 04:31:36 PMLast edit: December 22, 2022, 04:44:21 PM by cygan",
      "body": "Quote from: CoinEraser on December 22, 2022, 02:07:54 PM✂Is there an overview somewhere on the net of how many nine-darters have been thrown and by whom? Unfortunately I couldn't find any.  i did some searching for you and found the following info:QuoteThere have been 401 nine-dart finishes in PDC history since 1999. 2021 saw 42 nine-dart finishes, while there have already been 16 nine-dart finishes in 2022. Only Phil Taylor and Michael van Gerwen have ever been able to hit two nine-darters in the same game. Van Gerwen’s last nine-darter came in the UK open in 2020. Gerwyn Price hit two nine-dart finishes on the same evening this season during Premier League Darts Night 3.https://news.williamhill.com/darts/nine-dart-finish-snooker-147-maximum/this info is from december 13 and should still be up to date today, since at the current pdc no player has thrown a nine-darter yet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}