{
  "id": "topic_5408324",
  "title": "lee dongzhe",
  "author": "lee dongzhe",
  "created_time": "August 01, 2022, 10:47:52 AMLast edit: January 19, 2024, 01:37:15 AM by lee dongzhe",
  "content": "ビットコインの価値　前書き 　2009年1月3日、ビットコインが誕生して以来、人々はビットコインに対していろんな議論を行い、その中には正反対の観点もあった。その内容はビットコインには価値があるのか,ないのか？その本質価値は何なのか？という問題に帰結することができる。この文章はビットコインの価値を探求することにある。 　第1章ビットコインの実質 　1.ビットコインの定義　ビットコインとは何なのか？ビットコインは貨幣である。　ビットコインは、通常に使われている紙幣と異なり、デジタル形式で存在するため、デジタル貨幣と呼ばれている。デジタル貨幣は、電子形態で存在しているから電子貨幣とも呼ばれている。ビットコインは暗号化によって生成されているから、暗号貨幣とも呼ばれている。ビットコインはインターネットシステム内に存在されているから、ネットワーク貨幣または仮想貨幣とも呼ばれている。ビットコインは全世界に開かれているから，超主権貨幣とも呼ばれている。ビットコインにはさまざまな呼び名があるが、その本質は貨幣である。それは貨幣史上で、実物貨幣、鋳造金属貨幣、紙幣に続いて新しく生まれたデジタル貨幣である。ビットコインは新興のデジタル貨幣であるため、各国のビットコインに対する政策および法的な定義が異なる。一部の国では、商品として扱われ、一部の国では資産として扱われ、一部の国では仮想貨幣として扱われ、一部の国では法定貨幣として扱われ、一部の国では使用が禁止されている。ビットコインは商品であり、資産であり、貨幣である。商品が貨幣で計れると資産となる。商品の主な機能が商品取引の媒介物で、また人々に広く使用されると貨幣になる。貨幣は商品交換の媒介物として、価値尺度機能、交換機能と価値保存機能を持っている。アメリカのドルは貨幣であり、また商品でもある。現在米ドルなど紙幣が主流になっているが、ビットコインなどデジタル貨幣より取引コストが高く、取引スピードが遅く、過剰な発行によりインフレーションを引き起こしている。　2.ビットコインの設計　2008年10月31日、中本哲史は「ビットコイン：ピアツーピア電子キャッシュシステム」という論文を発表した。　中本哲史はビットコインの設計において貨幣設計の基本原則である価値真実原則と価値保存原則に従った。価値真実原則とは、偽造貨幣が流通できないようにすることである。これは貨幣発行組織が最初に防がなければならない問題である。偽造貨幣が横行すると、貨幣は信用を失い、商品取引の媒介物として役割を果たすことができなくなる。価値保存原則とは貨幣の価値を保つことである。貨幣発行組織が意図的に貨幣を増発して、貨幣の価値を希釈して、利益を得てはならないことである。貨幣価値真実原則については、中本哲史は、既存のデジタル署名技術がデジタル貨幣の偽造の問題を解決したが、デジタル貨幣の二重使用問題は解決してないと考えた。二重使用問題とは、インターネットでの商品取引において、一定量の貨幣を二回以上使用することである。それは特別な形式の偽造貨幣である。第三者金融サービス機関を介して二重支払いの問題を解決することができるが、第三者の金融サービス機関が価値保存原則に違反して貨幣を増発しない保証はできない。そのため、中本哲史はピアツーピアの方法で、即ち中央集権の金融サービス機関を通さないで、二重支払い問題を解決することが意義あると認識した。　彼は、デジタル署名、ハッシュ暗号、タイムスタンプ、プルーフ・オブ・ワークなどの前人の技術成果を創造的に活用することによって、ピアツーピア状態で、二重支払い問題を解決した。これにより、価値真実原則と価値保存原則に基づくデジタル貨幣であるビットコインが誕生した。　3.ビットコインの発行　ビットコインのオープンソースソフトウェアを実行することにより、ジェネシスブロックが誕生した後、約10分ごとにブロックチェーン生成される。各ブロックチェーンは約10分ごとのビットコインの取引記録であり、4年間で約21万ブロックが生成される。21万ブロックチェーンごとにビットコインの生産量は半分に減る。最初の21万ブロックチェーンは各ブロックごとに50枚ビットコインの報酬が付与され、4年間で1,050万個ビットコインが生成された。２番目の21万個ブロックチェーンは各ブロックに２５枚のビットコインの報酬が付与され、4年間で合計525万個ビットコインが生成された。このように続けて、おおよそ2140年までに2100万ビットコインが生成される予定である。その後の公開取引記録のインセンティブは、手数料の付与によって運営される。現在、741,123のブロックチェーンが生成され（Jun17、2022、4：01AM、UTC）、19,069,752枚のビットコインが発行されており、総発行量の約90.８％を占めている。これはいつもよく増発する紙幣とは異なり、ビットコインは発行総量が約定された最初の貨幣である。発行総量だけでなく、発行プロセスも4年ごとに半減する仕組みとなっている。これは、貨幣史上始めてうまれた約定貨幣である。約定貨幣とは、発行総量と発行プロセスが約定された貨幣である。　4.ビットコインの性能　ビットコインは紙幣に比べて、取引スピードが速く、取引コストが低く、取引安全性が高い。貨幣の取引性能の著しい向上は、社会に莫大な経済利益をもたらす。紙幣からデジタル貨幣への移行は、貨幣性能の進化による自然的な流れである。　5.ビットコインのシステム　今までの紙幣、クレジットカード、デビットカード、カードタイプの電子マネーなどはすべて銀行のシステムをベースに運営されていた。銀行システムから独立したインターネットでの取引はまだ存在していない。ビットコインは、銀行システムからは独立して存在するデジタル貨幣システムである。ビットコインは最初のピアツーピアのインターネット貨幣である。これは、インターネット商品取引の進化の結果である。 2010年5月22日、一万枚のビットコインでただ2枚のピザと取引された。これはビットコインがインターネットから現実の世界に始めて出て、実物と交換された瞬間である。また、ますます多くの商品がビットコインと取引されている。同時に、世界のほとんどの国の法定通貨と24時間年中取引されている。ビットコインの誕生は新しい貨幣システムの誕生である。これは、従来の金融システムを変革する力を内在することだけではなく、デジタル空間の価値基盤を構築することでもある。　第2章ビットコインの価値　1.貨幣増発　人間は貨幣の増発による富を獲得する誘惑に抵抗することは難しいのだ。歴史家は、西ローマ帝国の崩壊は、金貨に安価な銅や鉛などを混じて、金の純度を希釈したことに関連していると指摘した。この行為は兵士の利益を直接に侵害し、兵士の戦闘力を弱めた。イギリスでは貴金属が貨幣として使用された時代でも、貨幣の価値が低下した。摩耗、回りを削いた貨幣が市場に流通されるとグレシャムの法則に説明されるように「悪貨は良貨を駆逐する」ことが発生した。1717年にニュートンは1オンスの純度0.９の金を、3ポンド17シリング10.5ペンスに設定して、イギリス及び世界の金本位制の基礎を築いた。長年にわたる戦争と1929年の資本主義金融危機の影響で、イギリス経済は苦境に立たされ、1931年に金本位制度を廃止せざるを得なくなった。1944年に確立されたブレトンウッズ体制は、ドルがポンドを取り替え、世界の中心貨幣になり、その構造はドルが金に固定され、他の国の貨幣がドルに固定されたことである。当時、35米ドルを1オンスの金に交換することができたが、後にアメリカが大量に貨幣を増発して、35ドルで1オンスの金を交換できなかった。1971年8月15日、アメリカのニクソン政権は突然ドルと金の固定レートを放棄することを発表した。それで、アメリカは大胆に貨幣を増発する貪欲な道を歩むことになった。歴史は再び貨幣発行組織が急速に富を得るために貨幣を増発する誘惑に抵抗できないことを証明した。これは人間が制御しにくい貪欲の力である.イエスはエルサレムの聖殿で両替業商人を追い出したが、人々の貨幣への貪欲は変わることがなかった。貨幣を増発することによる利益を貨幣発行益と言い、これを　一般的に貨幣鋳造税と呼ばれているが、税金の一つ項目ではなく、第二形態の税金である。これは普通の課税よりも、隠蔽で、金額も大きく、影響も深いものである。税金は国民の承認を得て、税務管理機関が多くの時間と労力を費やす必要がある。しかし、貨幣を増発することは、貨幣発行組織が一方的にお金を印刷することにより、利益を得ることができる。納税者の抵抗はない、課税者の時間と労力もいらない。今や貨幣の増発は一般的にインフレーションと呼ばれ、人々はインフレ-ションに慣れてきた。人々はお貨幣の価値が徐々に失っていることに漠然として気づいているが、日々の生活の中で、その貨幣の背後に潜む秘密を探求する時間と余裕がない。ただ自分の貨幣の価値の減る事実を受け入れることしかない。ほとんどの人はこの問題に直面していない。しかし、この世の中には、誠実で正義感のある魂が存在している。ハイエクはこの問題を直面し、貨幣の独占発行組織により貨幣を増発して、利益を得ることは盗み同然の犯罪行為にほかならないと言った。中本哲史はこの問題に立ち向かい、ビットコインを創造した。ビットコインのジェネシスブロックには、その日のタイムズの見出し、『英タイムズ紙：財務大臣 二度目の銀行救済措置の瀬戸際に』が記録された。 （The Times 03/Jan/2009 Chancellor on brink of second bailout for banks）ビットコインは、貨幣の歴史を変えるだけでなく、人間の自由への道にも影響を与える。　継続",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5408324",
  "comments": []
}