{
  "id": "topic_5446862",
  "title": "cygan",
  "author": "cygan",
  "created_time": "March 30, 2023, 06:12:46 AMLast edit: May 10, 2023, 04:46:00 PM by cygan",
  "content": "Autor: GazetaBitcoinWątek oryginalny: Cryptocurrency vs digital money issued by the StateWidmo nawiedza współczesny świat, widmo kryptowalutowej anarchii - Tim MayRozpoczynam ten temat jako \"część drugą\" innego mojego tematu - Rządy biorą się za handlowców!, będąc po części pod wpływem przeczytania (tytułu) tego wątku: Dlaczego rządy świata nie korzystają z kryptowalut?.Rządy nie chcą używać kryptowalut; przynajmniej nie tych zdecentralizowanych. Ponieważ muszą kontrolować wszystko - od informacji osobistych po dane i pieniądze. Nie możesz nic zrobić bez wydanego przez rząd dowodu identyfikacyjnego - nie możesz iść do szkoły, nie możesz prowadzić samochodu, nie możesz wziąć ślubu i tak dalej. Rządy potrzebują wszystkich danych swoich obywateli, w tym ich informacji finansowych. Z tego powodu rządy starają się jak najbardziej wyeliminować pieniądze w gotówce i zamienić je na karty kredytowe/bankowe. Pieniądze gotówkowe są trudne do śledzenia, podczas gdy transakcje cyfrowe są zawsze przechowywane przez banki, które działają jako ramiona rządu, dostarczając władzom wszystkich danych, których żądają o ludziach.Zdając sobie sprawę z całego szumu wokół kryptowalut, rozumiejąc, że ludzie zmierzają w kierunku używania cyfrowych walut, rządy zaczęły, mniejszymi lub większymi krokami, myśleć o zaoferowaniu takich pieniędzy swoim obywatelom. Ale nie zdecentralizowane kryptowaluty, które są anonimowe lub pseudonimowe -- chcą zaoferować scentralizowane kryptowaluty, rodzaj pieniędzy, które można śledzić, powiązać z prawdziwymi nazwiskami i które mają wartość ustaloną przez rząd zamiast wolnego rynku. Weźmy na przykład wenezuelski Petro, rosyjski CryptoRuble, japoński J-coin, Chiny i tak dalej.Oczywiście państwowe waluty cyfrowe są całkowicie przeciwne kryptowalutom, a różnic między nimi jest tak wiele, że trudno je wszystkie wyliczyć:- Kryptowaluty mają wyzwolić ludzi z niewolnictwa narzuconego przez banki i rządy, eliminując pośrednika i ułatwiając transfery peer to peer; waluty cyfrowe emitowane przez rządy opierają się na zaufanych stronach trzecich (banków), są zaprojektowane tak, aby nadal zniewalać ludzi, dawać im iluzję wolności, podczas gdy w rzeczywistości są uciskani;- kryptowaluty zapewniają anonimowość/pseudonimowość, a użytkownicy są ich prawdziwymi właścicielami, ponieważ posiadają ich klucze prywatne; cyfrowy pieniądz wymyślony przez rządy nie będzie oferował ludziom kluczy prywatnych, będzie możliwy do śledzenia i, najprawdopodobniej, nie będzie możliwy do wydobycia (zamiast tego będzie przechowywany przez banki);- (większość) kryptowalut ma stałą liczbę monet, aby uniknąć inflacji; pieniądz cyfrowy emitowany przez rządy nie będzie miał stałej liczby, ponieważ rządy dążą do inflacji, a nie do deflacji, ponieważ inflacja jest podatkiem pośrednim, za którym stoi wiele osób nawet bez świadomości. Trudniej jest zmusić ludzi do zaakceptowania podatku bezpośredniego, niż narzucić im podatek pośredni; w przypadku, gdy podatek pośredni nie jest nawet uświadamiany, praca rządzących jest o wiele łatwiejsza;- wartość kryptowalut jest określana przez wolny rynek (a przynajmniej tak powinno być; nie myślmy teraz o wielorybach); pieniądz rządzących ma wartość ustaloną przez państwo.A lista może się ciągnąć dalej.W rzeczywistości jedyną rzeczą wspólną dla kryptowalut i cyfrowych walut emitowanych przez państwo jest to, że obie chcą pozbyć się waluty fiat. Ale, oczywiście, z zupełnie innych powodów: kryptowaluty chcą zmienić rzeczywisty system, który jest skorumpowany do korzeni, podczas gdy rządowcy chcą zachować system, ale z innym instrumentem finansowym, który dałby ludziom fałszywe wyobrażenie o używaniu kryptowalut.Ta przyszłość została przewidziana już dawno temu przez Cypherpunks, Ojców Założycieli krypto anarchii. Jeśli należysz do tych, którzy zaczęli odrzucać skorumpowane przez rządy waluty fiat, nie daj się nabrać na używanie cyfrowej waluty emitowanej przez państwo!Powstańcie, nie macie nic do stracenia oprócz swoich ogrodzeń z drutu kolczastego! (Tim May, Manifest kryptoanarchistyczny, 1988)[Ciąg dalszy nastąpi]Tłumaczenie wykonane w ramach inicjatywy AOBT",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446862",
  "comments": [
    {
      "author": "Tytanowy Janusz",
      "created_time": "March 30, 2023, 07:25:00 AMLast edit: March 30, 2023, 08:09:03 AM by Tytanowy Janusz",
      "body": "Świetny wątek. Dzięki @Cygan za tłumaczenie.\"Złoto, Banki, ludzie Krótka Historia pieniądza\" - Murray N. Rothbard w swojej książce opisuje jak elity od tysięcy lat dążyły do przejęcia kontroli nad pieniądzem, bo kto ją posiada ... posiada kontrolę nad połową wolumenu transakcyjnego (bo każda transakcja to po jednej stronie dobro/usługa a po drugiej pieniądz). Złoto też początkowo było, powstałym oddolnie, środkiem wymiany. Każdy mógł bić monety, które potem przez wolny rynek były akceptowane bardziej bądź mniej w zależności od prestiżu bijącego. Pierwszym krokiem rządzących była monopolizacja mennic (pod pretekstem ochrony obywateli przed podróbkami). Kolejnym krokiem była zmiana nazwy z jednostki masy (uncje, gramy, grany) na bardziej patriotyczną (talar, dolar) a następnie ... nie trudno się domyślić psucie monet poprzez obniżanie zawartości złota w monecie. Tak nakładano \"tajne podatki\" i łatano luki budżetowe już setki/tysiące lat temu. Miało to jednak swoje limity, które kolejne pokolenia elit sukcesywnie eliminowały. Od standardu złota (papier wymienialny na złoto rozwodniony rezerwą cząstkową), poprzez system dywyzowo-złoty (papier wymienialny na złoto tylko między bankami centralnymi rozwodniony jeszcze większą rezerwą cząstkową), papierowy pieniądz generowany przez rządy według widzi misię. Dziś żyjemy w świecie pieniądza \"cashless and reserveless\". Jedni spędzają życie w znienawidzonej pracy po 10 godzin dziennie walcząc o jednostki pieniądza, który jest 50 letnim walącym się eksperymentem, a pewne instytucje mogą generować go z powietrza według celów politycznych elit. CBDC jest kontynuacją tego trendu. Przekazanie całej kontroli bankom centralnym nad tym jaki pieniądz posiadamy, ile go posiadamy i na co wydajemy. Bitcoin jest próbą stworzenia złota na nowo. Oddolną inicjatywą. Próbą zaczęcia od nowa. Cofnięcie się o tysiące lat do czasów wolnego pieniądza z zdecentralizowanymi \"mennicami\" niezależnymi od elit. Wymazaniem stuleci skrupulatnej walki z wolnością.Quote from: cygan on March 30, 2023, 06:12:46 AM- wartość kryptowalut jest określana przez wolny rynek (a przynajmniej tak powinno być; nie myślmy teraz o wielorybach); pieniądz rządzących ma wartość ustaloną przez państwo.Tu bym mógł wchodzić w polemikę. Państwo może starać się utrzymać na jakimś poziomie wartość pieniądza, ale historia dowodzi, że nie jest to tak proste i nieraz wywalało się na plecy.Quote from: cygan on March 30, 2023, 06:12:46 AMopierają się na zaufanych stronach trzecich (banków), Banków centralnych, bo to one będą generowały CBDC. CBDC przeniesie kompetencje z banków do banków centralnych. Czyli przechodzimy na wyższy etap centralizacji.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GazetaBitcoin",
      "created_time": "March 30, 2023, 08:02:23 PM",
      "body": "Dziękuję cyganowi za przetłumaczenie mojego tematu na swój język! Jestem zaszczycony, że mój temat został przetłumaczony w lokalnym forum!I uważam, że jest on bardzo przydatny, aby pomóc większej liczbie ludzi wiedzieć o Bitcoinie, jego historii i pomóc im łatwiej zrozumieć to zjawisko.Obecny temat rzuca światło na niebezpieczeństwa, przed którymi stanie wiele krajów, gdy rządy zaczną wydawać CDBC. Wielu da się nabrać na to, że państwo będzie oferować kryptowalutę ludziom, ale ten temat pomaga nam zrozumieć, że żaden rząd nigdy nie wyda kryptowaluty swoim obywatelom. Wszystkie rządy dążą jedynie do kontrolowania ludzi, a nie do pomocy w byciu wolnym. Więc potraktuj ten temat jako przestrogę. Nadchodzi era CDBC i wszyscy musimy być przygotowani, aby nie dać się oszukać przez rząd!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}