{
  "id": "topic_5475091",
  "title": "bimmer92",
  "author": "bimmer92",
  "created_time": "November 22, 2023, 06:01:10 PMLast edit: November 22, 2023, 07:00:47 PM by bimmer92",
  "content": "Hi,if I use an website like hash160.com (WARNING!! DO NOT USE THIS SITE, ITS SCAM) to generate Hash 160 and the Hash Key from Phrase Words, is it possible to get access to my wallet?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475091",
  "comments": [
    {
      "author": "apogio",
      "created_time": "November 22, 2023, 06:03:32 PM",
      "body": "Quote from: bimmer92 on November 22, 2023, 06:01:10 PMHi,if I use an website like hash160.com to generate Hash 160 and the Hash Key from Phrase Words, is it possible to get access to my wallet?I have never heard of this site. It suspiciously looks like this: https://iancoleman.io/bip39/ which is legit but must be run totally offline.Does anyone know of hash160.com ?Also, what do you mean get access to your wallet? Sorry to say it, but your post seems somewhat suspicious. Hope you prove me wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "November 22, 2023, 06:07:50 PM",
      "body": "Never let your secret phrases get associated with any online software.I checked hash160 and they seem like they want to convert your private keys into something else which to me is not a good idea since you’ll be exposing your keys to them, and they’ll be able to access your account anytime they wishes to so stay away from it as far as you possibly can. If you’re allowed to run it offline without having to connect your computer to the internet and even if you connect it nothing will be sent to any server then you can try it with an empty wallet but don’t risk it with one that has funds in it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bimmer92",
      "created_time": "November 22, 2023, 06:08:41 PM",
      "body": "I know it was very stupid, but I shared the hash 160 and Hash Key with someone and now my wallet is empty. That's why I'm asking if you can get access to a wallet with the two things",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "November 22, 2023, 06:10:21 PM",
      "body": "Quote from: bimmer92 on November 22, 2023, 06:08:41 PMI know it was very stupid, but I shared the hash 160 and Hash Key with someone and now my wallet is empty. That's why I'm asking if you can get access to a wallet with the two thingswhat do you mean? do you have the transaction that emptied your wallet? seems like you imply you got scammed. Sorry to hear this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bimmer92",
      "created_time": "November 22, 2023, 06:14:50 PM",
      "body": "Yes I got scammed, there is a transaction with the full amount to another wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "November 22, 2023, 06:17:08 PM",
      "body": "Quote from: bimmer92 on November 22, 2023, 06:14:50 PMYes I got scammed, there is a transaction with the full amount to another wallet. Would you like to share the transaction id? So we can look to an explorer? If there are confirmations, unfortunately there is nothing you can do. In Bitcoin, transactions are irreversible. Sorry!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bimmer92",
      "created_time": "November 22, 2023, 06:21:15 PM",
      "body": "Here is the id 2e64b508a83af549b5616622ae45bb8d8c2031e0dd098a6564ce22079336566bIts confirmed",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "November 22, 2023, 06:24:56 PM",
      "body": "Quote from: bimmer92 on November 22, 2023, 06:21:15 PMHere is the id 2e64b508a83af549b5616622ae45bb8d8c2031e0dd098a6564ce22079336566bIts confirmedUnfortunately, there is nothing to be done, it has 10 confirmations. Also unfortunately you lost a lot of money. How did it happen? Did you give someone your seed phrase? The 12/24 words you haveP.S The person who stole your money used a fee of ~240 sats/vB, which was x4 the fees at the time. Which looks like the thief wanted it to be confirmed ASAP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bimmer92",
      "created_time": "November 22, 2023, 06:28:01 PM",
      "body": "No, only the hash 160 and hash key. Thas why I want to know if its possible to get access to the wallet with this information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "November 22, 2023, 06:31:26 PM",
      "body": "Quote from: bimmer92 on November 22, 2023, 06:28:01 PMNo, only the hash 160 and hash key. Thas why I want to know if its possible to get access to the wallet with this information. Essentially hash160 is derived from your public key if you apply SHA256 and RIPEMD160 to it. Check here: https://learnmeabitcoin.com/technical/public-key-hashTherefore, there is no way if someone knew this that they could steal your money. They would need to go backwards from hash160 to public key and then to private key. But this is not possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bimmer92",
      "created_time": "November 22, 2023, 06:34:51 PM",
      "body": "What about the hash key?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "November 22, 2023, 06:38:36 PM",
      "body": "Quote from: bimmer92 on November 22, 2023, 06:34:51 PMWhat about the hash key?I am not sure I understand this. You mean the hash of your public key? In the website you posted: hash160.com says \"hash key\" but there is no way I am ever going to put my seed phrase there, just to see what it is.How did you come across this website? It looks very suspicious man! It is basically a copy of this https://iancoleman.io/bip39/ but I can't understand what is the use of this website you have asked about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "November 22, 2023, 06:39:16 PM",
      "body": "Quote from: apogio on November 22, 2023, 06:31:26 PMEssentially hash160 is derived from your public key if you apply SHA256 and RIPEMD160 to it. Check here: https://learnmeabitcoin.com/technical/public-key-hashTherefore, there is no way if someone knew this that they could steal your money. They would need to go backwards from hash160 to public key and then to private key. But this is not possible.My guess is that the operator of the site has access to any key that’s being converted, if not why don’t they make it run offline? Quote from: bimmer92 on November 22, 2023, 06:34:51 PMWhat about the hash key?I doubt the person you sent your hash key to has anything to do with this, it should be those in charge of the site, it’s known that one shouldn’t expose to their secret phrase to an online service so why would someone still go on and create such type of converter that requires users to input their keys directly if not for a deceitful reason?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "November 22, 2023, 06:42:21 PM",
      "body": "Quote from: Cantsay on November 22, 2023, 06:39:16 PMMy guess is that the operator of the site has access to any key that’s being converted, if not why don’t they make it run offline? I totally agree, but why did OP mention this website in the first place and where did he find about it? With a single search on google it didn't come up. The resemblance with Ian Coleman's website is uncanny, which leads me to believe this whole topic may be a scam, unless OP proves me wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bimmer92",
      "created_time": "November 22, 2023, 06:48:12 PM",
      "body": "I DONT want anyone to put any information to this website. The person who I gave the hash recommended this site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "November 22, 2023, 06:49:15 PM",
      "body": "Quote from: bimmer92 on November 22, 2023, 06:48:12 PMI DONT want anyone to put any information to this website. The person who I gave the hash recommended this site. So did you import your 12/24 words there in order to get the hash160 and hashkey ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bimmer92",
      "created_time": "November 22, 2023, 06:54:12 PM",
      "body": "Yes, exactly. So again, I warn everyone NOT to use the site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "November 22, 2023, 06:57:02 PM",
      "body": "Quote from: bimmer92 on November 22, 2023, 06:54:12 PMYes, exactly. So again, I warn everyone NOT to use the site.This is how you got scammed. Please edit the original post and add a warning that this website mustn't be used. Make it clear.Unfortunately the owner of the website got access to your words. He used a template that he got from Ian Coleman's website. He is a lazy bastard... He told you \"no worries, I only want the hash160, here is website to convert it\".And ... he got access to your funds... I am really sorry mate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bimmer92",
      "created_time": "November 22, 2023, 07:01:03 PM",
      "body": "I edited it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}