{
  "id": "topic_5448700",
  "title": "Cryptomultiplier",
  "author": "Cryptomultiplier",
  "created_time": "April 13, 2023, 04:31:53 PM",
  "content": "All in a bid to ensure I have a concrete investment plan this year, I researched some of the altcoins that has the potential to yield the best return over a duration of 5years. BTC and Eth top my list as one of the more secure coins, but other altcoins have proven to be reliable overtime, if you agree. Despite market volatility and the possibility of a crash, which is your most valid choice right now.*If I have $40,000 to invest in one #cryptocurrency that will make me a billionaire, Which one do you think would be a better choice, besides BTC and Eth of which I have grown accustomed to?- $BTC *- $ETH *- $ADA- $VET- $SOL- $MATIC- $SHIB- $NEAR- $DOGE- $DOT- $LINKThese are some of the best I have seen so far. *What advice would you give me?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448700",
  "comments": [
    {
      "author": "electronicash",
      "created_time": "April 13, 2023, 04:51:03 PM",
      "body": "$VET is my bet.we all have a preference in viewing which has more potential and which one could be adopted sooner than we see it. thereby one may choose ADA, SOL MATIC. but becuase they are all top tokens in the CMC, i think they all will have their own bull run. whichever you may put your money on, you can be assured you can profit when they soar to their ATH.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fvb",
      "created_time": "April 13, 2023, 05:00:46 PM",
      "body": "It is certainly loudly said that you can become a billionaire. But historical facts have confirmation that people became millionaires. With the right investment and a long wait, you can significantly improve your financial situation. All the cryptocurrencies that you indicated can bring a good income, and with such an investment portfolio, I think you can count on financial success",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "April 13, 2023, 05:06:19 PM",
      "body": "Besides BTC and ETH which should be your majority, you should go with the older and reputed altcoins before jumping into the newer ones, these include LTC and DOGE at first choice and then the rest. You can be assured that with these bought at low price, your chance of making it out with at least a break even capital is possible in the long run.For the newly launched coins get at the low and get out quickly too, dont prolong your stay or you will get into a bad price position from where getting out is a difficult pill to pass and holding is painful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "April 13, 2023, 05:19:56 PM",
      "body": "Isn't the answer obvious? It should be either BTC or ETH... Every other coin is inferior to these projects. If you are a risk taker your may try DOGE too because it is now backed by Elon but since you said \"invest in one crypto\", I wouldn't go with doge. Had you said \"invest in 3-4 crypto\", then I would have said go with ETH, BTC & DOGE.BTC is the safest bet out there and ETH has a very wide eco-system. You are not going to find a better crypto than these in the markets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "April 13, 2023, 05:24:58 PM",
      "body": "DOGE and SHIB are both shitcoins and not advisable to hold long term because it’s price is purely rely on Elon Musk hype which means if Doge was already abandoned by Musk in the future then it will be worthless again same with SHIB since it’s just a shadow of Doge.You have a a good list already and just remove the 2 meme coin and SOL. Add Optimism and Arbitrum to complete your list for the best investment for 5 years. You don’t need to add more crypto to diversify since most of the crypto moves at same direction, they just varies on the percentage of growth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "April 13, 2023, 05:30:47 PM",
      "body": "If I have $40 grand, I would never invest it in a single cryptocurrency ever. That's a suicide. Cryptocurrency is extremely volatile. So will divide that up and invest in Bitcoin and ETH. Also looking at how Shiba Inu is progressing, I would invest some thousand dollar in SHIB too. But I would definitely not invest in anything else for sure. Oh yes, I won't forget gold too. Because that's the asset which can support my capital investment during odd times. Nothing beats gold 8n capital protection.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "April 13, 2023, 05:57:13 PM",
      "body": "Quote from: Cryptomultiplier on April 13, 2023, 04:31:53 PMAll in a bid to ensure I have a concrete investment plan this year, I researched some of the altcoins that has the potential to yield the best return over a duration of 5years. BTC and Eth top my list as one of the more secure coins, but other altcoins have proven to be reliable overtime, if you agree. Despite market volatility and the possibility of a crash, which is your most valid choice right now.*If I have $40,000 to invest in one #cryptocurrency that will make me a billionaire, Which one do you think would be a better choice, besides BTC and Eth of which I have grown accustomed to?- $BTC *- $ETH *- $ADA- $VET- $SOL- $MATIC- $SHIB- $NEAR- $DOGE- $DOT- $LINKThese are some of the best I have seen so far. *What advice would you give me?Wanting be a billionaire with one investment is pretty much tells us why don't you have 40k to invest. I can pretty much guarantee that 40k isn't paying for you to be millionaire in any of the coins / tokens you included in that list. High marketcap coins have only so much room to growAnd key is not to invest something on something that moons. When we talk about altcoins it also requires for you to have an exit plan. And when we talk about all in one coin that's not being a \"billionaire\" if you are sensible. You wouldn't even have decent liquidity to exit.If i had to bet on any of those i would be betting on eth because of their new deflationary tokenomics and because every smart developer out there is building on eth. But that's not going to make you billionaire.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "April 13, 2023, 06:04:14 PM",
      "body": "Shib and Doge because these are highly controlled by whales so its good for short term investment not for long term but don't forget that don't put all your eggs in a basket so I will never go all in on one particular coin except BTC but diversify your investment portfolio apart from cryptocurrency assets too to avoid the risk factor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "April 13, 2023, 06:14:29 PM",
      "body": "I will point out in bitcoin around 90-95% of total, maybe a small percentage (1 digit) in ETH or coins that allow staking.maybe it's too late but it could worth a try also allocate a small % in BGL (Bitgesell). This coin has some positive aspects (see coin specification and implementation). https://bgl.bitaps.com/I have not sold my coins (received from some initiative here on forum).In less then 7 days there is the halving (!) but actually the price has doubled from the ATH (it was around 12 cents now valuation is around 24 cents). Negative points... low hashrate allocated (that change very frequently), so it means risk of double expense, etc etc ... but probably it could be something that can be mitigated in long term.https://www.publish0x.com/bitbollo-cryptocurrencies-blog/a-depth-analysis-of-bitcointalkorg-speculation-thread-the-ne-xpnnjwqTake a look into this blogpost. Is not updated, but it's useful since explain in detail how it's really hard achieve a profit with cryptocoins (and mostly of the times is a bad idea  )",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$crypto$",
      "created_time": "April 13, 2023, 06:18:05 PM",
      "body": "I won't choose too many altcoins, this will be a big risk in the future, we know that altcoins are often discarded a lot, so it's a feeling with some altcoins and especially BTC which is the main savings rather than increasing the portfolio in other altcoins.Meme coins are often a blast who knows when they happen but they have control and Elon Musk is like a lot of people think behind it it's a bit of a wake up call as well even though they have such a large community I would never have had much more to save on meme coins.It would be a better suggestion then the choices are BTC and ETH.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coinerer",
      "created_time": "April 13, 2023, 06:25:08 PM",
      "body": "$40k will be a huge amount so you should invest in multiple potential coins if you have this amount for investment. In this case you need to give priority to Bitcoin first then ETH and others potential Altcoins. And I think it would be better to buy all coins at low price and follow DCA method.  Since the amount is huge, one must invest carefully. I personally like to invest on#BTC#ETH#BNB#MATIC#TRX#WAVES#SOL#XLM",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitSwapNow",
      "created_time": "April 13, 2023, 06:55:16 PM",
      "body": "PHB and HZN are severly undervalued gems right now. Strong team making advancements in AI and DeFI ect with milestones constantly being met and real world products and use case. HZN is on a run this week as more and more people start finding out. Still only like a 6m market cap at around 8 cents a coin. Their defi exchange of real world assets and staking is also awesome. This thing has the potential to 100x i feel. PHB is working with AI an you can read more of both on their respective medium blogs//whitepapers. Id recommend joining their telegrams and the announcement channels for most up to date news. PHB has about a 50m market cap right now. Also still low in the view of larger crypto. As always read and do your own research!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "April 13, 2023, 07:00:29 PM",
      "body": "Quote from: Cryptomultiplier on April 13, 2023, 04:31:53 PM...*If I have $40,000 to invest in one #cryptocurrency that will make me a billionaire, Which one do you think would be a better choice, besides BTC and Eth of which I have grown accustomed to?..Having 40 thousand dollars now, I would refrain from investing at the moment, since the risks for investing are too high now. In my opinion, we should wait for the correction, since the risk of buying coins when they are at a local high is now too high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "April 13, 2023, 07:26:45 PM",
      "body": "I would highly suggest you to take a look at it differently though. I mean if you keep thinking that you could become a millionaire billionaire and all that while focusing just on that, I would be able to say that its not going to be awesome. I think it would be better if you could focus on something much better, which would be \"what could be the best thing that could profit me\". Because in that idea you are aiming at buying the thing that would be the best for you. I think the answer to that is bitcoin, but if you bought 40k worth of bitcoin, which is a bit above 1 bitcoin, you are not going to be a billionaire, that would require bitcoin to hundreds of millions of dollars and we all know that won't happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odusko",
      "created_time": "April 13, 2023, 07:28:11 PM",
      "body": "Hope so you know that altcoin is a gamble and is a high risk, while some investors are carried away by the high profits possibilities in some altcoins it is good to note that you can as well lose everything in a bid to reach that profit.Its quite good that you already have the best investment assets on the top of your list but it is important to note that you must give a high percentage of your investment capital to Bitcoin and risk a substantially small amount on another asset on that list because most of them have a high percentage of risk that you can lose some or all your money since their centralized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "April 13, 2023, 08:26:24 PM",
      "body": "I can divide the currencies you mentioned into groups and thus make it easier for you:$MATIC, $ADA, $SOL, $DOT: This pair's philosophy is that if Ethereum fails, they offer themselves as an alternative, so invest in one of them in addition to Ethereum, not all of them.$SHIB, $DOGE: Both are speculative currencies. I do not advise you to invest more than 1% in them.$VET, $NEAR, $LINK: I have not heard of enthusiastic news about these projects, so do not invest more than 4%.If I were you, I would invest no more than $3,000 in all of the currencies mentioned.This will leave you with $30,000 in Bitcoin and $7,000 in Ethereum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dunfida",
      "created_time": "April 13, 2023, 08:40:16 PM",
      "body": "$DOGE$SHIBIm not really that a fan of meme coins but once these fellas would be having that kind of hype then for sure it would  really be going up into the ceiling but of course you shouldntbe expecting something about being a billionare with just having $40k unless if you do go with some shitcoins or degen coins then theres a chance but we know thatits not something that recommendable since its just too risky and not really worth.Actually these both meme coins are having their possible use case though.DOGE- Possible currency of twitter  (assumption)SHIB -  Have their Shibarium on the works.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "April 13, 2023, 08:49:16 PM",
      "body": "Quote from: Cryptomultiplier on April 13, 2023, 04:31:53 PM*If I have $40,000 to invest in one #cryptocurrency that will make me a billionaire, Which one do you think would be a better choice, besides BTC and Eth of which I have grown accustomed to?*What advice would you give me?First of all 40k$ is a very big amount of money for your first investment into crypto, so congratz to have that many funds to invest. My very first advice would be to only invest those 40k$ if you can afford to lose them and if you really don't need them for your daily life. In crypto it is still very much possible that you will lose all of your funds because of a hack, a rugpull or whatever.Also i would not expect to become a billionaire, if you have such high expectations then you will only be disappointed. To become a billionair your investment would need to make a x25000. I heavily doubt that this will happen.I personally invested into NEAR and Cosmos in the last few weeks because i think they have potential to grow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "April 13, 2023, 08:54:15 PM",
      "body": "SOL is out of the choice, they're no good honestly. Why it seems that we already know the answer but we're removing bitcoin on it. But the aim is to become a billionaire? Well, that's really gonna need some serious choice from the altcoins.Since you want to have some tremendous growth, I don't know if that will be enough if the choices will be filled, it should be a project that has never grown and pumped yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}