{
  "id": "topic_5436071",
  "title": "riocasinoback",
  "author": "riocasinoback",
  "created_time": "January 19, 2023, 10:38:27 PMLast edit: January 22, 2023, 01:45:17 AM by riocasinoback",
  "content": "there is a big fight tomorrow Figueiredo vs Moreno  ufc fight 10 pm colombia time Figueiredo  will win.dont cry after when you didnt listen to to me when i give you straight out the winner of the fight.and you dont bet like idiots  that you are and miss the opportunity to double all your money. i am one of the goat in predicting ufc fightsHere proof that i bet on stake 3000 usd on fig and i put my money where my mouth is. https://www.loom.com/share/3e9d91e527c944a5839d987f6f7361e4Here my last  public UFC prediction that i won: https://bitcointalk.org/index.php?topic=5429742.msg61457303#msg61457303You can see I predicted fight i have the  ability to predict again and again.Figueiredo, Deiveson will win. the odds are:2.15 Figueiredo1.80 morenothe fight will end by decision to figuerido or by ko",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436071",
  "comments": [
    {
      "author": "riocasinoback",
      "created_time": "January 19, 2023, 11:12:50 PM",
      "body": "I just added another 1.3 eth in bc.gamehttps://www.loom.com/share/22f7148dde3749819f5155a5677c7289",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "January 20, 2023, 07:27:08 AM",
      "body": "Do not continue to post when no user has not posted, it is against the rules of bitcointalk, just edit the OP or your post and add what you want to post there.We all know that Stake is a good gambling site, you do not have to create a new topic about your betting on a gambling site always, or just do that on a single thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "frenchmika",
      "created_time": "January 20, 2023, 08:08:59 AM",
      "body": "i will bet against udont like ppl who brag for nothing",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "January 20, 2023, 08:27:54 AM",
      "body": "How long you're doing this? What's your win rate? I think people need to find more information about that, just because you did won or two or three bets doesn't mean you're skillful, it might have been luck n your side. I'm not bragging, I'm happy you're winning but what I want or other users here to know was the information or percentage of your betting history if ever that's possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hopenotlate",
      "created_time": "January 20, 2023, 10:09:10 AM",
      "body": "Why don't you start your own bet picks thread?So all your bets and predictions will be in one place for a better track of your ability and for a better usage by people interested in following you, like me for example, without having to dig into your posts history.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "January 20, 2023, 10:44:07 AM",
      "body": "Quote from: rhomelmabini on January 20, 2023, 08:27:54 AMHow long you're doing this? What's your win rate? I think people need to find more information about that, just because you did won or two or three bets doesn't mean you're skillful, it might have been luck n your side. I'm not bragging, I'm happy you're winning but what I want or other users here to know was the information or percentage of your betting history if ever that's possible.This is the second time he posts a prediction and the first bet resulted in success. He is using alt account riocasino when he posted his first prediction on UFC. There's nothing much to analyze on this guy since his previous prediction is for a closed fight while there's no other data available. All I can was this guy is very lucky on all of his gambling journey which is why he keeps bragging here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "January 20, 2023, 11:08:09 AM",
      "body": "Quote from: hopenotlate on January 20, 2023, 10:09:10 AMWhy don't you start your own bet picks thread?So all your bets and predictions will be in one place for a better track of your ability and for a better usage by people interested in following you, like me for example, without having to dig into your posts history. I think it is clear that he is on a lucky streak and that he will stop posting once the streak comes to an end. I would not say that there is enough evidence to prove that he should be offering picks, his last win before this was a double zero bet on stake.com. Even though I can see where this is going, I wish him the best of luck anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shamm",
      "created_time": "January 20, 2023, 11:15:46 AM",
      "body": "Quote from: rhomelmabini on January 20, 2023, 08:27:54 AMHow long you're doing this? What's your win rate? I think people need to find more information about that, just because you did won or two or three bets doesn't mean you're skillful, it might have been luck n your side. I'm not bragging, I'm happy you're winning but what I want or other users here to know was the information or percentage of your betting history if ever that's possible.Big True mate we all know that betting on UFC fight has a 50% of winning and another 50% for loss so you can not say that you will always win in betting maybe a series of 6-8 win is very lucky but not all you will win. As we all know that it will base on the fighter itself cause there are many fighter who are the challenger and has small percent of winning but the end of the fight he won. So it's unpredictable, and it's hard to decide.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "January 20, 2023, 01:46:02 PM",
      "body": "Quote from: Eternad on January 20, 2023, 10:44:07 AMQuote from: rhomelmabini on January 20, 2023, 08:27:54 AMHow long you're doing this? What's your win rate? I think people need to find more information about that, just because you did won or two or three bets doesn't mean you're skillful, it might have been luck n your side. I'm not bragging, I'm happy you're winning but what I want or other users here to know was the information or percentage of your betting history if ever that's possible.This is the second time he posts a prediction and the first bet resulted in success. He is using alt account riocasino when he posted his first prediction on UFC. There's nothing much to analyze on this guy since his previous prediction is for a closed fight while there's no other data available. All I can was this guy is very lucky on all of his gambling journey which is why he keeps bragging here. Well, I don't know why he's posting this and what he tries to prove but if I'm winning and want to help other people I'd rather create a thread where I can share my thoughts on a bet. If it's just a post to brag your winnings then I'd say you just want an attention, you better keep it to yourself then. It's childish if it will keep happen this way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "January 20, 2023, 02:08:38 PM",
      "body": "Quote from: Oshosondy on January 20, 2023, 07:27:08 AMDo not continue to post when no user has not posted, it is against the rules of bitcointalk, just edit the OP or your post and add what you want to post there.We all know that Stake is a good gambling site, you do not have to create a new topic about your betting on a gambling site always, or just do that on a single thread.Technically, it can be considered a bump, since posts were made on different days. He isn't spamming.As for posting about Stake, or bcgame, or any other, he's using this as proof of his bets. I don't see anything wrong with this post. Many people post their won bets, this is actually better because OP is showing who he's betting on before the fight, so he's literally backing his own prediction with money. You can like that, or not, but it's not like he's breaking the rules by doing it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "January 20, 2023, 02:30:01 PM",
      "body": "Don't let overconfidence pull you down, have you forgotten that this is gambling, there's nothing impossible, there are games you would have been too sure of and at the end it will do end up disappointing you regardless of how much is being involved, i agree with you that you know how to bet and gamble very well but only post the ones you've already won and brag about it and not the ones yet to come.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fullcoinese",
      "created_time": "January 20, 2023, 02:46:25 PM",
      "body": "Quote from: Dunamisx on January 20, 2023, 02:30:01 PM i agree with you that you know how to bet and gamble very well but only post the ones you've already won and brag about it and not the ones yet to come. I'm afraid the OP has spent more money than he's made on the few bets he's won.OP, I suggest keeping your predictions to yourself. if what you share is wrong and is followed by other people with substantial finances. you could be in trouble. although nothing will ensnare you.I don't know your prowess at gambling, but keep it all to yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "January 20, 2023, 03:05:06 PM",
      "body": "Quote from: Fullcoinese on January 20, 2023, 02:46:25 PMQuote from: Dunamisx on January 20, 2023, 02:30:01 PM i agree with you that you know how to bet and gamble very well but only post the ones you've already won and brag about it and not the ones yet to come. I'm afraid the OP has spent more money than he's made on the few bets he's won.OP, I suggest keeping your predictions to yourself. if what you share is wrong and is followed by other people with substantial finances. you could be in trouble. although nothing will ensnare you.I don't know your prowess at gambling, but keep it all to yourself.He already done this before and turns out to become successful. There's nothing wrong for sharing a bet since this is like a tipster. The OP just construct this post in an arrogarant way(probably this is his character) but this thread can be considered as a regular tipster. As a reader, You have the responsibility for yourself if you will follow this or not. OP didn't point a gun to anyone here to follow his bet. It's up to us if we will be attracted on his bet picks that back up with his huge bet or not.@OP maybe a giveaway raffle once this pick become successful to scare away all the bashers?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "January 20, 2023, 03:09:38 PM",
      "body": "I will like to wish you good luck,But like other users have said, it's not advisable to make threads about predictions, there is a thread for ufc predictions on the gambling discussion board, you can post your predictions there, or Better still, since you are gambling on stake.com, you can post your predictions on stake's dedicated announcement thread, predictions are not worth making a topic for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Piesel",
      "created_time": "January 20, 2023, 03:22:36 PM",
      "body": "Quote from: frenchmika on January 20, 2023, 08:08:59 AMi will bet against udon't like ppl who brag for nothingThis is the part I have been waiting to hear, I like to see high wagerer that always looks out for bets to go against such as in thos situations.When it come to gambling the result is sometimes unpredictable and the outcome may not go in the direction ops is pointing to, but then we can only wish the ops good luck in his bets",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maydna",
      "created_time": "January 20, 2023, 03:30:44 PM",
      "body": "He managed to make us all curious about his intentions. He has not given his predictions yet and is only providing information that he has managed to win many games and earn a lot of money.I hope he understands that he can't always win every game he bets on. It can make him arrogant and lose control of himself. And when he loses, he can return to betting to recover his losses. And it's highly unrecommended, but he thinks it's still worth trying, so he'll try to recover his losses. After winning a lot of money, taking a break for a while will be better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klidex",
      "created_time": "January 20, 2023, 03:40:36 PM",
      "body": "Quote from: Fullcoinese on January 20, 2023, 02:46:25 PMQuote from: Dunamisx on January 20, 2023, 02:30:01 PM i agree with you that you know how to bet and gamble very well but only post the ones you've already won and brag about it and not the ones yet to come. I'm afraid the OP has spent more money than he's made on the few bets he's won.OP, I suggest keeping your predictions to yourself. if what you share is wrong and is followed by other people with substantial finances. you could be in trouble. although nothing will ensnare you.I don't know your prowess at gambling, but keep it all to yourself.Yes, that's true, and if it happens that there are people who want their predictions with big money bets, but these predictions are wrong, then people who follow them will think that they have spread false predictions which are very detrimental.What's worse, there will be blasphemy against him continuously.If indeed the prediction is good, it would be better to use it yourself and you don't need to tell other people more, spread it in a published manner.In my opinion, no matter how good a person is who makes predictions, he must have a chance of losing too, and not all of his predictions are correct as a whole.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "January 20, 2023, 04:07:46 PM",
      "body": "-  You know the truth, I'm happy and you win playing gambling here in crypto gambling. And as a matter of fact, it seems that you are even jealous because I wonder when I will be able to win a big amount like you.However, I hope you also follow the advice of the other people who commented on your post made here that you do not make another topic that is similar to the topics you made before because you are also against the policy and rules of the forum platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "January 20, 2023, 05:12:18 PM",
      "body": "thanks for your suggestion this can be an interested bet but (as you know) there is not always any sure bet! the risk always behind the corner and you must pay attention on ANY Bethttps://bitcointalk.org/index.php?topic=5435885.0  just to have an idea.If you like to provide free suggestions for bet, create a topic like minehttps://bitcointalk.org/index.php?topic=1234109.0people can track the history of bets, check previous performance and be more confident while they decide to bet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}