{
  "id": "topic_5446073",
  "title": "0x00100",
  "author": "0x00100",
  "created_time": "March 23, 2023, 04:13:12 PM",
  "content": "Greetings Bitcointalk community,I would like to introduce an exciting investment opportunity in the gambling industry: ProximaBet. This innovative project is in its investment phase and offers long-term potential for both beginners and experienced investors alike.About ProximaBetProximaBet is a next-generation betting platform that leverages blockchain technology to offer a unique and profitable user experience. At its core, the platform allows users to place bets on the price movement of various cryptocurrency pairs, such as BNB/USD, within a 5-minute window. This creates a user vs. user dynamic where the market determines the winning side.The platform charges a 3% fee from each pool bet and has plans to introduce more pairs and games in the future, providing additional revenue streams.Investment OpportunityProximaBet is offering 7 investment stages, with 5 pre-launch and 2 post-launch. Each stage consists of 1,000 shares for sale, starting at a price of 0.1 BNB per share during the first stage. The share price will increase as the project progresses and milestones are reached.There are a total of 10,000 shares available, with 7,000 allocated for public investors and 3,000 reserved for the team and marketing efforts. Holding these shares will grant users a weekly percentage of the website's profit, with 100 shares equating to a 1% share of the profits.Shares can be purchased on the Binance network through the project's investment platform at invest.proximabet.comSocials: https://linktr.ee/proximabetPlatform sneak peek https://i.imgur.com/cOoQf1C.png",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446073",
  "comments": [
    {
      "author": "worldofcoins",
      "created_time": "March 28, 2023, 11:22:36 AM",
      "body": "Quote from: 0x00100 on March 23, 2023, 04:13:12 PMInvestment OpportunityProximaBet is offering 7 investment stages, with 5 pre-launch and 2 post-launch. Each stage consists of 1,000 shares for sale, starting at a price of 0.1 BNB per share during the first stage. The share price will increase as the project progresses and milestones are reached.There are a total of 10,000 shares available, with 7,000 allocated for public investors and 3,000 reserved for the team and marketing efforts. Holding these shares will grant users a weekly percentage of the website's profit, with 100 shares equating to a 1% share of the profits.Shares can be purchased on the Binance network through the project's investment platform at invest.proximabet.comExcellent investment opportunity, in my opinion. But please share the complete portfolio (regulatory environment and legal status of the investment) for a better understanding so we can analyze the credibility of this platform, as we all know about the potential scams in this market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "March 28, 2023, 01:37:24 PM",
      "body": "Are you representative of ProximaBet on Bitcointalk?If you are, let's buy Copper Membership with some permissions to enable images even you are not ranked up to Junior member.If you are interested in, buy there https://bitcointalk.org/index.php?action=credit;promoteThen wear the Copper membership as followsQuote from: theymos on November 11, 2017, 06:01:16 AMQuote from: Quickseller on November 11, 2017, 03:54:09 AMIs “copper member” displayed when someone pays the fee? If so do they retain he title after they have sufficient activity to become a “member”? Once you have it, you get the choice:Lastly, ask your designer or hire one to make a good graphics for your announcement.If you are not not their representative, please ignore my advice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}