{
  "id": "topic_5407450",
  "title": "wagmi",
  "author": "wagmi",
  "created_time": "July 24, 2022, 11:05:44 AM",
  "content": "Most crashes are not rational and instead, driven by misconceptions and fear. We need to break such misconceptions to build a stronger and more resistant market. Recently, Altcoin pressure has resulted in Bitcoin losing value. A huge crash occured, where Bitcoin lost 10k USD. It was clearly not a rational decision. Selling people lost much money. And here's what's important:  It was because a Shitcoin collapsed (Terra Luna). And one more Shitcoin, too (Celsius)NOT because Bitcoin had issues! It was only Altcoin related but Bitcoin declined in price, too. Completely unreasonable because Bitcoin had NO issues. It was only Altcoin related. People need to learn to differenciate between Bitcoin and Altcoins. Bitcoin wasn't responsible for what happened, Bitcoin was safe, working as usual and as usually proven since Bitcoin was started. It was caused by a single, very risky ALTCOIN, where fundamentals of were not proven sufficiently. It was a weak Altcoin causing a huge crash. An Altcoin, where no link to Bitcoin's tech was around. Bitcoin and Altcoins are totally independent, still people are getting FUD and sell Bitcoin causing a crash. People should be aware for a similar situation: Bitcoin wasn't responsible for what happened, Bitcoin was safe, working as usual and as usually proven since Bitcoin was started. No need to sell Bitcoin. People need to learn to be wise and don't sell Bitcoin when different Altcoins are having techical problems. It will likely happen a lot more because we have a lot of shady Altcoins! A very good recommendation: don't sell Bitcoin when a different Altcoin crashes! After all, such crashes will only re- distribute coins from weak hands to strong hands (HODLers). Bitcoin is a store of value, HODLTo be succesful means to understand Bitcoin is independent from Altcoins and to understand HODL.  To be succesful means to understand Bitcoin is a good store of value. Bitcoin is valuable because BTC is capped at 21M coins, Bitcoin's supply can't get inflated.Imagine in 100 years, FIAT inflation is 2 to 10 percent every year, but Bitcoin is capped.Bitcoin can get a real alternative for gold, digital gold and a very reliable store of value. But people need to do research about Bitcoin,  halving mechanism and technical independence from Altcoins.Don't be feared.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407450",
  "comments": [
    {
      "author": "Bttzed03",
      "created_time": "July 24, 2022, 12:37:38 PM",
      "body": "Quote from: wagmi on July 24, 2022, 11:05:44 AMMost crashes are not rational and instead, driven by misconceptions and fear. We need to break such misconceptions to build a stronger and more resistant market. Recently, Altcoin pressure has resulted in Bitcoin losing value. A huge crash occured, where Bitcoin lost 10k USD. It was clearly not a rational decision. Selling people lost much money. And here's what's important:  It was because a Shitcoin collapsed (Terra Luna). And one more Shitcoin, too (Celsius)NOT because Bitcoin had issues! It was only Altcoin related but Bitcoin declined in price, too. Completely unreasonable because Bitcoin had NO issues. It was only Altcoin related.It's not as simple as altcoin related.If I'm going to guess, it's more like this:Luna Foundation Guard (LFG) sold a significant amount of bitcoins (80K) after the 'attack' to save the dying UST, more bears took advantage of the situation to push the price down further, and then the majority of retail traders sold out of panic.If you're going to say the market crashed because of what LFG did, you might as well say they also helped pumped the price when they bought BTC for their reserve.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "July 24, 2022, 12:55:34 PM",
      "body": "As Bttzed03 mentioned, the Luna Foundation Guard owned over $3 billion worth of Bitcoin and several altcoins. But when Terra started crashing, they made the decision to sell almost all of their bitcoin collateral trying to stop the stablecoin from de-pegging further. That didn't work out and Terra is now art of crypto history. Didn't Tesla also announce recently they sold almost $1 billion worth of bitcoin?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wagmi",
      "created_time": "July 24, 2022, 01:00:29 PM",
      "body": "Quote from: Bttzed03 on July 24, 2022, 12:37:38 PMQuote from: wagmi on July 24, 2022, 11:05:44 AMMost crashes are not rational and instead, driven by misconceptions and fear. We need to break such misconceptions to build a stronger and more resistant market. Recently, Altcoin pressure has resulted in Bitcoin losing value. A huge crash occured, where Bitcoin lost 10k USD. It was clearly not a rational decision. Selling people lost much money. And here's what's important:  It was because a Shitcoin collapsed (Terra Luna). And one more Shitcoin, too (Celsius)NOT because Bitcoin had issues! It was only Altcoin related but Bitcoin declined in price, too. Completely unreasonable because Bitcoin had NO issues. It was only Altcoin related.It's not as simple as altcoin related.If I'm going to guess, it's more like this:Luna Foundation Guard (LFG) sold a significant amount of bitcoins (80K) after the 'attack' to save the dying UST, more bears took advantage of the situation to push the price down further, and then the majority of retail traders sold out of panic.But it is not enough to crash Bitcoin almost about 10k down. It was a crash caused by fear and irrational decisions (panic sell). Many people lost money as Bitcoin slowly recovered later but people stayed weak (which was a mistake) and more Altcoin bad news arrived. Totally irrational. Quote from: Pmalek on July 24, 2022, 12:55:34 PMDidn't Tesla also announce recently they sold almost $1 billion worth of bitcoin? Yes, but markets stayed stable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "July 24, 2022, 01:07:06 PM",
      "body": "Quote from: wagmi on July 24, 2022, 01:00:29 PMYes, but markets stayed stable.  Relatively stable. Depending on how you look at it. Compared to what happened with the Terra situation, this didn't lead to such a crash. But if I remember correctly, bitcoin was trading at around $24k when it happened, and then the value dropped to $21-22k. Nothing dramatic but we are still looking at a difference of 8%.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "July 24, 2022, 01:16:19 PM",
      "body": "Quote from: wagmi on July 24, 2022, 01:00:29 PMBut it is not enough to crash Bitcoin almost about 10k down. <snip>The point is that an altcoin having fundamental issues is not going to affect Bitcoin much, the sell off could have caused panic as it's somewhat Bitcoin related and can cause panic and fud. There are also other factors that goes into price movements besides what hits the news as headlines.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "July 24, 2022, 02:06:06 PM",
      "body": "Quote from: wagmi on July 24, 2022, 11:05:44 AMRecently, Altcoin pressure has resulted in Bitcoin losing value. A huge crash occured, where Bitcoin lost 10k USD. Do you think Bitcoin fell because of altcoins?Altcoins are not reasons why Bitcoin fell down. It will fall with a reason to you see. Luna Foundation Guard sold their Bitcoin but do you think why they had to sell their Bitcoin from their guard?Market makers test the market and when they saw a great opportunity to pull a trigger, they did it. Luna is a victim in the game to break a price of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "July 24, 2022, 02:30:18 PM",
      "body": "Quote from: wagmi on July 24, 2022, 01:00:29 PMYes, but markets stayed stable. Not sure if I would call it \"stable\" if they gave bitcoin a great amount of sell pressure. Obviously it would look \"stable\", because they slowly sold the bitcoin rather than doing it all in one huge sell offer(which would be horrendous for both Tesla and the broader crypto market).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luzin",
      "created_time": "July 24, 2022, 02:30:31 PM",
      "body": "Quote from: wagmi on July 24, 2022, 11:05:44 AM Bitcoin wasn't responsible for what happened, Bitcoin was safe, working as usual and as usually proven since Bitcoin was started. It was caused by a single, very risky ALTCOIN, where fundamentals of were not proven sufficiently. It was a weak Altcoin causing a huge crash. An Altcoin, where no link to Bitcoin's tech was around. Bitcoin and Altcoins are totally independent, still people are getting FUD and sell Bitcoin causing a crash. This problem seems to have become a tradition, for several years knowing the price and movement of BTC and altcoins. Altcoins and BTC have always had an entanglement. They have a relationship, this consensus has been trusted. Realistically it's actually quite realistic because we can see the dominant amount of BTC. If Dominance goes up then altcoin habits tend to go down because many hold BTC and vice versa. CMIIWQuote from: Pmalek on July 24, 2022, 12:55:34 PMDidn't Tesla also announce recently they sold almost $1 billion worth of bitcoin? Yes, but I don't think there's a big effect. Either this just makes the market opinion worse to make the BTC price lower or it is the reality. In other news, Finland is also selling confiscated BTC to help Ukraine but i see no big effect.Source: https://www.bloomberg.com/news/articles/2022-07-21/finland-liquidates-seized-bitcoin-stash-amid-crypto-bust",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "July 24, 2022, 03:12:40 PM",
      "body": "Quote from: wagmi on July 24, 2022, 11:05:44 AMIt was caused by a single, very risky ALTCOIN, where fundamentals of were not proven sufficiently. It was a weak Altcoin causing a huge crash. An Altcoin, where no link to Bitcoin's tech was around. Bitcoin and Altcoins are totally independent, still people are getting FUD and sell Bitcoin causing a crash. Lets agree to disagree. Its only not about Luna crash here mate. Yes they did sold all of their bitcoin to retain its peg on their stablecoin but seems not to work and eventually lead to a bigger crash. Yes I agreed it was fear but if you look into the technical side. Its destined to be like that since were oversold already and has to make some correction that is hugely been criticize as manipulations. Anyway you got your point its just not a solid one that believable though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wagmi",
      "created_time": "July 24, 2022, 03:52:08 PM",
      "body": "Quote from: cryptoaddictchie on July 24, 2022, 03:12:40 PMQuote from: wagmi on July 24, 2022, 11:05:44 AMIt was caused by a single, very risky ALTCOIN, where fundamentals of were not proven sufficiently. It was a weak Altcoin causing a huge crash. An Altcoin, where no link to Bitcoin's tech was around. Bitcoin and Altcoins are totally independent, still people are getting FUD and sell Bitcoin causing a crash. Lets agree to disagree. Its only not about Luna crash here mate. Yes they did sold all of their bitcoin to retain its peg on their stablecoin but seems not to work and eventually lead to a bigger crash.It's only about Luna crash. Yes, Luna sold all Bitcoin but please look at how much is Bitcoin's volume dailyWhy is it so hard to admit Bitcoin's crash was unreasonable based on fear and misconcettions. Quote from: cryptoaddictchie on July 24, 2022, 03:12:40 PMYes I agreed it was fear but if you look into the technical side. Exactly, it was based on fear and misconception. It has been a very unreasonable crash. Quote from: Luzin on July 24, 2022, 02:30:31 PMQuote from: Pmalek on July 24, 2022, 12:55:34 PMDidn't Tesla also announce recently they sold almost $1 billion worth of bitcoin? Yes, but I don't think there's a big effect. +1",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "July 24, 2022, 05:08:24 PM",
      "body": "Quote from: wagmi on July 24, 2022, 11:05:44 AMWe need to break such misconceptions to build a stronger and more resistant market. To a great extent I think this forum has been doing that. There's been enough sensitization against panic selling and I want to believe that the message is being absorbed by noob investors who care to read and adhere to that. Any watcher of Bitcoin from the past two halvings should know that what's playing out now had happened before and Bitcoin came out victorious. The market will continue to bull and bear because that's its nature.Quote from: wagmi on July 24, 2022, 11:05:44 AMIt was only Altcoin related but Bitcoin declined in price, too. Completely unreasonable because Bitcoin had NO issues. It was only Altcoin related.What happened there was the ripple effect of panic sellers. Panic sellers tend not to be rational whenever their emotions are punctured by FUD. They go on selling spree and don't care if their action is in any way related to the reality on ground.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "July 24, 2022, 06:09:47 PM",
      "body": "Quote from: wagmi on July 24, 2022, 11:05:44 AMMost crashes are not rational and instead, driven by misconceptions and fearwhat surprised me most id that even at this moment, some bitcoiners also have this fear of uncertainties about bitcoin as a result of the bear in market price, what then should we expect from the world of cryptocurrencies in general when those in the right right system (bitcoin) network fear what should the altcoins and other investment means create in people's mind. Quote from: wagmi on July 24, 2022, 11:05:44 AMWe need to break such misconceptions to build a stronger and more resistant market.what needed to be clear here is that the bitcoin market price does not need this to create it market value or price, it works strictly base on demand and supply strategy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "July 24, 2022, 10:34:15 PM",
      "body": "This idea that shitcoins are responsible for Bitcoin crashes is doing more harm than good. It just ruins the credibility of Bitcoin as a currency and a reserve asset. Imagine if USD was crashing because Zimbabwe or Venezuela printed more of their useless fiat currency. But this is essentially what you are saying about Bitcoin. That scams can bring down its price. How it is supposed to replace fiat then?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wagmi",
      "created_time": "July 24, 2022, 11:14:44 PM",
      "body": "Quote from: hatshepsut93 on July 24, 2022, 10:34:15 PMThis idea that shitcoins are responsible for Bitcoin crashes is doing more harm than good. It just ruins the credibility of Bitcoin as a currency and a reserve asset. Did you even try to read or understand my post? I said in my post it is essential to know Bitcoin is NOT related to Shitcoins. Because Bitcoin is COMPLETELY different from Shitcoins. Bitcoin is NOT tied to Shitcoins and people need to understand. People need to understand it and don't sell when a random Altcoin has issues. But some ppl even have no basic understanding about Coins and don't know basic rules. Bitcoin is on a different, own Blockchain!!!An Altcoin has no link to Bitcoin's tech. Bitcoin and Altcoins are totally independent, still people are getting FUD and sell Bitcoin causing a crash because such people HAVE NOT DONE RESEARCH. People need to start doing research. Quote from: hatshepsut93 on July 24, 2022, 10:34:15 PMThis idea that shitcoins are responsible for Bitcoin crashes is doing more harm than good. But this is essentially what you are saying about Bitcoin. Stop lying! If you don't want to read or understand my post, no need for you to reply here! I say we need to look at Bitcoin and Altcoin separately because it is different tech!!!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bttzed03",
      "created_time": "July 25, 2022, 01:44:25 AM",
      "body": "Quote from: wagmi on July 24, 2022, 01:00:29 PM~But it is not enough to crash Bitcoin almost about 10k down.The sale of BTC80K alone may not have been enough to crash the market but why don't you think of the whale bears that also sold a lot which helped broke vital support?Quote from: wagmi on July 24, 2022, 01:00:29 PMIt was a crash caused by fear and irrational decisions (panic sell).Yes but it most likely happened after the two conditions I said above.Quote from: wagmi on July 24, 2022, 01:00:29 PM~ and more Altcoin bad news arrived.Are you talking about Celsius? It's a lending platform that also holds a massive amount of BTC (over 150K) as of April 2022. What happened to them is not really an altcoin news, they just happen to have their own token.Quote from: wagmi on July 24, 2022, 11:14:44 PMQuote from: hatshepsut93 on July 24, 2022, 10:34:15 PMThis idea that shitcoins are responsible for Bitcoin crashes is doing more harm than good. It just ruins the credibility of Bitcoin as a currency and a reserve asset. Did you even try to read or understand my post? I said in my post it is essential to know Bitcoin is NOT related to Shitcoins. Because Bitcoin is COMPLETELY different from Shitcoins. Bitcoin is NOT tied to Shitcoins and people need to understand. People need to understand it and don't sell when a random Altcoin has issues. But some ppl even have no basic understanding about Coins and don't know basic rules. Bitcoin is on a different, own Blockchain!!!An Altcoin has no link to Bitcoin's tech. Bitcoin and Altcoins are totally independent, still people are getting FUD and sell Bitcoin causing a crash because such people HAVE NOT DONE RESEARCH. People need to start doing research. Remember that you also said this:Quote from: wagmi on July 24, 2022, 11:05:44 AM~ Recently, Altcoin pressure has resulted in Bitcoin losing value. Nobody is contesting that we should look at bitcoin and altcoin separately but anyone, probably other than you, would also take that statement the same as @hatshepsut93 that altcoin was the reason for BTC crash. Also, no one is against your statement that the market crashed because of fear/misconceptions and that it's irrational but the argument is you connecting it to altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "July 25, 2022, 05:58:01 AM",
      "body": "Quote from: Bttzed03 on July 24, 2022, 12:37:38 PMIt's not as simple as altcoin related.If I'm going to guess, it's more like this:Luna Foundation Guard (LFG) sold a significant amount of bitcoins (80K) after the 'attack' to save the dying UST, more bears took advantage of the situation to push the price down further, and then the majority of retail traders sold out of panic.If you're going to say the market crashed because of what LFG did, you might as well say they also helped pumped the price when they bought BTC for their reserve.You know, someone should make a timeline on how exactly Luna UST collapsed (even I am not quite sure what happened, as I have never heard of this token), and then post it somewhere here. So that the wild rumor-mill stops churning and everyone learns a lesson from this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bttzed03",
      "created_time": "July 25, 2022, 07:05:58 AM",
      "body": "Quote from: NotATether on July 25, 2022, 05:58:01 AMQuote from: Bttzed03 on July 24, 2022, 12:37:38 PMIt's not as simple as altcoin related.If I'm going to guess, it's more like this:Luna Foundation Guard (LFG) sold a significant amount of bitcoins (80K) after the 'attack' to save the dying UST, more bears took advantage of the situation to push the price down further, and then the majority of retail traders sold out of panic.If you're going to say the market crashed because of what LFG did, you might as well say they also helped pumped the price when they bought BTC for their reserve.You know, someone should make a timeline on how exactly Luna UST collapsed (even I am not quite sure what happened, as I have never heard of this token), and then post it somewhere here. So that the wild rumor-mill stops churning and everyone learns a lesson from this.It happened in May and you can already see a number of post-mortem analysis on the LUNA and UST crash online. This is probably the most detailed with all the dates and links - The Fall of Terra: A Timeline of the Meteoric Rise and Crash of UST and LUNA.For the said 'attack', there are still speculations on how it exactly happened.For the disposal of BTC80K, you can also find it on LFG's series of tweetsLFG BTC Address: bc1q9d4ywgfnd8h43da5tpcxcn6ajv590cg6d3tg6axemvljvt2k76zs50tv4q",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "July 25, 2022, 07:13:13 AM",
      "body": "Quote from: hatshepsut93 on July 24, 2022, 10:34:15 PM<Snip> Bitcoin didn't crash because an altcoin failed. But the foundation that stood behind that altcoin (Luna Foundation Guard) sold off billion dollars worth of Bitcoin. That's the connection. The sell-off. The owner of those coins isn't important and it could have been someone else. But this time, it was the team behind Luna who sold 80.000 BTC. That of course triggered other holders to sell and we know the rest. Bad news coupled with panic and FUD and here we are.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "July 25, 2022, 08:37:06 AM",
      "body": "Quote from: wagmi on July 24, 2022, 11:05:44 AMRecently, Altcoin pressure has resulted in Bitcoin losing value. A huge crash occured, where Bitcoin lost 10k USD. I disagree with your speculation. Altcoins have always created sell pressures on bitcoin but never too high to cause any crash of any size. In the most recent case we saw this too, there was a small panic sell but nowhere near $10k drop.You are missing all the other things that have been going on, the fact that the world economy is in a pretty bad shape these days and many other markets have been crashing too.You got the irrational part right though but the reason for panic sell was the economy crashing not some shitcoin being dumped.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}