{
  "id": "topic_5454696",
  "title": "airbin",
  "author": "airbin",
  "created_time": "May 31, 2023, 09:32:59 PM",
  "content": "Binance cotiza a la baja en Australia.QuoteBitcoin cuesta alrededor de 22.000 USD en Binance Australia: ¿oportunidad de arbitraje?Fuente de la web:https://criptoinforme.com/bitcoin/bitcoin-cuesta-alrededor-de-22-000-usd-en-binance-australia-oportunidad-de-arbitraje/La razón simple los retiros a su proveedor (AUD) estarían siendo suspendido apartir de mañana.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454696",
  "comments": [
    {
      "author": "Porfirii",
      "created_time": "June 01, 2023, 10:00:59 AM",
      "body": "Bueno, a mí me gusta más ver el titular en el \"Subject\" del hilo para saber si me interesa el tema antes de hacer click o no, pero si esta es tu manera personal de compartir las noticias es muy lícito.En cuanto al arbitraje, recuerdo que cuando conocí por primera vez las criptomonedas y los CEX hice algún pequeño experimento que a veces salió bien y otras no. No le presté demasiada atención pero creo que por aquél entonces sí que había una buena oportunidad de hacer negocio con el arbitraje.A día de hoy, han entrado actores tan grandes y está todo tan automatizado con bots que no creo que el usuario de a pie le pueda sacar demasiado provecho a estos desfases en el precio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Drawesome",
      "created_time": "June 02, 2023, 08:38:21 PM",
      "body": "Sí por favor. En el subject pon la noticia y así no hay que entrar a leer.El arbitraje siempre es posible, la pregunta es ¿tienes medios para arbitrar? Mi respuesta simple es No. Arbitran agentes con muchos más medios que simples mortales como nosotros.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "airbin",
      "created_time": "June 04, 2023, 03:49:14 AM",
      "body": "No quieres entrar a leer, que tontería dices.Creó que ninguno leyó el enlace de la noticia. Técnicamente es un arbitraje, pero la realidad es que ocurre por un problema de proveedor no por demanda y oferta.Y para poder hacer arbitraje debes tener una cuenta en la moneda local, no siempre es así pero es la mejor manera. Si no sabés hacer algo puede resultar difícil, pero no lo es.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Drawesome",
      "created_time": "June 10, 2023, 01:18:08 PM",
      "body": "Quote from: airbin on June 04, 2023, 03:49:14 AMNo quieres entrar a leer, que tontería dices.Creó que ninguno leyó el enlace de la noticia. Técnicamente es un arbitraje, pero la realidad es que ocurre por un problema de proveedor no por demanda y oferta.Y para poder hacer arbitraje debes tener una cuenta en la moneda local, no siempre es así pero es la mejor manera. Si no sabés hacer algo puede resultar difícil, pero no lo es. Preguntas opiniones y opiniones tienes. Lo de las tonterías es una falta de respeto que sobra.  Te digo que es imposible para ti, que llegas tarde porque te basas en una noticia. Entiendo que no estés de acuerdo con lo que te digo o no me creas, buena suerte encontrando a alguien que te ayude a arbitrar algo que ha salido en una noticia y estás seguro que se puede hacer fácil pero no sabes como",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}