{
  "id": "topic_5398998",
  "title": "alicetheman",
  "author": "alicetheman",
  "created_time": "May 17, 2022, 09:28:08 AM",
  "content": "I have bought some bitcoin and other crypto likes MANA, CAKE, DOT, ETH, and many other through USDT and USTIn future If i want to sell it against BUSD or any other stablecoin then is that possible? Means, whenever I sell Bitcoin, MANA, etc.... i get BUSD or other stable coin. Possible?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398998",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "May 17, 2022, 09:44:59 AMLast edit: May 17, 2022, 09:56:28 AM by OmegaStarScream",
      "body": "Why wouldn't it be possible? It is but I wouldn't recommend going with BUSD. It's too centralized and only available in Binance and a couple of DEXes on BSC. It might be a better idea to go with USDC or DAI which you can find in almost every exchange. OKX, Binance, Kucoin, Coinbase, etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "May 17, 2022, 10:05:16 AM",
      "body": "Not sure why you prefer BUSD specifically — but you can do it through Binance, as while there are other exchanges that support BUSD, Binance has the most liquidity. (along with PancakeSwap, but the coins/tokens you hold are native to the Ethereum blockchain so you're limited to Binance)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "May 17, 2022, 10:22:09 AM",
      "body": "That is the function of exchanges, to convert/trade/exchange from one coin to another. There are many exchanges that support binance coin. But I will give a good advice to never leave you coin on centralized exchanges, exchange your coin and move the coin you exchange to your noncustododial wallet.Quote from: mk4 on May 17, 2022, 10:05:16 AMNot sure why you prefer BUSD specifically — but you can do it through Binance, as while there are other exchanges that support BUSD, Binance has the most liquidity. (along with PancakeSwap, but the coins/tokens you hold are native to the Ethereum blockchain so you're limited to Binance)But he should know that Binance require identity verification",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "May 17, 2022, 10:46:26 AM",
      "body": "Quote from: Oshosondy on May 17, 2022, 10:22:09 AMBut he should know that Binance require identity verificationKnowing that OP managed to buy these coins, I'm going to guess that OP is fine with AML/KYC.Also, it's not like OP has any other choice but to use Binance (because liquidity) if he/she wants BUSD specifically.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Farma",
      "created_time": "May 17, 2022, 10:57:00 AM",
      "body": "Quote from: alicetheman on May 17, 2022, 09:28:08 AMI have bought some bitcoin and other crypto likes MANA, CAKE, DOT, ETH, and many other through USDT and USTIn future If i want to sell it against BUSD or any other stablecoin then is that possible? Means, whenever I sell Bitcoin, MANA, etc.... i get BUSD or other stable coin. Possible? of course it's possible. as long as the exchange you choose provides that option, then it's very easy. in fact, the purpose of the exchange was for just that. how can you buy a lot of coins but you don't know about the BUSD pair. try checking again on the exchange you chose, or on the popular exchange on coinmarketcap, you will see that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "May 17, 2022, 11:01:18 AM",
      "body": "You can always sell it to stable coins or fiat currencies if there is enough trading volume. The mentioned coins are good enough in aspect of trading volume.Let's be careful when you choose what stable coin to store your money. I read the advice from Peter Brandt months ago that if he chooses between stable coins and fiat currencies, he will choose fiat currencies. I think he is right after the death spiral of $UST.We know fiat currency has inflation but at least they won't vanish in the air like $UST.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alicetheman",
      "created_time": "May 17, 2022, 11:12:51 AM",
      "body": "Thank you everybody helping me. Really appreciate prompt help and reply from everybody",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}