{
  "id": "topic_5400895",
  "title": "Doctorbit69",
  "author": "Doctorbit69",
  "created_time": "May 31, 2022, 05:51:05 PM",
  "content": "hi ervyone im new on this and im looking for help, i bougth a h110 pro btc+ motherboard and im just starting with my rig and evrything works well but when im tryng to start witch cpu cables is not starting at all its like starting but not anymore ,  when i star without the cpu cable its working but with cpu cable not workingplease help me",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400895",
  "comments": [
    {
      "author": "rdluffy",
      "created_time": "May 31, 2022, 06:26:51 PM",
      "body": "Is this the CPU cable you're talking about?From PSU to MotherboardAnd how it's working well without cpu cable?Sorry but it's hard to understand your issue",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "miner29",
      "created_time": "May 31, 2022, 09:45:40 PM",
      "body": "On that board the manual shows that you need to plug in a pair (8 pins total) for the cpu.  If hes only doing a single plug it would explain it.Could just be a bad cable / psu.Hard to make out exactly what is going on though from the OP.  Maybe he can clean up the post and correct the misspelling / incorrect usage?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "June 01, 2022, 01:44:25 PM",
      "body": "Quote from: Doctorbit69 on May 31, 2022, 05:51:05 PMhi ervyone im new on this and im looking for help, i bougth a h110 pro btc+ motherboard and im just starting with my rig and evrything works well but when im tryng to start witch cpu cables is not starting at all its like starting but not anymore ,  when i star without the cpu cable its working but with cpu cable not workingplease help meWhat does working mean?To start the motherboard, it is enough to connect a 20 + 4 pin connector, but for the motherboard to work, you also need 4 or 4 + 4 pins, what you call cpu cable.Did you buy a used motherboard?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}