{
  "id": "topic_5479210",
  "title": "bitcoin talk",
  "author": "bitcoin talk",
  "created_time": "December 25, 2023, 08:06:57 AMLast edit: December 25, 2023, 08:23:53 AM by bitcoin talk",
  "content": "Can you recommend reliable virtual credit card (no KYC) for paying bills and just to throw it out there maybe even considering setting up paypal only if I have to. No KYC.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5479210",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "December 25, 2023, 08:13:50 AM",
      "body": "Quote from: bitcoin talk on December 25, 2023, 08:06:57 AMCan you recommend reliable virtual credit card for paying bills and maybe setting up paypal?Does it have to be non-KYC? If so, then as far as I know there are none that you could link to your PayPal account. Also, if by \"setting up paypal\" you mean \"verifying it\" it needs to be a Visa. A MasterCard is not going to cut it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitcoin talk",
      "created_time": "December 25, 2023, 08:18:10 AM",
      "body": "Quote from: OmegaStarScream on December 25, 2023, 08:13:50 AMDoes it have to be non-KYC? If so, then as far as I know there are none that you could link to your PayPal account. Also, if by \"setting up paypal\" you mean \"verifying it\" it needs to be a Visa. A MasterCard is not going to cut it.You can't payone until you verify (Paypal)? And verifying means photo id etc usual? Then we can exclude paypal from topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Natsuu",
      "created_time": "December 25, 2023, 04:26:29 PM",
      "body": "Would it be credible if it doesnt have KYC? Will you really trust it? I cannot endorse or encourage you to continue looking for one to pay for your bills. Engaging in financial transactions without proper identification can lead to serious consequences and is not advised.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "December 25, 2023, 04:32:37 PM",
      "body": "Quote from: bitcoin talk on December 25, 2023, 08:18:10 AMYou can't payone until you verify (Paypal)? And verifying means photo id etc usual? Then we can exclude paypal from topic.I have not used PP for some time, but verification with documents was not required until a certain limit was reached, and I think it was an amount greater than $2000.Quote from: OmegaStarScream on December 25, 2023, 08:13:50 AMDoes it have to be non-KYC? If so, then as far as I know there are none that you could link to your PayPal account. Also, if by \"setting up paypal\" you mean \"verifying it\" it needs to be a Visa. A MasterCard is not going to cut it.Right at the beginning, let me say that I have not personally tried it, but recently I saw this topic in which virtual cards (Visa&Master) are offered without KYC - and according to what is written in the description, they should work with PP and services such as Google Pay and Apple Pay.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "December 25, 2023, 06:12:43 PM",
      "body": "I went through a long mission to find a reliable crypto virtual credit card for purchasing online and doing payments. In summary I don’t advise using these kind if cards, especially for PayPal verification (long term use). Most of these cards are scams, characterized by exorbitant fees, including purchase, loading, and monthly fees.A few years ago, I expiremented with the Pyypl card. Despite the KYC process because I had to,it featured a commendable Mastercard with average fees and the option to load it with Binance or any other cryptocurrency. unfortunatly, this year the card was disabled due to issues created by the Dubai government accusing them of money laundering. They replaced the Mastercard with VISA. So the resume is that  finding a good virtual card with long term reliability and good services is not possible in my opinion and experience.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tyz",
      "created_time": "December 25, 2023, 09:13:24 PM",
      "body": "Quote from: bitcoin talk on December 25, 2023, 08:06:57 AMCan you recommend reliable virtual credit card (no KYC) for paying bills and just to throw it out there maybe even considering setting up paypal only if I have to. No KYC. As far as I know, there are currently no more virtual debit cards that you can use to pay without KYC. A few years ago there were many of such cards that could be used without KYC up to a certain daily or monthly limit. Since a lot of fraud has been carried out as a result, the providers (Mastercard, Visa) do not allow giving out (virtual) cards without knowing their customers anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "December 26, 2023, 01:56:44 PM",
      "body": "Quote from: tyz on December 25, 2023, 09:13:24 PMAs far as I know, there are currently no more virtual debit cards that you can use to pay without KYC. A few years ago there were many of such cards that could be used without KYC up to a certain daily or monthly limit. Since a lot of fraud has been carried out as a result, the providers (Mastercard, Visa) do not allow giving out (virtual) cards without knowing their customers anymore.I mentioned just one such, and you still claim that such a thing does not exist at all? There is always some kind of solution, the only question is how reliable it is and how much you have to pay for it.Quote from: GxSTxV on December 25, 2023, 06:12:43 PMI went through a long mission to find a reliable crypto virtual credit card for purchasing online and doing payments. In summary I don’t advise using these kind if cards, especially for PayPal verification (long term use). Most of these cards are scams, characterized by exorbitant fees, including purchase, loading, and monthly fees.~snip~Any such service without KYC simply cannot be cheap because anonymity has its price, especially when it comes to paying with \"anonymous\" cards. Someone on the forum has been selling \"anonymous\" bank cards for a long time and no one has complained so far - but the question is who can afford to pay around $1000 a year for such a service.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Publictalk792",
      "created_time": "December 27, 2023, 05:35:20 AM",
      "body": "It is important to note that most virtual credit card providers and payment platforms including PayPal typically require some form of identification verification. This is to comply with legal and regulatory requirements as well as to ensure the security of transactions.It is  important to find a balance between want privacy and following the law.If you really care about privacy you might want to try other ways to pay that focus on keeping your information private like using cryptocurrencies or anonymous payment systems. But it is also really important to know the risks and limits of these options.But these platforms like you have mentioned PayPal so I think if they are asking for KYC so you should keep in mind they are asking due to the law enforcement and doing it for security. So I think a platform is reliable so we should complete the KYC process.But there are many platforms which can compromise on your security so always be careful while giving them your personal information which you think should not be given to anyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "December 27, 2023, 06:40:21 AM",
      "body": "Quote from: bitcoin talk on December 25, 2023, 08:06:57 AMCan you recommend reliable virtual credit card (no KYC) for paying bills and just to throw it out there maybe even considering setting up paypal only if I have to. No KYC. Is it mandatory for you to pay the bills via VCC and what do you mean by \"just to throw it out there\"?All the VCC providers, that are somewhat reliable require KYC. You can get a prepaid virtual card without KYC, but prepaid cards won't do the work. I've spent several months looking for a good non-KYC VCC provider with a reasonable price, but I failed at finding one.There was a forum thread in the Service Discussion forum, posted by Ratimov, where he lists all crypto virtual card providers.You can check his forum thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ronsbit",
      "created_time": "December 27, 2023, 06:49:50 AM",
      "body": "Quote from: bitcoin talk on December 25, 2023, 08:06:57 AMCan you recommend reliable virtual credit card (no KYC) for paying bills and just to throw it out there maybe even considering setting up paypal only if I have to. No KYC. You really can not get such offer from any virtual credit card company in any part of the world as they are government regulated  organisation. Any of such organisation that does that would be held accountable by the law for their actions. So I think non of them would want to fall victim of such and if anyone wants to convince you that they do such, run for away because they are scammers and are looking for who they could fool and deceive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "December 27, 2023, 07:01:32 AM",
      "body": "I don't think you will find any VCC anymore that would not do KYC. I think that's already standard protocol towards financial institutions to prevent money laundering type of things.Upon a quick search, I saw this.https://fintechbusinessweekly.substack.com/p/stripe-celtic-bank-power-no-kyc-stablecoinI'm not affiliated with that, just did a quick search about this and this is what I saw.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "December 27, 2023, 09:27:28 AM",
      "body": "All of them are prepaid cards that come in small amounts, not exceeding $500 in most cases, and are sold at a high price. You need to buy new cards every time. In addition, you need a PayPal account with which identity verification has been completed, and you risk linking cards that may be hacked or stolen to an account. It contains your personal information, which may expose you to some legal problems.If you want to complete card verification, it may work, but the risks are greater.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Assface16678",
      "created_time": "December 27, 2023, 09:44:53 AM",
      "body": "I don't think there will be a credit card company that will allow their users to use their credit card without KYC. Why does there have to be no KYC? Then it will be unfair on the side of the credit card company because if something goes south, they have no contact with you, and do you think it will be legal to have a credit card without KYC? No, of course, because the merchants will ask for the credit card holder's name before the transaction is done, and if you lose your credit card and someone else uses it, they can freely use it as there is no information about who the owner is. I don't know your intention why you don't want KYC; I don't want to judge, but the thing is, it's impossible, and I don't think there is a credit card company that will let their customer not undergo KYC. For convenience, comply with KYC; it's for your own good and the credit card company's.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "December 27, 2023, 10:24:25 AM",
      "body": "Quote from: davis196 on December 27, 2023, 06:40:21 AM~snip~There was a forum thread in the Service Discussion forum, posted by Ratimov, where he lists all crypto virtual card providers.You can check his forum thread.You obviously live in a world of your own and have no idea what is happening on the forum - that user you mentioned changed his name on the forum and deleted most of his topics. Quote from: hugeblack on December 27, 2023, 09:27:28 AMAll of them are prepaid cards that come in small amounts, not exceeding $500 in most cases, and are sold at a high price. ~snip~I posted a link to a card that has a limit of max $1000 and should be valid for 3 years - I'm surprised that no one read my post and clicked on the link, which by the way is a forum link (ANN thread).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alecfisker",
      "created_time": "December 27, 2023, 11:31:43 AM",
      "body": "Quote from: bitcoin talk on December 25, 2023, 08:06:57 AMCan you recommend reliable virtual credit card (no KYC) for paying bills and just to throw it out there maybe even considering setting up paypal only if I have to. No KYC. people selling gift cards, one time usage cards, text me for quote",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitcoin talk",
      "created_time": "December 28, 2023, 01:30:09 AMLast edit: December 28, 2023, 10:13:11 PM by Mr. Big",
      "body": "Quote from: davis196 on December 27, 2023, 06:40:21 AMThere was a forum thread in the Service Discussion forum, posted by Ratimov, where he lists all crypto virtual card providers.You can check his forum thread.I used forum search and typed in 'virtual card\" and user:  Ratimov and got no results. Other results present Ratimov as deceptive.Quote from: Lucius on December 27, 2023, 10:24:25 AMI posted a link to a card that has a limit of max $1000 and should be valid for 3 years - I'm surprised that no one read my post and clicked on the link, which by the way is a forum link (ANN thread).I don't see that link here?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayu7adi",
      "created_time": "December 28, 2023, 05:45:03 AM",
      "body": "It's challenging to find what you're looking for because it's related to centralized companies. They'll still require KYC as a condition to create a valid VCC (as far as I know).If you're really concerned about your privacy, buying a VCC might be a solution, or purchasing a ready-to-use PayPal account. It seems like you can't avoid KYC data, but it can be redirected by someone else. So, the information on the purchased VCC and PayPal will belong to someone else, while your data remains private.This method is a bit risky because the seller might still have full control of the account. So, for significant transactions, I can't recommend it, as there could be potential issues in the future. For small transactions, you could make a one-time deposit and spend the entire balance",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "December 28, 2023, 11:34:22 AM",
      "body": "@bitcoin talk, I already wrote to you not to break the forum rules by \"posting multiple posts in a row\", which you obviously ignore. I also replied @davis196 that the user @Ratimov no longer exists, and that he deleted a lot of his posts, and I wonder why you refuse to read and understand what is written?Quote from: bitcoin talk on December 28, 2023, 01:31:36 AMQuote from: Lucius on December 27, 2023, 10:24:25 AMI posted a link to a card that has a limit of max $1000 and should be valid for 3 years - I'm surprised that no one read my post and clicked on the link, which by the way is a forum link (ANN thread).I don't see that link here?The link is in my first post of this topic, hidden behind a hyperlink - and if you still can't find it, then you should go back to the basics of using the forum, and only then ask questions...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d@v",
      "created_time": "February 25, 2025, 04:24:44 PM",
      "body": "If you're looking for a hassle-free way to get virtual cards without KYC, I’d recommend checking out BingCard. They support crypto payments, making it easy to top up and use your card.  A couple of months ago, their service went down, but all card balances were refunded, and users could withdraw funds in crypto. I didn’t personally withdraw, but everything seemed to work fine. Now that they’re back, you can create cards again, and they’ve even expanded their offerings.  What’s interesting is that they now have cards compatible with Apple Pay and Google Pay, which is a nice addition. If you're signing up, you can use referral code 232323.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}