{
  "id": "topic_5446468",
  "title": "Alik Bahshi",
  "author": "Alik Bahshi",
  "created_time": "March 27, 2023, 11:37:49 AM",
  "content": "Alik Bahshi                                                         People's fate          Everyone is different and distinct from each other, not only visually, but also features an individual thinking and behavior. Each man has his own destiny, and attempts to change it is hopeless, because change itself, not as a person. A similar observation can be transferred to people. Inherent to every nation on the common features is not very difficult to recognize the typical representatives of different nations. Just as we can give a description of an individual, and can be characterized by a whole people. Every nation has the genotype, that is, hereditary characteristics, which are likely the people can identify and which determine its historical destiny. Thanks genes we have such a variety of people and as a result states. From this we can conclude that it is the people as a group of people united not only by a common historical past, but also a common future, that is destiny. Thus determine the fate of hereditary characteristics from which no getting around it, which once again points to the validity of the famous wise saying \"can not escape the fate\", and most importantly in our case, this is true for all the people in general, not just for the individual.      The question is, why Peter touts Germans in Russia? Because he realized that only the Germans (not French and Italians) can teach Russian law, and the management work that only they can rely on it to his intended reorganization of the state reformatory. In the former Soviet Union can be found German villages, which contrast with the beauty, neatness and order. Even when you are not in their homeland, people do not leave their habits and lifestyles. If they say that, in cases Englishman can usually rely on the word, it goes without conclusion is that, when dealing with someone else, you should not rely solely on words. Gypsies love liberty, but hard work is a burden to them. Russian differ in their .... However, it is better not to detail these differences, because both positive and negative traits can be found in every nation. We note only that, however, such as the Arabs did not want to, they can not be like the Scandinavians, and is not that important external difference as a difference in mentality.You can spend a mental experiment. If the German, Russian and Hebrew, along with their families to land on a desert island and visit them, that way, in ten years, in what condition we find them? It seems most likely the following simplified picture. The German - solid house with a garden and a strong economy. Russian lives in a mud hut, and rotten to the Germans, and a Jew is mediating between them, say, to buy vodka at the German and Russian markets. Or let's say, what if all the Swiss move to Mexico and Mexicans in Switzerland. How do you think, what would be in this case, well-groomed, and how rich Switzerland transformed Mexico. Probably not hard to imagine what would happen to Germany and Russia, if we make the cross-migration of peoples. No climatic or geographical conditions do not change the character of the people. Why did the Japanese live richer Vietnamese or Russian? Because they are the Japanese and the other explanation is needed. Give Roma land, give them the opportunity to live and handle it, alas, the next day you're gypsies in the land will not find. A similar case is unnatural for Roma, they have a different way of being, however, is not for them alone. Impoverished after the war, do not have any natural resources, Japan and Germany, but by the willingness and ability of their people to work much more than that, what country is Russia. Finland, a former colony of Russia, not a rich mineral resources, with severe climatic conditions far ahead of Russia in terms of life and an explanation of this one, there lived Finns. There is no other explanation. Quite the opposite result, we will have, if hypothetically settle in this territory Russian. I do not for a moment doubt that if the Russian succeeded in 1940 again returned to Finland in the empire, then the standard of living adequate for today's Russia there. So that Finns know why they need the freedom and appreciated this neohodimosti condition for people who can work and wants to decide their own destiny. An empire could not break this will to freedom.There are no racist or nationalist ideas, I do not pursue, just stating the fact that every nation has its own character and therefore his fate. It would be sheer folly to assert the superiority of one nation over another on the basis that they are at different stages of social development. Yes Englishman richer gypsy, he has his own house, his own country, the Falkland Islands, in the end, there was nothing like a gypsy, but he did not have to, because he belongs to the whole world. Summarizing, we can say that's what people probably unknowingly, and according to their own way, people's mentality is an addiction, and it has. You can realize many of the social phenomena associated with a particular people, and according to its historical destiny.Unless the person who has musical talent and love music trying to make a talented mathematician, it is unlikely to come out of this venture is something worthwhile. Beginning with Peter the Great Russian people literally pull the ears in Europe, but the distance is not at all close. The latter idea, related to the introduction of Western-style democracy, torn Russia, just kak all previous Russian foreign to the spirit of innovation. Since the days of Rurik Russian used to be ruled and desirable by people because they themselves are useless organizers.Russia has reached the highest dawn of Catherine the Great, which is two words, then in Russian could not connect. In Russia Oblomovism this phenomenon, not a special case. Who made up the backbone of the Bolsheviks, led by Lenin? Whether there was a lot of Russian? Do not want to be like Russian nationalists, accused of all misfortunes of the Jews. But on the other hand, where you were Russian businessmen, when for example, given the freedom of economic activities after the collapse of the communist ideology. Why were people oligarchs, well, non-Russian nationality? And again, there's no guilt Russian. The fact that the Russian see other value for money than the Jews or Germans. The value of money for the Russian people, is to have fun. From classical Russian literature: Russian aristocrat could dissipate money, drink, and not as I do not spend for useful work. For a Jew money are valuable in themselves, and are a means to enlarge the scheme: money - (mediation, foreign exchange) is money - in other words, the money put into circulation, to make money. The desire to have money in preference to any other property, whether land, factory, farm, make the Jews mobile. They like the Roma, who appreciate the absolute freedom and gold, are not tied to one place and can migrate to any vending their country. A good example is the mass migration of Jews associated with the collapse of Communism and the collapse of the USSR, and preference was given to America and the rich countries of Western Europe, mainly Germany, despite the Holocaust, and not problematic for Israel. But not always for the money can buy everything. For example, there was a famine, no one will sell you bread. And then, the money can be taken away, the one who made the money gun. No wonder the prophet Moses warned his tribe from the worship of the Golden Calf. Unfortunately, either then or later, that charge is left without proper obedience. The people who can not feed himself, will always depend, - gold not grow corn. And in order to grow grain, we need not only his own land, but also their sweat. Germans see the money means for production, that is, they do not appreciate the money as such, but a product that can be made on the money (according to the scheme: product - money - product). Therefore, banks have been the Rothschilds, and the means of production from the croup. The Russian is no such cycle (money - fun - ...). Of course, this is a very rough and simplified scheme to caricature.In post-communist Russia bankers, traders Tipster emerged mainly from the Jews not to leave the country, but the major manufacturers have not appeared. Though again shills in the country of the Germans. Group of oligarchs that emerged under Yeltsin, the authorities take this free enterprise and using the lack of initiative of the Russian population, achieves a significant impact, both in financial and political spheres. Yeltsin, who regarded himself as the guarantor of the Constitution, which in Russia has always been a dead letter, in fact, is the guarantor of the financial well-being of the oligarchs. It was under Yeltsin symbiosis of power and money reaches its highest peak. The new government, which replaced the communists, provided an opportunity for easy dressing, so instantly corruption permeates all echelons. Money and power gain in the circumstances, Russia unlimited possibilities. For the money, the oligarchs bought parliamentary seats in the State Duma and government posts. Berezovsky is the richest man in Russia with Israeli citizenship, became secretary of the Security Council. Though later, already, as secretary, Berezovsky rejects Israeli citizenship, but this fact only underlines the uniqueness of the situation. Can you imagine a similar post in Israel occupied people, an ethnic Russian, and even with Russian citizenship. In Putin as in traditional executive officer KGB oligarchs saw limp puppet, which will allow them to further enrichment by the sale of the country's natural resources without creating manufacturing enterprises. This trend in the economy could put Russia in a position of countries that are resource fringes of the West and Japan. Russia from the former dictatorship \"of the proletariat\" could turn into a country of the dictatorship of the oligarchs. (By the way, America is wary of Russian oligarchs close some of them to enter.) This outcome was favorable pathologic complete political bezinitsiativnost Russian people. New new rich did not associate their future with Russia. First of all, they saw it as a country. They are all pre-produced rear in Israel and in other countries, taking out there as much as possible their capital. Russia is for them only a means of enrichment. However, Putin's time they did not see the other side of his nature. As a true security officer, he managed to hide his ambitious future intentions, mixed with strong patriotism. Then the oligarchs did not foresee the danger to their financial empire is Putin. On the other hand violence against the oligarchs prevented spontaneous pogroms, which inevitably would occur, with further economic stratification of society, when one of the causes of such a bundle is readily apparent national factor.It is worth noting that the fight against oligarchs Putin and his anti-democratic politics, was a lightning rod of an approaching storm in the form of the growth of a large number of various nationalist and clearly pro-fascist parties and organizations in Russia.The victory of democracy turned around for the Russian people to complete impoverishment and ultimate collapse of the Russian Empire. Can I like the Russian people to pay for their freedom? Do all the freedom, the people who carries a gene Oblomovism? Only a dictatorship for the society, who does not want to engage in any political or economic problems. So the rise of Putin is not accidental, but fatal for the Russian people.The collapse of the communist ideology has put the Russian people in a dilemma of choosing between freedom and dictatorship, and the people decided not to tempt fate and chose tradition, according to the mentality, the last. The unpopularity of democratic ideas in the Russian environment is reflected in the composition of the national leaders of the Democrats. Moreover, unjustifiably high political ambitions of each individual, Yavlinsky, Nemtsov and Hakamada, ripped, in the end, the balloon of their verbiage.Russian people prefer the Little Father in the face of Putin, the man did not take place in any party, which is a simple, international, without any ambiguity, vowed to strangle the vermin (ie Chechnya), fighters (ie Chechens), wet in the toilet, and all the other Western guardians of democracy to get circumcised. Do you think it was possible after such a clear and concise policy speech to select a presidential some busybody Democrat willing to distribute empire infidels. Magnificent triumph in the presence of priests and high officials of the state on the occasion of Putin as president more like a coronation to the throne than the taking of the oath.Putin came not so much a revival of the empire, and how many, continued her agony that is dangerous to the world, even more so when one sixth part again, apparently installed a totalitarian regime.In the incident, of course, wine mladodemokratov Russian who had to take into account the mentality of the Russian people during the market reforms in the economy and not to go to a situation appears oligarchs. Mladodemokraty naively believed that enough to deprive the communist government, the people gladly take advantage of being given the opportunity for free political and economic activity, by which Russia is sure to reach the standard of living of the world's leading powers. But in reality, trying to taste democracy, the Russian people, in fact, rejected it as not acceptable for domestic use._____________I want to say a few words about the \"Other Russia\", a new party - a new attempt talkers Democrats, led by American paratroopers emerged from Garry Kasparov, Russian fool and seize power. He decided to checkmate the Russian people outside the chess board. True to the role of first violin there like Kasyanov claimed, but \"The Other Russia\" is not the Russian party. Even if we assume that they will be able to buy the Russian voters, they are still not good for Russia will not do (you can not change people's character and his destiny), and only an even stronger robbery happen, because they, unlike Putin, all currency will place on foreign banks, and the Russian people do not get it. Russian people for himself nothing of democracy will not win, because, I repeat, democracy requires the active participation of people in politics and the economy, that is, what is not traditional in the Russian people. It is this fact, and it is tempting for people like Kasparov (Weinstein), why not use the political passivity of the people and enter into power in pursuit of personal interests. Thought, why Kasparov-Vanshtein not try to Armenia or Israel, but there it is reaching out to Russia, where it is possible to use passive people. The closer the elections in Russia, the more active of the natives of the \"Other Russia\" for self-promotion. Truly greed for power and money overthrew former players - the new leader of talkers Democrats.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446468",
  "comments": [
    {
      "author": "BADecker",
      "created_time": "March 27, 2023, 05:19:58 PM",
      "body": "You seem to forget that the reason why the US is using Ukraine against Russia, is that the US failed in using Russia for its dastardly purposes. Russia freed itself from US domination years ago.You must have writers working for/with you to print up so many words, without being able to even get around to your point, clearly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "March 27, 2023, 08:24:10 PM",
      "body": "Quote from: BADecker on March 27, 2023, 05:19:58 PMYou seem to forget that the reason why the US is using Ukraine against Russia, is that the US failed in using Russia for its dastardly purposes. Russia freed itself from US domination years ago.You must have writers working for/with you to print up so many words, without being able to even get around to your point, clearly. Извинитe, Bы этo o чeм? Здecь тeмa coвceм нe o тoм, чтo Bы тyт излaгaeтe. Haйдитe дpyгyю тeмy бoлee пoдxoдящyю для Baшeгo пocтa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}