{
  "id": "topic_5448886",
  "title": "worldtraveller321",
  "author": "worldtraveller321",
  "created_time": "April 14, 2023, 09:04:03 PM",
  "content": "With the printing of fiat money that is always in constant motion by the powers that be.As the fiat money devalues in value. The value of BTC and other cryptos goes up.So if the banks etc printing all fiat out of crazy numbers, then we should be in a guarantee of BTC going to over a million perhaps.Does that mean we should be embracing the printing of money?Make all our money go totally out of value, so anyone holding BTC can get good value?Does this make sense?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448886",
  "comments": [
    {
      "author": "PrivacyG",
      "created_time": "April 14, 2023, 09:15:47 PM",
      "body": "Not really.  Sure, you now hold Bitcoin and you are some what secured against inflation and the quick depreciation in Fiat value.  But.  Now all your expenses increase.  Volatility in the Markets increases too.  Prices for every thing do too.  Every thing increases and what you now own is a volatile asset.Do not get me wrong.  I love Bitcoin and I do think it is a particularly great asset to hold on to while inflation happens.  But being volatile, it does not make a great asset to use as the only string to rely on when the economy is going really bad.  You need multiple strings.  Bitcoin itself will do an amazing job at making you not feel inflation but not all the time.Bitcoin is here particularly due to what printing of money does to the economy.  It is particularly here to offer an alternative and a shelter against such unfortunate events.  We should not embrace the printing of money.  It destroys lives of people and families.  It destroys economies.  It makes the whole system cripple only to drop down the middle class to the lower and make the top of the pyramid be stronger than ever.  We should embrace the use of Bitcoin and help others get out of the very muddy Fiat system and move on to Bitcoin instead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "April 14, 2023, 09:23:55 PM",
      "body": "Ops note that when money loses its value the rate of inflation increases so is the price of goods and services and that will cycle down to your Bitcoin value not having any real-world value since you need to exchange your Bitcoin for goods and services or convert it to fiat before it is used. So ultimately let us work for a good economic system that allows value for money through the lowering of the inflation rate and increasing the purchasing power of the people to allow economic growth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "April 14, 2023, 09:29:29 PM",
      "body": "Quote from: worldtraveller321 on April 14, 2023, 09:04:03 PMWith the printing of fiat money that is always in constant motion by the powers that be.As the fiat money devalues in value. The value of BTC and other cryptos goes up.So if the banks etc printing all fiat out of crazy numbers, then we should be in a guarantee of BTC going to over a million perhaps.Does that mean we should be embracing the printing of money?Make all our money go totally out of value, so anyone holding BTC can get good value?Does this make sense?OP, we should not embrace the fact that our local currencies are devaluing because I don't think it makes anyone happy. The fact that the purchasing power of money is heavily depreciating doesn't make anyone feel better, and it's not even a good thing for the economy. The high rate of printed cash has a big disadvantage in society; for example, an average citizen of a country that is greatly inflated cannot solve all of their budget with their monthly salary, which in turn has a negative impact on their lifestyle.It doesn't mean that Bitcoin's value and price will not go high if the rate of dollars printed is reduced. Do not forget that there are various factors that drive the price of bitcoin, such as high demand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kgdktac",
      "created_time": "April 14, 2023, 09:31:05 PM",
      "body": "it is not necessarily a good thing for the overall economy. The printing of excessive amounts of fiat money can lead to inflation, which can cause prices to rise, making it more difficult for people to afford basic necessities.while the devaluation of fiat currencies can have a positive impact on the value of cryptocurrencies, it is not a sustainable or ethical strategy to intentionally devalue fiat currencies in order to drive up the value of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "April 14, 2023, 09:31:10 PM",
      "body": "pick a dozen random daily living goods/services. and compare bitcoin to how many goods/services can buywhat people want is to be able to buy more goods/services the more they wait/hoard. its got nothing to do with $ price, which loses value(number of goods bought)so compare it to for instance the \"bread loaf\" value. how many loaves could you buy now compared to 2020 compared to 2017 compared to 2014",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "April 14, 2023, 10:09:36 PM",
      "body": "While I understand your point, inflation causes our daily expenses to skyrocket, so even if we suppose that Bitcoin's value rises due to the increasing inflation, it's actually quite pointless because the fiat money that you'd be exchanging your Bitcoin with has actually a smaller purchasing power. In the end, at some point, the majority of us will exchange our crypto for fiat, so it's not like we won't be affected at all.I'd also find it immoral to praise an increase in inflation just to gain profit from cryptocurrencies when the average household is struggling to make ends meet, but that's a story for another day. It wouldn't be us to blame, but I bet you understand where I'm coming from.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "April 14, 2023, 10:19:49 PM",
      "body": "Inflation is good if it happens in a controlled level. Anything too much is bad, and we have seen it in the case of several countries battling severe bouts of hyperinflation. By wanting to get too much inflation, we also disregard a lot of other things: prices of goods, wages that aren't really moving towards the benefit of the working class, etc. Sure, you get more USD through bitcoin and crypto, but what about the others around you? Even without inflation, bitcoin and crypto seem to be doing good in terms of price appreciation and overall valuation. I don't think we need to wish ill will to fiat currencies in order to get some good gains on our bags. In the end, it will screw us over and those bags of ours will also be worthless if fiat is worthless.Inflation has always been a double-edged sword. While the right amount may signify progress and better economic conditions, asking for too much is like asking to burn the value of money right in front of us even if it means getting more in bitcoin and crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "April 14, 2023, 10:25:40 PM",
      "body": "Quote from: worldtraveller321 on April 14, 2023, 09:04:03 PMDoes that mean we should be embracing the printing of money?Why comparing bitcoin with inflation or printing of money, we can join them together becau they exist differently, one of the assurance in bitcoin is that it does not undergo inflation because it's a decentralized currency, another thing is that we need to understand the printing of money without limit whereby with time to time, there will always be a continuous print of new notes, if you chose bitcoin, you wouldn't want to go back again to fiat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WeThePe0ple",
      "created_time": "April 14, 2023, 10:26:31 PM",
      "body": "Quote from: worldtraveller321 on April 14, 2023, 09:04:03 PMWith the printing of fiat money that is always in constant motion by the powers that be.As the fiat money devalues in value. The value of BTC and other cryptos goes up.So if the banks etc printing all fiat out of crazy numbers, then we should be in a guarantee of BTC going to over a million perhaps.Does that mean we should be embracing the printing of money?Make all our money go totally out of value, so anyone holding BTC can get good value?Does this make sense?If this is true, purchasing BTC only protects your savings from being evaporated through inflation.However purchasing BTC does not allow you to gain a salary (and thus prosperity) that is adjusted to the inflation.I see BTC as a hedge against the confiscation of wealth (fiat currency) that you hold at this point. But BTC can not prevent people from getting paid in debased currencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "April 14, 2023, 10:31:36 PM",
      "body": "Quote from: worldtraveller321 on April 14, 2023, 09:04:03 PMDoes that mean we should be embracing the printing of money?No, it might look good in increasing the fiat value of Bitcoin but inflation does not do good on the economy of a country.  Yes, Bitcoin fiat valuation will increase and so the price of commodoties too.  I would rather have good economic situation and having the Bitcoin value increase slowly than a devastated economy with high BTC price.Quote from: worldtraveller321 on April 14, 2023, 09:04:03 PMMake all our money go totally out of value, so anyone holding BTC can get good value?With money going out of value, prices of commodity is also affected.  Those who have stash of Bitcoin maybe sitting pretty well but those who are not involved or just beginning to get involved with Bitcoin will have difficulty.Quote from: worldtraveller321 on April 14, 2023, 09:04:03 PMDoes this make sense?No, I prefer a healthy economy with an average Bitcoin price than a devastated one with extreme Bitcoin price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "April 14, 2023, 11:06:14 PM",
      "body": "Quote from: worldtraveller321 on April 14, 2023, 09:04:03 PMDoes this make sense?That argument does not hold water. Inflation caused by excessive money printing diminishes the value of earned income, resulting in a reduction of purchasing power. As the prices of goods and services increase, people are forced to spend more of their income on basic necessities, leaving them with less disposable income to invest. In this context, advocating for the printing of money to benefit Bitcoin fails to account for the negative effects of inflation on people's lives and investments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "April 14, 2023, 11:58:47 PM",
      "body": "That's the logic that I've to understand when I've read someone's point to be the same as yours. That's just one way for Bitcoin to reach another high but we won't be dependent on the high inflation that will be made from USD or any other fiat because that's essential that inflation will be there. And the common growth for Bitcoin has always been natural and that's just one of the factors that are being considered. I even read someone predicts about bitcoin $10M because of high inflation and devaluation of dollar but then, don't be too overhyped with those as you'll never know what's with up with global economy. Just as bitcoin, they're all unpredictable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "April 15, 2023, 12:11:38 AM",
      "body": "Definitely not, I agree with others. I mean if you keep wanting dollar (or any other fiat) go out of this world, that means you would be living a terrible life paying so much. Take it from someone who had %200 unofficial and at some point %100 or so official I think? Inflation in his nation, that's not something bitcoin can cover. First of all you would need ALL fiats to do that, just one or two would make those nations economically in trouble, secondly bitcoin is not accepted everywhere yet, so if you spend it, you can't get it back, once you invested and profited, that's it and you can't anymore. Whereas the trouble will continue to go on and you would not be making any profit at all while in trouble.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Party24*7",
      "created_time": "April 15, 2023, 02:57:54 AM",
      "body": "Quote from: worldtraveller321 on April 14, 2023, 09:04:03 PMWith the printing of fiat money that is always in constant motion by the powers that be.As the fiat money devalues in value. The value of BTC and other cryptos goes up.So if the banks etc printing all fiat out of crazy numbers, then we should be in a guarantee of BTC going to over a million perhaps.Does that mean we should be embracing the printing of money?Make all our money go totally out of value, so anyone holding BTC can get good value?Does this make sense?The price of bitcoin depends on many factors, the fact that banks print money is just one of many reasons why the price of bitcoin increases. Most commodities and assets appreciate in price due to high demand. If the government prints a lot of money but demand for bitcoin doesn't increase, it won't increase in price either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "April 15, 2023, 03:50:16 AM",
      "body": "Quote from: worldtraveller321 on April 14, 2023, 09:04:03 PMAs the fiat money devalues in value. The value of BTC and other cryptos goes up.True, many people always compare Bitcoin with fiat which I think it's useless where the meaning is the same as inflation itself. We refuse the bank to print fiat, but we always compare Bitcoin with what they print, it is just the same thing with agree. because of that thing, bitcoin is always affected by inflation, If we want to reduce it, from today we must not compare it again with fiat, so 1 BTC = 1 BTC, and done, no more inflation we have to talk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gallar",
      "created_time": "April 15, 2023, 03:53:35 AM",
      "body": "Quote from: worldtraveller321 on April 14, 2023, 09:04:03 PMWith the printing of fiat money that is always in constant motion by the powers that be.As the fiat money devalues in value. The value of BTC and other cryptos goes up.So if the banks etc printing all fiat out of crazy numbers, then we should be in a guarantee of BTC going to over a million perhaps.I think doing this is very inappropriate, it will not be easy to overthrow fiat money, because fiat money is under the responsibility of their respective countries, each country will definitely maintain the fiat money that applies in their country, so that it does not fall and continues to stand firmly.I am also a pro for bitcoin, but if I have to arriveToppling fiat money in favor of rising bitcoin prices, it feels like unkind and too extreme. Because even though fiat money drops very drastically downwards, then inflation occurs, is it possible that our lives will be more comfortable? I do not think so.And actually there is no need to bother deliberately to roll over fiat money, for the sake of rising bitcoin prices, let alone until inflation occurs, things like this are not needed. Because I have confidence in bitcoin, even though I don't use the method described above, I believe bitcoin will continue to experience growth and development. As it is clear, bitcoin will definitely continue to be popular going forward, and lead to a new economic heyday.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "April 15, 2023, 04:08:46 AM",
      "body": "Quote from: worldtraveller321 on April 14, 2023, 09:04:03 PMDoes that mean we should be embracing the printing of money?As you have been told, printing is not necessarily good, especially if it is excessive. The rise in the price of bitcoin, which is generally measured by the USD pair, has two components. The first is the rise in demand, because people realise the value of bitcoin and want to buy it. Given the limited supply of bitcoin, the price rises. Secondly, there is the devaluation of the dollar, which is of less interest to us. Because of the first factor, you are able to buy more and more things with the same amount of bitcoin, but not because of the second.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "April 15, 2023, 04:10:11 AM",
      "body": "Quote from: worldtraveller321 on April 14, 2023, 09:04:03 PMWith the printing of fiat money that is always in constant motion by the powers that be.As the fiat money devalues in value. The value of BTC and other cryptos goes up.So if the banks etc printing all fiat out of crazy numbers, then we should be in a guarantee of BTC going to over a million perhaps.Governments don't ask for our acceptances to print more fiat currencies. They do it from their own decisions that match with their policies, strategies for their own benefits. We can not stop governments and central banks on this so we have to accept this fact and live in a world of inflation.Of course inflation of fiat currencies and their decreasing purchasing power can force people to find better alternatives. One of the best alternatives for people to consider is Bitcoin with only 21M bitcoins in total supply. No miners can create more than 21M bitcoins after 2140 and this fact is interesting and attractive for investors who are tired and scared of fiat inflation.However we don't need to see something like a bomb of inflation from fiat currencies globally. It won't be good for Bitcoin and our lives when a whole world is in economic apocalypse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Patrol69",
      "created_time": "April 15, 2023, 04:27:06 AM",
      "body": "As a result of inflation, the economic system of a country is seriously damaged. In all countries where inflation occurs, the prices of essential goods increase significantly.  Many countries are already bankrupt due to inflation. However, by inflation we mean the decrease in the value of one's own currency and the increase in the value of the dollar.  What is the relationship between inflation and the increase in the value of Bitcoin?  Which country's inflation can you blame on the international currency. Because the value of money in those countries has decreased due to the increase in the value of the internationally accepted currency.  If bitcoin was a globally accepted international currency, you could blame bitcoin for the devaluation of paper money to increase the value of bitcoin. So I think Bitcoin price rise can never be responsible for inflation in any country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}