{
  "id": "topic_5451115",
  "title": "tg88",
  "author": "tg88",
  "created_time": "May 03, 2023, 03:32:53 PMLast edit: May 03, 2023, 05:48:03 PM by tg88",
  "content": "Hoje alcancei o ranking legendary, foram quase 6 anos, mas oque vale é tudo que aprendi e também um pouco do que compartilhei por aqui nesse período. Obrigado a todos que contribuíram para que eu pudesse alcançar esse ranking.Estou feliz por nossa aba estar bem fortalecida atualmente e dando chance para que novos usuários também tenham acesso às oportunidades que esse fórum nos proporciona.Participar do bitcointalk transformou profundamente minha vida.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451115",
  "comments": [
    {
      "author": "Paredao",
      "created_time": "May 03, 2023, 05:46:11 PM",
      "body": "Meus parabéns por mais essa conquista. Você mereceu. Agora você chegou ao topo da carreira aqui no bitcointalk. Terá acesso a áreas Vips em voos internacionais, descontos em cinemas e parques temáticos, fora outros mimos que tal cargo proporciona. Brincadeirinha   . Ser Legendário é algo que nos dá muita honra, sendo este o principal fórum sobre bitcoin do mundo. Meus parabéns novamente.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "May 03, 2023, 05:48:01 PM",
      "body": "IHAAAAA!Parabens por se juntar ao clube das lendas legendárias! O Tg foi super atencioso comigo e foi uma das primeiras pessoas a 'acreditar' no meu potencial e me explicar em detalhes como funcionavam as campanhas aqui e também foi quem me deu meus primeiros sats do fóruns, em um sorteio que ele tinha feito, então estou super feliz com seu novo ranking também! Cada novo membro e manutenção dos membros é super importante para a aba. Então é uma super felicidade",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "May 03, 2023, 05:50:20 PM",
      "body": "Quote from: tg88 on May 03, 2023, 03:32:53 PMHoje alcancei o ranking legendary, foram quase 6 anos, mas oque vale é tudo que aprendi e também um pouco do que compartilhei por aqui nesse período. Obrigado a todos que contribuíram para que eu pudesse alcançar esse ranking.Estou feliz por nossa aba estar bem fortalecida atualmente e dando chance para que novos usuários também tenham acesso às oportunidades que esse fórum nos proporciona.Participar do bitcointalk transformou profundamente minha vida.Parabéns pela conquista.Estou aqui também a mais de 5 anos  e posso dizer que esse fórum também transformou minha vida, para melhor.Vamos apoiar a nova geração de newbies que está chegando. Feliz por ver os novatos chegando e os veteranos chegando ao topo.Espero que na próxima bull run tenhamos novas aposentadorias na nossa aba.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "May 03, 2023, 07:09:27 PM",
      "body": "Parabéns pela subida de ranking @tg88 !!!Nunca fiz essa estatística, mas a nossa aba deve ter neste momento quase 90% dos users ativos como Legendary.Somos poucos (em comparação com outras abas) mas muito bons!!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "guid8",
      "created_time": "May 03, 2023, 10:00:48 PM",
      "body": "Quote from: tg88 on May 03, 2023, 03:32:53 PMHoje alcancei o ranking legendary, foram quase 6 anos, mas oque vale é tudo que aprendi e também um pouco do que compartilhei por aqui nesse período. Obrigado a todos que contribuíram para que eu pudesse alcançar esse ranking.Estou feliz por nossa aba estar bem fortalecida atualmente e dando chance para que novos usuários também tenham acesso às oportunidades que esse fórum nos proporciona.Participar do bitcointalk transformou profundamente minha vida.Parabéns, tg88! Ver alguém alcançar o ranking de lendário sempre é motivo de comemoração e inspiração para todos nós aqui no fórum. É uma grande conquista que só é possível com muito trabalho duro e dedicação.Eu também espero um dia chegar a essa posição lendária e contribuir ainda mais para a comunidade. Mas por enquanto, é uma honra poder aprender com pessoas como você e compartilhar conhecimento com todos os usuários.Quote from: Paredao on May 03, 2023, 05:46:11 PMMeus parabéns por mais essa conquista. Você mereceu. Agora você chegou ao topo da carreira aqui no bitcointalk. Terá acesso a áreas Vips em voos internacionais, descontos em cinemas e parques temáticos, fora outros mimos que tal cargo proporciona. Brincadeirinha   . Ser Legendário é algo que nos dá muita honra, sendo este o principal fórum sobre bitcoin do mundo. Meus parabéns novamente.Seu comentário foi tão engraçado que eu quase caí da cadeira. Agora eu entendo por que você é tão popular por aqui.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "May 04, 2023, 12:24:41 AM",
      "body": "Parabéns tg88, mais que merecido!Lembro de tantas coisas sobre mineração que compartilhamos juntos, desde 2017, e passamos muita coisa igual hahaha, boom da mineração em 2017, uma queda feia em 2018, momento totalmente depre, mas depois melhorou novamente, passamos outra bull run e cá estamos no mesmo fórum, como legendários agora    Só nesses primeiros meses já fomos 4, sendo 3 da mesma leva de 2017, e hoje estamos vendo outra leva de usuários começando por aqui, muito legal ver o pessoal novo e nós juntos",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "May 04, 2023, 01:36:05 AM",
      "body": "Quote from: tg88 on May 03, 2023, 03:32:53 PMHoje alcancei o ranking legendary, foram quase 6 anos, mas oque vale é tudo que aprendi e também um pouco do que compartilhei por aqui nesse período. Obrigado a todos que contribuíram para que eu pudesse alcançar esse ranking.Pôxa, eu pensei que tinha tópico duplicado aparecendo por aqui, mas até tu @tg88, meu parabéns meu caro, certamente esse ranking é super merecido!!!!O único problema é que vocÊs estão me abandonando e tô me sentindo cada vez mais solitário na casa do Hero  quem é que ainda é Hero mesmo? kkkkSó mais 100 pontinhos (exatamente) e eu chego no Legendary também... acho que esse ano ainda... esperem por mim ein.Quote from: Paredao on May 03, 2023, 05:46:11 PMMeus parabéns por mais essa conquista. Você mereceu. Agora você chegou ao topo da carreira aqui no bitcointalk. Terá acesso a áreas Vips em voos internacionais, descontos em cinemas e parques temáticos, fora outros mimos que tal cargo proporciona.De fato, poderia ter uma recompensa super bacana desbloqueada, tipo o recurso de postar videos aqui no f[orum ou alguma outra coisa que somente o Legendary poderiam fazem.Enfim... só o fato de estentar esse rank já demonstra incrível respeito ao resto da comunidade e um compromisso de zelar ainda mais pela reputação alcançada.Mais uma vez... parabéns!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "May 04, 2023, 07:48:19 PM",
      "body": "Quote from: guid8 on May 03, 2023, 10:00:48 PMQuote from: Paredao on May 03, 2023, 05:46:11 PMMeus parabéns por mais essa conquista. Você mereceu. Agora você chegou ao topo da carreira aqui no bitcointalk. Terá acesso a áreas Vips em voos internacionais, descontos em cinemas e parques temáticos, fora outros mimos que tal cargo proporciona. Brincadeirinha   . Ser Legendário é algo que nos dá muita honra, sendo este o principal fórum sobre bitcoin do mundo. Meus parabéns novamente.Seu comentário foi tão engraçado que eu quase caí da cadeira. Agora eu entendo por que você é tão popular por aqui.Popular eu ? Sou nada ? Logo vou fazer um teste para saber se sou mesmo popular. Vou abrir uma campanha para arrecadar doações para minha ONG voltada ao tratamento de dependentes em shitcoins. Vamos ver se haverá doações para minha causa. Preciso comprar uma sede numa praia paradisíaca.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gagux123",
      "created_time": "May 18, 2023, 08:23:40 AM",
      "body": "wow, confesso que não tinha visto esse topico   Parabéns por essa conquista tg88, fico muito feliz em saber que mais outro usuário da nossa board portuguesa virou Legendary Aos poucos vamos subindo a \"patente\" da nossa aba localO que me deixa mais euforico é ver a evolução dos usuários da nossa board, somos poucos em comparação as outras abas, mas o mais importante é a assiduidade e evolução que estamos tendo atualmente. Diversos membros daqui se tornaram Legendary nos ultimos meses e eu imagino que a tendência é melhorarmos e crescermos cada dia mais  obs: quem será o proximo usuário a se tornar Legendary? @alegotardo é você!!?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "May 26, 2023, 12:18:19 AM",
      "body": "Quote from: gagux123 on May 18, 2023, 08:23:40 AMobs: quem será o proximo usuário a se tornar Legendary? @alegotardo é você!!?     E por acaso você está vendo mais alguém por aqui no rank dos Hero!? tá me tirando né.... lazarento!Por sorte to quase lá, faltam 70 mérits apenas, o problema é que de uma única vez todo mundo correu tão rápido na minha frente que levantou uma poeria danada, não consigo ver a linha de chegada, uma ajudinha cairia bem Estou precisando tirar tempo para contribuir mais aqui na aba local, todo dia eu leio umas notícias bacanas nos portais que acompanho, geralmente elas não são traziadas para cá e poderiam render uma boa discussão, mas a falta de tempo tem me impossiblitado isso... vou ver se consigo me disciplinar mais e trazer algo bacana, pois todo OP ganha uns meritozinhos que sempre ajuda.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "May 26, 2023, 08:52:39 AM",
      "body": "Quote from: alegotardo on May 26, 2023, 12:18:19 AMPor sorte to quase lá, faltam 70 mérits apenas, o problema é que de uma única vez todo mundo correu tão rápido na minha frente que levantou uma poeria danada, não consigo ver a linha de chegada, uma ajudinha cairia bem Já dei uma ajudinha, mas tem que sair mais esses tópicos que você tem ai guardo no baú.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "May 26, 2023, 09:02:16 AM",
      "body": "Onde está o tópico onde explica a cena dos merits e do trust? Sei que havia um post sobre isto mas não encontro. Acho que também explicava a cena dos DT1 e DT2.E parabéns ao @tg88. É preciso dedicação para chegar a Legendary! Tomara eu estar no level Hero, embora isso sejam apenas títulos, mas sempre dá uma motivação para continuarmos. Se calhar se houvesse mais patamares, era mais motivante!Edited;Segunto este post, devo estar quase a passar a Hero Member.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "May 26, 2023, 10:52:29 AM",
      "body": "Quote from: darkv0rt3x on May 26, 2023, 09:02:16 AMEdited;Segunto este post, devo estar quase a passar a Hero Member.Dei uma ajuda... Para ver se esse Hero sai da caixa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "May 26, 2023, 10:54:18 AM",
      "body": "Quote from: joker_josue on May 26, 2023, 10:52:29 AMQuote from: darkv0rt3x on May 26, 2023, 09:02:16 AMEdited;Segunto este post, devo estar quase a passar a Hero Member.Dei uma ajuda... Para ver se esse Hero sai da caixa.  Já está... Obrigado @joker_josue!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "May 27, 2023, 12:49:15 AM",
      "body": "Quote from: darkv0rt3x on May 26, 2023, 10:54:18 AMQuote from: joker_josue on May 26, 2023, 10:52:29 AMQuote from: darkv0rt3x on May 26, 2023, 09:02:16 AMEdited;Segunto este post, devo estar quase a passar a Hero Member.Dei uma ajuda... Para ver se esse Hero sai da caixa.  Já está... Obrigado @joker_josue!Aeh... bem vindo à turma, eu já estava me sentindo meio solitário por aqui.Infelizmente, espero te deixar logo, só não espero que tu me passe à frente também Parabéns por alcançar o cargo de Hero, @darkv0rt3xEu fui fuçar seus posts, pois achei que assim como o @joker_josue você havia acordado de uma longa hibernação, mas percebi que você apenas era preconceituoso mesmo e preferia manter distância de nós",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "May 27, 2023, 07:21:19 AM",
      "body": "Quote from: alegotardo on May 27, 2023, 12:49:15 AMEu fui fuçar seus posts, pois achei que assim como o @joker_josue você havia acordado de uma longa hibernação, mas percebi que você apenas era preconceituoso mesmo e preferia manter distância de nós Acredito que ajam mais na mesma situação.As vezes falamos muito de trazer mais pessoal novo para a aba português, mas existe muitos que já andam pelo o fórum mas não veem a nossa aba.Como atrair esses?@darkv0rt3x o que vez olhares mais para a nossa aba (de novo)?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "capoeira",
      "created_time": "May 27, 2023, 04:50:27 PM",
      "body": "parabéns. vc merece.eu peguei só pq entrei cedo aqui. nem merecia kkkkk",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "May 27, 2023, 07:13:06 PM",
      "body": "Quote from: capoeira on May 27, 2023, 04:50:27 PMparabéns. vc merece.eu peguei só pq entrei cedo aqui. nem merecia kkkkkEu nunca tinha te visto por aqui capoeiraSe não se importar, qual é sua história aqui?Cadastrou, usou por um tempo e depois abandonou?Entrou aqui por causa de Bitcoin e faucets da época?Fiquei curioso, você é legendary e só te vi aqui há poucas semanas",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "May 27, 2023, 08:38:59 PM",
      "body": "Quote from: alegotardo on May 27, 2023, 12:49:15 AMQuote from: darkv0rt3x on May 26, 2023, 10:54:18 AMQuote from: joker_josue on May 26, 2023, 10:52:29 AMQuote from: darkv0rt3x on May 26, 2023, 09:02:16 AMEdited;Segunto este post, devo estar quase a passar a Hero Member.Dei uma ajuda... Para ver se esse Hero sai da caixa.  Já está... Obrigado @joker_josue!Aeh... bem vindo à turma, eu já estava me sentindo meio solitário por aqui.Infelizmente, espero te deixar logo, só não espero que tu me passe à frente também Parabéns por alcançar o cargo de Hero, @darkv0rt3xEu fui fuçar seus posts, pois achei que assim como o @joker_josue você havia acordado de uma longa hibernação, mas percebi que você apenas era preconceituoso mesmo e preferia manter distância de nós Passar à frente? heheh... Só se houver muitas campanhas de assinaturas assim umas seguidas as outras!Obrigado pela saudação!Achas que sou preconceituoso? Não sei se percebi! Preconcentuoso relativamente a quê?Não sei se te referes a eu não gostar muito do \"brasileiro\", porque isso até é verdade e sinceramente nem tenho razão para não gostar. Aliás, o que não gosto nem é do \"brasileiro\" mas sim da língua brasileira!  Mas isto é uma paranóia minha que nem eu sei explicar porquê. Também não gosto da língua francesa. A maneira como ela me soa, simplesmente não gosto! Pronto, é isso! lolNão percebi a parte da hibernação. Se te referes ao facto de eu estar neste forum desde 2014 mas só ter posts em 2018, se não me falha a memória, a razão é que eu acho que vim parar aqui a este forum em 2014, não por causa de Bitcoin (nessa altura acho que nunca tinha ouvido falar), mas porque andava a tentar fazer bruteforce a paasswords de ficheiros rar e não só, com um software que se chama hashcat, e acho que vim aqui parar por causa este software. Mas não tenho a certeza. A certeza que tenho é que não foi por causa de Bitcoin!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}