{
  "id": "topic_5402266",
  "title": "supermankid",
  "author": "supermankid",
  "created_time": "June 12, 2022, 10:18:28 AM",
  "content": "It might be a silly question but for example if a Bitcoin wallet in Bitcoin core is lost, is it  ???possible to make/recover the original wallet file?My sense is that it is not possible because the password/signature is for verification , not for source creation.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402266",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "June 12, 2022, 10:26:52 AMLast edit: June 12, 2022, 11:13:56 AM by Charles-Tim",
      "body": "This thread that was just created today should be helpful, Wallet. Backup your wallet.dat. If it is wallet like Electrum, backup you seedphrase.Quote from: supermankid on June 12, 2022, 10:18:28 AMMy sense is that it is not possible because the password/signature is for verification , not for source creation. The signature is derived from the private key, not password. The private key is used for making transaction. The private key can also be used for recovery if imported.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 12, 2022, 10:40:50 AM",
      "body": "when you create a password protected zip file for an image on your desktop. that password does not represent the image itself. its password just protects the file. there is no correlation to the password/contentyou cant recreate an image by having just the password.. but losing the zip file..same is true with bitcoin wallets.inside the wallet file is the private key.. its the private key that is used to make the bitcoin address and sign for value of the bitcoin address..but if the wallet file has password protection. the password has no association with the data inside the file. the password of the file protection is not linked to the private key within the file...the best option is to back up the private key within the file, by having it stored in different places/methods, formats and/or copy the wallet file containing the privatekey in multiple places, where by if you have a highly secure place that no one can get to, have a wallet file without password protection (should you forget the password for the files)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "June 12, 2022, 10:47:37 AM",
      "body": "If you don't have the backup file or seed phrases of the lost wallet, then forget about the wallet. This scenario not like that of an email address, which you can recover if you have the password. The purpose of the password is to encrypt the wallet file so that not anybody can access your file, but it plays no part in the derivation of your address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "June 12, 2022, 11:36:41 AM",
      "body": "Quote from: supermankid on June 12, 2022, 10:18:28 AMIt might be a silly question but for example if a Bitcoin wallet in Bitcoin core is lost, is it  ???possible to make/recover the original wallet file?My sense is that it is not possible because the password/signature is for verification , not for source creation. The private key you have encrypts the wallet file you created, so if a SCAMMER finds your file, they need the password to decrypt it.In short, you will need the file (wallet.dat) and password to get the private key to spend those coins.But if you use SPV wallets[1], you will most likely get seeds, those seeds (alone) represent the private key that enables you to spend bitcoins.Overall, BitcoinCore is not a wallet for beginners who don't have any background in Bitcoin or computer, it's a full node wallet, and it needs to sync the entire blockchain (more than 300GB) so if privacy isn't your first goal, use opensource SPV wallets.[1] Simplified Payment Verification (SPV) - BitcoinWiki",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "June 12, 2022, 12:15:40 PM",
      "body": "Quote from: supermankid on June 12, 2022, 10:18:28 AM~My sense is that it is not possible ...You are right. Wallets cannot be recreated out of addresses and wallet passwords. For this purpose, a seed phrase is required from which all private / public key pairs are derived.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "June 12, 2022, 10:59:39 PM",
      "body": "Quote from: supermankid on June 12, 2022, 10:18:28 AMIt might be a silly question but for example if a Bitcoin wallet in Bitcoin core is lost, is it  ???possible to make/recover the original wallet file?Then if it's lost without a backup like a master/private key or the wallet.dat on Bitcoin core there is no way to recover them with just an address and password the only purpose of adding password is to protect your wallet, not for recovery. So make sure that you have a backup like wallet.dat or private keys on another device so that you can recover your wallet with those backups in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "June 13, 2022, 02:42:31 AM",
      "body": "Quote from: hugeblack on June 12, 2022, 11:36:41 AMThe private key you have encrypts the wallet file you created, so if a SCAMMER finds your file, they need the password to decrypt it.This is probably a typo right? Because it looks like you meant \"the password you have...\" instead of \"private key\".Otherwise it's incorrect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}