{
  "id": "topic_5463586",
  "title": "Abu-Naim",
  "author": "Abu-Naim",
  "created_time": "August 17, 2023, 12:55:13 PM",
  "content": "Hello my people, I hope una they fine,I get on question wey I been they try ask here.As here na we Nigerians they this board e get place for here wey I fit buy BTC directly from my fellow Nigerians wey they here?I ask this question because I wan buy BTC for investment with my small 50,000 Naira, so I said make I come here ask if una get place wey I go take buy the BTC direct without having any problem.I they try avoid KYC from exchanges like Binance na why I ask for hear, if there is any link to the thread wey we go fit the exchange our Naira to BTC withing us here in this board abeg make una share with me because to buy from people wey you no trust fit bring problem such as scam by running with my money.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463586",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "August 17, 2023, 01:10:59 PM",
      "body": "You are on the right board.CryptopreneurBrainboss was offering this service before, I do not know if he is going to be interested or not. His exchange service thread has been locked. I am just seeing this right now.Igehhbotz too make some offers in the past, but I do not know if he is going to be interested.I hope there will be some people that will accept this offer.I would have helped but I do not prepare for this. I am surprised that Brainbiss has locked his exchange thread.Be careful of scammers. If you are using anyone that is not reputed enough, use someone in between as an escrow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "August 17, 2023, 08:19:55 PM",
      "body": "Contact Brainboss through PM and hear what he will say because I believe that he was running this service then not until now that @Charles-Tim is saying that his exchange has been blocked. So you have  to confirm from him directly to hear from him. It is better to deal with trusted people than those you don't know. Some members here might also be interested to sell but if only you know who they are,you would have contacted them too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Igebotz",
      "created_time": "August 17, 2023, 08:29:22 PM",
      "body": "Quote from: Charles-Tim on August 17, 2023, 01:10:59 PMYou are on the right board.Igehhbotz too make some offers in the past, but I do not know if he is going to be interested.I hope there will be some people that will accept this offer.I would have helped but I do not prepare for this. I am surprised that Brainbiss has locked his exchange thread.Be careful of scammers. If you are using anyone that is not reputed enough, use someone in between as an escrow.Yes I'm open to trade. I'm surprised why the OP wouldn't use a CEX P2P, which is one of the most efficient ways to buy and sell cryptocurrency in Nigeria. I understand that most individuals dislike the idea of KYC, but I see nothing wrong with submitting a tie 1 KYC, which is to verify email and phone number only and trading less than $100 each day. Op if you must buy from anyone from this board I'm ready to serve as zero-fees escrow for the deal.But if you want to get it from me send a PM and I will give you my rates.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "August 17, 2023, 10:09:50 PM",
      "body": "Quote from: Igebotz on August 17, 2023, 08:29:22 PM-but I see nothing wrong with submitting a tie 1 KYC, which is to verify email and phone number only and trading less than $100 each day. Op if you must buy from anyone from this board I'm ready to serve as zero-fees escrow for the deal.But if you want to get it from me send a PM and I will give you my rates.  Tie 1 KYC is limited to many features plus the amount to be withdrewn. So it will not make sense for a large amount of bitcoin purchase from exchanges that use KYC. And since the op is asking the local board to purchase bitcoin, it is better he uses p2p for that and if anyone here junsi go collect wotowo with red feedback enough ones for dat matter. Op since Igebotz has accepted the order then you don't have anything to worry about it again. Just dm and start the process. Good luck with good deal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abu-Naim",
      "created_time": "August 18, 2023, 07:13:03 AM",
      "body": "Quote from: Igebotz on August 17, 2023, 08:29:22 PMYes I'm open to trade. I'm surprised why the OP wouldn't use a CEX P2P, which is one of the most efficient ways to buy and sell cryptocurrency in Nigeria. I understand that most individuals dislike the idea of KYC, but I see nothing wrong with submitting a tie 1 KYC, which is to verify email and phone number only and trading less than $100 each day. Thank you for your response, sir Igebotz.I don't know the exchanges that I will use just email and phone number for stage one verification that allow me to buy that is why I am here; I thought I must submit BVN, NIN, Driver's License or so before I can be allowed to trade small amount of less than $100.Plese you can provide me with exchange link/name so that I can buy it there for some experience too.QuoteOp if you must buy from anyone from this board I'm ready to serve as zero-fees escrow for the deal.But if you want to get it from me send a PM and I will give you my rates. I was thinking there will be an existing Bitcoin to Naira exchange thread here that was why I ask, but the information you provide will be enough so that I cannot be bothering you with PM any time I will buy small amounts of BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelward",
      "created_time": "August 18, 2023, 08:03:14 AM",
      "body": "Quote from: Igebotz on August 17, 2023, 08:29:22 PMQuote from: Charles-Tim on August 17, 2023, 01:10:59 PMYou are on the right board.Igehhbotz too make some offers in the past, but I do not know if he is going to be interested.I hope there will be some people that will accept this offer.I would have helped but I do not prepare for this. I am surprised that Brainbiss has locked his exchange thread.Be careful of scammers. If you are using anyone that is not reputed enough, use someone in between as an escrow.Yes I'm open to trade. I'm surprised why the OP wouldn't use a CEX P2P, which is one of the most efficient ways to buy and sell cryptocurrency in Nigeria. I understand that most individuals dislike the idea of KYC, but I see nothing wrong with submitting a tie 1 KYC, which is to verify email and phone number only and trading less than $100 each day. Op if you must buy from anyone from this board I'm ready to serve as zero-fees escrow for the deal.But if you want to get it from me send a PM and I will give you my rates. Thanks my Oga Igebotz, as you stand gidigba for ground to run P2P and to serve as escrow for deals here for dis our board. E de good as reputable member like you de run dis parole, so members wey wan exchange bitcoin and naira transactions for our local board go get confidence say na genuine source dem de deal with. I commend di OP as e trow di question open, because money matter na serious matter, so person need to shine eyes, ask questions and verify wella before committing money for any deals, because of story, scammers de everywhere de look for victims.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "August 18, 2023, 08:24:21 AM",
      "body": "Quote from: Abu-Naim on August 18, 2023, 07:13:03 AMI don't know the exchanges that I will use just email and phone number for stage one verification that allow me to buy that is why I am here; I thought I must submit BVN, NIN, Driver's License or so before I can be allowed to trade small amount of less than $100.Probably Igebotz is taking CeXP2P for deposit and withdrawal limit on centralized exchanges but which is not. If you want to trade on CexP2P, you will need to provide identity document like drivers license, national ID/NIN or international passport, or at least you will provide your BVN.Quote from: Abu-Naim on August 18, 2023, 07:13:03 AMPlese you can provide me with exchange link/name so that I can buy it there for some experience too.The option that you can go for is P2P (DexP2P). I would have advised you to go for Agarodesk, but I see people creating ads to sell bitcoin, no one that is buying. Also on hodlhodl, I just saw only just one person that creates ad to selling bitcoin, no ad for buying bitcoin. Or maybe you can create your own ad on those sites, but I have not tried that before.The easiest way is to buy from someone on this forum from Nigerians. Igebotz will give you a good offer that will also favour him to earn, not that you are disturbing him. It is an offer that he accepted, or look for other people with a better rate if you think his rate is expensive for you is what he is talking about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abu-Naim",
      "created_time": "August 18, 2023, 06:16:14 PM",
      "body": "Quote from: Charles-Tim on August 18, 2023, 08:24:21 AMThe easiest way is to buy from someone on this forum from Nigerians. Igebotz will give you a good offer that will also favour him to earn, not that you are disturbing him. It is an offer that he accepted, or look for other people with a better rate if you think his rate is expensive for you is what he is talking about.Thank you, I will send him message when I set my receiving wallet, currently I wanted to download electrum wallet in my laptop to create my wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Igebotz",
      "created_time": "August 18, 2023, 07:00:08 PMLast edit: August 18, 2023, 07:22:27 PM by Igebotz",
      "body": "Quote from: Abu-Naim on August 18, 2023, 07:13:03 AMQuote from: Igebotz on August 17, 2023, 08:29:22 PMYes I'm open to trade. I'm surprised why the OP wouldn't use a CEX P2P, which is one of the most efficient ways to buy and sell cryptocurrency in Nigeria. I understand that most individuals dislike the idea of KYC, but I see nothing wrong with submitting a tie 1 KYC, which is to verify email and phone number only and trading less than $100 each day. Thank you for your response, sir Igebotz.I don't know the exchanges that I will use just email and phone number for stage one verification that allow me to buy that is why I am here; I thought I must submit BVN, NIN, Driver's License or so before I can be allowed to trade small amount of less than $100.Plese you can provide me with exchange link/name so that I can buy it there for some experience too.You can sign up on Remitano with this link https://remitano.comYou can trade up to $75/day with phone number and email verification. Quote from: Charles-Tim on August 18, 2023, 08:24:21 AMThe option that you can go for is P2P (DexP2P). I would have advised you to go for Agarodesk, but I see people creating ads to sell bitcoin, no one that is buying. Also on hodlhodl, I just saw only just one person that creates ad to selling bitcoin, no ad for buying bitcoin. Or maybe you can create your own ad on those sites, but I have not tried that before.Remitano gives such freedom for tie 1 verification without personal docs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "August 18, 2023, 10:34:44 PM",
      "body": "Op f you know anyone in your locality who is also a bitcoiner and if he has bitcoin ask him to sell some for you. And that is the p2p aspect of bitcoin but since someone has volunteered to sell for you then you have to dm im and have the deal. He is a reliable fellow in the forum. And please if you are dealing with newbies in the forum or the local board, please take precautions because many of those guys are just coming na to make money so anyhow if you fall for their hands you will your own and nobody in this local board can help that. It was Brainboss that was doing that service and probably because of the low patronage he stop at the moment but I believe he will still resume work very soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abu-Naim",
      "created_time": "August 19, 2023, 01:50:59 PM",
      "body": "Quote from: Igebotz on August 18, 2023, 07:00:08 PMYou can sign up on Remitano with this link https://remitano.comYou can trade up to $75/day with phone number and email verification. Thank you, I will give it a try there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}