{
  "id": "topic_5468912",
  "title": "Bitstar_coin",
  "author": "Bitstar_coin",
  "created_time": "October 02, 2023, 03:31:49 PM",
  "content": "As the Heading implies. Honda the giant of Japanese automobile now accept bitcoin and ethereum for payment through a third party partnership deal with a blockchain payment system called FCF Pay. Honda not only taken the bold step of accepting crypto as payment option, also managed to expand their already huge user base with this important development. Source With such an opportunity to spend btc to buy luxury cars- *Will you be willing to spend your btc to buy car from Honda? Or any other automobile company that will follow the Honda's part?*Which other automobile company would you want to also accept btc for payment?*Is this news big enough to trigger market uptrend in the coming weeks, months?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468912",
  "comments": [
    {
      "author": "bitmover",
      "created_time": "October 02, 2023, 03:55:38 PM",
      "body": "Nice find!Quote from: Bitstar_coin on October 02, 2023, 03:31:49 PM*Which other automobile company would you want to also accept btc for payment?Tesla! LolQuote*Is this news big enough to trigger market uptrend in the coming weeks, months?Well, the news comes in a good moment.  Bitcoin is already going up for a few days. This news won't trigger alone a bull run, but it may push this small run a little forward",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "October 02, 2023, 04:04:04 PM",
      "body": "Quote from: Bitstar_coin on October 02, 2023, 03:31:49 PMWith such an opportunity to spend btc to buy luxury cars- *Will you be willing to spend your btc to buy car from Honda? Or any other automobile company that will follow the Honda's part?No, Bitcoin is my investment and I definitely don’t want to exchange it to a liability such as car that depreciates value over time. Exchanging fiat to Bitcoin will charge tons fee considering the amount involved is equals car value.I’d rather use fiat or car loan to pay it slowly instead of liquidating my Bitcoin investments just to purchase car. This payment method is interesting if they can provide discounts exclusive for Bitcoin payment. With this benefits, I might spend my Bitcoin but in terms basis not one-time payment because I value my Bitcoin investments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "October 02, 2023, 04:10:57 PM",
      "body": "In which country it is happening? I am sure Honda cannot extend such crypto support in all countries they operate. Government regulation plays a big role here. So while it's a good news that Honda has started accepting cryptocurrency payment it's Limited to some certain countries.But honestly it doesn't make sense to spend cryptocurrence is like Bitcoin to purchase a liability asset like a car.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 02, 2023, 04:15:59 PM",
      "body": "I read Honda's success story and how it started from a problem between the founder and his wife and how the company developed thanks to the research and development department. The only constant in this company is its awareness of the value of future things before they happen and their acceptance of Bitcoin is a good indicator that the currency will have a good future in the short and long term. I did not read the reason for acceptance. Whether they will keep Bitcoin directly or whether they will convert it into dollars in their bank accounts.Does it include all Honda dealers and all industries as Honda bikes?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "October 02, 2023, 04:24:37 PM",
      "body": "Quote from: Eternad on October 02, 2023, 04:04:04 PMQuote from: Bitstar_coin on October 02, 2023, 03:31:49 PMWith such an opportunity to spend btc to buy luxury cars- *Will you be willing to spend your btc to buy car from Honda? Or any other automobile company that will follow the Honda's part?No, Bitcoin is my investment and I definitely don’t want to exchange it to a liability such as car that depreciates value over time. Exchanging fiat to Bitcoin will charge tons fee considering the amount involved is equals car value.I’d rather use fiat or car loan to pay it slowly instead of liquidating my Bitcoin investments just to purchase car. This payment method is interesting if they can provide discounts exclusive for Bitcoin payment. With this benefits, I might spend my Bitcoin but in terms basis not one-time payment because I value my Bitcoin investments.Is not as if they're jettisoning the idea of paying with your fiat, is it just that they are giving you an extra option of saying you can as well use your ethereum or your bitcoin to buy their cars,  I believe  they are just doing all of this to ease their payment structure inline with the modern reality.I still believe they have the option of installmental payment because virtually every dealer has that option, but for them to bring in cryptocurrency payments options, it's a plus and something we should applaud.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "October 02, 2023, 04:34:20 PM",
      "body": "Could this news be behind the little spike between yesterday and today? It's hard to say but after a long time of monotony I saw that spike and thought it might be related to some news, now I see this. Quote from: avikz on October 02, 2023, 04:10:57 PMIn which country it is happening? I am sure Honda cannot extend such crypto support in all countries they operate.This is something I would like to know too.Quote from: Eternad on October 02, 2023, 04:04:04 PMNo, Bitcoin is my investment and I definitely don’t want to exchange it to a liability such as car that depreciates value over time. Exchanging fiat to Bitcoin will charge tons fee considering the amount involved is equals car value.I’d rather use fiat or car loan to pay it slowly instead of liquidating my Bitcoin investments just to purchase car. This payment method is interesting if they can provide discounts exclusive for Bitcoin payment. With this benefits, I might spend my Bitcoin but in terms basis not one-time payment because I value my Bitcoin investments.I think exactly the same, and I would add another thing: the payment is going to be KYC, so if you have bitcoin without KYC and you want to keep your privacy, there is no way you are going to pay with bitcoin for a liability. But this is good because it gives bitcoin publicity, it normalises it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romero121",
      "created_time": "October 02, 2023, 04:40:23 PM",
      "body": "One of the biggest automobile maker into bitcoin acceptance is good news, but I expect this need to last for longer. In recent days we were able to see more services accepting bitcoin into their businesses. Very few continue the acceptance whereas the majority end bitcoin acceptance as they don't get the calculated profit as well as the increased userbase. Very few prefer buying car with bitcoin, because of the volatility. It is the same world where an African citizen arrested for buying Ferrari with bitcoin. Man Buys Ferrari With Bitcoin, Gets 18-month Prison Sentence. Honda need to provide every form of support, if not the cryptocurrency acceptance will ruin the reputation of the company.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qwertyup23",
      "created_time": "October 02, 2023, 04:44:13 PM",
      "body": "Quote from: avikz on October 02, 2023, 04:10:57 PMIn which country it is happening? I am sure Honda cannot extend such crypto support in all countries they operate. Government regulation plays a big role here. So while it's a good news that Honda has started accepting cryptocurrency payment it's Limited to some certain countries.But honestly it doesn't make sense to spend cryptocurrence is like Bitcoin to purchase a liability asset like a car. I am also curious as to which country does this Honda shop accept BTC as payment. Though I do understand that they are independent car manufacturers, it still depends on the country's laws and regulations if they allow BTC as a system of payment method for their products and cars.While this may be true, I do think that this puts BTC in a good light if they have the support of the Japanese car manufacturer. If they view BTC as something that should be used as a payment method, then this may inspire other car manufacturers as well to accept or at least consider BTC and ETH as respective payment methods for their products.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "October 02, 2023, 04:47:47 PM",
      "body": "Quote from: avikz on October 02, 2023, 04:10:57 PMIn which country it is happening? I am sure Honda cannot extend such crypto support in all countries they operate. Government regulation plays a big role here. So while it's a good news that Honda has started accepting cryptocurrency payment it's Limited to some certain countries.But honestly it doesn't make sense to spend cryptocurrence is like Bitcoin to purchase a liability asset like a car. In Japan I guess according to the article, since this is very new I believe it will only be within that location until maybe other countries government decided to expand their options and embrace crypto transactions legally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "October 02, 2023, 05:04:10 PM",
      "body": "Quote from: Bitstar_coin on October 02, 2023, 03:31:49 PMAs the Heading implies. Honda the giant of Japanese automobile now accept bitcoin and ethereum for payment through a third party partnership deal with a blockchain payment system called FCF Pay. Honda not only taken the bold step of accepting crypto as payment option, also managed to expand their already huge user base with this important development. Source With such an opportunity to spend btc to buy luxury cars- *Will you be willing to spend your btc to buy car from Honda? Or any other automobile company that will follow the Honda's part?*Which other automobile company would you want to also accept btc for payment?*Is this news big enough to trigger market uptrend in the coming weeks, months?Indeed this is a good news to every bitcoiner and car lovers to make purchase of their specific car brand under Honda, we should know that this brand name has a global high ranking and recognition among the top best people mostly preferred when it comes to car brands, bitcoiners can have easy access to also make purchase of their varieties under this product brand each time they wanted to make purchase of a car, am excited to see that the most top brands names and organizations are taking necessary steps towards the acceptance of bitcoin in making payments, bitcoin indeed is revolutionizing the entire economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "October 02, 2023, 05:15:16 PM",
      "body": "\"Such a surprise!\" I thought when I saw the topic title. But when I began to study this issue a little deeper, my admiration began to rapidly diminish.What do we have as a result? Honda began accepting cryptocurrencies through an intermediary, FCF Pay, which takes a commission of Flat fee of 3usd + 2%.Who are FCF Pay (French Connection Finance)? FCF - is a dividend-generating cryptocurrency that operates on the BNB network (now it’s clear why this news was published on Binance Feed). As it turned out, Honda is not their only partner and this platform provides intermediary services to more than 20,000 counterparties.The question arises: why is Honda (as well as many other partners of FCF Pay) unable to accept cryptocurrencies directly as payment for its products (auto\\motorcycles, leasing, rent), but needs the services of intermediaries, like FCF Pay? Cryptocurrencies are designed in such a way that there is no need for intermediate platforms between the owner (crypto owner) and the seller (of goods and services) and they can interact directly, that is, p2p. Where p1 is crypto owner, and p2 is seller. Even with these problems, it became possible to buy cars and motorcycles from a famous brand like Honda for cryptocurrencies, which is already a very good event.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "October 02, 2023, 05:23:36 PM",
      "body": "Quote from: Bitstar_coin on October 02, 2023, 03:31:49 PMWith such an opportunity to spend btc to buy luxury cars- *Will you be willing to spend your btc to buy car from Honda? I would love to do that as it will surely make some news in the place and might even get into the headlines, possibly.Quote from: Bitstar_coin on October 02, 2023, 03:31:49 PMOr any other automobile company that will follow the Honda's part?I remember that it should be Tesla to be the first one to do this bold step but they just didn't and took their part only on it for being an investor.Quote from: Bitstar_coin on October 02, 2023, 03:31:49 PM*Which other automobile company would you want to also accept btc for payment?Toyota.Quote from: Bitstar_coin on October 02, 2023, 03:31:49 PM*Is this news big enough to trigger market uptrend in the coming weeks, months?Maybe, Honda is such a big company and they've got a lot of branches worldwide. But I don't think that there will be such demand that will come from their car sales through crypto payments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "October 02, 2023, 05:37:14 PM",
      "body": "Saw this on X (twitter) and was like wow, what is Elon Musk waiting for? There are  people like me waiting for Tesla cars to start selling in bitcoin before we can give an interest in purchasing it. Lol. I wouldn't stack and hodl BTC over the past years just to use it all in purchasing a car, I'll rather buy a house of mine with btc at this phase, maybe in time to come i may see cogent reasons to expend my crypto on car's.I welcome the initiative of Honda company but IMO, cryptocurrency like bitcoin and ethereum are value growing assets and should be expended on things and products that adds value over time. At least not for now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AprilioMP",
      "created_time": "October 02, 2023, 05:55:54 PM",
      "body": "Quote from: Bitstar_coin on October 02, 2023, 03:31:49 PMWith such an opportunity to spend btc to buy luxury cars- *Will you be willing to spend your btc to buy car from Honda? Or any other automobile company that will follow the Honda's part?*Which other automobile company would you want to also accept btc for payment?*Is this news big enough to trigger market uptrend in the coming weeks, months?Tesla already has competition and the Tesla boss will make something more if the decision to accept approximately 46 types of crypto including Bitcoin is successful.Later it will be a positive thing that can trigger the market trend to rise. It would be better if it happened at the same time as the SEC's ETF approval decision.In the near future, it is not certain that a large-scale increase will occur — it is still gray, but the acceptance of bitcoin and 45 other cryptocurrencies in purchasing their products could be an opportunity for increased market prices.If someone doesn't want to use bitcoin to purchase Honda products because bitcoin is an investment asset, there are still other cryptocurrencies that are allowed. With the many types of cryptocurrencies that are accepted, Honda, in my opinion, is aware that if they only accept bitcoin in payment, there will be problems and the problem may be that consumers find it difficult to spend bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "October 02, 2023, 06:04:26 PM",
      "body": "The only subtle nuance that has not been disclosed is that Honda accepts cryptocurrency on its crypto wallet, or through a crypto payment system, accepts payment in cryptocurrency and converts it into fiat, accepted tokens? And there is a big difference! Although even if it goes through the transformation from cryptocurrencies to fiat, it is still a commendable initiative!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "October 02, 2023, 06:05:31 PM",
      "body": "Quote from: Bitstar_coin on October 02, 2023, 03:31:49 PMHonda the giant of Japanese automobile now accept bitcoin and ethereum for payment through a third party partnership deal with a blockchain payment system called FCF Pay. I believe this also means they'd still receive fiat [subject field is somewhat misleading, but I'm blaming Binance for this]!Quote from: Bitstar_coin on October 02, 2023, 03:31:49 PM*Will you be willing to spend your btc to buy car from Honda?If it didn't require going through an intermediary, my answer would've been yes, but as things stand, it's going to be a big fat NO.- I don't want to be affected by another third-party data breach!Quote from: Bitstar_coin on October 02, 2023, 03:31:49 PM*Is this news big enough to trigger market uptrend in the coming weeks, months?No.Quote from: m2017 on October 02, 2023, 05:15:16 PMwhich takes a commission of Flat fee of 3usd + 2%.Another reason not to use their services for such products.Quote from: m2017 on October 02, 2023, 05:15:16 PMwhy is Honda (as well as many other partners of FCF Pay) unable to accept cryptocurrencies directly as payment for its products (auto\\motorcycles, leasing, rent), but needs the services of intermediaries, like FCF Pay?They don't want to deal with its volatile nature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayu7adi",
      "created_time": "October 02, 2023, 06:22:06 PM",
      "body": "Quote from: Lida93 on October 02, 2023, 05:37:14 PMSaw this on X (twitter) and was like wow, what is Elon Musk waiting for? There are  people like me waiting for Tesla cars to start selling in bitcoin before we can give an interest in purchasing it. Lol. I wouldn't stack and hodl BTC over the past years just to use it all in purchasing a car, I'll rather buy a house of mine with btc at this phase, maybe in time to come i may see cogent reasons to expend my crypto on car's.I welcome the initiative of Honda company but IMO, cryptocurrency like bitcoin and ethereum are value growing assets and should be expended on things and products that adds value over time. At least not for now.I understand it's an investment mindset, but besides you, there are others who have goals like buying a vehicle, a laptop, shoes, or anything else they desire with the profits from their Bitcoin investments. Purchasing a car with Bitcoin isn't an issue, let's say your dream Honda currently costs 0.5 BTC, and you only have 0.3 BTC, meaning you need to accumulate another 0.2.However, due to a significant BTC price pump triggered by a major event, the Honda's price drops to 0.28 BTC. I see this as an opportunity to attain your dream item with the hard-earned gains you've gathered. There's still a balance that can cover other expenses.I prefer to view this as a chance from a different perspective. And for sure, with broader adoption by major corporations, Bitcoin's position as an alternative currency will be strengthened.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "October 02, 2023, 06:36:22 PM",
      "body": "Quote from: Bitstar_coin on October 02, 2023, 03:31:49 PM *Will you be willing to spend your btc to buy car from Honda? Or any other automobile company that will follow the Honda's part?I will not, because each person has their own flavor of investment, and in my opinion investing money on Honda in the form of BTC (that I have accumulated as an investment) is a total waste of BTC and Honda will be a liability. And I don't want that. Because, if we talk in the sense of investment then Honda is going to make huge expenses but BTC will lie there. And the Honda will eat enough of my money while the BTC will not. And if I just have to buy a Honda car (despite the context of Investment) then It does not matter whether we buy with BTC or with Fiat. Let's say Honda is worth $28k and 1 BTC is also worth $28k or you have $28k in fiat. What would you do, if you bought with 1 BTC then the BTC was gone and the car came? But if you will buy with Fiat then your fiat is gone and Honda comes. In both scenarios. 1 BTC and $28k fiat (worth 1 BTC) are both gone. Which means, it does not matter anymore. And I will not prefer the company of the car I am buying from, I value my BTC so I am going to buy BTC more, But if I have to buy a car I will try to find a good one that will not become a liability.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "October 02, 2023, 07:14:29 PM",
      "body": "Quote from: Bitstar_coin on October 02, 2023, 03:31:49 PMWith such an opportunity to spend btc to buy luxury cars- *Will you be willing to spend your btc to buy car from Honda? Or any other automobile company that will follow the Honda's part?*Which other automobile company would you want to also accept btc for payment?*Is this news big enough to trigger market uptrend in the coming weeks, months?This news is not big enough to trigger the market, but it will have a good impact on the market if combined with others. Honda is not a small company it has a big inflow of money and they have huge sales, but who knows how many BTC users are their customers. But the thing is, those who are well educated and know the potential of BTC are saving it. They might not consider the Honda over BTC. But if the Honda is good enough and a person loves it then there is no cost of passion and a person will not hesitate to sell his BTC to buy Honda. But to be honest, that deal will be the one of loss. I will buy Ferrari or Honda Civic but I don't have enough money either in BTC or in Fiat. Overall, they made the right choice of accepting in BTC because many people who have funds in BTC and want to buy Honda they will have 1 benefit of the moment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}