{
  "id": "topic_5409345",
  "title": "hridoyb",
  "author": "hridoyb",
  "created_time": "August 10, 2022, 10:40:24 AM",
  "content": "Crypto exchange giant Coinbase has cited a “fast and furious” downturn of the crypto markets as the reasons behind a staggering $1.1 billion net loss in the second quarter of 2022, which also saw trading volume and transaction revenue tumbling. This is the  largest loss since its listing on the Nasdaq Stock Exchange (Nasdaq) in April 2021. Coinbase said that Q2 was a “tough quarter” with trading volume falling 30% and transaction revenue down 35% sequentially.In order to cut expenses and improve profit margins, Coinbase cut 18% of employees in June, and has also taken a “pause, maintain and prioritize” approach toward product development:",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409345",
  "comments": [
    {
      "author": "AbuBhakar",
      "created_time": "August 10, 2022, 10:50:53 AM",
      "body": "This issue is already been discussed before the moment coinbase made the announcement about there huge loss due to crypto market meltdown. It’s obvious crypto exchange will be the most business affected by this because they have liquidity provided for there orderbook. There stock will surely been target by shorter because they are company involved on cryptocurrency which is now experiencing a strong bearish market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "August 10, 2022, 11:08:03 AM",
      "body": "Quote from: hridoyb on August 10, 2022, 10:40:24 AMCrypto exchange giant Coinbase has cited a “fast and furious” downturn of the crypto markets as the reasons behind a staggering $1.1 billion net loss in the second quarter of 2022, which also saw trading volume and transaction revenue tumbling. This is the  largest loss since its listing on the Nasdaq Stock Exchange (Nasdaq) in April 2021. Coinbase said that Q2 was a “tough quarter” with trading volume falling 30% and transaction revenue down 35% sequentially.In order to cut expenses and improve profit margins, Coinbase cut 18% of employees in June, and has also taken a “pause, maintain and prioritize” approach toward product development:They were not the only one that did incur huge loses ,both other exchange ,Institutional Investors , individual investors and traders equally got their own share in loses, so there should be no cause for alarm almost everyone shared the pain, Michael did lost some billion dollars too. They should understand that business involves profit and lose. So you do not always gain all time, at some point you gonna incur some loses as well let alone a business that involves cryptocurrency that is still in its early stage and highly volatile market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "August 10, 2022, 11:10:52 AM",
      "body": "Quote from: hridoyb on August 10, 2022, 10:40:24 AMWhich site did you got this information from? Try and include the link.This points towards not you key not your coin, especially in the time of crypto bear market, it is better to have your coin on a noncustodial wallet which you have control over. Quote from: AbuBhakar on August 10, 2022, 10:50:53 AMThis issue is already been discussed before the moment coinbase made the announcement about there huge loss due to crypto market meltdown.Are you talking about this link below?Coinbase posts net loss of $430 million for Q1 2022That was Q1 and the loss was $430 million. It would be good if hridoyb can include a link for us to know if the OP is true or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "August 10, 2022, 11:39:38 AM",
      "body": "There are many places posting about it online here is one:https://fortune.com/2022/08/09/coinbase-posts-1-1-billion-loss-falling-revenue-in-q2/Not surprising, since trading is way down along with the price.With their tie-in with blackrock and some other things that they have said about 'large investors' and 'institutional investors' I wonder if they are going to slowly transition away from the small retail market (read people like us) and move to the bigger players and let them handle the front end so to speak. They would let E*Trade deal with me for my buying and selling of investment crypto and they just handle the back end. No real idea, just speculation but I have seen a lot of similar speculation.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "August 10, 2022, 01:41:00 PM",
      "body": "Quote from: Oshosondy on August 10, 2022, 11:10:52 AMQuote from: hridoyb on August 10, 2022, 10:40:24 AMWhich site did you got this information from? Try and include the link.This points towards not you key not your coin, especially in the time of crypto bear market, it is better to have your coin on a noncustodial wallet which you have control over. Quote from: AbuBhakar on August 10, 2022, 10:50:53 AMThis issue is already been discussed before the moment coinbase made the announcement about there huge loss due to crypto market meltdown.Are you talking about this link below?Coinbase posts net loss of $430 million for Q1 2022That was Q1 and the loss was $430 million. It would be good if hridoyb can include a link for us to know if the OP is true or not.Yep, The point is the discussion revolves same issue here that Coinbase is reporting loss since Q1 due to market crash and how it was different to the current report which just update there loss with the same problem? I think we are just counting how much they are losing if that is what you are trying to know deeper about this new report.You can use the link below as source for coinbase Q2 report.https://www.business-standard.com/article/finance/coinbase-reports-1-1-billion-in-net-loss-revenue-drops-60-in-q2-122081000316_1.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LeGaulois",
      "created_time": "August 10, 2022, 10:31:52 PM",
      "body": "Quote from: Oshosondy on August 10, 2022, 11:10:52 AMThis points towards not you key not your coin, especially in the time of crypto bear market, it is better to have your coin on a noncustodial wallet which you have control over. You don't understand.Coinbase still owns the coins. The company lost $1.1B in revenues, not  $1.1B of coins, it's a difference.When a company has less activity, so makes less revenues, it consumes fewer resources/infrastructures/employees, and as any company decently managed, it adapts the resources/infrastructures/employees. It's all about management.The point is because Coinbase makes less money, people who invested get less dividends and won't be happyRevenue   US$7.84 billion (2021)Operating income   US$3.08 billion (2021)Net income   US$3.62 billion (2021)Total assets   US$21.3 billion (2021)Total equity   US$6.38 billion (2021)Number of employees   3,730 (2021)Perhaps in May, they have included a \"new risk factor\" but it's because of a new requirement from the SEC which is needed for public companies that hold crypto assets",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "August 11, 2022, 03:10:24 PM",
      "body": "I posted this thought a few months ago: https://bitcointalk.org/index.php?topic=5398711Now that CB has had a 2nd quarter of *public* losses I am just wondering if anyone has had their opinions change. Or, if you didn't see the post the 1st time around feel free to comment now More of an discussion point then trying to make people change their minds on how / where they store their coins and if they know how an exchange is doing matters that much to them and why.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "August 11, 2022, 06:56:29 PM",
      "body": "I have been trying to put together a list of the financially distressed crypto platforms, which seem to be many, and this suffering may continue unless the price rises quickly and realistically to higher levels than the levels of last April and March.Coinbase seems to be in a better position than the lending platforms, which may continue to suffer if the price continues to decline and the interest rate increases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrimeNumber7",
      "created_time": "August 14, 2022, 09:49:35 PM",
      "body": "Quote from: LeGaulois on August 10, 2022, 10:31:52 PMQuote from: Oshosondy on August 10, 2022, 11:10:52 AMThis points towards not you key not your coin, especially in the time of crypto bear market, it is better to have your coin on a noncustodial wallet which you have control over. You don't understand.Coinbase still owns the coins. The company lost $1.1B in revenues, not  $1.1B of coins, it's a difference.Coinbase lost $1.1 billion in its most recent quarter. In other words, Coinbase had expenses that exceeded its revenue by $1.1 billion. Coinbase holds coin on behalf of their customers, but they also own a lot of coin on their own account. About half of the loss was actually an accounting entry that caused Coinbase to report the lowered value of its coin that it owns when compared to its previous quarter. Quote from: DaveF on August 10, 2022, 11:39:38 AMWith their tie-in with blackrock and some other things that they have said about 'large investors' and 'institutional investors' I wonder if they are going to slowly transition away from the small retail market (read people like us) and move to the bigger players and let them handle the front end so to speak. They would let E*Trade deal with me for my buying and selling of investment crypto and they just handle the back end. No real idea, just speculation but I have seen a lot of similar speculation.Coinbase already enjoys what I assume to be a huge profit margin when dealing with their retail customers. Their retail customers are likely to be more employee/time intensive, but I would think many tasks relating to the servicing of retail accounts are automated. Coinbase already has the infrastructure in place to service these accounts. I think it would probably be more likely for a newer exchange to outsource the retail servicing to the likes of eTrade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}