{
  "id": "topic_5420256",
  "title": "lionheart78",
  "author": "lionheart78",
  "created_time": "November 09, 2022, 09:37:16 PMLast edit: November 13, 2022, 10:19:50 AM by lionheart78",
  "content": "Quote from: SFR10 on November 11, 2022, 10:12:09 AM@lionheart78It's worth noting na kailangan ng \"Lightning-enabled wallets\" para iwithdraw ang rewards sa mga laro na ito.- Ang ayaw ko lang sa mga ganitong laro is the fact that pwede silang mag build ng profile dahil sa mga kinocollect nilang data at bilang isang bitcoiner, it's not that safe!Posted earlier here : Earn Bitcoin while Playing GamesHabang nagbabrowse ako kanina about Pouch, nakita ko ang isang site na ito na may nakatalang mga laro na pwedeng pagkakitaan ng satoshi kaya naisip ko na ishare ito sa inyo.  Ang mga laro ay gawa ng THNDR at pwedeng iinstall sa ating mga gadget.  Isa rin itong magandang pagkalibangan kaya kahit na maliit ang reward na satoshi dito ay ayos lang dahil maienjoy naman natin ang oras na inilaan natin sa paglalaro.Narito ang ilang listahan ng mga nasabing laro:Club Bitcoin SolitaireQuoteIf you like Solitaire, then you will fall in love with Club Bitcoin. Play the most tantalizing Classic Solitaire game on the market while earning Bitcoin! What more could you want?Get it on:  Bitcoin BounceQuoteSee how far you can bounce along the Blockchain, trying not to fall! A challenging game that requires fast reflexes and timing.Get it on:  Turbo 84QuoteCan you reach 100 mph? How about 200 mph? Drive as fast as you canthrough this insane lane changing game. Just try not to crash on yourway to reaching your top speed!Get it on:  Bitcoin snakeQuoteThe Classic Snake game - now with Bitcoin! One of the most wellknown and most popular mobile games in the world now has a new twist!Get it on:  Bitcoin BayQuoteA bubble shooter game set in a beautiful tropical location! Have fun and chill by downloading this relaxing seaside bubble shooter today.Get it on:  Iyan ay ilan lamang sa mga laro na pwede tayong kumita ng satoshi, kahit na malafaucet lang ang reward nito ay mageenjoy naman tayo sa oras na gugugulin sa paglalaro nito.  Kung may alam pa kayong mga laro na nagbibigay ng reward na satoshi, maaring ishare lamang natin dito sa thread na ito. Request:Please no \"not worth the time\" reply we all know the faucet reward is minuscule, the aim is to get the list of games where we can earn satoshi while having fun, and @mod if this thread doesn't belong to this board, kindly move it to where it should be thanks!Source: https://www.thndr.games/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420256",
  "comments": [
    {
      "author": "crwth",
      "created_time": "November 10, 2022, 02:45:11 AM",
      "body": "I remember a game parang may alien and nakakareceive ng satoshi before eh. Pero napaka repetitive eh pero ganun siguro talaga mga game earnings. Have you withdrawn from any of the games, OP?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "November 10, 2022, 06:01:29 AM",
      "body": "Quote from: crwth on November 10, 2022, 02:45:11 AMI remember a game parang may alien and nakakareceive ng satoshi before eh. Pero napaka repetitive eh pero ganun siguro talaga mga game earnings. Have you withdrawn from any of the games, OP?Hindi pa, bale recently ko lang nakita ang mga games na ito, I tried lang na iinstall to check kung gumagana pa ang mga laro at ok naman siya.  That said, wala pa ako earnings dito, trying to share baka may mga interesadong member dito sa lokal board na makaearn ng kontig satoshi habang nagpapalipas ng oras at kasabay nito ay baka may nalalaman din ang ibang members na larong nagbibigay ng satoshi as reward kahit anong platform pa ito.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "November 11, 2022, 01:56:42 AM",
      "body": "Ang isip ko sa mga ganitong games na nagbibigay ng satoshi eh parang faucet lang din na nadivert yung system sa isang laro.May katagalan din siguro bago makawithdraw dyan, antayin ko muna kung makawithdraw si op bago ko otry. Maganda to para sa mga bata sa bahay natin tapos laro laro lang sa free time tapos may sats na reward na.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jemzx00",
      "created_time": "November 11, 2022, 08:49:52 AM",
      "body": "Quote from: lionheart78 on November 10, 2022, 06:01:29 AMQuote from: crwth on November 10, 2022, 02:45:11 AMI remember a game parang may alien and nakakareceive ng satoshi before eh. Pero napaka repetitive eh pero ganun siguro talaga mga game earnings. Have you withdrawn from any of the games, OP?Hindi pa, bale recently ko lang nakita ang mga games na ito, I tried lang na iinstall to check kung gumagana pa ang mga laro at ok naman siya.  That said, wala pa ako earnings dito, trying to share baka may mga interesadong member dito sa lokal board na makaearn ng kontig satoshi habang nagpapalipas ng oras at kasabay nito ay baka may nalalaman din ang ibang members na larong nagbibigay ng satoshi as reward kahit anong platform pa ito.Goods talaga mga crypto games na ganto since halos lahat ng faucet crypto games ay repetitive at mas mataas score mo mas mataas makukuha mong rewards. Pero sa totoo lang kung yung reason bakit mo ininstall yan ay para sa earnings, waste of time talaga sya kasi hindi worth it (sorry, kahit indicated naman sa OP na wag sabihin), however kung yung hinahanap mo ay panlibang at laro at extra na lang yung kikitain ng crypto then goods tong mga to. I remember yung ganyang laro na medjo matagal ko rin nilaro since addictive at time consuming rin. Flappy bird sya pero possible ka makakuha ng satoshi depende sa score mo. Sa halos 2weeks to 1 month ko paglalaro, halos 100 pesos worth of sats yung nacash-out ko. Maganda na rin since na-enjoy ko naman yung laro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "November 11, 2022, 10:12:09 AM",
      "body": "@lionheart78It's worth noting na kailangan ng \"Lightning-enabled wallets\" para iwithdraw ang rewards sa mga laro na ito.- Ang ayaw ko lang sa mga ganitong laro is the fact that pwede silang mag build ng profile dahil sa mga kinocollect nilang data at bilang isang bitcoiner, it's not that safe!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "November 24, 2022, 09:18:00 PM",
      "body": "Quote from: blockman on November 11, 2022, 01:56:42 AMAng isip ko sa mga ganitong games na nagbibigay ng satoshi eh parang faucet lang din na nadivert yung system sa isang laro.May katagalan din siguro bago makawithdraw dyan, antayin ko muna kung makawithdraw si op bago ko otry. Maganda to para sa mga bata sa bahay natin tapos laro laro lang sa free time tapos may sats na reward na. Para talaga ito sa mga mahilig maglaro pero for sure, hinde ganoon kadali kumita dito and ang tanong is kung worth it ba ito? Or baka magsayang ka lang ng oras dito at hinde naman safe laruin. Anyway, if marame naman ang naglalaro ng mga games na ito siguro ay kumita na sila. OP, naglalaro kaba nito or natry mo na kahit anong games dito? Curious lang ako kung magkano ang possible na kitain dito.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "November 25, 2022, 01:19:27 PM",
      "body": "May nakita akong isa pang websites [Bling Financial] na kung saan pwede rin kumita ng Satoshi rewards [indirectly (bling rewards > cash-out to Bitcoin and ethereum)] sa mga laru nila, but there's a catch [kailangan may \"Coinbase account\" tayo]!Note: I prefer not to vouch.8 out of 9 games nila is tungkol sa Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}