{
  "id": "topic_5476136",
  "title": "Waybit",
  "author": "Waybit",
  "created_time": "December 01, 2023, 04:55:37 AM",
  "content": "WayBit.pl - provides services for the safe sale and purchase of cryptocurrency for fiat. A modern website with high-quality support makes it possible for clients to receive excellent service and make a quick exchange at a favorable rate.Key Features:- More than 1000 exchange directions- 24/7 support with fast processing of orders- Availability of a crypto license- Support for different currencies PLN, UAH, EUR, USD- Offices in Poland and cash exchange- Unique directions of exchange BLIK and SEPA EUR- Multilingual interfaceLoyalty program - for large and regular customers, our exchanger provides an individual system of discounts.Affiliate programWe are open to cooperation with webmasters, monitors, offline exchangers and business owners who want to accept cryptocurrency for their goods and services. More information about the program and formats can be found at the link.Contacts for communicationE-mail info@waybit.plTelegramInstagramOnline chat on the website www.waybit.pl GO TO EXCHANGE",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476136",
  "comments": [
    {
      "author": "Best_Change",
      "created_time": "December 01, 2023, 05:44:16 AM",
      "body": "Exchanger waybit.pl has been added to our monitor BestChange.We have analyzed information about the service’s work, its reputation, principles, and values of its administration and came to the conclusion that waybit.pl satisfies the criteria for a reliable partner and can be listed in BestChange, among other exchangers.We sincerely hope for productive and long-term cooperation with this service. Despite the successful passing of all the checks, we will keep an eye on its reputation and the development of the client service.We recommend you always check the review page https://www.bestchange.com/waybit-exchanger.html After an exchange, please share your opinion about the provided service with others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "December 01, 2023, 02:04:18 PM",
      "body": "I am not sure about your service having the lowest exchange fees since I haven't used it yet, but you should probably rethink about the anonymity claim to avoid misleading future customers. Firstly, what is anonymous? Your exchange or the clients who will be using it?When I read this KYC and AML policy, there is nothing anonymous about the platform at all. I am I missing something?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "December 01, 2023, 11:55:34 PM",
      "body": "Quote from: logfiles on December 01, 2023, 02:04:18 PM-snip-Firstly, what is anonymous?As always, users will remain anonymous until they hit the AML monitoring alarm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slaman29",
      "created_time": "December 06, 2023, 11:48:09 AM",
      "body": "I like how exchanges can put anything they want. Anonymous and secure.Need to sign up an account? That's not anonymous If I'm not mistaken Poland is an EU country, so there's no way you can use it without KYC. It's probably even illegal for CEX to be anonymous in EU. Not against CEX but prepare for full KYC if you use one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "December 06, 2023, 11:47:38 PM",
      "body": "I randomly tried to put BTC/TRX for the exchange and why is it asking for email address and telegram account? I believe that you're asking for Telegram because next to it attached are Russian characters that I don't understand. It should only be the address of receiving wallet and not going to exceed with other details and information like that, while it's actually an option to put up email but you're putting unnecessary details like they said, agreeing to the KYC/AML policy. Too much to ask just for a few bucks of swapping through you waybit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}