{
  "id": "topic_5456657",
  "title": "cryptosize",
  "author": "cryptosize",
  "created_time": "June 17, 2023, 12:57:54 PM",
  "content": "Έφτιαξα νέο πορτοφόλι στο Electrum-ltc, μου έβγαλε seed phrase των 12 λέξεων, αλλά στο Litewallet (Android app) δεν το δέχεται!Δεν ήξερα ότι το Electrum έχει δικό του custom seed phrase, το οποίο λένε ότι είναι «καλύτερο» από το BIP39. Μπορώ να το μετατρέψω σε BIP39 εκ των υστέρων;Μικρή σημασία έχει βέβαια όταν σπάει το backwards compatibility.Σκέφτομαι τον average joe (που συνήθως έχει passwords στυλ 123456 ) τι μανίκι έχει να φάει αν δεν υπάρχει ένα ενιαίο seed phrase (ΑΝ υποθέσουμε ότι θα κάνει τον κόπο να σημειώσει 12 λέξεις σε ένα χαρτί).Ακόμα δηλαδή κι αν υποθέσουμε ότι το BTC υιοθετούσε 4GB blocks και δεν χρειαζόταν το Lightning...Περιέργως με το original Electrum (για BTC) δεν είχα πρόβλημα με το seed phrase όταν πήγα να το βάλω στο BlueWallet.Τι μπορώ να κάνω τώρα; Δεν μου βγάζει επιλογή τι seed phrase θέλω να δημιουργήσω και υποτίθεται ότι έχει το ίδιο codebase με το Electrum.ΥΓ: Με αυτά και με αυτά, μάλλον προς τσιπάκι θα πάει η δουλειά για τον average joe.Ένα RFID implant στο χέρι και θα χωράνε 256 bits.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456657",
  "comments": [
    {
      "author": "cryptosize",
      "created_time": "June 17, 2023, 04:26:29 PM",
      "body": "QuoteWarning: BIP39 seeds can be imported in Electrum, so that users can access funds locked in other wallets. However, we do not generate BIP39 seeds, because they do not meet our safety standard. BIP39 seeds do not include a version number, which compromises compatibility with future software. We do not guarantee that BIP39 imports will always be supported in Electrum.Φέξε μου και γλίστρησα δηλαδή τι θα ισχύει σε 10-20 χρόνια από σήμερα. Ούτε το Electrum-BTC φτιάχνει BIP39 seed τελικά;",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "June 19, 2023, 09:37:56 AM",
      "body": "Quote from: cryptosize on June 17, 2023, 12:57:54 PMΜικρή σημασία έχει βέβαια όταν σπάει το backwards compatibility.Δε σπάει κάποιο backwards compatibility. Το Electrum ποτέ δεν υποστήριζε παραγωγή seed με BIP39 standard. Quote from: cryptosize on June 17, 2023, 12:57:54 PMΠεριέργως με το original Electrum (για BTC) δεν είχα πρόβλημα με το seed phrase όταν πήγα να το βάλω στο BlueWallet.Μήπως είχες εισάγει BIP39 seed στο Electrum, και μετά το μετέφερες στο BlueWallet; Απ 'όσο ξέρω το BlueWallet μόνο BIP39 υποστηρίζει.Quote from: cryptosize on June 17, 2023, 04:26:29 PMΟύτε το Electrum-BTC φτιάχνει BIP39 seed τελικά;Ποτέ δεν έφτιαχνε. Απλά σου επιτρέπει να εισάγεις τέτοιο όταν κάνεις recover ένα wallet. Αλλά από πάντα είχε δικό του standard.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptosize",
      "created_time": "June 19, 2023, 11:48:43 PM",
      "body": "Εγώ είχα την εντύπωση ότι το Electrum ακολουθεί τα standards που έχει θεσπίσει το BTC (εν προκειμένω το BIP39).Η κατάσταση μου θυμίζει Linux desktop OS πριν 20 χρόνια (πολύ πριν βγει το Android), οπού κάθε distro έκανε τα δικά του. Άλλος boot loader, άλλο GUI, τρέχα γύρευε.Το BlueWallet φαίνεται να υποστηρίζει και Electrum seed. Το Litewallet (για LTC) όχι.Και μάλιστα με το ίδιο BIP39 seed στο Electrum-ltc μου βγάζει άλλη public address και δεν μπορώ να δω το balance μου. Αυτά είναι χαζές παιδικές ασθένειες που πρέπει να λυθούν...Το backwards compatibility μπορεί να σπάσει αν στο μέλλον πάψουν να υποστηρίζουν BIP39 (όπως λένε).Δηλαδή τι; Θα έχω εγώ ένα κομμάτι χαρτί με 12 λέξεις και μετά από 20 χρόνια θα ψάχνω το source code του 2023 να κάνω recompile σε PC του 2040; Ή μήπως αυτό θα το κάνει ο average joe; Αν υπάρχουν PCs μέχρι τότε...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "June 20, 2023, 02:04:07 PM",
      "body": "Quote from: cryptosize on June 19, 2023, 11:48:43 PMΕγώ είχα την εντύπωση ότι το Electrum ακολουθεί τα standards που έχει θεσπίσει το BTC (εν προκειμένω το BIP39).Αν δώσεις αρκετή προσοχή, θα δεις πως δεν υπάρχει κάποιο standard που έχει θεσπίσει το Bitcoin. Υπάρχουν απλά προτάσεις, και σε κάθε wallet software υλοποιούνται. Σε ένα αποκεντρωμένο περιβάλλον είναι φυσιολογικό να συμβαίνει.Quote from: cryptosize on June 19, 2023, 11:48:43 PMΑυτά είναι χαζές παιδικές ασθένειες που πρέπει να λυθούν...Αυτό που ονομάζεις παιδική ασθένεια είναι το side effect του decentralization. Αλίμονο αν είχαμε ένα standard κι όλοι ήταν υπάκουοι χωρίς την ελευθερία να το αρνηθούν. Υπάρχουν διάφοροι τρόποι να αναπαραστήσεις ένα Bitcoin wallet, ο πιο γνωστός με BIP39 seed phrases. Αν δεν σ' αρέσουν άλλοι τρόποι, απλά επέλεξε wallet που να υποστηρίζει BIP39.Quote from: cryptosize on June 19, 2023, 11:48:43 PMΤο backwards compatibility μπορεί να σπάσει αν στο μέλλον πάψουν να υποστηρίζουν BIP39 (όπως λένε).Ποιοι λένε πως θα πάψουν να υποστηρίζουν BIP39 seed;",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptosize",
      "created_time": "June 20, 2023, 06:53:50 PM",
      "body": "Quote from: BlackHatCoiner on June 20, 2023, 02:04:07 PMQuote from: cryptosize on June 19, 2023, 11:48:43 PMΕγώ είχα την εντύπωση ότι το Electrum ακολουθεί τα standards που έχει θεσπίσει το BTC (εν προκειμένω το BIP39).Αν δώσεις αρκετή προσοχή, θα δεις πως δεν υπάρχει κάποιο standard που έχει θεσπίσει το Bitcoin. Υπάρχουν απλά προτάσεις, και σε κάθε wallet software υλοποιούνται. Σε ένα αποκεντρωμένο περιβάλλον είναι φυσιολογικό να συμβαίνει.Quote from: cryptosize on June 19, 2023, 11:48:43 PMΑυτά είναι χαζές παιδικές ασθένειες που πρέπει να λυθούν...Αυτό που ονομάζεις παιδική ασθένεια είναι το side effect του decentralization. Αλίμονο αν είχαμε ένα standard κι όλοι ήταν υπάκουοι χωρίς την ελευθερία να το αρνηθούν. Υπάρχουν διάφοροι τρόποι να αναπαραστήσεις ένα Bitcoin wallet, ο πιο γνωστός με BIP39 seed phrases. Αν δεν σ' αρέσουν άλλοι τρόποι, απλά επέλεξε wallet που να υποστηρίζει BIP39.Quote from: cryptosize on June 19, 2023, 11:48:43 PMΤο backwards compatibility μπορεί να σπάσει αν στο μέλλον πάψουν να υποστηρίζουν BIP39 (όπως λένε).Ποιοι λένε πως θα πάψουν να υποστηρίζουν BIP39 seed;Ρε Άγγελε διαβάζεις τι γράψω ή απλά κάνεις τον contrarian; Άνοιξε το Electrum να δεις τι λέει, το έβαλα και παραπάνω, αλλά προφανώς δεν το διάβασες:QuoteWarning: BIP39 seeds can be imported in Electrum, so that users can access funds locked in other wallets. However, we do not generate BIP39 seeds, because they do not meet our safety standard. BIP39 seeds do not include a version number, which compromises compatibility with future software. We do not guarantee that BIP39 imports will always be supported in Electrum.Για να έρθει adoption, θα πρέπει να υπάρχουν κοινά συμφωνημένα standards.Τα έχω ζήσει και στο Linux (μου θυμίζεις dejavu συζητήσεις 15-20 ετών πίσω περί open-source και ότι δεν γίνεται να συμφωνούν όλοι), δεν είμαι χθεσινός σε αυτά. Ξέρω πως ήρθε το adoption εν τέλει εκεί (όταν συμφώνησαν όλοι να επικεντρωθούν στο Android).Αν θέλουμε self-custody, δεν πρέπει να υπάρχουν τέτοια μπερδέματα, ούτε να ψαχνόμαστε σε 20 χρόνια τι (δεν) θα υποστηρίζει το Electrum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "June 20, 2023, 07:29:33 PM",
      "body": "Quote from: cryptosize on June 20, 2023, 06:53:50 PMΡε Άγγελε διαβάζεις τι γράψω ή απλά κάνεις τον contrarian;Καλά, συγχώρεσέ μου που δεν το είδα. Με μια παράβλεψή μου ξαφνικά γίνομαι contrarian; Quote from: cryptosize on June 20, 2023, 06:53:50 PMΤα έχω ζήσει και στο Linux (μου θυμίζεις dejavu συζητήσεις 15-20 ετών πίσω περί open-source και ότι δεν γίνεται να συμφωνούν όλοι), δεν είμαι χθεσινός σε αυτά.Έχω ξαναπεί πως η αναλογία με το Linux δεν μου φαίνεται και πολύ έγκυρη. Τα Windows νίκησαν επειδή ήταν προϊόν, και η Microsoft είχε στόχο να πιάσει τον average Joe. Η Linux κοινότητα δεν καιγόταν και πολύ, σίγουρα όχι όπως μια εταιρία της οποίας η επιβίωση βασιζόταν στον average Joe.Μπορείς να φανταστείς και μόνος πως ένα closed-source, centralized altcoin δεν τίθεται θέμα προς συζήτηση, είναι προφανώς υποδεέστερο απ' το Bitcoin. Quote from: cryptosize on June 20, 2023, 06:53:50 PMΑν θέλουμε self-custody, δεν πρέπει να υπάρχουν τέτοια μπερδέματα, ούτε να ψαχνόμαστε σε 20 χρόνια τι (δεν) θα υποστηρίζει το Electrum.Το Electrum μπορεί να πάψει να υποστηρίζει BIP39, αλλά δεν επέτρεπε την παραγωγή τέτοιων seed phrases εξ αρχής. Απλώς σου επέτρεπε να κάνεις recover με BIP39. Αν θελήσεις να κάνεις recover, ο συνιστώμενος τρόπος είναι να χρησιμοποιήσεις το wallet software που σου παρήγαγε την φράση.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptosize",
      "created_time": "June 20, 2023, 07:57:01 PM",
      "body": "Quote from: BlackHatCoiner on June 20, 2023, 07:29:33 PMQuote from: cryptosize on June 20, 2023, 06:53:50 PMΡε Άγγελε διαβάζεις τι γράψω ή απλά κάνεις τον contrarian;Καλά, συγχώρεσέ μου που δεν το είδα. Με μια παράβλεψή μου ξαφνικά γίνομαι contrarian; Quote from: cryptosize on June 20, 2023, 06:53:50 PMΤα έχω ζήσει και στο Linux (μου θυμίζεις dejavu συζητήσεις 15-20 ετών πίσω περί open-source και ότι δεν γίνεται να συμφωνούν όλοι), δεν είμαι χθεσινός σε αυτά.Έχω ξαναπεί πως η αναλογία με το Linux δεν μου φαίνεται και πολύ έγκυρη. Τα Windows νίκησαν επειδή ήταν προϊόν, και η Microsoft είχε στόχο να πιάσει τον average Joe. Η Linux κοινότητα δεν καιγόταν και πολύ, σίγουρα όχι όπως μια εταιρία της οποίας η επιβίωση βασιζόταν στον average Joe.Μπορείς να φανταστείς και μόνος πως ένα closed-source, centralized altcoin δεν τίθεται θέμα προς συζήτηση, είναι προφανώς υποδεέστερο απ' το Bitcoin. Quote from: cryptosize on June 20, 2023, 06:53:50 PMΑν θέλουμε self-custody, δεν πρέπει να υπάρχουν τέτοια μπερδέματα, ούτε να ψαχνόμαστε σε 20 χρόνια τι (δεν) θα υποστηρίζει το Electrum.Το Electrum μπορεί να πάψει να υποστηρίζει BIP39, αλλά δεν επέτρεπε την παραγωγή τέτοιων seed phrases εξ αρχής. Απλώς σου επέτρεπε να κάνεις recover με BIP39. Αν θελήσεις να κάνεις recover, ο συνιστώμενος τρόπος είναι να χρησιμοποιήσεις το wallet software που σου παρήγαγε την φράση. Δεν ξέρω να σου πω ποιό θα είναι το \"Android moment\" του Bitcoin (ούτε το 2005 ήξερα περί Android, αφού δεν υπήρχε), αλλά ξέρω ότι θα έρθει. Δεν νίκησαν τα Windows στο mobile, απέτυχαν οικτρά! Mobile devices > PCsΤο θέμα είναι σε βάθος χρόνου τι γίνεται με το BIP39 recovery... μπορώ να κρατήσω το τωρινό source code; Μπορώ. Δεν είναι πρακτική λύση όμως, δεν ξέρω καν αν θα έχω PC ή mobile το 2040 (μπορεί να είμαστε όλοι με γυαλιά στυλ Apple Vision Pro, τσιπάκια στο σώμα κλπ.)Δεν αμφιβάλλω ότι είναι ανώτερο το seed του Electrum (αφού έχει version number), αλλά δεν καταλαβαίνω γιατί δεν το προωθούν σε κάποιο BIP, έτσι ώστε να το υποστηρίξουν περισσότερα πορτοφόλια.Καλώς ή κακώς το BIP39 είναι το standard, αφού δεχόμαστε ότι και το Bitcoin είναι standard στο όλο οικοσύστημα των κρυπτονομισμάτων.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "June 20, 2023, 08:06:06 PM",
      "body": "Quote from: cryptosize on June 20, 2023, 07:57:01 PMΤο θέμα είναι σε βάθος χρόνου τι γίνεται με το BIP39 recovery... μπορώ να κρατήσω το τωρινό source code;Δε καταλαβαίνω γιατί σε καίει τόσο πολύ αυτό. Αν θέλεις να κρατήσεις λεφτά με Electrum σε βάθος 20ετίας, χρησιμοποίησε το δικό του standard. Δεν προτείνεται να παράξεις τη φράση σε BlueWallet και να περιμένεις να παίζει σε 20 χρόνια σε ένα που δεν είναι φιλικό με άλλα standards όπως το Electrum. Επίσης τα έμπιστα software που έχουν να κάνουν με bitcoin (όπως αυτό) δεν πιστεύω να σε απογοητεύσουν σε 20 χρόνια. Νομίζω είναι σχεδιασμένα για αυτό το λόγο.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}