{
  "id": "topic_5434073",
  "title": "haloxon",
  "author": "haloxon",
  "created_time": "January 07, 2023, 02:10:03 PMLast edit: January 11, 2023, 09:56:59 AM by mole0815",
  "content": "... wenn man bei dem Routine-Blockchain-Check seiner Paperwallets feststellt, dass zwei der Paperwallets im November leergeräumt wurden   //edit by mole0815: Die Beiträge ab hier wurden aus dem ursprünglichen Thread abgetrennt.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434073",
  "comments": [
    {
      "author": "Real-Duke",
      "created_time": "January 07, 2023, 02:35:30 PM",
      "body": "Quote from: haloxon on January 07, 2023, 02:10:03 PMdass zwei der Paperwallets im November leergeräumt wurden Bitte was?? Oh mein Gott, ich hoffe jetzt für Dich, dass es kein riesen Verlust gewesen ist Hast Du die Paperwallets denn online oder offline (wie es allgemein immer empfohlen wird) erstellt?Wer ausser Dir hatte denn alles Zugang? Ich bekomme bei solchen Meldungen selbst immer wieder Gänsehaut...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "January 07, 2023, 05:31:56 PMLast edit: January 07, 2023, 06:06:53 PM by cygan",
      "body": "Quote from: haloxon on January 07, 2023, 02:10:03 PM... wenn man bei dem Routine-Blockchain-Check seiner Paperwallets feststellt, dass zwei der Paperwallets im November leergeräumt wurden   wtf... woher hast du die paperwallets? wurden die bei den collectibles angeboten? wenn ja, wer war der verkäufer und um welche paperwallets genau handelt es sich hier?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Koal-84",
      "created_time": "January 07, 2023, 06:06:08 PM",
      "body": "Würde mich auch interessieren wie es vorkommen kann das Paperwallets leergeräum sind und wo/wie die Wallets erstellt wurden. @haloxon sorry für deinen Verlust hoffe er ist nicht zu hoch?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "5tift",
      "created_time": "January 08, 2023, 09:00:15 AM",
      "body": "Mich würden auch die Umstände interessieren die zu diesem Verlust führten.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_solo_miner",
      "created_time": "January 08, 2023, 11:01:16 AM",
      "body": "Quote from: haloxon on January 07, 2023, 02:10:03 PM... wenn man bei dem Routine-Blockchain-Check seiner Paperwallets feststellt, dass zwei der Paperwallets im November leergeräumt wurden   wie und womit hattest du diese Erstellt?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "haloxon",
      "created_time": "January 08, 2023, 01:27:18 PM",
      "body": "merci euch. bin selber erst noch am eruieren und am \"wie was wann warum\" herausfinden und werde dann berichten, wenn ich bisserl schlauer sein sollte.betraglich einmal 0,5 BTC und einmal 0,1 BTC - wobei das kleinere wallet jenes war, was ich für mein patenkind immer wieder mit kleinen beträgen gefüttert hatte. es sind jedenfalls die einzigen beiden paperwallets, die ich nicht mit bip38 verschlüsselt hatte. alles andere, wenn ich selber mehr weiß.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Koal-84",
      "created_time": "January 08, 2023, 02:00:21 PM",
      "body": "Quote from: haloxon on January 08, 2023, 01:27:18 PMmerci euch. bin selber erst noch am eruieren und am \"wie was wann warum\" herausfinden und werde dann berichten, wenn ich bisserl schlauer sein sollte.betraglich einmal 0,5 BTC und einmal 0,1 BTC - wobei das kleinere wallet jenes war, was ich für mein patenkind immer wieder mit kleinen beträgen gefüttert hatte. es sind jedenfalls die einzigen beiden paperwallets, die ich nicht mit bip38 verschlüsselt hatte. alles andere, wenn ich selber mehr weiß.Wie oder wo (mit welchem Tool) wurden die Wallets erstellt? So könnte man sagen am besten doch (Enkel/Kinder) doch einen günstigen Nano S kaufen und dort hin senden 🤔. Ist doch eine ganz schön beachtliche Summe, tut mir echt leid. Roobet hat mir ca. 0.3 BTC eingebracht die letzten 2 Jahre, somit wären mehr als 2 Jahre für einen scammer gewesen😥, eventuell möchtest du ja eine BTC Adresse veröffentlichen, Lafu (glaube ich jedenfalls) hat da bis jetzt immer gute Analysen erstellt wohin die BTC geflossen sind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "January 08, 2023, 04:46:17 PM",
      "body": "Quote from: haloxon on January 08, 2023, 01:27:18 PMmerci euch. bin selber erst noch am eruieren und am \"wie was wann warum\" herausfinden und werde dann berichten, wenn ich bisserl schlauer sein sollte.betraglich einmal 0,5 BTC und einmal 0,1 BTC - wobei das kleinere wallet jenes war, was ich für mein patenkind immer wieder mit kleinen beträgen gefüttert hatte. es sind jedenfalls die einzigen beiden paperwallets, die ich nicht mit bip38 verschlüsselt hatte. alles andere, wenn ich selber mehr weiß.Oh je , sorry das zu hören was dir passiert ist mit deinem paperwallets.Wie Koal-84 bereits geschrieben hat wäre eine Bitcoin adresse eventuell nicht schlecht wo die Btc hin überwiesen worden sind.Ist es bei bei beiden paperwallets die gleiche adresse wo die Coins hingesendet worden sind ?DU kannst mir auch gerne die Btc adresse der wallet in einer PM schicken dann schaue ich mir das mal an , nur wenn du willst.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "January 08, 2023, 05:07:34 PM",
      "body": "@haloxon 0.6BTC ist schon eine ansage und da es vor knapp über einem jahr Real-Duke erwischt hat und er durch unsere d-a-ch community etliche hilfe bekommen hatmöchte ich dir, wie damals auch Real-Duke, auch etwas unter die arme greifen und deinen verlust so gut wie möglich minimierensomit bitte ich dich mir mal eine BTC adresse zu geben (am besten jetzt keine von den 2 betroffenen paperwallets...  ) und ich schicke dir 0.005 rüber btw mit einer schönen Coldkey karte würde das nicht passieren...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Real-Duke",
      "created_time": "January 08, 2023, 06:20:29 PM",
      "body": "Oh je, bitte echt nicht schon wieder  @haloxon, auch wenn Du noch am prüfen bist wieso und weshalb, ich kann mir exakt vorstellen, wie es dir gerade geht...Ich würde auf jeden Fall zuerst die Adressen an Lafu schicken, damit er einmal den Weg der Coins checken kann auf verdächtige Empfänger Wallets.Bei mir war ja das Problem, dass ich den Seed zzu meinem Ledger auch digital in einer verschlüsselten Textdatei auf meinem NAS liegen hatte. Ich hatte einfach bammel, das mit den Wörtnern ausgefüllte Kärtchen zu verbummeln. Der programmierer des Trojaners hat die Datei dann gefunden und entschlüsselt.Auch wenn es dir momentan schwer fällt, Kopf hoch! Ist nur Geld, keine tödliche Krankheit",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Unknown01",
      "created_time": "January 08, 2023, 09:03:02 PM",
      "body": "Oh scheiße.. Das ist eine sehr schmerzhafte Summe und es ist sehr beängstigend, dass da jemand tatsächlich Zugriff auf deine Paper Wallets bekommen konnte. Es tut mir leid für dich und so sieht man eben, dass selbst Paper Wallets nicht sicher genug sind. Ich fühle mich zwar mit Ledger gut aufgehoben aber auch da gibt es bestimmt Tricks wie man ausgeraubt werden kann. Ich hoffe, dass du irgendeine Spur finden kannst..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Buchi-88",
      "created_time": "January 09, 2023, 08:29:09 AM",
      "body": "Quote from: haloxon on January 07, 2023, 02:10:03 PM... wenn man bei dem Routine-Blockchain-Check seiner Paperwallets feststellt, dass zwei der Paperwallets im November leergeräumt wurden   Sorry das ist immer Böse so eine Erfahrung, für einen weiteren Austausch @all würde ich Real-Dukes Thread vorschlagen Zwecks OffTopic hier?Heute hat es mich erwischt....Den genauen Hergang bei einer Paperwallet würde mich nämlich auch interessieren.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "January 09, 2023, 08:44:38 AM",
      "body": "Oh shit! Kopf hoch haloxon und ich hoffe du kannst rausfinden (gerne auch mit unserer Unterstützung) wie es dazu kam damit du zumindest in Zukunft sicher sein kannst sowas nicht nochmal erleben zu müssen Quote from: Buchi-88 on January 09, 2023, 08:29:09 AMfür einen weiteren Austausch @all würde ich Real-Dukes Thread vorschlagen Zwecks OffTopic hier?Das würde ich auch empfehlen oder ich trenne die Beiträge zu dem Thema (ab diesem Beitrag) hier raus und wir erstellen einen separaten Thread.Besser wäre es auf jeden Fall denn der Sache sollten wir schon auf den Grund gehen und hier geht es sonst unter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CoinEraser",
      "created_time": "January 09, 2023, 12:16:15 PM",
      "body": "Quote from: haloxon on January 07, 2023, 02:10:03 PM... wenn man bei dem Routine-Blockchain-Check seiner Paperwallets feststellt, dass zwei der Paperwallets im November leergeräumt wurden   Oh man! So was hört man nicht gerne. 0,6 BTC sind schon ein herber Verlust und es tut mir wirklich leid für dich! Was auch krass ist, das es Paperwallets waren und diese leer geräumt wurden. Das ist schon echt bitter! Ich kann dir derzeit zwar keine BTC schicken, aber ich erwarte morgen meine Ledger Wallet von Betnomi. Bei mir wäre diese ein Sammlerstück und ich würde sie nicht aktive nutzen, daher kann ich dir anbieten, dir diese kostenlos zu schicken, damit so was nicht noch mal passiert. Also wenn du daran Interesse hast, schick mir eine PN mit deinen Kontaktdaten und ich schicke sie dir zu.  Quote from: mole0815 on January 09, 2023, 08:44:38 AM-snip- ... oder ich trenne die Beiträge zu dem Thema (ab diesem Beitrag) hier raus und wir erstellen einen separaten Thread.Besser wäre es auf jeden Fall denn der Sache sollten wir schon auf den Grund gehen und hier geht es sonst unter.Ein separater Faden wäre wohl das Beste dafür.Ansonsten Entschuldigung für OT!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bullrun2024bro",
      "created_time": "January 09, 2023, 05:18:19 PM",
      "body": "Quote from: haloxon on January 07, 2023, 02:10:03 PM... wenn man bei dem Routine-Blockchain-Check seiner Paperwallets feststellt, dass zwei der Paperwallets im November leergeräumt wurden Oh shit, dass tut mir Leid.  Weißt du schon wie es passiert ist, dass du deine Coins verloren hast? Paperwallets gelten ja idR als sehr sicher. Da bin ich doch etwas schockiert, dass du jetzt um deine Coins erleichtert wurdest.Quote from: haloxon on January 08, 2023, 01:27:18 PMbetraglich einmal 0,5 BTC und einmal 0,1 BTC - wobei das kleinere wallet jenes war, was ich für mein patenkind immer wieder mit kleinen beträgen gefüttert hatte. es sind jedenfalls die einzigen beiden paperwallets, die ich nicht mit bip38 verschlüsselt hatte. alles andere, wenn ich selber mehr weiß.Uff 0.6 BTC ist schon eine ganz schöne Hausnummer. Hoffentlich gelingt es die Täter zu fassen (auch wenn es natürlich sehr unwahrscheinlich ist).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "January 11, 2023, 09:55:07 AM",
      "body": "Ich habe es mir erlaubt die Beiträge zu der Thematik in diesen neuen Thread auszulagern haloxon.In den anderen Threads gibt es Verweise und ich hoffe wir kommen der Sache auf die Schliche.Und noch besser wäre es wenn dir in irgendeiner Form geholfen werden kann haloxon.Anzeige bei der Polizei hast du bereits erstattet?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "haloxon",
      "created_time": "January 11, 2023, 03:29:38 PM",
      "body": "sorry für die späte Rückmeldung...Grund wird wohl der hier gewesen sein: https://medium.com/mycrypto/disclosure-key-generation-vulnerability-found-on-walletgenerator-net-potentially-malicious-3d8936485961das Thema war leider im deutschen Board nicht so präsent, darum ist es mir nicht untergekommen.das Timing war zusätzlich unglücklich: ich hab das wallet Anfang Mai 2019 erstellt, dieser Bericht ist Mitte/Ende Mai 2019 rausgekommen. September 2022 war noch alles normal. Ende November 2022 herum wurden die corns scheinbar abgezogen.betrifft diese beiden wallets:BTC 0.539 / 1CGtbXFvGQWHuas6TDLummCqkpEG7fjc56BTC 0.095 / 17ScPhQ5Ab9zmJXRRgSvp8Dz1ozdLwq6qqich bin mir nicht sicher, aber ich glaube, mit dieser Tx (d767b893ad7e0b78bef76966ff47f5e7ee93151840f04b062dc609c5e8f85569) müsste die Transaktion stattgefunden habenp.s.: das Weihnachtsgeschenk auf das zweite Wallet 0,005 haben sie noch nicht abgezogen - vielleicht sollte ich es mal drauf lassen, um herauszufinden, ob die Betrüger wallets, die sie schon mal abgezockt haben, weiterhin regelmäßig auf neu-Eingänge überprüfen und dann nochmals abzocken (ist ja jetzt immerhin seit dem 24.12. noch drauf).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "willi9974",
      "created_time": "January 11, 2023, 04:07:47 PM",
      "body": "Schade das du da drüber gestolpert bist, sehe ich aber jetzt auch zum ersten mal. Hätte mir auch passieren können.Ist https://www.bitaddress.org/ dann weiterhin save? War hier auch mal was? Glaube mich zu erinnern, das hier ähnlich klingende Webadressen benutzt wurden um die Seite nachzubauen mit kompromittierten Code. Finde dazu aber gerade nichts mehr...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "January 11, 2023, 04:18:57 PM",
      "body": "Quote from: haloxon on January 11, 2023, 03:29:38 PMsorry für die späte Rückmeldung...Grund wird wohl der hier gewesen sein: https://medium.com/mycrypto/disclosure-key-generation-vulnerability-found-on-walletgenerator-net-potentially-malicious-3d8936485961Danke für die Erklärung. Ich muss mir das auch nochmal in Ruhe durchlesen denn Paperwallets (für Geschenke) habe ich auch schon verwendet Erwähnt wurde die betroffene URL hier schon mehrfach aber im Detail habe ich die Ergebnissen noch nicht geprüft: https://ninjastic.space/search?board=16&child_boards=true&content=WalletGenerator.netQuote from: willi9974 on January 11, 2023, 04:07:47 PMIst https://www.bitaddress.org/ dann weiterhin save?Korrekt (offline) verwendet mMn. ja.//edit: z.B. hier wurde das Thema bereits erwähnt. Aber sowas kann man leider auch mal übersehen",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}