{
  "id": "topic_5457170",
  "title": "Liliana1304",
  "author": "Liliana1304",
  "created_time": "June 22, 2023, 07:37:34 AM",
  "content": "Nah for we contry wey dis saying \"wonders shall never cease\" dey really work. None of us be strangers to d suffering of the masses and even our civil servants wey for a long time don dey earn #30,000 and bin dey beg govt to increment the tin but notin don show instead we presido dey promise \" living wage\"  News wey reach us dis morning na say them don dey urge pipo for The House of Rep say make dem hurry amend the rule wey go see highly placed individuals to receive a 114% increase in salary. To me, dis na highly unfair treatment to the poor masses and subjugation of the rights and privilege of the civil servants and masses. How una see this development? E make sense or Presido dey do wetin e dey try preach against??https://www.vanguardngr.com/2023/06/tinubu-shettima-govs-judges-others-to-get-114-salary-increase-rmafc/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457170",
  "comments": [
    {
      "author": "lagosnoir",
      "created_time": "June 22, 2023, 10:39:17 AM",
      "body": "I'm personally not bothered about their official salary once it is declared. It is the unofficial salary (corruption and gratuitous perks) that is worrisome. And legislators treating constituency projects like personal largesse. I think the former vice president was hinting about the increase before he left office.https://igberetvnews.com/1445882/yemi-osinbajo-seeks-pay-rise-ex-presidents-vpsBut considering that government is about to go into negotiations with labour over fuel price hikes, these guys are clearly not reading the room, or they don't give a damn.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "June 22, 2023, 03:10:16 PM",
      "body": "President Tinubu sae day kind thing e no happened for anywhere. Im no tok am sef na piple dey carry rumour dey walker na so im tok am. You can see the egberi for here https://nairametrics.com/2023/06/22/breaking-presidency-says-president-tinubu-has-not-approved-salary-increase-for-politicians-others/. And if im go do like dat then dat means he sef come for imself and not to develop the people has im claim. Make we see weti imself go do .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "June 22, 2023, 06:31:41 PM",
      "body": "I still dey maintain my stand as not a fan of Bola Ahmed Tinubu but I always try to be reasonable as possible, I had to check the site you got the news to see if it's authentic even at that many newspaper houses in the country don't verify their news properly and mainly right what the feel can get attention and give them more money.So I would keep researching on this news to see if it's true but the bigger picture is that the masses are being left out in the country and it did not start now. The salary difference between politicians and the masses are enormous coupled with the allowance and benefits the politicians earn. It's all laughable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "June 22, 2023, 08:29:34 PM",
      "body": "This is one day ago news:Quote from: https://dailytrust.com/fg-approves-114-salary-increase-for-tinubu-shettima-govs-others/The Revenue Mobilisation, Allocation and Fiscal Commission (RMAFC) has approved a 114 per cent increase in the salaries of elected politicians, including the President, vice president, governors, lawmakers as well as judicial and public office holders.This is 16 hours ago news:Quote from: https://www.google.com/amp/s/www.vanguardngr.com/2023/06/tinubu-shettima-govs-judges-others-to-get-114-salary-increase-rmafc-2/amp/Chairman of the Revenue Mobilisation, Allocation and Fiscal Commission, RMAFC, Muhammad Shehu, has said the salaries of politicians, judicial and public office holders would be increased by 114 per cent.From approved to would be increased.This is six hours ago news:No presidential approval to raise pay of political office holders, judicial officers – PresidencyQuote from: https://www.google.com/amp/s/sunnewsonline.com/no-presidential-approval-to-raise-pay-of-political-office-holders-judicial-officers-presidency/%3fampThe Presidency has declared that the Revenue Mobilisation, Allocation and Fiscal Commission (RMAFC) did not get approval to increase the salaries of politicians, judicial and public office holders by 114 per cent.Let us wait to see what will happen next. We should not just trust what we see on news immediately.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lagosnoir",
      "created_time": "June 23, 2023, 10:18:58 AM",
      "body": "This na wetin dem they call \"developing story\".E be like dem want to check people temperature before them do am. If dem do am, the thing go be unpopular. But, e go be...Quote from: Charles-Tim on June 22, 2023, 08:29:34 PMThis is one day ago news:Quote from: https://dailytrust.com/fg-approves-114-salary-increase-for-tinubu-shettima-govs-others/The Revenue Mobilisation, Allocation and Fiscal Commission (RMAFC) has approved a 114 per cent increase in the salaries of elected politicians, including the President, vice president, governors, lawmakers as well as judicial and public office holders.This is 16 hours ago news:Quote from: https://www.[Suspicious link removed]Chairman of the Revenue Mobilisation, Allocation and Fiscal Commission, RMAFC, Muhammad Shehu, has said the salaries of politicians, judicial and public office holders would be increased by 114 per cent.From approved to would be increased.This is six hours ago news:s/sunnewsonline.com/no-presidential-approval-to-raise-pay-of-political-office-holders-judicial-officers-presidency/%3famp]No presidential approval to raise pay of political office holders, judicial officers – PresidencyQuote from: https://www.[Suspicious link removeds/sunnewsonline.com/no-presidential-approval-to-raise-pay-of-political-office-holders-judicial-officers-presidency/%3famp]The Presidency has declared that the Revenue Mobilisation, Allocation and Fiscal Commission (RMAFC) did not get approval to increase the salaries of politicians, judicial and public office holders by 114 per cent.Let us wait to see what will happen next. We should not just trust what we see on news immediately.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "June 23, 2023, 11:32:12 AM",
      "body": "Quote from: Liliana1304 on June 22, 2023, 07:37:34 AMNah for we contry wey dis saying \"wonders shall never cease\" dey really work. None of us be strangers to d suffering of the masses and even our civil servants wey for a long time don dey earn #30,000 and bin dey beg govt to increment the tin but notin don show instead we presido dey promise \" living wage\"  News wey reach us dis morning na say them don dey urge pipo for The House of Rep say make dem hurry amend the rule wey go see highly placed individuals to receive a 114% increase in salary. To me, dis na highly unfair treatment to the poor masses and subjugation of the rights and privilege of the civil servants and masses. How una see this development? E make sense or Presido dey do wetin e dey try preach against??https://www.vanguardngr.com/2023/06/tinubu-shettima-govs-judges-others-to-get-114-salary-increase-rmafc/I know the reason why this increment of workers salary from #30k to a reasonably amount was never implemented since, is simply because those politicians & law makers weren't included, and now wey presido Tinubu don shoke mouth for the matter, eh no go still also make sense to include politicians for this 114% salary increase, as politics is not a career, and yet all of them are entitled to more privileges in mere 4 to 8yrs in office than career professionals such as teachers, medical doctors & other civil servants in their 35 to 40yrs in office working for the betterment of the nation. Because if you could examine very well, you will notice that the least Civil/public servant earns around #30,000 to #200,000 monthly, while the least politicians earn around 700k to 3million naira monthly, including Walldrop allowances and e.t.c",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "June 23, 2023, 11:44:05 AM",
      "body": "I just hope say this news na rumors,if not na discrimination na e Tinubu and the former Nigeria leaders dey do to the poor. After the rich go say na one Nigeria when no love and equality of law to all citizens. How the poor masses way need liberation from poverty funds no increase with all hardship,then na the rich wey no dey experience hardship na e Tinubu go increase their funds.Most times some decision wey our leaders dey take dey make me wonder if them be daylight vampires,wet see the poor as the ones wet them to feed on (suck their blood). Let's keep all ears down to hear if this is for real.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "June 23, 2023, 02:40:09 PM",
      "body": "Dis mata dey funny o. As the tin don receive enough backlash dem don run talk say no be true news. According to wetin I read for  here  it seems to be a true news o. But I wonder where the country dey head to like dis. No wonder we teachers for public schools no dey carry their jobs seriously again since such treatment dey reach them. I wonder the day wen corruption go leave this contri hand because at this rate, person no fit carry the govt get hope.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "knowngunman",
      "created_time": "June 23, 2023, 02:55:16 PM",
      "body": "Nigerian government don debunked this information na. Seriously media suppose get regulation and punishment should be served to those wey dey spread fake news. E dey painful to see media houses doing copy and paste from one another without verifying the information from reliable and accurate source. Nothing good no de dey our headline on a daily basis based on the hatred wey dey flow for our blood",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "June 23, 2023, 06:06:09 PM",
      "body": "Una d sure wey we go fit survive all this new implementation wey the happen for this our country before the end of Tinubu tenure? Only within a month, Nigerians don d experience so many unexpected stuff for the country. Em started with the removal of fuel subsidy wey skyrocket the price of fuel to 540, followed by naira exchange unification wey make dollar increase to 840naira, FG can't fund university anymore, electricity bill hike by 40% join and now na 114% salary increase for elected politicians and judges. No be renewed hope for politicians be this? And shege come give us wey be the poor masses. As em d so, peso no know what else wey the FG go do again because na every week wey the FG d pass new bill.In all of these wey d happen, none of the proposed bill wey FG don pass don d in favor of the masses. Na to tell you sae, em no go be an easy 4years for Nigerians.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "June 23, 2023, 08:16:20 PM",
      "body": "Quote from: knowngunman on June 23, 2023, 02:55:16 PMNigerian government don debunked this information na. Seriously media suppose get regulation and punishment should be served to those wey dey spread fake news. E dey painful to see media houses doing copy and paste from one another without verifying the information from reliable and accurate source. Nothing good no de dey our headline on a daily basis based on the hatred wey dey flow for our blood The news don already dey debunked but I still think there’s more to this and that the government is getting at something. Like our people say, there’s no smoke without fire. This new case from a very reliable source and all major newspapers in Nigeria took the news on their pages. Whatever been the case in this matter, let them not forget the poor masses and temper justice with mercy for the less privileges who needs this increment the most and are being affected adversely by the recent fuel subsidy removal too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "June 23, 2023, 10:42:24 PM",
      "body": "Sometimes I dey wonder the set's of human rice nd beans we get as leaders for this country. Every government wey enter go first tagget one thing wey Dem go do  to favor them before them begin work for office proper. Why the suden increase in salaries of elected officials. Are they not wealthy already to be contented with the large chunk of money they stole.  It is unfortunate that our leaders do not care about the masses but rather they think of their pockets and bank accounts to accumulate more I'll gotten wealth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Black susano",
      "created_time": "June 27, 2023, 10:59:30 PM",
      "body": "Quote from: CryptoHeadlineNews on June 23, 2023, 11:32:12 AMQuote from: Liliana1304 on June 22, 2023, 07:37:34 AMNah for we contry wey dis saying \"wonders shall never cease\" dey really work. None of us be strangers to d suffering of the masses and even our civil servants wey for a long time don dey earn #30,000 and bin dey beg govt to increment the tin but notin don show instead we presido dey promise \" living wage\"  News wey reach us dis morning na say them don dey urge pipo for The House of Rep say make dem hurry amend the rule wey go see highly placed individuals to receive a 114% increase in salary. To me, dis na highly unfair treatment to the poor masses and subjugation of the rights and privilege of the civil servants and masses. How una see this development? E make sense or Presido dey do wetin e dey try preach against??https://www.vanguardngr.com/2023/06/tinubu-shettima-govs-judges-others-to-get-114-salary-increase-rmafc/I know the reason why this increment of workers salary from #30k to a reasonably amount was never implemented since, is simply because those politicians & law makers weren't included, and now wey presido Tinubu don shoke mouth for the matter, eh no go still also make sense to include politicians for this 114% salary increase, as politics is not a career, and yet all of them are entitled to more privileges in mere 4 to 8yrs in office than career professionals such as teachers, medical doctors & other civil servants in their 35 to 40yrs in office working for the betterment of the nation. Because if you could examine very well, you will notice that the least Civil/public servant earns around #30,000 to #200,000 monthly, while the least politicians earn around 700k to 3million naira monthly, including Walldrop allowances and e.t.c(op) why e dey be you like film for your eyes na today na him u no 9ja for this life, things for  this country just dey like say na upside down because how dey go add 114% salary increments for thife politicians  this matter no clean ohh see some level 13 worker dey earn about 100k monthly and wet in self buy with 100k now, the civil servant get things to do pass the politician if I be the president I no go do something like ohhMak we check if the government increase the salary how much thing we fit buy self the way thing don cost.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "June 28, 2023, 10:17:00 PM",
      "body": "Quote from: Liliana1304 on June 22, 2023, 07:37:34 AMNews wey reach us dis morning na say them don dey urge pipo for The House of Rep say make dem hurry amend the rule wey go see highly placed individuals to receive a 114% increase in salary. To me, dis na highly unfair treatment to the poor masses and subjugation of the rights and privilege of the civil servants and masses. How una see this development? E make sense or Presido dey do wetin e dey try preach against??Any update for this matter because I no believe say presido go gree accept this one. Him know say plenty people already hate am as no be him the masses vote into office so him go need dey mindful of things wey him go do especially during this him early days in office. E no make sense to sign this kind rubbish into law say make dem dey pay people wey dey high places (AKA themselves) this increase. Person wey bring this on no get conscience so upon wetin dey sup for the country na to increase their pockets be this people problem. We need begin they watch people wey we dey put for all those seat for reps and senate and not only governors and President because na thief them full there. If any salary need to get increase for this country na minimum wage to the least as 50k go dey reasonable. If them over increase am then be rest assured others things will increase as well but for person to dey on the least 50k monthly, e go fit help out. Minimum wages no means say na wetin all man go receive but on the least minimum nobody supposed dey earned less than 50k. Infact instead of them to increase this politicians money or money of people wey dey high places as dem talk, make dem cut down their salary and distribute it among the levels in the public sector.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "June 29, 2023, 01:11:49 AM",
      "body": "Quote from: CryptopreneurBrainboss on June 28, 2023, 10:17:00 PMIf any salary need to get increase for this country na minimum wage to the least as 50k go dey reasonable. If them over increase am then be rest assured others things will increase as well but for person to dey on the least 50k monthly, e go fit help out. Minimum wages no means say na wetin all man go receive but on the least minimum nobody supposed dey earned less than 50k. Infact instead of them to increase this politicians money or the money of people wey dey high places as dem talk, make dem cut down their salary and distribute it among the levels in the public sector. Baba oil dey your talk, why should there be increased in the salary of.rep, the same way the EFCC boss emerged with a huge takeaway package for himself. and one female director who retired 3 years ago, the truth is that politicians for Nigeria are not leaders but businessmen who are there for their interest, on the issue of minimum wage think a raise innit is long overdue and the 50k amount you mentioned is a relatively fair for the economy for now because the current economic situation in the country has forced most civil servants to become corrupt just to survive and met up to earns needs.But if the minimum wage is placed at 50k it will go a long way in solving the economic problems of Nigeria citizens and the workforce because the purchasing chain will witness increased flow to meet global standards since our major resource is a peg to the dollar and fuel price is based on the global oil price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blackened515",
      "created_time": "July 13, 2023, 09:13:10 PM",
      "body": "Quote from: CryptSafe on June 23, 2023, 10:42:24 PMSometimes I dey wonder the set's of human rice nd beans we get as leaders for this country. Every government wey enter go first tagget one thing wey Dem go do  to favor them before them begin work for office proper. Why the suden increase in salaries of elected officials. Are they not wealthy already to be contented with the large chunk of money they stole.  It is unfortunate that our leaders do not care about the masses but rather they think of their pockets and bank accounts to accumulate more I'll gotten wealth.We're suffering and it's high time we make the right choice by making sure we vote these bad leaders out of power in our next chance to exercise our franchise. Our leaders don't care about its citizens, we de suffered and our voices are not heard. Instead of the top influential politicians for the country to try to solved the country problem, dem de fight for increase for their salaries, as if them b de collect pennies as salaries. Them de chop weytin 1 million Nigerian workers for dey earn, and the thing go just unzip the estimated budget, come turn everything upside down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}