{
  "id": "topic_5438144",
  "title": "theskillzdatklls",
  "author": "theskillzdatklls",
  "created_time": "February 05, 2023, 10:46:19 AM",
  "content": "Offering bank wires, cash in several major cities (inquire), ewallets.Accepting payment in BTC/ETH/USDT. Will use trusted escrow at buyers expense. You must post bond up front either with myself or escrow.Min $5k. Max $250k.Bank wires, cash (if available) you pay a 15% fee. Ewallets you pay a 10% fee. Extra fees may be applicable depending on the currency you request just to cover exchange fees.Send a personal message if you wish, please only serious offers.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5438144",
  "comments": [
    {
      "author": "alertoriole",
      "created_time": "February 05, 2023, 10:33:07 PM",
      "body": "15 percent fee for cash to crypto? not spamming but why would anyone ever pay that. it literally costs half that to get money out of sanctioned countries. anyone charging over 6 percent for cash to coins is providing a really unreasonable fee. Using escrow for cash deals as well? How would you determine if a payment had actually been made or not? More info and reasoning behind pricing would be good considering crypto for wires costs under 1 percent if kyc and up to 6 percent if not via larger p2p traders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "theskillzdatklls",
      "created_time": "February 06, 2023, 05:38:30 AM",
      "body": "Quote from: alertoriole on February 05, 2023, 10:33:07 PM15 percent fee for cash to crypto? not spamming but why would anyone ever pay that. it literally costs half that to get money out of sanctioned countries. anyone charging over 6 percent for cash to coins is providing a really unreasonable fee. Using escrow for cash deals as well? How would you determine if a payment had actually been made or not? More info and reasoning behind pricing would be good considering crypto for wires costs under 1 percent if kyc and up to 6 percent if not via larger p2p traders.You are spamming. Get a life. If you aren't interested, don't buy it. It's just an offer.How would you determine if a cash transaction took place? Have the escrow give a passphrase to the buyer. Buyer gives passphrase to seller upon receipt or it's not released. Escrow knows that the seller has the passphrase now and that things are ok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alertoriole",
      "created_time": "February 07, 2023, 06:10:27 PM",
      "body": "I'm not spamming, phrases dont validate that the cash transaction was successful. Same way with tokens(bank note serial numbers) when your collecting or giving money, shows two people met but doesn't prove that the transaction was successful and the seller able to leave with the cash. Unsure why people can't question ads without being accused of spamming.Escrow and cash deals don't make sense as theres always a risk of being robbed regardless of the scenario. You would be willing to escrow 250k cash deals? On what site? Here or p2p and what cities, happy to do some transactions if the rate can be halved at least.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}