{
  "id": "topic_5425011",
  "title": "Ummarr",
  "author": "Ummarr",
  "created_time": "December 01, 2022, 01:25:34 PM",
  "content": "When I was attempting to get into Bitcoin, I came across the term blockchain. It's difficult for me to understand the precise function and meaning of blockchain technology after searching for it on the Chrome browser, which is why I'm here.I'm new to this forum and this is my first post asking for information about blockchain. Could someone please provide me with a detailed explanation of how blockchain functions?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5425011",
  "comments": [
    {
      "author": "hosemary",
      "created_time": "December 01, 2022, 01:33:54 PM",
      "body": "In simple terms, blockchain is a public ledger including all (confirmed) bitcoin transactions that have been ever made. Thousands of copies of blockchain are kept all around the world by thousands of people. This makes bitcoin decentralized and changing or removing the transactions impossible. With this technology, transactions can be made without any need to a third party.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "December 01, 2022, 01:35:05 PM",
      "body": "Blockchain can be Proof of Work like Bitcoin or Proof of Stake like Ethereum and many altcoins. Some altcoins have other algorithms but the biggest blockchain is Bitcoin with Proof of Work.Bitcoin network is decentralized by its hashrate distribution and its full node distribution. Its network won't be stopped if one person want to do it.Altcoin networks can be stopped if their owners want to do it like Terra Classic network, Binance Smart Chain.Proof of Work for Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "salad daging",
      "created_time": "December 01, 2022, 01:42:37 PM",
      "body": "About the function of Bitcoin and Blockchain, how it works, you can trace it here, it's quite clear > https://learnmeabitcoin.com/Here's a little explanation that you can find easily maybe you can understand by reading in detail clearly how it works.I agree with hosseinimr93 about blockchain which includes or records all bitcoin transaction records in it.Explanation from Wikipedia > https://en.wikipedia.org/wiki/Blockchain",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cruxleo",
      "created_time": "December 01, 2022, 02:02:18 PM",
      "body": "Quote from: Ummarr on December 01, 2022, 01:25:34 PMWhen I was attempting to get into Bitcoin, I came across the term blockchain. It's difficult for me to understand the precise function and meaning of blockchain technology after searching for it on the Chrome browser, which is why I'm here.In simple terms, Blockchain is like a book where a business man records all his transactions. The blockchain is the database containing a record of all Bitcoin transactions from the very first. Just like a business man would record each successful transaction to a ledger for accountability, is how Bitcoin transactions are recorded on the Blockchain. Such records help a business owner to know which stock is sold, when, and of what amount. So does the Blockchain technology keep the details of Bitcoin transactions in other to avert users from double-spending their funds since each transactions are well detailed on the Blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shahrifat755",
      "created_time": "December 01, 2022, 02:36:36 PM",
      "body": "My knowledge is also little about it. But I think it practically. I just know that Blockchain is a technology of transferring digital assets form address to address. It is easy, fast and secure. this is the best way of crypto asset transaction form wallet to wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "December 01, 2022, 02:45:52 PM",
      "body": "Quote from: Ummarr on December 01, 2022, 01:25:34 PMWhen I was attempting to get into Bitcoin, I came across the term blockchain. It's difficult for me to understand the precise function and meaning of blockchain technology after searching for it on the Chrome browser, which is why I'm here.I'm new to this forum and this is my first post asking for information about blockchain. Could someone please provide me with a detailed explanation of how blockchain functions?a blockchain contains data of that crypto that is kept by many people around the world who run a node. Each block contains the data that is made when someone made a transaction like wallet address a send 1 BTC to Wallet address b. When that happen then the next block copy the information of previous block that the 1 BTC is no longer in wallet address a. To learn more about it then you should make a research in google and here's a site to start with https://www.synopsys.com/glossary/what-is-blockchain.html.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "December 01, 2022, 04:58:39 PM",
      "body": "In summary, it's pretty much just a permanent database that's add-only and doesn't remove away any data. Compared to a typical database where you can remove/delete data.Some learning material:* If you like reading articles: https://coindesk.com/learn* If you like reading books: https://theinternetofmoney.info/* If you like watching videos: https://www.youtube.com/playlist?list=PLPQwGV1aLnTuN6kdNWlElfr2tzigB9NnjSecurity related:* https://cryptosec.info* https://www.lopp.net/bitcoin-information/security.htmlIf you want to get more technical* https://github.com/bitcoinbook/bitcoinbook#chapters",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "December 01, 2022, 05:09:53 PM",
      "body": "I've also created a thread on the forum some months ago about how to become a blockchain developer, maybe you can give this a try as well in getting some important thought https://bitcointalk.org/index.php?topic=5390254.msg59560949#msg59560949 knowing about the definition of blockchain will give you more insight to understanding other applicable areas where blockchain technology can be applied in including government, industries and private sectors because it has provided a solution which no other network has given in the oast with security, privacy, immutability, decentralization and so on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anguwa",
      "created_time": "December 01, 2022, 08:11:30 PM",
      "body": "Because there is of this Blockchain technology, Bitcoin transactions are transparent and viewable by everyone in order to be safe and have a successful transaction. Based on my limited knowledge of Bitcoin and Blockchain, I can refer to Blockchain as the record place for all Bitcoin transactions that were made globally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}