{
  "id": "topic_5434974",
  "title": "BADecker",
  "author": "BADecker",
  "created_time": "January 16, 2023, 03:52:08 PMLast edit: January 19, 2023, 12:12:01 AM by BADecker",
  "content": "It seems that the powers that be are trying to rid themselves of Joe and Hunter. I don't really blame them. If you can't trust them, they simply can't be trusted.Why Was Hunter Paying Joe Biden $50k Per Month To Rent House Where Classified Documents Found?https://www.zerohedge.com/political/why-was-hunter-biden-paying-joe-50k-month-rent-house-where-classified-documents-found\"The now-52-year-old began listing the Wilmington home as his address following his 2017 divorce from ex-wife Kathleen Buhle — even falsely claiming he owned the property on a July 2018 background check form as part of a rental application,\" the Post reported.Of note, this is the same house where classified documents were found.Yet, upon closer inspection, Hunter lists the \"Monthly Rent\" as $49,910 - or roughly $550,000 for the 11 months he indicated he lived there?----------Miranda Devine@mirandadevine·FollowIn 2018 Hunter Biden claimed he owned the house where Joe Biden kept classified documents alongside his Corvette in the garage Via @jj_talking----------A Zillow search reveals that the most expensive home currently for rent in Wilmington, Delaware is going for $6,000 per month....",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434974",
  "comments": [
    {
      "author": "Die_empty",
      "created_time": "January 17, 2023, 03:13:32 AM",
      "body": "Quote from: BADecker on January 16, 2023, 03:52:08 PMIt seems that the powers that be are trying to rid themselves of Joe and Hunter. I don't really blame them. If you can't trust them, they simply can't be trusted.The hunter is now the hunted. Democrats a putting a lot of effort to tarnish that image of Donald Trump so that he wouldn't be marketable in the next presidential elections. But they also fail to understand that even in Joe Biden's political circle, there are still Trump's loyalists. These set of person act as spies that are always looking for avenues to expose the past, present or even future blunders of the current US president.Hunter Biden have been a pain in the the ass of the Biden family. His addiction to drugs and other unethical behaviors have been a tool of disdaining and attacking the President. The issue inflating his rent might be connected to tax issues. And the reason why he stayed in the house that the classified documents were discovered can be answered by only Hunter and his father.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "January 17, 2023, 06:19:05 AM",
      "body": "I'm not sure of the authenticity of these claims -- I'm skeptical because I keep hearing about this story in right wing circles/commentators but can't find anything indisputable that Hunter Biden was actually paying out that much in rent to Joe Biden. They're also claiming that Hunter Biden owned the property so it wouldn't make sense to pay out 50k/month rent if he owned the property.Could've been a way for Hunter to funnel money to Joe but surely they could not have made it so obvious. I suppose never trust a crack addict.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "January 17, 2023, 03:06:03 PM",
      "body": "Next Hunter and Joe will be denying that they were the Hunter and Joe in question.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "January 17, 2023, 04:33:38 PM",
      "body": "Quote from: BADecker on January 16, 2023, 03:52:08 PMA Zillow search reveals that the most expensive home currently for rent in Wilmington, Delaware is going for $6,000 per month.This is disturbing.  The disconnect between the amount that Hunter was paying 'The Big Guy' and the amount that he could have rented an entire home is more than just a coincidence.  It's flat out money laundering.  I find it hard to believe that any citizen engaging in such an arrangement wouldn't eventually have to explain it to the IRS or possibly Homeland Security depending on the details of the arrangement.  In any event, I think the admission that Hunter was giving Joe kickbacks, along with this $50K per month arrangement coming to light, displays that Hunter was likely involved in deals using Joe's power to earn him $6,000,000 per year, of which he kicked 'The Big Guy' $50K per month.  This should probably bother people that voted for Joe. You might want to add a \"K\" to the subject line.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "January 19, 2023, 12:11:27 AM",
      "body": "I'm just glad my rent isn't that high --- duuuuh.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}