{
  "id": "topic_5465122",
  "title": "LFC_Bitcoin",
  "author": "LFC_Bitcoin",
  "created_time": "August 30, 2023, 08:49:29 PM",
  "content": "Spot Bitcoin ETF Approval Odds Rise to 75%Following a notable victory in a recent court case against the US Securities and Exchange Commission (SEC), spot Bitcoin ETF approval odds have now risen to 75%. Specifically, Bloomberg’s Eric Balchunas noted the significance of Grayscale’s victory in court preceding the jump in odds from 65%. Grayscale has recently won its significant lawsuit against the SEC, with the court ordering the regulator to “vacate” its rejection of a spot Bitcoin ETF application. Subsequently, the move has propelled the odds of an ETF arriving this year up another 10%, with it appearing more likely by the day. Bitcoin ETF Odds Jump Again Following Grayscale VictoryThe race for the United States’ first spot Bitcoin ETF has been an interesting one. For the past several months, digital asset companies and traditional finance enterprises alike have submitted applications for the offerings. Headlined by the participation of asset management firms like BlackRock and Fidelity.Although the US has yet to approve the creation of such an offering, that is looking more likely to change. Now, the spot Bitcoin ETF approval odds have risen to 75%. Indeed, the notable increase was a result of the SEC’s most recent court defeat at the hands of Grayscale. Bloomberg’s Balchunas noted that the 75% odds are connected to a spot Bitcoin ETF approval this year. However, he added that those odds would increase to 95% by the end of 2024. Moreover, he stated that the “unanimity and decisiveness of the ruling were beyond expectations,” leaving the SEC in a difficult place. Ultimately, the oddsmakers noted that the SEC’s defeat is a sign of increased difficulty facing the regulator. Specifically stating that they “will struggle to justify further denials as it faces deals, negative PR, and Hashdex’s novel approach.” Eventually, it is ever more likely that this year will see the very first spot Bitcoin ETF approved for operations in the United States. https://watcher.guru/news/spot-bitcoin-etf-approval-odds-rise-to-75",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465122",
  "comments": [
    {
      "author": "DaveF",
      "created_time": "August 30, 2023, 09:03:24 PM",
      "body": "I have always wondered if at times organizations like the SEC play to loose so they can get some things implemented the way they want.They lost the war so to speak but they did win a battle or two. The court has now affirmed that they CAN regulate it, and they can't just reject it out of hand. So they now can always go back and show that they DO have the right to do some regulations since the court did not say they could not do it.Interesting case of double-think but I can see them using this as a stepping stone. Had they approved it, people could come back later and say they had no right to approve it or do this or that.Just my paranoid tinfoil hat theory.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "August 30, 2023, 09:18:18 PM",
      "body": "Quote from: LFC_Bitcoin on August 30, 2023, 08:49:29 PMSpot Bitcoin ETF Approval Odds Rise to 75%Bitcoin ETF Odds Jump Again Following Grayscale VictorySEC did not approve any Spot Bitcoin EFT so far in the USA. and the latest lawsuit against Grayscale does not mean SEC will approve Grayscale Bitcoin Spot ETF.The Odds rise only reflects that more chance to see a first Bitcoin Spot ETF in the USA. with approval from SEC but we just don't know when they will have to make such approval. It's interesting to see the odds rise and positive thinking in the community. I believe it will come but not in this year with only 3 months left. If it comes, it will come next year in a bull market because a first Bitcoin Spot ETF in the USA. will be a very big positive news for the market. Logically it should not come in a bear market like this year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "August 30, 2023, 09:43:51 PM",
      "body": "Quote from: LFC_Bitcoin on August 30, 2023, 08:49:29 PMBloomberg’s Balchunas noted that the 75% odds are connected to a spot Bitcoin ETF approval this year. However, he added that those odds would increase to 95% by the end of 2024. Moreover, he stated that the “unanimity and decisiveness of the ruling were beyond expectations,” leaving the SEC in a difficult place. This is important information here. Reading only the title of this thread can be misleading. Balchunas thinks it's almost certain that spot ETF will get approval, but it's a question of when not if.Also, BlackRock has an almost 100% ETF approval rate (>99.8% per quick google search) and I don't think giants like them would even bother filing for it if they didn't know it'll get approved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "August 31, 2023, 01:36:52 AM",
      "body": "Quote from: pawel7777 on August 30, 2023, 09:43:51 PMThis is important information here. Reading only the title of this thread can be misleading. Balchunas thinks it's almost certain that spot ETF will get approval, but it's a question of when not if.It is a question WHEN, not YES/ NO question. I agree with you that Bitcoin Spot EFT will be approved in the USA. People are only speculating when it will be approved a first time.QuoteAlso, BlackRock has an almost 100% ETF approval rate (>99.8% per quick google search) and I don't think giants like them would even bother filing for it if they didn't know it'll get approved.It's reason to hype the market latest months after BlackRock applied their Bitcoin Spot ETF. The hearing of US Congress against SEC Chairman Gensler and his failure to response to questions, give the crowd more belief that SEC and Gensler will have less freedom to arbitrarily regulate cryptocurrency market as well as make decisions on approvals of Bitcoin Spot ETF.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tread93",
      "created_time": "August 31, 2023, 03:05:42 AM",
      "body": "They will approve Blackrock to run it but it really should be grayscale that gets the chance to convert their trust into an ETF. I do wonder what Blackrock etf will look like though....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "August 31, 2023, 04:15:17 AM",
      "body": "Very odd how right after Blackrock said they would launch an etf. That they lost the lawsuit with XRP and now with GBTC. Pretty much a few weeks after.Seems the SEC is getting kicked in the balls and they are in trouble. I wouldn’t be surprised if one day that Gensler guy is forced to resign and it’ll be taken over by someone more fair. The decision is very soon for the blackrock etf but I am guessing it’s going to be delayed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legendbtc",
      "created_time": "August 31, 2023, 04:27:08 AM",
      "body": "The SEC cannot continue to delay the ETF, but the question is when will they approve it and whether they are trying to manipulate the market. I have also read some conspiracy theories that the SEC will accept ETFs but they need to have the right timing and people believe that halving or bull season will be more appropriate to accept ETFs. Even though the SEC lost the case, approval of ETFs is still within their discretion, not the judge's authority, so they can still find other silly reasons to continue delaying until the right time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "August 31, 2023, 05:55:32 AM",
      "body": "Quote from: tread93 on August 31, 2023, 03:05:42 AMThey will approve Blackrock to run it but it really should be grayscale that gets the chance to convert their trust into an ETF. I do wonder what Blackrock etf will look like though.... With the battle Blackrock has with the US government these days, SEC may reject theirs specifically and approve anything else if they were to approve any bitcoin spot ETF.In any case, the only thing I wonder is the effect that the approval of an ETF in USA could have on the bitcoin price, otherwise it is ETF after all and that is not the way we want bitcoin to be adopted... so it isn't really something we want to be excited about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "August 31, 2023, 07:44:05 AM",
      "body": "Quote from: pooya87 on August 31, 2023, 05:55:32 AMQuote from: tread93 on August 31, 2023, 03:05:42 AMThey will approve Blackrock to run it but it really should be grayscale that gets the chance to convert their trust into an ETF. I do wonder what Blackrock etf will look like though.... With the battle Blackrock has with the US government these days, SEC may reject theirs specifically and approve anything else if they were to approve any bitcoin spot ETF.Blackrock only had one ETF rejected ever, out of almost 600.Quote from: pooya87 on August 31, 2023, 05:55:32 AMIn any case, the only thing I wonder is the effect that the approval of an ETF in USA could have on the bitcoin price, otherwise it is ETF after all and that is not the way we want bitcoin to be adopted... so it isn't really something we want to be excited about.It is usually not the ETF approval itself that causes the price spikes and bull runs but all the lemming traders on exchanges who decide: \"Hey, this is my big day to get rich!\", open a few long positions and buy some extra bitcoins, wait for everyone to copy them, and then close the positions once they hit profit and the brakes are slammed on the ETF craze.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "August 31, 2023, 08:01:00 AM",
      "body": "Quote from: NotATether on August 31, 2023, 07:44:05 AMBlackrock only had one ETF rejected ever, out of almost 600.The situation I was referring to is not bitcoin related. It is the battle this investment management company has with the US government over their \"freedom of investment\". To put simply BlackRock wants to take their money (about $15 trillion if we count msci) to more solid economies such as China and US regime doesn't want to allow that because that would be the end of dollar hegemony and US economy. The battle is that whenever BlackRock talks to any Chinese company, US government immediately and out of nowhere places that company in their terrorist list to prevent BlackRock from taking their money out of US!So much for Economic Liberalism QuoteIt is usually not the ETF approval itself that causes the price spikes and bull runs but all the lemming traders on exchanges who decide: \"Hey, this is my big day to get rich!\", open a few long positions and buy some extra bitcoins, wait for everyone to copy them, and then close the positions once they hit profit and the brakes are slammed on the ETF craze.That's true.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blitzboy",
      "created_time": "August 31, 2023, 10:38:16 AM",
      "body": "SEC approval by Grayscale is a game-changer for the US bitcoin market. Grayscale and every other digital asset company that's fought for legitimacy and respect should celebrate. I've said for years that regulators should understand digital assets' potential, and this decision is a smack in the SEC's face.Chance 75%? Huh? Should be yes! US is sluggish to move, but BlackRock and Fidelity, two of the largest names in traditional finance, are racing. Holding back? Why? Hard to imagine! By 2024, Eric Balchunas of Bloomberg didnt make up that probability will rise from 75% to 95%. Cryptocurrency is the future, and the SEC will fall behind if they don't switch. They can no longer use outdated regulations and bureaucracy.The SEC is under pressure to explain why they're waiting. Before long, the US will have its first Bitcoin ETF. Darkness is coming, and Grayscale's success highlighted it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "August 31, 2023, 06:14:46 PM",
      "body": "If all the ETFs really approved within the 2024 then it will be a huge win before time because in my opinion the ETFs will be approved just before or after halving. Because after halving it will have more effect because there will be lesser BTC in the market and Bull run will be near to initiation and at that time if these ETFs will got green flag then those who are still wanted to buy BTC but no buying it due to traditional mindset then those people will tend to move towards BTC.There acceptance of BTC will increase more hype and the demand will be high and the price will be too.Overall it will be a win win for BTC and it might really reach $150000 in 2025. But still, I think the ETFs will be approved after the halving in next year maybe according to the news outlet as they are saying in the last quarter of 2024. Nothing confirmed here as in crypto finger must be crossed all the time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "August 31, 2023, 07:30:02 PM",
      "body": "Quote from: pooya87 on August 31, 2023, 08:01:00 AMThe situation I was referring to is not bitcoin related. It is the battle this investment management company has with the US government over their \"freedom of investment\". To put simply BlackRock wants to take their money (about $15 trillion if we count msci) to more solid economies such as China and US regime doesn't want to allow that because that would be the end of dollar hegemony and US economy. Political sympathies aside, US will care about their own interests just as China cares about theirs. Especially in a current time of possible Taiwan conflict looming ahead.I believe you're referring to BlackRock getting probed by US House Committee on investing in blacklisted Chinese entities? If so, I don't think SEC actually had anything to do with it.Quote from: NotATether on August 31, 2023, 07:44:05 AMIt is usually not the ETF approval itself that causes the price spikes and bull runs but all the lemming traders on exchanges who decide: \"Hey, this is my big day to get rich!\", open a few long positions and buy some extra bitcoins, wait for everyone to copy them, and then close the positions once they hit profit and the brakes are slammed on the ETF craze.You can't really say if it \"usually\" is or isn't an ETF approval causing bull runs, as no spot Bitcoin ETF has been approved yet. But the lemmings (aka retail investors) have way less influence than they had at the beginning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "August 31, 2023, 07:50:33 PM",
      "body": "Quote from: Faisal2202 on August 31, 2023, 06:14:46 PMThere acceptance of BTC will increase more hype and the demand will be high and the price will be too.Overall it will be a win win for BTC and it might really reach $150000 in 2025. I am not too sure if BTC spot etf approval can be said to be a \"win\" for BTC. We preach not your keys, not your coins to people, and we all know that the right way to use BTC is when you control your keys, not when another institution manages it for you. We have to wait and see what the impact of a spot etf approval in the U.S will be, it could attract institutional investors and take the price of BTC high, which will be good for speculators; but i'll still not call it a \"win\" for BTC in itself, because i can't recommend people to buy BTC through etf's that they don't control, the same way i'll never recommend storing BTC's in centralized exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "August 31, 2023, 08:16:25 PM",
      "body": "Quote from: NotATether on August 31, 2023, 07:44:05 AM\"Hey, this is my big day to get rich!\"Sure, that happens, but we've never encountered that before, so you can't know with certainty, as if a large company became heavily invested in bitcoin. We're now talking about BlackRock, probably the largest financially company in the world, attempting to apply for an ETF.I hold the belief that once bitcoin becomes integrated into the financial system, as indicated by the news, we will witness another level of bullish activity. If the system continues to advance in parallel with bitcoin, we could potentially see trillions flowing in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "September 01, 2023, 01:12:25 AM",
      "body": "Good News but what happened to the recent dump after Grayscale won the case against the SEC I mean Bitcoin ETF Approval will become a major milestone to get more investors, especially in the US Market. when this really happens I think other countries will follow to make an ETF but in this case, Europe Already had one right just hope that Mr. Gary approve this",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "September 01, 2023, 01:48:26 AM",
      "body": "Somehow it feels disappointing to read that Spot ETF could be approved by the end of 2024, it's not even sure. Excitement gone which traders must have realized is a short-lived bull. If news like this goes out after halving, it would have been one that will make spikes particularly Elon's X getting a crypto license. But the market is getting harsher, it almost gives hope to the new investors but now that it has dipped again, they will leave the market for good after losing some funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AnonBitCoiner",
      "created_time": "September 01, 2023, 01:54:25 AM",
      "body": "Yes, I read this news yesterday and First spot ETF approvals is possible very soon. SEC wants every firm works according to their wish and very possible that SEC will try to regulate the Bitcoin ETF even after it launched successfully. Congratulations to grayscale for winning case. currently Blackrock and other big companies like Vanceck, Wisdomtree applied for Bitcoin ETF and SEC has not approved anyone application. I don't think SEC will accept application this years because SEC is postponing every time and as far i think all application will be approved near Bitcoin halving and this will be new revolution in Bitcoin price..In short term Spot Bitcoin approval is positive and and will bring more investors and fame to btc. bull season is not away after these application accept but I think in long term Bitcoin ETF will not give any positive results because people will not hold real btc which we store in our wallet and this will be same as CEX and we already warned that without holding in our own wallet we haven't full control over our btc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "September 01, 2023, 01:59:28 AM",
      "body": "Quote from: dansus021 on September 01, 2023, 01:12:25 AMGood News but what happened to the recent dump after Grayscale won the case against the SEC I mean Bitcoin ETF Approval will become a major milestone to get more investors, especially in the US Market. when this really happens I think other countries will follow to make an ETF but in this case, Europe Already had one right just hope that Mr. Gary approve this It's logic to say that the USA. has to follow European countries in approval of Bitcoin Spot ETF. In Europe, the first Bitcoin Spot ETF was approve months ago and it is a big milestone for Bitcoin.Latest changes in the USA. with more challenges on power of SEC and Gensler give us more hope that that nation will have its first Bitcoin Spot ETF.Gensler will have to be testimonies in US Congress twice in this September. He will have to come to the Congress with lot of fear like a latest time he came there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}