{
  "id": "topic_5500043",
  "title": "mk4",
  "author": "mk4",
  "created_time": "June 16, 2024, 04:32:50 AMLast edit: July 01, 2024, 06:18:08 PM by mk4",
  "content": "First, some context: I am in no way a Bitcoin maximalist — I think there's some value outside of Bitcoin, but ultimately BTC is my 'main' crypto holding and every profit I make with altcoins has always been exchanged back into BTC.In crypto bull markets, the common opinion is that in a full-blown bull market, pretty much everything goes up unison. This is based on crypto's general performance back in the last bull market of 2017.The thing is, people seem to expect the same thing in this cycle. Do I think it will be the same whereas pretty much everything goes up? I don't think so. Capital and attention are too spread out and too diluted.Compared to 2017 — as if we didn't have so many coins/tokens already back then, we have far more coins and tokens now; we're talking huge multiples more coins/tokens. Money will be too spread out this cycle that price pumps will likely be heavily suppressed.I and a lot of people here frequently say that BTC is the better pick for the masses(which has always been true), but regardless, I'm usually only like 10% BTC overall most of the time because I like risk and I have been historically successful with picking altcoins. But this cycle? I have far fewer altcoin holdings and am more concentrated on BTC as the r/r has gotten worse with altcoins, and I think a lot of people will be disappointed — regardless if we generally continue to go up or not.Will there still be altcoins that will achieve huge multiples? There will always be such altcoins.Will I be right? Maybe, maybe not. Time will tell.EDIT 1:Quote from: mk4 on June 18, 2024, 08:28:19 AMUpdate: Quite lucky with the timing. I started the first batch of my shorts(L2s) on the 28th of May, while at the same time having an equal amount of longs with majors(BTC/ETH/SOL, mostly BTC. only have a smaller amount of ETH and SOL as a bet on the ETFs).As of today, the L2s are down bigly while the majors are just down slightly(except for SOL). Up quite a good amount; will continue holding my position.EDIT 2:Quote from: mk4 on July 01, 2024, 06:16:26 PMUpdate: so far so good as the trade is going well. Long majors(+TON), short L2s, and a few L1s that are pretty dead in terms of activity.Currently up 200% ish. Will my trade continue to go well? Maybe, maybe not. Let's see.List is sorted by position size.Obviously, red = short, green = long.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5500043",
  "comments": [
    {
      "author": "Churchillvv",
      "created_time": "June 16, 2024, 05:52:54 AM",
      "body": "Few days ago we argued about some kind of percentage of altcoins that are decent and the in decent ones, where you said over 50% where decent. Of course I took a tour on your platform and I happened to me amazed with the huge number of Airdrops for coins/tokens but that kept me wondering so how many do one need to participate on? with the number of coins/token I'm confused where to go and this is one of the main reasons I have always stocked with bitcoin, causing less stress for myself. Regardless, anyone can pick altcoins (shitcoins) and make it out with them but the current situation of this bull run in my opinion is a good reason that people should concentrate more on bitcoin, having at least 85 -90 % of their assets in bitcoin, than spread their attention in what may not end well. the 2017 bullrun is definitely different from 2024.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "June 16, 2024, 06:22:07 AM",
      "body": "The cycle that has always been the path that bitcoin and other cryptocurrencies trail on have changed recently, but only those that have experienced and seen how the previous cycles took place, made some profits from them through potentials they’ve seen in some tokens can really understand it. We are all focus on the bull run and expect most of the tokens (altcoins) to do some multiples like before but the truth is everyone in the market have learnt a lot and are +1 smarter.Those that lost more money the last time in investing in shit projects don’t longer do that. Everyone have come to realize how the market works and they don’t just put money where they won’t be profitable. The bull run will come but the expectations shouldn’t be high like before on those altcoins. As for bitcoin, it can still be dependable on if you want some profits and not be at loss totally at the time of bull run. Not everyone that preaches bitcoin are its maximalist, but it’s always consider better amongst the rest which is just the fact about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "June 16, 2024, 06:26:45 AM",
      "body": "Quote from: mk4 on June 16, 2024, 04:32:50 AMFirst, some context: I am in no way a Bitcoin maximalist — I think there's some value outside of Bitcoin, but ultimately BTC is my 'main' crypto holding and every profit I make with altcoins has always been exchanged back into BTC.There really is some profit outside bitcoin however these altcoins are just way too volatile and risky than bitcoin so it is more difficult to reach your target profit while also making sure that you are not losing anything.QuoteThe thing is, people seem to expect the same thing in this cycle. Do I think it will be the same whereas pretty much everything goes up? I don't think so. Capital and attention are too spread out and too diluted.Compared to 2017 — as if we didn't have so many coins/tokens already back then, we have far more coins and tokens now; we're talking huge multiples more coins/tokens. Money will be too spread out this cycle that price pumps will likely be heavily suppressed.Exactly. There are way too many subsections under altcoins now all with different purposes. In one blockchain alone, there are so many projects associated so it is harder now to penetrate through the market.Here will come the important decision of choosing the right altcoin because not all altcoins will feel an increase in price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "June 16, 2024, 06:27:17 AM",
      "body": "The problem is to find the alts that will make good multipliers this cycle. Just because you have had good results in the past does not guarantee future results, and in any case you seem to know more about it than the average buyer of alts. Concentrating on Bitcoin as I do is because it provides a mix of profitability and security. It is not going to do x100 this cycle as some altcoins will, but it has almost no risk of going to zero, as such alts do. Apart from an ethical issue, I prefer to support a decentralized mechanism than a centralized alts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "June 16, 2024, 07:41:48 AM",
      "body": "Quote from: Churchillvv on June 16, 2024, 05:52:54 AMOf course I took a tour on your platform and I happened to me amazed with the huge number of Airdrops for coins/tokens but that kept me wondering so how many do one need to participate on? with the number of coins/token I'm confused where to go and this is one of the main reasons I have always stocked with bitcoin, causing less stress for myself.This thread is specifically about spot coin/token portfolio allocation, not airdrop farming, but yea airdrops have a different risk:reward profile as compared to buying coins/tokens for your portfolio.And yea, it's quite a lot, but I personally do this full time so I'm not really that overwhelmed. You don't need to participate in everything just like how you don't need to buy every hot altcoin in existence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "June 16, 2024, 07:45:13 AM",
      "body": "The concept of bitcoin/altcoin is similar to different views of religion and different types of governments.Each one person has their own view on crypto and they are free to create something new from it and thus the emergence of altcoins. But time has shown us that each and every altcoin is not worth putting your money in. On the other hand bitcoin has out performed itself and is essentially enough to cover the needs.Year by year have passed, I have watched from 2015, and it all cycles back, altcoins suck and bitcoin dominates.Hence it is good enough to keep a little bit on altcoins but keeping the maximum in bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "June 16, 2024, 08:13:07 AM",
      "body": "Quote from: mk4 on June 16, 2024, 04:32:50 AMI and a lot of people here frequently say that BTC is the better pick for the masses(which has always been true), but regardless, I'm usually only like 10% BTC overall most of the time because I like risk and I have been historically successful with picking altcoins. But this cycle? I have far fewer altcoin holdings and am more concentrated on BTC as the r/r has gotten worse with altcoins, and I think a lot of people will be disappointed — regardless if we generally continue to go up or not.Will there still be altcoins that will achieve huge multiples? There will always be such altcoins.Will I be right? Maybe, maybe not. Time will tell.Year after year there are more and more altcoin choices, but this also makes us divide our portfolios more widely and the risk will no longer be as guaranteed as before in terms of returns. Some of the projects currently being built are only limited to games so that Bitcoin remains the main choice to be on a safe path in terms of risk. I agree that currently there are fewer altcoin holdings, it is difficult to choose, but if you want to go deeper and focus on seeking profits then we are already faced with the altcoin trend cycle of AI, Game, DeFi, Layer2 etc. Even that is not easy without in-depth research.As a result, I, who don't really like risk, and decided to stay in Bitcoin in the long term. Leaving more of my finances in Bitcoin, because the results have been proven over the years to never disappoint.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "June 16, 2024, 08:18:45 AM",
      "body": "There are countless projects popping up everywhere whether it's in ETH, SOL, or other L2s of different main chains. We should remember that the value of such projects is given by the ones who hold on to it and the demand of the certain project. There would always be altcoins that would rise in price and it's up to the person investing to look out for this. Another thing to consider is that the coins in the cryptocurrency space are affected by BTC prices. So whether or not a coin goes up or down, the majority are following the trend of BTC.I agree that we will see it as time continues.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "June 16, 2024, 08:23:06 AM",
      "body": "Quote from: mk4 on June 16, 2024, 04:32:50 AMWill there still be altcoins that will achieve huge multiples? There will always be such altcoins.Will I be right? Maybe, maybe not. Time will tell.Right now there are big expectations from ETH ETF, for example.But Bitcoin bull run is also here and I also think that, no matter what other coins people are speculating on, this year is still about trying to squeeze as much gains as possible from (the expected) Bitcoin price rise.So for now, indeed, it's all about stacking sats.There's only one thing I don't agree with you, OP. And that's the placing of this topic under Bitcoin Discussion. Imho it's more worthy to Speculation..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luzin",
      "created_time": "June 16, 2024, 08:45:18 AM",
      "body": "Quote from: TheUltraElite on June 16, 2024, 07:45:13 AMHence it is good enough to keep a little bit on altcoins but keeping the maximum in bitcoin.There are new changes, I start trading maybe the same as yours in 2015. New altcoins dominate with new projects. Some Altcoins used to always be able to survive and come back beyond the ATH that was ever created. But right now it seems difficult, probably because of the many new Altcoins created. Keeping most of it on Bitcoin is good enough, but we have to have more patience. Bitcoin is quite different from Altcoins, but so far it has been very promising. This condition is also what makes me want to continue to increase the amount of BTC by trading BTC Altcoin pairs instead of multiplying Altcoins. Right now I'm waiting for Bitcoin to reach a new price better, hopefully that happens because we've already reached a new ATH but it hasn't met my target yet. Hopefully this Bitcoin Price cycle will not change.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mrbluntzy",
      "created_time": "June 16, 2024, 08:53:11 AM",
      "body": "The bull Run may be suppressed  for most altcoins because money is far spread into many altcoins, that's what you said and you are very correct but definitely there are some altcoins that will pump but because of too many altcoins that are already looking so promising, it will be a  difficult to easily know the coin that can follow the trend of the bull market. I am just trying my luck on too many altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "June 16, 2024, 08:57:35 AM",
      "body": "Altcoins is just for making money, while Bitcoin is for store of value, that's why most people suggest to invest in Bitcoin because it will not disappoint you in the future.Since choosing the right altcoins is as hard as trading, where only 5%-10% people are successful, that's why people should focus on real life job that have higher chance to be successful than \"gambling\" (altcoins and trading).There's always be someone who're successful in \"something\", just like gambling. Most people know casino has house edge and it's bad for someone that want to make money on there, but there's always a person can beat the house, the thing is it might be only 1 from 100,000 gamblers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "B1-66ER",
      "created_time": "June 16, 2024, 09:08:55 AM",
      "body": "BTC>There is no second best —Saylor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 16, 2024, 11:19:22 AM",
      "body": "Quote from: B1-66ER on June 16, 2024, 09:08:55 AMBTC>There is no second best —Saylor.says the guy(saylor) that promotes another network(lightning)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "June 16, 2024, 12:24:33 PM",
      "body": "As everyone knows, at certain times altcoins boom, and when they do that they gain a lot more than Bitcoin because they are tiny. But anytime the market goes sideways or down, altcoins often lose all of their gains while Bitcoin stays at a decent price.After Bitcoin broke out of the bear market early last year and pumped, there was the normal half-year sideways / slightly down action for bitcoin, but many altcoins lost an enormous amount of their value and went back down to around where they were at the bottom of the market.And now again, while Bitcoin is consolidating and accumulating for a few months, staying in the $60,000s, many altcoins have lost a ton of value.Basically, altcoins are ONLY good when the market is actually pumping hard. As soon as the market stops pumping altcoins start dropping like rocks even as Bitcoin is steady. This is why altcoins are very dangerous. You can make tons of gains in a few months with them, but if you are still in them when the pump ends literally all your gains can be washed out while Bitcoin goes sideways. You can be waiting many months for altcoins to get back to where they were, and when they do Bitcoin will be far higher than it was at that previous point. Long term all altcoins go to zero against Bitcoin.This is why it is best just to stay away from altcoins entirely.And yes in 2017 altcoins were a lot more successful in that year than they are these days because that was the ultimate retail FOMO bull market. The whole world heard about Bitcoin for the first time and the retail market expanded several times over in the course of just that year. People were FOMOing into not just Bitcoin but everything. Ever since then, or specifically since 2018 when the world (people who had first heard about bitcoin in 2017) experienced their first crypto bear market, people have felt burned by bitcoin and crypto because they panic sold and loss money, or those who didn't get in are too scared to ever get in because \"it always crashes\". So ever since then, and continuing into the future, retail FOMO is much less intense than that first time people were hearing about bitcoin and crypto and seeing everyone get rich quick. Much more subdued retail FOMO means altcoins have far less interest and when there is a bout of altcoin FOMO it doesn't last long. In 2021 there was a few months of retail FOMO from Musk followers some of whom got into Bitcoin but most just poured money into meme tokens and most of those people will never get their money back. Retail FOMO is gonna get smaller and smaller every cycle. But institutional adoption and TradFi adoptoin is just getting started and will grow much larger, and those participants are going to be mostly interested in Bitcoin, somewhat interested in Ethereum, and have very little interest in any other crypto.Best to just stay out of altcoins entirely and stick with Bitcoin, or at most if you do trading, briefly trade altcoins for a few weeks once a pump starts and then get out before the pump ends and they crash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RockBell",
      "created_time": "June 16, 2024, 03:06:34 PM",
      "body": "Quote from: Poker Player on June 16, 2024, 06:27:17 AMThe problem is to find the alts that will make good multipliers this cycle. Just because you have had good results in the past does not guarantee future results, and in any case you seem to know more about it than the average buyer of alts. Concentrating on Bitcoin as I do is because it provides a mix of profitability and security. It is not going to do x100 this cycle as some altcoins will, but it has almost no risk of going to zero, as such alts do. Apart from an ethical issue, I prefer to support a decentralized mechanism than a centralized alts. Their is always a reason why they always ask people to stick to bitcoin since bitcoin is like the king and also the one that drives the market for for years we know how bitcoin operates. And no matter how bad the market is bitcoin will always survives and one thing have noticed about bitcoin is how it recovers and other altcoins have to wait for bitcoin to recover before other altcoins follows so for me is still bitcoin for sure. And if any other person wants to give a try on altcoins is also not a bad ideas but as for me I will continue to go fully on bitcoin. And will continue to accumulate until my goal is meet and continue that way. History is only made reference to because their won't be assurance that what happened previously will happen again. Yeah bitcoin is more secured. Alts can actually go zero ftx  is still one of the examples so when deciding we should know what we are going for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "June 16, 2024, 04:36:45 PM",
      "body": "Quote from: mk4 on June 16, 2024, 04:32:50 AMWill there still be altcoins that will achieve huge multiples? There will always be such altcoins.Yeah, there will always be such altcoins that will achieve huge multiples, but for me, i don't know how big the numbers were previously. Did just a few altcoins achieve this, but so many people then forgot about the majority that failed and started telling success stories with the few that succeeded.Altcoins are very tricky and i try to stay away from them, even if i know that a few of them can achieve very high prices, but what if all of the ones i buy fail. BTC is just the best choice, for almost every reason.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GbitG",
      "created_time": "June 16, 2024, 07:13:04 PM",
      "body": "Hmm well to be honest the reason why the flow of the money is heavily spread this time around is because of new investors coming into the market who are mostly into cryptocurrencies or tokens that can give them huge returns in less time which isn't the case with Bitcoin.We know that Bitcoin is the best among all the cryptocurrencies existing in the market, but we can't deny the fact that it isn't the best option when it comes to quick profits due to its extremely high value, and when the value of an asset gets this high, it tends to have a slower pace gaining or losing value which is the case with Bitcoin.So it's natural for people to invest their money in altcoins since they are running behind short term profits and aren't into safety of their funds, mostly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "doomloop",
      "created_time": "June 16, 2024, 07:22:33 PM",
      "body": "Quote from: TheUltraElite on June 16, 2024, 07:45:13 AMThe concept of bitcoin/altcoin is similar to different views of religion and different types of governments.Each one person has their own view on crypto and they are free to create something new from it and thus the emergence of altcoins. But time has shown us that each and every altcoin is not worth putting your money in. On the other hand bitcoin has out performed itself and is essentially enough to cover the needs.Year by year have passed, I have watched from 2015, and it all cycles back, altcoins suck and bitcoin dominates.Hence it is good enough to keep a little bit on altcoins but keeping the maximum in bitcoin.Or better say the concept of all currencies and this is why Bitcoin and Altcoins are created because Satoshi Nakamoto (the creator of first crypto, Bitcoin) seem to disagree on what Banks' own currency called Fiats has to offer. After the creation of Bitcoin, there are still Devs, or people who seem to disagree with it and that is why Altcoins are born.It is easy to express their opinions by creating a crypto here because of its nature, or the technology that it is using called the Blockchain. Even though there are plenty of Altcoins, indeed that not all of them are worth it and that is why Bitcoin still continues to dominate even if it's only a single cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}