{
  "id": "topic_5473311",
  "title": "General_Bitcoin",
  "author": "General_Bitcoin",
  "created_time": "November 08, 2023, 08:17:49 AM",
  "content": "I recently study about few wallets and then download Electrum with first deposit works fine but as I send my first withdraw it's stuck in for last three days now I already increase fees three times, but it's not working.Today fourth time I increase fees which is now 5612 Satoshi $1.98 40.0 sat/vB it's nearly two hours lurking in last three blocks but still not having 1st confirmation any solution or guideline for this could be appreciated.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473311",
  "comments": [
    {
      "author": "Zaguru12",
      "created_time": "November 08, 2023, 08:19:17 AM",
      "body": "This is probably because the mempool has been congested since the last few days and probably you use a transaction fee that’s low even with the 40sats/vbyte your transaction fee is still low, check  https://mempool.space/ for fee estimation and set your transaction fee above the high priority and you could get your transaction confirmed in the next block Another great fee estimator again is  https://mempool.jhoenicke.de/#BTC,24h,weight",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "November 08, 2023, 08:20:00 AM",
      "body": "The fees are skyrocketing because of ORDINALS and Binance listing Ordinal token, if I'm not mistaken.With 40 sat/byte you should expect your transaction to get confirmed soon, or you can increase the fees a bit more. See here: https://mempool.space/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "General_Bitcoin",
      "created_time": "November 08, 2023, 08:25:07 AM",
      "body": "Quote from: OmegaStarScream on November 08, 2023, 08:20:00 AMThe fees are skyrocketing because of ORDINALS and Binance listing Ordinal token, if I'm not mistaken.With 40 sat/byte you should expect your transaction to get confirmed soon, or you can increase the fees a bit more. See here: https://mempool.space/I am watching this pool for last 1 hour, and it's showing 29 minutes left but as its jump in second last pool after few minutes I have back this on third pool its doing this for last two hours just because of this now I post this and want to know is this normal its lurking around here for last 2 hours.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "November 08, 2023, 08:29:02 AM",
      "body": "Quote from: General_Bitcoin on November 08, 2023, 08:17:49 AMToday fourth time I increase fees which is now 5612 Satoshi $1.98 40.0 sat/vB it's nearly two hours lurking in last three blocks but still not having 1st confirmation any solution or guideline for this could be appreciated.If you increased the fee to the 25sat range yesterday itself then your transaction could have been confirmed because there were times when 21sat TX was included in the blocks for a while.Even now your TX will be included in the next block if you can increase the fee to 45sat/vb or you have to wait longer cuz the network is highly congested and often fee sky rockets to 100sat/vb.Look at this chart to know where your TX is queue: https://jochen-hoenicke.de/queue/#BTC,2h,weightOr just use https://mempool.space/ for a simplified view.Quote from: General_Bitcoin on November 08, 2023, 08:25:07 AMQuote from: OmegaStarScream on November 08, 2023, 08:20:00 AMThe fees are skyrocketing because of ORDINALS and Binance listing Ordinal token, if I'm not mistaken.With 40 sat/byte you should expect your transaction to get confirmed soon, or you can increase the fees a bit more. See here: https://mempool.space/I am watching this pool for last 1 hour, and it's showing 29 minutes left but as its jump in second last pool after few minutes I have back this on third pool its doing this for last two hours just because of this now I post this and want to know is this normal its lurking around here for last 2 hours.The estimated time is based on the current network congestion but no one knows what fees will be used in the upcoming TX so it's normal to hang around at 2 blocks from the tip region in these situations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "November 08, 2023, 08:30:30 AM",
      "body": "Quote from: General_Bitcoin on November 08, 2023, 08:25:07 AMI am watching this pool for last 1 hour, and it's showing 29 minutes left but as its jump in second last pool after few minutes I have back this on third pool its doing this for last two hours just because of this now I post this and want to know is this normal its lurking around here for last 2 hours.There is nothing wrong with the transaction is just that with the highest priority estimated at 47sats/vbyte, the miners are prioritizing transactions with higher fee than your own set at 40sats/vbyte if you’re in a hurry to receive the transaction i would advice bumping the fee again a little more and you could get it into the next block to be mined",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God Of Thunder",
      "created_time": "November 08, 2023, 08:31:57 AM",
      "body": "Quote from: General_Bitcoin on November 08, 2023, 08:17:49 AMToday fourth time I increase fees which is now 5612 Satoshi $1.98 40.0 sat/vB it's nearly two hours lurking in last three blocks but still not having 1st confirmation any solution or guideline for this could be appreciated.You still need to increase it a little more so your transaction can be added to the next block. I just saw a new block was generated and the Low priority transactions are 40 sat/vB for now. Still, it will be better to increase it to 45 to 50 sat/vB.Quote from: OmegaStarScream on November 08, 2023, 08:20:00 AMThe fees are skyrocketing because of ORDINALS and Binance listing Ordinal token, if I'm not mistaken.Exactly. Binance announced they would list a token named Ordinals (ORDI) and it has been skyrocketing since then. A lot of Bitcoin users are unaware of why the transaction fees increased dramatically. https://decrypt.co/204724/bitcoin-ordinals-daily-trading-hits-6-month-peak-ordi-token-surges-binance-listing",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "General_Bitcoin",
      "created_time": "November 08, 2023, 08:37:32 AM",
      "body": "Quote from: Learn Bitcoin on November 08, 2023, 08:31:57 AMQuote from: General_Bitcoin on November 08, 2023, 08:17:49 AMToday fourth time I increase fees which is now 5612 Satoshi $1.98 40.0 sat/vB it's nearly two hours lurking in last three blocks but still not having 1st confirmation any solution or guideline for this could be appreciated.You still need to increase it a little more so your transaction can be added to the next block. I just saw a new block was generated and the Low priority transactions are 40 sat/vB for now. Still, it will be better to increase it to 45 to 50 sat/vB.Quote from: OmegaStarScream on November 08, 2023, 08:20:00 AMThe fees are skyrocketing because of ORDINALS and Binance listing Ordinal token, if I'm not mistaken.Exactly. Binance announced they would list a token named Ordinals (ORDI) and it has been skyrocketing since then. A lot of Bitcoin users are unaware of why the transaction fees increased dramatically. https://decrypt.co/204724/bitcoin-ordinals-daily-trading-hits-6-month-peak-ordi-token-surges-binance-listingCurrently, I am watching this https://mempool.space/ as my transaction is staying in last and second last block due 40 sat/vB and last block is having 42 sat/vB, but sadly I can't increase my fees as it's already empty due to four times increase and low funds know how much time needed for having first confirmation as its staying here for 2 hours.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "November 08, 2023, 08:38:58 AMLast edit: November 08, 2023, 08:58:51 AM by Charles-Tim",
      "body": "Quote from: General_Bitcoin on November 08, 2023, 08:17:49 AMToday fourth time I increase fees which is now 5612 Satoshi $1.98 40.0 sat/vB it's nearly two hours lurking in last three blocks but still not having 1st confirmation any solution or guideline for this could be appreciated.The mempool is around 46 sat/vbyte now, the transaction may likely be confirmed if you can be patient, but you can use ViaBTC free accelerator.You can also use https://www.viabtc.com/tools/txaccelerator/ free accelerator. All you have to do is to copy the txid of your transaction and submit it. But your transaction should not be more than 500 bytes in size.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "General_Bitcoin",
      "created_time": "November 08, 2023, 08:44:09 AM",
      "body": "Quote from: Charles-Tim on November 08, 2023, 08:38:58 AMQuote from: General_Bitcoin on November 08, 2023, 08:17:49 AMToday fourth time I increase fees which is now 5612 Satoshi $1.98 40.0 sat/vB it's nearly two hours lurking in last three blocks but still not having 1st confirmation any solution or guideline for this could be appreciated.The mempool is around 46 sat/vbyte now, the transaction may likely be confirmed if you can be patient, but you can use ViaBTC free accelerator.You can also use https://www.viabtc.com/tools/txaccelerator/ free accelerator. All you have to do is to copy the txid of your transaction and submit it. But your transaction should not be more than 500 kilobytes in size.Thanks for your this new link which is giving me more information about this all with currently still it's staying on second last block, and I am waiting patiently to have confirmation.My transaction is having Weight ‎561 WU so is this ok for copying and pasting here ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "November 08, 2023, 08:44:33 AM",
      "body": "Quote from: General_Bitcoin on November 08, 2023, 08:37:32 AMbut sadly I can't increase my fees as it's already empty due to four times increase and low funds know how much time needed for having first confirmation as its staying here for 2 hours.In electrum you have two options while use bump fee which is Preserve payment and decrease paymentby default, it will be in preserve payment while the fee needed for RBF will be used from wallet balance and if your wallet has zero balance then you can switch to decrease payment which will take the required fee from the Transacted value and broadcast the remaining balance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "November 08, 2023, 08:53:45 AM",
      "body": "Quote from: General_Bitcoin on November 08, 2023, 08:44:09 AMMy transaction is having Weight ‎561 WU so is this ok for copying and pasting here ?Yes, you can use free ViaBTC free accelerator. Your transaction virtual size is around 140 vbyte and its size must be less than the maximum size of 500 bytes. If you submit your transaction to ViaBTC accelerator, they will include your transaction in the next block they will mine. They have around 10% of the total hash power and it's estimated that they mine 1 block in every 100 minutes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "November 08, 2023, 08:59:35 AM",
      "body": "Quote from: Charles-Tim on November 08, 2023, 08:38:58 AMThe mempool is around 46 sat/vbyte now, the transaction may likely be confirmed if you can be patient, but you can use ViaBTC free accelerator.You can also use https://www.viabtc.com/tools/txaccelerator/ free accelerator. All you have to do is to copy the txid of your transaction and submit it. But your transaction should not be more than 500 kilobytes in size.I don’t think this will workout that much because OP is looking desperate, if we check the viabtc they only accept 100 transactions for free acceleration and there is no guarantee that viabtc will mine any of the next few block and would even include his transaction into them. The best way is to be patient or just bump the fee a little",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "November 08, 2023, 09:04:04 AM",
      "body": "Quote from: Zaguru12 on November 08, 2023, 08:59:35 AMI don’t think this will workout that much because OP is looking desperate, if we check the viabtc they only accept 100 transactions for free acceleration and there is no guarantee that viabtc will mine any of the next few block and would even include his transaction into them. The best way is to be patient or just bump the fee a littleLeft to OP. ViaBTC mined the last 15th block, which means for the mining pool to mine the next block is higher and I will not be surprised if the mining pool mine one of the next blocks soon. If OP accelerate the transaction, he can check if ViaBTC has mine a block from here: https://mempool.space/blocksI will advice him to accelerate the transaction and wait. But if he needs the transaction to get confirmed faster, he can increase the fee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "November 08, 2023, 09:13:57 AM",
      "body": "Quote from: Zaguru12 on November 08, 2023, 08:59:35 AMI don’t think this will workout that muchI have used ViaBTC free accelerator many times and I can confirm that it works. Quote from: Zaguru12 on November 08, 2023, 08:59:35 AMif we check the viabtc they only accept 100 transactions for free accelerationThey accept 100 transactions per hour for free acceleration. Quote from: Zaguru12 on November 08, 2023, 08:59:35 AMThe best way is to be patient or just bump the fee a littleI expect OP's transaction to be confirmed soon normally, but there is no harm if he/she submit his/her transaction to ViaBTC free accelerator, as it definitely increases the chance of getting confirmation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "November 08, 2023, 09:22:25 AM",
      "body": "Quote from: hosseinimr93 on November 08, 2023, 09:13:57 AMQuote from: Zaguru12 on November 08, 2023, 08:59:35 AMif we check the viabtc they only accept 100 transactions for free accelerationThey accept 100 transactions per hour for free acceleration. @Zaguru12I do not really understand the 100 transaction that you pointed to. Maybe you mean that General_Bitcoin may not be able to use the free accelerator as the 100 free transactions would have been used up by people every hour as it was before like a year or two years ago. That was before, when the rule of any transaction more than 500 byte will not be accelerated, the congestion disappeared on ViaBTC. Hardly will you see 30 transactions that is accelerated freely every hour on ViaBTC. I use it often in time like this, it is always not congested.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "November 08, 2023, 09:31:31 AM",
      "body": "Quote from: Charles-Tim on November 08, 2023, 09:22:25 AM@Zaguru12I do not really understand the 100 transaction that you pointed to. Maybe you mean that General_Bitcoin may not be able to use the free accelerator as the 100 free transactions would have been used up by people every hour as it was before like a year or two years ago. That was before, when the rule of any transaction more than 500 byte will not be accelerated, the congestion disappeared on ViaBTC. Hardly will you see 30 transactions that is accelerated freely every hour on ViaBTC. I use it often. Always not congested.I was actually pointing out at that 100 free transactions per hour and with the congestion on the mempool maybe it could also get congested since other people would like to use that also. Just checking the site now ut hasn’t even dropped below 90 free transactions left since, so probably that size reduction did reduce the entry numbers then. One thing is if they pick the first hundred is that what will be added to the next block they mine? Say they mine a block in two hours space and the free entry is above 100 since every 100 is an hour (although not realistic since they don’t get that number too often), also do there cooperate mining pools also help them include the free transactions into their bocks or it is for paid services only",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "November 08, 2023, 09:37:02 AM",
      "body": "Quote from: Zaguru12 on November 08, 2023, 09:31:31 AMOne thing is if they pick the first hundred is that what will be added to the next block they mine? Say they mine a block in two hours space and the free entry is above 100 since every 100 is an hour (although not realistic since they don’t get that number too often), also do there cooperate mining pools also help them include the free transactions into their bocks or it is for paid services only As long as your transaction is accelerated and show successful without no other error, it would be accelerated and be confirmed when ViaBTC mine a block.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "General_Bitcoin",
      "created_time": "November 08, 2023, 09:52:36 AM",
      "body": "Quote from: Charles-Tim on November 08, 2023, 09:37:02 AMQuote from: Zaguru12 on November 08, 2023, 09:31:31 AMOne thing is if they pick the first hundred is that what will be added to the next block they mine? Say they mine a block in two hours space and the free entry is above 100 since every 100 is an hour (although not realistic since they don’t get that number too often), also do there cooperate mining pools also help them include the free transactions into their bocks or it is for paid services only As long as your transaction is accelerated and show successful without no other error, it would be accelerated and be confirmed when ViaBTC mine a block.I really appreciate your all suggestions and helpful knowledgeable tips as well which will help me in near future with this advantage I just check my transaction having first confirmation, and now I understand few new things as well.For the better understanding about blockchain and this wallet Electrum what is the best way if anyone can guide this could be also appreciated thanks again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "November 08, 2023, 10:02:53 AM",
      "body": "Quote from: General_Bitcoin on November 08, 2023, 09:52:36 AMFor the better understanding about blockchain and this wallet Electrum what is the best way if anyone can guide this could be also appreciated thanks again. I would say you learn experience, so as you continue to use the wallet more often you will be able to gather more knowledge about it, to get some few guides about electrum you can read this there newbie guide,  https://electrum.readthedocs.io/en/latest/index.html, but be rest assured that experience is the best teacher, once you get confused you can search using the forum search button whether such cases has happened before if don’t see any create a thread and there are capable members here that would help you out, that is the beauty of this forum. As for bitcoin blockchain entirely you can look into this site  https://learnmeabitcoin.com/ or read this mastering bitcoin book",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}