{
  "id": "topic_5453870",
  "title": "devil-soul",
  "author": "devil-soul",
  "created_time": "May 24, 2023, 12:10:34 PM",
  "content": "Buon giorno ho visto qualche tempo fa che la gestione di metamask e passata a una nuova società consensys che richiede una nuova accettazione del regolamento praticamente dicono che registrano gli ip ed eventualmente l indirizzo eth e il tipo di transazione e si riservano in futuro di chiedere kyc, è da abbandonare immediatamente e usare un altro wallet?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453870",
  "comments": [
    {
      "author": "mendace",
      "created_time": "May 24, 2023, 06:02:33 PM",
      "body": "Quote from: devil-soul on May 24, 2023, 12:10:34 PMBuon giorno ho visto qualche tempo fa che la gestione di metamask e passata a una nuova società consensys che richiede una nuova accettazione del regolamento praticamente dicono che registrano gli ip ed eventualmente l indirizzo eth e il tipo di transazione e si riservano in futuro di chiedere kyc, è da abbandonare immediatamente e usare un altro wallet?Non saprei consigliarti perché ho abbandonato tutte le crypto eccetto Bitcoin ormai è più di un anno che mi concentro solo ed esclusivamente a quello e quindi non seguo gli sviluppi di altro, ma non ho mai amato metamask se proprio ti dovessi consigliare ti direi my Ether wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "May 25, 2023, 07:10:02 PM",
      "body": "Quote from: devil-soul on May 24, 2023, 12:10:34 PMBuon giorno ho visto qualche tempo fa che la gestione di metamask e passata a una nuova società consensys che richiede una nuova accettazione del regolamento praticamente dicono che registrano gli ip ed eventualmente l indirizzo eth e il tipo di transazione e si riservano in futuro di chiedere kyc, è da abbandonare immediatamente e usare un altro wallet?nel dubbio, esporta le chiavi private (è possibile senza complicazioni allo stato attuale) e importale poi su un altro wallet... Potrebbero sempre fare un aggiornamento per rimuovere questa funzione e poi essere troppo tardi ....  con tutto ciò che ne consegue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "^BuTcH^2",
      "created_time": "May 25, 2023, 08:24:34 PM",
      "body": "Azz... prima ledger live e adesso pure metamask, un consiglio su dove mettere eth e shitcoin varie?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "May 26, 2023, 06:32:16 AM",
      "body": "Quote from: ^BuTcH^2 on May 25, 2023, 08:24:34 PMAzz... prima ledger live e adesso pure metamask, un consiglio su dove mettere eth e shitcoin varie?nella spazzatura?  eheheh scherzo ... (più o meno...) la soluzione è semplice ed applicabile come sempre.creati un address utilizzando un wallet off line open source o genera da te un seed / chiave privata. (puoi utilizzare dei dadi / elenco parole del seed etc etc etc). Importalo e verifica che si riesca ad accedere e non hai fatto errori mentre lo generavi. Segnati la chiave pubblica. et voilà!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "devil-soul",
      "created_time": "May 27, 2023, 12:23:52 PM",
      "body": "Quindi bisogna guardare altrove ed anche di corsa grazie",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "^BuTcH^2",
      "created_time": "May 27, 2023, 01:47:07 PM",
      "body": "Da quanto ho letto Ledger vuole rendere open source il Recover, un piccolo passo avanti dai",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "May 27, 2023, 02:31:39 PM",
      "body": "Quote from: devil-soul on May 27, 2023, 12:23:52 PMQuindi bisogna guardare altrove ed anche di corsa grazie il backup della chiave privata (o del seed) deve essere sempre un MUST da fare a prescindere.quando vengono fatte queste \"modifiche\" in questa tipologia di wallet spostare i fondi è una buona opzione... tempo fa ho fatto notare in una review che \"non mi piacciono i wallet che mi chiedono di aderire ad un TOS\"....in generale credo che un vantaggio di usare criptovalute è quello di poter gestire tutto da soli. Qualsiasi soluzione può essere implementata da te senza dover passare da un ente terzo etc etc il classico \"BYOB\" (Be your own Bank).Perchè non sfruttare (anche) questo vantaggio nella sua completezza ed evitare restrizioni di sorta?Ulteriore vantaggio offerto è la decentralizzazione o in generale l'assenza di un \"gruppo\" di utenti che possa determinare dei cambiamenti in un protocollo, abbia barato durante l'emissione dei token e via dicendo... ecco perchè non mi sento MAI di raccomandare l'utilizzare di altcoins... soprattutto se non si sa cosa si sta facendo/non si conoscono i rischi di questa attività etc etc....Quote from: ^BuTcH^2 on May 27, 2023, 01:47:07 PMDa quanto ho letto Ledger vuole rendere open source il Recover, un piccolo passo avanti dai  Beh, dalla quantità di meme e contenuti negativi che sono nati dal loro annuncio io fossi in loro un paio di domande me le sarei fatte...probabile è troppo tardi per tornare indietro ma vabbè Insomma, è come se la Ferrari domani iniziasse ad offrire auto con impianto GPL per venire incontro ai consumi elevati dei proprietari... non credo che questo sia il prodotto ideale in questa fascia di mercato o l'interesse principale...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hopenotlate",
      "created_time": "May 31, 2023, 10:28:18 AM",
      "body": "Quote from: devil-soul on May 24, 2023, 12:10:34 PMBuon giorno ho visto qualche tempo fa che la gestione di metamask e passata a una nuova società consensys che richiede una nuova accettazione del regolamento praticamente dicono che registrano gli ip ed eventualmente l indirizzo eth e il tipo di transazione e si riservano in futuro di chiedere kyc, è da abbandonare immediatamente e usare un altro wallet?Sto anche io valutando di abbandonarlo e ho iniziato blandamente a guardare ad alternative valide, non ho ancora approfondito a 360 gradi ma mi sembra che Rabby wallet possa essere una soluzione praticabile ma vorrei ascoltare il parere di utenti più esperti circa questi loro termini di servizio :QuoteWhat information do we collectWe get information about you in a range of ways.Information You Give Us. Information we collect from you includes:Network information regarding transactions;Feedback and correspondence, such as information you provide in your responses to surveys when you report a problem with our service, receive customer support, or otherwise correspond with us;Usage information, such as information about how you use the Service and interact with us;We will never collect the following information:Never collect keys, addresses, transactions, balances, hashes, or any personal informationNever collect your full IP addressNever sell data for profitHow do we use the information we collectOur primary purpose in collecting information is to help us operate, provide, improve, customize, support, and market our services.We may use your information to:Provide the services and customer support you request;Resolve disputes and troubleshoot problems;How do we use CookiesWhen you access our services, we may place small data files called cookies or pixel tags on your computer.We use these files to understand, secure, operate, and provide our services. For example, we use cookies to:Provide all web-based services, improve your experience, and understand how our services are being used;Remember your choices and customize our services for you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "devil-soul",
      "created_time": "May 31, 2023, 05:42:19 PM",
      "body": "Invece trust wallet?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}