{
  "id": "topic_5411614",
  "title": "bonfire66",
  "author": "bonfire66",
  "created_time": "August 29, 2022, 03:22:07 PM",
  "content": "И как это нужно себя не любить и как сильно это чувство желания много денег, чтобы становиться губернаторами и прочими административными работниками на бывших территориях Украины. К чему бы это я? А к тому, что, например, сегодня убили замглавы администрации Херсонской области, назначенного российской стороной.    Если тут есть реальные аналитики-математики, не могли бы вы посчитать с помощью точных методов, сколько месяцев в среднем получается поработать российским наймитам на территории Украины, сколько за это время они успевают заработать денег, и имеет ли это какой-то физиологический смысл? Ибо рано или поздно все эти люди будут убиты или надолго посажены, а их родственники (я очень на это надеюсь) будут тоже. Зачем люди это делают? В чем смысл данного деяния? Или тут все идет нормально с точки зрения социал-дарвинизма и естественного отбора – что типа идиоты должны сдохнуть и не размножаться, а те кто умные, они и продолжат развитие правильного общества.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411614",
  "comments": [
    {
      "author": "cryptomaxsun",
      "created_time": "August 29, 2022, 05:32:33 PM",
      "body": "Село Михайловка в Запорожье.24 августа.Взорван глава оккупационной администрации.28 августа.Повешен начальник оккупационной полиции.Вопрос к путинистам: вы разве по истории ВОВ не знаете, что обычно бывает с гауляйтерами и полицаями?https://twitter.com/prof_preobr/status/1563832493832298496",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "August 31, 2022, 10:58:09 AM",
      "body": "Я видел сегодня утром видео, где губернатор Херсона вещал, что все в Херсоне хорошо. Но.. по виду из окна за его спиной люди сделали выводы, что он уже вещает отнюдь не из Херсона, а из Воронежа. Приводят доказательства. Картинки с улиц Воронежа.  Так ли это? Или фейк?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}