{
  "id": "topic_5476775",
  "title": "Wapfika",
  "author": "Wapfika",
  "created_time": "December 06, 2023, 02:58:49 PM",
  "content": "I think everyone notice how high the current fee right now on Bitcoin network. I’m sure player like me that relying only on signature campaign payment in Bitcoin is having a hard time to play right now since the fee is insanely high.How do you deal with this problem? Is there any casino that allows no confirmation to deposit? Let’s say I will send my Bitcoin using fee below average and then play while it’s still unconfirmed. I knew that some casino do have instant deposit but I never try depositing much lower fee to the average fee if they will still credit instantly.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476775",
  "comments": [
    {
      "author": "ryzaadit",
      "created_time": "December 06, 2023, 03:11:48 PM",
      "body": "Yes, some casino provided zero-confirmation for the balance.However, you only can spend-it (Betting) but before the transaction is getting minimum confirmation you will cannot withdraw. I have some experience on (Roobet) with zero-confirmation, the balance credited before getting confrmation.One another things, bitcoin fee is not really big at all. In around 1-2$ + If you using (Segwit) you can get more cheaper.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "December 06, 2023, 03:34:29 PM",
      "body": "Swap your BTC into an altcoin which has a cheaper transaction fee and as soon as you betting session is over, swap the profit made immediately into BTC once again, or move larger chunks of BTC in a single transaction to dilute the fees' costs, instead of making many small BTC transactions and paying huge fees in the end.Quote from: Wapfika on December 06, 2023, 02:58:49 PMI’m sure player like me that relying only on signature campaign payment in Bitcoin is having a hard time to play right now since the fee is insanely high.Well, my signature campaign pays me directly to my casino's balance, so it's not an issue after all. I don't have to pay any fees to deposit money at the casino in order to play. The only concern is when cashing out the money, so what I try to do is what I told above: to accumulate maximum coins as possible and make a single withdrawal, so I also pay a single fee only once every 3 weeks or once a month.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "December 06, 2023, 03:39:43 PM",
      "body": "Quote from: ryzaadit on December 06, 2023, 03:11:48 PMYes, some casino provided zero-confirmation for the balance.However, you only can spend-it (Betting) but before the transaction is getting minimum confirmation you will cannot withdraw. I have some experience on (Roobet) with zero-confirmation, the balance credited before getting confrmation.One another things, bitcoin fee is not really big at all. In around 1-2$ + If you using (Segwit) you can get more cheaper.$1-2 is below average fee, i think it would take days if not weeks for it to be confirmed. the insane fee probably contributes to people holding their BTC for long term which is good too. i also use segwit and to secure confirmation would be at least $6 at least in this mycelium that i'm using. that's nice of the roobet to credit unconfirmed tx.i wonder if they have some issue with double spending and the user who did it won big.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "December 06, 2023, 03:47:27 PM",
      "body": "Quote from: electronicash on December 06, 2023, 03:39:43 PMthat's nice of the roobet to credit unconfirmed tx.i wonder if they have some issue with double spending and the user who did it won big. Well Roobet KYC almost all of their members so I doubt that someone with KYC already submitted will attempt to double spend their deposit while their ID is on the casino. They can be ban even on other casino by doing that thing due to the KYC.The problem on crediting unconfirmed deposit is the waiting time for withdrawal. I’m a victim of this on multiple occasions and lose a lot of profit including my original bankroll just because I lose patience on waiting for my deposit to be confirmed in able for me to withdraw my funds. Btw, Livecasino, Sportsbet and Bitcasino credits unconfirmed deposit too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "December 06, 2023, 03:48:05 PM",
      "body": "Quote from: electronicash on December 06, 2023, 03:39:43 PMthat's nice of the roobet to credit unconfirmed tx.i wonder if they have some issue with double spending and the user who did it won big. If roobet is crediting unconfirmed transfers then this is really commendable.Quote from: Wapfika on December 06, 2023, 02:58:49 PMHow do you deal with this problem?Have you tried converting to at least usdt? I think most casinos have such option for deposit and you won't have the issue of high fee with stablecoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "December 06, 2023, 03:48:12 PM",
      "body": "Quote from: Wapfika on December 06, 2023, 02:58:49 PMI think everyone notice how high the current fee right now on Bitcoin network. I’m sure player like me that relying only on signature campaign payment in Bitcoin is having a hard time to play right now since the fee is insanely high.How do you deal with this problem? Is there any casino that allows no confirmation to deposit? Let’s say I will send my Bitcoin using fee below average and then play while it’s still unconfirmed. I knew that some casino do have instant deposit but I never try depositing much lower fee to the average fee if they will still credit instantly.When I notice that the transaction fee is high, I refrain from gambling for a while. It's a bit regrettable to pay such a steep fee even if I often end up losing, hehe, since we can see the amount before we send. What I do when I'm really into a game, especially if there's a tempting promotion I want to join or pursue, is closely monitor the network activity and use the average estimation fee tool. Sometimes, if I have some stored altcoin, I use that for betting in the casino as long as it's also supported",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "December 06, 2023, 03:52:08 PM",
      "body": "Quote from: ryzaadit on December 06, 2023, 03:11:48 PMOne another things, bitcoin fee is not really big at all. In around 1-2$ + If you using (Segwit) you can get more cheaper.It was around 50 sat/vbyte region before 48 hours but now again it's getting crazy and right now we can see the price at 150sat-200sat/vb for medium to high priority transactions which is like $10 for 1 input and 1 output TX.Well, I am not gonna deposit BTC at the moment to gambling site and if you want then choose alternative cryptos until the spam attack clears from BTC network but for an average gambler like high rollers $10 fee is not that big problem at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "December 06, 2023, 04:03:46 PM",
      "body": "Quote from: Wapfika on December 06, 2023, 02:58:49 PMI think everyone notice how high the current fee right now on Bitcoin network. I’m sure player like me that relying only on signature campaign payment in Bitcoin is having a hard time to play right now since the fee is insanely high.How do you deal with this problem? Is there any casino that allows no confirmation to deposit? Let’s say I will send my Bitcoin using fee below average and then play while it’s still unconfirmed. I knew that some casino do have instant deposit but I never try depositing much lower fee to the average fee if they will still credit instantly.There are 2 solutions.1- Use the Lightning Network2- Use some other altcoinThe fees are outrageous right now. Lightning Network isn't widely adopted yet and that leaves me no other choice than using alts sadly. My current favorite alt is doge. It only costs a 2-3 doge to make withdrawals from the exchanges and it costs nothing to make regular transactions. It is fairly stable and has good adoption. LTC is my second favorite. You can find these alts almost on every crypto casino.Just don't use btc till it gets its shit together...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "December 06, 2023, 04:10:33 PM",
      "body": "Quote from: Wapfika on December 06, 2023, 02:58:49 PMI think everyone notice how high the current fee right now on Bitcoin networkI left the bitcoin I have on gambling site alone. If I use my weekly budget finish one day, I will pounce on it. But I have enough gambling weekly budget and I leave it alone the old bitcoin budget alone which I have transferred already to gambling site. I am using stable coins and other altcoins like litecoin and tron to gamble now. As for bitcoin, I will not use it until the mempool become decongested.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "criptoevangelista",
      "created_time": "December 06, 2023, 04:16:27 PM",
      "body": "Sorry if my question may seem stupid, but aren't there casinos where you can use LN? because at this point LN would solve this problem of high rates. Or maybe some casino that uses altcoins and stablecoins",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "December 06, 2023, 04:20:13 PM",
      "body": "Indeed, it seems fees won't give us a break for a while as the fever for Ordinals and other shit-tokens continue to have some popularity within the Bitcoin community, but I disgress. Most of the occasions when I decides Bitcoin fees are too high for relatively small transactions, like depositing on a casino or paying for a small gift card, I always try to have a little bit of Altcoins to handle occasions like these ones. I know it may not a solution for everyone, though. When comes to specific coins I personally like Litecoin and Dash, though, Dash has lately fallen off glory (and price) for the allegations against it by the SEC in the United States.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Latviand",
      "created_time": "December 06, 2023, 04:25:23 PM",
      "body": "I used to gamble on some casinos that have zero confirmation but didn't last long there, have a hard time seeing myself spending bitcoin to gamble when I almost always lose when I gamble. Best decision I did is just to switch to an altcoin so it's not that difficult when I deal with transactions, Litecoin's probably the best altcoin to use for gambling but that's just my opinion, some people are using other altcoins but for me it works just fine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "December 06, 2023, 04:27:41 PM",
      "body": "Quote from: Wapfika on December 06, 2023, 02:58:49 PMI think everyone notice how high the current fee right now on Bitcoin network. I’m sure player like me that relying only on signature campaign payment in Bitcoin is having a hard time to play right now since the fee is insanely high.How do you deal with this problem? Is there any casino that allows no confirmation to deposit? Let’s say I will send my Bitcoin using fee below average and then play while it’s still unconfirmed. I knew that some casino do have instant deposit but I never try depositing much lower fee to the average fee if they will still credit instantly.You can simply wait until the tx fees are back to lower rates and then withdraw.There are some casinos which has an inbuilt exchange and so you can exchange to altcoins with cheaper tx fees and then withdraw.There's nothing much you can do other than these.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tsaroz",
      "created_time": "December 06, 2023, 04:28:24 PM",
      "body": "Quote from: Wapfika on December 06, 2023, 02:58:49 PMI think everyone notice how high the current fee right now on Bitcoin network. I’m sure player like me that relying only on signature campaign payment in Bitcoin is having a hard time to play right now since the fee is insanely high.How do you deal with this problem? Is there any casino that allows no confirmation to deposit? Let’s say I will send my Bitcoin using fee below average and then play while it’s still unconfirmed. I knew that some casino do have instant deposit but I never try depositing much lower fee to the average fee if they will still credit instantly.For the same reasons, there are no casino that accepts non-confirmation deposits. Every of I know needs at least three confirmations.A few days ago, I got a recommended fees of $14 in bitcoins in an online wallet. The thing with bitcoin is you need to plan your transactions and achieve your goals with minimum numbers of transactions.You need to use Non-custodial wallets like Electrum, use segwit addresses and decrease the recommended fee if you are not in a hurry.There are congestion at times but they get eased in a few hours.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bounceback",
      "created_time": "December 06, 2023, 04:33:37 PM",
      "body": "Quote from: ryzaadit on December 06, 2023, 03:11:48 PMYes, some casino provided zero-confirmation for the balance.However, you only can spend-it (Betting) but before the transaction is getting minimum confirmation you will cannot withdraw. I have some experience on (Roobet) with zero-confirmation, the balance credited before getting confrmation.One another things, bitcoin fee is not really big at all. In around 1-2$ + If you using (Segwit) you can get more cheaper.Are there all gambling platform supported with btc deposit trough Segwit address? right now bitcoin is not best option for depositing to gambling or casino account high transaction and delay more than one until two hours. Need prepare for long time before depositing bitcoin fund in gambling platform with usually credit without few minutes but right now have waiting more than two hours. Usually I used fiat for depositing in gambling platform account and run smooth without waiting longer than bitcoin, but I want to try with my signature payment on the weekend will get faster block confirmation and credit without delay in gambling casino?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "December 06, 2023, 04:36:20 PM",
      "body": "Quote from: criptoevangelista on December 06, 2023, 04:16:27 PMSorry if my question may seem stupid, but aren't there casinos where you can use LN? because at this point LN would solve this problem of high rates. Or maybe some casino that uses altcoins and stablecoinsI have not used a casino that has lightning network. If many casinos can adopt it, it would be good. I will not have to use altcoin for gambling in time like this anymore.You can see some gambling sites that support lightning network: https://cryptogambling.com/casinos/lightning-networkRollbit and BC.game are recommended.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "December 06, 2023, 04:49:23 PM",
      "body": "Quote from: Wapfika on December 06, 2023, 02:58:49 PMI think everyone notice how high the current fee right now on Bitcoin network. I’m sure player like me that relying only on signature campaign payment in Bitcoin is having a hard time to play right now since the fee is insanely high.How do you deal with this problem? Is there any casino that allows no confirmation to deposit? Let’s say I will send my Bitcoin using fee below average and then play while it’s still unconfirmed. I knew that some casino do have instant deposit but I never try depositing much lower fee to the average fee if they will still credit instantly.I think for segwit addresses it wasn't that high, I think it's more high using Ethereum and that thing sucks compare to the former. I think if you can trade-off on selling your bitcoin to some altcoins that have lower transaction fees that are supported by your casino, then, I suggest you go with that path.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mvdheuvel1983",
      "created_time": "December 06, 2023, 05:55:42 PM",
      "body": "Quote from: Gozie51 on December 06, 2023, 03:48:05 PMQuote from: Wapfika on December 06, 2023, 02:58:49 PMHow do you deal with this problem?Have you tried converting to at least usdt? I think most casinos have such option for deposit and you won't have the issue of high fee with stablecoin.This is the solution to the problem. Used other cryptocurrencies that is accepted by the casinos. As a gambler you have to think like a business person which is to keep your expenses very low. It makes no sense to spend more on transaction fee if there are cheaper alternatives. You can learn how to use other cryptocurrencies like Ethereum and Litecoin, and also USDT mentioned above. Bet smartly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "December 06, 2023, 06:08:37 PM",
      "body": "Quote from: Wapfika on December 06, 2023, 02:58:49 PMHow do you deal with this problem? Is there any casino that allows no confirmation to deposit? Let’s say I will send my Bitcoin using fee below average and then play while it’s still unconfirmed. I knew that some casino do have instant deposit but I never try depositing much lower fee to the average fee if they will still credit instantly.No casino will ever allow that, and that will be a risky thing for any casino to do because people will take advantage of that situation in real time, and secondly, casinos are making use of every deposit, moving it down to their cold wallet. At least that's what most centralised systems do, so they can't move an unconfirmed transaction to a safe place. Another thing is that someone who makes such a deposit and is allowed to play a game could also be like someone who walks into a casino to make a bet on credit because the money is not yet in the casino's hands, and if the gambler ends up losing on all his games, that will stop the person from cancelling the transaction, as that could easily be done when the transaction has not undergone at least one confirmation. I don't think there is any casino taking such a risk out there; all they can do is provide other deposit options to make things easier for their customers, if they don't already have one available. I mean, those BTC-only deposit casinos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}