{
  "id": "topic_5452753",
  "title": "Framelover",
  "author": "Framelover",
  "created_time": "May 15, 2023, 12:33:27 AM",
  "content": "I greet Una my seniors and fellow beginners. Make una no vex if this topic no sweet una for body but na as e de do me na im make I see am as a concern nd necessity to address am. Cuz even me wey write this article, my mental health de f**kd up. Mental Health na mathias wey we as Nigerians de overlook, we no de really care about am or take am seriously. This mathias na watyn fit affect person, family, society at large. Many pipu de struggle in silence base on fear say other pipu go use one kain Irene 👀 take kpor dem.The major reason why be say mental health awareness dey essential be say e de help to remove stigma wey concern mental health issues and e de help encourage pipu make dem for seek help. This mathias fit go long way in reducing mental health disorders nd make e improve our overall mental health for we country cuz una go agree with me so majority of us no too normal (make we tell ourselves truth).This awareness fit help improve we country productivity nd our quality of life. By dey promote awareness about mental health nd dey encourage pipu make dem seek help wen dem need am, we fit help reduce all these negative effects nd we fit make d overall health nd well being of Nigerians better.Make we try look into this mathias cuz mental health dey really underrated for we country nd na something wey we need to serious about cuz from there, even d change and betterment of d country wey we de talk about go begin workout. Abeg how Una take reason this mathias?I make sentence abi I de cap vatica?Una reason with me say this awareness go actually fit go a long way in helping we country?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452753",
  "comments": [
    {
      "author": "SatoPrincess",
      "created_time": "May 15, 2023, 05:31:29 PM",
      "body": "How many Nigerians go gree pay money to go see therapist to talk about trauma, even to see marriage counselor for advice na problem, many go prefer to go see their pastor. Nigerians know how we take dey heal our pains, many people na memes and twitter trends them dey use forget their problem, na either big brother naija or some other trending show for social media. Right now na Hilda dey trend, everybody dey focused on her for now, by next week we go don move on to something else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Framelover",
      "created_time": "May 15, 2023, 09:01:38 PM",
      "body": "Quote from: SatoPrincess on May 15, 2023, 05:31:29 PMHow many Nigerians go gree pay money to go see therapist to talk about trauma, even to see marriage counselor for advice na problem, many go prefer to go see their pastor. Nigerians know how we take dey heal our pains, many people na memes and twitter trends them dey use forget their problem, na either big brother naija or some other trending show for social media. Right now na Hilda dey trend, everybody dey focused on her for now, by next week we go don move on to something else. E be true say many Naija pipu dey prefer make dem go meet dem pastors or find comfort for popular culture instead of paying money go see therapist or marriage counselor. Memes, Twitter trends, and reality TV shows na e be the way dem dey take forget their problem for some time. But e dey important make we know say some Naija pipu dem dey see d importance of professional help, nd dem dey go see therapist or counselor when dem need am. Even though popular culture fit help dem for small time, therapist go give dem special place make dem fit talk about their problems nd dem go give dem advice wey go fit help dem for long time healing and personal growth. As pipu dey increase their awareness about mental health, e go cause change for their attitude towards therapy nd counseling so more people go fit embrace d benefits wey e dey bring.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartGold01",
      "created_time": "May 15, 2023, 09:48:18 PM",
      "body": "Bros abi madam, see this our country no even need normal people because people wey normal never see food chop na people wey no normal the rule us and they even see better food chop pass those people wey we think say them normal. In essence, educated people no dey fit rule us, na uneducated people dey always rule us with a forged certificate and yet you still want us to go do mental well being or awareness?For you to be normal you have to be abnormal to be normal in this our country so it's a choice whether if people would pay heed to it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Framelover",
      "created_time": "May 16, 2023, 12:22:10 AM",
      "body": "Quote from: SmartGold01 on May 15, 2023, 09:48:18 PMBros abi madam, see this our country no even need normal people because people wey normal never see food chop na people wey no normal the rule us and they even see better food chop pass those people wey we think say them normal. In essence, educated people no dey fit rule us, na uneducated people dey always rule us with a forged certificate and yet you still want us to go do mental well being or awareness?For you to be normal you have to be abnormal to be normal in this our country so it's a choice whether if people would pay heed to it.My senior brozzay, I understand say u de vex about d way things dey go for we contri. E no dey make sentences say normal pipu no dey chop well, but people wey no normal dey rule us nd chop beta food. Some pipu dey say make we focus on mental wellbeing nd awareness, but e dey hard when to be normal for dis country u for dey abnormal. E be choice if pipu go take am serious or not. Education nd mental wellbeing still dey important for our personal growth nd progress as society.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "May 16, 2023, 05:07:34 AM",
      "body": "Na true talk na Satoprincess yan for here say we Nigerians get our own way wey we dey take handle/heal our mental health challenges and eh dey work for us, because Nigerians na the last set of people to carry money go pay for a session with a therapist to tell them how eh dey do them for body, they rather prefer to go see pastor or herbalist and even pay more. But all thanks to Twitter and all this social media prankstars & content creators @ Untouchable comedy, Emmanulla comedy, Sydney, Taaooma comedy  & e.t.c wey dey give us joy everyday, I bet you the level of mental health for don high more than what it is today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "May 16, 2023, 11:28:11 PM",
      "body": "Quote from: Framelover on May 15, 2023, 12:33:27 AMMake we try look into this mathias cuz mental health dey really underrated for we country nd na something wey we need to serious about cuz from there, even d change and betterment of d country wey we de talk about go begin workout. Abeg how Una take reason this mathias?I make sentence abi I de cap vatica?Una reason with me say this awareness go actually fit go a long way in helping we country?Oboy forget am, swallow am, na man you be, all this words na wetin dey kill most of the men for this country. This mental health issue na men dey suffer am pass for this country (I no care if statistics talk another thing). If you know how many man dey die in silence you go shout. Abeg make una dey try treat people right for anywhere una find otherselfs because people dey actually go through alot and I dey encourage everybody here to try talk to person if you notice say your own dum dey do you somehow. No dey shame, na talk dem go talk and e dun finish. If you allow shame kill you na ur own cup of tea be dat. Make we dey open up to one another.If your own shame too much then go see doctor. Him fit help you tell you one or twos wey you fit dey use or do to help your mental health. Also try dey exercise and dey chop well. All this time go help you. No be only outside wahala dey cause mental issue. Both your own overthinking dey causes am therefore to eradicate this thing from the country or to reduce am well well to the bare minimum, den we need to put hands together to educate people to dey talk their mind when their own no good so people fit reason them wetin dem go do to reduced the loan wey dem dey carry for head.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Framelover",
      "created_time": "May 17, 2023, 12:34:49 PM",
      "body": "Quote from: CryptopreneurBrainboss on May 16, 2023, 11:28:11 PMQuote from: Framelover on May 15, 2023, 12:33:27 AMMake we try look into this mathias cuz mental health dey really underrated for we country nd na something wey we need to serious about cuz from there, even d change and betterment of d country wey we de talk about go begin workout. Abeg how Una take reason this mathias?I make sentence abi I de cap vatica?Una reason with me say this awareness go actually fit go a long way in helping we country?Oboy forget am, swallow am, na man you be, all this words na wetin dey kill most of the men for this country. This mental health issue na men dey suffer am pass for this country (I no care if statistics talk another thing). If you know how many man dey die in silence you go shout. Abeg make una dey try treat people right for anywhere una find otherselfs because people dey actually go through alot and I dey encourage everybody here to try talk to person if you notice say your own dum dey do you somehow. No dey shame, na talk dem go talk and e dun finish. If you allow shame kill you na ur own cup of tea be dat. Make we dey open up to one another.My senior brozzay, me make waw for u wey u help me chuck mouth for dis Mathias.. d mata don too over me na im make I say make I air am. Dis mata don affect me but I don de heal small small and I de don de recover small small. On God we go all de alright nd as u talk am, make anybody wey de suffer from dis tin try seek help cuz na very serious mata wey ppl de underrate.Thank u so much for d encouragement boss.I salama for u.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "May 17, 2023, 09:02:06 PM",
      "body": "Before I join people way dey talk say depression no dey exist until I see problem way pass me. I too don go through depression, this one happen for 2021, thank God for my close friends and family way stay by my side even when I dey para unnecessary for them, dem no vex because them understand say na frustration dey do me. My advice to anybody way dey go through tough times na say make them remember say tough times no go last forever, try find joy for something and focus on that small joy because overthinking dey kill faster than any disease. year",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Truthlovecoins",
      "created_time": "May 18, 2023, 01:53:29 PM",
      "body": "Quote from: CryptopreneurBrainboss on May 16, 2023, 11:28:11 PMQuote from: Framelover on May 15, 2023, 12:33:27 AMMake we try look into this mathias cuz mental health dey really underrated for we country nd na something wey we need to serious about cuz from there, even d change and betterment of d country wey we de talk about go begin workout. Abeg how Una take reason this mathias?I make sentence abi I de cap vatica?Una reason with me say this awareness go actually fit go a long way in helping we country?Oboy forget am, swallow am, na man you be, all this words na wetin dey kill most of the men for this country. This mental health issue na men dey suffer am pass for this country (I no care if statistics talk another thing). If you know how many man dey die in silence you go shout. Abeg make una dey try treat people right for anywhere una find otherselfs because people dey actually go through alot and I dey encourage everybody here to try talk to person if you notice say your own dum dey do you somehow. No dey shame, na talk dem go talk and e dun finish. If you allow shame kill you na ur own cup of tea be dat. Make we dey open up to one another.If your own shame too much then go see doctor. Him fit help you tell you one or twos wey you fit dey use or do to help your mental health. Also try dey exercise and dey chop well. All this time go help you. No be only outside wahala dey cause mental issue. Both your own overthinking dey causes am therefore to eradicate this thing from the country or to reduce am well well to the bare minimum, den we need to put hands together to educate people to dey talk their mind when their own no good so people fit reason them wetin dem go do to reduced the loan wey dem dey carry for head. As good as e be for person to yarn with other men them or brothers wey suppose understand, the truth be say no body really care about the issues wey dey bother man or put am for the kind mental condition wey em dey face.Women go tell man say e too complain or make em be man and bear the emotional burden alone. Man go still tell man same thing or worse. Na only those wey get good heart and calm dey even bother at times to listen to person.Sometimes sef, the person wey you think say you dey talk to in order to relief your mental state, fit even be the cause or follow contribute to the issue. E always dey good to dey kind sha, because no be clear eye some people dey use wake up comot for house in the morning o. Nigerian government suppose get better health care strictly for people wey get so much wey dey bother them for mind. Most times na just to talk dey wan talk. Before the how to solve their problem go come.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RockBell",
      "created_time": "May 19, 2023, 09:02:07 PM",
      "body": "Quote from: Framelover on May 15, 2023, 12:33:27 AMI greet Una my seniors and fellow beginners. Make una no vex if this topic no sweet una for body but na as e de do me na im make I see am as a concern nd necessity to address am. Cuz even me wey write this article, my mental health de f**kd up. Mental Health na mathias wey we as Nigerians de overlook, we no de really care about am or take am seriously. This mathias na watyn fit affect person, family, society at large. Many pipu de struggle in silence base on fear say other pipu go use one kain Irene 👀 take kpor dem.The major reason why be say mental health awareness dey essential be say e de help to remove stigma wey concern mental health issues and e de help encourage pipu make dem for seek help. This mathias fit go long way in reducing mental health disorders nd make e improve our overall mental health for we country cuz una go agree with me so majority of us no too normal (make we tell ourselves truth).This awareness fit help improve we country productivity nd our quality of life. By dey promote awareness about mental health nd dey encourage pipu make dem seek help wen dem need am, we fit help reduce all these negative effects nd we fit make d overall health nd well being of Nigerians better.Make we try look into this mathias cuz mental health dey really underrated for we country nd na something wey we need to serious about cuz from there, even d change and betterment of d country wey we de talk about go begin workout. Abeg how Una take reason this mathias?I make sentence abi I de cap vatica?Una reason with me say this awareness go actually fit go a long way in helping we country?In spite of the fact that many of us have neglected our mental health and that many people, particularly in this country, are struggling, no one is paying attention to it. However, since the majority of what you do is influenced by your mental state, we Nigerians don't view seeing a therapist as being particularly important. However, I think it is crucial that we encourage individuals to seek counseling and communicate to others about their feelings. When we express how we feel, it should help us feel better in some way as opposed to holding it in and having it consume us. Challenges is just driving everyone crazy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "May 20, 2023, 06:50:36 PM",
      "body": "Mental health is not what is only associated with a particular country, it's something common and mostly found in every part of the world, one thing that needs to be much concerned about this is that many were being tound mentally imbalance through the emotional trauma they have been through in some stages of their life, some accident, malnutrition while others may be due to spiritual attacks as believed by some people, some people were mentally affected but you really won't know by just seing their appearance, we need to put others interest in mind and help them towards maintaining a stable mindset and rendering help where necessary to help them in our own way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "June 30, 2023, 06:07:17 PM",
      "body": "Quote from: Framelover on May 15, 2023, 12:33:27 AMI greet Una my seniors and fellow beginners. Make una no vex if this topic no sweet una for body but na as e de do me na im make I see am as a concern nd necessity to address am. Cuz even me wey write this article, my mental health de f**kd up. Mental Health na mathias wey we as Nigerians de overlook, we no de really care about am or take am seriously. This mathias na watyn fit affect person, family, society at large. Many pipu de struggle in silence base on fear say other pipu go use one kain Irene 👀 take kpor dem.The major reason why be say mental health awareness dey essential be say e de help to remove stigma wey concern mental health issues and e de help encourage pipu make dem for seek help. This mathias fit go long way in reducing mental health disorders nd make e improve our overall mental health for we country cuz una go agree with me so majority of us no too normal (make we tell ourselves truth).This awareness fit help improve we country productivity nd our quality of life. By dey promote awareness about mental health nd dey encourage pipu make dem seek help wen dem need am, we fit help reduce all these negative effects nd we fit make d overall health nd well being of Nigerians better.Make we try look into this mathias cuz mental health dey really underrated for we country nd na something wey we need to serious about cuz from there, even d change and betterment of d country wey we de talk about go begin workout. Abeg how Una take reason this mathias?I make sentence abi I de cap vatica?Una reason with me say this awareness go actually fit go a long way in helping we country?  This mental health issue is something we need to look into and talk about,  OP you try we'll well for this topic because alot of people here fit dey get issues with their mental health but dey find I'm hard to share their personal issues so once again you try, because such persons in a much as they no fit air out go learn how to handle this particular issue from replys, this issue as we know done lead many people to suicide or remain mental unstable for life, and I urge members of this naija board to check up on their friends at large because people dey really go through alot for this our country,  and imagine say person for this forum mental health no dey stable, how eh wan use think well reply topics or create topics for different boards anyways to cut long tori short make eh no be say I dey cap too much, I go drop una with some ideas of how to tackle this mental health wahala. • Good sleeping habit - one of the reasons why people they suffer from this na because dem dey hardly sleep or observe siesta, science done talk I'm say we need to dey observe 8 hours sleep everyday but most people no dey sleep especially some men done turn their working hours to night and eh no good  imagine person wey sleep by 3am then wake by 6 to go work, when eh wake eh go dey very unstable and that go affect em mental health for place of work.• meditation - this one na another way to tackle this issue, sometimes you just need to go quit place close your eyes and begin to meditate on this, and eh dey mostly good with slow music to help you while you dey think deep, daily practice of this everyday for about 15- 30 mins go give you stable mind and help improve your mental health  and eh go make you more calm and your mind go dey at ease.• Good interactions with people - when your mental health no dey balance eh no good to dey stay isolated from people because at that point when you dey alone your mindset fit they feed you with negative thoughts like suicide, or other bad ideas, so another way you fit help yours na to interact with trustworthy people wey you fit confide in and share your problem with them, oyibo talk say \"a problen shared na problem solved\" so the best peope to share your problem with most time na older family members wey you fit confide in because most of them fit done pass through that same problem and they'll  advise you on how to go about I'm. Another thing na exercise, regular exercise dey help develop our body not only our body but there are some good exercises wey dey help our mental health dey balanced like. Yoga Jogging  Hiking  Running  Pilates.  My brother since you say your mental health no dey stable you fit try any of the above eh go go a long way that's why oyibo say \" problem shared na problem solved \".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Richbased",
      "created_time": "October 07, 2023, 04:49:48 PM",
      "body": "One's mental health is very important in any business you are involved in as your ability of reasoning towards a particular topic will aid you in knowing the techniques and the rightful insights to follow.Finding the right solution to problems requires mental awareness as if you're not giving the right solution to problems it also becomes a problem to you as well.Moreover, anything you want to do in life requires the right  knowledge to be applied towards enhancing your mental ability. When you apply the right knowledge to something it boost your confidence morale. In as much as one is concerned, we are responsible for our actions and inactions and the inability to take responsibility of our actions becomes a state of mental health related challenges and it is advisable to know about the changes we experience in our environment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ever-young",
      "created_time": "April 16, 2024, 09:31:18 PM",
      "body": "Quote from: SatoPrincess on May 15, 2023, 05:31:29 PMHow many Nigerians go gree pay money to go see therapist to talk about trauma, even to see marriage counselor for advice na problem, many go prefer to go see their pastor. Nigerians know how we take dey heal our pains, many people na memes and twitter trends them dey use forget their problem, na either big brother naija or some other trending show for social media. Right now na Hilda dey trend, everybody dey focused on her for now, by next week we go don move on to something else. Normally na true u talk so, nobody dey ready to comot money spend for their body, dem dey see am as na waste of money wen be say herbs dey for bush wey dem go use treat demselves, even when some go hospital self, dey go prefer to go buy the medicine by themselves, select the ones wey dey won buy, some self go go chemist dey go complain how their body dey do dem but yet na still dem go prescribe the drugs by themselves, wonders wey our country people dey do dey really amaze me, we been our own doctor wey be say we no dey gree hear advice from people, and we still dey very sensitive and creative to fine out or to create things by ourselves. God bless our people for the natural brain but e dey good to take care of our body and also wetin dey always cause why e be say we dey as we like wen it comes to our mental health na because say we no get the awareness, assuming seminar especially free seminar dey always dey to dey teach body how important our health be, and how dey supposed dey take care of am. E go really mk sense o",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}