{
  "id": "topic_5412809",
  "title": "libert19",
  "author": "libert19",
  "created_time": "September 08, 2022, 04:17:30 AM",
  "content": "Suppose your country has banned crypto completely. You could buy ecommerce [1]giftcards from sites like bitrefill ($1k/month without account and there are some other sites too which I have no personal experience of). Ofc they have some premium and if you were to sell these gift cards you would get 5-10% lower but could be helpful strategy in dire need. You can always purchase basic necessities using these or purchase items online and resell them. [1] Gift cards providers",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5412809",
  "comments": [
    {
      "author": "pooya87",
      "created_time": "September 08, 2022, 04:26:22 AM",
      "body": "Quote from: libert19 on September 08, 2022, 04:17:30 AMOfc they have some premium and if you were to sell these gift cards you would get 5-10% lower but could be helpful strategy in dire need. If cryptocurrencies are banned then using them to buy giftcards is also banned. Also if there is a loss in such a conversion (buy gift card with a fee then sell it for fiat at a loss) then I'd say it is best to simply find a way to exchange your cryptos to fiat using peer to peer platforms. That way you are still doing something that is banned but at least you don't lose money (assuming you don't get scammed of course).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "September 08, 2022, 06:02:35 AM",
      "body": "Quote from: libert19 on September 08, 2022, 04:17:30 AMOfc they have some premium and if you were to sell these gift cards you would get 5-10% lower but could be helpful strategy in dire need.This is one of the reasons I do not like gift cards. Another is that it is easy for gift card buyers to scam if compared with peer-to-peer crypto trading. How about going for a decentralized exchange? That would probably be very difficult to ban, what I am thinking is that local trading on decentralized exchanges could be reduced if bitcoin is banned in the country. But I definitely know that bitcoin is traded in countries that ban it as long as the citizen are having it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "September 08, 2022, 06:25:09 AM",
      "body": "Quote from: libert19 on September 08, 2022, 04:17:30 AMYou can always purchase basic necessities using these or purchase items online and resell them. 1. As already said, when crypto is banned, you won't be able to buy these cards for your country.2. In many countries the offer for these gift cards is very limited. In my case, phone refills (but not for the cheaper operator I use), books and furniture are not really the \"basic necessities\"... (some of BitRefill's Visa/MC debit cards may be useful though - actually the only useful items, but those are not really gift cards)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "September 08, 2022, 06:29:53 AM",
      "body": "Quote from: _act_ on September 08, 2022, 06:02:35 AMHow about going for a decentralized exchange? That would probably be very difficult to ban, what I am thinking is that local trading on decentralized exchanges could be reduced if bitcoin is banned in the country. But I definitely know that bitcoin is traded in countries that ban it as long as the citizen are having it.DEX can be used but don't you think the Income tax department might question later of the fiat currency being credited or debited from the bank account to perform DEX trades. If crypto is banned in a country then the only way to trade would be illegally over the counter. I don't think there is any other option apart from it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "September 08, 2022, 09:53:12 AM",
      "body": "Quote from: libert19 on September 08, 2022, 04:17:30 AMSuppose your country has banned crypto completely. This would mean that you live in a very undemocratic country where the ban on cryptocurrencies would not be the biggest problem for you. In that case, I would seriously consider moving to another country with a higher level of democracy and human rights. Even if there is a ban, people will always manage to get around it, you just have to be creative.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "September 08, 2022, 10:12:07 AM",
      "body": "Quote from: libert19 on September 08, 2022, 04:17:30 AMSuppose your country has banned crypto completely. You could buy ecommerce [1]giftcards from sites like bitrefill ($1k/month without account and there are some other sites too which I have no personal experience of). Ofc they have some premium and if you were to sell these gift cards you would get 5-10% lower but could be helpful strategy in dire need. You can always purchase basic necessities using these or purchase items online and resell them. [1] Gift cards providersSo you are proposing this idea for someone who is actually having cryptocurrency in their wallet but suddenly their government banned the usage so now the person can use this idea to buy things what he wanted.Personally I feel doing p2p is more preferable in this situation so you will get the fiat in your account or in hands so the spending ways are not limited.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "September 08, 2022, 10:29:59 AM",
      "body": "Quote from: Findingnemo on September 08, 2022, 10:12:07 AMPersonally I feel doing p2p is more preferable in this situation so you will get the fiat in your account or in hands so the spending ways are not limited.I second this. At least in my country gift card value are not that great except for online shopping for overseas products, so I'd rather cash out directly. That being said, I can see how valuable they are if your country's gift card trades are mainstream and you can cash them out easily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "September 08, 2022, 11:45:02 AM",
      "body": "Quote from: libert19 on September 08, 2022, 04:17:30 AMSuppose your country has banned crypto completely. Feels like North Korea which banned almost everything which is sucks. Probably a country with a dictator and has communist approach when it comes to community. Doing/getting involved with crypto is one thing a person should not be deprived of if it is, then I suggest leave(Not allowed in North Korea as far as I know) that and go to a more fair country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "September 08, 2022, 04:00:31 PM",
      "body": "If it's banned in your country how can you access well-known shops or websites that accept crypto?In my country when the BTC is banned before I can't access any crypto exchanges it shows something related to the government with a warning that you can access the site because Bitcoin is banned(Something like that). You can only bypass it if you change your DNS or use VPN so if you are living in a country where BTC is banned then use VPN to bypass the internet to access websites that crypto involved.Another way is to find someone trusted here on the forum to sell your Bitcoin or any crypto and send them through wire or Western union. You can also try PayWithMoon to deposit your crypto and buy anything that accepts a visa card just avoid Amazon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "September 08, 2022, 11:59:11 PM",
      "body": "If crypto is banned, then buying or using bitcoin is too risky unless you knew what you were doing online. Most most probably most of these websites will be banned too, especially those who are well-known in the crypto space. Although you can use VPNs but still should be taken by risk and safety, especially buying premium ones that has proven secured (like protonvpn).Also, to those who are in a country where their government wants to ban or just banned the use crypto i guess its good to assume that you should sell your holdings in early before getting involved and imprisoned due carelessness of using without protection. But yeah most of those will be still stay in the space no matter what's the government's decision regarding the matter",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "September 09, 2022, 01:01:46 AM",
      "body": "If my country bans crypto completely, I wouldn't be bothered. Other than the fact that my country is a big failure in policy implementation, I think there isn't really a complete ban on crypto to the point that people could no longer find ways to transact with each other. My country also imposed a complete ban on illegal drugs. Peddlers and even users are killed openly following its strict implementation. Alas, drugs remain. So if they failed to eradicate illegal drugs despite the ban and its bloody implementation, how could they stop Bitcoin when it is impossible to ban the blockchain?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "September 09, 2022, 03:36:19 AM",
      "body": "Peer to peer using localbitcoin or something same is the best way to do transcation when the county ban you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 09, 2022, 06:34:50 AM",
      "body": "Quote from: dansus021 on September 09, 2022, 03:36:19 AMPeer to peer using localbitcoin or something same is the best way to do transcation when the county ban youIt is localbitcoins. For not to enter the wrong URL. LocalBitcoins is a peer-to-peer exchange, but it is centralized, it requires KYC. If you do not verify your account on the site, you will not be able to make use of their products and services. If bitcoin is totally banned in a country, even people from the county may not be able to access all the centralized exchanges. The country can make that possible, all centralized exchanges to become inaccessible by their citizens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "September 09, 2022, 11:27:01 AM",
      "body": "Quote from: Darker45 on September 09, 2022, 01:01:46 AMIf my country bans crypto completely, I wouldn't be bothered. Other than the fact that my country is a big failure in policy implementation, I think there isn't really a complete ban on crypto to the point that people could no longer find ways to transact with each other. My country also imposed a complete ban on illegal drugs. Peddlers and even users are killed openly following its strict implementation. Alas, drugs remain. So if they failed to eradicate illegal drugs despite the ban and its bloody implementation, how could they stop Bitcoin when it is impossible to ban the blockchain?The alarm of ban has never seemed to amaze me because it's all bark, no bite. Blockchain network is decentralized, with an emphasis on term decentralized, because it is functional on a digital space. Unless the government of a country intends to inspect every persons digital device on either daily or weekly or as frequent as they think necessary, it will be quite difficult to place a complete ban on the use of crypto for transactions for cases where persons doing the exchange are enlightened on the subject matter already. One of the things they can do is to place restrictions that would make crypto to fiat exchange difficult or too expensive to afford.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "September 09, 2022, 04:12:24 PM",
      "body": "Quote from: dansus021 on September 09, 2022, 03:36:19 AMPeer to peer using localbitcoin or something same is the best way to do transcation when the county ban youLocalBitcoins has required AML/KYC for a while now.The only similar platforms that doesn't require AML/KYC are LocalCryptos, HodlHodl, and Bisq.[1] https://localcryptos.com/[2] https://hodlhodl.com/[3] https://bisq.network/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "September 09, 2022, 04:51:28 PM",
      "body": "Cryptocurrency is totally banned in my country but I'm still using it without any problem as you know things are pretty much easy these days though I have gone through KYC. But still, you have a lot of options like having trades through the help of a lot of facebook groups in my country. I barely had any issue other than a small scam which was also my fault.However, if someone wants to have full privacy, this type of step may help them as selling gift cards won't any longer makes someone a suspect. I haven't tried it but losing 5-10% on a transaction would be a great loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "September 09, 2022, 05:38:05 PM",
      "body": "Quote from: libert19 on September 08, 2022, 04:17:30 AMYou could buy ecommerce [1]giftcards from sites like bitrefill ($1k/month without account and there are some other sites too which I have no personal experience of). Ofc they have some premium and if you were to sell these gift cards you would get 5-10% lower but could be helpful strategy in dire need. I don't like gift cards for some reasons you just pointed out, those vendors who buy gift cards are somehow milking users with those discounts they buy. I once did a gig online and the company was having problems with their credit card funding the platform we were using, I had to wait for some days and after the period they promise passed by, they ask if they can pay me in gift card, I declined because I can't sell them at the value they gave it to me and the company wasn't ready to give me more than the price we agreed, they had no choice than to pay me in Bitcoin they previously didn't want to send.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "September 09, 2022, 07:23:26 PM",
      "body": "It won't be useful in my current situation and my country, gift cards aren't a thing in here and it's better to purchase crypto elsewhere and have it personally and directly even the country bans it.Like those people that are in actual declaration of banning for crypto by their government, it's impossible that none of them are still engaging, buying and selling cryptos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "September 09, 2022, 07:36:01 PM",
      "body": "This won't really work, Crypto-currency banned in a country also applies to even online purchases, I am from a country where Bitcoin is banned and well we have been going by but definitely not using gift cards or any other online stuff asThe well known best way is through peer to peer, this is the way that make Crypto-currency even untouchable to the government. My suggestion is keep funds in Personal crypto-currency wallet and when ever in need you can always convert to fiat (many businesses in such a country mostly accepts Fiat) just same way as using the bank.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}