{
  "id": "topic_5404841",
  "title": "Lilacthrow123",
  "author": "Lilacthrow123",
  "created_time": "July 01, 2022, 07:31:37 PMLast edit: July 07, 2022, 07:59:52 PM by Lilacthrow123",
  "content": "Hello everyone. Please refer to my previous post for all the details. https://bitcointalk.org/index.php?topic=5404614.0 I will just be providing the proof here. Rocketpot Ann thread - https://bitcointalk.org/index.php?topic=5178376.0Rocketpot rep profile (in this case, their account profile on this forum) - https://bitcointalk.org/index.php?action=profile;u=2641009Proof of initial deposit: https://imgur.com/a/qjnYb3IProof of bonus being cleared/completed: https://imgur.com/a/JlVoRUcProof of winnings: https://imgur.com/a/7bv7MPn https://imgur.com/a/FEeFZT2https://imgur.com/a/H4sGRyk https://imgur.com/a/Vt1Un9j https://i.imgur.com/RJHyAar.jpgProof of balance: https://imgur.com/a/gi0I1PlProof of rocketpot vip manager confirming I cleared the bonus and the winnings are legit(please note the blacked out part showed player name and details so it’s blacked out for privacy reasons): https://imgur.com/a/2RtqBuCAmount owed: 176 Ethereum Website/Casino: Rocketpot.ioLatest update, still haven’t received anything on rocketpots end. Was told yesterday by vip manager “Sofia” to request a $6000 withdraw and that another manager would be emailing me by tomorrow the latest. Haven’t received any email or the $6000. Will be posting all updates on the original thread, be sure to followUPDATEhttps://imgur.com/a/RkJwgydGood news rocketpot has paid out $16k so far. They processed the $6000 withdrawal Sunday and has already paid out the $10000 for this week following their limits. So so far I’ve received $16k of the $170k+. Good news is there was no delay in the $10k payout for this week.  Unfortunately still have no direct answer or confirmation from rocketpot if they will be paying out and honoring the full 170k+ in winnings waiting on the appropriate manager update for that. Now following their withdrawal limits I am waiting till next week to request another $10k to see if this continues. Will post further updates and every payment received on hereUPDATEhttps://imgur.com/a/ljC8YGlThat’s the thing, rocketpot still hasn’t given a direct answer or confirmation if they’ll honouring the full amount. When I asked today for the update regarding it, I was told this(see pic). In fairness to rocketpot they have started paying out what’s allowed within in their limits and they have honoured their word on these payouts. Trust me there’s no one that would love to change the thread title more than me, but for now untill I get a answer allI can do is just post every payment I receive on here(which is still positive news) I also asked if there is any way they can raise their monthly limits they cannot. So after I request a another $10k on Monday the 11th I’m gonna be waiting till August 1st before I can request a further payout. The reality is getting paid out in full is gonna take a long time and this will be an extruding long process",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404841",
  "comments": [
    {
      "author": "Lilacthrow123",
      "created_time": "July 02, 2022, 08:36:03 AM",
      "body": "New update posted",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "July 02, 2022, 02:29:53 PM",
      "body": "Now they have a financial manager in the picture, there was none in their first communication, they should have told you that in the first place they have a financial manager to check your status, I hope this will not drag on as we have been, not only you taken by a ride, they should have pay what they promise, I would have praised these people if they honor their promise, but they keep on delaying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lilacthrow123",
      "created_time": "July 02, 2022, 05:21:55 PM",
      "body": "Quote from: coin-investor on July 02, 2022, 02:29:53 PMNow they have a financial manager in the picture, there was none in their first communication, they should have told you that in the first place they have a financial manager to check your status, I hope this will not drag on as we have been, not only you taken by a ride, they should have pay what they promise, I would have praised these people if they honor their promise, but they keep on delaying.Exactly, their communication has been very inconsistent. Just to recap, first they decline the withdrawal and say “dishonest behaviour” with an explanation of “I activated the bonus funds and then collect bonuses or spins in a game directly. Then I go and cancel or lose the bonus funds. After that I go back into the game collect the spins or bonus and have it added to real balance” again that doesn’t make any sense as you can see from the proof/pics posted this is a lie and simply not true, as I never canceled or lost the bonus. I cleared the 100x wager requirements for it. At one point I was down to my last $140 from the bonus funds and placed it on sweet bonanza candy land game show and hit a 60x for around $4800ish here is the game history for that bet https://imgur.com/a/MWqgvgE and from there cleared the bonus playing multiple games such as Slots, table games and game shows. Point being I got extremely lucky and had I lost that last $140 bet I would of lost and never went on the insanely lucky run I went on. Moving forward after I explain to them I cleared the bonus wager requirements and never canceled or lost the bonus the next day they tell me my winnings are legit and that I did clear the bonus and to request a $6000 withdrawal. I also asked if they will be honoring the pay out and I was told a manager will be emailing you, could this be the finance manager? Here’s a continuation of the chat Thursday with Sofia after she confirmed the winnings are legit and to request a $6000 withdrawal https://imgur.com/a/OPTUXuuThis chat took place Thursday and I was told Friday latest Now it’s Saturday and I’m being told my case is being handled by the finance manager and to continue waiting. Further delaying",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MonsterV",
      "created_time": "July 02, 2022, 08:28:01 PM",
      "body": "I've read through the story and find the story of the Rocketpot representative on support to be very fuzzy. I can't think of any reason why they wouldn't pay out, probably not themselves and so they've decided to hold your money. I give you little hope. I don't think there is a representative of the site here on the forum, otherwise communication would be a lot easier. In any case, keep us informed about the situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "July 02, 2022, 08:58:35 PM",
      "body": "From what I can see they have no intention of paying you, but as there is that old saying: \"You shouldn't lose hope\" so you have to keep insisting on contacting them so they can solve your problem. while you are in the dialogue with them, you have to put three things in this thread:1 - their Ann thread2 - Their profile (in this case, their account profile on this forum)3 - FlagI know they are not active, but at least it will serve to alert other people when they do research on this site",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "July 02, 2022, 10:39:34 PM",
      "body": "I hope after all that we posted about this casino, they will not get back to you and accuse you of ruining their reputation when they already promised that they will pay, I have seen this scenario in the past, you just did the right thing posting all that happens here and do not rely on their promise, if their intention is to pay they will do it without further delay and agitate you.They will have more alibis coming, if there's still no payment coming it's time to create a flag and we will support it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lilacthrow123",
      "created_time": "July 02, 2022, 11:07:04 PM",
      "body": "Quote from: Slow death on July 02, 2022, 08:58:35 PMFrom what I can see they have no intention of paying you, but as there is that old saying: \"You shouldn't lose hope\" so you have to keep insisting on contacting them so they can solve your problem. while you are in the dialogue with them, you have to put three things in this thread:1 - their Ann thread2 - Their profile (in this case, their account profile on this forum)3 - FlagI know they are not active, but at least it will serve to alert other people when they do research on this siteHow do I do all this? Sorry I’m a new member to this forum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "July 02, 2022, 11:21:07 PM",
      "body": "Quote from: Lilacthrow123 on July 02, 2022, 11:07:04 PMHow do I do all this? Sorry I’m a new member to this forum In other words, you should edit and add more information in the OP such as;1 - their Ann thread - https://bitcointalk.org/index.php?topic=5178376.02 - Their profile (in this case, their account profile on this forum) - https://bitcointalk.org/index.php?action=profile;u=26410093 - Flag - Open the link of their profile >>> click on trust >>> under new feedback, next to negative, there is an option to add a flag >>> click on add a flag >>> you can create both flag one and two.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lilacthrow123",
      "created_time": "July 02, 2022, 11:31:21 PM",
      "body": "Quote from: Bitcoin_Arena on July 02, 2022, 11:21:07 PMQuote from: Lilacthrow123 on July 02, 2022, 11:07:04 PMHow do I do all this? Sorry I’m a new member to this forum In other words, you should edit and add more information in the OP such as;1 - their Ann thread - https://bitcointalk.org/index.php?topic=5178376.02 - Their profile (in this case, their account profile on this forum) - https://bitcointalk.org/index.php?action=profile;u=26410093 - Flag - Open the link of their profile >>> click on trust >>> under new feedback, next to negative, there is an option to add a flag >>> click on add a flag >>> you can create both flag one and two.Done. Thanks for this, much appreciated.As for the flag based on current communication I’ll be waiting till Monday. If Monday is just much of the same and further delays I will flagging, as well as writing formal complaints on multiple casino review websites such as askgamblers, casinoguru etc…",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "July 03, 2022, 02:03:22 PM",
      "body": "Quote from: Lilacthrow123 on July 02, 2022, 11:31:21 PMQuote from: Bitcoin_Arena on July 02, 2022, 11:21:07 PMQuote from: Lilacthrow123 on July 02, 2022, 11:07:04 PMHow do I do all this? Sorry I’m a new member to this forum In other words, you should edit and add more information in the OP such as;1 - their Ann thread - https://bitcointalk.org/index.php?topic=5178376.02 - Their profile (in this case, their account profile on this forum) - https://bitcointalk.org/index.php?action=profile;u=26410093 - Flag - Open the link of their profile >>> click on trust >>> under new feedback, next to negative, there is an option to add a flag >>> click on add a flag >>> you can create both flag one and two.Done. Thanks for this, much appreciated.As for the flag based on current communication I’ll be waiting till Monday. If Monday is just much of the same and further delays I will flagging, as well as writing formal complaints on multiple casino review websites such as askgamblers, casinoguru etc… It's really sad to see they haven't paid the 6k they told you to request. If Monday comes and goes and you still see no pay send me a message and remind me to tag them for you. (looks like jawhead has already tagged them)You should also consider opening a flag against them to warn possible future depositors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "July 04, 2022, 07:08:45 AM",
      "body": "Thanks to CryptoHeadlineNews for posting this on your other thread but Rocketpo.io already has an existing complaint, that's very similar to yours, and it goes back to OCTOBER 21, 2021, and the issue has not been resolved up to this day.https://www.askgamblers.com/casino-complaints/rocketpot-casino-closed-account-and-not-responding-1",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "July 04, 2022, 02:04:09 PM",
      "body": "it's Monday now, has there been an update? have they said anything regarding the 6k withdrawal request or about their \"financial manager\"? reading the post robelneo linked. it is quite concerning especially when the things they are doing right now are quite similar to the post robelneo shared.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aew",
      "created_time": "July 04, 2022, 04:59:19 PM",
      "body": "Is there any update ? Also avoid such a cheap casinos with limits on withdrawals daily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lilacthrow123",
      "created_time": "July 04, 2022, 08:14:42 PM",
      "body": "UPDATEhttps://imgur.com/a/RkJwgydGood news rocketpot has paid out $16k so far. They processed the $6000 withdrawal Sunday and has already paid out the $10000 for this week following their limits. So so far I’ve received $16k of the $170k+. Good news is there was no delay in the $10k payout for this week.  Unfortunately still have no direct answer or confirmation from rocketpot if they will be paying out and honoring the full 170k+ in winnings waiting on the appropriate manager update for that. Now following their withdrawal limits I am waiting till next week to request another $10k to see if this continues. Will post further updates and every payment received on here",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aew",
      "created_time": "July 04, 2022, 08:27:51 PM",
      "body": "Quote from: Lilacthrow123 on July 04, 2022, 08:14:42 PMUPDATEhttps://imgur.com/a/RkJwgydGood news rocketpot has paid out $16k so far. They processed the $6000 withdrawal Sunday and has already paid out the $10000 for this week following their limits. So so far I’ve received $16k of the $170k+. Good news is there was no delay in the $10k payout for this week.  Unfortunately still have no direct answer or confirmation from rocketpot if they will be paying out and honoring the full 170k+ in winnings waiting on the appropriate manager update for that. Now following their withdrawal limits I am waiting till next week to request another $10k to see if this continues. Will post further updates and every payment received on hereGood to hear that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JollyGood",
      "created_time": "July 05, 2022, 11:16:53 AM",
      "body": "I am waiting for news about the rest of the money you are claiming. The amount is huge and any delays in receiving it will be affecting you on several levels. I think they have made steps in the right direction but Rocketpot needs to much more.Quote from: Lilacthrow123 on July 04, 2022, 08:14:42 PMUPDATEhttps://imgur.com/a/RkJwgydGood news rocketpot has paid out $16k so far. They processed the $6000 withdrawal Sunday and has already paid out the $10000 for this week following their limits. So so far I’ve received $16k of the $170k+. Good news is there was no delay in the $10k payout for this week.  Unfortunately still have no direct answer or confirmation from rocketpot if they will be paying out and honoring the full 170k+ in winnings waiting on the appropriate manager update for that. Now following their withdrawal limits I am waiting till next week to request another $10k to see if this continues. Will post further updates and every payment received on here",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "July 05, 2022, 04:10:39 PM",
      "body": "Quote from: Lilacthrow123 on July 04, 2022, 08:14:42 PMUPDATEhttps://imgur.com/a/RkJwgydGood news rocketpot has paid out $16k so far. They processed the $6000 withdrawal Sunday and has already paid out the $10000 for this week following their limits. So so far I’ve received $16k of the $170k+. Good news is there was no delay in the $10k payout for this week.  Unfortunately still have no direct answer or confirmation from rocketpot if they will be paying out and honoring the full 170k+ in winnings waiting on the appropriate manager update for that. Now following their withdrawal limits I am waiting till next week to request another $10k to see if this continues. Will post further updates and every payment received on hereI'm happy for you but I will advise you not to celebrate yet because it is never a good idea to play in a casino that has an unresolved issue on Ask Gamblers according to the link provided here. Meanwhile, they only promised to pay you $16K out of $170K and they have paid you $10K so far. If they are going to pay you the money have it in mind that they will pay you weekly or monthly because the amount is huge. In the meantime, I hope you get all your fund.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lilacthrow123",
      "created_time": "July 06, 2022, 05:18:25 PM",
      "body": "UPDATEhttps://imgur.com/a/ljC8YGlThat’s the thing, rocketpot still hasn’t given a direct answer or confirmation if they’ll honouring the full amount. When I asked today for the update regarding it, I was told this(see pic). In fairness to rocketpot they have started paying out what’s allowed within in their limits and they have honoured their word on these payouts. Trust me there’s no one that would love to change the thread title more than me, but for now untill I get a answer allI can do is just post every payment I receive on here(which is still positive news) I also asked if there is any way they can raise their monthly limits they cannot. So after I request a another $10k on Monday the 11th I’m gonna be waiting till August 1st before I can request a further payout. The reality is getting paid out in full is gonna take a long time and this will be an extruding long process",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "July 06, 2022, 05:53:04 PM",
      "body": "Quote from: Lilacthrow123 on July 06, 2022, 05:18:25 PMThe reality is getting paid out in full is gonna take a long timeWhether they will pay you the full sum or not, that's the fact. It's pretty much understandable why they are not going to pay you in full. It's because of their liquidity. Very much likely that if they pay you the full amount at once, they will lack of liquidity and as a result, bankruptcy. Since, they have taken step and promised to pay you installment, you have no other option but to bear with that decision.Good luck man.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}