{
  "id": "topic_5416965",
  "title": "Dr.Bitcoin_Strange",
  "author": "Dr.Bitcoin_Strange",
  "created_time": "October 13, 2022, 11:44:06 AMLast edit: October 13, 2022, 01:04:21 PM by Dr.Bitcoin_Strange",
  "content": "Concerning myself:I am 23 years old by age, an undergraduate with the zeel to explore more crypto knowledge and archive success in crypto investment.When my curiosity woke up:I was still a novice in crypto back in 2019, with zero interest. I only saw crypto as a means of throwing away one's money all in the name of investment, but after attending a seminar in school with the theme \"Giving Empowerment to the Rising Youth,\" I was inspired to learn more about Bitcoin. I thought I was privileged to have had a friend who was very knowledgeable about cryptocurrency, but his interest in teaching others was just a little too small. He all but concealed knowledge from me. To be frank, after the seminar in school, my curiosity to learn about Bitcoin woke up, but there was no one to teach me.Erroneous cryptocurrency information:From the seminar, they thought I meant to earn free cryptocurrency through telegram bots and other airdrop platforms. I followed all the instructions that were given to me and put them to use, but did not earn any real reward. It made me feel bad because all my effort and the countless tasks I did were a waste of time and energy. I did many airdrops for almost 6 months but did not make any money from them. I gave up and started to learn more about Bitcoin.I fully learned about Bitcoin:I learned that in 2009, one Bitcoin was worth $0, but in 2019, it was worth $7,500 or more. This got me wondering how. But then I asked myself a rhetorical question, \"How can 1 bitcoin be worth thousands of dollars when it's something that's not physical?\" LoL, making a joke of myself. However, I decided to go to Google and do some Bitcoin research. From my research on Google, I learned about:1: the inventor of Bitcoin2: Bitcoin's Mysteries and Decentralization3: Bitcoin price influencers, Bitcoin halving, and Bitcoin whales.4: Investing in Bitcoin5: trustworthy Bitcoin purchasing platforms6: the original Bitcoin investorsAfter taking a lot of time to study all the information I found about Bitcoin, I was convinced to invest.How I fully believed in Bitcoin:I was able to invest just a little amount of cash into Bitcoin in December 2019, which I quickly sold in the month of August 2020 due to the COVID-19 pandemic that triggered a difficult time. Although I was very busy with school in 2021, I believed in Bitcoin when its price rose to $68k that year. I learned here that Bitcoin's price is down due to:QuoteHigh, unsupressable inflation is the primary reason the United States Federal Reserve is raising interest rates. And since rate hikes began in March 2022, Bitcoin and the broader crypto market have been in a correction.but I think the 2024 halving will be better for Bitcoin.Difficulty in learning about Bitcoin:I went through a lot of stress to gain the little knowledge I have about crypto/Bitcoin. I understand Bitcoin is a good store of value, and so its knowledge should not be hidden from people who are willing to learn about Bitcoin, like myself, and how my friend never wanted me to learn anything about Bitcoin. I joined this forum to add to my crypto knowledge and I hope to learn more and also teach my friends who want to learn.Updated I learned from articles on the links below.https://www.[Suspicious link removed]s/www.businessinsider.com/personal-finance/bitcoin-halving%3famphttps://www.forbes.com/advisor/investing/cryptocurrency/best-crypto-exchanges/https://www.investopedia.com/terms/b/bitcoin.asphttps://en.m.wikipedia.org/wiki/Satoshi_Nakamotohttps://www.forbes.com/advisor/investing/cryptocurrency/bitcoin-price-history/#:~:text=Since%20then%2C%20Bitcoin%20has%20seen,nearly%20%2469%2C000%20in%20November%202021.Dr.Bitcoin_strange",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416965",
  "comments": [
    {
      "author": "cryptoaddictchie",
      "created_time": "October 13, 2022, 12:45:31 PM",
      "body": "Good for you at a young age you already familiarize yourself with bitcoin and other related blockchain information with it.Since you mentioned 6 of your reseaerched. I think its better if you could attached the details youve found out about it so if theres a mistake or wrong info on what you learned then we can comment and correct that. Like the founder of Bitcoin, I do hope you find the answer as \"Satoshi\" and not some reference directing to Craig Wright.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "October 13, 2022, 01:37:51 PM",
      "body": "Quote from: Dr.Bitcoin_Strange on October 13, 2022, 11:44:06 AMI was still a novice in crypto back in 2019, with zero interest. I only saw crypto as a means of throwing away one's money all in the name of investment, but after attending a seminar in school with the theme \"Giving Empowerment to the Rising Youth,\" I was inspired to learn more about Bitcoin. I thought I was privileged to have had a friend who was very knowledgeable about cryptocurrency, but his interest in teaching others was just a little too small. He all but concealed knowledge from me. To be frank, after the seminar in school, my curiosity to learn about Bitcoin woke up, but there was no one to teach me.Wherever you learn about crypto it is a good thing for you to do even I always recommend beginners who come to learn first before investing dealing with money, so the basics are more important. In this forum you can find more knowledge about Bitcoin and other Crypto, I'm sure you will find it when you don't know it but believe me if you search it you will find what you are looking for to learn even though there are many seminars out there that you can't follow you there are still forums asking about many things.And this is where you will be taught a lot.Quote from: Dr.Bitcoin_Strange on October 13, 2022, 11:44:06 AMFrom the seminar, they thought I meant to earn free cryptocurrency through telegram bots and other airdrop platforms. I followed all the instructions that were given to me and put them to use, but did not earn any real reward. It made me feel bad because all my effort and the countless tasks I did were a waste of time and energy. I did many airdrops for almost 6 months but did not make any money from them. I gave up and started to learn more about Bitcoin.Airdrops will only waste your time and indeed it does not provide rewards that are commensurate with our hard work in pursuing the airdrop, even if there is a result it is only a penny I know so never waste your time with unimportant things especially airdrops with flat telegram bots average I know from the airdrop bot is a scam.I've experienced the same thing but I've never followed that trail and it's better to invest far more than relying on airdrops that have no certainty.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "October 13, 2022, 02:50:41 PM",
      "body": "Now you believe that bitcoin is a digital currency and have the average information any newbie could have started with, but remember that the journey does not end there, you will still have to continue in learning, especially sometimes whereby you may invest and the luck went down on you to have a dip in price after your investment, expression of interest is good and your experience in this network is as important as well, wish you all the best.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ShowOff",
      "created_time": "October 13, 2022, 06:10:37 PM",
      "body": "Quote from: ajiz138 on October 13, 2022, 01:37:51 PMAirdrops will only waste your time and indeed it does not provide rewards that are commensurate with our hard work in pursuing the airdrop, even if there is a result it is only a penny I know so never waste your time with unimportant things especially airdrops with flat telegram bots average I know from the airdrop bot is a scam.I've experienced the same thing but I've never followed that trail and it's better to invest far more than relying on airdrops that have no certainty.No matter how valuable the current airdrop is, I've been ignoring it for years.If the OP and others want to earn extra but they don't want to spend their time on something like bounty or airdrops then I think the best advice for them would be a drawing contest or something. In the service section, there are some good art contests, they can apply the application.Quote from: Dr.Bitcoin_Strange on October 13, 2022, 11:44:06 AMI joined this forum to add to my crypto knowledge and I hope to learn more and also teach my friends who want to learn.Welcome, you are in the right zone. Share your thoughts on bitcoin and focus on your learning, it will increase your knowledge. Ignore the rank for a while, I don't know if you think about it either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "October 13, 2022, 08:22:39 PM",
      "body": "I hope to clear your understanding if you have gotten it wrong somewhere. Note this down it is not erroneous to think you can make it financially in bitcoin outside Investing.Yes you can actually but in that efforts and still earn in Bitcoin and accumulate, all you have to do is find what services you are great at rendering or you can also learn some if you have no prior idea and then charge in Bitcoin which you can accumulate over time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "October 13, 2022, 08:41:41 PM",
      "body": "Quote from: ShowOff on October 13, 2022, 06:10:37 PM Ignore the rank for a while, I don't know if you think about it either.. Am not bothered about rank for now, all I want is to learn and know more about Bitcoin, to also contribute with quality post in the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelvinid",
      "created_time": "October 13, 2022, 10:27:33 PM",
      "body": "We can think about the mystery of what really happened with Bitcoin and of its huge spike, I did it and I like it. In fact, even the creator doesn't think this really happens but fortunately, it makes history, and most people, rich people see the continuous price and growing adoption that even surpass the numbers who bought and hold Gold. It is a game changer in terms of investment, rich and poor are already involved with this making the demand to uplift high more than our imagination. And despite the volatility and high risk, people are coming and risking their money for they believe this will give them a better a future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}