{
  "id": "topic_5420180",
  "title": "XEN_Protocol",
  "author": "XEN_Protocol",
  "created_time": "November 09, 2022, 04:47:25 PM",
  "content": "What wallet or tools can I use to make multiple transactions to 20 different wallet addresses at once? Also I find a tool called cointool app but the gas fee is higher than if I send the transaction one by one myself, is this normal?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420180",
  "comments": [
    {
      "author": "BitcoinBarrel",
      "created_time": "November 09, 2022, 05:02:17 PM",
      "body": "Consider Electrum wallet, here is a tutorial:https://bitcointalk.org/index.php?topic=5365527.0https://electrum.org",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "November 09, 2022, 05:06:03 PM",
      "body": "Quote from: BitcoinBarrel on November 09, 2022, 05:02:17 PMConsider Electrum wallet, here is a tutorial:https://bitcointalk.org/index.php?topic=5365527.0https://electrum.orgOP isn't looking for BTC transactions I think rather a token on Ethereum or Binance chain as he has mentioned about gas fee which is more common on both Ethereum and Binance network.OP, you can try coin98 wallet for multisend. Here's a tutorial if you are looking for this- https://docs.coin98.com/products/coin98-super-app/extension/beginners-guide/multi-send",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "November 09, 2022, 07:41:16 PM",
      "body": "Quote from: Little Mouse on November 09, 2022, 05:06:03 PMOP, you can try coin98 wallet for multisend. Here's a tutorial if you are looking for this- https://docs.coin98.com/products/coin98-super-app/extension/beginners-guide/multi-sendThis is a good option. I have reviewed reports about the service and there are no complaints about it. Unfortunately, the options in this field are somewhat limited, and users must seek the assistance of those who are more experienced to choose the best option.There is also disperse application which I also consider to be a good application and is very commonly used with the exception that it charges fees for the service that it is better to compare with the fees on the rest of the options.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "November 09, 2022, 09:20:42 PM",
      "body": "Do you want to spend from 20 separate addresses, or to be more technically correct, from 20 separate Unspent Transaction Outputs, or do you want to spend to 20?In any case, use a simple, non-custodial wallet software, such as Electrum: https://electrum.org. If you want to do the former, just import the private keys and empty the wallet to a specific destination. If you want to do the latter, just fill the \"Pay to\" form like that:Code:ADDRESS_1, BTC_AMOUNTADDRESS_2, BTC_AMOUNTADDRESS_3, BTC_AMOUNTADDRESS_4, BTC_AMOUNTetc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "November 09, 2022, 10:43:28 PM",
      "body": "I guess you should mentioned what coin you are trying to send multiple transaction at once. Because every blockchain based token has its own tool.Here you can check this tools. Disperse were mentioned already above. Multisender is a tool for ethereum based tokens while bulksender have it different network support such as binance, ethereum, tron, matic, AVAX and solana network.Code:https://disperse.app/https://bulksender.app/https://multisend.org/Now if you're talking about bitcoin, then electrum is the best choice as already mentioned many times above.Another note, this multi sender is probably uses large gas fees, because they are designed to send at least 20 transactions above or so. So expect that fees they required is high. Disperse.app is somewhat the cheapest fees required on the list above.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "November 09, 2022, 11:16:37 PM",
      "body": "I guess this is all about ETH network sending coin/token to multiple addresses.Becareful on using closed source tool cointool.app is a good suggestion above but this one below is better than that.- https://github.com/rstormsf/multisenderIt was share here long time ago and until now many users here use it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "November 10, 2022, 01:25:35 AM",
      "body": "for the bitcoin i never been using it or know how to send in batch hahah but if you want to send via Ethereum and BinanceSmart Chain or other EVM Compatible chain u can using this https://multisender.app/ and https://bulksender.app/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "November 10, 2022, 04:52:34 AM",
      "body": "Quote from: XEN_Protocol on November 09, 2022, 04:47:25 PMWhat wallet or tools can I use to make multiple transactions to 20 different wallet addresses at once? Also I find a tool called cointool app but the gas fee is higher than if I send the transaction one by one myself, is this normal? The prices are volatile now, dump at the moment and that possible the fee is more growing up than usual. Many transaction are in and out from wallet to exchange, and vice versa. I think whatever wallet you want to use is the same, the fee is not predictable, it could be growing up from today. There have site which you can use to multiple send, https://multisend.org, but I never tried. dwyor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "XEN_Protocol",
      "created_time": "November 10, 2022, 06:12:09 AM",
      "body": "Quote from: Little Mouse on November 09, 2022, 05:06:03 PMQuote from: BitcoinBarrel on November 09, 2022, 05:02:17 PMConsider Electrum wallet, here is a tutorial:https://bitcointalk.org/index.php?topic=5365527.0https://electrum.orgOP isn't looking for BTC transactions I think rather a token on Ethereum or Binance chain as he has mentioned about gas fee which is more common on both Ethereum and Binance network.OP, you can try coin98 wallet for multisend. Here's a tutorial if you are looking for this- https://docs.coin98.com/products/coin98-super-app/extension/beginners-guide/multi-sendYes 👍, I am not looking for BTC sending tool but for altcoins like BNB and others like Fantom etc, thanks for all your feedback guys.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Magic-Money",
      "created_time": "November 23, 2022, 11:33:41 AM",
      "body": "Quote from: XEN_Protocol on November 09, 2022, 04:47:25 PMWhat wallet or tools can I use to make multiple transactions to 20 different wallet addresses at once? Also I find a tool called coin tool app but the gas fee is higher than if I send the transaction one by one myself, is this normal? Use a Trust Wallet App, is more helpful to choose BNB, Tron or Matic chains for any given transaction and they are low transaction fees that the wallet can accumulate difference type of chain in one wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "November 23, 2022, 06:18:33 PM",
      "body": "Cointool.app is very good for multi sending tokens and coins and it's available for many chains like BSC, ETH, FTM, EVMOS and many others.It's the first one that allows NFT multi-sending too, this is still a very rare combo in the crypto space right now and this platform is fully open-source, and highly recommended.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "November 23, 2022, 07:02:50 PM",
      "body": "Quote from: XEN_Protocol on November 10, 2022, 06:12:09 AM<...>Yes 👍, I am not looking for BTC sending tool but for altcoins like BNB and others like Fantom etc, thanks for all your feedback guys. This is the bitcointalk.org forum. All questions related to altcoins should be posted in the Altcoins section of this forum. Find the \"move\" function at the foot of this thread, and move it to the correct board.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EluguHcman",
      "created_time": "July 18, 2024, 05:50:45 AM",
      "body": "Quote from: XEN_Protocol on November 09, 2022, 04:47:25 PMWhat wallet or tools can I use to make multiple transactions to 20 different wallet addresses at once? Also I find a tool called cointool app but the gas fee is higher than if I send the transaction one by one myself, is this normal? The percentage of charge fees you get depends on you coin you are transacting with. There are network pools that assumes these fees so you can not get precise feedback as no one knows your coins.As for multiple at a time, that is far unknown to me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}