{
  "id": "topic_5471060",
  "title": "She shining",
  "author": "She shining",
  "created_time": "October 20, 2023, 03:13:56 PM",
  "content": "I have always frowned towards court marriage with a man signing half of his wealth in case of a divorce. I see one post here wey talk about men wey don dey keep their asset for block chain to protect their wealth in case of divorce. White people don get detective/forensic wey dem dey use take track the digital currency for situations like dis. E dey hard but sometimes dem dey run ahn and the woman go take her share.My question na b say naija court dey ask for person crypto wen dem dey talk asset to share for divorce?Na bad thing for man to keep some of his asset away from court proceedings?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471060",
  "comments": [
    {
      "author": "Zanab247",
      "created_time": "October 20, 2023, 04:43:23 PM",
      "body": "Quote from: She shiningWhite people don get detective/forensic wey dem dey use take track the digital currency for situations like dis. E dey hard but sometimes dem dey run ahn and the woman go take her share. things like dis can only happen in white man country because, deir lawyers and judges no everything about crypto assets, and dey must include crypto among d things court is going to share among the two husband and wife, but if something like dis happen in our country it will b very difficult for Naija lawyers and judges to include crypto among the properties dey are going to share which it will give d man freedom to enjoy his crypto.Quote  My question na b say naija court dey ask for person crypto wen dem dey talk asset to share for divorce?Na bad thing for man to keep some of his asset away from court proceedings?Na Wetin dey make men dey run for Court marriage b that because, once divorce don enter the marriage court must stand on deir ground to share deir things equal in a way d two couples will live in a separate life forever. For lawyer to include crypto assets in d divorce maybe d woman informed her lawyer to inform d judge that her husband is a crypto investors but it will be very difficult for dem to have access to dem because, crypto is banned from Naija which will stop d judge not to pronounce such judgment in d court to save his career.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}