{
  "id": "topic_5410276",
  "title": "themaxx",
  "author": "themaxx",
  "created_time": "August 17, 2022, 08:20:35 PM",
  "content": "Hi, does anyone have thoughts on https://formation.fi? The token has been dropped from an all time high of $0.40 to $0.003, but it seems to be a solid project - experienced team, external funding, doxxed team, defi platform, roadmap that's being worked on.I don't understand why the token is so low - is the defi platform never going to make any money?Any thoughts are greatly appreciated.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410276",
  "comments": [
    {
      "author": "ryzaadit",
      "created_time": "August 17, 2022, 08:51:13 PM",
      "body": "Some people are gonna to said.\"Exchange\" trading in not top exchange ~XD as you know \"Gate & Kucoin\" are easily to be entered. If you have connection inside the launchpad, then launching on there is really easy. What they need, listened to some popular exchange with a hard requirement while the exchange never advertised listing in \"Telegram\".I work with some project and know the process system for \"KOLs, Investment VC & others\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoperkele",
      "created_time": "August 17, 2022, 11:32:13 PM",
      "body": "Quote from: themaxx on August 17, 2022, 08:20:35 PMHi, does anyone have thoughts on https://formation.fi? The token has been dropped from an all time high of $0.40 to $0.003, but it seems to be a solid project - experienced team, external funding, doxxed team, defi platform, roadmap that's being worked on.I don't understand why the token is so low - is the defi platform never going to make any money?Any thoughts are greatly appreciated.I was sure that this would be another uninteresting shitcoin but i am sucker for hidden gems, and this might actually be one. Being low as an unknown coin in this market is quite normal, and seems like they launched right when bear started so it's understandable. And could take a while until this gets confidence to rise. Even a year or so.However i am definitely reading more about this and going to follow this post as i am interested what people have to say.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "August 17, 2022, 11:43:23 PM",
      "body": "Quote from: cryptoperkele on August 17, 2022, 11:32:13 PMI was sure that this would be another uninteresting shitcoin but i am sucker for hidden gems, and this might actually be one. Being low as an unknown coin in this market is quite normal, and seems like they launched right when bear started so it's understandable. And could take a while until this gets confidence to rise. Even a year or so.However i am definitely reading more about this and going to follow this post as i am interested what people have to say. If the OP wants to keep up with the project and assess its potential, he needs to follow the social media channels of this project.In that manner, he will understand more why the price is down and if there is hope that it will go up again.One can't understand the project if he is not familiar with the project itself. So for the OP to understand better this project, he needs to study and do more research. He can also get good insights from the discussion in their social media channels.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoperkele",
      "created_time": "August 18, 2022, 05:23:07 AM",
      "body": "Quote from: TimeTeller on August 17, 2022, 11:43:23 PMIf the OP wants to keep up with the project and assess its potential, he needs to follow the social media channels of this project.In that manner, he will understand more why the price is down and if there is hope that it will go up again.One can't understand the project if he is not familiar with the project itself. So for the OP to understand better this project, he needs to study and do more research. He can also get good insights from the discussion in their social media channels.Yes, but op was asking about OUR thoughts about the project and i answered and OP already seems to be familiar about the project. And knowing about it doesn't mean you would know why the price dropped.Also i am not sure why you were quoting me, as you weren't obvously answering to me, nor the question OP was asking about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "themaxx",
      "created_time": "August 18, 2022, 11:47:12 AM",
      "body": "Quote from: TimeTeller on August 17, 2022, 11:43:23 PMIf the OP wants to keep up with the project and assess its potential, he needs to follow the social media channels of this project.In that manner, he will understand more why the price is down and if there is hope that it will go up again.One can't understand the project if he is not familiar with the project itself. So for the OP to understand better this project, he needs to study and do more research. He can also get good insights from the discussion in their social media channels.Thanks for the response. I've been looking through their telegram and it's quite active but no clues as to why the token has dumped so much. I'm going through the discord now (also very active) to see if I can find any hints.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "themaxx",
      "created_time": "August 18, 2022, 11:48:12 AM",
      "body": "Quote from: Wahyuihib on August 18, 2022, 12:46:54 AMI've seen the concept and partners of this Project.And in fact the price of tokens owned is getting less and less valuable.Or it could be the lack of promotion that causes the $Form token to become less valuable and get less attention from investors.Because good promotion is an important factor in the success of a crypto product and project Yes I'm also confused as to why it keeps going down. Promotion is important, but if the product is good the token should go up in price, right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "themaxx",
      "created_time": "August 18, 2022, 11:54:11 AM",
      "body": "Quote from: cryptoperkele on August 18, 2022, 05:23:07 AMYes, but op was asking about OUR thoughts about the project and i answered and OP already seems to be familiar about the project. And knowing about it doesn't mean you would know why the price dropped.Also i am not sure why you were quoting me, as you weren't obvously answering to me, nor the question OP was asking about.   I'm researching now, will come back to this thread if I find something. I'm really     because the market is saying that this token is basically worthless, but when I dig into the project it looks like it has promise. Maybe not the $0.40 ATH but it's got to be worth more than its current price - sure at least $0.01 or something??? On that basis I threw a couple of bucks at it last night. Unless it's a complete scam??? If anyone has any insights please post here!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittick",
      "created_time": "August 19, 2022, 03:01:39 AM",
      "body": "You did even see the price was going down so hard and then where's a good thing from a token that dumped so hard like that? This is another shit coin that will be dead soon. Keep in your mind that investing in this shit pretty much the same like giving your money easily to the scammers. Even this time the price is still going down. You can take your own conclusion. Don't be so mad because this is obvious scam token.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "masterrex",
      "created_time": "August 19, 2022, 07:12:45 AM",
      "body": "IMO, I dont understand why still too many, Defi projects that came out of nowhere, armed with just copycat concepts and functionality, they don't consider the truth that some early Defi projects are already gone bankrupt, so I don't think it's still an attractive structure, too many projects competing for a very limited market size thats was too risky in my opinion. so just take time to think about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "themaxx",
      "created_time": "August 19, 2022, 07:56:32 AM",
      "body": "Quote from: bittick on August 19, 2022, 03:01:39 AMYou did even see the price was going down so hard and then where's a good thing from a token that dumped so hard like that? This is another shit coin that will be dead soon. Keep in your mind that investing in this shit pretty much the same like giving your money easily to the scammers. Even this time the price is still going down. You can take your own conclusion. Don't be so mad because this is obvious scam token. I said in the first post that price had gone down hard. I said it could be a scam, which is why I was asking for people's thoughts. But there could be other reasons why the price had gone down - the bear market is a factor, and in the discord someone said that single sided staking at 70% APR caused selling but that's been ended. Is that the reason? I don't know, I'm hoping smarter people will weigh in.I'm thinking about it like this - there's a 90% chance that this could go to zero (scam, no product fit, product doesn't work). If that happens I've lost $100. There's a 10% chance that this could go to $0.01 - if that happens I've made $3100. I think it's a good investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "themaxx",
      "created_time": "August 19, 2022, 07:57:11 AM",
      "body": "Quote from: masterrex on August 19, 2022, 07:12:45 AMIMO, I dont understand why still too many, Defi projects that came out of nowhere, armed with just copycat concepts and functionality, they don't consider the truth that some early Defi projects are already gone bankrupt, so I don't think it's still an attractive structure, too many projects competing for a very limited market size thats was too risky in my opinion. so just take time to think about it.  This is a good point, thank you for sharing your knowledge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "super bako",
      "created_time": "August 19, 2022, 11:59:14 AM",
      "body": "From a concept point of view, the project is good. what I don't like about their team is that they are not visible in activities or are not open, many projects have occurred that are not visible from the team that appear to be scammed. if they do any project marketing activities they might be able to attract investors",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "themaxx",
      "created_time": "August 19, 2022, 12:12:14 PM",
      "body": "Quote from: super bako on August 19, 2022, 11:59:14 AMFrom a concept point of view, the project is good. what I don't like about their team is that they are not visible in activities or are not open, many projects have occurred that are not visible from the team that appear to be scammed. if they do any project marketing activities they might be able to attract investorsThanks for your insights!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nira09",
      "created_time": "August 19, 2022, 04:31:52 PM",
      "body": "I got a glimpse of this project, What you said is right, it should be a pretty good project because it has a lot of good support and has solutions to some of the current DEFI problems. If in the future their product is really useful, then the possibility of their token price returning to ATH is quite high. and Buy it now there is a potential profit of 200x.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Moshi Moshi",
      "created_time": "August 19, 2022, 05:45:53 PM",
      "body": "Quote from: themaxx on August 17, 2022, 08:20:35 PMHi, does anyone have thoughts on https://formation.fi? The token has been dropped from an all time high of $0.40 to $0.003, but it seems to be a solid project - experienced team, external funding, doxxed team, defi platform, roadmap that's being worked on.I don't understand why the token is so low - is the defi platform never going to make any money?Any thoughts are greatly appreciated.Thank you in advance for providing this information, and yes, I have analyzed it, I think the Formation.fi project is quite good, it is proven that FORM listings on Tier 1, such as Gateio and Kucoin, are certainly good to support those fundamentals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "August 19, 2022, 09:39:23 PM",
      "body": "Quote from: nira09 on August 19, 2022, 04:31:52 PMI got a glimpse of this project, What you said is right, it should be a pretty good project because it has a lot of good support and has solutions to some of the current DEFI problems. If in the future their product is really useful, then the possibility of their token price returning to ATH is quite high. and Buy it now there is a potential profit of 200x.I’ve seen this project before and I’m shock to see it’s current price well it’s expected though since we came from a bear market and almost all projects reach their bottom price the big challenge for this project is to rise again. Though it’s risky to buy but if you really believe on this project and believe that it can be a good one again, having that 200x profit is really possible and more realistic, though it will take time before it recovers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbterryboy",
      "created_time": "August 20, 2022, 02:44:39 AM",
      "body": "Quote from: themaxx on August 17, 2022, 08:20:35 PMHi, does anyone have thoughts on https://formation.fi? The token has been dropped from an all time high of $0.40 to $0.003, but it seems to be a solid project - experienced team, external funding, doxxed team, defi platform, roadmap that's being worked on.I don't understand why the token is so low - is the defi platform never going to make any money?If it is a solid project then why would its price drop hard? Oh well, it might be cause of the recent bear because even the solid projects like eth and btc do also experience the same thing. Something about the team and the roadmap can be faked easily. So, it's not enough to convince a wise investor if that's the only thing that they are going to show.Also you forgot to describe if what was the project all about? You only mentioned that it is defi but my guess is it's some kind of a lending platform? Dunno why but that was the first thing that pop in my head. Maybe because of that word finance in its name. Defi isn't dead yet and it is still possible to make money out of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hichamito37",
      "created_time": "August 20, 2022, 04:32:03 AM",
      "body": "Quote from: themaxx on August 17, 2022, 08:20:35 PMHi, does anyone have thoughts on https://formation.fi? The token has been dropped from an all time high of $0.40 to $0.003, but it seems to be a solid project - experienced team, external funding, doxxed team, defi platform, roadmap that's being worked on.I don't understand why the token is so low - is the defi platform never going to make any money?Any thoughts are greatly appreciated.You are the one doing research on it so I think you understand it better than we do, with these tokens I have never researched or learned about them. You should join social media channels and follow them, you can directly talk to the project team so they can answer your questions and get a better understanding.  As for the price, you can see all the projects are in equally bad condition right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoperkele",
      "created_time": "August 21, 2022, 10:25:56 PM",
      "body": "Quote from: themaxx on August 19, 2022, 07:56:32 AMI said in the first post that price had gone down hard. I said it could be a scam, which is why I was asking for people's thoughts. But there could be other reasons why the price had gone down - the bear market is a factor, and in the discord someone said that single sided staking at 70% APR caused selling but that's been ended. Is that the reason? I don't know, I'm hoping smarter people will weigh in.I'm thinking about it like this - there's a 90% chance that this could go to zero (scam, no product fit, product doesn't work). If that happens I've lost $100. There's a 10% chance that this could go to $0.01 - if that happens I've made $3100. I think it's a good investment.Honestly, speaking from having experience of trading cryptos since 2014, price dropping has ton of reasons other then pure scam. You can spot scams usually from lack of transparency and blaming anyone but people themselves. Some times obviously community reacts by selling it to the ground but if you can't see any good reason for it to be scam, it could be either the fact people are slowly accumulating, no one wants to shill a project that they don't have pockets full. Or the fact is that thay project isn't needed, which is the major reason. Normal people just don't see that because they can't read the code or compare it to competition.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}