{
  "id": "topic_5400897",
  "title": "Loco1887",
  "author": "Loco1887",
  "created_time": "May 31, 2022, 05:59:20 PM",
  "content": "1/6 Bitcoin (BTC)1/6 Ethereum (ETH)1/6 Polygon (MATIC)1/6 ApeCoin (APE)1/6 Aave (AAVE)1/6 Astar (ASTR)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400897",
  "comments": [
    {
      "author": "Mosharafhh",
      "created_time": "May 31, 2022, 06:23:38 PM",
      "body": "I dont know about apecoin future but all others are looking good to hold for long term. But without this chart you can also hold some of your investment on BNB because its also very potential and have a great future so i will suggest most to invest on ETH, BTC, BNB",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "May 31, 2022, 06:48:34 PM",
      "body": "Ape should be remove.I don't even know that, it's that a coin/token from BoreApe ? If yes, better to remove it. If you want to know, the HYPE of NFTs has been bubble. Now everything related to some MEME NFTs has been down.Everyone know, NFTs investment like that is more shitty rather than shitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "usekevin",
      "created_time": "May 31, 2022, 07:19:25 PM",
      "body": "In this list, bitcoin was all the time best option to inverse your money.Many bitcoin investors was became a good profit earning person and they became a millionaire and billionaire. The current situation of the bitcoin was very low and bearish.So it's best time to inverse in the cryptocurrency for the long run profit.Ethereum and Matic was everygreen project for your investments,people inverse on this two coin will earn huge profit after the pump market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "topman21",
      "created_time": "May 31, 2022, 07:30:36 PM",
      "body": "Quote from: Loco1887 on May 31, 2022, 05:59:20 PM1/6 Bitcoin (BTC)1/6 Ethereum (ETH)1/6 Polygon (MATIC)1/6 ApeCoin (APE)1/6 Aave (AAVE)1/6 Astar (ASTR)The portfolio list that you have created for long term investment is quite acceptable.However, if you want to invest for a long time, then you can definitely invest by buying Bitcoin Ethereum Polygon APE Coin etc.Then you will definitely get a big return on your long-term investment.With this you can invest Binance Coin BNB for long time. It is a very good long time investment coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AdryJoel",
      "created_time": "May 31, 2022, 08:55:46 PM",
      "body": "Quote from: Loco1887 on May 31, 2022, 05:59:20 PM1/6 Bitcoin (BTC)1/6 Ethereum (ETH)1/6 Polygon (MATIC)1/6 ApeCoin (APE)1/6 Aave (AAVE)1/6 Astar (ASTR)I think the NFT could be a long-term investment in the near future. I am following some interesting NFT projects, which seem to me will be successful and profitable soon. For example, one blockchain-based NFT game \"reptile chronicles\" has great potential. This project has deep and unique lore, this option will give the project to be fascinating for a long time. What do you think about it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "isaac_clarke22",
      "created_time": "May 31, 2022, 09:04:47 PM",
      "body": "Quote from: Loco1887 on May 31, 2022, 05:59:20 PM1/6 Bitcoin (BTC)1/6 Ethereum (ETH)1/6 Polygon (MATIC)1/6 ApeCoin (APE)1/6 Aave (AAVE)1/6 Astar (ASTR)Well you could be better if you're going to just all in Bitcoin. If you're truly into alts, go for Ethereum. I do not have an idea what the rest of your portfolio is/was all about, nor I do mind since it is your money anyway.Since you mentioned \"long-term investment\", I think you should reconsider your list of investment..... a little bit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "May 31, 2022, 09:16:22 PM",
      "body": "Aren't you tired of creating these monotonous threads with variants of your portfolio? It is not clear what you want to achieve. It's up to you to decide what to invest in and how. If you hope that you will go through a huge number of options for your portfolio and the publication of these options will somehow help you to earn or not to lose money, then you are very wrong. Invest only in what you are confident in, not in what is approved in the comments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "May 31, 2022, 09:57:07 PM",
      "body": "Quote from: Loco1887 on May 31, 2022, 05:59:20 PM1/6 Bitcoin (BTC)1/6 Ethereum (ETH)1/6 Polygon (MATIC)1/6 ApeCoin (APE)1/6 Aave (AAVE)1/6 Astar (ASTR)There are some coins  on your list I have heard about but I do not know much about them, however I think your coin distribution is too straightforward, by this I mean that while it may seem to make some sense to distribute your capital this way, as it makes sense from a math point of view, it does not makes sense from an investor point of view.The risk of your portfolio is too high because you are giving the same weight to those relatively unknown altcoins than the importance that you are giving to bitcoin and ethereum, in my opinion bitcoin and ethereum should at minimum constitute 67% of your portfolio, and then you could think about how to distribute the remaining 33% of your capital to the rest of the coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "May 31, 2022, 10:28:22 PM",
      "body": "Quote from: Loco1887 on May 31, 2022, 05:59:20 PM1/6 Bitcoin (BTC)1/6 Ethereum (ETH)1/6 Polygon (MATIC)1/6 ApeCoin (APE)1/6 Aave (AAVE)1/6 Astar (ASTR)Yes the list some how comprehensive but we know quite well that ApeCoin,  Aave and Astar, this two coins i fished out, the potential is questionable, on my own will say below is the preferable to invest on and hold for long time frame.1) Bitcoin2) Ethereum3) Litecoin4) Cardano5) BNB (binance coin)6) Solana) (TRON) and (Bitcoin Cash)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "May 31, 2022, 10:36:58 PM",
      "body": "Quote from: Loco1887 on May 31, 2022, 05:59:20 PM1/6 Bitcoin (BTC)1/6 Ethereum (ETH)1/6 Polygon (MATIC)I think this list is good for long-term investment.  They have dedicated developers and have solid community.  They are also in the market for a long time.  Aside from that, you can also add Solana, ADA, and Tron to the list.  Quote from: AdryJoel on May 31, 2022, 08:55:46 PMI think the NFT could be a long-term investment in the near future. I am following some interesting NFT projects, which seem to me will be successful and profitable soon. For example, one blockchain-based NFT game \"reptile chronicles\" has great potential. This project has deep and unique lore, this option will give the project to be fascinating for a long time. What do you think about it? I don't see NFT as good for long-term investment because the way most of them were created is to money grab.  These NFT's economic model is designed to deteriorate in value over time because over-creation makes the supply beat demand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shinratensei_",
      "created_time": "May 31, 2022, 11:40:16 PM",
      "body": "Those coins are good for long term but will you change some into the small cap tokens instead of betting into the all of big cap tokens in the market? i think this will make your portfolios more balance caused by when you are seeing it now if the small cap token has more chance to grow up compared with the big cap coin. I know that will become a safe investment for you but it's about how big the risk that will be the same as the profit that can be gotten anytime. I hope that if you will can consider it.So far your list was so good but if i were you and i will be adding some small invesments into the low cap token",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kurniawan05",
      "created_time": "June 01, 2022, 12:00:23 AM",
      "body": "All the coins you mentioned above are among the top 100 rankings according to CMC except ASTAR, however, considering the LUNA incident, there is still the possibility of failure in the long term, I hope you remain careful in investing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "June 01, 2022, 12:29:04 AM",
      "body": "Quote from: Loco1887 on May 31, 2022, 05:59:20 PM1/6 Bitcoin (BTC)1/6 Ethereum (ETH)1/6 Polygon (MATIC)1/6 ApeCoin (APE)1/6 Aave (AAVE)1/6 Astar (ASTR)Why not put majority of your portfolio on BTC and ETH?We should learn our lessons from the Luna fiasco, it was a solid and even in the top 10 but all of a sudden it was a failure and the price almost goes to 0.And with that,  Apecoin and Astar seems to be questionable investment for me, just saying.Better if you have BNB or ADA or your list.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "X-ray",
      "created_time": "June 01, 2022, 01:15:33 AM",
      "body": "These are very good lists. In my opinion if the ratio to be invested into the major coin must be less but that's your decision. I think that that's quite clear that if there was astar in your portfolios. This is a new blockchain that is starting to grow now. I think these are very good choices based on you are dividing some amounts info medium cap of tokens like polygon and ape token. i consider if we are still in the bearish market and the chance to recover will always there. Bitcoin potentially doubled from the current price and ethereum as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adzino",
      "created_time": "June 01, 2022, 06:45:50 AM",
      "body": "The top two coins on your list, bitcoin and ethereum is the safest coin for long term investment. Polygon (MATIC) seems to be a safe coin to invest in but do your own research if you are willing to hold for long term. I would say remove APE coin from the list. It's a token with a very high volatility. Look at the chart and you will know what I am saying. The price gets pumped and dumped very often so it's not going to be a good coin for holding long term. Not sure about the rest three.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "June 01, 2022, 07:53:10 AM",
      "body": "Quote from: Loco1887 on May 31, 2022, 05:59:20 PM1/6 Bitcoin (BTC)1/6 Ethereum (ETH)You cannot improve your investments in the long term by dividing them on the same market, meaning that what you are doing is not diversifying your investments, but rather weakening their value in the long term.In short, your solution is to buy more Bitcoin in the long term.In the short term you can invest in Ethereum, and Polygon (MATIC) (considering the failure of Ethereum to reach POS)Other than that, all investments in altcoins should be based on a reason, for example, an update, soft-fork, hard-fork, good news, a listing, and so on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "June 01, 2022, 08:04:56 AM",
      "body": "The first two are great for long-term holding, no doubt about that. But the other four I might disagree. Although I don't want to change it all because that is your decision. Just one tweak will be my suggestion and that's to put BNB (Binance coin) on the list. That way, you will have 3 of the most trusted and always on-demand coins that are being bought as an asset to be kept for a long time. You could make it 1/7 or just change one on the list to preserve the 6 only options.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Uang_kartal",
      "created_time": "June 01, 2022, 08:20:29 AM",
      "body": "did you sort it from the chart on the coin marketcap or where?let's give a little reason, I am indeed more friendly with bitcoin and eth but do you keep all of them? I hope you don't fall into the time category Btc is still uptrend and the market is still stable huh. heheDyor, whatever your choice, I personally add 1 BNB currency in my activities other than usdt. Still aware of all the risks and possibilities that occur. I think all forms of savings are included in the queue for financial freedom in the future. I hope you are not tempted to cut losses friend",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reid",
      "created_time": "June 01, 2022, 08:46:38 AM",
      "body": "You again Loco?!  It seems like you are having a hard time to decide what coin you want to buy. I'd expect you already stopped because you found your newly created portfolio, thanks to the tips provided by other members but it seems you are still confused. If I were you, just use that capital that you have buying Bitcoin and Ethereum then forget about new coins, NFT, memes and other stuff. Maybe that way you could prioritize in just holding it long term. You don't even need to monitor them, just take a sleep without stress.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}