{
  "id": "topic_5470693",
  "title": "Stakefast",
  "author": "Stakefast",
  "created_time": "October 17, 2023, 02:24:02 PMLast edit: October 17, 2023, 09:06:55 PM by Stakefast",
  "content": "We proudfully present to you our open source casinoSmashy.GG - Decentralized Solana CasinoWith us you can play anonymously, without registration in lightning fast speed.We currently offerDice RouletteHiLoSlotsMinesThe casino is completely open source and every bet can be traced, here is a example:https://explorer.gamba.so/tx/89Qff4yTQaM4ZRCjgsfFh5Smyevy8sta9EPwH5HRCvXuf4Muzq6nCCch4FvJaJvKtR3pN4v1S9Px8gxmaqmyRDvPlease keep in mind this is just the start, we will expand to a new system with much more games soon.If you have any recommendations or suggestions, please let us know, we will work on it daily to improve it.Visit👇",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470693",
  "comments": [
    {
      "author": "Ever-young",
      "created_time": "October 17, 2023, 02:34:47 PM",
      "body": "You site is just straight to the point no much information about the casino if it’s licensed by any recognized gambling body or not, and this wallet requirements which is the only option for login, i understand it’s for privacy reason for Solana users who would not want to link their identity to any gambling place, but again, (just a suggestion though) would it not be nice if you can also add some other option which someone can use for funding, for those who will not want to take the risk of connecting their wallet to the casino due to lack of trust. I believe this might also be the reason why you don’t have much of active players currently as I can see that your last played game is 6hrs ago that’s if the data is correct, people are so much concern about their funds security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "markk1",
      "created_time": "October 17, 2023, 02:43:43 PM",
      "body": "Who would play scripted games in such a casino without a license? The author should study the gambling market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "October 17, 2023, 03:22:49 PM",
      "body": "I like it when it says Someone but definitely I would agree with markk1. QuoteSomeone made 0.0602 SOL from 0.05 SOL 7h ago Someone made 0.0602 SOL from 0.05 SOL 7h ago  Someone made 0.7624 SOL from 0.5864 SOL 14h ago I think it will be more convincing if at least Someone will be replaced by a few beginning characters of the SOL wallet. The domain extension .gg seems to be preferred by lots of websites these days, not sure how this is being favored by the search engines.The casino graphic is not so impressive but users in the forum I think already are not expecting much for a decenralized casino that concentrates more on altcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "October 17, 2023, 03:36:02 PM",
      "body": "Quote from: markk1 on October 17, 2023, 02:43:43 PMWho would play scripted games in such a casino without a license? The author should study the gambling market.The game is open source which everything can be verified. Although it’s still a concern for players that doesn’t know how to read code and determine how it works in fair gameplay.@OP, I suggest to at least acquire an audit to trusted audit company for your code. Also add different currencies and allow to register user via email since not everyone is using Solana which is your current market. The current version of the casino looks like the typical casino template being sell online by random guy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stakefast",
      "created_time": "October 17, 2023, 06:52:52 PM",
      "body": "Quote from: Eternad on October 17, 2023, 03:36:02 PMQuote from: markk1 on October 17, 2023, 02:43:43 PMWho would play scripted games in such a casino without a license? The author should study the gambling market.The game is open source which everything can be verified. Although it’s still a concern for players that doesn’t know how to read code and determine how it works in fair gameplay.@OP, I suggest to at least acquire an audit to trusted audit company for your code. Also add different currencies and allow to register user via email since not everyone is using Solana which is your current market. The current version of the casino looks like the typical casino template being sell online by random guy.We are working on that. There will be a new system with new games comming pretty soon with lower min bet.Please do keep in mind that we are using a open source code that with on chain bets, you can simply verify the bet by clicking on the transaction, here is a example:https://explorer.gamba.so/tx/89Qff4yTQaM4ZRCjgsfFh5Smyevy8sta9EPwH5HRCvXuf4Muzq6nCCch4FvJaJvKtR3pN4v1S9Px8gxmaqmyRDv",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "edmundduke",
      "created_time": "October 17, 2023, 07:06:53 PM",
      "body": "I played a few games and all positive experiences so far. Solana is fast enough that even the Dice game feels fast enough, plenty fast for other games. The color scheme and design is really nice and simplistic. Looks great to be honest. Maybe some sort of a chat would be cool aswell for social experience ?Could probably use some leaderboards or wager challenges with rewards but other than that it seems great.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stakefast",
      "created_time": "October 17, 2023, 08:17:23 PM",
      "body": "Quote from: bittraffic on October 17, 2023, 03:22:49 PMI like it when it says Someone but definitely I would agree with markk1. QuoteSomeone made 0.0602 SOL from 0.05 SOL 7h ago Someone made 0.0602 SOL from 0.05 SOL 7h ago  Someone made 0.7624 SOL from 0.5864 SOL 14h ago I think it will be more convincing if at least Someone will be replaced by a few beginning characters of the SOL wallet. The domain extension .gg seems to be preferred by lots of websites these days, not sure how this is being favored by the search engines.The casino graphic is not so impressive but users in the forum I think already are not expecting much for a decenralized casino that concentrates more on altcoin. Thanks for your suggestion,we adjusted that and added the first 6 digits of the wallet to the list:Quote from: edmundduke on October 17, 2023, 07:06:53 PMI played a few games and all positive experiences so far. Solana is fast enough that even the Dice game feels fast enough, plenty fast for other games. The color scheme and design is really nice and simplistic. Looks great to be honest. Maybe some sort of a chat would be cool aswell for social experience ?Could probably use some leaderboards or wager challenges with rewards but other than that it seems great.Amazing, thanks for the play and review. Only possible on Solana  Chat is a interesting one, the site needs to get active till we enable it. We will work on wager challenges, very good idea",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "October 17, 2023, 08:46:24 PM",
      "body": "Welcome to the forum, when I saw the title I thought: your casino only has a deposit option for Solana only. I hope I'm wrong, now if I'm right that your casino only has the option to deposit solana, I highly doubt that this will cause many people who have other cryptocurrencies to exchange for solana to go play at your casino when they can play at other casinos that have the option to deposit the cryptocurrencies they have in their wallet. Another point is what your casino has to offer that other casinos don't yet have and that is what would make you have many customers or no customers.for example I didn't see many bonuses, I'm talking about things like registration bonuses, I didn't see other bonuses, I didn't see TOS, I don't know if your casino will or won't charge kyc, I didn't see a license in your casino, although a license is not something that guarantee that the casino will be trustworthy or not, because there are many licensed casinos that have become scams, but at least with a license your casino does not run the risk of being targeted by governments. In any case, congratulations on the casino and I wish it great success, only in the last 2 months I saw that many new casinos came to the forum, so I see that you will have a lot of competition in this market",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "October 17, 2023, 10:14:36 PM",
      "body": "I've connected using Phantom Wallet with my very little SOL in the balance. No email registration needed whatsoever, but just simply I'm good to go once connected.Tried some few games like Flip, Dice, Hilo, etc., and everything went smooth. I lose some, but I win some as well. For first timers, there's an initiation fee before proceeding which is just one time only. Maybe you add some more casino games to it.Interface looks slick especially the effects in both winning and losing the round. One thing however is that my Avast antivirus detected the chat part as \"scam\", but did not block the entire site even with the antivirus is still on. Hopefully you can sort this small issue every time I access this website.You also need to add TOS and there are no bonuses for first time registrants. This is something that you need to consider but overall great start!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "October 17, 2023, 11:51:07 PM",
      "body": "Quote from: bittraffic on October 17, 2023, 03:22:49 PMThe domain extension .gg seems to be preferred by lots of websites these days, not sure how this is being favored by the search engines.The word GG has significance for players all over the world it is widely used for Good Game its more like a fist bump for gamers done in chat, or after the game gamers can relate to the word GG so many webmasters adopt it when thinking of a domain extension related to their gaming platform.About the .gg domain Quote.gg is the country code top-level domain for the Bailiwick of GuernseyUsage in video gamesMultiple video game, streamers and esports websites use this domain because \"gg\" is a common initialism used in multiplayer video games as an abbreviation for the phrase \"good game\", usually said at the end of a matchhttps://en.wikipedia.org/wiki/.gg",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rodskee",
      "created_time": "October 18, 2023, 02:00:33 AM",
      "body": "Quote from: cheezcarls on October 17, 2023, 10:14:36 PMI've connected using Phantom Wallet with my very little SOL in the balance. No email registration needed whatsoever, but just simply I'm good to go once connected.with these feature in which what I love the most? maybe will consider playing now as I also have small Solana in my Wallet that i have been keeping and now will use to try this site.also interested in playing using new coin as I will be first using Solana in gambling as i prefer litecoin,bitcoin and Ripple in the past.QuoteYou also need to add TOS and there are no bonuses for first time registrants. This is something that you need to consider but overall great start!that's a good advise , OP should reply on this or to work for it._______________________________Have created my account now and played , yes the winning and losing seems balanced(at least as of my playing)will come back later to try my luck again and I love the fairness of the site , good job guys .Welcome to the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Quidat",
      "created_time": "October 18, 2023, 02:37:52 AM",
      "body": "Welcome into this forum Smashy.gg!Site looks cool and i do love the simplicity of everything. Dice game and sliders are good. Totally decentralized or everything would really be passing through your dedicated wallet.On this case, i do make use of Phantom wallet but since i have spent all my SOL then i have failed on initializing which this is my first time on encountering something like this.Just like the rest been saying that having a chatbox would be good. Current offered games are common but i do still love its simplicity.Do you have plans on launching some marketing or competition or promotion into this forum? (which is standard for most new casinos).I dont know if its really just that right that this one is posted on Gambling board considering that this isnt accepting Bitcoin but well i might be wrong on this one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "October 18, 2023, 02:47:39 AM",
      "body": "Quote from: Stakefast on October 17, 2023, 08:17:23 PM-snipAmazing, thanks for the play and review. Only possible on Solana  Chat is a interesting one, the site needs to get active till we enable it. We will work on wager challenges, very good idea  I can see that edmundduke's suggestion to introduce a chat feature for a social experience has already been implemented. This improves user engagement and interaction, making your platform more attractive. The idea of leaderboards and wager challenges with rewards is also excellent and can enhance user engagement.Keep up the good work, and I'm excited to see how Smashy.gg evolves with these improvements. Best of luck!I just have one question, what are your thoughts on the possibility of editing or deleting the chat?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MainCharacter",
      "created_time": "October 18, 2023, 11:42:22 AM",
      "body": "I like the Idea of just playing, no unnecessary stuff. Also my transactions went through very fast, excited to see where it goes! Is it planned to add a refferal system, would be cool to get a share for promoting smashy?`",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stakefast",
      "created_time": "October 18, 2023, 02:06:51 PM",
      "body": "Quote from: robelneo on October 17, 2023, 11:51:07 PMQuote from: bittraffic on October 17, 2023, 03:22:49 PMThe domain extension .gg seems to be preferred by lots of websites these days, not sure how this is being favored by the search engines.The word GG has significance for players all over the world it is widely used for Good Game its more like a fist bump for gamers done in chat, or after the game gamers can relate to the word GG so many webmasters adopt it when thinking of a domain extension related to their gaming platform.About the .gg domain Quote.gg is the country code top-level domain for the Bailiwick of GuernseyUsage in video gamesMultiple video game, streamers and esports websites use this domain because \"gg\" is a common initialism used in multiplayer video games as an abbreviation for the phrase \"good game\", usually said at the end of a matchhttps://en.wikipedia.org/wiki/.ggThats exactly what we had in mind creating the domain.Quote from: rodskee on October 18, 2023, 02:00:33 AMQuote from: cheezcarls on October 17, 2023, 10:14:36 PMI've connected using Phantom Wallet with my very little SOL in the balance. No email registration needed whatsoever, but just simply I'm good to go once connected.with these feature in which what I love the most? maybe will consider playing now as I also have small Solana in my Wallet that i have been keeping and now will use to try this site.also interested in playing using new coin as I will be first using Solana in gambling as i prefer litecoin,bitcoin and Ripple in the past.QuoteYou also need to add TOS and there are no bonuses for first time registrants. This is something that you need to consider but overall great start!that's a good advise , OP should reply on this or to work for it._______________________________Have created my account now and played , yes the winning and losing seems balanced(at least as of my playing)will come back later to try my luck again and I love the fairness of the site , good job guys .Welcome to the forum.Thank you so much. We fixed a few errors in the chat/ header of the website. Chat should be closable now on mobile phones.Its tricky to have any kind of bonus when you simply relay on fees earned from instant games on-chain. We will have to think about it.Quote from: Quidat on October 18, 2023, 02:37:52 AMWelcome into this forum Smashy.gg!Site looks cool and i do love the simplicity of everything. Dice game and sliders are good. Totally decentralized or everything would really be passing through your dedicated wallet.On this case, i do make use of Phantom wallet but since i have spent all my SOL then i have failed on initializing which this is my first time on encountering something like this.Just like the rest been saying that having a chatbox would be good. Current offered games are common but i do still love its simplicity.Do you have plans on launching some marketing or competition or promotion into this forum? (which is standard for most new casinos).I dont know if its really just that right that this one is posted on Gambling board considering that this isnt accepting Bitcoin but well i might be wrong on this one.Thanks a lot, yes we think about a signature campaign here on Bitcointalk. Its a good way of finding new players. Quite expensive though.Quote from: MainCharacter on October 18, 2023, 11:42:22 AMI like the Idea of just playing, no unnecessary stuff. Also my transactions went through very fast, excited to see where it goes! Is it planned to add a refferal system, would be cool to get a share for promoting smashy?`A referral system is planned in the near future, stay tuned.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "October 18, 2023, 04:26:09 PM",
      "body": "Quote from: robelneo on October 17, 2023, 11:51:07 PMQuote from: bittraffic on October 17, 2023, 03:22:49 PMThe domain extension .gg seems to be preferred by lots of websites these days, not sure how this is being favored by the search engines.The word GG has significance for players all over the world it is widely used for Good Game its more like a fist bump for gamers done in chat, or after the game gamers can relate to the word GG so many webmasters adopt it when thinking of a domain extension related to their gaming platform.About the .gg domain Quote.gg is the country code top-level domain for the Bailiwick of GuernseyUsage in video gamesMultiple video game, streamers and esports websites use this domain because \"gg\" is a common initialism used in multiplayer video games as an abbreviation for the phrase \"good game\", usually said at the end of a matchhttps://en.wikipedia.org/wiki/.ggGood to know. Seem like more gamers are used to seeing such domain extensions. There used to be .io extension that also became popular at some point but gradually people are going back to its .com still. Registrars are just making more and more extensions these days. Anyway, Smashy.GG could be what gamers might like if they are also a fan of SOL depending on how the casino markets their site which will also take time to build trust.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "October 18, 2023, 05:29:42 PM",
      "body": "Is there any direct connection with Bitpr0? Why they are promoted on the site?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "edmundduke",
      "created_time": "October 18, 2023, 08:10:30 PM",
      "body": "Quote from: Stakefast on October 18, 2023, 02:06:51 PMA referral system is planned in the near future, stay tuned.Looking forward to the referral system. Can you add referrals retroactively aswell or once it is out do the players need to make a new account ? (when we tell about the site to our friends before the affiliate system is out ?)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "October 18, 2023, 11:21:09 PM",
      "body": "Quote from: Little Mouse on October 18, 2023, 05:29:42 PMIs there any direct connection with Bitpr0? Why they are promoted on the site?This is a valid question you have been announcing a lot of platforms but you're not stating your role on these platforms this is kind of risky for you as you do not have a disclaimer on all your announcements, if any of the projects you announced here face an issue people will think that you have a direct contact or one of the owners of the platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}