{
  "id": "topic_5452391",
  "title": "tech30338",
  "author": "tech30338",
  "created_time": "May 11, 2023, 02:51:27 PM",
  "content": "Have you ever been heard of the blockchain chat?Ethereum had a chat system where you can message a receiver or even someone's address on the Ethereum network?Step 1: Connect your wallet example is Metamask you need to sign-in and approve itStep 2: Search the address or the person with the address you need to talk tostep 3: Start chatting with the address for example you can chat with the person you are transacting withNote: To send a message you will need a transaction in Ethereum chain if you will not unable to send a message if you don't have even single transaction in the network, maybe its a way to protect users from unknown, although you can block unwanted users if you want from the featuresJust like in the chat before like yahoo messenger you can block unblock a user, now its eth addressFor me its a nice way to have a chat system, although we should be careful what message or info we are trying to send to a person, since we don't know if there is a chance it will be leak , although this should be safe in a way since it will be encrypted, but where the data will be stored is another one.I'm not sure if everyone already know this , any feedback from you guys if someone have try this application.I have been seeing this since but never tried since I'm a bit afraid of what will happen.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452391",
  "comments": [
    {
      "author": "God Of Thunder",
      "created_time": "May 11, 2023, 04:34:56 PM",
      "body": "I don't think anyone would like to do that. I am not sure reliable Blockscan is. I won't risk connecting my wallet to a website to chat with someone. Moreover, As I can see, Users can connect to Metamask, Coinbase and wallet connect only. That means if your ETH wallet address is from another wallet provider, You won't be able to connect it (Even though I don't suggest anyone connect their wallet). I am not sure if anyone finds it interesting. But I don't think we have to use such a platform just to chat with someone. Imagine you have connected your wallet to their website, and it drained your full balance. After they reach a good number of wallets connected, they might drain everyone's wallet and say our website was hacked! There is nothing you can do about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pity Token",
      "created_time": "May 11, 2023, 07:19:22 PM",
      "body": "If you want to chat over the blockchain using a trusted system then try Neo Chat. It's an old school coin that has been around a long time, and it works with NEO name service. It was once called the Chinese Ethereum so worth a lookhttps://neonewstoday.com/development/neo-releases-neochat-an-end-to-end-encrypted-chat-service-with-neons-integration/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "May 12, 2023, 03:39:02 AM",
      "body": "Quote from: Learn Bitcoin on May 11, 2023, 04:34:56 PMMoreover, As I can see, Users can connect to Metamask, Coinbase and wallet connect only. That means if your ETH wallet address is from another wallet provider, You won't be able to connect itI believe it is a shitty wallet if it isn't supported. WalletConnect is the standard protocol of cryptocurrency wallets to be able to connect with a platform/application, so it is expected any recommendable wallet should support the widely adopted protocol.Quote from: tech30338 on May 11, 2023, 02:51:27 PMI have been seeing this since but never tried since I'm a bit afraid of what will happen.Quote from: Learn Bitcoin on May 11, 2023, 04:34:56 PMImagine you have connected your wallet to their website, and it drained your full balance. After they reach a good number of wallets connected, they might drain everyone's wallet and say our website was hacked! There is nothing you can do about it. I also don't think a messaging app that tied your address to the platform is worth using. I just don't find any use case, personally. In regard to security, it should be noted that the app itself only asks for signature verification purposes to log on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Freddie Boyer",
      "created_time": "May 12, 2023, 04:20:56 AM",
      "body": "Yes, I've heard of the blockchain chat feature on the Ethereum network. This is an interesting way to communicate with other users on this platform, especially when it comes to sending transactions. I think blockchain chat is not a traditional messaging app. In order to send a message, you have to make a transaction on the Ethereum network, which means you have to pay a petrol fee. It's also important to be careful with the information you share, because everything on the blockchain is public and permanent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}