{
  "id": "topic_5406991",
  "title": "MAAManda",
  "author": "MAAManda",
  "created_time": "July 20, 2022, 01:17:31 PM",
  "content": "Hello everyone, this time I had the opportunity to create a topic on this board (maybe this is the first topic I created on this board) Lately we hear a lot of new things in the crypto space, such as GameFi, Metaverse and also Web 3.0. As we know that our Internet currently uses a centralized system as a regulator of all our behavior on the Internet, especially social media. Therefore, Web 3.0 is present as a solution to the problem of centralization on the Internet.For social media itself, recently we have Solcial which is the pioneer of decentralized social media.What's Solcial?Solcial is a permissionless social network allowing users to be rewarded fairly for their work, and promoting freedom of speech by allowing users to interact without fearing ban or censorship. - SourceFYI, Solcial is a project that runs on the Solana blockchain and also has well-known backers such as Solana Capital, Alameda Research, Rarestone, Kucoin Labs, DWEB3 and also Newave Capital. What do you think? Will Solcial really revolutionize how social media works? and do you think the $SLCL token is very promising for its holders? Don't forget to include a clear reason.Note: To find out more about Solcial and its mechanics, you can visit their wiki page here.Reference:[1] https://solcial.io/[2] https://wiki.solcial.io[3] https://wiki.solcial.io/the-basics/introduction",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406991",
  "comments": [
    {
      "author": "HeavensPro",
      "created_time": "July 22, 2022, 02:13:14 AM",
      "body": "There're so many social media and networks which try to get some hype on decentralisation and crypto but none of them became a mainstream so I think that a new one needs to offer users something bigger. Now people are using them just to try their luck and earn some oney from them instead of using as intended",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Panos Markovits",
      "created_time": "July 22, 2022, 03:01:47 AM",
      "body": "From my point of view, Solcial seems like a good idea that has a lot of potential. I do think it needs more attention and publicity if investors should have confidence that it can live up to people's expectations from this peer-to-peer social media network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "July 22, 2022, 03:13:57 PM",
      "body": "Quote from: HeavensPro on July 22, 2022, 02:13:14 AMThere're so many social media and networks which try to get some hype on decentralisation and crypto but none of them became a mainstream so I think that a new one needs to offer users something bigger. Now people are using them just to try their luck and earn some oney from them instead of using as intended There are so many? is there anything else besides Solcial for Social Media? As far as I know only Solcial has the Web 3.0 hype for Social Media. But I agree with what you said that these Web 3.0 projects should give more bids regarding their project, so that their project will become mainstream platform.Quote from: Panos Markovits on July 22, 2022, 03:01:47 AMFrom my point of view, Solcial seems like a good idea that has a lot of potential. I do think it needs more attention and publicity if investors should have confidence that it can live up to people's expectations from this peer-to-peer social media network.Why do you think Solcial has potential? can you explain it to me? there may be 1 or 2 features that you like from this project?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}