{
  "id": "topic_5417402",
  "title": "paxmao",
  "author": "paxmao",
  "created_time": "October 17, 2022, 10:18:58 AM",
  "content": "https://www.doctorswithoutborders.org/latest/five-facts-about-crisis-somaliaSeveral regions in Somalia are under alert for an incoming crisis, while some others are already on full blown starvation. The RF war on Ukraine may have a lot to do and this year is not great either for those countries that could have helped. In a few weeks children will start dying and not before long, parents who have lost crops and cattle alike will flood into the camps with nothing to eat and nothing to buy food with.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417402",
  "comments": [
    {
      "author": "BADecker",
      "created_time": "October 17, 2022, 12:22:08 PM",
      "body": "This time, the US might be too busy with supplying Ukraine against Russia, to go into Somalia and straighten things out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "StanCrypt",
      "created_time": "October 17, 2022, 02:10:15 PM",
      "body": "Quote from: paxmao on October 17, 2022, 10:18:58 AMhttps://www.doctorswithoutborders.org/latest/five-facts-about-crisis-somaliaSeveral regions in Somalia are under alert for an incoming crisis, while some others are already on full blown starvation. The RF war on Ukraine may have a lot to do and this year is not great either for those countries that could have helped. In a few weeks children will start dying and not before long, parents who have lost crops and cattle alike will flood into the camps with nothing to eat and nothing to buy food with.There is a Crisis Recovery Project being developed for Somalia by the WORLD BANK which seeks to improve national disaster preparedness while assisting in the restoration of infrastructure and means of subsistence in areas damaged by flooding and drought. There are five parts to the project. Component 1: Immediate basic services and livelihood support for the nation's flood-affected states and locust-affected areas through the establishment of a cash-for-work program for vulnerable households, control of the desert locus population through ground and aerial spraying operations, restoration and protection of farmers' capacity for agricultural production, revitalization of basic health provisions, bolstering of response services, and support for household hygiene.Component 2: Reconstruction of vital public and community infrastructure following a medium-term flood. The component will renovate bridges, small feeder roads, health facilities, and water and sewage infrastructure. Additionally, it will assist regional mitigation strategies for risk reduction, including environmental restoration and slope protection. Component 3: Longer-term disaster risk preparedness will enhance institutional readiness of governmental ministries, agencies, and departments to respond to flood and drought-related calamities. The institutional capability of the PIU (Project Implementation Unit) and State Project Teams will be strengthened by Component 4: Project Management for the project's implementation. A first-line finance choice for an emergency response will be provided by Component 5: Contingency Emergency Response Component (CERC).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "October 17, 2022, 03:16:34 PM",
      "body": "This is the most heartbreaking news I read today because these people have been suffering from hunger before this war even begin and now they are even suffering because they no longer get any help from the sources which helped them before. Looks like this war is kinda needed to end right now because when the start of suffering such as this one will begin, it will gonna be like a domino effect, and one after another the others will get affected as well. Somalians and other countries in Africa are in need of help, I hope they will survive this global crisis and return back to normal again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}