{
  "id": "topic_5420935",
  "title": "Fivestar4everMVP",
  "author": "Fivestar4everMVP",
  "created_time": "November 14, 2022, 09:56:26 AM",
  "content": "Hi everyone, i trust ya all having a great day...Like the subject of this topic say, its a question i am putting out to you all, as a member of the gambling community, what do you think can be done to reduce the gambling related issues like --Substance Misuse problemsDepressionPersonality DisorderFear and AnxietyObsessive-compulsive Disorder (OCD)Bipolar DisorderAttention Deficit/hyperactivity Disorder (ADHD)The above issues can some or most times results to the complications below, and they are --Financial ProblemsRelationship[/Family ProblemsGeneral Health issuesLow Self EsteemLegal/Social ProblemsPoor Performance at work or Job LossAnd worst of it all --Suicidal Thoughts/AttemptsAnd finally --SuicideFrom one article i was reading this morning, the UK government officially stated that there are more than 409 suicides a year in England which results from gambling problems.Here is a quote from an article i read this morning --QuoteOn a summer’s day in 2015, Joshua Jones put on his suit and headed to his gleaming office block overlooking the Thames in London.It was the trainee accountant’s day off, but he was in turmoil after gambling away most of his monthly pay and an annual bonus. He told a friend he needed to “pop into the office”. He took the lift to the top floor of the block in the early evening and jumped to his death. He was 23.Martin Jones, 72, Joshua’s father, said: “To people who worked with him, he was the life and soul of the party, but he was living a double life as a gambler. He felt despair that he could not control the addiction.”From the same article, i learnt that --Liz and Charles Ritchie (whoever they were before now), founded the gambling with lives charity organization after their Son, Jack, took his life in 2017 due to gambling addiction.Majority in the UK, last year(2021) called on the government of UK to place a total ban on gambling ads.Now I do not know if this ban on gambling ads was or has been unforced in the UK, but my question now is, \\if the UK goes ahead to enforce the ban on gambling ads in the country, you think this will reduce the number of suicides, and other gambling related problems in the country?\\Do you think banning gambling ads is a good measure for the entire government of the world should enforce? will this really stop people from gambling?\\In your own opinion, what measures do you think is appropriate to take that will help reduce the issues, gambling related problems cause in our society? Lets discuss.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420935",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "November 14, 2022, 10:47:41 AM",
      "body": "Quote from: Fivestar4everMVP on November 14, 2022, 09:56:26 AMNow I do not know if this ban on gambling ads was or has been unforced in the UK, but my question now is, \\if the UK goes ahead to enforce the ban on gambling ads in the country, you think this will reduce the number of suicides, and other gambling related problems in the country?\\Do you think banning gambling ads is a good measure for the entire government of the world should enforce? will this really stop people from gambling?\\In your own opinion, what measures do you think is appropriate to take that will help reduce the issues, gambling related problems cause in our society? Gambling site will not want ads to be banned, but it has to in some areas, especially that kids are accessing. The government of many countries see gambling tax to be a good revenue for them they will somehow be in support of gambling sites and only have little amendment in regulation, but not ban. But if gambling ads are banned, people that will join gambling site in the country will reduce.Like I said, what is most important is to ban gambling ads on where kids are visiting. I was surprised that my country had gone to the extent that gambling sites are advertised on prepaid channels which makes it not advisable for kids.I have been a victim, discipline is the first, and not seeing gambling as a way of making money, it is not a way to make money because the odds are set in a way gamblers are more likely to lose in total than to win. We should not hide the bad realities to children, friends me family and how they can be addicted and to avoid it. We should gamble responsibly, not chasing money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "November 14, 2022, 10:58:35 AM",
      "body": "First of all we need to learn to quit and learn self control,if we see that we are addicted and are having trouble to quit the first thing we need to do is to seek for help,first from our family which is the basis to solve all of our problems like this one and then soon after to go to a rehabilitation center if we still cannot quit after talking with our family.This basically removes and reduces every suicide attempt that an addicted person can surely have if he is drown in debt and looks as life has no way out or no meaning to him.Everything else like removing ads it is not going to work as you cannot ban the internet which is full of these ads,sure you can ban them nationally in TV but most people gamble from the internet so it is up the gambler himself to save himself by asking for help in cases of addiction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "November 14, 2022, 11:01:30 AM",
      "body": "There isn't much to be done honestly, as the gamblers themselves should know whether or not they're already crossing a point of no return. All other people can do is to warn them of the possible negative effects of too much gambling. Ads advocating against gambling won't stop any gambler honestly, similar to how negative ads are already placed on most cigarettes yet people aren't deterred in using them. It's a mental and psychological disorder that the gambler themselves, or anyone close to them, should know before any action can be done—at least in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "November 14, 2022, 11:07:07 AM",
      "body": "If it gets too much to the point that it's hard to control but the gambler realizes and admits that he's doing it wrongly. The first thing is no need to think of it but rather go and seek immediate professional help. It's either psychiatrists or psychologists. Both of that professional titles are into mental behavior and they can treat that because that's the profession and specialization that they've studied.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "November 14, 2022, 11:14:06 AM",
      "body": "Quote from: dothebeats on November 14, 2022, 11:01:30 AMThere isn't much to be done honestly, as the gamblers themselves should know whether or not they're already crossing a point of no return. All other people can do is to warn them of the possible negative effects of too much gambling. Ads advocating against gambling won't stop any gambler honestly, similar to how negative ads are already placed on most cigarettes yet people aren't deterred in using them. It's a mental and psychological disorder that the gambler themselves, or anyone close to them, should know before any action can be done—at least in my opinion.that is true. ads banning won't resolve the root cause of this problem. it may be a temporary solution by the government. but they need to look at long-term solution or at least better approach like offering better jobs or other worthwhile activities to earn extra income. some are getting addicted into this because they don't have anything to do, and they are trying their luck to get \"easy\" money. but most of the time, instead of getting that money, they incur huge debts as they chase their losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "November 14, 2022, 11:23:55 AM",
      "body": "Gambling is a problem for many and the more quickly they realise this the better. The reason why such problems persist is because of the endless cycle or loss and chase after loss. Those who have a background of mental disorder or substance use will get addicted to gambling and that problem will exacerbate. Then there are people who will make sure they play only at times and not bet more than what they can afford. These are th people who manage to have the fun or gambling but not turn them to an addiction, but this rare which is why the industry of gambling flourishes.It is a tough problem/disease to handle on your own. So one should seek help and be ready to accept that they may be in trouble.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "QueenVera",
      "created_time": "November 14, 2022, 11:39:39 AM",
      "body": "Suicide has never been a way out of any problem one is facing.Most of this country's government, especially the United kingdom you mentioned generate alot of revenues from this gambling casinos and hence it might be difficult to place a ban on it, though some amendments might be made.I also suggest a heavy penalty placement on parents of underaged gamblers should be placed and by so doing, the parents will be conscious of the activities of their children so as not to get into paying some huge sums for fines.Counselling session should be one thing that should be introduced into school and work curriculums to aeast check the mental state and health of people around.One thing that leads to this stuffs is revenge gambling, when one try all his possible best to recover his loss at all cost and by so doing losses all his money.I would suggest that government places a regular for a certain number of bets and amounts one can make a day and by so doing, I think this risk might be managed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "November 14, 2022, 12:36:37 PM",
      "body": "Quote from: QueenVera on November 14, 2022, 11:39:39 AMSuicide has never been a way out of any problem one is facing.Most of this country's government, especially the United kingdom you mentioned generate alot of revenues from this gambling casinos and hence it might be difficult to place a ban on it, though some amendments might be made.I also suggest a heavy penalty placement on parents of underaged gamblers should be placed and by so doing, the parents will be conscious of the activities of their children so as not to get into paying some huge sums for fines.Counselling session should be one thing that should be introduced into school and work curriculums to aeast check the mental state and health of people around.One thing that leads to this stuffs is revenge gambling, when one try all his possible best to recover his loss at all cost and by so doing losses all his money.I would suggest that government places a regular for a certain number of bets and amounts one can make a day and by so doing, I think this risk might be managed.I must say that you have a lot of vital points that are actually new to the table..\\Like you right said, the UK government makes a lot of money from taxes paid by casinos and other gambling firms, so it is quite understandable why they may never comply or give attention to the public demand to ban gambling ads in the country.But like i said, you have indeed pointed out some important ideas that if implemented into the system, might help to significantly reduce gambling related issues in our society.Heavy penalties on parents of underaged gamblers is one i love and fully support, there have been an instance in my country where a fifteen years old played a bet and luckily won 35 million in, if converted to USD using todays exchange rate, that should be a little above $46,000, the boy was later that day killed by a vehicle on the high way due to over excitement, though the boy won a really huge amount of money that indeed have helped the family financially, the general public blamed the parents for the boys untimely death saying gambling at such a young age was deadly and the death of the boy proved it.So i personally think imposing heavy penalties on parents of underaged gamblers is indeed a good way to start, since this addiction of the thing is most times, as a result of starting gambling at ages when the brain have not developed enough strength to deal with some loses probably -- this is just my assumption though, i have nothing to back this up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "November 14, 2022, 01:46:36 PM",
      "body": "Quote from: Fivestar4everMVP on November 14, 2022, 09:56:26 AMGambling is not the source or problem of someone who wants to or commits suicide or other crimes, many other problems arise for someone that they really can't face and at the end of the story are frustrated.For example:Domestic problems, dating, debt problems and many other problems.Many people I have seen end their lives because of gambling, in the end it was revealed that it was caused by debt, gambling was made the mastermind behind the problem, the fact is not so.All the points you convey in your thread are true, on the contrary for those who are frustrated and want to commit suicide should think wisely, that gambling is a high risk, losses are greater than gains, of course if they think so some of the points you say will not happen.For example:Quote from: Fivestar4everMVP on November 14, 2022, 09:56:26 AM• Financial Problems.• Relationship[/Family Problems.So they don't need to go into debt and sell property owned by the family to bet on gambling, there are many other alternatives they can do to gamble in a healthy and professional manner.For example: they can take part in competitions and take bonuses offered by online gambling sites, many online gambling sites provide free money and bonuses in various ways so that users can bet without doing things that are detrimental to themselves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "November 14, 2022, 02:07:06 PM",
      "body": "Prevention is better than cure. If in the first place a plaer have limited oneself towards gambling, things would be at ease. But ofcourse we cannot change the past so in order to somehow lessen the drive of engaging into this activity and eventually be too dragged in gambling, practice not spending most of your time in gambling platforms. Make it a way to do other things such as engaging to sports, reading books, watching movies or even socializing with your friends. In such way, you won't be ending up on your couch betting for the whole day. But what if you don't have those hobbies? Then check for your wallet.  Avoid having an on the go budget because it would be more likely be consumed as one of your bets.Lastly, you may consult a professional if you think you are having a hard time not thinking of gambling. That's way too dangerous if it would be set aside 'coz eventually it may manifest to psychological problems or even physical and emotional.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "November 14, 2022, 02:10:00 PM",
      "body": "to avoid having this kind of problems, people when they play should not create high expectations like: \"I will bet 1$ and I will win 1000$\", they should not think that they will get rich, they should not think that they will not lose, they should not think to take revenge when they lose in the game. they must manage their bankroll well, they must always think that they are playing for fun and that the time they are allocating for gambling is time for fun, after that time the person needs to stop playing and do something else in the real world, for example: if the person says that 2H are to play then it has to be only 2H to play and after 2h he has to stop playing and the person always needs to put money that he knows that when he loses he will not need it, for example: if the person put 50$ per week for games, then you only have to use 50$ for games each week",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "November 14, 2022, 02:11:34 PM",
      "body": "Quote from: Fivestar4everMVP on November 14, 2022, 09:56:26 AMDo you think banning gambling ads is a good measure for the entire government of the world should enforce? will this really stop people from gambling?It's the internet if you frequent sites that show gambling ads your government cannot do anything about it, it's different between a physical casinos and online casinos, the government can control physical casinos but not online casinosQuoteIn your own opinion, what measures do you think are appropriate to take that will help reduce the issues, gambling related problems cause in our society? The government can educate people on the harm of excessive gambling but controlling ads cannot make them stop gambling, if the government can do without taxes coming from the government then they can ban it, but in my country, our government badly needs those taxes so they can only warn people on the harmful effects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "November 14, 2022, 02:19:43 PMLast edit: November 14, 2022, 02:57:16 PM by Zlantann",
      "body": "Some people just have a natural suicide tendency. They always feel hopeless in situations that most people have also gone through. Their thought each time they are facing any challenge is suicide. There is also a high rate of suicide caused by relationship marital challenges. Sometimes there are so many factors that contribute to suicide. In some cases, people that commit suicide suffer from two or more contributors to suicide. Someone that is suffering from alcoholism and gambling addictions has a higher tendency to commit suicide than a person that is addicted to just gambling addiction. Haven said that, some persons became addicts or would become addicted to gambling because of gambling ads which might contribute to their suicidal behavior, but the number would be insignificant compared to other causes of suicide.Banning gambling ads would contribute to the reduction in the rate of gambling because in recent times we have seen a high increase in very attractive gambling ads. But the banning gambling ads would be an unpopular policy and it would not have much effect on gambling addiction or suicide.  I think government should set up agencies that would monitor and regulate this gambling ads. People prone to gambling addiction such as children should be shielded from strong and attractive gambling ads. Parents and other citizens should be enlightened by the government on gambling addiction, suicide and other societal vices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Boristhecat",
      "created_time": "November 14, 2022, 02:25:57 PM",
      "body": "Quote from: Fivestar4everMVP on November 14, 2022, 09:56:26 AM-skip-Now I do not know if this ban on gambling ads was or has been unforced in the UK, but my question now is, \\if the UK goes ahead to enforce the ban on gambling ads in the country, you think this will reduce the number of suicides, and other gambling related problems in the country?\\Do you think banning gambling ads is a good measure for the entire government of the world should enforce? will this really stop people from gambling?\\In your own opinion, what measures do you think is appropriate to take that will help reduce the issues, gambling related problems cause in our society? Lets discuss. Is alcohol and its advertising already banned in the UK? But it causes a much greater number of deaths and crimes. I don't think that banning anything from ads can solve some imaginary problem because, to begin with, I don't see any connection at all between the harm and what supposedly caused it. If a person initially has mental problems, then he will find a way to worsen it and find a reason for suicide - by the way, even a romantic attachment to someone can become the reason for this. Maybe we should ban romance novels and movies about love?The most correct thing is to strive for citizens to lead a healthy lifestyle (both physically and mentally), but the problem is that you can’t force anyone (this would be totalitarianism), and many citizens consciously choose a destructive path.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "November 14, 2022, 02:31:51 PM",
      "body": "There should be family intervention the government can do little about this issue, its the family and close friends that should take these signs seriously when they see it on one of their family or close friends, the foundation of every society is the family a strong family foundation is likely to have these kinds of problems, the government can strengthen this foundation by giving its citizens a good economy and rehabilitation centers and professional help within reach.Even banning ads cannot stop people to gamble the internet is a big temptation for gamblers and it's hard for gamblers to avoid those ads on the internet, the battle is within the character of the individuals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "November 14, 2022, 02:34:17 PM",
      "body": "Quote from: Fivestar4everMVP on November 14, 2022, 09:56:26 AM\\if the UK goes ahead to enforce the ban on gambling ads in the country, you think this will reduce the number of suicides, and other gambling related problems in the country?maybe, I mean, fewer or total ban of gambling ads being shown means people with addiction and is trying to better their lives will have less exposure to gambling ads.Quote from: Fivestar4everMVP on November 14, 2022, 09:56:26 AM\\Do you think banning gambling ads is a good measure for the entire government of the world should enforce? will this really stop people from gambling?I don't know, but what I know is that some countries rely a lot on gambling revenue so I have a feeling that they'd be reluctant on banning gambling ads, as for if it will stop people from gambling, I don't think it will.Quote from: Fivestar4everMVP on November 14, 2022, 09:56:26 AM\\In your own opinion, what measures do you think is appropriate to take that will help reduce the issues, gambling related problems cause in our society? Lets discuss.proper knowledge about gambling and the dangers of it and more help centers that people can go to if they need help. I am sure there are far better measures than can be done but I think having knowledge about gambling problems and rehabilitation centers could help a lot of people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "November 14, 2022, 02:39:10 PM",
      "body": "there had been lots of prevention, google banning gambling related ads must be one of the effort. the popularity and the gambling business is just too lucrative that even on teens, gambling becomes very usual.Steam gambling for instance, there are already CSGO skin casinos where the teens playing. winning cheeky CSGO skins lured them to gambling. the Valve   knew about teens gambling but because they profit from it, they don't warn the gamers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Viscore",
      "created_time": "November 14, 2022, 02:52:48 PM",
      "body": "Quote from: dothebeats on November 14, 2022, 11:01:30 AMThere isn't much to be done honestly, as the gamblers themselves should know whether or not they're already crossing a point of no return. All other people can do is to warn them of the possible negative effects of too much gambling. Ads advocating against gambling won't stop any gambler honestly, similar to how negative ads are already placed on most cigarettes yet people aren't deterred in using them. It's a mental and psychological disorder that the gambler themselves, or anyone close to them, should know before any action can be done—at least in my opinion. This is the reason why gambling is not for everyone. If you think that you can’t easily control yourself especially if you’re into any addiction, particularly gambling addiction, then never decide to enter gambling in the first place regardless if you do it for fun or for entertainment purposes only. Otherwise, you will find it very hard to exit from gambling especially if you have not win back a lot of your losses.There might be a lot of ads against gambling, but they don’t bring heavy impact anymore to a gambling addict. The only way to minimize gambling addiction is to admit to yourself that you are now becoming an addict, so that you can ask for your family support and seek medical treatment if needed. That way, you will not resort into worst scenarios like suicidal and other gambling related issues.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "November 14, 2022, 02:55:30 PM",
      "body": "The challenge we have here is that we can't control the entire gamblers all over the world at the same time since the gambling sites were also different from each other and every gambler has the choice to choose from his comfort the suitable and most preferred casino to use, i would have suggested a widely campaign against such abuses that comes along with gambling, but having a coordinate organization of the state of affairs in gambling isn't that an easy job to do but the government in it own way has regulated some oart of this challenge but not to zero level to curb the violence thereafter, i also think this is more a personal issues than public or general one since we have people commiting suicide or any other even without being a gambler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}