{
  "id": "topic_5416139",
  "title": "KiaKia",
  "author": "KiaKia",
  "created_time": "October 06, 2022, 07:44:31 AM",
  "content": "With the way companies are going bankrupt this days I think I should warn my fellow Bitcointalk friends, give me a minute of your time.Forget about how big a crypto exchange have grown, do not leave your coins on exchange, we can never tell which exchange will go down unexpectedly in this bear market.I have some USDT that I plan to use to buy coins probably when BTC is down to 10k which I believed would happened in September but it never did so I moved the USDT out of the exchange back into my wallet.Do not relent, do not trust any exchange, trust only your private keys, remember, not your keys, not your coins.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416139",
  "comments": [
    {
      "author": "Zilon",
      "created_time": "October 06, 2022, 08:17:13 AMLast edit: October 06, 2022, 04:14:30 PM by Zilon",
      "body": "No one can accurately tell what will happen next in the market but if it be bear market then it  might come with so much shakings and won't be surprising if many exchange go bankrupt because most of them are operating on loans. The advice over time has been not your keys, not your coin been our own bank. Even in bull market leaving one's portfolio in a centralise exchange keeps one at high risk because hackers will definitely be on the increase so as to steal from exchanges working with more sophisticated tools. Any coin that isn't meant for trading or immediate swap is best kept off exchanges and for trading, reputable exchange is always the most preferred. Because the initial idea of the whole crypto ecosystem was to make individuals their own bank so leaving your coin on exchanges is like forfeiting the whole idea of decentralisation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "October 06, 2022, 08:17:26 AM",
      "body": "Bitcoin may never go below $14000, buying at $18000 is still good too. But that is not an advice, but just my opinion about bitcoin price and how buying at low price now would be profitable during all-time-high.Yes. Exchanges can be hacked, better not to leave your money on exchange, it is best left on noncustodial wallet. Not your keys not your coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "October 06, 2022, 08:38:16 AM",
      "body": "Quote from: KiaKia on October 06, 2022, 07:44:31 AMWith the way companies are going bankrupt ~Forget about how big a crypto exchange have grown, do not leave your coins on exchange~A good advice but irrelevant reason. Companies aren't going bankrupt for no reason these days. They go bankrupt because of the economic situation in those countries, for example in Germany they go bankrupt because of the high energy costs and the shortage of it.Exchanges, specially the big ones, are not going to go bankrupt that easily. They mostly go bust when they get hacked.QuoteI have some USDT that I plan to use to buy coins probably when BTC is down to 10k which I believed would happened in September but it never did so I moved the USDT out of the exchange back into my wallet.Do not relent, do not trust any exchange, trust only your private keys, remember, not your keys, not your coins. A much better advice is to not trust anything centralized which includes USDT which is one of the most centralized altcoins that can go bust at any time.P.S. There is no reason for bitcoin go any lower than this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 06, 2022, 08:41:14 AM",
      "body": "Your advice would be wiser if you would advise people to stay away from investing heavily in stablecoins.Investing in stablecoins will have a negative impact if a big problem occurs in the market, just as happened to Luna, as the collapse of the Bitcoin price led to a lot of chaos in this market.The same goes for centralized platforms that actually own your money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "October 06, 2022, 08:57:19 AM",
      "body": "Quote from: KiaKia on October 06, 2022, 07:44:31 AMI have some USDT that I plan to use to buy coins probably when BTC is down to 10k which I believed would happened in September but it never did so I moved the USDT out of the exchange back into my wallet.While its definitely good idea to move USDT out of exchange and into your own non-custodial (I hope) wallet, your money is still not completely safe. I don't know if you area ware of the fact that USDT can be frozen by their issuer inside your own wallet and there would be nothing that you could do about it.Chances of that happening anytime soon are not great, but they exist and as you said in your post that no exchange is too big to fail, the very same goes for stablecoins so I would advise you not to hold them for too long.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "October 06, 2022, 09:03:16 AM",
      "body": "Take note crypto exchanges are bankrupt doesn't only because of bear market alone, but there's many cases where centralized exchanges suffered hack for multiple times as you can read it here Hacked Exchanges since 2011Anyone must not leave their coins on centralized exchanges regardless any reason because it's really riskier to lose all of your coins rather than spend some satoshi to send your coins from wallet to exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "October 06, 2022, 09:11:58 AM",
      "body": "Quote from: KiaKia on October 06, 2022, 07:44:31 AMWith the way companies are going bankrupt this days I think I should warn my fellow Bitcointalk friends, give me a minute of your time.As you mentioned, many companies that go bankrupt have a reason for doing so. Many of them have initial problems that they may overlook, which can be a key problem to the company letter on and they will have no choice but to go bankrupt.That is why proper planning is always recommended; any company or project that has proper planning appears to be very strong and would be difficult to bankrupt easily.QuoteForget about how big a crypto exchange have grown, do not leave your coins on exchange, we can never tell which exchange will go down unexpectedly in this bear market.Do not relent, do not trust any exchange, trust only your private keys, remember, not your keys, not your coins. Although some of the world's leading exchanges are very good and reliable, when it comes to cryptocurrency investment, \"trust no one.\" Those exchanges have total control over all of your investments in their exchanges, and they can also go down or bankrupt at any time, or they can leak your data because you submitted your details for KYC in the exchange.Keep your coins in your personal wallet and make sure your private keys and seed phrases are secure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "October 06, 2022, 09:22:13 AM",
      "body": "Quote from: Rikafip on October 06, 2022, 08:57:19 AMI don't know if you area ware of the fact that USDT can be frozen by their issuer inside your own wallet and there would be nothing that you could do about it.If Op is not aware, they can read about it in this post, Most Stablecoins Can Be Frozen, Even in Your Own Wallets, anything that is centralized can't be completely in the control of the owner, the issuers have the final say and decision, that is why centralized services or coins are not advisable.Quote from: KiaKia on October 06, 2022, 07:44:31 AMI have some USDT that I plan to use to buy coins probably when BTC is down to 10k which I believed would happened in September but it never did so I moved the USDT out of the exchange back into my wallet.BTC may not move down to 10k now, and $20,150 is a good buying price, if you keep on waiting for it to go down to 10k before you buy, you may not buy before the next bull run starts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "October 06, 2022, 09:29:38 AM",
      "body": "Quote from: hugeblack on October 06, 2022, 08:41:14 AMYour advice would be wiser if you would advise people to stay away from investing heavily in stablecoins.Investing in stablecoins will have a negative impact if a big problem occurs in the market, just as happened to Luna, as the collapse of the Bitcoin price led to a lot of chaos in this market.The same goes for centralized platforms that actually own your money.Buying stable coins shouldn't be considered as investment, it's like exchanging your Fiat to Digital, how about going for stable coins from projects that has enough collateral funds on ground to cover for any unexpected loses? I'm saying this because that's why I choose Binance exchange BUSD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "October 06, 2022, 10:16:05 AM",
      "body": "There are two types of people when it comes to Bitcoin - those who think they know what Bitcoin is, and those who have understood the difference between Bitcoin and everything else. These others do not even understand how unstable the so-called stablecoins actually are and that the failure of a centralized crypto exchange is no less likely than the failure of the company behind the most famous stablecoins of today.The belief of a part of the crypto community that expects the price of Bitcoin to drop even more is quite justified in a speculative sense, but how realistic is it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "October 06, 2022, 10:25:50 AM",
      "body": "Quote from: KiaKia on October 06, 2022, 07:44:31 AMDo not relent, do not trust any exchange, trust only your private keys, remember, not your keys, not your coins. You came with a very good advice and a bad example.USDT is a centralized coin. USDT being pegged to USD is not a given - sometimes it's closer to USD, sometime it's not - and you have to trust the issuer, which has the power to make your money worthless or freeze it.So, indeed, not your keys, not your coin, but long time storing in your wallet makes sense only for proper decentralized cryptocurrencies.Keep in mind that while \"not your keys, not your coins\" is correct, \"your keys, your coins\" is not always true.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "October 06, 2022, 10:34:33 AM",
      "body": "Quote from: Rikafip on October 06, 2022, 08:57:19 AMQuote from: KiaKia on October 06, 2022, 07:44:31 AMI have some USDT that I plan to use to buy coins probably when BTC is down to 10k which I believed would happened in September but it never did so I moved the USDT out of the exchange back into my wallet.While its definitely good idea to move USDT out of exchange and into your own non-custodial (I hope) wallet, your money is still not completely safe. I don't know if you area ware of the fact that USDT can be frozen by their issuer inside your own wallet and there would be nothing that you could do about it.Chances of that happening anytime soon are not great, but they exist and as you said in your post that no exchange is too big to fail, the very same goes for stablecoins so I would advise you not to hold them for too long.I agree with you. it may not seem like it right now, but I think bitcoin is currently the safest currency for storing money/value. of course, using the proper way on wallets that offer full control.btw. I think $18k is the bottom right now, only in the case of a serious global crisis can it be lower.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "October 06, 2022, 10:38:10 AM",
      "body": "Quote from: KiaKia on October 06, 2022, 07:44:31 AMForget about how big a crypto exchange have grown, do not leave your coins on exchange, we can never tell which exchange will go down unexpectedly in this bear marketThanks for the subtle warning, centralized exchanges will always be known and remain insecure as need by us, if can can run away from government and yet fall in hand of another government or third party in the name of exchanges then that makes no difference from where we are coming from, data leak and bridge of privacy and security is what should be the main target of every cryptopreneurs to ensure that they were avoided by all means and there are ways to do about these, stay decentralized, run of full node, use bitcoin core, or get yourself an offline walllet like electrum or buy hardware wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "October 06, 2022, 10:42:29 AM",
      "body": "Quote from: KiaKia on October 06, 2022, 07:44:31 AMWith the way companies are going bankrupt this days I think I should warn my fellow Bitcointalk friends, give me a minute of your time.Forget about how big a crypto exchange have grown, do not leave your coins on exchange, we can never tell which exchange will go down unexpectedly in this bear market.It was worth the time taken, thank you so much for the kind advice but I still wonder why most people, still leave thier funds in centralized exchanges after reading and hearing all that is going on, around the world and with other big exchange companies.Most times people tend to follow the trend and believes of others without trying to have a rule for themselves. For example, Mr A who has other sources of funds has over a thousand dollar in his trading portfolio on an exchange without making any withdrawal and maybe if there is any casualties, Mr A has where to fall back to and bounce back immediately and then Mr B on seeing or even hearing this, tends to put all his $100 in one portfolio in an exchange without considering any casualty and when the unknown happens Mr B will be stranded and then start calling cryprocurrencies scam.Please let's work to seek and find what works for us and when we do please we should also stick to it and try not to put money not meant for trading in exchanges",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "October 06, 2022, 11:19:13 AM",
      "body": "Quote from: pooya87 on October 06, 2022, 08:38:16 AMA much better advice is to not trust anything centralized which includes USDT which is one of the most centralized altcoins that can go bust at any time.P.S. There is no reason for bitcoin go any lower than this.I don't understand why people keep their coins on exchange if they are not involved in trading as you are using centralised services for storing a decentralised asset so you are completely diluting the base purpose of Bitcoin existence.These exchange have your keys and funds are in their custody and they can take anytime big action on you putting restrictions on you to withdraw funds.Now speaking of these stable coins then we saw an algorithm fault could disrupt the whole market and making these stable coins collapse easily as in the case of LUNA so why should be trusting these coins at all? The USDT is also centralised and you are not getting anything by holding it in return and they can take any action to bust you as said correctly so people need to understand these things and stay away from them and bitcoin is the best choice available to us.And those who keep their coins on these exchange just have a look at this image which says coinbase can sell your coins to pay liabilities in case of bankruptcy so what safety you are assuring from these CEX?Quote from: aysg76 on May 13, 2022, 12:39:56 PMSo are there are valid reasons why people prefer to keep their coins on CEX? I don't see any one of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "October 06, 2022, 12:10:05 PM",
      "body": "Stop waiting for 10k per BTC, it may never come to pass and you will remain a sitting hand until the bear market is over, no matter how accurate a trader market strategy may be they can't always be precise, take advantage of every dips and resist going all in, this is now a case of what may or may never happen so be prepared for both sides, keep stable coin and also buy some BTC in the dips.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "October 07, 2022, 04:08:27 AM",
      "body": "Quote from: aysg76 on October 06, 2022, 11:19:13 AMI don't understand why people keep their coins on exchange if they are not involved in trading as you are using centralised services for storing a decentralised asset so you are completely diluting the base purpose of Bitcoin existence.It's because some people got into this world wanting to make money and at the same time were too lazy to research what they were buying. Most of them think bitcoin is like PayPal where the only way to use it is to sign up somewhere!It gets worse when it comes to altcoins since they don't usually have any decent wallet or any SPV clients at all. So you'll have to run the full node of that shitcoin or buy a hardware wallet or store it on an exchange, they obviously choose the last option since it is cheaper and they can dump them any time they want without needing to wait for hundreds of confirmation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "October 07, 2022, 04:34:23 AM",
      "body": "Quote from: KiaKia on October 06, 2022, 07:44:31 AMWith the way companies are going bankrupt this days I think I should warn my fellow Bitcointalk friends, give me a minute of your time.Forget about how big a crypto exchange have grown, do not leave your coins on exchange, we can never tell which exchange will go down unexpectedly in this bear market.I have some USDT that I plan to use to buy coins probably when BTC is down to 10k which I believed would happened in September but it never did so I moved the USDT out of the exchange back into my wallet.Do not relent, do not trust any exchange, trust only your private keys, remember, not your keys, not your coins. So what wallet do you use to store your USDT, is it a hardware wallet or a software wallet?offending the bitcoin price, if you expect to buy bitcoin when it's $10000, rest assured it will never happen, bitcoin price will never again be below $15000. a few days ago I saw the bitcoin price drop below $20k, I think you missed a good opportunity to buy.btw, the best place to store bitcoin and altcoins is a non-custodial wallet; Code:https://www.exodus.com/https://bluewallet.io/https://trustwallet.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "October 07, 2022, 04:50:46 AM",
      "body": "Quote from: KiaKia on October 06, 2022, 07:44:31 AMWith the way companies are going bankrupt this days I think I should warn my fellow Bitcointalk friends, give me a minute of your time.Forget about how big a crypto exchange have grown, do not leave your coins on exchange, we can never tell which exchange will go down unexpectedly in this bear market.I have some USDT that I plan to use to buy coins probably when BTC is down to 10k which I believed would happened in September but it never did so I moved the USDT out of the exchange back into my wallet.Do not relent, do not trust any exchange, trust only your private keys, remember, not your keys, not your coins. Either with Bankruptcy or not, the idea of leaving your coins on an exchange is never a good one, we all should have learned from Celcius, they are still battling on how to open back the platform so that people can have access to liquidity but it seems it is not only the users that are finding a way to exit liquidity, the venture capitals are now on the bench waiting as well and a result, the SEC has put in their interest in investigating everyone involve in Celcius.There are so many things that can happen to an exchange, they can get hacked, they can get sued and locked for anytime God knows depending on the duration of the investigation and not only that, exchanges can deny you access to your own money if they found out you violet their terms and conditions, remember not your keys, not your coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}