{
  "id": "topic_5451272",
  "title": "hugeblack",
  "author": "hugeblack",
  "created_time": "May 05, 2023, 02:01:41 AM",
  "content": "I think some of you may have heard of the story, but I did not see discussions here. I will quote the important points:QuoteWestern Alliance shares recovered from their session lows after the Arizona-based bank denied it was exploring a potential sale.The Arizona bank described an earlier version of this FT report, which said it was considering a potential sale of all or part of its business, as “categorically false in all respects”, adding: “Western Alliance is not exploring a sale, nor has it hired an advisor to explore strategic options.”Western Alliance has sought advice from the law firm Sullivan & Cromwell on dealing with the current turmoil in regional banking but said it had not hired them or other advisers to work on a specific transaction.Sullivan & Cromwell said: “We have been providing legal advice around the banking situation to Western Alliance but neither we nor anybody else have been hired for a sale or a capital raise.”Western Alliance, which has $65bn of assets, was trading down 26 per cent before the report was published, after which they traded down as much as 61 per cent on the day. The shares recovered before closing down 38 per cent.Source ----> https://www.ft.com/content/bf2bd5af-1e55-4be3-b29d-f5cae9533b29I don't know if it was the Financial Times report, but if one piece of news could have caused bank shares to decline by that much, then Bitcoin has become more solid and volatile than in the past.What do you think, will we face more banks, more difficulties, or has the worst already happened?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451272",
  "comments": [
    {
      "author": "adaseb",
      "created_time": "May 05, 2023, 04:16:08 AM",
      "body": "I think it’s too late. Because most likely many shareholders won’t want to hold the stock because they have the most to lose if it gets seized.So many banks went bust that people are scared and they won’t want to risk anything and will either send their money to a money market fund or send it to a large bank like JPM.Shareholders have no benefit really. The deposits will get bailed out but shareholders won’t. So why risk holding the stock. JPM will buy it for pennies and they will get wiped out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "May 05, 2023, 04:53:29 AMLast edit: May 05, 2023, 06:05:47 AM by Die_empty",
      "body": "Quote from: hugeblack on May 05, 2023, 02:01:41 AMI think some of you may have heard of the story, but I did not see discussions here. I will quote the important points:QuoteWestern Alliance shares recovered from their session lows after the Arizona-based bank denied it was exploring a potential sale.The Arizona bank described an earlier version of this FT report, which said it was considering a potential sale of all or part of its business, as “categorically false in all respects”, adding: “Western Alliance is not exploring a sale, nor has it hired an advisor to explore strategic options.”Banks will always deny that they are having problems to discourage customers from withdrawing their funds. But this deception won't last for long because they will start looking for options such as sourcing for funds and laying off workers. QuoteI don't know if it was the Financial Times report, but if one piece of news could have caused bank shares to decline by that much, then Bitcoin has become more solid and volatile than in the past.What do you think, will we face more banks, more difficulties, or has the worst already happened?More banks will also have the same issues because of the recent FED increase of interest rate. The increase will reduce customer's loan applications because it will be more expensive to borrow. Meanwhile, bank debtors will have to repay their loans based on past lower interest rates making banks to experience more losses. Businesses will also withdraw more funds from their deposits because loans are expensive. Also, some banks are mismanaged because most of their deposits exceed the $250,000 insurance benchmark of FDIC.I have observed that bitcoin is gradually becoming independent of some economic news and the fall of these banks has made Bitcoin more attractive to investors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "be.open",
      "created_time": "May 05, 2023, 05:31:35 AM",
      "body": "Quote from: adaseb on May 05, 2023, 04:16:08 AMI think it’s too late. Because most likely many shareholders won’t want to hold the stock because they have the most to lose if it gets seized.So many banks went bust that people are scared and they won’t want to risk anything and will either send their money to a money market fund or send it to a large bank like JPM.Shareholders have no benefit really. The deposits will get bailed out but shareholders won’t. So why risk holding the stock. JPM will buy it for pennies and they will get wiped out.You are right, the shares of regional banks have now become the most toxic type of financial asset, generating losses at a frantic pace. I think few people in their right mind want to keep such an asset in their portfolio now, so every trading session there are panic sales.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "May 05, 2023, 07:40:27 AMLast edit: May 05, 2023, 07:50:58 AM by Tytanowy Janusz",
      "body": "Quote from: hugeblack on May 05, 2023, 02:01:41 AMWhat do you think, will we face more banks, more difficulties, or has the worst already happened?I think we are not even close to \"worst already happened\"the current collapse is aleady bigger than 2008 trigger event:https://www.nextbigfuture.com/2023/05/worst-year-in-us-bank-failures-will-get-worse.htmland that's how it went:https://twitter.com/byHeatherLong/status/1653036404241309699The housing bubble is also bigger than in 2008. More blood is yet to come.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "May 05, 2023, 07:50:21 AMLast edit: May 05, 2023, 08:23:36 AM by stompix",
      "body": "Quote from: hugeblack on May 05, 2023, 02:01:41 AMWhat do you think, will we face more banks, more difficulties, or has the worst already happened?Are you serious?  You're asking on bitcointalk bitcoin users if banks will face more difficulty and you think you will get a single nonbiased to the core answer who won't point at the banks disappearing by June, the fiat system collapsing and lemurs in Madagascar paying with bitcoins their mortgage?This is the epicenter of the doomsayer's lair, banks are gone bruh!!! Don't ask silly questions! They are doomed!Meanwhile, thousands wire money in and out of Binance to get their profits in shitty dollars!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "May 05, 2023, 10:46:24 AM",
      "body": "The people working at the Federal Reserve had realized at this point, that a new interest rate hike will be the nail in the coffin for the banks.I'm sure that FED will stop with the interest rate hikes after the last one.It's normal to have uncertainty around the US banking stocks. All the news, gossips and rumors could make or break the stock prices of the US banks. We have enough experience with volatility here on the crypto markets. All the crypto haters keep complaining about Bitcoin and altcoins being volatile, but they don't say anything about the volatility on the stock market.  I know that cryptocurrencies aren't stocks, but both crypto and stocks are financial assets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "May 05, 2023, 11:24:53 AM",
      "body": "Quote from: stompix on May 05, 2023, 07:50:21 AMAre you serious?  You're asking on bitcointalk bitcoin users if banks will face more difficulty and you think you will get a single nonbiased to the core answer who won't point at the banks disappearing by June, the fiat system collapsing and lemurs in Madagascar paying with bitcoins their mortgage?This is the epicenter of the doomsayer's lair, banks are gone bruh!!! Don't ask silly questions! They are doomed!I enjoy \"black and white\" opinions because at least they mean people continue to believe in something that won't happen anytime soon.I was expecting to see the opinions of individuals about the rumors of bank collapse. I did not face such an option in the past. The worst thing I saw was that I moved to a country and the banks were suffering from a liquidity crisis, so restrictions were placed on the daily withdrawal limit, but to put your money and investments in a sector knowing that it may collapse, this is Courage (I don't mean the big banks)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}