{
  "id": "topic_5406734",
  "title": "gospodin",
  "author": "gospodin",
  "created_time": "July 18, 2022, 03:11:53 PM",
  "content": "komik değil mi:)hepimizin dün gibi hatırladığı rusya savaşı sonrası yaşanan ayçiçek yağı krizi cebimizde. birileri işin bokunu çıkararak fiyatları resmen uçurmuştu ve bu da doğal olarak insanlarımızın daha da fazla alım yapmasına neden olmuştu.şimdi savaş sıkıntısını bir kenara koyduk gibi ama karşımızda şu an da trakya'da ortaya çıkan tırtıl meselesi var: https://www.ntv.com.tr/galeri/turkiye/trakyada-aycicegi-tarlalarinda-cayir-tirtili-istilasi,nFy-4wQIEkmGhLzodh4qnAyetkililer sınırlara yakın olduğu için drone uçurma konusunda zorlandıklarını söylemişti. dedikleri yerler konusunda haklılar. neyse bu gelişmeler sonucu sizce fiyatlar ne gibi bir harekette olur. not: kripto para forumuna bak amk.not1: ben zaten zeytinyağı kullanıyorum, kızartmalar için fritöz yeterli ama yine de evde en az 5-10 litre sıvıyağ denilen naneden stoklarım. amazon'da fiyat iyi gibi.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406734",
  "comments": [
    {
      "author": "Gencecikmen",
      "created_time": "July 18, 2022, 06:35:23 PM",
      "body": "Nasıl bir zamana denk geldik anlamıyorum, hiç bir şey olmasa bile bir şey oluyor ve olan halka oluyor. Şimdi fiyatlar bir kez daha tırmanır. Bir de bu krizden faydalanarak fiyatı bilerek artıranlar olur, iyice işin içinden çıkılmaz hale gelir. Mis gibi enflasyon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Retro Harmony",
      "created_time": "July 18, 2022, 08:08:08 PM",
      "body": "Ayçiçek yağının her yemeğe girdiğini biliyorum en azından bizim evimizde böyle. Bu yüzden biraz ihtiyaç kadar alıp fiyatının daha yüksek olmamasından önce tedbiri biraz almamız daha doğru olur. Fiyatına gelince bir ara markete baktığımda fiyatın hemen hemen aynı olduğunu görmüştüm belki baktığım market fiyatları arttırmamıştır o kadarını bilmiyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "July 18, 2022, 09:19:56 PM",
      "body": "Ayçiçek yağı fiyatlarına verilen tepkiler, stok yapmak için verilen amansız mücadeleler unutulmuştu şimdi tekrar yeniden gündemimize girdi. Fiyatı artırmak için en ufak bir bahane artık yetiyor ama tırtıl meselesi iç piyasaya verilen malın fiyatında pahalılaşmaya yol açacaktır. İthal mallar kaldığı yerden devam eder. Bunu gören satıcılar affeder mi sanmam ithal yağlara da yerliye gelecek fiyat artışı miktarında güncelleme yapılır",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Red Pie",
      "created_time": "July 19, 2022, 04:34:43 AM",
      "body": "Quote from: karabiber on July 18, 2022, 09:19:56 PMAyçiçek yağı fiyatlarına verilen tepkiler, stok yapmak için verilen amansız mücadeleler unutulmuştu şimdi tekrar yeniden gündemimize girdi. Fiyatı artırmak için en ufak bir bahane artık yetiyor ama tırtıl meselesi iç piyasaya verilen malın fiyatında pahalılaşmaya yol açacaktır. İthal mallar kaldığı yerden devam eder. Bunu gören satıcılar affeder mi sanmam ithal yağlara da yerliye gelecek fiyat artışı miktarında güncelleme yapılır Bir de ürüne yapılan yüksek zamlar vardı gereksiz yere arttırılan sırf talep yüksek diye fiyat arttıran firmalar. bu arada bazı bilinmedik markalara bakın yüzde 100 ayçiçek yağı değil, çeşitli yağlardan oluşturulmuş “çoğunluğu” ayçiçek yağı olan bir yağ. içinde kanola, soya gibi besleyici olmayan ancak yağı çok çıkan yağları da karıştırmışlar. yağ sektörü tamamen işi ranta çevirmiş.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "July 21, 2022, 10:41:18 AM",
      "body": "Sadece ayçiçekte mağduriyet yok. Ayçiçek gibi şeker fiyatları da tavan yapmış durumda. 5 kg şeker fiyatı 120-130 TL bandında seyrediyor. Belki de daha da artmıştır yakın zamanda almamıştım. Yağ fiyatlarının enflasyon ile normal seyrine döneceğini düşünmüyorum. Ukrayna Rusya savaşı bizim gibi bir çok ülkede buğday ve yağ fiyatlarını çok yükseltti.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "July 21, 2022, 11:53:39 AM",
      "body": "Evde biz de alışkanlık olarak zeytinyağı kullanıyoruz. İş yerinde ise zoraki zeytinyağı pahalı diye herhalde ayçiçek yağı tercih ediliyor. Bugün sanal markette gezinirken ayçiçek yağında indirim görmüştüm. Açıkçası ben bu yağ krizi çözülüyor kapanıyor sanıyordum ama ülkemizin enflasyon durumu malum olunca ne çözülmüş bu çözülsün. Bu arada drone ile ilaçlama muhabbeti gerçekten iyiymiş artık bilimkurgu filmi gibi hayatın her alanında drone yani minyatür hava araçları görüyoruz. Şaşırtıcı bi durum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "July 21, 2022, 11:55:47 AM",
      "body": "Quote from: Pierre 2 on July 21, 2022, 11:53:39 AMEvde biz de alışkanlık olarak zeytinyağı kullanıyoruz. İş yerinde ise zoraki zeytinyağı pahalı diye herhalde ayçiçek yağı tercih ediliyor. Bugün sanal markette gezinirken ayçiçek yağında indirim görmüştüm. Açıkçası ben bu yağ krizi çözülüyor kapanıyor sanıyordum ama ülkemizin enflasyon durumu malum olunca ne çözülmüş bu çözülsün. Bu arada drone ile ilaçlama muhabbeti gerçekten iyiymiş artık bilimkurgu filmi gibi hayatın her alanında drone yani minyatür hava araçları görüyoruz. Şaşırtıcı bi durum.Bugün Hataylı bir arkadaşımız kendi bahçesinde ürettikleri zeytinden çıkardıkları zeytinyağını kilosu 40 liradan verecek bana, ayçiçek parasına zeytinyağı alacağım için kendimi çok şanslı hissediyorum, herkese tavsiyem üreticisinden alabilirse zeytinyağını ayçiçeğe tercih etmesi, şu an çok ayçiçek yağında katma yabancı maddeler olduğu dolanıyor internette özellikle zincir mağazaların ucuza sattıkları bilinmeyen markalarda,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "July 21, 2022, 04:32:15 PM",
      "body": "Quote from: kriminall on July 21, 2022, 11:55:47 AMQuote from: Pierre 2 on July 21, 2022, 11:53:39 AMEvde biz de alışkanlık olarak zeytinyağı kullanıyoruz. İş yerinde ise zoraki zeytinyağı pahalı diye herhalde ayçiçek yağı tercih ediliyor. Bugün sanal markette gezinirken ayçiçek yağında indirim görmüştüm. Açıkçası ben bu yağ krizi çözülüyor kapanıyor sanıyordum ama ülkemizin enflasyon durumu malum olunca ne çözülmüş bu çözülsün. Bu arada drone ile ilaçlama muhabbeti gerçekten iyiymiş artık bilimkurgu filmi gibi hayatın her alanında drone yani minyatür hava araçları görüyoruz. Şaşırtıcı bi durum.Bugün Hataylı bir arkadaşımız kendi bahçesinde ürettikleri zeytinden çıkardıkları zeytinyağını kilosu 40 liradan verecek bana, ayçiçek parasına zeytinyağı alacağım için kendimi çok şanslı hissediyorum, herkese tavsiyem üreticisinden alabilirse zeytinyağını ayçiçeğe tercih etmesi, şu an çok ayçiçek yağında katma yabancı maddeler olduğu dolanıyor internette özellikle zincir mağazaların ucuza sattıkları bilinmeyen markalarda,ilk olarak bu şekilde üreticiden almanızı tavsiye etmem. sebebini uzun uzun yazarım ama üşendim:)ikinci olarak da hatay bölgesinin yağları çok iyi değildir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "July 21, 2022, 06:33:59 PM",
      "body": "Yağ konusunda birkaç bilgi paylasirsan sevinirim Zeytinyağını çok seven biriyim bende Dalaman tarafindan bir miktar yağ getirttim yarı soğuk sıkım.Üreticiden neden almamaliyiz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "July 22, 2022, 09:26:39 PM",
      "body": "Benim bildiğim kadarıyla köylülerin sattıkları genelde sızma zeytinyağı olmuyor. Bizim başımıza da benzer bir olay geldi. Bodrum'da tanıdığımız vardı. Onlar aracılığıyla Milas'ın bir köyünden sözde onların kendi ailesi için kullandıkları yani kendi bahçelerinden ben, ailem ve birkaç tanıdığımız yağ satın aldık. Hatta ben sevdiğim için abartıp 3 litre aldım ki çok aşırı kullanmıyoruz. Sonra gene bu yağı da alan akademisyen bir tanıdığımız merak edip üniversitesindeki gıda mühendisliği bölümünde baktırmış ve asit olması gereken 0.8'in çok üstünde çıkmış. Yani teknik olarak riviera zeytinyağı oluyor, sızma değil. Sonra birkaç yerden daha duydum ki bu köylülerin sattığı yağlar neredeyse hep riviera çıkıyormuş. Ama açıkçası çok lezzetli bir yağ idi. Kalp ve sağlık için aynı olumlulukta olamayacağım tabi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "July 23, 2022, 09:47:23 AM",
      "body": "Quote from: püsür on July 22, 2022, 09:26:39 PMBenim bildiğim kadarıyla köylülerin sattıkları genelde sızma zeytinyağı olmuyor. Bizim başımıza da benzer bir olay geldi. Bodrum'da tanıdığımız vardı. Onlar aracılığıyla Milas'ın bir köyünden sözde onların kendi ailesi için kullandıkları yani kendi bahçelerinden ben, ailem ve birkaç tanıdığımız yağ satın aldık. Hatta ben sevdiğim için abartıp 3 litre aldım ki çok aşırı kullanmıyoruz. Sonra gene bu yağı da alan akademisyen bir tanıdığımız merak edip üniversitesindeki gıda mühendisliği bölümünde baktırmış ve asit olması gereken 0.8'in çok üstünde çıkmış. Yani teknik olarak riviera zeytinyağı oluyor, sızma değil. Sonra birkaç yerden daha duydum ki bu köylülerin sattığı yağlar neredeyse hep riviera çıkıyormuş. Ama açıkçası çok lezzetli bir yağ idi. Kalp ve sağlık için aynı olumlulukta olamayacağım tabi.Yıllardır şu köyden geliyor kendi kullandığımız lafları o kadar oturmuş ki kafamızda bi akıl edip de baktırmamışız değerlerine. Şimdi şüpheyle yaklaşıcam. Riviera ve sızma zeytinyağı arasındaki fark nedir?Sızma zeytinyağı için zeytin ezilme ve parçalanma gibi bazı işlemler görür. Riviera ise rafine zeytinyağının ısıtılıp kimyasal işlemlerle temizlenmesi ve natürel yağ ile karıştırılmasıyla elde edilir. Tat bakımından sızma zeytinyağı daha aromatiktir, riviera ise hafif bir tada sahiptir.Link'te zararları ve aksi düşünceleri yer alıyor;https://www.nefisyemektarifleri.com/blog/riviera-zeytinyagi-nedir/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "July 23, 2022, 08:51:01 PM",
      "body": "Son 2 haftada yağ fiyatlarında yavaş yavaş indirimler gelmeye başlamıştı, online alımlarda güzel kampanyalar oldu. Demek ki yeniden fiyatların uçuşa geçme zamanı yaklaşıyor. İhtiyacı olan kişilerin yavaştan stoklama fırsatları kovalama zamanı geldi.Yeni mahsul ürünler raflara çıkınca aslında indirim artmalı ama maliyetler artıyor ve üretim beklenen miktarda gelemeyince fiyat doğal olarak artıyor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "July 23, 2022, 09:20:39 PM",
      "body": "Bu aralar marketlerde ayçiçek yağlarına bolca kampanya var. Şu kadar alışverişe x litre yağ 20 TL gibi. Sanırım stok fazlalarını elden çıkarmaya çalışıyorlar. En son Trakya bölgesinde ayçiçek tarlalarında hastalık görülmüştü ve fiyatlar sabit kalmıştı şaşırmıştım. Şimdi de fiyatların düşmesine şaşırıyorum. Ancak ithal malların fiyatlarının sabit kaldığını söylemeliyim. Önümüzdeki sonbahar aylarında fiyatların tekrar yukarı yönlü olacağını düşünüyorum. İhtiyaçtan biraz fazlası alınabilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}