{
  "id": "topic_5470826",
  "title": "krishnaverma",
  "author": "krishnaverma",
  "created_time": "October 18, 2023, 05:51:43 PM",
  "content": "I have often wondered about the people who have lost a lot in gambling and who almost loose in every gambling activity they participate. What is their reason or motivation to continue even after so many losses?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470826",
  "comments": [
    {
      "author": "Odohu",
      "created_time": "October 18, 2023, 05:55:07 PM",
      "body": "Quote from: krishnaverma on October 18, 2023, 05:51:43 PMI have often wondered about the people who have lost a lot in gambling and who almost loose in every gambling activity they participate. What is their reason or motivation to continue even after so many losses? Are there really people like that? It seems strange to me that someone will continue in gambling when failure is experienced in every gambling activity. That does not seem reasonable to me. Maybe they have had a major win before the series of losses....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "October 18, 2023, 06:03:42 PM",
      "body": "There are times they lose and also win. More reason to continue is they are hoping to win. As long as they have funds to bet, I think the gamblers are still going to keep playing. In crypto though, they can use the free spins and some coins we earn.Either we have the motivation to continue gambling or we are just addicted. Some of us are already in it without minding it. I guess it's still fun to play despite losing many times.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "October 18, 2023, 06:07:11 PM",
      "body": "They’ve lost an amount, what drives them is to get back with their losses and hope to win. I experienced losing for a week and I almost stop there however, I chose to just manage the amount I can afford losing and just continued what I was doing. Changing the game you are playong would atleast give you a bigger chance to win ‘coz pushing it through will just make losses bigger. If you choose to quit then that would be fine; we all have different levels of tolerance with our losses by the way,so better discover yours. Luck exists in our bodies but it won’t come in an instant and won’t take place on a daily basis. Therefore prevention would be the best thing do do; implying self discipline and limitation could little by little help you regain the losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "October 18, 2023, 06:09:23 PM",
      "body": "Quote from: krishnaverma on October 18, 2023, 05:51:43 PMI have often wondered about the people who have lost a lot in gambling and who almost loose in every gambling activity they participate. What is their reason or motivation to continue even after so many losses? It is because they are looking for ways to earn money from gambling, but which is not possible because people that are looking for means to earn money from gambling lastly lose after they continue to play. They also risk more than the money that they can afford to lose. They do not also have self-discipline about gambling and that makes them to gamble irresponsibly without thinking about the negative consequences until it happens. They are unable to control the their emotion that makes them to continue to lose, instead to quit for the day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "October 18, 2023, 06:18:01 PM",
      "body": "Quote from: krishnaverma on October 18, 2023, 05:51:43 PMI have often wondered about the people who have lost a lot in gambling and who almost loose in every gambling activity they participate. What is their reason or motivation to continue even after so many losses? Well what I am familiar is that many people that lose much has also had time they won big that's gambling, they aren't stupid people. Gambling goes both ways and not just gambling also investing and trading has this type of people.Gambling is an activity but should not cause anyone get addicted to it. I have lost in gambling but also I have won so I don't see why I should not continue in it .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "October 18, 2023, 06:21:04 PM",
      "body": "They enjoy the games, remember that the online gambling industry is designed in such a way to cater to the entertainment base of users.If you are referring to the frequency of losses, not the amount of losses, then you should not generalize this kind of experience as a gambler's losses, but commensurate exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rachael9385",
      "created_time": "October 18, 2023, 06:21:17 PM",
      "body": "Quote from: Odohu on October 18, 2023, 05:55:07 PMQuote from: krishnaverma on October 18, 2023, 05:51:43 PMI have often wondered about the people who have lost a lot in gambling and who almost loose in every gambling activity they participate. What is their reason or motivation to continue even after so many losses? Are there really people like that? It seems strange to me that someone will continue in gambling when failure is experienced in every gambling activity. That does not seem reasonable to me. Maybe they have had a major win before the series of losses....Well, I do say that it is only those addicted gamblers that have once experienced big wins from gambling that always continue even after losing huge amount of money while gambling, it is a bit easy for those who haven't been fully involved in gamble to quit when they loose in gamble.However, everyone has their own belief. Some might think that even if they are losing from gambling today, some day they will eventually win big to recover their losses from gambling. It is easy to lose by gambling, but very hard to recover from loss or to win, but still every gambler has their own belief.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "October 18, 2023, 06:22:30 PM",
      "body": "Quote from: krishnaverma on October 18, 2023, 05:51:43 PMI have often wondered about the people who have lost a lot in gambling and who almost loose in every gambling activity they participate. What is their reason or motivation to continue even after so many losses? The losses itself. If you are ever seeing those gamblers that keeps on going on despite the huge losses already, it is because of that. When you've been beaten for so many times and your money has been taken into your hands.All you want is to take them back. But what happens for most is that they're taken for more and that's how it goes. It still ends up into stopping but that's like with some rage in the heart because of those losses incurred.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Richbased",
      "created_time": "October 18, 2023, 06:28:57 PM",
      "body": "Quote from: boyptc on October 18, 2023, 06:22:30 PMQuote from: krishnaverma on October 18, 2023, 05:51:43 PMI have often wondered about the people who have lost a lot in gambling and who almost loose in every gambling activity they participate. What is their reason or motivation to continue even after so many losses? The losses itself. If you are ever seeing those gamblers that keeps on going on despite the huge losses already, it is because of that. When you've been beaten for so many times and your money has been taken into your hands.All you want is to take them back. But what happens for most is that they're taken for more and that's how it goes. It still ends up into stopping but that's like with some rage in the heart because of those losses incurred.It is very unfortunate how some persons derive joy in loses, how can someone be doing a business and you're losing conspicuously then they still continue doing the business why don't they quit or rather discard it for sometime. Like in football there are weeks that matches presented are not too familiar with a gambler so instead of leaving it they will want to try luck knowing too well that the chances of predicting the outcome of the event is not cerntain",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "October 18, 2023, 06:47:26 PM",
      "body": "Quote from: krishnaverma on October 18, 2023, 05:51:43 PMI have often wondered about the people who have lost a lot in gambling and who almost loose in every gambling activity they participate. What is their reason or motivation to continue even after so many losses? I guess they are too rich to worry about the money lost in their gambling activities. Gambling is not supposed to be seen in a way of making money but if someone never experienced winning will not be thrilled to gamble in my opinion so one who is still doing it is probably dumb to realize they can't become rich by losing money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Broadanbig",
      "created_time": "October 18, 2023, 06:57:56 PM",
      "body": "Wisdom demands that when you as a gambler play consecutively with recorded failures, it is expected that you retract for a while or possibly take a break from gambling but since common sense is not common to some gamblers they begin to chase their loses with the mentality and perspective of recovering their loss and they end up recording more loses more and more and this result to their addiction and the circle keep repeating itself again and again. These are the reason why most gamblers get addicted to gambling and finds it difficult stopping the habit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fatunad",
      "created_time": "October 18, 2023, 06:59:15 PM",
      "body": "Quote from: krishnaverma on October 18, 2023, 05:51:43 PMI have often wondered about the people who have lost a lot in gambling and who almost loose in every gambling activity they participate. What is their reason or motivation to continue even after so many losses? Motivation?- Chasing losses- Thinking up on break even- Next bet might be a win- You do still have balance, and that might be ending on hitting a jackpot or big win- You are just planning to make use of the remaining balance you do haveA very common type of problem on which most gamblers are really that into and this is why on the time that you would really be having losses on consecutive manner then it would really be that always wise that you shouldnt really be going into beyond borders or limits.Call it a day or simply that quitting that session after you had exhausted your balance because on the time that you would really be adding up more, then this is solid indication that youare really that addicted to it on the time that you would really be going against into those actions which are really that more sensible on doing so rather thanon making yourself that continuing until you have lost big time which is something that needs to avoid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartCharpa",
      "created_time": "October 18, 2023, 07:30:56 PM",
      "body": "Quote from: krishnaverma on October 18, 2023, 05:51:43 PMI have often wondered about the people who have lost a lot in gambling and who almost loose in every gambling activity they participate. What is their reason or motivation to continue even after so many losses? You know, even in gambling, it still involves those who have the knowledge and abilities. There are many people for whom gambling is not a way of life or a source of happiness but they don't seem to be giving up because they think that one day they will win no matter how they have previously lost. However, if I came across people who consistently lost on gambling and lacked luck in winning, I would advise them to stop gambling and try something else instead because it wasn't the right activity for them.I had two friends who have been gambling on sportybet for about seven years, and one has only won like six times, and even then, the winnings have never been enough to cover his losses. He always complained to me that he wanted to stop gambling but couldn't because he kept losing, despite his mind telling him to stop and the other telling him to keep playing because he would win one day. But he does not respond well to my constant advice to stop gambling. The worst part is that if they get their hands on a little bit of money, they'll start planning ways to gamble with it. I'm not sure if they experience pain when they lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "October 18, 2023, 08:58:15 PM",
      "body": "Quote from: krishnaverma on October 18, 2023, 05:51:43 PMI have often wondered about the people who have lost a lot in gambling and who almost loose in every gambling activity they participate. What is their reason or motivation to continue even after so many losses? Some habit of gamblers are worth emulating, not all habits that they show is bad. If you examine the life of a serious gambler, you will notice that gamblers have or develop a positive trait that can be emulated by others who do not even gamble, and that habit is having a strong mindset of mostly never giving up. There is always the sustained belief that if they keep trying, they will one day be able to win something tangible to cover all their loss or as compensation, and that is what keeps gamblers going.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TechnoX_X",
      "created_time": "October 18, 2023, 09:02:16 PM",
      "body": "Quote from: krishnaverma on October 18, 2023, 05:51:43 PMI have often wondered about the people who have lost a lot in gambling and who almost loose in every gambling activity they participate. What is their reason or motivation to continue even after so many losses? I am not an active gambler, I can understand the reasons for those who continue to gamble even though they often lose and there are only 2 reasons, either addiction or being too comfortable. A gambling addict will continue to come to gambling because he considers gambling as a place to make money and always wants to earn more. But if a gambler feels comfortable he just considers gambling like playing regular games to entertain himself with a very small amount or by using money he can afford to lose. So this gambler will not expect a big win because he realizes that gambling is just a place to find fun in his free time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "October 18, 2023, 09:06:10 PM",
      "body": "Quote from: krishnaverma on October 18, 2023, 05:51:43 PMI have often wondered about the people who have lost a lot in gambling and who almost loose in every gambling activity they participate. What is their reason or motivation to continue even after so many losses? For me, I think it's either to go breakeven of that loss or get back at it or you really want to win, other case is that it was a combination of it and passing the time. The motivation is to not lose the next time of course, that's like having a dopamine even if you're just getting lost after lost, psychology probably has explanation for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "October 18, 2023, 09:35:26 PM",
      "body": "Quote from: krishnaverma on October 18, 2023, 05:51:43 PMI have often wondered about the people who have lost a lot in gambling and who almost loose in every gambling activity they participate. What is their reason or motivation to continue even after so many losses? Is it continuous losses or just losses in the majority? I've experienced the former, as for the latter I believe I have more wins than losses afaik. Might be wrong though, I've gambled a couple of years already and I haven't really kept count. I've never really lost motivation while losing, if I did, I sure as hell would not have played countless games before (or even bough them if I feared losing). It's just part of the process, the game. This might be more apparent with gambling though since money is involved, but hey, that's the price I accepted before hand, wouldn't blame it if I lost or anything really, I'd seem rather dumb by then.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "October 18, 2023, 09:43:18 PM",
      "body": "Quote from: Richbased on October 18, 2023, 06:28:57 PMQuote from: boyptc on October 18, 2023, 06:22:30 PMQuote from: krishnaverma on October 18, 2023, 05:51:43 PMI have often wondered about the people who have lost a lot in gambling and who almost loose in every gambling activity they participate. What is their reason or motivation to continue even after so many losses? The losses itself. If you are ever seeing those gamblers that keeps on going on despite the huge losses already, it is because of that. When you've been beaten for so many times and your money has been taken into your hands.All you want is to take them back. But what happens for most is that they're taken for more and that's how it goes. It still ends up into stopping but that's like with some rage in the heart because of those losses incurred.It is very unfortunate how some persons derive joy in loses, how can someone be doing a business and you're losing conspicuously then they still continue doing the business why don't they quit or rather discard it for sometime. Like in football there are weeks that matches presented are not too familiar with a gambler so instead of leaving it they will want to try luck knowing too well that the chances of predicting the outcome of the event is not cerntainThere is this mindset and mentality named \"YOLO\". I know that you also know it and that's what makes someone to continue even if he's got nothing anymore but wanting to keep going. And with that mindset that encourages them, the other thing that they do is when they are using those disappointments and mainly losses in gambling as their motivation.You can see the point from there and that's why with gamblers that have been losing a lot of money, whether they've got reasons or not, something pushes them to go on and uses that as their motivation which is wrong obviously in our eyes but for them, it is not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Casdinyard",
      "created_time": "October 18, 2023, 09:49:52 PM",
      "body": "First off, the biggest reason why people quit after losing one too many times is the fact that they are either traumatized from the amount of money that they lost from the whole ordeal, or it's not just fun losing to them. I personally don't let it get to my head when such situations arise especially since I made it a point to only gamble for fun and not for the profit, but I'm not gonna lie there are instances where I lose my cool too and end up aggravated from my losses. But as the age old adage says, \"tomorrow is another day\" so I just hope for the best and assume that the next day's going to be more eventful. I'm not looking to win, I'm looking to enjoy and sometimes you can do that while you're losing too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}