{
  "id": "topic_5433957",
  "title": "pffffffff",
  "author": "pffffffff",
  "created_time": "January 10, 2023, 06:30:38 PM",
  "content": "So this was my father's bitcointalk account. There's also wallet.dat and a text file:bitcoin.orgbitcointalk.orgThe password is THE DATE13zEUPdpCDT3JGqv4o61vXQpgWWdxMEZeXThe coins are still there. I guess I can try some datesI've never used the old Bitcoin client. What do I do?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433957",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "January 10, 2023, 06:39:19 PM",
      "body": "I'm guessing you don't have bitcoin core installed? If not, install and run it, you can then go to the following path:Code:C:\\Users\\YourUserName\\Appdata\\Roaming\\BitcoinRplace the wallet.dat with the one you have and then restart your wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "January 10, 2023, 07:21:26 PM",
      "body": "Quote from: pffffffff on January 10, 2023, 06:30:38 PMThe coins are still there. I guess I can try some datesI would start with 2009-01-09 (Bitcoin's first transaction date)2016-05-05 (the date that wallet got funded at)Make sure you do tests offline, or if you are knowledgeable enough, on a live OS, still offline. Hacks are really a thing and 10BTC is an overly good looking amount.Make sure you know how your father was writing the dates (mm/dd/yyyy. dd.mm.yyyy, yyyy-mm-dd or other ways)Beware of people that may offer you help in private, some may be scammers.Good luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "January 11, 2023, 12:14:02 AMLast edit: January 11, 2023, 04:12:55 AM by goldkingcoiner",
      "body": "Quote from: NeuroticFish on January 10, 2023, 07:21:26 PMQuote from: pffffffff on January 10, 2023, 06:30:38 PMThe coins are still there. I guess I can try some datesI would start with 2009-01-09 (Bitcoin's first transaction date)2016-05-05 (the date that wallet got funded at)Make sure you do tests offline, or if you are knowledgeable enough, on a live OS, still offline. Hacks are really a thing and 10BTC is an overly good looking amount.Make sure you know how your father was writing the dates (mm/dd/yyyy. dd.mm.yyyy, yyyy-mm-dd or other ways)Beware of people that may offer you help in private, some may be scammers.Good luck.He could just brute-force the password with a simple few lines of script. I mean there are only so many days since Bitcoin has come into existence. If you try out them all eventually you will get it. I do not think that will even take him all night. Unless he does not know how to automate the process in which case he can still spend a couple of days trying out every date.I mean its been 5548 days so thats what, a bit over 15 and a half hours? 2 days full-time and done. Boom, $174k. Or like 2 minutes if you automate the task...Hopefully its not his fathers cryptic way of remembering an arbitrary date which has nothing to do with Bitcoin. Although, even if that would take you longer, it would still be perfectly do-able.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PawGo",
      "created_time": "January 11, 2023, 07:43:19 AM",
      "body": "If you have minimal IT skills, try to use hashcat with a given masks https://hashcat.net/wiki/doku.php?id=mask_attack or btcrecover https://btcrecover.readthedocs.io/en/latest/tokenlist_file/If it is date only (no time) it should be quite easy task, even if you do not know the order of date segments or separators used (if there are any).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "January 11, 2023, 11:29:52 AM",
      "body": "Yeah, just use btcrecover and set up an appropriate tokens file. Even with a fairly modest GPU, you should be able to brute force 1,000 passwords a second or more for a Core wallet file.First see if you have any other old documents from your father in which he wrote the date - letters, spreadsheets, emails, etc. - and see what format he used. If he used that format for the password, then btcrecover could try every date in the last 100 years in about 30 seconds. Failing that, then you would need to try every other possible date format. This includes two or four digit years, digits or written words for the month, including short and full names (Jan/January), as well as every possible ordering, and every possible separator (/ - . etc.) But even then, you should be able to cycle through all that for every date in the last 100 years in a couple of hours.If there is something else in the password, such as a time, or a location, or a name, then things become exponentially more complicated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vampobit",
      "created_time": "January 11, 2023, 12:19:01 PM",
      "body": "Quote from: o_e_l_e_o on January 11, 2023, 11:29:52 AMYeah, just use btcrecover and set up an appropriate tokens file. Even with a fairly modest GPU, you should be able to brute force 1,000 passwords a second or more for a Core wallet file.First see if you have any other old documents from your father in which he wrote the date - letters, spreadsheets, emails, etc. - and see what format he used. If he used that format for the password, then btcrecover could try every date in the last 100 years in about 30 seconds. Failing that, then you would need to try every other possible date format. This includes two or four digit years, digits or written words for the month, including short and full names (Jan/January), as well as every possible ordering, and every possible separator (/ - . etc.) But even then, you should be able to cycle through all that for every date in the last 100 years in a couple of hours.If there is something else in the password, such as a time, or a location, or a name, then things become exponentially more complicated.Hello, I have a question only out of curiosity. Let's say someone could brute force. How would they go about trying the passwords ? I mean, I could for instance generate all possible dates using brute force and store them in a file. But how would I try them all ?That's a general question that I have since I was a CS student (apparently not a great student though haha).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "January 11, 2023, 12:30:28 PM",
      "body": "Quote from: Vampobit on January 11, 2023, 12:19:01 PMHello, I have a question only out of curiosity. Let's say someone could brute force. How would they go about trying the passwords ? I mean, I could for instance generate all possible dates using brute force and store them in a file. But how would I try them all ?There are plenty of pieces of software out there which will do this. btcrecover as mentioned above is one such piece of software. You can either give it a text file listing all the passwords you want to try, or you can create what is called a tokens file which is essentially a list of instructions on how to generate passwords. In this case you would create a tokens file telling it to try something like every combination of YYYY-MM-DD within a given range, and it would generate the passwords on the fly as it tried them all. You direct the software to a copy of your the wallet file you are trying to decrypt, and it will simply cycle through all the passwords you provide and try them as quickly as your hardware will allow.The same software can also be used to do things like brute force missing characters from private keys or missing words from seed phrases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "January 16, 2023, 11:51:05 PM",
      "body": "For now OP still didn't find \"the date\"  Bitcoins are still here.I wish you good luck OP ! Will follow this thread, curious to see how long time you will need to find the password ; it should be easy with btcrecover",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Edwardard",
      "created_time": "January 17, 2023, 01:28:26 AM",
      "body": "Quote from: iwantmyhomepaidwithbtc2 on January 16, 2023, 11:51:05 PMFor now OP still didn't find \"the date\"  Bitcoins are still here.Not that easy, he doesnt know in which format the date has been written as password. It'll technically take a lot of time while he tries to discover the format. Chances decrease if there are certian non-guessable special characters between the date.Quote from: iwantmyhomepaidwithbtc2 on January 16, 2023, 11:51:05 PMI wish you good luck OP ! Will follow this thread, No use, he is already inactive to provide a followup, just like the rest of the newbies. (making one post and going away).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pffffffff",
      "created_time": "January 17, 2023, 06:44:35 PM",
      "body": "Thanks guys! No luck so farAt some point it becomes far too obsessive and you want to try too many crazy ideas, so I'm just trying to slow down a little and not get too excited to keep my sanity, haha",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vampobit",
      "created_time": "January 17, 2023, 07:25:05 PM",
      "body": "Quote from: pffffffff on January 17, 2023, 06:44:35 PMThanks guys! No luck so farAt some point it becomes far too obsessive and you want to try too many crazy ideas, so I'm just trying to slow down a little and not get too excited to keep my sanity, hahaHello! Let tell you my insane ideas, just in case  1. your birth date2. the phrase \"THE DATE\"I wouldn't try to find a bitcoin specific date, but I would rather start searching for an important date for you or your father.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "January 18, 2023, 04:52:21 PM",
      "body": "Quote from: pffffffff on January 10, 2023, 06:30:38 PMSo this was my father's bitcointalk account. There's also wallet.dat and a text file:bitcoin.orgbitcointalk.orgThe password is THE DATE13zEUPdpCDT3JGqv4o61vXQpgWWdxMEZeXThe coins are still there. I guess I can try some datesDid you maybe try the date your father registered on this forum? Given that the text file contains the name of this forum, it may be about that date.QuoteDate Registered: 23 August 2015, 12:45:31",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serveria.com",
      "created_time": "January 20, 2023, 11:15:51 PM",
      "body": "Quote from: pffffffff on January 10, 2023, 06:30:38 PMSo this was my father's bitcointalk account. There's also wallet.dat and a text file:bitcoin.orgbitcointalk.orgThe password is THE DATE13zEUPdpCDT3JGqv4o61vXQpgWWdxMEZeXThe coins are still there. I guess I can try some datesI've never used the old Bitcoin client. What do I do?I don't see any reason in trying to guess the date. Just run the brute-forcing software/script an configure it to use numbers only. As there are only 10 numbers: 0,1,2,3,4,5,6,7,8 and 9 such passwords are considered unsafe and can be brute-forced easily.P.S. What happened to your father? Is he alive?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alicatraz",
      "created_time": "January 21, 2023, 01:28:20 AM",
      "body": "if i were u i would not even post the address here , BTC recover or Hashcat can easily guess the password if it is just numbers and if the length of the password is known , whatever you do , do not share the Wallet.dat file with anyone , best of luck",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "January 21, 2023, 12:01:10 PM",
      "body": "Quote from: Alicatraz on January 21, 2023, 01:28:20 AMif i were u i would not even post the address here , BTC recover or Hashcat can easily guess the password if it is just numbers and if the length of the password is known , whatever you do , do not share the Wallet.dat file with anyone , best of luck I agree with the idea but we never know.For example, if a write \"01/01/2009\" in my native language and using only letters it would be :\"Premier janvier deux mille neuf\"So even a date could be hardcore to find",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "January 21, 2023, 01:50:27 PM",
      "body": "Quote from: iwantmyhomepaidwithbtc2 on January 21, 2023, 12:01:10 PMSo even a date could be hardcore to findAs I said above, with reasonable hardware and a correctly configured tokens file, btcrecover will be able to try every date from the last 100 years in one specific format in around 30 seconds. So even if you come up with multiple different ways to write out the date, this is trivial to brute force, provided it is just a date and nothing else.Let's say you have \"two thousand nine\" and \"two thousand and nine\" for the year. 2 possibilities. For the day/month, you could have \"January first\", \"January the first\", \"First January\", or \"First of January\". 4 possibilities. You could put the year first, or the day/month first. 2 possibilities. 2*4*2 = 16, meaning you can try every date in the last 100 years with every combination of those possibilities in 8 minutes.Even if you come up with 500 different possible formats to write the date, you can brute force them all in a few hours.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bnbstorm",
      "created_time": "January 21, 2023, 09:30:11 PM",
      "body": "I would just like to add here that do not share your dat file with anyone. There will many people try to connect you and help you guess password but they are all scams. Do no trust anyone. Learn stuff yourself and try to brute-force. Try other data of your father and study his pattern. You got plenty of time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "January 25, 2023, 07:30:15 PM",
      "body": "I think this is another reason why we all must learn to carry our family along in our bitcoin activities, I searched the wallet address shared in the OP and 10 bitcoin sitting there since 6 years ago, I want to believe that the father to the OP have passed away probably without the family knowing that he such amount of money in bitcoin, as well as in bitcoin cash, now his son(in the person of OP) is left with no choice but to find a way to get into wallet, otherwise, those bitcoins(and what's ever its worth be now and in the future) will remain there forever.@OP, this might be a lame suggestion but from the explorer, i saw that the 10 bitcoins currently in the wallet was received on the 5th of May, 2016, if you haven't already, maybe you can try that and see if it works..Goodluck all the same.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bnbstorm",
      "created_time": "January 25, 2023, 07:42:47 PM",
      "body": "Quote from: Fivestar4everMVP on January 25, 2023, 07:30:15 PMI think this is another reason why we all must learn to carry our family along in our bitcoin activities, I searched the wallet address shared in the OP and 10 bitcoin sitting there since 6 years ago, I want to believe that the father to the OP have passed away probably without the family knowing that he such amount of money in bitcoin, as well as in bitcoin cash, now his son(in the person of OP) is left with no choice but to find a way to get into wallet, otherwise, those bitcoins(and what's ever its worth be now and in the future) will remain there forever.@OP, this might be a lame suggestion but from the explorer, i saw that the 10 bitcoins currently in the wallet was received on the 5th of May, 2016, if you haven't already, maybe you can try that and see if it works..Goodluck all the same.This is good suggestion but wallet was created before receiving coins so most probably date will be different from this one.I want to add there is no guarantee that date is from past. It can also be a future date. So OP should try some future years as well. Maybe your father thought to gave you or your siblings wallet on any of your specific birthday etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}