{
  "id": "topic_5463695",
  "title": "Silence Scream",
  "author": "Silence Scream",
  "created_time": "August 18, 2023, 12:49:40 PM",
  "content": "Aynen ekonomi süper cart curt. Devamına gerek bile yok. Buyurun 100 liranın seneler içerisindeki eriyişine.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463695",
  "comments": [
    {
      "author": "totti67",
      "created_time": "August 18, 2023, 01:25:39 PM",
      "body": "Yaklaşık yedi buçuk yılda nereden nereye gelmiş Euro, ya da daha doğru tabirle bizim paramız ne kadar ayağa düşmüş. ve dahası bu tablo bir yerden sonra tekrar terse doğru duzelebilir umudu cogumuzda yok, yılbaşında 100 TL karşısında 2 kusur bir rakam girmemiz işten bile değil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "August 18, 2023, 01:36:36 PM",
      "body": "Gökten daş yağacak daş, tayyap olmasaydı ülke satıldıydı ne olmuş 100 tl 3 eyro alayorsa tayyap olmasaydı din elden giderdi onlar seccadeye basıyor. Olsun istersen 0.1 eyro alsın tayyap'tan vazgeçmeyiz. Eroylamı maaş alıyorsunuz ha alçaklar vatanı bölemeyecekler. Ezanlar susmayacak Nas var nas. Siz nas'ı ne sanıyorsunuz ha. Ne olmuş Türkiye toprak kaybettiyse? Ne olmuş adalar peşkeş çekildiyse. GÖKLERDEN GELEN BİR KARAR VARDIR.  HZ. MUHAMMET SON PEYGAMLER OLMAYAYDI SON PEYGAMBER TAYYAP OLURDU.Nolmuş yani tayyap'ı kaybetmeyiz.Trollerin uğramadığı konudan birisi de ekonomidir. Nasıl olsa tayyap babişkoları ceplerine harçlığını koyuyor. Bu kafayla gittiğimiz taktirde daha çok değer kaybedecektir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "August 18, 2023, 03:56:41 PM",
      "body": "Süreç böyle olduğu sürece hiç bir şey eskisi gibi olacağını sanmıyorum bu konuda hiç ümidim yok açıkçası. Ekonomiyi çocuk oyuncağı haline getirip resmen batırdılar ne söyledilerse hep tam tersi oldu. Geç kalınmış faiz artışıda yeterli olmadı zamanında indireceğizde indireceğiz diyerek eksi rezervi arttırdılar üstünede başarı gibi lanse ettirdikleri KKM de cabası.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zonefloor",
      "created_time": "August 18, 2023, 04:41:52 PM",
      "body": "Aslında bizde millet olarak farkına varmamışız. Paramız her yıl değer kaybetmiş fakat bariz değer kaybı olmadığı için görmezden gelmişiz. Aslında ekonomi ben göçüyorum diye yıllarca bağırmış. Şimdi bu saatten sonra bende pek düzeleceğini sanmıyorum ve arkadaşın dediği gibi hiçbitşey eskisi gibi olmayacak. Sürekli maaşlara zam geliyor ve piyasa artış gösteriyor. Bu şekilde fiyatlar nasıl düşecekse",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "August 18, 2023, 05:50:47 PM",
      "body": "Biz farkına vardık da ne oldu her geçen gün daha da dibe batırdılar. 10 senede koskoca imparatorluğu çökertmek gibi bir şey yaşandı, dolar 1 lirayken ilkokula gidenler üniversiteyi bitirince 30 lira ile karşılaştılar. Bu yüzyılda 2-3 ülkede görülebilecek ender bir olay, tabi ki bunu da kaptırmadık. Ama yıkılmadık hala ayaktayız belki bir gün toparlarız",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "August 18, 2023, 06:04:18 PM",
      "body": "Hadi gelsin forumun trolü buna cevap versin, gene konuyu cehapa bağlasın. Alakasız alakasız gelir yok belediyede otobüs işinde şu yapıldı, park bahçe müdürlüğünde şu oldu diye. Sadece şu yukarıdaki görselden tüm halkın hakkını araması gerekirdi ama adamlara hala %30-40 oy çıkıyor, akıl alır gibi değil. Ve bunun bir açıklamasını da yapamıyorlar, söyleyebilecekleri tek mantıklı şey yok. Bu tablonun sadece atıyorum İstanbul depremi ya da büyük savaş gibi şeyler sonucu ortaya çıkmış olması gerekirdi. Ama bizde olmasının nedenini hepimiz çok iyi biliyoruz. Bugün ben de 1000 tl'lik dolar sattım ve 37 sayısını görünce kahroldum. Bu milletin azıcık akıllı olan kısmı gerçekten bu kötülüğü hak etmedi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "August 18, 2023, 06:12:00 PM",
      "body": "Quote from: zonefloor on August 18, 2023, 04:41:52 PMAslında bizde millet olarak farkına varmamışız. Paramız her yıl değer kaybetmiş fakat bariz değer kaybı olmadığı için görmezden gelmişiz. Aslında ekonomi ben göçüyorum diye yıllarca bağırmış. Şimdi bu saatten sonra bende pek düzeleceğini sanmıyorum ve arkadaşın dediği gibi hiçbitşey eskisi gibi olmayacak. Sürekli maaşlara zam geliyor ve piyasa artış gösteriyor. Bu şekilde fiyatlar nasıl düşecekseDünyada paranın bol olduğu dönemde ayrıca özelleştirme denen satıp savurma ile memleketi olduğundan daha zengin gösterdiler, ancak 2010 larin ortalarından itibaren üretmeyi bırakıp hazirdan yemekten başka birşey yapmayan sistem, orta direği ufak ufak fakir sınıfına dahil etmeye başladı, insanlar fakirlestiklerini anlayamadılar, anlayanlar da sebebi başka başka yerlerde aradılar, tabi bu rada sadece gecinebilme, ay sonunu getirebilme telaşından ne doları gördü gözleri ne euroyu ne altını, bu saatten sonra görseler de birşey değişmez orası da ayrı konu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "August 18, 2023, 06:18:00 PM",
      "body": "Quote from: püsür on August 18, 2023, 06:04:18 PMHadi gelsin forumun trolü buna cevap versin, gene konuyu cehapa bağlasın. Alakasız alakasız gelir yok belediyede otobüs işinde şu yapıldı, park bahçe müdürlüğünde şu oldu diye. Sadece şu yukarıdaki görselden tüm halkın hakkını araması gerekirdi ama adamlara hala %30-40 oy çıkıyor, akıl alır gibi değil. Ve bunun bir açıklamasını da yapamıyorlar, söyleyebilecekleri tek mantıklı şey yok. Bu tablonun sadece atıyorum İstanbul depremi ya da büyük savaş gibi şeyler sonucu ortaya çıkmış olması gerekirdi. Ama bizde olmasının nedenini hepimiz çok iyi biliyoruz. Bugün ben de 1000 tl'lik dolar sattım ve 37 sayısını görünce kahroldum. Bu milletin azıcık akıllı olan kısmı gerçekten bu kötülüğü hak etmedi.Bu memleketin aydınlanması, insanlarin kendilerini geliştirmeleri o güruh için çok tehlikeliydi, hatta kendileri de açıkladılar eğitim seviyesi arttıkça oylarimiz düşüyor diye, sonrasında insanları sadece ay sonunu getirebilir duruma soktular, basit ifadeyle, yaşama dürtüsü olayları sorgulama analiz etme ve ders çıkarma yetilerini koreltti, e zaten bence yüzde 15 lik herhangi bir fikri olmadan sadece kişiye oy veren kitleyi de ekleyince sonuç bu. Troller ise her devirde olan, ama en çok bu dönemde revaçta olanlar, herhangi bir yeteneğinin olmasına gerek yok, basit şekilde itaat et savun parsayi kap adamlarin düsturu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "August 18, 2023, 07:58:36 PM",
      "body": "100 liranın karşılığı üç küsür euro olmamalıydı. Avrupa'da, Almanyada insanlar yerde bulduğu 2-3 teneke kutuyu dönüştürücü makinesine atarak o parayı kazanabiliyorlar arada ki dağlar yani uçtukça uçuyoruz bu mesafe daha da artacak düzeleceği yok mevcut durumlara göre yaşamayı öğreniyoruz mecbur kaldığımız için Türkiye şartları 7.5 senede ne kadar zorlaştı işte paradan yola çıkarak görebiliyoruz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "August 18, 2023, 08:04:05 PM",
      "body": "Böyle bakınca durum gerçekten trajikomik oluyor son 5 yılda resmen paraya bir 0 ekledik tarihin en kötü ekonomik dönemlerinden birini yaşıyoruz ve buna rağmen herkesin keyfi yerinde gibi bir ortam var. Algıyı hala iyi yönetebiliyorlar ee zamanında medyayı boşuna ele geçirmediler. Hırsızların katillerin salıverildiği ama işini yapan gazetecilerin içeride olduğu bir ülkede Euro daha çooook değerlenir. Uzun uzun bunu tartışmanın anlamı bile yok şu cümle ülkenin özeti.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "August 18, 2023, 10:43:41 PM",
      "body": "Muhtemelen bir kaç sene içerisinde çocuklarımıza 100 lirayı sakız almaları için vereceğiz. 2015 yılında w176 aracımı 80.000 TL karşılığında almıştım. Şu an aynı aracı aynı şekilde sıfır olarak almak istesem 2 milyon TL ödemem gerekiyor. Para için 8 senede 25 kat değer kaybı ki bu bahsettiğim düşük motor olduğu için en fazla fiyatı artan araçlar arasında değil. Yada bugün 8 sene kullanmış olduğum aracı satsam 1 milyon TL yani 8 sene eskiterek 12,5 kat fiyatla satabilir hale gelmiş oluyorum. Bu süreçte dolaşımdaki para miktarı 12 katına çıkmış. 92 senede basılan paranın 11 katı kadar para basılmış 8 senede. 8 sene önce 1 senede aldığınız maaşı hiç ellemeseniz bugün kenara koyduğunuz o para 1 ay çalışarak ortaya koymuşsunuza dönüşmüş. Geri kalan 11 aylık emekleriniz sizden bizzat çılgınca para basmaya devam edenler tarafından çalınmış. Ve en önemlisi bu ülkede en büyük yük her zaman olduğu gibi vergisini ödeyen dürüst vatandaşın sırtına yüklenmeye devam ediyor. Birileri vergi kaçırmaya hatta her işlerini vergisiz bir şekilde halletmeye devam ediyor. Finalde ise vergi kaçakçılarına ceza verilmesi gerekirken fazileri silinmiş şekilde borçlarını ödemeleri için sürekli ödül niteliğinde aflar çıkarılıyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zonefloor",
      "created_time": "August 19, 2023, 04:32:26 PM",
      "body": "Quote from: xzone on August 18, 2023, 05:50:47 PMBiz farkına vardık da ne oldu her geçen gün daha da dibe batırdılar. 10 senede koskoca imparatorluğu çökertmek gibi bir şey yaşandı, dolar 1 lirayken ilkokula gidenler üniversiteyi bitirince 30 lira ile karşılaştılar. Bu yüzyılda 2-3 ülkede görülebilecek ender bir olay, tabi ki bunu da kaptırmadık. Ama yıkılmadık hala ayaktayız belki bir gün toparlarız Komik olan tarafıda burası gerçekten. Nerden nereye geldik. Daha düne kadar alım Gücümüz ciddi anlamda varken şuanda sizinde dediğiniz gibi 100 lirayı geçtim 200 lirayı bozdurmaya korkar bir duruma geldik. Çünkü anında bitiyor ve yakında bir yemek yiyemeyecek duruma geleceğiz. İşin en trajik tarafı ise dün dalga ve alay konusu yaptığımız ülkeler bizi daha fazla alaya almaya başladı",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "August 19, 2023, 05:03:42 PM",
      "body": "Artık İran’ın Tümen sistemine benzer bir para birimi değişikliğine gideceğiz herhalde. Baksanıza 7 yılda paramın değeri 10 kat azalmış. 7 sene önce çocuğuma 100 lira verirken çocuğumun o parayı değerlendirme biçimini bile takip etmek zorunda kalıyordum o kadar büyük parayı sağa sola vermesin diye. Şimdi döner 100 lira olmuş. Hala da bir şekilde buna ses etmemeye devam ediyorlar en büyük şaşkınlığım da bu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "W Jr.",
      "created_time": "August 19, 2023, 06:32:50 PM",
      "body": "8 ayda neredeyse yarı yarıya bir düşüş görülmüş.Korkarım ki az bir süre sonra Euro 50 lira diye başlıklar açılacak ve o zaman da bu güncelleme değişecek ve 100 lira 2 Euro yazacağız.Ekonomik sorunlarla boğuşan ülkede kolay mı böyle şeyleri yapıp enflasyonu düşürmek.Tek çare vergi arttırmak gibi görülüyor halbuki köklü bir maddi değişiklik yasaları lazım.Bir kere milyarlarca vergileri silmeyeceksin kardeşim.Sileceksen garibanın KYK borcunu sil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "August 19, 2023, 06:49:23 PM",
      "body": "Sene 2016 maaş bordroma bakayım dedim ama e devlet sağolsun şaşırtmadı ve hata verdi bakamıyorum internete bakayım 2016 Temmuz zammı ile maaş 3522 imiş zamlı hali dolar kuru 2.89 imiş 1218 dolar maaş alıyormuşuz Bugün son bordrom 31300 lira evli bir çocuk ve eşi çalışmayan birisi olarak ek olarak aldığım 1500 lirayı düşersem o dönemde aldığım gibi hesaplarsam 29800 lira maaşım var bunu dolar kuruna bölersek 27.10 1099 dolar maaş yapıyor Ayrıca bunun seçimden sonra verilen 8000 lira seyyanen zamlı maaş olduğunu da söylemek istiyorum onu düşersek 786 dolar maaş alacakmışız Yani 2016 yılından bu yana dolar bazında maaşımız 432 dolar azalmış aradaki farkı kapatmak için seyyanen zam yaptıkları halde aradaki fark kapanmamış hayat pahalılığı derseniz kaç kat artmış siz düşünün ben bugün maaşımın 1/3’ünü kiraya veriyorum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mustang Shelby",
      "created_time": "August 19, 2023, 07:24:01 PM",
      "body": "Quote from: RaltcoinsB on August 19, 2023, 06:49:23 PMSene 2016 maaş bordroma bakayım dedim ama e devlet sağolsun şaşırtmadı ve hata verdi bakamıyorum internete bakayım 2016 Temmuz zammı ile maaş 3522 imiş zamlı hali dolar kuru 2.89 imiş 1218 dolar maaş alıyormuşuz Bugün son bordrom 31300 lira evli bir çocuk ve eşi çalışmayan birisi olarak ek olarak aldığım 1500 lirayı düşersem o dönemde aldığım gibi hesaplarsam 29800 lira maaşım var bunu dolar kuruna bölersek 27.10 1099 dolar maaş yapıyor Ayrıca bunun seçimden sonra verilen 8000 lira seyyanen zamlı maaş olduğunu da söylemek istiyorum onu düşersek 786 dolar maaş alacakmışız Yani 2016 yılından bu yana dolar bazında maaşımız 432 dolar azalmış aradaki farkı kapatmak için seyyanen zam yaptıkları halde aradaki fark kapanmamış hayat pahalılığı derseniz kaç kat artmış siz düşünün ben bugün maaşımın 1/3’ünü kiraya veriyorum Bu ülkede maaşı erimeyen bir Allah’ın kulu yok hocam bu yüzden yazdıklarınızı garip karşılamıyorum. Ülkede en büyük sorun zaten insanların sabit bir gelir/gider tablosu olmaması. Yani her sene bir miktar para ile aynı maaşı alıp aynı kirayı öderseniz sorun ortadan kalkacak ama enflasyon denilen canavarla maaş sürekli eriyor. Günden güne eriyen maaş insanları mahvediyor. Emekli ne yapsın 7500 lira ile, 276 dolar yapıyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hvdv",
      "created_time": "August 19, 2023, 08:08:41 PM",
      "body": "Eleştirel yaklaşmak lazım. Nerede hata yapıldığını objektif olarak söylemek lazım. Baştaki ekonomi modellerinde saçma yöntemler, üstüne her hafta değişen merkez bankası başkanları ve yabancıların piyasadan çıkışını düşününce, yaklaşan seçimler yüzünden sürekli satılan dolarlar ile yedekte kalmayan akçeler, basılan sonsuz paralar yüzünden buralara geldik. Görülen tablo ise ortada. Anlatmaya gerek yok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "August 20, 2023, 06:37:17 AM",
      "body": "Quote from: RaltcoinsB on August 19, 2023, 06:49:23 PMSene 2016 maaş bordroma bakayım dedim ama e devlet sağolsun şaşırtmadı ve hata verdi bakamıyorum internete bakayım 2016 Temmuz zammı ile maaş 3522 imiş zamlı hali dolar kuru 2.89 imiş 1218 dolar maaş alıyormuşuz Bugün son bordrom 31300 lira evli bir çocuk ve eşi çalışmayan birisi olarak ek olarak aldığım 1500 lirayı düşersem o dönemde aldığım gibi hesaplarsam 29800 lira maaşım var bunu dolar kuruna bölersek 27.10 1099 dolar maaş yapıyor Ayrıca bunun seçimden sonra verilen 8000 lira seyyanen zamlı maaş olduğunu da söylemek istiyorum onu düşersek 786 dolar maaş alacakmışız Yani 2016 yılından bu yana dolar bazında maaşımız 432 dolar azalmış aradaki farkı kapatmak için seyyanen zam yaptıkları halde aradaki fark kapanmamış hayat pahalılığı derseniz kaç kat artmış siz düşünün ben bugün maaşımın 1/3’ünü kiraya veriyorum Hocam güzel ozetlemissiniz, küçük ama önemli bir detay hariç, maalesef o seyyanen denen illet emekli kesenegine tesir etmediginden, aslında orada da dolaylı da olsa bence yıllara vurunca epey zarar yazıyor. Ayrıca 2016 da kiranizin maaşınızı oranı bugüne kıyasla daha makuldur, bu örnekleri tüm harcama kalemlerinde görebilirsiniz. Yani ez cümle rakamlar maalesef tek yönlü büyümüyor epeydir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "August 30, 2023, 01:06:23 PM",
      "body": "31,15 Euro'dan 3,38 euroya yani paramız nerede ise 10 kat değer kaybetmiş. Bu alım gücümüzün, hayat standartlarımızın 10 kat düşmesi demek. 4 Ocak 2016'da euro ortalama 3,2 TL imiş. O günün asgari ücretlisi 1650 TL civarı bir para alıyormuş. 520 Euro civarı bir para. Şu an 15.000 TL civarı para yapıyor 520 euro. Asgari ücretli şu an 393 euro alıyor. 130 euroya yakın bir alım gücü kaybı var sadece kur üzerinden. Bunun üstüne enflasyon kaybını da eklersek ne kadar büyük bir ölçüde alım gücü kaybı yaşadığımızı anlayabiliriz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}