{
  "id": "topic_5402078",
  "title": "merticinak",
  "author": "merticinak",
  "created_time": "June 10, 2022, 12:03:27 PM",
  "content": "Türkiye’de ve Dünyada Haftanın Trend Coinleri!Her hafta CoinGecko tarafından hazırlanan haftanın trend coinleri listesiyle birlikte hem Türkiye’de hem de dünyada o hafta hangi kripto para birimlerinin öne çıktığını görmüş oluyoruz. Bu listeler piyasadaki yatırımcıların ilgisini takip etmek açısından önemli. Şimdi gelin, hep birlikte 4 – 10 Haziran tarihleri arasında hangi kripto para birimlerinin öne çıktığına yakından bakalımTürkiye’de Haftanın Trend Coinleri!Türkiye’de trend olan coinler listesinin en başında, çöküşün izlerini devam ettiren Terra Luna Classic (LUNC) var. Haberin yazımı sırasında 0.000076 dolardan işlem gören LUNC, 802.660.063 dolarlık piyasa değerine sahip. Listenin ikinci ismi ise Baby Doge Coin (BABYDOGE) var. Piyasa değerine göre 168’inci sırada olan BABYDOGE, 5 ay önce ATH yapmıştı. Şimdilerde 0.000000001464 dolarlık işlem fiyatıyla ATH’sinden yüzde 77 oranında geride. Meme kripto para birimi ayrıca son 24 saat içinde de yüzde 7.5 oranında değer kaybetti. Green Satoshi Token ise her hafta olduğu gibi bu hafta da listede. 1.07 dolardan işlem gören kripto para birimi, son 24 saatte yüzde 7.6, son 7 günde yüzde 38.6, son 30 günde ise yüzde 93.2 oranında değer kaybetti. Listenin son iki sırasında ise Ethereum (ETH) ve Shiba Inu (SHIB) var. ETH’de şu sıralarda bir değer kaybı söz konusu. Son 7 günde yüzde 2.3 oranında düşüş yaşayan en değerli ikinci kripto para birimi, son 30 günde ise yüzde 23.7 oranında değer kaybetti. Diğer yandan en popüler meme kripto para birimlerinden biri olan SHIB’de de değer kaybı söz konusu. Son 30 günde SHIB’in yüzde 34.9 oranında değer kaybettiğini görüyoruz.Dünyada Haftanın Trend Coinleri!Dünyada ise Türkiye ile karşılaştırdığımızda sadece bir ortak kripto para birimi var o da Terra Luna Classic (LUNC). LUNC, listenin dördüncü sırasında konumlanıyor.Listede ilk sırada ise Optimism (OP) var. Haberin yazımı itibariyle OP, 0.86 dolardan işlem görüyor. Piyasa değeri 186.277.502 dolar olan OP, aslında piyasanın yenilerinden. 1 Haziran günü 2.10 dolarla ATH yapan OP, 8 Haziran’da ise ATL yaparak 0.72 dolara kadar geriledi. Şimdilerde ise ATL seviyesine daha yakın olduğunu söyleyebiliriz. Piyasa değeri açısından 124’üncü sırada konumlanan Everdome (DOME) da listenin ikinci sırasında. 0.016 dolardan işlem gören DOME, bir süredir düşüşte olan kripto para birimlerinden biri. Son 7 günde yüzde 28.5 değer kaybeden DOME’da son 30 gündeki kayıp yüzde 45.9 oranında. Üçüncü sırada ise EVMOS var. 340.307.532 dolarlık piyasa değerine sahip EVMOS, 1.68 dolarlık fiyatıyla işlem görüyor. Son 24 saatte yüzde 6’dan fazla değerlenen kripto para biriminde aylık bazda kayıp ise yüzde 41’den fazla. Dördüncü sırada başta da söylediğimiz gibi LUNC var. Listenin sonunda ise bir stablecoin olan SpiceUSD (USDs) var. 15.155.870 dolarlık piyasa değerine sahip USDS, ABD dolarına sabit bir stablecoin.Kaynak:BTCHaber",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402078",
  "comments": []
}