{
  "id": "topic_5496933",
  "title": "Bit_Happy",
  "author": "Bit_Happy",
  "created_time": "May 18, 2024, 05:48:04 PM",
  "content": "(BTC Reputation Upgrades) Can This Be Done With Bitcoin Without Using Any Altcoins?Hello, The following \"flow of ideas\" *can* be done with Smart Contracts and Altcoins.  Please Note: I am not proposing or promoting a specific project in this discussion. The outline of details is just an example, seeking the answer: \"Can This Currently Be Done With Bitcoin Without Using Any Altcoins?\"* Starting Point = Bitcoin and the community has earned a horrible mainstream reputation with an endless flow of scandals, alleged hacks, and other major thefts. * Many early Bitcoin users were idealists who wanted to actually help \"the masses\" have sound money.* What if (for example) people could safely pool money (BTC) in a way that massively helps improve our reputation?* Do you think (at least some) some of the super-rich, old-time idealists (and many other people) would be interested?Here is a quick example of something very positive which can be done with smart contracts and altcoins - and possibly (?) using only BTC:Bitcoin For \"The Masses\" Super Bowl 2025 ads!* Super Bowl ads are relatively expensive, and can be worth the money by creating a Huge Positive Buzz.* The ad(s) can educate people about the original goals of BTC idealists and how great the future can be!* The smart contracts used would specify funding targets, and other vital details.* The first 100 (or 500 - for example) donations all earn the right to be (optionally) participating in a trustee group (DAO = cannot be done with BTC / possibly vote in the forum?)* The Trustee group and/or exact details in the smart contracts, specify a clear path to securely releasing/converting the funds and buying the ads.Questions:The above optimistic, exciting outline can currently be done with smart contracts and altcoins. Can it be done using only BTC?The BTC ecosystem/reputation obviously needs repairs, do you have an opinion on how/what to do ASAP?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5496933",
  "comments": [
    {
      "author": "decodx",
      "created_time": "May 18, 2024, 07:19:51 PM",
      "body": "Quote from: Bit_Happy on May 18, 2024, 05:48:04 PMThe BTC ecosystem/reputation obviously needs repairs, do you have an opinion on how/what to do ASAP?  I don't really agree with what you're saying here.  I'm not convinced Bitcoins reputation actually needs any \"repairs\" or anything - I mean, on what grounds are you saying that's obvious it does? Seems to me its reputation as a secure way to store value is still pretty solid.  Sure, there's stuff like scalability that's tricky to figure out.  But the basic ideas behind it are still good. Going on about repairing its reputation doesn't seem that productive really. Scams are still way more common with fiat money than with Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "May 18, 2024, 07:44:08 PM",
      "body": "Quote from: Bit_Happy on May 18, 2024, 05:48:04 PM* Starting Point = Bitcoin and the community has earned a horrible mainstream reputation with an endless flow of scandals, alleged hacks, and other major thefts. This is what those who control the media want you to believe, BTC is a currency and people lose BTC, just as they can lose their fiat currencies in any 'scandal' or theft, but once people lose their BTC, the media wants you to believe that the problem is in BTC itself and not the fault of the victims or the platforms they used.Quote from: Bit_Happy on May 18, 2024, 05:48:04 PMThe BTC ecosystem/reputation obviously needs repairs, do you have an opinion on how/what to do ASAP?  You don't need any ads to 'educate' people on what BTC is, there are enough articles online for that and this forum too. There is also nothing wrong with the BTC ecosystem, and you have not proposed anything here to improve the BTC network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "May 18, 2024, 09:22:11 PM",
      "body": "Quote from: Bit_Happy on May 18, 2024, 05:48:04 PM* Starting Point = Bitcoin and the community has earned a horrible mainstream reputation with an endless flow of scandals, alleged hacks, and other major thefts. I agree that when bitcoin was first launched up to its next following years, it was shrouded by a lot of false assumptions from the general community and everyone believed that bitcoin is nothing but a scam but I don’t think that still applies until now.If they still genuinely believe that bitcoin is a scam, are they living under a rock or what? QuoteHere is a quick example of something very positive which can be done with smart contracts and altcoins - and possibly (?) using only BTC:Bitcoin For \"The Masses\" Super Bowl 2025 ads!* Super Bowl ads are relatively expensive, and can be worth the money by creating a Huge Positive Buzz.* The ad(s) can educate people about the original goals of BTC idealists and how great the future can be!* The smart contracts used would specify funding targets, and other vital details.* The first 100 (or 500 - for example) donations all earn the right to be (optionally) participating in a trustee group (DAO = cannot be done with BTC / possibly vote in the forum?)* The Trustee group and/or exact details in the smart contracts, specify a clear path to securely releasing/converting the funds and buying the ads.Sure, why not? Many crypto exchanges already do this and sponsor a lot of sporting teams so an advertisement of bitcoin wouldn’t be too out of place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "May 18, 2024, 09:30:56 PM",
      "body": "So you want to fundraise for a super bowl ad for bitcoin education, and use smart contracts as some way to entice people to fundraise for the ad.I'm sorry, but a super bowl ad does nothing to educate people. People already know about Bitcoin. Surface level 30 second ad to say how great Bitcoin is does nothing. People need a bit deeper learning. They need to learn what sound money is, why Bitcoin is the perfect embodiment of that, and why national currencies are the polar opposite. They need to learn all the other fundamentals about Bitcoin. They need to learn why Bitcoin mining is not some bad scary thing. They need to learn about price volatility and why volatility is not risky long term, and they need to learn about the four year market cycle. They need to learn why Bitcoin keeps expanding and growing despite everyone saying its a terrible thing that is gonna collapse. And they then need to think about these things, be able to ask questions and get good answers, and then think about those answers, and finally come to their own realization about why Bitcoin is so great.A super bowl ad does nothing for any of this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "May 18, 2024, 11:40:01 PM",
      "body": "Most of what you propose can be done with Bitcoin, it doesn't need a \"smart contract altcoin\" with a turing complete language.Quote from: Bit_Happy on May 18, 2024, 05:48:04 PM* The smart contracts used would specify funding targets, and other vital details.* The first 100 (or 500 - for example) donations all earn the right to be (optionally) participating in a trustee group (DAO = cannot be done with BTC / possibly vote in the forum?)There are several methods how you could implement that.One is to develop a token which tracks the donations. This can be done without problems using existing token platforms which can be \"extended\" to allow more complex rules (I have myself made an experimental implementation for something very similar to an \"investors community\" once). The users (in this case: the donors) however would have to run not only the token software (Counterparty, Runes, etc.) but also a plugin or extension for these rules to work.You could also use the RGB platform I think, which is the most \"modern\" token and smart contract platform for Bitcoin. There, you would set up the smart contract off-chain, but RGB could track the UTXOs of the donations.But in general the big problem is that in the end, someone has to buy the ads, probably with fiat because I don't think Super Bowl will accept a Bitcoin-based platform like Anonymous Ads  So in general this person could simply set up a Bitcoin address for people to donate these funds. The \"first 100 donors become trustees\" rule does, in my opinion, not really add trust. First, you risk that scammers rush to get these 100 donor slots. If the scammers become the majority, then they could steal the funds. And second, the problem would not be solved, the person buying the ads is still a single point of failure.You could design a complex system with periodic evaluations of the trustees, which would then have to regularly do \"marketing actions\" for Bitcoin with the donors' funds. This probably can be done with RGB too. But don't underestimate the complexity of such a system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peter0425",
      "created_time": "May 19, 2024, 02:28:43 AM",
      "body": "Quote from: thecodebear on May 18, 2024, 09:30:56 PMA super bowl ad does nothing for any of this.If you want people to be so knowledgeable about bitcoin, ads will not do anything you are right.However exposure can bring a lot of people interested in bitcoin which will lead them to researching about bitcoin and possibly investing on it as well. We would just have to hope that no matter what information they find is correct and accurate otherwise we’d just be spreading useless information.Ads are not the most effective in educating but can be used to gain more followers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CODE200",
      "created_time": "May 19, 2024, 02:59:29 AM",
      "body": "I can see the point of doing Superbowl Ads, a lot of Americans are tuning into it especially the halftime show but the real problem here would be the management that allows which can be shown in the halftime show, you also have to deal with the people that are outside of the show and those that are managing what shows up on television as they're a separate entity with the latter being the government, so even if the case was that we would be able to fund an ad for bitcoin that will be seen here, I doubt that the government will allow such ads to air, they might not like it and bitcoin is an anti-government tool anyway so the journey to this would be an eye of a needle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "May 19, 2024, 03:56:47 AM",
      "body": "If it's education that's truly the goal, I don't think paying for expensive ads is the most effective way to do it. Especially if there's a specific understanding of Bitcoin that you wish to spread, something grand and expensive like Super Bowl ads might not even be helpful. Flashing the Bitcoin logo, printing it on jerseys, and so on aren't even Bitcoin education. I don't know how it would make \"the masses\" get informed particularly on the \"original goals of BTC idealists\".I guess the money would be more optimized if it's used to sponsor Bitcoin seminars, pay for expert resource persons, and the like.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "May 19, 2024, 06:12:20 AM",
      "body": "Quote from: peter0425 on May 19, 2024, 02:28:43 AMAds are not the most effective in educating but can be used to gain more followers.Most of the people you'll be putting up that ad for have heard about BTC previously, but many of them are not interested in it and know nothing about the network and they do not care. That ad isn't going to do anything to change their mind about BTC, neither will it 'educate' them more than the little they already know about BTC. Like i have said, whoever is interested in BTC, knows where to get information about the network, and no bitcoiner needs to raise funds to put up ads for this purpose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "May 20, 2024, 05:58:51 AM",
      "body": "Quote* Starting Point = Bitcoin and the community has earned a horrible mainstream reputation with an endless flow of scandals, alleged hacks, and other major thefts.* Many early Bitcoin users were idealists who wanted to actually help \"the masses\" have sound money.* What if (for example) people could safely pool money (BTC) in a way that massively helps improve our reputation?* Do you think (at least some) some of the super-rich, old-time idealists (and many other people) would be interested?How did you come up with the conclusion, that Bitcoin has a horrible mainstream reputation? Did you conduct a survey/poll among the people or something? I think that Bitcoin has a somewhat neutral mainstream reputation. The people, who know a thing or two about BTC know the pros and cons, the advantages and disadvantages. Usually the people, who know nothing about Bitcoin call it a scam.Do you really think that Super Bowl Ads could improve Bitcoin's reputation? This sounds like a dumb idea to me.There are idealists and there are people, who simply want to make money. I think that the second group of people is way bigger than the first group.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "May 20, 2024, 11:13:17 PM",
      "body": "Quote from: peter0425 on May 19, 2024, 02:28:43 AMQuote from: thecodebear on May 18, 2024, 09:30:56 PMA super bowl ad does nothing for any of this.If you want people to be so knowledgeable about bitcoin, ads will not do anything you are right.However exposure can bring a lot of people interested in bitcoin which will lead them to researching about bitcoin and possibly investing on it as well. We would just have to hope that no matter what information they find is correct and accurate otherwise we’d just be spreading useless information.Ads are not the most effective in educating but can be used to gain more followers.Yeah but the thing is there have already been Bitcoin super bowl ads haha. This is nothing new. The whole ask of this thread by the OP is a very weird thing - fundraising and smart contracts and all that just to buy a super bowl ad lol",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bit_Happy",
      "created_time": "May 21, 2024, 04:04:57 PM",
      "body": "The reputation of the community and the ecosystem is very damaged. You have noticed that correct?Quote from: decodx on May 18, 2024, 07:19:51 PMQuote from: Bit_Happy on May 18, 2024, 05:48:04 PMThe BTC ecosystem/reputation obviously needs repairs, do you have an opinion on how/what to do ASAP?  I don't really agree with what you're saying here.  I'm not convinced Bitcoins reputation actually needs any \"repairs\" or anything - I mean, on what grounds are you saying that's obvious it does? Seems to me its reputation as a secure way to store value is still pretty solid.  Sure, there's stuff like scalability that's tricky to figure out.  But the basic ideas behind it are still good. Going on about repairing its reputation doesn't seem that productive really. Scams are still way more common with fiat money than with Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "May 21, 2024, 04:20:07 PM",
      "body": "Honestly, I agree with decodx that there is no reputation crisis with Bitcoin. I actually think that its reputation improves over the years, as more and more serious people and organizations get involved. Bitcoin used to be seen as weird money for drug dealers and other Darknet users. Now we have major investment funds buying Bitcoin, major global powers developing policies on Bitcoin, some countries and regions adopting Bitcoin is various ways.Where there are some misunderstandings, there can be clarifications. Bitcoin education wouldn't hurt, of course. But I don't think the issue is as big as the op portrays it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "May 21, 2024, 08:52:32 PM",
      "body": "Quote from: Bit_Happy on May 21, 2024, 04:04:57 PMThe reputation of the community and the ecosystem is very damaged. You have noticed that correct?Quote from: decodx on May 18, 2024, 07:19:51 PMQuote from: Bit_Happy on May 18, 2024, 05:48:04 PMThe BTC ecosystem/reputation obviously needs repairs, do you have an opinion on how/what to do ASAP?  I don't really agree with what you're saying here.  I'm not convinced Bitcoins reputation actually needs any \"repairs\" or anything - I mean, on what grounds are you saying that's obvious it does? Seems to me its reputation as a secure way to store value is still pretty solid.  Sure, there's stuff like scalability that's tricky to figure out.  But the basic ideas behind it are still good. Going on about repairing its reputation doesn't seem that productive really. Scams are still way more common with fiat money than with Bitcoin.On the contrary. I noticed how some bad actors give the whole thing a bad name.  But, the reputation of the Bitcoin ecosystem has always been under fire from folks who don't understand it or who benefit from the status quo.  This isn't anything new. But seriously damaged reputation? Nah, not in my experience. Especially with all the big institutional money flooding in lately, and even Bitcoin ETFs getting approved.  That's actually changing some minds around here even among the biggest haters I know.  So, I gotta ask, what kind of bad reputation are you even hearing about?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "May 22, 2024, 10:43:20 AM",
      "body": "Quote from: Bit_Happy on May 21, 2024, 04:04:57 PMThe reputation of the community and the ecosystem is very damaged. You have noticed that correct?I do not agree that anything or anyone is damaged when it comes to Bitcoin - especially in the sense of how it seems to you. Most of the people involved in BTC in any way are ordinary and honest people and they have nothing to do with those who are bad in any way. I especially don't see any sense that the reputation would be improved by the fact that a BTC related advertisement will be shown at a sporting event (no matter how popular it is) - especially when it comes to the US where Bitcoin is in the mainstream media every day, and that what people watch is mostly positive.If BTC's reputation was so bad, would the SEC approve spot ETFs - and would US investors invest billions of dollars in them?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wiss19",
      "created_time": "May 23, 2024, 04:30:22 PM",
      "body": "Quote from: Z-tight on May 19, 2024, 06:12:20 AMQuote from: peter0425 on May 19, 2024, 02:28:43 AMAds are not the most effective in educating but can be used to gain more followers.Most of the people you'll be putting up that ad for have heard about BTC previously, but many of them are not interested in it and know nothing about the network and they do not care. That ad isn't going to do anything to change their mind about BTC, neither will it 'educate' them more than the little they already know about BTC. Like i have said, whoever is interested in BTC, knows where to get information about the network, and no bitcoiner needs to raise funds to put up ads for this purpose.How do you or how do we know if we won't try? BTC may be popular now but I think a lot of the population are still clueless about it. We are one of it before but BTC got our attention and we researched further about it, up to the point that we are now involved with it.So, if it happened to us, why not on other people? We only need to try our best to come up with a good and presentable approach in terms of marketing, so that we can increase our chances of attracting the public towards it. If only I have an extra money or are fortunate enough, I'd gladly donate to make this movement more possible and I think other solid Bitcoiners will do too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "May 23, 2024, 05:18:10 PM",
      "body": "Quote from: Z-tight on May 19, 2024, 06:12:20 AMQuote from: peter0425 on May 19, 2024, 02:28:43 AMAds are not the most effective in educating but can be used to gain more followers.Most of the people you'll be putting up that ad for have heard about BTC previously, but many of them are not interested in it and know nothing about the network and they do not care. That ad isn't going to do anything to change their mind about BTC, neither will it 'educate' them more than the little they already know about BTC. Like i have said, whoever is interested in BTC, knows where to get information about the network, and no bitcoiner needs to raise funds to put up ads for this purpose.If you think this advert will not change their minds or have any impact on these people why do crypto exchanges or other crypto businesses spend so much money to pay for advert slots in the Super Bowl? It was reported that Crypto.com, FTX Trading, and Coinbase spent about $6.5 million each for the ads. It is estimated that close to  123.7 million people viewed this year's Main Bowl. These ads are powerful tools to attract people to the industry. Nevertheless, there are other means of promoting Bitcoin education. Taking Bitcoin education to schools where young students will be exposed to the coin might be cheaper and more effective. Engaging in humanitarian services in some countries using the platform to promote the coin might also be viable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}