{
  "id": "topic_5445979",
  "title": "Catenaccio",
  "author": "Catenaccio",
  "created_time": "March 23, 2023, 02:10:08 AM",
  "content": "I created my account on Binance but they did not give me change address.Any exchange give us change address for my account?I don't want to use one address forever.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445979",
  "comments": [
    {
      "author": "Nwada001",
      "created_time": "March 23, 2023, 02:22:39 AM",
      "body": "It's hard to find an exchange that uses new deposit addresses all the time. Binance usually uses just 1 address for all ERC-20, BSC, POLYGON, and other smart contracts that are compatible with the Eth address. But Bitmart used different addresses for different blockchains and different deposit tokens or coins. But I really don't think a change of address is really wise, especially on a centralized exchange.  If you need change of address why not use private wallets which you can create as many address as you want for every single transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dbshck",
      "created_time": "March 23, 2023, 02:25:29 AM",
      "body": "Yeah you can't do that in Binance. Try Kraken, they provide users with the option to generate a new deposit address https://support.kraken.com/hc/en-us/articles/7432313905172-Generating-new-deposit-addresses",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ifarted",
      "created_time": "March 23, 2023, 03:17:15 AM",
      "body": "I never heard that an exchange have change address. Some exchange generate new address after transactions. Why do you need an exchange with change address?. Is it by any chance that if you send crypto then you want to receive the change in an address that is not in the exchange?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helena Yu",
      "created_time": "March 23, 2023, 03:26:39 AM",
      "body": "Quote from: ifarted on March 23, 2023, 03:17:15 AMIs it by any chance that if you send crypto then you want to receive the change in an address that is not in the exchange?I think he just want to increase his privacy, so if he will make a deal with someone and he give hid Bitcoin address, his client will not know who's him since the address is differ from one to other. Either it's a same address or different, the funds will still arrive into your account because one seed phrase can create many private keys and it's hard to trace because your funds will be stored on hot wallet before it's send into your wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smack That Ace",
      "created_time": "March 23, 2023, 03:32:59 AM",
      "body": "Try using Kraken that @dbshck mentioned. But you can tell me, Why would you want to change your wallet address, because once you have used a centralized exchange, your privacy has been lost, changing the wallet address is sometimes not beneficial, but also cause unnecessary confusion? If you want to change your wallet address all the time for the best privacy, you'd better use a personal wallet, I'm using Green Wallet, they provide a wallet address change service.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UchihaSarada",
      "created_time": "March 23, 2023, 04:03:32 AM",
      "body": "Use centralized exchange is bad.Reminder: do not keep your money in online accountsIf you want to find platforms that allow you to create new addresses[LIST] Exchanges which let you create multiple deposit addresses but be aware of above risk.If you don't want risk, use Electrum wallet.[GUIDE] How to Safely Download and Verify ElectrumWhat is the \"Change\" address on bitcoin wallet ? read to know !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "March 23, 2023, 05:19:27 AM",
      "body": "Quote from: Nwada001 on March 23, 2023, 02:22:39 AMBut I really don't think a change of address is really wise, especially on a centralized exchange. Thats right. Its quite confusing using different addresses on cex it might give you an error later on. But if using non custodial, its good to have different address or change the one you frequently used.Interesting question, does there is an exchange that allows change of deposit address? Or at least a feature that we can request one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "March 23, 2023, 06:26:35 AM",
      "body": "Quote from: Catenaccio on March 23, 2023, 02:10:08 AMAny exchange give us change address for my account?I don't want to use one address forever.I think you're confusing the term \"change address\".It's not the mechanism of wallets that generates new address after it received bitcoins.\"Change address\" is from a different derivation path at 'chain index', separate from your \"receiving addresses\".It's the standard path for addresses where the change from your transactions will be sent.Anyways, the main question is already answered by others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UchihaSarada",
      "created_time": "March 23, 2023, 07:01:43 AM",
      "body": "Binance does not allow you to change your receiving address but you can choose two address types.Bitcoin for Legacy address: begins with 1.BTC (Segwit) for Native Segwit Bech32: begins with bc1q.So you will have two Bitcoin receiving addresses on Binance.Binance does not allow you to get Nested Segwit receiving address, begins with 3 or Taproot address begins with bc1p.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "March 23, 2023, 07:13:44 AM",
      "body": "Quote from: Catenaccio on March 23, 2023, 02:10:08 AMI created my account on Binance but they did not give me change address.Any exchange give us change address for my account?I don't want to use one address forever.Some exchange do recommend when clicking the receive tab and near to the address and also they say its for your privacy reasons unfortunately not many exchange gave us such feature including Binance so you have to go with that same address forever. Or if you're concerned about your privacy over the market price of your altcoins or tokens then use decentralized exchanges.Quote from: UchihaSarada on March 23, 2023, 07:01:43 AMBinance does not allow you to change your receiving address but you can choose two address types.Bitcoin for Legacy address: begins with 1.BTC (Segwit) for Native Segwit Bech32: begins with bc1q.So you will have two Bitcoin receiving addresses on Binance.Binance does not allow you to get Nested Segwit receiving address, begins with 3 or Taproot address begins with bc1p. Please don't reply only by reading the title. I don't mean to offend you but your giving irrelevant info for OPs query.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UchihaSarada",
      "created_time": "March 23, 2023, 07:28:19 AM",
      "body": "Quote from: jrrsparkles on March 23, 2023, 07:13:44 AM Please don't reply only by reading the title. I don't mean to offend you but your giving irrelevant info for OPs query.Irrelevant?Quote from: Catenaccio on March 23, 2023, 02:10:08 AMI don't want to use one address forever.ReallyQuote from: UchihaSarada on March 23, 2023, 07:01:43 AMBinance does not allow you to change your receiving address but you can choose two address types.So you will have two Bitcoin receiving addresses on Binance.It is useful for OP with at least one new address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "armanda90",
      "created_time": "March 23, 2023, 07:48:47 AM",
      "body": "Binance seems impossible for changing your deposit address and extended for longer time with your current address, but you have use Coinbase because ability there generate or changing deposit address with unlimited amount. But the weakness with Coinbase not all coins listed there and you will face difficult later when getting coins not support in Coinbase exchange.Before coinbase ever used with Hitbtc and ability generate with many address, we can use difference address when depositing fund but I don't know detail about this exchange progress. Last three years is the last time I used with Hitbtc and until right now my account have been restore with 2fa reset by their system, I think not recommended with Hitbtc getting generate or change address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "March 23, 2023, 07:51:13 AM",
      "body": "Quote from: jrrsparkles on March 23, 2023, 07:13:44 AM Please don't reply only by reading the title. I don't mean to offend you but your giving irrelevant info for OPs query.The problem isn't only that, but he was already make a reply to the @OP before but he create another more reply where he's reply to the @OP. Do you understand what I mean? he can just edited his post and add more information rather than creating two replies when he want to replied on the same discussion Quote from: armanda90 on March 23, 2023, 07:48:47 AMBefore coinbase ever used with Hitbtc and ability generate with many address, we can use difference address when depositing fund but I don't know detail about this exchange progress. AFAIK Hitbtc have many scam accusations in this forum, although it's mostly an old accusations, so better to withdraw the money on the exchange if you still have it on there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "March 23, 2023, 08:27:38 AM",
      "body": "Quote from: Catenaccio on March 23, 2023, 02:10:08 AMI created my account on Binance but they did not give me change address.Any exchange give us change address for my account?I don't want to use one address forever.The idea of change address is to avoid linking your address to yourself especially  when you use it over time in different places for different purposes. But you already completed kyc with binance which made some reasons for change address implementation seems defeated.However, it is also not totally useless having a change address because you use centralized exchange. It could also help you escape random friends and relatives knowing how much you own in your binance exchange. I know of kraken, remitano that does change address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "March 23, 2023, 09:06:32 AM",
      "body": "A simple clarification. It was mentioned that OKX gives No - One address per user, (https://bitcointalk.org/index.php?topic=5292667.0)  which is incorrect or at least has changed. When you use the platform, it gives you up to 10 addresses for each account, and you can reuse the addresses several times.These platforms do not do much to enhance identity by giving you several private keys, so do not rely on them as a way to enhance privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "March 23, 2023, 09:46:05 AM",
      "body": "Quote from: Catenaccio on March 23, 2023, 02:10:08 AMI created my account on Binance but they did not give me change address.Any exchange give us change of address for my account?I don't want to use one address forever.I hope you aren't trying to store your crypto assets on the Binance exchange, don't do it.You can't trust any centralized exchange even if they are the top #1 rated over the web, it still doesn't guarantees that your assets will be safe on the exchange.Centralized exchanges are the ones in the custody of your private key, they are not non-custodial.If your purpose of depositing on Binance exchange is not to keep funds there then it makes no sense to me why you need an exchange that can give you more than one address, you can do this comfortable in non-custodial wallets too, like meta mask wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z390",
      "created_time": "March 23, 2023, 10:06:33 AM",
      "body": "Simple, you have to generate a new address in your wallet, just download a wallet that supports multi-wallet like coinomi wallet, this was the first wallet I used that can generate as many addresses as possible, even a new Bitcoin address. Do not send your crypto to any exchange and leave the coins on exchanges, if Luna crash doesn't teach you anything the FTX collapse should, no centralized exchange is safe with customers' funds, not even Kraken or Binance exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "March 23, 2023, 10:13:31 AM",
      "body": "Quote from: ifarted on March 23, 2023, 03:17:15 AMI never heard that an exchange have change address. Some exchange generate new address after transactions. Why do you need an exchange with change address?It's all about having more privacy and that makes someone's privacy better by having change address. So, every time someone transacts to another address and it's changed, it's hard to track that it's the same person that did it.@OP, you've got the answers about what exchanges that has change addresses and the thread have served its purpose to what you're looking for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "March 23, 2023, 11:11:11 AM",
      "body": "There was a time I contacted binance customer support to ask if I could get a new wallet address. The person in charge was asking me several questions to know why I needed one and after providing them with all the answer they needed my request was still denied. I don't know if it's possible but have you tried deleting your account from Binance and register another one? I know it's not possible to use same document to complete KYC on Binance but I suspect that if you delete your previous account and then proceed to creating a new account could solve this problem. I haven't tried it yet though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}