{
  "id": "topic_5437746",
  "title": "andreevich",
  "author": "andreevich",
  "created_time": "February 02, 2023, 09:30:48 AM",
  "content": "В мире, где децентрализованные технологии становятся все более заметными, потребность во взаимодействии между различными блокчейн-сетями как никогда высока. Именно здесь на помощь приходит ZetaChain, представляющая собой первую в мире децентрализованную публичную блокчейн-сеть первого уровня, которая соединяет все.ZetaChain облегчает межцепочечную и межуровневую передачу ценностей, доставку сообщений и вызовы смарт-контрактов. Это позволяет разрабатывать омниканальные dApps (odApps), которые могут использовать ликвидность в нескольких сетях, читать и обновлять состояния во всех подключенных сетях. Другими словами, ZetaChain позволяет децентрализованным приложениям беспрепятственно соединяться друг с другом и взаимодействовать с несколькими сетями блокчейн таким образом, который ранее был невозможен.Одним из ключевых преимуществ ZetaChain является его способность уменьшить фрагментацию децентрализованной экосистемы. В настоящее время существует множество различных блокчейн-сетей, работающих независимо друг от друга, каждая со своим уникальным набором функций и возможностей. С помощью ZetaChain эти сети могут быть соединены, что позволит передавать между ними ценности и данные, создавая более единую и взаимосвязанную экосистему.Еще одним преимуществом ZetaChain является его способность повышать безопасность и надежность децентрализованных приложений. Соединяя несколько сетей блокчейн, ZetaChain создает более безопасную и надежную инфраструктуру для odApps, снижая риск возникновения единых точек отказа и затрудняя атаку злоумышленников на какую-либо одну сеть.В настоящее время ZetaChain находится на стадии Testnet, а ее Mainnet будет запущен в ближайшее время. Команда ZetaChain неустанно работает над тем, чтобы сеть была безопасной, масштабируемой и отвечала требованиям быстро растущей децентрализованной экосистемы.В заключение следует отметить, что ZetaChain представляет собой важный шаг вперед в развитии децентрализованной экосистемы. Благодаря своей способности соединять несколько сетей блокчейн и облегчать межцепочечную и межслойную передачу ценностей, ZetaChain имеет потенциал для революционного изменения способа создания и использования децентрализованных приложений. Поскольку запуск Mainnet уже не за горами, будущее ZetaChain и децентрализованной экосистемы в целом выглядит светлым.До конца первого квартала 2023 года сеть тестируется, вы так же можете принять в этом участие и ВОЗМОЖНО получить airdrop токена $ZETA. Что нужно делать в тестнете зетачейн можете ознакомится в этой статье https://teletype.in/@andreevich52/airdrop_zetachain.Официальные страницы Zetachainhttps://twitter.com/zetablockchainhttps://t.me/zetachainofficialhttps://discord.gg/yW63vGQW5u",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437746",
  "comments": [
    {
      "author": "klarki",
      "created_time": "November 28, 2023, 11:38:47 PM",
      "body": "В партнерстве с Bitget запустили свежую активность \"Узнайте, как взаимодействовать с ZetaChain!\":Quote from: sompitonov on November 22, 2023, 10:28:24 AM700 000 $ZETA в наградах! Получите доступ к Task2Get сейчас и взаимодействуйте с экосистемой ZetaChainПолный текст:  тут Доступ к Task2Get возможен только в мобильном приложении BitgetWallet. Если еще не активничали в Zeta, то есть возможность прогреться.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klarki",
      "created_time": "December 01, 2023, 10:26:17 AM",
      "body": "sompitonov, вытяну Вас в профильную тему  Quote from: sompitonov on December 01, 2023, 10:14:44 AMХочется сказать \"Что происходит?\"  просто ачуметь, уже почти полляма. Походу дела ботоферма на скриптах работает 24/7. Первое впечатление было обманчиво для меня и вот во что это вылилось.Зайду в ближайшее время в дискорд, поспрашиваю как там оно) я кстати там с ролью вип контрибутор, полученной меньше года назад. На недавней ама сказали в который раз о переносе мейннета, вроде пока на Q1 2024, но сдвинуться может все на изи, снова. Slem сказал что затягивать тоже им не стоит а то конкуренты не дремлют и копируют их технологии  думаю хотя бы это поспособствует более скорейшему выходу в мейннет, а то в крипте я знаю чем обычно заканчивается если перетянуть выход, ничем хорошим  ладно, не буду оффтопить, про проект больше, тут все-таки больше про Bitget)В ZetaLabs тоже мультов много:В дискорде Zeta вроде тихо все)) Поделитесь потом, сколько нальют за эту роль, как бы не вышло как вышло с Sei) Что касательно майнета, то на них уже наезжают инвесторы в лице фондов)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klarki",
      "created_time": "January 21, 2024, 01:08:23 PM",
      "body": "Тут это, намечается бритва охотников за дропом) Если имеете роль контрибутора в дискорде ZetaChain, имеет смысл заполнить эту форму для подтверждения своей роли.Информация из дискорда ZetaChain.Подготовка в выходу в майнет: https://blog.zetachain.com/preparing-for-zetachain-1-0-5f52daa7a9b0?gi=75abb1767571",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sompitonov",
      "created_time": "January 21, 2024, 01:15:54 PM",
      "body": "Quote from: klarki on January 21, 2024, 01:08:23 PMТут это, намечается бритва охотников за дропом) Если имеете роль контрибутора в дискорде ZetaChain, имеет смысл заполнить эту форму для подтверждения своей роли.Информация из дискорда ZetaChain.Подготовка в выходу в майнет: https://blog.zetachain.com/preparing-for-zetachain-1-0-5f52daa7a9b0?gi=75abb1767571Я заполнил пару дней назад, интересно есть у нас на форуме еще контрибьюторы зетачейн.Вообще довольно долго у них это всё проходит, в крипте плохо выпустить сырой продукт, но у зеты другая проблемка, вероятно они претянули с выходом. Сами недавно говорили что на пятки им наступают другие проекты, копируют у них идеи разные. Вообщем я уверен что в первом полугодии выйдет в мейннет. Некоторые ставят небольшой tier этому проекту, мне пока сложно сказать успешно ли выйдут, посмотрим. В добавок ко всему Zealy снова начал делать. Захожу иногда в дискорд, там есть люди которые 1.5 года просто живут в дискорде, потратили тонну времени, интересно окупят ли они его.Так что тоже жду и верю что все будет хорошо у зетачейн, по крайней мере мне бы очень хотелось.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klarki",
      "created_time": "January 21, 2024, 01:26:24 PM",
      "body": "Quote from: sompitonov on January 21, 2024, 01:15:54 PMЯ заполнил пару дней назад, интересно есть у нас на форуме еще контрибьюторы зетачейн.Вообще довольно долго у них это всё проходит, в крипте плохо выпустить сырой продукт, но у зеты другая проблемка, вероятно они претянули с выходом. Сами недавно говорили что на пятки им наступают другие проекты, копируют у них идеи разные. Вообщем я уверен что в первом полугодии выйдет в мейннет. Некоторые ставят небольшой tier этому проекту, мне пока сложно сказать успешно ли выйдут, посмотрим. В добавок ко всему Zealy снова начал делать. Захожу иногда в дискорд, там есть люди которые 1.5 года просто живут в дискорде, потратили тонну времени, интересно окупят ли они его.Так что тоже жду и верю что все будет хорошо у зетачейн, по крайней мере мне бы очень хотелось.Я не дотянул до этой роли, мейби успею еще, но зная, как они проверяют заявки, то можно легко пролететь. Что касательно выхода в Mainet, это уже на них фонды надавили, если бы не они, можно было бы еще пару лет в пустую гонять транзы в тестнете   Меня больше пугает то, что ZetaChain считай построен на космосе, а как правило проекты выпущенные на космосе выходят в майнет довольно плохонько.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sky999",
      "created_time": "January 22, 2024, 09:53:01 AM",
      "body": "Quote from: klarki on January 21, 2024, 01:26:24 PMЯ не дотянул до этой роли, мейби успею еще, но зная, как они проверяют заявки, то можно легко пролететь. Что касательно выхода в Mainet, это уже на них фонды надавили, если бы не они, можно было бы еще пару лет в пустую гонять транзы в тестнете   Меня больше пугает то, что ZetaChain считай построен на космосе, а как правило проекты выпущенные на космосе выходят в майнет довольно плохонько.тиа хорошо вышла. Так что все может быть. Я не контрибьютил но поинтов набил там в свое время прилично.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klarki",
      "created_time": "January 22, 2024, 08:53:56 PM",
      "body": "Появилась возможно узнать количество токенов, которые наловили во время активности.Снимок оказывается был уже в августе 2023 года.Чекнуть свои токены, которые будут для клейма можно здесь.Маскимально с одного аккаунта можно было заработан 20к Zeta.С деталями можно ознакомиться в источнике.Я лично пока мимо, буду чекать остальные акки + может что-то получится забрать с активности на Bitget.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sompitonov",
      "created_time": "January 22, 2024, 09:29:34 PM",
      "body": "Quote from: klarki on January 22, 2024, 08:53:56 PMПоявилась возможно узнать количество токенов, которые наловили во время активности.Снимок оказывается был уже в августе 2023 года.Чекнуть свои токены, которые будут для клейма можно здесь.Маскимально с одного аккаунта можно было заработан 20к Zeta.С деталями можно ознакомиться в источнике.Я лично пока мимо, буду чекать остальные акки + может что-то получится забрать с активности на Bitget.Анонс увидел сразу же из дискорда зетачейн. Я видел скрины у кого 3200 токенов, но это по пальцам пересчитать, оснвновная масса процентов 90 это меньше 1к токенов.За роли еще не раздавали, это только за зеталабс. Цену уже прогнозируют от 0.05$ до 1$. Когда все понакидывают токены за роли и тд, тогда самое первое где будет известна равновесная цена это будет ОТС кукоина.На страничке дропа если полистать дальше будет форма которую заполнить надо, вот там и есть пункт в котором необходимо отметить кампании в которых участвовали",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klarki",
      "created_time": "January 23, 2024, 11:39:59 PM",
      "body": "Немного информации о том, как отсеивали сибил/ботов: https://teletype.in/@slem_1337/3lj71-7thbCИз 1,3 млн. адресов было отсеяно всего 300к.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klarki",
      "created_time": "January 27, 2024, 10:12:24 AM",
      "body": "Ютилити токена ZetaChain и обновление информации о вознаграждениях:https://zetachain.notion.site/ZetaChain-814fb919b8064059bd50bf4d3e5999b3Распределение токенов: https://www.zetachain.com/docs/about/token-utility/distribution/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sky999",
      "created_time": "January 27, 2024, 12:03:38 PM",
      "body": "Quote from: klarki on January 23, 2024, 11:39:59 PMНемного информации о том, как отсеивали сибил/ботов: https://teletype.in/@slem_1337/3lj71-7thbCИз 1,3 млн. адресов было отсеяно всего 300к. Короче очередное фуфло. Там надо было 300к оставить, а остальное отсеять, разрабы наверно кнопкой ошиблись   А скорее всего сами мультили по черному.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klarki",
      "created_time": "February 02, 2024, 10:21:02 AM",
      "body": "Появилась возможно заклеймить награды за Access Pass (1 Zeta). + объявили о запуске кампании https://hub.zetachain.com/xpПод эту тему выделено 6% от общего саплая.По активностям и наградам за активность на платформах Zelay, Galxe, пока нет никакой информации.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sky999",
      "created_time": "February 02, 2024, 02:21:45 PM",
      "body": "Quote from: klarki on February 02, 2024, 10:21:02 AMПоявилась возможно заклеймить награды за Access Pass (1 Zeta). + объявили о запуске кампании https://hub.zetachain.com/xpПод эту тему выделено 6% от общего саплая.По активностям и наградам за активность на платформах Zelay, Galxe, пока нет никакой информации. Нда, прикрутить кис на клейм дропа, да еще без ру-региона, это надо было додуматься. Прошлое дно пробила суи, зета поставила новый рекорд. Как говорится, никогда не говори никогда...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klarki",
      "created_time": "February 03, 2024, 09:34:58 AM",
      "body": "Quote from: sky999 on February 02, 2024, 02:21:45 PMНда, прикрутить кис на клейм дропа, да еще без ру-региона, это надо было додуматься. Прошлое дно пробила суи, зета поставила новый рекорд. Как говорится, никогда не говори никогда...По Sui я бы не был столь категоричен, несмотря на кидок с дропом, различные костыли, можно было с WL вытянуть неплохо. Что касательно KYC в ZetaChain, то тоже не понял на кой черт они его внедрили, не уверены в системе отсева, которая отбрила 300к акков? Ок, но каким боком KYC поможет отсечь? 5 баксов и у тебя есть KYC  По ру, там еще должны открыть возможность загрузить док. + под KYC попали только те, у кого больше 200 токенов для клейма.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sky999",
      "created_time": "February 03, 2024, 12:48:36 PM",
      "body": "Quote from: klarki on February 03, 2024, 09:34:58 AMQuote from: sky999 on February 02, 2024, 02:21:45 PMНда, прикрутить кис на клейм дропа, да еще без ру-региона, это надо было додуматься. Прошлое дно пробила суи, зета поставила новый рекорд. Как говорится, никогда не говори никогда...По Sui я бы не был столь категоричен, несмотря на кидок с дропом, различные костыли, можно было с WL вытянуть неплохо. Что касательно KYC в ZetaChain, то тоже не понял на кой черт они его внедрили, не уверены в системе отсева, которая отбрила 300к акков? Ок, но каким боком KYC поможет отсечь? 5 баксов и у тебя есть KYC  По ру, там еще должны открыть возможность загрузить док. + под KYC попали только те, у кого больше 200 токенов для клейма. а какие сейчас трастовые сервисы есть для этого дела? А то у меня болтается 300 токенов и что делать теперь с этим хз...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klarki",
      "created_time": "February 04, 2024, 01:50:58 PM",
      "body": "Quote from: sky999 on February 03, 2024, 12:48:36 PMа какие сейчас трастовые сервисы есть для этого дела? А то у меня болтается 300 токенов и что делать теперь с этим хз...В среде ретродроперов сейчас активно используются различные Отс-рынки в тг. Например,  terncrypto_otc.Правда скамеров там тоже хватает, но есть гарант-сервисы (вроде еще не скурвились). Правда хз, что за сервис берет на себя KYC (проверку).Если взять SumSub, то там можно было просто дать ссылку для верифа челику, который за копейки крутит фейсом, грузит доки, а ты у себя на странице верифа сразу видишь, прошел ли вериф. или нет.Если надумаете таким образом пройти вериф, то не тяните с клеймом, могут откатить вериф",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klarki",
      "created_time": "February 06, 2024, 10:22:44 PM",
      "body": "Обновление в XP программе (ретродроп в майнете):перевод клейма наград за активности в экосистеме Zetachain на еженедельный формат На данный момент отключена возможность заработка XP за активности. Имхо, проблем больше, чем пользы. hub.zetachain c самого начала работает некорректно, то задания не засчитывались, то кнопка клейма не отображалась.Cтатусы систем Zetachain: https://status.zetachain.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bakasabo",
      "created_time": "February 07, 2024, 09:03:28 AM",
      "body": "А тем временем курс ZETA падает ежедневно, с $1.87 до $1.14 и падение не останавливается. Надеюсь что это какое-то временное событие, коррекция и последует рост. А то сейчас некогда гейнер, превращается в лузера. Закинул полученное из дропа в стэкинга, но наблюдаю лишь как баланс уменьшается ежедневно. Немного странно что так мало топовых бирж залистили. Жду листинг на Бинансе.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klarki",
      "created_time": "February 11, 2024, 11:59:47 PM",
      "body": "На данный момент не наблюдается проблем при взаимодействии с платформой Hub Zeta.Задания выполняются без проблем, кнопка клейма тоже работает. Сегодня последний день перед началом следующего периода клейма XP.Наблюдают только баги в стейкинге, но это исключительно проблема платформы. Проверить свой стейк можно здесь.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}