{
  "id": "topic_5448980",
  "title": "aseev",
  "author": "aseev",
  "created_time": "April 15, 2023, 11:30:45 PMLast edit: May 12, 2023, 08:33:51 PM by aseev",
  "content": "Custom vector graphics of any kind - icons, stickers, logos, illustrations, backgrounds, you name it (see examples on my site dedicated to vector images: https://www.rorki.com/).     PaymentEthereum on the main net or Matic / USDC / USDT on PolygonExclusive and non-exclusive image licenses are available.Non-exclusive Image LicensesYou can request a custom design without any commitment. All designed images are added to the Rorki image library and available for licensing on a non-exclusive basis. With no obligation to purchase, you only pay if the end result is exactly what you're looking for.ExamplesSimple graphics and shapesPrice Range: $1-$4Medium complexityPrice Range: $5-$14Complex designs and illustrationsPrice Range: $15-$29Exclusive Image LicensesBy agreement.Contact me via private message.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448980",
  "comments": [
    {
      "author": "Woodie",
      "created_time": "April 16, 2023, 07:24:19 AM",
      "body": "Visited your site great work mate Fyi this service  will be much more attractive to your potential client's if pricing was put up their to avoid back and forth pricing questions unless you say every service has its own price depending on difficulty and they need to always get a quotation from you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aseev",
      "created_time": "April 17, 2023, 04:05:29 AMLast edit: April 17, 2023, 04:54:39 PM by aseev",
      "body": "Quote from: Woodie on April 16, 2023, 07:24:19 AMVisited your site great work mate Thank you.Quote from: Woodie on April 16, 2023, 07:24:19 AMFyi this service will be much more attractive to your potential client's if pricing was put up their to avoid back and forth pricing questions unless you say every service has its own price depending on difficulty and they need to always get a quotation from you.Thank you for the suggestion. I can create anything from site icons to cuttable files on plotters to stickers to apparel design so the price will differ based on complexity. For example, the design on the right will take much more time to create and naturally will cost more than the one on the left. But I will create a price table to give people some idea about pricing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aseev",
      "created_time": "September 13, 2023, 07:22:28 PM",
      "body": "bump",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}