{
  "id": "topic_5449569",
  "title": "SmartGold01",
  "author": "SmartGold01",
  "created_time": "April 20, 2023, 11:36:39 AM",
  "content": "I have been wondering why does it take so much time for bitcoin price to bull and whenever it try's coming up it takes just some few hours or days to drop drastically or changes in percentage.Does this means bitcoin can not maintain bull sign for about 7 months or 1 year straight up without having to change and show bear signs?Can someone explain this to me i am curious to know, and if this question already ask please ref me topic to read so i can lock this?Thank you.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449569",
  "comments": [
    {
      "author": "Cointxz",
      "created_time": "April 20, 2023, 11:43:36 AM",
      "body": "Quote from: SmartGold01 on April 20, 2023, 11:36:39 AMI have been wondering why does it take so much time for bitcoin price to bull and whenever it try's coming up it takes just some few hours or days to drop drastically or changes in percentage.Does this means bitcoin can not maintain bull sign for about 7 months or 1 year straight up without having to change and show bear signs?Can someone explain this to me i am curious to know, and if this question already ask please ref me topic to read so i can lock this?Thank you.Buying a dipping token is very hard during crypto winter because everyone is afraid. It needs time and unity for all traders to buy without selling their holdings short term for bullrun to happened. We are talking about money here and no one wants to risk buying when there’s uncertainty in the market which is why only few gain huge profit in trading and most of them are those doesn't purchasing Bitcoin when everyone is on panic selling.Maybe try to learn what's behind bull run to have a better understanding on how it works. Buying on dipping market is harder than selling in loss because that's how human mind work when scared of loses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DanWalker",
      "created_time": "April 20, 2023, 11:55:29 AM",
      "body": "What are you expecting from bitcoin? Do you want bitcoin to increase in price continuously for 1 year so you can take profits and get rich quickly after just one year of investing in bitcoin? I have not seen a financial market that can go up continuously for a year without a correction.The financial market is like that, it is always harsh and making money is not easy, if you want to make money with the financial market you need to be patient and seize the opportunity when the opportunity comes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "April 20, 2023, 11:58:02 AM",
      "body": "Bitcoin takes its own time to meet its bull run, then the bearish market most of the time is caused by some fuds and bad news that affect the market negatively. It takes some time for Bitcoin to regain its strength and rise again, and most times it might go higher than it was before. The drastic change in price is what shows that it's being traded; if the price remains stagnant, that means there is not much interest in trading bitcoin. The bitcoin price needs to go up and down; it's only stable coins whose price is meant to remain at a certain level. (Even those so-called stable coins still drop in price by some percentage.)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wakate",
      "created_time": "April 20, 2023, 12:04:32 PM",
      "body": "Quote from: SmartGold01 on April 20, 2023, 11:36:39 AMI have been wondering why does it take so much time for bitcoin price to bull and whenever it try's coming up it takes just some few hours or days to drop drastically or changes in percentage. That is what we meant by volatility when we talk about weighing you risk to profits ratio. Same thing happens when the market wants to bullishly skyrocket in price. Many of these things is based on the law of demand and supply that is why the Bitcoin price is volatility and can move to any direction in seconds. It is advisable for us to be aware of this movement and make proper investment plans or else you might have to patiently wait for the market to bounce back to get the kind of profits you are looking for.QuoteDoes this means bitcoin can not maintain bull sign for about 7 months or 1 year straight up without having to change and show bear signs?You need to understand that the market needs to balance momentum for it to keep going bullish or bearish. That is why we do see something like.  Bull Trend Higher - high Higher - lowBear TrendLower - highLower - LowPicture sourceThis pattern of market movement is necessary for price to keep going bull or bear and momentum of buyers or the sellers need to be balanced for the market to keep moving. I would like you to go read on MARKET STRUCTURE  so you will have a comprehensive knowledge about the cryptocurrency market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "April 20, 2023, 01:58:14 PM",
      "body": "Quote from: SmartGold01 on April 20, 2023, 11:36:39 AMI have been wondering why does it take so much time for bitcoin price to bull and whenever it try's coming up it takes just some few hours or days to drop drastically or changes in percentage.That's the very definition of volatility, we don't know where the price is going to be, and most of the time it will be -/+ in a given day. Quote from: SmartGold01 on April 20, 2023, 11:36:39 AMDoes this means bitcoin can not maintain bull sign for about 7 months or 1 year straight up without having to change and show bear signs?Not just bitcoin though, if I'm not mistaken, traditional market like stocks can't go on parabolic rise, sooner or later buyers are going to be exhausted and with that, the market might on a correction.But wait after the block halving and see how the real bull run is with Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "April 20, 2023, 02:07:00 PM",
      "body": "Quote from: SmartGold01 on April 20, 2023, 11:36:39 AMDoes this means bitcoin can not maintain bull sign for about 7 months or 1 year straight up without having to change and show bear signs?It is because of Psychology of market cycles need a lot of time to complete. People only feel boring and exit, give up if they have to wait too long and gain nothing. You can see market crash but first time, people panic sell and buy back not a long time later. However if such things repeat many times, they will feel boring if the market won't grow up, then they will exit and stop their game.It is when the market starts to be bullish.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "April 20, 2023, 03:26:14 PM",
      "body": "Quote from: SmartGold01 on April 20, 2023, 11:36:39 AMDoes this means bitcoin can not maintain bull sign for about 7 months or 1 year straight up without having to change and show bear signs.Everyone know that Bitcoin has volatile movement and due that that reason Bitcoin goes up and down with different time frame and I think due to these movement it increase the interest of people to invest in BitcoinBasically any bullish movement in Bitcoin chart need two thing huge investment from whale or any positive news like , announcement of any upgrade in his project or partnership with any trusted big names. So it can't possible to delivery kind of news or investment continuously which make Bitcoin green ever. While the investor will also sell some amount after a period of time to get some profit too. So it's can't possible for Bitcoin to be green for 7month or year",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oceat",
      "created_time": "April 20, 2023, 03:40:35 PM",
      "body": "It all boils down to supply and demand plus we can't expect Bitcoin to be as stable just like the fiat currency. Bitcoin has a lot of traders that's why the volatility of its price isn't stable plus it's somehow prone to price manipulation by the big guy on the top since that's their only way of making money from the small fish.Notice why every after halving the price of Bitcoin will suddenly pump beyond to what you are expecting? If you know how Bitcoin halving works then that's the very reason why the bull run pump too much but after the pumping of course, you can expect a great bearish trend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "April 20, 2023, 03:41:37 PM",
      "body": "Such is the condition of the crypto market that is uncertain. But with bulls and bears, we can benefit. It's okay if the price can last for a few hours or days and after that, it corrects so that people can stay aware of what's going to happen next.Usually, after bitcoin reaches its peak price, it will experience a correction and often the price will drop drastically immediately without us expecting it. But sometimes the correction will come down slowly and we won't notice it and it won't make people panic and look for excuses.So you must familiarize yourself with crypto market conditions, which will experience ups and downs faster than usual. And don't be greedy if you already get a profit and take advantage of it immediately before everything changes and you have to wait a few more moments to be able to see the profit coming.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MainIbem",
      "created_time": "April 20, 2023, 04:36:44 PM",
      "body": "Quote from: DanWalker on April 20, 2023, 11:55:29 AMWhat are you expecting from bitcoin? Do you want bitcoin to increase in price continuously for 1 year so you can take profits and get rich quickly after just one year of investing in bitcoin? I have not seen a financial market that can go up continuously for a year without a correction.I think op is not directly saying that bitcoin price should be stable continually, but saying whenever the bulls comes it disappears quickly than the bear. The bear can last for about 7 months above but we barely maintain straight up bull for about 7 months as what I understood from op post.Quote from: SmartGold01 on April 20, 2023, 11:36:39 AMI have been wondering why does it take so much time for bitcoin price to bull and whenever it try's coming up it takes just some few hours or days to drop drastically or changes in percentage.The market doesn't function that way, the simply analogy there is the cost of demand and supply. When the price bull there will be lot of people who wants to quickly take profits since is on \"Green\" and numbers of people doing that (selling) is much than the people buying, that is the reason bull doesn't stay long as you think. After much selling pressure it will take time for market to recover back, meaning people who sold may now see market is down and will want to invest again, at the point of doing this market will get it's feet back. People who always falls victim are those who invested at pick point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wahyuagung26",
      "created_time": "April 20, 2023, 05:03:22 PM",
      "body": "Quote from: SmartGold01 on April 20, 2023, 11:36:39 AMI have been wondering why does it take so much time for bitcoin price to bull and whenever it try's coming up it takes just some few hours or days to drop drastically or changes in percentage.Bitcoin has a fluctuating nature that makes its price unstable, which is where it will continue to run on its own graph, if you expect Bitcoin to go up continuously in a year this may be difficult except for the factor of higher demand for supply and increasing adoption, maybe this can happen, but being in a fluctuating nature still provides fluctuating and unstable prices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "April 20, 2023, 05:10:38 PM",
      "body": "If you have any slight idea about the market and how it works, it’s just about the fact that it’s increasing in price because of the demand. If there is no demand, it will stabilize or possibly go down if there are more sellers than buyers. Imagine having a trend or any viral video. How long do you think it stays relevant in the current situation? Not a long time, but it is a psycho, so maybe in the future, it will rise in demand again and increase in price. The market is always a cycle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Compromise me",
      "created_time": "April 20, 2023, 05:28:03 PM",
      "body": "Quote from: SmartGold01 on April 20, 2023, 11:36:39 AMI have been wondering why does it take so much time for bitcoin price to bull and whenever it try's coming up it takes just some few hours or days to drop drastically or changes in percentage.Does this means bitcoin can not maintain bull sign for about 7 months or 1 year straight up without having to change and show bear signs?Can someone explain this to me i am curious to know, and if this question already ask please ref me topic to read so i can lock this?This is a very interesting question, and I have also done a lot of research on it. While there are many factors that can affect the price of Bitcoin I believe that the halving of Bitcoin is one of the main reasons for its increased volatility.Due to the halving there is a decrease in the supply of Bitcoin, which can increase its price by reducing its availability and increasing demand. In fact during the last halving the price of Bitcoin increased by 19% within 12 months and by 142% within 12 months after that. If someone knows more about this please guide us further.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "April 20, 2023, 05:36:32 PM",
      "body": "It is all related to supply in the market because, in the bear market, there are lots of investors sending their BTC to the exchanges and short-term holders are selling with plans to return when the cycle is about to explode again. All these take time.When there are lots of traders already withdrawing their BTC from exchanges, the supply diminishes while halving also affects the supply from the miner's side.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "April 20, 2023, 06:45:12 PM",
      "body": "For every newbies it always takes forever for the crypto market to go into the bull season, but for those that have been around for a longer year they understand how things works in crypto, the best tip I can give someone like you is to wait for Bitcoin halving, erase your mind from bull season right now and put your mind on Bitcoin halving after Bitcoin halving we are already in a bull season. Where will Bitcoin go if it never retrace its value? There will be no benefit from holding Bitcoin for anyone other than early adopters, but with volatility there will certainly be a redistribution of wealth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MFahad",
      "created_time": "April 20, 2023, 06:55:59 PM",
      "body": "Bitcoin is moving in cyclic form so we cannot predict that bitcoin price can persist higher for seven months. If it takes place then everyone will get profit from it and the price will become down because the demand has a greater impact on price ups and downs of bitcoin. If you are just in the desire to make profit with a price which in constant for seven months then it's means that you don't want to use your knowledge, just want to take profit and then leave behind this investment. So always accept the way of patience and do not rush for the quick success, always remember that success comes after hard time and patience.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2double0",
      "created_time": "April 20, 2023, 07:05:37 PM",
      "body": "Bullish days cannot remain for a very long duration because it needs a lot of capital to maintain that value and to dump it, it's very easy. However, we see long bearish cycles because the bulls kick out every inch of patience from your mind that you become helpless and take out your coins for sale. This is why bearish times are longer, for the bulls to accumulate and then don't give a chance to the weak hands to get on the train again while they pleasantly make enough money on the btc gains.P.S. this belongs to speculation if I'm correct.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "April 20, 2023, 07:38:05 PM",
      "body": "It's a bumpy road. You can not make your journey through this road smoothly. You have to face it too. And small pump like this is not considered as a bull run at any means. These are small pumps, and these reds are all market corrections. You will know for sure when the bulls are back in the market. So if you want to invest, then do it and watch when they are back. It will take time. Also, bitcoin is a long term investment plan asset. You need to wait if you want to earn a good profit from your investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tiCeR",
      "created_time": "April 20, 2023, 07:44:26 PM",
      "body": "Buying a dipping Bitcoin is as good of a decision sometimes as buying Bitcoin that is on the way up. Timing the market is impossible. Everyone wants to catch the lowest price spot and then sell at the highest spot in order to then rebuy at the next lowest spot. This equates to buy low, sell high, which is dumb. It doesn't work like that even if so called pro traders tell you it does. Yes, it can work for one time or two times, but nobody is able to catch the optimal spots all the time no matter the software that is used and no matter how much experience someone has. It is about choosing the right amount based on a strategy that fits your circumstances. Freely available income, security needs/requirements, risk appetite etc. If you can't sleep well anymore after buying in, you probably invested too much money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}