{
  "id": "topic_5405662",
  "title": "bitmover",
  "author": "bitmover",
  "created_time": "July 08, 2022, 10:10:06 PM",
  "content": "https://br.noticias.yahoo.com/elon-musk-desiste-comprar-o-213514250.htmlQuoteElon Musk disse que está encerrando seus US$ 44 bilhões para adquirir o Twitter e torná-lo privado, dizendo que a empresa fez “representações enganosas” como parte do negócio. Twitter não “cumpriu suas obrigações contratuais” sobre a questão dos bots de spam na plataforma”, disse ele na sexta-feira em documento enviado à SEC, órgão regulador americano.As ações da empresa caem 5,90% no after market. no dia, fecharam em queda de 5,10%.Parece que a desistência está relacionada aos bots de spam, que Musk disse que o Twitter não passou todas as informações requeridas.Esse Elon Musk tá meio fanfarrão",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405662",
  "comments": [
    {
      "author": "joker_josue",
      "created_time": "July 09, 2022, 12:28:46 AM",
      "body": "Quote from: bitmover on July 08, 2022, 10:10:06 PMEsse Elon Musk tá meio fanfarrão  Neste caso ele tem toda a razão. Como acionista maioritário e futuro dono da empresa, tem o direito de saber todos os detalhes da empresa.Avisou internamente... avisou publicamente. Quando o fez, foi acusado de tentar baixar o valor da empresa pelos outros grandes acionistas. Acionistas esses que andaram a enrolar na espectativa que ele desse mais dinheiro pela empresa.Agora, acabando-se o prazo estabelecido, ele retira a proposta... e esses acionistas não vem a venda a realizar-se e ainda desvaloriza mais a empresa. Com isto, ele pode continuar a comprar ações no mercado bolsista, mais baratas até ficar com as ações suficientes, para tomar ainda mais decisões dentro da empresa.Resultado final... ele vai acabar por ficar com o Twitter, e esses acionistas que queriam tudo, vão perder muito dinheiro.O Musk pode ser doido... mas não é parvo!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cassiolucena",
      "created_time": "July 09, 2022, 05:22:15 PM",
      "body": "Tenho visto no twitter que isso foi mais uma jogada dele do que uma real intenção de comprar, quem sabe até ele no ganhou uma graninha com esse movimento das ações.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 09, 2022, 06:46:38 PM",
      "body": "Quote from: cassiolucena on July 09, 2022, 05:22:15 PMTenho visto no twitter que isso foi mais uma jogada dele do que uma real intenção de comprar, quem sabe até ele no ganhou uma graninha com esse movimento das ações.Isso não é bem assim.Ele não fez uma proposta só de boca. Ele fez uma OPA oficial, que segue todos os parâmetros legais.E como em todas as OPAs são colocadas exigências, por parte dos compradores. Ele colocou uma exigência, se ela fosse comprida, ele teria de avançar caso contrario teria grandes problemas. Nessas coisas os EUA são muito rigorosos.Visto que não foram compridas essas exigências, dentro do prazo, ele ficou legitimado para cancelar a OPA.A malta é que esta sempre a querer apontar o dedo a tudo o que ele faz, e ficaram muito chateados por não terem conseguido vender.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lcharles123",
      "created_time": "July 10, 2022, 12:04:07 AM",
      "body": "Quote from: joker_josue on July 09, 2022, 06:46:38 PMQuote from: cassiolucena on July 09, 2022, 05:22:15 PMTenho visto no twitter que isso foi mais uma jogada dele do que uma real intenção de comprar, quem sabe até ele no ganhou uma graninha com esse movimento das ações.Isso não é bem assim.Ele não fez uma proposta só de boca. Ele fez uma OPA oficial, que segue todos os parâmetros legais.E como em todas as OPAs são colocadas exigências, por parte dos compradores. Ele colocou uma exigência, se ela fosse comprida, ele teria de avançar caso contrario teria grandes problemas. Nessas coisas os EUA são muito rigorosos.Visto que não foram compridas essas exigências, dentro do prazo, ele ficou legitimado para cancelar a OPA.A malta é que esta sempre a querer apontar o dedo a tudo o que ele faz, e ficaram muito chateados por não terem conseguido vender.Mas não seria melhor ele ter investigado ou exigido que as condições fossem cumpridas antes da proposta? Se sim, então foi a cobertura da mídia que o fizeram parecer fanfarrão  Ou se a proposta foi a exigência para a reivindicação das tais condições? Então aconteceu tudo na normalidade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "July 10, 2022, 01:05:32 AM",
      "body": "Quote from: joker_josue on July 09, 2022, 12:28:46 AMQuote from: bitmover on July 08, 2022, 10:10:06 PMEsse Elon Musk tá meio fanfarrão  Neste caso ele tem toda a razão. Como acionista maioritário e futuro dono da empresa, tem o direito de saber todos os detalhes da empresa.Avisou internamente... avisou publicamente. Quando o fez, foi acusado de tentar baixar o valor da empresa pelos outros grandes acionistas. Acionistas esses que andaram a enrolar na espectativa que ele desse mais dinheiro pela empresa.Agora, acabando-se o prazo estabelecido, ele retira a proposta... e esses acionistas não vem a venda a realizar-se e ainda desvaloriza mais a empresa. Com isto, ele pode continuar a comprar ações no mercado bolsista, mais baratas até ficar com as ações suficientes, para tomar ainda mais decisões dentro da empresa.Resultado final... ele vai acabar por ficar com o Twitter, e esses acionistas que queriam tudo, vão perder muito dinheiro.O Musk pode ser doido... mas não é parvo!Pois é, o cara é realmente intelignte nos negócios, isso eu adminto.O que eu não consigo entender é porque ele quer tanto comprar o Twitter cacildis!?!?Esse cara quando invoca com alguma coisa vai longe, à exemplo da dodge coin, que até hoje ninguém sabe realmente qual é o motivo dele, apesar do cara afirmar ser uma moeda com futuro Eu acho que quando as pessoas tem tanto dinheiro que não sabem mais onde gastar, acabam por fazer certas maluquices que ninguém entende direito o motivo, ou será que somos nós mortais que estamos muito subdesenvolvidos para compreender?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 10, 2022, 05:55:02 AM",
      "body": "Quote from: lcharles123 on July 10, 2022, 12:04:07 AMMas não seria melhor ele ter investigado ou exigido que as condições fossem cumpridas antes da proposta? Se sim, então foi a cobertura da mídia que o fizeram parecer fanfarrão  Ou se a proposta foi a exigência para a reivindicação das tais condições? Então aconteceu tudo na normalidade.Não é bem assim que funciona... Ele não pode fazer exigências sem antes ter uma proposta em cima da mesa.Por exemplo, não sei se gostas de futebol. Quando um clube contrata um jogador, o mesmo passa por uma serie de exames médicos e só depois é que o contrato é assinado com o jogador. Mas esses exames só são feitos, depois de a proposta de compra estar toda acertada com as três partes: clube vendedor; clube comprador e jogador. Isso até pode demorar semanas até acontecer, mas se nos exames médicos feitos pelo o clube comprador o jogador reprovar, a compra é cancelada.Podes dizer: \"porque é que eles não fazem os testes antes?\" Por vários motivos, primeiro não sabem se vão conseguir chegar a um acordo, depois o jogador ainda não é deles para poderem fazer exames nas suas instalações, e esses exames servem para verificar se todo o que o vendedor disse sobre o jogador é verdade. Claro que na maioria dos casos, quando se chega a essa fase, raramente a venda é cancelada, mas já aconteceu.Neste caso, pelo o que parece, ele antes de ter feito a OPA, já tinha pedido ou recebido informações sobre os bots, mas foi a informação igual a que todos os acionistas tem acesso, e ele achou que foi incompleta.Quando avançou com a OPA, apresentou uma proposta de compra com exigências e uma delas era uma informação sobre os bots fosse mais clara. E todos na administração e os grandes acionistas ignoraram. Ele apesar de ser o acionista com um maior numero de ações, não tem a maioria, se mais ninguém faz pressão para que essa informação fosse apresentada a tempo, findando o prazo ele ficou legitimado para a cancelar a OPA.Não podem agora acusar que isto tudo foi uma estratégia de marketing. Isso não faz sentido.O Musk pode fazer muita coisa doida, e não concordo com tudo o que ele faz, agora desta vez ele fez tudo certinho e segundo as exigências das leis. Apresentou uma OPA, com um conjunto de exigências que foram aceites e não foram cumpridas dentro do prazo. Acabando esse prazo, anunciou numa sexta-feira (o ideal e recomendado, porque a bolsa fecha no fim de semana) que como não foi cumprido o prazo das exigências, a OPA é cancelada.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "July 10, 2022, 11:50:47 PMLast edit: July 11, 2022, 01:04:51 AM by bitmover",
      "body": "Quote from: alegotardo on July 10, 2022, 01:05:32 AMO que eu não consigo entender é porque ele quer tanto comprar o Twitter cacildis!?!?Não é nenhuma maluquice querer controlar o twitter.Twitter hoje é maior rede social que ainda não foi comprada pelo facebook.Além disso, o twitter tem um perfil de uso bastante diferente das outras redes, com muito protagonismo político.E ainda para deixar tudo mais complexo, existe uma censura no Twitter.Controlar essa rede social pode dar muito poder nas mãos de uma pessoa inteligente e com objetivos claros, e certamente o Elon Musk é uma pessoa assim.Acabei de ver que o Twitter já está em caminhos de processar o Elon Musk por desistir da compra.Contraram um escritório gigante especializado em fusões de empresas:https://oglobo.globo.com/economia/tecnologia/noticia/2022/07/twitter-contrata-escritorio-para-processar-elon-musk-por-desistir-de-compra.ghtml",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 11, 2022, 06:53:00 AM",
      "body": "Quote from: bitmover on July 10, 2022, 11:50:47 PMAcabei de ver que o Twitter já está em caminhos de processar o Elon Musk por desistir da compra.Contraram um escritório gigante especializado em fusões de empresas:https://oglobo.globo.com/economia/tecnologia/noticia/2022/07/twitter-contrata-escritorio-para-processar-elon-musk-por-desistir-de-compra.ghtmlIsso era espectável. Vai agora começar uma longa batalha em tribunais.Mas eu acredito que neste caso o Twitter não vai ter sucesso. Não estou a ver um Elon Musk em tomar decisões que o podiam colocar em tribunal assim de qualquer maneira. De certeza que ele já terá tudo preparado para este cenário.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "July 12, 2022, 12:43:25 AM",
      "body": "Quote from: joker_josue on July 11, 2022, 06:53:00 AMMas eu acredito que neste caso o Twitter não vai ter sucesso. Não estou a ver um Elon Musk em tomar decisões que o podiam colocar em tribunal assim de qualquer maneira. De certeza que ele já terá tudo preparado para este cenário.Elon musk ja ta fazendo piada do twitter. Achei interessante.No final das contas, ele vai conseguir o que quer.Twitter vai mostrar os dados que eles nao mostraram antes (se é que foi isso mesmo)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 12, 2022, 06:58:59 AM",
      "body": "Quote from: bitmover on July 12, 2022, 12:43:25 AMNo final das contas, ele vai conseguir o que quer.Twitter vai mostrar os dados que eles nao mostraram antes (se é que foi isso mesmo)Boa imagem.Mas se eles realmente avançarem para o tribunal vai ser o que vai acontecer.Elon Musk, pode as vezes ter umas ideias um pouco doidas e dizer coisas sem pensar.Mas, ele não é nenhum tótó para fazer negócios, e prova é a posição que ele tem.E este negocio era bem serio, visto que ele teve sempre cuidada naquilo que dizia sobre o assunto.Eu acho que o problema foi mesmo esse dos dados, posso estar enganado, mas foi o único problema que veio a publico e que o Musk deixo claro que precisava dessas informações para avançar.E até faz sentido. Ninguém vai querer comprar uma empresa que diz ter um numero de clientes, para depois da compra descobrir que metade desses clientes são bots. Essa informação tem de ser dada antes da compra.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "July 13, 2022, 11:42:46 PM",
      "body": "Quote from: bitmover on July 12, 2022, 12:43:25 AMQuote from: joker_josue on July 11, 2022, 06:53:00 AMMas eu acredito que neste caso o Twitter não vai ter sucesso. Não estou a ver um Elon Musk em tomar decisões que o podiam colocar em tribunal assim de qualquer maneira. De certeza que ele já terá tudo preparado para este cenário.Elon musk ja ta fazendo piada do twitter. Achei interessante.~snip image~No final das contas, ele vai conseguir o que quer.Twitter vai mostrar os dados que eles nao mostraram antes (se é que foi isso mesmo)É... se realmente foi isso.Pela forma como foi ilustrado isso até parece um passo-a-passo simples de Musk para conseguir o que quer, mas tenho certeza que nos bastidores isso está sendo uma grandiosa partida de xadrez com jogadas demoradas e muito bem planejadas.Sinceramente me parece muito difícil saber quem possui a razão e quem irá dar o xeque-mate... muita notícia deve rolar ainda.Por mim, poderiam sumir com o twitter... desde que bloquearam minha conta de quando eu fazia spam na era das ICOs eu nunca mais utilizei ele.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 13, 2022, 11:52:18 PM",
      "body": "Quote from: alegotardo on July 13, 2022, 11:42:46 PMÉ... se realmente foi isso.Pela forma como foi ilustrado isso até parece um passo-a-passo simples de Musk para conseguir o que quer, mas tenho certeza que nos bastidores isso está sendo uma grandiosa partida de xadrez com jogadas demoradas e muito bem planejadas.Sinceramente me parece muito difícil saber quem possui a razão e quem irá dar o xeque-mate... muita notícia deve rolar ainda.Acho que o resultado vai ser simples: Musk compra o Twitter e o Twitter revela o numero de bots.Resta saber como reage o mercado, quando se souber de forma oficial, que o Twitter tem uma grande % de bots.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "July 14, 2022, 12:26:42 AM",
      "body": "Quote from: joker_josue on July 13, 2022, 11:52:18 PMResta saber como reage o mercado, quando se souber de forma oficial, que o Twitter tem uma grande % de bots.Se o Musk comprar o Twitter ele vai fechar o capital da empresa.Não haverá mais reação de mercado, pois não haverão mais ações do twitter negociadas em bolsa.https://economia.uol.com.br/noticias/redacao/2022/04/26/elon-musk-compra-twitter.htm",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 14, 2022, 06:59:03 AM",
      "body": "Quote from: bitmover on July 14, 2022, 12:26:42 AMSe o Musk comprar o Twitter ele vai fechar o capital da empresa.Não haverá mais reação de mercado, pois não haverão mais ações do twitter negociadas em bolsa.Sim, tens razão.Por acaso, quando escrevi \"mercado\", estava a pensar nos clientes reais do Twitter e não da bolsa.Usei mal a expressão...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "July 15, 2022, 01:24:45 AM",
      "body": "Quote from: bitmover on July 14, 2022, 12:26:42 AMSe o Musk comprar o Twitter ele vai fechar o capital da empresa.Não haverá mais reação de mercado, pois não haverão mais ações do twitter negociadas em bolsa.https://economia.uol.com.br/noticias/redacao/2022/04/26/elon-musk-compra-twitter.htmDesculpe minha ignorância, mas quais as regras de forma geral para se fechar o capital de uma empresa?Acredito que o passo fundamental seja ser acionista majoritário, mas além disso musk poderia forçar a compra das demais ações mesmo que alguém não queira vender? Quem define o preço dessas ações?Enfim, antes disso acontecer eu ainda creio que a briga Twitter x Musk deve durar algum tempo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 15, 2022, 06:44:00 AM",
      "body": "Quote from: alegotardo on July 15, 2022, 01:24:45 AMDesculpe minha ignorância, mas quais as regras de forma geral para se fechar o capital de uma empresa?Acredito que o passo fundamental seja ser acionista majoritário, mas além disso musk poderia forçar a compra das demais ações mesmo que alguém não queira vender? Quem define o preço dessas ações?Enfim, antes disso acontecer eu ainda creio que a briga Twitter x Musk deve durar algum tempo.Em primeiro lugar para uma OPA funcionar, ele tem de conseguir ficar com 51% da empresa. E neste momento o Musk já é o acionista com maior percentagem de ações do Twitter.Depois, da compra apenas tem de fazer uma reunião com os acionistas para aprovar a retirada da empresa da bolsa. Sendo o maior acionista, será uma decisão aprovada.Quando a empresa ficar fechada, todos os outros acionistas continua com a sua participação e podem a vender a quem quiserem, não vendem é na bolsa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "July 15, 2022, 01:03:48 PMLast edit: July 15, 2022, 01:14:11 PM by bitmover",
      "body": "Quote from: alegotardo on July 15, 2022, 01:24:45 AMDesculpe minha ignorância, mas quais as regras de forma geral para se fechar o capital de uma empresa?Acredito que o passo fundamental seja ser acionista majoritário, mas além disso musk poderia forçar a compra das demais ações mesmo que alguém não queira vender? Quem define o preço dessas ações?Enfim, antes disso acontecer eu ainda creio que a briga Twitter x Musk deve durar algum tempo.É simplesmente a compra das ações.http://www.ouropretoinvestimentos.com.br/blog/por-que-as-empresas-fecham-capital-e-saem-da-bolsa-de-valores/#:~:text=Como%20funciona%20o%20processo%20de,capital%20na%20bolsa%20de%20valores.QuoteComo funciona o processo de fechamento de capital?Assim como ocorre no IPO, o primeiro passo é a publicação do fato relevante ao mercado, falando sobre a realização da oferta pública de aquisição (OPA) e, consequentemente, o fechamento do capital na bolsa de valores.O acionista pequeno é obrigado a vender. Isso é decidido em assembleia.QuoteComo fica a situação dos acionistas dessas empresas?Após a publicação do edital de conclusão do processo de fechamento de capital, a empresa tem de 30 a 45 dias para realizar a OPA em um leilão na bolsa de valores.Caberá ao investidor se credenciar em uma corretora para representá-lo, concordando ou não com o fechamento de seu capital. Caso mais de 10% dos acionistas não concordem com o valor proposto no OPA, uma assembleia deve ser convocada para que seja discutida a precificação do ativo e que seja feita uma nova avaliação seja feita por outra empresa.Musk fez o acordo com os principais acionistas, comprou a maior parte das acoes e vai fechar o capital. Ele vai continuar sendo sócio da empresa (existirão sócios). Quote from: joker_josue on July 15, 2022, 06:44:00 AMEm primeiro lugar para uma OPA funcionar, ele tem de conseguir ficar com 51% da empresa. Eu acho que não é necessário que ninguem seja majoritárioUma empresa de 33%-33%-34% e não ter capital aberto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 15, 2022, 03:02:01 PM",
      "body": "Quote from: bitmover on July 15, 2022, 01:03:48 PMQuote from: joker_josue on July 15, 2022, 06:44:00 AMEm primeiro lugar para uma OPA funcionar, ele tem de conseguir ficar com 51% da empresa. Eu acho que não é necessário que ninguem seja majoritárioUma empresa de 33%-33%-34% e não ter capital aberto.Não é necessário para ter capital fechado.Mas para a OPA funcionar ele tem de ficar com a maioria das ações, ou que a maioria dos acionistas concordam com essa compra de ações.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 14, 2022, 09:25:45 AM",
      "body": "E os acionistas do Twitter continuam convencidos que vão conseguir vender o Twitter.Na reunião de ontem aprovaram a venda, pelo o valor inicialmente proposta. (fonte)Isto depois do Musk já ter dito que devido a demora da decisão e pela falta de transparência pelas informações solicitadas, não queria avançar com o negocio. Estando agora o assunto a ser tratado em tribunal.Será que só eu é que acho que estes acionistas estão a dar um tiro no pé, ao tentarem ganhar dinheiro, depois de terem feito asneira e não terem cumprido a sua parte do acordo?Continuo achar que em tribunal do Twitter perde.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}