{
  "id": "topic_5502953",
  "title": "ContentWriter",
  "author": "ContentWriter",
  "created_time": "July 14, 2024, 01:34:29 PM",
  "content": "When you hear words like \"HODL,\" \"HALVING,\" \"BULL RUN,\" you're left in no doubt that most members of the Bitcoin community like the cryptocurrency because of the prospect or hope that it could make them rich. I know it's made early adopters rich, but shouldn't there be other reasons to learn and use Bitcoin besides price fluctuations? Was this Satoshi's motive for the invention? Is price the most important driver of your interest in Bitcoin?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5502953",
  "comments": [
    {
      "author": "mindrust",
      "created_time": "July 14, 2024, 01:41:49 PM",
      "body": "I would say it is 50-50… The price action is half of the fun. The tech is the other half. Bitcoin is like a hobby which you would gladly do as a job. You are interested in the tech, and you are getting paid while holding. Best of the both worlds. I am pretty sure that is the case for many bitcoin holders. Some people obviously are not interested in the tech and only care for the prices but I don’t think they are the majority. They usually end up losing their coins too because they don’t understand the tech behind it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "July 14, 2024, 01:56:17 PM",
      "body": "Price is the first thing that caught my interest on Bitcoin because it promised huge potential to grow by the time I discover Bitcoin in early days.But now my perspective was already changed when my knowledge grow further especially in the use of Bitcoin for finance. You can’t move huge funds using bank without giving explanation to your bank about the purpose of your transfers and also there’s a limit on how much you can transfer in daily and monthly basis which you can’t experience on Bitcoin.Bitcoin provides real financial freedom in both price and its use.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "July 14, 2024, 02:16:28 PM",
      "body": "Quote from: ContentWriter on July 14, 2024, 01:34:29 PMIs price the most important driver of your interest in Bitcoin?Technical guys like early adopters of Bitcoin many years ago probably did cared more about technology and they started their adventure to decentralization with Bitcoin. For most of other adopters, they are more keen on chances to get profit in different stances like as investors, traders, speculators. They all do care about price of Bitcoin together with some different interests depends on who they are and what they want to do with Bitcoin and their money. Investors will have different interests than traders and speculators.Quote from: mindrust on July 14, 2024, 01:41:49 PMI would say it is 50-50… The price action is half of the fun. The tech is the other half.I am pretty sure that is the case for many bitcoin holders. Some people obviously are not interested in the tech and only care for the prices but I don’t think they are the majorityDo they have fun with price with different interests in technology and price or their portfolio?I believe price is important for both types of people because price reflects many things like adoption in the community and value of Bitcoin. Value should be low if technical developments to satisfy needs of community, users, tech guys are not good enough. So as technical enthusiasts, they can not simply look at Github development activities but also have to look at how latest developments are either adopted or refused by users.In another side of view, investors, traders, or speculators have to know that it's hard for price to move up a lot or make a parabolic curve if behind the scene, no developers are working and actually released upgrades for Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "July 14, 2024, 02:25:59 PM",
      "body": "Quote from: ContentWriter on July 14, 2024, 01:34:29 PMWhen you hear words like \"HODL,\" \"HALVING,\" \"BULL RUN,\" you're left in no doubt that most members of the Bitcoin community like the cryptocurrency because of the prospect or hope that it could make them rich. I know it's made early adopters rich, but shouldn't there be other reasons to learn and use Bitcoin besides price fluctuations? Was this Satoshi's motive for the invention?Aside from trading, store of value and investment, using it as a form of currency or actual or alternative payments is what satoshi has envisioned.Quote from: ContentWriter on July 14, 2024, 01:34:29 PMIs price the most important driver of your interest in Bitcoin?Can't deny about that. But during the early days, I wasn't really into its price but being on its infancy gave me an idea that there's a great future to it. The potential that everyone that was talking to about it was more than a craze of what we're seeing right now with the hypes that we have left and right. But unfortunately, I was one of the sellers before the 2021 bull run. I didn't sold all of my holdings but I can say that I am still fortunate to see its growth over the period of time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "July 14, 2024, 02:32:11 PM",
      "body": "Quote from: ContentWriter on July 14, 2024, 01:34:29 PMWhen you hear words like \"HODL,\" \"HALVING,\" \"BULL RUN,\" you're left in no doubt that most members of the Bitcoin community like the cryptocurrency because of the prospect or hope that it could make them rich. I know it's made early adopters rich, but shouldn't there be other reasons to learn and use Bitcoin besides price fluctuations? Was this Satoshi's motive for the invention? Is price the most important driver of your interest in Bitcoin?So you are asking what the fuck is BTC good for besides making money?Interesting question I would argue BTC has created or spurred the creation of:ZELLE Apple Pay Cash app",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "July 14, 2024, 02:48:11 PM",
      "body": "Today, Bitcoin is only useful as a meme speculation instrument, so yes, the only interesting thing about Bitcoin is the price. For all other purposes, there are far better products out there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legendbtc",
      "created_time": "July 14, 2024, 02:56:55 PM",
      "body": "Quote from: ContentWriter on July 14, 2024, 01:34:29 PMIs your interest in bitcoin primarily tied to its price?I'm fascinated by bitcoin's price rise, so it's safe to say that bitcoin's price and volatility were the biggest drivers of my interest in bitcoin in the early days. Even now, I'm still interested about bitcoin prices, because who doesn't like money, and profits? But when I participated in this market long enough and spent time learning about bitcoin, I gradually became conquered by it not only in terms of profits but also in terms of use cases. If you care about privacy and financial freedom, you will find its decentralized nature truly irresistible. That's why even though bitcoin is no longer volatile and profitable but still safe, I will still use it to a certain extent, even if not as much as now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aylabadia05",
      "created_time": "July 14, 2024, 03:02:51 PM",
      "body": "Quote from: ContentWriter on July 14, 2024, 01:34:29 PMWhen you hear words like \"HODL,\" \"HALVING,\" \"BULL RUN,\" you're left in no doubt that most members of the Bitcoin community like the cryptocurrency because of the prospect or hope that it could make them rich. I know it's made early adopters rich, but shouldn't there be other reasons to learn and use Bitcoin besides price fluctuations? Was this Satoshi's motive for the invention? Is price the most important driver of your interest in Bitcoin?Bitcoin is not a get-rich-quick scheme and it is not my reason for being interested in Bitcoin.The word HOLD refers to and is meant for people who own Bitcoin and use it as a long-term investment asset. The use of Bitcoin as an investment asset is a decision made by the person as the owner. Bitcoin, which was created by Satoshi, has made it clear in the white paper that Bitcoin is an electronic cash system that makes it easy for people to do without having to have an ATM card and other conveniences such as not requiring a third party to own their Bitcoin.It would be wrong to think that Satoshi’s motive behind his invention was solely about price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alone055",
      "created_time": "July 14, 2024, 03:04:21 PM",
      "body": "Quote from: ContentWriter on July 14, 2024, 01:34:29 PMWas this Satoshi's motive for the invention? Is price the most important driver of your interest in Bitcoin?For me, when I first came to know about Bitcoin, it's price wasn't very high, maybe around $500 or something, so I wouldn't say that its price was the most important driver of my interest towards it because I was more intrigued and surprised by its existence and what it had to offer.Before Bitcoin, I knew that we can store and use fiat currencies in their digital forms but Bitcoin was different and that was what made me interested in it.However, if we talk about the present, it wouldn't be wrong to say that most individuals or even firms are in it for the price action, they invest in it because they know it has the ability to grow in price over time and that can provide them good profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelockg",
      "created_time": "July 14, 2024, 03:07:06 PM",
      "body": "Quote from: ContentWriter on July 14, 2024, 01:34:29 PMWhen you hear words like \"HODL,\" \"HALVING,\" \"BULL RUN,\" you're left in no doubt that most members of the Bitcoin community like the cryptocurrency because of the prospect or hope that it could make them rich. I know it's made early adopters rich, but shouldn't there be other reasons to learn and use Bitcoin besides price fluctuations? Was this Satoshi's motive for the invention? Is price the most important driver of your interest in Bitcoin? unfortunately, people's ideas about Bitcoin has changed overtime and it's now more about what they expect Bitcoin price to get to in the coming days and not just having Bitcoin. The fact that earlier Bitcoin HODLers benefited from how bullish bitcoin became is one reason behind the speculation and desire that most people have while buying Bitcoin with the primary hope that it's going to make them richer in the future. Bitcoin has paved way for all the other crypto that equally has similar qualities like Bitcoin and the only thing we can build say Bitcoin has above almost all the other digital asset is that it value is far higher than them and when one intends HODling for the long term, Bitcoin gives HODLers a sense of comfort even while your intention is to HODL for 5 to 10 years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "July 14, 2024, 03:14:54 PM",
      "body": "Quote from: ContentWriter on July 14, 2024, 01:34:29 PM Was this Satoshi's motive for the invention?Satoshi created bitcoin in order to give people financial freedom from third-party being a middle man that you must pass through before sending or receiving funds. This was why he created bitcoin to be decentralized which used p2p payment method. He created bitcoin to be an alternative to fiat. He didn't know that bitcoin will become more valuable overtime. Quote from: ContentWriter on July 14, 2024, 01:34:29 PM Is price the most important driver of your interest in Bitcoin?To be honest with you, majority of people who are into bitcoin is because of the profit it brings after a very long period of time when you hodli, bitcoin is more of an investment than being a currency to people and that is why Institutions and government are buying bitcoin not because they like it but because of the profit it generates after a long period of time. ETFs and countries are doing the same.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "July 14, 2024, 03:45:40 PM",
      "body": "Quote from: ContentWriter on July 14, 2024, 01:34:29 PMWhen you hear words like \"HODL,\" \"HALVING,\" \"BULL RUN,\" you're left in no doubt that most members of the Bitcoin community like the cryptocurrency because of the prospect or hope that it could make them rich. I know it's made early adopters rich, but shouldn't there be other reasons to learn and use Bitcoin besides price fluctuations? Was this Satoshi's motive for the invention? Is price the most important driver of your interest in Bitcoin?Pertaining to mode of payment, I guess? If that's the case then it depends on your accessibility on this industry regarding your country's adoption of it. You cannot force them in the first place to accept it as a mode of payment if it is not yet widely accepted in your region which is why we cannot also blame other people who made use of it as an asset to take advantage of its volatile market price, and there's totally nothing wrong with it. We cannot extract the idea of volatility on Bitcoin and other cryptocurrencies simply because it is one of its trait. Rather than to not use it at all, it would obviously be better if you'd take advantage of this characteristic than to push your desires of using it with other things or ways such as mode of payment. At least for now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "July 14, 2024, 05:11:58 PM",
      "body": "Quote from: ContentWriter on July 14, 2024, 01:34:29 PM~My interest is not just in the price but also in the benefits. I like the concept of self-custody, even though it has it's risks.I like the ease with which you can move money to someone in another country.I like the opportunity it has presented.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "July 14, 2024, 05:19:17 PM",
      "body": "The fiat gains are just the beginning. Bitcoin is a deep rabbit hole. At first, you might be interested only in making a profit. Then, you worry it could be shut down by the government. Next, you might think it's too \"slow\" and expensive. You could even buy into FUD claims, such as it wasting energy or being a Ponzi scheme.If you continue exploring the rabbit hole, you'll discover more profound insights. At some point, you'll realize the entire financial system is fundamentally flawed. The problem isn't Bitcoin but the broader financial system, like how banking works. You'll then learn about Austrian economics and come across influential figures like Milton Friedman, F.A. Hayek, Ludwig von Mises, and Murray Rothbard. Good stuff. Reaching this understanding might be life-changing. You may adopt these ideas as a life philosophy, and that's when you become a Bitcoin maximalist.The rabbit hole is endless. A wet dream for anyone driven by curiosity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "July 14, 2024, 05:40:52 PM",
      "body": "Quote from: ContentWriter on July 14, 2024, 01:34:29 PMIs price the most important driver of your interest in Bitcoin?No, it's not... As someone who doesn't hodl, initially, the most important thing that pushed me toward its usage was its decentralized nature, but now I have to say the different layers of security that I could have based on my setup are the most interesting things for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptosize",
      "created_time": "July 14, 2024, 06:13:06 PM",
      "body": "Bitcoin is something bigger, it's a perfect match for renewable energy (Net Zero @ 2050) and AI (it will micromanage the grid):https://www.instagram.com/worldeconomicforum/reel/C35FfRytPtJ/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HideYourKeys",
      "created_time": "July 14, 2024, 06:13:54 PM",
      "body": "Not at all, price it is a factor, indeed, but I crave for the revolution that comes behind it. If we ever reach a Bitcoin standard, the theft from the institutions, nation states and governments to all citizen will be greatly reduced. I want the power back to the citizenship",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bangjoe",
      "created_time": "July 14, 2024, 08:06:05 PM",
      "body": "Quote from: ContentWriter on July 14, 2024, 01:34:29 PMWhen you hear words like \"HODL,\" \"HALVING,\" \"BULL RUN,\" you're left in no doubt that most members of the Bitcoin community like the cryptocurrency because of the prospect or hope that it could make them rich. I know it's made early adopters rich, but shouldn't there be other reasons to learn and use Bitcoin besides price fluctuations? Was this Satoshi's motive for the invention? Is price the most important driver of your interest in Bitcoin?Some thoughts may be from the average have such thoughts for a fortune and seek profit from fluctuations in the price of bitcoin but I do not have an analysis of Satoshi's goal for that, nothing in the bitcoin white paper is found, seeking profit on the price is a result of the development of bitcoin itself whose supply is limited which causes a price increase due to a lot of demand, I do not think that kind of motive for Satoshi.I have another reason besides that, which is to maintain the value of the money I get from my work from the cruel inflation that continuously every year eats my money, and it is quite painful for me who always saves money for my old age.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "July 14, 2024, 08:15:45 PM",
      "body": "Quote from: Frankolala on July 14, 2024, 03:14:54 PMSatoshi created bitcoin in order to give people financial freedom from third-party being a middle man that you must pass through before sending or receiving funds. This was why he created bitcoin to be decentralized which used p2p payment method. He created bitcoin to be an alternative to fiat. He didn't know that bitcoin will become more valuable overtime. False. Bitcoin was not created to replace sovereign currencies or it would never have been designed with the massive limitations it has. Bitcoin couldn't ever handled even 0.001% of the world's daily transactions and it's getting even slower and more expensive as time goes on.Indeed, as far as the \"middle man\" goes, Bitcoin is one of the slowest and most expensive in the world right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}