{
  "id": "topic_5493828",
  "title": "Bitwave01",
  "author": "Bitwave01",
  "created_time": "April 22, 2024, 10:49:41 PM",
  "content": "I was panicking when I had of the upcoming bitcoin Halving because I wasn't well educated about the halving and I read about it through online resources, still I wasn't okay, so I just relax to experience the fort bitcoin Halving as they say and after the bitcoin Halving I didn't really see a significant change apart from a little drop in price! I was happy that the halving has come and gone. Today i was just analyzing the chart and it looks like #Bitcoin is about to print new highs! I was smiling and not quiet long I carried out a transaction, I did not believe my eyes, I was devastated, the whole of my bitcoin was gone for transaction fee.And I began to wonder is this what the Bitcoin Halving is all about???",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5493828",
  "comments": [
    {
      "author": "Hatchy",
      "created_time": "April 22, 2024, 10:57:03 PM",
      "body": "Quote from: Bitwave01 on April 22, 2024, 10:49:41 PMAnd I began to wonder is this what the Bitcoin Halving is all about???If that's what you choose to believe, then it's on you. I really don't know why so many investors thinks that the halving will just magically push Bitcoins price to the moon. I think investors who has this mind set are those who really don't understand Bitcoin and it's past halving. Yes a lot of us were excited about the halving, which of cause from past halvings event, Bitcoins price is followed by a new breakthrough in its movement. But did this Happen immediately after the past halving? Nope. If you check properly, it literally took months before Bitcoins price made a significant movement from its past halvings. So why all these pressure now? Though the increase in fees wasn't expected as much but if you compare it to what it was during when the last 84000 block was mined, you'll notice it's gradually going back. It will take a little time though but it will.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitwave01",
      "created_time": "April 22, 2024, 11:06:08 PM",
      "body": "Quote from: Hatchy on April 22, 2024, 10:57:03 PMQuote from: Bitwave01 on April 22, 2024, 10:49:41 PMAnd I began to wonder is this what the Bitcoin Halving is all about???If that's what you choose to believe, then it's on you. I really don't know why so many investors thinks that the halving will just magically push Bitcoins price to the moon. I think investors who has this mind set are those who really don't understand Bitcoin and it's past halving. Yes a lot of us were excited about the halving, which of cause from past halvings event, Bitcoins price is followed by a new breakthrough in its movement. But did this Happen immediately after the past halving? Nope. If you check properly, it literally took months before Bitcoins price made a significant movement from its past halvings. So why all these pressure now? Though the increase in fees wasn't expected as much but if you compare it to what it was during when the last 84000 block was mined, you'll notice it's gradually going back. It will take a little time though but it will.I understand everything you said but what I don't understand is the transaction fee they are now charging, I lost a lot from a single transaction 😭😭",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "April 22, 2024, 11:11:17 PM",
      "body": "Quote from: Bitwave01 on April 22, 2024, 11:06:08 PMI understand everything you said but what I don't understand is the transaction fee they are now charging, I lost a lot from a single transaction 😭😭In short, the very high transaction fees right now is due to the congestion of the mempool. So in order to have your transaction get confirmed in the next few blocks, you will have to pay very high fees.Unfortunately, during the halving. A certain group of individuals decided to introduce a certain pointless protocol known as Runes which is leading to the spamming of the network leading to very high fees for normal transactionsUnder normal circumstances, things would have been fine but right now we are faced with that problem of inscriptions (Runes and ordinals)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "South Park",
      "created_time": "April 22, 2024, 11:16:53 PM",
      "body": "Quote from: Bitwave01 on April 22, 2024, 11:06:08 PMQuote from: Hatchy on April 22, 2024, 10:57:03 PMQuote from: Bitwave01 on April 22, 2024, 10:49:41 PMAnd I began to wonder is this what the Bitcoin Halving is all about???If that's what you choose to believe, then it's on you. I really don't know why so many investors thinks that the halving will just magically push Bitcoins price to the moon. I think investors who has this mind set are those who really don't understand Bitcoin and it's past halving. Yes a lot of us were excited about the halving, which of cause from past halvings event, Bitcoins price is followed by a new breakthrough in its movement. But did this Happen immediately after the past halving? Nope. If you check properly, it literally took months before Bitcoins price made a significant movement from its past halvings. So why all these pressure now? Though the increase in fees wasn't expected as much but if you compare it to what it was during when the last 84000 block was mined, you'll notice it's gradually going back. It will take a little time though but it will.I understand everything you said but what I don't understand is the transaction fee they are now charging, I lost a lot from a single transaction 😭😭Whenever you are engaging in a new activity you need to research a little bit to understand more about it, if you have done so you would have known there are some dumb people out there which wanted to get their transactions into the block in which the halving took place to create useless collectibles and sell them for a profit, and there were so many people doing it, that it caused the fees to skyrocket, so if you had to do a transaction you should have done it before or after the halving to avoid the congestion and the high fees caused by those people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "April 22, 2024, 11:19:03 PM",
      "body": "Quote from: Bitwave01 on April 22, 2024, 10:49:41 PMToday i was just analyzing the chart and it looks like #Bitcoin is about to print new highs! I was smiling and not quiet long I carried out a transaction, I did not believe my eyes, I was devastated, the whole of my bitcoin was gone for transaction fee.And I began to wonder is this what the Bitcoin Halving is all about???Nope, that's not halving is all about. Just like the other concerns about the fees on other networks, the bitcoin blockchain is experiencing some kind of spam or attack from the runes that have been making the demand higher so the price reflects on it.This isn't the first time that it did happened, way back on 2017 EOY it also happened and last time early this year, it happened due to BRC20 and ordinals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "April 22, 2024, 11:25:43 PM",
      "body": "Quote from: Bitwave01 on April 22, 2024, 10:49:41 PMAnd I began to wonder is this what the Bitcoin Halving is all about???Of course not it is simply one of the many consequences brought by the halving event itself. The reward for mining blocks have reduced down to half. This is to control the supply entering the market at a time. It is good to fight inflation and it drives up demand even more. The halving event’s impact can not only be seen in one day or one week. It stretches out for months even years so anything you see right now as a consequence isn’t the end of it all. Some of them even bitcoin’s price is temporary.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "April 23, 2024, 12:29:31 AM",
      "body": "Quote from: Bitwave01 on April 22, 2024, 10:49:41 PMI was panicking when I had of the upcoming bitcoin Halving because I wasn't well educated about the halving and I read about it through online resources, still I wasn't okay, so I just relax to experience the fort bitcoin Halving as they say and after the bitcoin Halving I didn't really see a significant change apart from a little drop in price! I was happy that the halving has come and gone. Today i was just analyzing the chart and it looks like #Bitcoin is about to print new highs! I was smiling and not quiet long I carried out a transaction, I did not believe my eyes, I was devastated, the whole of my bitcoin was gone for transaction fee.And I began to wonder is this what the Bitcoin Halving is all about???The demand will go up because supply is dwindling, basic law of supply and demand. And it's good that you have experience your first halving, some of us here are very excited when we see it the first time. But the thing is that the transaction fees are so high because there are some individuals who want their inscriptions on the particular block (but that is another day for discussion). So with that, I will just advise you to HODL and not sell because of the high transaction fees, if you can then still accumulate as much as you can and wait till we reach the top price or what we call all time high (ATH).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "April 23, 2024, 02:03:04 AM",
      "body": "Quote from: Bitwave01 on April 22, 2024, 10:49:41 PMafter the bitcoin Halving I didn't really see a significant change apart from a little drop in price!And I began to wonder is this what the Bitcoin Halving is all about???Halving is event for Bitcoin subsidy drops (halves) a half of its previous block or more accurately of 210,000 previous blocks. Two halvings are 210,000 separately with each other.If you think a halving, a half of block subsidy, will cause price to rise 100% after one block or one day, one week after a halving block, you think wrongly about halving effects.It only creates more scarcity with less new bitcoins from future blocks but it takes people time like some months to realize this. Especially people who are exposed with Bitcoin news very first time in this bull run, they will not quickly make decisions and spend money to buy bitcoins. They need some months to decide and when new capital flows from these people come to this market, price will rise.Panic because price didn't rise or double after a halving, funny panic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YUriy1991",
      "created_time": "April 23, 2024, 03:02:50 AM",
      "body": "Quote from: BlackBoss_ on April 23, 2024, 02:03:04 AMHalving is event for Bitcoin subsidy drops (halves) a half of its previous block or more accurately of 210,000 previous blocks. Two halvings are 210,000 separately with each other.If you think a halving, a half of block subsidy, will cause price to rise 100% after one block or one day, one week after a halving block, you think wrongly about halving effects.I think OP wants to know the real halving moment for whom and when it is our turn to feel the positive moment now or have to wait how many months are left for the right time to buy BTC.Quote from: Bitwave01 on April 22, 2024, 10:49:41 PMToday i was just analyzing the chart and it looks like #Bitcoin is about to print new highs! I was smiling and not quiet long I carried out a transaction, I did not believe my eyes, I was devastated, the whole of my bitcoin was gone for transaction fee.Actually, OP must see the moment and check before making a transaction how much fee you have to pay, if it is expensive do not force it and wait until normal conditions and anyway you will not lose if you want to wait for a few days unless there is the most urgent need so you have to do it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "April 23, 2024, 03:06:28 AM",
      "body": "The fees of the network are getting high because of the investors and creators who are minting runes on the network. As a Bitcoin investor one should have proper knowledge about it and its network. I suggest you to look for Bitcoin network transactions fees at mempool.space before making any transactions.The halving event was just an event which cut the reward per block to half and it has nothing to do with the transaction fees directly. The protocol that allowed rune creators to mint runes is the main cause of those high fees that we have right now.Next time when you want to invest in Bitcoin then you should learn more about the transaction fees before investing money in it. It's always preferable to wait for low transaction fees if your main goal is investing and holding of that investment. A DCA strategy with dip buying could also be helpful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BALIK",
      "created_time": "April 23, 2024, 03:50:04 AM",
      "body": "Quote from: Bitwave01 on April 22, 2024, 10:49:41 PMI was panicking when I had of the upcoming bitcoin Halving because I wasn't well educated about the halving and I read about it through online resources, still I wasn't okay, so I just relax to experience the fort bitcoin Halving as they say and after the bitcoin Halving I didn't really see a significant change apart from a little drop in price! I was happy that the halving has come and gone. Today i was just analyzing the chart and it looks like #Bitcoin is about to print new highs! I was smiling and not quiet long I carried out a transaction, I did not believe my eyes, I was devastated, the whole of my bitcoin was gone for transaction fee.And I began to wonder is this what the Bitcoin Halving is all about???If you have learned about bitcoin and halving using online resources, I think you also know that the sudden increase in transaction fees has nothing to do with halving and it is not caused by halving. Regarding the reason for the sudden increase in transaction fees, you should learn more and on the forum there are many topics about this issue. This is one of the risks when someone joins bitcoin hastily and without understanding, if you spend a lot of time learning about bitcoint before investing you will not panic. Surely you like many other newbies, are looking forward to a price increase after the halving, I hope you will not continue to be disappointed or complain if bitcoin does not increase in the coming days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "April 23, 2024, 04:02:45 AM",
      "body": "The halving has nothing to do with the change in transaction fees. What happened was something called Runes protocol was activated on the same halving block.Similar to Ordinals people wanted to get their transaction in and they spammed the blockchain and the fees spiked to like 1500 sats/vbyte. It was bad, basically $150 for a simple transaction.It’s come down since then, now it’s at like 150 sats and the cost is around $10-15 or so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slaman29",
      "created_time": "April 23, 2024, 04:09:46 AM",
      "body": "Gosh it's been a while since I read some fake story that just sounds and looks ridiculous lolInstead of spending all that time analyzing charts OP maybe you should start analyzing wallets so you know about transaction fees. I'm just so curious not that you will answer but have you been doing trading all this while and only have what, $50 of BTC to trade?I mean, you said it's all gone for fees so that must be the max you have",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Popkon6",
      "created_time": "April 23, 2024, 06:26:31 AM",
      "body": "We should pay more attention to bitcoin transaction fees than bitcoin halving at present. Basically Bitcoin halving is a four-year cycle held by Bitcoin price peak. But we have seen the highest transaction fees for Bitcoin transactions targeting this hard, have you ever experienced this transaction. Those who are unable to transact for this transaction fee are the ones who mainly feel it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SilverCryptoBullet",
      "created_time": "April 23, 2024, 10:39:19 AM",
      "body": "Quote from: adaseb on April 23, 2024, 04:02:45 AMThe halving has nothing to do with the change in transaction fees. What happened was something called Runes protocol was activated on the same halving block.I believe it is not coincidence that Runes team planned to launch their project at Bitcoin halving block. I believe they did planned the launch time to spam Bitcoin network and mempools to make as biggest noise as possible. If they launch their project and minting previously or later, it will make less noise so they just chose a most noticeable block and time to do that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "April 23, 2024, 11:01:26 AM",
      "body": "Bitcoin, with all its awesomeness!, has some shortcomings and flaws too. One of those is its vulnerability to spam attacks that can create congestion and cause fee spikes. That \"shortcoming\" exists because there is a finite amount of space available in each block but there can be virtually infinite number of transactions competing for that space.A while ago, someone found another exploit in the protocol which allowed them to inject an arbitrary message into each block with an arbitrary size. Then they created a scam known as Ordinals where they sold those messages to newbies who didn't understand what \"token\" really means. That scam market picked up a lot of gamblers who then participated in creating a lot of such messages exploiting the protocol and effectively spamming the network.This recent fee spike is the result of that ongoing spam attack.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Belarge",
      "created_time": "April 28, 2024, 06:57:46 AM",
      "body": "Quote from: Popkon6 on April 23, 2024, 06:26:31 AMWe should pay more attention to bitcoin transaction fees than bitcoin halving at present. Basically Bitcoin halving is a four-year cycle held by Bitcoin price peak. But we have seen the highest transaction fees for Bitcoin transactions targeting this hard, have you ever experienced this transaction. Those who are unable to transact for this transaction fee are the ones who mainly feel it.Its mainly a gradual process to understand the system and not some random rush pattern. We get upset whenever our goals are not hitting the top standards of the system, just calm and achieving our worth. Bitcoin halving was merely overhyped and watching how everything play was out of line. We know bitcoin halving to be one of the crucial incident but we should also that its basically our phase to comprehend the system and understand how everything will pan out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YUriy1991",
      "created_time": "April 28, 2024, 07:10:02 AM",
      "body": "Quote from: BALIK on April 23, 2024, 03:50:04 AMThis is one of the risks when someone joins bitcoin hastily and without understanding, if you spend a lot of time learning about bitcoint before investing you will not panic. Surely you like many other newbies, are looking forward to a price increase after the halving, I hope you will not continue to be disappointed or complain if bitcoin does not increase in the coming days.I think it's okay, so OP will understand it more and more especially having experienced it himself and at least it will be a pretty strong reminder because everyone at the beginning was also still a little fumbling especially the reference sources that were studied and found are still online, especially during current conditions.The OP has started out to be one of the parts that realize that BTC is a very and reliable asset to own and invest in. Continue to buy and increase your BTC coffers OP and you will reap the rewards in the future very decently.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "April 28, 2024, 09:08:13 AM",
      "body": "Quote from: Bitwave01 on April 22, 2024, 10:49:41 PMI was panicking when I had of the upcoming bitcoin Halving because I wasn't well educated about the halving and I read about it through online resources, still I wasn't okay, so I just relax to experience the fort bitcoin Halving as they sayWhy panic about halving if it happens every 4 years and is an integral part of the BTC-system? Also, this event is inevitable and is “hardwired” into the bitcoin program code. No one can influence this or make changes, but only take it for granted in the work of bitcoin.Quote from: Bitwave01 on April 22, 2024, 10:49:41 PMand after the bitcoin Halving I didn't really see a significant change apart from a little drop in price! I was happy that the halving has come and gone. How has there been no change? But what about the halving (x2) of the reward for the mined block? Or did you want the halving to immediately affect the current value of bitcoin, the price of which will skyrocket immediately? This doesn't happen overnight and positive factors must accumulate to lead to explosive demand for this asset.Quote from: Bitwave01 on April 22, 2024, 10:49:41 PMToday i was just analyzing the chart and it looks like #Bitcoin is about to print new highs! I was smiling and not quiet long I carried out a transaction, I did not believe my eyes, I was devastated, the whole of my bitcoin was gone for transaction fee.And without any analysis of the charts, it is clear that during this year bitcoin will reach new highs (if force majeure circumstances don't arise) as happened before.Quote from: Bitwave01 on April 22, 2024, 10:49:41 PMAnd I began to wonder is this what the Bitcoin Halving is all about???I described the essence of the BTC-halving (briefly) above.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}