{
  "id": "topic_5447398",
  "title": "Davidvictorson",
  "author": "Davidvictorson",
  "created_time": "April 03, 2023, 01:42:09 PM",
  "content": "I hope you find this article1 as useful as I did. We are all have dependent parents or elders in our household. Most of them  may be retired and depend on their pension(which doesn't come often), some may even have a small shop just to keep active(which doesn't bring in enough cash to cater for their needs), some may have one form of medical needs or the other(and we know how important this is).We know that one thing that may bother most of us is how we will be able to cater for their financial needs, their access to quality healthcare, provision of some sort of emotional support to them, and help them to engage in activities that make them happy.Here are some tips1. Get them a health insuranceThere is a National Health Insurance Scheme and I believe there are also helath insurance schemes in the states too. And the fee to buy one for them that will get them access to quality healthcare is as low as N50,000.2. Put them on monthly allowanceWe already how important this is. Have you budget every month and set aside a fixed amount for monthly allowance for them. Personally, I am of the opinion that it doesn't need to be monthly. It may be weekly, biweekly etc. Just give them something every week.(If you dey give your girlfriend money but your mama/papa dey village or house dey suffer because you nor dey give am shimgbam, you dey craze.)3. Open a bank account for themIf your parents or elderly dependents do not have a bank account, please open for them. Do not rely on sending money to them through someone becasue no matter how much trust you have for the person, the person may one day take some portion out to solve their own family need. If your parents have their own account, you will rest assured that no one will tamper with it.4. Put them on a special call planWe know how chatty are parents get when they start getting old. Maybe due to loneliness and boredom. To tackle this, put them on a cheap call plan so that they can call you or any of you siblings or their friends and talk for as long as they want.5. Provide EntertainmentIf you can buy them a TV set and a DSTV or GoTV decoder. Get them a generator too. This will ensure that they can find something to keep themselves entertained whenever they get bored. My grandma who doesn't understand English loves English Soap Operas. I often wonder how she stays glue to the screen when she doesn't understand a word.6 Help them set up something they love doingSome parents may love gardening. Find a small acre of land that they can grow vegetables of whatever appeals to them. Some may love to sow, get them a sowing machine, if they already have but are lacking some tools, get it for them.Suggest some other ways you can cater financially for you parents or elderly dependents.1. https://nairametrics.com/2023/04/02/financial-tips-for-catering-for-dependent-parents/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447398",
  "comments": [
    {
      "author": "Merit.s",
      "created_time": "April 03, 2023, 04:56:13 PM",
      "body": "Bros,everything na confirmento. Taking care of our parents is the best thing that you can do for them now that they are alive. No be when dem don die you go come throw big party for their burial. Some of us mama dey suffer but we dey carry big big money dey give our boyfriends and girlfriends,wey we fit no even marry tomorrow. This na the major problem wey some of the youths dey do,forget say parent na parent and say God go bless you the more when you carter for their responsibilities because they are weak like small children in terms of meeting up with their demands due to old age. OP, make God bless you,because this topic go help put some of us mind for our parents wey need our assistant.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "April 04, 2023, 12:43:10 PM",
      "body": "Quote from: Davidvictorson on April 03, 2023, 01:42:09 PMI hope you find this article1 as useful as I did. We are all have dependent parents or elders in our household. Most of them  may be retired and depend on their pension(which doesn't come often), some may even have a small shop just to keep active(which doesn't bring in enough cash to cater for their needs), some may have one form of medical needs or the other(and we know how important this is).We know that one thing that may bother most of us is how we will be able to cater for their financial needs, their access to quality healthcare, provision of some sort of emotional support to them, and help them to engage in activities that make them happy.Our parents don too try for us for this life and them deserve more than all these things you mentioned.We no fit pay dem all the sacrifice wey dem do for us back because na dem help us determine our future, come still support us to make sure say we don reach where we de go for this life, na dem also make sure say we get better home training which is what make us responsible till date.Our prayer be say, may their labor not be in vain, and make God provide for us so that we can take care of them at this stage because they really need our help and support for the rest of their lifetime.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomiles1",
      "created_time": "April 04, 2023, 09:26:20 PM",
      "body": "All this things you list here really correct but somehow e dey bleed my mind say me no get any of these people to do all these things u write but as a man I be like this I grow up in hard way from persons to person without good parenting and e dey vex like mad. Na just God carry me put here and I no get any wey me for dey plan all these things but believe or not, I go try make all of these for my family so that dem go live a comfortable life rather than that of others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "April 04, 2023, 11:39:18 PM",
      "body": "I agree with everything you have said, only thing I will add is that you should register them for gym to keep their mind and body strong. Thankfully we don’t have a culture of discarding our parents to retirement homes for strangers to take care of them. We care for our parents ourselves like they did for us from childhood to adulthood. My granddad died of stroke, he lived with us and when his illness started, he had his family by his side till he passed on. I think it’s important to keep our elderly ones busy with light activities so they don’t get bored and think of silly things that can increase their blood pressure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "April 05, 2023, 06:23:19 AM",
      "body": "Our parents did a lot for us while growing up for those of us who have sacrificial parents, I feel that our generosity should know only be shown to her parents when they are dependent but also to our parents who are independent and still financially stable. Your parents do not need to be dependent on you for you to show them love, you can also show your independence parents love by helping to offset some of their bills as well as some other little things on the list.- Buy them gifts.- Buy them Travel holiday tickets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "April 05, 2023, 08:52:58 PM",
      "body": "You don talk am finish. Which other thing wey person fit add again. And to just to pray for make God keep our parents for us and open financial door for us. Seriously, our parents needs all the best things life can offer from us. Taking care of them suppose be our main priority cos that's how the sacrifice for us to get where we are today. Returning back the favor no be bad thing. Na why we d pray sae make God put peso in good position to care of our parents cos without them I wonder where we for dey so. Na why I d pray day in, day out sae make Oluwa butter my bread so that I go be able to provide wetin you don mention above",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "April 05, 2023, 10:22:22 PM",
      "body": "Although it depends on how old those parents are, because I grew up with my grandparents, I know the kind of scolding I received then, and I just realized that if a person is not really determined, they may not be able to endure the torture of old people. Well, I think they should have house help hired for them. Since they are dependent, they may need someone to run some errands for them, and if they have a house helper, that will be a good thing as well.My grandma is partially educated, and she loves going on Facebook to read posts and watch some funny videos, as well as to see the posts of his children. I have been teaching her how to successfully subscribe for mobile data plan for herself, but she has not yet understood how to do it herself, so I also suggested that we place them on a monthly or weekly data plan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "April 05, 2023, 11:00:31 PM",
      "body": "All of your suggestions are very useful and appropriate; they will go a long way toward ensuring that our elderly relatives have a comfortable life. They get something I'd like to add to your third tip of \"opening a bank account for them\" to avoid having their money tampered with by relatives or close people assigned to give them money. Even if they have accounts and are unable to read or write (assuming they did not receive a formal education), which is likely, they can still temper with their money by sending relatives who know how to withdraw to assist them. The bottom line is that we should have relatives we can trust to handle financial issues related to catering for our parents and elderly ones. This will help reduce the case of theft as it sometimes use to be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "April 08, 2023, 02:27:33 AM",
      "body": "Quote from: Davidvictorson on April 03, 2023, 01:42:09 PMI hope you find this article1 as useful as I did. We are all have dependent parents or elders in our household. Most of them  may be retired and depend on their pension(which doesn't come often), some may even have a small shop just to keep active(which doesn't bring in enough cash to cater for their needs), some may have one form of medical needs or the other(and we know how important this is. Make una no vex oh all this plans nobi who get money go run them all, what about person wey no come get money how him go take, take care of him parents. I believe the best taking care of has to be been there for them. If you dun make small money build house, you fit move your parents from the village come city make them just dey one side for your house like boys quarter that's if you no get better money to run this package wey una dun mention. Parents like been taken care of, giving them your time pass all this oyinbo things wey una dey talk.You see making their grandchildren available to them, like make dem dey see them regularly go make them happy and better pass all this holiday talks. We Nigerian no dey dey dread those oyinbo activities them. Ask your parents now if them wan travel around the world or get their grandchildren with them 24/7 and see which one wey dem go choose. Shall anyhow e be provided our parents dey happy e goes well and make God provide us with better resources to use give both our family and parents an enjoyable life wey dem deserve.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "April 08, 2023, 05:46:16 AM",
      "body": "This one na valid points wey u raise on how to take good care of our aged parents. Sometimes if I see how worried parents dey wen their kids no well or wen food no dey for house, I go dey ask myself say naso my parents suffer for me. Dis na people wey don give their lives for us and e go good make wey take good care of dem. I go like support wetin Brainboss talk, say for some of us wey get houses for cities e go good make we bring dem over come stay wit us because if dem dey around family and dey see their loved ones on a daily basis e go dey give dem so much joy and you on the other hand go fit monitor their health and give dem everything they want.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "martyns",
      "created_time": "April 10, 2023, 09:24:30 PM",
      "body": "Quote from: Cryptomiles1 on April 04, 2023, 09:26:20 PMAll this things you list here really correct but somehow e dey bleed my mind say me no get any of these people to do all these things u write but as a man I be like this I grow up in hard way from persons to person without good parenting and e dey vex like mad. Na just God carry me put here and I no get any wey me for dey plan all these things but believe or not, I go try make all of these for my family so that dem go live a comfortable life rather than that of others.Omoh,sorry say people wey you go do those things for no dey again,not everybody dey fortunate to get mama and papa wey still dey alive till now,so many person's don loose their parents based on one or two wahala wey happen.It is bad when you get small money to spend and you no get any parent wey go fit  enjoy your money,e go even pain you when you dey wastam on other people wey no even deserve the money sef.Some person's like me dey wait to dey financially balanced before I go start to dey do all those things for my parents wey don try so hard for me to make sure say I still dey alright reach now.We still get parents wey no dey reason their children Matta despite how their children dey try show them say if them invest in them,them go dey very reasonable tomorrow.I for talk say if money dey,make we just try dey show our parents some love,because e no easy to born pikin come trainam join.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomiles1",
      "created_time": "April 10, 2023, 10:18:26 PM",
      "body": "Quote from: martyns on April 10, 2023, 09:24:30 PMQuote from: Cryptomiles1 on April 04, 2023, 09:26:20 PMAll this things you list here really correct but somehow e dey bleed my mind say me no get any of these people to do all these things u write but as a man I be like this I grow up in hard way from persons to person without good parenting and e dey vex like mad. Na just God carry me put here and I no get any wey me for dey plan all these things but believe or not, I go try make all of these for my family so that dem go live a comfortable life rather than that of others.Omoh,sorry say people wey you go do those things for no dey again,not everybody dey fortunate to get mama and papa wey still dey alive till now,so many person's don loose their parents based on one or two wahala wey happen.It is bad when you get small money to spend and you no get any parent wey go fit  enjoy your money,e go even pain you when you dey wastam on other people wey no even deserve the money sef.Some person's like me dey wait to dey financially balanced before I go start to dey do all those things for my parents wey don try so hard for me to make sure say I still dey alright reach now.We still get parents wey no dey reason their children Matta despite how their children dey try show them say if them invest in them,them go dey very reasonable tomorrow.I for talk say if money dey,make we just try dey show our parents some love,because e no easy to born pikin come trainam join.I understand e no easy though but normally I don already dey use to am so anything man dey do na one man standing so need to say sorry or even sympathize with me because dat one don be e don be like that, na way forward man dey reason for him head and wetin go for put food for we table naim really matta pass anything, every oda tin secondary.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}