{
  "id": "topic_5405248",
  "title": "DdmrDdmr",
  "author": "DdmrDdmr",
  "created_time": "July 05, 2022, 09:43:50 AM",
  "content": "250 asistentes de todas las edades celebraron en un parque natural de Avon Valley (UK) una jornada familiar peculiar con temática Bitcoin, entremezclando actividades lúdicas y de contacto con los animales y la naturaleza, con charlas sobre bitcoin, amenizadas con juegos y bares con temática bitcoin.Tambien hubo música con temática bitcoin, aunque quizás es buscar encajarla con calzador (letra del estilo de \"Bitcoin es la máquina del amor\" …).Me quedo con una frase curiosa del artículo a modo de anéctota:QuoteMejor aún, el \"maximalismo tóxico\" de Bitcoin estuvo ausente.El entrecomillado desconozco si era un reclamo o una conclusión a posteriori.Ver: https://es.cointelegraph.com/news/the-uk-bitcoin-adventure-shows-btc-is-a-family-affair",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405248",
  "comments": [
    {
      "author": "Porfirii",
      "created_time": "July 09, 2022, 06:36:58 PM",
      "body": "Oye, pues qué rollo más flower power parece que se traían, ya podíamos montar aquí también este tipo de cosillas. Lo de los maximalistas tóxicos también me ha gustado, ya he declarado alguna vez que no son tanto de mi devoción (ningún radicalismo).Pareciera quizá que lo hayan hecho con una visión un tanto utópica, dentro de un entorno de aplastante realismo como en el que solemos vivir quizá sea una buena terapia para el \"alma\", si no también para el bolsillo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "July 10, 2022, 03:59:28 PM",
      "body": "Creo que es una gran iniciativa, ya me gustaría ver eventos como este en mi país, sin embargo pienso que aceptar bitcoins como método de pago para las actividades no es tan conveniente debido a los fees. Yo hubiera optado por otras monedas como Doge coin o LTC. Pero insisto en que la iniciativa es muy buena.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "July 10, 2022, 04:36:06 PM",
      "body": "Incluso con Lightning Network no lo ves viable para pagar por las actividades? Por otro lado, sé que no es indicativo de nada porque varían enormemente, pero hace un par de días pagué unos 6 céntimos por una transacción que se confirmó en seguida...No sé, en un entorno distendido como este no me importaría pagar un poco más.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "July 11, 2022, 08:05:29 AM",
      "body": "Quote from: Porfirii on July 10, 2022, 04:36:06 PMIncluso con Lightning Network no lo ves viable para pagar por las actividades? <…>No lo cité en el OP, pero parte de las jornadas tuvieron su vertiente lightning. El artículo cita como para algunos partícipes, el evento supuso su pérdida de virginidad con la Lightning Network (tal cual …). Los bares aceptaban pagos en LN por ejemplo.De hecho, hay un video del evento en el cual una usuaria realiza su pago mediante su Bolt Card con NFC, una solución apta para el más tradicionalista de las tarjetas y sin esfuerzos técnicos (en el pago por lo menos).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "July 11, 2022, 05:45:20 PM",
      "body": "Quote from: seoincorporation on July 10, 2022, 03:59:28 PM...Yo hubiera optado por otras monedas como Doge coin o LTC. Pero insisto en que la iniciativa es muy buena. Supongo que en terminos de fees y velocidad de transacción, ciertamente Dogecoin tiene sus ventajas. Pero aún así creo que es un acierto hacer un evento de este tipo con Bitcoin como protagonista en lugar de Dogecoin, por motivos de integridad de inversión y por las criticas que muchos pueden tener a la existencia de una moneda meme como activo de inversión, no son pocos que consideran Dogecoin una sh*tcoin...Aunque a diferencia de Bitcoin, Doge tambien tiene la ventaja de que es más fácil diseñar una atracción family friendly de un perro japones que una attración de una BTC. Finalmente, la educación de la tecnología blockchain, el funcionamiento básico de las transacciones y el manejo de las llaves privadas debería ser el protagonista de este tipo de eventos. Si educamos a los usuarios venideros podríamos ahorrarles la mala experiencia de ser victimas de una estafa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "July 12, 2022, 03:04:02 PM",
      "body": "En Octubre de este año celebrarán un par de jornadas de bitcoin en Edinburgo, ya con otro perfil menos lúdico y familiar, aunque dicen que con una fuerte componente didáctica. En su organización, cuentan con la colaboración (y supongo patrocinio) de un Exchange(OKX).Por cierto, que el lugar del enclave ha pegado un estirón desde que lo vi por última vez (ver las imágenes en el artículo referenciado, ante de que las cambien ...).Ver: https://es.cointelegraph.com/news/the-uk-s-largest-bitcoin-conference-comes-to-scotland",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}