{
  "id": "topic_5456721",
  "title": "mandown",
  "author": "mandown",
  "created_time": "June 18, 2023, 07:04:26 AM",
  "content": "Forumda geçirdiğim süre içerisinde 2. çocugum oldu burada konusunu açmadım hatırlarsanız ilkini açmıştım.İnsanın evladı olduğunda dünya bir başka güzelleşiyor. Gözünüzün önünde büyüyorlar. Her bir adımına tanıklık ediyorsunuz. Muhteşem bir duyguBabalar gününüz kutlu ve mutlu olsun.Not: Bekarlar evlenin geciktirmeyin. Bu aşk başka bir aşk.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456721",
  "comments": [
    {
      "author": "yslyv",
      "created_time": "June 18, 2023, 11:22:18 AM",
      "body": "Tüm babaların babalar gününü kutlarım. Benim 3. babalar günüm. Sabah kızım hediye kartı hazırlamış. Annesini, babasını ve kendini çizmiş, yanına da kalp eklemiş. Hayatımda aldığım en güzel hediye, tarifsiz bir duygu. Bence de bekarlar geç kalmasın",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "June 18, 2023, 12:08:58 PM",
      "body": "Babalık duygusunu tatmış tüm babaların babalar günü kutlu olsun. Bir çok arkadaşımızın burada baba olduklarına şahitlik etmiştik. Bu özel günde kaybettiğimiz babalarımızı büyük babalarımızı da unutmadan rahmetle anıyorum. Tüm babalar ve evlatlara sağlıklı mutlu bir ömür diliyorum, kimseye hiç birinin eksikliğini yaşatmasın.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l99l",
      "created_time": "June 18, 2023, 02:07:46 PM",
      "body": "Acısı dinmeyen vardır, yeni kaybetmiş olan vardır, hastalıkla mücadele eden vardır, imkansızlık nedeniyle göremeyen vardır. Her şey dozunda iyidir. Babalar güzel adamlardır.Tüm Babaların babalar günü kutlu olsun <3",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mustang Shelby",
      "created_time": "June 18, 2023, 05:35:30 PM",
      "body": "Babalık çok farklı bir duygudur. Herkes annelik daha kutsal der ama babalığın yeri bambaşkadır. Babanın adı bile yeter, gölgesi bile yeter. Bir şey yapmasa bile bir kez gururlar güldüğü zaman senin olur yerle gök. Babam çok mesafeli bir adamdı, sevmeyi bilmez, sevmeyi gösteremezdi. Ama mezuniyet günümde onun nasıl gururlu olduğunu görünce işte bu benim babam, ben onun oğluyum dedim içimden. Babaların evlatlarını bağırlarına daha çok bastığı, babaların evlatlarının annelere zarar vermediği, sevgi dolu nice babalar gününü görmek dileğiyle. Herkesin, özellikle forumumuzdaki babaların babalar günü kutlu olsun!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silence Scream",
      "created_time": "June 18, 2023, 08:05:19 PM",
      "body": "Baba olmak büyük bir duygu ve tüm erkeklerin bence önce askerlikle, sonra da babalıkla büyük olgunluğa ulaştıklarını söyleyebilirim. Özellikle çocuğunuzu kucağınıza aldığınızda onun boynundan cennet kokusunu içinize çekince ne demek istediğimi daha iyi anlayacaksınız. Bekarlar varsa ve evlenme niyetleri varsa geç olmadan evlenmelerini, kısmet olursa da evlat sahibi olmalarını öneririm. Bir de ilk defa baba derse o zaman tattığınız duyguyu asla unutmuyorsunuz arkadaşlar.Forumda baba olan, olacak olan, babalığı hakkıyla yapan tüm babaların babalar gününü kutlarım. Geç olmadan babanız hayatta ise ve dargınsanız bunları bir kenara bırakıp barışın. Zaman acımasız, durmuyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "June 18, 2023, 08:20:38 PM",
      "body": "Baba olan ve baba adayı olan forumda ki tüm forumdaşlarımın babalar günü kutlu olsun. Günün anlam ve önemine ithafken şu şarkıyı paylaşıyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "June 18, 2023, 08:40:52 PM",
      "body": "Quote from: Gencecikmen on June 18, 2023, 08:20:38 PMBaba olan ve baba adayı olan forumda ki tüm forumdaşlarımın babalar günü kutlu olsun. Günün anlam ve önemine ithafken şu şarkıyı paylaşıyorum. Hemen üstüme alınıyorum hocam baba olacağımı öğrenince heyecanla burada paylaşmıştım babalık muhteşem bir şey özellikle kız babası olmak daha başka bir şey herhalde bilmiyorum hem kız hem erkek çocuğu olanlar kızın farklı olduğundan bahsedince öyle dedim bende kızım bana bir kere sarılınca tüm stresi ve yorgunluğu alıyor babasının kuzusu Allah herkese nasip etsin isteyen herkese nasip etsin inşallah Babalar gününüz kutlu olsun babalar ve geleceğin babaları",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "June 19, 2023, 06:03:50 AM",
      "body": "Konu ilk açıldığında gördüm ve biraz bekledim önce Baba olmuş olanlar yazsın aralarında dedim  Çocukların rol model olarak aldığı kişiler anne ve babalarıdır. Çevrenizde bir şeylerden rahatsızsanız önce kendinizi iyi anlamda değiştirin ve sonra çocuğunuz sizden görüp iyi bir birey olacaktır. O yüzden çocuk sahibi olanlara büyük pay düşüyor.Forumdaki Baba'ların Babalar gününü kutluyorum. Ailenizle, sevdiklerinizle, sağlıklı, huzurlu ömürler geçirmenizi diliyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "June 19, 2023, 06:14:42 PM",
      "body": "Böyle günlerin yarardan çok zararı var bence. Babasını hiç görememiş kişiler, babasını kaybetmiş kişiler, hatta babasını hiç tanıyamayanlar ne kadar kötü hissediyorlardır. Ama gene de kutlu olsun tabi ki.Çocuk sahibi olmak isteyenlerin geciktirmemesi gerektiğine katılıyorum. Belli bir yaştan sonra gittikçe zorlaşıyor. Benim yok ancak çevremdekilerden çocuk yapan sayısı gittikçe artıyor. Yaş ilerledikçe herkesin çok zorlandığını görebiliyorum. Bir iş arkadaşım beyaz yaka olarak çalışırken çok erken çocuk yapmış. Kadın şimdi 37 yaşında ama çocuğu kocaman oldu bile. Kadın çocuğu yapıp anne moduna girmişti, şimdi çocuk büyüdü kadın tekrar gençleşti. Gençken enerji ve tahammül de kesinlikle yüksek oluyor. Çocuk isteyen erken yapsın kurtulsun bence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "June 20, 2023, 07:15:00 AM",
      "body": "Quote from: püsür on June 19, 2023, 06:14:42 PMBöyle günlerin yarardan çok zararı var bence. Babasını hiç görememiş kişiler, babasını kaybetmiş kişiler, hatta babasını hiç tanıyamayanlar ne kadar kötü hissediyorlardır. Ama gene de kutlu olsun tabi ki.Çocuk sahibi olmak isteyenlerin geciktirmemesi gerektiğine katılıyorum. Belli bir yaştan sonra gittikçe zorlaşıyor. Benim yok ancak çevremdekilerden çocuk yapan sayısı gittikçe artıyor. Yaş ilerledikçe herkesin çok zorlandığını görebiliyorum. Bir iş arkadaşım beyaz yaka olarak çalışırken çok erken çocuk yapmış. Kadın şimdi 37 yaşında ama çocuğu kocaman oldu bile. Kadın çocuğu yapıp anne moduna girmişti, şimdi çocuk büyüdü kadın tekrar gençleşti. Gençken enerji ve tahammül de kesinlikle yüksek oluyor. Çocuk isteyen erken yapsın kurtulsun bence.Erken yaşta anne baba olmanın avantajları olduğu gibi dezavantajları da var. Anne baba yanınızdaysa hiç dezavantaj yaşamazsınız ama geneli avantaja döner. Çocuğunuz büyür ve anne baba değil de arkadaş gibi olursunuz. Benim annemle aramdaki yaş farkı çok yakın ve görenler bizi abla kardeş zannediyor. Benim için güzel bir şey ama annem için daha güzel bir şey herhalde. Yine de niyeti olup geç kalanlar da her şekilde anne baba olmalı bence. Güzel bir duyguyu yaşamak herkesin hakkı. Elbette iyi niyetli olup çocuklarına bakabilecek kişiler için söylediğim geçerli.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "June 20, 2023, 07:55:44 AM",
      "body": "Babalar gününü kutlarım herkesin arkadaşlar, biraz geç oldu kusura bakmayın artık, hediyeleri aldıysanız artık neler olduğunu konuda paylaşabilirsiniz, yıllardır babamıza gömlek ala ala adamın içi dışı gömlek oldu, anneler günü öyle mi sürekli yeni elektronik ev eşyası alıyorsun, en son elektrikli süpürge almıştık  anneler günü babalar gününden daha özel",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "June 20, 2023, 05:11:08 PM",
      "body": "Quote from: püsür on June 19, 2023, 06:14:42 PMBöyle günlerin yarardan çok zararı var bence. Böyle günleri en çok hatırlatanlar markaların Tv reklamları. Onlar da babalarımızı çok sevdiği için hatırlatmıyor bunları. Daha çok ürün satmak için hatırlatıyor. Bana kalırsa da hem yararı var hem zararı var bugünün. Neoliberal şirketler toplumun üzerinde oluşturduğu baskı ile ürün satarak harcama yaptırıyor böyle günlerde. Bu yönü bana göre zararlı tarafı. Çünkü babamızın hiç ihtiyacı olmayan şeyleri de bugünlerde alabiliyoruz. Ben bir keresinde kravat iğnesi almıştım. Babam ona aldığım kravat iğnesini bana ayıp olmasın diye bi kere taktı o kadar. Bu benim hatam. Kabul ediyorum. Ama toplumsal etkiye kapıldığım için aldım iğneyi. Büyük bi tüketim çılgınlığı bana kalırsa. İyi tarafı da babalarımızı hatırlamamız için bi sebep oluşuyor. O yönüne bi eleştiri getiremem tabiki.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}