{
  "id": "topic_5473755",
  "title": "Forever101",
  "author": "Forever101",
  "created_time": "November 11, 2023, 08:05:34 PM",
  "content": "My country people, joy hit my chest today ooo, I no no maybe e  reach urside, MTN wipe my debt and everybody for our area oo, dis one don throw joy for everybody face. Imagine the debt wey you know no how u go take pay, all of a sudden Dem wipe am commot. Dis one sweet my belle. MTN una don reduce worry and overthinking for this economic crisis. As e be now person go fit buy data take dey do online hustle, stay updated on Bitcoin matter",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473755",
  "comments": [
    {
      "author": "Egii Nna",
      "created_time": "November 11, 2023, 08:14:39 PM",
      "body": "If you are online in social media, you would have seen that MTN has announced that it was a glitch in the system, and all customers that have seen their debt not reflecting will reflect it after they have resolved the technical problem, so in this case, I see no reason to be happy because you will still pay that money back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adultcrypto",
      "created_time": "November 11, 2023, 08:15:30 PM",
      "body": "Quote from: Forever101 on November 11, 2023, 08:05:34 PMMy country people, joy hit my chest today ooo, I no no maybe e  reach urside, MTN wipe my debt and everybody for our area oo, dis one don throw joy for everybody face. Imagine the debt wey you know no how u go take pay, all of a sudden Dem wipe am commot. Dis one sweet my belle. MTN una don reduce worry and overthinking for this economic crisis. As e be now person go fit buy data take dey do online hustle, stay updated on Bitcoin matterYou supposed run us full gist of the type of debt wey them clear for people. Abi na people wey borrow credit and data? Abi na people wey use their phone lines collect quick loan? Abi na for Lapo or Palmpay? Make person know weyin dey sup if person go quickly go collect loan dey wait make MTN come through for am. This your update sweet but e never enter my body well.... I wan make you explain more abeg.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "November 11, 2023, 08:22:39 PM",
      "body": "Quote from: Forever101 on November 11, 2023, 08:05:34 PMMy country people, joy hit my chest today ooo, I no no maybe e  reach urside, MTN wipe my debt and everybody for our area oo, dis one don throw joy for everybody face. Imagine the debt wey you know no how u go take pay, all of a sudden Dem wipe am commot. Dis one sweet my belle. MTN una don reduce worry and overthinking for this economic crisis. As e be now person go fit buy data take dey do online hustle, stay updated on Bitcoin matterChairman well-done for the update but I think it's not necessary to bring the topic here as the board is currently under massive watch and we are letting users know on their post quality here on the LB to make the board stand out. Although I understand the fact that we all want to pass information but we should try as much as possible to make it relate to Bitcoin or crypto related stuffs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "November 11, 2023, 08:36:05 PM",
      "body": "But I hear say na Davido  pay di bill for everyone that dey ow MTN because im win award. Some came to my side and told me di Tori and when I checked my account, I come see say n true true dem don clear my #500 debt. But I never really believed say na Davido go pay day money because dat money go reach trillions. All di households in dis country dey ow MTN and the minimum go be #50 and above. Na better thing wey Dem do oh but I still dey suspect dem. If na MTN really remove all dis people their debt from di database then something is better e don happened to dem and dem no wan tell us. MTN I know e no go just clear people loan like that. Dem too like money. Don't worry we go hear di story very soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rachael9385",
      "created_time": "November 11, 2023, 08:49:47 PM",
      "body": "My airtime balance was cleared.If you can take your time to read this content clearly you will get to know that the MTN company didn't clear our loans intentionally. Besides it is their business and in business there is no friendship in it.However, I too my loan was cleared and I noticed it this afternoon when I was seeing some jubilation stuffs in my social media page, firstly I didn't believe it untill I checked my airtime balance, I also read am article that's says after sometimes MTN will readjust everything the way it was.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "November 11, 2023, 08:50:53 PM",
      "body": "Quote from: adultcrypto on November 11, 2023, 08:15:30 PMYou supposed run us full gist of the type of debt wey them clear for people. Abi na people wey borrow credit and data? Abi na people wey use their phone lines collect quick loan? Abi na for Lapo or Palmpay? Make person know weyin dey sup if person go quickly go collect loan dey wait make MTN come through for am. This your update sweet but e never enter my body well.... I wan make you explain more abeg.Na people wey use their lines borrow airtime and data from MTN and you know say whenever you try to check your account balance, dem go show you [(-) the amount wey you dey owe]. So today, when people dey check their airtime balances, those outstanding debts no dey show again, na hin people come dey happy say MTN don clear their debts. But the thing wey dey be say, na network glitch according to the message wey MTN release for their social media platforms.https://twitter.com/MTNNG/status/1723331652196155474?t=X4nM8dyg-sHzsg0h445J6g&s=19",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelward",
      "created_time": "November 11, 2023, 09:17:09 PM",
      "body": "Quote from: Mate2237 on November 11, 2023, 08:36:05 PMBut I hear say na Davido  pay di bill for everyone that dey ow MTN because im win award. Some came to my side and told me di Tori and when I checked my account, I come see say n true true dem don clear my #500 debt. But I never really believed say na Davido go pay day money because dat money go reach trillions. All di households in dis country dey ow MTN and the minimum go be #50 and above. Na better thing wey Dem do oh but I still dey suspect dem. If na MTN really remove all dis people their debt from di database then something is better e don happened to dem and dem no wan tell us. MTN I know e no go just clear people loan like that. Dem too like money. Don't worry we go hear di story very soon.Thanks for dis update about how you reason say di matter be on why mtn clear dem customers recharge dept. Di OP no tell us di kind loan or give us details about how dem take clear di loan, whether na recharge card loan, bank loan or mtn agents just enter dem area de meet everybody de ask dem who dem de indepted to, and clear di dept. Abeg e de very important to at least try to de give more details about events wey we wan take start topic, so people go get idea of wetin dem de talk about to know how dem wan take chuk mouth for di matter.I hope say mtn go come out and officially tell us why dem clear di recharge dept for people wey de owe sem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Makus",
      "created_time": "November 11, 2023, 09:22:27 PM",
      "body": "As e don be like this I no say body go dey pepper MTN for this kind of glitch error wey dem dey experience like this, but Nigerian sef no get joy, no be say na Christmas day or 1 of October wey we go expect say na really true matter, already MTN don come outside yan say na by mistake so, dem go still put back the loan balance for our sims dem. Wattin still dey boarder me na the talk wey people dey talk say na OBO naim dey run the credit payment for us, this na to tell us how false news get power reach to take spread for this our country, if to say MTN no come outside talk I for think say na true oo, so those wey dem clear their debt make una still prepare to pay una loan back wen dem solve this error. The one wey pain me pass na when I see post wey talk say more Nigerian don go borrow from dem, my country people no dey like carry last",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Miles2006",
      "created_time": "November 11, 2023, 09:55:11 PM",
      "body": "Quote from: Egii Nna on November 11, 2023, 08:14:39 PMIf you are online in social media, you would have seen that MTN has announced that it was a glitch in the system, and all customers that have seen their debt not reflecting will reflect it after they have resolved the technical problem, so in this case, I see no reason to be happy because you will still pay that money back.Glitch or not I think this is a prank as na naija we dey na everything don turn cruise if this was an error things like this for don dey happen but for the history of mtn I never hear anything like this before, and now there's no service for people to borrow airtime again, at first I saw the post on IG and I thought it was a joke I tired it and there's no service. Tbh anything they want to do they should do it but they should stop playing with people, almost everybody don happen just to hear say na glitch",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.suevie",
      "created_time": "November 11, 2023, 11:28:44 PM",
      "body": "Quote from: Miles2006 on November 11, 2023, 09:55:11 PMQuote from: Egii Nna on November 11, 2023, 08:14:39 PMIf you are online in social media, you would have seen that MTN has announced that it was a glitch in the system, and all customers that have seen their debt not reflecting will reflect it after they have resolved the technical problem, so in this case, I see no reason to be happy because you will still pay that money back.Glitch or not I think this is a prank as na naija we dey na everything don turn cruise if this was an error things like this for don dey happen but for the history of mtn I never hear anything like this before, and now there's no service for people to borrow airtime again, at first I saw the post on IG and I thought it was a joke I tired it and there's no service. Tbh anything they want to do they should do it but they should stop playing with people, almost everybody don happen just to hear say na glitch This thing wey happen no concern anybody because no be we cause the glitch and beside them big pass to clear our depts, despite the trillion of dollars wey dem dey make for our head. Well that one no concern anybody watin we know be say the deed has already been don and if they decide to add it back to the balance of their users that one na their own cup of tea because the way I been dey with ma MTN sim nai I go still dey because na me know how the sim get value to me or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adultcrypto",
      "created_time": "November 12, 2023, 12:18:53 AM",
      "body": "Quote from: sokani on November 11, 2023, 08:50:53 PMQuote from: adultcrypto on November 11, 2023, 08:15:30 PMYou supposed run us full gist of the type of debt wey them clear for people. Abi na people wey borrow credit and data? Abi na people wey use their phone lines collect quick loan? Abi na for Lapo or Palmpay? Make person know weyin dey sup if person go quickly go collect loan dey wait make MTN come through for am. This your update sweet but e never enter my body well.... I wan make you explain more abeg.Na people wey use their lines borrow airtime and data from MTN and you know say whenever you try to check your account balance, dem go show you [(-) the amount wey you dey owe]. So today, when people dey check their airtime balances, those outstanding debts no dey show again, na hin people come dey happy say MTN don clear their debts. But the thing wey dey be say, na network glitch according to the message wey MTN release for their social media platforms.Thank you for clearing the air. Na later I come get the full gist self say na technical glitch been happen. The MTN wey me know no go gree do that kind awoof for Naija people. Now wey the update don cast, MTN will come back with plenty vexation come charge Nigerians wetin no good. Meanwhile, their staff wey press the CTRL CLEAR go collect wotoporiously. I get people wey don already use the opportunity borrow double of wetin them be dey owe as them increase their limit after them clear their debt. Imagine when MTN go come back for them, na too kuku use police go arrest them or kuku ban them from using MTN     . I dey wait to see as the game go play; enough cruise dey road dey come",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Riginac111",
      "created_time": "November 12, 2023, 04:33:22 AM",
      "body": "Quote from: Forever101 on November 11, 2023, 08:05:34 PMMy country people, joy hit my chest today ooo, I no no maybe e  reach urside, MTN wipe my debt and everybody for our area oo, dis one don throw joy for everybody face. Imagine the debt wey you know no how u go take pay, all of a sudden Dem wipe am commot. Dis one sweet my belle. MTN una don reduce worry and overthinking for this economic crisis. As e be now person go fit buy data take dey do online hustle, stay updated on Bitcoin matterWhat MTN did is good because their sometimes when you recharge and MTN will  deduct you what is not good, and I don't think their service in nigeria is paying any tax, they are tax free because we nigeria need their network, why if we are the one that own MTN mask in South Africa it would have stop working because South Africa will ask us to pay a tax we can not be able to pay and when we pay the tax we will not make profit. So what I'm saying in nutshell is that MTN supposed to reduce their charges in their network even in data and in normal calls I don't think that they deserve to be charging Nigerian the way they charged us,  do you know that global network is better than MTN network in terms of minimising charges both in calls, they paid those things theirs something they noticed maybe their is no trafficking in their network and they want to win their customers back by clearing their debt",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zanab247",
      "created_time": "November 12, 2023, 05:35:44 AM",
      "body": "Quote from: Forever101My country people, joy hit my chest today ooo, I no no maybe e  reach urside, MTN wipe my debt and everybody for our area oo, dis one don throw joy for everybody face. Imagine the debt wey you know no how u go take pay, all of a sudden Dem wipe am commot. Dis one sweet my belle. MTN una don reduce worry and overthinking for this economic crisis. As e be now person go fit buy data take dey do online hustle, stay updated on Bitcoin matterD news sweet my belly yesterday Sha, but I no dey among people wen borrow money from MTN but Wetin dey do to their users really makes sense and it will give other people dat are not using MTN to begin to hunger for it from today upward. If our government can also wake up one day and clear their debt dey own other countries of d world go really help the Naija economy to grow faster like d way other developed countries economy is growing like a trees planted by d side of river.I know dat many BTC users dat are using other network for online will surely change their minds to test dis better tin wey MTN official carry come for their customers to enjoy and see the difference with other network in the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hewlet",
      "created_time": "November 12, 2023, 05:43:04 AM",
      "body": "Quote from: DaNNy001 on November 11, 2023, 08:22:39 PMQuote from: Forever101 on November 11, 2023, 08:05:34 PMMy country people, joy hit my chest today ooo, I no no maybe e  reach urside, MTN wipe my debt and everybody for our area oo, dis one don throw joy for everybody face. Imagine the debt wey you know no how u go take pay, all of a sudden Dem wipe am commot. Dis one sweet my belle. MTN una don reduce worry and overthinking for this economic crisis. As e be now person go fit buy data take dey do online hustle, stay updated on Bitcoin matterChairman well-done for the update but I think it's not necessary to bring the topic here as the board is currently under massive watch and we are letting users know on their post quality here on the LB to make the board stand out. Although I understand the fact that we all want to pass information but we should try as much as possible to make it relate to Bitcoin or crypto related stuffs. normally the thread de off topic but I feel say since you know say men mount around when de choke eyes for the board, as you wan advice am about this matter, you for use pigin take knack your reply so the info for just de on a kum kum and na only we go know wetin you de try put across to the OP. But as I don yarn that one so, make I also follow put mouth say make we de put effort so our thread go de related to Bitcoin and even if we wan create post when go de a bit off, make e be more of government regulations when go affect bitcoin either positively or negatively or make the post get small relationship with Bitcoin either from the topic or the body of the thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dripplurd",
      "created_time": "November 12, 2023, 06:09:37 AM",
      "body": "Quote from: Mate2237 on November 11, 2023, 08:36:05 PMBut I hear say na Davido  pay di bill for everyone that dey ow MTN because im win award. Some came to my side and told me di Tori and when I checked my account, I come see say n true true dem don clear my #500 debt. But I never really believed say na Davido go pay day money because dat money go reach trillions. All di households in dis country dey ow MTN and the minimum go be #50 and above. Na better thing wey Dem do oh but I still dey suspect dem. If na MTN really remove all dis people their debt from di database then something is better e don happened to dem and dem no wan tell us. MTN I know e no go just clear people loan like that. Dem too like money. Don't worry we go hear di story very soon.omo the thing sweet me as a studen ooo, if na them try to help us but i con dey hear some kind thnings say it was a system glitch na were i con know say na my country people don do their work,and i hear say dem wan even leave am for us before but u know my country people, dem allowed dem to clear the debt wey dem dey owe and i heard it was around 1.4trillion,and all dey could do again is to borrow morethan the one dey were  owing before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "November 12, 2023, 07:57:09 AM",
      "body": "Quote from: Forever101 on November 11, 2023, 08:05:34 PMMy country people, joy hit my chest today ooo, I no no maybe e  reach urside, MTN wipe my debt and everybody for our area oo, dis one don throw joy for everybody face. Imagine the debt wey you know no how u go take pay, all of a sudden Dem wipe am commot. Dis one sweet my belle. MTN una don reduce worry and overthinking for this economic crisis. As e be now person go fit buy data take dey do online hustle, stay updated on Bitcoin matterOmo I follow experience am oh, Money way I dey owe for my MTN line, them don clear am oh, but Omo trust Nigerians, them don borrow again, almost immediately as them hear say them don clear their debt.Omo I no sure say na technical glitch something, na people formulate that one, just to make the thing look as if na joke, just as INEC take use us play. MTN actually did that deliberately.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Justbillywitt",
      "created_time": "November 12, 2023, 08:26:47 AM",
      "body": "QuoteMy country people, joy hit my chest today ooo, I no no maybe e  reach urside, MTN wipe my debt and everybody for our area oo, dis one don throw joy for everybody face. Imagine the debt wey you know no how u go take pay, all of a sudden Dem wipe am commot. Dis one sweet my belle. MTN una don reduce worry and overthinking for this economic crisis. As e be now person go fit buy data take dey do online hustle, stay updated on Bitcoin matterThis your post is coming at a time when the senior men them for this local board dey say make we no post this king of post for this place. You know say na this kind of post dey make the board lose it's credibility. To be honest with you this your post is not helpful at all, but spreading fake news . Moreover before you spread any news make sure say the thing legit and it's coming from the company verified social media handles and their website. Things like this gives scammers opportunities to keep practicing their crafts and unsuspecting citizens will fall victims. Soon you will see links flying on facebook and whatsapp asking people to click to see if they are eligible for M.T.N debt clearance and get more benefits like data and airtime for calls. Such unsuspecting victims will click thoses links and they be hurt in one way or the other by losing their money in banks or exposing their personal detals to those malicious sites. Abeg make we dey careful the way we dey spread unverified news for the sake of the masses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samlucky O",
      "created_time": "November 12, 2023, 09:38:22 AM",
      "body": "Quote from: sokani on November 11, 2023, 08:50:53 PMQuote from: adultcrypto on November 11, 2023, 08:15:30 PMYou supposed run us full gist of the type of debt wey them clear for people. Abi na people wey borrow credit and data? Abi na people wey use their phone lines collect quick loan? Abi na for Lapo or Palmpay? Make person know weyin dey sup if person go quickly go collect loan dey wait make MTN come through for am. This your update sweet but e never enter my body well.... I wan make you explain more abeg.Na people wey use their lines borrow airtime and data from MTN and you know say whenever you try to check your account balance, dem go show you [(-) the amount wey you dey owe]. So today, when people dey check their airtime balances, those outstanding debts no dey show again, na hin people come dey happy say MTN don clear their debts. But the thing wey dey be say, na network glitch according to the message wey MTN release for their social media platforms.https://twitter.com/MTNNG/status/1723331652196155474?t=X4nM8dyg-sHzsg0h445J6g&s=19I talk am! Say devil no get Free gift. say how on Earth wey mtn of all people go do this kind Bonanza for this kind economic recession. Even dangote self Never do this kind thing. I been dey reason say Yahoo boys don't hack them? Just like during endsars wey dem hack either Airtel or glo people come dey get 1k but after that people come become deptors. No be today this kind thing don dey happen. Even access bank been get this similar network glich people come dey dial one code to transfer money from access to other account while them no get money from for bank. The funny thing be say you go see the alert but you no go fit withdrawal am that time.My advice for everybody here besay when something don dey too real to be truth, make we dey careful. Because people too dey take any slight opportunity as to dey smart, meanwhile that smartness fit put you for danger. Emagine somebody say just pick any old already recharge card make you still recharge am you go get money. that one Alone soppos give you signal say error dey somewhere and this go surely affect you when everything don normalize, you go come become a huge investor of debt. Maybe you take advantage of recharging #20k because of the network glich my brother after network don come back na sorry go be your future name.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MainIbem",
      "created_time": "November 12, 2023, 11:03:19 AM",
      "body": "Quote from: Forever101 on November 11, 2023, 08:05:34 PMMy country people, joy hit my chest today ooo, I no no maybe e  reach urside, MTN wipe my debt and everybody for our area oo, dis one don throw joy for everybody face. Imagine the debt wey you know no how u go take pay, all of a sudden Dem wipe am commot. Dis one sweet my belle. MTN una don reduce worry and overthinking for this economic crisis. As e be now person go fit buy data take dey do online hustle, stay updated on Bitcoin matterLet me attest to what you just said my wife was owing about 1500 in her MTN SIM card wey dey inside phone and she come manage pay out 1k debt e come remain about 500 Naira reaching today now as i come read this post na so I tell my madam to check weda that her debt still dey na so we run check her balance omo nothing dey there again oo. The debt has been cleared this one na good story for those wey like to dey owe those network providers. But one thing i go let una know say be say MTN no fit do something for free to people because I know say e get another better place them wan use milk am from people wey them help clear debt, don't be surprised say them fit dey charge am from every calls wey una dey make without knowing the reason why una airtime dey quickly exhaust make una fear them oo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}