{
  "id": "topic_5415127",
  "title": "theskillzdatklls",
  "author": "theskillzdatklls",
  "created_time": "September 27, 2022, 07:29:43 PM",
  "content": "Probably nothing. But it's pretty funny this was in the SEC's calendar that was given to a journalist/activist through a FOIA request.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415127",
  "comments": [
    {
      "author": "The Cryptovator",
      "created_time": "September 27, 2022, 07:35:28 PM",
      "body": "Do you believe SEC is involved with Bitcoin? If not then they should expose who is Satoshi Nakamoto. But they never did it, which means either they don't know Satoshi or are involved with Bitcoin somehow. Still, no one can solve Satoshi's mystery except Satoshi himself. I believe at least US legal authority had tried to investigate Satoshi. But not an easy task at all. I don't believe such tweets, anyone can write anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "theskillzdatklls",
      "created_time": "September 27, 2022, 08:02:41 PM",
      "body": "Quote from: The Cryptovator on September 27, 2022, 07:35:28 PMDo you believe SEC is involved with Bitcoin? If not then they should expose who is Satoshi Nakamoto. But they never did it, which means either they don't know Satoshi or are involved with Bitcoin somehow. Still, no one can solve Satoshi's mystery except Satoshi himself. I believe at least US legal authority had tried to investigate Satoshi. But not an easy task at all. I don't believe such tweets, anyone can write anything. This isn't a random tweet that someone just made up. This is an actual official US government document from the SEC's calendar from 2017.What it might mean is a different question.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gmaxwell",
      "created_time": "September 27, 2022, 08:11:26 PM",
      "body": "There have been numerous impersonators representing themselves to be Satoshi Nakamoto for years now, including to the US government.It's utterly implausible that Satoshi would reveal themselves to the SEC this way and not take some other actions.  So my immediate question is which impersonator tricked Tim Draper?  There was previous speculation that he'd been bamboozled by Wright after he'd done an interview with Ayre's media outlet, but I don't know if anyone managed to confirm that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 27, 2022, 08:12:48 PM",
      "body": "fox news doing investigative reporting???.. nah",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "theskillzdatklls",
      "created_time": "September 27, 2022, 08:22:43 PM",
      "body": "Quote from: gmaxwell on September 27, 2022, 08:11:26 PMThere have been numerous impersonators representing themselves to be Satoshi Nakamoto for years now, including to the US government.It's utterly implausible that Satoshi would reveal themselves to the SEC this way and not take some other actions.  So my immediate question is which impersonator tricked Tim Draper?  There was previous speculation that he'd been bamboozled by Wright after he'd done an interview with Ayre's media outlet, but I don't know if anyone managed to confirm that.Hadn't thought about this situation that much but that story checks out a lot as perhaps the most plausible situation actually. And given the SEC's [non-existent] level of expertise in cryptocurrency, especially at the time, seems like an easy trap for them to have fallen into.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 27, 2022, 08:27:15 PM",
      "body": "Quote from: gmaxwell on September 27, 2022, 08:11:26 PMThere have been numerous impersonators representing themselves to be Satoshi Nakamoto for years now, including to the US government.It's utterly implausible that Satoshi would reveal themselves to the SEC this way and not take some other actions.  So my immediate question is which impersonator tricked Tim Draper?  There was previous speculation that he'd been bamboozled by Wright after he'd done an interview with Ayre's media outlet, but I don't know if anyone managed to confirm that.https://twitter.com/TimDraper/status/901202875862237184QuoteTim Draper@TimDraperI just got targeted by a Satoshi fake. He was very convincing, and wasted a lot of my time. Could have been much worse. Watch out!11:01 pm · 25 Aug 2017if anyone wants to forward the TD tweet link to all the media and foxbusiness.. as this nonsense is trying to spread.. please do forward it to quash the nonsense",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "theskillzdatklls",
      "created_time": "September 27, 2022, 08:29:17 PM",
      "body": "Quote from: franky1 on September 27, 2022, 08:27:15 PMQuote from: gmaxwell on September 27, 2022, 08:11:26 PMThere have been numerous impersonators representing themselves to be Satoshi Nakamoto for years now, including to the US government.It's utterly implausible that Satoshi would reveal themselves to the SEC this way and not take some other actions.  So my immediate question is which impersonator tricked Tim Draper?  There was previous speculation that he'd been bamboozled by Wright after he'd done an interview with Ayre's media outlet, but I don't know if anyone managed to confirm that.https://twitter.com/TimDraper/status/901202875862237184QuoteTim Draper@TimDraperI just got targeted by a Satoshi fake. He was very convincing, and wasted a lot of my time. Could have been much worse. Watch out!11:01 pm · 25 Aug 2017Nice. Well, gg, to that 5 minutes of fun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "September 27, 2022, 10:48:41 PM",
      "body": "Quote from: franky1 on September 27, 2022, 08:27:15 PM>>snip<<Good find @franky1  It had to be a faketoshi, why would someone go through the trouble of making themselves anonymous only to have a meeting with the SEC years later just as Bitcoin starts to get more and more popular.It's also pathetic how the mainstream media are so quick to jump on stories that they feel could negative affect Bitcoin. In fact, I no longer follow all the crappy news channels like Bloomberg.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChiBitCTy",
      "created_time": "September 28, 2022, 12:59:48 AM",
      "body": "This is complete heresy and I find it hard to believe thees any credibility at all to this story. It was pretty obvious that he wanted to remain anonymous at all costs, and him all of a sudden revealing his identity, especially to the government to talk about a project that he didn’t want any known association with just doesn’t make a whole lot of sense to me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "September 28, 2022, 01:03:39 AM",
      "body": "wow wow hold up cut the bullshit no one know who satoshi nakamoto is Quote from: Bitcoin_Arena on September 27, 2022, 10:48:41 PMIt had to be a faketoshi, why would someone go through the trouble of making themselves anonymous only to have a meeting with the SEC years later just as Bitcoin starts to get more and more popular.It's also pathetic how the mainstream media are so quick to jump on stories that they feel could negative affect Bitcoin. In fact, I no longer follow all the crappy news channels like Bloomberg.yeah i do believe in this aswell maybe this only a faketoshi",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 28, 2022, 01:04:24 AM",
      "body": "first of all its fox newssecond its about a non exciting 2017 eventthird the event attendee got debunked within 2 days of the event 5 years agoseems someone contacted fox to try to create new drama about old event knowing fox wont research if event was ever discussed or debunked before reporting on it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gmaxwell",
      "created_time": "September 28, 2022, 02:45:55 AM",
      "body": "Franky1 solved the mystery. This thread should be locked, at this point it's only flypaper for people who didn't bother reading the rest of the thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "September 28, 2022, 03:44:08 AM",
      "body": "Quote from: theskillzdatklls on September 27, 2022, 08:29:17 PMQuoteQuote from: gmaxwell on September 27, 2022, 08:11:26 PMThere have been numerous impersonators representing themselves to be Satoshi Nakamoto for years now, including to the US government.It's utterly implausible that Satoshi would reveal themselves to the SEC this way and not take some other actions.  So my immediate question is which impersonator tricked Tim Draper?  There was previous speculation that he'd been bamboozled by Wright after he'd done an interview with Ayre's media outlet, but I don't know if anyone managed to confirm that.https://twitter.com/TimDraper/status/901202875862237184QuoteTim Draper@TimDraperI just got targeted by a Satoshi fake. He was very convincing, and wasted a lot of my time. Could have been much worse. Watch out!11:01 pm · 25 Aug 2017Nice. Well, gg, to that 5 minutes of fun.Indeed.  I was reading through this thread getting ready to put my Sherlock Holmes outfit and then to my somewhat disappointment it became clear that this was just Tim Draper getting embarrassed by a satoshi fake.  I wonder if he just didn't show up to the interview or if the SEC ripped the fake a new one.  Also makes you wonder if it was CW or another impersonator.  I think this has to look pretty bad for Tim Draper though, especially if he used personal contacts to setup the meeting.  Hopefully his call for Bitcoin to have an explosive fourth quarter this year is a little more accurate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 28, 2022, 12:58:49 PMLast edit: September 28, 2022, 02:07:56 PM by franky1",
      "body": "ognasty..its 5yr old newsyes it was tim drapped fooled by CSWCSW wanted to fork BCH into BSV in early august declare it an ICO and get it listed on a proper public market, but he wanted to put it all into tim drappers name \"to protect the anonymity of \".. the funny part is right up to the day of mid august 2017 (2 years after the whole faketoshi drama\" tim drapper still beleived in CSW ..it wasnt until the SEC pointed out a few things and pretty much showed drapper and CSW the exit that tim drapper finally jumped off the CSW bang wagon with in hours of the SEC meeting which awakened tim drapper to the realities of CSW scams and tricks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "September 28, 2022, 03:54:23 PM",
      "body": "Quote from: gmaxwell on September 28, 2022, 02:45:55 AMFranky1 solved the mystery. This thread should be locked, at this point it's only flypaper for people who didn't bother reading the rest of the thread.It's got to be up though, it was fun reading through all the replies. Its sad franky1 did it very fast and solved it. If it would not have been solved I am pretty sure there would have been very funny responses for this one. In fact I was very much attracted and deceived by the title of thread itself since anyone would want to reconfirm whats inside the thread and is it really upcoming even from official authority like SEC. Fun, that faketoshi is not just made up word anymore, it's official events too. Lolz/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 28, 2022, 05:09:26 PM",
      "body": "i solved nothingi just reminded people that its 5 year old drama that was non news then.. and non news now.everyone already knows fox news reports are not actually news",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "September 28, 2022, 05:58:54 PM",
      "body": "It has become mysterious to them how Satoshi became anonymous for over a decade now, since the invention of Bitcoin and no one is able to identify who actually is Satoshi, hence people will just be coming up with various Faketoshi claims here and there. Do you think that if SEC happens to know who Satoshi is, they would find all means to get in contact with him , or even get him arrested in order to pull down this technology which is a great threat to the old financial system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beefcake",
      "created_time": "September 28, 2022, 06:24:01 PM",
      "body": "Really interesting stuff, but foia requests can be highly misleading. A document can come out, and because of redactions, it seems like some smoking gun has been released, but later it turns out that it was just a memo detailing some hoax or other that was reported to the FBI. Foia can be tricky, and often lacks context. Besides, does anyone really believe that Satoshi would meet like this? Cmon, not a chance. However, that doesn't mean that the document wasn't interesting. Perhaps the document suggests the meeting was about Satoshi? IDK.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anonylz",
      "created_time": "September 28, 2022, 06:34:19 PM",
      "body": "Quote from: theskillzdatklls on September 27, 2022, 08:02:41 PMThis isn't a random tweet that someone just made up. This is an actual official US government document from the SEC's calendar from 2017.What it might mean is a different question.How does such document came to the public view in the first place? Was it the SEC that made it available to public view or it was gotten through illegal means. People do a lot of editing this days so it is hard to know it such kind of info from the Internet is genuine or not because you can't really tell where is original source. I have heard some rumour in the past about sec being the creator of bitcoin, could this information contain some element of truth?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}