{
  "id": "topic_5399704",
  "title": "hZti",
  "author": "hZti",
  "created_time": "May 22, 2022, 10:58:39 AM",
  "content": "As I did not find a general Thread for coldcard questions I wanted to open one. My first questions would be if somebody has seen any more informations or manuals for the new NFC feature of the MK4?As far as I know there is the option to store LTC on an coldcard is it possible for BCH also since it is also similar to BTC?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5399704",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "May 22, 2022, 11:07:21 AM",
      "body": "On Coldcard official site, it is indicated that it (Coldcard hardware wallet) only supports bitcoin. Bitcoin cash (BCH) is a fork of bitcoin, that makes it not to be bitcoin but an altcoin. Bitcoin cash is just an altcoin just like litecoin, it has its own seperate blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RickDeckard",
      "created_time": "May 22, 2022, 12:38:37 PM",
      "body": "Quote from: hZti on May 22, 2022, 10:58:39 AM(...)My first questions would be if somebody has seen any more informations or manuals for the new NFC feature of the MK4?(...)The information that I was able to find regarding the new feature mostly boils down to how the feature was implemented on MK4, per their Bitcoin Magazine article[1]:QuoteNear-Field Communication (NFC)In the connections front, the user can opt into using NFC with the Mk4 by enabling it in the device’s settings as the feature will come disabled by default. Once turned on, NFC will enable the COLDCARD to come near a compatible device to sign a transaction or a message, co-sign in a multisig setup, or share information from the device’s MicroSD card like a payment address or an extended public key, a partially-signed Bitcoin transaction (PSBT), a text file, or a transaction file.Coinkite founder NVK told Bitcoin Magazine that the goal with NFC is to lower cost, improve UX, and further adoption.“Imagine hardware wallets being able to just tap-to-pay,” he said.Although QR codes have recently become popular in some hardware wallets, NVK said they haven’t been adopted in the larger payment industries because they have extremely low data bandwidth, are more complex and not human readable, and require more expensive hardware.“This feature was added to improve phone-wallet UX as all modern phones have NFC, free, already sitting unused,” NVK said. “NFC will be available to all COLDCARD functions we are able to send or receive data, just like the SD card or USB cable.”In addition to requiring NFC to be turned on for usage, NVK told Bitcoin Magazine that the Mk4 will also enable the user to permanently disable the feature by scratching a PCB trace exposed on the MicroSD opening.On Coldcard documentation[2] you can find an extra bit of information:QuoteNFC Notesdefaults to OFF, must be enabled in Settings > Hardware On/Off > NFC Sharingpress 3 after signing to share txn by NFCpress 3 on any QR to share same by NFCcan share any PSBT/Txt/Transaction file from MicroSDdisable forever by cutting trace labeled \"NFC\", visible in the MicroSD slot.[1]https://bitcoinmagazine.com/business/inside-the-new-coldcard-mk4[2]https://coldcard.com/docs/coldcard-mk4",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "May 22, 2022, 06:41:17 PM",
      "body": "Look down about a dozen posts: https://bitcointalk.org/index.php?topic=5380346.0As others have said it's BTC only.If you are a good enough programmer you could probably clone their github and make something that will work.But, I don't think you will be able to load it since it checks for signature. I could be wrong on that, never tried to load anything but the official published builds.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "May 22, 2022, 08:53:07 PM",
      "body": "Quote from: hZti on May 22, 2022, 10:58:39 AMMy first questions would be if somebody has seen any more informations or manuals for the new NFC feature of the MK4?I don't understand why would you need manual for something you don't even own... and it's not exactly rocket science.You can't purchase Coldcard Mk4 version now even if you want to, you can only make reservation and wait until they make new devices, that is the same thing for weeks.One good thing about this wallet during Pizza day, I saw they are currently offering 10% discount for all their products.Quote from: hZti on May 22, 2022, 10:58:39 AMAs far as I know there is the option to store LTC on an coldcard is it possible for BCH also since it is also similar to BTC?Coldcard is not supporting shitcoins, and I don't think they will ever do that in future, that is not such a bad thing if you want to have better and cleaner code base.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "June 09, 2022, 09:04:02 AMLast edit: June 09, 2022, 11:57:47 AM by hZti",
      "body": "Quote from: dkbit98 on May 22, 2022, 08:53:07 PMQuote from: hZti on May 22, 2022, 10:58:39 AMMy first questions would be if somebody has seen any more informations or manuals for the new NFC feature of the MK4?I don't understand why would you need manual for something you don't even own... and it's not exactly rocket science.Well if it is not rocket science then please enlighten me on how to sign a transaction with NFC and an iPhone",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "June 09, 2022, 12:31:15 PM",
      "body": "Quote from: hZti on June 09, 2022, 09:04:02 AMWell if it is not rocket science then please enlighten me on how to sign a transaction with NFC and an iPhone 1) Buy a hardware wallet that supports NFC communication for transferring transaction data.2) Configure your hardware wallet. In particular, you will need an extended public key to import to a software wallet later.3) Install a software wallet that supports transferring unsigned transactions. For example, this one https://bluewallet.io/.4) Create a watch-only wallet with the software you installed by importing an extended public key you generated with your hardware wallet.5) Generate an address and send some coins to it.6) Once you have received coins using your watch-only wallet, you are ready to send coins back using your hardware wallet.7) For that, on your software wallet, create a PSBT transaction and click \"Export using NFC\" Enable the NFC feature on both devices and send a PSBT transaction to your hardware wallet (signing device).9) Sign the transaction by clicking \"Sign\" on your hardware device.10) Send it back to your software wallet using the export feature of your hardware wallet.11) On your software wallet, click \"Broadcast\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "June 09, 2022, 12:52:42 PMLast edit: June 09, 2022, 01:29:17 PM by Charles-Tim",
      "body": "Quote from: hZti on June 09, 2022, 09:04:02 AMWell if it is not rocket science then please enlighten me on how to sign a transaction with NFC and an iPhone I will advice you not to use bluetooth or NFC for signing bitcoin transaction, I will recommend you to use USB, but the perfect one which is mostly recommended is QR code.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "June 09, 2022, 01:06:08 PM",
      "body": "The general way of signing a transaction is totally clear to me. It is not about how it is working in theory but how can you actually do it with the coldcard. The problem that I am facing is that there is no hardware wallet that I know that can receive the signed transaction from the coldcard. With blue wallet I was able to export the transaction to the coldcard (wich was a pain in the ass because you need a 3rd party application) but the import of the signed transaction is impossible. Also it would be a good feature to show the QR code of the signed transaction and not try to send it again via NFC, but that would be a feature that coinkite needs to implement.Quote from: witcher_sense on June 09, 2022, 12:31:15 PM7) For that, on your software wallet, create a PSBT transaction and click \"Export using NFC\"What iOS or in general what wallet has that function?Quote from: witcher_sense on June 09, 2022, 12:31:15 PM10) Send it back to your software wallet using the export feature of your hardware wallet.Same question as above about a wallet that can actually do this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "June 09, 2022, 01:38:23 PM",
      "body": "Quote from: hZti on June 09, 2022, 01:06:08 PMThe problem that I am facing is that there is no hardware wallet that I know that can receive the signed transaction from the coldcard. Coldcard is the hardware wallet, hardware wallet generate and store the private keys and are used for the signing.Quote from: hZti on June 09, 2022, 01:06:08 PMSame question as above about a wallet that can actually do this.According to this Coldcard guide, you can use Electrum: https://coldcard.com/docs/quick#using-with-electrum-via-usbYou can read this detailed Coldcard guide for beginners, guide For Bitcoin Beginners to know more about how you can use Coldcard to make transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "June 09, 2022, 02:14:39 PM",
      "body": "Quote from: Charles-Tim on June 09, 2022, 01:38:23 PMQuote from: hZti on June 09, 2022, 01:06:08 PMThe problem that I am facing is that there is no hardware wallet that I know that can receive the signed transaction from the coldcard. Coldcard is the hardware wallet, hardware wallet generate and store the private keys and are used for the signing.Sorry, I mean there is no wallet (especially on iOS) that can receive the signed transaction via NFC.Quote from: Charles-Tim on June 09, 2022, 01:38:23 PMQuote from: hZti on June 09, 2022, 01:06:08 PMSame question as above about a wallet that can actually do this.According to this Coldcard guide, you can use Electrum: https://coldcard.com/docs/quick#using-with-electrum-via-usbYou can read this detailed Coldcard guide for beginners, guide For Bitcoin Beginners to know more about how you can use Coldcard to make transaction.Yes you can use many wallets with USB or MicroSD card. The question is what wallet can you use for NFC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "June 09, 2022, 05:35:01 PM",
      "body": "Quote from: hZti on June 09, 2022, 02:14:39 PMQuote from: Charles-Tim on June 09, 2022, 01:38:23 PMQuote from: hZti on June 09, 2022, 01:06:08 PMThe problem that I am facing is that there is no hardware wallet that I know that can receive the signed transaction from the coldcard. Coldcard is the hardware wallet, hardware wallet generate and store the private keys and are used for the signing.Sorry, I mean there is no wallet (especially on iOS) that can receive the signed transaction via NFC.Yes, exactly; as far as I know such an application doesn't exist yet. I should mention though, that this device isn't exactly portable anyway. It has no built-in battery and it's pretty large.If you want a portable hardware wallet that works with iOS and is compact to carry around with your phone, I'd recommend the Foundation Passport. It's my current daily driver and it's more secure by using QR codes instead of a wireless protocol such as NFC.Quote from: hZti on June 09, 2022, 02:14:39 PMQuote from: Charles-Tim on June 09, 2022, 01:38:23 PMQuote from: hZti on June 09, 2022, 01:06:08 PMSame question as above about a wallet that can actually do this.According to this Coldcard guide, you can use Electrum: https://coldcard.com/docs/quick#using-with-electrum-via-usbYou can read this detailed Coldcard guide for beginners, guide For Bitcoin Beginners to know more about how you can use Coldcard to make transaction.Yes you can use many wallets with USB or MicroSD card. The question is what wallet can you use for NFC.Why exactly are you so focused on NFC? If you are looking for a wallet that works with iOS, I guess that's why you don't want a USB or microSD wallet; however iOS wallets work perfectly with QR codes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "June 09, 2022, 06:28:38 PM",
      "body": "Its very weird to me, that coldcard advertises the NFC feature (that I would appreciate) but nobody seems to question that in reality it is impossible to use. Even on their website where you can find manuals for every last bit of the device they don't even mention the feature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "June 09, 2022, 07:18:10 PM",
      "body": "Quote from: hZti on June 09, 2022, 06:28:38 PMIts very weird to me, that coldcard advertises the NFC feature (that I would appreciate) but nobody seems to question that in reality it is impossible to use. Even on their website where you can find manuals for every last bit of the device they don't even mention the feature.You should ask mister NVK about that and not us, he is sometimes lurking around here.Coldcard mk4 is new device so I really don't know how NFC works, I really don't care much about it and I don't like it, but I know this a chip that can transfer any data in similar way like wireless is working but with short range.If I can send bitcoin transaction with QR codes, sd cards and cables, than I see no reason why NFC would be any different.I am not 100% sure, but I think their NFC chip is closed source, so they couldn't reveal everything even if they wanted to do it. NVK is using universal solution answer to all questions people have related with mk4 devices:Quote from: nvK on May 24, 2022, 09:07:19 PMSecurity model https://raw.githubusercontent.com/Coldcard/firmware/master/docs/mk4-security-model.mdDual SE design https://raw.githubusercontent.com/Coldcard/firmware/master/docs/mk4-secure-elements.mdThis is what NVK said about NFC used for ColdCard mk4 in Bitcoin Magazine few months ago:QuoteIn the connections front, the user can opt into using NFC with the Mk4 by enabling it in the device’s settings as the feature will come disabled by default. Once turned on, NFC will enable the COLDCARD to come near a compatible device to sign a transaction or a message, co-sign in a multisig setup, or share information from the device’s MicroSD card like a payment address or an extended public key, a partially-signed Bitcoin transaction (PSBT), a text file, or a transaction file.Coinkite founder NVK told Bitcoin Magazine that the goal with NFC is to lower cost, improve UX, and further adoption.“Imagine hardware wallets being able to just tap-to-pay,” he said.Although QR codes have recently become popular in some hardware wallets, NVK said they haven’t been adopted in the larger payment industries because they have extremely low data bandwidth, are more complex and not human readable, and require more expensive hardware.“This feature was added to improve phone-wallet UX as all modern phones have NFC, free, already sitting unused,” NVK said. “NFC will be available to all COLDCARD functions we are able to send or receive data, just like the SD card or USB cable.”In addition to requiring NFC to be turned on for usage, NVK told Bitcoin Magazine that the Mk4 will also enable the user to permanently disable the feature by scratching a PCB trace exposed on the MicroSD opening.https://bitcoinmagazine.com/business/inside-the-new-coldcard-mk4",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "June 09, 2022, 08:16:02 PM",
      "body": "I put in my reservation for a mk4 a couple of weeks ago.  I paid for it, and then a few days later I got an email stating my reservation has been turned into an order, and I should pay shipping.  I still haven't heard from them whether it has shipped or not, but I expect to receive it in the next few weeks.  I'm planning to do a thorough review of the wallet including it's NFC capacities once I get it.I didn't buy it for it's NFC capabilities, and honestly I don't plan to use that feature much if at all after playing with it, I just want get a picture of it's functionality.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "June 10, 2022, 07:05:51 AM",
      "body": "Quote“Imagine hardware wallets being able to just tap-to-pay,” he said.This made me laugh since I think at the moment the is really only the option to imagine that. Maybe he does he reply here to explain how it should work. Still the MK4 is a very nice device that I can recommend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "June 10, 2022, 03:40:24 PM",
      "body": "Quote from: hZti on June 09, 2022, 06:28:38 PMIts very weird to me, that coldcard advertises the NFC feature (that I would appreciate) but nobody seems to question that in reality it is impossible to use. Even on their website where you can find manuals for every last bit of the device they don't even mention the feature.Just a theory, but maybe all the delays are due to the software not being ready?Quote from: DireWolfM14 on June 09, 2022, 08:16:02 PMI put in my reservation for a mk4 a couple of weeks ago.  I paid for it, and then a few days later I got an email stating my reservation has been turned into an order, and I should pay shipping.  I still haven't heard from them whether it has shipped or not, but I expect to receive it in the next few weeks.  I'm planning to do a thorough review of the wallet including it's NFC capacities once I get it.I didn't buy it for it's NFC capabilities, and honestly I don't plan to use that feature much if at all after playing with it, I just want get a picture of it's functionality.I'm looking forward to your review! Outside Bitcointalk, almost all such reviews are paid and sponsored, so they're not very trustworthy.Quote from: hZti on June 10, 2022, 07:05:51 AMStill the MK4 is a very nice device that I can recommend.How can you recommend it if you didn't even receive (or order?) it and test it thoroughly?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "June 10, 2022, 05:35:31 PM",
      "body": "Quote from: n0nce on June 10, 2022, 03:40:24 PMQuote from: hZti on June 10, 2022, 07:05:51 AMStill the MK4 is a very nice device that I can recommend.How can you recommend it if you didn't even receive (or order?) it and test it thoroughly?Since the beginning of this thread I have receive my coldcard Mk4 (actually two of them) and used it quiete a lot. If you have any questions feel free to ask but other then the NFC feature everything is as I would have expected it to be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "June 11, 2022, 10:56:12 PM",
      "body": "Quote from: hZti on June 10, 2022, 05:35:31 PMQuote from: n0nce on June 10, 2022, 03:40:24 PMQuote from: hZti on June 10, 2022, 07:05:51 AMStill the MK4 is a very nice device that I can recommend.How can you recommend it if you didn't even receive (or order?) it and test it thoroughly?Since the beginning of this thread I have receive my coldcard Mk4 (actually two of them) and used it quiete a lot. If you have any questions feel free to ask but other then the NFC feature everything is as I would have expected it to be.Oh really? I thought the MK4 did not ship yet! Was there a preorder or something like that?I wouldn't use NFC just as I wouldn't use Bluetooth in a hardware wallet, but it would still be neat if you could check if there is software that supports this feature yet and if you have hardware that works with it (laptop / phone) and how well it works!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "June 12, 2022, 06:08:38 AM",
      "body": "Yes there was quiete a long preorder period but now I think it is officially on sale and you can get it in aroubd 3 weeks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}