{
  "id": "topic_5461417",
  "title": "Shortmaster",
  "author": "Shortmaster",
  "created_time": "July 29, 2023, 05:22:36 PM",
  "content": "Btc is cup money is liquid the water and Banks are from the word like a River bank.So money currency is water and btc IS the cup all assets gold btc and other crypto are the cups where the money the water flowing in.Those who got cups to collect the water when it's raining those got most of the water so to speak they got most of the money.If u sell btc early it means you empty your cup ...btc is big cup small coins smaller cups they full faster then biggest cup the bitcoin.Those who got cups when its raining they collect the most of the money more water more cups needed to collect water.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461417",
  "comments": [
    {
      "author": "nelson4lov",
      "created_time": "July 29, 2023, 05:31:13 PM",
      "body": "The explanation sounds complicated to me even though there are no technical terms in it. I'm not saying your analogy is bad but it could use some fine-turning here and there. For me, I just see bitcoin as Money but in a digital system without any mediator or intermediary to dictate or monitor if it could be spent or how it was spent.Quote from: Shortmaster on July 29, 2023, 05:22:36 PM btc IS the cup all assets gold btc and other crypto are the cups where the money the water flowing in..Gold is not decentralized so it would be wrong to fit both BTC and gold in the same category.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "July 29, 2023, 05:33:10 PM",
      "body": "I think you are trying to become \"metaphor aficionado\" but believe me, you need so much practice. You need to work on your grammatical errors and use of comma is necessary to give some gap between statements. Well, other than this, i understood your point and i am agreed with it. We all have to get some CUP to store Money in it. And BTC is one of the best CUP i have came so far to know about. But you also mentioned Gold as good CUP too. But not all BTC CUP holders will agree with it.But i will agree to some extent only. Because, BTC is far better than GOLD in many ways and i prefer BTC over GOLD. And, i have some opinions about your title. Which are if you wanted to explain someone about BTC then your metaphoric example is great but it need some upgradation and some more simplicity. Now it is on you to make a simple example. But this example does not differentiate between GOLD and BTC because you are referring both as same CUP while they are not. You must find some more accurate example. (IMHO).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "komisariatku",
      "created_time": "July 29, 2023, 05:44:34 PM",
      "body": "Although your parable is quite difficult to understand, maybe I understand your point a little. Bitcoin is a tool for making profit, that's the point, right?I think talking bitcoin is not that easy. Bitcoin does offer advantages for those who are patient and dare to hold bitcoin for a long time. But what if you bought bitcoin at a high and it went down like it is now? can bitcoin still be called a cup?Bitcoin investment has a lot of risks and you need to understand the basics of bitcoin, there are times when we need to sell bitcoin when the price drops deeper, there are times when we buy when we feel the price of bitcoin is low enough. Unless you plan to hold bitcoins for a long time, you probably won't need to check bitcoin's price movements very often, but it's not easy either. I often panic when I see bitcoin prices continue to fall and eventually sell my bitcoins",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "July 29, 2023, 06:31:06 PM",
      "body": "That's such a bad analogy lol and don't even try to explain bitcoin to people in a profit-related viewpoint — you're going to get people burned. There are so many good content, so just point them to that. Don't try to explain something you don't understand especially when money is involved.* If you like reading articles: https://coindesk.com/learn* If you like reading books: https://theinternetofmoney.info/* If you like watching videos: https://www.youtube.com/playlist?list=PLPQwGV1aLnTuN6kdNWlElfr2tzigB9NnjSecurity related:* https://chainsec.io* https://www.lopp.net/bitcoin-information/security.htmlIf you want to get more technical* https://github.com/bitcoinbook/bitcoinbook#chapters",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "July 29, 2023, 06:33:40 PM",
      "body": "Quote from: Shortmaster on July 29, 2023, 05:22:36 PMBtc is cup money is liquid the water and Banks are from the word like a River bank.So money currency is water and btc IS the cup all assets gold btc and other crypto are the cups where the money the water flowing in.Those who got cups to collect the water when it's raining those got most of the water so to speak they got most of the money.If u sell btc early it means you empty your cup ...btc is big cup small coins smaller cups they full faster then biggest cup the bitcoin.Those who got cups when its raining they collect the most of the money more water more cups needed to collect water.Jeez your post would have been more understandable if you had  used any punctuation mark.Right now, all your text are jammed together making it almost impossible for us to make a sense out of it.Bitcoin is cup, money is water. Instead of going through that stress, why not just do it the easy way? I've seen some alternate explanations for bitcoin to laypeople, but yours should not be included because it's even more technical than the standard explanation. If your technique can confuse those with minimal knowledge of bitcoin, consider what it will do to those with no knowledge of bitcoin at all. At the very least, you should try to improve your post and include appropriate punctuation to make it more readable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "July 29, 2023, 06:44:15 PM",
      "body": "Op, don't ever try to explain Bitcoin to anyone like that; you'll confuse both yourself and the person you're explaining it to. Bitcoin is not a \"cup\" that holds money; Bitcoin IS money - digital money, plain and simple.And, if you want to delve into more details about Bitcoin, I recommend checking out what mk4 wrote and using his sources. You'll get a full explanation of the entire concept, in both a simple and detailed manner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "July 29, 2023, 07:02:11 PM",
      "body": "I am confused on what you are trying to explain about how you explained BITCOIN. Gold and BTC is not the samd although yoi are right that gold have price while Bitcoin also have price. If you want to explain about Bitcoin in a simple way, here's what you should do, Bitcoin is e-money or electronic money like Paypal but the difference is there's no actual Bitcoin like the fiat money and also Bitcoin is decentralized meaning no one is controlling Bitcoin and no government is behind it. Bitcoin can also be used to buy online and if you don't believe you can search for transactions where Bitcoin is used as a payment and one of it is BTC to Pizza (One of Bitcoin History).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "July 29, 2023, 07:28:00 PM",
      "body": "You really used a good example to define the Investment opportunities like BTC and Gold. But many people do not consider BTC as an investment opportunity. They think of it just as a currency and use it as currency to pay for goods and services. But mostly people use it for investment. and then you must use an example, which uses some good similies like BTC is a cup ok and how can Gold be the same cup having the same characteristics. Gold and other investment plans must be differentiated from BTC so that the true potential of the BTC could be unleashed on newbies to understand it better. One of my community members made a post recently, about the true potential of BTC is in finding flaws in the current financial system. And I think you should start with that. BTC is decentralized and has limited supply but both are not present in gold, so you must use BTC as Financial Revolution or hedge against inflation but gold also plays that roles so, decentralization, anonymity, and scarcity are best.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "July 29, 2023, 07:30:33 PM",
      "body": "If you are to be a nursery school teacher, I will not make the mistake of sending my kids to your school before you confuse their brains for nothing.If you were the one to first explain bitcoin to people, I'm certain we would definitely have less than 10% of what we have right now as bitcoiners because it will be hard for people to really know the angel which you are pointing at. As for me, even with the little knowledge I have regarding bitcoin, I still can't explain what you mean by your entire content. I was thinking English was the problem, but that is really far from the truth. All I can see is some students trying to outsmart their professor but end up using the worst analogy to explain a term they assume they know everything about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "July 29, 2023, 07:42:55 PM",
      "body": "Quote from: nelson4lov on July 29, 2023, 05:31:13 PMThe explanation sounds complicated to me even though there are no technical terms in it. I'm not saying your analogy is bad but it could use some fine-turning here and there. For me, I just see bitcoin as Money but in a digital system without any mediator or intermediary to dictate or monitor if it could be spent or how it was spent. It is not only you, I didn't comprehend what op is saying there. And if I can even understood it a bit, it would be that, the op is saying that bitcoin is a liquid in which everyone is using cup to come and fetch with big and small cups. Op has described bitcoin with the objects around to the way he understands it. Op if I were you, I have restructure the thread as everyone is complaining about the thread. Op what do you means? Please explain it in a layman explanation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "July 29, 2023, 08:14:38 PM",
      "body": "What is the essence of this explanation and what is the relation between bitcoin/cryptocurrency and the cup and how does the global financial statement and money follow into Bitcoin as an asset if Bitcoin doesn't provide the responded liquidity to absorb the financial flows as you claim,  so in essence my point is that,  bitcoin os not some free money printing scheme and whatever the volume of Bitcoin,  it is a corresponding valuation of the liquidity Bitcoin provides in form of trading volume. At some point,  newbies need to build the right knowledge about Bitcoin and its technical connection to the financial system is instead of building false knowledge based on fallacies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JoyMarsha",
      "created_time": "July 29, 2023, 08:38:10 PM",
      "body": "I'm attempting to edit your post to make it more understandable and appealing to readers. This is what I can come up with in your post.QuoteIn the financial and investment world, money is act like liquid water while bitcoin is taken as the cup. Banks are gotten from the river because it has many liquid water in it. Money is to be regarded as water while bitcoin is the cup of all assets which can be gold or other crypto projects, where the water(money) flows within it. During the rainy season, those who have cup collects most of the water. If peradventure you sell your bitcoin, you have empty your cup. Bitcoin is the big cup, altcoins have a small cup, and they get full faster. Those who got a cup when it's rainy collect most water. The more cup, the more water to be collected with the cup.Now, I think it's pretty understandable now that when you did not put a comma and full stops in your words. OP I completely concur with what you wrote about using bitcoin as a cup to demonstrate how the crypto market operates.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "July 29, 2023, 09:10:53 PM",
      "body": "Hmm, Cant understand the concept and the words seem to be from a different English linguistic, at least my poor English skills cant understand. As you've said the assets are the cups and Banks and currency money is the river buddy how can you store the river water in the cup, Hmm the explanation approach is not valid at all.Also, I don't know why are you comparing the altcoins to the assets class and with Bitcoin. Empty cup vs Full cup haha weird, I have some Bitcoin amount so my cup is full of the river, and if I don't have then my cup is empty haha is it sounding weird yeah, exactly same it was for me when I was reading the OP.Quote from: JoyMarsha on July 29, 2023, 08:38:10 PMI'm attempting to edit your post to make it more understandable and appealing to readers. This is what I can come up with in your post.QuoteIn the financial and investment world, money is act like liquid water while bitcoin is taken as the cup. Banks are gotten from the river because it has many liquid water in it. Money is to be regarded as water while bitcoin is the cup of all assets which can be gold or other crypto projects, where the water(money) flows within it. During the rainy season, those who have cup collects most of the water. If peradventure you sell your bitcoin, you have empty your cup. Bitcoin is the big cup, altcoins have a small cup, and they get full faster. Those who got a cup when it's rainy collect most water. The more cup, the more water to be collected with the cup.Now, I think it's pretty understandable now that when you did not put a comma and full stops in your words. OP I completely concur with what you wrote about using bitcoin as a cup to demonstrate how the crypto market operates.Haha buddy Thanks its Quite reasonable to share now because from the OP's post it was looking like I am trying to understand some sort of deep poetry, by Mirza",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "July 29, 2023, 09:17:08 PM",
      "body": "Quote from: Shortmaster on July 29, 2023, 05:22:36 PMBtc is cup money is liquid the water and Banks are from the word like a River bank.So money currency is water and btc IS the cup all assets gold btc and other crypto are the cups where the money the water flowing in.This your English is hard to understand and the nutshell is all about having the understanding that bitcoin is the solution and what the people needs for asset and currency, no any other for of fiat currency or assets of investment can be compared to what bitcoin have come to offer the world.Quote from: Shortmaster on July 29, 2023, 05:22:36 PMThose who got cups when its raining they collect the most of the money more water more cups needed to collect water.Bitcoin is like a rain which the down pour will never be enough for a cup to contain, we are the cups and bitcoin the rain, the rain also drops and converges at the river, no amount  of water a cup can fetch to get the whole river drained, bitcoin is the river and a stream that  always gives the financial support we ever wanted to have.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "July 29, 2023, 09:35:38 PM",
      "body": "OP, while the analogy of comparing money and cryptocurrencies to water and cups may be creative, this is not be the most appropriate or simple way to explain Bitcoin and cryptocurrencies to beginners. I think that analogies can be useful in simplifying complex concepts, but they must be clear and easily understood by the target audience. It seems to me that this one is not.Using water and cups to explain the concept of Bitcoin could lead to unnecessary confusion. For example, why use water as an analogy for money when everyone already understands that concept? In my opinion, a better approach would be to provide a clear and concise explanation of key aspects of cryptocurrencies, such as their decentralized nature, security, and how transactions are recorded on the blockchain. Using real-world examples and simple language can help beginners better understand the underlying concepts behind cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "July 29, 2023, 10:01:28 PM",
      "body": "@OP's explanation is confusing and even makes it more complicated.  I think it is better to keep on the simple explanation that is what is written on the Bitcoin whitepaper.  Using other terms and tools to explain can only complicate things and may stray away from the true meaning and purpose of Bitcoin.Quote from: Stalker22 on July 29, 2023, 09:35:38 PMOP, while the analogy of comparing money and cryptocurrencies to water and cups may be creative, this is not be the most appropriate or simple way to explain Bitcoin and cryptocurrencies to beginners. I think that analogies can be useful in simplifying complex concepts, but they must be clear and easily understood by the target audience. It seems to me that this one is not.Using water and cups to explain the concept of Bitcoin could lead to unnecessary confusion. For example, why use water as an analogy for money when everyone already understands that concept? In my opinion, a better approach would be to provide a clear and concise explanation of key aspects of cryptocurrencies, such as their decentralized nature, security, and how transactions are recorded on the blockchain. Using real-world examples and simple language can help beginners better understand the underlying concepts behind cryptocurrencies. Yeah, that is what I am saying, the cup and water simply means that Bitcoin is the holder of money which is really very confusing since Bitcoin as a currency can be considered as money itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "July 29, 2023, 10:02:59 PM",
      "body": "Quote from: Shortmaster on July 29, 2023, 05:22:36 PM-snip-From an economics perspective - I think you've made your point well clear even though some users said it was complicated. But why are you only focusing on value instead of other advantages like real use cases or something else?Yesterday I dug up some great resources for teaching beginners about bitcoin and what a good way to teach it. I found one of the useful thread fillippone has - it's great for teaching beginners about bitcoin.5 Resources to teach Average Joe about Bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "July 29, 2023, 10:04:18 PM",
      "body": "Someone would say to me on this forum that this is the strangest scenario he has ever heard. OP, I am really trying to understand the whole write-up, but it's a bit confusing. Bitcoin is a digital asset that other digital assets also try to compete with, but Bitcoin has always been outstanding in the crypto space, and the case with Bitcoin is that if you invest and hold it for a long time, you will make a profit. Those who sell out of panic make little or no profit. Although some people compare Bitcoin to gold because of its limited supply and high price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "July 30, 2023, 02:01:26 AM",
      "body": "This is the strangest link I have heard in a while and the strangest link between bitcoin, river and water. It is true that bitcoin can be like a cup that collects water (money) for you, but it is not the only one and it is wrong to consider it better than gold and other assets.Altcoins can be considered as a cup with holes, as its value decreases with time, and keeping it for a long time leads to thirst, so I can find some logic in your analogy.What people care about now is turning this water into money",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}