{
  "id": "topic_5409409",
  "title": "Twik",
  "author": "Twik",
  "created_time": "August 10, 2022, 08:10:06 PM",
  "content": "How can find this project team ? https://bitcointalk.org/index.php?topic=5371414.2940Website is online to now and there is n,t any news about the project .The team received BNB for IDO ,s  but suddenly all their work stopped. Can refund paid BNB ? or find team informational team to talk with them ?Thank you if any one help to connect with the Project members or their support or technicians or developers .",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409409",
  "comments": [
    {
      "author": "ryzaadit",
      "created_time": "August 11, 2022, 07:41:27 PM",
      "body": "It's a scam, all things is related to the project you are ask is deadWelcome to crypto and say goodbye to your fund, there are no refund things on a sale unless you are investing in legit project and there has some reason why the sale is canceled and the project refund the money.For example, you are investing a project on a trusted resource like \"Binance\" but for this case you are just investing to a scam project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ludmilla_rose1995",
      "created_time": "August 11, 2022, 07:51:18 PM",
      "body": "Quote from: Twik on August 10, 2022, 08:10:06 PMHow can find this project team ? https://bitcointalk.org/index.php?topic=5371414.2940Website is online to now and there is n,t any news about the project .The team received BNB for IDO ,s  but suddenly all their work stopped. Can refund paid BNB ? or find team informational team to talk with them ?Thank you if any one help to connect with the Project members or their support or technicians or developers .it's a scam project. if you have given your funds to an ICO, IDO or similar project then there is no hope for you to get the money back because smart contracts do not have an automatic cashback feature (if the recipient has received 100% funds) when the sender cancels it. It's better if you make a lesson that don't easily believe in a new project before you do in-depth research.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "August 12, 2022, 03:39:21 AM",
      "body": "Quote from: Twik on August 10, 2022, 08:10:06 PMHow can find this project team ? https://bitcointalk.org/index.php?topic=5371414.2940Website is online to now and there is n,t any news about the project .The team received BNB for IDO ,s  but suddenly all their work stopped. Can refund paid BNB ? or find team informational team to talk with them ?Thank you if any one help to connect with the Project members or their support or technicians or developers .Say sorry bro , its clearly a scam project and yes you are one of the victim .. This will lead you to learning that try not to invest in any new project that you don't fully understand .because this project has been created clearly to take your funds like all those who are noob but find greedy to invest longing to earn big profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "minairia3",
      "created_time": "August 12, 2022, 06:25:47 AM",
      "body": "I am so sorry to hear that this was a scam and that your money has been lost. As there is nothing you can do to get it back, it is best to forget it and learn a lesson, never invest in a new project again.It is obvious that we have bitcoin, ethereum, and hundreds of other top coins, so why not choose one of them, instead of joining a project that is in no way reliable. It's a newbie mistake, always.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lookmovies",
      "created_time": "August 12, 2022, 06:29:26 AM",
      "body": "One of the top free movie websites is LOOKMOVIE. where watching movies from anywhere, including the UK, Turkey, Canada, South Africa, etc., do not require registration.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OrangeII",
      "created_time": "August 12, 2022, 08:30:07 AM",
      "body": "Quote from: Twik on August 10, 2022, 08:10:06 PMHow can find this project team ? https://bitcointalk.org/index.php?topic=5371414.2940Website is online to now and there is n,t any news about the project .The team received BNB for IDO ,s  but suddenly all their work stopped. Can refund paid BNB ? or find team informational team to talk with them ?Thank you if any one help to connect with the Project members or their support or technicians or developers .it is very clear that this is a project scam. they try to run away from their responsibilities. Until now, their website cannot be accessed. If you have invested in this project, unfortunately, there is very little chance of what you invested in getting back. because this is what in-depth research is needed. we don't know how much we can trust a project, until they provide information about their team. I feel sorry about what happened to this project. This is the risk of investing in a new project. this makes us learn that investing in popular things like bitcoin or ethereum will be much safer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "terciduk123",
      "created_time": "August 24, 2022, 05:36:03 PM",
      "body": "I was just trying to find information about the Dexgem project, But their site is no longer accessible and their Twitter account is suspended, You can only access their telegram group, But no one will respond, because the project team has gone with your money, so better forget your money, because it is impossible to return. Dexgem is a scam project",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "August 24, 2022, 06:21:10 PM",
      "body": "the site is inaccessible and there is no one you can contact, I think you have lost your money so forget it and come back to stand make it an experience for you, losing your money doesn't mean losing everything so my advice you need to do some research in the future before you invest your money, this is important and ask for opinion from this forum to avoid this kind of scam again in the future",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoperkele",
      "created_time": "August 24, 2022, 08:52:57 PM",
      "body": "Their latest telegram update was from last year where they said that they canceled their ico. You linked to bounty thread so are you looking for your bounty or did you buy from their ico? Either way it looks like you are not getting anything. I am sorry for your loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "August 24, 2022, 09:29:15 PM",
      "body": "Quote from: terciduk123 on August 24, 2022, 05:36:03 PMI was just trying to find information about the Dexgem project, But their site is no longer accessible and their Twitter account is suspended, You can only access their telegram group, But no one will respond, because the project team has gone with your money, so better forget your money, because it is impossible to return. Dexgem is a scam projectDid some research as well and yes it’s a scam and the team leave the project already, this is very unfortunate to those who invested on this project, they are no longer active and I wonder when OP invest on this project when in fact their last activity was last year. This is a normal scheme, and many IDO projects are scam so be careful on dealing with the new project, if they are offering a too good to be true services and profit, better to stay away.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "August 24, 2022, 10:09:10 PM",
      "body": "If a team and project suddenly disappear with all the funds, don't assume that you'll still be able to get a refund. That's what we call, rug pull.And that's usually happening now, yeah, still now despite the market is already bearish. The projects that have the intention to do that from the beginning will never change their plans of doing so. And that makes everyone should be wary of the projects where they're investing their money because it's highly unlikely a project refund investments to their investors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dark1234",
      "created_time": "August 24, 2022, 10:35:58 PM",
      "body": "this is where we have to be careful in choosing to join a project, and the project that has been mentioned is clearly a scam, we don't need to give a reason because your writing is a real proof of the projectQuote from: Twik on August 10, 2022, 08:10:06 PMWebsite is online to now and there is n,t any news about the project .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "August 24, 2022, 10:55:01 PM",
      "body": "Quote from: Twik on August 10, 2022, 08:10:06 PMHow can find this project team ? https://bitcointalk.org/index.php?topic=5371414.2940Website is online to now and there is n,t any news about the project .The team received BNB for IDO ,s  but suddenly all their work stopped. Can refund paid BNB ? or find team informational team to talk with them ?Thank you if any one help to connect with the Project members or their support or technicians or developers .As others have said, it's a scam, the bounty manager has been tagged already. However, it might be too late for you or for others who might have invested on this project.So there will be no Project members or supports or developers to reach out, sorry to burst the bubble for you. Hopefully though this is a big lessons for you, might be expensive though. So just before investing your hard earned money, better check everything first and do you own investigation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "X-ray",
      "created_time": "August 24, 2022, 11:58:59 PM",
      "body": "No chance to contact them. The website is still online doesn't mean if the are still working on it. They have gone and i saw that. This project was a scam. It has been running by a manager which has bad reputation. So, did you have participated in the bounty campaign or its public sale? Im sorry for your lose if you have been sending them some BNB. They have scammed you. You must be careful with so many scam projects that appeared at the same time these days. It's very hard to know that which bounty that was a scam and which is not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chato1977",
      "created_time": "August 25, 2022, 04:40:45 AM",
      "body": "Quote from: Wahyuihib on August 25, 2022, 03:58:22 AMThis is indeed the risk that we must face when participating in the implementation of IDO against scam projects. They deliberately stopped the project after getting large amounts of funds from IDO participants, including yourself. Consider this a valuable lesson and immediately forget about your lossesand I believe that OP had already understand this now and wont bother joining again o investing by all means .why risk in such a project if not total greediness?we can invest in more safer and more trust worthy project like this one.sorry for your losses op and hope you'll find good one sooner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ilovealtcoins",
      "created_time": "August 25, 2022, 04:45:27 AM",
      "body": "Quote from: Twik on August 10, 2022, 08:10:06 PMHow can find this project team ? https://bitcointalk.org/index.php?topic=5371414.2940Website is online to now and there is n,t any news about the project .The team received BNB for IDO ,s  but suddenly all their work stopped. Can refund paid BNB ? or find team informational team to talk with them ?Thank you if any one help to connect with the Project members or their support or technicians or developers .It's a scam, so you should forget about them. there are so many good coins out there why no one cares but people just love to invest in junk projects from bounty campaigns. I never invest in the projects featured on the bounty campaign board, they are completely useless, useless projects that just want to make money with zero capital. LOL",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "doomloop",
      "created_time": "August 26, 2022, 07:42:19 AM",
      "body": "Quote from: Wahyuihib on August 25, 2022, 03:58:22 AMThis is indeed the risk that we must face when participating in the implementation of IDO against scam projects. They deliberately stopped the project after getting large amounts of funds from IDO participants, including yourself. Consider this a valuable lesson and immediately forget about your lossesDid they really get a large amount for this project? Or maybe the reason for the postponement of the project is lack of funds? And it's not possible for them to do a refund because the money that they are receiving is slowly being used on the production cost.You cannot just say that those who lose their funds will immediately forget what happened because you don't know what if this was their first time? And what if they use a really huge amount because they believe on the project? But time heals as they say, so these people can always recover sooner or later. @op you can just visit their webpage because you said it was still online? There must be a contact details there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasisog",
      "created_time": "August 26, 2022, 06:59:33 PM",
      "body": "Quote from: Twik on August 10, 2022, 08:10:06 PMHow can find this project team ? https://bitcointalk.org/index.php?topic=5371414.2940Website is online to now and there is n,t any news about the project .The team received BNB for IDO ,s  but suddenly all their work stopped. Can refund paid BNB ? or find team informational team to talk with them ?Thank you if any one help to connect with the Project members or their support or technicians or developers .I have heard about this project before and yes, it's a scam and unfortunately, you couldn't have your money back again. There's no way for you to recover your funds and the only thing that you can do is just to move on and just take this experience as a lesson. The next time you'll invest, be sure to choose potential and legit projects. You should do some research so you won't waste your funds as well as your time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oceat",
      "created_time": "August 26, 2022, 09:34:44 PM",
      "body": "Never heard of this project before and since when do you exactly starting to invest in that project, OP? It seems like untrustworthy and a scam at the same based upon reading on the replies above me and why is that you only ask their team just now? It should be a common knowledge nowadays if someone would want to invest on a crypto project to do their own research about the team, the project, etc. I don't know why there are still people who fall for this kind of trap as a scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}