{
  "id": "topic_5411388",
  "title": "talkoncrypto Official",
  "author": "talkoncrypto Official",
  "created_time": "August 27, 2022, 04:36:57 AMLast edit: August 27, 2022, 05:03:25 AM by talkoncrypto Official",
  "content": "Hi After Wazirx been scrutinized by ED (Enforcement Directorate ) , another exchange which has been raided by ED is Coinswitch Kuber https://www.businesstoday.in/crypto/story/ed-raids-5-premises-linked-to-crypto-exchange-coinswitch-kuber-including-ceos-residence-345606-2022-08-26Q1) What could be the future of Indian Crypto Traders and InvestorsQ2) Are all these exchanges involved in Money Laundering or some kind of illicit ActivitiesQ3) They are providing instant loan from their liquidation which is ultimately people's moneyRead more at:https://economictimes.indiatimes.com/tech/technology/ed-searches-coinswitch-kubers-five-locations-under-money-laundering-probe/articleshow/93784283.cms?utm_source=contentofinterest&utm_medium=text&utm_campaign=cppstQ4) Does these exchanges working without any license or legal approvalsQ5) Are other existing exchanges fall under the same category Q6) Is it the  time for people to switch to peer to peer",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411388",
  "comments": [
    {
      "author": "EarnOnVictor",
      "created_time": "August 27, 2022, 11:00:19 AM",
      "body": "Quote from: talkoncrypto Official on August 27, 2022, 04:36:57 AMHi After Wazirx been scrutinized by ED (Enforcement Directorate ) , another exchange which has been raided by ED is Coinswitch Kuber https://www.businesstoday.in/crypto/story/ed-raids-5-premises-linked-to-crypto-exchange-coinswitch-kuber-including-ceos-residence-345606-2022-08-26Q1) What could be the future of Indian Crypto Traders and InvestorsQ2) Are all these exchanges involved in Money Laundering or some kind of illicit ActivitiesQ3) They are providing instant loan from their liquidation which is ultimately people's moneyRead more at:https://economictimes.indiatimes.com/tech/technology/ed-searches-coinswitch-kubers-five-locations-under-money-laundering-probe/articleshow/93784283.cms?utm_source=contentofinterest&utm_medium=text&utm_campaign=cppstQ4) Does these exchanges working without any license or legal approvalsQ5) Are other existing exchanges fall under the same category Q6) Is it the  time for people to switch to peer to peer In summary, India is one of the countries that do not hide their dislike for crypto, which to me is gross and caused by a lack of proper education about cryptocurrency. What I believe any reasonable government should do is regulate it effectively so that they don't deprive their citizen of the benefits that crypto brings.Also, we should not be ignorant of the illegality of the exchanges and other dealers of cryptocurrency as well which no serious government would accommodate.However, I fear for the future of crypto in the country if the Cryptocurrency and Regulation of Official Digital Currency Bill of 2021 are finally assented to by the president. The bill will prohibit all the private cryptocurrency companies in the country and the case will be like that of Nigeria, or worse. So, P2P may then be the order of the day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "August 27, 2022, 02:45:07 PM",
      "body": "I came about this concerning Indian on cryptocurrency, but am sure they are referring to other cryptos and not bitcoin, they claim this  cryptocurrency will negatively affect our currency, capital flows and the stability of the banking industry, Reserve Bank of Indian  then i asked, where have been the 30% tax charges on crypto entities going to, haven't they also benefited all the way from the crypto world, they government levied high tax payment on crypto yet make complaints, but i think they have right from time supported cryptocurrency long time ago without their awareness since the government can bouyantly accept payment via cryptocurrency for tax.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "August 27, 2022, 03:22:51 PM",
      "body": "I remember the last few years that India did not have a firm stand with its policies. What I'm thinking is that India didn't really like cryptocurrencies from the start, but due to some differences in the goals of politicians, freedom is sometimes given without careful consideration.Quote from: talkoncrypto Official on August 27, 2022, 04:36:57 AM-snip-Q6) Is it the  time for people to switch to peer to peer I don't know, maybe it's happening right now. Some time ago I saw a post that locals still accept bitcoins for their transportation service fees. It seems that legal sanctions have only been effective for companies, not individuals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Leviathan.007",
      "created_time": "August 29, 2022, 11:46:26 AM",
      "body": "Regading India I see many bitcoiners and cryptocurrency investors and you can even see many active Indian forum members here in this forum but it seems like the government is against it and that's not surprising whenever the governments see there are many people active this in this field there are not any benefits for the government on it they will try to somehow fight to agist them, however as fat as I know if you do not use the centralized exchanges or the local exchanges where you have to leak your personal information, the Indian bitcoiners won't have any problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "August 29, 2022, 12:45:57 PM",
      "body": "India ranks 63rd in the global \"ease of doing business\" list that is released by World Bank. So you can easily understand the kind of hostility and corruption a business has to deal before they can start operating in India. Now cryptocurrency is an unstructured business area here which doesn't have any proper legal framework. So there are a lot of open questions as well. What I foresee is that crypto exchange operators are going to have a hard time to prove their innocence. It's best for them juat to leave India and move to some crypto friendly nations like Singapore just as Zebpay did.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "8rch7",
      "created_time": "August 29, 2022, 01:25:49 PM",
      "body": "Until now, bitcoin is still the favorite of crypto investors in India, when it comes to crypto, it is certain that India has its own favorite, because according to market capitalization, bitcoin is the most traded crypto in India, maybe because of the large number of trades, it becomes the future of traders. and investors in India, even Prime Minister Narendra Modi is also planning progressive steps in the future related to crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptocurencyKing",
      "created_time": "August 29, 2022, 01:34:07 PM",
      "body": "p2p has been the future of cryptocurrency and would be the future of Indian crypto traders residing in India. There is nothing new with India instilling harsh policies on crypto investment and investors. They do there best in trying to use all negativity for which the local fiat currency also have and tie it up with cryptos. Still, crypto remains a taxable commodity within there jurisdiction and you wonder why is that.There is no stopping for a people seeking g new ways to do things, invest and make there living of it. Harsh policies would be the drive to a more decentralized/reserved way of operation and that's where they are pushing then to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "August 29, 2022, 01:34:23 PM",
      "body": "First of all, India Government strongly announced that they are against on crypto through implementing law that will give burden to all people that will invest on it. Government will gonna control what’s allowed and this taking down of crypto firm will just continue as long as same government is taking control India. We can’t do anything to change that fact and we are just denying that fact all this time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "newIndia",
      "created_time": "August 29, 2022, 01:36:04 PM",
      "body": "Quote from: talkoncrypto Official on August 27, 2022, 04:36:57 AMQ1) What could be the future of Indian Crypto Traders and InvestorsDon't worry bro. Everything will be fine.Quote from: talkoncrypto Official on August 27, 2022, 04:36:57 AMQ6) Is it the  time for people to switch to peer to peer OGs are all on P2P and DEX. Only noobs waste their time on shitty centralized exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "August 29, 2022, 01:38:40 PM",
      "body": "They banned it, unbanned it. They restricted it and lifted restrictions.These past events just remind you that you should never trust any platform for your money. Store it in your wallets with keys or seeds you can own. Only send your coins to exchanges if you want to take profit. When you complete your trade to take profit or to get fiat, withdraw your money or your coin as soon as possible.The longer you leave it on exchanges, the more risk you have.Don't trade all your money in one trade, it's risky. Because you will have to send your coin for that big trade. If the exchange is shutdown before you can trade, you lose money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0ne",
      "created_time": "August 29, 2022, 02:27:11 PM",
      "body": "Quote from: avikz on August 29, 2022, 12:45:57 PMIndia ranks 63rd in the global \"ease of doing business\" list that is released by World Bank. So you can easily understand the kind of hostility and corruption a business has to deal before they can start operating in India. Now cryptocurrency is an unstructured business area here which doesn't have any proper legal framework. So there are a lot of open questions as well. What I foresee is that crypto exchange operators are going to have a hard time to prove their innocence. It's best for them just to leave India and move to some crypto friendly nations like Singapore just as Zebpay did. This is true. India have got a big market and that purpose most of the corporate networks prioritise India. The hard reality, during the initial setting up of the firm they'll face hard times. Major problem is the corruption, if one is able to give bribe things will happen in a much faster way. Everything starts from the top order of the political network. Not only zebpay, many other firms have moved to Dubai and Singapore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "August 29, 2022, 02:39:24 PM",
      "body": "Quote from: Leviathan.007 on August 29, 2022, 11:46:26 AMRegading India I see many bitcoiners and cryptocurrency investors and you can even see many active Indian forum members here in this forum but it seems like the government is against it and that's not surprising whenever the governments see there are many people active this in this field there are not any benefits for the government on it they will try to somehow fight to agist them, however as fat as I know if you do not use the centralized exchanges or the local exchanges where you have to leak your personal information, the Indian bitcoiners won't have any problem.When the government cannot maximize their profit due to the lack of control of the cryptocurrencies, they will gonna deny the possible way of giving their people free access to it, and no surprise because this country has been hostile to bitcoins since then. they even implemented heavy taxes for both the traders and the exchanges operating in their country. Now the bitcoiners out there will gonna have a hard time finding new exchanges that could fit their current situation because if they are not careful enough, the next raid is on their homes. What a complicated place to live for mere traders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "August 30, 2022, 07:31:47 AM",
      "body": "Raid doesn't necessarily mean they are doing something wrong, its just an action to prove they are doing something wrong so after the raid is there any report from the officials about violations made by the exchanges? If not then they are going to work as the same way as before.But Indian exchanges facing huge downfall since the implementation of new policies regarding cryptocurrencies recently which is 31% tax if I am not wrong so based on this the traders will look for alternatives which doesn't connect with any centralized exchange to avoid paying unfair amount of taxes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xxmodded",
      "created_time": "August 30, 2022, 08:38:37 AM",
      "body": "So sad what happen with Indian cryptocurrency trader or investor, by the way except with WazirX what another alternative exchange market local do you use right now? my country have several trusted and have been under government regulation and we have many option kind for withdrawing except Binance still support if try to withdraw. I think there in your country have close all option with local exchange market better adopt with Binance as your way for withdrawing or deposit fund trough P2P. But you need all your country community keep active make transaction there beside still have another option like convert your cryptocurrency fund with other digital currency like PayPal, Perfect Money or other kinds of digital currency allow in your country except bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "August 30, 2022, 09:24:31 AM",
      "body": "Quote from: talkoncrypto Official on August 27, 2022, 04:36:57 AMQ1) What could be the future of Indian Crypto Traders and Investors The raid on exchanges is not a raid on crypto traders and investors, so as long as they hold, another means through which they can trade will still come up in the future, and besides, there are other international exchanges they can switch to, like binance and the rest. Quote Q2) Are all these exchanges involved in Money Laundering or some kind of illicit Activities Personally, I wouldn't know, but I think for the fact that bitcoin is not legal in India, is enough justification for the raid.Quote Q3) They are providing instant loan from their liquidation which is ultimately people's money Investors are always the ones that loss more in situations like this, that is one thing that pains me to my bones each time I hear stuffs like this. Quote Q4) Does these exchanges working without any license or legal approvals Like I said before, since bitcoin is banned in India, it is certain that this exchanges are operating without license and legal backing or approval. Quote Q5) Are other existing exchanges fall under the same category  \"No\" is the answer, there are several other exchanges that are not operating under or within the Indian territory, such exchanges does not fall under the same category with those that are raided. Quote Q6) Is it the  time for people to switch to peer to peer For bitcoin to be transacted through peer to peer was the main vision of satoshi Nakamoto when he developed bitcoin, maybe it is time to switch to peer to peer, but I doubt how effective this is going to be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "August 31, 2022, 09:44:40 AM",
      "body": "Quote from: Beparanf on August 29, 2022, 01:34:23 PMWe can’t do anything to change that fact and we are just denying that fact all this time.Everyone can do something to change situation of their lives. When it has to do with the government that has given you less expectations of what you want to better your lives and business, you wait to vote them out during election and when the next campaigners come for your vote then during manifestos of what policy they want to preach to you then you ask question to them to know who has better purpose for your aspirations and business. Youths in india are more into cryptocurrency trading so to wait for new administration is better to take your next decision to vote them out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "August 31, 2022, 02:21:35 PM",
      "body": "Quote from: talkoncrypto Official on August 27, 2022, 04:36:57 AMHi After Wazirx been scrutinized by ED (Enforcement Directorate ) , another exchange which has been raided by ED is Coinswitch Kuber https://www.businesstoday.in/crypto/story/ed-raids-5-premises-linked-to-crypto-exchange-coinswitch-kuber-including-ceos-residence-345606-2022-08-26Q1) What could be the future of Indian Crypto Traders and InvestorsIndia has imposed highest taxation on cryptocurrencies and has restricted it to be used as a legal tender.While we can say that crypto trading is now legal in India, the high taxation is still a burden for many.The Indian crypto community is very big as many big investors are investing in crypto.So the support towards crypto from India is massive but at the same time the Indians have to fight this war against the government towards better crypto regulations.QuoteQ2) Are all these exchanges involved in Money Laundering or some kind of illicit ActivitiesMost of the exchanges are involved in money laundering. Not only exchanges but many famous people and celebs are also involved in money laundering.So that's something that nobody can do anything about. This is why they say not to hold your funds on exchanges at first place.Holding crypto in a non-custodial wallet or a hardware wallet is the way to go.QuoteQ3) They are providing instant loan from their liquidation which is ultimately people's moneyRead more at:https://economictimes.indiatimes.com/tech/technology/ed-searches-coinswitch-kubers-five-locations-under-money-laundering-probe/articleshow/93784283.cms?utm_source=contentofinterest&utm_medium=text&utm_campaign=cppstIf you are so bothered about that then stop using leveraged trading at first place. This is how exchanges operate and it's normal.Once our funds are liquidated it becomes the exchanges' property. There's nothing we can do about it.QuoteQ4) Does these exchanges working without any license or legal approvalsI think they must be having a license to run an exchange because without a license and approval it's very hard to keep the exchange running.The authorities would have banned the exchange long ago if it wouldn't have a valid license.QuoteQ5) Are other existing exchanges fall under the same category Most Indian exchanges are having valid licenses and are operating from India but because of the strict regulations they are planning to shift outside India.QuoteQ6) Is it the  time for people to switch to peer to peer Yes, peer to peer is the best thing probably but the major hassle is to make sure the peer is a genuine person.People get into trouble if the source of money being sent or received is from an illegal source.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GigaBit",
      "created_time": "September 01, 2022, 12:29:31 PM",
      "body": "Quote from: Xxmodded on August 30, 2022, 08:38:37 AMSo sad what happen with Indian cryptocurrency trader or investor, by the way except with WazirX what another alternative exchange market local do you use right now? my country have several trusted and have been under government regulation and we have many option kind for withdrawing except Binance still support if try to withdraw. I think there in your country have close all option with local exchange market better adopt with Binance as your way for withdrawing or deposit fund trough P2P. But you need all your country community keep active make transaction there beside still have another option like convert your cryptocurrency fund with other digital currency like PayPal, Perfect Money or other kinds of digital currency allow in your country except bitcoin.Crypto investors will certainly express their displeasure when a country's government tries to impose arbitrary taxes on cryptocurrency traders. Basically cryptocurrency is the only asset that no one has control over except the owner. If Wazir X falls on such restrictions, there will be a huge drop in customer base. Also, everyone will be interested in using other exchange sites. So I think it's in everyone's interest that cryptocurrencies should be allowed to run at their own pace. However, Investors still have options, so i don't think it will not make any bad effect at the moment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "September 01, 2022, 10:58:59 PM",
      "body": "Quote from: GigaBit on September 01, 2022, 12:29:31 PMQuote from: Xxmodded on August 30, 2022, 08:38:37 AMSo sad what happen with Indian cryptocurrency trader or investor, by the way except with WazirX what another alternative exchange market local do you use right now? my country have several trusted and have been under government regulation and we have many option kind for withdrawing except Binance still support if try to withdraw. I think there in your country have close all option with local exchange market better adopt with Binance as your way for withdrawing or deposit fund trough P2P. But you need all your country community keep active make transaction there beside still have another option like convert your cryptocurrency fund with other digital currency like PayPal, Perfect Money or other kinds of digital currency allow in your country except bitcoin.Crypto investors will certainly express their displeasure when a country's government tries to impose arbitrary taxes on cryptocurrency traders. Basically cryptocurrency is the only asset that no one has control over except the owner. If Wazir X falls on such restrictions, there will be a huge drop in customer base. Also, everyone will be interested in using other exchange sites. So I think it's in everyone's interest that cryptocurrencies should be allowed to run at their own pace. However, Investors still have options, so i don't think it will not make any bad effect at the moment.Their crypto traders and investors will always find alternative trading platforms, that, I am certain.Just like when your exchange you used to trade suddenly closed their operations, you will be forced to find a new one.There will always be someone or a new site that will open up their services to cater such kind of service.This is not the end game for Indian crypto users, traders and investors. There may be another site which may provide better services for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}