{
  "id": "topic_5435987",
  "title": "Stakefast",
  "author": "Stakefast",
  "created_time": "January 19, 2023, 08:39:12 AM",
  "content": "BTCFinder.netBitcoin Private Key Finder 🔑I represent to you, BTCFinder  With BTCFinder you are able to generate millions of bitcoin adresses within seconds and checking each for transactions/balances.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5435987",
  "comments": [
    {
      "author": "NeuroticFish",
      "created_time": "January 19, 2023, 08:44:07 AM",
      "body": "Since you don't offer any open source code to be ran locally, I can easily expect that you have also implemented the part where you cash in the money from the found private key (what would stop you?)Apart of that, we do know that \"finding keys\" is 99.999.......999999% of the cases wasted time and resources, plus, if one finds by chance a private key and cashes in, that's... stealing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "January 19, 2023, 09:36:27 AM",
      "body": "So someone just woke up and created a website that generates Bitcoin private keys and shares it with the world for people to use, hoping that maybe someone could land on a private key with bitcoins?Obviously, there's a hidden motive behind the site. Maybe using people's computer resources while they think that they are busy looking for private keys",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CoinEraser",
      "created_time": "January 19, 2023, 07:08:11 PM",
      "body": "Quote from: NeuroticFish on January 19, 2023, 08:44:07 AM-snip-... if one finds by chance a private key and cashes in, that's... stealing.That's exactly what all people should be aware of. It is and remains theft. It's not a lucky find or anything like that. You steal someone else's property and enrich yourself at the expense of other people. Anyone who does something like this should think about how it would feel if their own coins were stolen. Even if the chance of finding a key is very, very, very small, no one should support such sites. It's usually just a waste of time and resources.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "January 20, 2023, 11:18:33 AM",
      "body": "Quote from: CoinEraser on January 19, 2023, 07:08:11 PMQuote from: NeuroticFish on January 19, 2023, 08:44:07 AM-snip-... if one finds by chance a private key and cashes in, that's... stealing.That's exactly what all people should be aware of. It is and remains theft. It's not a lucky find or anything like that. You steal someone else's property and enrich yourself at the expense of other people. Anyone who does something like this should think about how it would feel if their own coins were stolen. Even if the chance of finding a key is very, very, very small, no one should support such sites. It's usually just a waste of time and resources.  True, it is like getting someone's safe box and then trying different unlock combinations and then finally managing to open it and taking out the cash. That is plain theft or robbery. For many reasons, I am leaning more into tagging OP. Why should such a person be trusted?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CoinEraser",
      "created_time": "January 20, 2023, 02:04:13 PM",
      "body": "Quote from: logfiles on January 20, 2023, 11:18:33 AMQuote from: CoinEraser on January 19, 2023, 07:08:11 PM-snip-True, it is like getting someone's safe box and then trying different unlock combinations and then finally managing to open it and taking out the cash. That is plain theft or robbery. For many reasons, I am leaning more into tagging OP. Why should such a person be trusted?You're right. That's exactly what it describes. Unfortunately, there is more than this site that offers something like this. I wouldn't trust the OP and other operators of such sites, that's for sure. At least such sites show that it is almost impossible to find a key this way, but it doesn't really make it any better. Everyone has to decide for themselves whether that justifies an tag. I'm holding back, but I hope my opinion here in the thread will make people think.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "January 20, 2023, 03:49:59 PM",
      "body": "You can't combine these words (online tool for fast generating random Bitcoin adresses) into a sentence and then ask others to use your tool, why does the site need to be online to generate the addresses?This process does not need to connect to the Internet, and the lack of an open source version makes us not trust that all these private keys have been generated before and saved in a database with a link to a fast bot that dumps the address once you setup.You can say I have a fast CPU to generate millions of bitcoin adresses/second but WHY I NEED MILLIONS OF ADDRESS PER SECOND.Hence, it must be emphasized that even a reliable service run by a trusted person in the forum has turned into SCAM (My Cold Keys Just Got Swiped! All Halving Sets!!,) let alone an unknown account",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stakefast",
      "created_time": "January 21, 2023, 08:33:39 PM",
      "body": "Quote from: Husires on January 20, 2023, 03:49:59 PMYou can't combine these words (online tool for fast generating random Bitcoin adresses) into a sentence and then ask others to use your tool, why does the site need to be online to generate the addresses?This process does not need to connect to the Internet, and the lack of an open source version makes us not trust that all these private keys have been generated before and saved in a database with a link to a fast bot that dumps the address once you setup.You can say I have a fast CPU to generate millions of bitcoin adresses/second but WHY I NEED MILLIONS OF ADDRESS PER SECOND.Hence, it must be emphasized that even a reliable service run by a trusted person in the forum has turned into SCAM (My Cold Keys Just Got Swiped! All Halving Sets!!,) let alone an unknown accountYour comment, most especially the cold key swipe is just nonsense - he bought cold keys on here and is now wondering why his wallets are getitng cleared... absolutely no comparison to my website. If you find a bitcoin adress with balance its your choice of taking or maybe informing the owner of the leak. I am not responsible for anyone, neither do we collect any information of any sort.Thanks everyone for their comments, we will update the site accordingly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "January 23, 2023, 11:28:06 AM",
      "body": "Don't know why people attack the OP, there is already a bunch of open source applications designed especially to search for private keys with a speed of millions/ hundreds of millions of keys per second, why don't you go to their topics and slap some morality to their faces?Online key finders provide/ harness a small percentage of your computer power to search for the keys one is because they use CPU, another one is the fact that browsers do not allow websites to use a lot of resources from users systems.Finding keys especially for puzzle challenge is much more faster with GPUs, web browsers don't allow the use of GPU or at least no one has been able to find a way to use GPUs at max speed via browser.So if you want to waste your time and energy, go ahead and waste them, note that all of the similar services either take the coin(if you manage to find one) or will charge a very high amount as their fee, they usually won't show you the found key with a balance, they might tell you about the balance and even show you the address, but the private key is in their hands.I'm searching for one of the puzzle transactions with 28MK/s speed, searching with a speed under a million is just a sad joke right now.I tried your site and after seeing that clicking on a menu, button sends me to yet another site, I just closed it and won't recomend anyone to even visit the site where you have to go visit another site to learn things about the current one, lol just a poor attempt dude.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "January 23, 2023, 02:02:04 PM",
      "body": "Quote from: Stakefast on January 21, 2023, 08:33:39 PM he bought cold keys on here and is now wondering why his wallets are getitng cleared... absolutely no comparison to my website. If you find a bitcoin adress with balance its your choice of taking or maybe informing the owner of the leak. I am not responsible for anyone, neither do we collect any information of any sort.How can I be sure that I am the only one who has the private key and that no one will be able to generate that private key? You are talking about an online tool that needs to be online which means you can keep a copy of the private key, wait for me to send the coins, use a fast bot to transfer the coins once they are deposited and claim that you are not responsible for anything.What is the probability of finding an address with balance? Is it possible for this to happen to addresses that were generated at random?Quote from: digaran on January 23, 2023, 11:28:06 AMDon't know why people attack the OP, there is already a bunch of open source applications designed especially to search for private keys with a speed of millions/ hundreds of millions of keys per second, why don't you go to their topics and slap some morality to their faces?Because it is open source, you do not need to connect to the Internet, you can download and manage it locally.And because generating the address/private key does not require a high CPU ability to trust an anonymous third party.If his tool is open source and can be used without the need for the Internet, all negative comments will stop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CoinEraser",
      "created_time": "January 24, 2023, 10:20:43 AM",
      "body": "Quote from: digaran on January 23, 2023, 11:28:06 AMDon't know why people attack the OP, there is already a bunch of open source applications designed especially to search for private keys with a speed of millions/ hundreds of millions of keys per second, why don't you go to their topics and slap some morality to their faces? -snip-I wasn't attacking the OP personally, but I did voice my concerns about sites like this. One can generally see it this way. I'm not a fan of such sites with such a service I always see the danger that someone could lose their coins. Yes, I realize the chance is very, very small, but it's still there. That's why I don't like it when a new site like this comes out and I try to remind people what it means to use such sites. It's not a treasure hunt, it's theft when you use the keys you find to take coins that belong to someone else. But everyone can see it how they like it and it can certainly be discussed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}