{
  "id": "topic_5467449",
  "title": "rendravolt",
  "author": "rendravolt",
  "created_time": "September 20, 2023, 11:48:32 AMLast edit: September 20, 2023, 01:31:09 PM by rendravolt",
  "content": "Welcome to the AFC champions league 2023/2024 threadPlease comfortably discuss matches, results, betting odds and also all related news from clubs to players.With several participants from Saudi League teams, I think this competition will be even more exciting.These are the results of the 2023/2024 Champions League AFC group draw.The defending champion last season was Urawa Reds Diamond (JPN)List of AFC champions league leading teams along with the most title winners: https://en.wikipedia.org/wiki/AFC_Champions_LeagueWhich team will win the AFC Champions League 2023/2024 season this time?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467449",
  "comments": [
    {
      "author": "Strongkored",
      "created_time": "September 20, 2023, 12:35:59 PM",
      "body": "I know the AFC Champions League is not that well known and maybe in Asia itself it is not the main choice when there are matches from European leagues running at the same time as matches in this tournament, also the leagues in Asia are not well known except for the Saudi Pro league with lots of expensive players in the Japanese League it's also quite competitive, so many people won't know which clubs are the favorites in this tournament, because even though the Saudi Pro League is famous at the moment, there are definitely other teams that are better and favorites to win, maybe you could include a link to the list of top teams in this competition, and I really appreciate it because searching on google hasn't found it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "September 20, 2023, 01:02:30 PM",
      "body": "It looks like the club representatives from each country isn't equal. Some have 4 while others have just 1 or 2 so what's the AFC CL's policy here?Quote from: rendravolt on September 20, 2023, 11:48:32 AMWhich team will win the AFC Champions League 2023/2024 season this time?I have no idea but I'm guessing it would come from countries with strong football foundation like Japan and S. Korea. We can now add Saudi Arabia there with the influx of European players. I wanted to include Australia in there but they only have one team which I find strange.I'll just follow the group stage for now to see which teams standout. The betting comes after that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rendravolt",
      "created_time": "September 20, 2023, 01:28:02 PM",
      "body": "Quote from: Strongkored on September 20, 2023, 12:35:59 PMI know the AFC Champions League is not that well known and maybe in Asia itself it is not the main choice when there are matches from European leagues running at the same time as matches in this tournament, also the leagues in Asia are not well known except for the Saudi Pro league with lots of expensive players in the Japanese League it's also quite competitive, so many people won't know which clubs are the favorites in this tournament, because even though the Saudi Pro League is famous at the moment, there are definitely other teams that are better and favorites to win, maybe you could include a link to the list of top teams in this competition, and I really appreciate it because searching on google hasn't found it.I understand that competitions in mainland Asia are not very well known, and perhaps not many friends here follow the news developments. However, when a big influence comes from the Saudi league which brings in several famous European players, the AFC Champions League will definitely start to be highlighted by many media. The top teams in this competition are dominated by Korean, Japanese and Saudi Arabian teams. But when it comes to winning the most AFC Champions League titles, it is led by Al-Hilal (KSA) with 4 titles, Pohang Steelers (KOR) with 3 titles, and Urawa Red Diamonds (JPN) with 3 titles too. However, there are other top teams such as Jeonbuk, Ulsan, and Al-Ittihad which are also frequent champions and strong teams in this competition. In addition, you can find out more about the AFC Champions League through this source: https://en.wikipedia.org/wiki/AFC_Champions_LeagueAnd thank you for giving me advice.Quote from: Yogee on September 20, 2023, 01:02:30 PMIt looks like the club representatives from each country isn't equal. Some have 4 while others have just 1 or 2 so what's the AFC CL's policy here?Actually, I still don't really understand the existing policies, but if I quote from existing sources, this system has been in place since 2002.QuoteSimilar to Europe, Asia also has two levels of competition between clubs, the Asian Champions League and the AFC Cup. However, the relationship between the Asian Champions League and the AFC Cup is different from the relationship between the European Champions League and the Europa League.No club was eliminated from the Asian Champions League and then continued on to the AFC Cup. The system for distributing places for country representatives sent to these two competitions is also different. Not all countries have a place in the Champions League or AFC Cup. Some countries can only send representatives to the Asian Champions League, some can only send both, while others can only go to the AFC.This system was born in September 2002. At that time the AFC had a new chairman, Mohammed Bin Hammam. The new chairman of the AFC brought a vision for the development of Asian football which was later named, Vision Asia. This new vision became an ambitious project initiated by Bin Hammam to later become the basis for developing Asian football for 10 years.Here's the complete article: https://www.panditfootball.com/cerita/172476/ABI/150228/beberapa-hal-yang-jarang-diketahui-dari-sistem-kompetisi-antar-klub-asia",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "masulum",
      "created_time": "September 20, 2023, 02:09:09 PM",
      "body": "The arrival of European players to Saudi Arabia, including Ronaldo, has provided benefits for Asian football. The AFC Champions League will probably attract the attention of Ronaldo supporters in Europe, making Asia's highest champions league a match worth for watching. Unfortunately, no clubs from Indonesia have qualified for the ACL this season. Even though I think it would be really fun if the Indonesian team could meet representatives of the Saudi Arabian team.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "armanda90",
      "created_time": "September 20, 2023, 02:42:43 PM",
      "body": "AFC Champion League not really popular like UEFA Champion League bit in this season seema difderence because European top player departure success make AFC have been popular than usuallly. Cristoano Ronaldo and friend success bring AFC Champion League will be difference in this season and we are watching the same atmosphere with UEFA Champion League because many top European player from Saudi Pro League teams will participants in AFC Champion League. Usually AFC Champion League dominance by South Korean team but I doubt they have chance for winning tittle this season because Saudi Pro League teams have three participants teams and they have top European player in their squad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "marcous",
      "created_time": "September 20, 2023, 06:04:28 PM",
      "body": "Quote from: Strongkored on September 20, 2023, 12:35:59 PMI know the AFC Champions League is not that well known and maybe in Asia itself it is not the main choice when there are matches from European leagues running at the same time as matches in this tournament, also the leagues in Asia are not well known except for the Saudi Pro league with lots of expensive players in the Japanese League it's also quite competitive, so many people won't know which clubs are the favorites in this tournament, because even though the Saudi Pro League is famous at the moment, there are definitely other teams that are better and favorites to win, maybe you could include a link to the list of top teams in this competition, and I really appreciate it because searching on google hasn't found it.It's true that I agree with your opinion, however, this thread is very interesting to increase our literacy about AFC football. Personally, I don't really update information related to this competition, because I prefer UCL competitions and domestic leagues from European countries. The impact of Saudi investment in the development of its domestic league (Saudi Pro League), automatically influences the rise in AFC prestige thanks to the presence of clubs from the SPL. Even though it is less popular, Ronaldo existence will always be a trending topic for discussion.I think AFC will become trending on social media in the future, because Ronaldo fan base in the Asian region is quite large.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}