{
  "id": "topic_5468828",
  "title": "Taskford",
  "author": "Taskford",
  "created_time": "October 01, 2023, 09:58:49 PM",
  "content": "For so many attempts to hack our wallet and any other platform accounts we should be aware that hackers will do all just to penetrate on our account so sample of this on the image provided and we should never click that since getting compromise or anything that you don't like might happen to us.We should never get tempted or get curious to know about what random people sent to us on email or to the notifications sent by random apps so that we would not fall into their trap. Newbies are the targets of this frauds so they should remember than anything random offer is shady especially if they give huge money or bonus so start to doubt on what you read especially if you didn't participate on anything and most important of all don't download any random apps since you would provably receive a lot of this notifications.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468828",
  "comments": [
    {
      "author": "lionheart78",
      "created_time": "October 01, 2023, 10:03:36 PM",
      "body": "Any messages from email or social media that require downloading from a link should be taken into consideration carefully, even if the source is from the official site, there might be some instances that the site is hacked and the hacker puts a malware-infected file that can automatically be installed when downloaded.  We have seen lots of proof and event where a person got hacked because he downloaded some file or clicked some link from an unverified source.  So we must be in our utmost vigilance when receiving these kind of messages.  Best if it is not that important is ignore or delete them to prevent us from misclicking it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "October 01, 2023, 10:08:40 PM",
      "body": "It's important to always avoid any unexpected emails from unknown senders, irrespective of the email content. I have learned how to do that for a very long time now. Recently, I have been receiving a series of emails asking if either my blockchain account has been longed in or my PayPal account, and sometimes the email comes with a suspicious withdrawal attempt or a log-in to my Huobi exchange account. Since I know I have not used those exchanges for long and I don't have funds in them, nor am I expecting anything from them, I just don't fall for their prey. I will just advise you to block the sender; it will not completely stop them as they will still come with a different mail, but at least for the time being, it will reduce the level of spam mail that you will receive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tuturtinular",
      "created_time": "October 01, 2023, 10:10:28 PM",
      "body": "Quote from: Taskford on October 01, 2023, 09:58:49 PM~cut~There are a lot of spam emails containing bonus offers, but I never thought that there would be people who would be so generous in giving away bonuses for free. So it's better to just ignore messages like that and don't pay attention to them because they can have a bad impact on the security of the devices we use. Never download anything from unknown web addresses, it is very dangerous.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "October 01, 2023, 10:47:12 PM",
      "body": "Quote from: Taskford on October 01, 2023, 09:58:49 PMFor so many attempts to hack our wallet and any other platform accounts we should be aware that hackers will do all just to penetrate on our account so sample of this on the image provided and we should never click that since getting compromise or anything that you don't like might happen to us.We should never get tempted or get curious to know about what random people sent to us on email or to the notifications sent by random apps so that we would not fall into their trap. Newbies are the targets of this frauds so they should remember than anything random offer is shady especially if they give huge money or bonus so start to doubt on what you read especially if you didn't participate on anything and most important of all don't download any random apps since you would provably receive a lot of this notifications.This scammers are getting sophisticated day by day. The other day, a friend of mine was complaining bitterly how her WhatsApp app was hacked, I asked her what happened and she said, a random phone number that she's doesn't have on her contact list, sent her a link to click that she will win a price if she clicks on the link, she being naive and not knowing that this is the pattern scammers now use to deceive people, she went ahead and clicked on the link, immediately she did that, she was logged out of her WhatsApp app, and the person blocked her too, and they started using her WhatsApp to defraud her friend's on her WhatsApp, asking them for money and other gift items.So nowadays, please don't click on link sent to you from an unverified or a random person, either by mail or text message, who knows, you could be clicking your death warrant. Let's be very careful out there, because this guy's are diving into the crypto space.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "October 01, 2023, 10:59:18 PM",
      "body": "The rule of thumb should be that if you get an unexpected message from someone you don't know, than it's 100% spam/malware and you shouldn't even open it. Instead you should  mark it as spam so that your email service could automatically filter all similar messages in the future.You should be also careful to whom you are giving your email and have different emails for different types of sites, but getting spam is pretty much unavoidable because web services eventually get hacked and user information gets stolen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "October 01, 2023, 11:01:12 PM",
      "body": "I do get a lot of these with my teenage email and that's because I've been registering in almost everywhere before, I just sign up for anything that I see when I was curious and careless. Even til' now, they keep coming but I am not interested with them because I know that all of them are scams. There are also other topics but the same tactics that they're sending through email, like you're falsely hacked and they're giving you the scare that they've got your files, never click the link that they've included in that email because that's the first move that will make you phished and install some malware. Next time, to those that haven't learned about these email scams, never register anywhere or don't use your main email to random sign ups.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "October 01, 2023, 11:59:40 PM",
      "body": "I haven’t received any of such emails. I don’t believe these mails are just random, it’s possible that scammers target the email address of people who are in crypto. My theory is that they buy the addresses from the dark web, they could have these data after a crypto exchange or site has suffered a hack, users who have their emails linked to that platform are usually targeted by scammers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "October 02, 2023, 12:29:38 AM",
      "body": "Thanks for sharing Taskford.About files shared in an email or any chat platforms like Telegram, Discord, never click on it is a vital rule for everyone. It is more important rule to obey if you received it from a stranger, more reason to never click on it and download file then open it.About email you received, I would like to ask. Did it come to your Spam folder?Mostly emails from scammers will come to Spam folder that is a signal or can be considered as a red flag, don't click on it if the sender is a stranger.I resize your images too. Current ones are too big.Quote from: Taskford on October 01, 2023, 09:58:49 PM",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "October 02, 2023, 12:55:18 AM",
      "body": "Quote from: Spaceman1000$ on October 01, 2023, 10:47:12 PMThis scammers are getting sophisticated day by day. The other day, a friend of mine was complaining bitterly how her WhatsApp app was hacked, I asked her what happened and she said, a random phone number that she's doesn't have on her contact list, sent her a link to click that she will win a price if she clicks on the link, she being naive and not knowing that this is the pattern scammers now use to deceive people, she went ahead and clicked on the link, immediately she did that, she was logged out of her WhatsApp app, and the person blocked her too, and they started using her WhatsApp to defraud her friend's on her WhatsApp, asking them for money and other gift items.I thought these clicks doesn't happen immediately. To be eligible for the grant, the victim is expected to execute tasks. In the process, the hackers get useful information  that can be used to control her account. But, it seems these attackers, advance quickly. Many victims fall for unique techniques. A lot of internet users think making money online is a luck thing. Uninformed fellows easily believe the scam messages, because it came luckily. They anxiously get lost in the process and pay in money. There their eyes gets clearer. The daily emergence of fresh internet users, increases the alarming news of scam activities. An experienced internet user can avoid cheap scam methods, newbies can't. And nobody will be suspicious enough to detect when a friend's message or chat responses doesn't correspond. They'll have to inform friends about being hacked, which may be too late. Before getting informed, numerous friends may have been scammed. I feel like little discussions with the hacker, can reveal to me that I'm not talking to a friend. The baits, gets the victim's interest. What they get from their interest, puts them into a sad experience and situation. I'd advise any new or fresh internet user, to marry the search engine. Whatever strange or lucky emails you receive, look it up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "powder1800",
      "created_time": "October 02, 2023, 01:39:13 AM",
      "body": "What I learned from here is that, if it sounds and looks suspicious, do not click it. You can already recognized it from the way how their usernames constructed- it is usually jumbled letters with many numbers. Aside from that, if you can see the preview of their messages, their grammar is a whole crap. So better watch out for these signs! Quote from: BlackBoss_ on October 02, 2023, 12:29:38 AM...About files shared in an email or any chat platforms like Telegram, Discord, never click on it is a vital rule for everyone. It is more important rule to obey if you received it from a stranger, more reason to never click on it and download file then open it.Spam folders are really a great help to avoid scammers or any other suspicious and fraudulent activities online. I'm not saying that you should not visit this section on your emails, but you should also try to visit it, because sometimes when you are waiting for an email from someone and this sender is new on your inbox, they might go to your spam. So better get their details so that you can check it beforehand. Also don't forget to delete those spams- it will save your space plus it will reduce your carbon footprint!Quote from: BlackBoss_ on October 02, 2023, 12:29:38 AM...About email you received, I would like to ask. Did it come to your Spam folder?Mostly emails from scammers will come to Spam folder that is a signal or can be considered as a red flag, don't click on it if the sender is a stranger.Generally, don't forget to always think before you click. Do not let your curiosity governs alone, gear up with knowledge so that your assets are secured.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "October 02, 2023, 01:59:12 AM",
      "body": "This kind of attack is very normal for most people even if it is not related to cryptocurrencies. I also saw some people posted in some community group on social media asking \"what is this?\" and yeah we answered that never clicked it, especially when he said that there was a file attached there.So we conclude that is a malware attached where after you download and able to run to your computer, your computer will be compromised.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avp2306",
      "created_time": "October 02, 2023, 06:19:07 AM",
      "body": "Quote from: hatshepsut93 on October 01, 2023, 10:59:18 PMThe rule of thumb should be that if you get an unexpected message from someone you don't know, than it's 100% spam/malware and you shouldn't even open it. Instead you should  mark it as spam so that your email service could automatically filter all similar messages in the future.You should be also careful to whom you are giving your email and have different emails for different types of sites, but getting spam is pretty much unavoidable because web services eventually get hacked and user information gets stolen.This should be consider by anyone since unexpected message always contains risky contents so its better to ignore that messages and locate which app continuously giving those notification so that we can easily delete it. So dangerous for anyone to show their interest on such messages since we don't know if we will get drained by malwares or get scammed by those people who usually offer huge amount of money to convince and scam people.If this is spam messages is not provided by apps then its provably emailed by scammers and we need to be more aware with their activities done so that people can avoid losing some amount on those old scamming methods they do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "October 02, 2023, 06:19:52 AM",
      "body": "Quote from: SatoPrincess on October 01, 2023, 11:59:40 PMI haven’t received any of such emails. I don’t believe these mails are just random, it’s possible that scammers target the email address of people who are in crypto. My theory is that they buy the addresses from the dark web, they could have these data after a crypto exchange or site has suffered a hack, users who have their emails linked to that platform are usually targeted by scammers.Some people use email for airdrop or give it to a group, they give their email out without knowing what would happen. One of my emails out of many that I have did contain phishing messages, this is the email that I have given out before in the paste but I did not know the exact thing I used it for. The rest do not receive phishing messages, example is the email that I used for just the forum that is only receiving messages from only this forum, it has no phishing messages.Quote from: GreatArkansas on October 02, 2023, 01:59:12 AMSo we conclude that is a malware attached where after you download and able to run to your computer, your computer will be compromised.If an email message contain a file which you do not authorized for, likely it is a malware. The best thing to do against phishing email is to avoid them. I gave up the email I did receiving several phishing messages in the past.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "October 02, 2023, 06:46:08 AM",
      "body": "If I can still remember very well those messages in the Op are not sent to emails… they mostly seen when you are trying to download a file from a free website most especially movies.I remember back then when I used one of my phones to access a free movie site and before I could download a single movie I had to click and cancel numerous ads and most of them look exactly like what op is showing us, some of them have; “Your phone space is full, download x phone cleaner to help you reduce your phone space”, “You have won x amount click on this link to receive or share this link to several WhatsApp groups to receive”, “Your x phone has been contaminated with virus, down xvirus to keep your phone safe”, etcetera.There are so many of them when you’re using such site, but I have never received it through an email before only through one of my unprotected devices which I have no use for except watching movies and accessing sites that are not secure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "October 02, 2023, 06:48:00 AM",
      "body": "Someone I don't know shared a file with me in this fraudulent age? I delete such files immediately and block the sender. I don't just delete and block, I also report such to limit the spread if possible.Nowadays, it's very risky to open any unsolicited and unfamiliar messages, I even disregard the ones from the banks and companies I registered with. I would rather go directly to their official websites instead of clicking any link whatsoever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Y3shot",
      "created_time": "October 02, 2023, 06:55:56 AM",
      "body": "Quote from: SatoPrincess on October 01, 2023, 11:59:40 PMI haven’t received any of such emails. I don’t believe these mails are just random, it’s possible that scammers target the email address of people who are in crypto. You never can tell if scammers don't send messages to random emails,  it can be very possible scammers can send emails randomly. Scammers can not be trusted. I think this emails of users can be of those who normally participate in airdrops,  some of the airdrops are scam projects.  Some people are not very conscious on how they exposed their emails on Internet,  their are many ways this scammers gets emails but one needs to be careful of the mails we receive because scammers sending mails to users is nothing strange but very common.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "October 02, 2023, 07:04:32 AM",
      "body": "Quote from: EarnOnVictor on October 02, 2023, 06:48:00 AMSomeone I don't know shared a file with me in this fraudulent age? I delete such files immediately and block the sender. I don't just delete and block, I also report such to limit the spread if possible.Nowadays, it's very risky to open any unsolicited and unfamiliar messages, I even disregard the ones from the banks and companies I registered with. I would rather go directly to their official websites instead of clicking any link whatsoever. It should not surprise you that these scammers are getting innovative. The thing that ticks me off is how convincing it would sound but there's always a catch..the link they'd provide.There was one notification I received from my bank in my email that I needed to provide deets about my card. The moment I saw that they mentioned my card, I started calling their bull, good thing I didn't tap on the link that was provided tho.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "October 02, 2023, 07:30:09 AM",
      "body": "Quote from: Spaceman1000$ on October 01, 2023, 10:47:12 PMThis scammers are getting sophisticated day by day.There is nothing sophisticated about this type of scam, it is the victims that are either ignorant, gullible or greedy. Quite a lot of times these scammers play on the greed of the victims, ether by telling them they have won something (out of thin air), or that they have been selected for a giveaway prize, etc. It is easy to know that you shouldn't click on random/unsolicited links, more often than not it is going to be a phishing attempt.Having said that, it is also necessary to have throwaway email addresses, these addresses would be used for random and untrusted platforms or websites, thus you'll take anything in its inbox as prolly a scam until proven otherwise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 02, 2023, 10:21:18 AM",
      "body": "Try to limit the places where you post your email, especially if it is your personal email.Customize filter options to reduce spam and try as much as possible to avoid clicking on links. I don’t know why Gmail has limited options for filtering incoming messages and reducing spam and phishing, but using protonmail will provide you with a lot of settings, such as the ability to check the link before clicking, better filters for messages, and checking the message extension.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}