{
  "id": "topic_5447042",
  "title": "cafter",
  "author": "cafter",
  "created_time": "March 31, 2023, 04:00:59 PM",
  "content": "Many people decide by seeing depth charts that what the price will be in future, but the orders are constantly changing many people cancel and change orders many times, then why this wall observer thread is opened, does it important to see the order wall or depth chart?mostly price movements occur on market price which is due to intuitional buying or selling,",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447042",
  "comments": [
    {
      "author": "Ojima-ojo",
      "created_time": "March 31, 2023, 04:11:57 PM",
      "body": "Quote from: cafter on March 31, 2023, 04:00:59 PMMany people decide by seeing depth charts what the price will be in future, but the orders are constantly changing many people cancel and change orders many times, then why this wall observer thread is opened, does it important to see the border wall or depth chart?mostly price movements occur on market price which is due to intuitional buying or selling,Most time I am faced with this point where I need to decide either to follow the order book or follow the current trend, chart indept reading could only be a risk for those who are looking to execute the trade with urgency, for those who have in-depth information about the market could wait a few hours to see their order get executed if the price reached their order price. I am not a passive trader and I trade my Bitcoin a few times, but each time I make an order either to buy or sell and the order book go against my own set price, I always excessively patient to wait until the order chart reaches my on order price, this is something that has helped me a lot of times from losing on the long run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cafter",
      "created_time": "March 31, 2023, 04:14:43 PM",
      "body": "I mostly use order book when i was scalping , to confirm that i m right or not. it gives some overview but not always right.what about long term, that people see depth charts?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zilon",
      "created_time": "March 31, 2023, 04:45:29 PM",
      "body": "Quote from: cafter on March 31, 2023, 04:00:59 PMMany people decide by seeing depth charts that what the price will be in future, but the orders are constantly changing many people cancel and change orders many times, then why this wall observer thread is opened, does it important to see the order wall or depth chart?mostly price movements occur on market price which is due to intuitional buying or selling,You already have the answer to your question i presume. Long term positions draw deep inference from charts and this positions are meant to last for months or even a years this are majorly position traders. For Order books it is common between scalpers and day traders, The use it to catch up with the slightest change in price and make either profit or loss from it. While making in-depth chart analysis require good capital to take a  position either for a buy or sell, the order book can accommodate small capital and this is why cancelations of trade and changing of orders happens most often in order book due to fear of losing a trading account. As for wall Observer thread just know no one is an island of knowledge so as speculators there should be a channel to share ideas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "March 31, 2023, 04:56:25 PM",
      "body": "Quote from: cafter on March 31, 2023, 04:00:59 PMMany people decide by seeing depth charts that what the price will be in future, but the orders are constantly changing many people cancel and change orders many times, then why this wall observer thread is opened, does it important to see the order wall or depth chart?mostly price movements occur on market price which is due to intuitional buying or selling,Depth charts and order book display fake data from market maker of the exchange. You will notice that price both sides retroactively changing every seconds. Those wall and resistance that you can see on the order book depth will more likely vanished when there’s an actual trend in the market.An indicator using long term time frame is still the best tool to use on trading for a better understanding on the trend and to avoid fake out due to crypto volatility and manipulation. Long term trend line for example is always accurate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KaizenJujustsu",
      "created_time": "March 31, 2023, 04:59:21 PM",
      "body": "Quote from: cafter on March 31, 2023, 04:00:59 PMMany people decide by seeing depth charts that what the price will be in future, but the orders are constantly changing many people cancel and change orders many times, then why this wall observer thread is opened, does it important to see the order wall or depth chart?mostly price movements occur on market price which is due to intuitional buying or selling,Both order books and depth charts can be useful tools in the cryptocurrency market. but provide different types of information.Order books show the current buy and sell orders for a particular cryptocurrency, including the quantity and price at which buyers and sellers are willing to transact. You can use this information to gauge market sentiment and determine areas of support and resistance. Depth charts, on the other hand, provide a visual representation of the order book data by plotting the cumulative volume of buy and sell orders at different price levels. I think this will help you to quickly identify areas of high liquidity and potential price movements.which one do you prefer? ask me if u are still confused.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "March 31, 2023, 08:23:53 PM",
      "body": "depth charts are just temporary observations of where whales are sticking their resistance wallsthey have no intention to have those deep walls hit the market. its just a pressure line to get other minnows to fill up between the pressure lines to then help control the pricethese walls may last a week or 8 weeks it depends on what bets the whale is making on a different market called the futures market where they are gambling that the price wont go below or above X amount that weekif you want to judge how desired bitcoin is. take the AMOUNTS being processed(order history) not the walls far away(depth chart)if one week the average order is 0.01 and the next week its 0.02 then it shows people are more willing to buy more in the second weekso use the 'order history'  as a metric for desire/demand sentiment more so then the 'depth'the depths are fake orders that cancel if the whales walls get too near the spread(order processing line)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hypnosis00",
      "created_time": "March 31, 2023, 09:38:40 PM",
      "body": "Quote from: cafter on March 31, 2023, 04:00:59 PMMany people decide by seeing depth charts that what the price will be in future, but the orders are constantly changing many people cancel and change orders many times, then why this wall observer thread is opened, does it important to see the order wall or depth chart?mostly price movements occur on market price which is due to intuitional buying or selling,I guess not because charts are just the presentation of the past, not the thing that will dictate what will happen or likely happen in the future. We could use this as a tool to predict the market and do market analysis but never we could say that everything lies in this as the price movement changes its trend all the time and so buy and sell volume will change as well. But don't wonder if some people rely on this, perhaps they are newbies and usually don't have yet experience which they fall into this. But soon they realize that it was wrong about their beliefs and they will stop relying on them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MIner1448",
      "created_time": "April 01, 2023, 08:25:03 PM",
      "body": "Being able to see the order wall and the market depth chart can help traders and investors understand the current market situation and make more informed trading decisions. However, as you rightly point out, market orders can change very quickly, so it's important to understand that market depth charts and order walls may not reflect the actual market situation in real time.In addition, it is important to understand that price movements in the market can occur not only at the market price, but also at other price levels. For example, traders can use limit orders to enter or exit a position at a certain price level, which can influence the direction of price movement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "April 01, 2023, 10:14:51 PM",
      "body": "Orderbooks or depth charts are the least reliable tools/indicators I use to determine how the market is going to behave because it's easy to manipulate. A whale could place a huge buy order for example and this could make other traders think that the market is going upwards if they are relying on depth charts, they rush to buy the coin only for the whale to cancel the order and place a sell order in the opposite side.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "April 02, 2023, 07:29:49 AM",
      "body": "Quote from: cafter on March 31, 2023, 04:00:59 PMMany people decide by seeing depth charts that what the price will be in future, but the orders are constantly changing many people cancel and change orders many times, then why this wall observer thread is opened, does it important to see the order wall or depth chart?They are Buy walls and Sell walls and because in this market, there are manipulations so you will have fake buy walls as well as fake sell walls. When whales don't want price to move beyond a range, they will set those fake walls to prevent people buy or sell to make price moves beyond that area. When they want price to move beyond it, they will cancel their previous orders (walls) and lift it up or down a little bit.Quotemostly price movements occur on market price which is due to intuitional buying or selling,It is not true. Institutional entities can trigger the market with their capital but they do it gradually and when you see price moves up or down a lot, it is because of forced liquidations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "death69",
      "created_time": "April 02, 2023, 10:31:16 AM",
      "body": "Traders! Brace yourselves for the high seas of trading, where complexity and randomness rule. Some folks lean on depth charts and order walls to navigate future prices, but, alas, they have boundaries.Orders shift like the winds, with traders altering and canceling them all day long. Predicting future prices based solely on order books? That's tougher than cracking the code of the Rosetta Stone.Nevertheless, order books and depth charts aren't worthless. They shed light on market vibes and unveil potential trends and patterns.But, my trading comrades, remember: institutional buying and selling often dictate price movements. We can dissect past patterns and watch order books, but trading will always have that unpredictable, mysterious allure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "|MINER|",
      "created_time": "April 03, 2023, 04:45:59 PM",
      "body": "Quote from: cafter on March 31, 2023, 04:00:59 PMMany people decide by seeing depth charts that what the price will be in future, but the orders are constantly changing many people cancel and change orders many times, then why this wall observer thread is opened, does it important to see the order wall or depth chart?mostly price movements occur on market price which is due to intuitional buying or selling,I would agree with you that market conditions are constantly changing and hence order books and depth charts should not be relied upon for futures. Order Books and depth charts can be useful but it for only know to the current situation of market because it provides info  only about the current buy and selling. So the wise decision here is that order books and depth charts can be used to see the current situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jody.Drummer",
      "created_time": "April 03, 2023, 05:31:48 PM",
      "body": "Before we place an order, of course we do an analysis first to see which way the market will move, that is something that I also often use to enter the market. In that way it indicates whether something we are analyzing is running smoothly or vice versa. There are also several factors that will make our analysis one of them is the market which is not stable enough so it becomes difficult to analyze it. In my opinion, the order book is to measure the quality of our analysis and it is also a form of our awareness of the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "April 05, 2023, 12:19:10 PM",
      "body": "Well maybe I'm going to seat on the fence because trading needs all the care you have to give but first chart analysis is good not only for longtime but also for day trading and scalping for those who scalp. It gives you the idea of the market at a shorter time and longer time, however you need to add your intelligence and experience to it. For order books, it may be used for those seeking for quick profit. Combination of both can help but I think chart analysis is more reliable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "April 05, 2023, 01:08:34 PM",
      "body": "Quote from: cafter on March 31, 2023, 04:14:43 PMI mostly use order book when i was scalping , to confirm that i m right or not. it gives some overview but not always right.what about long term, that people see depth charts?I prefer more on order book, which I can easily understand every time I trade.I can say that you choose what is working for you since we have different strategy and approach in the market. I tried using Depth charts before in long term, it also works along with the other indicator, better to use it wisely and use other indicators to compliment the other, trading can be very risky if you don't understand what you are doing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "April 05, 2023, 02:17:48 PM",
      "body": "Depth charts are a way to see the market with a deeper look than order books, or more precisely, to see the sequence of orders, including a point where the average is most likely in the short term.But you cannot rely on them without developing a detailed strategy because in the end they are tools that are used within a strategy and are closer to short-term or daily trading after identifying technical indicators such as support and resistance levels.For beginners depth charts are the best, isn't it easy to see changes in a chart like this?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kgdktac",
      "created_time": "April 06, 2023, 06:14:35 PM",
      "body": "Depth charts show the supply and demand of an asset at different price levels, and this can give traders an idea of where buyers and sellers are concentrated.For example, if there is a large buy wall (a concentration of buy orders) at a certain price level, it could indicate that there is strong buying support at that level and the price may not drop below it easily. Conversely, a large sell wall (a concentration of sell orders) could indicate resistance at that level and the price may have difficulty moving above it.While depth charts are not the only factor to consider when making trading decisions, they can be useful in conjunction with other forms of analysis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "borovichok",
      "created_time": "April 08, 2023, 06:53:08 AM",
      "body": "Quote from: Jody.Drummer on April 03, 2023, 05:31:48 PMBefore we place an order, of course we do an analysis first to see which way the market will move, that is something that I also often use to enter the market. In that way it indicates whether something we are analyzing is running smoothly or vice versa. There are also several factors that will make our analysis one of them is the market which is not stable enough so it becomes difficult to analyze it. In my opinion, the order book is to measure the quality of our analysis and it is also a form of our awareness of the market.Stacking the book shelves with books that will motivate me to make real cash is the ultimate priority when it comes to books, not solving matter or things that ought to exits. Reading crypto-related documents and novels is simple because they explain the market in simple terms. Because learning never stops and we do learn something new about the market every day that goes by, I treasured my time spent reading these books. Discover the facts about the cryptocurrency market before investing. Complex analysis must be applied to the market in order to determine the direction in which the market is moving. The market almost always behaves counter to expectations and hits our set SL.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slaman29",
      "created_time": "April 08, 2023, 09:13:21 AM",
      "body": "I don't think order books or depth is a reliable way to see anything, mainly because any whale can show you what he wants to see.But I think if you get a good idea of books/depth across many many exchanges, it's more accurate.What's more important is volume. Even if books are low, but volume is high, that's more reliable for me. Of course with same consideration not of single but multiple CEX.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}