{
  "id": "topic_5427752",
  "title": "alegotardo",
  "author": "alegotardo",
  "created_time": "December 10, 2022, 04:09:52 PMLast edit: December 15, 2023, 01:51:07 AM by alegotardo",
  "content": "Now that the dream of the six championship of Fifa has become more distant for Brazilians, it's time to start talking about the Brazilian championship 2023, after all, Brazilians are moved by football and if we are just lamenting Brazil's defeat in the world cup, we will end up going into depression Our beloved \"Brasileirão\" starts only on April 15th, before that we will have the state games. But, the teams are already preparing their teams for the main championship in the country, and then we can discuss in this topic the hiring of technical staff and players until the championship starts.Here are the 20 clubs that will compete in the championship:PalmeirasFlamengoCruzeiroInternacionalFluminenseCorinthiansAthletico-PRAtléticoFortalezaSão PauloAméricaBotafogoSantosGoiásRed Bull BragantinoCoritibaCuiabáGrêmioVascoBahiaOf these, 15 have already lifted the cup, so they are predicting that it will be a very close dispute.Is anyone crazy to hazard a guess at this point about the likely champion? LEADERBOARDCredits to @TryNinja",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5427752",
  "comments": [
    {
      "author": "alegotardo",
      "created_time": "December 14, 2022, 01:17:19 AM",
      "body": "Today, Flamengo defined who will be their coach for 2023... Vitor Perreira, who was already a coach at Corinthians this year (2022).Unfortunately, Perreira left Corinthians \"stained\" due to some personal problems that made him leave the previous team, but... he doesn't let him be a great leader, because in Portugal he has already led his teams to win the league twice and a Super Cup , let's see how he does in Flamengo.Another curiosity... I found out that this year we have 10 foreign coaches, if I'm not mistaken this is a record:Palmeiras - Abel Ferreira (PORTUGAL)Flamengo - Vítor Pereira (PORTUGAL)Botafogo - Luís Castro (PORTUGAL)Bahia - Renato Paiva (PORTUGAL)Coritiba - António Oliveira (PORTUGAL)Red Bull Bragantino - Pedro Caixinha (PORTUGAL)Cuiabá - Ivo Vieira (PORTUGAL)Fortaleza - Juan Pablo Vojvoda (ARGENTINA)Atlético-MG - Eduardo Coudet (ARGENTINA)Cruzeiro - Paulo Pezzolano (URUGUAI)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "December 22, 2022, 01:29:02 AM",
      "body": "Is anyone else looking forward to the start of Brasileirão 2023?Unfortunately it will still take a while, as the first league match is only in April. But, we can kill the nostalgia with the state championships that will start in January.Practically all the teams will play in the Paulista, Carioca, Mineiro and Gaúcho championships before the Brasileirão begins.I highlighted below the main games of each one...In the Paulista championship, on January 15th, they face:Santos x Mirassol;Palmeiras x São Bento;Corinthians x Red Bull Bragantino;São Paulo x Ituano;In the Carioca championship, Flamengo plays on the 12th against Audax;And on the 15th they play:Botafogo x Audax;Vasco x Madureira;Fluminense vs Resende;The Rio Grande do Sul championship starts a little later, and Internacional faces Juventude on January 21st.Grêmio faces São Luiz on January 17th for the Recopa GaúchaIn the Mineiro championship there is also an important game on the 21st of January, as Atlético-MG faces Caldense",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "December 28, 2022, 02:14:41 PM",
      "body": "Thanks alegotardo, I was looking for this threadDo you think it's better to create a new thread to discuss the state championships or can we discuss here?State championships are a nice warm up until the beginning of national championshipI'm excited to see my Corinthians playing, maybe we'll see Philippe Coutinho playing here, some sources said Aston Villa is almost accepting the offer, and Philippe Coutinho too.And I think we can see a record of foreigner players and coaches in 2023We can discuss the transfer market of brazilian teams too",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "December 28, 2022, 03:12:12 PM",
      "body": "Quote from: alegotardo on December 14, 2022, 01:17:19 AMToday, Flamengo defined who will be their coach for 2023... Vitor Perreira, who was already a coach at Corinthians this year (2022).Unfortunately, Perreira left Corinthians \"stained\" due to some personal problems that made him leave the previous team, but... he doesn't let him be a great leader, because in Portugal he has already led his teams to win the league twice and a Super Cup , let's see how he does in Flamengo.Another curiosity... I found out that this year we have 10 foreign coaches, if I'm not mistaken this is a record:Palmeiras - Abel Ferreira (PORTUGAL)Flamengo - Vítor Pereira (PORTUGAL)Botafogo - Luís Castro (PORTUGAL)Bahia - Renato Paiva (PORTUGAL)Coritiba - António Oliveira (PORTUGAL)Red Bull Bragantino - Pedro Caixinha (PORTUGAL)Cuiabá - Ivo Vieira (PORTUGAL)Fortaleza - Juan Pablo Vojvoda (ARGENTINA)Atlético-MG - Eduardo Coudet (ARGENTINA)Cruzeiro - Paulo Pezzolano (URUGUAI)I would not say that they are that foreign honestly,Portugal speaks the same language as Brazil does if I am not wrong here.Also the other ones are from countries nearby so while they are foreigners in the sense that they are not Brazilians they are not complete foreigners if for example a coach would have been from Greece or Italy which are far away from Brazil.I think that Palmeiras still remains the team to beat as we have seen lately,I don't think a lot of teams have made dramatic changes to their organics and I believe most of the players are the same,thus making it easy to predict that most likely Palmeiras will be Champions again.Personally I am a fan of Internacional de Porto Alegre and I would love them to win the title.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "December 29, 2022, 02:14:36 AM",
      "body": "Quote from: swogerino on December 28, 2022, 03:12:12 PMI would not say that they are that foreign honestly,Portugal speaks the same language as Brazil does if I am not wrong here.Also the other ones are from countries nearby so while they are foreigners in the sense that they are not Brazilians they are not complete foreigners if for example a coach would have been from Greece or Italy which are far away from Brazil.I think that Palmeiras still remains the team to beat as we have seen lately,I don't think a lot of teams have made dramatic changes to their organics and I believe most of the players are the same,thus making it easy to predict that most likely Palmeiras will be Champions again.Personally I am a fan of Internacional de Porto Alegre and I would love them to win the title.You can clearly see Portuguese coaches become mainstream in Brazil heheheIt's almost impossible a few years ago, if you said that in the past people would call you crazyAfter the huge success of Jorge Jesus in Flamengo, teams are now searching to improve their level in European way, and Portugal is the most easy country to work with, because the language and probably because the money too, it's cheaper than Spanish or Italian coaches for example.There's another thing in Brazil, teams are now starting to manage their foreigners, like I said above, it was impossible to think in a few years, but Gremio is now having to manage their players to not exceed the quota with Luis Suarez. They will probably sell a player.The limit of foreigner players in Brazil are 5.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "December 29, 2022, 03:29:11 AM",
      "body": "Quote from: swogerino on December 28, 2022, 03:12:12 PMI think that Palmeiras still remains the team to beat as we have seen lately,I don't think a lot of teams have made dramatic changes to their organics and I believe most of the players are the same,thus making it easy to predict that most likely Palmeiras will be Champions again.Personally I am a fan of Internacional de Porto Alegre and I would love them to win the title.Yes, Palmeiras' results were outstanding on the championship of this year. The club didn't give any chances to the other clubs to surpass them on the competition, and since we are talking about a very close championship that is going to start in April next year I think the scenario must be pretty similar.There are no guarantees Palmeiras will win again, but just to launch an initial guess on the dark, they are the best pick among every disponible ones in Brasileirão.Quote from: rdluffy on December 29, 2022, 02:14:36 AMYou can clearly see Portuguese coaches become mainstream in Brazil heheheIt's almost impossible a few years ago, if you said that in the past people would call you crazyNext step is a foreigner coach for the national team. Probably Jorge jesus?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "December 30, 2022, 01:46:01 PM",
      "body": "Quote from: uneng on December 29, 2022, 03:29:11 AMThere are no guarantees Palmeiras will win again, but just to launch an initial guess on the dark, they are the best pick among every disponible ones in Brasileirão.Palmeiras keep most of the players for the next season, the only player they sold is Gustavo Scarpa to Nottingham ForestThey are waiting to buy 2 or 3 players because the coach is satisfied with the players, and there's 4 players who came from the amateur to prefessional for the next season.If Corinthians get Philippe Coutinho I think there's a good chance to have a solid team to compete.Quote from: uneng on December 29, 2022, 03:29:11 AMNext step is a foreigner coach for the national team. Probably Jorge jesus? I don't believe in Jorge Jesus to be the coach right now, but there's some talk in Brazil to have the first foreigner coach to the next world cup.I think he already did a contract with Fenerbahçe.The media is speculating about Zidane",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "December 31, 2022, 01:55:51 AM",
      "body": "Quote from: rdluffy on December 30, 2022, 01:46:01 PMThe media is speculating about ZidaneZidane at Corinthians? Until a few days ago I swore that this was a very unlikely hiring, but then this week I read something even more absurd....The CBF (Brazilian football confederation), which has been looking for a coach since the end of the World Cup, seems to be interested in hiring Zidane to lead the national team, and it just hasn't done that yet because Zidane dreams of coaching France and is first awaiting a response from them.Zidane has been without coaching a team since 2021, so if it doesn't work out at CBF, he might join Corinthians to maybe get closer to Brazilians.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "December 31, 2022, 02:55:32 PM",
      "body": "Quote from: alegotardo on December 31, 2022, 01:55:51 AMQuote from: rdluffy on December 30, 2022, 01:46:01 PMThe media is speculating about ZidaneZidane at Corinthians? Until a few days ago I swore that this was a very unlikely hiring, but then this week I read something even more absurd....The CBF (Brazilian football confederation), which has been looking for a coach since the end of the World Cup, seems to be interested in hiring Zidane to lead the national team, and it just hasn't done that yet because Zidane dreams of coaching France and is first awaiting a response from them.Zidane has been without coaching a team since 2021, so if it doesn't work out at CBF, he might join Corinthians to maybe get closer to Brazilians.No no hehehe, I'm sorry if I didn't explain wellMedia is talking about Zidane to be the new coach of brazilian team, not Corinthians.Corinthians don't have the money to bring a coach like Zidane  People are talking about a possible foreigner coach to brazilian team. In my opinion it's quite possible, like you said Zidane don't have any contract right now and CBF have money to pay Zidane.Former coach Tite was the fourth highest paid coach of the World Cup, so I think money is not a problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "January 04, 2023, 01:08:46 AM",
      "body": "Looking forward to the start of the Brasileirão, today I was reading some random news about this championship when I came across this:\"Players of the Brasileirão elect Casagrande as the worst commentator of 2022\"He got 25% disapproval from the athletes And I thought that after \"shut up galvão\" no one could overcome him, I was wrong.In any case, it's been a while since I've watched Rede Globo on TV, lately I've been turning to paid channels (pirated  ) or Youtube.How do you intend to follow the championship in 2023?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "January 04, 2023, 07:16:23 PM",
      "body": "Quote from: alegotardo on January 04, 2023, 01:08:46 AMLooking forward to the start of the Brasileirão, today I was reading some random news about this championship when I came across this:\"Players of the Brasileirão elect Casagrande as the worst commentator of 2022\"He got 25% disapproval from the athletes And I thought that after \"shut up galvão\" no one could overcome him, I was wrong.In any case, it's been a while since I've watched Rede Globo on TV, lately I've been turning to paid channels (pirated  ) or Youtube.How do you intend to follow the championship in 2023?I'm anxious to see all the teams who will play brasileirão, there's some good changes on the teams.Beginning of the year is always interesting to see after all the transfersI'm hoping we can see Philippe Coutinho playing for Corinthians but I think it's almost impossible right now.It will be nice to see some players like Suarez, but I'm worried about my team, Corinthians is not doing well in transfer market and there's no good players comingThis is the last year of Fabio Santos and probably last year of Paulinho in Corinthians. Maybe the team can get some good players from the base, and remember to keep an eye in Copa Sao Paulo of JR Footbal, there's always great players who is going to play in professional this year.About the channels, Globo is the most obvious and easy way to watch on Wednesdays and Sundays.Globo, SporTV and Premiere on TV channels, and Globoplay in streaming, I think these are the ways to watch this year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "January 04, 2023, 07:38:57 PM",
      "body": "Quote from: alegotardo on January 04, 2023, 01:08:46 AMLooking forward to the start of the Brasileirão, today I was reading some random news about this championship when I came across this:\"Players of the Brasileirão elect Casagrande as the worst commentator of 2022\"He got 25% disapproval from the athletes And I thought that after \"shut up galvão\" no one could overcome him, I was wrong.It was because he mix sports with politics on his comments, becoming an unpleasant political shill in the eyes of the audience who is watching soccer because they enjoy the sport and not because they are interested in the political views of the players or commentators involved. It has become more blatant regards his negative comments on Neymar during Qatar's World Cup.Quote from: alegotardo on January 04, 2023, 01:08:46 AMIn any case, it's been a while since I've watched Rede Globo on TV, lately I've been turning to paid channels (pirated  ) or Youtube.How do you intend to follow the championship in 2023?Youtube is my only mean of access, but I don't know if they will allow it to transmit in real time. Usually they don't.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "January 05, 2023, 02:32:23 PM",
      "body": "Quote from: uneng on January 04, 2023, 07:38:57 PMIt was because he mix sports with politics on his comments, becoming an unpleasant political shill in the eyes of the audience who is watching soccer because they enjoy the sport and not because they are interested in the political views of the players or commentators involved. It has become more blatant regards his negative comments on Neymar during Qatar's World Cup.The funny thing is: UOL did this research, and Casagrande works for UOL now  Quote from: uneng on January 04, 2023, 07:38:57 PMYoutube is my only mean of access, but I don't know if they will allow it to transmit in real time. Usually they don't.I'll try to find if any other streaming will get brasileirão, but I think it's hard, since Rede Globo has the broadcasting rights for the Brazilian championship and Copa do Brasil.There's some talk about Premiere broadcast on Amazon Prime Video, but I think you'll have to pay (just like Premiere)Premiere is a group of channels where you can buy all the matches of Brasileirao to watch, it's popular in Brazil, but Premiere is part of Globo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "January 11, 2023, 06:30:57 PM",
      "body": "Quote from: rdluffy on January 05, 2023, 02:32:23 PMThere's some talk about Premiere broadcast on Amazon Prime Video, but I think you'll have to pay (just like Premiere)Premiere is a group of channels where you can buy all the matches of Brasileirao to watch, it's popular in Brazil, but Premiere is part of Globo.Yes, you have to pay almost R$ 60.00 to follow the games. Premier is a \"package\" that is part of the so-called \"Prime Video Channels\" that are charged separately from the subscription.On this site you can check all the packages and their prices, but I'm not sure if Premier is up to date, if the price is frozen or if there will still be an update this year before the Brasileirão starts. https://associados.amazon.com.br/resource-center/prime-video-channelsCurrently, I think the best option for those who don't want to risk having their game interrupted in the middle of the match watching a pirated channel is to hire Premier directly by Globo for R$ 29.90 on this website https://premiere.globo.com/Another option is GloboPlay + SportTV for R$42.90/month, which can also be subscribed at https://globoplay.globo.com/assine/sportv/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "January 11, 2023, 08:33:43 PM",
      "body": "Quote from: alegotardo on January 11, 2023, 06:30:57 PMYes, you have to pay almost R$ 60.00 to follow the games. Premier is a \"package\" that is part of the so-called \"Prime Video Channels\" that are charged separately from the subscription.On this site you can check all the packages and their prices, but I'm not sure if Premier is up to date, if the price is frozen or if there will still be an update this year before the Brasileirão starts. https://associados.amazon.com.br/resource-center/prime-video-channelsCurrently, I think the best option for those who don't want to risk having their game interrupted in the middle of the match watching a pirated channel is to hire Premier directly by Globo for R$ 29.90 on this website https://premiere.globo.com/Another option is GloboPlay + SportTV for R$42.90/month, which can also be subscribed at https://globoplay.globo.com/assine/sportv/In my opinion if you are a huge fan, it's worth to subscribe for Premiere directly, 12x 29,90 brl is not expensive, and more important, you can also watch the state championships (Paulista, Gaucho and Mineiro), Copa do Brasil and also Brasileiro A and B. Tons of content for 29,90.You can also have 3 logged devices and share the subscription with someone in your home.I'm following my team Corinthians, and at least they did the contract with Yuri Alberto, it's important to have him this seasonThis is probably the players who will play for 2023 season:Goal - Cássio, Carlos Miguel e Matheus DonelliDefense - Balbuena, Gil, Bruno Méndez and CaetanoFull-back - Fagner, Fábio Santos, Matheus Bidu and Rafael RamosMidfield - Renato Augusto, Giuliano, Maycon, Fausto Vera, Du Queiroz, Roni, Cantillo and PaulinhoAttack - Adson, Róger Guedes, Yuri Alberto, Júnior Moraes, Giovane, Romero and Gustavo MosquitoThey need to get at least a couple of players to Brasileiro and Libertadores, I'm not confident enough with this team.In bold are the possible starters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "January 17, 2023, 03:22:48 PM",
      "body": "Quote from: alegotardo on December 22, 2022, 01:29:02 AMI highlighted below the main games of each one...In the Paulista championship, on January 15th, they face:Santos x Mirassol;Palmeiras x São Bento;Corinthians x Red Bull Bragantino;São Paulo x Ituano;In the Carioca championship, Flamengo plays on the 12th against Audax;And on the 15th they play:Botafogo x Audax;Vasco x Madureira;Fluminense vs Resende;After the first round of the Paulista and Carioca, we have at least a taste of what to expect from main teams.I did not follow Mineiro and Gaucho, too much to watch but I can say this:Paulista:Santos - A promising first match, on par with Palmeiras. It showed evolution unlike Corinthians and Sao Paulo.With a little more work with the younger players, Santos's team has everything to reach the top 4 this year in Paulista.Palmeiras - Only a draw against Sao Bento, but the team played well and had 2 irregular goals, in my opinion Palmeiras made a good 1st game and fans should not be worried.Corinthians - I didn't like the first game, Cassio had to save Corinthians again, like last year. I know Bragantino is a good team, but Corinthians didn't played well. It's almost the same time of last year, and it's obvious to me that they need to hire 2 or 3 players to fight for title and to make a good participation in Libertadores.Sao Paulo - With 45,000 fans watching the first match, Sao Paulo only got a draw, and the fans are already complaining. Rogerio Ceni still have a lot of work to do to find a better formation, it looks like Corinthians, playing like last year, with nothing new.Carioca:Flamengo - As expected, 2 matches two victories, without any problem. It's the favorite to win Carioca, and they are preparing to play Fifa Club World Cup. Victor Pereira got a great team to work. Seems to me the most prepared team to win.Vasco - The main team is playing at USA, so they played with substitutes and managed to draw the first match, I can't analyze correctly without the main team. But at least they did not lose, and substitutes will try their best to be at starters.Botafogo - Played with some substitutes, like Vasco, but for a different reason. Lost to Audax (they made a beautiful goal) and after that Audax played only in defense mode. Hard to analyze.Fluminese - A victory against a weak team, Resende, but did their job and won 2 x 0. I think Fluminense is the second force in Carioca this year. They need to improve a lot of things, but they are in the right way. The new players didn't start the match but they got into the game in the end, I think the team will improve with both Lima and Keno starting the matches.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "January 17, 2023, 08:29:45 PM",
      "body": "Quote from: rdluffy on January 17, 2023, 03:22:48 PMAfter the first round of the Paulista and Carioca, we have at least a taste of what to expect from main teams.I did not follow Mineiro and Gaucho, too much to watch but I can say this:Paulista:Santos - A promising first match, on par with Palmeiras. It showed evolution unlike Corinthians and Sao Paulo.With a little more work with the younger players, Santos's team has everything to reach the top 4 this year in Paulista.Palmeiras - Only a draw against Sao Bento, but the team played well and had 2 irregular goals, in my opinion Palmeiras made a good 1st game and fans should not be worried.Corinthians - I didn't like the first game, Cassio had to save Corinthians again, like last year. I know Bragantino is a good team, but Corinthians didn't played well. It's almost the same time of last year, and it's obvious to me that they need to hire 2 or 3 players to fight for title and to make a good participation in Libertadores.Sao Paulo - With 45,000 fans watching the first match, Sao Paulo only got a draw, and the fans are already complaining. Rogerio Ceni still have a lot of work to do to find a better formation, it looks like Corinthians, playing like last year, with nothing new.In my analysis of the Paulista championship, I think that the current champion Palmeiras will emerge with strength after having also won the Brazilian championship last year. I believe that the Endrick boy is already well adapted to the professional team and will still be a great revelation this year.But São Paulo will also give a lot of work with this reformulation in the squad, as it maintained the base of the team but continued the work of coach Rogério Ceni after the departure of twelve players, my bet is for a superior performance of the striker Wellington Rato who was highlighted at Atlético-GO.Santos and Corinthians? Maybe, I'm in disbelief for now",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "January 19, 2023, 12:12:40 PM",
      "body": "Quote from: alegotardo on January 17, 2023, 08:29:45 PMIn my analysis of the Paulista championship, I think that the current champion Palmeiras will emerge with strength after having also won the Brazilian championship last year. I believe that the Endrick boy is already well adapted to the professional team and will still be a great revelation this year.But São Paulo will also give a lot of work with this reformulation in the squad, as it maintained the base of the team but continued the work of coach Rogério Ceni after the departure of twelve players, my bet is for a superior performance of the striker Wellington Rato who was highlighted at Atlético-GO.Santos and Corinthians? Maybe, I'm in disbelief for now Yesterday I watched both matches of Santos and CorinthiansSantos did a horrible match against Guarani, almost unrecognizable. Totally different than 1st match, it was horrible to see.As I said in the last post here: QuoteWith a little more work with the younger players.They will probably have to work more to adjust the team with new players.The Corinthians team, unlike the first match, played well, of course the opponent is weak, I know that, but it showed a more aggressive team with the will to win. Yuri Alberto played this time and it seems to me that he is the best player of the team, perhaps the most important reinforcement that Corinthians managed to keep.Sao Paulo and Palmeiras will play today.Talking about the teams of Brasileiro and possible candidates to the title, look at Luis Suarez and Gremio. The atacker did a hat-trick at first matchHere you can watch the 3 goals: https://www.youtube.com/watch?v=PzmVc5xRL_wIt's clearly that he's in another level.I'm seriously thinking to bet on Suarez to be the top goalscorer of Brasileiro, I'll check the odds when available, but I'm thinking to bet on him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "January 20, 2023, 04:05:07 PM",
      "body": "Quote from: rdluffy on January 19, 2023, 12:12:40 PMTalking about the teams of Brasileiro and possible candidates to the title, look at Luis Suarez and Gremio. The atacker did a hat-trick at first matchHere you can watch the 3 goals: https://www.youtube.com/watch?v=PzmVc5xRL_wIt's clearly that he's in another level.I'm seriously thinking to bet on Suarez to be the top goalscorer of Brasileiro, I'll check the odds when available, but I'm thinking to bet on him.I also think that Luis Suárez will be one of the great attractions of Brazilian football in 2023 and will make Grêmio quickly conquer important positions in the Brazilian championship.For a team that has just returned to the country's top league, it's not bad at all, let's see if it really comes to fruition.Sebre Suárez, I researched your stats and check it out:The 35-year-old striker is the fifth highest active scorer in world football. There are 528 goals divided into games for Nacional, Groningen, Ajax, Liverpool, Barcelona, Atlético de Madrid and the Uruguayan national team, where he is the best scorer in history, with 68 goals.Not bad!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}