{
  "id": "topic_5444620",
  "title": "pelimies",
  "author": "pelimies",
  "created_time": "March 12, 2023, 06:54:06 PM",
  "content": "Revolutionary Multi-Chain Defi Ecosystem! Lunatics Token is rewarding investors and burning Terra Luna Classic supply.Lunatics Token has become one of the largest burning mechanisms of Terra Luna Classic, with over 2.1 Billion #LUNC burned. If that wasn't impressive enough, LunaT has rewarded investors over 5.1 Billion #LUNC to its investors!What is Lunatics?Lunatics Token (LunaT) is designed to be a Hyper-Deflationary Multi-chain ecosystem, aimed at becoming a one-stop shop offering DeFi, GameFi, Metaverse and Crypto Banking products while bringing passive income back to its investors.The LunaT Ecosystem will include, and has already started development of a Decentralized Exchange (DEX) and Crypto Wallet. Future developments will include a Lending/Borrowing Protocol, a Metaverse Experience (with our Partners, Exodus: Our Universe) Lottery, Staking, NFT's and many other Defi Utilities.Deserving of its own paragraph, and something we are extremely excited for is Lunatics Banking! Lunatics Banking will be extremely beneficial to bridging the gap between Crypto and Fiat. More details will be released as we get closer to its release!imaj photoWho We Are ?Lunatics is a hyper deflationary token dedicated to help burn the supply of Luna Classic. Restoring some faith in the space we all love, so much. We are a Community of Lunatics, dedicated to rewarding our holders and geared up to create an ecosystem that will help burn through the supply ofLuna Classic. Since our focus is to reduce the supply of Luna Classic, all our utilities willplay a part in assisting those burns.imaj photoThe Metaverse: ExodusLunatics has partnered up with what will surely be the best and greatest, Exodus: Our Universe. An incredible, new and exciting metaverse. Along with our partnership, we will have an entire island in Exodus. Our island will be known as Lunatics Island which will include a 4 square kilometre city. Along with the city, there will be 4900 plots to choose from, to live and build upon! On Lunatics Island, people will have the ability to rent retail spaces either in the city, or on the beach for their own stores, bars, discos etc. The Team cant wait for everyone to experience Lunatics Island, in Exodus: Our Universe!Our MissionFrom the beginning, we wanted to put together a project that not only burned, but also rewarded our holders with Luna Classic. Now, with these rewards you can HODL them, sell them or if you choose, you can even burn them. As a Now, with these rewards you can HODL them, sell them or if you choose, you can even burn them. As acommunity we will take the lead, restoring faith and be a beacon of hope for all those devastated by the Luna crash.$Lunatics – https://lunaticstoken.com/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444620",
  "comments": []
}