{
  "id": "topic_5430959",
  "title": "eightdots",
  "author": "eightdots",
  "created_time": "December 22, 2022, 09:07:29 AMLast edit: May 23, 2024, 09:20:09 PM by eightdots",
  "content": "Türkiye Kupası başlığının olmadığını farkettim. Konuyu açıyorum. Şu an kupada 5. tur maçları oynanıyor. Salı günü Fenerbahçe, İstanbulspor’u 3-1 ile çarşamba günü Beşiktaş, 2-0 geriye düştüğü maçta Şanlıurfaspor’u 4-2’lik skorla geçmeyi başardı. Şanlıurfaspor ilk yarıyı 2-0 önde kapadı. Ayağa pas yapan ve akıllı oynayan bir takım izlenimini verdi. İkinci yarı ise fiziksel gücün ortaya çıktığı dakikalarda Beşiktaş kendinden bekleneni yapıp ard arda goller buldu ve büyük bir kaostan kurtulmuş oldu.Bugün yani 22 Aralık tarihinde Galatasaray ile Keçiörengücü saat 21:00’de karşı karşıya gelecek.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5430959",
  "comments": [
    {
      "author": "W Jr.",
      "created_time": "December 22, 2022, 09:13:25 AM",
      "body": "Giresunspor büyük bir süpriz yaptı.TFF 2. Lig takımı Karacabey Birlikspora Giresun’da 5-0 yenilerek kupadan elendiler.Belki de karşı takımı hafife aldılar ancak bunun sonucu çok ağır oldu.Şimdilik kupada büyüklerden sürpriz yok.Beşiktaş 2-0 geriye düşünce acaba mı dedim ama çok iyi şekilde 4-2 çevirmeyi başardılar.Kupa yolunda bu konuyu bayağı dolduracağız.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "December 22, 2022, 08:18:12 PM",
      "body": "Galatasarayımız son dakkada maçı tehlikeye atıyordu. Ofsaytlı pozisyonu oynatan hakem Keçiörengücü'ne bi şans veriyordu nerdeyse. Kupada VAR sistemi yok. Ona rağmen oynattı hakem. Pozisyon golle bittikten sonra mı kaldırcaktı bayrağı anlamadım. Yanlış bi karar verdi bana göre o pozisyonda. Maçta Galatasaray da çok gol kaçırdı. Daha kolay geçebilecek bi maçtı bizim açımızdan. Ama erken gol atamayınca, farkı arttıran golü atamayınca maç sıkıştı bi anlamda. Üstüne Seferoviç'in, Mertens'in tutuk şanssız oyunu sürdü. En iyi hücum oyuncalarına sahip olsak da maçları çevirememe şanssızlığımız devam edecek bu sene anlaşılan. Çünkü golü Kerem Aktürkoğlu, Gomis iş birliği attı. Bi bakıma umut beslenen golcü hücum transferlerimiz yine sahneye çıkmadı. Dünya Kupasından önce durumu toparlamıştık. Fenerbahçe temposunu kaybetmişti. Lige iyi bi geri dönüş yapamama durumumuz var. Fenerbahçe arayı dinlenerek iyi geçirirse onların işine yarar bu ara en çok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Distraction",
      "created_time": "December 22, 2022, 08:44:43 PM",
      "body": "Galatasaray'ın böyle sağlam bir kadro ile çıkmasına rağmen sadece 1-0 ile yetinmesi gerçekten beklenmedikti. Fakat oynanan oyun sezonun geri kalanı için umut vericiydi bence de. Seferovic tercihi yorucu oldu tabi ki.    Bu maçta da sıkıntı çekti ve üstüne bir de penaltı kaçırdı. Seferovic gerçekten Galatasaray adına şu ana kadar yapılmış en kötü transferlerden biri.Gomis'in golü takımı kurtarmış oldu. Gomis'in Icardi varken ilk 11'e girmesi çok zor ve bence girmesin de. Burada gol atması aldatıcı çünkü önceden inanılmaz fırsatları harcadığı maçlar da mevcut. Tabi bu yaşında yine fena oynamıyor orası ayrı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "December 23, 2022, 06:03:52 AM",
      "body": "Quote from: Distraction on December 22, 2022, 08:44:43 PMGalatasaray'ın böyle sağlam bir kadro ile çıkmasına rağmen sadece 1-0 ile yetinmesi gerçekten beklenmedikti. Fakat oynanan oyun sezonun geri kalanı için umut vericiydi bence de. Seferovic tercihi yorucu oldu tabi ki.    Bu maçta da sıkıntı çekti ve üstüne bir de penaltı kaçırdı. Seferovic gerçekten Galatasaray adına şu ana kadar yapılmış en kötü transferlerden biri.Gomis'in golü takımı kurtarmış oldu. Gomis'in Icardi varken ilk 11'e girmesi çok zor ve bence girmesin de. Burada gol atması aldatıcı çünkü önceden inanılmaz fırsatları harcadığı maçlar da mevcut. Tabi bu yaşında yine fena oynamıyor orası ayrı.Seferovic konusunda katılıyorum. Bu senenin balon 11’ine seçilebilecek kadar kötü performans gösteriyor şimdilik. Icardi varken Gomisten sonraya bile kalır bu oyunla. Yani şu an takımın üçüncü forveti olabilecek konumda olan bir futbolcu.Galatasaray’ın turu geçmesi güzeldi. Sürprizlere izin vermeyen büyükleri gördük şimdilik. Yeni eşleşmeler belli olursa yorumlamaya devam ederiz",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "W Jr.",
      "created_time": "December 23, 2022, 06:18:40 AM",
      "body": "Quote from: Distraction on December 22, 2022, 08:44:43 PMGalatasaray'ın böyle sağlam bir kadro ile çıkmasına rağmen sadece 1-0 ile yetinmesi gerçekten beklenmedikti. Fakat oynanan oyun sezonun geri kalanı için umut vericiydi bence de. Seferovic tercihi yorucu oldu tabi ki.    Bu maçta da sıkıntı çekti ve üstüne bir de penaltı kaçırdı. Seferovic gerçekten Galatasaray adına şu ana kadar yapılmış en kötü transferlerden biri.Gomis'in golü takımı kurtarmış oldu. Gomis'in Icardi varken ilk 11'e girmesi çok zor ve bence girmesin de. Burada gol atması aldatıcı çünkü önceden inanılmaz fırsatları harcadığı maçlar da mevcut. Tabi bu yaşında yine fena oynamıyor orası ayrı.Bende Galatasaray’dan fark bekliyordum ancak bu farkı atamadılar.1-0’lık skor da turu geçmelerine yarıyor elbette ancak böyle büyük bir takımın daha farklı sonuçlar alması gerekiyor.Maç boyunca iyi oynayabilir ancak futbol skor odaklı bir oyundur.Sürpriz bir gol ile turnuvaya veda edebilirlerdi.Neyse ki Gomis yine kara boğalık yapıp golünü attı 1-0 kazandılar.Üst tur eşleşmeleri bugün saat 11.30’da gerçekleşecek.11.30’dan sonra büyük maçlar dahi görebiliriz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "December 23, 2022, 06:54:17 AM",
      "body": "3 büyük takımın sadece özetlerini izledim ve buna bakarak iyi durumda olan tek bir takım var, o da tabii ki fenerbahçe:))dünya kupasından sonra bizim kupa maçlarını izlemek istemedim. kendimi trabzonspor karşılaşmasına saklıyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "December 23, 2022, 09:12:24 AM",
      "body": "Dün oynanan maçta VAR sisteminin bu maçlarda da olması gerektiğini birçok izleyici gördü. Galatasaray son dakikalarda ofsayttan bir gol yiyebilirdi. Böyle bir sisteme sahipken neden kullanılmıyor anlamıyorum. Kendi federasyonumuzun bile bu kupaya gerekli özeni göstermemesi bence çok yanlış.Son 16 turu kuraları bugün çekildi ve eşleşmeler şu şekilde;",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "December 23, 2022, 10:40:41 AM",
      "body": "Quote from: eightdots on December 23, 2022, 09:12:24 AMDün oynanan maçta VAR sisteminin bu maçlarda da olması gerektiğini birçok izleyici gördü. Galatasaray son dakikalarda ofsayttan bir gol yiyebilirdi. Böyle bir sisteme sahipken neden kullanılmıyor anlamıyorum. Kendi federasyonumuzun bile bu kupaya gerekli özeni göstermemesi bence çok yanlış.Son 16 turu kuraları bugün çekildi ve eşleşmeler şu şekilde;Eşleşmelerde büyük takımları zorlayacak takım göremedim, dört büyükler ve Başakşehir mutlaka turu atlarlar, son takımların arasında ciddi eşleşmeler olabilir, derbi maçları görebiliriz, Galatasaray, Alanya deplasmanında oynayacak, biraz onların durumu zor olabilir",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hvdv",
      "created_time": "December 23, 2022, 02:04:03 PM",
      "body": "Fenerbahçe yine iyi kura çekti. İkinci lig takımı çaykur rizespor ile eşleşti. Diğer takımların rakipleri daha zor. Özellikle Ankaragücü ile Beşiktaş arasında geçmişten gelen bir husumet var.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silence Scream",
      "created_time": "December 23, 2022, 02:06:30 PM",
      "body": "Quote from: W Jr. on December 22, 2022, 09:13:25 AMGiresunspor büyük bir süpriz yaptı.TFF 2. Lig takımı Karacabey Birlikspora Giresun’da 5-0 yenilerek kupadan elendiler.Belki de karşı takımı hafife aldılar ancak bunun sonucu çok ağır oldu.Şimdilik kupada büyüklerden sürpriz yok.Beşiktaş 2-0 geriye düşünce acaba mı dedim ama çok iyi şekilde 4-2 çevirmeyi başardılar.Kupa yolunda bu konuyu bayağı dolduracağız.Bunu bende beklemiyordum hocam. Giresunspor süper ligde iyi maçlar çıkaran bir takımdı. Gidip Karacabey Belediyespor’a yenilince teknik direktörleri de özür dilemiş. Bu iş özürle de çözülecek bir iş değil. 5-0 yenilmek hele ki kendisinden 2 lig alt lig takımına, bu açıklanamaz. Kuralara bakarsak sürprizler olmazsa üst tura çıkacak takımlar az çok belli oldular.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "December 23, 2022, 04:46:05 PM",
      "body": "Quote from: kriminall on December 23, 2022, 10:40:41 AMQuote from: eightdots on December 23, 2022, 09:12:24 AMDün oynanan maçta VAR sisteminin bu maçlarda da olması gerektiğini birçok izleyici gördü. Galatasaray son dakikalarda ofsayttan bir gol yiyebilirdi. Böyle bir sisteme sahipken neden kullanılmıyor anlamıyorum. Kendi federasyonumuzun bile bu kupaya gerekli özeni göstermemesi bence çok yanlış.Son 16 turu kuraları bugün çekildi ve eşleşmeler şu şekilde;Eşleşmelerde büyük takımları zorlayacak takım göremedim, dört büyükler ve Başakşehir mutlaka turu atlarlar, son takımların arasında ciddi eşleşmeler olabilir, derbi maçları görebiliriz, Galatasaray, Alanya deplasmanında oynayacak, biraz onların durumu zor olabilir Hocam büyük takımları zorlayacak takım göremedim diyorsunuz fakat bu normal bir lig maçı değil özellikle diğer ligdeki takımlar kendilerini gösterebilmek adına canla başla mücadele ediyorlar, daha öncede büyük takımları yenen nice takımlar oldu. Mesela Giresunspor'un 5-0 yenilmesi gibi hatta Galatasaray'ın Keçiören Gücü'nü zor yenmesi gibi hatta Keçiören Gücü çok net pozisyonlar kaçırdı eğer buldukları fırsatları gole çevirebilselerdi Galatasaray'ı çok rahat yenebilirlerdi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "December 23, 2022, 05:42:19 PM",
      "body": "Fenerbahçe yine kolay rakip çekmiş, Rize karşısında zorlanmadan üst tura çıkar. Alanyaspor ve Galatasaray arasında sağlam bir maç izleyeceğiz, bu turdaki en heyecanlı maç o olacaktır.Anadolu takımlarını bu maçlar sayesinde tanıyoruz, düşük bütçeli takımları üst turda görmek çok güzel oluyor. Karacabey ve Karagümrük’te üst turda görmeyi çok isterim",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "judas",
      "created_time": "December 23, 2022, 05:53:15 PM",
      "body": "Quote from: xzone on December 23, 2022, 05:42:19 PMFenerbahçe yine kolay rakip çekmiş, Rize karşısında zorlanmadan üst tura çıkar. Alanyaspor ve Galatasaray arasında sağlam bir maç izleyeceğiz, bu turdaki en heyecanlı maç o olacaktır.Anadolu takımlarını bu maçlar sayesinde tanıyoruz, düşük bütçeli takımları üst turda görmek çok güzel oluyor. Karacabey ve Karagümrük’te üst turda görmeyi çok isterim Önceki turda tek süper lig takımını Fenerbahçe çekmişti diye hatırlıyorum büyüklerden bu tur şansına daha kolay bir kura çekti.Ben alt lig takımlarını destekliyorum Türkiye Kupası'nda büyük takımların bu kupayı almasına çok ihtiyacı yok gerçi Avrupa ligi bileti alıyor şampıyon direkt olarak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Balmain",
      "created_time": "December 23, 2022, 06:31:26 PM",
      "body": "Son 16 turunda en kolay galibiyet Fenerbahçenin olmalı, Rize karşısında farka gidebilirler. Galatasaray, Keçiörengücünü bir gol atarak zar zor yenmesinden sonra Alanyaspor karşısında da zorlanayacağını düşünüyorum, Seferovic bu maçta yedekte olursa iyi olur. Galatasaray bu turu geçmesine geçer, galibiyet için doğru oyuncu seçimi gerekiyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ILuckyGuyI",
      "created_time": "December 23, 2022, 08:27:24 PM",
      "body": "Bence Galatasaray Alanyaspor karşısına çok yedek bir kadroyla çıkmaz. Çıkarsa kendileri kaybederler çünkü. Alanyaspor'un tüm ciddiyetiyle oynayacağına dair şüphem yok. Sonuçta kupa alabilecekleri ya da başarılı bir dönem geçirebilecekleri nadir yerlerden birisi burası. Seferovic'in ilk 11'de olmasına ihtimal vermiyorum. Sadece acaba Gomis ile başlayıp Icardi'yi ikinci yarı mı oyuna alır Okan hoca onu düşünüyorum.Hücum yönümüz zaten güçlü olduğu için defansta ekstra dikkatli olmak gerekecek. Alanyaspor daha önce geriden gelip bizden beraberlik koparmıştı. Bunu yine yapmasına izin vermemeliyiz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ingiltere",
      "created_time": "December 23, 2022, 08:59:15 PM",
      "body": "Quote from: eightdots on December 23, 2022, 09:12:24 AMDün oynanan maçta VAR sisteminin bu maçlarda da olması gerektiğini birçok izleyici gördü. Galatasaray son dakikalarda ofsayttan bir gol yiyebilirdi. Böyle bir sisteme sahipken neden kullanılmıyor anlamıyorum. Kendi federasyonumuzun bile bu kupaya gerekli özeni göstermemesi bence çok yanlış.Son 16 turu kuraları bugün çekildi ve eşleşmeler şu şekilde;Bu kupanın tek avantajı getirdiği prestij ve Avrupa Ligi'ne katılma hakkı. Para ödülleri çok düşük olduğu için büyük kulüpler fazla ciddiye almıyor. Ortada daha büyük bir ödül havuzu olsaydı rotasyonu minimumda görürdük. Durum böyle olunca maçlarda takımların ismine bakarak bahis yapmak sürpriz sonuçların görülmesine neden olabiliyor. Ben bu maçları sadece keyif için izlemeyi tercih ediyorum.Kağıt üstünde dört büyüklerin hepsi sonraki tura çıkar gibi görünüyor ama bu turda en az bir takımın eleneceğine eminim. Galatasaray'ın hem deplasmanda oynaması hem de Alanyaspor'un zaman zaman ilginç sonuçlar alması bu eşleşmeyi ilgi çekici yapıyor. Bu maçı Alanyaspor da alsa, Galatasaray 5 gol atıp da elese sürpriz olmaz. Trabzonspor'un işi kolay görünüyor. Ümraniyespor ligin en kötü takımı ve sürpriz yapma ihtimalleri yok denecek kadar az. Fenerbahçe çok geniş bir kadroya sahip olduğu için istediği gibi rotasyon yapabilir. Beşiktaş ise tarihsel olarak ciddi bir üstünlük kurduğu Ankaragücü ile oynayacak ancak maçın Ankara'da olması ve son çıkan olayları düşündüğümüzde çok farklı bir atmosfer olacaktır. Sonuç olarak tüm bu takımlar kağıt üstünde sonraki tura çıkabilir ancak işler 90 dakika sonunda sahada belli olacak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "December 26, 2022, 08:52:36 AM",
      "body": "Herhalde geçen sene sivasspor şampiyon olmuştu bu sene konferans liginde çok iyi bir performans göstererek kendi grubunu lider bitirmişlerdi bu sene şampiyon kim olup Avrupa kupalarına gidecek bende merak ediyorum Fenerbahçe olarak artık bu finali alalım ya insan kupa istiyor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flipme",
      "created_time": "December 27, 2022, 06:43:50 PM",
      "body": "Bu kupada favorim Galatasaray olacak. Erken eşleşme olmazsa Fenerbahçe finaldeki rakibimiz olabilir. Ancak Sivasspor geçen sene kupayı kazandı ve Avrupa'da bizi başarıyla temsil etti. Aynı olayın bir daha yaşanacağının garantisi yok ama dört büyüklerin dışındaki takımlar da başarılı olabiliyor. Onların fırsat bulması da önemli. Bu alışkanlığa sahip Sivasspor kupayı bir kez daha kazanırsa fena olmaz. Aynı başarıyı göstermeleri garanti değil ancak bir fırsatı daha kesinlikle hak ediyorlar. Turnuva konsepti lig maçlarından farklı sonuçlar doğurabiliyor. Lig maçlarına bakarak bu maçları yorumlamak her zaman doğru sonuçlar vermez. Ancak benim favorim yine de Galatasaray olacak. Bireysel anlamda tek tek değerlendirildiğinde en iyi kadroya Galatasaray'ın sahip olduğunu düşünüyorum. Bu kupayı Galatasaray'ın kazanması benim için sürpriz olmaz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "December 27, 2022, 08:48:27 PM",
      "body": "Dünya kupası dolasıyla liglere ara verilmesinden dolayı oluşan yoğunluk nedeniyle haftada birden fazla maç yapılacak olması takımları iyice yoracaktır. Hem ligde üst üste maç oynamanın yorgunluğu ile birlikte Türkiye Kupası maçlarında olumsuz yönde etkileyecektir yani her an her şey olabilir takımlarda favori gördüklerimiz elenebilir beklemediğimiz takımlar tur atlayabilir kısaca her şey olabilir. Kupa maçlarının atmosferi de başka oluyor o yüzden takımlar daha bir gayretli oynuyorlar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}