{
  "id": "topic_5422192",
  "title": "Mustang Shelby",
  "author": "Mustang Shelby",
  "created_time": "November 19, 2022, 11:35:27 AM",
  "content": "İnternette gezinirken gördüğüm ve başlığı çok iddialı olduğu için kendimce törpülediğim bir kaç faydalı siteyi sizinle buluşturacağım arkadaşlar. 1- NumbeoFarklı şehirlerin ekonomik düzeylerini kıyaslayan bir site. Diyelim ki yurtdışında bir yere gideceksiniz oradaki ortalama maliyetinizi bu site aracılığı ile bulabilirsiniz. Ben örnekleme açısından Ankara ile Tokyo’yu kıyasladım. Tokyo, Ankara’dan %143 daha pahalı çıktı 2- Homestyler Odanızı 3D olarak tasarlayabileceğiniz bir site. Evinizde bir odanız var ve yeniden kurmak mı istiyorsunuz işte tam size göre bir site.3- in2013dollars Geçmişteki paranın bugün ne kadar ettiği ile alakalı bir site. Bir nevi enflasyon verileriyle ortalama eder yapıyor. 1630’lu yıllardaki 100 doların bugün 3500 dolar civarına denk geldiğini örneğe bakarak söyleyebilirim.4- Chronas Tarihin her hangi bir döneminde insanların nasıl yaşadıklarını merak mı ediyorsunuz? İşte bu site size göre. Türkiye haritasını seçerek tarihimiz hakkında kısa bir gezintiye çıkabilirsiniz.5- Locallingual Haritada tıkladığınız rastgele bir yerin nasıl konuştuğunu, dilini ve aksanını öğrenebileceğiniz bir site. Size tavsiyem Angaradan başlayın 6- IMSDbFilm senaryolarını okuyabileceğiniz bir site olarak hayatına devam ediyor.7- Football FullmatchŞampiyonlar ligi dahil 7 büyük ligin tüm geçmiş maçlarını Full olarak izleyebileceğiniz bir site. Meraklıları mutlaka vardır.8- How is the WorldDünyanın herhangi bir yerinde anlık olarak insanların ne kadar mutlu olduklarını gösteren site.9- Skylineİstediğiniz şehrin sokaklarını canlı izlemenizi sağlayan site.10- Explore.orgBuda canlı canlı vahşi hayatı izlemenize yarıyor.Linkleri vermedim forumda yasak olabilir diye. İsimleri yazarsanız bulursunuz.Kaynak : https://www.webtekno.com/haber/amp/92922",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5422192",
  "comments": [
    {
      "author": "meser#",
      "created_time": "November 19, 2022, 11:57:56 AM",
      "body": "Merhaba hocam bu konuda yüzlerce konu açılmıştır büyük ihtimalle en son şu konuda toplamaya başlamıştık oradan devam ederseniz forum kirliliği oluşmaz  https://bitcointalk.org/index.php?topic=5410644.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}