{
  "id": "topic_5404750",
  "title": "mandown",
  "author": "mandown",
  "created_time": "July 01, 2022, 10:22:28 AM",
  "content": "Quoteİçişleri Bakanı Süleyman Soylu, 1 Temmuz itibarıyla otoyollarda hız sınırının saatte 120 km'den 140 km'ye çıkacağını söyledi, ceza limiti ise saatte 154 km olacakhttps://www.bbc.com/turkce/live/haberler-turkiye-61329503",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404750",
  "comments": [
    {
      "author": "W Jr.",
      "created_time": "July 01, 2022, 11:30:27 AM",
      "body": "İsabetli bir karar olmuş bence.2022 yılında araçların hızları genelde yüksek oluyordu ve otobanda kendini frenlemek zorunda kalıyorlardı.Bu kararla birlikte en azından biraz daha hızlı gidecek otobanda araçlar.Eski model araçlar ise yine düşük hızda devam edebilirler.Bunun için orta veya sağ şeridi kullanacaklar zaten.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "July 01, 2022, 11:33:57 AM",
      "body": "Otobanda saatte 120km hız gerçekten yavaş oluyordu ister istemez sürücüler yavaşlamak zorunda kalıyordu bu karar iyi olmuş diyebilirim daha rahat bir şekilde sürüş yapabilirler artık sürücüler. 140 km aşağısında seyehat etmek isteyenler sağdan sağdan devam edebilirler güzel karar çok daha önce verilmesi bir karardı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Retro Harmony",
      "created_time": "July 01, 2022, 11:35:58 AM",
      "body": "140+ %10 ile saatte 154 km hıza kadar serbest artık otobanlarda bu hız. Bu durumda şehirler arası seyahat edenler çok rahat edecek. Belki tır veya otobüslerde pek bir fark hissedilmeyecek ama şehirler arası şirket araçlarının daha hızlı seyahat imkanı doğacak. Fazla hız iyi değil hızı arttırırken de dikkat etmeyi unutmamak gerekiyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "July 01, 2022, 11:38:28 AM",
      "body": "İsabetli bir karar olmuş bence de. Bir de olur olmadık yerlere radar koyup tuzak kurulmasa güzel olur. Otoban yapılmış aman ceza yiyeceğiz diye korkuyoruz. 140-150 ideal bir hız. Aşırısı da zarar tabi. Herkes aracını tabit ve ona göre hız yapar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ILuckyGuyI",
      "created_time": "July 01, 2022, 11:57:38 AM",
      "body": "''Otoyollarda'' şeklinde belirtildiğine göre sanıyorum ki tüm otoyollar için geçerli bu karar. Çünkü bir ara bu yönde bir hamle yapılacağı söylentisi dolanırken belli başlı otoyolları kapsayacağını söylüyorlardı ve sayıca da oldukça az kalıyordu. Bana göre de bu doğru bir karar. Zaten şöyle de bir şey var önceki halinde de 180-200 hatta daha fazla hızlarla gidenler yine gidiyordu ve onlar için değişen bir şey olmaz. Kurallara uymaya daha çok özen gösteren sürücüler için sınırın biraz daha artırılması güzel bence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Red Pie",
      "created_time": "July 01, 2022, 01:25:03 PM",
      "body": "Quote from: ILuckyGuyI on July 01, 2022, 11:57:38 AM''Otoyollarda'' şeklinde belirtildiğine göre sanıyorum ki tüm otoyollar için geçerli bu karar. Çünkü bir ara bu yönde bir hamle yapılacağı söylentisi dolanırken belli başlı otoyolları kapsayacağını söylüyorlardı ve sayıca da oldukça az kalıyordu. Bana göre de bu doğru bir karar. Zaten şöyle de bir şey var önceki halinde de 180-200 hatta daha fazla hızlarla gidenler yine gidiyordu ve onlar için değişen bir şey olmaz. Kurallara uymaya daha çok özen gösteren sürücüler için sınırın biraz daha artırılması güzel bence.Tüm otoyollar için olması lazımdı zaten. ücretli otoyollarda yüksek hızla gidilip ücretsiz otoyollarda limitler düşük olsaydı etik olmazdı, doğru olmazdı. bana göre de doğru bir karar hocam. tabi 180-200 km hızla giden önce kendi sağlığına, sonra çevresine ve cebine zararları hiç düşünmüyor. onlar için değişen bir şey olmayacak. giden yine 200 km hızla gider. yine de biz kurallara uyanlar için güzel bir gelişme diyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "July 01, 2022, 01:38:40 PM",
      "body": "Basitçe özetlemek gerekirse yeni yapılan pahalı otoyallarda 140'a çıkarılmış. TEM'de, İzmir'de ve Niğde Şanlıurfa otoyollarında 130'a çıkarılmış. Kalan yollarda örneğin Karadeniz'de ya da Antalya'da hız limitlerinde bir değişiklik yok. Bildiğim kadarıyla bu yeşil olan otoyollarda zaten millet 200 bile bassa ceza almıyordu. Kişisel olarak ben bile Kuzey Marmara otoyolunda ve İzmir otoyolunda çok yüksek hızlara çıktım ve ceza gelmedi. Tem'de de pek ceza yazılmıyordu ama zaten hiç boş olmuyor ki, en fazla 150'ye çıkılabiliyordu. Asıl E5'te bazı yerlerde ya da bazı tünellerde çok salak cezalar yazıyorlar. İstanbul'da Taksim tünelinde hafta sonu sabahın dokuzunda 57 km hızdan ceza geldi bana. Hız sınırı girişte ve çıkışta 50, ortalarda 70. Kimse yoktu ve ben cidden çok yavaş gittim ki 70'i geçmemiştim. Ceza yazacak yer arıyorlar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "July 01, 2022, 01:54:18 PM",
      "body": "Hız sınırı bazı yollarda gerçekten gereksiz oluyor, otobanda 120 ile gidip hızı arttırınca ceza yer miyim düşüncesi rahatsız ediciydi. Bazı yollarda yokuş aşağı da olunca hiç fark etmeden aracınız 150’yi bulabiliyordu, artık radar düşünmeden hareket edeceğiz.Fakat Çeşme otobanı gibi yerlerde insanlar abartılı hızlar ile araç kullanıyor, umarım bunun artmasına sebep olmaz bu karar. Bir de benzin 30 lirayken aracı 90 ile sürmek en iyisi oluyor, basmamak lazım",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "July 01, 2022, 03:26:37 PM",
      "body": "Araçların leveli yükseldikçe hız artırımı gerekliliği ortaya çıkmıştı. Geç bile alınan karar aslında. Otobanda 120'yle gitmek birçok araç için sanki gitmiyormuş hissi gibiydi. Güzel karar. Özellikle işi ulaşım sektörüyle olan kişiler oldukça rahatlayacaklardır. Her gün yol yapan biri için çok olumlu bir karar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Distraction",
      "created_time": "July 02, 2022, 01:12:29 PM",
      "body": "Tüm otoyollar için geçerli değil bu arada zaten @püsür detayıyla belirtmiş yukarda. Yine de bu artış iyi mi oldu bence iyi oldu. Örneğin TEM Otoyolu diye tabir ettiğimiz otoyolda 120+%10 bana göre biraz az geliyordu. 10 km/sa kadarlık bir artış biraz daha iyi hale getirmiş oldu. Bu otoyolda oldukça fazla radarla karşılaştığım kısımlar olmuştu. Şimdi en azından bir miktar daha fazla hızla yine kurallar içerisinde buradan geçilebilir. 140+%10 yapılan otoyolları kullananların sayısı çok daha az tabi ama kullanan için güzel haber.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hero1111",
      "created_time": "July 02, 2022, 01:21:33 PM",
      "body": "Çağın gereklerine uygun yollar ve araçlar yapıldığı sürece ve bunlara insan hayatını koruyucu donanımlar eklendikten sonra hız artışlarının olması güzel , inşallah insanlarımız bu kurallara uyarlar ve daha fazla hız yapma ihtiyacı duymadan insan hayatlarını riske atmazlar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "July 02, 2022, 01:43:16 PM",
      "body": "Quote from: püsür on July 01, 2022, 01:38:40 PMBasitçe özetlemek gerekirse yeni yapılan pahalı otoyallarda 140'a çıkarılmış. TEM'de, İzmir'de ve Niğde Şanlıurfa otoyollarında 130'a çıkarılmış. Kalan yollarda örneğin Karadeniz'de ya da Antalya'da hız limitlerinde bir değişiklik yok. Bildiğim kadarıyla bu yeşil olan otoyollarda zaten millet 200 bile bassa ceza almıyordu. Kişisel olarak ben bile Kuzey Marmara otoyolunda ve İzmir otoyolunda çok yüksek hızlara çıktım ve ceza gelmedi. Tem'de de pek ceza yazılmıyordu ama zaten hiç boş olmuyor ki, en fazla 150'ye çıkılabiliyordu. Asıl E5'te bazı yerlerde ya da bazı tünellerde çok salak cezalar yazıyorlar. İstanbul'da Taksim tünelinde hafta sonu sabahın dokuzunda 57 km hızdan ceza geldi bana. Hız sınırı girişte ve çıkışta 50, ortalarda 70. Kimse yoktu ve ben cidden çok yavaş gittim ki 70'i geçmemiştim. Ceza yazacak yer arıyorlar.Şu haritadan görülüyor ki ülkenin %90'ında doğru düzgün otoyol bile yok. Her yıl milyarlarca lira vergi toplanıyor ama yapılan yatırımlar bu verginin çok ufak bir bölümü oluyor. Para yandaşlara ve milyonlarca memura gidiyor. Devlet bu kadar devasa olduğu için işbilmezlerin de yönetime gelmesiyle batması kaçınılmazdı.Hız sınırı çağ dışında kalmıştı artık yeni teknoloji ve daha güvenli arabalarla birlikte çok daha hızlı ve güvenli şekilde gidilebiliyor. Sadece otoyollarda değil tüm yollarda yeni düzenlemeye ihtiyaç var. Kanun 50 sene geriden geliyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "verbakalim",
      "created_time": "July 02, 2022, 08:05:36 PM",
      "body": "Herkese hayırlı olsun. Hız sınırlarımız değişti. Az paralı yollarda az arttı. Çok paralı yollarda çok arttı. Aynı araba devlet yolunda gittiği hız ile otobanlarda daha ve daha hızlı gidecek. Ne kadar ekmek o kadar köfte. Ne saçma günlerden geçiyoruz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "July 03, 2022, 11:00:41 AM",
      "body": "Her otobanda olmaması olmamış yani, bende dün otoban kullandım ve hız limitini 130 olarak gösteren tabelaya ilk defa baktım, tabelalar hemen yenilenmiş, yine de gelecek artıştan sonra kesilecek cezaların artış göstereceğini düşünüyorum, eskiden biraz daha göz ardı ediliyordu ama herhalde artık affetmezler,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "July 04, 2022, 01:29:15 PM",
      "body": "Otobanlarda hız sınırının artması bana yaramadı benim için hala aynı seviyede hızla takip ediyorum maksimum 120 km/saat ile gidiyorum hem benzin durumu yüzünden hem de motoru çok zorlamak istemiyorum 150 de basamıyorum aracım 16-17 yıllık olunca ancak bu hız sağlıklı gidişi karşılıyor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "July 04, 2022, 02:50:00 PM",
      "body": "Olması gereken bir karar hatta 160km olabilir. Yeni araçlarda 150-160 km’lere çıkınca zaten çokta hızlı gitmiş olmuyorsun. Ayrıca güvenlik testleri de son yıllarda gelişme kaydetti. Otoyolun amacına hizmet etmesi için hızın biraz daha artmasının daha iyi olacağını düşünüyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "W Jr.",
      "created_time": "July 04, 2022, 03:56:44 PM",
      "body": "Quote from: karabiber on July 04, 2022, 02:50:00 PMOlması gereken bir karar hatta 160km olabilir. Yeni araçlarda 150-160 km’lere çıkınca zaten çokta hızlı gitmiş olmuyorsun. Ayrıca güvenlik testleri de son yıllarda gelişme kaydetti. Otoyolun amacına hizmet etmesi için hızın biraz daha artmasının daha iyi olacağını düşünüyorum.Bence de 160 km/h çok mantıklı bir sınır olabilirdi.Bu sınırı geçemeyecek araçlar için yine sorun yok.Sınırı geçecek araçlar için de 130-140 yeterli gelmeyebilir.150-160 km/h hızla giden araçlar için gayet yeterli bir hız olurdu.Genelde böyle lüks araçlar hız limitlerine uymak zorunda olduğu için kapasitesi olsa da hızlı gidemiyorlar, hız sabitleyiciyi 120’ye sabitleyip gidiyorlardı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "July 04, 2022, 04:13:08 PM",
      "body": "Bazı çok şeritli ve güzel yollarda hızlı limiti daha fazla olmalı hatta limitsiz yollar bile olmalı düşüncesindeyim her ne kadar hız yapmayı sevmesem de arada gazlamayı seviyorum ama bu şartlarda mümkün olduğunca tutuyorum kendimi. Şöylede bir gerçek var asfalt kalitemiz çok düşük 150 km hızdan sonra yoldaki bozukluklar daha iyi hissedebiliyorsunuz, yeni yapılmalarına rağmen kısa sürede bu yollarda düzgün yapılmayan yamalarda cabası.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "July 04, 2022, 04:31:27 PM",
      "body": "Ülkemizde araçların yaş ortalaması büyüdü her ne kadar yollarda sıfır araçlar görsekde işin rengi farklı allah göstermesin 160 la bir araç size çarpsa canı geçtim malın karşılığını alamazsınız.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}