{
  "id": "topic_5434714",
  "title": "kriptobaron",
  "author": "kriptobaron",
  "created_time": "January 14, 2023, 03:00:41 PMLast edit: March 27, 2023, 12:53:13 PM by kriptobaron",
  "content": "Bill Gates yapay zekanın Web 3 ve Metaverseden daha önemli olduğunu söylemiş.Açıklamasının ardından OpenAI şirketine 10 milyar dolar yatırım yapacağı iddiaları da konuşuluyor.AI coinleri de açıklamalardan sonra yükselişe geçmiş.AGİXFETNMROCEANhttps://coinmarketcap.com/tr/view/ai-big-data/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434714",
  "comments": [
    {
      "author": "Mustang Shelby",
      "created_time": "January 14, 2023, 03:04:17 PM",
      "body": "Bill Gates önemli bir isim. Gelecek için yapay zeka, metaverse sisteminden daha önemli olabilir tabii ancak Metaverse teknolojisi de tek başına değil, yapay zeka ile birlikte dünyanın en farklı alanlarından olacak. Biraz gelişime ihtiyaç duyuyor. Eğer yeterli destek sağlanır ve gelişebilirse yapay zeka dünya üzerindeki en ilgi çekici projelerin başında olacak. Bill Gates gizemli bir adam. Her şeyi yapabilecek bir insan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "January 14, 2023, 07:37:58 PM",
      "body": "AI teknolojisi Web 3-Metaverse gibi digital dinamiklerin içerisinde çok önemli rolü olacağı rol üstleneceği belli bir durum. Yapay zeka ayrı tutarsak bu açıklamaya katılıyorum bence çok önemli geleceğin içerisinde yapay zeka, derin öğrenme, veri üzerine olan bütün öğrenmeler her şeyden daha önemli olacağı doğrudur. AI coinleri biraz araştırmaya başlayayım ayı sezonundayız hazır. CMC big data listesindeki ilgi çekici tokenlere bakacağım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "January 14, 2023, 11:24:28 PM",
      "body": "AI coinleri listesine Phoenix Global (PHB)'yi de ekleyebilirsiniz, sağlam proje, araştırmanızı öneririm tabiki, türk telegram grupları da var, yani ekmek yiyebileceğiniz bir proje.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "January 15, 2023, 11:28:00 AM",
      "body": "Quote from: MK-74 on January 14, 2023, 11:24:28 PMAI coinleri listesine Phoenix Global (PHB)'yi de ekleyebilirsiniz, sağlam proje, araştırmanızı öneririm tabiki, türk telegram grupları da var, yani ekmek yiyebileceğiniz bir proje.Hocam bu PHB bir iki kere isim değiştirdi mi? O kadar çok token var. Yoksa ben mi adını karıştırdım. Eskiden red pulse olan buydu galibaBenim ilgi alanımda olan AI projeleriGlqHeartOraiXeta",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bobita",
      "created_time": "January 15, 2023, 10:02:35 PM",
      "body": "Bana göre yapay zeka, Web 3.0 ve Metaverse birbirlerine oldukça bağlı ve bağımlı kavramlar, birbirlerinden ayrı düşünmek çok anlamlı olmuyor. Belki birbirlerinden bağımsız olarak çalışabilirler ama birlikte sinerjik bir güçle yeni dünyayı şekillendirecekler. O nedenle şu daha önemli, bu daha önemsiz kıyaslaması yapmayı doğru bulmuyorum, ancak Bill Gates'in olaya doğal olarak ticari açıdan baktığını da göz önüne almak lazım.Web 3.0 ve Metaverse'ün insan hayatında kalıcı bir yer almasından başka ihtimal yok, çünkü yapay zeka hem de yakın gelecekte öyle bir hale gelecek ki, gerçek ile oluşturulmuşu ayırd etmek neredeyse imkansız hale gelecek. Ve insanlar bir süre sonra bu çabadan vazgeçip \"gerçeği\" o kadar umursamamaya koşullanarak alternatif evrenlerde ikincil hayatlar yaşamaya başlayacaklar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "January 16, 2023, 09:58:51 PM",
      "body": "Quote from: ajanwalker on January 15, 2023, 11:28:00 AMQuote from: MK-74 on January 14, 2023, 11:24:28 PMAI coinleri listesine Phoenix Global (PHB)'yi de ekleyebilirsiniz, sağlam proje, araştırmanızı öneririm tabiki, türk telegram grupları da var, yani ekmek yiyebileceğiniz bir proje.Hocam bu PHB bir iki kere isim değiştirdi mi? O kadar çok token var. Yoksa ben mi adını karıştırdım. Eskiden red pulse olan buydu galibaBenim ilgi alanımda olan AI projeleriGlqHeartOraiXetaAynen ilk çıktığında APEX'idi sonra Red Pulse ile birleştiler ve PHB oldular, Binance borsasında BUSD, USDT ve BTC paritelerinde bulabilirsiniz.AI coini yakında kendi ağı gelecek, bakmanızı öneririm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "January 17, 2023, 12:42:06 AM",
      "body": "Quote from: MK-74 on January 16, 2023, 09:58:51 PMQuote from: ajanwalker on January 15, 2023, 11:28:00 AMQuote from: MK-74 on January 14, 2023, 11:24:28 PMAI coinleri listesine Phoenix Global (PHB)'yi de ekleyebilirsiniz, sağlam proje, araştırmanızı öneririm tabiki, türk telegram grupları da var, yani ekmek yiyebileceğiniz bir proje.Hocam bu PHB bir iki kere isim değiştirdi mi? O kadar çok token var. Yoksa ben mi adını karıştırdım. Eskiden red pulse olan buydu galibaBenim ilgi alanımda olan AI projeleriGlqHeartOraiXetaAynen ilk çıktığında APEX'idi sonra Red Pulse ile birleştiler ve PHB oldular, Binance borsasında BUSD, USDT ve BTC paritelerinde bulabilirsiniz.AI coini yakında kendi ağı gelecek, bakmanızı öneririm.Bu PHB bir ara çok popüler değil miydi? Ne oldu da o popülerlik azaldı acaba? Şimdi Bill Gates ile birlikte bu popülerliği tekrar kazanacak olan coinlerden birisi oluyor o zaman. İlgi çekici projeleri takip etmekte  fayda var. Hele Bill Gates dediyse daha çok dikkat etmekte fayda var.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "demir77",
      "created_time": "January 17, 2023, 05:57:37 AM",
      "body": "2021 boğasında defi ve nft vardı. Bir sonraki boğada AI coinler olacak gibi. Dikkatli olmakta fayda var. Kar almasını bilmek gerek.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriptobaron",
      "created_time": "January 23, 2023, 02:28:48 PMLast edit: January 23, 2023, 02:39:01 PM by kriptobaron",
      "body": "Microsoft, yapay zeka şirketi OpenAI Ortaklığı açıklandı.https://twitter.com/OpenAI/status/1617522852273737728",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "January 24, 2023, 05:46:22 PM",
      "body": "Quote from: kriptobaron on January 23, 2023, 02:28:48 PMMicrosoft, yapay zeka şirketi OpenAI Ortaklığı açıklandı.https://twitter.com/OpenAI/status/1617522852273737728Yeni trend bunlar olabilir, bu şirketlerin yatırımlarına, güvenilir kripto paralarına dikkat etmekte fayda var, ne zamandır düşündüğüm bir şey var örneğin defi platformu seç 4 tane at 20 bin, taraftar token seç 4 tane at 20 bin, metaverse seç 4 tane at 20 bin, bir de bunu yap at sepetlerin hangisi en kazançlı olur zamanla görülür, bu sektör adını daha çok duyuracak,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "50promil",
      "created_time": "January 24, 2023, 05:58:34 PM",
      "body": "paylaşılan tokenler 2021 de 10x yapıp uykuya geçmişler ama bir daha uyanır mı? tatmin eder mi? riski çok yüksek açıkçası .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "January 24, 2023, 10:22:47 PM",
      "body": "Quote from: Phoenix Anka on January 17, 2023, 12:42:06 AMBu PHB bir ara çok popüler değil miydi? Ne oldu da o popülerlik azaldı acaba? Şimdi Bill Gates ile birlikte bu popülerliği tekrar kazanacak olan coinlerden birisi oluyor o zaman. İlgi çekici projeleri takip etmekte  fayda var. Hele Bill Gates dediyse daha çok dikkat etmekte fayda var. Şahsen ben çok popüler olduğu dönemi hatırlamıyorum, bir ico zamanı popülerdi yatırım için o kadar, öyle ahım şahım bir popülerliği yoktu, ico'dan beri de tutuyorum.Projenin gerçekten çok iyi olduğunu ve  gerçekten çalıştıklarını biliyorum, hali hazırda arkalarında altyapısı güçlü bir şirket bulunuyor, ben bakmanızı öneriyorum sadece.Microsoft, yapay zeka şirketi OpenAI'a 10 milyar dolar yatırım yapacağını da açıkladı, AI için start verildi, bu gelecek boğa AI coinlerinin uçup kaçtığı bir boğa olacak bana kalırsa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "January 27, 2023, 06:07:54 AM",
      "body": "Quote from: 50promil on January 24, 2023, 05:58:34 PMpaylaşılan tokenler 2021 de 10x yapıp uykuya geçmişler ama bir daha uyanır mı? tatmin eder mi? riski çok yüksek açıkçası .Hocam orası öyle. Benim de görüşüm eskiden olan bir projenin balinalar suyunu sıkmıştır geriye posası kalmıştır diye düşünüyorum ama şu da var o zamanlar AI projelerinde hype yoktu şimdi Bill Gates Elon gibi kişiler o hype'ı oluşturabilir. Yeni çıkan ya da çıkacak olan AI lere yatırım yapmak mantıklı. Ben eskiden var olanlara bir miktar yatırım yaptım ama yenilerini kovalıyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "January 27, 2023, 05:19:48 PM",
      "body": "Bu web 3.0 coinlerinin ortaya sunabildiği somut bir hizmet yok bence. Bunların karşısında geçen seferki nft rallisi daha anlamlı idi. Hiç değilse ortada al sat döndüren token lar vardı. AI coin özelinde de lafta kalan bin tane isimlendirme var. Şunu yaparız bunu yaparız e abi ne yaptınız diye bakıyorsun binance ta listelendiği yazıyor. İsmi AI olan bir projeye zamanında yatırım yapmıştım birkaç x yaptıktan sonra söndü gitti. Yine benzeri olur muhtemelen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriptobaron",
      "created_time": "January 27, 2023, 10:46:18 PM",
      "body": "Şuanda piyasadaki Al coinleri tamamen ChatGPT ve Microsoft ile bir hype yakaladı eminim ki önümüzdeki boğada bu alana yoğunlaşan yeni projeler çıkacaktır hem de haddinden fazla proje doluşacak piyasaya.Şimdilik seçenek olmadığı için insanlar bunlarla idare ediyor şöyle bir baktım da bunlar alıp da 3-5 yıl tutarım diyebileceğimiz coinler değiller riskliler.Daha iyileri lazım bize.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "January 28, 2023, 01:17:20 PM",
      "body": "Ben de Bill Gates ile aynı fikirdeyim bu konuda. Yapay zeka Web 3.0 ve Metaverse'in önünde olabilir. Çünkü Web 3.0 ve Metaverse'i daha bi anlamlı yapacak teknoloji yapay zekalar olacak. ChatGPT harici seslendirme yapan, resim çizen yapay zekalar var bugün. Teknolojinin gelişimi çok bi hızlı ilerliyor bu konuda. Yakında avukatlık, operatörlük gerektirmeyen doktorluk mesleklerini yapay zekalar kapacak. Merkeziyetsiz projelerde yapay zeka ile avukatlık hizmeti sunan tokenlar hoş bi gelecek sunar bana kalırsa. Danışmanlık bile yapsa yeter. Hakim karşısında savunmasa da olur.  Teknolojiye her zaman inanıyorum. Yapay zeka teknolojosi de diğerlerinden önde görüyorum Bill Gates gibi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriptobaron",
      "created_time": "January 30, 2023, 01:58:57 PM",
      "body": "Konu ile pek alakası yok ama yine de paylaşalım.Fenerbahçe Yeni Transferini Yapay zeka uygulaması ile duyurdu. https://twitter.com/Fenerbahce/status/1620052421002100737",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "January 30, 2023, 03:22:47 PM",
      "body": "Quote from: kriptobaron on January 30, 2023, 01:58:57 PMKonu ile pek alakası yok ama yine de paylaşalım.Fenerbahçe Yeni Transferini Yapay zeka uygulaması ile duyurdu. https://twitter.com/Fenerbahce/status/1620052421002100737Bence güzel bir reklam olmuş. Biz burada yapay zeka proje ve tokenlerine bakıyoruz bakıyoruz belki ama burada olan da yapay zekanın kendisi. Hakemlerin atamasında da yapay zeka kullanmıyoruz diyordu Sabri çelik yönetimi ara ara eleştiri alsa da yapay zekanın reklamı oluyor. Gelecek yapay zekada olacak ve bu da mutlaka coinlere yansıyacaktır. Bu arada güzel bir tanıtım olmuş ben beğendim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "January 30, 2023, 05:05:36 PM",
      "body": "Quote from: kriptobaron on January 30, 2023, 01:58:57 PMKonu ile pek alakası yok ama yine de paylaşalım.Fenerbahçe Yeni Transferini Yapay zeka uygulaması ile duyurdu. https://twitter.com/Fenerbahce/status/1620052421002100737Yapay zekayı artık hemen hemen her yerde her şirket,holding yada kulüpler gibi kar amacı güden oluşumlarda tanıtımlarını göreceğiz gibi. Bill Gates'in açıklaması daha sonrasında ChatGPT kullanımının artması, insanların merakıyla artık yapay zeka ile tamamen iletişim haline girer olduk, zaman içerisinde zamanda token fiyatlarına da yansıyacağı kuvvetli bir ihtimal olur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}