{
  "id": "topic_5473981",
  "title": "WhiteKnightBitcoin",
  "author": "WhiteKnightBitcoin",
  "created_time": "November 13, 2023, 09:54:20 PM",
  "content": "LinkedIn went insane and blocked me for bitcoin lasering my eyes and using a VPN/crypto SMS verify service.  I uploaded my Passport verification when asked, but they are so crazed about bots they won’t even approve my real ID.  I’m not doing anything illegal, I just want a LinkedIn for jobs.I am looking for an American to do the following:1) Register a LinkedIn account with my real name and an email I give you, using either a residential proxy IP or your real IP address.  So not using a data center VPN2) SMS verify(my numbers are blocked)3) Verify LinkedIn by downloading their mobile app, which likely has some kind of geolocation tracking and scanning the QR codeThis will take you like 10 minutes.  I’m paying $35 USD in whatever crypto you want.  Ideally low transaction fees, Bitcoin lightning would be good.  Please email me at WhiteKnightBitcoin@proton.me",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473981",
  "comments": [
    {
      "author": "Broadanbig",
      "created_time": "November 13, 2023, 10:12:47 PM",
      "body": "Quote from: WhiteKnightBitcoin on November 13, 2023, 09:54:20 PMLinkedIn went insane and blocked me for bitcoin lasering my eyes and using a VPN/crypto SMS verify service.  I uploaded my Passport verification when asked, but they are so crazed about bots they won’t even approve my real ID.  I’m not doing anything illegal, I just want a LinkedIn for jobs.I am looking for an American to do the following:1) Register a LinkedIn account with my real name and an email I give you, using either a residential proxy IP or your real IP address.  So not using a data center VPN2) SMS verify(my numbers are blocked)3) Verify LinkedIn by downloading their mobile app, which likely has some kind of geolocation tracking and scanning the QR codeThis will take you like 10 minutes.  I’m paying $35 USD in whatever crypto you want.  Ideally low transaction fees, Bitcoin lightning would be good.  Please email me at WhiteKnightBitcoin@proton.meI see this is your first post as a newbie so I will welcome you to this platform. I had to carefully read your offer but something bothers me bout your plight on this. I think you have not clearly stated why you need this job done because all you have said here holds no water and I must tell you that members would be skeptical of this offer.  If I may ask you, do you not have anybody around you there that could help you scale through your kyc or you are afraid of getting anybody around you to do it for you. Lastly your request i think sounds more of a random person to do the job but you are being specific of who will do the verification for you and why must it be an American?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "November 13, 2023, 11:28:13 PM",
      "body": "Just some random thought.Is it not possible to have one of your close family members or friends help you out with this rather than some stranger over the internet? They could easily help you with the sms verification and real IP address part.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wallet4bitcoin",
      "created_time": "November 13, 2023, 11:59:08 PM",
      "body": "Asking for KYC process from the forum randomly creates a trust issue, also, your newbie account is sufficient reason why forum members might not consider your plight even though you are truly geniune with your explanation and offer.You most likely have family and friends that can help you with the process, that's more like your inner circle that will understand you better than the forum members who will still be concerned with rendering assistance even though its  a paid offer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WhiteKnightBitcoin",
      "created_time": "November 14, 2023, 02:23:02 AM",
      "body": "These are all legitimate concerns and questions.Regarding the American part, I’m looking for US jobs.  So I want to write US on my LinkedIn, and therefore need the geolocation mobile verification there.Regarding the term “KYC”, this is not the legal definition of a KYC.  It’s downloading a mobile app from a random internet company with no legal authority.  The term KYC is for banking and has a legal obligation, while there is no legal liability for LinkedIn app downloads.  One can’t forge government documents or falsify a name, but there is no clear definition on what defines what my “phone number” or my “phone”?  And you’re not downloading it from me.  The app is from the official company.  So there is limited trust in me.Regarding the “newbie” account.  I said this is associated with my real name so of course I would never do anything shady on this forum.  I am an outstanding citizen in compliance with all laws and regulations and have no other accounts.  I am new!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RIDER3D",
      "created_time": "November 22, 2023, 04:05:34 PM",
      "body": "I'm also interested in such Linkedin account for $35",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CCMS",
      "created_time": "November 23, 2023, 12:30:18 PM",
      "body": "I wanted to know why is it so urgent for you to verify yourself on Linked In and why didn't you put here your Gmail address instead ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}