{
  "id": "topic_5448903",
  "title": "mikeoneal",
  "author": "mikeoneal",
  "created_time": "April 15, 2023, 02:44:58 AM",
  "content": "What is the best Btc accelerator  sites?Viabtc is very good , but $86 to accelarate a transaction.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448903",
  "comments": [
    {
      "author": "nc50lc",
      "created_time": "April 15, 2023, 03:50:31 AM",
      "body": "Quote from: mikeoneal on April 15, 2023, 02:44:58 AM-snip-Viabtc is very good , but $86 to accelarate a transaction.Are you perhaps looking for free transaction accelerator?Unfortunately, they only accept free acceleration service for 10sat/B transactions or above.Any other free accelerators (that's not a mining pool/solo miner) are fake services that only re-broadcast transactions which you node already did.Or a cheaper option?AFAIK, the suggested \"service fee\" is based from the transaction's size in consideration of the number of unconfirmed parent(s).I doubt other paid accelerators will charge you considerably less.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "April 15, 2023, 05:47:50 AM",
      "body": "Given how easy it is to enable RBF on a transaction, there really shouldn't ever be a reason to require a transaction accelerator anymore. Just opt in to RBF with every transaction you make, and you can replace it later with a higher fee if it gets stuck. This will work out much cheaper than paying any transaction accelerator service, not to mention quicker and easier as well. Even using CPFP will probably be much cheaper than paying for a transaction accelerator.Is your transaction opted in to RBF, or does it produce a change output? If so, use RBF/CPFP instead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "April 15, 2023, 06:54:14 AM",
      "body": "To add to the previous 2 posts: there's a scenario I can think of in which you can't do CPFP or RBF: if you received a transaction from a third party on an exchange. But that's something you shouldn't really do in the first place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "April 15, 2023, 07:57:50 AM",
      "body": "There are open source wallets that you can use that support opt-in RBF: Bitcoin open source wallets that support replace-by-fee (RBF)I have been using Electrum and Bluewallet. I can recommend both wallets. That does not mean that other wallets are not good too, but just recommending the ones I am using.RBF to pump fee on Electrum and Bluewallet is by default. If you check mempool site like https://mempool.space/ (for beginners) or https://jochen-hoenicke.de/queue/#BTC,24h,weight (for adviced users) to know the fee priority, you can pump the fee if there is any need to. You do not have to use those unrecommended wallets that do not support RBF. If you want to make a transaction that do not support RBF, you can disable it on those wallets that support it too. But if no any reason, let your transaction support opt-in RBF.I have test paid accelerator via ViaBTC before, I could not complete it when I have to pay a fee of over $70 to just accelerator a coin less than $100. Paid accelerator is not what you can like to go for. Always find ways to avoid it, I mean when mempool can become very congested to the extent that free accelerator would become difficult to use successfully.Quote from: nc50lc on April 15, 2023, 03:50:31 AMUnfortunately, they only accept free acceleration service for 10sat/B transactions or above.Also the transaction must not be more than 500 bytes.Quote from: https://www.viabtc.com/tools/txaccelerator/The volume of a single transaction must be ≤0.5 KB, and the transaction fee rate should be ≥ 0.0001 BTC/KB.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "April 15, 2023, 11:51:39 AM",
      "body": "Quote from: mikeoneal on April 15, 2023, 02:44:58 AMWhat is the best Btc accelerator  sites?Viabtc is very good , but $86 to accelarate a transaction.I would say that your best bet is to ask miner or a group of miners to include your transaction in their block but probably they'll charge you a lot and you'll spend some time to find them. Still the best option for you is probably to wait until it gets confirmed.Personally I did a transaction with 4sat/B today and it got confirmed in 1 hour. What was your fee? I think you can relax.Quote from: LoyceV on April 15, 2023, 06:54:14 AMTo add to the previous 2 posts: there's a scenario I can think of in which you can't do CPFP or RBF: if you received a transaction from a third party on an exchange. But that's something you shouldn't really do in the first place.That's exactly what I wanted to write right now. But I have noticed that some exchanges send transaction with enabled RBF feature. In this case, probably the best idea is to contact that third party to increase the transaction fee or if someone still wants or has to use third party, it's the best to avoid Bitcoin transaction in this case because these exchanges always send with very low fee and instead, one should choose Ripple or Nano or probably Bitcoin cash or Litecoin, depends how limited he is to options.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "April 15, 2023, 08:46:49 PM",
      "body": "Quote from: Synchronice on April 15, 2023, 11:51:39 AMBut I have noticed that some exchanges send transaction with enabled RBF feature.Which exchanges? Quote from: Synchronice on April 15, 2023, 11:51:39 AMIn this case, probably the best idea is to contact that third party to increase the transaction fee or if someone still wants or has to use third party, it's the best to avoid Bitcoin transaction in this case because these exchanges always send with very low fee and instead, one should choose Ripple or Nano or probably Bitcoin cash or Litecoin, depends how limited he is to options.Which coin is Nano? Because of low transaction fee, someone should hold altcoin instead?Exchanges processed bitcoin transaction fast, the huge withdrawal fee demanded for is more than enough to make the exchanges to use high transaction fee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "April 15, 2023, 09:58:26 PM",
      "body": "Quote from: Synchronice on April 15, 2023, 11:51:39 AMBut I have noticed that some exchanges send transaction with enabled RBF feature. In this case, probably the best idea is to contact that third party to increase the transaction feeAlthough this is not exactly what Loyce was talking about but I've never heard of someone complaining about n exchange withdrawal transaction being stuck for too long. Most reputable exchanges process withdrawal transactions in batches and they pay more than enough fee for a fast confirmation. In fact, fee overpayments by exchanges are the main reason why the mempool get congested every now and then.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "April 16, 2023, 10:24:13 AM",
      "body": "Quote from: khaled0111 on April 15, 2023, 09:58:26 PMQuote from: Synchronice on April 15, 2023, 11:51:39 AMBut I have noticed that some exchanges send transaction with enabled RBF feature. In this case, probably the best idea is to contact that third party to increase the transaction feeAlthough this is not exactly what Loyce was talking about but I've never heard of someone complaining about n exchange withdrawal transaction being stuck for too long. Most reputable exchanges process withdrawal transactions in batches and they pay more than enough fee for a fast confirmation. This is so right, and having RBF feature on an exchange sounds like overbearing and just a bragging feature that it can be used but in fact it's not. Also, i never heard any exchange have it, it might be better mentioning it here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "April 16, 2023, 03:01:27 PM",
      "body": "Quote from: o_e_l_e_o on April 15, 2023, 05:47:50 AMGiven how easy it is to enable RBF on a transaction, there really shouldn't ever be a reason to require a transaction accelerator anymore. ~snip~There are still a lot of people who have heard about some magical transaction accelerators where you can speed up your transaction even if you have paid a minimal fee, and they are not too interested in the RBF option which actually does what they didn't even want at the beginning, pay $0.50 or even a little more for their transaction. Quote from: Charles-Tim on April 15, 2023, 08:46:49 PMWhich coin is Nano? Because of low transaction fee, someone should hold altcoin instead?It was one of the few projects in which I participated by solving captchas and thus \"mining\" Nano coins, which were not even called that at the time (RaiBlocks). Although many things later went wrong when it came to that project, the fact is that the coin cannot succeed even when it has 0% fee and instant confirmation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "April 16, 2023, 03:04:17 PM",
      "body": "AFAIK, If the transaction does not contain RBF flag, then transferring the seeds to a wallet that supports that will not enable you to re-broadcast the transaction with higher fees.It is a future option, but in the current situation you are forced to wait if it has low fees (≤0.5 KB) or the platform forces you to use a wallet that does not support RBF.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "April 16, 2023, 03:43:41 PMLast edit: April 16, 2023, 04:17:58 PM by Charles-Tim",
      "body": "Quote from: Husires on April 16, 2023, 03:04:17 PMAFAIK, If the transaction does not contain RBF flag, then transferring the seeds to a wallet that supports that will not enable you to re-broadcast the transaction with higher fees.Yes, for RBF and also if he is not the receiver.If he imports the seed phrase on Electrum, he would be able to use CPFP. If it is BIP39 seed phrase, he would be able to use CPFP on Bluewallet.Quote from: Husires on April 16, 2023, 03:04:17 PMIt is a future option, but in the current situation you are forced to wait if it has low fees (≤0.5 KB) or the platform forces you to use a wallet that does not support RBF.ViaBTC free accelerator? The fee should be more than 10 sat/byte (0.0001 BTC/KB) and the size should be less than 500 bytes ((≤0.5 KB). If the input and outout are not many, the transaction would be less than 500 bytes. Using 1 input and 10 outputs while sending from legacy address to legacy addresses, the transaction size is 498 bytes. 471 bytes for bech32 to bech32 segwit. Although 549 bytes for bech32m to bech32m addresses, but with 1 input and 8 inputs, it would less than 500 bytes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "April 16, 2023, 05:40:44 PM",
      "body": "Quote from: Charles-Tim on April 15, 2023, 08:46:49 PMQuote from: Synchronice on April 15, 2023, 11:51:39 AMIn this case, probably the best idea is to contact that third party to increase the transaction fee or if someone still wants or has to use third party, it's the best to avoid Bitcoin transaction in this case because these exchanges always send with very low fee and instead, one should choose Ripple or Nano or probably Bitcoin cash or Litecoin, depends how limited he is to options.Which coin is Nano? Because of low transaction fee, someone should hold altcoin instead?Exchanges processed bitcoin transaction fast, the huge withdrawal fee demanded for is more than enough to make the exchanges to use high transaction fee.Nano is not a famous coin but it does its job. Instead, you can use XRP.And your second question sounds kinda strange. Personally, I have no problem with using bitcoin, it fulfills my needs but there are cases when you may prefer to use altcoins.For example, imagine you have Tron in your wallet and you have to buy something from website that has built-in coinbase payment gateway and your only option is to exchange Tron to coins that are accepted by Coinbase, what would you do? If you exchange Tron to Bitcoin address given by coinbase, then there is a chance that instant exchange may send it with low transaction fee and you'll have to wait hours to get 2 confirmation. In this case, it's best to exchange Tron to XRP address that's given by Coinbase and get your transaction done quickly and finish your order ASAP.Quote from: khaled0111 on April 15, 2023, 09:58:26 PMQuote from: Synchronice on April 15, 2023, 11:51:39 AMBut I have noticed that some exchanges send transaction with enabled RBF feature. In this case, probably the best idea is to contact that third party to increase the transaction feeAlthough this is not exactly what Loyce was talking about but I've never heard of someone complaining about n exchange withdrawal transaction being stuck for too long. Most reputable exchanges process withdrawal transactions in batches and they pay more than enough fee for a fast confirmation. In fact, fee overpayments by exchanges are the main reason why the mempool get congested every now and then. I don't mean exchanges like Binance and Coinbase, they spend transactions with good fee rates. I mean small instant exchanges that you can see on Bestchange.Quote from: PX-Z on April 16, 2023, 10:24:13 AMQuote from: khaled0111 on April 15, 2023, 09:58:26 PMThis is so right, and having RBF feature on an exchange sounds like overbearing and just a bragging feature that it can be used but in fact it's not. Also, i never heard any exchange have it, it might be better mentioning it here.It may sound overbearing but you can actually see that transactions from exchanges have RBF enabled. For example, check FixedFloat. Transactions from FF have RBF enabled and fees are sometimes very low.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "April 17, 2023, 01:47:51 PM",
      "body": "Try Bumped the fee by using child pay for a parent or by using Viabtc like you have said before there is actually BTC.com transaction accelerator back then but I didn't find the link now sorry Search on google and found a couple But I think DYOR first because I never used it.Next time before do any transaction check mempool.space first so you know the better fee to use that day",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "anubizz",
      "created_time": "June 19, 2023, 10:14:41 AM",
      "body": "I used these with success in the past:https://bitaccelerate.com/https://www.bitcoinjumper.com/And this one (but no free version any more):https://btcnitro.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "June 19, 2023, 12:16:36 PM",
      "body": "Quote from: anubizz on June 19, 2023, 10:14:41 AMI used these with success in the past:All these do is rebroadcast your transaction. They are absolutely useless. They achieve literally nothing if your transaction is still in the mempool, and if it isn't in the mempool might make things worse by rebroadcasting your transaction after it has dropped, preventing you from making a new transaction with a higher fee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "June 19, 2023, 12:32:45 PM",
      "body": "Quote from: o_e_l_e_o on June 19, 2023, 12:16:36 PMQuote from: anubizz on June 19, 2023, 10:14:41 AMI used these with success in the past:All these do is rebroadcast your transaction. They are absolutely useless. They achieve literally nothing if your transaction is still in the mempool, and if it isn't in the mempool might make things worse by rebroadcasting your transaction after it has dropped, preventing you from making a new transaction with a higher fee.It is interesting that people have difficulty accepting this fact and everyone hopes that it will somehow speed things up, but without it costing them. Then why would anyone pay a fee of more than 1 sat/byte, if they can subsequently just accelerate the transaction and finish the job?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "June 19, 2023, 12:55:36 PM",
      "body": "Quote from: examplens on June 19, 2023, 12:32:45 PMQuote from: o_e_l_e_o on June 19, 2023, 12:16:36 PMQuote from: anubizz on June 19, 2023, 10:14:41 AMI used these with success in the past:All these do is rebroadcast your transaction. They are absolutely useless. They achieve literally nothing if your transaction is still in the mempool, and if it isn't in the mempool might make things worse by rebroadcasting your transaction after it has dropped, preventing you from making a new transaction with a higher fee.It is interesting that people have difficulty accepting this fact and everyone hopes that it will somehow speed things up, but without it costing them. Then why would anyone pay a fee of more than 1 sat/byte, if they can subsequently just accelerate the transaction and finish the job?If person knows that much, he/she will send transaction with enabled RBF option and will have an idea about Child Pays For Parent option. Usually, people who post here about bitcoin transaction acceleration, are the ones who have no idea about where to check recommended fees, what's RBF or CPFP, have already tried so called free transaction accelerators (It's true that these fake accelerators play with keywords and lie to people) and then when all the free hope dies, they come here.There is a new paid transaction acceleration service from Shitnance, uups, sorry, Binance, here you can check it out: https://pool.binance.com/en/accelerationP.S. It's only for VIP users but it's easy to get VIP on Binance. Or you can just ask a friend or someone here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "June 19, 2023, 01:06:25 PM",
      "body": "It's very ok to either use the wallet that supports the use of RBF function like electrum wallet and then pump the fee to accelerate the transaction or rather you make use of the mining pool to accelerate your transactions where it will be broadcasted along with their own transactions to be confirmed together, but one thing i will like to add is that sometimes there maybe no need for doing this if the mempool is not congested, you can know that by checking it before making your transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "June 19, 2023, 11:36:33 PM",
      "body": "Quote from: anubizz on June 19, 2023, 10:14:41 AMI used these with success in the past:https://bitaccelerate.com/https://www.bitcoinjumper.com//\"success\" in the past does not mean that they actually \"accelerated\" your transaction because the bitter truth is that they did not. What you think was success was actually the fact that the optimal fee rate dropped as transactions kept getting cleared from the mempool with time until your transaction was included in the next block. With or without the so-called accelerators, your transaction would have been confirmed in that block at that very time anyway. Stop misinforming members.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}