{
  "id": "topic_5455233",
  "title": "tg88",
  "author": "tg88",
  "created_time": "June 05, 2023, 11:18:39 PM",
  "content": "No dia 30 de Maio o maior pool da história de mineração de Ethereum Ethermine ou tambem conhecido com Flypool anunciou que estará encerrando as suas atividades de pool de mineração apartir do dia 01 de julho, após o ETH deixar POW de lado eles vinham mantendo pools ativas para ETC, RavenCoin e Ergo mas não estavam conseguindo ganhar o suficiente para manter a estrutura de pé. Eles vão continuar oferecendo apenas stake para ETH.Me sinto um pouco triste com isso pois no dia que descobri cripto a primeira coisa que fui pesquisar na sequencia foi como minerar ETH e de cara cai no site do Ethermine onde iniciei na mineração, realmente o fim de uma era.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455233",
  "comments": [
    {
      "author": "joker_josue",
      "created_time": "June 06, 2023, 08:52:40 AM",
      "body": "Quote from: tg88 on June 05, 2023, 11:18:39 PMMe sinto um pouco triste com isso pois no dia que descobri cripto a primeira coisa que fui pesquisar na sequencia foi como minerar ETH e de cara cai no site do Ethermine onde iniciei na mineração, realmente o fim de uma era.Fim da 2ª era da mineração. O mais certo é voltar a surgir outro momento de mineração. Eu entendo perfeitamente o seu sentimento. Quando entrei, também comecei com a mineração Bitcoin. E a pessoa fica com aquele bichinho de querer continuar a minerar, mesmo sabendo que não é rentável.Um dia espero minerar um pouco com ASIC, mas sei que é cada vez mais complicado, pelo menos enquanto a forma atual de fazer as coisas continuar assim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "June 06, 2023, 04:16:54 PM",
      "body": "Quote from: tg88 on June 05, 2023, 11:18:39 PMMe sinto um pouco triste com isso pois no dia que descobri cripto a primeira coisa que fui pesquisar na sequencia foi como minerar ETH e de cara cai no site do Ethermine onde iniciei na mineração, realmente o fim de uma era.Acho que a maioria de nós acabou usando ou aprendendo algo no site da ethermine, eu mesmo já minerei com eles por um tempo, e se não me engano e lembro bem, a maioria dos miners já vinham configurados com a ethermine, acho que o Claymore mesmo vinha (detalhe, fiquei mais de 20 minutos tentando lembrar desse miner, foi o primeiro que usei  )Muita gente minerou muito ETH com a ethermine, vai ficar na lembrançaQuote from: joker_josue on June 06, 2023, 08:52:40 AMFim da 2ª era da mineração. O mais certo é voltar a surgir outro momento de mineração. Eu entendo perfeitamente o seu sentimento. Quando entrei, também comecei com a mineração Bitcoin. E a pessoa fica com aquele bichinho de querer continuar a minerar, mesmo sabendo que não é rentável.Um dia espero minerar um pouco com ASIC, mas sei que é cada vez mais complicado, pelo menos enquanto a forma atual de fazer as coisas continuar assim.Tomara que um dia volte mesmo joker, eu tenho um pouco de dúvidas, mas torço pra voltar na próxima geração da Nvidia, que vai coincidir com o halving do BTC, e se tudo correr bem, seria uma nova bullrun",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "June 06, 2023, 11:24:40 PM",
      "body": "Quote from: rdluffy on June 06, 2023, 04:16:54 PMacho que o Claymore mesmo vinha (detalhe, fiquei mais de 20 minutos tentando lembrar desse miner, foi o primeiro que usei  )Muita gente minerou muito ETH com a ethermine, vai ficar na lembrançaAcho que é assim que vamos nos tornando uns dinossauros das criptomoedas haha. Claymore sumiu de uma forma muito misteriosa também mas talvez foi só aproveitar a aposentadoria, uma época muito boa essa que passou mas sigo confiante para os novos tempos que virão pois ainda carrego uma parte do ETH que minerei todo esse tempo. No futuro se surgir novas oportunidades viaveis na mineração estarei investindo novamente sem dúvidas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}