{
  "id": "topic_5438012",
  "title": "Virginia21",
  "author": "Virginia21",
  "created_time": "February 04, 2023, 09:37:23 AM",
  "content": "Well from the start i really liked the projects with farming but there is a sugaryield.com with the  Amazing APR on farming i can't see that much ever they have different farms like Caramel_BUSD, Caramel_USDT, Caramel_DAI, Caramel_BUSD | Saltish_BUSD, Saltish_USDT, Saltish_DAI, Saltish_BUSD. Emission rate for each farm is same but the APR is different.Here is the catch, our APR is not static it varies based on number of contributors. For instance if only one person stake his token then APR probably 1,298,000% but as long as contributors increase then APR may drop upto 5160%.website: https://sugaryield.com/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5438012",
  "comments": [
    {
      "author": "dbshck",
      "created_time": "February 04, 2023, 11:30:42 AM",
      "body": "Quote from: Virginia21 on February 04, 2023, 09:37:23 AMWell from the start i really liked the projects with farming but there is a sugaryield.com with the  Amazing APR on farming i can't see that much ever they have different farms like Caramel_BUSD, Caramel_USDT, Caramel_DAI, Caramel_BUSD | Saltish_BUSD, Saltish_USDT, Saltish_DAI, Saltish_BUSD. Emission rate for each farm is same but the APR is different.It seems like just another AMM pool, with the high APR yield being paid in their own token, $SUGAR. Although they have added an extra layer of complexity with the introduction of Caramel and Saltish, it likely will follow a similar trajectory to many other protocols.Quote from: Virginia21 on February 04, 2023, 09:37:23 AMHere is the catch, our APR is not static it varies based on number of contributors. For instance if only one person stake his token then APR probably 1,298,000% but as long as contributors increase then APR may drop upto 5160%.What's gonna happen is the generous emission of rewards by the protocol will result in a significant drop in the price of $SUGAR token. This, combined with impermanent losses, will likely lead to most people incurring losses from farming.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cee2",
      "created_time": "February 04, 2023, 11:48:47 AM",
      "body": "APR of this magnitude are completely unsustainable.Maybe the first few people will make some positive returns but the rest will all loose it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Virginia21",
      "created_time": "February 04, 2023, 11:59:00 AM",
      "body": "Quote from: dbshck on February 04, 2023, 11:30:42 AMQuote from: Virginia21 on February 04, 2023, 09:37:23 AMWell from the start i really liked the projects with farming but there is a sugaryield.com with the  Amazing APR on farming i can't see that much ever they have different farms like Caramel_BUSD, Caramel_USDT, Caramel_DAI, Caramel_BUSD | Saltish_BUSD, Saltish_USDT, Saltish_DAI, Saltish_BUSD. Emission rate for each farm is same but the APR is different.It seems like just another AMM pool, with the high APR yield being paid in their own token, $SUGAR. Although they have added an extra layer of complexity with the introduction of Caramel and Saltish, it likely will follow a similar trajectory to many other protocols.Quote from: Virginia21 on February 04, 2023, 09:37:23 AMHere is the catch, our APR is not static it varies based on number of contributors. For instance if only one person stake his token then APR probably 1,298,000% but as long as contributors increase then APR may drop upto 5160%.What's gonna happen is the generous emission of rewards by the protocol will result in a significant drop in the price of $SUGAR token. This, combined with impermanent losses, will likely lead to most people incurring losses from farming.you Can also earn 2x rewards in BNB also i think they are doing great marketing to bring more users moreover their supply is limited and a APR is not fixed more people farm the APR decreases that's the thing attracts me",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "February 04, 2023, 01:11:56 PM",
      "body": "That's alluring but you know what? It's too good to be true, we'll all be rich if that percentage APY will remain to be like that. The APY really varies depending on how many will stake and invest on that project. But if it's an unknown one, it's most likely that only a few will invest because it's not ideal especially if the project isn't common. There have been a lot of investors that fell for that wrong encouragement because it's not really the way to go. I don't have to review all of those projects that you've mentioned. I've already given the keyword about being too good to be true.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "February 04, 2023, 03:25:01 PM",
      "body": "Quote from: Virginia21 on February 04, 2023, 09:37:23 AMHere is the catch, our APR is not static it varies based on number of contributors. For instance if only one person stake his token then APR probably 1,298,000% but as long as contributors increase then APR may drop upto 5160%.Up to 5160%Do you know what that means? That the APR can never drop below, 5160%What measures are there to ensure that it never goes below that?Nonetheless, this is too good to be true and just like many we have seen before, it's likely a lie and a scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "February 04, 2023, 03:51:06 PM",
      "body": "I don't see anything interesting about APR, the only thing I sense here is to attract investors. Yes, this is another techniques project owners do offers to attract and lure investor into their project, APR and ROI is major things investors hardly resist in any project. After all liquidity is pulled out, they are being left with an empty project. Although this might interest those who wants to invest, i am not a fan of altcoin and may hardly pick interest to look down into altcoin. The percentage are too huge for you and I to believe is real.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittick",
      "created_time": "February 04, 2023, 03:57:08 PM",
      "body": "LOL another scam token. You do like the project caused by you may be a part of the team or supporters who were trying to promote that shitty token in this forum. i would not be surprised if your motive was to asking others about opinion related to your scammy token. That scammy token was even mentioning binance logo instead of BSC. The site tries to mislead people by manipulating people's mind to think the crappy token cooperated with binance. No thanks man. that's scam.QuoteFor instance if only one person stake his token then APR probably 1,298,000% but as long as contributors increase then APR may drop upto 5160%Is that a joke? *LMAO",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ivankoh",
      "created_time": "February 05, 2023, 06:44:58 AM",
      "body": "QuoteAfter all liquidity is pulled out, they are being left with an empty project. Although this might interest those who wants to invest, i am not a fan of altcoin and may hardly pick interest to look down into altcoin. The percentage are too huge for you and I to believe is real.Yes. I think with such a high APR to stimulate demand for such an early stage investment, it is understandable.  But how sustainability really matters, over time their liquidity pools will dry up quickly.  Where does the hedge fund for that come from??  this is also one of several other things on defi that have similar problems.  I think looking at an attractive cake is not necessarily a good piece of cake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "posi",
      "created_time": "February 05, 2023, 09:22:26 AM",
      "body": "Quote from: Virginia21 on February 04, 2023, 09:37:23 AMWell from the start i really liked the projects with farming but there is a sugaryield.com with the  Amazing APR on farming i can't see that much ever they have different farms like Caramel_BUSD, Caramel_USDT, Caramel_DAI, Caramel_BUSD | Saltish_BUSD, Saltish_USDT, Saltish_DAI, Saltish_BUSD. Emission rate for each farm is same but the APR is different.Here is the catch, our APR is not static it varies based on number of contributors. For instance if only one person stake his token then APR probably 1,298,000% but as long as contributors increase then APR may drop upto 5160%.website: https://sugaryield.com/The higher the return, the higher the risk, this has been said thousands of times in the market. If you are willing to risk losing everything to get such a high APR, then you can give it a try. No one can give you any helpful advice in this case because we all, like you, never know how many days this project will take.Remember, highly profitable investments like these often don't last long enough for you to get out before it collapses. Don't try to be smarter than them when they're the creator of the game and you're just the player.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tony116",
      "created_time": "February 05, 2023, 11:40:45 PM",
      "body": "Quote from: Virginia21 on February 04, 2023, 09:37:23 AMWell from the start i really liked the projects with farming but there is a sugaryield.com with the  Amazing APR on farming i can't see that much ever they have different farms like Caramel_BUSD, Caramel_USDT, Caramel_DAI, Caramel_BUSD | Saltish_BUSD, Saltish_USDT, Saltish_DAI, Saltish_BUSD. Emission rate for each farm is same but the APR is different.Here is the catch, our APR is not static it varies based on number of contributors. For instance if only one person stake his token then APR probably 1,298,000% but as long as contributors increase then APR may drop upto 5160%.website: https://sugaryield.com/I have never heard of this project but look at the apy it provides, I can say that you stay away from it. With projects that promise high profits up to thousands of percent, we say they are not sustainable and a scam project. These projects can only deceive new investors like you, lack of knowledge about the market. Stay away from them and research top projects on the market such as Bitcoin or ETH, BNB. Remember that the higher the profit, the higher the risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "February 06, 2023, 03:59:08 PM",
      "body": "Quote from: Virginia21 on February 04, 2023, 11:59:00 AM-cut-you Can also earn 2x rewards in BNB also i think they are doing great marketing to bring more users moreover their supply is limited and a APR is not fixed more people farm the APR decreases that's the thing attracts me-cut-No you can't. It's 100% scam and you are either in it or newb who hasn't encountered these scams before. If you aren't in it you should lock this topic so you won't be luring in any newb victims. Otherwise your account (and your alt accounts) will get red trust for promoting a scam. And yes i would count your comments promoting it as they are not from someone who is listening the warnings you already had.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$crypto$",
      "created_time": "February 06, 2023, 04:30:19 PM",
      "body": "How many projects that offer large APRs are still going on now, of course, they have come out a lot after earning a lot of money. I don't even believe in any APR because this is not going to come true whether in new projects this is clear don't just trust investors should stay away from this offer.BTC Caramel with 1209% APR wow that is so crazy isn't it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "February 06, 2023, 04:48:01 PM",
      "body": "It's been just a few minutes of reading new threads in the forum and i can already tell organized shilling for this $SUGAR. obviously, the yields are too good to be true. we wouldn't be able to stop you from investing even iff we say NO.DEFI is really great source of income since 2020, so i have no doubt there will be more projects that will also work the same as it was. as long as you can sell the tokens you hold before all comes crashing again, why not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "beerlover",
      "created_time": "February 06, 2023, 08:15:32 PM",
      "body": "Quote from: electronicash on February 06, 2023, 04:48:01 PMIt's been just a few minutes of reading new threads in the forum and i can already tell organized shilling for this $SUGAR. obviously, the yields are too good to be true. we wouldn't be able to stop you from investing even iff we say NO.DEFI is really great source of income since 2020, so i have no doubt there will be more projects that will also work the same as it was. as long as you can sell the tokens you hold before all comes crashing again, why not. If the OP is truly shilling it then he isn't the one that will invest on it but he is only encouraging the public to do so by proposing how good this project are. At first glance the APR is huge. It was a million percent but if you keep on reading, there is a catch about it and that is the more the people that will invest on the project, the lower the APR can go.Now, will you still say that it was too good to be true? I bet not anymore. Defi is one of the hottest craze that we have here in crypto but I think their shine isn't bright anymore as before. Defi isn't the first and it's not going to be the last to be a profitable thing here in crypto but new trends can just come and go but not the original or the classical cryptos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "February 07, 2023, 07:02:03 PM",
      "body": "Quote from: Virginia21 on February 04, 2023, 09:37:23 AMWell from the start i really liked the projects with farming but there is a sugaryield.com with the  Amazing APR on farming i can't see that much ever they have different farms like Caramel_BUSD, Caramel_USDT, Caramel_DAI, Caramel_BUSD | Saltish_BUSD, Saltish_USDT, Saltish_DAI, Saltish_BUSD. Emission rate for each farm is same but the APR is different.Here is the catch, our APR is not static it varies based on number of contributors. For instance if only one person stake his token then APR probably 1,298,000% but as long as contributors increase then APR may drop upto 5160%.website: https://sugaryield.com/Well i think it is pretty obvious for everyone who is either older than 12 and has an IQ that is higher than 50 that you are part of the team and just shilling this project. There is another newbie-account that also has posted a shill post about this project today. So if you want to shill your project, then just do it openly and don't hide your shilling as a question or something like that.Like others already said, an APR of minimum 5160% is just not sustainable. Everyone that is able to do basic maths knows that. So if this numbers are really true, than the very early stakers maybe can make money, if the projects manages to attract a few new users after that, but everyone that joins a few hours or days to late will lose money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "February 07, 2023, 08:43:08 PM",
      "body": "Quote from: Virginia21 on February 04, 2023, 09:37:23 AMHere is the catch, our APR is not static it varies based on number of contributors. For instance if only one person stake his token then APR probably 1,298,000% but as long as contributors increase then APR may drop upto 5160%.I wonder if anyone really believes that the project can pay at least 10 investors 5160% p.a.? If that happens, the project will most likely go bankrupt. Such huge interest rates only serve to attract liquidity, such figures have little to do with reality. I don't even want to say anything about hundreds of thousands of percent, or even millions. This is an outright lie and a scam. No one will ever pay such interest on staking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}