{
  "id": "topic_5476593",
  "title": "AirtelBuzz",
  "author": "AirtelBuzz",
  "created_time": "December 05, 2023, 07:00:58 AM",
  "content": "According to the National Institute of Statistics and Census, inflation in Argentina is 142,7 per year. The country's struggling economy is one of the main drivers behind the Nov. 19 election of libertarian and Austrian-school economist Javier Millei as the new president. Inflation is one of the main reasons why Argentine citizens use alternatives to access dollars such as stablecoins. In this context, Miley is associated with Bitcoin and cryptocurrencies, due to her appeal to eliminate the central bank in her country. But right now, Miley's opinion on Bitcoin is neutral. \"The problem I see with cryptocurrencies is that they don't have legal tender status, and they don't have an asset value.  source",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476593",
  "comments": [
    {
      "author": "ImThour",
      "created_time": "December 05, 2023, 07:13:53 AM",
      "body": "They are still wrong on Bitcoin and I am not sure why they think Cryptocurrency == Bitcoin. Bitcoin is way different and acts more as an asset as compared to other Cryptocurrencies like Ethereum which does not reflect any asset values at all. Bitcoin has a fixed supply. It's literally much better than Gold. We do not have a fixed supply of any other  Major Cryptocurrency in the world.They all will follow the moves once a big player makes it, that's why these countries remain a follower not an innovator.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "December 05, 2023, 08:49:51 AM",
      "body": "Quote from: AirtelBuzz on December 05, 2023, 07:00:58 AMThe problem I see with cryptocurrencies is that they don't have legal tender status, and they don't have an asset value. sourceCryptocurrencies should not have legal tender status, becuase most of the coins are not as good as people would think it is. You can see now that there are more than 26000 cryptocurrencies. There are still more coins but only few remain good. Most are shit and dead coins. Also that most coins are securities and not commodities. The only coins that has legal tender status should be bitcoin. And it should be in a way citizens needs to know how volatile it is. Bitcoin also is a store of value and an asset of value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "December 05, 2023, 09:30:24 AM",
      "body": "South American countries, specifically Argentina, have a long history of clashes against the International Monetary Fund, and some of these clashes were public, and the problem always gets worse when the Federal Reserve raises interest rates. Therefore, this problem will persist, and people will react to it, and it will return again with the next increase in interest rates, and cryptocurrencies will not solve this matter.Cryptocurrencies may be a solution for individuals, but not for government investments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "December 05, 2023, 09:47:08 AM",
      "body": "Bitcoin does not need legal tender status to operate in any country, all it needs is for the government to not be anti bitcoin and not set rules that will limit the usage of bitcoin. Legal tender will often come with regulations and high levels of centralization, deviating from the core uses of bitcoin.I am also avoiding using cryptocurrency in general cause it is a general word which has a more than 99% rate of centralization and scams.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "December 05, 2023, 11:38:27 AM",
      "body": "Quote from: ImThour on December 05, 2023, 07:13:53 AMThey are still wrong on Bitcoin and I am not sure why they think Cryptocurrency == Bitcoin.Bitcoin initiates the cryptocurrency industry. Without Bitcoin, no cryptocurrency ecosystem.Bitcoin is the King in this ecosystem and it is the lovely asset for Bitcoin maximalist. Cryptocurrencies are abundant, in number they are thousands and there will be more cryptocurrencies created in future. Alternate cryptocurrencies are very scam and the forum even bans altcoin give aways because of their scam rate.Giveaway threads are not allowed",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitLeap",
      "created_time": "December 05, 2023, 11:58:26 AM",
      "body": "Quote from: AirtelBuzz on December 05, 2023, 07:00:58 AMAccording to the National Institute of Statistics and Census, inflation in Argentina is 142,7 per year. The country's struggling economy is one of the main drivers behind the Nov. 19 election of libertarian and Austrian-school economist Javier Millei as the new president. Inflation is one of the main reasons why Argentine citizens use alternatives to access dollars such as stablecoins. In this context, Miley is associated with Bitcoin and cryptocurrencies, due to her appeal to eliminate the central bank in her country. But right now, Miley's opinion on Bitcoin is neutral. \"The problem I see with cryptocurrencies is that they don't have legal tender status, and they don't have an asset value.  source Javier Millei is indeed pro Bitcoin, but he is still faced with the country's economic conditions which need to recover, improve infrastructure, increase state income and of course the public's demands to be able to show their vision and mission as a government must be proven. It's not enough to just say pro Bitcoin and then change all transactions. Argentina needs a balance where the country's financial identity remains unavoidable. Javier Millei has a responsibility not only to focus on one support, but he is also responsible for the people of Argentina who do not use Bitcoin.For Javier Milei, currently it is not a question of whether he is neutral or not regarding the inauguration of Bitcoin, it is just that he is aware that while serving as head of state he cannot focus on one source of income. It is not easy for a leader of a country whose job is to improve the economy with a population of more than 45.81 million people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "December 05, 2023, 05:14:17 PM",
      "body": "OP, Javier Milei is a man, so I think \"his\" makes more sense than \"her\" if you are referring to this person. Or were you referring to something else, like the country of Argentina in general?The article mentions that Milei said different things about cryptos and Bitcoin in different interviews, and, considering that the article is very new, there's probably not enough information yet to know which policies he will actually try to implement. Bitcoin is one solution, but maybe he'll opt for a different one, such as dollarization.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "December 05, 2023, 06:13:47 PM",
      "body": "Quote from: AirtelBuzz on December 05, 2023, 07:00:58 AMAccording to the National Institute of Statistics and Census, inflation in Argentina is 142,7 per year. The country's struggling economy is one of the main drivers behind the Nov. 19 election of libertarian and Austrian-school economist Javier Millei as the new president. Inflation is one of the main reasons why Argentine citizens use alternatives to access dollars such as stablecoins. In this context, Miley is associated with Bitcoin and cryptocurrencies, due to her appeal to eliminate the central bank in her country. But right now, Miley's opinion on Bitcoin is neutral. \"The problem I see with cryptocurrencies is that they don't have legal tender status, and they don't have an asset value.If you are saying cryptocurrency has no asset value now then it would be wrong to say because there are around 20k+ cryptocurrencies and let's guess, 40% have asset value, which means they are backed by real money (pegged with another currency). But if you solely talking about BTC then yeah it is not pegged with any real-world assets. As it is decentralized and its prices depend on demand and supply.Anyway, your title of the topic says, that BTC adoption has increased in Argentina while in the post you are saying Miley's opinion on Bitcoin is neutral. I don't see it as an increment in the adoption of BTC instead these are just Miley's concerns about BTC, or it shows that they have BTC in their minds and they might do something in it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "December 05, 2023, 06:21:34 PM",
      "body": "Quote from: AirtelBuzz on December 05, 2023, 07:00:58 AMAccording to the National Institute of Statistics and Census, inflation in Argentina is 142,7 per year. The country's struggling economy is one of the main drivers behind the Nov. 19 election of libertarian and Austrian-school economist Javier Millei as the new president. Inflation is one of the main reasons why Argentine citizens use alternatives to access dollars such as stablecoins. In this context, Miley is associated with Bitcoin and cryptocurrencies, due to her appeal to eliminate the central bank in her country. But right now, Miley's opinion on Bitcoin is neutral. \"The problem I see with cryptocurrencies is that they don't have legal tender status, and they don't have an asset value.  source Bitcoin cannot become a mainstream currency. The Bitcoin network is simply not capable of handling such volumes. Also the current situation of Argentina is not something where Bitcoin or other cryptocurrencies can help. It is simply not possible. If Argentina really wants to get back on track, we will have to adopt some other currency systems just the way Zimbabwe did. Cryptocurrencies are not the answers to every problem. Removing Central Bank entirely can be a suicide for Argentina. Alternatively cryptocurrency can work as a parallel currency system in the country where both fiat and cryptos can be used to buy goods and services. Removing feat entirely can have severe consequences which may not be reversible at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "December 05, 2023, 09:16:29 PM",
      "body": "The new president uses many mimicry, examples that underlie his ideals, in days past he used the air as an idea of why the air we breathe was free, and he underlies them in the idea that when there is a lot of air there is too much supply... example is \"bizarre\" but from the point of view of applying the idea of supply and demand it works.So, bitcoin is in a way a reflection of that idea(s) that the new Argentine president has of sticking to his explanations, anyway, if whether or not he can eliminate the central bank, he seeks to dollarize the Argentine economy, but bitcoin as an alternative function is very far from his initial political enclaves, let's say that... his idea with bitcoin is reflected in that simile that he used with the idea of air-free.Now, his distancing from bitcoin as a political weapon does not distance him from bitcoin achieving better legislation that allows a better position with the existing rules...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "December 06, 2023, 11:48:40 AM",
      "body": "When referring to cryptocurrency, the person making such a reference must also know that there are thousands of them in the space, and it's not all that is worth investing money in. You cannot look at some shitcoins without condemning crypto as not worth a legal tender or an asset, but how about focusing on Bitcoin alone? Bitcoin is dominant, persistent, and always an asset that generates profit during the bull market, and those who have invested in it do not regret holding it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "icalical",
      "created_time": "December 06, 2023, 03:48:10 PM",
      "body": "So, in short, on his campaign to win election he promise that he want to eliminate the central bank and then adopt cryptocurrency, but now when he actually win the election he thought that cryptocurrency doesn't have asset value. Well, this is just a typical politician move, they will promise anything that the voter want to hear, but most of the time they never keep their promise. I understand that disbanding central bank and adopting Bitcoin is very radical and significant move, it will be very hard to be applied, but if he doesn't want to do it, he shouldn't promise this thing in the first place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alpha Marine",
      "created_time": "December 06, 2023, 07:33:18 PM",
      "body": "We have to establish a fact. The fact that a leader is pro-Bitcoin does not make him a good leader. He can be pro-Bitcoin just for the sake of votes.Argentina's problem is not a problem Bitcoin can solve. Even if they make Bitcoin legal tender it won't change much. Bitcoin is not an economic savior. Some things are needed for a better economy. Proposing to eliminate a central bank is not the way to go for me. The central bank is the best rock of every economy. How does he want to improve a centralized system without the central bank? I don't really know the full details of how things are on the ground in Argentina but eliminating the central bank is not a solution. The institution is not the problem but the greedy people running the institution.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FinePoine0",
      "created_time": "February 27, 2024, 12:45:55 AM",
      "body": "NEW: 🇦🇷 Javier Milei aims to implement a currency competition system within Argentina and pass a law to imprison anyone printing money to cover government spending 👀Source Link or Video link: https://twitter.com/BitcoinNewsCom/status/1761922985445744747?t=TrUnO6RODIEoGd_oUCQ2nA&s=19",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}