{
  "id": "topic_5472895",
  "title": "Hewlet",
  "author": "Hewlet",
  "created_time": "November 05, 2023, 05:21:07 AM",
  "content": "Have you noticed that the more you search on a particular kind of topic on your YouTube, Facebook, or google, the more you see more of those related topics? There is how much you will search on cryptocurrency-related topics on YouTube that all the recommended videos that will come when you navigate through YouTube will just focus on cryptocurrencies. For others who might have other interests like music, if you use their phone to access YouTube, you will find out that most of the content you will see will be music-related.I know this is designed and programmed by the developers of those sites but it tells a lot about what goes on in our lives. If you surround yourself with positive thoughts or ideas, more positive thoughts will continue coming in and with time you will dispel every form of negative thought.If you focus on thinking out solutions to life challenges rather than sitting back to complain and creating excuses, more solutions and ideas will fill your head and with time all the thoughts regarding the challenge that would have weighed you down will gradually become a thing of the past",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472895",
  "comments": [
    {
      "author": "jrrsparkles",
      "created_time": "November 05, 2023, 06:25:12 PM",
      "body": "Quote from: Hewlet on November 05, 2023, 05:21:07 AMHave you noticed that the more you search on a particular kind of topic on your YouTube, Facebook, or google, the more you see more of those related topics? That is called an algorithm, an AI will analyse all your inputs such as searches, viewed contents, history and everything and bring more contents to you to keep yourself engaged in the platform then only they can make more money.Quote from: Hewlet on November 05, 2023, 05:21:07 AM but it tells a lot about what goes on in our lives. If you surround yourself with positive thoughts or ideas, more positive thoughts will continue coming in and with time you will dispel every form of negative thought.If you focus on thinking out solutions to life challenges rather than sitting back to complain and creating excuses, more solutions and ideas will fill your head and with time all the thoughts regarding the challenge that would have weighed you down will gradually become a thing of the past It's acceptable but being positive alone will not change anything, it will give you the courage to move forward, what to do next, and so on. Optimism is abused by many genZ people and lose their lives without actually making any effort to make changes to it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samlucky O",
      "created_time": "November 11, 2023, 07:37:26 PM",
      "body": "You are actually correct Google search engine has that authentic word sudjestion. And has a similar topic detector or suggestions of related topics. This help you to get the required information needed to emback on your journey. It is always helpful and takes you to places where you don't expect and you will even learn more. What so ever we do is always a reflection of us. I remember asking my friend to help me with his phone, when I tried to search something I see topics that were typed previously. Guest what? it was pornography sites that is to show the kind of things he does with his phone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "November 12, 2023, 05:19:31 AM",
      "body": "Quote from: jrrsparkles on November 05, 2023, 06:25:12 PMQuote from: Hewlet on November 05, 2023, 05:21:07 AMHave you noticed that the more you search on a particular kind of topic on your YouTube, Facebook, or google, the more you see more of those related topics? That is called an algorithm, an AI will analyse all your inputs such as searches, viewed contents, history and everything and bring more contents to you to keep yourself engaged in the platform then only they can make more money.Quote from: Hewlet on November 05, 2023, 05:21:07 AM but it tells a lot about what goes on in our lives. If you surround yourself with positive thoughts or ideas, more positive thoughts will continue coming in and with time you will dispel every form of negative thought.If you focus on thinking out solutions to life challenges rather than sitting back to complain and creating excuses, more solutions and ideas will fill your head and with time all the thoughts regarding the challenge that would have weighed you down will gradually become a thing of the past It's acceptable but being positive alone will not change anything, it will give you the courage to move forward, what to do next, and so on. Optimism is abused by many genZ people and lose their lives without actually making any effort to make changes to it.agreedit can also be confused with toxic positivity sometimes there are things that go wrong and it’s not necessarily a bad thing to acknowledge that rather it’s even healthy to identify negative things and process them in such a way that isn’t harmfulif your mindset is to just throw out the negativity how can you solve them? learn how to balance the good and bad in life because they co-exist",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "November 12, 2023, 06:58:34 AM",
      "body": "Quote from: btc78 on November 12, 2023, 05:19:31 AMQuote from: jrrsparkles on November 05, 2023, 06:25:12 PMQuote from: Hewlet on November 05, 2023, 05:21:07 AMHave you noticed that the more you search on a particular kind of topic on your YouTube, Facebook, or google, the more you see more of those related topics? That is called an algorithm, an AI will analyse all your inputs such as searches, viewed contents, history and everything and bring more contents to you to keep yourself engaged in the platform then only they can make more money.Quote from: Hewlet on November 05, 2023, 05:21:07 AM but it tells a lot about what goes on in our lives. If you surround yourself with positive thoughts or ideas, more positive thoughts will continue coming in and with time you will dispel every form of negative thought.If you focus on thinking out solutions to life challenges rather than sitting back to complain and creating excuses, more solutions and ideas will fill your head and with time all the thoughts regarding the challenge that would have weighed you down will gradually become a thing of the past It's acceptable but being positive alone will not change anything, it will give you the courage to move forward, what to do next, and so on. Optimism is abused by many genZ people and lose their lives without actually making any effort to make changes to it.agreedit can also be confused with toxic positivity sometimes there are things that go wrong and it’s not necessarily a bad thing to acknowledge that rather it’s even healthy to identify negative things and process them in such a way that isn’t harmfulif your mindset is to just throw out the negativity how can you solve them? learn how to balance the good and bad in life because they co-existEven toxicity can act as a catalyst for someone to change their life so the underlying point is it can be the point that changes may happen but without any effort from the individual nothing will be changed.And for someone who thinks they will become a billionaire just by watching a motivational speech then the day will never arrive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "November 14, 2023, 11:47:09 PM",
      "body": "Yes, that's algorithm and I don't know how you're able to relate that with focus and things in life. But that's a good motivation for those that are confused and deals hardship with their matters right now. Go and focus yourself and deal with them one at a time.And always, don't talk a lot infront of your smartphone or PCs that has microphones on or else you'll always get to see what you talk about especially with the brand names.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "November 15, 2023, 05:43:36 AM",
      "body": "you are comparing our mindset into AI technologies ? those internet site are reading our activities that's why they are sending us those related things towards  our engine  .Life is also like that and you are completely correct , If we will only focus in same target in life then we will be heading towards the same thing and also we will be reaching same thing over and over inside our mind.You have shared a better thoughts and this is really helpful mate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ubakama",
      "created_time": "November 16, 2023, 04:30:27 AM",
      "body": "What we search more on the Internet tends to pop up when we browse the Internet. Algorithms",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Brijuek Bukah Boh",
      "created_time": "November 25, 2023, 01:43:04 PM",
      "body": "Quote from: Hewlet on November 05, 2023, 05:21:07 AMHave you noticed that the more you search on a particular kind of topic on your YouTube, Facebook, or google, the more you see more of those related topics? There is how much you will search on cryptocurrency-related topics on YouTube that all the recommended videos that will come when you navigate through YouTube will just focus on cryptocurrencies. For others who might have other interests like music, if you use their phone to access YouTube, you will find out that most of the content you will see will be music-related.I know this is designed and programmed by the developers of those sites but it tells a lot about what goes on in our lives. If you surround yourself with positive thoughts or ideas, more positive thoughts will continue coming in and with time you will dispel every form of negative thought.If you focus on thinking out solutions to life challenges rather than sitting back to complain and creating excuses, more solutions and ideas will fill your head and with time all the thoughts regarding the challenge that would have weighed you down will gradually become a thing of the past History yotube (yt), or facebook it will show related searches to what we are looking for, for example if you on yt often watch crypto, then on your homepage will come out several videos related to crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}