{
  "id": "topic_5406258",
  "title": "safar1980",
  "author": "safar1980",
  "created_time": "July 14, 2022, 12:03:15 PM",
  "content": "Большинство крупных компаний, занимающихся майнингом криптовалют, продали биткойны, добытые самостоятельно, в то время как некоторые фирмы, такие как Marathon, Hut 8 и Hive, все еще держатся.Цена на оборудование для майнинга криптовалюты, вероятно, продолжит падать в ближайшем будущем на фоне продолжающейся криптозимы, по словам руководителя крупного майнингового BTC  пула  F2Pool. Поддерживая  14,3% сети BTC, F2Pool является одним из крупнейших в мире пулов для майнинга биткойнов. Во вторник F2Pool  выпустила свое последнее обновление для майнинг отрасли.Сосредоточившись на результатах майнинга BTC в июне 2022 года, в отчете F2Pool отмечается, что большинство компаний по добыче биткойнов, таких как Core Scientific, недавно решили продать свои  добытые биткойны.Bitfarms, крупная канадская компания по добыче BTC, продала 3000 биткойнов, или почти 50% всей своей доли BTC, за 62 миллиона долларов, чтобы сократить свою кредитную линию в июне.«Я изучил почти 10 публичных промышленных майнеров и обнаружил, что все они очень честно говорят всем, что продают добытые биткойны», — написала в отчете директор F2Pool по глобальному развитию бизнеса Лиза Лю. Она добавила, что вырученные средства используются для финансирования операционных расходов и увеличения капитала, а также для сокращения обязательств по договорам кредита на оборудование и объекты.Далее Лю сказала, что лишь несколько публичных промышленных майнеров заявили, что будут придерживаться своей давней стратегии HODL . Среди них были такие фирмы, как Marathon, Hut 8 и Hive Blockchain Technologies. «В частности, у Hive на удивление нет значительного долга, а также финансирования оборудования ASIC и GPU», — добавила она.Исполнительный директор также упомянул, что цена ASIC резко упала за последние несколько месяцев. По сообщениям, к началу июня цена  ASIC высшего и среднего уровня упала на 70% по сравнению с их историческим максимумом в диапазоне от 10 000 до 18 000 долларов.На момент написания статьи флагманский асик Bitmain Antminer S19 Pro продается на Amazon по цене от 4000 до 7000 долларов за подержанные устройства. Совершенно новое устройство, по-видимому, по-прежнему продается по цене более 11 000 долларов.Цены на ASIC будут продолжать падать еще больше, если майнеры не смогут обеспечить хешрейт по конкурентоспособному уровню цен, что может привести к тому, что многие новые майнеры уйдут из майнинга, предсказала Лю, заявив:«Я думаю, что цены на ASIC будут продолжать падать, хотя они уже быстро упали с момента достижения пика. Если владельцы оборудования не смогут обеспечить хешрейт и по конкурентоспособной цене, многие новички, которые в прошлом году запрыгнули на хэш-поезд, скорее всего, будут сброшены».Лю подчеркнула, что такая ситуация будет «наихудшим сценарием», поскольку F2Pool хочет, чтобы «каждый майнер пережил эту холодную зиму».В заявлении для Cointelegraph Лю подчеркнула, что в индустрии майнинга криптовалют по-прежнему будет много новичков из-за более низкой цены майнинга. «Конечно, будут уходить майнеры, но также и новые компании или частные лица, которые выйдут на рынок майнинга, воспользовавшись более низкими ценами на ASIC», — отметила она.По состоянию на середину июля доход от майнинга биткойнов упал почти на 80% за девять месяцев после достижения рекордного уровня в 74,4 млн долларов в октябре 2021 года. Резкое падение спровоцировало резкое падение цен на графические процессоры, что наконец, стал более доступным после глобальной нехватки чипов, вызванной пандемией.Источникhttps://cointelegraph.com/news/bitcoin-miner-prices-will-continue-to-fall-f2pool-exec-predicts",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406258",
  "comments": [
    {
      "author": "safar1980",
      "created_time": "July 15, 2022, 04:35:10 PM",
      "body": "Добыча одного биткоина подешевела до $13 000 — JPMorganОценочная стоимость добычи биткоинов снизилась, потому что для этих целей расходуется меньше электричества. По данным Кембриджского индекса потребления электроэнергии, в сутки сеть биткоина потребляет около 9,77 гигаватт, на 30% ниже декабрьского пика на уровне 14,18 гигаватт.Стратеги JPMorgan во главе с Николаосом Панигирцоглу связывают это с тем, что майнеры переходят на более энергоэффективное оборудование и отключают неэкономичные установки, чтобы сохранить рентабельность. Эксперты уверены, что этот тренд будет сдерживать рост цен на криптовалюту.Источникhttps://beincrypto.ru/dobycha-odnogo-bitkoina-podeshevela-do-13-000-jpmorgan/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FontSeli",
      "created_time": "July 16, 2022, 12:33:37 PM",
      "body": "Quote from: safar1980 on July 14, 2022, 12:03:15 PM«Я изучил почти 10 публичных промышленных майнеров и обнаружил, что все они очень честно говорят всем, что продают добытые биткойны», — написала в отчете директор F2Pool по глобальному развитию бизнеса Лиза Лю. Она добавила, что вырученные средства используются для финансирования операционных расходов и увеличения капитала, а также для сокращения обязательств по договорам кредита на оборудование и объекты.Мне вот интересно продают ли они только добываемые в данный момент Биткоины или и те что добыли и в \"сытые годы\". И если это так, то почему они не продавали монеты когда Биткоин стоил в 2-3 раза выше чем сейчас, зачем копили?В любом случае, для майнеров Биткоины - это прежде всего товар и для них важно чтобы цена продажи была выше себестоимости и тогда они в любом случае будут в плюсе. На медвежьем рынке лучшая стратегия - это продавать только то количество которое нужно для покрытия затрат, а остальное копить на лучшие времена.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mak013",
      "created_time": "July 19, 2022, 07:38:29 AM",
      "body": "Quote from: FontSeli on July 16, 2022, 12:33:37 PMQuote from: safar1980 on July 14, 2022, 12:03:15 PM«Я изучил почти 10 публичных промышленных майнеров и обнаружил, что все они очень честно говорят всем, что продают добытые биткойны», — написала в отчете директор F2Pool по глобальному развитию бизнеса Лиза Лю. Она добавила, что вырученные средства используются для финансирования операционных расходов и увеличения капитала, а также для сокращения обязательств по договорам кредита на оборудование и объекты.Мне вот интересно продают ли они только добываемые в данный момент Биткоины или и те что добыли и в \"сытые годы\". И если это так, то почему они не продавали монеты когда Биткоин стоил в 2-3 раза выше чем сейчас, зачем копили?В любом случае, для майнеров Биткоины - это прежде всего товар и для них важно чтобы цена продажи была выше себестоимости и тогда они в любом случае будут в плюсе. На медвежьем рынке лучшая стратегия - это продавать только то количество которое нужно для покрытия затрат, а остальное копить на лучшие времена.может и продавали. может и с прошлой медвежки держали и продавали на хаях. как и сейчас начинают копить. не думаю, что нам скажут правду. плюс вполне могли продавать на хаях с запасом, которого им хватит, чтобы вообще ничего не продавать на этой медвежке. мне более интересно на каком халвинге добыча станет настолько ничтожна, а сложность столь велика, что на манинг битка просто забьют?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}