{
  "id": "topic_5439931",
  "title": "joker_josue",
  "author": "joker_josue",
  "created_time": "February 15, 2023, 09:49:47 AM",
  "content": "Hoje vi uma noticia sobre o autor de Pai Rico, Pai Pobre (um livro que estou sempre a ouvir falar aqui no fórum, mas ainda não li).Segundo Robert Kiyosaki, brevemente iremos assistir a um grande colapso econômico e uma grande valorização do Bitcoin.Quote from: exame.com“Um grande colapso está por vir. Possível recessão. O Fed foi forçado a imprimir bilhões em dinheiro falso. Até 2025 o ouro estará em US$ 5 mil, prata em US$ 500 e o bitcoin em US$ 500 mil. Por quê? Porque a fé no dólar norte-americano será destruída. Ouro e prata são o dinheiro de Deus. Bitcoin é o dinheiro do povo. Cuidem-se”, publicou Robert Kiyosaki no Twitter.(...)Segundo ele, o governo norte-americano não realiza decisões confiáveis sobre a política monetária do país, que vem enfrentando altos níveis de inflação nos últimos anos. A principal crítica de Kiyosaki é contra a impressão excessiva de dólares, o que ele chama de “dinheiro falso”.Aqui esta o Twitter dele: https://twitter.com/theRealKiyosaki/status/1624988584267894784Perante esta analise, qual é atitude que vocês tomariam (ou irão tomar) ao ouvir estas palavras deste especialista?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5439931",
  "comments": [
    {
      "author": "bitmover",
      "created_time": "February 15, 2023, 12:13:53 PM",
      "body": "Quote from: joker_josue on February 15, 2023, 09:49:47 AMPerante esta analise, qual é atitude que vocês tomariam (ou irão tomar) ao ouvir estas palavras deste especialista?Kiyosaki  não é nenhum guru dos investimentos,  ele é um escritor de livros de finanças para leigos, ensinando coisas extremamente simples do tipo \"não faça dividas\".Embora muito respeitado, suas colocações são bastante simples. Essa frase mesmo já foi repetida em muitos fóruns diferentes, e eu concordo bastante com ele.A emissão de dinheiro descontrolada (usd, eur, brl etc) causou essa alta inflação ao redor do mundo, e os cidadãos têm poucos mecanismos para proteção. O bitcoin pode ser um desses mecanismos,  mas a alta volatilidade ainda o torna bastante riscado para proteção...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "February 15, 2023, 12:15:48 PM",
      "body": "Essa semana eu abri aleatório um vídeo de um ''especialista financeiro'' e ele estava contando a seguinte história:''Acho que tudo é uma questão de mindset. Algumas pessoas tem um pensamento focado em bilhões, outras em milhões. Quando eu estava chegando ao meu primeiro milhão, eu percebi que investir não seria suficiente para subir de patamar. Que eu continuasse a fazer o que eu estava fazendo, as coisas não se alavancariam tão bem. Então eu pensei, preciso fazer uma coisa nova se quero subir. Foi quando eu comecei a palestras.''Como o Lynch diz, o dinheiro dos inexperientes apenas se torna tolo quando ouve os especialistas. Lembro desse cara fazer muuuuuuitas previsões bem erradas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "February 15, 2023, 12:19:42 PM",
      "body": "Até bom que você criou esse tópico Joker, fazia tempo que queria saber a opinião de vocês sobre eleO livro é excelente, é bem para iniciantes mesmo, mas você não tem ideia de quanta gente não tem simples conhecimentos sobre o dinheiro e o livro é bem recomendado.Ele ensina bons conceitos sobre poupança, alguns conceitos são mais relevantes para os Estados Unidos, mas ainda assim vale a pena ler.Eu acompanho algumas notícias sobre as coisas que ele fala, e já faz muitos anos que ele vem falando que \"agora é pra valer, a recessão vai chegar\", sério, ele fala toda hora que vai ter uma grande crise, uma hora ele acerta, mas depois de não sei quantas tentativas  Quem sou eu pra falar, mas ele fez um baita livro, é famoso, tem conhecimento, mas fica tentando fazer umas previsões que ao meu ver, ele nem precisava.O lado bom é que ele até defende o BTC na maioria das vezes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "February 15, 2023, 03:02:40 PM",
      "body": "Quote from: rdluffy on February 15, 2023, 12:19:42 PMQuem sou eu pra falar, mas ele fez um baita livro, é famoso, tem conhecimento, mas fica tentando fazer umas previsões que ao meu ver, ele nem precisava.O lado bom é que ele até defende o BTC na maioria das vezes.Pois as vezes, um cara consegue ficar famoso, que tende a começar a fazer observações que muitas vezes pouco valor tem. Mas, como é bem conhecido, as suas palavras acabam por ter uma propagação maior.Quote from: Disruptivas on February 15, 2023, 12:15:48 PM''Acho que tudo é uma questão de mindset. Algumas pessoas tem um pensamento focado em bilhões, outras em milhões. Quando eu estava chegando ao meu primeiro milhão, eu percebi que investir não seria suficiente para subir de patamar. Que eu continuasse a fazer o que eu estava fazendo, as coisas não se alavancariam tão bem. Então eu pensei, preciso fazer uma coisa nova se quero subir. Foi quando eu comecei a palestras.''É sempre assim. Enquanto você não consegue o seu primeiro milhão, todas as estratégias são validas. Mas, ele conseguiu esse milhão investindo? Não é agora, porque chegou a 1 milhão que deixa de ser uma boa estratégia. E sinceramente, não é a fazer palestras que vai ganhar mais um milhão.Se dizeres, que ele investiu esse milhão, e passa a viver a custa das palestras, eu já acredito.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "February 17, 2023, 12:58:57 PM",
      "body": "Quote from: joker_josue on February 15, 2023, 03:02:40 PMÉ sempre assim. Enquanto você não consegue o seu primeiro milhão, todas as estratégias são validas. Mas, ele conseguiu esse milhão investindo? Não é agora, porque chegou a 1 milhão que deixa de ser uma boa estratégia. E sinceramente, não é a fazer palestras que vai ganhar mais um milhão.Se dizeres, que ele investiu esse milhão, e passa a viver a custa das palestras, eu já acredito.Acho que no caso dele - que é um super influencer brasileiro de finanças- ele realmente conseguiu mais de um milhão fazendo palestra sim. Mas isso é uma super controversia. E o que achei mais estranho é que o cara que estava ouvindo, achou isso INCRÍVEL. Eu achei muito tosco. Porque na prática, ele estava dizendo: não é o que eu falo sobre investimento, mas POR falar que eu ganho dinheiro e consigo subir de patar. Acho que é o caso de vários.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "February 17, 2023, 03:06:16 PM",
      "body": "Quote from: Disruptivas on February 17, 2023, 12:58:57 PMAcho que no caso dele - que é um super influencer brasileiro de finanças- ele realmente conseguiu mais de um milhão fazendo palestra sim. Mas isso é uma super controversia. E o que achei mais estranho é que o cara que estava ouvindo, achou isso INCRÍVEL. Eu achei muito tosco. Porque na prática, ele estava dizendo: não é o que eu falo sobre investimento, mas POR falar que eu ganho dinheiro e consigo subir de patar. Acho que é o caso de vários.  De acordo. Ele consegue fazer um milhão, porque já ganhou um milhão. E existem pessoas que pagam a ele para ouvirem a sua estratégia. Como disse, difícil é fazer o primeiro milhão, a partir dai é sou uma boa gestão.Isso quase parece aqueles esquemas de ganhar dinheiro vendido livro de estratégia de ganhar dinheiro. E depois o livro é a dizer para vender ele também. Que treta...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "February 20, 2023, 03:10:07 PM",
      "body": "Quote from: Disruptivas on February 17, 2023, 12:58:57 PMAcho que no caso dele - que é um super influencer brasileiro de finanças- ele realmente conseguiu mais de um milhão fazendo palestra sim. Mas isso é uma super controversia. E o que achei mais estranho é que o cara que estava ouvindo, achou isso INCRÍVEL. Eu achei muito tosco. Porque na prática, ele estava dizendo: não é o que eu falo sobre investimento, mas POR falar que eu ganho dinheiro e consigo subir de patar. Acho que é o caso de vários.  As palestras e livros dele tem mais foco em uma auto ajuda e crescimento pessoal do que um conhecimento técnico de finanças pessoais de fato.Ele ganhou 1 milhão dr palestras pq muitos querem ouvi lo",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "February 20, 2023, 08:27:41 PM",
      "body": "Parece que esse autor \"fabuloso\" anda meio por baixo nos últimos tempos: Palestra com autor de 'Pai Rico, Pai Pobre' tem ofensa a plateia e vaias",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "February 21, 2023, 10:06:51 PM",
      "body": "Quote from: Paredao on February 20, 2023, 08:27:41 PMParece que esse autor \"fabuloso\" anda meio por baixo nos últimos tempos: Palestra com autor de 'Pai Rico, Pai Pobre' tem ofensa a plateia e vaiasBoa. Isso aí. As pessoas estão ficando mais antenadas em investimentos e finanças pessoais (provavelmente com a facilidade que a internet trouxe) e não mais se contentam com um cara famoso repetindo o básico e cobrando mais de 2 mil reais por pessoa.QuoteO evento, realizado em São Paulo no último final de semana, reuniu cerca de 5.000 participantes que pagaram até R$ 2.647 pelo ingresso, segundo a organização.  Para muitos dos presentes, em vez de poder e sucesso, o congresso despertou a ira. O motivo do descontentamento, segundo relatos de diversos participantes, foi Kiyosaki. Em resumo, dizem os insatisfeitos, o autor repetiu exaustivamente a mesma ideia nas palestras de sábado (23) e domingo (24). E atrelava a divulgação de mais informações --além do conceito do \"quadrante do fluxo de caixa\", apresentado em seu livro-- a outro curso nesta terça-feira (26), com custo de R$ 6.997. ... - Veja mais em https://economia.uol.com.br/noticias/redacao/2017/09/26/palestra-com-autor-de-pai-rico-pai-pobre-tem-ofensa-a-plateia-e-vaias.htm?cmpid=copiaecolaOu seja, ele ficava horas repetindo a mesma coisa por 2600 reais, e depois pedia mais 7 mil reais pra continuar. Tem que ser vaiado mesmo!Como eu disse em cima, Kiyosaki é um autor que ensina o básico para leigos. É fraco tecnicamente, e o público alvo não são investidores. São pessoas que estão precisando dum incentivo para se convencerem a investir algum dinheiro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "February 22, 2023, 07:50:22 AM",
      "body": "Quote from: bitmover on February 21, 2023, 10:06:51 PMOu seja, ele ficava horas repetindo a mesma coisa por 2600 reais, e depois pedia mais 7 mil reais pra continuar. Tem que ser vaiado mesmo!Como eu disse em cima, Kiyosaki é um autor que ensina o básico para leigos. É fraco tecnicamente, e o público alvo não são investidores. São pessoas que estão precisando dum incentivo para se convencerem a investir algum dinheiro.Não estando aqui a defender o cara, porque eu não sou fã desse tipo de palestras...Mas, isso também não é assim tão culpa dele. As pessoas é que criaram espectativas que nunca foram ditas que se iam cumprir.Quando vamos a um concerto, o musico vai repetir as musicas que nós ouvimos no Spotify não estamos a espera de ouvir algo novo.Aqui é a mesma coisa, quem foi nos dias anteriores, porque é que foi no dia seguinte?Ele estava explicar o seu livro em palavras, quem não quer ler, ou ainda tem duvidas sobre o livro é que deve de ir.O livro já tem uns bons anos. Ele já escreveu mais algum? Se não, é porque ele só sabe aquilo que escreveu no seu livro. É isso que as pessoas tem de esperar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "February 22, 2023, 09:54:46 AM",
      "body": "Quote from: joker_josue on February 22, 2023, 07:50:22 AMAqui é a mesma coisa, quem foi nos dias anteriores, porque é que foi no dia seguinte?Bem, eu nunca iria num evento desse tipoContudo, se eu pagasse 2600 reais (500 euros) para ir num evento de dois dias, eu iria em tudo q eu paguei. Se o cara se dispôs a dar duas palestras no mesmo evento  , eu iria preferir q elas fossem diferentes,  até pelo valor pago.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BrunoCastro",
      "created_time": "February 22, 2023, 01:06:08 PMLast edit: February 24, 2023, 10:35:06 AM by BrunoCastro",
      "body": "Parece ter encontrado o livro como um recurso útil, particularmente para indivíduos que são novos na alfabetização financeira. Embora as previsões do autor sobre uma recessão iminente possam ser encaradas com cepticismo devido aos seus antecedentes, ainda é crucial estar consciente dos potenciais riscos económicos e tomar precauções para se preparar para eles.Relativamente ao tema Spy App para iPhone, vale a pena notar que embora estas aplicações afirmem fornecer uma monitorização abrangente das actividades do iPhone, a sua utilização sem o conhecimento ou consentimento do indivíduo que está a ser monitorizado levanta preocupações éticas significativas. Estas aplicações que analisámos em https://pt.celltrackingapps.com/app-espiao-ios/ podem ser vistas como uma intrusão da privacidade e potencialmente prejudiciais se utilizadas para fins nefastos, tais como a perseguição ou o assédio. Como tal, é crucial considerar os potenciais benefícios e danos da utilização de uma aplicação de espionagem para o iPhone e pesá-los cuidadosamente antes de tomar uma decisão.Além disso, é interessante saber que o autor do livro é um proponente do Bitcoin, que se tornou cada vez mais relevante no mundo das finanças. Como em qualquer investimento, é essencial conduzir uma investigação aprofundada e compreender os potenciais riscos e recompensas antes de investir em Bitcoin ou em qualquer outra moeda criptográfica. Apesar de algumas reservas sobre as previsões do autor, parece ter considerado o livro como um valioso recurso em geral.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l3pox",
      "created_time": "February 22, 2023, 03:49:29 PM",
      "body": "Bom. 2.5 milhoes de brl em 2025 me parece um chute muito altoVeremosAcho que pode chegar nisso sim mas não no próximo ciclo e sim no de 2029Apesar dos livros do Kyosaki serem bem básicos acho os palpites dele bons, em geralVamos verSempre fico pensando o que acontecerá quando as nações perderem a confiança nas moedas fiat",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "February 22, 2023, 08:08:26 PM",
      "body": "Quote from: bitmover on February 22, 2023, 09:54:46 AMBem, eu nunca iria num evento desse tipoSomos dois.Pagar para ouvir malta a dizer como ficou rico, não obrigado. Apenas se for com o objetivo de conhecer melhor o cara, a sua historia de vida, e afins. Não como um modelo a seguir.Até porque as historias de vida nunca são iguais, e mesmo que possamos retirar algumas coisas para a nossa vida, o modelo seguido por essa pessoa dificilmente se conseguira aplicar na dos outros, na maioria dos casos.Por exemplo, se o cara começa a palestra a dizer que durante a sua adolescência guardou todas as mesadas que recebia dos país e quando vez 18 anos aplicou em certificados, o seu modelo já não funciona para mim, tenho quase 40.   Ainda pode dar para tirar umas ideias e aplicar, mas o modelo do cara só vai dar para os meus filhos - se os tiver e os levar a palestra do cara quando fizerem 10 anos...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "February 24, 2023, 01:28:18 PM",
      "body": "Uma notícia interessante que apareceu no meu celular, quantos BTC o Robert Kiyosaki tem?60 Bitcoins, comprados por 6.000 dólares cada, em 2019Fonte: https://livecoins.com.br/robert-kiyosaki-revela-quantos-bitcoins-comprou/Na época pagou 360 mil dólares, hoje vale 1.428,00, nada mal",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "February 24, 2023, 06:56:11 PM",
      "body": "Quote from: rdluffy on February 24, 2023, 01:28:18 PMNa época pagou 360 mil dólares, hoje vale 1.428,00, nada mal  kkkk o cara ganhou uma grana com bitcoin, agora virou defensor.Já que o negócio é sempre estar antenado em investimentos alternativos (mas realmente alternativos,que não sejam muito mainstream) para ganhar dinheiroO bitcoin tem esse plus que é realmente uma proteçao, assim como os metais preciosos.Quote“Então, a razão pela qual as pessoas compram bitcoin é a mesma razão pela qual eu compro isso (moeda de ouro) e compro isso (moeda de prata) porque não confio nisso (dinheiro fiduciário)”, disse ele, segurando as referidas moedas e uma nota de 1 dólar.Eu sigo de olho no uranio, so esperando cair mais um pouquinho pra entrar",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "February 24, 2023, 09:06:27 PM",
      "body": "Quote from: bitmover on February 24, 2023, 06:56:11 PMkkkk o cara ganhou uma grana com bitcoin, agora virou defensor.Já que o negócio é sempre estar antenado em investimentos alternativos (mas realmente alternativos,que não sejam muito mainstream) para ganhar dinheiroO bitcoin tem esse plus que é realmente uma proteçao, assim como os metais preciosos.Eu sigo de olho no uranio, so esperando cair mais um pouquinho pra entrarNessa ele mandou super bem, mesmo entrando relativamente tarde, em 2019, mas foi num preço de dar inveja hoje, 6000 dólares, e ter coragem de comprar 360mil dólares naquela épocaPonto pra ele, ele poderia focar nos investimentos em Bitcoin e esquecer um pouco essas previsões loucas aíEu penso que se houver mesmo um colapso econômico, pode ser difícil prever que Ouro, prata e BTC sejam garantias, já que os governos podem entrar numa loucura e fazer muita mer... Espero que não cheguemos a esse pontoVocê tinha comentado sobre mercados alternativos, como exemplo o urânio, quanto você está esperando chegar pra entrar?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "February 25, 2023, 01:52:25 AM",
      "body": "Quote from: bitmover on February 21, 2023, 10:06:51 PMComo eu disse em cima, Kiyosaki é um autor que ensina o básico para leigos. É fraco tecnicamente, e o público alvo não são investidores. São pessoas que estão precisando dum incentivo para se convencerem a investir algum dinheiro.Ôxe, mais de 2k para uma palestra motivacional é pedir mesmo para ser vaiado.Eu, como praticamente todos aqui (creio eu) li o livro e achei fanástico.Como você bem falou, é voltado para quem está começando a investir, e foi nessa época de aprendizagem que eu comprei esse livro de um sebo... queria baixar na internet, mas como eu queria começar a fazer as coisas certas, pensei que esse seria um bom investimento, não me arrependi.Entretanto... cobrar mais 7k na sequência para revelar os detalhes é muito pior do que a tática da Empiricus que te faz ler uma bíblia em uma página só mais 2horas de vídeo para só então chegar no final e dizer que você precisa pagar para ter o \"segredo revelado\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "February 25, 2023, 12:16:01 PM",
      "body": "Quote from: bitmover on February 24, 2023, 06:56:11 PMkkkk o cara ganhou uma grana com bitcoin, agora virou defensor.Bem, ele já devia ser defensor antes.Investir 360k em Bitcoin, não é para um cético. Já tem de acreditar no projeto.Quote from: bitmover on February 24, 2023, 06:56:11 PMQuote“Então, a razão pela qual as pessoas compram bitcoin é a mesma razão pela qual eu compro isso (moeda de ouro) e compro isso (moeda de prata) porque não confio nisso (dinheiro fiduciário)”, disse ele, segurando as referidas moedas e uma nota de 1 dólar.Eu não sou assim tanto a favor dessa afirmação por um motivo: para comprar ouro/prata/bitcoin ou outro ativo qualquer, tivemos de usar fiat. E por isso o fiat acaba por ser a catapulta para investimentos maiores e melhores. Acho que não é adequado desvalorizar tanto ele.Agora, poderei concordar que o fiat não é tão viável como aparenta ser.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}