{
  "id": "topic_5440688",
  "title": "Accardo",
  "author": "Accardo",
  "created_time": "February 21, 2023, 12:59:29 PM",
  "content": "Last Year they was a 46% decline in cryptocurrency scam revenue in 2022 and it may interest us to know that it was not caused only by the plunging market price. Scam tracker software contributed to a vast, enormous plunge in cryptocurrency scams. Last week the California Department of financial protection and innovation launched a scam tracker that permits California Citizens to escape cryptocurrency scams. Though it doesn't solve all the problems, yet through software innovation, people can fast learn the con of a cryptocurrency scam. How it worksI enjoyed reading the complaints on the website and the idea behind the engineering of the site, it exposes, tricks, concepts and sites used by scammers to lure victims. It allows victims to report a specific scam site that looks fishy or have been used to successfully scam a victim. Such scams includes; pig butcher scams, romance scams, impersonation scams, etc. In my opinion, if citizens spend time reading the information garnered on the DFPI website, they would have no problem. They would easily detect or figure out if a site is legitimate. Scammers have got a similar strategy; tell a victim to deposit funds, then disable the person from withdrawing their money. Some would allow the victim to trade on their site, let them quickly take out some profits to trigger them to deposit huge amounts of money then boom, everything is gone. A major part of their victims get targeted from dating apps; pig butcher scams. DisadvantageI noticed one disadvantage of these scam tracker software, especially the DFPI software. Victims must have fallen prey to their predators before others get alerted about the scam on the scam tracker site. It can only reduce the scam activity and adds time to the existence of cryptocurrency scams, as the scammers would not hesitate to launch a new website to continue their bad attitude. AdvantageThe only advantage scam tracking software possess is, terminating subsequent scams on a website. After the site successfully scams a victim, it'll definitely get reported, which would alert other users not to negotiate with any person, persons, or organizations that share with them the same site. And it also triggers people to stay careful and confirm a site before sending funds to them or even creating accounts. In a nutshell, if this huge money was deposited by scam victims into cryptocurrency the market would have been going bullish. Victims invest about 200k, 50k, and 300k dollars to these scammers and it'll go into thin air. It's actually killing the market. https://dfpi.ca.gov/crypto-scams/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440688",
  "comments": [
    {
      "author": "Darker45",
      "created_time": "February 22, 2023, 12:53:05 AM",
      "body": "How popular is this scam tracker from California that the enormous decline in cryptocurrency scam revenue in 2022 is significantly attributed to it? I'm actually doubting its contribution. If we look back in the year 2022, the largest failures include Terra, Three Arrows Capital, FTX, Alameda, Voyager, Celsius, BlockFi and others. I'm sure not one of these companies or projects or platforms made it to the list. I only saw one that is impersonating FTX, but if somebody would have taken a closer look at FTX itself, it could have also been considered a scam with all its red flags. The same is true with the rest of them. Of course, these companies may not look like outright scams, but these are also the same companies which investors would easily fall to and lose their money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "February 22, 2023, 04:56:04 AM",
      "body": "Quote from: Accardo on February 21, 2023, 12:59:29 PMI noticed one disadvantage of these scam tracker software, especially the DFPI software. Victims must have fallen prey to their predators before others get alerted about the scam on the scam tracker site. It can only reduce the scam activity and adds time to the existence of cryptocurrency scams, as the scammers would not hesitate to launch a new website to continue their bad attitude. You pretty much nailed it. By the time someone that's financially savvy enough to see that it's a scam — chances are, there already are victims. But I guess this is better than nothing so there's that.Still, education is still the most effective way of combating scams in my opinion. Most people simply just don't want to take the time and effort into reading about these stuff.https://cryptosec.info/scams",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "February 22, 2023, 06:37:58 AM",
      "body": "The decline in crypto scam revenue in 2022 doesn't have anything to do with the launch of this scam tracker, even the news you shared about the decline in crypto scam revenue in 2022 attributed it to the condition of the market, and not this scam tracker:QuoteWe attribute most of this decline to market conditions, as scam performance tends to worsen when cryptocurrency prices are in decline.I don't know how many people would be checking the DFPI scam tracker site before they communicate with any website, company, etc, i don't think many people would be doing that, or if they are even aware of it. The scam tracker helps a little bit, you can see if and how others have been scammed on the site or platform you want to use, but it is very inadequate to help save a lot of people from scams as there are many companies that would never get on the list. Nobody should depend on this, but try to learn by themselves how scammers operate. And as for the decline in crypto scam revenue, i think it is because of all the recent events of huge crypto losses, maybe people are now smarter and protect their funds better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "February 24, 2023, 09:52:16 PM",
      "body": "Quote from: Darker45 on February 22, 2023, 12:53:05 AMHow popular is this scam tracker from California that the enormous decline in cryptocurrency scam revenue in 2022 is significantly attributed to it? I'm actually doubting its contribution. If we look back in the year 2022, the largest failures include Terra, Three Arrows Capital, FTX, Alameda, Voyager, Celsius, BlockFi and others. I'm sure not one of these companies or projects or platforms made it to the list. I only saw one that is impersonating FTX, but if somebody would have taken a closer look at FTX itself, it could have also been considered a scam with all its red flags. The same is true with the rest of them. Of course, these companies may not look like outright scams, but these are also the same companies which investors would easily fall to and lose their money. I don't know if you understood what I wrote, I didn't mean the california scam tracker alone, other trackers like scam busters etc helped to reduce scam by providing results to users regarding if a company is genuine. Hence, its well know that the market condition kept the number of successful scam low in the industry, but such tools like the California scam tracker would help its citizen in many possible ways to stay clear from scam activities. However, it's better than nothing or making any decision to help victims out of a scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "February 25, 2023, 02:31:51 AM",
      "body": "Of course, tracking scammers will not prevent fraud completely, but it can play a major role in reducing fraud by spreading the methods of fraudsters and fraud sites.Spreading knowledge about fraudsters' methods is the best way to prevent such cases from occurring in the future, but this does not mean that fraud will not occur in the future because fraudsters are constantly changing their methods and they are creating new websites with ease.In my opinion, it is impossible to find a way to prevent fraud 100%, so the only solution is to acquire more knowledge and cumulative experience that gives a person the ability to discover most fraudsters and fraud methods and not fall victim to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "February 25, 2023, 02:56:56 PM",
      "body": "QuoteAfter the site successfully scams a victim, it'll definitely get reported, which would alert other users not to negotiate with any person, persons, or organizations that share with them the same site. Do you need to burn with fire to know that fire is harmful to you? You do not need to be scammed to know that this site is scam.Such sites may have a defect, which is that they give a false sense of security, and they can be developed to be integrated into the MetaMask wallet or as an add to Chrome with some tips.I hope they have enough resources to update the list every hour",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "February 28, 2023, 07:03:40 AM",
      "body": "I was wondering, what if somebody used ML to inspect the content and design of webpages, to classify between a cryptocurrency site and a non-crypto site, and then assign a tag for each identified site so that it can be detected again if it relaunches but under a different domain name?It will put an end to \"stock HYIP scripts\" but the more unique-looking scams would still get away.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "February 28, 2023, 10:23:55 AM",
      "body": "Quote from: NotATether on February 28, 2023, 07:03:40 AMIt will put an end to \"stock HYIP scripts\" but the more unique-looking scams would still get away.If done unannounced it'll stay for a while before the scammers would realize why their site is getting redflags even before a first, successful scam. But, once it's discovered, they can easily change the contents or change the script. These trackers need to work strides ahead to beat scammers using different strategies. Most of these scammers pay for domain registrars to lock their whois information, though good or corporate companies do that for reasons why such feature is made available. So, since the fraudulent sites owners take advantage of the feature, for awareness purposes, these tracking sites should always inform users about non established sites with no whois information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}