{
  "id": "topic_5476908",
  "title": "Dimitris",
  "author": "Dimitris",
  "created_time": "December 07, 2023, 01:02:31 PMLast edit: December 07, 2023, 01:27:43 PM by Dimitris",
  "content": "Λεπτομέρειες και RSVP: https://www.meetup.com/blockchaingreece-0/events/297790417/Στην επόμενη συνάντησή μας στην Αθήνα στις 18 Δεκ φιλοξενούμε ένα πάνελ νομικών και φοροτεχνικών που θα απαντήσουν στις φορολογικές και άλλες ερωτήσεις σας! Μετά θα συνεχίσουμε στην καθιερωμένη συζήτηση και networking με συνοδεία πίτσας και μπύρας. Η συνάντηση θα γίνει στο φιλόξενο Ελληνικό Μουσείο Πληροφορικής.Οι ομιλητές είναι:- Ο Βαγγέλης Αηδόνης είναι δικηγόρος που ασχολείται με το φορολογικό και αστικό δίκαιο και είναι Senior Manager στην KBVL Law Firm, μέλος της Deloitte Legal. Ο Βαγγέλης είναι ο πρώτος που αρθρογράφησε για στην απόφαση ΔΕΔ 417 η οποία είναι και η αφορμή για τη συνάντησή μας.- Οι Athens Legal Firm είναι μια μπουτίκ δικηγορική εταιρία, τα μέλη της οποίας εξειδικεύονται σε όλο το φάσμα με οπτική από νομική, οικονομική και πρακτική άποψη προτείνουν πρακτικές λύσεις σε ζητήματα αγοραπωλησιών με Bitcoin.- Ο Κωνσταντίνος Νανόπουλος είναι φοροτεχνικός, σύμβουλος επιχειρήσεων και ιδιοκτήτης της Taxexperts.gr και διαχειριστής του αδειοδοτημένου από την Ελληνική Επιτροπή Κεφαλαιαγοράς ανταλλακτηρίου vfahub.com. Ο Κωνσταντίνος μίλησε για πρώτη φορά στο meetup μας το 2017.- Ο Παναγιώτης Κουτάς είναι λογιστής και ιδιοκτήτης του λογιστικού γραφείου ACTN.gr. Ο Πάνος είναι μέλος της κοινότητας των κρυπτονομισμάτων εδώ και πολλά χρόνια.Ενδεικτικά θέματα συζήτησης:- Απόφαση ΔΕΔ 417/Ενδικοφανείς Προσφυγές/Θεσσαλονίκη/2023 για φορολογούμενο και πώς πρέπει να δηλώνουν στο εξής τα κέρδη από κρυπτονομίσματα οι φορολογούμενοι;- Απόφαση ΔΕΔ 1699e/Ενδικοφανείς Προσφυγές/Αθήνα/2023 για επιχείρηση-ανταλλακτήριο- Πως μπορούν να δέχονται οι επιχειρήσεις και οι επαγγελματίες πληρωμές με κρυπτονομίσματα με νόμιμο τρόπο και πως θα φορολογηθούν για αυτό;- Πως μπορούν να φορολογηθούν miners και stakers που μπορεί να μην έχουν αντισυμβαλλόμενο πρόσωπο για να δείξουν την πηγή εισοδήματος; Καθώς και αυτοί που έχουν αγοράσει και πουλήσει κρυπτονομίσματα από/σε DEX (Decentralized Exchanges)- Φορολογούνται οι μετατροπές κρύπτο-προς-κρύπτο, όπως π.χ. στην Αμερική;- Φορολογικοί Κάτοικοι Εξωτερικού και επαναπατρισθέντες (δικαιούνται να φέρουν λεφτά στην Ελλάδα χωρίς να τα δικαιολογούν)- Στο Περιουσιολόγιο (Πόθεν Έσχες) που θα επεκταθεί σε όλους τα επόμενα χρόνια πρέπει να δηλώνουμε κρυπτονομίσματα;- Κληρονομιά κρυπτονομισμάτων και Διαθήκες- Μπορεί μια αγοραπωλησία ακινήτου να γίνει με κρυπτονομίσματα στην Ελλάδα;- Ζημίες από αγοραπωλησίες κρυπτονομισμάτων μπορούν να δηλωθούν στην εφορία από 1) φυσικά πρόσωπα και 2) νομικά πρόσωπα;- Θα περιμέναμε να συμβούν εικονικές συναλλαγές NFTs, ώστε 1) με εικονικά κέρδη κάποιον να ξεπλένει εισοδήματα ή 2) με εικονικές ζημίες να μειώσει τη φορολογία του;- MICA (η οποία δεν επηρεάζει τους χρήστες/φορολογούμενους αλλά τα ανταλλακτήρια και τους εκδότες νομισμάτων)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476908",
  "comments": [
    {
      "author": "Dimitris",
      "created_time": "January 24, 2024, 11:55:45 AM",
      "body": "Τη Δευτέρα 5 Φεβρουαρίου το επαναλαμβάνουμε online στο Zoom για όσους δεν μπορούσαν να βρεθούν στη συνάντηση της Αθήνας: https://www.meetup.com/blockchaingreece-0/events/298751840/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dimitris",
      "created_time": "January 31, 2024, 11:44:41 AM",
      "body": "Bitcoin social meetup αύριο Πέμπτη στην Αθήνα: https://www.meetup.com/hellenicbitcoin/events/298403042/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}