{
  "id": "topic_5411613",
  "title": "citb0in",
  "author": "citb0in",
  "created_time": "August 29, 2022, 03:22:01 PM",
  "content": "Hello friends of coins,is there a technical possibility to be alerted by email or SMS as soon as a freely definable address receives or has sent a payment, i.e. when the balance has virtually changed? Do any of you know such a free service on the net? Or maybe the technical implementation of it so one could fulfull this task maybe by running his own full-node and block explorer?thanks in advance.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411613",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "August 29, 2022, 03:58:08 PM",
      "body": "Quote from: citb0in on August 29, 2022, 03:22:01 PMis there a technical possibility to be alerted by email or SMS as soon as a freely definable address receives or has sent a payment, Yes it's possible. Most web wallets do this by default, but they are not advisable to use for storage.This would be a bit more difficult to do on a non custodian wallet like electrum. Quote from: citb0in on August 29, 2022, 03:22:01 PMDo any of you know such a free service on the net? Or maybe the technical implementation of it so one could fulfull this task maybe by running his own full-node and block explorer?There are some scripts for this around the forum, but I would not recommend any, as I've not used them and you will need to be security conscious.To get real time alerts for transactions electrum would need to be active 24/7.You can of course try to create a plug in yourself by connecting to a block explorer and linking an address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "citb0in",
      "created_time": "August 29, 2022, 04:01:21 PM",
      "body": "I don't think Electrum is the best way for this but still curious and thankful for more suggestions. Maybe pycoin library is capable of doing this while using a full-node and own blockexplorer? Does it happen to be existing scripts on Github to accomplish this? any hint really appreciated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "August 29, 2022, 04:10:07 PM",
      "body": "I think this is what you are looking for- https://cryptocurrencyalerting.com/wallet-watch.htmlThough I don't know what's the requirement to get notification but this site will provide you notification through your email when balance of an address gets changed/increase/decrease. You can set up that. They also allow monitoring for Ethereum. Apart from that, you can build your own script to monitor any address.Just to alert you- if you are thinking of monitoring your own address, this site may store ip logs etc and can get sone of your data which may leak your privacy. Be sure to use TOR if that's an issue.Edit- I just checked the site. They allow you to check if balance increase/decrease, I think any one of these. But getting notification for balance changes, you have to go premium. Anyway, there are other option too. You can google and get the best monitoring site for free.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "citb0in",
      "created_time": "August 29, 2022, 04:15:49 PM",
      "body": "This sounds promising. Now I would really like to know if there's something like that available on GIThub so I could run it locally on my side. This way I have a better privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "August 29, 2022, 04:27:27 PM",
      "body": "Quote from: citb0in on August 29, 2022, 04:15:49 PMThis sounds promising. Now I would really like to know if there's something like that available on GIThub so I could run it locally on my side. This way I have a better privacy.I'm not an expert when it comes to write some code and get it done through myself lol. But I can assure you that yes, you can. There's something called \"walletnotify\" which you can use for this purpose if I'm correct. I have seen that quite a long time ago and have never tried. Through this, you can monitor and get update on your email on each tx on a predetermined address. This can be a basic guideline for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "citb0in",
      "created_time": "August 29, 2022, 04:35:01 PM",
      "body": "I am running Linux only and not interested in Windows applications, however thanks for the link you provided. The walletnotify hint was helpful. I think I will stick with that.Thank you so much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "August 29, 2022, 04:48:48 PM",
      "body": "Quote from: citb0in on August 29, 2022, 04:35:01 PMThe walletnotify hint was helpful. I think I will stick with that.I've had some setup to get notified by email in the past. I've been using blockchain.com and the interesting part is that I've added an address there (i.e. watch only). There were clearly privacy issues, but no safety concerns since blockchain.com didn't know private key or seed. It was years ago and I don't know if it still works like that.It may be off topic, but I'll add another possibility: if push notification on your smartphone are also OK instead of e-mail, blue wallet does the job, and again, you can just add an address (watch only, safe) there. Of course, same privacy concern applies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}