{
  "id": "topic_5524134",
  "title": "Oshio-man",
  "author": "Oshio-man",
  "created_time": "December 25, 2024, 01:21:09 PM",
  "content": "Greetings my beloved Bitcointalk users, Merry Christmas to you all, I know many people have been busy enjoying themselves in this festive season celebration and holiday, I brought this topic to know what people have experienced from this bull season that reign in this month of November and December to hit $100k, I was not able to hold bitcoin this year because I was still learning on how to acquire the knowledge of bitcoin and how to hold bitcoins for long term before I can start investing in bitcoin, which I just achieved the knowledge few weeks ago waiting for funds to enter my hand before I can buy bitcoins. I notice that some people sold their bitcoins when the price was $70k, some sold when the price was $80k, some people sold when the price was $90k while some people sold when the price was $100k and above, and those that couldn't endure till $100k and above where not happy when they saw the price increased above $100k, despite they made income from the rate they use to sell their bitcoins, with what I have experienced from bitcoins bull season, i will never be in a hurry to sell my bitcoins, and I will be patient with my holding in the bull season, those are the major lesson I learned from this $100k that happened.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5524134",
  "comments": [
    {
      "author": "lovesmayfamilis",
      "created_time": "December 25, 2024, 02:32:55 PM",
      "body": "Quote from: Oshio-man on December 25, 2024, 01:21:09 PM i will never be in a hurry to sell my bitcoins, and I will be patient with my holding in the bull season, those are the major lesson I learned from this $100k that happened.You are lucky that you started to study Bitcoin carefully, studying all its pros and cons, and saw the price movement, and the growth of Bitcoin, which many have been waiting for for several years. Now, having gone through many stages of training, you probably have set for yourself the time and the cost of Bitcoin, after which you will cash out your investments. I was not so persistent and spent some as needed, but I respect people who, albeit slowly, but persistently go to their goal. Saying the word \"never\" is too self-confident, but this Christmas, I sincerely wish you the fulfillment of your dream of having strong hands and good patience on your investment path.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "December 25, 2024, 03:05:08 PM",
      "body": "I learned that Bitcoin fees is no longer expensive even Bitcoin has achieving new ATH, so we don't have to complain about scalability issue since it's still fine. I thought the fees would reach 50 sat/vbyte at the lowest when Bitcoin price hit $100K, but now the fees is only 3 sat/vbyte, completely low than what I expect.Although it's due to off chain transactions, but I think majority of people are happy to see that instead of seeing Bitcoin fees rose really high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EL MOHA",
      "created_time": "December 25, 2024, 04:13:02 PM",
      "body": "Quote from: Oshio-man on December 25, 2024, 01:21:09 PM I notice that some people sold their bitcoins when the price was $70k, some sold when the price was $80k, some people sold when the price was $90k while some people sold when the price was $100k and above, and those that couldn't endure till $100k and above where not happy when they saw the price increased above $100k, despite they made income from the rate they use to sell their bitcoins, with what I have experienced from bitcoins bull season, i will never be in a hurry to sell my bitcoins, and I will be patient with my holding in the bull season, those are the major lesson I learned from this $100k that happened.So categorically you don’t have bitcoin yet, it is not bad the knowledge gotten before actually buying it is very important now it’s time to put the knowledge into use. As for selling of bitcoin there is nothing actually bad about that because every one has their take profit price target or time frame. People you see selling at $80k and $90k would even be in much higher profits than some selling at $100k or above. Everyone has its own target to take profit and to me sticking to it is the best way to go. We all can’t have one target so we definitely need some to sell so that we can even buy. My advice to you is when investing set a profit target too so you don’t just sell any price Quote from: Plaguedeath on December 25, 2024, 03:05:08 PMI learned that Bitcoin fees is no longer expensive even Bitcoin has achieving new ATH, so we don't have to complain about scalability issue since it's still fine. I thought the fees would reach 50 sat/vbyte at the lowest when Bitcoin price hit $100K, but now the fees is only 3 sat/vbyte, completely low than what I expect.Although it's due to off chain transactions, but I think majority of people are happy to see that instead of seeing Bitcoin fees rose really high.The scalability issue of Bitcoin network this days is mostly not a problem caused by bitcoin it self technically but by the other projects on bitcoin network like inscriptions and Runes which are used to span the network most of the time causing the congestion but since their hype die down there wasn’t a thing of such again. This means even without them the bitcoin network can manage large adoption rate. More so this period has shown that the fees doesn’t go up with the price",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ale88",
      "created_time": "December 25, 2024, 05:43:26 PM",
      "body": "Quote from: Oshio-man on December 25, 2024, 01:21:09 PMwith what I have experienced from bitcoins bull season, i will never be in a hurry to sell my bitcoins, and I will be patient with my holding in the bull season, those are the major lesson I learned from this $100k that happened.I don't think selling bitcoin is about \"being in a hurry\" rather than a question like \"do I actually need to sell my bitcoins? Do I need this money? Am I actually happy with the amount of dollars I would get from the sale?\". Every situation is different, some people just want some quick profit while others don't want to sell but they need to out of necessity. Just try to have your plan ready.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "criptoevangelista",
      "created_time": "December 25, 2024, 05:50:57 PM",
      "body": "Quote from: lovesmayfamilis on December 25, 2024, 02:32:55 PMQuote from: Oshio-man on December 25, 2024, 01:21:09 PM i will never be in a hurry to sell my bitcoins, and I will be patient with my holding in the bull season, those are the major lesson I learned from this $100k that happened.You are lucky that you started to study Bitcoin carefully, studying all its pros and cons, and saw the price movement, and the growth of Bitcoin, which many have been waiting for for several years. Now, having gone through many stages of training, you probably have set for yourself the time and the cost of Bitcoin, after which you will cash out your investments. I was not so persistent and spent some as needed, but I respect people who, albeit slowly, but persistently go to their goal. Saying the word \"never\" is too self-confident, but this Christmas, I sincerely wish you the fulfillment of your dream of having strong hands and good patience on your investment path. I still have a theory in my mind that it's always good (once in a while in a bull run) to treat yourself to something, even if it's not that expensive... to always remember the powerful phenomenon surrounding bitcoin hodlers: products costing less and less money... this helps to restore faith and when you have something, it always reminds you of difficult times in the past when bitcoin didn't exist in our lives...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z_MBFM",
      "created_time": "December 25, 2024, 06:23:13 PM",
      "body": "Quote from: Oshio-man on December 25, 2024, 01:21:09 PMGreetings my beloved Bitcointalk users, Merry Christmas to you all, I know many people have been busy enjoying themselves in this festive season celebration and holiday, I brought this topic to know what people have experienced from this bull season that reign in this month of November and December to hit $100k, I was not able to hold bitcoin this year because I was still learning on how to acquire the knowledge of bitcoin and how to hold bitcoins for long term before I can start investing in bitcoin, which I just achieved the knowledge few weeks ago waiting for funds to enter my hand before I can buy bitcoins. I notice that some people sold their bitcoins when the price was $70k, some sold when the price was $80k, some people sold when the price was $90k while some people sold when the price was $100k and above, and those that couldn't endure till $100k and above where not happy when they saw the price increased above $100k, despite they made income from the rate they use to sell their bitcoins, with what I have experienced from bitcoins bull season, i will never be in a hurry to sell my bitcoins, and I will be patient with my holding in the bull season, those are the major lesson I learned from this $100k that happened.Go through the previous history of Bitcoin and analyze it by how much percent the price of Bitcoin went down from the ATH before and how much percent the price went up again to create a new ATH then you can estimate how much the price of Bitcoin can reach in any halving season. Analyzing like this can give you some idea and then you will understand at what price you should sell and at what price you should buy.  By understanding bull & bear formation you can profit in all trading and holding. But you must beware of greed and panicI am not in big profit because my investment is not big.  But I'm still holding bitcoins from my weekly signature payment",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "December 25, 2024, 07:09:31 PM",
      "body": "It's nice to see another person adopting Bitcoin but you need to be very careful as a newbie. And if I should advise you, buying the coin at the peak is not advisable, you may learn from those who bought it for around $60,000 in 2021, they were so bittered for over 2 years before Bitcoin went up again. This is not to scare you but to let you make an informed investment about whether you can HODL longer or not. If you can't, then buying the peak is not smart. Again, I love people divesting around the peak and buying Bitcoin when it's cheap at another bullish cycle's beginning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "December 25, 2024, 07:23:32 PM",
      "body": "Quote from: Oshio-man on December 25, 2024, 01:21:09 PMGreetings my beloved Bitcointalk users, Merry Christmas to you all, I know many people have been busy enjoying themselves in this festive season celebration and holiday, I brought this topic to know what people have experienced from this bull season that reign in this month of November and December to hit $100k, I was not able to hold bitcoin this year because I was still learning on how to acquire the knowledge of bitcoin and how to hold bitcoins for long term before I can start investing in bitcoin, which I just achieved the knowledge few weeks ago waiting for funds to enter my hand before I can buy bitcoins. I notice that some people sold their bitcoins when the price was $70k, some sold when the price was $80k, some people sold when the price was $90k while some people sold when the price was $100k and above, and those that couldn't endure till $100k and above where not happy when they saw the price increased above $100k, despite they made income from the rate they use to sell their bitcoins, with what I have experienced from bitcoins bull season, i will never be in a hurry to sell my bitcoins, and I will be patient with my holding in the bull season, those are the major lesson I learned from this $100k that happened.Bitcoin investment has categories and classes and these classes originate from the individuals that are involved because one bitcoin can be for long-term goals why while another investor, only has short-term plans for their bitcoin so it all depends on the individual and what their plans are for the investment, it's not a bad thing to cash out your bitcoin at whatever price you think fit your desires and your needs at that time.What is bad is that selling your bitcoin below the price you bought it is what we advise against all the time, because bitcoin has more advantage when you hold it, and don't take traders such as derivative traders bitcoin position as an investment, when we say bitcoin investment what we mean is the bitcoin you holding in your private wallet that can not get liquidated at any time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jegileman",
      "created_time": "December 25, 2024, 07:52:26 PM",
      "body": "Those that sold below $100K still baffles me because the bull run was not even at its peak yet and many thought of the US Presidential elections to be the cause of it. Those that sold at $100K is still fair to me because it was a milestone that have been talked about for long and everyone has been anticipating for the market to reach their one of this days. Overall, you don’t need to blame most of them for selling at a very lower price, some already set target and due to their discipline, they exit the market when it gets to that price. Some do not have a very strong psychology to be able to hold on for the market, so when they see little profits from their investments, they’re been bothered to take profit and exit the investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "December 25, 2024, 08:10:46 PM",
      "body": "In my case it's been pretty much the same boring thing. I've been holding for close to 10 years and I expected a post halving bull run. I did what I keep on doing every time - spending a very small % of my coins to celebrate a new ATH, get some gifts for myself and my family, have some fun, set aside a bit of fiat money. It's usually 1-2% that I spend during bull runs, but if we go above 110k, I might use another 1% to buy stuff that I don't necessarily need, but might set aside to have fun with next year, if the bear market hits.In other words, I have all that I need and I have the money to buy what I need, but there are things that I could have. For instance, I have a good photo printer, but I could have a better one if I had excess money. I have a decent car, but I could switch it to a similar model with 4x4. That's not a must, but there's always room for improvement",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AprilioMP",
      "created_time": "December 25, 2024, 08:36:54 PM",
      "body": "Quote from: Oshio-man on December 25, 2024, 01:21:09 PMI notice that some people sold their bitcoins when the price was $70k, some sold when the price was $80k, some people sold when the price was $90k while some people sold when the price was $100k and above, and those that couldn't endure till $100k and above where not happy when they saw the price increased above $100k, despite they made income from the rate they use to sell their bitcoins, with what I have experienced from bitcoins bull season, i will never be in a hurry to sell my bitcoins, and I will be patient with my holding in the bull season, those are the major lesson I learned from this $100k that happened.Upon the title OP, I am happy for everything I experienced with Bitcoin that I have, including when the price of Bitcoin is able to reach $100,000.When prices rise in surprise from the multi -rise process ranging from $70,000 to $80,000 then to $90,000 to $100,000, including above $100,000.Experience, me and you are among the others may be different but the same taste is happy. Happy to sell at a price of $80,000 because it has been holding a long time since the price is below $70,000.Likewise for those who sell Bitcoin at the price of $90,000 will feel a little furious when the price has penetrated $100,000.For me, all of this is not about price but about involvement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "December 25, 2024, 08:45:39 PM",
      "body": "Quote from: Oshio-man on December 25, 2024, 01:21:09 PMGreetings my beloved Bitcointalk users, Merry Christmas to you all, I know many people have been busy enjoying themselves in this festive season celebration and holiday, I brought this topic to know what people have experienced from this bull season that reign in this month of November and December to hit $100k, I was not able to hold bitcoin this year because I was still learning on how to acquire the knowledge of bitcoin and how to hold bitcoins for long term before I can start investing in bitcoin, which I just achieved the knowledge few weeks ago waiting for funds to enter my hand before I can buy bitcoins. I notice that some people sold their bitcoins when the price was $70k, some sold when the price was $80k, some people sold when the price was $90k while some people sold when the price was $100k and above, and those that couldn't endure till $100k and above where not happy when they saw the price increased above $100k, despite they made income from the rate they use to sell their bitcoins, with what I have experienced from bitcoins bull season, i will never be in a hurry to sell my bitcoins, and I will be patient with my holding in the bull season, those are the major lesson I learned from this $100k that happened.It's depends on what price they really bought their coin, I can justify their reason for not been happy but there is no wizard that can tell you how far Bitcoin price will go, if you are not happy that you bought Bitcoin at low price and you sold at $70k and angry because the price keeps going up, that means you are not a good person, you want Bitcoin price to do your way and not makes other people happy, what are you going to do if it's never increase at all to $70k.I don't judge anyone if they buy Bitcoin at $90k and sold at $100k, it's your money isn't it and it's your profits. As long as you don't make loss, it's all good. The person th that bought Bitcoin at $100 and holding all the way up that hasn't sell isn't not doing Bitcoin any favor, at one point in time, he is going to sell when there is need and ready, just that not everyone will sell Bitcoin at once, it's going to be different time and different quantity and different prices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batang_bitcoin",
      "created_time": "December 25, 2024, 09:35:28 PM",
      "body": "Quote from: Oshio-man on December 25, 2024, 01:21:09 PMGreetings my beloved Bitcointalk users, Merry Christmas to you all, I know many people have been busy enjoying themselves in this festive season celebration and holiday, I brought this topic to know what people have experienced from this bull season that reign in this month of November and December to hit $100k, I was not able to hold bitcoin this year because I was still learning on how to acquire the knowledge of bitcoin and how to hold bitcoins for long term before I can start investing in bitcoin, which I just achieved the knowledge few weeks ago waiting for funds to enter my hand before I can buy bitcoins. I notice that some people sold their bitcoins when the price was $70k, some sold when the price was $80k, some people sold when the price was $90k while some people sold when the price was $100k and above, and those that couldn't endure till $100k and above where not happy when they saw the price increased above $100k, despite they made income from the rate they use to sell their bitcoins, with what I have experienced from bitcoins bull season, i will never be in a hurry to sell my bitcoins, and I will be patient with my holding in the bull season, those are the major lesson I learned from this $100k that happened.To me, profit is profit. And if those people weren't happy from the time they have sold, they have to realize for how long they have been holding. There is no problem for them if they sold a little bit but what matters is that they've made some decent profit after all of the years or months that they have been holding. This is all about people's greed and being not content. That will strike the most of those that have sold even at the peak of 2017 for which the price of BTC was $20k. There's a regret in it, but what's done is done.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "December 25, 2024, 09:51:46 PM",
      "body": "Quote from: Ale88 on December 25, 2024, 05:43:26 PMI don't think selling bitcoin is about \"being in a hurry\" rather than a question like \"do I actually need to sell my bitcoins? Do I need this money? Am I actually happy with the amount of dollars I would get from the sale?\". Every situation is different, some people just want some quick profit while others don't want to sell but they need to out of necessity. Just try to have your plan ready.The more reason why people should have extra money saved for emergencies and other necessity so that they won't have to sell their bitcoin because they need it like you said. Everyone may have their own reasons why they want quick profit or more profit that's why they sell. After all, it is their own bitcoin investment so if they are satisfied or happy with the quick profit result then that's good for them while the other aims for more profit which is good for bitcoin network (possibly earn lots of profit).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "December 25, 2024, 09:59:06 PM",
      "body": "we all have very different situations but i think majority of us were very happy from bitcoin reaching $100k no matter where or when we sold our coins maybe some of us have some regrets but overall i have only seen really good or positive mood from the community which shows how bitcoin really affects our life in a good way",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "December 25, 2024, 10:32:52 PM",
      "body": "Quote from: Oshio-man on December 25, 2024, 01:21:09 PMGreetings my beloved Bitcointalk users, Merry Christmas to you all, I know many people have been busy enjoying themselves in this festive season celebration and holiday, I brought this topic to know what people have experienced from this bull season that reign in this month of November and December to hit $100k, I was not able to hold bitcoin this year because I was still learning on how to acquire the knowledge of bitcoin and how to hold bitcoins for long term before I can start investing in bitcoin, which I just achieved the knowledge few weeks ago waiting for funds to enter my hand before I can buy bitcoins. I notice that some people sold their bitcoins when the price was $70k, some sold when the price was $80k, some people sold when the price was $90k while some people sold when the price was $100k and above, and those that couldn't endure till $100k and above where not happy when they saw the price increased above $100k, despite they made income from the rate they use to sell their bitcoins, with what I have experienced from bitcoins bull season, i will never be in a hurry to sell my bitcoins, and I will be patient with my holding in the bull season, those are the major lesson I learned from this $100k that happened.Take this scenario of people that goes to market to buy or sell something in the market, some will leave in the morning, some in the afternoon, whereas some will leave at night, people will leave the market according to the time they entered the market and according to the time when they make some profit, whereas some will still leave with or without profit, so what does that tell you everyone won't do the same thing, do the one that suits your time and target, and what others are doing shouldn't be of concern to you, the market is a competitive one, meaning people are doing what they think will be favorable for their win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Natalim",
      "created_time": "December 25, 2024, 10:58:14 PM",
      "body": "Quote from: Ale88 on December 25, 2024, 05:43:26 PMQuote from: Oshio-man on December 25, 2024, 01:21:09 PMwith what I have experienced from bitcoins bull season, i will never be in a hurry to sell my bitcoins, and I will be patient with my holding in the bull season, those are the major lesson I learned from this $100k that happened.I don't think selling bitcoin is about \"being in a hurry\" rather than a question like \"do I actually need to sell my bitcoins? Do I need this money? Am I actually happy with the amount of dollars I would get from the sale?\". Every situation is different, some people just want some quick profit while others don't want to sell but they need to out of necessity. Just try to have your plan ready.You can sell if you hit your target selling price and enjoy your profits, but if $100k isn't your target, then there's no need to sell your coins in a rush. Set your own price when to finally sell your coins so you won't be imitating others if ever they are taking such actions. Right, have your own plan and stick to it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EFS",
      "created_time": "December 25, 2024, 11:19:18 PM",
      "body": "The most important lesson from this 100k run is that if you believe in something, stand behind it. There are so many people who sold their coins beforehand, even though they knew Bitcoin was going to get to this point. I've realized this much better. Never sell your Bitcoin if you don't urgently need cash money. Bitcoin is one of the best ways to protect your wealth against high inflation and economic crises.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "December 26, 2024, 12:15:32 AM",
      "body": "Quote from: Oshio-man on December 25, 2024, 01:21:09 PMand those that couldn't endure till $100k and above where not happy when they saw the price increased above $100k, I am among the people who sold some portion of their Bitcoin bag when the price was in the $80K price range. I never feel sad about the decision when I see the $100K price because I don't sell at a lost price, and the reason why I sold at the $80K price was for an emergency purpose which I will achieve something valuable through it.I believe some crypto enthusiasts need to understand being responsible for their actions and how to be mature because we can't eat our cake and still have it, and we do not face the reality of the decision made.Quote from: Oshio-man on December 25, 2024, 01:21:09 PMdespite they made income from the rate they use to sell their bitcoins, with what I have experienced from bitcoins bull season, i will never be in a hurry to sell my bitcoins, and I will be patient with my holding in the bull season, those are the major lesson I learned from this $100k that happened.Good. In addition, to what you said. The bull season is never the moment for accumulation. Split into 2 your BTC bag, have one for short, and the remaining for long -term olding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}