{
  "id": "topic_5472680",
  "title": "Fivestar4everMVP",
  "author": "Fivestar4everMVP",
  "created_time": "November 03, 2023, 08:19:38 AM",
  "content": "Yeah, you read that right, 93% of all existing Bitcoins have been mined already, we have just 7% remaining, and it is estimated that the last Bitcoin will be mined by the year 2140, that is approximately 117 years from this year 2023.100 years makes 1 century right? yeah, so this means that the remaining 7% of bitcoin yet to be mined will take more than one century to mine all of them.Now, with bitcoin becoming more popular and expensive as time progresses, Billions are gonna be competing to mine the last remaining bitcoin, if not for anything, to at least have it as a legacy that they were among those that mined the last bitcoins, I also want this as a legacy for myself but unfortunately, I probably won't be alive in the next 70 to 80 years from now, and so it is also for majority of us here right now.Are you here and still unsure whether bitcoin is the right asset to invest in, well, just start accumulating bitcoin today before it's too late, if you feel you are too old and don't have any need for bitcoin, you sure need bitcoin for the generation coming through you, accumulate bitcoin for them, it's a legacy they will live to forever remember you for.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472680",
  "comments": [
    {
      "author": "AprilioMP",
      "created_time": "November 03, 2023, 09:00:12 AM",
      "body": "Quote from: Fivestar4everMVP on November 03, 2023, 08:19:38 AMAre you here and still unsure whether bitcoin is the right asset to invest in, well, just start accumulating bitcoin today before it's too late, if you feel you are too old and don't have any need for bitcoin, you sure need bitcoin for the generation coming through you, accumulate bitcoin for them, it's a legacy they will live to forever remember you for.Doubtful on Bitcoin, no. There is no doubt about Bitcoin as an investment asset even though I am still a baby in my experience about Bitcoin. But thanks to the openness of the information space that exists due to internet access, I don't doubt Bitcoin as an investment asset. Trust in Bitcoin is increasing due to the recorded history of what, why, how and for what Bitcoin was created.I'm not sure how long I'll be able to breathe, but I plan to make Bitcoin a legacy that will be passed on to the next generation when I have time to start a family and have children.So for now I have not thought about the purpose of collecting for my next generation. Now I'm thinking about how I can use Bitcoin even though I can't use Bitcoin as money to make payments.Because I can't use it as money because there is a ban, one of the real benefits I can feel now is using it as a long-term investment asset by becoming a holder while enjoying the remaining 7% that has not been mined.I Love Bitcoin and thanks Satoshi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "November 03, 2023, 10:02:38 AM",
      "body": "Quote from: Fivestar4everMVP on November 03, 2023, 08:19:38 AM Yeah, you read that right, 93% of all existing Bitcoins have been mined already, we have just 7% remaining, and it is estimated that the last Bitcoin will be mined by the year 2140, that is approximately 117 years from this year 2023.Since there will only be 21 million Bitcoin, 7% of that is around 1,470,000 which can be mined for the next 117 years...which is a lot of time and we will not anymore be alive by then. So I agree with you that accumulating BTC can be our legacy for the future generations. And I have no doubt that BTC will continue to be more valuable as ever most especially if soon ETF will be approved by SEC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "November 03, 2023, 10:18:54 AM",
      "body": "Quote from: Fivestar4everMVP on November 03, 2023, 08:19:38 AM Yeah, you read that right, 93% of all existing Bitcoins have been mined already, we have just 7% remaining, and it is estimated that the last Bitcoin will be mined by the year 2140, that is approximately 117 years from this year 2023.This is information that might fascinate a beginner, not someone who has read dozens of similar topics over the years on this forum.Quote from: Fivestar4everMVP on November 03, 2023, 08:19:38 AM100 years makes 1 century right? yeah, so this means that the remaining 7% of bitcoin yet to be mined will take more than one century to mine all of them.Fascinating observation, for those who did not know until now, 100 years is equal to one century Quote from: Fivestar4everMVP on November 03, 2023, 08:19:38 AMNow, with bitcoin becoming more popular and expensive as time progresses, Billions are gonna be competing to mine the last remaining bitcoin, if not for anything, to at least have it as a legacy that they were among those that mined the last bitcoins, I also want this as a legacy for myself but unfortunately, I probably won't be alive in the next 70 to 80 years from now, and so it is also for majority of us here right now.Billions you say? You want to say that in 100+ years billions of people will be mining Bitcoin just to go down in history as the ones who grabbed the last satoshi? Do you know that of the 7% you mention, even 6% will be mined in less than 10 years, and that 1% will actually remain for the next 100 years as a very insignificant part, considering that it is only 210 000 BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helena Yu",
      "created_time": "November 03, 2023, 10:26:54 AM",
      "body": "Despite Bitcoin circulation, mining difficulty etc are keep rising, but it's not entirely make Bitcoin price increase too if the market is small, Bitcoin is still not achieve it's mass adoption due to not regulated. The biggest task is making an Average Joe feel safe to invest in Bitcoin or the government is legally regulated Bitcoin.Quote from: Fivestar4everMVP on November 03, 2023, 08:19:38 AMyou sure need bitcoin for the generation coming through you, accumulate bitcoin for them, it's a legacy they will live to forever remember you for.It's up to everyone choice whether they want to pass their coins to their next generation or not, after all you must focus with your life \"right now\" instead of thinking about heritage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iamcrypticguy",
      "created_time": "November 03, 2023, 10:37:42 AM",
      "body": "Quote from: Fivestar4everMVP on November 03, 2023, 08:19:38 AM Yeah, you read that right, 93% of all existing Bitcoins have been mined already, we have just 7% remaining, and it is estimated that the last Bitcoin will be mined by the year 2140, that is approximately 117 years from this year 2023.100 years makes 1 century right? yeah, so this means that the remaining 7% of bitcoin yet to be mined will take more than one century to mine all of them.Now, with bitcoin becoming more popular and expensive as time progresses, Billions are gonna be competing to mine the last remaining bitcoin, if not for anything, to at least have it as a legacy that they were among those that mined the last bitcoins, I also want this as a legacy for myself but unfortunately, I probably won't be alive in the next 70 to 80 years from now, and so it is also for majority of us here right now.Are you here and still unsure whether bitcoin is the right asset to invest in, well, just start accumulating bitcoin today before it's too late, if you feel you are too old and don't have any need for bitcoin, you sure need bitcoin for the generation coming through you, accumulate bitcoin for them, it's a legacy they will live to forever remember you for.This is good for BTC or bad?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lombok",
      "created_time": "November 03, 2023, 10:42:39 AM",
      "body": "Quote from: Helena Yu on November 03, 2023, 10:26:54 AMDespite Bitcoin circulation, mining difficulty etc are keep rising, but it's not entirely make Bitcoin price increase too if the market is small, Bitcoin is still not achieve it's mass adoption due to not regulated. The biggest task is making an Average Joe feel safe to invest in Bitcoin or the government is legally regulated Bitcoin.There's still a long way to go for Bitcoin. Yes, compared to the previous few years, Bitcoin market capitalization has increased quite rapidly, if you add legalization, ETFs and so on in the coming year, there will definitely also be an increase. Adoption and interest in Bitcoin will continue to grow, especially if Bitcoin continues to have the title of asset storage and often appears and is discussed in economic broadcasts. I am sure that many investors and even new users will enter Bitcoin.Quote from: Helena Yu on November 03, 2023, 10:26:54 AMQuote from: Fivestar4everMVP on November 03, 2023, 08:19:38 AMyou sure need bitcoin for the generation coming through you, accumulate bitcoin for them, it's a legacy they will live to forever remember you for.It's up to everyone choice whether they want to pass their coins to their next generation or not, after all you must focus with your life \"right now\" instead of thinking about heritage.Yes, regarding inheritance, it can be arranged within the family. Each succeeding generation definitely has desires and interests in each field. And we cannot force their will to match our wishes, if they remember and want to access it. If you forget it or get it tucked away, it will become a useless inheritance. I think we can know what children need most, and what is best for our heirs. I think Knowledge is the best inheritance for children, and Bitcoin might be a bonus.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "November 03, 2023, 11:22:32 AM",
      "body": "Quote from: Iamcrypticguy on November 03, 2023, 10:37:42 AMQuote from: Fivestar4everMVP on November 03, 2023, 08:19:38 AM *SnipThis is good for BTC or bad?What do you think? Of course it's good for bitcoin generally.Think of this, when all the bitcoins are mined, miners will no longer earn Bitcoin through mining but will only earn from transaction fees, bitcoin will become more attractive to invest in, most especially to big investors, as no new bitcoins are being minted any more, and the circulating bitcoins will be capped at around 18 or 19 million bitcoins if we minus the bitcoins that are forever lost.And since there will be no more halvings, the price of bitcoin will become relatively more stable, making it more attractive for people to accept it as payment for their goods and services.This are the benefits and many more I didn't mention.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "November 03, 2023, 12:26:24 PM",
      "body": "This makes Bitcoin scarcer and people don't realize that until they see the price goes high to a tremendous that we're never expecting. Or should I say that many are expecting but it's just so unbelievable because most of the speculations or predictions are just too high to imagine.Quote from: Iamcrypticguy on November 03, 2023, 10:37:42 AMThis is good for BTC or bad?It's good in general if you're a long term guy for Bitcoin or very optimistic on it. But if you're still thinking that you're late then it seems that the bad thought will come to you just as the others thinking that you guys are already late.More than a century to mine all the Bitcoin, I can no longer wait for that and I know that I might be dead when it comes. But I know that good times will come for the most of us who knows how to be patient.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Get Happy Code",
      "created_time": "November 03, 2023, 12:38:22 PM",
      "body": "\"93 Percent of all Bitcoin Has Been Mined\"At some point, probably the next bull market (when BTC is over $100,000), mainstream, wealthy people will go nuts over the idea of owning a \"single whole Bitcoin\" before it is too late. At that point the fun and near insanity will rapidly intensify.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "November 03, 2023, 12:39:41 PM",
      "body": "Quote from: Fivestar4everMVP on November 03, 2023, 08:19:38 AM Yeah, you read that right, 93% of all existing Bitcoins have been mined already, we have just 7% remaining, and it is estimated that the last Bitcoin will be mined by the year 2140, that is approximately 117 years from this year 2023.100 years makes 1 century right? yeah, so this means that the remaining 7% of bitcoin yet to be mined will take more than one century to mine all of them.Now, with bitcoin becoming more popular and expensive as time progresses, Billions are gonna be competing to mine the last remaining bitcoin, if not for anything, to at least have it as a legacy that they were among those that mined the last bitcoins, I also want this as a legacy for myself but unfortunately, I probably won't be alive in the next 70 to 80 years from now, and so it is also for majority of us here right now.Are you here and still unsure whether bitcoin is the right asset to invest in, well, just start accumulating bitcoin today before it's too late, if you feel you are too old and don't have any need for bitcoin, you sure need bitcoin for the generation coming through you, accumulate bitcoin for them, it's a legacy they will live to forever remember you for.I don't think that we can see it in our lifetime.But I guess in the next couple of halvings, we might see that almost all bitcoin has been mine at 99%. And the rest of that 1% will be mined till that 2140.So there is still some time for us before we can reach that 99% of bitcoin being mine and if that happens, then obviously it will be scarce and it will really push the price beyond our imagination.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "November 03, 2023, 01:11:02 PM",
      "body": "Quote from: Fivestar4everMVP on November 03, 2023, 11:22:32 AMAnd since there will be no more halvings, the price of bitcoin will become relatively more stable, making it more attractive for people to accept it as payment for their goods and services.This are the benefits and many more I didn't mention. You are actually correct. If the price of bitcoin becomes relatively stable, it will attract more people and businesses to the sector. At this point, it will be widely used as legal tender just as it was designed for. Businesses would have benefitted from using bitcoin for local and international transactions but I have heard some business owners claim that they a forced to convert their funds to fiat because of the volatility of bitcoin price. Since we cannot predict when it will happen for now bitcoin is better as an investment.  Quote from: Helena Yu on November 03, 2023, 10:26:54 AMDespite Bitcoin circulation, mining difficulty etc are keep rising, but it's not entirely make Bitcoin price increase too if the market is small, Bitcoin is still not achieve it's mass adoption due to not regulated. The biggest task is making an Average Joe feel safe to invest in Bitcoin or the government is legally regulated Bitcoin.Bitcoin awareness and adoption will affect the price of bitcoin positively but government regulations will make the currency more centralised. Government involvement might increase public trust and confidence which will increase the price of bitcoin but many people will lose privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AHOYBRAUSE",
      "created_time": "November 03, 2023, 01:16:30 PM",
      "body": "Quote from: Fivestar4everMVP on November 03, 2023, 08:19:38 AM Yeah, you read that right, 93% of all existing Bitcoins have been mined already, we have just 7% remaining, and it is estimated that the last Bitcoin will be mined by the year 2140, that is approximately 117 years from this year 2023.100 years makes 1 century right? yeah, so this means that the remaining 7% of bitcoin yet to be mined will take more than one century to mine all of them.Now, with bitcoin becoming more popular and expensive as time progresses, Billions are gonna be competing to mine the last remaining bitcoin, if not for anything, to at least have it as a legacy that they were among those that mined the last bitcoins, I also want this as a legacy for myself but unfortunately, I probably won't be alive in the next 70 to 80 years from now, and so it is also for majority of us here right now.Are you here and still unsure whether bitcoin is the right asset to invest in, well, just start accumulating bitcoin today before it's too late, if you feel you are too old and don't have any need for bitcoin, you sure need bitcoin for the generation coming through you, accumulate bitcoin for them, it's a legacy they will live to forever remember you for.Oh wow, you never learn out.I didn't imagine it would take that long to mine the remaining coins! I mean, it took so few years to mine 93% and so many to mine the remaining 7, that's crazy.Since I never educated myself about that process it really surprises me. I thought it would be fully mined in the next 10 years maybe, haha.With so fe coins to be mined, it mining actually worth it anymore? Of course if the price would go up SIGNIFICANTLY it would but at the current price I doubt it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "November 03, 2023, 02:53:40 PM",
      "body": "Quote from: Fivestar4everMVP on November 03, 2023, 08:19:38 AMAre you here and still unsure whether bitcoin is the right asset to invest in, well, just start accumulating bitcoin today before it's too late, if you feel you are too old and don't have any need for bitcoin, you sure need bitcoin for the generation coming through you, accumulate bitcoin for them, it's a legacy they will live to forever remember you for.Bitcoin's adoption rate vs Bitcoin's available supply in the coming days is gonna be a Hot topic, insufficient supply will cause massive jumps in the market valuation compared to any fiat currency when it comes to accumulation. The perspective of saving Bitcoin for the next generation is neither old & new it is all up to the investor who enters the market to explore after learning and getting familiar with the market and future financial crisis he can easily pick up this narrative, except for his short-term temperament and gains.I would love to see the legacy of Bitcoin so far until the end of my life and I'm pretty sure sooner I will be able to consider myself a storyteller to my children than how I entered and explored this legend (Haha it on the Bitcoin evolution to a global payment and  & my marriage journey lets hope both are gonna be smooth and on time).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "November 03, 2023, 03:02:07 PM",
      "body": "Quote from: Fivestar4everMVP on November 03, 2023, 08:19:38 AMNow, with bitcoin becoming more popular and expensive as time progresses, Billions are gonna be competing to mine the last remaining bitcoin, if not for anything, to at least have it as a legacy that they were among those that mined the last bitcoins,Yeah right, everyone is going to throw money away on electricity just to not be mentioned anywhere!As for the billions competing, how many are competing right now, for sure not even millions, as in orde to actively compete you have to throw a few grand in the mix at least and deal with the noise and heat and power consumption, for what, a place on internet history that is tossed away 5 minutes later?Look what happened to the early miners, where is their hall of fame? As if 99% of this forum could name somebody else other than Satoshi!Quote from: Lucius on November 03, 2023, 10:18:54 AMFascinating observation, for those who did not know until now, 100 years is equal to one century Joking and not so much joking, I don't doubt there are some who would take a few moments to think how long a century is!And after all you need to add some of this platitude to make it look like a topic, right?Can't wait for 94%, 95%, 95,1%, 95,2% and so onQuote from: sunsilk on November 03, 2023, 12:26:24 PMThis makes Bitcoin scarcer and people don't realize that until they see the price goes high to a tremendous that we're never expecting.No it doesn't!New coins are mined every day, and there are more coins available each day, the complete opposite of scarcer!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "November 03, 2023, 03:20:26 PM",
      "body": "Quote from: Lucius on November 03, 2023, 10:18:54 AMQuote from: Fivestar4everMVP on November 03, 2023, 08:19:38 AM100 years makes 1 century right? yeah, so this means that the remaining 7% of bitcoin yet to be mined will take more than one century to mine all of them.Fascinating observation, for those who did not know until now, 100 years is equal to one century I was also fascinated by it.  Quote from: stompix on November 03, 2023, 03:02:07 PMNo it doesn't!New coins are mined every day, and there are more coins available each day, the complete opposite of scarcer!Well, that is relative, because to consider the number of bitcoins available we would have to know who is willing to sell the ones they have, as well as exactly how many have been lost. I don't think there is either one or the other: there is less and less left before the total limit is reached, but we could consider that there are more available because we assume that most of those that are mined are available for sale and purchase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JunaidAzizi",
      "created_time": "November 03, 2023, 03:24:50 PMLast edit: November 04, 2023, 11:53:27 AM by JunaidAzizi",
      "body": "Quote from: Fivestar4everMVP on November 03, 2023, 08:19:38 AM Yeah, you read that right, 93% of all existing Bitcoins have been mined already, we have just 7% remaining, and it is estimated that the last Bitcoin will be mined by the year 2140, that is approximately 117 years from this year 2023.Well, you are right in that about 19 million of Bitcoin has been mined, and only 2 million of Bitcoin which makes 7% of the remaining bitcoin is left. We all know that the whole count of Bitcoin is 21millions and 19 million are mined you said that the remaining 7% of Bitcoin takes approximately 117 years which is 1 century and 17 years. But I am confused a little bit here.  Bitcoin was invented in 2009 and tested and started working fully in 2010. Now it's 2023 and you told me that 93% of Bitcoin is mined in just 13 or 14 years, if the larger percentage takes that time how does the 7% remaining Bitcoin require 117 years?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "November 03, 2023, 03:35:13 PM",
      "body": "100 years is not a short time, certainly within this time period the development of the bitcoin ecosystem will be bigger and more massive than it is now. Even though no one knows for sure what the future will be like for Bitcoin, I am sure that it will continue to develop and there will be more and more adopters.Even though I won't be alive in the next 100 years, at least I will leave a legacy to my children and grandchildren that there is someone in their family who invested in bitcoin and I hope that they can continue this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "November 03, 2023, 03:42:52 PM",
      "body": "Quote from: Fivestar4everMVP on November 03, 2023, 08:19:38 AM Yeah, you read that right, 93% of all existing Bitcoins have been mined already, we have just 7% remaining, and it is estimated that the last Bitcoin will be mined by the year 2140, that is approximately 117 years from this year 2023.100 years makes 1 century right? yeah, so this means that the remaining 7% of bitcoin yet to be mined will take more than one century to mine all of them.Now, with bitcoin becoming more popular and expensive as time progresses, Billions are gonna be competing to mine the last remaining bitcoin, if not for anything, to at least have it as a legacy that they were among those that mined the last bitcoins, I also want this as a legacy for myself but unfortunately, I probably won't be alive in the next 70 to 80 years from now, and so it is also for majority of us here right now.Are you here and still unsure whether bitcoin is the right asset to invest in, well, just start accumulating bitcoin today before it's too late, if you feel you are too old and don't have any need for bitcoin, you sure need bitcoin for the generation coming through you, accumulate bitcoin for them, it's a legacy they will live to forever remember you for.And so we have discussed this n number of times already. Yes, bitcoin is legacy and accumulate as much as possible while you can.But the important thing is, take the profits when you are in need, have a backup plan for inheritance and enjoy freedom because thats what bitcoin is for.Don't just keep accumulating without any backup plan so that your bitcoins become inactive after you're dead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "November 03, 2023, 04:14:22 PM",
      "body": "Quote from: Don Pedro Dinero on November 03, 2023, 03:20:26 PMQuote from: stompix on November 03, 2023, 03:02:07 PMNo it doesn't!New coins are mined every day, and there are more coins available each day, the complete opposite of scarcer!Well, that is relative, because to consider the number of bitcoins available we would have to know who is willing to sell the ones they have, as well as exactly how many have been lost. I don't think there is either one or the other: there is less and less left before the total limit is reached, but we could consider that there are more available because we assume that most of those that are mined are available for sale and purchase.Not relative at all!Every single day we have 900 extra coins getting released into the wild, this is simply increasing the available supply, standard definition!Furthermore, and this is the interesting thing, if you go above the scarce assumption, then what do you know, fiat is also getting scarcer, no joke! Because there is a limited amount that is being printed, there are hundreds and thousands of bills that get lots, get destroyed end up in safe cases, and so on! If all the government in the US would come and say here is the deal, we're going to print a limit of 1000 quadrillion dollars and after that, there won't be anymore being printed, would that make the $ scarce because it has an upper limit by the amount of plastic needed for bills not existing on this planet? Of course not!Quote from: JunaidAzizi on November 03, 2023, 03:24:50 PMWell, you are right in that about 19 million of Bitcoin has been mined, and only 2 million of Bitcoin which makes 7% of the remaining bitcoin is left. We all know that the whole count of Bitcoin is 21millions and 19 million are mined you said that the remaining 7% of Bitcoin takes approximately 117 years which is 1 century and 17 years. Lucius, any feedback on this gem?  Quote from: JunaidAzizi on November 03, 2023, 03:24:50 PMAs I read that a single Bitcoin is mined in about one hour so how does 93% take such a short time to mine?Wow, 150 merits, one year on this forum, and he knows one Bitcoin is mined per hour!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}