{
  "id": "topic_5473360",
  "title": "RioBlemz",
  "author": "RioBlemz",
  "created_time": "November 08, 2023, 02:22:18 PM",
  "content": "Bitcoin is the Choice of InvestorsGold has had hedging functions for many years, while Bitcoin is just getting started, implying that Bitcoin will earn additional value over the next ten years.Taking a cue from Ark Invest CEO Cathie Wood, I can state unequivocally that investors are currently paying more Keen interest on Bitcoin than ever before.ARK Invest is an American investment management firm that provides solutions to investors seeking profitable development in the public market. Notably, the US Securities and Exchange Commission has received an application from this company seeking to establish a Bitcoin ETF for trading on the spot market.Cathie Wood, who appeared on the show 'Merryn Talks Money' to discuss current financial events, chose Bitcoin over gold for a decade. Her stance was that young people who represent the futures market prefers holding Bitcoin, and Bitcoin has recently outperformed Gold in terms of hedging.Some significant points that I believe investors are taking note of is that:During the March 2023 regional bank crisis, the value of Bitcoin increased from $18,900 to $30,000. This was a strong indication that Bitcoin is more than just a hedge against inflation; it is also a \"Safe Haven.\"\"Transparent and Decentralized\" is how Bitcoin describes itself and this has remain true over time.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473360",
  "comments": [
    {
      "author": "Odohu",
      "created_time": "November 08, 2023, 04:29:26 PM",
      "body": "The caption is actually confusing because using the word \"investors\" and not \"some investors\" is actually equivocal.  There is no doubt Bitcoin has gained significant popularity given the uncertainties in the global political and financial systems. A lot of investors are actually looking for a safe haven, but I wouldn't say Bitcoin is their choice already. The approval of some of the Bitcoin ETF will actually pave the way for some of these investors to enter into Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "November 08, 2023, 10:11:34 PM",
      "body": "Well, for us obviously it's a best choice for investors. We have seen Bitcoin's tremendous journey since it's inception and how a few of it's early adopters become millionaires today and they have wielded so much influence and then we want to emulate how they made profits in Bitcoin, and so we become holders.But there are also one group in the other side, we might be going into altcoins with gives better result in terms of ROI but the risk is there.And some who invest on Gold, not that volatile, but still as a long term it's one of the best.So it's up to us where we want to put our money here or in other commodities/assets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panganib999",
      "created_time": "November 08, 2023, 10:27:45 PM",
      "body": "Bitcoin is the choice investment not because of anything other than safety. profit? We got shitcoins and other currencies on the market with a low marketcap but high potential upturns to rely upon should we feel the need to. It's just that bitcoin is the most consistent cryptocurrency out there that it makes it so appealing to the public. People want consistency in their profit stream and since bitcoin could provide that with its cyclical 4-year nature wherein you can pretty much say that every 4 years or so we got a good chance of going big, the choice becomes apparent. So when you say that \"bitcoin is the choice of investors\", it doesn't inspire the same energy as when you'd say it for something like another stock or cryptocurrency, at least for me. Don't get me wrong, I love bitcoin as much as the next guy but it just doesn't bring that much impact to me you know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChiBitCTy",
      "created_time": "November 08, 2023, 10:38:03 PM",
      "body": "I've owned a few share of ARKK for a little while now.  It's been performing horribly over the last year or so.  I have left my money in it but probably will dump it here before long.  So I guess what I'm saying is I'm not sure I trust her judgement.  However I do agree that bitcoin is becoming a better asset/hedge etc as time has been going on when ETFs start to be issued here, I can see things really taking off.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kingvirtus09",
      "created_time": "November 08, 2023, 11:33:18 PM",
      "body": "Over time, after the events of 2017, investors are gradually discovering and seeing that the value of Bitcoin is not going down, so investors may be thinking that if they don't buy Bitcoin now, they will definitely be left alone in the end.After all, who are the rich investors who will not buy Bitcoin today in this era? If well-known and big companies around the world are already investing in Bitcoin and cryptocurrency, how much more so are people like us who are not rich? This is where we should imitate the positive view of rich investors; after all, Bitcoin does not choose how much you can buy, as long as you can afford it, of course.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "krishnaverma",
      "created_time": "November 09, 2023, 01:46:41 AM",
      "body": "Quote from: RioBlemz on November 08, 2023, 02:22:18 PMBitcoin is the Choice of InvestorsGold has had hedging functions for many years, while Bitcoin is just getting started, implying that Bitcoin will earn additional value over the next ten years.Taking a cue from Ark Invest CEO Cathie Wood, I can state unequivocally that investors are currently paying more Keen interest on Bitcoin than ever before.ARK Invest is an American investment management firm that provides solutions to investors seeking profitable development in the public market. Notably, the US Securities and Exchange Commission has received an application from this company seeking to establish a Bitcoin ETF for trading on the spot market.Cathie Wood, who appeared on the show 'Merryn Talks Money' to discuss current financial events, chose Bitcoin over gold for a decade. Her stance was that young people who represent the futures market prefers holding Bitcoin, and Bitcoin has recently outperformed Gold in terms of hedging.Some significant points that I believe investors are taking note of is that:During the March 2023 regional bank crisis, the value of Bitcoin increased from $18,900 to $30,000. This was a strong indication that Bitcoin is more than just a hedge against inflation; it is also a \"Safe Haven.\"\"Transparent and Decentralized\" is how Bitcoin describes itself and this has remain true over time.During Russia Ukraine war, lot of people from Russia moved funds from banks into crypto. It shows that the trust of people on crypto is increasing day by day. Current investors should hold and continue investing more. Because increased demand will also push the prices up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iranus",
      "created_time": "November 09, 2023, 02:13:20 AM",
      "body": "Quote from: RioBlemz on November 08, 2023, 02:22:18 PMDuring the March 2023 regional bank crisis, the value of Bitcoin increased from $18,900 to $30,000. This was a strong indication that Bitcoin is more than just a hedge against inflation; it is also a \"Safe Haven.\"So how do you explain bitcoin falling from $69k to $15k by 2022 as inflation and crisis peak? If talking about an asset class with good growth potential, a potential investment that will bring high profits, bitcoin really deserves to be number 1. But saying it is a safe haven is not entirely correct, bitcoin is not suitable as a safe haven at the present time. That may become true in the future as the popularity of bitcoin grows as well as the recognition of bitcoin by governments and organizations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "November 09, 2023, 02:35:57 AM",
      "body": "The one thing I probably don't find interesting with Ark Invest's Cathie Wood is her overly bullish predictions. She must have her own analyses, of course, but she doesn't seem realistic. As a result, she sounds like she simply wants to cause a FOMO especially among institutions. She was wrong before and has already admitted that they had to temper their assumptions. But even so, they're still convinced that the price could still grow above a million dollars within this decade alone. I highly doubt this, although I wish she ends up proving me wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "November 09, 2023, 02:47:12 AM",
      "body": "Not really sure if bitcoin is ready to be called a \"safe haven\" and \"inflation hedge\"; it's technically true on some timeframes, but it's a bit too volatile right now for those titles. For now, it's still moving like a high-beta asset. But maybe in the future bitcoin can 'officially' earn those titles.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "November 09, 2023, 03:04:11 AM",
      "body": "Not discounting the value and importance of gold since I believe it will always have a place in the heart of many traders and investors, there is no question that as far as excitement, interest and enthusiasm can be concerned it is Bitcoin that is the hands down winner...at least for the time being. Actually, there is no competition between the two as they both have different value, functions and benefits. As far as possible ROI on the line, many experts might say that Bitcoin can give one better chance of financial benefits than gold though in terms of stability we know that BTC is very volatile...we don't know when it would make a bull run or a big dump as we saw in its short historical display.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solokan",
      "created_time": "November 09, 2023, 03:12:31 AM",
      "body": "Picture taken from: https://pluang.com/id/blog/resource/investasi-bitcoin-asetInvestors will of course choose to invest according to their wishes, some choose bitcoin, some choose gold and some choose something other than gold and bitcoin.I choose to invest in BTC because I see the profits that can be obtained from investing in BTC, especially today the price of BTC has risen again which of course gives happiness to BTC investors who buy under $30k. In my opinion, investing in anything cannot be separated from risk, and usually high risk will provide high returns, but low risk will certainly provide low returns. but in my opinion it is better to invest in assets that have permission from the government and I dare to invest in BTC because I have permission from the government of my country even though my government does not allow people to use BTC as a means of payment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "November 09, 2023, 03:24:03 AM",
      "body": "Well, this doesn't say anything new to me, although we could qualify that it is mostly for younger investors, as Wood also says. Today it is more of an investment than a P2P currency and it looks like it will continue to be so. If spot ETFs are approved, for example, what will happen is that it will be used more as an investment vehicle, and not as a currency, although it will always maintain that part.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "November 09, 2023, 03:27:44 AM",
      "body": "Quote from: RioBlemz on November 08, 2023, 02:22:18 PMDuring the March 2023 regional bank crisis, the value of Bitcoin increased from $18,900 to $30,000. This was a strong indication that Bitcoin is more than just a hedge against inflation; it is also a \"Safe Haven.\"\"Transparent and Decentralized\" is how Bitcoin describes itself and this has remain true over time.Well this statement is quite blurry. Yes its a good choice for investment but Im not gonna called itt a safe haven as anything is possible in thr market. If love crypto and everyone think so too but obviously we cant predict that it always going up and a good hedge for fund especially its so volatile. But one thing is for sure, it might be a good option other than else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "November 09, 2023, 03:28:15 AM",
      "body": "There are many different reasons why investors invest in Bitcoin. And it cannot be denied that perhaps the main reason some people try to make big profits or make money especially for the long term, and others may do it because it is a good way to hedge against global economic instability and other factors. And no matter who you are, crypto is a great and safe place to invest because it is never tied to banks or government monetary policies and Bitcoin is freedom and a way to take control of their financial future and achieve financial independence.And that doesn't mean investors don't make other investments, and what is certain is that they know what is best for them and Bitcoin is an alternative or one of their choices too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "November 09, 2023, 04:47:26 AM",
      "body": "Quote from: RioBlemz on November 08, 2023, 02:22:18 PMCathie Wood, who appeared on the show 'Merryn Talks Money' to discuss current financial events, chose Bitcoin over gold for a decade. Her stance was that young people who represent the futures market prefers holding Bitcoin, and Bitcoin has recently outperformed Gold in terms of hedging.Young people are tech-savvy that's why they are attracted to Bitcoin. They are also well aware of its benefits which outweigh fiat and some investments. Regarding Bitcoin outperforming gold I read a  research that indicated that the cryptocurrency indeed provided stronger short-term risk hedging in the G7 stock markets compared to gold during the COVID-19 and Russo-Ukrainian War periods. I hope the sudden love that institutional investors such as Cathie Wood are expressing towards bitcoin is genuine and will last for a long time. Quote from: RioBlemz on November 08, 2023, 02:22:18 PMDuring the March 2023 regional bank crisis, the value of Bitcoin increased from $18,900 to $30,000. This was a strong indication that Bitcoin is more than just a hedge against inflation; it is also a \"Safe Haven.\"\"Transparent and Decentralized\" is how Bitcoin describes itself and this has remain true over time.It has also been observed that Bitcoin is also affected by other economic conditions such as inflation and interest rates, especially in the US. The COVID-19 pandemic and the energy crisis caused by Russia and Ukraine are all examples of the connection between Bitcoin and the global economy. For now, it can be viewed as a hedge against inflation in nations that are going through hyperinflation mostly in developing nations. However, it could also be a good inflation hedge if it is held for a long time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AprilioMP",
      "created_time": "November 09, 2023, 05:24:24 AM",
      "body": "Choosing Bitcoin as an asset to invest in is the choice of investors who pay attention to investment value.Bitcoin itself is an investment asset that has hedging value against fiat currencies in the long term. The increase in the number of Bitcoin adoptions is due to the fact that in the not too distant future, Bitcoin's hedging against fiat currency has provided an answer to several events that have caused fiat currency to have an impact on the economy.Even though Bitcoin contains risks, there is research that concludes that Bitcoin can be a safe haven and contains diversification benefits[1].The paper from the source that I linked conducted a study on hedging and safe havens between Bitcoin and fiat currencies.[1]. Is Bitcoin a hedge or safe haven for currencies? An intraday analysis",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blitzboy",
      "created_time": "November 09, 2023, 11:37:29 AM",
      "body": "Thanks for sharing obvious things. Bitcoin has become a thing among investors. The shift from gold to digital assets is noteworthy. Bitcoin's rise in value during the banking crisis suggests that its attractiveness as a \"Safe Haven\" asset is growing, given its performance throughout economic downturns.Bitcoin revolutionizes money and investing due to its decentralization. Decentralization creates many problems, such as the lack of a central authority to interfere in market manipulations or retrieve lost cash. But who cares, anyway? Investors' responses to these problems and Bitcoin's integration into the financial system will be fascinating as it matures.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Texac",
      "created_time": "November 09, 2023, 12:29:31 PM",
      "body": "Quote from: ChiBitCTy on November 08, 2023, 10:38:03 PMI've owned a few share of ARKK for a little while now.  It's been performing horribly over the last year or so.  I have left my money in it but probably will dump it here before long.  So I guess what I'm saying is I'm not sure I trust her judgement.  However I do agree that bitcoin is becoming a better asset/hedge etc as time has been going on when ETFs start to be issued here, I can see things really taking off.You can even hold bitcoin and wait 4 years for the bull season to return.  meanwhile, you only invest in ARKK stock for 1 year, and you can also see how bad the world economic situation is.  therefore, I completely disagree with you when you think that investing in ARKK stock is too bad, everything needs time and the right time to make a profit and the same goes for stocks.  but it cannot be denied that the profits of stocks will not be as great as bitcoin gives us, but diversification is also a great thing that we should not ignore.  you are a financial advisor, I think you understand that better than anyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rodskee",
      "created_time": "November 09, 2023, 12:40:03 PM",
      "body": "Quote from: RioBlemz on November 08, 2023, 02:22:18 PMDuring the March 2023 regional bank crisis, the value of Bitcoin increased from $18,900 to $30,000. This was a strong indication that Bitcoin is more than just a hedge against inflation; it is also a \"Safe Haven.\"\"Transparent and Decentralized\" is how Bitcoin describes itself and this has remain true over time.I love it when people says about This Market is a safe haven because of that example and indeed ,  the transparency and the Decentralization of Bitcoin is why people now are shifting from banks to crypto and yes also to help people having faster transactions without Government interference so yes even if I am given many chance I will still choose Bitcoin and yes that is what the futures gonna tell the world when the success of bitcoin cross the universe .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}