{
  "id": "topic_5455532",
  "title": "Carollzinha",
  "author": "Carollzinha",
  "created_time": "June 06, 2023, 09:51:40 PMLast edit: June 06, 2023, 11:19:38 PM by Carollzinha",
  "content": "As the title says, we are looking for a native Russian and a native Korean reviewersWe are not looking for a one time reviewer but someone able for a long term cooperationRequirements:Be a Russian or Korean nativeSpeak English (or at least be able to read & write in English)Have a good Russian or Korean grammarUnderstand about Gambling & CryptosBe able to stick to deadlinesCapacity to work as a teamPayment:Payment per English word (the payrate may vary based in the language)Payments in BTC every weekend directly to the person Stake's accountIf you are interested in the position, fill the requirements & agree with the payment terms, please drop me a message on Telegram (you can find it in my Bitcointalk Profile) and I will forward you to our current translators in order to do a verification test on your language & grammar skills- No other language is needed for now -",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455532",
  "comments": [
    {
      "author": "coupable",
      "created_time": "June 06, 2023, 10:07:05 PM",
      "body": "Quote from: Carollzinha on June 06, 2023, 09:51:40 PMPayment per English word (the payrate may vary based in the language)Sorry, but how can you evaluate the price of the article according to the number of English words when the article will be written in Russian or Korean? Is there anyone who will work on translating these topics into English later? I mean, if the topics will be published in English, what is the point of creating them in a foreign language in the first place? And if it will be published in one of the two required languages, I do not think that you will work to translate them into English only to determine the price of their creation.Quote from: Carollzinha on June 06, 2023, 09:51:40 PMPayments in BTC every weekend directly to the person Stake's accountI think it is important to indicate whether the accepted candidate will be able to withdraw directly from the casino or must be subject to the terms of use like any other user (100% wagering or be like).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Carollzinha",
      "created_time": "June 06, 2023, 11:16:17 PM",
      "body": "Quote from: coupable on June 06, 2023, 10:07:05 PMQuote from: Carollzinha on June 06, 2023, 09:51:40 PMPayment per English word (the payrate may vary based in the language)Sorry, but how can you evaluate the price of the article according to the number of English words when the article will be written in Russian or Korean? Is there anyone who will work on translating these topics into English later? I mean, if the topics will be published in English, what is the point of creating them in a foreign language in the first place? And if it will be published in one of the two required languages, I do not think that you will work to translate them into English only to determine the price of their creation.This is a reviewer position (for website translations), not an article writer.. sorry if it was not clear in the OP, I changed it a bit, hope it helpsQuote from: coupable on June 06, 2023, 10:07:05 PMQuote from: Carollzinha on June 06, 2023, 09:51:40 PMPayments in BTC every weekend directly to the person Stake's accountI think it is important to indicate whether the accepted candidate will be able to withdraw directly from the casino or must be subject to the terms of use like any other user (100% wagering or be like).Actually it is something around 10% if you are referring to AML Policy but this rule just apply for deposit as far as I know.. as the payments here will be sent through tips, the users should not have any issue",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}