{
  "id": "topic_5456499",
  "title": "rdluffy",
  "author": "rdluffy",
  "created_time": "June 16, 2023, 12:37:55 AM",
  "content": "Já está rolando o burburinho que a BlackRock finalmente irá entrar com o pedido de ETF de BitcoinAinda não se sabe se será spot ou futures, mas possivelmente seria com a Coinbase de parceriaNotícia na Coindesk: https://www.coindesk.com/business/2023/06/15/blackrock-close-to-filing-bitcoin-etf-source/Notícia na Livecoins: https://livecoins.com.br/blackrock-etf-de-bitcoin/O que acham? Mesmo não tendo certeza, quando começa assim, geralmente tem algum fundamento. Será que poderia ser um catalisador pra virar o mercado pra bull? Talvez se der certo, e os EUA não se mostrarem contra o BTC, pode gerar um exemplo para o restante de instituições que querem entrar mas ainda estão segurando...",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456499",
  "comments": [
    {
      "author": "tg88",
      "created_time": "June 16, 2023, 11:30:48 AM",
      "body": "O momento com a SEC parece difícil mas um dia as coisas tendem a começar a melhorar. Em março o CEO da BlackRock divulgou uma carta aos investidores criticando a forma como o governo dos EUA vem atuando para regular cripto e que o país está ficando para trás de outras nações nesse mercado que ele considera uma inovação super importante. Talvez ele tá aproveitando esse momento tão negativo para tentar reverter um pouco as coisas e iniciar uma nova era de produtos regulados pela SEC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "June 16, 2023, 11:03:26 PM",
      "body": "Quote from: tg88 on June 16, 2023, 11:30:48 AM...o governo dos EUA vem atuando para regular cripto e que o país está ficando para trás de outras nações nesse mercado que ele considera uma inovação super importante.Não querendo defender o SEC. Mas que nações são essas, que podem realmente fazer frente aos EUA?A China tem esse mercado quase banido. A Rússia, nem conta, porque a \"guerra\" deles é outra. Na Europa, esta muito atras tecnologicamente e continua a dar poucos sinais de mudança, e nesse campo também tem criado algumas restrições.Sobra quem?El Salvador!? Fraquinho...Brasil!? Os EUA só querem saber da Amazónia e nada mais...Enfim, não vejo como eles estão a ser realmente ultrapassados. E esse é o problema, eles continuarem a sentir que continua a ser o maior e principal mercado. E prova disso são \"terem\" o maior numero de mineradores (ou de hash).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "June 17, 2023, 05:13:21 AM",
      "body": "Será que agora a coisa vai ser diferente? Temos que lembrar que a BlackRock é a maior gestora de investimento do mundo, com mais de $10 trilhões em ativos sob custodia.Curiosamente, a BlackRock já teve 575 ETFs aprovados e apenas 1 negado!! Será que o Bitcoin vai ser o segundo, ou será que tem um motivo para eles finalmente tentarem a aprovação desse ETF? Quote from: joker_josue on June 16, 2023, 11:03:26 PMNão querendo defender o SEC. Mas que nações são essas, que podem realmente fazer frente aos EUA?Dubai? Toda empresa crypto está se instalando lá e quase todo novo crypto-multimilionário escolhe a cidade como sua nova moradia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "June 17, 2023, 07:06:15 AM",
      "body": "Quote from: TryNinja on June 17, 2023, 05:13:21 AMQuote from: joker_josue on June 16, 2023, 11:03:26 PMNão querendo defender o SEC. Mas que nações são essas, que podem realmente fazer frente aos EUA?Dubai? Toda empresa crypto está se instalando lá e quase todo novo crypto-multimilionário escolhe a cidade como sua nova moradia.Mas essas empresas vivem dos negócios que fazem no Dubai ou nos EUA?A questão não é onde a empresa está, mas onde é o negocio delas. É verdade que depois essas empresas deixam de pagar parte dos impostos lá. Mas, o negocio continua a ser feito nos EUA.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "June 17, 2023, 11:22:49 AM",
      "body": "Quote from: tg88 on June 16, 2023, 11:30:48 AMO momento com a SEC parece difícil mas um dia as coisas tendem a começar a melhorar. Em março o CEO da BlackRock divulgou uma carta aos investidores criticando a forma como o governo dos EUA vem atuando para regular cripto e que o país está ficando para trás de outras nações nesse mercado que ele considera uma inovação super importante. Talvez ele tá aproveitando esse momento tão negativo para tentar reverter um pouco as coisas e iniciar uma nova era de produtos regulados pela SEC.A SEC já falou que o bitcoin é uma commodity, acho que eles não devem encrencar. Seria similar a ter um ETF de metais.Quote from: rdluffy on June 16, 2023, 12:37:55 AMO que acham? Mesmo não tendo certeza, quando começa assim, geralmente tem algum fundamento. Será que poderia ser um catalisador pra virar o mercado pra bull? Acho que já estão rolando muitos ETF de bitcoin por aí. O investidor institucional já entrou no bitcoin.Certamente a abertura de um ETF da blackrock daria mais credibilidade e ainda mais nos EUA, e isso poderia atrair ainda mais investidores institucionais. Mas não acho que seja uma grande novidade mais isso não a ponto de uma grande mudança no mercado em termos de preço.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "June 17, 2023, 12:42:13 PM",
      "body": "Quote from: bitmover on June 17, 2023, 11:22:49 AMA SEC já falou que o bitcoin é uma commodity, acho que eles não devem encrencar. Seria similar a ter um ETF de metais.Ué, fiquei um pouco confusa aqui, mas tem vários ETFs de ouro. O que você quer dizer ?Pois bem, @joker_josue esse post acho que tu vai gostar. Ontem vi a teoria da conspiração do Fausto Botelho e lembrei das suas. Vou compartilhar aqui:A teoria da conspiração é que a  BlackRock precisava de um pouco de FUD no mercado para acumular e lançar o primeiro ETF spot de Bitcoin do mundo.Os fatos:- A BlackRock, maior gestora de investimento do mundo pediu a SEC para lançar seu ETF- Não existe ETF spot de Bitcoin no EUA até hoje (só existe de futuros).-  BlackRock tem uma grande participação na Goldman e da MicroStrategy- Gensler trabalhou 18 ano na Goldman Então, por que a BlackRock pediria o ETF exatamente no meio do caos dos processos da SEC contra Binance e coinbase?Aqui as coisas começam a ficar interessantes.@cryptoskullx comentou que a BlackRock está comprando crypto usando a  coinbase: https://twitter.com/cryptoskullx/status/1669418647452827685-Tentaram reviver o FUD do USDT essa semanaOu seja, a BlackRock talvez precise de um FUD para comprar na baixa. E usou a força de uma TRILHÕES de DOLARES para o Gensler soltar o FUD, comprar BTC e ter o ETF aprovado.O que acham?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "June 17, 2023, 12:58:18 PM",
      "body": "Quote from: Disruptivas on June 17, 2023, 12:42:13 PMPois bem, @joker_josue esse post acho que tu vai gostar. Ontem vi a teoria da conspiração do Fausto Botelho e lembrei das suas. Vou compartilhar aqui:Bem... eu gosto as vezes de criar teorias da conspiração, só apenas pela piada... Nunca leve elas muito a serio. Apesar de as vezes fazerem muito sentido, não acha?  Realmente, podia ser uma estratégia interessante. Criar um ETF no meio do caos que está acontecer nos EUA, para atrair investidores. Ou seja, em vez de eles comprarem diretamente BTC como medo que o SEC caia em cima, compra um ETF que foi aprovado pelo SEC.Uma teoria com bastante logica, sem duvida.  Mas, não esquecer que é uma jogada arriscada, pois o podido ser negado, e o SEC cai em cima da BlackRock por causa de investimentos que tenha feito em cripto (não necessariamente em BTC, mas em outras cripto - caso os tenham).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "June 17, 2023, 01:03:11 PM",
      "body": "Quote from: bitmover on June 17, 2023, 11:22:49 AMA SEC já falou que o bitcoin é uma commodity, acho que eles não devem encrencar. Seria similar a ter um ETF de metais.No passado encrencaram bastante afirmando que poderia ser um mercado manipulado ou com fraudes, citaram as questões da Tether... Mas vamos ver agora quem está do outro lado é a BlackRock e ter mais de 10 trilhões sob gestão as vezes ajuda um pouco nessas decisões \"técnicas\". Curioso para ver o desfecho desse pedido.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "June 17, 2023, 01:10:55 PM",
      "body": "Quote from: Disruptivas on June 17, 2023, 12:42:13 PMQuote from: bitmover on June 17, 2023, 11:22:49 AMA SEC já falou que o bitcoin é uma commodity, acho que eles não devem encrencar. Seria similar a ter um ETF de metais.Ué, fiquei um pouco confusa aqui, mas tem vários ETFs de ouro. O que você quer dizer ?Quero dizer que sair mais um etf não será disruptivo. Se sair mais um etf de ouro, você acha que o preço vai multiplicar por 3x?QuoteOu seja, a BlackRock talvez precise de um FUD para comprar na baixa. A blackrock não será dona dos btc, será apenas custodiante.  Para a blackrock é indiferente comprar na alta ou na baixa, o dinheiro dela vem exclusivamente das taxas de adm. Ela não faz trade. É uma gestora passiva.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "June 17, 2023, 02:44:47 PM",
      "body": "Quote from: tg88 on June 16, 2023, 11:30:48 AMO momento com a SEC parece difícil mas um dia as coisas tendem a começar a melhorar. Em março o CEO da BlackRock divulgou uma carta aos investidores criticando a forma como o governo dos EUA vem atuando para regular cripto e que o país está ficando para trás de outras nações nesse mercado que ele considera uma inovação super importante. Talvez ele tá aproveitando esse momento tão negativo para tentar reverter um pouco as coisas e iniciar uma nova era de produtos regulados pela SEC.Isso pra mim está bem claro, não sei se é só a atual gestão do EUA, ou se vai se manter assim por muito tempo, mas vai ficar pra trás simQuote from: joker_josue on June 16, 2023, 11:03:26 PMNão querendo defender o SEC. Mas que nações são essas, que podem realmente fazer frente aos EUA?Realmente muitas outras também estão dificultando, como você mesmo disse, mas acho que há uma boa possibilidade de Hong Kong estair atraindo as empresas que estão saindo dos EUA para virar um polo das criptos.Ainda há outros países que não estão assim hostis como Coréia, Japão...Quote from: TryNinja on June 17, 2023, 05:13:21 AMSerá que agora a coisa vai ser diferente? Temos que lembrar que a BlackRock é a maior gestora de investimento do mundo, com mais de $10 trilhões em ativos sob custodia.Curiosamente, a BlackRock já teve 575 ETFs aprovados e apenas 1 negado!! Será que o Bitcoin vai ser o segundo, ou será que tem um motivo para eles finalmente tentarem a aprovação desse ETF? Essa é uma esperança, as chances são enormes. Estranho é o timing, devido ao SEC + Binance + CoinbaseQuote from: bitmover on June 17, 2023, 11:22:49 AMAcho que já estão rolando muitos ETF de bitcoin por aí. O investidor institucional já entrou no bitcoin.Certamente a abertura de um ETF da blackrock daria mais credibilidade e ainda mais nos EUA, e isso poderia atrair ainda mais investidores institucionais. Mas não acho que seja uma grande novidade mais isso não a ponto de uma grande mudança no mercado em termos de preço.Isso que eu acredito. Eu sei que não tem muito motivo para comemorar já que a BlackRock não seria positiva para o BTC em praticamente nada. Mas esse aspecto de dar confiança deve funcionar. As outras empresas podem olhar e falar, olha, a maior gestora do mundo está trabalhando com BTC, nós também podemos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l3pox",
      "created_time": "June 17, 2023, 04:44:37 PM",
      "body": "Quote from: joker_josue on June 16, 2023, 11:03:26 PMQuote from: tg88 on June 16, 2023, 11:30:48 AM...o governo dos EUA vem atuando para regular cripto e que o país está ficando para trás de outras nações nesse mercado que ele considera uma inovação super importante.Não querendo defender o SEC. Mas que nações são essas, que podem realmente fazer frente aos EUA?A China tem esse mercado quase banido. A Rússia, nem conta, porque a \"guerra\" deles é outra. Na Europa, esta muito atras tecnologicamente e continua a dar poucos sinais de mudança, e nesse campo também tem criado algumas restrições.Sobra quem?El Salvador!? Fraquinho...Brasil!? Os EUA só querem saber da Amazónia e nada mais...Enfim, não vejo como eles estão a ser realmente ultrapassados. E esse é o problema, eles continuarem a sentir que continua a ser o maior e principal mercado. E prova disso são \"terem\" o maior numero de mineradores (ou de hash).Talvez a galera dos polos tecnológicos tipo sei la… Singapura?Talvez Suiça?Gostei da pergunta. Curioso para ver as respostasTambém achei o timing estranho mas essas noticias costumam levar tempo. Provavelmente esse processo já está rolando faz meses e só veio à público agora",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "June 17, 2023, 11:29:00 PM",
      "body": "Quote from: Lucasgabd on June 17, 2023, 04:44:37 PMTalvez Suiça?Suíça!?Não. A Europa esta muito atras a nível tecnológico. Existe muito poucas empresas de desenvolvimento tecnológicas europeias.Tens a Nokia e pouco mais. Talvez podemos falar da Siemens ou da Philips.E mesmo assim, essas empresas a nível de TI pouco tem desenvolvido.Isso não quer dizer que a Europa esteja atrasada tecnologicamente, apenas não tem empresas capazes de rivalizar com as dos EUA, Japão, Coreia do Sul e China.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "June 18, 2023, 04:44:46 PM",
      "body": "Quote from: joker_josue on June 17, 2023, 12:58:18 PMMas, não esquecer que é uma jogada arriscada, pois o podido ser negado, e o SEC cai em cima da BlackRock por causa de investimentos que tenha feito em cripto (não necessariamente em BTC, mas em outras cripto - caso os tenham).Considerando ali o dado que o Ninja trouxe, sobre  575 ETFs aprovados e apenas 1 negado, não parece tão provável a negativa. E acho que o risco pra eles nesse caso não seria tão grande visto que eles já precisariam compreender e analisar os casos desses 575 então sem duvida entendem bem os pormenores. Inclusive fui procurar aqui qual tinha sido esse único não aprovado, e foi o caso de um ETF que era gerenciado ativamente, mas que não seriam obrigados a divulgar suas participações diariamente e que seriam menos transparentes. Pareceu um caso bem extremo. Quote from: bitmover on June 17, 2023, 01:10:55 PMQuero dizer que sair mais um etf não será disruptivo. Se sair mais um etf de ouro, você acha que o preço vai multiplicar por 3x?A blackrock não será dona dos btc, será apenas custodiante.  Para a blackrock é indiferente comprar na alta ou na baixa, o dinheiro dela vem exclusivamente das taxas de adm. Ela não faz trade. É uma gestora passiva.Ué, mas não existem ETFs spots de Bitcoin no EUA, por isso é um fato interessante. Ainda mais considerando o timming. Agora sobre essa questão da compra, não sei em detalhes como ocorre, no video do Fausto Botelho ele comenta que quem pede as aprovaçoes precisam ter já os fundos. Então quao mais baixo o preco medio, melhor seria",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "June 19, 2023, 12:57:54 AMLast edit: June 19, 2023, 09:33:25 AM by bitmover",
      "body": "Quote from: Disruptivas on June 18, 2023, 04:44:46 PMAgora sobre essa questão da compra, não sei em detalhes como ocorre, no video do Fausto Botelho ele comenta que quem pede as aprovaçoes precisam ter já os fundos. Então quao mais baixo o preco medio, melhor seriaEles vão fazer uma oferta publica (igual uma ipo) e quem irá comprar são outras pessoas e empresas. Eles teram uma exposição mínima ao btc , se tiverem.Subir ou descer o preço não faz diferença pra eles. Assim q o mercado financeiro faz dimdim, taxas de adm.Ganham na subida ou descida ou estável, indiferente pra eles. O que importa é o valor em custódia",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "June 19, 2023, 06:42:32 PM",
      "body": "Tem mais uns rumores, agora que a Fidelity também estaria aplicando para um ETF spot de BitcoinFonte: https://twitter.com/BitcoinMagazine/status/1670762619677085697",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "June 19, 2023, 07:53:25 PM",
      "body": "Quote from: rdluffy on June 19, 2023, 06:42:32 PMTem mais uns rumores, agora que a Fidelity também estaria aplicando para um ETF spot de BitcoinBem, isso seria incrível, uma das maiores empresas de investimentos do mundo, ter um ETF de Bitcoin.Este tipo de soluções, só trás maior rentabilidade a quem já está mesmo no Bitcoin, porque pode gerar aumentos estáveis de valorização.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "June 20, 2023, 12:18:15 AM",
      "body": "Outra coisa que vem acontecendo ao mesmo tempo é que o famoso Grayscale Bitcoin Trust (GBTC) vem se valorizando nos últimos dias e atingiu um ágio negativo de \"apenas\" -36,6% oque por mais incrível que pareça é o ATH de 2023 em termos de correlação com o preço real do BTC. Muitos analistas estão falando que a aprovação do ETF da BlackRock pode beneficiar o GBTC a atingir novamente a sua paridade mas eu confesso que não entendi a lógica.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "June 20, 2023, 09:42:22 AM",
      "body": "Quote from: tg88 on June 20, 2023, 12:18:15 AMOutra coisa que vem acontecendo ao mesmo tempo é que o famoso Grayscale Bitcoin Trust (GBTC) vem se valorizando nos últimos dias e atingiu um ágio negativo de \"apenas\" -36,6% oque por mais incrível que pareça é o ATH de 2023 em termos de correlação com o preço real do BTC. Muitos analistas estão falando que a aprovação do ETF da BlackRock pode beneficiar o GBTC a atingir novamente a sua paridade mas eu confesso que não entendi a lógica.Um etf sempre tem paridade pq eles podem criar/ remover cotas de acordo com o volume. Não sei exatamente como funciona, mas isso permite que o etf sempre tenha paridade de preço com o ativo, não acontecendo o que acontece com o fundo grayscale. Grayscale quer se tornar um etf há muitos anos  mas a sec nunca aprovou. Agora, com a entrada da blackrock, eles estão com novos ânimos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "June 20, 2023, 11:09:55 AM",
      "body": "Quote from: bitmover on June 20, 2023, 09:42:22 AMGrayscale quer se tornar um etf há muitos anos  mas a sec nunca aprovou. Agora, com a entrada da blackrock, eles estão com novos ânimos.Mas como funciona esse fundo da Grayscale?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}