{
  "id": "topic_5472093",
  "title": "alastantiger",
  "author": "alastantiger",
  "created_time": "October 29, 2023, 01:09:16 PM",
  "content": "I consider this year in terms of betting to be over. I have had some pretty decent wins. However, one mistake I made was not starting this year with a betting goal, which would have been the specific amount of money I intended to win. Instead, I began the year with the goal of gambling responsibly, and I'd rate myself around 80% in achieving that.I am sharing my sports betting goal for next year with the gambling community because I highly value your insights and seek advice for any adjustments. I hope to gain expert advice. My goal for next year is to generate $50,000 through betting. Here are the strategies I plan to employ:First, I will make every available promotion, bonus, arbitrage opportunity, injury information, and stale lines..Second, I will take advantage of various accessible sportsbooks, which may include legal, offshore, or local options based on jurisdictional regulations.Third, I will carefully build a bankroll that involves a selective approach to low-cost, high-potential profit angles to mitigate the risks associated with betting swingsFourth, I will evaluate the expected value (EV) of each betting angle because achieving my $50,000 goal requires realistic assessments and potentially exploring new, uncharted angles.Fifth, I will leverage my networks to maximize potential profits.What are your thoughts on these strategies to assist me in achieving my $50,000 betting goal by 2024?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472093",
  "comments": [
    {
      "author": "Don Pedro Dinero",
      "created_time": "October 29, 2023, 01:29:22 PM",
      "body": "There is one thing I do not understand.Quote from: alastantiger on October 29, 2023, 01:09:16 PMMy goal for next year is to generate $50,000 through betting. Here are the strategies I plan to employ:<...>What are your thoughts on these strategies to assist me in achieving my $50,000 betting goal by 2024?Do you want to wager a total of $50,000 or do you want to win or build up a bankroll of $50,000 in the year 2024? These are two very different things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "October 29, 2023, 01:37:40 PM",
      "body": "Op, in this your quest to try to achieve $50,000 through betting make sure you don’t forget that gambling is not meant to earn passive income, it should be done for fun. I don’t know if your strategy would work or not but my little piece of advice is that you don’t lose yourself to gambling during the course of trying to tweak some of your plans and eventually gets overwhelmed by your expectations—- And it should also be noted that goals like this if not properly handled could lead to addiction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "October 29, 2023, 01:42:16 PM",
      "body": "Quote from: Cantsay on October 29, 2023, 01:37:40 PMOp, in this your quest to try to achieve $50,000 through betting make sure you don’t forget that gambling is not meant to earn passive income, it should be done for fun. I don’t know if your strategy would work or not but my little piece of advice is that you don’t lose yourself to gambling during the course of trying to tweak some of your plans and eventually gets overwhelmed by your expectations—- And it should also be noted that goals like this if not properly handled could lead to addiction.Yes, that is another part to debate, and more so when the OP itself says:Quote from: alastantiger on October 29, 2023, 01:09:16 PMInstead, I began the year with the goal of gambling responsibly, and I'd rate myself around 80% in achieving that.Not playing responsibly 20% of the time and setting a big goal can end up backfiring and blowing a big hole in your head. Metaphorically speaking, of course, I mean a hole in your finances.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "October 29, 2023, 01:43:17 PM",
      "body": "Quote from: alastantiger on October 29, 2023, 01:09:16 PMWhat are your thoughts on these strategies to assist me in achieving my $50,000 betting goal by 2024?OP you seem to have a good strategy to actualize your goal of making $50,000 next year. But gambling is not a business and the profit that can be derived from it is unpredictable. It is good to have a gambling plan but predicting your yearly turnover can have some consequences. It could lead to loss chasing and over-gambling. It could also lead to anxiety and unnecessary tension caused by the drive to meet your yearly targeted profit. It is better to enjoy gambling and peacefully accept the returns you get from it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "October 29, 2023, 01:43:48 PM",
      "body": "Quote from: alastantiger on October 29, 2023, 01:09:16 PMI consider this year in terms of betting to be over. I have had some pretty decent wins. However, one mistake I made was not starting this year with a betting goal, which would have been the specific amount of money I intended to win. Instead, I began the year with the goal of gambling responsibly, and I'd rate myself around 80% in achieving that.What I see is that because you gamble responsibly this year, you make profit from gambling, but which you think is not enough and thinking you can make up to or more than $50000 next year. I will advise you not to think like that, this will only lead you to irresponsible gambling and losses may follow.You have a way that you are gambling now and you are making little amount of money, stick to it and continue to gamble responsibly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "October 29, 2023, 01:49:14 PM",
      "body": "Quote from: alastantiger on October 29, 2023, 01:09:16 PMI consider this year in terms of betting to be over. I have had some pretty decent wins. However, one mistake I made was not starting this year with a betting goal, which would have been the specific amount of money I intended to win. Instead, I began the year with the goal of gambling responsibly, and I'd rate myself around 80% in achieving that.I am sharing my sports betting goal for next year with the gambling community because I highly value your insights and seek advice for any adjustments. I hope to gain expert advice. My goal for next year is to generate $50,000 through betting. Here are the strategies I plan to employ:First, I will make every available promotion, bonus, arbitrage opportunity, injury information, and stale lines..Second, I will take advantage of various accessible sportsbooks, which may include legal, offshore, or local options based on jurisdictional regulations.Third, I will carefully build a bankroll that involves a selective approach to low-cost, high-potential profit angles to mitigate the risks associated with betting swingsFourth, I will evaluate the expected value (EV) of each betting angle because achieving my $50,000 goal requires realistic assessments and potentially exploring new, uncharted angles.Fifth, I will leverage my networks to maximize potential profits.What are your thoughts on these strategies to assist me in achieving my $50,000 betting goal by 2024?        -   Is your goal that you say about the $50,000 to generate a winning income in casino gambling here in the crypto business, or is that the sum of your estimated amount for the whole year?Because if that is your target to be able to generate income within a year, that is already a big target for income that can be obtained from a casino platform that you will be gambling on. Now, if that is the sum of what you gamble, for me, that amount is quite large that you will lose if ever, which is not practical for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "October 29, 2023, 01:57:50 PM",
      "body": "If you want to achieve 50.000 dollars wins from sport betting then it is not that difficult based on your starting bankroll that you may have,for example in here I have seen some people long before claiming to have a thread to make 10 dollars go to 1 million dollars and none of these guys I assume is still with us as I have not seen them here anymore.If you have like 1000-5000 dollars starting bankroll then achieving 50.000 dollars is not difficult you just need to hit some nice parlays during the weekend where most games are played and that amount can be reached real soon.If you have a small starting bankroll it will be much more difficult to win 50.000 dollars but of course not at all impossible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "October 29, 2023, 02:01:22 PM",
      "body": "Quote from: alastantiger on October 29, 2023, 01:09:16 PM-snip-Having a target goal for the year will just give you pressure when you are betting especially when you lose some of your bet since you might be force to chase loss just to catch up with your quota. I don’t want this kind of gambling since it’s like giving yourself a task to always win while you are playing a game with high risk.The purpose of gambling is to have fun since there’s no guarantee profit when you are playing. It’s not a job which you can save consistent money from your salary that makes this goal achievable when you hardwork. Gambling is based on luck which means you have no complete control on what will be the outcome of your game in the whole year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mirakal",
      "created_time": "October 29, 2023, 02:04:36 PM",
      "body": "I'd like to start by asking how much is your total bankroll?I mean, $50k is a substantial amount of money, though it's achievable in gambling, the odds are relatively small if you don't have a decent bankroll. Let's be realistic here. While I believe there are successful gamblers who make a living from it, they typically don't start with $1,000 and end up with $50,000 by the end of the year. That's quite unattainable for most, which is why I'm curious about your total bankroll.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2Pizza410000BTC",
      "created_time": "October 29, 2023, 02:07:11 PM",
      "body": "Quote from: alastantiger on October 29, 2023, 01:09:16 PMI consider this year in terms of betting to be over. I have had some pretty decent wins. However, one mistake I made was not starting this year with a betting goal, which would have been the specific amount of money I intended to win. Instead, I began the year with the goal of gambling responsibly, and I'd rate myself around 80% in achieving that.I am sharing my sports betting goal for next year with the gambling community because I highly value your insights and seek advice for any adjustments. I hope to gain expert advice. My goal for next year is to generate $50,000 through betting. Here are the strategies I plan to employ:~Snip~What are your thoughts on these strategies to assist me in achieving my $50,000 betting goal by 2024?OP I don't know how successful your plan will be. But till date no one has ever succeeded in planning like you. By making promises like yours thousands of people have become addicted to gambling platforms and at one point they have completely ruined their lives. Actually those of us who participate in gambling platforms mainly participate as entertainment although here we have a target to earn. On that day I was sure in the 15th match of ODI Cricket World Cup 2023 match between South Africa and Netherlands as South Africa has many formats in this match so I participated in betting for South Africa as a result I failed to bet there. From here it can be considered that nothing can ever be said for sure on gambling platforms. Any incident can happen at any moment. But I'm sure you'll fail to reach the conclusion you've reached.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "October 29, 2023, 02:07:40 PM",
      "body": "That's a lot of money to target and probably requires a good capital too.I think you already have a good plan ahead and a strategy, all you can do now is to implement it and adjust along the way.There's no assurance in gambling even if it's on betting, so make sure that your strategy is flexible and your target is realistic based on your bankroll. Betting can be more fun and rewarding, having patience and a good strategy is advisable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "October 29, 2023, 02:09:23 PM",
      "body": "The amount is really a big one, and that's a large target that you have chosen to meet at the end of 2024, but my question here is: how much are you willing to wager all through 2024 in order to achieve this goal? You have a good strategy that will help you minimise your losses, and you also have to set up a bankroll target, but when you have used up all of your budgets and there seems to be a negative result, what will you do? Will you continue by first breaking your own principles in order to meet your targets? If yes, then before you even get close to achieving that goal, you might have spent more than or close to that amount all over your wagers. Another thing is that being overconfident in gambling and having a winning target at the end of 2024 might also end up putting you in a disappointing stage. This is because we can never be too sure of the result we will get from our games all the time. If luck is not on our side, nothing we predict can even work according to plan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "October 29, 2023, 02:13:05 PM",
      "body": "Gambling in shitcoins is better than gambling in someone house, but the best is invest in Bitcoin... if we talk about making money.Even you've take advantage over everything e.g. bonus, rakeback, promotion, VIP rewards etc it will not going make you have a sure win in the long run. Remember martingale strategy should be work base on calculation, but the reality most of people lose due to insufficient of bankroll.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noormcs5",
      "created_time": "October 29, 2023, 02:17:43 PM",
      "body": "Quote from: alastantiger on October 29, 2023, 01:09:16 PMWhat are your thoughts on these strategies to assist me in achieving my $50,000 betting goal by 2024?I think that you need to tell us how much money will you allocate for gambling in the year 2024. We don't know if this target is realistic or not because we do not know how much money you will be using for the betting. If you have anything between $20,000 to $30000 for wagering, then this may be achievable but if you have a supposed 1,000$ to 2000$ gambling portfolio, then I think you need to stretch a lot in order to get this target considering the risk involved in gambling, you may not achieve this target at all.Anyways, i wish you the best of luck and i would like that you keep on telling us your progress from time to time as to what you have managed to achieve and where are you standing in terms of your 50,000$ goal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Japinat",
      "created_time": "October 29, 2023, 02:26:26 PM",
      "body": "Quote from: alastantiger on October 29, 2023, 01:09:16 PMFirst, I will make every available promotion, bonus, Yes, you can find this opportunity if you are an active gambler, and considering the $50k target, it's safe to assume you have a substantial amount of money to risk, which makes you more eligible for the rewards and bonuses.Quote from: alastantiger on October 29, 2023, 01:09:16 PMarbitrage opportunity,You'll probably find 1 of 10k bets an arbitrage opportunity, this is easier said that done as bookies now are just probably getting from the same bookmakers, so it's a tough job to find this opportunity. This is free moeny actually as you could just end up break even or you win. But good luck with that.Quote from: alastantiger on October 29, 2023, 01:09:16 PM injury information, and stale lines..Pretty basic my friend, you'll find a lot of information regarding this from difference sources, if you are into huge target, this should be your priroity and as you become a a good sports handicapper and casino player, the chances  of winning will increase overtime.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "October 29, 2023, 02:29:51 PM",
      "body": "There's really nothing much I could add since you probably performed better than me already. I think you've got everything in place so maybe some trial and error with parlays could help and also try to grow your network. Do you join casino sponsored competitions exclusive for bitcointalk members as well? I've seen some in games and rounds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "October 29, 2023, 02:33:22 PM",
      "body": "Quote from: alastantiger on October 29, 2023, 01:09:16 PMMy goal for next year is to generate $50,000 through betting.What are your thoughts on these strategies to assist me in achieving my $50,000 betting goal by 2024?$50,000 is a huge amount and making a life saving as $50,000 from small gambling capital is like impossible. It can be one super lucky bet and win big but it is nearly impossible, barely happens.I know what you want to do is not this, but bet and win with your strategy and making your capital up with time. You did not share what is your capital for starting so it's hard to say. If it is big capital, so why have to gamble?If it is a small capital, I think your target is unreachable if excluding super lucky bet with high multiplier.I would like to bet with altcoins like Dogecoin, Ethereum Classic and Litecoin. Taking profit with Bitcoin in a next bull run and jump to those altcoins. Profit will come and I don't have to face with risk of lost bets in gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "October 29, 2023, 02:34:21 PM",
      "body": "Quote from: alastantiger on October 29, 2023, 01:09:16 PMWhat are your thoughts on these strategies to assist me in achieving my $50,000 betting goal by 2024?At least you have the guts to place a bet, whatever you want to do, the decision is all in your hands, but I'm just saying that all the strategies you want to do one to five, have probably already been done by other people, whether they managed to win up to $50k or not.However, my advice is that if you focus only on betting on sports games, if you can, try betting normally like other people generally do, the point is: you really master what you are betting on, for example: teams, players and other situations that are related to the sport, I am sure you can succeed in achieving your dreams, rather than having to place a large bet on one match hoping to win multiplied by a large amount.But I support what you want to do, to take advantage of all available bonus sources, the point is: stay thorough, be careful, consider, don't hesitate, control your greed and emotions before you bet, do it wisely.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goinmerry",
      "created_time": "October 29, 2023, 02:38:54 PM",
      "body": "Quote from: alastantiger on October 29, 2023, 01:09:16 PMMy goal for next year is to generate $50,000 through betting. If I understood this right, the goal is to make a $50,000 \"profit\" right? Does that amount include the bankroll? Or simply, just to reach a $50,000 overall balance? Will you do sports betting only or also test your luck at casino games or whatever available gambling games you will encounter? Anyway, that surely be a tough challenge within 365 days. I do expect that you have a decent bankroll to start as your goal is a decent amount too. You might be pressured to reach that goal instead of just being comfortable with your betting activity by keeping and sustaining your winning rate over your losing rate. My advice is, well, just be on yourself as a bettor. Be wise in choosing odds and don't jump betting on the matches you are not familiar with.Good luck mate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}