{
  "id": "topic_5446677",
  "title": "johnkaminski",
  "author": "johnkaminski",
  "created_time": "March 28, 2023, 06:20:35 PM",
  "content": "https://i.imgur.com/zPfqNhT.jpegHi everyone,I'm selling database of Gambling Players leads  (8619 Players)  2022Source: Site : http://137.184.251.242/File Format :  JSONUnmerged JSON : 88 filesRecords contain: id, usrname, name, email, phone, createdDate, balance and more....Sample: https://0bin.zertrin.org/paste/KnHzfguC#IpevSiEgF6ZIWD4h8HYZFY6Q4-PFBRKW7E5WdFarXTDPrice : $250Payment: BTC and other CryptoMiddleman AcceptedContact -> Via forum PM or click this Telegram link https://t.me/blackhatwrld or See my Signature",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446677",
  "comments": [
    {
      "author": "Hispo",
      "created_time": "March 28, 2023, 07:15:44 PM",
      "body": "Hello, and welcome to be forum.I am not sure how many people would feel interested in this offer of yours, because two reasons:Did you obtain that data in a legal way? Because the first thing that comes to mind is that someone could have used an exploit to get access to that information or it is being shared without the consent of the casino.Assuming that you got that information in a legal way and everything seems to be in order, how do we know that information is real and has not been counterfeited? I am not very savvy on software but I assume a JSON can be forged.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "March 29, 2023, 12:56:20 PM",
      "body": "OP people might assume you are a hacker by this act of yours in selling people's gambling data. This is why most times I do it like the idea of casinos conducting KYC because from what I can see now based on your post, it is likely you guys this data from hack activities or you bought it from an insider or maybe possibly the dark market. How am I sure that this link you dropped here for us to access through is not a possible means of getting through to our devices to stealing our information fir sales.Lastly, are you selling the whole files for just $250 or your are selling per account at that price?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "johnkaminski",
      "created_time": "March 30, 2023, 12:54:58 PM",
      "body": "Quote from: Hispo on March 28, 2023, 07:15:44 PMHello, and welcome to be forum.I am not sure how many people would feel interested in this offer of yours, because two reasons:Did you obtain that data in a legal way? Because the first thing that comes to mind is that someone could have used an exploit to get access to that information or it is being shared without the consent of the casino.Assuming that you got that information in a legal way and everything seems to be in order, how do we know that information is real and has not been counterfeited? I am not very savvy on software but I assume a JSON can be forged. Hey thanks for the comments. To answer your questions, the data was surely extracted by someone who has an access to casino's database. Was is done withthe knowledge of the casino I doubt it. Would I hesitate  to use it for email marketing or sms campaigns? Not at all as long this can generate income. Also I'm more than happy to provide sample before purchase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "johnkaminski",
      "created_time": "March 30, 2023, 01:02:58 PM",
      "body": "Quote from: CryptSafe on March 29, 2023, 12:56:20 PMOP people might assume you are a hacker by this act of yours in selling people's gambling data. This is why most times I do it like the idea of casinos conducting KYC because from what I can see now based on your post, it is likely you guys this data from hack activities or you bought it from an insider or maybe possibly the dark market. How am I sure that this link you dropped here for us to access through is not a possible means of getting through to our devices to stealing our information fir sales.Lastly, are you selling the whole files for just $250 or your are selling per account at that price?Hi, whole database is for the cheap price of $250",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "March 30, 2023, 06:43:31 PM",
      "body": "I highly doubt if any one would be interested in buying such a data, though it could be of good benefit to those who are interested in finding new users for a casino, but then, how exactly can one verify that those data are genuine, and that they belong to real people, not something that was taken time to cook up in other to obtain money from desperate and unsuspecting victims?.I am clearly not interested, maybe you should try contacting some casinos directly, most especially New ones, they are the ones who would be most interested on such data, this is if there is a way for them to verify that the data is genuine and still market relevant.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "March 30, 2023, 07:05:38 PM",
      "body": "If the list was verified and legit, then it might be worth buying for someone running a casino. The fact that it cannot be verified makes it kinda worthless IMO. Could just be giving away $250 to someone who had an idea for a fast scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "len01",
      "created_time": "March 31, 2023, 01:57:16 AM",
      "body": "simply explained by @yahoo62278 and with a few additional questions from me, if the list is retrieved by someone from the casino database with the knowledge of the casino itself, how can the casino release some personal data of its users when it is very dangerous for the casino itself?so, what if this is a scam? I mean I'm not accusing you of being a fraud but here you are using a newbie account without any reputation and without using escrow from the forum, do you have a money back guarantee if it's not the same as what you said?this is actually not wrong when selling personal data to casino owners to make promotional offers at certain casinos. so maybe this thread has more to offer casino owners. maybe",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eureka_07",
      "created_time": "March 31, 2023, 02:36:08 AM",
      "body": "Quote from: johnkaminski on March 28, 2023, 06:20:35 PM<snip>Is there any way for you to prove to your clients that those extracted data are legitimate?Also is this kind of transaction is allowed here on our forum? I mean, all data was obviously got without the consent of the casino as well as the players'. Generally, it violates privacy laws.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "worldofcoins",
      "created_time": "April 03, 2023, 09:04:21 PM",
      "body": "It is not ethical or legal to sell personal information or data without the explicit consent of the individuals involved. Furthermore, it is against the terms and policies of many websites and online platforms to collect and sell user data. Respecting people's privacy and avoiding any actions that could harm or violate their rights is essential.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "April 03, 2023, 09:26:39 PM",
      "body": "Quote from: worldofcoins on April 03, 2023, 09:04:21 PMIt is not ethical or legal to sell personal information or data without the explicit consent of the individuals involved. Furthermore, it is against the terms and policies of many websites and online platforms to collect and sell user data. Respecting people's privacy and avoiding any actions that could harm or violate their rights is essential.If not hack how did OP got these details and putting them up for sales without the consent of the owners of the account and what baffles me most is that there are still people out there that would still by  them and still use it for their activities. This might likely be amongst the reasons why casino keep suspending  and banning accounts and would not say it but would give another reasons why they got accounts banned or suspended because if they do tell it as it is, they might tend to loose customers because it otherwise tells that their security systems are not strong enough to detect such act by holders who sell their accounts o possible hack into their data base to steal details of their customers. I believe these accounts as stated by OP falls into the same category.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Newlifebtc",
      "created_time": "April 03, 2023, 09:54:47 PM",
      "body": "I don't trust op for this particular statement I think I went looking at this point of hope you can see that it is contradictory you don't know if you will say that it is a scammer or either a hacker the way it's statement or what so it is somehow contradictory",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "April 03, 2023, 10:06:02 PM",
      "body": "Quote from: Newlifebtc on April 03, 2023, 09:54:47 PMI don't trust op for this particular statement I think I went looking at this point of hope you can see that it is contradictory you don't know if you will say that it is a scammer or either a hacker the way it's statement or what so it is somehow contradictoryYou would have taken a step further to atleast, say the statement which you think is contradictory.And by the way, whether a scammer or a hacker, both involves stealing money and personal datas of people and using it against them..If we are to dive into where op got the data he wants to sell from, I think that should be a topic for another day, but if I must touch on It a little , I would say that it is actually not a must that op be a scammer or hacker before he can obtain such data, there is also the possibility that op once owned a casino that maybe has failed, and this data are datas he obtained from users who kyced on the casino at the time the casino was still functional.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "April 03, 2023, 10:20:13 PM",
      "body": "If it's from someone who works for that casino and just took it without the casino's permission then that's data stealing. And if it's even put up for sale for a \"cheap\" price as you say, that's illegal. But either way, it's illegal or legal, someone could buy as said by yahoo that it can be just random email addresses that weren't verified its authenticity.Quote from: worldofcoins on April 03, 2023, 09:04:21 PMIt is not ethical or legal to sell personal information or data without the explicit consent of the individuals involved. Illegal as it's stealing and without consent breaches some laws about data privacy. This is happening in many countries and companies but law enforcement has a hard time dealing with all of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}