{
  "id": "topic_5417150",
  "title": "seoincorporation",
  "author": "seoincorporation",
  "created_time": "October 14, 2022, 09:24:59 PM",
  "content": "La semana pasada se estableció un nuevo Récord guienes sobre \"La clase sobre bitcoin más grande del mundo\". A la cual acudieron 289 personas. La clase no fue en la ciudad principal, sino que fue en la ciudad de Monterrey, Y al finalizar la clase se presentó un video de el fundador de Binance.Fuente: https://www.criptonoticias.com/comunidad/bitcoin-marco-record-guinness-mexico/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417150",
  "comments": [
    {
      "author": "d5000",
      "created_time": "October 14, 2022, 11:17:33 PM",
      "body": "¿289 personas la clase más grande del mundo? Parece algo poco  (Aunque claro, era presencial.)Hace unas semanas fui a un evento sobre Bitcoin y criptomonedas en el cual hubo alrededor de 300-400 personas (en un mismo momento). Pero no era una clase, más bien una conferencia.Pero claro:QuoteLas reglas para los oyentes de la clase eran claras: debían prestar atención a la ponencia sin distraerse ni levantarse durante los aproximadamente 45 minutos que duró.Fuente CriptonoticiasEso no fue el caso en el evento al que asistí. Así que será cierta la noticia",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "October 15, 2022, 03:57:51 AM",
      "body": "Espero que el próximo record que vea sobre Bitcoin en tierras Mexicanas sea algo relacionado con la tasa de hash, el volumen de comercio o el número de usuarios holdeando.Pero por ahora me puedo conformar con saber que poco a poco las personas se están informando un poco de este mundo, es necesario, solo así se vencen a los scammers. Ahora que lo pienso, tengo un buen tiempo que no me entero del estado de Bitcoin en Mexico, la última vez que leí algo fue el como Bitcoin aún estaba peleando un poco para librarse del estigma de ser asociado de forma indirecta con actividades ligadas al narcotráfico. Si alguno tiene un artículo actualizado sobre la adopción en Mexico (y de una fuente medianamente confiable) le invito a compartirlo por aquí.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "October 15, 2022, 11:20:09 AM",
      "body": "Quote from: Hispo on October 15, 2022, 03:57:51 AMSi alguno tiene un artículo actualizado sobre la adopción en Mexico (y de una fuente medianamente confiable) le invito a compartirlo por aquí.  Según noticia de ayer mismo, parece que una senadora por el Estado de Nuevo León apuesta por el carácter \"transitorio\" del peso mexicano digital. Si bien no prevé que el BTC se convierta en moneda de curso legal, como en El Salvador, al menos de manera inmediata, sí que habla en términos muy positivos sobre la criptomoneda. Habrá que ver si mantiene los términos en el futuro.Fuente: https://es.cointelegraph.com/news/indira-kempis-bitcoin-represents-a-new-latin-american-revolution",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "October 15, 2022, 12:45:51 PM",
      "body": "Estoy convencido, aunque sin pruebas, de que han habido MasterClasses con mayor número de asistentes que las 289 personas contabilizadas. Otra cosa es que se algunos sean más espabilados que otros en registrar el record conforme a las reglas de la entidad, con los inspectores mediante, y llevándose como premio el poder añadir el record en su haber como currículum corporativo.No acabo de ver qué pasó con la \"extensa fila con miles de personas asistentes a la lección se formaba a la puerta de entrada\" que cita el artículo. O bien no entraron más que un conjunto delimitado de personas al recinto donde se llevó a cabo la clase, o bien algo así como tan sólo una cuarta parte fue capaz de converger con las reglas de prestar atención sin distraerse durante la clase, lo cual denotaría algo que preferiría no interpretar.En todo caso, como digo, tiene un valor como componente de explotación en términos de márketing, que no de hito de verdadero valor.Quote from: Hispo on October 15, 2022, 03:57:51 AM<…> Si alguno tiene un artículo actualizado sobre la adopción en Mexico (y de una fuente medianamente confiable) le invito a compartirlo por aquí.  Secundo la petición. En este hilo se intenta interpretar los Tweets de Indira, pero faltarían aportes al respecto con conocimiento de causa sobre el terreno (en este caso, sobre las posibilidades reales de adopción).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "October 15, 2022, 02:28:46 PM",
      "body": "Quote from: DdmrDdmr on October 15, 2022, 12:45:51 PMQuote from: Hispo on October 15, 2022, 03:57:51 AM<…> Si alguno tiene un artículo actualizado sobre la adopción en Mexico (y de una fuente medianamente confiable) le invito a compartirlo por aquí.  Secundo la petición. En este hilo se intenta interpretar los Tweets de Indira, pero faltarían aportes al respecto con conocimiento de causa sobre el terreno (en este caso, sobre las posibilidades reales de adopción).Aquí hay un articulo de 2020 en el cual aseguran que en 2020 el 12% de los Méxicanos reconoce que ha utilizado bitcoin: https://www.eleconomista.com.mx/economia/Mexico-es-el-sexto-pais-con-mayor-adopcion-de-criptomonedas-20200708-0102.htmlY Buscando algo más reciente me encontré con este otro, el cual asegura que una de cada 10 personas en México invierte en criptomonedas.https://expansion.mx/mercados/2022/10/13/1-de-10-mexicanos-invierte-criptomonedasQuoteMéxico ocupa el lugar 15 entre 26 países en cuanto a adopción de monedas digitales, de acuerdo con el informe de Adopción de Criptomonedas de Finder.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "October 15, 2022, 03:09:02 PM",
      "body": "Quote from: seoincorporation on October 15, 2022, 02:28:46 PM<…>En mi caso, me interesaba más conocer la sensibilidad real del país por bitcoin como moneda de curso legal, entendiéndose como tal por un equivalente a como se considera en El Salvador, más allá de la extensión en términos de personas que tienen bitcoin como elemento de inversión.Concretamente, en múltiples ocasiones, Indira Kempis ha salido a la palestra de los medios abogando por bitcoin como moneda de curso legal en el país. De hecho, en la Gaceta del Senado figura la siguiente propuesta presentada, con el objeto de enmendar la Ley Monetaria:https://www.senado.gob.mx/64/gaceta_del_senado/documento/125472En dicha propuesta se recoge:Quote\"Artículo 2ndo ter – El Bitcoin (BTC) será considerado como moneda de curso legal en la República Mexicana\"En la propuesta, no encuentro una fuerte carga argumental pivotante entorno al bitcoin en sí aparente (los argumentos son más genéricos, que no estrictamente particulares sobre bitcon a mi entender).La propuesta está pendiente de ser tratada (desconozco el tiempo que puede quedarse en dicho estado), e Indira es de un partido minoritario en el país si no me equivoco, por lo que no le daría a priori muchas posibilidades de prosperar. No obstante, para estos temas, siempre va bien tener conocimiento desde dentro del propio país, a fin de calibrar mejor la seriedad de la propuesta, la sensibilidad del país al respecto, y las posibilidades reales de ser considerado y aprobado en términos legislativos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "October 19, 2022, 02:50:37 PM",
      "body": "Recuerdo en esa época donde la Internet no era tan popular y cosas como  tener un libro o leer estos libros de Récords Guinnes era en cierta manera increíble de ver ( tenían muchas fotos a veces más fotos que texto) y leer, junto a la revista Mecánica popular y Readers Digest, justo eso recordé al leer tu post.Guinnes sigue por ahí, todavía con cierta reputación sin duda pero ya no es lo que era antes en la relevancia de encontrar records impresionantes y creo que el récord del OP en su fuente demuestra que un récord para ellos es hoy en día cualquier cosa que se pueda registrar bajo ciertas reglas.Por otra parte como siempre cualquier buena noticia asociada al nicho suma, en ese sentido DdmrDdmr ha logrado reunir un buen número de récord asociados al bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}