{
  "id": "topic_5439594",
  "title": "Lexytroy",
  "author": "Lexytroy",
  "created_time": "February 12, 2023, 02:24:17 PM",
  "content": "Firstly I apologize for the long post, but there's quite a bit of information to cover.I know almost everyone here will have encountered a crypto scam at some point, but I'd like to bring to your attention a current scam called Uphoria Metaverse. It is just one of a string of scam projects created by convicted fraudster Barry Hayward from Preston in England. He also goes by the name James Hayward, but has been known to use a list of fake names including Xander Garrison, Barry Hayward, David Hayward, James Hayward, Starlord, Cypher, Jamie de Souza, Jamie Desouza, Colin Hayward, Carlos de Souza, Barry Howard, Raymond Calitri, James Ward, David Heywood, Barry Heywood, Barry David Heywood plus many more.He has served previous prison sentences for theft and fraud and has committed these crimes using a variety of methods including common theft, fraudulent use of a credit card, fake businesses, diamond trading, online shops, fake eBay sales, car services and parts, computer sales, receiving goods without paying, IT and gaming equipment, race simulator equipment, crypto brokerage and crypto projects.His scam companies in the past have included, OP Performance, Officially Pimped, Oppjapparts, Tech Carbon, Carbon Fibre Creation, Carbon Creations, Carbon Edge, UK dipping centre Ltd, Sim Rigs Ltd, VPCUK Ltd, Crypto Brokerage Ltd, FQ Autotech Ltd, Simplyoffroad, Kyoshiracing, Crotchrocket, BMWeurope, ChipGuru, Autobahnperformance, GoparcelGo, Habitus, Hashdigger, x2bitcoins, Hourbitcoins, Bitabay and Turn17 Ltd, plus many more.His activity within the crypto space quickly earned him the reputation of a fraudster regardless of which name he tried to hide under, his proven scam projects to date are Galaxium, Galaxium Phoenix, Supremium, Lego, Apex Realms and Uphoria Metaverse.He has also been found to have links with Lavabird, Indu-Ultra, Olyx-4, Lazy Shiba and more. Although Barry Hayward is the ring leader in these scam projects, his mods have also followed him from project to project and like him have also tried to mask their identity by creating fake names. They were instructed by Hayward to obtain new mobile SIM cards and new identities on telegram, delete old telegram groups, abandon investors and move on to the next scam. We obtained screenshots of leaked private admin chats which can prove this.Hayward has a history of slow rug pulls and liquidy theft, and is known for disappearing with presale earnings after failing to launch projects.He has blamed the past projects failures on investors selling, bots, FUD, members of the team stealing, marketing companies stealing, lied about spending money on magazine and game development, both of which were 100% completely fake, which is confirmed by ex mods, and also lied about paying CMC to fast track project listing.Many mods have joined, and left when they realised it was all a scam, but some have stayed, these are just some of the current members of his crypto scam ring.Barry Hayward or James Hayward - Preston, EnglandSusan Quirk or Su Quirk (Barry's partner) - Preston, EnglandPeter Ohanyan (Mr Live) - USA Gary Stringer (Gary) - London, EnglandOlusa Tobi Macduff (Macduff) - NigeriaJan Arve Hustad (Loke Bris) - Averøy, NorwayYelsew Doublep (Yelsew) - Amsterdam Peter Ohanyan is also a well know scammer within the crypto space and is responsible for countless Ponzi schemes and scams.Barry Hayward and his partner Su Quirk live a VIP lifestyle, driving around in an Aston Martin DBX, 1st class flights abroad, Mexico, France, Monte Carlo, Scandinavia, private yacht charters, VIP tickets to Formula 1 races, private helicopter charters to F1 races, helicopter flights over Dubai, Disney trips, meet and greet A list celebrities, sports cars, cosmetic surgery and breast augmentation for his partner, designer clothes, shoes and jewelry for his partner and daughter. He achieves all of this without a job, it's all paid for by the money stolen from investors. There are voice clips of him making threats, boasting about his friendship's with murderers and drug dealers, who he was going to send to houses to sort them people out. He has previously been wanted by police for serious assault on a woman, along with many other crimes which he was charged with, including credit card theft and obtaining IT equipment and failing to pay.I urge anyone affected by any of these scams to get in touch with the police and Actionfraud UK and file a report against him and his team.  Please PM me for further information.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5439594",
  "comments": []
}