{
  "id": "topic_5434618",
  "title": "kungen12321",
  "author": "kungen12321",
  "created_time": "January 13, 2023, 05:29:23 PM",
  "content": "Hi Guys!I have a T17+ miner that has no hashboards at the moment, they are under repair.I have tried installing Braiins via sd card. At startup, both lights flash in sync, on-off-on-off. After an hour they still do that, have then restarted the miner manually.When I restart the miner without the sd card, first both lights turn on, with constant light. After some minutes they go out completely and stay off.I can log in via the ip address (comes to stock firmware) but when I select the miner status and miner pool/workername tabs it is just a blank page, likewise the first page with miner model, hardware, software it is just blank.Anyone experienced something similar?I goal is to install Braiins on the control board \"hard drive\".",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434618",
  "comments": [
    {
      "author": "paid2",
      "created_time": "January 15, 2023, 10:54:55 AM",
      "body": "Quote from: kungen12321 on January 13, 2023, 05:29:23 PMHi Guys!I have a T17+ miner that has no hashboards at the moment, they are under repair.I have tried installing Braiins via sd card. At startup, both lights flaAsh in sync, on-off-on-off. After an hour they still do that, have then restarted the miner manually.When I restart the miner without the sd card, first both lights turn on, with constant light. After some minutes they go out completely and stay off.I can log in via the ip address (comes to stock firmware) but when I select the miner status and miner pool/workername tabs it is just a blank page, likewise the first page with miner model, hardware, software it is just blank.Anyone experienced something similar?I goal is to install Braiins on the control board \"hard drive\".Hey You should wait the feedback from Artemis3 here : https://bitcointalk.org/index.php?topic=5412808.20;topicseenI saw you already post a message in the Braiinos topic, no one is more legit and qualified to answer than Artemis3 for Braiinos realted questions / issues",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "January 15, 2023, 05:20:17 PM",
      "body": "You maybe interrupt the flashing process which is why it ends up a corrupted program/soft bricked and maybe you are using a fake SD card with fake volume take note if you use a fake SD card to flash the unit sometimes it can bricked the control board so make sure that you are using original one and recommended size.If you are using the original one then repeat the procedure redownload the firmware and reformat the SD card then burn it again and flash the unit.Do this 3 times, if it still didn't work for 3rd try then replace the SD card or try other ways to flash the unit.Check the guide here https://docs.braiins.com/os/open-source-en/Setup/2_advanced.html#sd-card-image",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}