{
  "id": "topic_5473699",
  "title": "noonesh",
  "author": "noonesh",
  "created_time": "November 11, 2023, 11:34:38 AM",
  "content": "HiI was looking to the blocks and transactions created to mint ordinals, write those shitty json inside the blockchain and all.All transactions are of very little satoshi, 294 satoshis, 512 satoshis, things like that.My question is simple, by creating those little UTXOs, aren't the morons that create them just burning satoshis forever? Cause with the size of a transaction today, fees will almost always be higher than the value of these UTXOs.Follow up question:If this Ordinals stupidity keeps going on, for years to come, become more popular and a lot of idiots creating shitcoins and images that children do on Paintbrush and saving them in the Blockchain with these unspendable UTXOs, couldn't this harm bitcoin at some point?Two quadrillion, one hundred trillion looks like much, but when you count the number of idiots burning money to save a stupid frog image in the blockchain like if it was a cloud storage, well.... there's no limit for human stupidity. That's why I have this concern.Thank you.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473699",
  "comments": [
    {
      "author": "Zaguru12",
      "created_time": "November 11, 2023, 12:08:57 PM",
      "body": "Quote from: noonesh on November 11, 2023, 11:34:38 AMIf this Ordinals stupidity keeps going on, for years to come, become more popular and a lot of idiots creating shitcoins and images that children do on Paintbrush and saving them in the Blockchain with these unspendable UTXOs, couldn't this harm bitcoin at some point?For a non block miner, sadly it will harm the network and probably its adoption a bit if it’s prolonged for a longer time, because just like now we will be face with high number of unconfirmed transactions and the use of bitcoin network to propagate small transactions will be a thing of the past. If it continues then will be face with another block size war as proposal for a bigger block size will emerge to enhance its scalability and we know how a bigger block size poses the risk to decentralization of the network. But will the ordinals and inscriptions continue for a longer time? I will say NO because as time passes on those naive people buying this jepegs will find out that it wouldn’t be profitable as they see it and will stop and probably the inventors will have to find another initiative to scam users again. For now it’s just hype because people believe it is the next big thing like that thought when NFT started.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "November 11, 2023, 01:06:59 PM",
      "body": "Those NFTs from Ordinals, Inscriptions can become useless soon and they will not worth any thing.Small inputs can be consolidated but it will cost you on-chain transaction fee. The more inputs you want to consolidate, bigger size for that consolidation then higher transaction fee for it.I don't see it is like burning any satoshi but it is kind of wasting money without good awareness. It's issue of Ordinal fans, not me or you if we don't engage in Inscription FOMO wave.Fortunately, if they lose those satoshis, it is like donation to us like Satoshi Nakamoto wrote about that.Quote from: satoshi on June 21, 2010, 05:48:26 PMLost coins only make everyone else's coins worth slightly more.  Think of it as a donation to everyone.Think it simply like this and you will feel happy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "November 11, 2023, 02:16:49 PM",
      "body": "I wouldn't say high fees harm Bitcoin because the network and security in Bitcoin isn't get any effect, so Bitcoin remains decentralized. I'd more concern with Blackrock which has $98~ Billions market cap that accepting Bitcoin ETFs. If they're can hold Bitcoin as much as they can without need to send their coins outside, this will be a problem.As Bitcoin become scarcer, we should be prepared to face the insanely high fee in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "November 11, 2023, 02:25:07 PM",
      "body": "Quote from: Apocollapse on November 11, 2023, 02:16:49 PMAs Bitcoin become scarcer, we should be prepared to face the insanely high fee in the future.Bitcoin becomes scarcer is a narrative!More bitcoin will be created on Bitcoin blockchain with miner mining and total supply of Bitcoin is already known since 2009. People only hesitate too much, delay their decisions when there are great times, prices and chances for them to accumulate bitcoin. They only begin seriously thinking about investment and accumulation when they see big green candles from Bitcoin.It's true that there will be less new bitcoin in future because block subsidy will be less in future.It's true that there will also be more bitcoin lost in future by careless people or by sudden deaths, accidents of technical issues on where they store bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "November 11, 2023, 04:34:21 PM",
      "body": "Quote from: noonesh on November 11, 2023, 11:34:38 AMMy question is simple, by creating those little UTXOs, aren't the morons that create them just burning satoshis forever? Cause with the size of a transaction today, fees will almost always be higher than the value of these UTXOs.That's called dusting, in which these UTXO makers spend huge money to create congestion in the blockchain to make transactions more expensive for the big UTXO makers. And in my opinion this is not equal to the burning of the Satoshies forever, because the fee they are spending is going into the accounts of miners and the UTXOs that cannot be spent later are obviously going to waste if there are not enough funds to cover the fee, which also means we can't use those small satoshis as the fee is higher then them but it does not mean they are being burned because we can still use them by refunding that wallet with enough satoshies to create another UTXOs. Quote from: noonesh on November 11, 2023, 11:34:38 AMIf this Ordinals stupidity keeps going on, for years to come, become more popular and a lot of idiots creating shitcoins and images that children do on Paintbrush and saving them in the Blockchain with these unspendable UTXOs, couldn't this harm bitcoin at some point?No, it will not hurt Bitcoin instead the price of BTC will increase over time due to this dusting technique which no doubt in result creates a high TX fee but that can also be managed using LN.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}