{
  "id": "topic_5465746",
  "title": "sabotag3x",
  "author": "sabotag3x",
  "created_time": "September 05, 2023, 01:31:56 PM",
  "content": "Projetos que surgiram antes do Bitcoin (tem até a NSA):",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465746",
  "comments": [
    {
      "author": "thiagothx1370",
      "created_time": "September 05, 2023, 05:49:01 PM",
      "body": "Da uma bela tatuagem isso ai. Uma pena que nos proximos anos, os novos judeus serão os bitcoiners, e os nazistas o governo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 05, 2023, 07:35:24 PM",
      "body": "Belo infografico.É verdade que nem tudo está diretamente ligado ao Bitcoin. Mas, também é verdade sem Internet não estávamos aqui.   Seria interessante, analisarmos essas etapas com detalhe e perceber como elas acabaram por nos levar atá ao Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "September 12, 2023, 04:08:16 PM",
      "body": "Quote from: sabotag3x on September 05, 2023, 01:31:56 PMProjetos que surgiram antes do Bitcoin (tem até a NSA):Bem bacana Eu senti falta de qualquer mencao ao  ecash e ao cypherpunk manifesto (ou Wei dai / Erich hughes)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "September 12, 2023, 04:15:54 PM",
      "body": "Quote from: bitmover on September 12, 2023, 04:08:16 PMBem bacana Eu senti falta de qualquer mencao ao  ecash e ao cypherpunk manifesto (ou Wei dai / Erich hughes)O Manifesto está ali (1993) e o Hughes é citado duas vezes.Wei Dai também está ali com o B-money em 1998.Sobre o eCash, deve ser 1983 (David Chaum).Eu senti falta do Ethereum depois do Bitcoin Quote from: joker_josue on September 05, 2023, 07:35:24 PMSeria interessante, analisarmos essas etapas com detalhe e perceber como elas acabaram por nos levar atá ao Bitcoin.Eu ia começar, escolhendo um e escrevendo sobre, mas acabei esquecendo.. quem sabe eu faça isso essa semana.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Loganota",
      "created_time": "September 12, 2023, 04:32:19 PM",
      "body": "É um belo infográfico que se mistura bem com aquela declaração do theymos que o Satoshi estava observando a cena e então teve a ideia de unir o que tinha sido proposto de bom e juntar para criar o Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "September 12, 2023, 09:16:49 PM",
      "body": "Já tinha visto este gráfico algures. Realmente quem o fez/pensou e o desenhou teve bastante creatividade em juntar todos os acontecimentos eventualmente relacionados com Bitcoin e que no fundo possibilitaram que Bitcoin existisse e fosse criado \"in the first place\".Todas as tecnologias estão ali incluídas. Até a criação do protocolo que serviu de berço à internet como a conheçemos hoje (ou pouco menos).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "September 13, 2023, 02:52:29 PM",
      "body": "Quote from: thiagothx1370 on September 05, 2023, 05:49:01 PMDa uma bela tatuagem isso ai. Uma pena que nos proximos anos, os novos judeus serão os bitcoiners, e os nazistas o governo.Não posso deixar de comentário isso, porque é algo que já pensei muito e é algo bem importante pra mim.Tem uma autora, uma bióloga-antropóloga que eu adoro muitas coisas - não gosto de várias também - mas ela tem um livro chamado Manifesto Ciborgue (que teoricamente é sobre feminismo, mas não prática é um livro incrível e sobre várias coisas) e nesse livro tem uma frase incrível, que me marcou muito e me incentivou MUITO em cripto. Ela diz o seguinte:''O principal problema com os ciborgues é, obviamente, que eles são filhos ilegítimos do militarismo e do capitalismo patriarcal, isso para não mencionar o socialismo de estado. Mas os filhos ilegítimos são, com frequência, extremamente infiéis às suas origens. Seus pais são, afinal, dispensáveis. (HARAWAY, 2016, p. 40).'''Nessa parte do manifesto ela está discutindo sobre processo de apropriação de ideias, tecnologias e etc e principalmente, transformação de significados. Quando eu entrei em cripto, eu estava MUUUUUUITO animada com o aspecto anarquista, revolucionário, de transformação do ativo. E fiquei super decepcionada quando comecei a conhecer ''as pessoas'' do sistema. Ninguém era anarquista, não tinha mulheres. As pessoas nos primeiros eventos que eu ia todas estavam de terno. Mas eu sempre fiquei pensando, cara, os ciborgues, as tecnologias e o Bitcoin é de quem usa. O cara que criou esse negócio deixou ela ai pra quem quiser. Vai ser de quem se apropriar a tecnologia. Então isso de ''nazistas o governo'' acho meio besteira. E te diria, não fica preso nisso. Com o tempo, eu percebi que sim, tem homens de ternu, mas tem vitalik vestidos de unicornios kkk",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "September 13, 2023, 05:25:39 PM",
      "body": "Quote from: Disruptivas on September 13, 2023, 02:52:29 PMQuando eu entrei em cripto, eu estava MUUUUUUITO animada com o aspecto anarquista, revolucionário, de transformação do ativo. E fiquei super decepcionada quando comecei a conhecer ''as pessoas'' do sistema. Ninguém era anarquista, não tinha mulheres. As pessoas nos primeiros eventos que eu ia todas estavam de terno. Mas eu sempre fiquei pensando, cara, os ciborgues, as tecnologias e o Bitcoin é de quem usa. O cara que criou esse negócio deixou ela ai pra quem quiser. Vai ser de quem se apropriar a tecnologia. Então isso de ''nazistas o governo'' acho meio besteira. E te diria, não fica preso nisso. Com o tempo, eu percebi que sim, tem homens de ternu, mas tem vitalik vestidos de unicornios kkk  Curioso. Em que ano foi isso? foi no Brasil? Não tenho a imagem de investidores de btc de terno.Acho q terno cai bem pra burocratas, executivos e scammers.  Não vejo nenhum desse pessoal como investidor, só os scammersSe bem q algumas palestras q vejo pelo YouTube mostra algumas pessoas de terno.. tipo as q o taleb vai kkk deve depender muito do evento.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "September 13, 2023, 08:06:39 PM",
      "body": "Quote from: Disruptivas on September 13, 2023, 02:52:29 PMQuando eu entrei em cripto, eu estava MUUUUUUITO animada com o aspecto anarquista, revolucionário, de transformação do ativo. E fiquei super decepcionada quando comecei a conhecer ''as pessoas'' do sistema. Ninguém era anarquista, não tinha mulheres. As pessoas nos primeiros eventos que eu ia todas estavam de terno. Com o tempo, eu percebi que sim, tem homens de ternu, mas tem vitalik vestidos de unicornios kkk Tem de tudo mesmo, basta escolher quem acompanhar..Eu costumo definir os usuários de bitcoin por 'turmas'.. se você pega a turma de 2009-2010, a maioria são cypherpunks, anarquistas, programadores, etc.. às vezes eu lia umas postagens antigas aqui do fórum, rolava uns papos diferentes.Já as turmas de 2013, 2017 e 2021 são pessoas que conheceram o Bitcoin por conta das altas de preços, abordadas pela grande mídia, então é muito mais fácil encontrar pessoas mais ligadas a investimentos e empreendedorismo, que não se importam em jogar o jogo do governo. Podem ser a maioria, mas como você falou, sempre tem alguém perdido usando relógio de gatinho, ou com ideias semelhantes as suas, para ler e ouvir.Quote from: bitmover on September 13, 2023, 05:25:39 PMSe bem q algumas palestras q vejo pelo YouTube mostra algumas pessoas de terno.. tipo as q o taleb vai kkk deve depender muito do evento.Antonopoulos ta sempre \"no estilo\" com sua camisa social em suas palestras",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 13, 2023, 10:48:50 PM",
      "body": "Quote from: sabotag3x on September 13, 2023, 08:06:39 PMEu costumo definir os usuários de bitcoin por 'turmas'.. se você pega a turma de 2009-2010, a maioria são cypherpunks, anarquistas, programadores, etc.. às vezes eu lia umas postagens antigas aqui do fórum, rolava uns papos diferentes.Já as turmas de 2013, 2017 e 2021 são pessoas que conheceram o Bitcoin por conta das altas de preços, abordadas pela grande mídia, então é muito mais fácil encontrar pessoas mais ligadas a investimentos e empreendedorismo, que não se importam em jogar o jogo do governo. Podem ser a maioria, mas como você falou, sempre tem alguém perdido usando relógio de gatinho, ou com ideias semelhantes as suas, para ler e ouvir.Realmente, achei essa analise bem apropriada.Só acrescentava umas turmas de 2010-2013 (onde eu me incluiria  ). São aquelas pessoas, que até tiveram conhecimento do Bitcoin, mas não se envolveram logo, até perceber tudo o que estava envolvido. É bem interessante essa analise geracional, que se consegue sentir dentro do Bitcoin, apesar dos poucos anos de existência. Certamente irão surgir novas \"turmas\", que viram por objetivos e com características diferentes.Acho que seria um campo que podia ter uma analise mais profunda. Acredito que a nossa colega @Disruptivas iria gostar de analisar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "September 16, 2023, 05:12:11 PM",
      "body": "Quote from: darkv0rt3x on September 14, 2023, 10:52:25 AMQuote from: thiagothx1370 on September 05, 2023, 05:49:01 PMDa uma bela tatuagem isso ai. Uma pena que nos proximos anos, os novos judeus serão os bitcoiners, e os nazistas o governo.Porque dizes que os judeus serão os bitcoiners? Eu não quero ser associado a judeus de forma nenhuma. São outro cancro da sociedade com o apoio certo. Acho que a malta aqui peca um bocado por se negar andar mais pelo telegram.Pelos menos falo relativamente ao judeu israelita! tornaram-se uma elite de merda à custa dos outros e agora praticamente já mandam neles e fazem o que querem deles.Vocês são malucos. Odio e preconceito contra etnias é algo idiota. As pessoas nascem judias e israelitas. Tem gente de todo tipo nesse grupo.O bitcoin é algo muito maior do que qualquer religião, estado, país, etnia ou qualquer outra coisa. Bitcoin é um ponto em comum entre Israel e palestina, entre nerds  de computadores e o mercado financeiro,  entre russos chineses americanos e ucranianos.Ninguém é dono do bitcoin, todos podem usá-lo, sem barreiras ou proibição. E sem incentivo também.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "September 16, 2023, 05:16:36 PM",
      "body": "Quote from: bitmover on September 16, 2023, 05:12:11 PMQuote from: darkv0rt3x on September 14, 2023, 10:52:25 AMQuote from: thiagothx1370 on September 05, 2023, 05:49:01 PMDa uma bela tatuagem isso ai. Uma pena que nos proximos anos, os novos judeus serão os bitcoiners, e os nazistas o governo.Porque dizes que os judeus serão os bitcoiners? Eu não quero ser associado a judeus de forma nenhuma. São outro cancro da sociedade com o apoio certo. Acho que a malta aqui peca um bocado por se negar andar mais pelo telegram.Pelos menos falo relativamente ao judeu israelita! tornaram-se uma elite de merda à custa dos outros e agora praticamente já mandam neles e fazem o que querem deles.Vocês são malucos. Odio e preconceito contra etnias é algo idiota. As pessoas nascem judias e israelitas. Tem gente de todo tipo nesse grupo.O bitcoin é algo muito maior do que qualquer religião, estado, país, etnia ou qualquer outra coisa. Bitcoin é um ponto em comum entre Israel e palestina, entre nerds  de computadores e o mercado financeiro,  entre russos chineses americanos e ucranianos.Ninguém é dono do bitcoin, todos podem usá-lo, sem barreiras ou proibição. E sem incentivo também.Concordo contigo no que dizes sobre Bitcoin. Por isso acho que também não é muito sábio dizer-se que os judeus serão os Bitcoiners. Já o Nazi alemão quis exterminar o judeu porque o achava superior em intelegência e com uma visão para o negócio fora do normal e agora vem-se dizer que o novo judeu será o bitcoiner!A não ser que estivessem a estabelecer uma analogia/metáfora em que tal como o judeu tinha que ser exterminado pelo Nazi, os Bitcoiners têm que ser exterminados pelos governos! Só se for nessa perspectiva! Aí, talvez concorde com a metáfora!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "September 16, 2023, 07:20:36 PM",
      "body": "Quote from: bitmover on September 16, 2023, 05:12:11 PMVocês são malucos. Odio e preconceito contra etnias é algo idiota. As pessoas nascem judias e israelitas. Tem gente de todo tipo nesse grupo.O bitcoin é algo muito maior do que qualquer religião, estado, país, etnia ou qualquer outra coisa. Bitcoin é um ponto em comum entre Israel e palestina, entre nerds  de computadores e o mercado financeiro,  entre russos chineses americanos e ucranianos.Ninguém é dono do bitcoin, todos podem usá-lo, sem barreiras ou proibição. E sem incentivo também.Também acho que estão misturando as coisas @bitmover. Depois reclamam. São tipos de comentários que nem deveriam aparecer aqui no fórum. Já conversei com o @Adriano a respeito disso. Tem vezes que a tal \"liberdade de expressão\" ultrapassa alguns limites da razoabilidade. Isso pode dar problema. Não é nada bom.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Prancheiro",
      "created_time": "September 19, 2023, 05:15:46 PM",
      "body": "Quote from: sabotag3x on September 05, 2023, 01:31:56 PMProjetos que surgiram antes do Bitcoin (tem até a NSA):Aqui tem um artigo mais focado nas tentativas de criação de criptomoedas:https://mirror.xyz/detalks.eth/xLDmDqTRatN62zgUIWDMRFElb0Y_hwkPRvB5JGEC2AoInteressante que a centralização é sempre um calcanhar de aquiles.Aquela ideia de que o estado poderia permitir a livre concorrência de moedas privadas é uma falácia.O fator Satoshi talvez seja o maior diferencial do Bitcoin!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}