{
  "id": "topic_5473600",
  "title": "mandown",
  "author": "mandown",
  "created_time": "November 10, 2023, 11:09:05 AM",
  "content": "Poloniex kullanan varsa dikkatli olsun yerinde olsam borsayı boşaltırdım.  Borsaya ait ne kadar token varsa bolaştılıyor.https://etherscan.io/address/0xa910f92acdaf488fa6ef02174fb86208ad7722ba#tokentxns",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473600",
  "comments": [
    {
      "author": "Vispilio",
      "created_time": "November 10, 2023, 11:48:25 AM",
      "body": "Maalesef bu haber doğru, ben de şimdi baktım withdrawal'lar hep durdurulmuş...En az 49 milyon USD uçurulmuş: https://beincrypto.com/poloniex-hacked-49-million/Justin Sun da kullanıcı fonlarının tamamen kendi garantisinde olduğunu ve çalınanları da kurtarmaya çalışacaklarını ifade ediyor:https://twitter.com/justinsuntron/status/1722942733680296246",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "execijutiere",
      "created_time": "November 10, 2023, 12:46:15 PM",
      "body": "60 milyon dolar çalındığı doğrulandı. Bu tarz haberleri manipülasyon için çok daha görmeye hazırlık olmalıyız ama zaten Justin Sun zaten bu piyasanın manipülasyonu konusunda bilinen bir isim. Nereye baksak nereye el atmaya çalışsa aslında kurutuyor ama piyasa onu bir türlü silemedi.TheBlock’un haberine göre 60 milyon dolar kesin yaklaşık 63 milyon dolarlık fon çalındığını belirtmişler.https://www.theblock.co/post/262563/justin-suns-crypto-exchange-poloniex-seemingly-hit-by-60-million-hack",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vispilio",
      "created_time": "November 10, 2023, 01:42:46 PM",
      "body": "Çok ilginç bir şekilde TRX pump yedi ve diyorlar ki, Justin Sun kendi kendini hackledi, mevduatlarla Tron'u pumpladı, şimdi karını çekicek daha sonra onun bir kısmıyla kullanıcılara geri ödeme yapacak, uzak bir olasılık da olsa Tron'un böyle bir hack olayından sonra ani yükselmesi 0.11'leri görmesi gerçekten çok tuhaf...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "November 10, 2023, 04:08:16 PM",
      "body": "justin sun, çalınan paraların iade edilmesi halinde %5 ödeme yapacağını mı ne söylemişti en son. trx'in pump yemesinden ziyade işin bir yerinde justin sun şoparı olunca herkesin aklına tek bir fikir geliyor: sun kendisi hackledi sonra yedi. bu piyasadaki en güvensiz tip kimdir sorusunun cevabı bu herif. elon musk falan bunun yanında şeker çocuk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "November 10, 2023, 09:00:29 PM",
      "body": "Quote from: mandown on November 10, 2023, 11:09:05 AMPoloniex kullanan varsa dikkatli olsun yerinde olsam borsayı boşaltırdım.  Borsaya ait ne kadar token varsa bolaştılıyor.https://etherscan.io/address/0xa910f92acdaf488fa6ef02174fb86208ad7722ba#tokentxnsBiraz daha fazla para kazanabilmek için her türlü dolandırıcılık faaliyetine girişebilecek Justin Sun'a ait borsanın içinin boşaltılması ekosistemi biraz tanıyan hiç kimseyi şaşırtmamış olsa gerek. Tron zinciri ve Justin Sun'ın kıyısından kenarınden geçtiği her proje, her varlık bu piyasa için tehlikelidir.Steemit olaylarında binance borsasındaki kullanıcı varlıklarını oy vermek için kullanıp zincirde kendi fikirleriyle uyuşmayan insanların varlıklarının bulunduğu adresleri yasakladığı gün olay bitmişti aslında. Yaptığı her işin altından başka bir hile çıkıyor. En son FTX olaylarında insanları kurtarma vaadi ile varlıklarına çökmeye çalışmıştı. Şimdi de şüphesiz kendi borsasının içini boşaltmıştır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bobita",
      "created_time": "November 10, 2023, 10:12:36 PM",
      "body": "Artık eski şaşalı günlerinden eser kalmasa da Poloniex geçmişin prestijli ve şimdinin de çalışmaya devam eden bir borsası, dev borsalığı eskidendi ama şimdi de cüce değil. Bu çerçevede baktığımızda Poloinex hack olayının piyasaya rakam anlamında görünür ve hiç olmazsa birkaç günlük olumsuz etkisi olması lazımdı ama olmadı. Bunun bana göre iki temel nedeni var, birincisi herkesin yazdığı, işin içinde Justin Sun çakalı olunca her şey olası, dolayısıyla piyasa o kadar iplemedi bence. İkinci olarak da, artık irili ufaklı o kadar sık hack olayı ya da girişimi yaşanıyor ki, camia artık bu konuda kaşarlandı, \"hee, öyle mi olmuş\" deyip geçiyorlar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}