{
  "id": "topic_5422972",
  "title": "thehairymob",
  "author": "thehairymob",
  "created_time": "November 24, 2022, 11:36:26 AM",
  "content": "Help please. Transaction id bc1qcr9ndrfxvt5tyddm2nhvcs466tcrdcavtfa29x Tried to increase fee using electrum wallet but it won't allow me. Using Electrum 4.3.2 to send.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5422972",
  "comments": [
    {
      "author": "mocacinno",
      "created_time": "November 24, 2022, 11:43:09 AM",
      "body": "Quote from: thehairymob on November 24, 2022, 11:36:26 AMHelp please. Transaction id bc1qcr9ndrfxvt5tyddm2nhvcs466tcrdcavtfa29x Tried to increase fee using electrum wallet but it won't allow me. Using Electrum 4.3.2 to send. your transaction id is c0db0cb4f3299e3196e396dd4a7f645d06de81d76a04aa1dabf5e1dcb379f497, bc1qcr9ndrfxvt5tyddm2nhvcs466tcrdcavtfa29x is probably the address you tried to fund.It looks like it's opt-in rbf, so you should be able to bump the fee or do an CPFP. That being said, you chose a 1,7 sat/vbyte fee... You're only <4Mb away from the top tx's (in sats/vbyte), so odds are good your transaction will be confirmed in a couple of hours.Unless it's super urgent, i'd just advice you to wait... I do assume you're the sender of the transaction, right? As a receiver you cannot bump the fee eventough it's opt-in rbf (but you can still do a cpfp)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thehairymob",
      "created_time": "November 24, 2022, 11:44:30 AM",
      "body": "sorry is this one the correct one c0db0cb4f3299e3196e396dd4a7f645d06de81d76a04aa1dabf5e1dcb379f497",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "November 24, 2022, 11:51:28 AM",
      "body": "Quote from: thehairymob on November 24, 2022, 11:44:30 AMsorry is this one the correct one c0db0cb4f3299e3196e396dd4a7f645d06de81d76a04aa1dabf5e1dcb379f497You said Electrum won't allow you although your transaction is RBF enabled. Can you take a screenshot of the error you're getting?As mentioned above, your transaction shouldn't take too long to confirm. According to Blockchair[1], it'll confirm in ~30mn.[1] https://blockchair.com/bitcoin/transaction/c0db0cb4f3299e3196e396dd4a7f645d06de81d76a04aa1dabf5e1dcb379f497",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thehairymob",
      "created_time": "November 24, 2022, 11:56:45 AMLast edit: November 24, 2022, 12:13:32 PM by thehairymob",
      "body": "rbf is enabled. Clicked on transaction and then increase fee, oked that but no sign that it took effect and still reporting old fee no error. Very confusing for my small mind  Time says 26 min but then goes to 4 hours if you look at the position in q it is always 4000+ from top not sure why it never closes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "November 24, 2022, 12:25:24 PM",
      "body": "Quote from: thehairymob on November 24, 2022, 11:56:45 AMrbf is enabled. Clicked on transaction and then increase fee, oked that but no sign that it took effect and still reporting old fee no error. As the original transaction is still valid, you haven't increased the fee at all. If you had increased the fee, the original transaction should have been replaced by a new transaction. What happens when you click on \"OK\" button? After that, a new window in which you broadcast the replacing transaction should popup.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thehairymob",
      "created_time": "November 24, 2022, 12:33:13 PM",
      "body": "yes the transaction screen then appears but not getting anywhere with it as there is nothing to combine, export or sign so close is the only option left.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "November 24, 2022, 12:34:44 PM",
      "body": "Quote from: thehairymob on November 24, 2022, 12:33:13 PMyes the transaction screen then appears but not getting anywhere with it as there is nothing to combine, export or sign so close is the only option left.Click on \"sign\" button and then broadcast the transaction. After that, the original transaction will be replaced by a new one paying higher fee.Edit: As I see in the mempool, you increased the fee rate to 2.7 sat/byte successfully.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thehairymob",
      "created_time": "November 24, 2022, 12:36:36 PMLast edit: November 24, 2022, 03:32:29 PM by thehairymob",
      "body": "Got it thanks and done  still not moving id e75041aea76b31f1d2d1cab05a7cd478367d37506d4403f8f78fb79c4b0004a2",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "November 24, 2022, 05:37:01 PM",
      "body": "Take a look at mempool.space and other explorers, you can see that the fee is currently rising. Your tx shows that you set it at 2.74 sats/vbyte where the next 3 blocks are averaging around 4 sats. Either increase the fee again or just wait if you're not in a hurry, there's no problem with your tx.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thehairymob",
      "created_time": "November 24, 2022, 10:11:13 PM",
      "body": "Finally completed thanks for the help",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}