{
  "id": "topic_5472749",
  "title": "Raknik77",
  "author": "Raknik77",
  "created_time": "November 03, 2023, 06:08:04 PM",
  "content": "Need btc or usdt in nigeria and these africa countries.I need for test this counties:Algeria 🇩🇿 Morocco 🇲🇦 Ethiopia 🇪🇹 Tanzania 🇹🇿 DR Congo 🇨🇩Mozambique 🇲🇿 Madagascar 🇲🇬 Cote 🇨🇮Niger 🇳🇪 Burkina Faso 🇧🇫 Chad 🇹🇩 Benin 🇧🇯 Tunisia 🇹🇳 Gabon 🇬🇦 Cabo Verde 🇨🇻Lesotho 🇱🇸Botswana 🇧🇼Dominican 🇩🇴Togo 🇹🇬Costa Rica 🇨🇷 Chile 🇨🇱 Panama 🇵🇦 Puerto-Rico 🇵🇷Honduras 🇭🇳 Belize 🇧🇿Suriname 🇸🇷 Guyana 🇬🇾 Trinidad 🇹🇹 Aruba 🇦🇼 Barbados 🇧🇧Saint Lucia 🇱🇨 Grenada 🇬🇩 Bermuda 🇧🇲Martinique 🇲🇶I can send first (small mounth or use escrow btc talk or other exchanger plataform)@aleptc my telegram",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472749",
  "comments": [
    {
      "author": "Spaceman1000$",
      "created_time": "November 03, 2023, 06:44:00 PM",
      "body": "Quote from: Raknik77 on November 03, 2023, 06:08:04 PMNeed btc or usdt in nigeria and these africa countries.I need for test this counties:Algeria 🇩🇿 Morocco 🇲🇦 Ethiopia 🇪🇹 Tanzania 🇹🇿 DR Congo 🇨🇩Mozambique 🇲🇿 Madagascar 🇲🇬 Cote 🇨🇮Niger 🇳🇪 Burkina Faso 🇧🇫 Chad 🇹🇩 Benin 🇧🇯 Tunisia 🇹🇳 Gabon 🇬🇦 Cabo Verde 🇨🇻Lesotho 🇱🇸Botswana 🇧🇼Dominican 🇩🇴Togo 🇹🇬Costa Rica 🇨🇷 Chile 🇨🇱 Panama 🇵🇦 Puerto-Rico 🇵🇷Honduras 🇭🇳 Belize 🇧🇿Suriname 🇸🇷 Guyana 🇬🇾 Trinidad 🇹🇹 Aruba 🇦🇼 Barbados 🇧🇧Saint Lucia 🇱🇨 Grenada 🇬🇩 Bermuda 🇧🇲Martinique 🇲🇶I can send first (small mounth or use escrow btc talk or other exchanger plataform)@aleptc my telegramI don't understand what is your post is trying to portray, is it that you're trying to show countries that use BTC in the world or countries that use BTC in Africa, because there is no write up to back up what you're trying to explain to us for our understanding. You need to backup your post with some explanation on what you mean, or a question you're trying to ask, so we will know how to answer you or give our opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "November 03, 2023, 07:00:38 PM",
      "body": "Quote from: Spaceman1000$ on November 03, 2023, 06:44:00 PMI don't understand what is your post is trying to portray, is it that you're trying to show countries that use BTC in the world or countries that use BTC in Africa, because there is no write up to back up what you're trying to explain to us for our understanding. You need to backup your post with some explanation on what you mean, or a question you're trying to ask, so we will know how to answer you or give our opinion.I think what the OP is trying to say is that it can buy or sell either BTC or USDT from any of those countries that are included on its list, and for security and trust reasons, the OP is also open to the use of an exchange or escrow, where he or she can send their payment first to the escrow service, and after the final deal is complete, they can both receive their payment either directly or from the escrow service, or better yet, the use of an exchange can still be acknowledged. I think the OP is just trying to create some form of local Africa exchange for himself or anyone who wants to buy crypto. But what's in for the OP, and why will people choose to buy from the OP rather than using any Dex that has been existing for years, or better yet, still use a CEX if the person is not concerned about privacy? Instead of taking the risk of dealing with an unknown trader, tinted coins are actually real.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "November 03, 2023, 10:48:00 PM",
      "body": "I dey curious say this Padi man no cap like a casa man wey dey our shores o but any how sha we gat reason him mata.  Him want to buy or sell Bitcoin wetin stop am to use centralised exchange wey plenty every where wey no go waste much time Abi Na KYC dey fear am? On top of the transparency wey him say him want him still come put him telegram handle for who Na?  Abi the escrow wey him dey find no dey important again? Or him wey want services no go dey frequent the thread wey him create here to dey see wetin dey happen and lastly, I noticed say this him account na fresh newbie and Na the first post be this which makes me more curious of his intentions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "November 04, 2023, 12:30:59 AM",
      "body": "Quote from: Raknik77 on November 03, 2023, 06:08:04 PMI need for test this counties:Op to test what? your message is not clear as others as said. please if you need help of sending you bitcoin then you have to make your thread clear for people to understand what you saying as it is, it's like you just drop the thread with no solid information to help you out. Therefore, I advise you to add more information to your thread to make it more clearly. Okay let me ask you some few questions. Who are you? and what do you want? Do you want to test bitcoin mining here or you want to invest in in Nigeria? By the way, you are welcome and please clear yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Onyeeze",
      "created_time": "November 04, 2023, 04:51:27 AM",
      "body": "Broda man you say we need btc in nigeria lol. Go to statistics of the countries that uses bitcoin most or transact with bitcoin you will see that we Nigerians we are in good position being Nigerians, in nigeria we embrace bitcoin and their is no African country that uses bitcoin more than how nigeria used bitcoin you can go and verify from statistics of African continent that embrace cryptocurrency, so I will like you to make such research, without central bank of nigeria that restructures uses of bitcoin, and since that time is when bitcoin transactions became minimize, both we are still making use of bitcoin every time so make your inquiring and statistics.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Promocodeudo",
      "created_time": "November 10, 2023, 05:07:23 PM",
      "body": "OP, I think you should focus on learning here, I feel that you are thinking much without proper research, just be guided, Nigeria as a country know BTC and they have been transacting in this currency, the problem Bitcoin enthusiast is facing is the inability of the government of the nation to allow this currency to scale through, for me, before you come up with this statistics of yours, you would have made versed research, despite the CBN statement Nigerian btc enthusiast are still doing the needful.OP try as much as possible to make your stay here impactful because it would have been better for you to ask questions before bringing this here, I mean no disrespect, I stand to be corrected if am been found wanting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "November 10, 2023, 05:22:52 PM",
      "body": "Quote from: Promocodeudo on November 10, 2023, 05:07:23 PMOP, I think you should focus on learning here, I feel that you are thinking much without proper research, just be guided, Nigeria as a country know BTC and they have been transacting in this currency, the problem Bitcoin enthusiast is facing is the inability of the government of the nation to allow this currency to scale through, for me, before you come up with this statistics of yours, you would have made versed research, despite the CBN statement Nigerian btc enthusiast are still doing the needful.OP try as much as possible to make your stay here impactful because it would have been better for you to ask questions before bringing this here, I mean know disrespect. I wouldn't even count that as a limitation because Nigeria so far have gained the title of the most consumers of Bitcoin in Africa despite the rejection of Bitcoin by the government. Bitcoin usage in Nigeria is growing everyday and I think it's owe to the massive opportunity that the youth if the country see and also many other benefits that come with Blockchain technology and even the government themselves can see this and that why this administration have decided to give an open stand to Bitcoin and actually work towards it adoption here in the country. It wasn't long ago when the government decided to train some certain number of person on Blockchain technology to enable underated the technology behind the trending Bitcoin and how could take advantage of this wonderful trend that is ongoing. federal government and Blockchain technology",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Makus",
      "created_time": "November 11, 2023, 11:16:47 AM",
      "body": "Op I no understand you oo, you just come create thread wey no get complete information, for others to understand wattin you mean. Especially wattin be \"I need for test this country\" wattin you dey talk sef, na all this kind of things dey make our forum be like scam for people their eye. Even if unto say you mean to sell bitcoin and usdt for those countries how person wan take do am when em no know you, as you can see no body go like do money business like this give person wey em no trust. And beside your post dey show say you from espanol local board why come here abi na scam you the op dey package ? Because the op account na this month dem create am oo.Abeg my fellow local board forum members make we dey careful for all this kind of posts dem wey external go come board with newbie account wey never get any reputation for the forum, on to say na business e dey come do, this na reason why dem create the market place, any body wey go fuck up naim sabi oo, I don yan wattin I fit yan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adultcrypto",
      "created_time": "November 11, 2023, 12:18:02 PM",
      "body": "Quote from: CryptSafe on November 03, 2023, 10:48:00 PMI dey curious say this Padi man no cap like a casa man wey dey our shores o but any how sha we gat reason him mata.  Him want to buy or sell Bitcoin wetin stop am to use centralised exchange wey plenty every where wey no go waste much time Abi Na KYC dey fear am? On top of the transparency wey him say him want him still come put him telegram handle for who Na?  Abi the escrow wey him dey find no dey important again? Or him wey want services no go dey frequent the thread wey him create here to dey see wetin dey happen and lastly, I noticed say this him account na fresh newbie and Na the first post be this which makes me more curious of his intentions.The post no just get clear direction, no beta touchlighting to make am easy for people to know wetin him wan do. Untop of that, the account wey post am na new person for the forum and people no sabi anything about am. I no know how him wan take convince person make e for do business with am. We get plenty means we fit use buy Bitcoin, some na people wey dey the business for long wey don get better reputation.  Anything wey go make person leave those plenty options them must get some motivation and advantages.  For this post, I no see anything like that. If the OP know wetin people don go through untop trading Bitcoin, him go know how to present mater wey e go enter people eye. For people to even think go him side",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Perfectbaby",
      "created_time": "November 11, 2023, 12:38:35 PM",
      "body": "Op here is not the right section to post this, will you kindly move this to currency exchange section where you could see more buyer or traders over there because here is only meant for Nigerians and not other countries as you got them listed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelward",
      "created_time": "November 11, 2023, 05:20:42 PM",
      "body": "Wetin i don learn from dis thread na to refresh my memory about the names of African countries, because frankly i don forget some of them. Me sef i no too understand the OP yarn, because just like most members don talk , em de economical with information to take help interested members. I come de wonder again why a newbie wey never familiarize himself for the forum go come de share im telegram for di forum. One of the lessons wey i don  learn from dis forum be say make I no do any transactions with strangers for telegram and WhatsApp. Anyway good luck to the OP if im truly know wetin im de do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MainIbem",
      "created_time": "November 11, 2023, 06:17:22 PM",
      "body": "Na this kind of post we supposed report to mod to handle or move am go were e belong because nothing I know say this post dey work for here or even do self as a be so, if for say we get our local mod since them for sweep am go were e belong. Besides who sabi this our persin wey come do that post, sometimes e dey fear people to dey see now newbies dey come post this kind of things for the forum especially e come be our local board. Even self I no even see am for the intro thread make e be say one or two person know am self so that person mind fit strong to dey run parole with am.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samlucky O",
      "created_time": "November 11, 2023, 07:08:28 PM",
      "body": "Quote from: Spaceman1000$ on November 03, 2023, 06:44:00 PMQuote from: Raknik77 on November 03, 2023, 06:08:04 PMNeed btc or usdt in nigeria and these africa countries.I need for test this counties:Algeria 🇩🇿 Morocco 🇲🇦 Ethiopia 🇪🇹 Tanzania 🇹🇿 DR Congo 🇨🇩Mozambique 🇲🇿 Madagascar 🇲🇬 Cote 🇨🇮Niger 🇳🇪 Burkina Faso 🇧🇫 Chad 🇹🇩 Benin 🇧🇯 Tunisia 🇹🇳 Gabon 🇬🇦 Cabo Verde 🇨🇻Lesotho 🇱🇸Botswana 🇧🇼Dominican 🇩🇴Togo 🇹🇬Costa Rica 🇨🇷 Chile 🇨🇱 Panama 🇵🇦 Puerto-Rico 🇵🇷Honduras 🇭🇳 Belize 🇧🇿Suriname 🇸🇷 Guyana 🇬🇾 Trinidad 🇹🇹 Aruba 🇦🇼 Barbados 🇧🇧Saint Lucia 🇱🇨 Grenada 🇬🇩 Bermuda 🇧🇲Martinique 🇲🇶I can send first (small mounth or use escrow btc talk or other exchanger plataform)@aleptc my telegramI don't understand what is your post is trying to portray, is it that you're trying to show countries that use BTC in the world or countries that use BTC in Africa, because there is no write up to back up what you're trying to explain to us for our understanding. You need to backup your post with some explanation on what you mean, or a question you're trying to ask, so we will know how to answer you or give our opinion.Judging from wetting me I dey see, this guy wants pass message on bitcoin trading with African countries but in no want run the stuff for Bitcointalker. if you check the bottom you go see him telegram user name @eleptc on telegram maybe na from there you fit go reason am.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "November 11, 2023, 07:10:10 PM",
      "body": "This type of post is the reason why we need our own moderator in this board,  very important because this is a powerful topic that will not amount to any discussion that can help any member of the local board or even the entire forum. And even on a second note if ops truly belongs to this local board he or she needs to be specific about what he wants and if he is looking to buy Bitcoin,  there are several ways to buy Bitcoin in Nigeria,  you can use many of the p2p exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "November 11, 2023, 07:22:32 PM",
      "body": "Quote from: Nwada001 on November 03, 2023, 07:00:38 PMBut what's in for the OP, and why will people choose to buy from the OP rather than using any Dex that has been existing for years, or better yet, still use a CEX if the person is not concerned about privacy? Instead of taking the risk of dealing with an unknown trader, tinted coins are actually real.I am not saying the op is a scam but I would say it would be very risky to just trust him/her and enter and dealing with the person, guys I think using peer to peer needs a good level of security mind so before you using any service like this always be careful, using an escrow is a great idea but let the escrow not be provided by the service provider. Also OP you can also make this as a post on the service board.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "November 11, 2023, 07:29:50 PM",
      "body": "E bi like sey village people dey worry dis wan so. Na here you see to com run ur test, ba? Abeg, shift enta Binance. I believe dem dey accept ya local currency there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "November 11, 2023, 07:48:49 PM",
      "body": "Granted, the OP may not be a scam but the way the message or request is written may make my fellow Naija brothers and sisters jump into conclusions. And I cannot blame them because we have worked so hard to first build a good reputation in this community. We do not want anything to tarnish it. Secondly, Whatever we have in our wallets was gotten through very hard worked and we'd protect it with whatever we have got. If the OP can be kind enough to make his message clearer and clear our doubts, we'd be most grateful. I hope he or she sees this in time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jamestown70",
      "created_time": "November 12, 2023, 01:47:56 PM",
      "body": "Brother man you gats be careful out here o, make sure say wetin u dey post e dey very legit make Dem no go cast you abeg as newbie wey me and you be I say make I just drop this piece of advise to u",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "November 14, 2023, 09:41:22 AM",
      "body": "Quote from: adultcrypto on November 11, 2023, 12:18:02 PMQuote from: CryptSafe on November 03, 2023, 10:48:00 PMI dey curious say this Padi man no cap like a casa man wey dey our shores o but any how sha we gat reason him mata.  Him want to buy or sell Bitcoin wetin stop am to use centralised exchange wey plenty every where wey no go waste much time Abi Na KYC dey fear am? On top of the transparency wey him say him want him still come put him telegram handle for who Na?  Abi the escrow wey him dey find no dey important again? Or him wey want services no go dey frequent the thread wey him create here to dey see wetin dey happen and lastly, I noticed say this him account na fresh newbie and Na the first post be this which makes me more curious of his intentions.The post no just get clear direction, no beta touchlighting to make am easy for people to know wetin him wan do. Untop of that, the account wey post am na new person for the forum and people no sabi anything about am. I no know how him wan take convince person make e for do business with am. We get plenty means we fit use buy Bitcoin, some na people wey dey the business for long wey don get better reputation.  Anything wey go make person leave those plenty options them must get some motivation and advantages.  For this post, I no see anything like that. If the OP know wetin people don go through untop trading Bitcoin, him go know how to present mater wey e go enter people eye. For people to even think go him sideI no even think say country men go reason him area at all because as it stands now every man eye don open for the system not to talk of to dey do this kind parol with newbie wey no get reputation here because based on this offer, Na only reputable members as you been cap fit run this parol wey country man fit get that confidence sake of say the account holder don already dey established here wey people know very well say him don really contribute or last long for the platform. Na only when e be like that people fit reason go there but anything outside that one na on your own o and anybody wey Cary himself go there get him or herself to blame if anything goes South.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}