{
  "id": "topic_5415771",
  "title": "Editbar",
  "author": "Editbar",
  "created_time": "October 03, 2022, 11:02:46 AM",
  "content": "Hey guys 'How the war of crypto is on office has sanctioned tornado cash  congress is talking about banning mining in the u.sa lot of you know uncertainty with crypto in terms of regulations in us and other countries in Europe as wellbut what is happening now with crypto specifically with tornado cash is that first of all we should know thestatistics are that over uh roughly approximately 92% of the entire cryptocurrency ecosystem has exposure totornado cash in some way or another so the sanctioning on tornado cash and its code how are they going to enforce that?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415771",
  "comments": [
    {
      "author": "Jawhead999",
      "created_time": "October 03, 2022, 02:52:43 PM",
      "body": "Everything can happen because government can easily ban, unban and re-ban Bitcoin when they're don't like it. That's why before later your country ban Bitcoin and any transactions related with Bitcoin will be blocked or frozen, you need to learn about privacy and how to become anonymous.Tonardo cash get sanctioned because blockchain analysis is target them, Chipmixer currently become a reputable mixer and still alive until now. Though we don't know what will happen to Chipmixer in the future, but you can still use their service for your privacy concern.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "October 03, 2022, 03:00:12 PM",
      "body": "Just store your assets on non custodial wallets so that you will be safe no matter what will be the stand of your government on crypto since you are holding your own keys. As @Jawhead stated, Government decision is unpredictable depends on what they can gain. You can use your crypto assets once your government doesn't ban while just holds it in case they prohibit it. Just stay away on centralized services and you are good to go. Bitcoin is operating under the radar of government for long time before. I’m sure crypto will survive on this was since most of the project is decentralized.We can always do a P2P exchange just like the old times if the government controls CEX.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitkanu",
      "created_time": "October 03, 2022, 03:31:03 PM",
      "body": "Tornado cash is dead. The regulators are always putting the money laundering as the main problem that must be solved. So many criminals are using it. If you are considering the ban for tornado cash as a bad thing and then you must be also supporting scammers and hackers stealing money from people. Decentralization was only bullshit. It can't be trusted again. We didn't actually need anything to be decentralized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "October 04, 2022, 01:48:06 AM",
      "body": "Quote from: Editbar on October 03, 2022, 11:02:46 AMfirst of all we should know thestatistics are that over uh roughly approximately 92% of the entire cryptocurrency ecosystem has exposure totornado cash in some way or another Such a number is absurd, what sources do you get that number from? Quote from: Editbar on October 03, 2022, 11:02:46 AMso the sanctioning on tornado cash and its code how are they going to enforce that? If we talk about DApps there will be a single centralized point that authority might be able to enforce the related regulation, as has been happening, Tornado Cash has few centralized points as in result, governments are able to block and censor it. But do note that deep down in the other layer, the smart contract still exists and the platform front is still accessible. Lastly, based on the latest OFAC sanction, it is concluded those in the US are able to interact with the code and Tornado Cash, but they are prohibited to engage in any transaction[1].[1] https://home.treasury.gov/policy-issues/financial-sanctions/faqs/1076",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "October 04, 2022, 03:08:59 AM",
      "body": "Quote from: vanesha on October 03, 2022, 03:28:36 PMI think after tornado.cash the next target will be monero coins. If this is the case it is not good to store assets in privacy coins, sadly why are privacy coins being targeted by them, if indeed it is an illegal transaction it should not be related to privacy coins, I may have heard of mixing services for illegal transactions, but I'm sure it's not pseudo but they generalize it all.They will target every privacy coin out there to prevent it to be used by crypto users to store their crypto assets so that the government has the access to see the total amount of their people's cryptos and they cannot hide from their government or do some strange transactions because they are being monitored. When they completely get rid of it, they will make a plan on how to tax people that are holding bitcoins. Luckily is not that easy to do those things and we still have some people who always make a way to make your crypto assets amount not visible to others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smack That Ace",
      "created_time": "October 04, 2022, 03:32:59 AM",
      "body": "Quote from: Eternad on October 03, 2022, 03:00:12 PMBitcoin is operating under the radar of government for long time before. I’m sure crypto will survive on this was since most of the project is decentralized.We can always do a P2P exchange just like the old times if the government controls CEX.  I don't think most of the projects today are decentralized, in my opinion most of them are completely centralized. Today's projects are just trying to focus on cheap transaction fees, fast processing speed. To do this, it is necessary to trade some decentralization in exchange for it, while the original goal of cryptocurrencies was to be decentralized in the same way that bitcoin did. For example, ETH in exchange for scalability and low gas fees, ETH abandoned POW and switched to POS. Things don't seem to be going according to the original goal and perhaps we are gradually accepting that because we only look at profits and pay little attention to other benefits. If the government declares war on cryptocurrencies, only bitcoin and very few other coins will survive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ben Barubal",
      "created_time": "October 04, 2022, 06:34:16 AM",
      "body": "Quote from: Editbar on October 03, 2022, 11:02:46 AMHey guys 'How the war of crypto is on office has sanctioned tornado cash  congress is talking about banning mining in the u.sa lot of you know uncertainty with crypto in terms of regulations in us and other countries in Europe as wellbut what is happening now with crypto specifically with tornado cash is that first of all we should know thestatistics are that over uh roughly approximately 92% of the entire cryptocurrency ecosystem has exposure totornado cash in some way or another so the sanctioning on tornado cash and its code how are they going to enforce that? -  We can't do anything about what they prohibit, as long as the only thing I see that we should do is put or hide our cryptocurrency assets in a safe wallet. Unfortunately, in these instances, many cryptocurrencies are removed from the list of exchange platforms, just like other stablecoins and so on.It is still good to hold assets coins that are not private coins according to my opinion and view on this matter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "October 04, 2022, 07:22:09 AM",
      "body": "Obvioualy government will hunt anything like tornadocash. Why? Simple crimes happened on mixers even how we can defend it. Even popular mixers except tornado are beind for laundering. Yes we have people concern on privacy thats why there is service like this. But there are people who blend and simply hiding their wrong doings with the use of these mixers. Any government would be alarm on that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptobadshah",
      "created_time": "October 04, 2022, 08:22:57 AM",
      "body": "I think private technology will spread and save more money treasury must decide if this is a surgical fix for tornado cash or if they 'll outlaw all privacy solutions the crypto industry may fight US government pressure to crack down on financial anonymity by doubling down on illegal technologies maybe now it's tougher to be surgical with sanctions and all crypto must be destroyed or disrupted improbable if this is any indication this war will be long some crypto leaders say the restriction is unfair illegal and a threat to user privacy the industry's most essential principle the decision could make thing worse between crypto privacy advocates and the federal government in a way that will affect the area for years to come.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "October 04, 2022, 09:00:16 AM",
      "body": "First of all please explain the term Crypto Wars i would like to know what type of answer you want as according to my Mindsetup you must be talking about the crypto War on the Bear vs Bull or may be it belongs to the Pow vs PoS as these topics can be explained as the crypto war.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "October 04, 2022, 05:19:23 PM",
      "body": "I do not think that we would have \"people vs governments\" type of war ever in the crypto world. At the end of the day, we are talking about something that is going to be beneficial for the governments to track and tax it instead of be against it, and that is what we should be aiming at.I am not saying that it is a good idea to track everyone and tax them, that would be bad as well and it would centralize the way we use crypto at the very best case, and could be a lot worse in the long term. But if governments can do that, then isn't it better to make money off it, then ban it? What could crypto do to hurt the economy, it would only improve it if you ask me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "October 04, 2022, 09:14:32 PM",
      "body": "Quote from: vanesha on October 03, 2022, 03:28:36 PMI think after tornado.cash the next target will be monero coins. If this is the case it is not good to store assets in privacy coins, sadly why are privacy coins being targeted by them, if indeed it is an illegal transaction it should not be related to privacy coins, I may have heard of mixing services for illegal transactions, but I'm sure it's not pseudo but they generalize it all.It's the other way around, it was Monero was the first target years ago and that it why exchanges are mostly banning Monero because of this. The IRS even offered a bounty of $625,000 to crack Monero's codehttps://cointelegraph.com/news/the-irs-offers-a-625-000-bounty-to-anyone-who-can-break-monero-and-lightningSo I would say that this war is ongoing since 2017, when we reach a all time high and every financial regulatory bodies is onto our heel.But this is going to be cyclical, we might see the demise of Tornado Cash but for sure another one will replace it. And be more hard to crack.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "October 04, 2022, 09:51:29 PM",
      "body": "Quote from: Hamza2424 on October 04, 2022, 09:00:16 AMFirst of all please explain the term Crypto Wars i would like to know what type of answer you want as according to my Mindsetup you must be talking about the crypto War on the Bear vs Bull or may be it belongs to the Pow vs PoS as these topics can be explained as the crypto war.I guess it’s about Crypto war against the government, since he talks about the regulation and the current problem of some projects dealing with the government. Remember that cryptocurrency is a revolutionary currency which aim to operate out of the sight or control of any government but it looks like we can’t really escape them since they still have the power to regulate and in this war, we have no choice but to comply with the government agencies or else, they can ban crypto easily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "October 04, 2022, 10:25:15 PM",
      "body": "They can do it if they want to, there's even Canada that had done the same thing of banning some crypto transactions just because of those labor worker's rallies.I don't see it as a war because eventually, these governments that have been up and against it will have come to realize what they're missing. Could you remember India that they've been in the news about banning crypto and then later changed their minds about it? That's why, these officials are on the state of being confused as they still don't understand wholly the function and concept of crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "October 04, 2022, 11:08:53 PM",
      "body": "Quote from: Editbar on October 03, 2022, 11:02:46 AM....a lot of you know uncertainty with crypto in terms of regulations in us and other countries in Europe as wellI don't know about you or anyone else but we've been talking about regulation for years so it doesn't really surprise me anymore. Privacy invading policies have already been accepted by centralized and custodial exchange traders. A lot of users also moved away from privacy coins as seen in the decline of their market capitalization. All these just points out that crypto is moving towards greater adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "October 05, 2022, 06:07:31 AM",
      "body": "Quote from: Editbar on October 03, 2022, 11:02:46 AMHey guys 'How the war of crypto is on office has sanctioned tornado cash  congress is talking about banning mining in the u.sa lot of you know uncertainty with crypto in terms of regulations in us and other countries in Europe as wellbut what is happening now with crypto specifically with tornado cash is that first of all we should know thestatistics are that over uh roughly approximately 92% of the entire cryptocurrency ecosystem has exposure totornado cash in some way or another so the sanctioning on tornado cash and its code how are they going to enforce that? 92 percent? I doubt that. It's the first time I heard about Tornado Cash as I am not a big fan of mixers. Plus, there's already one which is well known in this forum. Money laundering had always been an issue for a mixer business and reputation will be a big part of how they will stay in business for a long time. When illegal funds entered their service, how do they deal with it? Will they let it slide for the profits in transaction fees or will they take a look at it and report it to authorities? But, that takes out the anonymity and privacy the buyer is trying to achieve so it becomes a conflict.There's big money in cryptocurrencies now, expect the government to look at it every time they see large amounts flowing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "justdimin",
      "created_time": "October 05, 2022, 07:09:23 PM",
      "body": "Quote from: danherbias07 on October 05, 2022, 06:07:31 AM92 percent? I doubt that. It's the first time I heard about Tornado Cash as I am not a big fan of mixers. Plus, there's already one which is well known in this forum. Money laundering had always been an issue for a mixer business and reputation will be a big part of how they will stay in business for a long time. When illegal funds entered their service, how do they deal with it? Will they let it slide for the profits in transaction fees or will they take a look at it and report it to authorities? But, that takes out the anonymity and privacy the buyer is trying to achieve so it becomes a conflict.There's big money in cryptocurrencies now, expect the government to look at it every time they see large amounts flowing.If you look at the money and where it comes from and find out it is an illegally attained money and report to law enforcement, then you are not going to be purely decentralized and fair, it is going to be centralized, and other people may not prefer you neither.The point of mixers is not to be followed, so that your money would be going through many other stuff to reach its point and no government could follow you, even if tax reasons alone. If you check it and report it, then why even mix it? It’s found out anyway and it is not going to be worth mixing. You either accept everyone, or you do not do a mixing business at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "add1ct3dd",
      "created_time": "October 06, 2022, 03:18:31 PM",
      "body": "Cryptos are already uncertain due to their value or nature while regulations on the other hand are already certain and can happen on any parts of the world but cryptos can still continue after that because there are still countries that won't join the same movement. Each of them has their own views towards crypto.Some see it as a threat while some see many possibilities around it. Tornado cash is only a mixing service and even if they shut it down, I don't think it will have a big impact in the entire crypto market. There are past mixing service that have the same faith as tornado cash but cryptos are still moving continuously so don't worry now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "October 06, 2022, 11:01:21 PM",
      "body": "Quote from: Editbar on October 03, 2022, 11:02:46 AMHey guys 'How the war of crypto is on office has sanctioned tornado cash  congress is talking about banning mining in the u.sa lot of you know uncertainty with crypto in terms of regulations in us and other countries in Europe as wellI am following the crypto space since the middle of 2017 and since then the whole topic of regulations of crypto or the ban of crypto was a topic that was always present since then. Sometimes it was not the number one topic but a few times news about an incoming ban of cryptos for example in china or the banning of mining farms in china were pretty big news back then and also had pretty big (negative) impact on the prices of all cryptos. After i have witnessed so many news and rumors about possible bans and/or regulations for cryptos in the past 5 years, i don't really worry that much about that nowadays to be honest. So far no regulation or ban could really hurt cryptos in the long run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}