{
  "id": "topic_5471451",
  "title": "NFTflow8545",
  "author": "NFTflow8545",
  "created_time": "October 24, 2023, 09:36:55 AM",
  "content": "Well from the last one week I have been following the Pinksale project and found 90% of the projects are the meme coins.And those meme coins are actually going for 5x ,10x after the launch because of Low MC and then the price shoots So when I dig more into this then i found a project name Opiumerc.com $OPIUM The best part is no team tokens , No tax , and contract renounced and the tokenomics are just presale and LP else are already burned also I found the project launch at Low MC so what you think is OPIUM also do 5x at launch or not ?Presale link is https://www.pinksale.finance/launchpad/0xb1ca927B17325395C18337ab3E826E7bD7c678d2?chain=ETHcheck out and share your thoughts",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471451",
  "comments": [
    {
      "author": "Tytanowy Janusz",
      "created_time": "October 25, 2023, 06:07:46 AM",
      "body": "Quote from: NFTflow8545 on October 24, 2023, 09:36:55 AMThe best part is no team tokens , No tax , and contract renounced and the tokenomics are just presale and LP else are already burned Yea I know those tricks. presale ends after 1 second because there is so much demand for this wonderful project (in fact, the team just loaded the bag at a cost of zero, pretending that someone else was purchasing). And this is assuming that the token does not have mechanisms such as honeypot, high sale tax or minting new tokens by team without anyone persmission.Avoiding meme coins. They are here from only one cause. To scam us and get more capital to make an even bigger scam after.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NFTflow8545",
      "created_time": "October 25, 2023, 08:35:21 AM",
      "body": "Quote from: Tytanowy Janusz on October 25, 2023, 06:07:46 AMQuote from: NFTflow8545 on October 24, 2023, 09:36:55 AMThe best part is no team tokens , No tax , and contract renounced and the tokenomics are just presale and LP else are already burned Yea I know those tricks. presale ends after 1 second because there is so much demand for this wonderful project (in fact, the team just loaded the bag at a cost of zero, pretending that someone else was purchasing). And this is assuming that the token does not have mechanisms such as honeypot, high sale tax or minting new tokens by team without anyone persmission.Avoiding meme coins. They are here from only one cause. To scam us and get more capital to make an even bigger scam after.from last 2 months i have witnessed many meme projects who gives a really great profit to the users so i think we have to be consider these coins as well just be take part in it and take profit and take out all your funds that's the good approach what you think",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "October 25, 2023, 08:41:24 AM",
      "body": "Quote from: NFTflow8545 on October 25, 2023, 08:35:21 AMfrom last 2 months i have witnessed many meme projects who gives a really great profit to the users so i think we have to be consider these coins as well just be take part in it and take profit and take out all your funds that's the good approach what you thinkI know a guy who take part in the lottery and won. He put in $2 on a scratch card and took out $200, making his investment 100x. Impressive isn't it? Worth following? No, because the statistical return on $1 on scratch cards is about 80 cents, because, surprise here, the lottery is not a charitable institution and the prizes are calculated to bring profits to the organizers. So the risk/reward is far from good. It's the same with meme coins, but the return on $1 is statistically probably about 10 cents considering that they are created to extract capital from dupes, hundreds of them are created every day and most end in a rugpull or some other type of scam. you're tricking people into buying something that has zero value. You know about it? onlye because maybe 10% of them will succeed and they will be among the small group of those who got out in time before others who didn't make it. When \"getting out on time\" is just about luck. A bit like playing crash in a casino. Except that currently good crypto casinos have a \"provably fair\" mechanism and calculable winning probability... unlike meme coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cuongtruna81",
      "created_time": "October 25, 2023, 09:18:28 AM",
      "body": "The project may consider buying tokens on its own to boost investor enthusiasm. In the market, there is always an inherent risk, and investors tend to be cautious when it comes to new projects if they can't see everything they need. I really don't know much about this project; it has a name that's quite similar to the popular Optimition project. It's possible that this project has a name similar to OP to attract investors, but it still lacks many things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wallet4bitcoin",
      "created_time": "October 25, 2023, 09:32:18 AM",
      "body": "The folks who have been around the space for a long time knows better than telling themselves that this token will be a good buy, by merely reading it off a thread as an OP. There are loads of features to look out for in projects rather than the prospected 5x - 10x. I am also led to say that a member of the said project can create a new forum account just to make an OP on the project but it won't get the required attention if things aren't put in place as supposed to by standard projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "October 25, 2023, 09:44:13 AM",
      "body": "Quote from: NFTflow8545 on October 24, 2023, 09:36:55 AMPresale link is https://www.pinksale.finance/launchpad/0xb1ca927B17325395C18337ab3E826E7bD7c678d2?chain=ETHcheck out and share your thoughts Since its on Pinksale and their contract is out.  Everyonr is free to check the content of their smart contract by going to Defi platform and used the scanner feature where they will check it and reveal if their code is harmful or safe. Its like a detailed summary of what they already been code. If there are backdoor minting, honeypot or any form of illegal attempt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "October 25, 2023, 10:21:26 AM",
      "body": "Quote from: NFTflow8545 on October 24, 2023, 09:36:55 AMWell from the last one week I have been following the Pinksale project and found 90% of the projects are the meme coins.And those meme coins are actually going for 5x ,10x after the launch because of Low MC and then the price shoots So when I dig more into this then i found a project name Opiumerc.com $OPIUM The best part is no team tokens , No tax , and contract renounced and the tokenomics are just presale and LP else are already burned also I found the project launch at Low MC so what you think is OPIUM also do 5x at launch or not ?Presale link is https://www.pinksale.finance/launchpad/0xb1ca927B17325395C18337ab3E826E7bD7c678d2?chain=ETHcheck out and share your thoughts Your tag shows how shill you are in different kind of Project in which I believe being part of the group who wanted to lure investors and be trapped.created an account week ago but showing in your post how good you are in understanding the forum and the project you are promoting?like what says in your tag, your account seems to be not trusted.Quote from: cuongtruna81 on October 25, 2023, 09:18:28 AMThe project may consider buying tokens on its own to boost investor enthusiasm. In the market, there is always an inherent risk, and investors tend to be cautious when it comes to new projects if they can't see everything they need. I really don't know much about this project; it has a name that's quite similar to the popular Optimition project. It's possible that this project has a name similar to OP to attract investors, but it still lacks many things.you got it mate, the team can also buy significant amount of coins to show people how popular and trusted they are, like what had happened in ICO and IEO in the past in which the team tries to believe the people they reached Max Cap but scamming their  bounty hunters .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "October 25, 2023, 10:53:00 AM",
      "body": "Quote from: NFTflow8545 on October 25, 2023, 08:35:21 AMfrom last 2 months i have witnessed many meme projects who gives a really great profit to the users so i think we have to be consider these coins as well just be take part in it and take profit and take out all your funds that's the good approach what you thinkAny investment based on the fact that others have made a profit from this investment should be avoided, and this should not be a reason for your investment.Meme projects are based on the fact that they are successful because one of the meme projects succeeded, and even Dogecoin succeeded, not because it is something new, but because of the increased demand for it after Elon Musk’s tweets. What you are trying to say is more like that the price of Bitcoin reached more than $30k in 10 years. I will invest in any currency. I am encrypted and I will definitely be rich in 10 years because they will all reach $30k, which is completely wrong.Think analytics, not feelings",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}