{
  "id": "topic_5413646",
  "title": "OgNasty",
  "author": "OgNasty",
  "created_time": "September 15, 2022, 08:52:00 AM",
  "content": "I know that Ravencoin was supposed to be a securities platform of sorts and was designed for users to be able to purchase a ticker symbol.  My question is if these are actually traded anywhere?  Is anyone actually using these for anything?  With Ravencoin's sudden rise in popularity from ETH 2.0's PoW demise, it seems like people might be looking into these names and maybe starting to create some projects using them.  Is there a central place where this sort of activity is taking place?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413646",
  "comments": [
    {
      "author": "ahmia39",
      "created_time": "September 18, 2022, 05:14:18 PM",
      "body": "Reporting from the official website ravencoin.org, Ravencoin is a peer-to-peer blockchain, handling the efficient creation and transfer of assets from one party to another.Ravencoin is a protocol based on a Bitcoin code fork that adds features that are specifically, focused on enabling tokens to be issued on the Ravencoin blockchain.These tokens can have any property the owner decides – so they can be limited in number, named, and issued as securities or as collectibles.According to Ravencoin.org, you can create your own security token in minutes and trade it worldwide.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "September 18, 2022, 08:39:30 PM",
      "body": "Quote from: ahmia39 on September 18, 2022, 05:14:18 PMReporting from the official website ravencoin.org, Ravencoin is a peer-to-peer blockchain, handling the efficient creation and transfer of assets from one party to another.Ravencoin is a protocol based on a Bitcoin code fork that adds features that are specifically, focused on enabling tokens to be issued on the Ravencoin blockchain.These tokens can have any property the owner decides – so they can be limited in number, named, and issued as securities or as collectibles.According to Ravencoin.org, you can create your own security token in minutes and trade it worldwide.But you haven't given him the answer he wants. All you did was just getting him generic information written on their websiteThere are a few I know, but they are more about NFTs and seem not so popular. I personally haven't used the platforms so this is not an endorsement1. https://www.ravenist.com2. https://rvnft.art/nft-marketplace3. https://mellori.market/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "September 21, 2022, 07:40:27 AM",
      "body": "Quote from: JeromeTash on September 18, 2022, 08:39:30 PMThere are a few I know, but they are more about NFTs and seem not so popular. I personally haven't used the platforms so this is not an endorsement1. https://www.ravenist.com2. https://rvnft.art/nft-marketplace3. https://mellori.market/Interesting.  I didn't know there were people trading NFTs on Ravencoin's blockchain.  I was more interested in knowing about their security names, where you have a ticker symbol and can issue dividends or communicate with those who buy shares (or whatever they're called).  Wasn't that what Ravencoin was created for?  I'm a bit surprised to see NFT trading sites...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}