{
  "id": "topic_5452062",
  "title": "Zoomic",
  "author": "Zoomic",
  "created_time": "May 09, 2023, 08:43:33 AM",
  "content": "I searched the internet for the cause of the mempool congestion with these words \"What is the cause of mempool congestion?\".The below answer was given me.\"A surge in Taproot usage and ordinal inscriptions has put pressure on the Bitcoin network. This has caused transaction fees to skyrocket and the mempool to clog up\"https://www.coindesk.com/business/2023/05/08/binance-pauses-bitcoin-withdrawals-for-the-second-time-in-24-hours/#:~:text=Binance.Without winding my head much about it, I read down the article and discovered where Binance after pausing and resuming BTC transaction is working on implementing the Lightening Network as a solution to the congested mempool. I think this is the perfect time for Lightening Network to prove its importance to everyone and even its doubters.If you open a channel, you can continue your transactions in the channels and will only close it when the mempool is decongested. I think bitcoin on its own have a self healing medication (the LN).",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452062",
  "comments": [
    {
      "author": "darkv0rt3x",
      "created_time": "May 09, 2023, 09:19:13 AM",
      "body": "Problem is that even LN needs the onchain features to open and close channels. And despite the fact that I do not believe that this might be a problem in the near future, it's a fact that the more users the LN has, the more channels will need to be opened and closed. And when that needs to happen, and if the fees keep the way they are now, we will be waiting ages for channel open and closures and paying stupid high fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mocacinno",
      "created_time": "May 09, 2023, 09:27:47 AM",
      "body": "Quote from: darkv0rt3x on May 09, 2023, 09:19:13 AMProblem is that even LN needs the onchain features to open and close channels. And despite the fact that I do not believe that this might be a problem in the near future, it's a fact that the more users the LN has, the more channels will need to be opened and closed. And when that needs to happen, and if the fees keep the way they are now, we will be waiting ages for channel open and closures and paying stupid high fees.Certainly a correct answer.I did want to add some additional information tough: it's pretty common practice to rebalance your channels, so if person A has a channel with person B (and A is using it to send funds to B all the time), B has a channel with C (and B is using it to send funds to C all the time) and C has a channel with A (and C is using it to send funds to A all the time), it's possible they can just rebalance their channels once in a while and closing and reopening a channel would only need to happen very rarely.It is true, however, that at this point it'll cost you a lot of money to open a channel. It is also true that if you'll be using the LN only to send funds (and never receive) or if somebody opens a channel with you only to send you funds (which you'll never spend), you'll be forced to open/close channels on a regular basis.... But as long as you have a lot of channels already open, and you spend about the same amount as you receive, it *should', *in theory* more or less even out...This congestion isn't fun for us, and eventough the LN will be a viable sollution, we *should have* opened channels when we were paying 1 sat/vbyte in fees... Opening channels right now will be costly, but the cost might be lower for opening a channel than for a couple dozen \"regular\" on chain transactions...Man, i'm really bummed out that i had to shut down my lightning node due to rising dedicated server prices... I had so many open channels which i had to close just a couple of weeks ago...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "May 09, 2023, 02:18:21 PM",
      "body": "Quote from: mocacinno on May 09, 2023, 09:27:47 AMQuote from: darkv0rt3x on May 09, 2023, 09:19:13 AMProblem is that even LN needs the onchain features to open and close channels. And despite the fact that I do not believe that this might be a problem in the near future, it's a fact that the more users the LN has, the more channels will need to be opened and closed. And when that needs to happen, and if the fees keep the way they are now, we will be waiting ages for channel open and closures and paying stupid high fees.Certainly a correct answer.I did want to add some additional information tough: it's pretty common practice to rebalance your channels, so if person A has a channel with person B (and A is using it to send funds to B all the time), B has a channel with C (and B is using it to send funds to C all the time) and C has a channel with A (and C is using it to send funds to A all the time), it's possible they can just rebalance their channels once in a while and closing and reopening a channel would only need to happen very rarely.It is true, however, that at this point it'll cost you a lot of money to open a channel. It is also true that if you'll be using the LN only to send funds (and never receive) or if somebody opens a channel with you only to send you funds (which you'll never spend), you'll be forced to open/close channels on a regular basis.... But as long as you have a lot of channels already open, and you spend about the same amount as you receive, it *should', *in theory* more or less even out...This congestion isn't fun for us, and eventough the LN will be a viable sollution, we *should have* opened channels when we were paying 1 sat/vbyte in fees... Opening channels right now will be costly, but the cost might be lower for opening a channel than for a couple dozen \"regular\" on chain transactions...Man, i'm really bummed out that i had to shut down my lightning node due to rising dedicated server prices... I had so many open channels which i had to close just a couple of weeks ago...Oh yeah, indeed. And seems that many transactions going on in the LN are in fact from rebalances. But yeah, good points you made there.About the LN node, I'm sorry to hear that. I personally run my own LN node at my home. Of course that sometimes I have downtimes due to power going out for a couple of hours, but my node is small and mostly for routing. I don't run any services with it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "May 09, 2023, 05:43:46 PM",
      "body": "Quote from: Zoomic on May 09, 2023, 08:43:33 AMI think this is the perfect time for Lightening Network to prove its importance to everyone and even its doubters.Why? Because Binance thinks on adopting it? Lightning is already accepted in lots of exchanges. In fact, it was just yesterday that I mentioned some.Quote from: BlackHatCoiner on May 08, 2023, 08:09:11 PMBitfinex, Fixedfloat, hodlhodl, Bitstamp.There are more, which don't require KYC, such as boltz and robosats. Quote from: darkv0rt3x on May 09, 2023, 09:19:13 AMProblem is that even LN needs the onchain features to open and close channels.The real problem, in my opinion, is that the overwhelming majority of Binance users don't even know how to run a full node. I can't think of them downloading a lightning client, running a node 24/7 and having their channels re-balanced frequently. Technical competence is the bad part of lightning, as I must have repeated in this board.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "May 09, 2023, 07:23:53 PM",
      "body": "Quote from: BlackHatCoiner on May 09, 2023, 05:43:46 PMQuote from: Zoomic on May 09, 2023, 08:43:33 AMI think this is the perfect time for Lightening Network to prove its importance to everyone and even its doubters.Why? Because Binance thinks on adopting it? Lightning is already accepted in lots of exchanges. In fact, it was just yesterday that I mentioned some.Quote from: BlackHatCoiner on May 08, 2023, 08:09:11 PMBitfinex, Fixedfloat, hodlhodl, Bitstamp.More exchanges are using lightning network. You can look at these exchanges, they are all supporting lightning network: Quote from: Oshosondy on April 23, 2023, 08:40:33 PMThere are many exchanges that support lightning network. You can check the list: https://github.com/theDavidCoen/LightningExchangesIf you click on that link, there are 25 exchanges there that are now supporting lightning network. KrakenBitfinexBitstampOKXOKcoinNiceHashTheRockTrading (excluding it because it is said to be a scam exchange and no more existing) SouthxchangeCoinCornerBitMexBudaBullBitcoinBitarooRiver FinancialVBTC VietnamFixedFloatLOFTPrimeBitSimpleFXBitcoinVNBipaBoltzKolliderLN MarketsTaurosI excluded Paxful because it is no more existing.Paxful has begin operation back, it is no more closed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BrianH",
      "created_time": "May 09, 2023, 09:21:29 PMLast edit: May 09, 2023, 09:34:26 PM by BrianH",
      "body": "Quote from: BlackHatCoiner on May 09, 2023, 05:43:46 PMThere are more, which don't require KYC, such as  robosats. Dangerous and complicated. Use BisQ for currency exchanges. We should all try to use the same open-source platform to increase the fluidity of the market.Other Non-KYC exchanges for coin-to-coin conversions (lightning support marked):https://www.reddit.com/r/Bitcoin/comments/cd1fr8/list_of_nokyc_instant_exchanges/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "May 09, 2023, 10:53:06 PM",
      "body": "Quote from: BrianH on May 09, 2023, 09:21:29 PMOther Non-KYC exchanges for coin-to-coin conversions (lightning support marked):https://www.reddit.com/r/Bitcoin/comments/cd1fr8/list_of_nokyc_instant_exchanges/The list seems to be outdated as it's about 4 years oldSome exchanges are no longer the same as they used to be, while others are now non-operationalFor example, the following are all offline/non-operational at the momentCode:1. https://instaex.io2. https://www.liquality.io3. https://liquiditi.io4. https://golightning.club/5. https://ion.radar.tech/redshift#swap-assets6. https://bitflash.club/7. https://mercuriex.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "May 11, 2023, 06:36:42 PM",
      "body": "Quote from: BlackHatCoiner on May 09, 2023, 05:43:46 PMQuote from: Zoomic on May 09, 2023, 08:43:33 AMI think this is the perfect time for Lightening Network to prove its importance to everyone and even its doubters.Why? Because Binance thinks on adopting it? Lightning is already accepted in lots of exchanges. In fact, it was just yesterday that I mentioned some.Quote from: BlackHatCoiner on May 08, 2023, 08:09:11 PMBitfinex, Fixedfloat, hodlhodl, Bitstamp.There are more, which don't require KYC, such as boltz and robosats. Quote from: darkv0rt3x on May 09, 2023, 09:19:13 AMProblem is that even LN needs the onchain features to open and close channels.The real problem, in my opinion, is that the overwhelming majority of Binance users don't even know how to run a full node. I can't think of them downloading a lightning client, running a node 24/7 and having their channels re-balanced frequently. Technical competence is the bad part of lightning, as I must have repeated in this board. So what happens when Lightening Network gets flooded with endless exchanger transactions and acceptance from more and more exchangers in the future?I am curious about the concept of LN. Will it be same story with LN in the future if exchangers start adopting it for the escape from current bitcoin network congestion? Definitely LN is on chain and will get many restrictions as it grows. In similar fashion as bitcoin network did. The current issue is with Ordinal NFT which can be upgraded \"on chain\" meaning they are putting extra burden on the chain with numerous packets moving in and out. Wouldn't that be the same case with LN in the future. Also, will this ever stop like this or we need to keep forming new type of networks one after another. Please ignore my less technical background in the field of blockchain and how it works, I am still prospering on that side.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "May 11, 2023, 06:50:01 PM",
      "body": "Quote from: Flexystar on May 11, 2023, 06:36:42 PMSo what happens when Lightening Network gets flooded with endless exchanger transactions and acceptance from more and more exchangers in the future?I suppose we put regular Bitcoin users at ease. Quote from: Flexystar on May 11, 2023, 06:36:42 PMDefinitely LN is on chain and will get many restrictions as it grows.Lightning is off-chain, and depending on how it grows, it probably gets less restrictions as liquidity increases. Quote from: Flexystar on May 11, 2023, 06:36:42 PMWouldn't that be the same case with LN in the future. No because there cannot be Ordinals in lightning.Quote from: Flexystar on May 11, 2023, 06:36:42 PMAlso, will this ever stop like this or we need to keep forming new type of networks one after another.Nobody can give a certain answer to this, but I'd rely on the fact that humans are developing creatures.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "May 11, 2023, 07:01:12 PM",
      "body": "Quote from: Flexystar on May 11, 2023, 06:36:42 PMSo what happens when Lightening Network gets flooded with endless exchanger transactions and acceptance from more and more exchangers in the future?Bear in mind that Lightning is still very much in its infancy. There are a lot of further developments which are in the works which we will hopefully see come to fruition over the coming years, and there will be plenty of more developments which have not yet been thought of.Touching on darkv0rt3x's point above regarding opening and closing channels - two developments which are currently ongoing are Eltoo and Channel Factories. In short, these would allow multiple users to cooperate to make a single on chain transaction, and then on top of that single transaction open as many payment channels between each other as they like. This would significantly decrease the on chain footprint of Lightning channels.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "May 11, 2023, 07:18:15 PM",
      "body": "Quote from: Flexystar on May 11, 2023, 06:36:42 PMSo what happens when Lightening Network gets flooded with endless exchanger transactions and acceptance from more and more exchangers in the future?Such thing won't happen from night to day. I would say it will follow the market rules. The more need for open and closing channels, the more channels will be created, more liquidity, more development, more features, more security, more everything.We have only a handfull() LN implementations. Probably, if demand \"demands\" more implementations will appear and more offer there will be.Quote from: Flexystar on May 11, 2023, 06:36:42 PMI am curious about the concept of LN. Will it be same story with LN in the future if exchangers start adopting it for the escape from current bitcoin network congestion? Definitely LN is on chain and will get many restrictions as it grows. In similar fashion as bitcoin network did.I have no idea how one could elaborate a rationale on that as it may depend on so many factors that is quite hard to predict a possible path. Once more, I would say that will also follow what the market demands, even in conceptual terms. When there is a problem / challenge, I'm pretty sure that there are enough bright people to think out pretty advanced solutions to satisfy the demand.Quote from: Flexystar on May 11, 2023, 06:36:42 PMThe current issue is with Ordinal NFT which can be upgraded \"on chain\" meaning they are putting extra burden on the chain with numerous packets moving in and out. Wouldn't that be the same case with LN in the future. Also, will this ever stop like this or we need to keep forming new type of networks one after another. Please ignore my less technical background in the field of blockchain and how it works, I am still prospering on that side.Not exactly sure what you mean \"to be the same case with LN\". LN needs the L1 and it is supposed to need as it's the base layer that provides the critical features to all layers above, such as decentralization, security and all other properties. And LN is actually helping the base layer to handle the bourdain of handling the increasing number of transaction and also handling the speed that we can make transactions, theoretically competing with other fiat systems such as VISA.Quote from: o_e_l_e_o on May 11, 2023, 07:01:12 PMQuote from: Flexystar on May 11, 2023, 06:36:42 PMSo what happens when Lightening Network gets flooded with endless exchanger transactions and acceptance from more and more exchangers in the future?Bear in mind that Lightning is still very much in its infancy. There are a lot of further developments which are in the works which we will hopefully see come to fruition over the coming years, and there will be plenty of more developments which have not yet been thought of.Touching on darkv0rt3x's point above regarding opening and closing channels - two developments which are currently ongoing are Eltoo and Channel Factories. In short, these would allow multiple users to cooperate to make a single on chain transaction, and then on top of that single transaction open as many payment channels between each other as they like. This would significantly decrease the on chain footprint of Lightning channels.Yeah, I'm quite anxious waiting for channel factories. I think it's one other very needed and handy feature for the LN. Once more this will allow to decrease a bit more the amount of transactions on the L1 by allowing us to manage channels without having to constantly close and reopen channels due to lack of capacity!From Bitcoin OpTech, put simple:QuoteChannel factories are a multi-user contract capable of opening payment channels without putting the channel-open transaction onchain.For example, three users create a channel factory by each of them depositing some funds to an onchain 3-of-3 multisig address. Using non-broadcast (offchain) spends from that address, they open payment channels with each other (e.g. Alice↔Bob, Alice↔Charlie, and Bob↔Charlie). They can then use those channels with the same security as if they had opened them onchain because, if necessary, they can broadcast the channel-open transactions. However, they don’t need to broadcast those transactions if both parties act cooperatively, allowing them to reduce the amount of block chain data used.For large numbers of users under ideal situations, channel factories can reduce the onchain size and fee cost of LN by 90% or more.https://bitcoinops.org/en/topics/channel-factories/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "May 13, 2023, 03:51:47 PM",
      "body": "Getting familiar with lightning network of bitcoin is not that simple for an everage bitcoin user, and for the record after years we aren't completely moved to Bech32 segwit address which saves half fees compared to older version so do you think people will really switch to LN until the congestion becomes normal? I doubt it happens this time.Well good thing is the fees are pretty low compared to what we has seen for the past few days so I hope this is the end of congestion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "May 13, 2023, 10:53:32 PM",
      "body": "Quote from: jrrsparkles on May 13, 2023, 03:51:47 PMWell good thing is the fees are pretty low compared to what we has seen for the past few days so I hope this is the end of congestion.I guess this is where we say there is always calm after a storm.Maybe Ordinals and BRC20 showing up before the next bull run might be a blessing in disguise (The hype for the shitcoins will have died down that no sane person would want to even here about them)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zoomic",
      "created_time": "May 14, 2023, 03:57:36 PM",
      "body": "Quote from: jrrsparkles on May 13, 2023, 03:51:47 PMGetting familiar with lightning network of bitcoin is not that simple for an everage bitcoin user, and for the record after years we aren't completely moved to Bech32 segwit address which saves half fees compared to older version so do you think people will really switch to LN until the congestion becomes normal? I doubt it happens this time.Well good thing is the fees are pretty low compared to what we has seen for the past few days so I hope this is the end of congestion.Getting familiar with Bitcoin Lightening Network is not that simple and also getting familiar with every new addition to the bitcoin is not simple. But at some points those additions maybe become so necessary and using them could be the only way out. Bitcoiners will then have no option than to learn and use them.Many people are moving to bech32 segwit as the legacy fees is extremely high.But despite all odds, LN since inception is growing well. The chart below can show. Of course we don't expect LN to hit global adoption even before BTC. The growth of the bitcoin network should be directly proportional to the growth of LN",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serveria.com",
      "created_time": "May 14, 2023, 05:31:28 PM",
      "body": "Quote from: BlackHatCoiner on May 11, 2023, 06:50:01 PMQuote from: Flexystar on May 11, 2023, 06:36:42 PMWouldn't that be the same case with LN in the future. No because there cannot be Ordinals in lightning.Definitely not, but LN is L2 so it still depends on the main blockchain to function. If LN transactions are stuck somewhere between 500000 monkey and dick pics there's little use in LN.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "May 16, 2023, 09:04:20 AM",
      "body": "Quote from: Oshosondy on May 09, 2023, 07:23:53 PMQuote from: BlackHatCoiner on May 09, 2023, 05:43:46 PMQuote from: Zoomic on May 09, 2023, 08:43:33 AMI think this is the perfect time for Lightening Network to prove its importance to everyone and even its doubters.Why? Because Binance thinks on adopting it? Lightning is already accepted in lots of exchanges. In fact, it was just yesterday that I mentioned some.Quote from: BlackHatCoiner on May 08, 2023, 08:09:11 PMBitfinex, Fixedfloat, hodlhodl, Bitstamp.More exchanges are using lightning network. You can look at these exchanges, they are all supporting lightning network: Quote from: Oshosondy on April 23, 2023, 08:40:33 PMThere are many exchanges that support lightning network. You can check the list: https://github.com/theDavidCoen/LightningExchangesIf you click on that link, there are 25 exchanges there that are now supporting lightning network. KrakenBitfinexBitstampOKXOKcoinNiceHashTheRockTrading (excluding it because it is said to be a scam exchange and no more existing) SouthxchangeCoinCornerBitMexBudaBullBitcoinBitarooRiver FinancialVBTC VietnamFixedFloatLOFTPrimeBitSimpleFXBitcoinVNBipaBoltzKolliderLN MarketsTaurosI excluded Paxful because it is no more existing.Paxful has begin operation back, it is no more closed.This is the beauty of the lightning network, because it makes it faster and cheaper to use it for smaller purchases. And on top of that it (LN) lowers the fees they have to pay to accept the Bitcoin payment we make.Apparently, it simply makes it scalable, more cheaper and even improves bitcoin's privacy in every transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zoomic",
      "created_time": "May 16, 2023, 06:52:27 PM",
      "body": "Quote from: bettercrypto on May 16, 2023, 09:04:20 AMThis is the beauty of the lightning network, because it makes it faster and cheaper to use it for smaller purchases. And on top of that it (LN) lowers the fees they have to pay to accept the Bitcoin payment we make.Apparently, it simply makes it scalable, more cheaper and even improves bitcoin's privacy in every transaction.You quoted a long text of exchanges that have adopted LN and replied this. What you wrote here is not connected to the conversations that you quoted, it would have been better that you dropped it as an independent reply.QuoteApparently, it simply makes it scalable, more cheaper and even improves bitcoin's privacy in every transaction.Can you please explain to me how LN improves bitcoin privacy?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "May 18, 2023, 08:45:15 AM",
      "body": "Quote from: Bitcoin_Arena on May 13, 2023, 10:53:32 PMMaybe Ordinals and BRC20 showing up before the next bull run might be a blessing in disguise (The hype for the shitcoins will have died down that no sane person would want to even here about them)You know what the mempool was before Ordinals and Inscriptions started making use of Taproot to create NFTs and Tokens. I used to make a transaction of 1 sat/vbyte. The lowest transaction that I noticed which was on weekends on last Sunday was 17 sat/vbyte. Almost all the time over 20 sat/vbyte now. If compared to 1 sat/vbyte before, it is 20 times higher now. Another thing is that these coins may survive, an example is the meme coin called pepe, it is also existing on other blockchain like ethereum blockchain. We may think that the tokens may become shotcoins and die, but what if the hype follows the bull run? Bitcoin blockchain would be congested at that time, followed by Ordinals and Inscriptions making the congestion to be far worse because the tokens and non fungible tokens are hyped during bull run and it is a bull market for them too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "May 18, 2023, 12:21:06 PMLast edit: May 18, 2023, 01:22:12 PM by BlackHatCoiner",
      "body": "Quote from: serveria.com on May 14, 2023, 05:31:28 PMDefinitely not, but LN is L2 so it still depends on the main blockchain to function. If LN transactions are stuck somewhere between 500000 monkey and dick pics there's little use in LN.I'm honestly curious if you're frustrated by the monkey pics per se, or by the fact that the miners prioritize transactions which pay more than you do. Quote from: Zoomic on May 16, 2023, 06:52:27 PMCan you please explain to me how LN improves bitcoin privacy?When you send a payment, the receiver doesn't know which lightning node sent it. The intermediary nodes which route transactions neither know the sender nor the receiver. They only know it goes somewhere, from someone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}