{
  "id": "topic_5445615",
  "title": "tg88",
  "author": "tg88",
  "created_time": "March 20, 2023, 12:26:22 AM",
  "content": "Recentemente li esta noticia: Os efeitos da ‘operação sufocamento’ dos EUA no mercado de criptomoedasNos últimos tempos ficou evidente o empenho do governo dos EUA cortar o acesso do mercado cripto ao setor bancário. Durante o governo Obama ocorreu a Operação nomeada Choke Point e o seu objetivo era cortar o acesso dos sites de poker ao sistema bancário. Na noticia cita apenas setor de poker mas li mais sobre a operação e ela abrangia diversos setores: empréstimos, venda de armas, tabaco, etc, etc...  Eu me deparei com esse termo a poucos dias e não sabia que todo esses \"problemas\" que o setor está passando já tinha ocorrido com diversos outros tão recentemente, mudou somente o alvo e agora a operação pode ser chamada de Operação “Choke Point II” apesar das autoridades norte americanas neguem que ela exista.Fico me perguntando se no caso de cassinos e poker essa dificuldade de acesso bancário não foi o que impulsionou o setor a olhar bitcoin e criptomoedas como alternativa?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445615",
  "comments": [
    {
      "author": "joker_josue",
      "created_time": "March 20, 2023, 04:30:46 PM",
      "body": "Por acaso, algum tempo atras debati com um amigo sobre esse tipo de situação: a banca rejeitar todo o dinheiro vindo de exchanges cripto.Segundo ele, isso iria fazer com que o Bitcoin desvaloriza-se e deixa-se de ter valor.Por outro lado, eu lembro que o Bitcoin começou a valorizar bem antes de haver exchanges.Para algo tão dramático acontecer, a medida tinha de ser generalizada em todo o mundo, o que acho difícil. Até porque, num ultimo caso, teríamos El Salvador que não implementaria essa medida (pelo menos enquanto tiver aquele Presidente).Acredito que possa surgir algumas medidas interbancárias, que dificultem a vida as exchanges. Isso já acontece em Portugal, com alguns bancos a rejeitarem abrir contas da única exchange portuguesa. Mas, haverá sempre forma de cambiar, e a dificuldade mais depressa aumenta o preço que o faz descer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "March 21, 2023, 07:58:34 PM",
      "body": "Quote from: tg88 on March 20, 2023, 12:26:22 AMFico me perguntando se no caso de cassinos e poker essa dificuldade de acesso bancário não foi o que impulsionou o setor a olhar bitcoin e criptomoedas como alternativa?Com certeza sim, e hoje em dia nós vemos claramente aqui no fórum por exemplo, que os sites de gambling utilizam muito as criptos pela facilidade que traz, olha o tanto de campanhas que tem por aqui de sites de apostas.Tem casino que já usa a LN do BTC para depósito e retiradas, tem casino que aceita várias outras criptos etcAgora falando mais sobre essa operação, está bem claro que a guerra começou, e acho que no fundo todos nós sabíamos que uma hora ia acontecer, só não sabíamos como.Não sei, e provavelmente nunca iremos saber dos detalhes, das influências, das pessoas envolvidas, mas é muita coisa pra ser apenas coincidência.FTX + BUSD + USDC + Signature Bank + Silvergate + Chipmixer e várias outras coisas que estão acontecendo agora são provas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "March 22, 2023, 04:06:13 AM",
      "body": "Quote from: rdluffy on March 21, 2023, 07:58:34 PMNão sei, e provavelmente nunca iremos saber dos detalhes, das influências, das pessoas envolvidas, mas é muita coisa pra ser apenas coincidência.FTX + BUSD + USDC + Signature Bank + Silvergate + Chipmixer e várias outras coisas que estão acontecendo agora são provas.Eu também ando desconfiado que andam me seguindo. Acredito que já tive vários endereços meus rastreados aqui no Bitcointalk.      Já sei até como fazem para rastrear. Tenho um serviço de contraespionagem. Os Iluminatis, o pessoal do Priorado do Sião e o Opus Dei também estão de olho.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 22, 2023, 07:59:37 AM",
      "body": "Quote from: rdluffy on March 21, 2023, 07:58:34 PMAgora falando mais sobre essa operação, está bem claro que a guerra começou, e acho que no fundo todos nós sabíamos que uma hora ia acontecer, só não sabíamos como.Não sei, e provavelmente nunca iremos saber dos detalhes, das influências, das pessoas envolvidas, mas é muita coisa pra ser apenas coincidência.FTX + BUSD + USDC + Signature Bank + Silvergate + Chipmixer e várias outras coisas que estão acontecendo agora são provas.Coincidência ou não, o meio blockchain está muito interligado, por mais que pareça que não está.Então, levando em linha de conta que o cara do FTX chegou a um acordo para colaborar com as autoridades, não ficava admirado que ele começa-se a comentar algumas coisas, que todos nós já ouvimos falar nos \"corredores\". Depois as autoridades só tiveram de ir atras das pistas e ver o que iria dar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "March 22, 2023, 01:06:05 PM",
      "body": "Mas de que coincidencias vocês estão falando? Qual a relação entre os acontecimentos envolvendo FTX + BUSD + USDC + Signature Bank + Silvergate + Chipmixer? Querem dizer no sentido de muita coisa ruim acontecendo em pouco tempo? Não entendi bem, me parecem casos bem diferentes, que seguem o fluxo do ciclo de inovação de qualquer disrupção tecnologica. Quote from: tg88 on March 20, 2023, 12:26:22 AMFico me perguntando se no caso de cassinos e poker essa dificuldade de acesso bancário não foi o que impulsionou o setor a olhar bitcoin e criptomoedas como alternativa?Se pensarmos nos países onde adoção do Bitcoin é maior, vamos ver a mesma coisa. Se há dificuldade de acesso ao sistema tradicional, novas rotas e novas vias vão ser criadas. A adoção não vem dos paises desenvolvidos, assim como não vem dos setores super estabelecidos, com fácil acesso a tudo e que todos acham a coisa mais linda do mundo. Bem de onde a treta ta feia, de onde não tem opção.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 22, 2023, 03:09:27 PMLast edit: March 22, 2023, 07:55:42 PM by joker_josue",
      "body": "Quote from: Disruptivas on March 22, 2023, 01:06:05 PMMas de que coincidencias vocês estão falando? Qual a relação entre os acontecimentos envolvendo FTX + BUSD + USDC + Signature Bank + Silvergate + Chipmixer? Querem dizer no sentido de muita coisa ruim acontecendo em pouco tempo? Não entendi bem, me parecem casos bem diferentes, que seguem o fluxo do ciclo de inovação de qualquer disrupção tecnologica. Claro que o que vou dizer é um estilo \"teoria da conspiração\", mas:  A FTX cai e o CEO é preso pelas autoridades sob fraudes, mas ele aceita colaborar. Dá a dica que a Binance anda a emitir token tendo como base BUSD, mas que não está 1:1 em fiat. Entretanto, sai outra dica que pode ajudar a descobrir quem é o dono do Chipmixer. E os bancos? Efeitos colaterais, por causa de algumas pessoas que estão envolvidas em tudo isso.Logicamente isto é tudo uma grande \"teoria\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "March 22, 2023, 07:52:18 PM",
      "body": "Quote from: Disruptivas on March 22, 2023, 01:06:05 PMMas de que coincidencias vocês estão falando? Qual a relação entre os acontecimentos envolvendo FTX + BUSD + USDC + Signature Bank + Silvergate + Chipmixer? Querem dizer no sentido de muita coisa ruim acontecendo em pouco tempo? Acho que me expressei errado ou meio confuso haha, mas seria isso mesmo, muita coisa ruim acontecendo ao mesmo tempo / pouco tempo, fazendo tudo parecer que está tendo um ataque às criptosNão sei se tem relação direta tudo isso que citei, de que alguém cordeena, mas é bastante coincidência todas atitudes que vem tomando que vai contra as criptos.Eu não acredito em quase nenhum teoria de conspiração, mas é bem estranho tanto ataque assim, e já faz tempo que vem acontecendoVai ser interessante observar que agora com as quebras dos bancos e a impressão de dólares, o BTC terá mais uma nova narrativa (na verdade a mais antiga) de se proteger contra os bancos e ser dono do seu dinheiro, pode ser que isso fale mais alto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "March 22, 2023, 10:10:57 PM",
      "body": "Quote from: rdluffy on March 22, 2023, 07:52:18 PMQuote from: Disruptivas on March 22, 2023, 01:06:05 PMMas de que coincidencias vocês estão falando? Qual a relação entre os acontecimentos envolvendo FTX + BUSD + USDC + Signature Bank + Silvergate + Chipmixer? Querem dizer no sentido de muita coisa ruim acontecendo em pouco tempo? Acho que me expressei errado ou meio confuso haha, mas seria isso mesmo, muita coisa ruim acontecendo ao mesmo tempo / pouco tempo, fazendo tudo parecer que está tendo um ataque às criptosAcho que na verdade todas essas \"coisas ruins\" são bastante irrelevantes num longo prazo é nenhuma delas tem de fato influência na tecnologia e na única criptomoeda que realmente importa: o btc.Um banco quebrar, um piramideiro que tinha uma exchange e quebrou, problemas regulatorios de stablecoins... nada disso importa. São coisas pontuais que fazem apenas ruído no mercado.Acho q os governos e os bancos estão desesperados mesmo é com essas quebras bancárias que estão sendo impulsionadas pelo aumento das taxas de juros do fed. Mas a inflação tá pegando.Nesse cenário o bitcoin aparece como uma alternativa ao sistema bancário, e ele não apresentou nenhuma fragilidade e nenhuma notícia ruim apareceu diretamente relacionada a ele ainda.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "March 23, 2023, 12:34:40 PM",
      "body": "Quote from: joker_josue on March 22, 2023, 03:09:27 PMClaro que o que vou dizer é um estilo \"teoria da conspiração\", mas:  A FTX cai e o CEO é preso pelas autoridades sob fraudes, mas ele aceita colaborar. Dá a dica que a Binance anda a emitir token tendo como base BUSD, mas que não está 1:1 em fiat. Entretanto, sai outra dica que pode ajudar a descobrir quem é o dono do Chipmixer. E os bancos? Efeitos colaterais, por causa de algumas pessoas que estão envolvidas em tudo isso.Logicamente isto é tudo uma grande \"teoria\".  Mas calma lá. Foi o Sam que denunciou a Binance? Pelo que eu saiba, foi a Circle, não?E quem deu a dica do dono do Chipmixer? Pelo que eu tinha entendido, descobriram por ele ter usado o nome na conta do PayPal, não? Quote from: rdluffy on March 22, 2023, 07:52:18 PMAcho que me expressei errado ou meio confuso haha, mas seria isso mesmo, muita coisa ruim acontecendo ao mesmo tempo / pouco tempo, fazendo tudo parecer que está tendo um ataque às criptosEu acho que sim, está acontecendo uma perseguição a criptomoedas, como citado aqui pelo tg sobre essa operação e imagino que seja acentuado até pelo momento ruim da economia do EUA. Imagina como é pra essa galera aceitar que enquanto o sistema financeiro deles vai pro brejo, o preço do Bitcoin sobe. Mas mesmo assim - talvez to perdendo informações- não vejo a ligação entre os acontecimentos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 23, 2023, 02:27:41 PM",
      "body": "Quote from: Disruptivas on March 23, 2023, 12:34:40 PMMas calma lá. Foi o Sam que denunciou a Binance? Pelo que eu saiba, foi a Circle, não?E quem deu a dica do dono do Chipmixer? Pelo que eu tinha entendido, descobriram por ele ter usado o nome na conta do PayPal, não?   Não te preocupes, que eu disse apenas que estava a criar uma \"grande teoria da conspiração\".   Apenas isto mostra como é fácil pegar numa coisa, e criar um enredo que mesmo incorreto, parecer logico.Qualquer das formas, acho que esta serie de acontecimentos, a unica coisa que tem em comum é o facto de trabalharem no mercado cripto.Alem disso, como já é um mercado que envolve muito dinheiro, é normal as autoridades andarem mais atentas, e nesta fase \"inicial\" de investigação, apanhar-se mais bandidos. Com o mercado a se tornar um pouco mais regulado, esses bandidos também reduzem um pouco.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "March 24, 2023, 01:48:36 PM",
      "body": "Quote from: joker_josue on March 23, 2023, 02:27:41 PM  Não te preocupes, que eu disse apenas que estava a criar uma \"grande teoria da conspiração\".   Apenas isto mostra como é fácil pegar numa coisa, e criar um enredo que mesmo incorreto, parecer logico.Qualquer das formas, acho que esta serie de acontecimentos, a unica coisa que tem em comum é o facto de trabalharem no mercado cripto.Alem disso, como já é um mercado que envolve muito dinheiro, é normal as autoridades andarem mais atentas, e nesta fase \"inicial\" de investigação, apanhar-se mais bandidos. Com o mercado a se tornar um pouco mais regulado, esses bandidos também reduzem um pouco.Eu gosto, eu acho que no final as coisas tem bem mais ligações do que jamais saberemos. Se pensamos que 1% das pessoas tem 99% da riqueza do mundo, faria muito sentido que tudo que ocorra de grande e drástico no mundo estivesse diretamente correlacionado com esse 1%, né? Dessa forma, se os filmes estão certo e todos os politicos, mafia e policias estão envolvidos em tretas, em cada noticia. Em cada queda, prisão ou banco falindo e sendo resgatado, deve ter uma miriade de relações entre as mesmas pessoas. Eu acho que você deve estar certo, mas as peças em si, elas não encaixaram.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 24, 2023, 03:52:19 PM",
      "body": "Quote from: Disruptivas on March 24, 2023, 01:48:36 PMDessa forma, se os filmes estão certo e todos os politicos, mafia e policias estão envolvidos em tretas, em cada noticia. Em cada queda, prisão ou banco falindo e sendo resgatado, deve ter uma miriade de relações entre as mesmas pessoas. Eu acho que você deve estar certo, mas as peças em si, elas não encaixaram. Não sou nenhum especialista em criar teorias da conspiração.  Mas, também foi uma \"historia\" que foi criada em cima do joelho, e por isso não tive cuidado nos detalhes.  Sabes o que costumo dizer? Que os filmes tem mais realidade do que nós imaginamos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "March 26, 2023, 01:54:01 PM",
      "body": "Quote from: joker_josue on March 24, 2023, 03:52:19 PMQuote from: Disruptivas on March 24, 2023, 01:48:36 PMDessa forma, se os filmes estão certo e todos os politicos, mafia e policias estão envolvidos em tretas, em cada noticia. Em cada queda, prisão ou banco falindo e sendo resgatado, deve ter uma miriade de relações entre as mesmas pessoas. Eu acho que você deve estar certo, mas as peças em si, elas não encaixaram. Não sou nenhum especialista em criar teorias da conspiração.  Mas, também foi uma \"historia\" que foi criada em cima do joelho, e por isso não tive cuidado nos detalhes.  Sabes o que costumo dizer? Que os filmes tem mais realidade do que nós imaginamos. Acho que sim mesmo. E acho que isso ocorre porque os filmes são muito inspirados nos ''1%'' nas histórias que giram em torno dessas pessoas. Se pegassemos a vida de cada politico, talvez com as historias já daria super enredos para filmes de ficcão de hiper conspiração que pareceriam falsas. E se fossemos conectando esses fios, daria histórias absurdas baseadas na realidade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 26, 2023, 07:45:07 PM",
      "body": "Quote from: Disruptivas on March 26, 2023, 01:54:01 PME acho que isso ocorre porque os filmes são muito inspirados nos ''1%'' nas histórias que giram em torno dessas pessoas. Se pegassemos a vida de cada politico, talvez com as historias já daria super enredos para filmes de ficcão de hiper conspiração que pareceriam falsas. E se fossemos conectando esses fios, daria histórias absurdas baseadas na realidade.Por exemplo, o agende mais conhecido da historia do cinema James Bond, foi escrito por Ian Fleming, que foi nada mais nada menos que um agende da inteligência naval britânica. E provavelmente ele inspirou-se em agentes que foi conhecendo.https://www.britannica.com/question/Who-is-James-Bond-based-onFica a questão, qual será a % de real nas suas historias. Será que é muito baixa?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crossholder",
      "created_time": "March 28, 2023, 03:28:32 PM",
      "body": "\"Fun fact\"A Binance usava telegram (TG) para comunicação interna e para resolução de casos de customer support até início de 2020. Alteraram para Webex próximo ao aniversário de 3 anos, em junho de 2020.Sim, eram milhares de mensagens diárias sendo divididas nestes chats de TG, muitas destas com os emails dos usuários,fotos de documentos,screenshots... ou seja,  SPII pra todo lado.Nunca entendi como nunca tiveram nenhum dado vazado desta época.Enfim, engraçado que o leak veio pelo Sigma.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "March 28, 2023, 04:01:55 PM",
      "body": "Quote from: joker_josue on March 26, 2023, 07:45:07 PMPor exemplo, o agende mais conhecido da historia do cinema James Bond, foi escrito por Ian Fleming, que foi nada mais nada menos que um agende da inteligência naval britânica. E provavelmente ele inspirou-se em agentes que foi conhecendo.https://www.britannica.com/question/Who-is-James-Bond-based-onFica a questão, qual será a % de real nas suas historias. Será que é muito baixa?Acho que as histórias completas são 100% ficção, até porque quando as pessoas vão contar histórias de verdade elas já tendem a aumentar ou diminuir um pouco. Mas acho que as inspirações são quase 100% verdade. Se a pessoa tinha contato com muitas histórias absurdar, era só fazer um apanhado que já tinha algo incrivel. Quote from: Crossholder on March 28, 2023, 03:28:32 PM\"Fun fact\"A Binance usava telegram (TG) para comunicação interna e para resolução de casos de customer support até início de 2020. Alteraram para Webex próximo ao aniversário de 3 anos, em junho de 2020.Sim, eram milhares de mensagens diárias sendo divididas nestes chats de TG, muitas destas com os emails dos usuários,fotos de documentos,screenshots... ou seja,  SPII pra todo lado.Nunca entendi como nunca tiveram nenhum dado vazado desta época.Enfim, engraçado que o leak veio pelo Sigma.E esse Webex tu conhece? Eu nunca tinha ouvido falar. Mas não sabia isso da Binance e o telegram. Mas fiquei pensando, aqui no Brasil ja vimos vários casos onde a justiça brasileira pediu para o telegram acesso/retirar do ar e quando há motivo, é bem fácil até que eles deem acesso.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 28, 2023, 06:31:23 PM",
      "body": "Quote from: Disruptivas on March 28, 2023, 04:01:55 PMAcho que as histórias completas são 100% ficção, até porque quando as pessoas vão contar histórias de verdade elas já tendem a aumentar ou diminuir um pouco. Mas acho que as inspirações são quase 100% verdade. Se a pessoa tinha contato com muitas histórias absurdar, era só fazer um apanhado que já tinha algo incrivel. Olha que a historia até pode ser 100% real, todo o enredo a volta é que será 100% ficção.Por exemplo, imagina que na realidade um agente secreto tem a missão de matar secretamente alguém e executa essa tarefa. Ficou escondido na casa dele, e durante a noite mata o cara, fim da historia real.No cinema, esta historia passa pelo agente almoçar com o bandido, lutar com os capangas do bandido, levar meia dúzia de tiros e uma senhora que é maltratada pelo bandido cuida dele, e no final numa arriscada perseguição de carro no meio de uma cidade o agente lá consegue matar o bandido.  Sabem que eu gostava ter sido realizador, então vejo muita historia real, que com um pouco de imaginação ficavam fantásticas em cinema.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "March 29, 2023, 01:47:37 PM",
      "body": "GENTE! Acho que entrei/entendi as teórias conspiratórias.   Vocês viram o artigo do Nic? https://www.piratewires.com/p/crypto-choke-pointEle cita vários acontecimentos que corroboram com a tese da perseguição dos EUA às criptomoedas, ele inicia uma retrospectiva dos acontecimentos do final do ano passado e passa por diversos acontecimentos, da FTX, Paxos Binance e os bancos. E vai ligando todos os pontos pra citar o Choke Point II",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 29, 2023, 04:23:11 PM",
      "body": "Quote from: Disruptivas on March 29, 2023, 01:47:37 PMEle cita vários acontecimentos que corroboram com a tese da perseguição dos EUA às criptomoedas, ele inicia uma retrospectiva dos acontecimentos do final do ano passado e passa por diversos acontecimentos, da FTX, Paxos Binance e os bancos. E vai ligando todos os pontos pra citar o Choke Point IIPois... É verdade que isso pode ser apenas uma grande teoria, com alguns pontos de verdade.Mas, o facto de muito dinheiro ter saído do sistema financeiro americano, deve ter causado um alerta nas autoridades para começarem a investigar mais a fundo.E por sua, vez o facto de terem acesso a muita informação do FTX, poderão ter encontrado muitos podres que agora vão apanhando.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}