{
  "id": "topic_5451151",
  "title": "Gencecikmen",
  "author": "Gencecikmen",
  "created_time": "May 03, 2023, 07:57:11 PM",
  "content": "20 Mart tarihinde yayınlanan verilere göre ülkemiz 137 ülke arasın 106. sırada gelmiş. Yani bizden daha mutsuz 31 ülke var. Avrupa kıtasının en mutsuz ülkesiyiz. Ayrıca Avustralya, Güney Amerika ve Amerika kıtlarında da bizim ülkemiz kadar mutsuz bir ülke yok. Bizim mutluluktan puanımız 4,6 iken an az mutsuz olan Afganistan'ın puanı 1,9, en mutlu ülke olan Finlandiya'nın 7,8.Kaynak: https://www.visualcapitalist.com/worlds-happiest-countries-2023/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451151",
  "comments": [
    {
      "author": "Captain Corporate",
      "created_time": "May 03, 2023, 08:23:16 PM",
      "body": "Mutlu olmayı başarmak elbette çok önemli ama nasıl mutlu olmayı başardığınız daha önemli. Elbette ülkemizde tonla sorun var, daha önce bahsettiğim gibi ayrıştıran bir iktidar ve açlık çeken bir halkın içerisinde mutlu olmak pekte mümkün değil. Fakat İngiltere gibi, Amerika gibi, kendi insanına dahil ırkçılık yapmış, tüm dünyaya savaş açmış, yağmalamış, öldürmüş, talan etmiş, tecavüz etmiş bir geçmişimiz olmadığından dolayı, ve hatta daha bugün hala kafası ezilerek nefessiz bırakılan sadece teni farklı renk olduğu için öldürülen insanlarımız olmadığı için, oraların nasıl mutlu olabildiğine şüpheyle yaklaşmak lazım. Amerika bizden çok puan gözüküyor mesela, siyahi amerikalılarda aynı düşünüyor mudur? Sadece onların puanını sorsak? Veya kızılderili halka bir sorsak acaba kaç puan verirler belirli yere tıkılmış bu halk? Peki ya İngiltere yüksek puan ve hatta kökeni farklı siyasetçi mizanseni yaparken, aynı kökenlerin ülkelerinin fakirliğini sebebi nedir? Onlar neden mutsuz? İngiltereyle bir alakası olabilir mi?Evet ülkemizde ÇOK şey yanlış gidiyor, ve kısmetse bunu 2 haftadan kısa süre sonra düzeltmeye başlamayı umuyoruz, ama bizede kalkıp kimse nasıl mutlu olduklarını anlatmasın, Osmanlı gibi bir güce sahipken bile fethettiğimiz her yere tebaası demiş, oralarıda geliştirmiş, bugün toprakları bize ait olmayan bir çok yerde hala eserlerimizin olduğu bir geçmişe sahibiz, bizde bilirdik asıp kesip varını yoğunu alıp, kadınlarına tecavüz edip, erkeklerini köle yapabilirdik, kolay yolu bu olurdu, zenginliğimize zenginlik katsaydık şimdi bizde fersah fersah mutluyduk. Omurgasız ve alçak bir mutluluğumuz olacağına, onurlu bir mutsuzlukla yaşamayı tercih ederim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Distraction",
      "created_time": "May 03, 2023, 08:49:25 PM",
      "body": "Bu sıralamada bu kadar aşağıda olmamıza şaşırmamak gerek. Sonuçta ülkenin ekonomik şartlarından tutun birçok alandaki sıkıntıları ortadayken ve insanlar göz göre göre birbirine düşmüşken böyle bir topluma mutluluk hakim olamaz. Bizim çok daha mutlu olabilmemizin tek yolu bence sosyal bir devlet olmaktan geçiyor. Eğer bunu günün birinde başarabilirsek en azından o zamanın insanları daha mutlu bir yaşam sürebilirler.Eğer bu veriler bundan yıllar öncesinde elde edilmiş olsaydı Türkiye'nin mutluluk seviyesi bundan daha yukarılarda çıkardı orası kesin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "May 04, 2023, 12:02:07 AM",
      "body": "Mutluluk ne para da ne pulda edebiyatı yapmayı çok isterdim ancak bunu diyen insanın elinden lokmasını kapacak bir zamanda ve ortamda yaşıyoruz.  Bu düzen böyle devam ederse de aha bu dayı gibi hissedecek milyonlarca insan olacak ve bunlardan birisi de ben olurum : https://www.youtube.com/watch?v=XDZpbMIqnnE&ab_channel=buremba",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "May 04, 2023, 11:08:48 AM",
      "body": "Paran kadar mutlusun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "May 04, 2023, 02:20:47 PM",
      "body": "Mutluluk endeksine göre savaştaki ülkeler ve kabile hayatı yaşamaya devam edenler ila aynı yerdeyiz, tek farkımız coğrafi konumumuz. Burada ciddi anlamda durup düşünmek gerekiyor, bu kadar imkana sahipken her şeye bu kadar yakınken insanımız nasıl bu kadar mutsuz olabilir? Ekonomi her şeyin temeli, o kadar kötü bir zamandan geçiyoruz ki insanlar çok mutsuz. Çok üzülüyorum bu duruma, umarım kısa sürede toparlarız",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "May 04, 2023, 03:20:41 PM",
      "body": "Bizim durum vahim. Eskiden mutlu olmak daha kolaymış sanki ama bu sözümde bile genele yaymak hata, her şartta mutlu olanlar da var bir çok şartı sağlayıp mutlu olamayan da. Yine de ortalama alınarak verilen değerlerde alt sıralarda olmamız üzücü. Şu konuda bile mutlu olamadık işte durduk yere negatif pompalıyoruz. Asıl ilgimi çeken şey; görseli çok beğendim. Çizim baya bir hoş olmuş. Gözü yormuyor, mesajı net veriyor. Renklendirmede ufak oynamalarla daha iyi hale gelir. İkinci paragrafımda da kendime pozitiflik yükledim. Umarım çevremiz, kendimiz, hayatımız hep bize mutluluk katar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "May 04, 2023, 04:59:48 PM",
      "body": "Quote from: meser# on May 04, 2023, 12:02:07 AMMutluluk ne para da ne pulda edebiyatı yapmayı çok isterdim ancak bunu diyen insanın elinden lokmasını kapacak bir zamanda ve ortamda yaşıyoruz.  Bu düzen böyle devam ederse de aha bu dayı gibi hissedecek milyonlarca insan olacak ve bunlardan birisi de ben olurum : https://www.youtube.com/watch?v=XDZpbMIqnnE&ab_channel=burembaPara mutluluk getiriyor hocam. Para mutluluk getirmiyor diyen kişiler bence ancak elindeki imkanları kullanmak için kendi kendine avuntu yaratan kişilerdir. Para pulda değil mutluluk diyen kişilere inanamıyorum. Para her şey olmasa da, bir çok hedefinize doğrudan para ile ulaşabiliyorsunuz. Acun Ilıcalı mı, bir ev için kredi çekmeye çalışan bakkal Rüstem amca mı daha mutlu şimdi soruyorum?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "May 04, 2023, 05:15:02 PM",
      "body": "Quote from: Phoenix Anka on May 04, 2023, 04:59:48 PMQuote from: meser# on May 04, 2023, 12:02:07 AMMutluluk ne para da ne pulda edebiyatı yapmayı çok isterdim ancak bunu diyen insanın elinden lokmasını kapacak bir zamanda ve ortamda yaşıyoruz.  Bu düzen böyle devam ederse de aha bu dayı gibi hissedecek milyonlarca insan olacak ve bunlardan birisi de ben olurum : https://www.youtube.com/watch?v=XDZpbMIqnnE&ab_channel=burembaPara mutluluk getiriyor hocam. Para mutluluk getirmiyor diyen kişiler bence ancak elindeki imkanları kullanmak için kendi kendine avuntu yaratan kişilerdir. Para pulda değil mutluluk diyen kişilere inanamıyorum. Para her şey olmasa da, bir çok hedefinize doğrudan para ile ulaşabiliyorsunuz. Acun Ilıcalı mı, bir ev için kredi çekmeye çalışan bakkal Rüstem amca mı daha mutlu şimdi soruyorum? Şimdi cevap veriyorum hocam:D Demek isterdim dedim ancak diyemedim çünkü böyle olmadığını da sende bende rüstem amca da biliyor acun bilmiyor çünkü ben parasızda mutluydum paralıykende diye bir açıklamada bulundu bu yüzden onu pas geçiyorum. Paranın mutluluk getirmez diyenler(tabiki de gerçekten dürüst bir şekilde dediklerinde ) eğer o toplumun %100'ünü oluşturursa işte o zaman getirmez deriz ama o zamana kadar bunlar insanları manipüle etmek için kullanılan içi boş sözlerdir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "May 04, 2023, 06:06:55 PM",
      "body": "Quote from: meser# on May 04, 2023, 05:15:02 PMQuote from: Phoenix Anka on May 04, 2023, 04:59:48 PMQuote from: meser# on May 04, 2023, 12:02:07 AMMutluluk ne para da ne pulda edebiyatı yapmayı çok isterdim ancak bunu diyen insanın elinden lokmasını kapacak bir zamanda ve ortamda yaşıyoruz.  Bu düzen böyle devam ederse de aha bu dayı gibi hissedecek milyonlarca insan olacak ve bunlardan birisi de ben olurum : https://www.youtube.com/watch?v=XDZpbMIqnnE&ab_channel=burembaPara mutluluk getiriyor hocam. Para mutluluk getirmiyor diyen kişiler bence ancak elindeki imkanları kullanmak için kendi kendine avuntu yaratan kişilerdir. Para pulda değil mutluluk diyen kişilere inanamıyorum. Para her şey olmasa da, bir çok hedefinize doğrudan para ile ulaşabiliyorsunuz. Acun Ilıcalı mı, bir ev için kredi çekmeye çalışan bakkal Rüstem amca mı daha mutlu şimdi soruyorum? Şimdi cevap veriyorum hocam:D Demek isterdim dedim ancak diyemedim çünkü böyle olmadığını da sende bende rüstem amca da biliyor acun bilmiyor çünkü ben parasızda mutluydum paralıykende diye bir açıklamada bulundu bu yüzden onu pas geçiyorum. Paranın mutluluk getirmez diyenler(tabiki de gerçekten dürüst bir şekilde dediklerinde ) eğer o toplumun %100'ünü oluşturursa işte o zaman getirmez deriz ama o zamana kadar bunlar insanları manipüle etmek için kullanılan içi boş sözlerdir. Hocam bıraksın ya. Adamda şu an itibar, güç, hırs hepsi var ve bunların hepsi para ile oldu. Parasız mutluymuş ondan mı hayatını tam aksi yönde şekillendirme kararı aldı? Bir insan mutluysa o durumu devam ettirir. Devam ettiremediğine göre kendini kandırıyormuş, mutlu değilmiş. Paranın Türkiye’de mutlu edemeyeceği insan sayısı gerçekten çok az.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "May 04, 2023, 06:28:46 PM",
      "body": "Mutluluk endeksinde pardon haritasında neredeyse Afrika ülkelerini mutsuzlukta sollayacağız o duruma geldi. Ülkemiz için çok fazla detaylı veriye bile gerek yok sokakta hemencecik denk geldiğiniz bir kaç kişiyle sohbet ettiğimizde ortalama çıkıyor çok belli insanların mutsuzluğu yüzlerinden okunuyor bu mutsuzluklar beraberinde agresiflikte getiriyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flyingcarpet",
      "created_time": "May 04, 2023, 07:01:14 PM",
      "body": "Şu an belki genel olarak mutsuzluk ve umutsuzluk var ülkemizde. Unutmayalım ki her zaman buna benzer dönemlerden geçmişizdir. Ben yaş olarak buradaki birçok kişiden büyüğümdür. Benden büyükler vardır elbet ve içinde bulunduğumuz durumdan çıkabileceğimizin onlar da farkındadırlar. Geleceğe yönelik iyi düşüncelerimizi kaybedersek zaten mutlu olamayız.Kötüyü düşünelim ama iyi günlerin de geleceğini hiçbir zaman unutmayalım. Bugünlerde konu hep siyaset olduğu için şunu söylüyorum. Günümüz siyasetinde kimsenin maşası ve sonuna kadar savunucusu olmadan önümüze bakmalı, kendimizi geliştirmeli ve gelmesini istediğimiz mutlu günler için çabalamalıyız.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}