{
  "id": "topic_5473344",
  "title": "alani123",
  "author": "alani123",
  "created_time": "November 08, 2023, 12:33:29 PM",
  "content": "$ORDI, short for ordinals, is the first token on the BRC-20 standard, which allows tokens tokens be \"inscribed\" on the bitcoin blockchain. Total number of coins: 21.000.000 (twenty one million)Date created: 9th of March 2023[1]Creator: https://twitter.com/domodataUtility: N/A (it helped demonstrate BRC-20 is feasible)Block explorer: https://unisat.io/Wallet: https://github.com/unisat-wallet/extension/releases/tag/v1.1.33Exchanges: Binance.com, Gate.io, Kucoin.com, OKX.com, HTX.com, ByBit.com, Poloniex.com, BitGet.com, Bitrue.com, [...] and moreWARNING: The ORDI token is not associated with the ordinals.com project or the ORD client. [1]: https://twitter.com/domodata/status/1633658974686855168QuoteI alani123 am in no way associated with ORDI and have no stake in the project. This thread is created for informational purposes only.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473344",
  "comments": [
    {
      "author": "Grafen",
      "created_time": "November 26, 2023, 04:01:31 PMLast edit: November 04, 2024, 03:32:39 PM by Grafen",
      "body": "It's like ethereum tokens?                    Sounds great",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "November 26, 2023, 04:26:46 PM",
      "body": "Quote from: Grafen on November 26, 2023, 04:01:31 PMIt's like ethereum tokens?No. It's a very rudimentary token standard, without the extended smart contract possibilities offered by ERC-20. You can't do much more than minting and transfering them. Basically the same thing like Coloured Coins which exist already since 2013, only using Taproot and Ordinals techniques.As any Ordinals NFT-type inscription, you need two transactions to move ORDI if you want to transfer or trade it. See here and here for other disadvantages.This is the price evolution:We can see that it had an initial hype taking it to more than $28 per token, then it crashed down to $2, then it went up in a spectacular bounce when it was listed on Binance to $27.50, and now is falling again.As alani123 wrote, it has no utility, so it's basically a collectible for those who think BRC-20 and Ordinals were an important milestone in the history of humanity",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "culexevilman",
      "created_time": "March 11, 2024, 10:49:33 PM",
      "body": "As we approach the year 2024, a new milestone in the digital currency landscape is on the horizon. ORDI, a currency that has captured the imagination and enthusiasm of the younger generation, is poised to be listed on Coinbase. This event marks a significant evolution in the realm of digital currencies, highlighting the continuous innovation that drives this field forward.ORDI, often referred to as the \"young people's Bitcoin,\" embodies the spirit of decentralization and freedom that initially inspired the creation of Bitcoin. However, it has become apparent that Bitcoin has increasingly fallen under the influence of Wall Street, leading to a perception that it now serves the interests of the financial elite rather than those of the broader community. This shift has sparked a debate about the essence of digital currencies and the importance of maintaining their independence from traditional financial systems.The comparison between ORDI and Bitcoin, suggesting that \"1 ORDI = 1 BTC,\" is a provocative statement that challenges the current valuation and perception of cryptocurrencies. It serves as a reminder of the original vision of a decentralized and open financial system, free from the control of any single institution or group.In the spirit of Satoshi Nakamoto, it is crucial to remember the core principles that gave birth to Bitcoin and the cryptocurrency movement. The introduction of ORDI and its recognition by platforms like Coinbase represents not just the advent of a new digital currency but also a call to reflect on the direction and values of the cryptocurrency ecosystem.As we move forward, it is essential to foster an environment where innovation thrives, and new ideas are welcomed. The true strength of cryptocurrencies lies in their ability to empower individuals and facilitate a more inclusive and equitable financial system. Whether ORDI or another currency, the focus should always be on preserving the integrity and transformative potential of digital currencies.In this pivotal moment, let us embrace the dynamism and diversity of the cryptocurrency world, while also staying true to the ideals of decentralization, transparency, and community that have guided this journey from the very beginning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}