{
  "id": "topic_5448097",
  "title": "crypticj",
  "author": "crypticj",
  "created_time": "April 09, 2023, 12:50:08 AM",
  "content": "Hello everyone!I've been thinking a lot about Bitcoin adoption lately and I think that adoption is still pretty slow partly because of the Bitcoin reputation. Despite it being a progressive technology of the future, a lot of people still think that it's a joke.So there is different opinion among people about Bitcoin. Some people consider Bitcoin as \"criminal money\" because it's often used on the dark web and helps criminals to get away with selling drugs and stuff. There are also people who think that Bitcoin is a bubble that will explode and lose its value, so they don't trust it. It's probably because these people don't know how Bitcoin and blockchain work.And there is a third group of people who think that Bitcoin is used just for gambling so they don't want to buy it.I think it would be good if we can convince these people that they are wrong. I know that an obvious way to do it would be an education, which will help A LOT. But as for now, do you think there are other ways to change these people's opinions?Like would it be good if we could create a system that somehow will make the life of criminals who use Bitcoin harder?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448097",
  "comments": [
    {
      "author": "Hispo",
      "created_time": "April 09, 2023, 01:45:03 AM",
      "body": "I do not know about you, but in my personal perception and according to what I recall hearing and reading about Bitcoin from past years, the stigma on Bitcoin has been reduced drastically in comparison.Granted, It can always be better and more people can be more open about new things like this one, which is supposed to help people to take control over their assets, i would rather an approach which promotes education about the blockchain technology in general, so people can continue from there and do their own research (as they are supposed to).Also, as far as I am concerned more cyber criminals have moved from Bitcoin to other coins which take an emphasis in being fungible and privacy, because there are already tools to track Bitcoins on-chain that discourage them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "April 09, 2023, 01:59:31 AM",
      "body": "Quote from: crypticj on April 09, 2023, 12:50:08 AMI've been thinking a lot about Bitcoin adoption lately and I think that adoption is still pretty slow partly because of the Bitcoin reputation. Despite it being a progressive technology of the future, a lot of people still think that it's a joke.So there is different opinion among people about Bitcoin. Some people consider Bitcoin as \"criminal money\" because it's often used on the dark web and helps criminals to get away with selling drugs and stuff. People are free with their minds and they can think Bitcoin is either a joke, a fraud or a virtual thing. You don't need to convince anyone that Bitcoin is a good thing with good reputation. It was not created to be used for criminal activities including dark markets and money laundering so it is not related to bad reputation caused by those activities.Is Alfred Nobel related to many deaths in the Russia invasion to Ukraine and Russia - Ukraine war? He is not responsible for it and you know who is responsible for it.He has patent for dynamite but he is not responsible for people who used it to kill others, in wars and invasions.QuoteNobel's most famous invention was dynamite, a safer and easier means of harnessing the explosive power of nitroglycerin; it was patented in 1867.QuoteThere are also people who think that Bitcoin is a bubble that will explode and lose its value, so they don't trust it.Tell them about bubbles and collapses from banks. Bitcoin is not dead but many banks were dead.https://buybitcoinworldwide.com/bitcoin-is-dead/https://99bitcoins.com/bitcoin-obituaries/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lassdas",
      "created_time": "April 09, 2023, 02:12:05 AM",
      "body": "Quote from: crypticj on April 09, 2023, 12:50:08 AMLike would it be good if we could create a system that somehow will make the life of criminals who use Bitcoin harder?That's not really a good idea.If you create a system to make the the life of <usergroup-A> harder, what's stopping you from using that same system to make the life of <usergroup-B/C/D..> harder for whatever reason you can think of.Bitcoin is permissionless for a reason.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Latviand",
      "created_time": "April 09, 2023, 02:42:12 AM",
      "body": "Quote from: crypticj on April 09, 2023, 12:50:08 AMHello everyone!I've been thinking a lot about Bitcoin adoption lately and I think that adoption is still pretty slow partly because of the Bitcoin reputation. Despite it being a progressive technology of the future, a lot of people still think that it's a joke.I don't think it's slow, adoption also takes a long time so I don't know where you're getting this. Regarding the reputation, can you list at least some reasons as to why do you think that it's the reason that the adoption is slow. Give us an example like an article about people that think that bitcoin is a joke. You need to cover your bases my guy because you're spouting nonsense right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "April 09, 2023, 03:26:35 AM",
      "body": "Bitcoin is decentralized and it's a freedom to choose, if you're force them to buy Bitcoin because of the good thing or advantage in Bitcoin, what's make it different with a government which force their citizens to use their worthless fiat? you're just make a centralization in Bitcoin since you force anyone to follow your choice. Let alone people who think Bitcoin is an illegal currency, bad currency, bubble, haram etc. I know Bitcoin and I have a good reason to buy Bitcoin, why should I need to wasting my time to convince everyone else?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lorence.xD",
      "created_time": "April 09, 2023, 03:38:14 AM",
      "body": "It would be unnecessary to convince them to believe to Bitcoin if their mindset is fixed to it as a \"joke\". That's actually just fine for people to intercept Bitcoin since it's too complicated for people who doesn't have prior knowledge about it. If they want to really deepen their understanding to crypto and blockchain technology they would learn if for themselves, you only have to share your experiences without convincing them, for them to have an idea what could Bitcoin benefits and cons its up to people if they'll study it. Criminals are opened to Bitcoin since it is a decentralized system but their addresses could be track for people to be aware on their wrong doings. Doing such system for making people life harder would just complicate things, its just fine the way it is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "April 09, 2023, 03:47:34 AM",
      "body": "There is nothing to fix, bitcoin was not design to be used by bad actors, but if someone is taking advantage of it, then we can't do anything about it.And according to this report:Quotehainalysis also estimates that the criminal share of all crypto transactions in 2020 was below one percent. A study conducted by the Massachusetts Institute of Technology in the United States claims to have evaluated all Bitcoin transactions to date and concluded that only three percent of them were related to criminal activity. If that data is correct, the criminal element of Bitcoin is no greater than in traditional markets, and drug dealing, blackmail and con artists all existed before Bitcoin was founded in 2009.https://www.redbull.com/int-en/theredbulletin/bitcoin-currency-of-criminalsAs far as it's being used by gambling, then there's nothing wrong with it, you can't stop people from gambling and even if fiat industry, gambling is a big business billions worth every year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "April 09, 2023, 03:51:00 AMLast edit: April 09, 2023, 04:11:47 AM by Don Pedro Dinero",
      "body": "Quote from: crypticj on April 09, 2023, 12:50:08 AMHello everyone!I've been thinking a lot about Bitcoin adoption lately and I think that adoption is still pretty slow partly because of the Bitcoin reputation.Keep thinking. I think you are 5 or 10 years too late, it had a much worse reputation before.Because you give the wrong diagnosis you put forward the wrong proposals. The adoption of bitcoin is not a matter of reputation.Perhaps now with the next launching of CBDCs governments will want to attack reputation but as of today it is unstoppable and is on a slow but sure path to mass adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "April 09, 2023, 03:58:22 AM",
      "body": "According to my experience, people are afraid of something new. I remember that there was a drawing 100 years ago showing electricity as something evil.Therefore, it is natural for people to be afraid of Bitcoin or warn of it, and we do not forget the role of the media in drawing this bleak picture and the bad use during the first years of this technology.The more time increases and the alert gradually increases, people will understand Bitcoin, especially since many user-friendly wallets began to appear, and not in the past, where the use of Bitcoin was restricted to those who had good knowledge of dealing with computers.So the issue of changing awareness requires a little time and it is a gradual issue, the view will not change in a year, two, or even five years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "April 09, 2023, 04:07:44 AM",
      "body": "I remember post 2017 every main stream media had an agenda of creating negative image of Bitcoin. For some reason it got less after 2021 and now none of them are discussing about Bitcoin after few banks went bankrupt. I think this year has been the best for Bitcoin reputation and I believe that it will remain the same in coming years. Adoption has been steadily growing and we can expect a few countries this year or next to declare it as a legal tender. I do not think that we need to do anything now. All we need to do is to wait for USD to plunge downwards and we will see that the reputation of Bitcoin to go upwards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "April 09, 2023, 04:15:21 AM",
      "body": "Quote from: crypticj on April 09, 2023, 12:50:08 AMHello everyone!I've been thinking a lot about Bitcoin adoption lately and I think that adoption is still pretty slow partly because of the Bitcoin reputation. Despite it being a progressive technology of the future, a lot of people still think that it's a joke.So there is different opinion among people about Bitcoin. Some people consider Bitcoin as \"criminal money\" because it's often used on the dark web and helps criminals to get away with selling drugs and stuff. There are also people who think that Bitcoin is a bubble that will explode and lose its value, so they don't trust it. It's probably because these people don't know how Bitcoin and blockchain work.And there is a third group of people who think that Bitcoin is used just for gambling so they don't want to buy it.I think it would be good if we can convince these people that they are wrong. I know that an obvious way to do it would be an education, which will help A LOT. But as for now, do you think there are other ways to change these people's opinions?Like would it be good if we could create a system that somehow will make the life of criminals who use Bitcoin harder?But who is creating that reputation? Who is pushing for that image to form in the minds ordinary people over and over again? Those in power of course, for such a reputation to change we will need those very same people to change their minds about bitcoin, an impossibility if you ask me.So there is nothing we can do to bring a massive change to the way bitcoin is perceived, and our only option is to let each person to discover on their own the truth, a very inefficient method I am aware but the only one which is within our grasp.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "John Abraham",
      "created_time": "April 09, 2023, 05:01:46 AM",
      "body": "You don't have to convince anyone to trust Bitcoin. Quote from: satoshi on July 29, 2010, 02:00:38 AMIf you don't believe me or don't get it, I don't have time to try to convince you, sorry. This is not the exact same reason why Satoshi said that. But the quote is still valid. People are still dumb enough not to understand Bitcoin. Bitcoin is a currency. It cannot be a bad thing. It depends on how you use it. We invented weapons for our safety. We Invented drugs for our health. A weapon could have various uses. Criminals use it to do bad things. But Army uses it to protect our country. Most Criminals use Fiat money to deal with. A few percent of Criminals use Bitcoin or other cryptocurrencies for their work. That doesn't mean Bitcoin is criminal money. Bitcoin doesn't have a bad reputation. It's a currency. It shouldn't have a reputation. A Gun shouldn't have a bad reputation because it can kill a human. It can kill innocent people, and it can also kill a criminal. It depends on who uses it and for what reason. We don't have to fix anything. Everything will be improved over time. Just let it happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "April 09, 2023, 05:24:40 AM",
      "body": "Quote from: crypticj on April 09, 2023, 12:50:08 AMBut as for now, do you think there are other ways to change these people's opinions?The challenge is that we would be going against strong propaganda centers that have been spreading the FUD about bitcoin through the media that they also control or have tight relationships with. It is extremely hard to counter that because we don't have the same reach.The only thing we can do is to first educate ourselves and then give those people \"facts\" about bitcoin with indisputable data.QuoteLike would it be good if we could create a system that somehow will make the life of criminals who use Bitcoin harder?Bitcoin is a tool so like any other tool it can be used for many different purposes. Just like you can't make a kitchen knife that couldn't be used as a murder weapon you can't create a currency that criminals don't use.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "April 09, 2023, 05:33:52 AM",
      "body": "Bitcoin is decentralized, unfortunately, there is no other way to change people's opinions about Bitcoin, if they are not willing to help themselves by doing research and learning about why Bitcoin was created, we can't help them, no one can. Do your best and leave the rest they say, I have done my part and I will continue to do it, I have been able to prove some people wrong, and they listened, the argument started when they remained firm on their point that Bitcoin is for fraudsters, so I just gave them a few reasons why Bitcoin is better than government banks and fiat, and this caught their attention.Today these people are not Bitcoin believers, we don't have to force anyone, but if they are ready to learn, the door is always open.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "April 09, 2023, 05:43:14 AM",
      "body": "A good number of people have already been trying to debunk these misconceptions through YouTube videos, conferences, articles, social media replies, you name it. It's just the simple fact that a lot of people don't want to be convinced otherwise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "April 09, 2023, 05:54:56 AM",
      "body": "Quote from: crypticj on April 09, 2023, 12:50:08 AMLike would it be good if we could create a system that somehow will make the life of criminals who use Bitcoin harder?Before Satoshi created BTC, criminals were using every other currency and tools for their crimes, after BTC was created it only became another currency added to the list of currencies that criminals can use, BTC is not their only tool like the government want people to believe. We don't have to create any system to counter criminals because that would mean censorship, whereas BTC is a censorship resistant and permissionless currency.The system has made the life of criminals harder because it is not possible for a malicious actor to control 51% of the hashrate, and the network is very secure through the proof of work algorithm, but when it comes to usage, the network is free for everybody and it will never censor people like centralized services do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "April 09, 2023, 05:57:30 AM",
      "body": "I don't think it's important to convince people to believe in Bitcoin. For what? I once heard the thought, \"People who don’t want to hear about Bitcoin now are like those who once refused to hear about the Internet.\"Give them time. Bitcoin goes its own way; everyone comes when they're ready for it. There is no need to forcefully teach anyone, and even more so to agitate them to invest in Bitcoin. Let people think the way they want while you live your life using new technologies. The world is changing, and as it was with the Internet, so will it be with Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "April 09, 2023, 06:20:29 AM",
      "body": "Why should we bother convincing people about their misconceptions? I'm sorry, but this approach looks too desperate. New innovations take time, and despite having been launched for over a decade now, Bitcoin has received tremendous attention from the public the last few years after Covid, due to its great performance. More and more people will eventually understand its technicalities and why these common misconceptions are basically myths to a large degree and not something worth noting.It's very easy to debunk each one of those points you mentioned, especially the last one regarding gambling. Physical and online casinos have been a thing long before Bitcoin became popular, so I don't get why there are still people claiming that cryptocurrencies are gambling-oriented.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "April 09, 2023, 06:51:25 AM",
      "body": "Quote from: crypticj on April 09, 2023, 12:50:08 AMI've been thinking a lot about Bitcoin adoption lately and I think that adoption is still pretty slow partly because of the Bitcoin reputation. Despite it being a progressive technology of the future, a lot of people still think that it's a joke.Bitcoin price was less than $1, but now the price is over $20000. Bitcoin marketcap was nothing before, but now over $500 billion. It has only been 13 years since bitcoin was created. No asset has increased like bitcoin. If they think bitcoin adoption is not significant like they think it should be, we are still satisfied with how it has been so far. If not more than 5 million people have bitcoin in the world for now, it is a good thing because it means it is never too late yet to buy and expect good ROI in the future.Quote from: crypticj on April 09, 2023, 12:50:08 AMSo there is different opinion among people about Bitcoin. Some people consider Bitcoin as \"criminal money\" because it's often used on the dark web and helps criminals to get away with selling drugs and stuff.Has darkweb not be existing before the creation of bitcoin? Bad people has always been having a way to hide many of their bad activities.Quote from: crypticj on April 09, 2023, 12:50:08 AMThere are also people who think that Bitcoin is a bubble that will explode and lose its value, so they don't trust it. It's probably because these people don't know how Bitcoin and blockchain work.And these are the people that misled some people that did not buy bitcoin at the appropriate time and they miss the bull market. That is why it is good to never believe people. It is good to do own research to know about a project or a coin like bitcoin, rather than listening to people.Quote from: crypticj on April 09, 2023, 12:50:08 AMAnd there is a third group of people who think that Bitcoin is used just for gambling so they don't want to buy it.If anyone do not buy bitcoin because it is used for gambling, that is stupidity. If a person can argue with me and say it is not stupidity, I will tell the person that it is not stupidity if he or she will not be spending fiat again because it is used for gambling.Quote from: crypticj on April 09, 2023, 12:50:08 AMI think it would be good if we can convince these people that they are wrong. I know that an obvious way to do it would be an education, which will help A LOT. But as for now, do you think there are other ways to change these people's opinions?Like would it be good if we could create a system that somehow will make the life of criminals who use Bitcoin harder?Education is the way, I agree to this. But it is good to also educate them about the bear market and how to avoid it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}