{
  "id": "topic_5440835",
  "title": "Arbitrumnvestor",
  "author": "Arbitrumnvestor",
  "created_time": "February 22, 2023, 01:30:41 PM",
  "content": "Inspired by the legendary investor “Warren Buffet” a dog themed crypto investment fund was born. $Warren coin is a true community investment fund with multiple ways to earn.$Warren coin can currently be bought on several decentralized platforms and operates on the Arbitrum smart chain. Liquidity is locked for 6 months and may be extended longer.*CommunityThe community is very important to us and we strive to assist them in any means possible. The $Warren team are investors just like you. Help us recruit new members, shill posts on Twitter, and post on Telegram. In doing so we all can be successful and continue to offer the best rewards around.*TeamThe team works for you! We sell full development packages to other crypto developers. Contracts, graphic designs, websites, marketing tools etc. A portion of the profit from that goes back into the vault to share with our holders.*TokenomicsBuy Tax: 6%Rewards USDC 2%Liquidity 1%Vault 2%Main Wallet 1%Sell Tax: 9%Rewards USDC 3%Liquidity 1.5%Vault 3%Main Wallet 1.5%*RewardsPurchase into the coin and automatically start to earn a share of USDC rewards from every buy and sell of the coin.Own 100,000 coins or more and be eligible for the $Warren Vault. The vault is the a crypto currency investment fund. Essentially it’s a pool of money used to invest in current and future crypto currency’s. The team takes suggestions from the community on which crypto assets to invest in. The team preforms a risk analysis of the assets and decides to invest or pass on that asset. Profits from investments are kept in the vault until ready to disperse to active $Warren holders.Telegram: https://t.me/warrenarbofficialWebsite: www.warrencoin.onlineContact us: info@warrencoin.online",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440835",
  "comments": [
    {
      "author": "Mikky.Crypto",
      "created_time": "March 24, 2023, 11:03:21 AM",
      "body": "Thanks to XGo, I was able to quickly and easily add some $ARB to my portfolio in anticipation of the upcoming ARB/USDT spot trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}