{
  "id": "topic_5422104",
  "title": "T0asti",
  "author": "T0asti",
  "created_time": "November 18, 2022, 12:12:52 PM",
  "content": "Good day everyone,since the collapse of FTX we had many discussion about people withdrawing their Bitcoin from exchanges. You can check the balances here https://www.coinglass.com/Balance.We went from 2.1 million BTC all the way down to 1.9 million BTC.Until yesterday Binance was one of the biggest looser with over 80k BTC withdrawn over the last 30 days. Coinbase was ranked first, but also with massive loses. Nearly all exchanges lost huge amounts, fitting perfectly in the narrative of people withdrawing their bitcoin.But suddenly in the last 24 hours Binance added and incredible 92,000 Bitcoin to their exchange an amount never seen before on the exchange (according to coinglass, and if you check the last 12 months). I found very little info about that, and all nearly other exchanges are still getting their balance reduces.Do we have some info about that or any idea whats going on?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5422104",
  "comments": [
    {
      "author": "DaveF",
      "created_time": "November 18, 2022, 01:02:15 PM",
      "body": "More or less read this thread: https://bitcointalk.org/index.php?topic=5421104.0It means that Binance had a ton of coins scattered across a ton of wallets, and have now been consolidating them down into a few known ones.For people that don't understand it makes them look better. For those that do understand it makes them look weak since they had to move all those coins to prove they did have the funds.It also makes them look incompetent since they should have been doing this all along when the mempool was empty and fees were low. Now it's costing them more and taking longer to do.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "November 18, 2022, 01:25:35 PM",
      "body": "Quote from: DaveF on November 18, 2022, 01:02:15 PMIt means that Binance had a ton of coins scattered across a ton of wallets, and have now been consolidating them down into a few known ones.Exchanges regularly consolidate their small inputs from users and from leftovers in change address after processing user withdrawal requests. This time, Binance chose a 'right' time to consolidate their inputs massively.  Fortunately, no domino effects to spam mempool more and it has been cleaned up gradually recent days. We also are going towards this weekend which should reduce mempool a little bit more.In the past, spamming mempool and cause more expensive transaction fee on newbie users is one of ways to make they get panic. With Segwit adoption in past 2 years, now it is harder to make Bitcoin network congested.Segwit usage from Blockchair.com",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "November 18, 2022, 01:25:49 PM",
      "body": "Quote from: DaveF on November 18, 2022, 01:02:15 PMMore or less read this thread: https://bitcointalk.org/index.php?topic=5421104.0It means that Binance had a ton of coins scattered across a ton of wallets, and have now been consolidating them down into a few known ones.Additionally, some FTX volume is probably shifting to binanceAt least in Brazil, FTX was a big exchange and one of the most \"liable\". Binance is by far the biggest here with more than 50% of total bitcoin volume. It is very likely that FTX clients moved to binance here in Brazil, and in other places as well.https://cointelegraph.com.br/news/binance-now-dominates-49-of-bitcoin-trading-in-brazil (this is old news, binance is bigger now)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "November 18, 2022, 01:48:14 PM",
      "body": "Quote from: T0asti on November 18, 2022, 12:12:52 PMUntil yesterday Binance was one of the biggest looser with over 80k BTC withdrawn over the last 30 days. Coinbase was ranked first, but also with massive loses. Nearly all exchanges lost huge amounts, fitting perfectly in the narrative of people withdrawing their bitcoin.Isn't this current happenings enough lessons for the people to wise up and take their assets off the centralized exchanges, more exchanges will still follow the same pattern FTX had been through and fall without a remedy to recover every lost assets, i think now people are getting to understand the more need they have to stay off the centralized exchanges and many of these same people would have come to a platform like this in learning to know why the FTX incident occurred and possible solutions for others to look after.Quote from: T0asti on November 18, 2022, 12:12:52 PMBut suddenly in the last 24 hours Binance added and incredible 92,000 Bitcoin to their exchange an amount never seen before on the exchange (according to coinglass, and if you check the last 12 months). I found very little info about that, and all nearly other exchanges are still getting their balance reduces.They are experienced on doing this, if they fail to pump more bitcoin to the exchange as people were withdrawing their btc off their exchange it will reduce their liquidity and capitalization as well and many will beginbto suspect them sooner to bebthe next victim.Quote from: T0asti on November 18, 2022, 12:12:52 PMDo we have some info about that or any idea whats going on?There will always be manipulations with exchanges and all that is needed is to stay clear and off them in avoiding any unnecessary headache.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "November 18, 2022, 02:13:40 PM",
      "body": "Quote from: T0asti on November 18, 2022, 12:12:52 PMGood day everyone,since the collapse of FTX we had many discussion about people withdrawing their Bitcoin from exchanges. You can check the balances here https://www.coinglass.com/Balance.We went from 2.1 million BTC all the way down to 1.9 million BTC.Until yesterday Binance was one of the biggest looser with over 80k BTC withdrawn over the last 30 days. Coinbase was ranked first, but also with massive loses. Nearly all exchanges lost huge amounts, fitting perfectly in the narrative of people withdrawing their bitcoin.But suddenly in the last 24 hours Binance added and incredible 92,000 Bitcoin to their exchange an amount never seen before on the exchange (according to coinglass, and if you check the last 12 months). I found very little info about that, and all nearly other exchanges are still getting their balance reduces.Do we have some info about that or any idea whats going on?People who traded on FTX probably moved to Binance but the real reason is we don't really know how much Bitcoins are in the custody of Binance and for the last few days the mempool clogged with transactions from Binance and its considered that the Binance is consolidating the smaller inputs so they can reduce the transaction fee while people withdraw their Bitcoins from exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "November 18, 2022, 02:26:56 PM",
      "body": "Quote from: tranthidung on November 18, 2022, 01:25:35 PMIn the past, spamming mempool and cause more expensive transaction fee on newbie users is one of ways to make they get panic. With Segwit adoption in past 2 years, now it is harder to make Bitcoin network congested.Segwit usage from Blockchair.comBULLS**tthose quick jumps of \"segwit usage\" are not users with independant wallets..its leaps due to SERVICES changing to use segwit addreseswhere by people are now custodianising their coin and then using subnets and sidechains instead of the bitcoin networksegwit itself is not actually much different in actual byte data length compared to legacythe fee's are miscounted. and bytes miscounted but when it comes to actual real hard drive bytes segwit is not much different. in many cases it has allowed exchanges to batch up utxo's more causing a shift user:service of the blockspace to be more in the service side.if you look at the amount of transactions over the last 7 years of all the scaling debates you will see after 2017 the tx count has NOT increasedeven though if you added up all user accounts of exchanges and also how many independant nodes are on the network and how many lite wallets are spving their wallet brand servers has risen.. the tx count has not risen reciprocallythus \"segwit\" has not reduced congestion. but the offramps to services/subnets has.and we all know the security risks of storing value in thosedo a little mental mathforgeting coinbase,bitfinex, etc(all other exchanges)where coinbase has 60m customersbinance has ~25m customersif 25 mill customer just wanted to 1 day a month buty btc and withdraw.. OR deposit btc to fiat exit/... just 1 event per month25m events per month(25m/4032)=6200 tx a block.. JUST FOR BINANCEdo you really think that bitcoin by looking at average TX a block for last few years(~2000) is actually scaled onchain to handle actually doing what it suppose to do EG not using exchanges as banks/custodians but converting and withdrawing to independent walletbit coin (the network not the crappy sub/side serves/network brand stealing) needs to scaletrying to remain in denial while thinking everything is ok because custodians and altnets take usage away to avoid congestion.. is not the solution",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "November 18, 2022, 02:33:10 PM",
      "body": "Based on recent announcement of CZ, Binance has a total of 475K Bitcoin reserves and probably the source of this new additions supply of token on Binance since they lose some liquidity from there customer to replenish it. I doubt that those crypto user that withdraw is the one who deposit again since most of them is now using DEX.Binance is know for manipulation. They are good on this to show that everything is back to normal and let user be confident on using the CEX again since everyone is coming back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "skarais",
      "created_time": "November 18, 2022, 03:01:09 PM",
      "body": "Quote from: Eternad on November 18, 2022, 02:33:10 PMBased on recent announcement of CZ, Binance has a total of 475K Bitcoin reserves and probably the source of this new additions supply of token on Binance since they lose some liquidity from there customer to replenish it. I doubt that those crypto user that withdraw is the one who deposit again since most of them is now using DEX.Binance is know for manipulation. They are good on this to show that everything is back to normal and let user be confident on using the CEX again since everyone is coming back.The negative sentiment towards Binance seems to be increasing day by day and I don't think things will be so negative towards them as there are still many people who think Binance has been driving positive things towards increasing crypto users worldwide. In Indonesia, crypto users still strongly believe that Binance is one of the best exchanges compared to many local exchanges, this is a positive thing for Binance and the crypto economy in general.But people should realize that Binance is just an exchange that should not be a long term investment asset wallet. Use the exchange as is, and withdraw funds from it after we trade your assets. It's simple, but they have a choice whether to trust a centralized exchange like Binance or not. About the possibility of manipulation, and yes I think it's one of Binance's efforts to appear safe for its customers. But it seems a lot of people are starting to realize that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "November 18, 2022, 03:26:40 PMLast edit: November 18, 2022, 04:22:00 PM by franky1",
      "body": "Quote from: skarais on November 18, 2022, 03:01:09 PMThe negative sentiment towards Binance seems to be increasing day by day.a few thousands whales invested heavily in FTX. and they lost everythinghowever instead of wanting 'scam bankman fraud' arrested, they blame their loss on binance actions of whistleblowing (the lack of liquidity of FTX that triggered the drama) and blaming the SEC for wanting transparency of exchangesstupid thing is kevin o'leary (sharktank) invested in FTX and lost all his investment.. calling it disapointing yet he still loves 'Scam bankman fraud' saying that he hopes to see SBF in a new crypto business in the future because he calls SBF a smart trader(the video captions instead wrote traitor  good caption edit)https://www.youtube.com/watch?v=eA0Uy926ozY",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "T0asti",
      "created_time": "November 18, 2022, 03:32:50 PM",
      "body": "Thanks for all the replies.Consolidation or not this is the first time we know for a fact that Binanceis holding at least 570,000 Bitcoin in their wallets. (again up ~3000 from when I shared this post)This fact alone is crazy imo.Will be interesting to see how much they will scrape together so we get a better picture of how manycoins the AT-LEAST hold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "November 18, 2022, 04:25:01 PM",
      "body": "Quote from: T0asti on November 18, 2022, 12:12:52 PMDo we have some info about that or any idea whats going on? No matter what's actually going on, anyone that still has many on any exchange/platform after everything that has happened is asking for trouble. Quote from: franky1 on November 18, 2022, 03:26:40 PMstupid thing is kevin o'leary (sharktank) invested in FTX and lost all his investment.. yet he still loves Scam bankman fraud saying that he hopes to see SBF in a new crypto business in the future becasue he calls SBF a smart trader(the video captions write traitor  good caption edit)https://www.youtube.com/watch?v=eA0Uy926ozYHoly fuck, he is talking about SBF like he is God's gift to crypto community and not just another scammer that mismanaged other's people money.I guess it's much easier for ego to think about him that way, instead admitting to yourself and the others that as an experienced entrepreneur you failed to see who are you dealing with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "November 18, 2022, 09:17:27 PM",
      "body": "Quote from: T0asti on November 18, 2022, 12:12:52 PMGood day everyone,since the collapse of FTX we had many discussion about people withdrawing their Bitcoin from exchanges. You can check the balances here https://www.coinglass.com/Balance.We went from 2.1 million BTC all the way down to 1.9 million BTC.Until yesterday Binance was one of the biggest looser with over 80k BTC withdrawn over the last 30 days. Coinbase was ranked first, but also with massive loses. Nearly all exchanges lost huge amounts, fitting perfectly in the narrative of people withdrawing their bitcoin.But suddenly in the last 24 hours Binance added and incredible 92,000 Bitcoin to their exchange an amount never seen before on the exchange (according to coinglass, and if you check the last 12 months). I found very little info about that, and all nearly other exchanges are still getting their balance reduces.Do we have some info about that or any idea whats going on?Or maybe Binance or CZ wanted to show their \"proof of reserves\" or whatever he calls it?But there are still outflows and inflows that we really don't know what's going on behind the scene, and everyone is upbeat because of what had happened to FTX. And I guess this is going to continue, until everything settles down.https://coingape.com/are-crypto-exchanges-faking-proof-of-reserves-cz-warns-investors/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "November 19, 2022, 02:54:38 AM",
      "body": "Quote from: Jating on November 18, 2022, 09:17:27 PMBut there are still outflows and inflows that we really don't know what's going on behind the scene, and everyone is upbeat because of what had happened to FTX. And I guess this is going to continue, until everything settles down.just like traditional banks. people dont deposit all their funds. do a action and withdraw all their funds same daybanks know people get paid a large lump at start of month slowly deplete it over the 30days until their next monthcoin custodians/exchanges know people deposit. they trade for a few weeks/months then withdrawbanks/custodians know that people only move about 1%-5% of the reserves at any given time/day so the outflows and inflows are a small % variance on any given day compared to reserves.. many other exchanges sweep those inflows to cold store often. where as binance waits weeks/months before sweeping. but suddenly this month binance sweeped all deposits in one swoop in a day to cold store that left the network congested with pending tx to confirm",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "November 19, 2022, 09:04:33 AM",
      "body": "Quote from: T0asti on November 18, 2022, 03:32:50 PMConsolidation or not this is the first time we know for a fact that Binanceis holding at least 570,000 Bitcoin in their wallets. (again up ~3000 from when I shared this post)This fact alone is crazy imo.This is more sad than crazy. It shows that a large number of people still keep their coins on exchanges, in other words despite all the recent withdrawals the people with balance on exchanges are still at large. This is the same with other exchanges too, not just Binance. The problem is with the site you posted in your first post, they don't know all the addresses of each exchange so they have no way of knowing how much coins each one actually has. They go with what is publicly known and that is what the exchange wants them to know!So for example if Binance wants us to know they have 100k bitcoin, that is what they put in their publicly known addresses and if they want us to know they have 500k (proving they are solvant) they increase its balance.It is sometimes done in competition with other exchanges too. For example Binance wants to look bigger than KuCoin so they show more of their balance, if they want to evade taxes they reveal less of their balance!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "November 19, 2022, 09:16:46 AM",
      "body": "Well, I think some people are also withdrawing their coins from lesser known Exchanges and moving them to bigger well known exchanges..... something that Binance anticipated.    I mean.... you do not throw your competition (FTX) under the bus, by withdrawing your promise to support them... if you do not plan to receive some benefit from that in the future... do you? Exchanges has been a talking point for years.... and we saw in Japan how competitive they can be.... even using fake trading volumes to boost their image.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "November 19, 2022, 09:34:27 AM",
      "body": "We are not yet ready to embrace Bitcoin considering how much trust there is in centralized exchanges. Binance was one of the first to support this proof-of-funds hype attempting to attract new and dissatisfied users from FTX and other places. Hardware wallet manufacturers are reporting an increase in sales, which is positive, but I am afraid that most of the liquidity will unfortunately just move to other CEXs. Binance is, of course, at the top of that list. Some people learn. Others just change the color of their shirts and carry on in the same way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "November 20, 2022, 01:57:35 PM",
      "body": "I am considering this as just a small proof that Binance and its CZ made the right choices when it comes to the FTX debacle...and though many people may not look CZ favorably yet this exchange platform can be coming out to be the real and big winner in this market war. FTX loses and Binance wins. But the next question is: Will this be another big win also for the people who are into cryptocurrency or maybe this is just another day of doing good business for money?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "November 20, 2022, 03:51:45 PM",
      "body": "Quote from: pooya87 on November 19, 2022, 09:04:33 AMThis is more sad than crazy. It shows that a large number of people still keep their coins on exchanges, in other words despite all the recent withdrawals the people with balance on exchanges are still at large. This is the same with other exchanges too, not just Binance. This is because these people don't know better than that, and by that I mean that they are not able to download and install a regular desktop/mobile wallet, and they probably don't even know that there is such a thing as a hardware wallet. Even those who would very much like to withdraw their funds (BTC) are often discouraged by the fact that CEX charges them expensive fees, which makes them live in the belief that BTC transactions are too expensive and should be done as rarely as possible.CEX are playing their dirty game because they know they can't keep liquidity any other way, and luckily for them there are millions who believe their stories.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AverageGlabella",
      "created_time": "November 20, 2022, 04:10:29 PM",
      "body": "Quote from: pooya87 on November 19, 2022, 09:04:33 AMThe problem is with the site you posted in your first post, they don't know all the addresses of each exchange so they have no way of knowing how much coins each one actually has. They go with what is publicly known and that is what the exchange wants them to know!So for example if Binance wants us to know they have 100k bitcoin, that is what they put in their publicly known addresses and if they want us to know they have 500k (proving they are solvant) they increase its balance.It is sometimes done in competition with other exchanges too. For example Binance wants to look bigger than KuCoin so they show more of their balance, if they want to evade taxes they reveal less of their balance!People are stupid and it is proven every time something like this happens. The people who got burnt on ftx probably got burnt on mt gox. I think in the next couple of months will be the battle of proof of reserves. I would not be surprised if the exchanges go into debt to buy more 'proof of reserves' and try to convince the people looking for another exchange coming from ftx to join their platform. If you have Binance that has $500,000 in reserves and Kraken that only has $300,000 in reserves (made up numbers as example) most people will see that and will go for the one that has more proof of funds and since they are looking for a exchange anyway it is good business to invest money into improving your proof of reserves even if it is only for a short time. This could lead to more exchanges fallen in the future if they have over invested trying to compete and do not get the return.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}