{
  "id": "topic_5463316",
  "title": "DireWolfM14",
  "author": "DireWolfM14",
  "created_time": "August 15, 2023, 02:10:59 AMLast edit: December 17, 2023, 03:55:05 PM by DireWolfM14",
  "content": "Moved here: https://bitcointalk.org/index.php?topic=5478275.0",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463316",
  "comments": [
    {
      "author": "MoparMiningLLC",
      "created_time": "September 12, 2023, 12:34:18 PM",
      "body": "I have one of these - nice revolver. has been great for teaching my grandkids to shoot.I have a SA XDs mod2 chambered in .45ACP - will be keeping an eye out for your SA listings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SpeedRacerF1",
      "created_time": "September 21, 2023, 12:09:22 PM",
      "body": "Why do you only offer to \"USA Residents\" and \"FFL Dealer\"? This is against the Organic Laws of The United States of America. The people do not need permission from anyone to keep and bear arms. You can send the goods to the \"general post office\" for the purchaser to pick up at their convenience.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "September 21, 2023, 04:55:04 PMLast edit: September 21, 2023, 05:06:26 PM by DireWolfM14",
      "body": "Quote from: SpeedRacerF1 on September 21, 2023, 12:09:22 PMWhy do you only offer to \"USA Residents\" and \"FFL Dealer\"?Okay, Rip Van Winkle.  I, personally don't care to commit any felonies by violating the Federal Firearms Act of 1938.  Why do so many third-world goons think they're experts on American firearm laws?  I should have made this a self-moderated thread, I guess.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SpeedRacerF1",
      "created_time": "September 21, 2023, 08:21:12 PM",
      "body": "Unlawful acts are void from the moment they are uttered, my friend. Don't try to hold that up as an excuse for your trespass against the laws of the land, which are here:https://uscode.house.gov/browse/frontmatter/organiclawsThe law of The United States of America does not include:- Statutes- Codes- Regulations- RulesThese things all require a valid contractual nexus to be voluntarily formed, where you received full disclosure of all material facts up front, and where you received valuable consideration. Something that was already you right to do (sell arms to the people) cannot be licensed.Did you consent to be governed? The law requires that you do before you are subject to \"government\" by third parties.The only lawful purpose for government to be established is to SECURE the rights granted to man by God.All benefits and privileges under government are available to those who choose not to consent, and govern themselves. This is I. You refusing to sell to people such I means you are committing another trespass against the people and The United States.FFL is for selling FIREARMS to the PUBLIC (persons), i.e. to the government and its agents.No license is required to sell arms to men and women (people).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}