{
  "id": "topic_5465777",
  "title": "Egii Nna",
  "author": "Egii Nna",
  "created_time": "September 05, 2023, 05:08:18 PM",
  "content": "I dey great oo my people as e dey happen for our country about this hardship as I go dey read previous and present news on other solutions and ways that we can follow so overcome Watin we day face for our country, in this process I came across a news that I was very excited with  I saw the CEO manoka island trade and crypto waves, said, he urged Nigeria bank to seize the opportunity of rapid evolution of cryptocurrency and blockchain technology to boost Nigeria economy. Hearing this I was overwhelmed I decided to share the information with my fellow 9ja mate in the forum Reference https://guardian.ng/business-services/entrepreneur-tasks-banks-on-cryptocurrency/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465777",
  "comments": [
    {
      "author": "Nwada001",
      "created_time": "September 05, 2023, 07:25:42 PM",
      "body": "I just read through the entire article, and the speaker was directing his speech and advice to Nigerian banks on how they can benefit from the new financial system (cryptocurrency), which is good, and the government will benefit heavily from taxation. A few job creations will be open, which is also good, but I saw nothing like empowering, training, and all that, which can really help the lives of the youth ascertain the knowledge of being productive in the crypto space.And based on the article, the thing that the banks can do as advised is run something similar to PayPal, that is, if they do not have a separate payment network for crypto currency, they can initiate a simple system that can allow the buying and withdrawal of crypto, and they can milk their customers heavily in the aspect of fees. The government can also tax each purchase that is being made using any of the Nigerian bank payments, which is also an extra income for the government. My question here is, will anyone who already knows the way of buying and selling crypto in this country be willing to use such a service?And is the economy problem of this country mainly not having enough funds to generate (both from external and internal revenue sources) or is the problem mismanagement?What difference will it even make if they are able to earn most of their income from crypto currency purchases? Will that one make a difference?IMO, the only way I see this as going to be beneficial is for those who have known about crypto currency but are afraid of going into it because of some sort of restriction and not knowing how to do it, to be willing to do that since they can then buy through their bank account and won't be afraid of disobeying any law.And the few job creations that might come afterwards, if they will consider using the experience developers we have here in our local community and not run entirely to outsiders,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 06, 2023, 10:55:08 PM",
      "body": "The problem is beyond only banks to start providing bitcoin and crypto services. Nigerian government are annoying. They have failed to know the benefit of cryptocurrencies. You can see the crypto exchanges that are not registered in Nigeria but providing CexP2P services for their Nigerian customers while Nigerian government are not benefiting from them. This alone points to how we are not having competent leaders. Cryptocurrencies would have been a means to create more jobs in Nigeria, but our government are ignorant to make this become reality.Quote from: Nwada001 on September 05, 2023, 07:25:42 PMMy question here is, will anyone who already knows the way of buying and selling crypto in this country be willing to use such a service?I do not think so, but there are many people that do not know much about bitcoin and other cryptocurrencies. I have many people that I noticed they did not buy bitcoin because they are afraid. I can remember my brother that is good in forex, he told me that he was afraid to invest in bitcoin because his money (bitcoin) can be lost, until few years ago that he later realized that his coins can be safe and secure. There are people that may not just invest because they do not really know how bitcoin and other cryptocurrencies are. But if banks start to provide crypto services to their customers, there are people like my brother that will invest.This is off-topic but worth mentioning. Not your key not your coin, but some people do not think that way. The reason people believe that if bitcoin spot ETF is approved in United States that the price of bitcoin will increase more is because they know some people believes in traditional market, but not having knowledge about bitcoin, that if bitcoin is introduced into the traditional market in form of ETF, that more people will buy the ETF. That is how people are, not everyone can know much about bitcoin the way we do on this forum. Quote from: Nwada001 on September 05, 2023, 07:25:42 PMAnd is the economy problem of this country mainly not having enough funds to generate (both from external and internal revenue sources) or is the problem mismanagement?The main problem we have is mismanagement. Cryptocurrencies is also just one area, there are many other areas that need to be taken care of. We lag behind in technology and this will not help us us in the future and neither would it help out future generations. The problem we have in the country is that we are not producing as much as we supposed to produced and we depend more on imports. But the reason everything has been like this is mainly because of mismanagement. Quote from: Nwada001 on September 05, 2023, 07:25:42 PMWhat difference will it even make if they are able to earn most of their income from crypto currency purchases? Will that one make a difference?If our government is wise and earn tax from crypto, it would help. Although, it is not only one thing that make up the economy, but cryptocurrencies are just one of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "September 07, 2023, 06:48:42 AM",
      "body": "Op your topic is not attractive to people so most of us e no dey visit am. If to say Charles-Tim did not quote di thread for one im comment I for no know say na dis kind matter nai e dey here. So please when you see things like dis next make di topic relate to the content or since content has cryptocurrency discussion, you have to include crypto in the topic so people can see and easily visit the thread. Oya look at it since on Tuesday till now na only 2 persons don make comments. No bi say weti bring na bad thing but the topic e no dey attract people to visit.This na good move by CEO Manoka Island Trade and Krypto Waves and also Mit Phoenix who is trying to encourage the defunct crypto bank to come back again. But one thing I know be say banks are interested to involve themselves in cryptocurrency but their problem nos the Central Bank of Nigeria, because CBN control the smaller banks and tell them what to do and they have to obey. But at least the information has passed to them with the benefits involved in adopting cryptocurrency in the banking system and other institutions. These are the truth cryptocurrency investors, whales, and others supposed give to Nigeria government so that they would restructure their plans on cryptocurrency. From the article all the sections and sectors that mentioned there are very much important to implement cryptocurrency but the most effective one among them is the formal and informal Sectors because that one go propagate the news and awareness of cryptocurrency speedily. But for the employment aspect is the area I am concerned. Nigeria is still very backward in technology, so adopting cryptocurrency might not increase the employment rate in the country but as for the increment of the economy, it is sure that the economy will be boost up and the inflation might come down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EluguHcman",
      "created_time": "September 07, 2023, 03:03:39 PM",
      "body": "Til CBN bring to the Federal Government the ideology on how dem go feed on public funds through this cryptocurrencies due to its decentralization cuz out Govts dey always like typhooning so til dem get dat up before dem fit make this happen else make we just wonder why a Govt go resist wetin get to boost a Federal economy 😏",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ruttoshi",
      "created_time": "September 07, 2023, 08:46:22 PM",
      "body": "It is a pity that our leaders don't  understanding the potential of cryptocurrency and how to generate tax from it for the country development. Assuming the early time that crypto came into the country and people were embracing massively, they could have  insight to see how the country can benefit from it and work towards it. Instead they only saw the other side of crypto, thinking that it will be like a barrier to investors from keeping their money in the bank.I wouldn't really put the blame on the president but on the Central Bank Governor,who they gave the power to decide on which currency to use or not. Out of his own low mentality on crypto restricted banks from trading with crypto,which discouraged many people from crypto. It is now that the former CBN governor Emiefele is no long in office that people who understands the advantage of cryptocurrency is trying to talk to the government for them to understand that the adoption will help the youths in provision of jobs and will generate tax for the country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartGold01",
      "created_time": "September 08, 2023, 12:16:30 PM",
      "body": "Though he could be right from his speech on the article but ..Let say when a country is facing economy crisis there's no way cryptocurrency I mean bitcoin could solve such problems as I believe to know, basically this could only help to reduce or create additional opportunities to their occupants or to inhabitants of such country but thinking accepting cryptocurrency as method of payment will never lift and settled a dying economy but if the government of such country ( I mean Nigeria) could reduce and change their minds from consumption to production country then I can assure that our country could drastically changed from a dying to a reviving nation. Then cryptocurrency can now play a crucial roles to help create opportunity by which people will massively involved in trading, investment and holding, mining as well as companies or individuals accepting it as payment gateway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iBaba",
      "created_time": "September 08, 2023, 07:48:11 PM",
      "body": "Quote from: Nwada001 on September 05, 2023, 07:25:42 PMI just read through the entire article, and the speaker was directing his speech and advice to Nigerian banks on how they can benefit from the new financial system (cryptocurrency), which is good, and the government will benefit heavily from taxation. A few job creations will be open, which is also good, but I saw nothing like empowering, training, and all that, which can really help the lives of the youth ascertain the knowledge of being productive in the crypto space.Nna ehn, especially at this period wey we dey, government suppose take the issue of diversification serious especially in the Fintech industry so that e go open more doors for the average and less-priviledged citizens. The number one way, wey dem fit achieve that na wen dem draw young people close to the government. Young people wey get doings. And trust me, by so doing. More jobs will be created and e go they easy to train people, through train the trainer mentorship programs.Quote And based on the article, the thing that the banks can do as advised is run something similar to PayPal, that is, if they do not have a separate payment network for crypto currency, they can initiate a simple system that can allow the buying and withdrawal of crypto, and they can milk their customers heavily in the aspect of fees. The government can also tax each purchase that is being made using any of the Nigerian bank payments, which is also an extra income for the government.See indigenous companies like Flutterwave and Paystack too. If government fit open their arms towards partnering with these payment gateways, e go dey easier to build more confidence to people and the taxes go dey locally collected. Quote My question here is, will anyone who already knows the way of buying and selling crypto in this country be willing to use such a service?And is the economy problem of this country mainly not having enough funds to generate (both from external and internal revenue sources) or is the problem mismanagement?What difference will it even make if they are able to earn most of their income from crypto currency purchases? Will that one make a difference?IMO, the only way I see this as going to be beneficial is for those who have known about crypto currency but are afraid of going into it because of some sort of restriction and not knowing how to do it, to be willing to do that since they can then buy through their bank account and won't be afraid of disobeying any law.And the few job creations that might come afterwards, if they will consider using the experience developers we have here in our local community and not run entirely to outsiders,At last, we need plenty awareness creation and community engagement about some of these new technologies. You sabi how our people dey conservative to new ideas. We go need just take am slow slow in to the schools and other institutions. For example, e don tey wey I know about bitcoin. But e never too tey wey I enter the house. Everything boils down to awareness creation sha!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Antotena",
      "created_time": "September 08, 2023, 08:10:39 PM",
      "body": "Quote from: Egii Nna on September 05, 2023, 05:08:18 PMI dey great oo my people as e dey happen for our country about this hardship as I go dey read previous and present news on other solutions and ways that we can follow so overcome Watin we day face for our country, in this process I came across a news that I was very excited with  I saw the CEO manoka island trade and crypto waves, said, he urged Nigeria bank to seize the opportunity of rapid evolution of cryptocurrency and blockchain technology to boost Nigeria economy. Hearing this I was overwhelmed I decided to share the information with my fellow 9ja mate in the forum Reference https://guardian.ng/business-services/entrepreneur-tasks-banks-on-cryptocurrency/It wouldn't work, not under the watch of the central bank. They have prohibited banks from engaging anything that has to do with cryptocurrency nd fiat, it will not happen under their watch because any bank whether microfinance or commercial bank that does that will be sanction or even suspended for violating the act the of central bank. Even though the commercial banks and micro finance are still use got p2p, they will close down accounts that indicates bitcoin or crypto word under transaction reference.Banks are not even in position to replicate what PayPal did, how many commercial banks are doing what PayPal is doing, it's because of regulation and the same regulation stand here in Nigeria as well. The only company thag is close to doing PayPal thing is Flucterwave, they facilate transaction across different countries and within Nigeria just like PayPal does and were also facilitating crypto transaction but they have stop because of the directive from Central Bank. If central bank revokes that policy, may be later it will happen sooner than expected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}