{
  "id": "topic_5439706",
  "title": "Abiky",
  "author": "Abiky",
  "created_time": "February 13, 2023, 11:41:39 AM",
  "content": "There are rumors that the US will enter a full-scale war with China once it invades Taiwan in 2025. If we thought the Russo-Ukraine war was coming to an end, then we ain't seen nothing yet. Such a catastrophe within the world's biggest economies (US and China) could lead us to a very dark future where the global economy collapses for good. After all, the US is the biggest economy in the world followed by China. Things will get worse if Russia is still at war with Ukraine by the time this happens. It seems like both China and Russia have ambitions to rule the world, so maybe a \"New World Order\" is upon us?How deep of an impact will a US-China-Taiwan conflict have over the global economy? Do you think there's still a possibility for economic recovery after the crisis? Will this weaken the US in the long run? Or will it strengthen it? Your input will be greatly appreciated. Thanks.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5439706",
  "comments": [
    {
      "author": "EarnOnVictor",
      "created_time": "February 13, 2023, 12:23:32 PM",
      "body": "No one prays for war, but the USA-China war might be counting down in years, and many of the US top military personnel have confirmed it. I will only blame the world for this by giving China undue power economically, which might, in turn, alter the balance of the world. The two countries I fear most aside from the terrorism-inflicted countries are China and Russia, while the latter has shown the world how irresistible it is, China is only waiting for opportunities. And with their economic power, they can do and undo, but the implication of the Taiwan invasion will be minimal economically since the world does not depend on Taiwan the way they depend on Ukraine for supplies of sunflower meal, oil, seed, wheat and many raw materials.Only China might be economically sanctioned and might cause further inflation, but it would not be as impactful since the world does not majorly depend on either China or Taiwan for food and raw materials which are major factors that aggravate inflation, the impact might be suppressible as the world turns elsewhere to fulfil their demands and also cooperate with the economic sanction of China tactically.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "February 13, 2023, 01:23:22 PM",
      "body": "Both US and China-Taiwan have huge influence to economy, it would cause a crisis in every country because almost all countries are depends on neither US or China-Taiwan. But I don't think it's become a war like Russia-Ukraine where each country will hurt the other using military weapons, I would think both country will try to restrict or limit a way of the export and import which is an economy war. Then it's depends on US and China-Taiwan if they will start to war using military weapons or not, because they wouldn't being silent if they can't make money anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "February 13, 2023, 01:42:41 PM",
      "body": "Quote from: EarnOnVictor on February 13, 2023, 12:23:32 PMNo one prays for war, but the USA-China war might be counting down in years, and many of the US top military personnel have confirmed it. I will only blame the world for this by giving China undue power economically, which might, in turn, alter the balance of the world. The two countries I fear most aside from the terrorism-inflicted countries are China and Russia, while the latter has shown the world how irresistible it is, China is only waiting for opportunities. And with their economic power, they can do and undo, but the implication of the Taiwan invasion will be minimal economically since the world does not depend on Taiwan the way they depend on Ukraine for supplies of sunflower meal, oil, seed, wheat and many raw materials.And you're saying we need food more than computer chips?  That's probably accurate. Not sure how well they can be produced elsewhere either.A China US war would have a huge impact on most international relations and would probably strain them. I don't know if China could handle a them against the world war though if they did try to start one with the US (I don't know how many countries are friendly with either but hopefully we don't have to wait to get a repeat of what happened in the second world war of people assisting invaders until they realised they were worse than what they already had - eg stealing resources, political power etc).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iroh",
      "created_time": "February 13, 2023, 01:49:13 PM",
      "body": "Quote from: Abiky on February 13, 2023, 11:41:39 AMHow deep of an impact will a US-China-Taiwan conflict have over the global economy? Do you think there's still a possibility for economic recovery after the crisis? Will this weaken the US in the long run? Or will it strengthen it? Your input will be greatly appreciated. Thanks. The United States and China are two of the biggest economies of the world, exporting more than they import thus making them a growing and thriving economy. We’re currently experiencing the pushbacks of the war involving Russia and Ukraine and it has been so far not a good experience. The economic fallout of the war has been disastrous and has been felt in most parts of the world. Food shortages as well as energy crisis has rocked the world since the war began. If the United States go into a war with China, the impact would be devastating and the impact would be felt worldwide. The United States with all its aid program that donates billions of dollars to countries in need and various NGOs like the WHO, and all the United Nations affiliated organizations would likely stop and that would in turn would have an enormous effect on the world. War is really disastrous even between two small nations and economies. With countries like the United States and China going into a war, the negative impact would be felt hard all over the earth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "February 13, 2023, 04:14:26 PM",
      "body": "Given the way that global demand for personal computers, GPUs and gaming PCs has declined in recent years. I do not think conflict in taiwan would have as much of an impact. While pressure is definitely being applied to taiwan. Its no guarantee of armed conflict or full blown war. Taiwan is probably not a high priority for china or the united states. All eyes at the moment are likely on russia and ukraine. If the war in ukraine escalates, taiwan might easily be forgotten in the background. It is possible that PC gaming is also on a global decline. Mobile gaming markets are growing, while PC gaming declines. We can see this in new consoles like the playstation 5 not having the all star line up of flagship titles they normally enjoy on release. The economics of the gaming industry is one where PC games are expensive to develop while offering small profit margins. While mobile games offer high revenues with far lower cost of development expense. Taiwans semiconductor industry revolving around high performance (low nanometer scale) chips in PCs, gives them more leeway as PC gaming declines worldwide. Although TBH I'm not 100% certain what the chip breakdown is for taiwan. I know they produce many high performance chips which are typically associated with high end performance PCs used by gamers. But as for the rest of their business I'm 100% certain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "February 13, 2023, 05:21:34 PM",
      "body": "I hope that these rumors will not come true, although I was hoping that the attack on Ukraine would not happen either, but it happened anyway. In the event that China attacks Taiwan and the US begins to defend it in the sense of placing its military forces between Taiwan and China, it would practically mean that two leading military and economic powers are clashing, which would shake the world far more than is the case for the current war in Ukraine.We should not forget that China is the most important logistics center with 7 of the 10 largest seaports in the world and that their cities-factories produce most of the devices we use today. The question is whether the US would take a risk for an island, no matter what it is called or where it is, because insisting on such a policy would have unfathomable consequences for their country, but also for all other countries in the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "February 13, 2023, 05:33:54 PM",
      "body": "Quote from: Abiky on February 13, 2023, 11:41:39 AMWill this weaken the US in the long run? Or will it strengthen it? The US is already involved in sponsoring many military missions worldwide, over stretched as it is, the US is already weakening unlike china that is not so involved in many military exercises. A conflict between US-China and Taiwan will weaken the US more and will have a massive global effect because the united states and china are two countries that are engaged in production of materials and things exported worldwide, the United States and China also have a lot of military alliances, many countries will be drawn into the war by virtue of their agreement.Quote from: Abiky on February 13, 2023, 11:41:39 AMHow deep of an impact will a US-China-Taiwan conflict have over the global economy? The impact will be more than the crisis between Russia-Ukraine. Many countries will be affected, there will be shortages of some commodities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "February 13, 2023, 05:37:29 PM",
      "body": "The US government acknowledges that Taiwan is China so there is no invasion of Taiwan. They are just making it up in fact the majority of the people in Taiwan favor unification with China. Biden administration couldn't make a friendly competition in the economy so they just encircle China. But if war really happens, I don't think they get will cross the sea to attack, the whole fleet will just sink. China can just take any missile attack from the sea.But sure the war will weaken China. This is if the BRICS will not go for gold already and have not abandoned completely the USD. So its a race for US to go war before this happens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "February 13, 2023, 06:16:21 PM",
      "body": "Quote from: Abiky on February 13, 2023, 11:41:39 AMHow deep of an impact will a US-China-Taiwan conflict have over the global economy? Do you think there's still a possibility for economic recovery after the crisis? Will this weaken the US in the long run? Or will it strengthen it? Your input will be greatly appreciated. Thanks. We flashback to the impact when Russia invaded Ukraine. Maybe this impact is felt more by the surrounding countries and countries that have a role on both sides. Do not underestimate the impact of Russia and Ukraine because whether you realize it or not, there has been a spike in prices, especially in the oil and gas sector.However, if this continues with the outbreak of war between the US and China, it is unimaginable that the world will experience the worst crisis of all time. Nothing can be expected because other countries have close trade relations with the two countries. The process of recovery from the results of the war took many years, and not a few countries failed to recover after a major war.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "February 13, 2023, 07:51:54 PM",
      "body": "I wouldn't put so much weight on gut feeling of some US general about the threat. Tensions have been building for a long time now and situation in the world isn't helping.There are ton of CPC propaganda trying to scare people about what happens if US gets involved into this invasion, ignoring the fact that US have been involved in this from the start and it's China who should watch their steps now. If there's going to be a fight, it's most likely rogue nations against the whole civilized world as this is going to be very symbolic fight with pretty clear objectives.Literally Democracy versus totalitarianism.I am seeing only reason for invasion at this point to save China's face, or more likely Chinas' leader Xi Jinping, and that's as a very fragile face (Winnie Pooh). And China knows exactly what happens when it gets isolated along with Russia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "February 13, 2023, 08:13:47 PM",
      "body": "Quote from: Abiky on February 13, 2023, 11:41:39 AMThere are rumors that the US will enter a full-scale war with China once it invades Taiwan in 2025. If we thought the Russo-Ukraine war was coming to an end, then we ain't seen nothing yet. Such a catastrophe within the world's biggest economies (US and China) could lead us to a very dark future where the global economy collapses for good. After all, the US is the biggest economy in the world followed by China. Things will get worse if Russia is still at war with Ukraine by the time this happens. It seems like both China and Russia have ambitions to rule the world, so maybe a \"New World Order\" is upon us?How deep of an impact will a US-China-Taiwan conflict have over the global economy? Do you think there's still a possibility for economic recovery after the crisis? Will this weaken the US in the long run? Or will it strengthen it? Your input will be greatly appreciated. Thanks. Let's hope it doesn't come any time soon, especially while Russia is already at war with Ukraine, because all of the extra confusion could really send us spiraling into situations that were never expected. One war between two  fairly large countries is bad enough, but if it escalates then there could be all sorts of unintended spillovers and events may get far beyond the abilities of the politicians to control them - even if they do end up starting them. Not to mention it will likely cause a very severe shock to the world economy because so many microchips are created in Taiwan and you can say goodbye to the original supply chains coming out of China with all sorts of electronic goods. Russia's invasion of Ukraine would look tiny in comparison.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serveria.com",
      "created_time": "February 13, 2023, 08:19:28 PM",
      "body": "Quote from: Abiky on February 13, 2023, 11:41:39 AMThere are rumors that the US will enter a full-scale war with China once it invades Taiwan in 2025. If we thought the Russo-Ukraine war was coming to an end, then we ain't seen nothing yet. Such a catastrophe within the world's biggest economies (US and China) could lead us to a very dark future where the global economy collapses for good. After all, the US is the biggest economy in the world followed by China. Things will get worse if Russia is still at war with Ukraine by the time this happens. It seems like both China and Russia have ambitions to rule the world, so maybe a \"New World Order\" is upon us?How deep of an impact will a US-China-Taiwan conflict have over the global economy? Do you think there's still a possibility for economic recovery after the crisis? Will this weaken the US in the long run? Or will it strengthen it? Your input will be greatly appreciated. Thanks. First, I have to say that I don't believe such a scenario is possible (disclaimer: I was sure Russia wasn't going to invade Ukraine   ) but in a very unlikely event of a full-scale war between US and China, I guess we're all doomed. Both countries possess nuclear weapons and will probably try to nuke each other asap. I also believe that Russo-Ukrainian war will end before 2025 (later this year or early 2024 is my prediction).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "February 13, 2023, 08:38:01 PM",
      "body": "China and the US at war is already a huge blow to the world, and to be honest it seems like they are already 'at it' but just not through violence but through economic sabotages and whatnot. Should these two giants go to war against each other, a lot of countries will be forced to join the war and it will literally be just bloodshed everywhere. I think both countries are using Taiwan as their fuse to have a reason to declare war against each other, and China knows that too that's why they're constantly trying to agitate Taiwan by sending in fighter jets to patrol around the region and cause a reaction from US or Taiwan. No one wants this war to happen, but it seems that the top brass of both countries are itching to have it their way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "February 13, 2023, 10:09:12 PM",
      "body": "Economic implications?  If any of the big world powers end up in a war, economics might come down to how many cockroaches you can scrounge up to feed whatever is left of your family, assuming any of us are alive at the end of said war.But before the nukes start flying, I'd expect severe sanctions to be imposed on all sides, just like with Russia.  As far as the US is concerned, if China were to impose sanctions like that, it'd cripple our economy (or at least put a big ding in it).  I'm hoping none of this happens--for the sake of generations to come, because a war between China and the US would probably wind up as a full-blown world war, and as you probably all are aware we've got much more powerful weapons now than during the last world war.And yet we have all of these UFOs flying around....kinda makes you wonder if the rumors Abiky referenced are true.  I don't suspect they're from outer space; they're probably Chinese spy-things gathering intel.  Ugh.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Casdinyard",
      "created_time": "February 13, 2023, 10:54:30 PM",
      "body": "Quote from: Jawhead999 on February 13, 2023, 01:23:22 PMBoth US and China-Taiwan have huge influence to economy, it would cause a crisis in every country because almost all countries are depends on neither US or China-Taiwan. But I don't think it's become a war like Russia-Ukraine where each country will hurt the other using military weapons, I would think both country will try to restrict or limit a way of the export and import which is an economy war. Then it's depends on US and China-Taiwan if they will start to war using military weapons or not, because they wouldn't being silent if they can't make money anymore. Just a little correction, Taiwan doesn't have an economic power that is as influential as China's but what it lacks in economic ppwer, it makes up with creating allies within its borders, and the west. Taiwan, has gained the favor of USA and thus will loop them in, along with suballies of the dtate possibly, should a full-scale war against China commence. If a war were to happen between these three nation-states it will not be like the Russo-Ukrainian conflict, it will be of a larger scale considering the firepower each of these countries could put out. Ultimately, I do hope that China lets go of their chokehold on Taiwan and have things end in a diplomatic manner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Desmong",
      "created_time": "February 13, 2023, 10:59:25 PM",
      "body": "This will have greater effect on the Americans that had been backing the country. It will already affect china because the NATO may declear war against china which is going to be very hard for chip producing countries to be able to meet up with standard. China is going to have a taste of there cake just like we are seeing im Russia Ukraine war.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iroh",
      "created_time": "February 14, 2023, 05:47:26 AM",
      "body": "Quote from: Bananington on February 13, 2023, 05:33:54 PMQuote from: Abiky on February 13, 2023, 11:41:39 AMWill this weaken the US in the long run? Or will it strengthen it? The US is already involved in sponsoring many military missions worldwide, over stretched as it is, the US is already weakening unlike china that is not so involved in many military exercises. A conflict between US-China and Taiwan will weaken the US more and will have a massive global effect because the united states and china are two countries that are engaged in production of materials and things exported worldwide, the United States and China also have a lot of military alliances, many countries will be drawn into the war by virtue of their agreement. The US is involved in military drills and missions worldwide. I won’t exactly say they’re sponsoring these drills and missions worldwide. And if it’s the Russia Ukraine war that you’re talking about, it’s no new news that the United States is actively sending aid in the form of weapons and equipments. You should know those equipments and weapons are in reserve and could be gifted to other nations. It won’t affect their military operations and capabilities in any way. The US is not already weakening like you purported, I wouldn’t want to be alive in a world where the two largest economies and military might go into a war to fight themselves. I’d like to think that the US has more allies than China has and in the event of a war, those allies won’t sit on the sidelines for long.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tiCeR",
      "created_time": "February 14, 2023, 07:18:46 AM",
      "body": "Quote from: o48o on February 13, 2023, 07:51:54 PMI wouldn't put so much weight on gut feeling of some US general about the threat. Tensions have been building for a long time now and situation in the world isn't helping.There are ton of CPC propaganda trying to scare people about what happens if US gets involved into this invasion, ignoring the fact that US have been involved in this from the start and it's China who should watch their steps now. If there's going to be a fight, it's most likely rogue nations against the whole civilized world as this is going to be very symbolic fight with pretty clear objectives.Literally Democracy versus totalitarianism.I am seeing only reason for invasion at this point to save China's face, or more likely Chinas' leader Xi Jinping, and that's as a very fragile face (Winnie Pooh). And China knows exactly what happens when it gets isolated along with Russia.That is what I think as well. Somehow these totalitarian regimes think that war propaganda is an essential element for their governments to stay in power. Hence, China is nonstop talking about how they are getting pulled into a war that they don't actually want, which is of course ridiculous. But at the same time China isn't interested in a global war. They have been acquiring critical infrastructure all around the globe. They have been pushing their Belt and Road Initiative (New Silk Road) aggressively for many years now. I think they would do this only when plan on fighting a war with sanctions rather than with real weapons or even nuclear weapons. As The Sceptical Chymist said, sanctions are the likely scenario at least in the beginning. Nobody would build such an economic network if the plan is to nuke planet Earth anyway. China does know that fighting a military war would put all of their decades long efforts to an end. There are also the major non-Nato allies like South-Korea and Japan surrounding them and those can't be underestimated either from a strategic point of view. I also doubt that India would ever join forces with China and Russia. I don't know how reliable the Global Firepower Index is, but I would still say that even a coalition between Russia and China would run into dramatic deadlocks unless they are willing to extinguish planet Earth from the universe. The speed at which China builds its global economic network is concerning as that might be an indicator of China preparing for some form of confrontation, but I doubt it will risk a military confrontation anytime soon due to an attack against Taiwan. Hopefully I am not wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "February 14, 2023, 07:21:52 AM",
      "body": "This is what scares me the most because we live in the most strategic country in the world, and we will almost certainly be at war with them, even if they are only at war because we are part of the US alliance. If this happens, then we can't really feel the economic impact as we are in the middle of the war unless we flee to another country. For sure, prices will be more than doubled, and people who are in third-world countries will have more difficulty buying their basic necessities. I am hoping that this is just speculation and far from the truth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}