{
  "id": "topic_5459733",
  "title": "HoferBit",
  "author": "HoferBit",
  "created_time": "July 14, 2023, 01:55:01 AM",
  "content": "文/胡翌霖 2017年9月14日原文链接 https://yilinhut.net/2017/09/14/7040.html今年ICO大爆发，许多比特币圈的大佬和前辈逐渐都不甘寂寞，玩起了ICO，圈钱无数，终于把自己作死，先是ICO被定性为非法集资，现在整个国内比特币交易平台都正在面临取缔，大佬们究竟如何收场，我们拭目以待。关于ICO，我向来保持敬而远之的态度，虽然这很可能让我错失了几十倍的暴富机会，但我向来奉行安全第一的投资理念，因而也丝毫不觉得遗憾。当然现在ICO被查禁了，我也不会幸灾乐祸，国内取缔ICO当然是一件非常遗憾的事情。冷静下来，我来聊聊对ICO的理解和展望吧。首先简单说一下ICO是什么意思：ICO这个词是仿造IPO（initial public offerings，首次公开募股）造出来的，全称是initial coin offerings，首次公开售币。但在这里，其实中译不太精确，事实上ICO三个词中没了“公开”（public）。当然，根据实际用法，ICO确实是“首次公开售币”的意思。“公开”一词其实非常关键。事实上非公开的募股，历史非常古老，古代很早就有合伙经营，合伙人之间约定好分红比例，各占股份。股份本身也可以交易，但这都是合伙人之间的私下交易，而不是在公共平台上进行的。股份交易的“公开”是现代资本主义市场的新事物，前提是数学化和符号抽象。股份原本是某种“比例”，但未必是一个中性的数字。而转变为“证券”之后，它们完全与持股人的身份、地位、入股方式等等都剥离了关系，变成了一个“客观”的凭证，因而可以脱离经营者，直接在投资人之间互相交易。古代社会的股权凭证可能是一份契约书，写明张三和李四的合伙关系和所享权益。现代的股票也是一份契约书，但却是向不特定的对象授权，无论王五也好马六也罢，只要持有股票就自动享有相应权益。因此这种不记名的股票才可以向不特定的公众发行。公众持有股票之后，也可以随时卖给其他公众，而无需经过创始人授权，因为领取权益的时候只需要凭借股票，而不需要凭借个人的身份。不记名的股票最初就和纸币差不多，当然，股票比纸币更早被全面数字化了然而证券与现代的纸币面临同样的问题，那就是如何进行发行和验伪。由于股票证券本身的形式可能只是一张纸片，乃至只是电脑中的一组数据记录，那么如何保证股票不被滥发，以及不被仿冒呢？其实纸币最初也是某种类似于股票的凭证，每一张纸币都对应于一定份额的黄金。但最后人们发现美国发行的纸币数量远远超出他们掌握的黄金，因而金本位制度从此崩溃。所谓金本位制度崩溃，其实就是美国人欺骗和耍赖的结果罢了。那么一家公司如果想要欺骗和耍赖，也可能发行超过100%的股票，也可能单方面不承认某些股票的真实性，当然伪造者也确实可能仿冒股票，这时候谁来验证呢？美国权倾天下，没人管制，他耍赖之后全世界也都没办法，只能继续乐呵呵地继续使用美元。但好在没有一家公司可以如此肆无忌惮，所以自然可以找到能管制公司的机构，来监管股票的发行。比如证券交易所，比如证监会，等等。他们可以监督公司不滥发股票，不随意赖账，不捏造信息……于是ICO的基本意义也就很清楚了，ICO所发行的数字货币，其实与比特币类似，而ICO之于股票所做的，也正是比特币之于货币所做的。无非“去中心化”四字罢了。当然，ICO并不是把作为募股中心的创业者给去中心化了，而是把证券的“发行”和“验证”的机构去中心化了。ICO发行的代币，无非也是一种凭证，每一枚代币都相当于总数的某个比例，这和一手股票相当于公司总股份的某个比例是类似的。ICO的好处在哪呢？无非是利用了区块链技术，解决了在证券的发行和验证环节的信任问题。也就是说，不需要证监会的监管，依靠区块链技术，我们就可以确信每一份代币在总数中所占的比例，公司不可能任性发行出200%的股票来。另一方面，投资者在私下交割股份时，可以依靠区块链技术，直接判断出所获得的代币的真伪，而不需要向证券交易所寻求确认。除了去中心化，比特币附带的一个次要特点是匿名性，这一点在ICO代币中也同样具有。虽然传统的不记名股票也是认股不认人，但是由于验证要求，通常依赖于在证券交易所等权威平台买卖交割，领取分红时也需要通过特定的渠道，所以投资者通常也要实名注册。而使用代币进行交易，则可以自始自终保持匿名，甚至在领取分红时，也可以通过在区块链上签名绑定，领取数字货币作为分红（比如比特币）。另外在行使投票权时，也可以通过数字签名完成，而不需要亲自出面。这样一来，传统股票投资者在买入、卖出、投票与分红等所有环节，都可以保持匿名。创业者与投资者也可以绕开第三方监管，直接建立关系。另外，也是比特币的一个特性，就是交易记录的公开化。虽然每一个地址对应的持币人是交易的，但任何比特币地址之间的交易都是公开透明的，所有人都可以查看到世界上每一笔正在发生的比特币交易。这一特点同样也适用于ICO，也就是说，所有股权转让都是公开透明的。比如公司老板拍胸脯宣称增持，但其实偷偷减持，这种事情不需要依赖证监会爆出消息才能让普通投资者知晓，任何人随时都可以盯着老板的股票账户。简而言之，ICO的特长，与比特币一样，无非是去中心化、匿名性、透明性等等。并没有什么新的革命，无非是把比特币在货币领域中所做的革命，延伸到金融证券的领域罢了。当然这一延伸革命本身也意义重大，因为比特币启动的是货币革命，但货币革命的意义远不止是替换货币而已，就好比天文学革命的意义不只是换了一个天文历算体系罢了。法币纸钞显然不只是一个印刷技术的产物，它涉及到政治、经济、金融、法律等各种体系的支持。比特币的革命从货币发起，但最终也会触动各个领域的行规定式。改变创业者的融资方式和公司的股份体制，也是其中的一小步罢了。当然，我们不能高估这一革命的意义。比特币的“去中心化”可以让它几乎完全摆脱监管，货币可以跨国匿名流动。但ICO的去中心化，只是免除了某几个具体环节中监管的作用——比如不需监管就可以确保发行的可信性，不需监管就可以确保股权及其行使的真实性——但很难在所有方面免除监管。这是因为，在货币体系中，事实上货币的价值并不需要监管者来支持，而且货币的使用过程中，除了发行与验真，并不需要哪些额外的信任。而融资募股就不一样了，股票的发行和验真只是整个金融活动中很小的两个环节，而在其它环节中，监管有时是可能起效的，有时更是被市场需要的。比特币不需要一个特定的发行者或发行机构，中本聪只是初始规则的制定者。但ICO当然还是有一个特定的发行者的，他需要创业，或开设公司，或启动项目，总之因为各种原因，需要募集资金，ICO归根结底是募集资金的一种新方式，投资者可以匿名，但筹资者通常不能。当然，理论上说，筹资者也可以匿名，比如完全有可能一个在暗网知名的黑客说他要搞一个黑市，那他当然不可能通过传统IPO募资，但可以通过ICO募资。但这是比较极端的情况，而且即便如此，募资者仍然是在网络世界上有一个明确身份才行。一般来说，募资者往往更倾向于实名站台，因为投资者毕竟是冲着募资者投钱的，投资进入了募资者的钱包，但对于募资者究竟是谁毫无了解，这种事情也只有最盲目的投资者才干得出来。事实上，在这一波火爆的ICO中，“名人站台”成为时尚，募资者或其合伙人越是有名，就越容易吸引到投资。所以在募资者这个环节，监管就是可能的，也是被需求的。首先因为募资者往往实名站台，所以监管者当然有迹可循，可以直接请这些币圈大佬喝茶；其次因为投资者总是希望更多地了解和确认募资者的身份信息，而这些信息当然不是募资者说什么就信什么，那么他们也会欢迎第三方的监督，这个第三方当然越权威越好。在募资成功之后，这些钱怎么使用呢？募资者宣称他要创业搞项目，但实际是去美国买了豪宅，回头告诉投资者创业失败，投资打了水漂，让投资者乖乖承担风险，那么投资者要找谁说理去呢？或者说，投资者如何才能区分失败的投资究竟是因为募资者创业失败还是因为挪用挥霍呢？所以在这个环节，虽然理论上不必然需要监管，但投资者往往愿意欢迎乃至要求监管者的介入。最后还有投资者之间的交易环节，当然，ICO的代币可以像比特币一样跨国匿名传递，但也和比特币一样，投资者如果需要频繁买卖，高抛低吸，肯定还有要求有相应的交易所。而不同的交易所可以各自决定上架哪些股票（代币），也可以设定不同的投资者准入门槛，这和现今的股票交易所也是一样的。是不是很令人失望了？ICO这种募股方式，最终仍然要求监管，仍然需要证券交易所，那么它究竟能提供什么新东西呢？当然还是有的，粗略来看，至少有以下几点：1、降低公募的门槛，模糊公募与私募的界限。在中国一个企业要发行股票且公开上市，需要经过严苛的审核，而这审核制中蕴含的寻租空间不必多言。中国要向注册制改革，但美国股市的注册制其实也有颇高的门槛，至少不是一个初创企业能够企及的。创业者寻求的第一笔投资往往叫“种子投资”、“天使投资”，然后经历A轮、B轮、C轮等一轮一轮的募资，最后历经坎坷终于上市IPO的时候，基本上可以说这家公司已经创业成功了。而现在这些ICO的公开募资，基本上都是初创项目，和传统的种子轮或天使轮类似，创业者往往只有一块虚无缥缈的“大饼”，一个创意，一篇论文（白皮书），就开始ICO了。而这些ICO，往往还能够募集到远远比一般天使投资更多的启动资金。当然这是由于巨大的泡沫所致，但也可以想象，在长期稳定的状态下，只要监管放行，ICO募资至少不会比寻求天使投资更难。现在已经流行的“众筹”网站就证明向大众筹资的模式是可行的。当然，让ICO取代天使投资还是太着急了一些，但关键在于，ICO可以取代任何一轮投资，无论种子轮、天使轮还是A轮、B轮，随时都可以切入ICO，而不是把公开募股视作创业者的终极目标。2、股票容易在交易所之外自由流动，不受制于交易所。由于不同交易所门槛不一，所以传统的IPO往往只在某一国家的某一交易所发行。但一家公司的股票当然可能在多家交易所发行，比如很多中国公司同时在A股和港股都有股票。现在的情况是，这些在不同交易所发行的股票，理论上同股同权，享受的权益是一样的，但实际上往往差别很大，乃至悬殊。为何如此呢？当然是因为两地之间流动不通畅所致。所谓沪港通之类的渠道，额度也非常有限。ICO轻而易举地解决了股票在不同交易所之间的流动问题，ICO代币可以随时从一家中国的交易平台中提取出来，转移到美国的交易平台。又或者我不想玩高抛低吸，只想持有股票领分红的话，完全不需要把代币托管给交易所，而是可以自己保存，丝毫不影响行权与分红。这样一来，“同股同权不同价”的情况基本上就被消解掉了。投资者仍然需要交易所，但交易所只是平台和工具，而不再具有生杀大权。3.大大增强股票的流动性股票本身能够脱离交易所自由流动，也将倒逼交易所本身尽可能提供更宽裕的流动性。比特币交易所从一开始就是T+0、24小时交易、无涨跌停板的设计。而现在的股票交易所几乎都做不到24小时全天候交易。为什么？因为数字货币的全球自由流动让交易所不得不屈从全球的时间，没有上午与下午，没有开市与闭市。另外，数字资产的无线切割的特性也使得交易更加灵活。股票交易往往有最低额度（比如一手），据说一半以上的中国股民买不起一手贵州茅台的股票。许多中国股票都喜欢玩“送股”的花样，以便拆分股票。但ICO代币随时都可以拆碎了买卖，买0.001个也可以，永远没有拆分股票的必要。4.账目透明，便于审计和监管。ICO通常不能逃脱监管，但反过来说，在愿意接纳监管的前提下，区块链技术的公开账本事实上更方便进行监管。每一笔开销、套现、回购和分红都有据可查且无法篡改。如果发放工资和购买资源等都可以通过数字货币直接进行，而不再需要兑换为法币之后再使用，那么这些全部的开销环节都是透明的。如果项目成功之后，获取的收入也是通过数字货币的话，那么未来的所有收入也都是透明的。比如我们可以从区块链的公共账本中清楚地看到：今年公司收入为A个币，支出为B个币，盈余中的C个币用于投资再生产，D个币用于分红……那么如果观众发现A远大于B+C+D，那么就马上会发现问题。现在上市公司往往都被要求账目公开，但这些公开的账目是否真实，公众需要首先信任相应的审计机构和监管机构。而借助区块链技术，公众将有可能直面账本本身。这样一来，虽然ICO仍然需要监管，但这种监管未必总是自上而下的了。5.代币的额外功能之前一直是把ICO代币与股票相比，但代币当然不止是股票，它本身也是新的数字货币。事实上，到现在为止的大部分ICO，似乎都没有把代币定位于一种股票，而大多是当作一种新的数字货币来鼓吹的，因此他们会渲染这些代币相对于比特币具有哪些新功能。这种意义上的代币发行，其实就是当年的山寨币发行但加上了大量“预挖”。几年前比特币社区的环境与现在完全不同，那时候还是理想主义的天下，新发行的山寨币往往被社区要求不能有一丝预挖。但现在的ICO代币发行，许多情况下基本相当于开发者100%预挖。当然这种以ICO形式开发新币种的模式，有一个最大的成功者，那就是以太坊（ETH），而它也成为了新一轮各种ICO的基础，新的ICO可以募集ETH而发放EOS，然后更新的ICO可以募集EOS而发放更新的币。虽然ICO打破了货币与股票的界限，但是我个人认为，如果仅仅是定位于新数字货币的开发，那么也没有超出之前的各种山寨币的意义。新的数字货币当然可能层出不穷，但我们究竟需要多少新货币呢？我们又需要有多少新公司、新创业者呢？显然，哪怕未来世界需要一万种数字货币，也远远比不上创业项目的数目。所以ICO最主要的意义，一定不在于作为一种新货币的开发模式，而是在于作为公开募股的融资手段。所以ICO代币完全可以只是一种毫无新意的山寨币，例如POS币，或者未来某种依附于比特币的侧链资产。不需要对标比特币或以太坊，而只需要对标传统的股票，足矣。",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459733",
  "comments": []
}