{
  "id": "topic_5475930",
  "title": "Lida93",
  "author": "Lida93",
  "created_time": "November 29, 2023, 01:16:23 PM",
  "content": "Have seen many posts in the forum posters sharing their excitement about how they sold their property's to buy bitcoin and that's what called for this thread. Some claim to have sold land/landed properties, cars and other equipments. Yeah' no body has a right to dictate for you on how or what to do with your property , it is yours anyways. However, you need to apply wisdom when taking such steps of selling a property to invest in bitcoin, make sure the property you are selling off you don't need it (a property you can afford to lose) because there is a risk in bitcoin investment the embedded risk of volatility shouldn't be neglected.Lastly, whatever property you have decided you must sell off,  you could always sell divide the money, use part of the money realized to invest in bitcoin stead of using all of it, and then using the other amount remaining to buy another of that property elsewhere for a lower rate.Now this is what I mean: assuming you sold your piece of landform $20k, you use $10-13k to invest in bitcoin and the remaining $7k to buy another land somewhere at a cheap rate. Surely, with years the value of that land will always appreciate so you still have a land (only that it's at a different location) while you invest in bitcoin stead of using (risking) all the money at ones.Just my two cents.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475930",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "November 29, 2023, 01:23:39 PM",
      "body": "There so many complexities when it comes to investments that one should avoid making general statements on it. Financial situations are different, properties are also held and valued differently depending on what part of the world you live in.The general advice is to only invest what you can afford to lose, it's up to the person to decide what they can afford to lose based on their current financial situation and act accordingly.Quote from: Lida93 on November 29, 2023, 01:16:23 PMLastly, whatever property you have decided you must sell off,  you could always sell divide the money, use part of the money realized to invest in bitcoin stead of using all of it, and then using the other amount remaining to buy another of that property elsewhere for a lower rate.Again, there is no straightforward solution so this may not be necessary depending on the circumstance around the sale of the property.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rockstarguy",
      "created_time": "November 29, 2023, 01:45:46 PM",
      "body": "Thanks op for this thread,  I have also read about stories people claimed to have sold their properties to invest in bitcoin. What I have to say is that instead of selling every asset to invest in bitcoin it is better to still have these asset and also try to make bitcoin another asset add to the existing ones. Investing in Bitcoin is good thing, but when planning to sell other properties to invest in bitcoin one really needs to think to be sure if the property really needs to be sold out not just because of they feel to invest in bitcoin. When it comes to investment people needs to apply wisdom to think thoroughly not to make mistakes that will lead to regrets in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "traderethereum",
      "created_time": "November 29, 2023, 01:52:29 PM",
      "body": "They may have other considerations about selling their assets, such as land.But it's best not to sell assets in the form of land to invest in bitcoin.They should invest using the money they can afford and keep their assets. It will increase the number of its assets with bitcoin in its asset list.But if they are confident in their decision to sell the land and use all or half of the money to invest in bitcoin, they can do it. But they should consider it first so that there are no regrets in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "November 29, 2023, 01:58:22 PM",
      "body": "Quote from: Upgrade00 on November 29, 2023, 01:23:39 PMQuote from: Lida93 on November 29, 2023, 01:16:23 PMLastly, whatever property you have decided you must sell off,  you could always sell divide the money, use part of the money realized to invest in bitcoin stead of using all of it, and then using the other amount remaining to buy another of that property elsewhere for a lower rate.Again, there is no straightforward solution so this may not be necessary depending on the circumstance around the sale of the property. Yeah I agree the circumstances surrounding the sale of the land might differ promoting a different risk approach by the owner but as a new investor with that money from the sales of the land as the only capital in hand IMO it's irrational to nosedive with all the money at ones in bitcoin Investment  or any other sort of Investment no matter what the circumstances could be looking like. There should always be a step by step Investment approach for a capital that is the only money at hand, with the result of every step made  you're clear and confident on what step to take next. In business the response we give to any circumstance is what matters most and not the circumstance itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Awaklara",
      "created_time": "November 29, 2023, 02:01:47 PM",
      "body": "Quote from: Lida93 on November 29, 2023, 01:16:23 PMHowever, you need to apply wisdom when taking such steps of selling a property to invest in bitcoin, make sure the property you are selling off you don't need it (a property you can afford to lose) because there is a risk in bitcoin investment the embedded risk of volatility shouldn't be neglected.This is a reason that should be held close to anyone seeking to sell their assets to invest in Bitcoin. If I'm not mistaken, someone previously shared their story regarding selling a car to buy Bitcoin here, but I forgot a bit.maybe it will be inspiring for other investors, or even new investors who are very interested in stories like that. What is certain is that in essence what is being done is investment. whether it's real assets or Bitcoin. Still, don't sell the assets we use, use assets that may not be very productive or that we don't really use.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Richbased",
      "created_time": "November 29, 2023, 02:04:54 PM",
      "body": "Overtime a tell people not to only be too attached to one investment and at a time one starts making good profits from his investments, the goal should be to invest in other asset that will still be sustainable should Incase the one you give all your trust doesn't turn out well in the future so that you can be able to have an alternative investment to fall unto though selling some of your asset to invest on the one you give more priority isn't bad but let it be that you've also got some other asset left. In life we take risk all the time so to me I don't really see it as a bad idea if one decides to sell off an asset to invest on bitcoin though it's future isn't certain but a volatile asset like Bitcoin is worth selling other asset for and buy bitcoins, investment shouldn't be done with emotions as if one invest with emotions then some certain investment goals may not be achieved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "November 29, 2023, 02:11:24 PM",
      "body": "Using money from selling a property to buy Bitcoin and more land makes a lot of sense. You can spread around the risk but still leave open the chance to make good money if Bitcoin or the land goes up in value. It's smart thinking.Personally, I do not own any property that I could sell to invest in bitcoin. But if I had to make such a decision, I would probably think along similar lines. At the end of the day, you gotta decide for yourself what to do with your money. But if you know the risks and diversify so you got some eggs in different baskets, you put yourself in a better spot to earn well and keep steady and more ways to win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "November 29, 2023, 02:19:16 PM",
      "body": "Quote from: Lida93 on November 29, 2023, 01:16:23 PMHave seen many posts in the forum posters sharing their excitement about how they sold their property's to buy bitcoin and that's what called for this thread. Some claim to have sold land/landed properties, cars and other equipments. Yeah' no body has a right to dictate for you on how or what to do with your property , it is yours anyways. In every steps or decision we are taking, we must always apply wisdom, it's not about Investing in bitcoin that marks the end of poverty but what we understand by any of our decision to make an investment in it, making an investment is by choice and chance, we can't afford to sell what is giving us profit to invest on bitcoin when we don't have any backup for sustainability as our source of income, this kind of a decision is what makes some people to sell when they can't bear to hold any longer, we can learn to earn instead of selling properties to invest in bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "November 29, 2023, 02:34:20 PM",
      "body": "Invest what you can afford to lose. If you are ready to lose money that you get from selling your property like land, you are free to do it. You are ready to take risk but taking risk does not always bring profit. You have to think of what you will have left if all the money lost in that investment. Have part of your money to use in that case must be one of conditions before taking such risk.Someone can go hardcore like this family but I don't recommend it, it is too risky.How this family survived 40 countries living solely off bitcoin for four years",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelward",
      "created_time": "November 29, 2023, 02:38:04 PM",
      "body": "First I'll like to differ on the popular saying on this forum that we should only invest what we can afford to loose in bitcoin. I think that we should change that mindset, because it degrades bitcoin, like it's something that is not worth investing a substantial amount on. Among cryptocurrencies, bitcoin, stands out as a top valued asset that guarantees ROI for investors. So don't use the amount that you can afford to loose to invest in bitcoin, use a substantial amount from the capital that you have mapped out profitable long term investments. It's true that bitcoin is volatile, but if you invest on a long term, you'll meet ATH and bull runs, to multiply your capital and you can cash in at anytime, no restrictions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zanab247",
      "created_time": "November 29, 2023, 02:54:20 PM",
      "body": "I have some thing like this in mind to sell my land and invest the money on BTC and hodl for the price to increase higher before I can sell to make a good profits, but with this your orientation, I don't think I will invest all the money on BTC if I sell the land because, some thing can happen to my BTC wallet that will make my efforts to be in Vail. Many people are rushing me with huge amount of money about the land base on the land is an open place, and they are ready to buy it with any amount of money I want to sell the land but I want to get another place where I can use small amount of money to buy another land and invest the remaining money on BTC and, this your trend resent my mind now.I believe the two investments will surely bring me a good profits in the future because, the land will appreciate in 10 years to come and, the BTC price will rise higher in 5 years to come to allow me to achieve a good profits that will give me more confident to increase my capital.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "November 29, 2023, 03:36:10 PM",
      "body": "I think that selling something from home is already a bad trait. If you do not have additional income that can be invested and you are not afraid that at some point it may be lost, then it is better not to rush into investments. Selling real estate, I would say, is a mistake to make, as real estate is already considered an investment that has grown over time. Selling little things makes you smile. If you don’t have extra money, you shouldn’t take off your last clothes; investing pennies will still not make you richer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kentrolla",
      "created_time": "November 29, 2023, 03:48:23 PM",
      "body": "Those are extremely decisions but unfortunately some people who have sold their properties or land to invest into Bitcoin in the past were the ones without any alternative as they just put their last dime on into it. Not only specific to crypto but it's a common sense that one shouldn't bet their basic necessities for anything and it has to be a calculated risk every rather blunders like investing everything and getting into debt. I have know some fools taking bank loans and investing into Bitcoin assuming they would get the capital back before they pay their first EMI but things turned ugly. FOMO is the reason why people end up being vulnerable like this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "November 29, 2023, 03:57:38 PM",
      "body": "Quote from: lovesmayfamilis on November 29, 2023, 03:36:10 PMI think that selling something from home is already a bad trait. If you do not have additional income that can be invested and you are not afraid that at some point it may be lost, then it is better not to rush into investments. Selling real estate, I would say, is a mistake to make, as real estate is already considered an investment that has grown over time. Selling little things makes you smile. If you don’t have extra money, you shouldn’t take off your last clothes; investing pennies will still not make you richer. I quite agree with your viewpoint because if you actually look at it, selling off your land to buy Bitcoin is like selling off one promising investment to engage in another profitable but highly risky one. Land appreciates over the years and if you are impatient to sell just because you may have heard the profits attached to Bitcoin investment, if cares not taken you can sell off your Bitcoin when price doesn't appreciate and as it is a very volatile coin, there's the possibility of it experiencing lows which can discourage who doesn't have the courage to hold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "November 29, 2023, 03:59:20 PM",
      "body": "This is mainly applicable to extra property or let say funds. Since the value of land also increases in due time as its belong to real state investment. Its quite risky to put that into speculative coin like bitcoin and ending up being sold fully and lost that property. Might as well gamble your extra fund than your property for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "November 29, 2023, 04:02:09 PM",
      "body": "We all have our different opinions about etwas. I have always been of the opinion of not selling anything at all in regard of wanting to acquire Bitcoin, that's a wrong decision to take, too much of everything is bad and that's where addiction comes in. There are people who are also investmentaddicts. They are so obsessed with bitcoin, up to the extent of not even caring about their health.  If you are in real estate or you have some sort of business that you do to earn more, when you invest in landed property or in whatever the case maybe, the capital is not what we should joke with, and the investment turns out to give you a return, which is good. Selling such is not a bad idea, after all, that was the purpose for the property: You invest in it to make profit, and you can also decide to change your investment decision, which is totally fine.  But in regard to those who sell off their cars when they have only one and the need for the car is very essential to the family, they sell off their family house and invest the money in bitcoin with the hope to get a higher return back. Those set lack good financial management, the risk they are taking is higher than the return they might get, their are some kind of risks we take and the properties we lose as a result of that becomes hard to reclaim in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nheer",
      "created_time": "November 29, 2023, 04:27:36 PM",
      "body": "Quote from: Lida93 on November 29, 2023, 01:16:23 PMHowever, you need to apply wisdom when taking such steps of selling a property to invest in bitcoin, make sure the property you are selling off you don't need it (a property you can afford to lose) because there is a risk in bitcoin investment the embedded risk of volatility shouldn't be neglected.Some people don't realise that every asset they own, whether current or future, has a purpose, and that every investment has benefits of its own. As a result, selling one asset to buy another doesn't always make sense, nor does it make sense to leave a particular investment to participate in a different one. In my view, it is not ideal to sell off a land to invest in bitcoin because the two are distinct entities with various values that are each advantageous in their own unique ways. Applying caution while selling a property to invest in bitcoin is essential because it is a risky investment because of it's volatility. Make sure you have enough of this type of property so that when you sell one, you still have some left and you aren't fully withdrawing from one investment to join another. If one does not exercise caution, they may have regrets in the future, especially since bitcoin price movements can be in any direction. Furthermore, people must understand that bitcoin investing does not require a large capital investment, therefore there is no need to sell any property to invest in bitcoin. You can always start with a small quantity of money and gradually accumulate enough bitcoin known as the DCA strategy. Quote from: Lida93 on November 29, 2023, 01:16:23 PMLastly, whatever property you have decided you must sell off,  you could always sell divide the money, use part of the money realized to invest in bitcoin stead of using all of it, and then using the other amount remaining to buy another of that property elsewhere for a lower rate.No one can decide what to do with your property for you, but whatever you do, make sure you think about it thoroughly before making a decision since if something goes wrong, only they will bear the repercussions. All we can do is advise them on the best course of action to take. You make an excellent point that if they chose to sell any property, they should not spend all of the money on bitcoin so that they have a backup in case things go wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "November 29, 2023, 04:31:37 PM",
      "body": "Quote from: Lida93 on November 29, 2023, 01:16:23 PMHave seen many posts in the forum posters sharing their excitement about how they sold their property's to buy bitcoin and that's what called for this thread. Some claim to have sold land/landed properties, cars and other equipments. Yeah' no body has a right to dictate for you on how or what to do with your property , it is yours anyways. Your life property are your rules.Quote from: Lida93 on November 29, 2023, 01:16:23 PMHowever, you need to apply wisdom when taking such steps of selling a property to invest in bitcoin, make sure the property you are selling off you don't need it (a property you can afford to lose) because there is a risk in bitcoin investment the embedded risk of volatility shouldn't be neglected.Most often, greed overshadows any wisdom, which leads to spontaneous actions.Quote from: Lida93 on November 29, 2023, 01:16:23 PMLastly, whatever property you have decided you must sell off,  you could always sell divide the money, use part of the money realized to invest in bitcoin stead of using all of it, and then using the other amount remaining to buy another of that property elsewhere for a lower rate.Well, why do this? Bitcoiners prefer to sell everything they have for zero, and invest all the proceeds in crypto, waiting for the approach of wealth. Quote from: Lida93 on November 29, 2023, 01:16:23 PMNow this is what I mean: assuming you sold your piece of landform $20k, you use $10-13k to invest in bitcoin and the remaining $7k to buy another land somewhere at a cheap rate. Surely, with years the value of that land will always appreciate so you still have a land (only that it's at a different location) while you invest in bitcoin stead of using (risking) all the money at ones.With part of the money you can buy anything that brings profit or reduces the impact of inflation: be it a share in a business, gold or real estate (anything). In principle, you can just keep the cash so that if a bitcoin exchange rate drops you don’t have to beg and become homeless (because what kind of investment would it be if you sell at a loss).Quote from: Lida93 on November 29, 2023, 01:16:23 PMJust my two cents.These two cents are very valuable and are something akin to risk diversification when betting on more than just one horse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "November 29, 2023, 04:58:49 PM",
      "body": "So, after scanning and reading the title carefully I've realized the moral of the story in the OP is just portfolio diversification or you can say efficient assets management/diversification. I've got it OP whatever you wanted to convey and summarized in the term relevant trading term.TBH, it user funds/assets, so better for him to own his decisions rather than asking others or seeking guidance from others, take some independent steps it will make you able to service the hard times, what are our teachers' and society's teachings are in hard times no ones hold your experience except our experience and your courage of being bold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}