{
  "id": "topic_5399787",
  "title": "Oshosondy",
  "author": "Oshosondy",
  "created_time": "May 23, 2022, 08:11:14 AMLast edit: May 23, 2022, 09:34:49 AM by Oshosondy",
  "content": "People should now be very careful of the scam that are happening in our world, scammers are finding new ways to scam. The ones that are common now are scams through discord and other social media. But the one I saw again today has been an old type of scam which is through a social media account that was compromised by the scammers.Quote from: https://cointelegraph.com/news/targeted-phishing-scam-nets-428k-in-crypto-and-nfts-from-hacked-beeple-accountThe scammers were likely looking to capitalize on a real recent collaboration between Beeple and Louis Vuitton. Earlier in May, Beeple designed 30 NFTs for the luxury fashion brand’s Louis The Game mobile game, which were embedded as rewards to players.The scammer continued to post phishing links from Beeple’s Twitter account, leading to fake Beeple collections that lured in unsuspecting users with the promise of a free mint for unique NFTs.The scammers compromised the Twitter account of Mike Winkelmann which is a digital artist and popular nonfungible token (NFT) creator, the scammer continue to post phishing link from the Twitter accountnajdnsome people were scammed.Quote from: https://cointelegraph.com/news/targeted-phishing-scam-nets-428k-in-crypto-and-nfts-from-hacked-beeple-accountThe phishing links were up on Beeple’s Twitter for around five hours, and an on-chain analysis of one of the scammers’ wallets shows the first phishing link scored them 36 Ether (ETH), worth roughly $73,000 at the time.The second link netted the scammers around $365,000 worth of ETH and many NFTs from high-value collections such as the Mutant Ape Yacht Club, VeeFriends and Otherdeeds, among others, bringing the grand total value stolen from the scam to around $438,000.On-chain data shows the scammer selling the NFTs on OpenSea and putting their stolen ETH into a crypto mixer in an attempt to launder the gains.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5399787",
  "comments": [
    {
      "author": "Widdop37",
      "created_time": "May 23, 2022, 08:47:56 AM",
      "body": "This is so bad, it looks very encouraging for bad people out there you know, which is why I think it's even worse to talk about this too, some people who are fining it hard to make it in the crypto space can easily be tempted to learn this trick too, only those with God's fear in mind will not think about this twice, God have mercy on our souls. Thanks for the warning OP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Munir575",
      "created_time": "May 23, 2022, 09:43:11 AM",
      "body": "There are lot of scam format in the world right now and more are still being discovered, we all should be careful and not trust Though it'd be difficult not to fall for this one as popular NFT creator Mike Winkelmann twitter account was tempered with, its so unfortunate this scammer made so much money. Good to know the account has been recovered and thank you for bringing this to our notice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "May 23, 2022, 11:02:00 AM",
      "body": "Fortunately, they have regain their account back:https://twitter.com/beeple/status/1528380635081068544So we need to be very careful, it seems that this scammers are ramping up in this bear market.You can see on the replies, majority have lost their ETH already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "May 25, 2022, 05:54:27 PM",
      "body": "Quote from: btc_angela on May 23, 2022, 11:02:00 AMYou can see on the replies, majority have lost their ETH already.  This is some very sad news, i can imagine that as a result of being victims many may loose interest from crypto and NFT's due to the depression they will face, some may keep going, some will return after a while, others  may never. Scammers are at the top of their game, it's a big surprise seeing how they have coined a strategy of how to swindle money from new projects like NFT, we should really be careful the links you click to follow and always double check to ensure you are in the right place. If these individuals could actually devote time to more positive endeavours like improving the quality of life through more innovations, they can actually create something extraordinary.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}