{
  "id": "topic_5453155",
  "title": "FiveG",
  "author": "FiveG",
  "created_time": "May 18, 2023, 05:20:54 AM",
  "content": "The most favourable investment is bitcoin, and I call it the most favourable is because it gives choice of what you want to invest, time, period, management and operations. I would love to take this opportunity to the next level, I don't investing any cash entering my hand even if bitcoin is going down or up, I still prefer it to others. I have seen a lot of testimonies of bitcoin despite the challenges it has faced but still good to mingle our mind with bitcoin lifestyle and love it, advertise it, campaign hard for it and trade cautiously. Bitcoin have touches lives my won't be exemption, I must learn, grow and earn from it.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453155",
  "comments": [
    {
      "author": "mk4",
      "created_time": "May 18, 2023, 07:16:09 AM",
      "body": "Quote from: FiveG on May 18, 2023, 05:20:54 AMThe most favourable investment is bitcoin, and I call it the most favourable is because it gives choice of what you want to invest, time, period, management and operations.? ? ?It's literally the same with almost any other publicly traded stock. You're (supposedly) free to buy/sell equity at any time inside trading hours.Quote from: FiveG on May 18, 2023, 05:20:54 AMI would love to take this opportunity to the next level, I don't investing any cash entering my hand even if bitcoin is going down or up, I still prefer it to others.?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "May 18, 2023, 07:54:21 AM",
      "body": "What do you mean by \"bitcoin lifestyle\" OP?Bitcoin is not a lifestyle. Bitcoin is only a storage value and a P2P payment method.I agree that it's great, but you should be careful, because if you don't know exactly what you're doing, the risks of investing at a loss are relatively high.Don't be fooled by rhetoric and online feedback only ; if you haven't already done it already, you should educate yourself on the subject as much as you can.For example, I think it's better to read The Bitcoin Standard and Mastering Bitcoin than to look at influencer content and reddit posts, you'll have a better chance of being the real master of your investment and not be disappointed by it. It could be a great starting point.Anyway, I am happy to see that you like BTC, I just hope that you perfectly understand what you are going to do with you hard earned money",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "leonair",
      "created_time": "May 18, 2023, 09:34:51 AM",
      "body": "Quote from: FiveG on May 18, 2023, 05:20:54 AMThe most favourable investment is bitcoin, and I call it the most favourable is because it gives choice of what you want to invest, time, period, management and operations. I would love to take this opportunity to the next level, I don't investing any cash entering my hand even if bitcoin is going down or up, I still prefer it to others. I have seen a lot of testimonies of bitcoin despite the challenges it has faced but still good to mingle our mind with bitcoin lifestyle and love it, advertise it, campaign hard for it and trade cautiously. Bitcoin have touches lives my won't be exemption, I must learn, grow and earn from it. You are investing in Bitcoin.  What is compatible with the bitcoin investment with Bitcoin lifestyle? Investing in bitcoin is a smart idea now because it is gaining popularity in such a way that in future days bitcoin will be used in all international payment systems like paypal /google pay. And then the price of Bitcoin will increase even more.  Since Bitcoin once touched $68k it is expected to cross 100k at the next ATH. All of this is correct but I still don't understand what you really mean by bitcoin lifestyle",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UchihaSarada",
      "created_time": "May 18, 2023, 10:17:20 AM",
      "body": "Quote from: FiveG on May 18, 2023, 05:20:54 AMThe most favourable investment is bitcoin, and I call it the most favourable is because it gives choice of what you want to invest, time, period, management and operations.Did you talk about yourself?It can be true with you but not true with others. Not all people on Earth like Bitcoin and not all of them invest in Bitcoin or consider Bitcoin as their most favorite investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "May 18, 2023, 10:43:03 AM",
      "body": "Quote from: FiveG on May 18, 2023, 05:20:54 AM1 it, campaign hard for it and trade cautiously. Bitcoin have touches lives my won't be an exemption, I must learn, grow and earn from it. Are you being sarcastic right now?Bitcoin doesn't need a public campaign because Bitcoin is not a scheme that needs crowd involvement for it to develop to the next stage, just as the BTC whitepaper stated, it should be allowed to develop and grow organically.And I think you have missed the point and there is a need for you to make further studies so that you could get the best knowledge that will give you a better understanding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FiveG",
      "created_time": "May 18, 2023, 11:47:55 AM",
      "body": "Please what I mean by bitcoin lifestyle is simply making bitcoin investment of a great priority, when you're dedicated in achieving something, you give it all it takes by that you're living the life of investing in bitcoin because it required time and determination.Secondly bitcoin might not need a public campaign but bitcoin still need people to hear it, to sustain it and to invest in it, and that's the only way bitcoin will survive, no business, company, organization and investment survive without people, so even campaigning it by people isn't a bad ideas. Lastly, we don't expect everybody to like bitcoin but the few or much people that believes it, are benefiting from it and that does not makes bitcoin bad because everybody do not likes it. Is all about choice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "May 18, 2023, 02:06:26 PM",
      "body": "Quote from: FiveG on May 18, 2023, 05:20:54 AMThe most favourable investment is bitcoin, and I call it the most favourable is because it gives choice of what you want to invest, time, period, management and operations. Wait, wait, wait. I'm using 1/4 of my brain cells to understand what you are saying, but I don't really understand what you are saying to us OP.Favorable investment? In what way? Give you choice of what you want to invest? Time? Period? Management? Operations? Nahhh, forget about it. I hope that the OP's ok after posting this thread of him.Quote from: FiveG on May 18, 2023, 11:47:55 AMPlease what I mean by bitcoin lifestyle is simply making bitcoin investment of a great priority, when you're dedicated in achieving something, you give it all it takes by that you're living the life of investing in bitcoin because it required time and determination.Ohhh it's good that you clarified it because we here are very confused on what you want to say to us, or it's just only me that's confused. Anyway, if you really want to invest into crypto, make Bitcoin your priority when you are investing. I guess there's no explanation needed for this because many knows the reason why. You used \"Bitcoin Lifestyle\" which is the first time that I've heard that's been used as a phrase. It's good that you make Bitcoin as a priority when you're investing in cryptocurrency because there are some who are prioritizing altcoins or memecoins which is a bad decision.Quote from: FiveG on May 18, 2023, 11:47:55 AMSecondly bitcoin might not need a public campaign but bitcoin still need people to hear it, to sustain it and to invest in it, and that's the only way bitcoin will survive, no business, company, organization and investment survive without people, so even campaigning it by people isn't a bad ideas. Adoption you are saying, eh?With that, I believe that we are slowly progressing into it. Social media is playing a big role to it, and luckily there are some people who knows Bitcoin that are spreading the information towards other people. Public Campaign? Social media platforms are helping us spread the information.Quote from: FiveG on May 18, 2023, 11:47:55 AMLastly, we don't expect everybody to like bitcoin but the few or much people that believes it, are benefiting from it and that does not makes bitcoin bad because everybody do not likes it. Is all about choice.Nobody expects that.Do you think that everybody loves the stock market? Do you think that everybody loves gambling? Do you think that everybody loves something? No because in every concept, there will always be pros and anti's on it. Same goes with Bitcoin. Like you said, it's all about choice, and I agree with that. It's up to the people if they really want to use Bitcoin or not. If they really want to invest into Bitcoin or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "May 18, 2023, 02:22:20 PM",
      "body": "Quote from: FiveG on May 18, 2023, 05:20:54 AMThe most favourable investment is bitcoin, and I call it the most favourable is because it gives choice of what you want to invest, time, period, management and operations. I would love to take this opportunity to the next level, I don't investing any cash entering my hand even if bitcoin is going down or up, I still prefer it to others. I have seen a lot of testimonies of bitcoin despite the challenges it has faced but still good to mingle our mind with bitcoin lifestyle and love it, advertise it, campaign hard for it and trade cautiously. Bitcoin have touches lives my won't be exemption, I must learn, grow and earn from it. Don't be too confident about finding bitcoin as a new investment lifestyle you discover for yourself. Getting yourself into a risky investment like bitcoin shouldn't be taken as a lifestyle to live upon. It can live you heartbroken if you don't tend to curtain your involvement with it. Think and think properly before you dive into it completely by investing with the amount you can't afford to lose all because you want to earn from it. My recommendation to you is to find a different way of life outside from bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "May 18, 2023, 02:36:09 PM",
      "body": "Quote from: FiveG on May 18, 2023, 05:20:54 AMThe most favourable investment is bitcoin, and I call it the most favourable is because it gives choice of what you want to invest, time, period, management and operations. I would love to take this opportunity to the next level, I don't investing any cash entering my hand even if bitcoin is going down or up, I still prefer it to others. I have seen a lot of testimonies of bitcoin despite the challenges it has faced but still good to mingle our mind with bitcoin lifestyle and love it, advertise it, campaign hard for it and trade cautiously. Bitcoin have touches lives my won't be exemption, I must learn, grow and earn from it. There are other investments that are also favourable but the returns of bitcoin is bigger than others but high volatility and yet they are prefered by people who are already there, it doesn't cost you anything when you spare some amounts in bitcoin, there is no minimum amount, you can invest as low as $10 but you should know that such amount wouldn't give much return, it is so small that in every 100%, you will only make $10 and that is a big move that will trend for many days if bitcoin make such kind of move, that is the challenge of investing in bitcoin, your profits depends on what you invest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sexylizzy2813",
      "created_time": "May 18, 2023, 02:38:26 PM",
      "body": "Quote from: FiveG on May 18, 2023, 05:20:54 AMThe most favourable investment is bitcoin, and I call it the most favourable is because it gives choice of what you want to invest, time, period, management and operations. I would love to take this opportunity to the next level, I don't investing any cash entering my hand even if bitcoin is going down or up, I still prefer it to others. I have seen a lot of testimonies of bitcoin despite the challenges it has faced but still good to mingle our mind with bitcoin lifestyle and love it, advertise it, campaign hard for it and trade cautiously. Bitcoin have touches lives my won't be exemption, I must learn, grow and earn from it. OP, why not say investing in Bitcoin is favorable to you. Is just like you made it look as if since investing in Bitcoin favors you that it will do the same to others. Imagine someone who haven't heard or done anything concerning Bitcoin running straight in investing on Bitcoin without any knowledge, something he/she doesn't know  about and let's say it all went bad, are you saying that is favorable to that individual? No.Quite alright that it [Bitcoin] gives options on how much to start with and all that, but I still feel that there are different types of investment that favors investors. I just wish you good luck and always know when to pull off the strings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rozak",
      "created_time": "May 18, 2023, 03:05:05 PM",
      "body": "Quote from: FiveG on May 18, 2023, 05:20:54 AMBitcoin have touches lives my won't be exemption, I must learn, grow and earn from it. so do you invest in Bitcoin, trade Bitcoin, or do you use Bitcoin as a means of payment instead of fiat?many people have earned from investing or trading Bitcoin. it's because they have tremendous confidence in Bitcoin. some beginners come with enthusiasm. but when Bitcoin is in FUD, they run scared with panic.now it's up to you, you can buy Bitcoin and save it. also can trade it. It all depends on your choice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "macson",
      "created_time": "May 18, 2023, 04:50:02 PM",
      "body": "Quote from: FiveG on May 18, 2023, 11:47:55 AMPlease what I mean by bitcoin lifestyle is simply making bitcoin investment of a great priority, when you're dedicated in achieving something, you give it all it takes by that you're living the life of investing in bitcoin because it required time and determination.what have you done with this, have you sold some useless assets to you and then bought bitcoin? or have you started investing in bitcoin?Quote from: FiveG on May 18, 2023, 11:47:55 AMSecondly bitcoin might not need a public campaign but bitcoin still need people to hear it, to sustain it and to invest in it, and that's the only way bitcoin will survive, no business, company, organization and investment survive without people, so even campaigning it by people isn't a bad ideas. since bitcoin first appeared, many people have believed in it, but actually, we don't need big companies to adopt bitcoin because they will only try to manipulate prices and try hard to make a profit.  believe me, without you saying this, millions of people continue to believe in bitcoin.Quote from: FiveG on May 18, 2023, 11:47:55 AMLastly, we don't expect everybody to like bitcoin but the few or much people that believes it, are benefiting from it and that does not makes bitcoin bad because everybody do not likes it. Is all about choice.it doesn't matter if they don't trust bitcoin because no one is in a hurry, i prefer bitcoin to be adopted slowly rather than quickly because it needs infrastructure adjustments and also proper education to the public.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "May 18, 2023, 05:05:53 PM",
      "body": "You should also consider the risk in bitcoin too not only the positive side. Bitcoin is like any other investment that you can think of,but bitcoin with little stress,as long as the know the market analysis and can keep your coins safe,you will make profit. Bitcoin is not a get rich quick investment, you must be patient and strong to hold for long. Long term investment is the best for bitcoin. Quote from: FiveG on May 18, 2023, 05:20:54 AM despite the challenges it has faced but still good to mingle our mind with bitcoin lifestyle and love it, advertise it, campaign hard for it Bitcoin doesn't need any campaign before it can be recognized, it's adoption is a gradual process. A valuable asset speaks for itself due to the potential benefits that it has. For example investors have understand that bitcoin is a store of value and it is inflation resistance. This has made so many people to invest their funds on bitcoin and some government are looking forward to legalize it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "May 18, 2023, 05:53:02 PM",
      "body": "Quote from: FiveG on May 18, 2023, 05:20:54 AMThe most favourable investment is bitcoin, and I call it the most favourable is because it gives choice of what you want to invest, time, period, management and operations. I would love to take this opportunity to the next level, I don't investing any cash entering my hand even if bitcoin is going down or up, I still prefer it to others. I have seen a lot of testimonies of bitcoin despite the challenges it has faced but still good to mingle our mind with bitcoin lifestyle and love it, advertise it, campaign hard for it and trade cautiously. Bitcoin have touches lives my won't be exemption, I must learn, grow and earn from it. This one that you are referring Bitcoin as a lifestyle, I hope you are ready to learn?Despite everything you've heard from so many others, I hope you're not here for quick money, as others used to believe Bitcoin was a get-rich-quick scheme?However, welcome to the world of Bitcoin! I recommend that you begin by studying the fundamentals of Bitcoin, such as wallets, keys, and addresses, as well as how to manage your Bitcoin in your own wallet.Learnmeabitcoin.com can assist you gain some of the fundamental knowledge you'll need to get started.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitDane",
      "created_time": "May 18, 2023, 06:32:17 PM",
      "body": "Quote from: FiveG on May 18, 2023, 05:20:54 AMThe most favourable investment is bitcoin, and I call it the most favourable is because it gives choice of what you want to invest, time, period, management and operations. I would love to take this opportunity to the next level, I don't investing any cash entering my hand even if bitcoin is going down or up, I still prefer it to others.Im just curious, how can you make it to the next level if you don't invest money in Bitcoin?  You stated that you are not financially invested in Bitcoin because you prefer others to do it.  So since you wanting to take the opportunity to the next level, then you should involved your own finances to engage with Bitcoin investing.Quote from: FiveG on May 18, 2023, 05:20:54 AM I have seen a lot of testimonies of bitcoin despite the challenges it has faced but still good to mingle our mind with bitcoin lifestyle and love it, advertise it, campaign hard for it and trade cautiously. Bitcoin have touches lives my won't be exemption, I must learn, grow and earn from it. Why not create a scenario where you yourself can be one of these testimonies.  What keeping you from investing your money to Bitcoin when you already have heard great success of people who are invested to Bitcoin.Quote from: Frankolala on May 18, 2023, 05:05:53 PMYou should also consider the risk in bitcoin too not only the positive side. Bitcoin is like any other investment that you can think of,but bitcoin with little stress,as long as the know the market analysis and can keep your coins safe,you will make profit. Bitcoin is not a get rich quick investment, you must be patient and strong to hold for long. Long term investment is the best for bitcoin. @OP is so hyped that he forget about the cons of bitcoin investment.  Although, I think he will learn it as he engaged with Bitcoin economics, hopefully he would not learn it the hardway.Quote from: Frankolala on May 18, 2023, 05:05:53 PMQuote from: FiveG on May 18, 2023, 05:20:54 AM despite the challenges it has faced but still good to mingle our mind with bitcoin lifestyle and love it, advertise it, campaign hard for it Bitcoin doesn't need any campaign before it can be recognized, it's adoption is a gradual process. A valuable asset speaks for itself due to the potential benefits that it has. For example investors have understand that bitcoin is a store of value and it is inflation resistance. This has made so many people to invest their funds on bitcoin and some government are looking forward to legalize it.Bitcoin had already made lots of campaigns in its early years.  The advertisement and online banners can be considered marketing campaign.  It may not be directly came from the developers themselves and most of them are made by community, supporters and company that is involved in Bitcoin Industry.  Bitcoin needs awareness campaign and marketing and advertisement is the answer to it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "May 18, 2023, 07:31:06 PM",
      "body": "Quote from: FiveG on May 18, 2023, 05:20:54 AMThe most favourable investment is bitcoin, and I call it the most favourable is because it gives choice of what you want to invest, time, period, management and operations. I would love to take this opportunity to the next level, I don't investing any cash entering my hand even if bitcoin is going down or up, I still prefer it to others. I have seen a lot of testimonies of bitcoin despite the challenges it has faced but still good to mingle our mind with bitcoin lifestyle and love it, advertise it, campaign hard for it and trade cautiously. Bitcoin have touches lives my won't be exemption, I must learn, grow and earn from it. I don't know the essence of all this excitement  but I think this post is more of a public show and I want to advise @op that you shouldn't be under any pressure to make any post but since you're here to learn, you should possibly take more of your time to read and follow the educational thread that talking more about bitcoin  rather than wanting to make post. I want to let you know that nothing is actually  certain in the industry and there is no single possibility  that because others are making profits from it l, that you must make profit especially  if you're  not smart enough in the industry.Whatever  you want to do and in all you do,  please try to study more before coming fully into the industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "May 18, 2023, 08:15:53 PM",
      "body": "Quote from: FiveG on May 18, 2023, 05:20:54 AMThe most favourable investment is bitcoin, and I call it the most favourable is because it gives choice of what you want to invest, time, period, management and operations. I would love to take this opportunity to the next level, I don't investing any cash entering my hand even if bitcoin is going down or up, I still prefer it to others. I have seen a lot of testimonies of bitcoin despite the challenges it has faced but still good to mingle our mind with bitcoin lifestyle and love it, advertise it, campaign hard for it and trade cautiously. Bitcoin have touches lives my won't be exemption, I must learn, grow and earn from it. It's even preferable to buy and HODL BTC at when it's going down massively like this....I call it the ESSENTIAL CRASH... alot of profits could be made with just a simple utilization of every CRASH OPPORTUNITY.You shouldn't follow anyone's testimonies - this is only to my own decreetion - you should only follow the ethical confirmations that has affirmed the persistency - that infact will only be made true if you've already learnt alot on your own about the coin you wanna HODL in question.Sandra 🧑‍🦰",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "May 18, 2023, 08:34:43 PM",
      "body": "Quote from: FiveG on May 18, 2023, 05:20:54 AMI don't investing any cash entering my hand even if bitcoin is going down or up, I still prefer it to others.Your telling on your title that you want to start your lifestyle with Bitcoin but then, your statement is contradicting your title. You don't want to invest your cash or whatever is coming in through your hand and you don't want to buy Bitcoin whether it's high or low.What do you mean that your prefer that to the others? You want other people buying it for you and you don't want to do it alone as there will be people that shall do it for you?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DiMarxist",
      "created_time": "May 18, 2023, 10:14:38 PM",
      "body": "Bitcoin is like any other investment that you can think of,but bitcoin with little stress,as long as the know the market analysis and can keep your coins safe,you will make profit. Bitcoin is not a get rich quick investment, you must be patient and strong to hold for long. Long term investment is the best for bitcoin. And so, always match up your experience as a trader with the platform’s perceived complexity. You need to gauge your expertise in using trading tools found on exchanges, and how easy it is to access and employ them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}