{
  "id": "topic_5463409",
  "title": "algoine",
  "author": "algoine",
  "created_time": "August 15, 2023, 08:46:11 PM",
  "content": "Hello everyone,I'm excited to introduce our latest innovation: Trading Operator! We've developed a new application that allows you to trade on the Binance exchange through chat-based interactions, powered by the ChatGPT framework.With Trading Operator, you can seamlessly navigate the Binance markets, execute trades, and manage positions using natural language commands. Imagine asking questions like \"What's the current price of Bitcoin?\" or placing orders by saying \"Buy 10 ETH at $1500\".We're thrilled to present this cutting-edge solution that combines the power of AI with the world of trading. Connect your OpenAI and Binance APIs to Trading Operator, and enjoy the benefits.Experience the convenience of both voice and text communication in your trades. Whether you prefer speaking or typing, Trading Operator offers you a seamless experience.Feel free to ask questions, share your thoughts, and join the conversation about the future of trading with Trading Operator. Let's revolutionize the way we trade together!Visit us at: https://tradingoperator.com",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463409",
  "comments": [
    {
      "author": "joniboini",
      "created_time": "August 16, 2023, 06:12:27 AM",
      "body": "What's the benefit of using your tools compared to other trading bots or trading on Binance directly? What kind of complex features that you have that others don't? Exposing Binance API is prone to hacking/abuse like what happened to 3commas and others, if what I can do is a simple buy and sell order I'd not use your platform for that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "August 16, 2023, 06:37:17 AMLast edit: August 16, 2023, 09:41:54 AM by stompix",
      "body": "Quote from: algoine on August 15, 2023, 08:46:11 PMWith Trading Operator, you can seamlessly navigate the Binance markets, execute trades, and manage positions using natural language commands. Imagine asking questions like \"What's the current price of Bitcoin?\" or placing orders by saying \"Buy 10 ETH at $1500\".Yeah, thrilling, can't wait for it:- Buy 1 mbtc at 29 000!- Buying 29 000 Micro Bitcoin Finance at 1$!- What did you say?- The price of WhatDoYouSee NFT is 0.02 , buy?- Ohhh no!!!!!! Don't buy! - Going long on Don't Buy Inu for all entire balance!That aside, 30 days an old website, supposedly owned by a company registered 3 months ago in Delaware, with no contact, no office, and no information whatsoever, so should I pay 10$ a month a month to give them access to all my funds and trade?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "August 16, 2023, 10:01:16 AM",
      "body": "Put the word ChatGPT in a sentence, and hey you've got a revolutionary project name.What is the need for artificial intelligence, I would understand if you said that you will make a chat or dumping data from this forum or anywhere, and use artificial intelligence to get recommendations such as buy GOGE because musk made a tweet, sell SOL because SOL bridge hacked. Like your service is converting text into commands, something that can be done via script and Binance api keys>",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "algoine",
      "created_time": "August 16, 2023, 10:24:58 AM",
      "body": "Quote from: joniboini on August 16, 2023, 06:12:27 AMWhat's the benefit of using your tools compared to other trading bots or trading on Binance directly? What kind of complex features that you have that others don't? Exposing Binance API is prone to hacking/abuse like what happened to 3commas and others, if what I can do is a simple buy and sell order I'd not use your platform for that. QuoteYeah, thrilling, can't wait for it:- Buy 1 mbtc at 29 000!- Buying 29 000 Micro Bitcoin Finance at 1$!- What did you say?- The price of WhatDoYouSee NFT is 0.02 , buy?- Ohhh no!!!!!! Don't buy!- Going long on Don't Buy Inu for all entire balance!That aside, 30 days an old website, supposedly owned by a company registered 3 months ago in Delaware, with no contact, no office, and no information whatsoever, so should I pay 10$ a month a month to give them access to all my funds and trade?QuoteIt sounds like disaster waiting to happen when you combine third party which have access to our Binance API key and ChatGPT. It's publicly known ChatGPT sometimes give wrong answer and  more frequently to make mistake when it involve number/math[1-2]. I expect people who're aware of ChatGPT limitation would rather keep using Binance app/website rather than risking losing their money.[1] https://community.openai.com/t/chatgpt-simple-math-calculation-mistake/62780 (https://community.openai.com/t/chatgpt-simple-math-calculation-mistake/62780)[2] https://community.openai.com/t/chatgpt-calculations-are-wrong/37343 (https://community.openai.com/t/chatgpt-calculations-are-wrong/37343)QuotePut the word ChatGPT in a sentence, and hey you've got a revolutionary project name.What is the need for artificial intelligence, I would understand if you said that you will make a chat or dumping data from this forum or anywhere, and use artificial intelligence to get recommendations such as buy GOGE because musk made a tweet, sell SOL because SOL bridge hacked. Like your service is converting text into commands, something that can be done via script and Binance api keys>Hello,In this application, we offer an opportunity for those who want to experience trading through written or voice dialogues with artificial intelligence. The main distinction from direct trading on Binance is the ability to trade using natural language or voice commands. Beyond obtaining price, volume, position, and wallet information, the platform also allows for the management of positions and assets. For commands that require action, user confirmation is obtained through a confirmation window. In the near future, when messages and confirmation prompts are equipped with text-to-speech features, this will also cater to visually impaired traders who wish to engage in trading.No one deposits their assets with us; instead, users grant trade authorization via API. We emphasize that all sensitive data is encrypted and stored securely within our platform. The security and well-being of our members are our top priorities, and we have taken all necessary measures in this regard. However, we acknowledge that this may not be readily provable from your perspective, and your skepticism is warranted. This holds true for any platform connected to your API. To enhance your security, you can refrain from granting withdrawal permissions and whitelist the coins you wish to work with. We do not allow API keys with withdrawal permissions to be added to our system. Nevertheless, if you are sharing your API key with an individual or entity, it is advisable to periodically check whether any unauthorized activities have taken place through your API on the exchange. If you notice any suspicious activity, it is recommended to take prompt action and consider removing the API key entirely. Similarly, placing unwavering trust in platforms where you hold your assets and the cryptocurrencies you invest in is not without risks. Conducting your own research and managing your risk are essential. We believe that individuals should refrain from keeping significant amounts they cannot afford to lose with individuals, entities, or platforms beyond their control, particularly when dealing with highly speculative instruments such as crypto assets.If our goal were to obtain API keys, we could have offered this service for free or at least provided a free trial. The choice is yours.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "August 17, 2023, 07:26:34 AM",
      "body": "Quote from: algoine on August 15, 2023, 08:46:11 PMHello everyone,I'm excited to introduce our latest innovation: Trading Operator! We've developed a new application that allows you to trade on the Binance exchange through chat-based interactions, powered by the ChatGPT framework.With Trading Operator, you can seamlessly navigate the Binance markets, execute trades, and manage positions using natural language commands. Imagine asking questions like \"What's the current price of Bitcoin?\" or placing orders by saying \"Buy 10 ETH at $1500\".We're thrilled to present this cutting-edge solution that combines the power of AI with the world of trading. Connect your OpenAI and Binance APIs to Trading Operator, and enjoy the benefits.Experience the convenience of both voice and text communication in your trades. Whether you prefer speaking or typing, Trading Operator offers you a seamless experience.Feel free to ask questions, share your thoughts, and join the conversation about the future of trading with Trading Operator. Let's revolutionize the way we trade together!Visit us at: https://tradingoperator.comNo offense, but that seems a bit pointless to me. What exactly is the advantage of this over trading on Binance directly or over some connected app? Would it even save anyone any amount of time? The cons seems to outweigh any pros since you are now trusting ChatGPT to put in orders correctly. That kind of trust might be misguided. What if ChatGPT glitches out and puts in a wrong order? Seems way too much of a risk to me. Furthermore, as some users here have already mentioned, this leaves you open to hackers. There are simply too many attack vectors.So what exactly are these \"benefits\" that you forgot to mention in your opening post?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "August 17, 2023, 09:19:06 AM",
      "body": "Quote from: algoine on August 16, 2023, 10:24:58 AMFor commands that require action, user confirmation is obtained through a confirmation window. In the near future, when messages and confirmation prompts are equipped with text-to-speech features, this will also cater to visually impaired traders who wish to engage in trading.The visually impaired can use software that provides the ability to convert images into commands, wear medical glasses, and there is a lot of software available for that, but there is no role for artificial intelligence there is no action from AI software or even automated trading.Quote from: algoine on August 16, 2023, 10:24:58 AMFor commands that require action, user This holds true for any platform connected to your API. To enhance your security, you can refrain from granting withdrawal permissions and whitelist the coins you wish to work with. It is true that the user can restrict withdrawal permissions, but you can use these accounts and in cooperation with pump-and-dump groups.What you are trying to offer is a simple text-to-speech service and chat application, right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zoomic",
      "created_time": "August 17, 2023, 10:23:57 AM",
      "body": "Quote from: algoine on August 15, 2023, 08:46:11 PMImagine asking questions like \"What's the current price of Bitcoin?\" or placing orders by saying \"Buy 10 ETH at $1500\".Apart from the above, what other importance of your project? I mean what I am seeing is that your project will help a lazy person who cannot open a tab to check the price of bitcoin. Your project will also help another lazy person who cannot use his mouse and keyboard to buy 10 ETH @1500.It is a nice project, but someone willing to try this out should also know that the bot which has the ability to buy 10 ETH @1500 can also withdraw 5k dollars without your consent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "August 17, 2023, 02:24:45 PM",
      "body": "Quote from: stompix on August 16, 2023, 06:37:17 AM~snip~That aside, 30 days an old website, supposedly owned by a company registered 3 months ago in Delaware, with no contact, no office, and no information whatsoever, so should I pay 10$ a month a month to give them access to all my funds and trade?You see, this service could very easily become part of a package offered by a well-known company that sells hardware wallets - first you pay them $10 a month so that your seed is divided into three parts between three companies, and then another $10 to increase the possibility that someone will hack you while trading on CEX",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasog",
      "created_time": "August 17, 2023, 04:38:42 PM",
      "body": "Quote from: algoine on August 15, 2023, 08:46:11 PMWith Trading Operator, you can seamlessly navigate the Binance markets, execute trades, and manage positions using natural language commands. Imagine asking questions like \"What's the current price of Bitcoin?\" or placing orders by saying \"Buy 10 ETH at $1500\".Are we too lazy to see the price of Bitcoin ourselves or do we really need to ask the OPEN AI to buy us 10 eth and we cannot buy it ourselves by placing the orders? Will it be safe to give access to our Binance account to your open AI through APIs?You and everyone needs to understand that the main purpose of AI is not to make us lazy  I can see the main motive to start this service is to get some money from innocent traders and fool them by using the hype word \"ChatGPT\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "August 18, 2023, 09:45:00 AM",
      "body": "Quote from: algoine on August 16, 2023, 10:24:58 AMTo enhance your security, you can refrain from granting withdrawal permissions and whitelist the coins you wish to work with. We do not allow API keys with withdrawal permissions to be added to our system. Nevertheless, if you are sharing your API key with an individual or entity, it is advisable to periodically check whether any unauthorized activities have taken place through your API on the exchange. Hacks in the past utilize this feature to manipulate the pump and dump/trading activity of its users. Let's say your platform is working as intended but if you expose the users' API key, then it is still problematic for most users. While I do understand that this can happen with any platform, I don't see the benefit of using it here since other competitors tell us how the story goes. Personally, I am a bit biased against trading API platforms since they don't seem to offer good security measures. What kind of protection do you have in mind? Surely it is not so secret that talking about it would lead to data leaks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "algoine",
      "created_time": "August 18, 2023, 11:54:15 AM",
      "body": "Hello everyone,Your constructive feedback prompts us to think deeper and strive to enhance our products. We extend our sincere gratitude for your valuable insights and suggestions.I've noticed that concerns about \"what if ChatGPT misinterprets\" still persist from your messages. Allow me to provide a brief overview of the process to address these worries. Each time a user sends a new message, the bot interprets it into one of three categories:1) Prompt that don't require special functions, using ChatGPT knowledge only. 2) Prompt that require specific functions but no actions within their exchange account (e.g., price and volume inquiries). 3) Prompt that require special functions and actions within their exchange account (e.g., opening positions, canceling orders, etc.). In the case of a user's message falling under the third type, ChatGPT presents its interpretation to the user for confirmation. For instance: \"I understand you want to place a BTCUSDT Long Buy order on Binance USDT-M Futures, in quantity of 0.3, at a price of $25,500. Do you confirm?\" The user can then choose to [Confirm] or [Cancel]. If the user presses [Confirm], these parameters don't go back to ChatGPT; they are sent to Binance as a request.Regarding concerns about unauthorized API usage, by 1) removing withdrawal permissions and 2) using symbol whitelist, you can ensure that transactions are limited to your chosen coins. As for pump-dump activities, it's known that such activities often target low-volume coins. Avoiding these is within your control.We've adapted the exciting AI chatbot technology to the crypto trading realm, a field that many are enthusiastic to explore. If the features I've previously mentioned don't seem beneficial to you, it's possible that the current version of the product might not align with your preferences. However, we're planning to elevate the product with upcoming additions. We didn't develop this product solely as an all-in-one solution for all traders. We're actively working on accessibility options, which alone can provide significant value. When we integrate other exchanges, the potential for \"comparative\" transactions, arbitrage, or executing simultaneous trades across multiple exchanges is also on the horizon.We would like to respectfully express that the notion of \"are we really this lazy\" carries an erroneous perspective from our point of view. We believe that striving for more, for better, for easier, and for uniqueness is more beneficial for the advancement of technology and science.Once again, thank you for your engagement and thoughtful input. We look forward to continuing our journey of improvement in collaboration with valuable users like you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Medusah",
      "created_time": "August 19, 2023, 01:41:45 PM",
      "body": "Quote from: algoine on August 18, 2023, 11:54:15 AM\"I understand you want to place a BTCUSDT Long Buy order on Binance USDT-M Futures, in quantity of 0.3, at a price of $25,500. Do you confirm?\" The user can then choose to [Confirm] or [Cancel]. If the user presses [Confirm], these parameters don't go back to ChatGPT; they are sent to Binance as a request.So why not using the traditional Binance dashboard, if there is confirmation requirement from Binance itself?  Needless to say that sounds the worst privacy-wise, as now OpenAI knows my trades.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "August 19, 2023, 05:36:29 PM",
      "body": "I'm not sure how secure is a service like this because somehow we must connect Binance to ChatGPT and that means giving the API access with our keys to your software, and there is where the real risk comes. You could easily save our keys and use our accounts in the future and that for me looks really risky.It would be nice if you make from this an opensource project, I understand that you want to make a profit from a service like this, but you need to have in mind that we can find a lot of ChatGPT+Binance trading bots in github.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "August 21, 2023, 06:14:34 AM",
      "body": "Trader : Alexa.... Buy 13 bitcoins.Alexa : Ok, buying 30 bitcoins at $30 000 Trader : Nooooo Alexa, I said buy 13 bitcoins!Alexa : Ok, buying 13 bitcoins...Trader : Nooooooo! do not buy another 13 bitcoins .... I just told you what I said. Alexa : Ok, buying another 13 bitcoins ...... beep beep beep.... Unfortunately you ran out of funds, should I transfer more money from your Bank? This is the kind of scenario that I see playing out with AI on these trading platforms, because technology can be flawed and it is \"Garbage in, garbage out\" with computers these days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "August 21, 2023, 10:34:48 AM",
      "body": "Quote from: Kakmakr on August 21, 2023, 06:14:34 AM~snip~This whole confusion with AI clearly shows that something is definitely wrong with people, because how else to explain the fact that more and more people think that AI should be involved in practically every part of society. I recently watched a documentary on this topic, and it was about the fact that some companies transferred the entire hiring process to AI, and later it turned out that this AI was actually racist because it did not take black people into account at all, and preferred men more but women.Also, some public institutions such as schools in the US started evaluating their staff with the help of AI, so some professors with an impeccable career suddenly became bad and useless, which of course has nothing to do with the truth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "August 21, 2023, 12:39:03 PM",
      "body": "Quote from: Kakmakr on August 21, 2023, 06:14:34 AMTrader : Alexa.... Buy 13 bitcoins.Alexa : Ok, buying 30 bitcoins at $30 000 Trader : Nooooo Alexa, I said buy 13 bitcoins!Alexa : Ok, buying 13 bitcoins...Trader : Nooooooo! do not buy another 13 bitcoins .... I just told you what I said. Alexa : Ok, buying another 13 bitcoins ...... beep beep beep.... Unfortunately you ran out of funds, should I transfer more money from your Bank? This is the kind of scenario that I see playing out with AI on these trading platforms, because technology can be flawed and it is \"Garbage in, garbage out\" with computers these days.  That reminds me a dialogue between a home owner and Alexa. Millions of people buy Alexa and actually instead of making their life easier, it makes their life more terrible. I don't understand how can one be so lazy to not stand up to turn the lights on. Even more I don't  understand how do these people have wealth.Quote from: Lucius on August 21, 2023, 10:34:48 AMQuote from: Kakmakr on August 21, 2023, 06:14:34 AM~snip~This whole confusion with AI clearly shows that something is definitely wrong with people, because how else to explain the fact that more and more people think that AI should be involved in practically every part of society. I recently watched a documentary on this topic, and it was about the fact that some companies transferred the entire hiring process to AI, and later it turned out that this AI was actually racist because it did not take black people into account at all, and preferred men more but women.Also, some public institutions such as schools in the US started evaluating their staff with the help of AI, so some professors with an impeccable career suddenly became bad and useless, which of course has nothing to do with the truth.AI that's available in public at the moment, is bullshit. How can we call it an intelligence when it follows certain written algorithms instead of pure creativity and own exclusive decision-making? And I am sceptical about those documentaries too and I think their purpose is to direct attention of people on some absurd.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "August 21, 2023, 06:27:01 PM",
      "body": "Quote from: stompix on August 16, 2023, 06:37:17 AMQuote from: algoine on August 15, 2023, 08:46:11 PMWith Trading Operator, you can seamlessly navigate the Binance markets, execute trades, and manage positions using natural language commands. Imagine asking questions like \"What's the current price of Bitcoin?\" or placing orders by saying \"Buy 10 ETH at $1500\".Yeah, thrilling, can't wait for it:- Buy 1 mbtc at 29 000!- Buying 29 000 Micro Bitcoin Finance at 1$!- What did you say?- The price of WhatDoYouSee NFT is 0.02 , buy?- Ohhh no!!!!!! Don't buy! - Going long on Don't Buy Inu for all entire balance!That aside, 30 days an old website, supposedly owned by a company registered 3 months ago in Delaware, with no contact, no office, and no information whatsoever, so should I pay 10$ a month a month to give them access to all my funds and trade?Yeah exactly the thoughts that were running through my mind when I was reading the concept. I mean I also have wild ideas sometimes but I do not put them publicly just to make fool out of me. Lolz. Honestly, I never believed in the automated trading so no bots no AI can take the place of human being to perform he complex task like trading and that too with the real money market. I mean seriously people are daring to take such risks and then blame it on the bad luck and shit. Now, this concept literally has no basis and there is no point in having \"Chat based trading\" it seems. If so then I can just have some patching and coding with the Alexa at my home and ask her to add \"0.005 btc at 31k USD\" into my trading cart.  I am damn sure Alexa would be more than happy to do this and with great accuracy as compared to ChatGPT. Edit: @Kakmakr yeah that is what literally came through me. I am luaghing a lot on this man.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "August 21, 2023, 11:13:15 PM",
      "body": "Concept of this creation may have a good benefit but also come technology flaw and we have to choose between convenience and security our capital and investment especially now that thousands of ChatGPT users credential is sold on the DarkNet website if integrate things there's no guarantee that something bad won't happen.  Giving third access to our Binance API had already make the account vulnerable not to about adding ChatGPT. Crypto trader and investors have to wake up and stop being lazy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "August 22, 2023, 06:50:31 AM",
      "body": "Quote from: algoine on August 18, 2023, 11:54:15 AMusing symbol whitelist, you can ensure that transactions are limited to your chosen coins. As for pump-dump activities, it's known that such activities often target low-volume coins. Avoiding these is within your control.It doesn't remove the risk since hackers can still manipulate them as long as they have enough accounts. Basically, the critical problem is likely how secure your system is. To be fair, you can't change how most exchange APIs work, so the only thing you can improve is securing your customer info. I think you've yet to answer my question about this in the previous post, so it would be better if you can answer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}