{
  "id": "topic_5447389",
  "title": "bonfire66",
  "author": "bonfire66",
  "created_time": "April 03, 2023, 01:04:52 PMLast edit: April 03, 2023, 05:36:03 PM by bonfire66",
  "content": "Мы все хотим кушать. И не просто абы как кушать, но кушать вкусно. И прилагаем для этого все возможные усилия и ресурсы, которыми мы обладаем. Просто потому, что все мы хотим просто кушать. Вкусно кушать. Устрицы и лобстеры, крабы и мидии, стейки и трюфели.  Каждому свое. Jedem Das Seine.   Мне кажется, что большинство кулинарных блюд придумано от бедности. Типа, вот например, у бедных марсельских моряков XIX века не было ничего, кроме как остатков их улова, которого никто не хотел покупать – и они придумали суп «Буайбес». Афигенная тема! А вот итальянцы, например, придумали пиццу. Просто потому, что качественного мяса не хватало на всех.  А муки и помидоров хватало. Но народ мог взбунтоваться. Поэтому надо было найти способ утихомирить народ кулинарными методами. Придумать ему (народу) такую еду, которая бы его (народ) бы полностью удовлетворяла и создавала бы иллюзию вкусности и сытности. Таким образом была придумана классическая итальянская пицца.   Если что, я ничего не  имею против ни пиццы, ни чебуреков, ни пельменей. Потому что это все – еда для  народа. А я – отнюдь не дитя олигарха (увы, мне очень жаль), но и даже и не «новый русский». Я НЕ могу позволить себе даже хотя бы 2 раза в день жрать по 300 грамм стейка «Вагю», запивая его «Шабли», и закусывая оостендскими устрицами в трюфелях, и при этом на завтрак усердно жрать крабов и креветок.    Ну не смог я. Не смог. Поберегся от гастрономической похоти. Хотя все это из вышеперечисленного я уже не раз пробовал. Но это все было именно редко, чисто по-приколу. А вот жрать каждый день по паре стейков – этого уровня финансово благополучия я так и не смог достигнуть.  Не всем дано. Ибо кулинарное кишкоблудие – это вам не бабу трахнуть! Тут опыт нужен и умение! Бабы – это вульгарное проявление социального материализма. А вот суметь вкусно покушать – это и есть настоящее искусство! И денег на это потребно гораздо больше.   И тут я попал в психологическую ловушку типа «качество-количество». Тут  я ничего не могу с собой поделать, ибо плебей по рождению, хотя и чистопородный плебей. Но, увы,  я не могу платить в 10 раз больше бабла просто за тот вкус, который лучше всего в 2-3 раза от эталонного. При этом жертвовать поездками на Мальдивы или Канары. Во имя незначительного улучшения вкусовых качеств. Но ведь лучше сгонять пару раз туда и обратно (в другое полушарие земли), но не жрать каждый день омаров с устрицами, чем жрать конкретно и часто все вышеупомянутое, но не побывать ни разу на Карибах.     Тут мой желудок не смог перевесить восприятие чистого разума. И я предпочел пищу духовную пище вульгарной. Да, пока еще не ясно, правильно ли я поступил, но будущее покажет, кто был прав. Подписывайтесь на мой канал, скоро я открою новый сезон путешествий, будет много интересных роликов, и не только про голубей. Всем удачи, и чтобы все, кто дочитал до этого момента, жрали бы стейки «Вагю» каждый день и закусывали бы тихоокеанскими крабами. А все прочие идите нах.    В итоге… По сути… Никакой пиццы. Никаких пельменей или чебуреков. Только натуральное мясо. Мясо бычков «вагю», вырезки тунца, устриц или лобстеров. Немного соевого соуса. А вот добавление муки, овощей и обильного жира вредит организму, ибо это клетчатка, липиды, сахара – это все способствует ожирению и не способствует качественному здоровью. Вы хотите стать жырным? Нет? Ну тогда не кушайте ни пельмени, ни пиццу ни сэндвичи, ни прочие мучные изделия. Никакого крахмала или углеводов. Только натуральное свежее почти обезжиренное мясо молодых бычков или моллюсков-лобстеров. Только так, и не как иначе! Только минимум клетчатки и будет вам счастье и здоровье!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447389",
  "comments": []
}