{
  "id": "topic_5456007",
  "title": "WhyFhy",
  "author": "WhyFhy",
  "created_time": "June 11, 2023, 04:35:33 AM",
  "content": "Recently, Grusch publicly alleged that the U.S. federal government maintains a highly secretive UFO retrieval program and is in possession of both extraterrestrial spacecraft and the corpses of pilots. These allegations are based on information he claims to have received from other officials.https://en.wikipedia.org/wiki/David_GruschRecently, there's been a reported sighting in Nevada that's caught my attention. You can check out the vid caught on axon bodycam here. A 911 call was made just a minute after this sighting.https://news4sanantonio.com/news/nation-world/las-vegas-workers-claim-ufo-sighting-police-body-cam-captures-mysterious-flashPersonally, I've always found Bob Lazar's claims about this stuff at Area 51(S4) to be compelling. The increasing number of reported sightings and the growing body of evidence seem to suggest that we may not be alone in the universe.I'm leaning towards the unacknowledged theory,  that governments are aware of extraterrestrial life but choose to keep it secret. At this point, it feels less like a theory and more like a plausible explanation.Given the mounting evidence, I believe it's time to move on from the Fermi Paradox. What do yall think?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456007",
  "comments": [
    {
      "author": "mich",
      "created_time": "June 12, 2023, 02:24:14 AM",
      "body": "I was truly intrigued when I heard there was a UFO sighting in Las Vegas. There were two theories that came into mind. First theory is with Las Vegas being known for entertainment and their nightlife. Was this an advertising plot to advertise Las Vegas and some kind of light show that has gone bad. The second is that since Area 51 being located a few hours drive from this city. This could have been an experiment from scientist from Area 51 gone bad. With the video provided on the news report, I’m still thinking that the evidence of alien sighting was not real for this time.I want to think that governments know of some alien activity. But I will not believe it all unless there is real life proof we can see for ourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "June 12, 2023, 02:34:22 AM",
      "body": "Wouldn't this change the reference of Christians being the special that God created human alone in his own image? Who created these aliens then? The question is why are they saying it now like they want us to believe it when all those UFO crashes happened decades ago. Whats the main goal here? Don't tell us to unite all people in the world to fight outsiders because literally we're leading wars all the time. There were theories that US is going to militarize the space because of this pronouncement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WhyFhy",
      "created_time": "August 09, 2023, 05:14:55 AM",
      "body": "Quote from: bittraffic on June 12, 2023, 02:34:22 AMWouldn't this change the reference of Christians being the special that God created human alone in his own image? Who created these aliens then? The question is why are they saying it now like they want us to believe it when all those UFO crashes happened decades ago. Whats the main goal here? Don't tell us to unite all people in the world to fight outsiders because literally we're leading wars all the time. There were theories that US is going to militarize the space because of this pronouncement.  I've heard similar theories. I've often found truth to be stranger than fiction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}