{
  "id": "topic_5417273",
  "title": "fuyicn",
  "author": "fuyicn",
  "created_time": "October 16, 2022, 05:08:34 AM",
  "content": "another questionthere was a sent out from the address: 164CjAHG7qssU2VumdT2TCRqkS6C1GDxC3 8btc. and I can see the txn is:5c14ff74318d2c1c44ae844a7c855ec3b8cf0bb32e706a43fc35e772d47ba285. then I can see the sent-out 8 BTC on the list, but why I can't see which address received it? or does it mean it will break down and I can't find where it goes to?thx",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417273",
  "comments": [
    {
      "author": "hosemary",
      "created_time": "October 16, 2022, 05:27:22 AM",
      "body": "Note that any bitcoin transaction can have multiple inputs and multiple outputs.There are 62 inputs and 57 outputs in the transaction in question and one the inputs is the 8 BTC you are referring to. Quote from: fuyicn on October 16, 2022, 05:08:34 AMbut why I can't see which address received it? or does it mean it will break down and I can't find where it goes to?That's because there's no address receiving 8 BTC at all. It's not that there should be a 8 BTC ouput, because there's a 8 BTC input.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuyicn",
      "created_time": "October 16, 2022, 05:36:27 AM",
      "body": "under the address: 164CjAHG7qssU2VumdT2TCRqkS6C1GDxC3 there is only 8 BTC received and sentand in the hash:5c14ff74318d2c1c44ae844a7c855ec3b8cf0bb32e706a43fc35e772d47ba285 i do see the input 8 BTC from the address but didn't see which address received this 8 BTCdoes it mean 8 BTC was split? and can I find out which address received it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "October 16, 2022, 05:45:10 AM",
      "body": "Quote from: fuyicn on October 16, 2022, 05:36:27 AMunder the address: 164CjAHG7qssU2VumdT2TCRqkS6C1GDxC3 there is only 8 BTC received and sentThis is correct.That address received 8 BTC in e3a1....822c and spent that in 5c14....a285. Quote from: fuyicn on October 16, 2022, 05:36:27 AMand in the hash:5c14ff74318d2c1c44ae844a7c855ec3b8cf0bb32e706a43fc35e772d47ba285 i do see the input 8 BTC from the address but didn't see which address received this 8 BTCYou are right that that address has spent 8 BTC in that transaction, but that doesn't mean there must be an output with the value of 8 BTC as well.A bitcoin transaction can have multiple inputs and multiple outputs and each of them can have different values.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuyicn",
      "created_time": "October 16, 2022, 07:08:21 AM",
      "body": "so, if i exchange 1 BTC in the address into ETH in any wallet, will it show in the address as 1 btc output?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "October 16, 2022, 07:22:21 AM",
      "body": "Quote from: fuyicn on October 16, 2022, 07:08:21 AMso, if i exchange 1 BTC in the address into ETH in any wallet, will it show in the address as 1 btc output? Here we are talking about bitcoin and note that there is no connection between bitcoin and ethereum blokchains. If you send 1 BTC to a bitcoin address (whether it's owned by an exchange and you want to trade with your bitcoin or it's owned by someone and you want to buy something), an output with the value of 1 BTC is created and will be owned by the owner of that address. If you search for the receiving address in a blockchain explorer, you will see that address has received 1 BTC. Note that your transaction may include an extra output as the change.It's also possible to make a transaction with multiple outputs. For example, you can pay 1 BTC to address A, 2 BTC in address B and 3 BTC to address C in a single transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuyicn",
      "created_time": "October 16, 2022, 08:03:49 AM",
      "body": "yes, it is why I am wondering.as I am helping the police check the record. we got the Huobi transactions back now. it shows to me that: the address: 14Ur3AR7CHxweAvrjnFvZvv8B5CBf5kGnGthere are a lot of BTC deposits in huobi's record, about 944 BTC, but there are only 2 withdraws about 10 BTCbut the record on the website shows all the withdrawal transactions. does it mean the withdrawal transaction on the website is the selling from BTC to usdt? but maybe huobi uses dynamic btc address, so it doesn't show in huobi's record? below is the record from huobi， doesn't match to the record onlinedeposit   btc      2018-05-07 16:17:09      3.669withdraw   btc      2018-06-12 16:12:53      4.52399006deposit   btc      2018-06-13 02:11:53      4.52389006deposit   btc      2018-10-11 17:25:27      5.71792525deposit   btc      2019-06-29 15:58:32      100.35deposit   btc      2019-07-07 10:06:40      2deposit   btc      2019-07-08 09:41:48      50deposit   btc      2019-07-14 04:37:15      50deposit   btc      2019-07-17 04:48:33      50deposit   btc      2019-07-24 10:41:15      50.252deposit   btc      2019-07-25 15:44:54      50deposit   btc      2019-07-27 15:30:54      50deposit   btc      2019-07-29 04:34:48      43deposit   btc      2019-07-30 08:14:03      46deposit   btc      2019-08-01 15:24:15      48deposit   btc      2019-08-04 07:03:09      47deposit   btc      2019-08-05 04:19:17      43deposit   btc      2019-08-06 07:02:18      30deposit   btc      2019-08-07 13:40:19      35deposit   btc      2019-08-08 13:39:52      30deposit   btc      2019-08-12 06:19:36      40deposit   btc      2019-08-18 06:54:37      36deposit   btc      2019-08-19 01:40:33      37deposit   btc      2019-08-22 14:12:46      37deposit   btc      2019-08-26 07:12:24      37deposit   btc      2020-07-13 01:46:34      10deposit   btc      2020-08-09 09:10:23      4withdraw   btc      2020-11-14 09:37:47      5.9995deposit   btc      2020-12-03 13:23:54      5.09",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "October 16, 2022, 08:18:24 AM",
      "body": "Quote from: fuyicn on October 16, 2022, 08:03:49 AMthere are a lot of BTC deposits in huobi's record, about 944 BTC, but there are only 2 withdraws about 10 BTCThe address has received 944 BTC and has spent all of that. Note that when you withdraw from an exchange, the withdrawal isn't made from the address you deposited to. When you deposit fund to your deposit address, exchange sends the fund from your deposit address to their own wallet and when you request a withdrawal, the exchange send you the fund from their own wallet. Quote from: fuyicn on October 16, 2022, 08:03:49 AM does it mean the withdrawal transaction on the website is the selling from BTC to usdt?Exchanging bitcoin to usdt or exchanging any other coin/token to any other coin/token is done on the exchange, not on the blockchain. So, trades are not recorded in the blockchain at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "October 16, 2022, 10:18:41 AM",
      "body": "If the record you posted above is a user account history, I think it means their withdrawal probably comes from another address. The address you mentioned is controlled by Huobi for deposit purposes, while they process user withdrawals with another address. I think this is common practice for centralized exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "October 16, 2022, 08:04:11 PM",
      "body": "Quote from: fuyicn on October 16, 2022, 08:03:49 AMyes, it is why I am wondering.as I am helping the police check the record. we got the Huobi transactions back now. it shows to me that: the address: 14Ur3AR7CHxweAvrjnFvZvv8B5CBf5kGnGthere are a lot of BTC deposits in huobi's record, about 944 BTC, but there are only 2 withdraws about 10 BTCbut the record on the website shows all the withdrawal transactions. does it mean the withdrawal transaction on the website is the selling from BTC to usdt? but maybe huobi uses dynamic btc address, so it doesn't show in huobi's record? below is the record from huobi， doesn't match to the record onlinedeposit   btc      2018-05-07 16:17:09      3.669withdraw   btc      2018-06-12 16:12:53      4.52399006deposit   btc      2018-06-13 02:11:53      4.52389006deposit   btc      2018-10-11 17:25:27      5.71792525deposit   btc      2019-06-29 15:58:32      100.35deposit   btc      2019-07-07 10:06:40      2deposit   btc      2019-07-08 09:41:48      50deposit   btc      2019-07-14 04:37:15      50deposit   btc      2019-07-17 04:48:33      50deposit   btc      2019-07-24 10:41:15      50.252deposit   btc      2019-07-25 15:44:54      50deposit   btc      2019-07-27 15:30:54      50deposit   btc      2019-07-29 04:34:48      43deposit   btc      2019-07-30 08:14:03      46deposit   btc      2019-08-01 15:24:15      48deposit   btc      2019-08-04 07:03:09      47deposit   btc      2019-08-05 04:19:17      43deposit   btc      2019-08-06 07:02:18      30deposit   btc      2019-08-07 13:40:19      35deposit   btc      2019-08-08 13:39:52      30deposit   btc      2019-08-12 06:19:36      40deposit   btc      2019-08-18 06:54:37      36deposit   btc      2019-08-19 01:40:33      37deposit   btc      2019-08-22 14:12:46      37deposit   btc      2019-08-26 07:12:24      37deposit   btc      2020-07-13 01:46:34      10deposit   btc      2020-08-09 09:10:23      4withdraw   btc      2020-11-14 09:37:47      5.9995deposit   btc      2020-12-03 13:23:54      5.09First of all there is no way to find an exchange's addresses completely, we may identify some but not a complete list of addresses. And if you deposit to an exchange wallet it doesn't mean the exchange will keep the funds in there all the time, as far as I know exchange keep moving most of their funds to their cold storage so they can avoid complete loss in case of hack or something.About the question all the transactions are stored digitally and anyone can view it, but it will be easier only if there is one input and one output while exchanges mostly have multiple input and multiple outputs so that is why you can't see that 8BTC in an output probably it maybe splitted and sent to multiple addresses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "October 16, 2022, 09:04:10 PM",
      "body": "Quote from: jrrsparkles on October 16, 2022, 08:04:11 PMFirst of all there is no way to find an exchange's addresses completely, we may identify some but not a complete list of addresses. And if you deposit to an exchange wallet it doesn't mean the exchange will keep the funds in there all the time, as far as I know exchange keep moving most of their funds to their cold storage so they can avoid complete loss in case of hack or something.About the question all the transactions are stored digitally and anyone can view it, but it will be easier only if there is one input and one output while exchanges mostly have multiple input and multiple outputs so that is why you can't see that 8BTC in an output probably it maybe splitted and sent to multiple addresses. It's true that you can't find an exchange address completely is because many exchanges have different addresses use per user when they deposit crypto to their account in that exchange. I have tried finding myself but didn't find it at all so I have to give up finding their address. If you exchange your btc to eth then it will go like this BTC address - BTC address then ETH address to your ETH address in that exchange before you can withdraw to your ETH wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "October 16, 2022, 09:40:21 PM",
      "body": "Quote from: nakamura12 on October 16, 2022, 09:04:10 PMQuote from: jrrsparkles on October 16, 2022, 08:04:11 PMFirst of all there is no way to find an exchange's addresses completely, we may identify some but not a complete list of addresses. And if you deposit to an exchange wallet it doesn't mean the exchange will keep the funds in there all the time, as far as I know exchange keep moving most of their funds to their cold storage so they can avoid complete loss in case of hack or something.About the question all the transactions are stored digitally and anyone can view it, but it will be easier only if there is one input and one output while exchanges mostly have multiple input and multiple outputs so that is why you can't see that 8BTC in an output probably it maybe splitted and sent to multiple addresses. It's true that you can't find an exchange address completely is because many exchanges have different addresses use per user when they deposit crypto to their account in that exchange. I have tried finding myself but didn't find it at all so I have to give up finding their address. Some tools make it possible to find out which address belongs to which exchange, but of course this does not always happen if the input's of an exchange's address are not spent in the same block and sent to another hot wallet address or cold wallet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "October 16, 2022, 11:01:54 PMLast edit: October 16, 2022, 11:12:10 PM by PX-Z",
      "body": "Quote from: JeromeTash on October 16, 2022, 09:40:21 PMQuote from: nakamura12 on October 16, 2022, 09:04:10 PMQuote from: jrrsparkles on October 16, 2022, 08:04:11 PMFirst of all there is no way to find an exchange's addresses completely, we may identify some but not a complete list of addresses.  It's true that you can't find an exchange address completely is because many exchanges have different addresses use per user when they deposit crypto to their account in that exchange. I have tried finding myself but didn't find it at all so I have to give up finding their address. Some tools make it possible to find out which address belongs to which exchange, but of course this does not always happen if the input's of an exchange's address are not spent in the same block and sent to another hot wallet address or cold walletThis is true, i usually see this twitter handles[1] and their website[2] monitoring the deposits, withdrawals, buy and sell order of almost the high volume exchanges. The address are random just like how the user deposits on its unique address in an exchange. So it really possible to know every exchange's address as its connected each other by z,y,xpub.[1] https://twitter.com/whale_alert[2] https://whale-alert.io/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "October 16, 2022, 11:10:34 PM",
      "body": "Quote from: fuyicn on October 16, 2022, 07:08:21 AMso, if i exchange 1 BTC in the address into ETH in any wallet, will it show in the address as 1 btc output? No, not necessarily.When you ake an exchange on a centralized exchange they will just update your balances on their database. They will subtract 1 btc from your btc balance and add the equivalent in your eth balance. The transaction will not be made on-chain.When you make a deposit, the coins you send to the receiving address will likely be moved to another address (cold wallet). So, tracking the address on a block explorer is pointless as it will not reflect the operations you made on the exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}