{
  "id": "topic_5412648",
  "title": "Iron Fist",
  "author": "Iron Fist",
  "created_time": "September 06, 2022, 08:51:16 PM",
  "content": "I am currently working with a client which is trying to perform some searches on blockchain data. One of the issues that I am running into is that there is no Blockchain explorer with advanced options, i.e. one where you can filter transactions according to certain criteria. For example, we would like to see only those transactions that started on specified input/output addresses. Do you know of such an online tool?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5412648",
  "comments": [
    {
      "author": "TryNinja",
      "created_time": "September 06, 2022, 08:54:29 PMLast edit: September 06, 2022, 09:05:00 PM by TryNinja",
      "body": "https://blockchair.com is probably the best I've seen so far.For example, you can search by hash, block, input/output count, time, fee, size, etc...: https://blockchair.com/bitcoin/transactionsDidn't work that well in the cases I needed it, though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "September 06, 2022, 09:04:03 PM",
      "body": "Quote from: Iron Fist on September 06, 2022, 08:51:16 PMone where you can filter transactions according to certain criteria. For example, we would like to see only those transactions that started on specified input/output addresses. Do you know of such an online tool?Using any of the reliable explorers[1][2] you can search for those input or output addresses and would get all transactions linked to them. I am yet to see a special option to easily navigate a filter, but just modifying what you are searching for can give the result you want.[1] https://blockchair.com[2] https://www.blockchain.com/explorer- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "September 06, 2022, 09:15:29 PM",
      "body": "Quote from: Iron Fist on September 06, 2022, 08:51:16 PMI am currently working with a client which is trying to perform some searches on blockchain data. One of the issues that I am running into is that there is no Blockchain explorer with advanced options, i.e. one where you can filter transactions according to certain criteria. For example, we would like to see only those transactions that started on specified input/output addresses. Do you know of such an online tool?All transactions containing an address are under that address in a blockchain explorer, it's not an advanced option.But maybe you indeed want something (much) more complicated (which you either didn't express well, either I misunderstood). And then you may want to take a look at this topic (and related pages) : Bitcoin in SQL",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "September 06, 2022, 10:05:05 PM",
      "body": "Can you please elaborate more on what exactly you mean by \"transactions started on specified input/output addresses\"?As suggested above, blockchair allows you filter transactions based on some different fields. For example, it allows you filter transactions based on number of inputs and outputs or their value. But I don't understand what you mean by \"specified input/output addresses\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "September 06, 2022, 10:14:27 PM",
      "body": "Quote from: NeuroticFish on September 06, 2022, 09:15:29 PMAll transactions containing an address are under that address in a blockchain explorer, it's not an advanced option.But maybe you indeed want something (much) more complicated (which you either didn't express well, either I misunderstood). And then you may want to take a look at this topic (and related pages) : Bitcoin in SQLOP's wording is indeed a bit confusing because if you look up an address on any blockexplorer you will see all the transactions it received (address used as output) and transactions it sent (address used as input).However, I believe OP is looking for some more advanced features like what blockchair (suggested by TryNinja) offers.OP, if this is a serious project and you will need to make multiple queries and need fast results then you might want to check their paid api service: https://blockchair.com/apihttps://blockchair.com/api/plans",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "September 06, 2022, 11:34:13 PM",
      "body": "Quote from: Iron Fist on September 06, 2022, 08:51:16 PMFor example, we would like to see only those transactions that started on specified input/output addresses. Do you know of such an online tool?Maybe you meant to say filter transactions from address A to address B? if so, I'd look into visualizer tools like breadcrumbs.app",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "September 06, 2022, 11:42:16 PMLast edit: September 06, 2022, 11:53:34 PM by BitMaxz",
      "body": "The Blockchair is enough I think but if you are looking for a more advanced option and you know how to use API blockstream would be a good alternative. There are lots of commands that you can use in Blockstream API and API can be found here https://github.com/Blockstream/esplora/blob/master/API.mdAnd you can find more blockchain explorer tools here https://github.com/dubuqingfeng/awesome-blockchain-explorer",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OROBTC",
      "created_time": "September 07, 2022, 08:52:39 PMLast edit: September 07, 2022, 09:11:10 PM by OROBTC",
      "body": "...Member witcher_sense posted the below interesting link that searches out probable wasabi conjoins using blockchair, this is an example of the kinds of options:https://blockchair.com/bitcoin/transactions?s=time(desc)&q=input_count(50..),output_count(58..),time(2022-06-26..),version(1)#f=hash,input_count,output_count,time,fee_usd,output_total,output_total_usd,version[edited]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iron Fist",
      "created_time": "September 08, 2022, 10:15:40 PM",
      "body": "Thanks everyone for the suggestions. It seems to me that the only solution is by using the API and combing through the data on my end.Quote from: Potato Chips on September 06, 2022, 11:34:13 PMMaybe you meant to say filter transactions from address A to address B? if so, I'd look into visualizer tools like breadcrumbs.appYeah, that's exactly what I meant. I just thought there was something simpler because I don't need visualization and other tools.Thank you!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "September 09, 2022, 09:49:45 PM",
      "body": "Quote from: Iron Fist on September 08, 2022, 10:15:40 PMYeah, that's exactly what I meant. I just thought there was something simpler because I don't need visualization and other tools.I actually think it fits the term \"simpler\"--at least for me and my use cases-- like you put in an address, get a graph and when you select a path, a window will pop up showing the transactions:In any case, nice to see that you found a workaround!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iron Fist",
      "created_time": "September 10, 2022, 02:03:12 PM",
      "body": "There was, somewhere on this forum, a list of all the Bitcoin blockchain explorers that are out there. However, I couldn't find it.In case anyone finds it, please let me know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "September 10, 2022, 02:11:09 PM",
      "body": "Quote from: Iron Fist on September 10, 2022, 02:03:12 PMThere was, somewhere on this forum, a list of all the Bitcoin blockchain explorers that are out there. However, I couldn't find it.In case anyone finds it, please let me know. You are probably referring to the topic created by 1miau. Click the following link to visit the thread. List of useful Bitcoin block explorersEdit:There's another topic created by bullrun2020bro.[List] Blockchain Explorer (BTC, ETH, XRP etc.), 02/20",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iron Fist",
      "created_time": "September 10, 2022, 02:19:38 PM",
      "body": "Thanks, that's exactly what I was looking for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}