{
  "id": "topic_5433481",
  "title": "raybucks",
  "author": "raybucks",
  "created_time": "January 08, 2023, 02:11:13 PM",
  "content": "hello,Many websites posts analysis from any trader and other shit , is there any crypto news sites which keep us up to date , site maybe small or big Cointelegraph is good and provide all news first then other site copy them no? but i don't like interfaceI think bitcoin.com is best",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433481",
  "comments": [
    {
      "author": "NeuroticFish",
      "created_time": "January 08, 2023, 02:38:22 PM",
      "body": "Quote from: raybucks on January 08, 2023, 02:11:13 PMI think bitcoin.com is best That website is owned by bcashers, who, last time I've checked, were still trying to convince the world that their altcoin is the true bitcoin.This being said, simply I don't trust their news are always correct/good.So I'd recommend looking for other news sources too.I will add some possible entries to \"the list\":https://defidive.com/news?filter=bitcoinhttps://bitcoinmagazine.com/And for the actual info (not news) on bitcoin:https://bitcoin.org/https://learnmeabitcoin.com/https://en.bitcoin.it/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "January 08, 2023, 02:47:31 PM",
      "body": "The reputable ones are CoinDesk, Cointelegraph, and The Block. I wouldn't really use these sites for trading-related stuff though; as you're pretty much reacting really slow if you're just going to base your information off news sites. I'd personally rather follow people directly on Twitter, but you do you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "raybucks",
      "created_time": "January 08, 2023, 02:47:39 PM",
      "body": "https://defidive.com/news?filter=bitcoinhttps://en.bitcoin.it/thanks , I liked this two sites thanks for sharing",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "January 08, 2023, 02:58:40 PM",
      "body": "I'd also take note of these op,  Nasdaq, CoinMarketCap, CoinDesk. It would help to have a varied number of sites to choose from. But the sites recommended by @NeuroticFish give better insights if you want more knowledge about Bitcoin and crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 08, 2023, 03:05:28 PMLast edit: January 08, 2023, 03:16:19 PM by franky1",
      "body": "best advice..read multiple \"news\" sites and then check their sourceswhen a site mentions something its quoting. find the source quote and check the context. verify its validity or atleast learn the full content/context of a 'snipped'/'sniped' quotesome sites lean towards certain biases and make \"opinion\" pieces that lean the quotes towards a certain sentiment.. i see many sites quote something but then highlight a source as another puffpiece made by same site or another media site. rather than the original sourcecoindesk does this alot. quotes other media sites and itself. rather than for instance linking in a link to an actual court filing or regulator announcement",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "January 08, 2023, 03:11:15 PM",
      "body": "It is difficult to say which cryptocurrency news site is the best because there are many factors that must be considered when saying the best, because those who judge the best site are ourselves, which is not necessarily the best for others, and vice versa.CoinDesk, BitcoinTalk, Twitter, and Reddit are the best sources for news and cryptocurrency related.and i also use CoinMarketCap if i want to track cryptocurrency exchange rate, actually there are many best source sites or anything related to cryptocurrency. But it all depends on what you need, and I use it a lot with what I listed above which I find great.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "January 08, 2023, 03:16:34 PM",
      "body": "mk4's suggestion are probably what I'd say are the most reputable too -- The Block, anyway, the one I'd rank the highest there. Just ignore all sponsored posts (they're usually clearly marked and are just a minor step up from pure Press Release type or advertisement posts) as those have the lowest quality and most dubious sources (they're paid for, so can't really blame them for using a common media business model).Crypto Town Crier is my occasional \"how to read between the lines of the real news\" site but they seem to have taken a break in the last month. I was formerly affiliated with Bitcoin News also, and while their content is a bit iffy, it does strive to be more of a commentary site than breaking news (and their Telegram is... at times interesting).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "January 08, 2023, 03:18:43 PM",
      "body": "Quote from: raybucks on January 08, 2023, 02:11:13 PMMany websites posts analysis from any trader and other shit , is there any crypto news sites which keep us up to date , site maybe small or big (....)Most news websites that are about cryptocurrency are almost the same. And if you are talking about charts, like more on technical analysis are more on speculation, so for me, it's normal for this.Another thing is if you are active on Twitter, there are some twitter accounts that are worth to follow but at the same time, on Twitter, there are lot of fake news to and shits, so becareful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 08, 2023, 03:20:45 PM",
      "body": "Quote from: bitzizzix on January 08, 2023, 03:11:15 PMIt is difficult to say which cryptocurrency news site is the best but easy to say which are the worsea. they clickbait titles but have nothing re-resourceful in the contentb. quotes that trigger something 'newsworthy' has no link(source) of how the media became aware of 'news'c. if they have a 'source' link. if its just a loop to other media circles.some sites have all three failures",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crunck",
      "created_time": "January 08, 2023, 03:23:29 PM",
      "body": "Quote from: raybucks on January 08, 2023, 02:11:13 PMhello,Many websites posts analysis from any trader and other shit , is there any crypto news sites which keep us up to date , site maybe small or big Cointelegraph is good and provide all news first then other site copy them no? but i don't like interfaceI think bitcoin.com is best There are countless crypto news websites and it is impossible to say which is the best to follow. Cryptocurrency news is endless and I don't think you can follow all of them. Try using social networks like Twitter and Reddit, where you will see the most important news discussed instead of trying to follow the whole news every day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "January 08, 2023, 03:37:54 PM",
      "body": "Quote from: crunck on January 08, 2023, 03:23:29 PMThere are countless crypto news websites and it is impossible to say which is the best to follow. Cryptocurrency news is endless and I don't think you can follow all of them. Try using social networks like Twitter and Reddit, where you will see the most important news discussed instead of trying to follow the whole news every day.Blogs and websites are good and reliable sources for receiving news better than social media sites, as anyone on Twitter or Reddit and others can publish any false news, There are many good websites that the OP can check out for the latest cryptocurrency and bitcoin news daily. For me, I prefer the following websites which have exclusive news and simple and easy interface for readers :1- https://cryptonews.com/2- https://www.coindesk.com/3- https://www.cnbc.com/cryptoworld/4- https://www.investing.com/news/cryptocurrency-news@OP After looking at these sites that I mentioned to you, you can put them in the Bookmarks of your browser so that it is easier for you to open them from time to time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0ne",
      "created_time": "January 08, 2023, 03:37:56 PM",
      "body": "I personally prefer using the Cryptocurrency News application which have the combined news from different sources. When we click some news, it directly takes us to the original source. In the beginning days it's really hard to get news about the cryptomarket. Now we've got more access as the market widening have paved path for the development of more cryptocurrency news providers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bobrox",
      "created_time": "January 08, 2023, 03:39:13 PM",
      "body": "Have several website with neutral position when updating news about cryptocurrency and Bitcoin, but don't trust with CNBC when publishing about Bitcoin always update from bad side only. Cointelegraph seems with neutral position updating both side between bad and good news with Bitcoin and altcoin, but keep away with CNBC actually from my local news always try to make FUD and giving negative side information only about Bitcoin.CoinDesk could be another alternative website for updating about cryptocurrency news, this website keep neutral and publishing accurate, good or bad news happening with Bitcoin, usually I read all update news about Bitcoin in Cointelegraph and CoinDesk because both website have early updating about cryptocurrency news.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iranus",
      "created_time": "January 08, 2023, 03:44:33 PM",
      "body": "https://cryptopanic.com/ .This is my favorite website that I use to follow daily market news. In addition, I think this forum is also a place for you to update market news from everyone's posts, and more specifically, we can exchange and discuss related issues. I would also recommend the Reddit social network, I think it's also a good place to follow market news and other discussions, it's like this forum. The news sites are many and the news is very noisy, not all news is true, so you need to filter it carefully.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "January 08, 2023, 03:47:26 PM",
      "body": "Quote from: NeuroticFish on January 08, 2023, 02:38:22 PMQuote from: raybucks on January 08, 2023, 02:11:13 PMI think bitcoin.com is best That website is owned by bcashers, who, last time I've checked, were still trying to convince the world that their altcoin is the true bitcoin.This being said, simply I don't trust their news are always correct/good.So I'd recommend looking for other news sources too.I will add some possible entries to \"the list\":https://defidive.com/news?filter=bitcoinhttps://bitcoinmagazine.com/And for the actual info (not news) on bitcoin:https://bitcoin.org/https://learnmeabitcoin.com/https://en.bitcoin.it/I would definitely acknowledge this websites you have presented. I mostly get up to date information from Bitcoin.org website when I am doing some analysis for the market. They have insightful information of bitcoin market and possible development as expected to be likely result of any occurrence in the blockchain industry. So far, they do share educative bitcoin data and information for personal Consumptions you upgrade if the need be. I think OP should also look into these sites you have presented as it would he OP very well added to the one OP already got.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crunck",
      "created_time": "January 09, 2023, 03:19:03 AM",
      "body": "Quote from: albon on January 08, 2023, 03:37:54 PMQuote from: crunck on January 08, 2023, 03:23:29 PMThere are countless crypto news websites and it is impossible to say which is the best to follow. Cryptocurrency news is endless and I don't think you can follow all of them. Try using social networks like Twitter and Reddit, where you will see the most important news discussed instead of trying to follow the whole news every day.Blogs and websites are good and reliable sources for receiving news better than social media sites, as anyone on Twitter or Reddit and others can publish any false news, There are many good websites that the OP can check out for the latest cryptocurrency and bitcoin news daily. For me, I prefer the following websites which have exclusive news and simple and easy interface for readers :1- https://cryptonews.com/2- https://www.coindesk.com/3- https://www.cnbc.com/cryptoworld/4- https://www.investing.com/news/cryptocurrency-news@OP After looking at these sites that I mentioned to you, you can put them in the Bookmarks of your browser so that it is easier for you to open them from time to time.Social networks have a lot of aggregated information and can post false information, but like forums, we have discussions and objections, so true or false news will always have someone confirm it, from which there will be better view. News sites don't always tell the truth, many traditional news sites still put out misinformation about bitcoin and cryptocurrencies because they hate them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "January 09, 2023, 01:20:45 PM",
      "body": "Quote from: raybucks on January 08, 2023, 02:11:13 PMI think bitcoin.com is best Well, that's what you think but as you can see majority of us will not say that it's the best. The common ones were mentioned already and you agree that Cointelegraph is one of them. And just because you don't like their interface, you don't like them already. They're a crypto news content website so basically the content is much more important than the appearance of the website. Although it's also one of my concerns when I'm thinking of using a website the design, but with them all I can say is that it's not that bad at all but that's my preference and the same as yours.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "January 09, 2023, 01:49:54 PM",
      "body": "These are my list of trusted news source for bitcoin news, some of them are mentioned already since these are the popular ones- CoinDesk- CoinTelegraph- Bitcoin Magazine- Forbes- FortuneDon't just focus on one or two of them, when there's a trending news/headline, always use google and on different sources. Don't be fooled a press release on a news because most PR are clickbait.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "January 10, 2023, 03:32:02 AM",
      "body": "Better to search for bitcoin on google, then click on \"news\" filter and you will see most recent results for your research. Theoretically most important and impacting news will appear on top, so you don't miss anything relevant. Moreover, by doing this, local news portals from your country will also be displayed as relevant news, then you have access to real time updates of bitcoin news in your country which are usually not covered by big portals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}