{
  "id": "topic_5456158",
  "title": "Crypt jnr",
  "author": "Crypt jnr",
  "created_time": "June 12, 2023, 05:30:34 PM",
  "content": "So like dis now Fg don ban Binance way we sti de manage for crypto exchanges chia Guys what is the next move to make oo Because abandoning crypto no b option o",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456158",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "June 12, 2023, 06:20:53 PMLast edit: June 14, 2023, 08:05:53 AM by Charles-Tim",
      "body": "Our government did not ban Binance. Also Binance is not the only exchange that Nigerians are using. There are many other exchanges that you can use to trade naira and crypto.I just do not like what I am reading on the news about Binance ban when we do not have enough regulation yet that could make that possible. Also that it is SEC (Nigeria SEC) that ban Binance, not the government.Nigerians can still access Binance. This has been filled with misinformation and misunderstanding from people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "June 12, 2023, 08:00:22 PM",
      "body": "This is not the end because I de sure say before Binance come some people for here don de use Bitcoin and crypto, so even if they ban Binance as u said it will not affect us using Bitcoin, and no be say them ban am, because as I speak to u, people they use Binance irrespective of the news from SEC.Other exchanges they to use, and if we feel say them too put eye on Binance, we can just go the normal way to continue de use our personal wallets like Electrum, make all these exchanges just be like our markets to buy and we then send dem to our wallets; I think one na im safe pass.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "June 12, 2023, 09:27:31 PM",
      "body": "You see why it is good to do a proper research before coming here to sprout out information you are inundated with.  I was going through the news about it but there was no where I saw that the federal government banned binance from operating but rather it cautioned users and Nigerians to be much careful when dealing so as not to fall for scammers and it still remains n the stand of resisting banks from dealing on Crypto.On the other end binance has refuted the claims and denied anything to do with binance nigeria limited saying I has no affiliation with binance nigeria limited.Source: https://techpoint.africa/2023/06/12/binance-is-not-affiliated-with-binance-nigeria-limited/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "June 12, 2023, 10:10:05 PM",
      "body": "Quote from: CryptSafe on June 12, 2023, 09:27:31 PMOn the other end binance has refuted the claims and denied anything to do with binance nigeria limited saying I has no affiliation with binance nigeria limited.You are right. Binance is also right because the SEC do not know how to tackle these exchanges.Do not mined Binance that try to play smart. I can't be the Nigeria SEC leader and Binance be saying trash. I will not only go for Binance but all other exchanges that Nigeria are using. I hope Nigeria SEC will be literate enough to know this one day after CBN formal governor deceives the government to realize what they can make from these exchanges.I hope that more regulations are coming to make the 10% capital gain tax to become reality and effective, while the exchanges too should not be left alone, or they should stop providing services to Nigerians.Those exchanges suppose to have offices in Nigeria, or they should stop their services to Nigerians.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "June 12, 2023, 10:38:26 PM",
      "body": "Quote from: Charles-Tim on June 12, 2023, 10:10:05 PMThose exchanges suppose to have offices in Nigeria, or they should stop their services to Nigerians.Having an office in Nigeria is not a big problem; they can always do it, but doing that means they are fully licensed to operate in the country as a legal crypto exchange. I believe they have such a plan. I'm not speaking for Binance, but I'm just saying it based on my personal view of how they show so much interest in the people of Nigeria and provide us with services to serve us better, thereby making a profit. I know of Nigerian guys who are currently working with Binance as part of the local support team, and Binance is not ready to lose Nigerians from patronizing them. If having a physical office will solve the problem, I believe they will do it. The problem is just how our country is always not taking things seriously that could have possibly benefited them in terms of huge revenue generation. Even Bundle Africa, which is also owned by Binance, is largely used by Nigerians.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "June 12, 2023, 11:27:05 PM",
      "body": "Quote from: Nwada001 on June 12, 2023, 10:38:26 PMQuote from: Charles-Tim on June 12, 2023, 10:10:05 PMThose exchanges suppose to have offices in Nigeria, or they should stop their services to Nigerians.Binance is not ready to lose Nigerians from patronizing No doubt mate. Binance knows their own very much and would want to go at any extent to protect what they benefit hugely from. Nigeria has always been a market target for all. So allowing Nigeria market slip away from their hands is like letting a diamond go which they would never allow or let another take away from them.Nigeria is a strong market contending force in the business atmosphere of all international organizations. Every new business would want to have a route or a trace to the Nigeria market because they know Nigerians would definitely have a taste of it. Hence the federal government of Nigeria is taking advantage of every opportunity to stand their position and not allowing anything slip out of their hands.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "June 13, 2023, 06:28:25 PM",
      "body": "Even if em be sae FG bans the operation of Binance for Nigeria as you think(which I no sae no be true), there are still  other exchanges that operate in the country that Nigerians go fit the use apart from Binance to continue their trade in crypto. So no need to shiver or make unnecessary assumption that em go fit make people abandon crypto for Nigeria because of that. For Nigeria we get about 10 best exchanges wey peso go fit buy and sell bitcoin. They are: KuCoin, OKX, Huobi, Gate.io, Bitget, Binance, Quidax, Remitano, Buycoins, and Bybit. All these 10 exchanges wey I mentioned, Nigerians dey make use of them, to the buy and sell their bitcoin. It is now left for you to choose the wan wey you want use to trade your bitcoin with. But remember sae, no leave your crypto assets for exchange no matter what.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zanab247",
      "created_time": "June 13, 2023, 07:53:47 PM",
      "body": "The banned of binance in the country doesn't affect the users in the country Nigeria, just like the way dey banned BTC in the country and people are still using BTC to improve their life and other things in the country. Our government  advise binance users in the country to be very careful with the exchange so that users will not blame the government not doing their work. If you are not safe with binance, I believe you can try other exchange like Remitano, Kucoin and bybit which are safe and secure for exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "royalfestus",
      "created_time": "June 13, 2023, 08:15:07 PM",
      "body": "I no understand dis tori of Binance ban, but I fit still access my account for my fone without VPN. I still fit do P2P trade sef.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Broadanbig",
      "created_time": "June 13, 2023, 08:22:58 PM",
      "body": "Omo wether binance dey o, binance no dey o p2p go do the work very well. Other exchange dey exist but why e be say na only binance just dey choke everywhere.Well I believe say na as Dem don work gidibam full every where wey e be say their name don go far and wide for everybody ear and too them get structure and system wey dey in place for ground wey dey solid and strong to benefit everybody wey want to identify with them.Their package go well. Them try.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartCharpa",
      "created_time": "June 13, 2023, 08:56:24 PM",
      "body": "Still that one no fit stop us from using Binance na i still dey use p2p up till now and no any change the Nigeria SEC no mean say we no go get access to Binance again it is just that is illegal to our country and you know how naija matters take be their talk is just to shake table na to do am dey always dey hard, as Nigeria SEC even dey talk about banned of Binance na how them go fee dey get small tax on any swap wey we do and with our prayers we go always pass their power.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "June 13, 2023, 08:57:29 PM",
      "body": "I really don't understand the whole thing. How? How did they ban Binance that it is still working perfectly in the region? I am still using Binance very well. So I don't know how the ban look like. Nigeria has plenty exchange platforms that one can use to buy and sell coins but bincance is the best among all because Binance does not charge when buying and selling while others charge. Exchange like Busa charge a very big amount of money for transaction. So I done like Nigerian own exchange but global exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "June 14, 2023, 12:20:46 AM",
      "body": "This might look little off but since this thread is about Binance let me ask. Onah no feel say, Binance get small license from govt either indirectly or 4rm some kind third party providers if not how dem they carry verify users way they use their BVN carry pass their KYC. If them no get get access to our country BVN data base how dem they carry verify if the information country or not. I don wonder diz tin till I try to use fake number way no be anybody BVN with name and age way i carry my head form but dem no gree am pass dat stage. I just say make I ask, if eh possible for dem to fit access BVN or NIN data page wen the countri people no give dem access to am",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Framelover",
      "created_time": "June 14, 2023, 12:32:30 AM",
      "body": "It’s important to do a thorough research on a topic before posting it to the general public and if you’re not well informed and you’re seeking clarification or opinions, you ought to state it and make it clear. I urge you to go back and make a proper research and stop giving ignorant people high BP",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iadegbola34",
      "created_time": "June 14, 2023, 12:42:49 PM",
      "body": "The government did not ban Binance. It's SEC that named binance as an illegal company in Nigeria and as far as I know, usage has not been affected on Binance. You can still make your day-to-day transactions without any hindrance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uchegod-21",
      "created_time": "June 14, 2023, 01:12:59 PM",
      "body": "Quote from: CryptSafe on June 12, 2023, 09:27:31 PMYou see why it is good to do a proper research before coming here to sprout out information you are inundated with.  I was going through the news about it but there was no where I saw that the federal government banned binance from operating but rather it cautioned users and Nigerians to be much careful when dealing so as not to fall for scammers and it still remains n the stand of resisting banks from dealing on Crypto.On the other end binance has refuted the claims and denied anything to do with binance nigeria limited saying I has no affiliation with binance nigeria limited.Source: https://techpoint.africa/2023/06/12/binance-is-not-affiliated-with-binance-nigeria-limited/No mind Op wey just post yeye post without link and without saying much thing about his post for person to understand. You think say federal government fit ban binance wey dey even sponsor plenty programs and projects for Nigeria including the one wey government own.This time too I sure say nothing Naija SEC wan do. Na just because US dey always get issues with exchanges as per securities, na em dem wan follow trend. Believe ye me, nothing sup and nothing go sup. Kpatakpata, if the new government stablize finish dem go make laws wey cover the activities of CEX in Nigeria.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "June 14, 2023, 01:34:30 PM",
      "body": "Quote from: uchegod-21 on June 14, 2023, 01:12:59 PMNo mind Op wey just post yeye post without link and without saying much thing about his post for person to understand. You think say federal government fit ban binance wey dey even sponsor plenty programs and projects for Nigeria including the one wey government own.It does not mean, we hope that OP should gain from what we have posted. But I am wondering that he created the topic and has not replied anything further. But maybe he is watching and learning, which is good.Quote from: uchegod-21 on June 14, 2023, 01:12:59 PMThis time too I sure say nothing Naija SEC wan do.Probably because SEC do not even know the right way to go about regulating cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Broadanbig",
      "created_time": "June 14, 2023, 07:00:10 PM",
      "body": "Quote from: Nwada001 on June 14, 2023, 12:20:46 AMThis might look little off but since this thread is about Binance let me ask. Onah no feel say, Binance get small license from govt either indirectly or 4rm some kind third party providers if not how dem they carry verify users way they use their BVN carry pass their KYC. If them no get get access to our country BVN data base how dem they carry verify if the information country or not. I don wonder diz tin till I try to use fake number way no be anybody BVN with name and age way i carry my head form but dem no gree am pass dat stage. I just say make I ask, if eh possible for dem to fit access BVN or NIN data page wen the countri people no give dem access to amBut wait o, this cappings make o, because I don ask myself series of questions about this binance verification on how e be say person do verification with bvn or non binance fin approve am immediately. How Dem ale dey know say na fake or original person submit for KYC? If Dem no get access, license or a bit cover to dey operate for Naija here how Dem go dey take dey know say person bvn and nun correct or bad.Me believe say Dem get small umbrella wey dey cover Dem to do wetin Dem want to do. All this cbn matter na backing dog pattern. Dem just want cbn to reason them so something.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "June 14, 2023, 09:17:57 PM",
      "body": "Quote from: Crypt jnr on June 12, 2023, 05:30:34 PMSo like dis now Fg don ban Binance way we sti de manage for crypto exchanges chia Guys what is the next move to make oo Because abandoning crypto no b option oYou may have misunderstood the news and the development,  and just to correct you,  binance have not been ban and every Nigerian is free to trade the cryptocurrency on binance but shouldn't use the exchange to store their coins most especially Bitcoin which can be readily held in a custodial wallet even hardware bitcoin wallets device which is the most secured form of self custody wallet. The binance Nig subsidiary should respond to the lawsuit and try to comply with the governmental demand in other to operate a cryptocurrency exchange in the Nigeria business environment and I think this new development will help the government to be able to tax the cryptocurrency exchange and even it users,  so at that, Binance users will be subject to taxation unless for those who hold decentralized coins like Bitcoin in their wallet and trade them on P2P manner that one can avoid tax,  there has always been Tax invasion in the Nigeria system,  and the emergence of cryptocurrency has helped many to avoid paying tax most especially most decentralized Bitcoin coin and its transactions may be untraceable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}