{
  "id": "topic_5418422",
  "title": "stompix",
  "author": "stompix",
  "created_time": "October 26, 2022, 03:14:56 PM",
  "content": "Probably a lot of you are already accustomed to the name of the FTX founder grabbing headline after headline when he offers to buy assets from Celsius in an altruistic way or how he has \"saved\" Voyager thinking only of its users. Adding on top of that his desire on helping other troubled exchanges and so on he wants probably to portray himself either as a crypto messiah or at least a copy of JP Morgan.But of course, in his ideal world where everything runs smoothly, we would need some adjustments and you can get an idea of those from the first paragraphs to the last:https://www.ftxpolicy.com/posts/possible-digital-asset-industry-standardsQuoteHacks are extremely destructive to the digital asset ecosystem.They have been all too prevalent and large.  At the same time, the industry has done a decent job of identifying and flagging addresses carrying funds from a security breach, and so even if the funds are gone, the hacker may not actually be able to utilize most of them.We should formalize this, with major trusted parties adding addresses associated with security breaches to their public list of suspicious addresses. Thus, both centralized and decentralized protocols will be able to promptly freeze out the associated addresses.QuoteSanctions, allowlists, and blocklists‍In order for commerce to work, it’s crucial that validators and smart contracts are free, permissionless, and decentralized. There are many cases, though, where many asset senders and centralized intermediaries will want or need to maintain and/or respect various address blocks: either because of hacks, scams, or sanctions.‍I fundamentally believe that blocklists – not allowlists – are the correct approach to sanctions compliance on blockchain environments. The possible options for those sending assets or acting as centralized intermediaries are to either:Allow all transfersBan transfers between sanctioned parties (i.e., declare these transfers illegal and hold violators liable) but otherwise presumptively allow other peer to peer transfersBan all transfers unless specifically allowlisted by an institutionOf course, this is just one of the many tips of the icebergs flotilla he has unleashed, for him seems like harmony can be achieved by, guess what, centralized coins, clear predefined protocols where percentage rule (I have a Terra flashback here) can solve everything without bothering anyone, and it's all about his care for the normal user that might be scammed or lose money, not about his own greed for power.Now, I'm pretty sure that his sudden need for law regulation customer protection has started with the FCA poking around FTX and probably others in different countries especially the US looking more carefully at the way FTX is doing business but still, for him to go that fast in this direction highlight again, at least for me why we must never and never name any kind of leader or head figure or promote someone to this kind of virtual position, I think I don't even need to add that a politician would be the last person needed to be branded as such a savior.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418422",
  "comments": [
    {
      "author": "NeuroticFish",
      "created_time": "October 26, 2022, 03:26:15 PM",
      "body": "Quote from: stompix on October 26, 2022, 03:14:56 PMhe wants probably to portray himself either as a crypto messiahMaybe some newbies and altcoiners can see him that way, but he's just another businessman who has felt the potential of crypto industry and started a business in this ecosystem. Nothing else. Not a believer, not a messiah, nothing. It's all about money. Fiat money.\"Saving\" those businesses means more businesses to earn from, means more customers he can get fees from. It happens in all kind of industries, not only in crypto.So anybody seeing him more than he is... should at least wake up (and make sure he doesn't lose money because of doing things while dreaming).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "October 26, 2022, 03:37:11 PM",
      "body": "I follow Sam work during his FTX is not that huge same with Solana since I’m one of the pioneer investor of Serum Project one of Sam greatest idea for a decentralized leverage trading on DEX. He is more focus on development side rather than spouting this ideology. I’m surprised that he was already blinded by power due to the success of his centralized exchange and blockchain(Solana). I never thought that he will become a sort of crypto politician since he is not interested on money before and focus on development side.He once announced that he will donate his wealth to a foundation that’s why I became a fan before. I was so disappointed that he became like this after all his hardwork on developing a very good exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "October 27, 2022, 10:54:34 AM",
      "body": "To me, all these CEX CEOs are more or less the same, although each of them has their own idea that they are trying to push through, using Bitcoin as a kind of link between that idea and the users of their platforms. It is true that they have already become rich to the extent that they can now swim very carefree and pretend to be some kind of savior of all those who are drowning around them.The real truth is that they don't care about decentralization and Bitcoin, and that their goal is to survive on the market at any cost. I don't have to bother too much with the answer to the question of what would happen if they received an official request from the authorities to remove Bitcoin from their platforms.I have written many times that they are not such a problem, but the real problem is that people blindly trust and appreciate them for some very strange reasons. All those who say that they will give their wealth to some foundations are especially suspicious to me, because that money does not contribute to the betterment of humanity anyway, but individuals who will use it to play some new saviors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "October 27, 2022, 11:10:47 AM",
      "body": "Despite other people's perceptions of Sam, I think he's been helping people who really don't have much money to provide transaction fees. For a small user like me, the Exchange he provides is very helpful. For the past few days, I have been actively exchanging some small coins for the sake of expenses. It's true that talking about business is still business, but there is a lightning effect we can take advantage of when all exchanges charge withdrawal fees. I think being smart about saving on transaction fees, FTX is my go-to so far.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Daltonik",
      "created_time": "October 27, 2022, 01:14:15 PM",
      "body": "Sam Bankman has been really flashing in almost every news lately that concerns crypto finance, participation in the auction for the assets of the bankrupt Celcius, victory in the auction for the assets of Voyager Digital, all because he can afford it. However, I would not perceive him as a crypto evangelist, all he does is ultimately have the goal of making a profit and in the end to keep this profit, judging by his statements, he will promote strict centralization.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DooMAD",
      "created_time": "October 27, 2022, 05:15:57 PM",
      "body": "The \"easy\" reaction is that the people who run these centralised intermediaries have a dangerous mindset when it comes to blacklisting and that their views are diametrically opposed to the values we hold dear.  But at the end of the day, that doesn't cut it.  Ultimately, these people are free to run their business however they please.  So, aside from not utilising their services, there's sweet-eff-all we can do about it.  The more difficult realisation to accept is that the onus is upon us to devise a better alternative if we can't abide by their obsession with blacklists.  It's our responsibility to develop technologies which can perform the same function as these intermediaries, but in a decentralised fashion, so that it is immune to regulatory takedown.  That's the only way in which this problem gets resolved to our satisfaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "October 27, 2022, 06:06:22 PM",
      "body": "Quote from: DooMAD on October 27, 2022, 05:15:57 PMUltimately, these people are free to run their business however they please.  So, aside from not utilising their services, there's sweet-eff-all we can do about it.  Of course, they are free to do so, if Mara wants to censor all the blocks they mine, it's their choice, if Bitpay wants full KYC, proof of Funds, pictures of all your family and former lovers, and a fresh sperm sample every 6 months, they can ask and see how they go bankrupt...or not!What I dislike is that for a few pennies or for the hope of seeing their investment go up by 10% some will abandon every single ounce of the reason they have, they will trash their moral principles, will start clapping, and even attack everyone who doesn't bow down and pray to the newly found god turning against any sane idea from the community, throwing away liberty and becoming a pet dog for a few coins. I've seen this with Bukele, have the courage to question his actions, his numbers his past projects, you'll be labeled as a traitor, a western propagandist, a banker, and the bigger the mass of those useful brainwashed idiots the easier for them to gain more and more power till at one point you will realize they outnumber you by an order of magnitude. And by that time...it's too late! Quote from: Coin_trader on October 26, 2022, 03:37:11 PMI’m surprised that he was already blinded by power due to the success of his centralized exchange and blockchain(Solana). I never thought that he will become a sort of crypto politician since he is not interested on money before and focus on development side.I'm curious how many more such cases, after seeing so many in the past, like CZ asking for a rollback or blocking wasabi addresses and a ton of others from Silbert to Armstrong do we need to see to stop being surprised by this?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "November 09, 2022, 02:05:37 PM",
      "body": "As a consequence of the collapse of FTX, there is also positive news: \"Bankman-Fried’s priority crypto bill ‘dead’ after FTX sells to Binance\" - https://www.theblock.co/post/184436/bankman-frieds-priority-crypto-bill-dead-after-ftx-sells-to-binance?utm_source=twitter&utm_medium=social Thus, the centralization of the cryptocurrency market has become a few steps further.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "November 09, 2022, 04:12:55 PM",
      "body": "Looks like Binance is starting to regret their decision on propping up FTX. If I had to guess then this is why today is another day of heavy dipping (8%) currently. https://twitter.com/BTC_Archive/status/1590368491659735043I really have no idea why Zhao thought \"rescuing\" was in any way a good idea. If I had to guess then I would say it a was a spur of the moment thing rather than an actual business decision. Now Binance is doing \"Due Dilligence\" or just saying that they are doing DD as an excuse to drop FTX soonish. Talk about shooting yourself in the foot...No doubt that now especially is a bad time to have your Bitcoin (or any crypto) on a CEX. We might see some liquidity caused withdrawal freezing on smaller exchanges soon, if the market keeps crashing at such rates.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "November 09, 2022, 06:30:31 PMLast edit: May 20, 2023, 07:24:55 PM by stompix",
      "body": "Two weeks, and god!!, reading this topic feels weird.I'm so happy I used \"savior\" with commas, I don't have to change it from savior to unsalvageable, not recyclable etc, etc!Or switch to \"“How the mighty have fallen!\" because it fits so well, from the one that had plans to bail out every troubled DeFi and exchange to the one that has to be bailed, from the one talking about regulation to a guy that has definitely played and got in some shady deals behind the scenes.And why stop here with the ironies:The future has proved who has no future...OMG, I could on like this forever!One more, he wanted to save us, but instead of giving us a fish, he took the fish!Quote from: tvplus006 on November 09, 2022, 02:05:37 PMAs a consequence of the collapse of FTX, there is also positive news: \"Bankman-Fried’s priority crypto bill ‘dead’ after FTX sells to Binance\" - https://www.theblock.co/post/184436/bankman-frieds-priority-crypto-bill-dead-after-ftx-sells-to-binance?utm_source=twitter&utm_medium=social Thus, the centralization of the cryptocurrency market has become a few steps further.No, the guy promoting the bill selling to the one that wanted to fork bitcoin to get his coins back is not really a step away from centralization!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "November 09, 2022, 06:42:16 PM",
      "body": "FTX was a company that likes to buy dying businesses and profit from it..the trick is simple..buy a dying company cheap.. take out any \"good\" asset. and then kill off the business that only has bad assets(liabilities) left. where by they hide the good assets in a separate business.eventually when all good assets are hidden completely outside the main company portfolio. then you collapse the whole portfolio. and clear your hands of any liability left. and then retire into a new hustle with the good assets. its standard practice for liquidation companies, im not surprised by the method.. just by the timing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "November 09, 2022, 06:48:26 PM",
      "body": "Smells like Wasabi Wallet in here  The issue with blacklists has been debated dozens of times during the past few months. The takeaway? They're fine in centralized services (if only because regulations make it mandatory for them), but in decentralized territory? Big no-no.Quote from: stompix on November 09, 2022, 06:30:31 PMAnd why stop here with the ironies:Remember that the performance that Bitcoin requires to run properly was only possible because of advancements in computers and the network stack & connections, in the 80s and 90s. So irrespective of the Trilemma, a similar advancement in computing speeds (in particular) will easily levitate the \"decentralization\" leg of it to make Layer 1 immediately capable of verifying and including more transactions at once. And even if L1 doesn't get a move-on, a second layer can be developed to exploit these technological advancements in processing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "November 09, 2022, 07:13:09 PM",
      "body": "I did think it was pretty amazing that this one CEO managed to seemingly sell the top and then buy up distressed assets left and right at the bottom.  It seemed as though he had taken a huge gamble with customer funds and was reaping the reward of his successful sells at the top.  However, now we see that he was just making his own tokens and using them as collateral to pretend to be a market savior.  This is one of the worst things that has ever happened to the crypto market.  It makes you wonder about the smaller exchanges now.  How many of them are insolvent and just trying to buy time until the next run?  Are any funds held on any exchanges safe?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DooMAD",
      "created_time": "November 09, 2022, 11:49:33 PM",
      "body": "Quote from: OgNasty on November 09, 2022, 07:13:09 PMIt makes you wonder about the smaller exchanges now.  How many of them are insolvent and just trying to buy time until the next run?  Are any funds held on any exchanges safe?Why limit yourself to the smaller ones?  Big exchanges can fail just as easily.  The only safe bet is to assume every exchange is insolvent until proven otherwise with a fully independent and transparent audit.  I'm still yet to be convinced that Binance are solvent.  And their latest talk of \"Proof-of-Reserve\" feels like a smokescreen without a \"Proof-of-Liabilities\" to go along with it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "November 09, 2022, 11:59:33 PM",
      "body": "Sam Bankman-Fried is officially bankrupt. From starting the week with a net worth over 15 billion to ending it with nothing, this is truly one of the more spectacular bankruptcies I’ve ever witnessed. The world’s most generous billionaire is now broke. I always thought he came out of nowhere fast and when he started donating to liberal politicians I questioned what sort of businessman he is. Now we know. He was shady as fuck and while liberal politicians got nice donations, his customers lost their ass. Pretty typical. The industry is better off without him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pixie85",
      "created_time": "November 10, 2022, 12:59:05 AMLast edit: November 11, 2022, 12:11:51 AM by pixie85",
      "body": "Quote from: stompix on November 09, 2022, 06:30:31 PMTwo weeks, and god!!, reading this topic feels weird.Ask mods to give you a special title since you saw how much Sam is trying to achieve before the rest of the people who held money on his exchange. If they had only listened... The name of Sam will forever be mentioned alongside such renowned figures like Mark Karpeles, Alexander Vinnik, Gerry Cotten and Do Kwon. Only 12 years and we've got ourselves a hall of fame.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "November 10, 2022, 01:04:17 AM",
      "body": "Quote from: goldkingcoiner on November 09, 2022, 04:12:55 PMI really have no idea why Zhao thought \"rescuing\" was in any way a good idea. If I had to guess then I would say it a was a spur of the moment thing rather than an actual business decision. Now Binance is doing \"Due Dilligence\" or just saying that they are doing DD as an excuse to drop FTX soonish. Talk about shooting yourself in the foot...(.....)I believe that those statements released from the side of Changpeng Zhao (CZ) and Sam Bankman-Fried (SBF) just to let the people don't react really well and will not affect the market immediately and after 24 hours when they released of those statements, the market started to tank. And now, Binance released again that they are not interested anymore on FTX acquistion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "November 10, 2022, 02:41:00 AM",
      "body": "Quote from: pixie85 on November 10, 2022, 12:59:05 AMThe name of Sam will forever be mentioned alongside such renowned figures like Mark Karpeles, Alexander Vinnik, Gerry Cotten and Do Kwon. Only 12 years and we've got ourselves a hall of fame. blameFTFYthough mtgox caused non gox exchanges to blind sheep gox prices down in 2014, as is non ftx blind following FTX down, this is not gonna be the last time an exchange is going to upset the natural price:value balance",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "November 10, 2022, 02:52:24 AM",
      "body": "We might be living our lives in a comedy. We traders and investors in the cryptospace might now have begun to understand that Gary Gensler was really trying to protecting us heehehhe. FTX customers will start demanding for more regulations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}