{
  "id": "topic_5473104",
  "title": "ImThour",
  "author": "ImThour",
  "created_time": "November 06, 2023, 05:03:06 PM",
  "content": "Hi everyone,Bitcoin price is going up, resistances are being converted into supports. I want to share my advice and personal experience with beginners and newbies on this forum and explain what is good for them in the long term. If you are an experienced member/trader, take it lightly.Alright, Newbie, I will start without wasting your time. Bitcoin Trading will never be profitable in the long term as compared to HODL.You will never win or become a millionaire if you decide to take leverage, use Future Trading, or even Spot Trading. You can never catch every move perfectly.If you are new and making a profit, that's called beginner's luck. That doesn't mean shit and no, you do not LEAVE your job to become a full-time trader.Always collect Bitcoin, Spend at least 20% of your savings on collecting sats.And once again, Leverage is your biggest enemy. Even 2x leverage is dangerous.Bitcoin Halving is approaching, I would suggest all of you focus on buying more, avoiding selling, as these prices will never come in the future.All the best! <3",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473104",
  "comments": [
    {
      "author": "Odohu",
      "created_time": "November 06, 2023, 05:23:07 PM",
      "body": "Quote from: ImThour on November 06, 2023, 05:03:06 PMHi everyone,Bitcoin price is going up,  are being converted into supports. I want to share my advice and personal experience with beginners and newbies on this forum and explain what is good for them in the long term. If you are an experienced member/trader, take it lightly.Alright, Newbie, I will start without wasting your time. Bitcoin Trading will never be profitable in the long term as compared to HODL.You will never win or become a millionaire if you decide to take leverage, use Future Trading, or even Spot Trading. You can never catch every move perfectly.If you are new and making a profit, that's called beginner's luck. That doesn't mean shit and no, you do not LEAVE your job to become a full-time trader.Always collect Bitcoin, Spend at least 20% of your savings on collecting sats.And once again, Leverage is your biggest enemy. Even 2x leverage is dangerous.Bitcoin Halving is approaching, I would suggest all of you focus on buying more, avoiding selling, as these prices will never come in the future.All the best! <3Thank you for stressing the need to buy and hold Bitcoin now. I just commented about this in our local board urging them to use this time to invest wisely in Bitcoin. I guess we are thinking in the same direction. The coming years hold so much promises for those who embraced this amazing technology and actually make effort to hold. It will be somehow divastating for anyone not to have some Bitcoin when the price finally explodes to a high they never thought could be possible. I love the conservative number of 20% you suggested to be invested in Bitcoin. We should be able to leave our normal lives after committing 20% of our capital into Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Peanutswar",
      "created_time": "November 10, 2023, 02:48:30 PM",
      "body": "From the last era of ATH, people have always been active in the market they are oveehwljing with the profit they made and every price action of the market but after those times they are now quiet because you didn't see people keep posting with their profits because they are waiting for the opportunity or else they ignore the bitcoin yet because it's not profitable right now due to some circumstance and market sideways.Your profit is not yet considered as profit unless you made a withdrawal of your position or sold your asset still it's an unrealized profit or loss. Make a plan and strategy how you will gain profit again for the upcoming halving like you will hold for a long term again or ride with the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ruttoshi",
      "created_time": "November 10, 2023, 03:01:49 PM",
      "body": "You are very correct OP, trading is like chasing peanuts when there is a bigger profit ahead of you, if only you could be patient and hodli your bitcoin. At this time like OP said, is a time for us to buy keep on stashing our bitcoin portfolio through DCA and wait till the bull run, instead of thinking on how to sell now and miss out in the bull run. Don't make decisions that will bring regrets in the nearest future.Don't be deceived that you can use trading to increase your bitcoin because, you will end up losing it. Hodli is the road to success in your bitcoin journey as a beginner and even an old bitcoiner. Just see bitcoin as a normal investment that needs time to grow so that the profit will accumulate with the timeline of the investment and the size of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "November 10, 2023, 03:18:22 PM",
      "body": "A very good advice by Op but the irony of the matter is, newbies will always make the newbie mistakes, no matter how you advise or preach. Infact, there are hundreds of newbies who are yet to join the bitcoin bandwagon, they are patiently waiting for the bull run period when the price of bitcoin will be above $50k. By then, they will buy at once and hold, they won't know when to sell and the market will dump on them, by then bitcoin will become a scam to them. They will sell at lose and never return till another bull run happens.As for newbie day traders, I was a victim. I learnt trading hastily during the last bull run, and due to the price movements, I was always on profits and I thought I had learnt how to trade. Not until the bear market came and many coins dumped on me. If you don't know how to trade, don't bother, just HODL.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "November 10, 2023, 03:21:00 PM",
      "body": "Quote from: ImThour on November 06, 2023, 05:03:06 PMAnd once again, Leverage is your biggest enemy. Even 2x leverage is dangerous.I will so say this in addition that what's the essence of taking a leverage position that one will be regretting later when things doesn't work as we thought, isn't holding not good enough to have patience with till another circle unfolds for the bitcoin market pump as we expect from next year halving, those that have been a long time holders will realizes what they least expect as a profit during this period than hastily taking a leverage position together with the risk involved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "November 10, 2023, 03:22:13 PM",
      "body": "I didn't get my first timer luck and I lost about 200$ to 300$ in my first bitcoin trade and since that day I have not traded because the way I lost the funds a surprise to me till now. Within a trickle of an eyes I lost the funds and empty the trading account and I abandoned the account till now. Trading is for instant earning of money and it is not good for long term. Anything long term should go to an investment and instant earning should go to trading but before then you to master the app and the skills of trading if not you will just dash them your money. And also in the hodling process, you have to k ow that you must patient enough to read what you sow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "November 10, 2023, 03:31:28 PM",
      "body": "Yea this is definitely one of those times where people get a bit too greedy and try to ramp up leverage — ending up getting liquidated by temporary dumps.This is the season to just sit on your hands and wait, ladies and gentlemen. If you really want to trade just to scratch the itch, play with 1% of your total portfolio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "November 10, 2023, 04:39:12 PM",
      "body": "Quote from: Dunamisx on November 10, 2023, 03:21:00 PMQuote from: ImThour on November 06, 2023, 05:03:06 PMAnd once again, Leverage is your biggest enemy. Even 2x leverage is dangerous.I will so say this in addition that what's the essence of taking a leverage position that one will be regretting later when things doesn't work as we thought, isn't holding not good enough to have patience with till another circle unfolds for the bitcoin market pump as we expect from next year halving, those that have been a long time holders will realizes what they least expect as a profit during this period than hastily taking a leverage position together with the risk involved. Leverage is not at all recommended for the longer trades, consider a scenario in which the market is moving sideways and the funding rate is against your trade it really sucks, I use to analyze the market from all potential perspectives but I'm not a leveraged trader. Also, I use to recommend my fellows and the new ones to never even think about the leverage because in my view when you are trading the portfolio/capital is your wicket and when you play for a long game the wicket plays an important role because a journey cant be flat but when you are holding the wicket you can make good total score and if you play recklessly without caring about the wicket the outcome won't be promising and that will be what we call full destruction and depressed senrio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "November 10, 2023, 06:37:16 PM",
      "body": "Quote from: ImThour on November 06, 2023, 05:03:06 PMAlright, Newbie, I will start without wasting your time. Bitcoin Trading will never be profitable in the long term as compared to HODL.This is quite harsh to say and a newbie trader will take it to mean that you are discouraging them entirely from trading when you are actually giving them a warning that is borne from experience. New people to bitcoins should not only think that they will be able to profit from trading bitcoins, holding bitcoins is also very profitable. Most newbies to bitcoins have a better chance to profit from just buying bitcoins and holding it than try to try out trading bitcoins on a trading platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "November 10, 2023, 07:06:01 PM",
      "body": "Quote from: ImThour on November 06, 2023, 05:03:06 PMAlright, Newbie, I will start without wasting your time. Bitcoin Trading will never be profitable in the long term as compared to HODL.You will never win or become a millionaire if you decide to take leverage, use Future Trading, or even Spot Trading. You can never catch every move perfectly.Trying to be smart with short-term investing to achieve good returns and then using it to buy more Bitcoin seems like a bright and amazing idea, but implementing it is the problem. Trading may or may not be profitable if you are a specialist and have experience. As for beginners, it is nothing more than luck.There are times when trading may be profitable, such as the year 2026, when the price fluctuates downward until it reaches the bottom.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Essential10",
      "created_time": "November 10, 2023, 07:18:32 PM",
      "body": "Quote from: ImThour on November 06, 2023, 05:03:06 PMHi everyone,Bitcoin price is going up, resistances are being converted into supports. I want to share my advice and personal experience with beginners and newbies on this forum and explain what is good for them in the long term. If you are an experienced member/trader, take it lightly.Alright, Newbie, I will start without wasting your time. Bitcoin Trading will never be profitable in the long term as compared to HODL.You will never win or become a millionaire if you decide to take leverage, use Future Trading, or even Spot Trading. You can never catch every move perfectly.If you are new and making a profit, that's called beginner's luck. That doesn't mean shit and no, you do not LEAVE your job to become a full-time trader.Always collect Bitcoin, Spend at least 20% of your savings on collecting sats.And once again, Leverage is your biggest enemy. Even 2x leverage is dangerous.Bitcoin Halving is approaching, I would suggest all of you focus on buying more, avoiding selling, as these prices will never come in the future.All the best! <3Bitcoin price is increasing day by day. The Bitcoin future is in for a surprise. Trading is always high risk, long term trading can be a risky move. HOLD in long term is the best way to get profitable money in future. Future trading or spot trading is like gambling to me. Instant millionaire and instantly sitting on the road. Bitcoin is the best option in the crypto world. Bitcoin is such a strong cryptocurrency, it has a missing value collection method and is tolerant of intrusions. Bitcoin halving is scheduled to happen in April next year so everyone should accumulate more bitcoins which will lead to a unique high in the future. Bitcoin market value crossed $37k today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "November 10, 2023, 08:01:43 PM",
      "body": "Quote from: Ruttoshi on November 10, 2023, 03:01:49 PMYou are very correct OP, trading is like chasing peanuts when there is a bigger profit ahead of you, if only you could be patient and hodli your bitcoin. At this time like OP said, is a time for us to buy keep on stashing our bitcoin portfolio through DCA and wait till the bull run, instead of thinking on how to sell now and miss out in the bull run. Don't make decisions that will bring regrets in the nearest future.Don't be deceived that you can use trading to increase your bitcoin because, you will end up losing it. Hodli is the road to success in your bitcoin journey as a beginner and even an old bitcoiner. Just see bitcoin as a normal investment that needs time to grow so that the profit will accumulate with the timeline of the investment and the size of it.Indeed is like chasing peanut and also with the possibility of actually losing some of your capital in the course of doing this and that's why it's not advisable at all especially for newbie that are not well structured in this field of trading. I would always advice to go for a long term investment but although the fact is there that many people are lacking the patience and perseverance to actually do the HODL game so instead they tend to go for trading in order to add to their portfolio which is of very risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "November 10, 2023, 08:20:44 PM",
      "body": "Quote from: ImThour on November 06, 2023, 05:03:06 PM...Bitcoin Halving is approaching, I would suggest all of you focus on buying more, avoiding selling, as these prices will never come in the future.How can you be so sure that there will no longer be such a price for Bitcoin? Or do you have a crystal ball? This is a cryptocurrency market and, accordingly, anything can happen here. Therefore, it should not be surprising that after a certain time, a dump of Bitcoin and the entire market may follow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bhadz",
      "created_time": "November 10, 2023, 11:42:34 PM",
      "body": "Quote from: ImThour on November 06, 2023, 05:03:06 PMIf you are new and making a profit, that's called beginner's luck. That doesn't mean shit and no, you do not LEAVE your job to become a full-time trader.Always collect Bitcoin, Spend at least 20% of your savings on collecting sats.Someone has to say this for those beginners to realize that it's okay to trade but what's supreme? HOLDING. I have been seeing people trying to find jobs and having a hard find doing it and when they see success stories of traders that are flaunted on social media, they are quick to say; \"Okay, then I'll just be a trader\".LOL, as if that's easy to happen, and by the way they're saying it. They do not recognize that every job is hard, and every source of income is hard except those who are doing it easily by fooling people.  It's like trading or being a trader is a no-brainer choice for them. HODL and you'll see why everyone is telling this and it is timely, you'll undestand newbies why.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "November 11, 2023, 02:20:07 AM",
      "body": "Quote from: ImThour on November 06, 2023, 05:03:06 PMBitcoin Trading will never be profitable in the long term as compared to HODL.You will never win or become a millionaire if you decide to take leverage, use Future Trading, or even Spot Trading. You can never catch every move perfectly.It's hard to win against the market and market makers. Very scarce people can be winners in the market with trading but if you can hodl a good asset with good fundamentals like Bitcoin, you are a true investor and choose a right asset for investment, so with time, you will have profit.(SSS) - A Sane and Simple bitcoin Savings planInvestment with Dollar Cost Averaging is good and I know two websites that are helpful for simulation of DCA investment.https://costavg.com/https://dcabtc.com/DCA can be applied for entries and exist like the above topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "November 11, 2023, 03:45:24 AM",
      "body": "What surprises me about the OP is that he tends to do quite a bit of technical analysis, so I understand that he does some trading. Completely agree with what he says, in general trading is profitable only for a small percentage of traders with great knowledge, which you will not hear all those who insist on promoting it, and adding leverage is exponentially multiplying the chances of bankruptcy. I agree with the message and I have said the same in similar threads of newbies asking about trading techniques and such: you would do better to use that money in buy and hold Bitcoin, what happens is that it is not so fancy and it is more boring.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Patrol69",
      "created_time": "November 11, 2023, 04:19:11 AM",
      "body": "Investing and trading is somewhat risky for every new investor or trader. Initially, an investor or trader does not have a complete understanding of these issues, due to which newbies make more mistakes in investing and trading. In the first instance new members need to get training and practical idea about investment first. Beginners need to use small amount of money first to get real idea. When they can get a fairly realistic idea of trading and investing with a small amount of money, they can start their main investment or trading. But in the beginning if one goes for direct investment or trading then they will not be able to do any good from their trading. So every trader and investor should get enough ideas and practical experience in the beginning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shamm",
      "created_time": "November 11, 2023, 04:36:13 AM",
      "body": "Quote from: bhadz on November 10, 2023, 11:42:34 PMQuote from: ImThour on November 06, 2023, 05:03:06 PMIf you are new and making a profit, that's called beginner's luck. That doesn't mean shit and no, you do not LEAVE your job to become a full-time trader.Always collect Bitcoin, Spend at least 20% of your savings on collecting sats.Someone has to say this for those beginners to realize that it's okay to trade but what's supreme? HOLDING. I have been seeing people trying to find jobs and having a hard find doing it and when they see success stories of traders that are flaunted on social media, they are quick to say; \"Okay, then I'll just be a trader\".LOL, as if that's easy to happen, and by the way they're saying it. They do not recognize that every job is hard, and every source of income is hard except those who are doing it easily by fooling people.  It's like trading or being a trader is a no-brainer choice for them. HODL and you'll see why everyone is telling this and it is timely, you'll undestand newbies why.That is the big mistakes for a newbie cause when they heard a testimony of those influencers that they earn a lot of money through trading then those newbie who are greed to be rich then they will try without thinking the possible outcome and that is the reason why other newbies fall in to a trap and loss thier Money. So being a newbie in investment is too hard we need to study first before we engage in it. Anyways Holding a coin right now is a good idea cause in the near future we can get profit for sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AprilioMP",
      "created_time": "November 11, 2023, 05:12:33 AM",
      "body": "Quote from: ImThour on November 06, 2023, 05:03:06 PMAlright, Newbie, I will start without wasting your time. Bitcoin Trading will never be profitable in the long term as compared to HODL.You will never win or become a millionaire if you decide to take leverage, use Future Trading, or even Spot Trading. You can never catch every move perfectly.If you are new and making a profit, that's called beginner's luck. That doesn't mean shit and no, you do not LEAVE your job to become a full-time trader.Always collect Bitcoin, Spend at least 20% of your savings on collecting sats.Useful advice before trading to look great in the environment of being a trader.The intention to experiment with trading was still there, but stopped because I was not brave enough to accept the risk even though an account on one of the well-known exchanges had been registered but I had never used it after completing the KYC process.Enjoying every process that occurs with hold is an activity that I am currently doing while trying to study price charts and compare them with various events that have occurred that have caused prices to rise. Having never experienced Bitcoin's price reaching its highest, maybe my goal now is to experience Bitcoin reaching its highest price.If I trade the Bitcoin that I currently have, two options will occur to me. The first option, I will make a profit, but that is just my luck. The second option, I let my Bitcoin decrease and cannot make a profit when Bitcoin reaches its highest price even though if I trade at the current price it is already profitable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}