{
  "id": "topic_5407880",
  "title": "StanCrypt",
  "author": "StanCrypt",
  "created_time": "July 28, 2022, 06:33:03 AM",
  "content": "For the three months ended in June, Meta (FB), the parent company of Facebook, reported sales of $28.8 billion, a 1% decrease from the corresponding quarter in the prior year and its first year-over-year revenue reduction since going public in 2012.The company's profit decreased even further. A significant contrast to the previous year, when its earnings more than doubled, was the net income for the quarter, which fell 36% year over year to close to $6.7 billion. The average price per ad dropped by 14 percent year over year according to Meta, which is concerning given the weakening demand for internet advertising brought on by the recent economic crisis.According to a Reuters article, Zuckerberg told staff in a Q&A that \"this might be one of the biggest downturns that we've seen in recent history\" when he announced earlier this month that the business will reduce plans to hire engineers by at least 30% this year. The company said in its earnings release on Wednesday that it had \"continued to concentrate resources toward our company priorities while reducing our recruiting and total spending growth expectations this year to account for the more challenging operating environment.\"Following the earnings report, Investing.com  senior analyst Jesse Cohen wrote in an investor note that \"the social media company faces several challenges in the months ahead, primarily a slowdown in revenue growth due to reduced ad spending, as well as a lack of innovation and introduction of new user-friendly features.\" Investors \"need to worry about the negative impact of prospective regulatory moves by the U.S. government,\" according to Cohen, in addition to the other factors.Also, on the call, Zuckerberg also discussed the company's decision to increase the proportion of suggested posts that Facebook and Instagram users see in their feeds as opposed to posts from accounts they follow. Zuckerberg has described this as turning the company into a \"discovery engine.\" This week, when a post urging users to \"Make Instagram Instagram again\" went viral and was reposted by Kim Kardashian and Kylie Jenner, user backlash to such changes on Instagram reached a fever pitch.https://edition.cnn.com/2022/07/27/tech/meta-q2-earnings/index.htmlHow does mark plan to maintain Mata as a social media platform and a search engine all at the same time?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407880",
  "comments": [
    {
      "author": "sunsilk",
      "created_time": "July 28, 2022, 10:21:08 AM",
      "body": "The reduction of hiring new engineers is a big sum with that 30% for this year and we can say that there's an impact from the current global recession that we're experiencing since Meta has that decrease of 1% which is already big to consider for such companies.I thought that companies like Meta are exempted from the global crisis including the pandemic that we're experiencing since they're tech companies. But it seems that it's not just the timing but they really are facing challenges that would impact the whole thing.Isn't it that they also have that plans about NFT related stuff?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "StanCrypt",
      "created_time": "July 28, 2022, 11:01:13 AMLast edit: July 28, 2022, 11:18:33 AM by StanCrypt",
      "body": "Quote from: sunsilk on July 28, 2022, 10:21:08 AMIsn't it that they also have that plans about NFT related stuff?That's right, Meta is also considering developing a market place where NFTs may be bought and sold. Millions of NFT aficionados who use social media may be excited by the news, but all of the projects are still in their early stages and may change as a result.The truth is that Potential earnings in the NFT sector are become increasingly difficult to ignore. Even conventional brands are expected to enter the NFT sector and look into ways to profit there, according to businesses. Its really not surprising that Leading NFT marketplace Open Sea just exceeded the $3.5 billion barrier for monthly transaction volume, and this only indicates that simply within the platform, NFT trading costs more than $169 million each day. NFT market sales tracking data also indicates that there have been $25 billion in total sales to date.https://cointelegraph.com/news/meta-reportedly-plans-to-integrate-nfts-on-facebook-and-instagram-profilesI actually think this plan is a better one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheNineClub",
      "created_time": "July 28, 2022, 02:51:25 PM",
      "body": "Quote from: StanCrypt on July 28, 2022, 06:33:03 AMHow does mark plan to maintain Mata as a social media platform and a search engine all at the same time?Yeah, it can't be everything at once, that's why it ended up being nothing. It doesn't seem that the team from FB had a clear goal for this (I could be wrong tho), but rather to take advantage of the situation and be the first in a space that had pretty low to no competition. And kinda thought they would find their way and concept along the way. It seems they were so sure of their idea that they thought that would be enough for now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "July 28, 2022, 03:05:21 PM",
      "body": "Quote from: StanCrypt on July 28, 2022, 06:33:03 AMFor the three months ended in June, Meta (FB), the parent company of Facebook, reported sales of $28.8 billion, a 1% decrease from the corresponding quarter in the prior year and its first year-over-year revenue reduction since going public in 2012.The company's profit decreased even further. A significant contrast to the previous year, when its earnings more than doubled, was the net income for the quarter, which fell 36% year over year to close to $6.7 billion. It's connected to Trump & Russia issues which it judged poorly. Poor judgment =  sign of getting de-ranked or demoted in human affairs.. . Only a few understand this. Justice is constantly served from above , whether humans judge right or not.When you realize we are being watched by Higher Beings (not aliens) who own this world, like people watch television you will never remain thesame.A big sign you were demoted = Your power to control things is diminished",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 28, 2022, 08:44:52 PMLast edit: July 28, 2022, 08:57:46 PM by franky1",
      "body": "QuoteFor the three months ended in June, Meta (FB), the parent company of Facebook, reported sales of $28.8 billion, a 1% decrease from the corresponding quarter in the prior year and its first year-over-year revenue reduction since going public in 2012.the financials of meta(FB) are not important. nothing in any market can be in a constant smooth pattern of linear or exponential rise. there are always ups and downsfirst rule of economics. never ever expect. hope, wish for a up, up up, up up. expect some downs. and dont be surprised by themduring a recession many product based companies will be not only evaluating its spending on employees, office space and products, but its advertising budget. and yes these reductions in advertising budget end up hitting the revenue income of meta(fb) and google. so there should be no surprise in this. its just part of the normal business cycle of a downturn. companies do and will reduce their advertising budgets and this does and will affect tech companies highly funded by advertising revenue. so dont be shocked that tech(online(no brick and mortar) companies get affected tooQuote\"the social media company faces several challenges in the months ahead, primarily a slowdown in revenue growth due to reduced ad spending, as well as a lack of innovation and introduction of new user-friendly features.\" Investors \"need to worry about the negative impact of prospective regulatory moves by the U.S. government,\" according to Cohen, in addition to the other factors.as for meta(fb) trying to move into the similarly named 'metaverse' to start a new platform of revenue stream thats not as direct advertising revenue as selling adspace. . they are approaching this both slowly and from the wrong directionlets look at the NFT stuffin ancient history art was just sold/commissioned and the recipient kept if for utility/sentiment. it took time for those art pieces to develop value from a sentiment/utility point first and then a rarity demand point later. and even then they were not put on central markets/auctions. but sold between the wealthy in private OTC style hand-overshowever NFT went backwards. nonsense art of no sentiment/utility pushed onto a market/auction. trying to find value via the market rather the the sentiment/utility first.the other thing is the power of what could be possible via NFT is not being utilised properly and many missed oppertunitys to become 'first leader' have passed some companies by. to which some are playing catch upimagine you own a server that is capable of managing 1,000,000 visitors at a time. you work out a yearly cost to run it. and then what you would do is break that down to a monthly cost. whereby you would set a price.you would section it off into 'zones' (ingame play rooms) where users can rent/lease or outright buy said server space(playroom). and have it entrusted into a ledger the proves the ownership where the ledger reference links the user to the ledger to the server code of the server space. now here is the thing.the idea was/is to first develop proper designed 'landscapes' to show the space available in 3d view of what 'land'(server space) is available for sale/rent/lease, but also offer proper architecture tools for users to build online webstores in the server space. where certain servers became 'shopping malls'. or real estate neighbourhood developments.  where the users can then with their rented space and built 'shopping mall'(3d webstore), offer 'store shelving space' and wall advertising space to not only sell goods(real world physically then dropped shipped to peoples real homes) displayed in the webstore, but get better deals on the wholesale price of dropshipped goods displayed, via by production location priority/product placement and such within the mall spacehowever by meta(FB) just wanting to sell server space. they did not concentrate much on the 3d design and tools to build online properties on/within. instead they done cartoony animation style childish stuff.. and as such they are not ahead of the curve in respect of NFT possibilities. becasue no one wants to buy childish 'zones' if they want to start a real professional businessinstead its just become a gimmick of purchasing server space in a visual world that just no longer looks like a white page webbrower index.html file. ..rather than building actual cities and landscapes to then build and sell professional grown up online city space such as webstores and shopping malls and such, which is where the real money isQuoteHow does mark plan to maintain Mata as a social media platform and a search engine all at the same time?he isnt making a search engine.he is calling some tweaks to the display of posts, feeds, adverts, followers a \"discovery engine\"it is basically saying that his algo will more intensely review what you click on, look at, and write in their platforms. and then advertise more suggested posts that fit your pleasures/interests more so than let you just see what your friends are upto. its not a case of you typing into a search box. its more of just plastering the platform page with things it thinks you would like to see that you may not exactly have seen before but are in your interest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "July 28, 2022, 11:57:58 PM",
      "body": "Quote from: StanCrypt on July 28, 2022, 06:33:03 AMHow does mark plan to maintain Mata as a social media platform and a search engine all at the same time?You forgot the meta virtual world. And that's not even their final form.  I think facebook (meta) is failing to align their business model with their strengths. Search engines have spiders and crawlers which visit most websites and index the data accordingly to make it searchable for end users. I think this is where their focus of search engines should be. Capitalizing on that capability. To deliver better targeted content to users. Rather than give them what they're searching. Serve up content they didn't know they wanted. In that the crawling and spider capability of search engines is underutilized.1% loss on revenue is better than expected performance from facebook. Mark Zuckenberg may be better at his job than he's been given credit for being. There have been past years when AMD and other tech laid off a good percentage of their engineering force. Its a recoverable trend. Hopefully, it will pass and be replaced by more positive trends in the future.Many corporations have billions in capital. Maybe they can re-allocate to growing food and becoming farmers if the price of food continues to rise. There would have to be expanding profit margins in the industry, they could leverage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}