{
  "id": "topic_5465952",
  "title": "Alexey1984",
  "author": "Alexey1984",
  "created_time": "September 07, 2023, 07:35:38 AM",
  "content": "At the end of 2021, a provider of staking and liquid pools XBANKING appeared on the market (you can easily find it in google or yandex).XBANKING supports staking and liquid pools of 58 tokens, including: eth, dot, atom, near, dot, ksm, ton,sol, apt, mina, arb, avax, icp, flow, op, matic, ftm, atom and many others.At the moment XBANKING is the largest provider of staking and liquid pools by the number of supported tokens (58), wallets (38), networks (23).Partners include: allnodes, bybit, alchemy, everstake, stakin, BrigeTower, HashQuark and many others.Main differences from regular staking:- No locking of tokens, after the end of the staking period- APR is used, compound interest is included in the rate.- Average interest rates are higher than others.- minimal commission.Staking is passive income if you are not going to sell your tokens anytime soon.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465952",
  "comments": [
    {
      "author": "FP91G",
      "created_time": "September 07, 2023, 02:06:33 PM",
      "body": "I've seen some discussion from other users about staking and it's not a win-win investment. If you transfer your tokens to another pool, then in addition to rewards for staking, the pool also pays fines for the fact that the pool was not connected to the network or other issues. And mining gives more profit per year than staking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fmz89",
      "created_time": "September 08, 2023, 12:45:22 PM",
      "body": "Quote from: Alexey1984 on September 07, 2023, 07:35:38 AMAt the end of 2021, a provider of staking and liquid pools XBANKING appeared on the market (you can easily find it in google or yandex).XBANKING supports staking and liquid pools of 58 tokens, including: eth, dot, atom, near, dot, ksm, ton,sol, apt, mina, arb, avax, icp, flow, op, matic, ftm, atom and many others.At the moment XBANKING is the largest provider of staking and liquid pools by the number of supported tokens (58), wallets (38), networks (23).Partners include: allnodes, bybit, alchemy, everstake, stakin, BrigeTower, HashQuark and many others.Main differences from regular staking:- No locking of tokens, after the end of the staking period- APR is used, compound interest is included in the rate.- Average interest rates are higher than others.- minimal commission.Staking is passive income if you are not going to sell your tokens anytime soon.yeah if your holding your coin better your stake on your pc/raspberry, even this only native staking that only support by each coin with different method and requirementto be honest putting your big money  only for small profit with high risk is no go for me, dunno why people love doing this, the rate even not much different from bank deposito  look out to many kinda this thing go bankrupt or hacked (drama/real). and on bear market even riskier",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}