{
  "id": "topic_5477151",
  "title": "sokani",
  "author": "sokani",
  "created_time": "December 09, 2023, 10:18:59 AM",
  "content": "Yes, that's it, as an investor would you pay such an amount to automatically become an El Salvadorian citizen? According to the news on various news site, El Salvadorian government has partnered with Tether to launch a program tagged \"Adopting El Salvador Freedom Visa Program.” Applicants are required to pay a non refundable $999 fee in BTC or USDT, if the application is successful, they'd be required to undergo KYC and a $1M dollar deposit in BTC or USDT to secure a freedom visa and citizenship.QuoteThe new program is primarily focused on enabling participants to play a role in co-creating a future that will set new benchmarks in culture, safety, technology, and societal progress. By participating in establishing El Salvador as a dynamic global center for cutting-edge technology and financial innovation, individuals become integral partners in steering a nation toward exceptional growth and evolution and offer a path to obtain a Salvadoran Passport.Share your thoughts, would you do this if you've a very deep pocket?https://tether.to/en/tether-powers-el-salvadors-visionary-freedom-visa-program-through-technology-support/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477151",
  "comments": [
    {
      "author": "Cantsay",
      "created_time": "December 09, 2023, 10:26:17 AM",
      "body": "I just converted the money to my local currency and mhen that’s no joke… But since you mentioned the person having a deep pocket then I’d be down with it, if I had 10,000x of that amount or an amount that won’t make me notice that I spent such an amount on a ticket & a visa then what’s stopping me from not enjoying a country that has adopted a system of decentralization as a payment method. And that goes for several users here, if they all had a good amount of money in their pocket they’ll still want to experience it, unless they have a place they had dreamt of going to all their life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "December 09, 2023, 10:29:45 AM",
      "body": "Quote from: sokani on December 09, 2023, 10:18:59 AMShare your thoughts, would you do this if you've a very deep pocket?No. Not at all.If I'd be rich I could easily go to better countries than El Salvador - maybe not so nice weather, but for example much better schools, roads and medical system.Even if I'd pe much poorer than \"very deep pockets\" (but still not poor), there are much cheaper ways to get El Salvador citizenship (I've seen on twitter even ideas to get married there, lol).However, El Salvador is not in my top10 countries I would want to be citizen of, and this pretty much sums it up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "December 09, 2023, 10:33:18 AM",
      "body": "Is there some financial benefit that comes with that citizenship? Because that amount alone is big enough to set someone up for life in any country of his choice. There must be some benefit to having such an offer because it's not a small amount of money, and that offer is not even for the common people. If there is more to be achieved when you are a citizen of that country, then many investors will take that offer, as they can rest assured that with time they will make more than that with the opportunity they will get to explore the country. But left to me alone, I can't spend that much just to acquire a citizenship passport or visa. Well, let me just say this is my level of thinking based on my current financial status. If I have more, I will definitely think big, but still, the money is too high. Something between $100 and $500k is a little more considerate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "December 09, 2023, 11:10:28 AM",
      "body": "Like seriously? Do you know many countries are better than this El Salvador? It's not a heaven paradise here on earth, I don't see any reason why anyone should do this, $1M dollars is a lot of money if I convert it into my local currency, I will live like a king in many countries that are better than El Salvador.If it's possible to buy a Plot of land on Satoshis island I would probably do this, but I guess the lands on there are just for rent on time bases, I wish, hehe, mind you, in coming years if things go very well with Bitcoin and crypto I believe that few countries will fully embrace crypto just like El Salvador is doing right now. If I have $1M dollars right now I would invest most of that into Bitcoin and wait for a pleasing cash out by 4th quarter of 2024, or when I see Bitcoin reach over 80k in value, good luck 🎲 .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "December 09, 2023, 11:34:46 AM",
      "body": "Quote from: sokani on December 09, 2023, 10:18:59 AMYes, that's it, as an investor would you pay such an amount to automatically become an El Salvadorian citizen? According to the news on various news site, El Salvadorian government has partnered with Tether to launch a program tagged \"Adopting El Salvador Freedom Visa Program.” Applicants are required to pay a non refundable $999 fee in BTC or USDT, if the application is successful, they'd be required to undergo KYC and a $1M dollar deposit in BTC or USDT to secure a freedom visa and citizenship.QuoteThe new program is primarily focused on enabling participants to play a role in co-creating a future that will set new benchmarks in culture, safety, technology, and societal progress. By participating in establishing El Salvador as a dynamic global center for cutting-edge technology and financial innovation, individuals become integral partners in steering a nation toward exceptional growth and evolution and offer a path to obtain a Salvadoran Passport.Share your thoughts, would you do this if you've a very deep pocket?https://tether.to/en/tether-powers-el-salvadors-visionary-freedom-visa-program-through-technology-support/What benefits they can offer to those people would pay such huge amount of money? If nothing just a passport and citizenship for sure no people will think about paying such huge amount of money. Although they are rank 38 in the world in terms of that still I doubt there's someone will get an interest on what they offer not unless if they want to do some business there. But for people who doesn't give any importance with that for sure they rather create a business out of that huge amount of money rather paying it for things that doesn't make sense at all. If US or Canada offer that maybe I will consider to get that but in other country will I might choose to have a local passport on my country since I can still use it to travel anywhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "December 09, 2023, 12:25:16 PM",
      "body": "Quote from: sokani on December 09, 2023, 10:18:59 AMShare your thoughts, would you do this if you've a very deep pocket?Considering that nowadays we no longer have to deal with finding a way to spend our Bitcoins in almost all countries, my answer would be a big fat \"NO\".- I do know it's mostly being done indirectly, but it still doesn't change the fact that it gets the job done!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "December 09, 2023, 01:48:11 PM",
      "body": "Thats too much. But for rich people likely they will probably do that. El Salvador is a country that is pro crypto and bitcoin and there must be a lot of people wanting to stay there to rip the benefits of the visa and citizenship. Are there any benefits aside from the citizenship? Like some perks of the program of course a big money like this should have benefits too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "December 09, 2023, 02:01:49 PM",
      "body": "I admire El Salvador and its government when its come to this type of development. But, with this program if I'd be willing to pay or deposit $1M in USD or BTC or Tether? Definitely a big no. If I want to get another passport or residency, I'd go into those countries in the Carribbean. They're requiring less than that amount and I think that they've got more powerful visa than El Salvador. Well, that's just me and with that money, I can distribute that to a lot of things that I'd be set probably for a lot of years until I leave this world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EL MOHA",
      "created_time": "December 09, 2023, 02:06:26 PM",
      "body": "Quote from: sokani on December 09, 2023, 10:18:59 AMShare your thoughts, would you do this if you've a very deep pocket?Wow this is too much even as a pro bitcoiner, seriously the amount is too much even for a wealthy fellow, a person with such amount in tons wouldn’t go through this unnoticed. Personally if I have that amount or preferably more than that I will just consider going to one of these places that less economical or let me say middle class countries. El Salvador is just the top country talked about in crypto because of its laws to use bitcoin as a legal tender but it is not the only country that has a relaxed law when it comes to bitcoin and cryptocurrency usage. Even Central Africa Republic can be a place to go not to talk about great places with decent weather. This amount to be a Salvadoran os just too much",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Awaklara",
      "created_time": "December 09, 2023, 02:08:05 PM",
      "body": "even if I had enough money to travel to several countries, why El Salvador? perhaps due to the adoption of Bitcoin there. but with costs like that, of course, even if I were rich I would consider going to another country which might be one of the countries I want to visit. but as for El Salvador, I'm not so sure I'll go there.Everyone will probably have their thoughts, in the media I have read about the changes that have occurred in the country of El Salvador. Maybe there is another attraction to the country besides the Bitcoin they use that makes people interested in going there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "December 09, 2023, 02:15:58 PM",
      "body": "I personally wouldn't, but I mean — it's totally optional. No one is forced to pay this amount and can go the normal way of getting a passport. And if a person has that much amount of money, chances are, he/she has a way of getting a passport anyway so why not try earning money from it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ruttoshi",
      "created_time": "December 09, 2023, 02:23:26 PM",
      "body": "El Salvador citizenship for 1M dollars in btc does not worth it. Instead of my wasting my bitcoin going to such place, I will prefer to sit down in my country and hodli my 1m worth of btc for a very long period of time. Do you know how much profit that I will get from my bitcoin investment.El Salvador doesn't have anything to offer me that will give me the profit that 1m dollars worth of bitcoin will give to me. Instead, I will think of going to the Caribbean Island on vacation. Let's not forget that El Salvador is a third world country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "December 09, 2023, 03:34:33 PM",
      "body": "If El Salvador isn't like any other country out there, and it's like a \"UTOPIA\" where everything is perfect then I guess I'll save some Bitcoins for it... or not. I'm living in a developing country and that amount of money is already huge for me even though I will work all my life, I might not save that amount of money. I don't see any differences between living in El Salvador and living in another country.I wonder who will try to do this one? Rich businessmen maybe who want to live in El Salvador? Maybe miners who want to mine there? I mean I can't think of somebody who will spend a million dollars just to be a citizen of that country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "December 09, 2023, 03:57:53 PM",
      "body": "Just by knowing that you need to deposit Bitcoin worth $1M is already a huge obstacle for me. If I converted the money needed then it will take a very long time before I can reach the said amount. It's around 55 million in my fiat currency and that alone is the deposit amount only and how much more if you add the fee $999 or let's put it to $1000. I think there are more expenses since you have to go through KYC and stuff so that means I need to pay money to get the documents needed for the verification. My answer in short is NO. I am lucky enough that my country didn't ban Cryptocurrency and there are E-Wallets that are now accepting crypto where you can buy, sell and receive crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "December 09, 2023, 04:29:53 PM",
      "body": "Quote from: sokani on December 09, 2023, 10:18:59 AMYes, that's it, as an investor would you pay such an amount to automatically become an El Salvadorian citizen? According to the news on various news site, El Salvadorian government has partnered with Tether to launch a program tagged \"Adopting El Salvador Freedom Visa Program.” Applicants are required to pay a non refundable $999 fee in BTC or USDT, if the application is successful, they'd be required to undergo KYC and a $1M dollar deposit in BTC or USDT to secure a freedom visa and citizenship.QuoteThe new program is primarily focused on enabling participants to play a role in co-creating a future that will set new benchmarks in culture, safety, technology, and societal progress. By participating in establishing El Salvador as a dynamic global center for cutting-edge technology and financial innovation, individuals become integral partners in steering a nation toward exceptional growth and evolution and offer a path to obtain a Salvadoran Passport.Share your thoughts, would you do this if you've a very deep pocket?https://tether.to/en/tether-powers-el-salvadors-visionary-freedom-visa-program-through-technology-support/If I would have that kind of money then why would I care to get a citizenship of El Salvador while I can use that money for my own good.Although El Salvador has adopted bitcoin but it doesn't mean that people should pay such a huge amount to them just to get a citizenship.That's a huge amount for a citizenship.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "December 09, 2023, 04:39:37 PM",
      "body": "Quote from: sokani on December 09, 2023, 10:18:59 AMShare your thoughts, would you do this if you've a very deep pocket?Nope, as if I am filthy rich, there are far better passports to buy than the one from El Salvador. On top of that, my country's passport is ranked 26th in the world while El Salvador 72nd according to VisaGuide meaning I woulnd't gain absolutely anything by getting one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "December 09, 2023, 05:08:16 PM",
      "body": "Absolutely not. The Salvadoran passport is not special, and I can get better passports at a cheaper price. For example, some countries require a deposit or investment of $500,000 in real estate or direct deposit, and they have a better visa after the security examination. Also, El Salvador is not one of the developed countries in terms of health or education. Therefore, it is not an ideal place for my children, especially with a million dollars spent, which could mean a luxurious life in Southeast Asian countries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "December 09, 2023, 05:08:58 PM",
      "body": "Quote from: sokani on December 09, 2023, 10:18:59 AMShare your thoughts, would you do this if you've a very deep pocket?I'm struggling with my English and much more on my Latin I have zero knowledge when it comes to Latin and besides Bitcoin, I hardly know anything about El Salvador I prefer to invest my $1 million if I have that amount in my own country I think my country is better than El Salvador in terms of tourist attraction we have the best beaches and we have the cheapest services and cost of living here is very low.And besides my my country's passport ranked 7 higher than El Salvador.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jegileman",
      "created_time": "December 09, 2023, 05:29:28 PMLast edit: December 09, 2023, 05:43:41 PM by Jegileman",
      "body": "Quote from: sokani on December 09, 2023, 10:18:59 AMShare your thoughts, would you do this if you've a very deep pocket?If I have that amount of money in my place, I am already an average person and can live a comfortable life here. Getting an El Salvadoran passport won’t be a nice idea for me to go for now but maybe later in the future when I have a deeper pocket like you’ve said. Even so, many things will be put into consideration before applying for one. In fact, I won’t get one even when I am filthy rich, there should be other more options I can get for a lesser price than that. 1 million dollars for just a passport, oh no, it is now worth it seriously. I thought it was 1 thousand dollars and not a million dollars initially.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}