{
  "id": "topic_5473208",
  "title": "Barikui1",
  "author": "Barikui1",
  "created_time": "November 07, 2023, 12:16:48 PM",
  "content": "Their are few mistakes we trader make even when we already knows the craft but we still fall victim to, which are;-  Trading against the trend: when trading against a trend their is a higher possibilities of you losing that trade, if you spot an uptrend, you should only be looking for a buy opportunities and if you spot a down trend you should only be looking for a sell opportunities simple, you get more winning trade by doing that.- Too much monitoring of the chart: before you place any trades use a margin you can afford to lose, so that once you place your trade, you set your exit point, take profit or stop loss you wouldn't be checking your chart steadily, because by doing so, you emotions will come into play if it's a margin you can't afford to lose, try as much as possible to trust your analysis, leave it to play out if you want to make good money from the market if it's going your way.- Entry point - most skill traders I have encountered struggle on this aspect, your entry point determine your risk to reward ratio and that is what keeps you profitable.if you can get a good entry point by letting the market come too you, even though you loss 60% of your trades, you will still be profitable because 1-3 risk reward ratio will be the least you will get from such entry.- Too much emphasis on technical indicators: most indicators mostly shows the past data of what have happened in the market, but wouldn't show you what is coming next, that's why it's very important to look at the price action of the chart, you react only to what the market gives you, not by doing what you think. if you must succeed in trading you must start learning to react to what the market is playing out.- Always calculate your loss before profit: when you trade with what you can afford to lose, it is near impossible for your emotions not to be in check.- Avoid trading consolidation: traders that fall victim to this one are people that takes many trades,  trading consolidation is very dangerous because it can go anyway, at such point, the market have no clear direction.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473208",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "November 07, 2023, 12:23:31 PM",
      "body": "One of the mistakes I do is to trade when a coin has increased significantly in price. If it has increased, I go on short position. This is also what I do if the market price of a coin has decreased significantly, I go long. The mistake is that the market will continue in the direction and no reversal sometimes.  I later used averaging with it and I gain than before but it is very risky.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Barikui1",
      "created_time": "November 07, 2023, 12:51:21 PM",
      "body": "Quote from: Oshosondy on November 07, 2023, 12:23:31 PMOne of the mistakes I do is to trade when a coin has increased significantly in price. If it has increased, I go on short position. This is also what I do if the market price of a coin has decreased significantly, I go long. The mistake is that the market will continue in the direction and no reversal sometimes.  I later used averaging with it and I gain than before but it is very risky.In such situation before thinking that their will be change a of trend,  if it's an uptrend, you look at the price chart to know if the buying pressure have subside and to know if there are more sellers in the market to push the price down. In trading it very important to be thought before venturing into the market, so that your will know how to react to the market by it actions",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "November 07, 2023, 02:44:36 PM",
      "body": "Quote from: Barikui1 on November 07, 2023, 12:16:48 PM- Too much monitoring of the chart: before you place any trades use a margin you can afford to lose, so that once you place your trade, you set your exit point, take profit or stop loss you wouldn't be checking your chart steadily, because by doing so, you emotions will come into play if it's a margin you can't afford to lose, try as much as possible to trust your analysis, leave it to play out if you want to make good money from the market if it's going your way.Biggest mistake of traders is Do not use Stop Loss or Stop Limit orders. Those order types can help them to avoid big loss when the market moves very quickly, crashes with very panic selling from other traders and liquidations from exchanges.One of best weapons in trading, Stop loss order.Stop limit order, what it is and why investors use it.What is stop limit order.Another mistake from trader is they use Margin, Leverage. They believe they can get rich quickly with margin, leverage, futures but they get poorer or bankrupted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "November 07, 2023, 02:59:21 PM",
      "body": "Quote from: Barikui1 on November 07, 2023, 12:16:48 PMtry as much as possible to trust your analysis, leave it to play out if you want to make good money from the market if it's going your way. if you must succeed in trading you must start learning to react to what the market is playing out.A big contradiction dictated. You advised that we should trust our analysis and allow it to play out if we want to make big money. Not advisable to keep visiting the screen to twerk our emotions by doing the wrong thing. This is understandable, but the second advice, you said we should learn to react to what the market is playing out. This also means that we can let go our strategy and react with the market. Are you not sensing contradictions here?Quote from: tbct_mt2 on November 07, 2023, 02:44:36 PMBiggest mistake of traders is Do not use Stop Loss or Stop Limit orders. Those order types can help them to avoid big loss when the market moves very quickly, crashes with very panic selling from other traders and liquidations from exchanges.I have had a very bad experience with the stop loss. It is a nice tool to mitigate losses and it is also a good tool to prevent wins. At times I feel that someone watches to see where you place your stop loss and trigger it and after which the market will reverse to profit immediately.Quote from: tbct_mt2 on November 07, 2023, 02:44:36 PMAnother mistake from trader is they use Margin, Leverage. They believe they can get rich quickly with margin, leverage, futures but they get poorer or bankrupted.I'll rather trade with 1k without leverage than $100 on X10 leverage",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "November 07, 2023, 03:30:51 PM",
      "body": "Is it not related to 1xbit or 1xbet? I just asked this. But I hope 0xbet is not related. Anyway, welcome to the bitcointalk forum. I hope you can properly establish your community here in the field of crypto business.Do you have any bonuses ready for newcomers to your casino? apart from welcome bonuses, free spins, and others? The competition that you will face here in the crypto gambling business is quite intense, so you should refine and improve your actions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "puloweh555",
      "created_time": "November 07, 2023, 07:01:22 PM",
      "body": "Quote from: Barikui1 on November 07, 2023, 12:16:48 PMTheir are few mistakes we trader make even when we already knows the craft but we still fall victim to, which are;-  Trading against the trend: when trading against a trend their is a higher possibilities of you losing that trade, if you spot an uptrend, you should only be looking for a buy opportunities and if you spot a down trend you should only be looking for a sell opportunities simple, you get more winning trade by doing that.Yes that's right. This is often done by many traders. When there is a breakout, the rules are that you have to follow the trend, but because you see that the price has gone far, your instinct automatically seems to be to see the moment to fight back (because your heart says \"it's time\"). Changing your mindset is indeed difficult. because it is filled with fomo, greed, etc.As well as additional advice for friends. When market conditions are no longer running according to the previous trend, traders need to prepare anticipation according to their respective methods. Don't fight the trend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "knowngunman",
      "created_time": "November 07, 2023, 07:03:16 PM",
      "body": "Quote from: Barikui1 on November 07, 2023, 12:16:48 PMtry as much as possible to trust your analysis, leave it to play out if you want to make good money from the market if it's going your way. if you must succeed in trading you must start learning to react to what the market is playing out.The truth is It can be tempting to over react to every little market movement and make constant changes to your trading strategy but that's usually not a good idea. Markets are volatile and unpredictable and trying to time the market often can sometimes backfire. It's usually better to stick to your plan and resist the urge to make emotional decisions based on short term price movements.Quote from: KingsDen on November 07, 2023, 02:59:21 PMA big contradiction dictated. You advised that we should trust our analysis and allow it to play out if we want to make big money. Not advisable to keep visiting the screen to twerk our emotions by doing the wrong thing. This is understandable, but the second advice, you said we should learn to react to what the market is playing out. This also means that we can let go our strategy and react with the market. Are you not sensing contradictions here?No, I don't think there's contradiction here because reacting to the market doesn't necessarily mean making emotional decisions. Instead, it means adjusting your trading plan based on new information and opportunities. It is about being flexible and adjusting your strategy based on what is happening in the market.Quote from: bettercrypto on November 07, 2023, 03:30:51 PMIs it not related to 1xbit or 1xbet? I just asked this. But I hope 0xbet is not related. Anyway, welcome to the bitcointalk forum. I hope you can properly establish your community here in the field of crypto business.Do you have any bonuses ready for newcomers to your casino? apart from welcome bonuses, free spins, and others? The competition that you will face here in the crypto gambling business is quite intense, so you should refine and improve your actions.Hey! What do you think you are doing here? Oh no, Wrong thread I guess.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "November 07, 2023, 07:27:32 PM",
      "body": "I am happy that there are tips and attempts to make things easier for beginners, but some of these tips will not be of value without you trying trading, as it is easy to say to a person, “I control his feelings,” but when trading comes, unless you have trading experience, you will end up forgetting this advice, and it is also It is difficult for beginners to find such topics. Therefore, it is better to avoid creating more of such topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "November 07, 2023, 07:32:14 PM",
      "body": "Quote from: knowngunman on November 07, 2023, 07:03:16 PMQuote from: Barikui1 on November 07, 2023, 12:16:48 PMtry as much as possible to trust your analysis, leave it to play out if you want to make good money from the market if it's going your way. if you must succeed in trading you must start learning to react to what the market is playing out.The truth is It can be tempting to over react to every little market movement and make constant changes to your trading strategy but that's usually not a good idea. Markets are volatile and unpredictable and trying to time the market often can sometimes backfire. It's usually better to stick to your plan and resist the urge to make emotional decisions based on short term price movements.Quote from: KingsDen on November 07, 2023, 02:59:21 PMA big contradiction dictated. You advised that we should trust our analysis and allow it to play out if we want to make big money. Not advisable to keep visiting the screen to twerk our emotions by doing the wrong thing. This is understandable, but the second advice, you said we should learn to react to what the market is playing out. This also means that we can let go our strategy and react with the market. Are you not sensing contradictions here?No, I don't think there's contradiction here because reacting to the market doesn't necessarily mean making emotional decisions. Instead, it means adjusting your trading plan based on new information and opportunities. It is about being flexible and adjusting your strategy based on what is happening in the market.could it be too much analysis that sometimes the trader instead freezes and is not able to execute trades because of contradicting indicators he uses?we've seen those users who have been studying too many of these indicators and in their charts, there are 7 of them not confirming each other whether the trend is exactly where it goes.the trend is your friend. this has always been the proverb of forex traders yet it applies to the new market as well. kinda telling us it's the golden rule to make a profit and not those paid indicators.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamphser",
      "created_time": "November 07, 2023, 07:38:19 PM",
      "body": "Quote from: Oshosondy on November 07, 2023, 12:23:31 PMOne of the mistakes I do is to trade when a coin has increased significantly in price. If it has increased, I go on short position. This is also what I do if the market price of a coin has decreased significantly, I go long. The mistake is that the market will continue in the direction and no reversal sometimes.  I later used averaging with it and I gain than before but it is very risky.This is where stop loss would really be that relevant or useful yet its really that very normal that we would really be making counter trades if we do assume that there would really be a reveral.We cant really just that able to know on how deep that movement could be or simply we dont really know on whats the bottom of it on which it would really be that so normal that hesitance and doubts could really be felt out on this kind of moment on which you would really be that trying out to wait up until you do see some reversal candle which it would be usually a doji or a hammer but of course crypto market wont really be always getting aligned with technical approach.This what makes it hard considering on making use of these tools but it isnt really that something that  you should ignore which we know that it is really that relevant on times like this because you cant really just make out buying or selling positions without having those kind of approach because having no use of any analysis  would really be just pure gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "November 07, 2023, 07:55:16 PM",
      "body": "As a trader you have to monitor your trade because monitoring of your trade will help you not to lose, their is no apparatus or tools you will use in trading that will not permit you or give you the privilege of not monitor your chart of trading, because in a trading irrespective of your tools you will not hesitate to be observate  and also be conscious in a trading to ensure you have to make a profit, either you use stop loss or not and without observations in trading you will lose, so therefore trading requires monitoring.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kentrolla",
      "created_time": "November 07, 2023, 08:35:53 PM",
      "body": "Here are the mistakes which usually make:1. I have personally made and still end up repeating is if the market goes against you like if you have taken position for long and price starts dropping down instead of applying stop loss I rather wait and take risk in assumption that market will pump back and I will get more profit but eventually end up liquidating my funds as result. 2. Sometimes I go for higher leverage in greed of earning more profit which often ends in losing the trade. 3. I have stopped doing it now but till few months ago I used to check the loser index and select the coin which has been the biggest loser of the day assuming it has more chances of recovery I made this mistake last year with UST and LUNC during the month of May when we all were shocked by crash of Luna.I have learn to avoid these mistake for future and I would advice everyone to list down the mistakes they have made and work on it to avoid repeating the same mistake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "November 07, 2023, 08:55:34 PM",
      "body": "Quote from: Barikui1 on November 07, 2023, 12:16:48 PM- Avoid trading consolidation: traders that fall victim to this one are people that takes many trades,  trading consolidation is very dangerous because it can go anyway, at such point, the market have no clear direction.Yeah, that's true. I do this too. However, I go in with minimal risk during consolidation until there's a Breakout and then I double my risk the direction of the BO. I don't just hop in once there's a BO. I wait for a retracement. Price has a way of retracing to retest its point of BO, most times. There's a 8 out of 10 chances that it will return for a retest before journeying on.However, besides all the mistakes you listed is the a major one you didn't list. That's lack of emotional control. Emotion is a trade killer. Any trader who can't control their emotion, whether in winning or losing, will have a hard time being profitable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "terrific",
      "created_time": "November 07, 2023, 09:04:58 PM",
      "body": "Quote from: Barikui1 on November 07, 2023, 12:16:48 PM if you must succeed in trading you must start learning to react to what the market is playing out.And this is what people lack of, they don't react when the market is playing out and even it's already on their favor they don't want to make profits out of it.They wait and wait until they become greedy and missing the plane. That's the scenario for most of the traders but the experienced ones, they don't get along with them.They make money, don't become emotional whatever is the situation of the market and they play out nicely with profit taking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "November 07, 2023, 09:18:52 PM",
      "body": "I do say in trading no one is an expert though there are people who made it through it but not for everyone from my own view, because mistakes can come at anytime and when a trader is always trying to be professional in their trading journey they often make lost, why because they thought they can handle the entire market conditions or can trade with past history to what the previous candle and indication they had before. Naturally it's too complex to understand trading entirely even as I am now currently I do finds difficulties while to make some cool cash from it all less I just wanna scalp for the day maybe buying little and watch for just some percentage changes and this could be 1 to 5 percentage I can likely take profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "November 07, 2023, 09:25:50 PM",
      "body": "Quote from: Adbitco on November 07, 2023, 09:18:52 PMI do say in trading no one is an expert though there are people who made it through it but not for everyone from my own view, because mistakes can come at anytime and when a trader is always trying to be professional in their trading journey they often make lost, why because they thought they can handle the entire market conditions or can trade with past history to what the previous candle and indication they had before. Naturally it's too complex to understand trading entirely even as I am now currently I do finds difficulties while to make some cool cash from it all less I just wanna scalp for the day maybe buying little and watch for just some percentage changes and this could be 1 to 5 percentage I can likely take profits. Professional, expert or novice traders, they still can experience mistakes or losses.Even if you say, you already know a lot of angles in trading, still, you are no exception to suffer loss.As each project is unique to each other, there is no concrete strategy that will work every time you trade.Hence, mistake or miscalculations is always around the corner. After all, we are only speculating on our every move.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mirakal",
      "created_time": "November 07, 2023, 10:39:32 PM",
      "body": "Quote from: hugeblack on November 07, 2023, 07:27:32 PMI am happy that there are tips and attempts to make things easier for beginners, but some of these tips will not be of value without you trying trading, as it is easy to say to a person, “I control his feelings,” but when trading comes, unless you have trading experience, you will end up forgetting this advice, and it is also It is difficult for beginners to find such topics. Therefore, it is better to avoid creating more of such topic.  These tips can be quite helpful if you are a beginner trader but experience is still the best teacher as you won't understand these basic tips if you are currently not experiencing real trading. That is why for you to overcome some common mistakes in trading, you need to trade more and the more you commit mistakes, the more lessons you will learn. While losing can discourage traders from trading more, but know that its the best option for you to become a pro trader and be a successful trader in the long run.Tips can be forgotten when you are already in live trading, but if you have the knowledge and skills obtained through consistent trading, no matter how forgetful you are, those skills will always be your edge in trading that will always play a vital part in your trading success.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shinratensei_",
      "created_time": "November 08, 2023, 01:02:29 AM",
      "body": "Quote from: GeorgeJohn on November 07, 2023, 07:55:16 PMAs a trader you have to monitor your trade because monitoring of your trade will help you not to lose, their is no apparatus or tools you will use in trading that will not permit you or give you the privilege of not monitor your chart of trading, because in a trading irrespective of your tools you will not hesitate to be observate  and also be conscious in a trading to ensure you have to make a profit, either you use stop loss or not and without observations in trading you will lose, so therefore trading requires monitoring. thats the essence of trading, monitoring 24/7 even when you're asleep you set alarm to look out for price, definitely mentally exhausting activity but if someone can make consistent profit out of it, it could be quite the massive profit.but the disadvantage with trading, so much speculation involved, even expert trader definitely gonna hard time to understand what the market gonna be turning out,  sometime the market just acts randomly any analysis might be irrelevant at this point, therefore there are many mistake needs to watch out for, but even then doesn't even guarantee anything.moreover, trading in general, might not be for everyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boty",
      "created_time": "November 08, 2023, 01:31:42 AM",
      "body": "Quote from: TimeTeller on November 07, 2023, 09:25:50 PMProfessional, expert or novice traders, they still can experience mistakes or losses.Even if you say, you already know a lot of angles in trading, still, you are no exception to suffer loss.As each project is unique to each other, there is no concrete strategy that will work every time you trade.Hence, mistake or miscalculations is always around the corner. After all, we are only speculating on our every move.Everyone has experienced failure in the trading they do and almost everyone cannot avoid these mistakes and we must be aware of this, at least we will incur fewer losses when trading. In making speculations, we must understand the market conditions and this is not easy to do because the market conditions are fluctuating so that many speculations are made that are not in accordance with market conditions, and we also have to be able to calculate the losses we have incurred so that we can correct them so that they don't fall into disrepair. we have suffered a lot of losses and cannot trade again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}