{
  "id": "topic_5470003",
  "title": "promise444c5",
  "author": "promise444c5",
  "created_time": "October 11, 2023, 02:03:36 PM",
  "content": "Today its all about economic discussion  , you guys might be wondering why discussing war that doesn't relate to us but believe me everyone is getting involved gradually , currently it's Israel and Hamas in Gaza IllusFrom the rough illustration above, there's  a chain-link structure  of sides from left to the right  we know about the main keys  here no need to dive deeper. However,  coming down to where we are involve is First, we are having  some downlines in our economic aspect due to these wars, crude oil market price rising  more inflation incoming as we still depend on Grey economy. Lastly,  if we go dey pick side wic side we go con dey   na normal sey na our government go determine our fate but if na us wetin we go do and u no sey u no fit stay neutral ,we  no be like China wey dey neutral and e Don get most things ready . Also make we knw sey our nebor contry wey go war no be say d war no get upper outside hand oo make we no go deeper sha  (Pidgin cont).Remember also that if all world power holding countries should engage in  war in one way or the other there will be some down  fall in crypto  world  too as cyber attacks will be lunched too especially at this technology age .Finally , the General question is what's the future  fate of a Civilised and Technology Age.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470003",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "October 11, 2023, 10:34:58 PM",
      "body": "Quote from: promise444c5 on October 11, 2023, 02:03:36 PMRemember also that if all world power holding countries should engage in  war in one way or the other there will be some down  fall in crypto  world  too as cyber attacks will be lunched too especially at this technology age .Can you use analysis to explain this?I do not know about other cryptocurrencies, but if I hold bitcoin with a secure setup on a noncustodial wallet, no one will be able to hack the wallet. Or you are referring to hashrates that may decrease during the time? Miners are all over many countries. Even in United States, China, and Kazakhstan with the highest hashrates, miners are in many states in the countries, they are not in a single location.A war that would weakens the bitcoin hashrate and make 51% attack possible would have lead to almost destruction of the world in a way that the attacker may not also be able to do the attack.During war in a country, bitcoin sell at premium, but I do not know what can be the result of world war on bitcoin. It would be positive and surprising.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "promise444c5",
      "created_time": "October 13, 2023, 09:08:48 AM",
      "body": "Quote from: Charles-Tim on October 11, 2023, 10:34:58 PMCan you use analysis to explain this?I do not know about other cryptocurrencies, but if I hold bitcoin with a secure setup on a noncustodial wallet, no one will be able to hack the wallet. Here I'm talking  about the crypto world at large any slight drop in btc gives a greater  drop on others, Also what about centralized market world , but as you've said Quote from: Charles-Tim on October 11, 2023, 10:34:58 PMA war that would weakens the bitcoin hashrate and make 51% attack possible would have lead to almost destruction of the world in a way that the attacker may not also be able to do the attack. AndQuoteDuring war in a country, bitcoin sell at premium, but I do not know what can be the result of world war on bitcoin. It would be positive and surprising.It's all assumption the negative effect might surface rather than the positive  actually.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Usasauki2004",
      "created_time": "October 13, 2023, 01:14:50 PM",
      "body": "Quote from: promise444c5 on October 13, 2023, 09:08:48 AMQuote from: Charles-Tim on October 11, 2023, 10:34:58 PMCan you use analysis to explain this?I do not know about other cryptocurrencies, but if I hold bitcoin with a secure setup on a noncustodial wallet, no one will be able to hack the wallet. Here I'm talking  about the crypto world at large any slight drop in btc gives a greater  drop on others, Also what about centralized market world , but as you've said Quote from: Charles-Tim on October 11, 2023, 10:34:58 PMA war that would weakens the bitcoin hashrate and make 51% attack possible would have lead to almost destruction of the world in a way that the attacker may not also be able to do the attack. AndQuoteDuring war in a country, bitcoin sell at premium, but I do not know what can be the result of world war on bitcoin. It would be positive and surprising.It's all assumption the negative effect might surface rather than the positive  actually. If you check this war well, Israel is an ally of USA so one way or the other USA must give aid and if that's is so then there will be massive drop in USA dollar rate at the financial markets due to investors pulling out their investments. During war like this, crypto currency like bitcoin, others paired with USDT and natural element like gold tend to be more valuable because most especially gold can't be affected by war and investors saved their money in gold.Tips for financial market trade, look for more of buy when the USDT is the quote and look for more of sell when USDT is the base",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "October 13, 2023, 02:24:44 PM",
      "body": "Quote from: Usasauki2004 on October 13, 2023, 01:14:50 PMIf you check this war well, Israel is an ally of USA so one way or the other USA must give aid and if that's is so then there will be massive drop in USA dollar rate at the financial markets due to investors pulling out their investments. During war like this, crypto currency like bitcoin, others paired with USDT and natural element like gold tend to be more valuable because most especially gold can't be affected by war and investors saved their money in gold.Tips for financial market trade, look for more of buy when the USDT is the quote and look for more of sell when USDT is the base I dislike coming across one common thing which almost everyone is sometimes involved in this kind of talk, why should we always think that whene there's an uproar of war or communal dispute the first thing rhat we relate to the cause is the US, they have always been the prime suspects of every economic challenges and war, though i understand that they have an international relations with many of these affected countries and also are the world giant when it comes to many economical challenges and political affairs.But aren't we yet due for a wake up from our slumber, you can't be dependents on someone and anything happening to you not to be traced to your colonial master, we are having freedom but not living in it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "October 13, 2023, 03:08:19 PM",
      "body": "Quote from: Usasauki2004 on October 13, 2023, 01:14:50 PMIf you check this war well, Israel is an ally of USA so one way or the other USA must give aid and if that's is so then there will be massive drop in USA dollar rate at the financial markets due to investors pulling out their investments. Yeah, that’s one thing I know for sure. Israel and USA are very strong Allie’s and it’s no hidden secrete that in times like this, you can expect the full support of the US government for the people of Israel in terms of military fire power, ammunitions, trainings and support through these trying times for there people. USA continues to come public on there support for Israel and warns other nations to stay clear of any form of support or aid to Hamas (Gaza) while, seeking possible peaceful relations for the releases of kidnapped civilians being held in an underground tunnel by Hamas and continues to show military strength in Gaza.In these economic downtimes, it’s hard to imagine all these wars coming up to further push dilapidate the situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "promise444c5",
      "created_time": "October 13, 2023, 06:31:50 PM",
      "body": "Quote from: Smartvirus on October 13, 2023, 03:08:19 PMIn these economic downtimes, it’s hard to imagine all these wars coming up to further push dilapidate the situation.From the image I believe the war is still spreading , there might have been some war before between hamas and isreal but this is way more established as it involving taking Gaza along  with it.Quote from: Doan9269 on October 13, 2023, 02:24:44 PM[I dislike coming across one common thing which almost everyone is sometimes involved in this kind of talk, why should we always think that whene there's an uproar of war or communal dispute the first thing rhat we relate to the cause is the US, they have always been the prime suspects of every economic challenges and war, From the figure it should be obvious thats a longer chain side picking is being formed with the giant coming forward .  I don't think USA should be  the prime suspect  but y linking  up in all wars currently,I think these wars are USAs but indirectly fought.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}