{
  "id": "topic_5419866",
  "title": "Yabani",
  "author": "Yabani",
  "created_time": "November 07, 2022, 07:52:26 PM",
  "content": "Arkadaşlar quai network yakında testnet yapacak ancak onun öncesinde bir ödül programı çıkarttılar sosyal medya görevleri yaparak quai network kazanabilirsiniz.site:  https://dashboard.quai.network/görevler: https://blog.quai.network/quai-network-social-media-rewards-program-39d66a8d935fGörevler çok zor değil",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5419866",
  "comments": [
    {
      "author": "ZekiBeyy",
      "created_time": "November 12, 2022, 07:29:42 PM",
      "body": "Discord'dan rol alarak alacağınız ödülü 1.5x arttırıyorsunuz rol almak aşırı kolay bir şey görevlerde aşırı basitmiş 100 tane coin yapmak 15 dakikalık bir uğraştan ibaret ne olur ne olmaz mantığı ile vakit ayırmak gerekli diye düşünüyorum adamlar bu sayede sosyal medyada sürekli göz önünde duruyor. Vakti olanlar için küçük bir uğraş.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zonefloor",
      "created_time": "November 16, 2022, 06:17:55 PM",
      "body": "Bu dönemde yatırım yapmak resmen intihar olur. Çünkü kötü haberlerin ardı arkası kesilmiyor. Bu yüzden de sürekli bounty ve airdroplara katılmaya çalışıyorum. Bu ödül programı hala devam ediyor mu acaba?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "November 16, 2022, 06:51:24 PM",
      "body": "Quote from: zonefloor on November 16, 2022, 06:17:55 PMBu dönemde yatırım yapmak resmen intihar olur. Çünkü kötü haberlerin ardı arkası kesilmiyor. Bu yüzden de sürekli bounty ve airdroplara katılmaya çalışıyorum. Bu ödül programı hala devam ediyor mu acaba? Paylaşıldığı günden beri yapmaya çalışıyorum evet ödül programı devam ediyor şimdilik zaten sadece twitter aktif yakında diğer platformlarda eklenecek görevler var. çok basit bugün yarın neden yapmadık demeyelim hangi projenin  ne yapacağını kimse kestiremiyor birkaç twet atmaktan zarar gelmez.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}