{
  "id": "topic_5468591",
  "title": "PayWithAnon",
  "author": "PayWithAnon",
  "created_time": "September 29, 2023, 09:06:58 PMLast edit: October 18, 2023, 11:29:45 PM by PayWithAnon",
  "content": "Hello fellow bitcoiners!   Welcome to the official PayWithAnon Bitcointalk Thread!      Today we introduce the world to the Anon Virtual Visa® Card.     The Anon virtual card lets you spend over 5+ cryptocurrencies like cash online, worldwide.   Purchase an Anon Virtual Visa® Card with crypto to pay online worldwide anywhere Visa® cards are accepted,   cards are immediately available to spend.    Key Features:    Private: We will never ask for any identification or personal information    Unlimited: You can create as many Anon Virtual Cards you need to match your spending needs    High load limit: Send funds or receive funds from other Anon users, instantly    Send and Receive: You can load an Anon Card up to $1.000 USD each.    How it works    Create an account: Create an account with only your email, no additional information required.    Fund your balance: Fund your credit balance with over 5+ cryptocurrencies, crypto will be automatically converted to USD.    Create A Card & Pay: Create a card in one click, cards are immediately available to spend. Use Anon cards to pay everywhere Visa cards are accepted, worldwide.   Check it out today: www.paywithanon.com",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468591",
  "comments": [
    {
      "author": "PayWithAnon",
      "created_time": "September 29, 2023, 09:14:54 PM",
      "body": "Reserved for updates.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "September 30, 2023, 07:48:24 PM",
      "body": "Quote from: PayWithAnon on September 29, 2023, 09:06:58 PMToday we introduce the world to the Anon Virtual Visa® Card. Can you show us some proof that you are official registered company working with Visa?I would love to see your office and Anon team behind this project.This looks like another scam like we saw before several times with cards like this, maybe even made by the same people who made PST.NET cards or coinpaycard.net.Design is similar and domain is recently registered, so I would be very careful before sending any coins to this website.QuoteDomain:paywithanon.comRegistrar:Key-Systems GmbHRegistered On:2023-09-15Expires On:2024-09-15Updated On:2023-09-15https://www.whois.com/whois/paywithanon.comArchived: https://web.archive.org/web/20230930195203/https://paywithanon.com/Maybe I am wrong about this, maybe Anon team is willing to give few cards for testing to trusted forum members.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PayWithAnon",
      "created_time": "September 30, 2023, 08:15:48 PM",
      "body": "Quote from: dkbit98 on September 30, 2023, 07:48:24 PMQuote from: PayWithAnon on September 29, 2023, 09:06:58 PMToday we introduce the world to the Anon Virtual Visa® Card. Can you show us some proof that you are official registered company working with Visa?I would love to see your office and Anon team behind this project.This looks like another scam like we saw before several times with cards like this, maybe even made by the same people who made PST.NET cards or coinpaycard.net.Design is similar and domain is recently registered, so I would be very careful before sending any coins to this website.QuoteDomain:paywithanon.comRegistrar:Key-Systems GmbHRegistered On:2023-09-15Expires On:2024-09-15Updated On:2023-09-15https://www.whois.com/whois/paywithanon.comArchived: https://web.archive.org/web/20230930195203/https://paywithanon.com/Maybe I am wrong about this, maybe Anon team is willing to give few cards for testing to trusted forum members.Hi dkbit98,It's correct that the domain is 15 days old, however we have worked hard for a couple of months on this project. We just recently settled on a good name. (We hope)We have no affiliation or any knowledge about the companies you describe above. Anon is NOT a bank, so we don't have a direct partnership with Visa as described on our website our cards are issued by our partner Financial Institutions, pursuant to a license from Visa U.S.A. Inc.We would love to waive the card creation fees for a couple of trusted members, let me know if you can suggest any members (our maybe yourself). Love to hear more feedback!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "October 01, 2023, 01:37:10 PM",
      "body": "It will never be clear to me how someone can even create a business based on this kind of business model, which, from the perspective of the legal framework, cannot possibly succeed. VISA is not some nonsense company through which money can be \"transferred\" in this way without the users being identified.Quote from: PayWithAnon on September 30, 2023, 08:15:48 PM~snip~We would love to waive the card creation fees for a couple of trusted members, let me know if you can suggest any members (our maybe yourself). This means absolutely nothing (unfortunately), because it does not prevent you from performing an exit scam at any time. However, everyone is the master of their own money and reputation, but I personally would never vouch for something like this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceMobile",
      "created_time": "October 01, 2023, 01:54:44 PM",
      "body": "Quote from: Lucius on October 01, 2023, 01:37:10 PMIt will never be clear to me how someone can even create a business based on this kind of business model, which, from the perspective of the legal framework, cannot possibly succeed. VISA is not some nonsense company through which money can be \"transferred\" in this way without the users being identified.I've seen similar claims a few times, and it always ended badly.There's no way VISA allows some anonymous new website to sell anonymous credit cards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PayWithAnon",
      "created_time": "October 01, 2023, 02:31:18 PM",
      "body": "Quote from: Lucius on October 01, 2023, 01:37:10 PMThis means absolutely nothing (unfortunately), because it does not prevent you from performing an exit scam at any time. However, everyone is the master of their own money and reputation, but I personally would never vouch for something like this. This is fair and absolutely true, there are many legit websites that ended-up being an exit scam. However, we must say we have put a lot of resource, funds and work into building this platform. Time will give us the bitcoin and crypto community trust. The only thing we can do is building a prefect platform to show that we can be trusted, it's a long road ahead for us but nevertheless a road we expect to be on when created Anon. Quote from: Lucius on October 01, 2023, 01:37:10 PMIt will never be clear to me how someone can even create a business based on this kind of business model, which, from the perspective of the legal framework, cannot possibly succeed. VISA is not some nonsense company through which money can be \"transferred\" in this way without the users being identified.I've seen similar claims a few times, and it always ended badly.There's no way VISA allows some anonymous new website to sell anonymous credit cards.Well it's not easy we work directly with issuing bank, there is a lot of back and forth with the banks and a lot of trust involved. For example, the BIN numbers for the card we issue are unique and only issued by us. Thus, every agency knows that we have issued these cards, and they are directly linked to us. When any issues arrive, we will be held accountable. All funds are going directly to the issuing bank for the issuing and top-up of our cards. There are a couple of platforms that do the same like, ezzo-card, pay-with-moon (stopped), bitcoin-company, bit-refill. Our fees are lower than those services, and because or BIN's are unique and clean our cards can be used at more merchants worldwide, than just generic BIN's they provide.  Also, our cards cannot be reloaded and can only have a max balance of $1K well within the legal framework for cards that are not linked to anybody identity. It's also important to understand that VISA is just a card network, license banks and EMI's have the ability to issue card how they like within their legal jurisdictions . You can buy anonymous visa/MasterCard cards in grocery shops, it's a bit like that. However, we provide a more easy way to obtain an anonymous card with our platform. And as I said above, it's a long road to trust and success, but we are prepared for that road. Best,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "edmundduke",
      "created_time": "October 02, 2023, 11:55:40 AM",
      "body": "Quote from: ETFbitcoin on October 02, 2023, 11:37:35 AMWhether your service is legit or not, i expect it'll hard to find people who can trust you. In past, few similar service (such as CoinPayCard.net) suddenly either perform exit scam or been abandoned where people can't spend or withdraw their money.Quote from: https://paywithanon.com/faqWhat are the fees associated with Anon?Transparency is key here, here are the fees associated with using Anon.Add funds to your Anon Account using crypto -FREE, You will get the best honest market rate with 0% spread.Create/Load Card - 10%Payment other than USD - 0%Send funds to other Anon users - 2%What exactly does \"Create/Load Card - 10%\" mean?Quote from: https://paywithanon.com/privacyData TransferAnon is headquartered in the United States, but we live in an increasingly interconnected world.Quote from: https://paywithanon.com/termsChanges to these TermsWe reserve the right to revise and update these Terms at our discretion. All changes take effect immediately upon posting and apply to all subsequent access to and use of the Website. Your continued use of the Website after the posting of revised Terms indicates your acceptance of and agreement to the changes. We encourage you to periodically review this page to stay informed about any updates, as they are binding on you.Is it really legal to change and apply ToS immediately? Few past news[1] says it's not legal to do so.[1] https://arstechnica.com/tech-policy/2007/07/court-says-no-to-changing-terms-of-service-without-notification/[2] https://www.bit-tech.net/news/court_says_no_to_tos_changes_without_notification/1/You assume that this is a registered/legal company that is doing this. (this is my assumption, if you are, feel free to correct me). Usually cards like this are used for connecting to random ad networks, and then running it till it gets charged. Another option is these are used to get several free trials that require a card submit. (such as canva etc) or then straight up to scam the CPA boards that pay you per action.Pretty much always illegal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PayWithAnon",
      "created_time": "October 02, 2023, 01:40:35 PM",
      "body": "Quote from: ETFbitcoin on October 02, 2023, 11:37:35 AM1. What exactly does \"Create/Load Card - 10%\" mean?2. Is it really legal to change and apply ToS immediately? Few past news[1] says it's not legal to do so.1. That the fees for creating an Anon card.2. I don't really know policy around the terms, however I know if they term change in a way that will affect you negatively they cannot be change immediately.Quote from: edmundduke on October 02, 2023, 11:55:40 AMYou assume that this is a registered/legal company that is doing this. (this is my assumption, if you are, feel free to correct me). Usually cards like this are used for connecting to random ad networks, and then running it till it gets charged. Another option is these are used to get several free trials that require a card submit. (such as canva etc) or then straight up to scam the CPA boards that pay you per action.Pretty much always illegal.If any user uses a card in a way that is violating our Terms of Service, these cards will be automatically deactivated. I must say, creating a card exclusively to sign up to a dozen of free trails is in no way illegal. However, we don't accept abuse and volition of the terms of service of other merchants, so in a case that happens the card will be deactivated in order to protect the merchants and other anon users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "edmundduke",
      "created_time": "October 03, 2023, 04:48:38 AM",
      "body": "Quote from: PayWithAnon on October 02, 2023, 01:40:35 PMQuote from: edmundduke on October 02, 2023, 11:55:40 AMYou assume that this is a registered/legal company that is doing this. (this is my assumption, if you are, feel free to correct me). Usually cards like this are used for connecting to random ad networks, and then running it till it gets charged. Another option is these are used to get several free trials that require a card submit. (such as canva etc) or then straight up to scam the CPA boards that pay you per action.Pretty much always illegal.If any user uses a card in a way that is violating our Terms of Service, these cards will be automatically deactivated. I must say, creating a card exclusively to sign up to a dozen of free trails is in no way illegal. However, we don't accept abuse and volition of the terms of service of other merchants, so in a case that happens the card will be deactivated in order to protect the merchants and other anon users.  As for the trials, that depends on what the rules set in place by the site are (even tho just being against TOS wont make it illegal).As for deactivating the card, that will not do much as the damage will already be done at that point. Your only hope is that the abuse does not become wide enough that the card identifying numbers dont get banned.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PayWithAnon",
      "created_time": "October 03, 2023, 12:54:24 PM",
      "body": "Quote from: edmundduke on October 03, 2023, 04:48:38 AMAs for the trials, that depends on what the rules set in place by the site are (even tho just being against TOS wont make it illegal).As for deactivating the card, that will not do much as the damage will already be done at that point. Your only hope is that the abuse does not become wide enough that the card identifying numbers dont get banned.To be honest, we don't expect to have any trials issue. If in a case we see an influx of trail fraud with a certain merchant, we will disable trails from that merchant so you can still shop at that merchant. We don't think it will go that far. 9/10 we will receive notice from Visa when such thing occurs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "October 06, 2023, 05:10:52 PM",
      "body": "Quote from: PayWithAnon on September 30, 2023, 08:15:48 PMWe would love to waive the card creation fees for a couple of trusted members, let me know if you can suggest any members (our maybe yourself). Thanks, but no thanks.I won't suggest anyone to test your product, this is your job, and I see to many risks to test it myself with my own money.After talking with support on your website I noticed a lot of typing errors, looks like one man ''team'' doesn't speak English very well.   Can you tell us where your financial technology company is registered and located exactly?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PayWithAnon",
      "created_time": "October 06, 2023, 08:29:57 PM",
      "body": "Quote from: dkbit98 on October 06, 2023, 05:10:52 PMQuote from: PayWithAnon on September 30, 2023, 08:15:48 PMWe would love to waive the card creation fees for a couple of trusted members, let me know if you can suggest any members (our maybe yourself). Thanks, but no thanks.I won't suggest anyone to test your product, this is your job, and I see to many risks to test it myself with my own money.After talking with support on your website I noticed a lot of typing errors, looks like one man ''team'' doesn't speak English very well.   Can you tell us where your financial technology company is registered and located exactly?https://www.talkimg.com/images/2023/10/06/Px5xI.jpegHi dkbit98,I'm really struggling to find your point here. You don't suggest people to try using our service, you don't want to try our product and in the same sentence you tell us to try our own product. Spelling errors happen, nothing wrong with it. Especially with our descent support team that is handling a much bigger volume than we expected.  (You yourself made some spelling errors)We are based in Amsterdam, but the PayWithAnon service is brought to you by: Anon Services, Inc. (Located in the U.S.)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "October 07, 2023, 05:28:20 AM",
      "body": "So if we load the card with $1000 we lose $100 off the top? Seems like a pretty high fee if ya ask me. Why wouldn't I just use an exchange and send the money to my bank? 10% fee just to avoid KYC? 10% everytime I load the card?In the longrun if you are looking to avoid taxes you would save money, but we still gotta trust you aren't going to take off with our money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "October 10, 2023, 09:41:56 PM",
      "body": "Quote from: PayWithAnon on October 06, 2023, 08:29:57 PMI'm really struggling to find your point here. You don't suggest people to try using our service, you don't want to try our product and in the same sentence you tell us to try our own product. My point was that you should be the one to choose someone to test your cards, not me.Quote from: yahoo62278 on October 07, 2023, 05:28:20 AM10% fee just to avoid KYC? 10% everytime I load the card?You have to pay 10% every time you load card with coins, this is what their website support told me. Way to expensive for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FinneysTrueVision",
      "created_time": "October 12, 2023, 04:58:06 AM",
      "body": "I've noticed many similarities between this product and PayWithMoon. Similar domain name, same brand colors, nearly identical terms & conditions with some slight rewording. Even the area where you show the logos of various stores accepting your card has the same logos as PayWithMoon's website. You only changed their order and have 5 logos instead of 6. Why should anybody believe you are legitimate and not some copycat scammer ripping off an established brand?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PayWithAnon",
      "created_time": "October 12, 2023, 03:19:16 PM",
      "body": "Quote from: yahoo62278 on October 07, 2023, 05:28:20 AMSo if we load the card with $1000 we lose $100 off the top? Seems like a pretty high fee if ya ask me. Why wouldn't I just use an exchange and send the money to my bank? 10% fee just to avoid KYC? 10% everytime I load the card?In the longrun if you are looking to avoid taxes you would save money, but we still gotta trust you aren't going to take off with our money. Quote from: dkbit98 on October 10, 2023, 09:41:56 PMYou have to pay 10% every time you load card with coins, this is what their website support told me. Way to expensive for me.Our fee of 10% is still a lot cheaper than our competitors like ezzo-card. They charge between 17 and 30%. As the volume rise, we will definitely be able to lower our fees in the future.Quote from: FinneysTrueVision on October 12, 2023, 04:58:06 AMI've noticed many similarities between this product and PayWithMoon. Similar domain name, same brand colors, nearly identical terms & conditions with some slight rewording. Even the area where you show the logos of various stores accepting your card has the same logos as PayWithMoon's website. You only changed their order and have 5 logos instead of 6. Why should anybody believe you are legitimate and not some copycat scammer ripping off an established brand?Our platform is similar to PayWithMoon, however we offer more features. The terms are generic for this type of service and most of the time it's up-to the banks what should be included in the Terms of Service and approved by the banks. That said, our text, logo and platform are unique and are not similar to PayWithMoon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jonaedbd",
      "created_time": "October 14, 2023, 08:33:18 PM",
      "body": "I am the developer of this project and the owner of the website didn't paid me a single penny. If anybody wants the product please contact me at jonaed.com.bd@gmail.com I'd love to sell the codebase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alani123",
      "created_time": "October 14, 2023, 11:10:31 PM",
      "body": "Quote from: jonaedbd on October 14, 2023, 08:33:18 PMI am the developer of this project and the owner of the website didn't paid me a single penny. If anybody wants the product please contact me at jonaed.com.bd@gmail.com I'd love to sell the codebase.lol",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jonaedbd",
      "created_time": "October 15, 2023, 12:53:25 AM",
      "body": "Quote from: alani123 on October 14, 2023, 11:10:31 PMQuote from: jonaedbd on October 14, 2023, 08:33:18 PMI am the developer of this project and the owner of the website didn't paid me a single penny. If anybody wants the product please contact me at jonaed.com.bd@gmail.com I'd love to sell the codebase.lolYep, it's true. If anybody wants the product please contact me at jonaed.com.bd@gmail.com I'd love to sell the codebase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}