{
  "id": "topic_5473508",
  "title": "Sim_card",
  "author": "Sim_card",
  "created_time": "November 09, 2023, 03:32:05 PM",
  "content": "This is a warning to newbies and a reminder to old members that they should not leave their coins in an exchange. Some old members would not learn from other peoples mistake but they will want to learn from their own mistake.From the word exchange, it means that it is where one goes to buy and sell cryptocurrency to fiat and vice versa. I have observed that newbies don't know the difference between an exchange account and a bitcoin wallet. When you register with an exchange, they have a bitcoin address available for you, in which you can use to receive bitcoin and send bitcoin but that is not a wallet. It is advisable that before you buy your bitcoin, you should have created a noncustodial wallet like electrum or blue wallet and only download the wallet app from the original website. After setting up your wallet and you have your seedphrase backed up, this is when you can now go to the next step of buying your bitcoin from an exchange. After you must have bought your bitcoin from an exchange, you should not waste any little time but transfer your bitcoin Asap to your noncustodial wallet to safe gaurd your bitcoin.Exchanges are used by traders for their daily trading and as a newbie, you shouldn't jump into trading until your have learnt the fundamental analysis and technical analysis to your proper understanding and also have learnt how to read charts, this is because trading is very risky and a newbie with zero knowledge on trading will end up losing all his coins. You should see exchange as a market place where you go to buy and sell and when you are done with whatever you went for in the market, you take your goods home because if you leave what you went to buy or sell in the market it will be stolen in the market.See exchanges in this same way and whatever that makes you to use an  exchange, when you are done, you should not leave your funds in there. We have seen big exchanges like FTX crashed and the whole thing is still a drama currently. You should only leave the amount that you can afford to lose in an exchange and don't for once risk your bitcoin. This is because exchanges are in full control of your bitcoin and they will decide what happens to your coins the moment you keep it in their custody.Keep your bitcoin safe from third party.Not your keys not your coins.Let's discuss.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473508",
  "comments": [
    {
      "author": "Hamza2424",
      "created_time": "November 09, 2023, 03:42:18 PM",
      "body": "The taste of learning from their own mistakes is much more pleasing compared to the so-called unexperienced learnings , TBH those who care don't need any sort of reminder. I've SEEN SUCH Stubborns haha. For newbies with a self-custody reminder I want to make them that it's not that simple make sure to realize the network fees, if you are holding for the short term with a lower capital it's is not worth it to move coins to the self custody better prefer a reputed exchange where, you've bought them. In the other case where you are accumulating for a longer timespan, you can consider the self custoday and its more likely recomennded.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "November 09, 2023, 03:53:54 PM",
      "body": "Frankly, I no longer blame beginners for making such fatal mistakes, despite all the repeated recommendations. When I see experienced users who have sufficient experience and cognitive capabilities falling victim as a result of their negligence and irresponsible behavior, blaming beginners becomes meaningless.The only explanation I found to justify these behaviors of the experienced members is their negligence and failure to take the necessary precautions resulting from their false sense of security. Because the losses incurred by users on platforms that are hacked or that steal their clients’ assets are huge amounts, and not all of them can be owned by novice users.I really hope that people will consider the mistakes of others and not trust these platforms, whether they are regulated or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "November 09, 2023, 04:02:08 PM",
      "body": "This is one of the most repetitive threads on the forum aside newbies announcing their arrival here, I would say this constant reminder is definitely needed as newbies are coming every and with centralized exchanges promising them that their funds are save with them especially at this period of time (accumulation period), they need to be aware that these exchanges can never be trusted no matter their liquidity or reputation on social media. Quote from: Sim_card on November 09, 2023, 03:32:05 PMIt is advisable that before you buy your bitcoin, you should have created a noncustodial wallet like electrum or blue wallet and only download the wallet app from the original website. As OP pointed out the most important thing is to download the right wallet and with many fake wallet apps around the best way to know if the wallet you downloaded is the right one is by verifying it. You can verify your electrum wallet by following the guide on this thread. The two wallet listed by OP is a bitcoin only wallet. For Altcoins you can use unstoppable wallet or any wallet but it should be an open source wallet. And for maximum security you use an offline wallet like hardware wallets or airgapped  wallets. QuoteAfter setting up your wallet and you have your seedphrase backed up, It’s worth mentioning that seed phrases should be stored offline probably on papers and in rare cases of natural disasters on Stainless steels and in different locations. You can also add passphrase to your seed as second layer of security should it get compromised. On no account should you trust password managers to store your seeds. Lastly prioritize decentralized exchanges or exchanges that do not require KYC for trading of tire coins to ensure maximum anonymity or privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "November 09, 2023, 04:10:07 PM",
      "body": "Quote from: Sim_card on November 09, 2023, 03:32:05 PMLet's discuss.There isn't a lot to talk about here. Everything that's been said is important for anyone who owns or is new to Bitcoin. Exchanges are for trading, not for storing money. If someone keeps their funds in an exchange, they need to be ready for any risks. For me I only funds my exchange wallet when I'm going to trade. I'd suggest the same for everyone else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "November 09, 2023, 04:39:54 PM",
      "body": "Quote from: Sim_card on November 09, 2023, 03:32:05 PMAfter you must have bought your bitcoin from an exchange, you should not waste any little time but transfer your bitcoin Asap to your noncustodial wallet to safe gaurd your bitcoin.I like your analogy down there, throwing light on exchange with reference to what's obtainable in a real life commonplace market situation. Any simple minded person or layman should be able to grab something from that illustration. However, what hasn't ceased to amuse me is how everyone is on the beat about why people shouldn't leave their funds on exchanges. There should be a demarcation in that respect between someone hodling and someone trading. Traders aren't of the same make with hodlers. We shouldn't expect traders not to leave funds on exchanges. How do they execute trades if they don't have ready funds for them on exchanges? Perhaps, what should be canvassed should be not to leave idle funds on exchanges for a long time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "traderethereum",
      "created_time": "November 09, 2023, 05:00:38 PM",
      "body": "Yes, it is true that we do not need to keep all the assets on the exchange to avoid bad things that can happen on the exchange. We have seen what happened to some exchanges that became scams or even closed their exchanges because they could not explain the situation and circumstances.Therefore, we must immediately move those assets if we have purchased them from the exchange.It's better to keep it in a separate wallet that we can control completely so we won't worry about anything.And we know that bitcoin is already expensive right now so we should really keep it in that separate wallet. There are many wallets that we can use so we have to find one that suits us.Beginners may not be able to buy a hardware wallet, so they can use a wallet that can be installed on their smartphone. That is enough to secure all our assets as long as we can look after them well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "November 09, 2023, 05:17:37 PM",
      "body": "There's not a ton to talk about here.  Your warning and reminder make total sense.  but we've seen these kinds of warnings a million times before. and  It's crazy how some people whove been around a while still don't get the risks.  The distinction between an exchange account and a noncustodial wallet is so important.  And you're so right to say that people need to make a secure wallet before jumping into exchanges. But for some folks, it's not just ignorance or laziness.  The exchanges need traders to function.  What good is a coin exchange if no one is buying or selling coins?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Antotena",
      "created_time": "November 09, 2023, 09:54:21 PM",
      "body": "Quote from: Hamza2424 on November 09, 2023, 03:42:18 PMThe taste of learning from their own mistakes is much more pleasing compared to the so-called unexperienced learnings , TBH those who care don't need any sort of reminder. I've SEEN SUCH Stubborns haha. For newbies with a self-custody reminder I want to make them that it's not that simple make sure to realize the network fees, if you are holding for the short term with a lower capital it's is not worth it to move coins to the self custody better prefer a reputed exchange where, you've bought them. In the other case where you are accumulating for a longer timespan, you can consider the self custoday and its more likely recomennded.Poor orientation beget all sort of things can harm them! If not for this forum and some other crypto related platforms, many will have been victims of this and we will prolly have more of people that keeps coins on the exchanges. We might not have the result but if they should take census of users that kept coins on the exchange from 2021 to now, we will have more of people that joined crypto between this years(2020-2023) and it is because they are not aware or didn't take note of that, despite all that has happen since FTX collapse, they believe Binance is the best for them and that is because Binance give them more awareness than we here in the forum, only a gullible here will not know the dangers of exchange and still use an exchange to keep coin.FTX should be a lesson for people that keeps their coin on any exchange because some many lost their lives because that mistake. If you are not a trader, I see no logical why you a coin should be left on any exchange and even as a trader, it's better to remove some of them and withdraw them out of the exchange when you are not trading for the time being to avoid pain stories that will make you start from scratch.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "November 09, 2023, 10:01:10 PM",
      "body": "I thought OP was going to tell us a personal experience that motivated the creation of this topic. To be honest, I’m surprised we are still discussing about this, enough has been said on the topic already and if recent events cannot teach newbies and old members (I doubt if anyone who’s been here for six months would make such a mistake) to store your coins in a non custodial wallet, then you will likely learn the hard way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "November 09, 2023, 10:01:22 PM",
      "body": "Left and right threads we see these nonstop threads about advising not to leave the coins in exchanges and even for simple replies, we tend to say this.But that's good because we're keeping everyone reminded that it's not a good thing when you're not going to use an exchange as is but a storage of your assets.Also some threads have been discussing about those robbers that are also getting the exchanges fund through forceful robbing, so be careful with those too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "November 09, 2023, 10:02:13 PM",
      "body": "Well, it's not bad to keep reminding users about this important advice despite the fact that the same topic, same facts, and same logic have been discussed on the board several times, but some people still get ignorant and deposit their coins on the centralized exchange for the sake of getting a small ROI. There was a thread created some weeks ago when the OP was asking where he could invest his crypto in order to make a profit. In the comments, someone mentioned staking his coin, which got me wondering if there's any place one can stake their coins if not on centralized platforms. Centralized exchange is not actually a wise place to store coins, like you said.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "November 09, 2023, 10:22:07 PM",
      "body": "Quote from: Sim_card on November 09, 2023, 03:32:05 PMSee exchanges in this same way and whatever that makes you to use an  exchange, when you are done, you should not leave your funds in there. We have seen big exchanges like FTX crashed and the whole thing is still a drama currently. You should only leave the amount that you can afford to lose in an exchange and don't for once risk your bitcoin. This is because exchanges are in full control of your bitcoin and they will decide what happens to your coins the moment you keep it in their custody.Keep your bitcoin safe from third party.Not your keys not your coins.Let's discuss.The issue is not limited to financial losses only in case of bankruptcy or hacking of these exchange platforms but also extends to the leakage of sensitive customer information and KYC documents provided by the client to use these platforms. The advice not to leave any person's currencies on centralized exchange platforms is well-known. Still, many beginners are unwilling to transfer their currencies to any hardware wallet. Although acquiring a hardware wallet can be costly, it can be done through popular desktop or mobile decentralized wallets. I do not know why they trust these exchange platforms, which may freeze their assets at any moment or require them to undergo additional complex verification procedures. If they prefer long-term investment and want to feel reassured after years of holding their assets, they should transfer them to any wallet they have complete control over, including its security details. Exchange platforms are only for trading and P2P transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goodbed",
      "created_time": "November 10, 2023, 05:16:03 AM",
      "body": "Quote from: Hatchy on November 09, 2023, 04:10:07 PMQuote from: Sim_card on November 09, 2023, 03:32:05 PMLet's discuss.There isn't a lot to talk about here. Everything that's been said is important for anyone who owns or is new to Bitcoin. Exchanges are for trading, not for storing money. If someone keeps their funds in an exchange, they need to be ready for any risks. For me I only funds my exchange wallet when I'm going to trade. I'd suggest the same for everyone else.what is the difference between on exchange wallet and bitcoin wallet, what you suggest on creation on it? Thanks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "November 10, 2023, 05:32:29 AM",
      "body": "Quote from: Sim_card on November 09, 2023, 03:32:05 PMThis is a warning to newbies and a reminder to old members that they should not leave their coins in an exchange.Some topics with similar reminders but maybe there are some points you missed.Reminder: do not keep your money in online accountsBe careful with online servicesSecurity checklistWallet basics",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Winterfrost",
      "created_time": "November 10, 2023, 05:52:40 AM",
      "body": "Quote from: Dr.Bitcoin_Strange on November 09, 2023, 10:02:13 PMWell, it's not bad to keep reminding users about this important advice despite the fact that the same topic, same facts, and same logic have been discussed on the board several times, but some people still get ignorant and deposit their coins on the centralized exchange for the sake of getting a small ROI. There was a thread created some weeks ago when the OP was asking where he could invest his crypto in order to make a profit. In the comments, someone mentioned staking his coin, which got me wondering if there's any place one can stake their coins if not on centralized platforms. Centralized exchange is not actually a wise place to store coins, like you said.To be honest reminding is necessary. Some newbies who joined the Bitcoin system lately are still buying and storing on their exchanges. This is because the persons who introduced them to Bitcoin did not go further to discuss the security aspect with them. There was a thread that a beginner was saying that he was advised to buy and keep his Bitcoin in Kucion exchange. Many people have heard of this information but they still choose to ignore because it hasn't happened to them yet. But this reminder may give them a second though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "November 10, 2023, 08:54:40 AM",
      "body": "Quote from: goodbed on November 10, 2023, 05:16:03 AMwhat is the difference between on exchange wallet and bitcoin wallet, what you suggest on creation on it? Thanks.It's pretty straightforward, mate. Exchange wallets come with your exchange account. you get them when you sign up. These wallets are handy for trading various digital assets on the exchange.Now, a Bitcoin wallet is different. it's a wallet for storing your Bitcoins. If you're trading or doing everyday transactions, go for an exchange wallet. But for keeping your Bitcoins safe for the long hodl, decentralized wallets are the way to go.Here's the deal. It's not recommended to leave your Bitcoins on exchanges. Why? Because most, if not all, exchanges are centralized. That means they control your wallet and have the keys to your deposited cryptocurrencies. They can use this control to help with trading on their platform. So, unless you're actively trading, it's best to keep your coins in a more secure, decentralized wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "November 10, 2023, 09:07:13 AM",
      "body": "Not your keys, not your coins. Discuss? There is nothing to discuss with that statement. It's a clear answer to any of your questions that you must have related to keeping your coins in any exchange or centralized platform. The best part of Bitcoin is to be your own bank and if you are not using that aspect, then you shouldn't be using Bitcoin at all. At least if you don't want to have your own wallet, use a Hardware Wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "November 10, 2023, 09:30:08 AM",
      "body": "Quote from: Winterfrost on November 10, 2023, 05:52:40 AMQuote from: Dr.Bitcoin_Strange on November 09, 2023, 10:02:13 PMWell, it's not bad to keep reminding users about this important advice despite the fact that the same topic, same facts, and same logic have been discussed on the board several times, but some people still get ignorant and deposit their coins on the centralized exchange for the sake of getting a small ROI. There was a thread created some weeks ago when the OP was asking where he could invest his crypto in order to make a profit. In the comments, someone mentioned staking his coin, which got me wondering if there's any place one can stake their coins if not on centralized platforms. Centralized exchange is not actually a wise place to store coins, like you said.To be honest reminding is necessary. Some newbies who joined the Bitcoin system lately are still buying and storing on their exchanges. This is because the persons who introduced them to Bitcoin did not go further to discuss the security aspect with them. There was a thread that a beginner was saying that he was advised to buy and keep his Bitcoin in Kucion exchange. Many people have heard of this information but they still choose to ignore because it hasn't happened to them yet. But this reminder may give them a second though.Not all newbie is good for researching these kind of information that's why its good that there's reminder like this will bump up especially on Beginners board so that they will be aware about possible risk for leaving their balances on exchange even if its reputable and running for long time. What happen to Mt.gox and FTX is really serious matter since they are good exchange before that's why this should serve as a warning for newbies that they should never trust those exchange especially if they are a busy person and cannot monitor what's current happening in the market. Those suggestion where to keep his bitcoin on kucoin is really a bad information they can read so hopefully no people got influence about those words and they continue to do further more research about scams or other important that need to consider.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$crypto$",
      "created_time": "November 10, 2023, 09:33:53 AM",
      "body": "It's not uncommon to see threads that warn against storing assets on exchanges, this has been a common discussion and others have suggested storing in your own wallet that has a key that you hold.theymos has announced this, there are also those who still insist on storing on the exchange, let's leave it alone, the important thing is that we have given advice on it, as long as we don't talk about the dangers of storing assets on the exchange but still use it then it is not logical with the advice given.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}