{
  "id": "topic_5502494",
  "title": "IMcryptosloth",
  "author": "IMcryptosloth",
  "created_time": "July 09, 2024, 04:54:31 PM",
  "content": "TLDR;Question: How can the Bitcoin network host a decentralized identity platform?I believe decentralized digital IDs will be the future.  They will be the answer to the question, \"Who [What] can we trust?\"  Because we can't seem to trust anyone any more - governments, politicians, banks, main stream media, big business, etc.  Decentralized digital IDs can help solve this and decentralized identifiers (DIDs) are key.Utilizing the decentralized, secure, and immutable nature of the Bitcoin network is necessary for the platform.  Why Bitcoin?- because I, like probably many of you, trust Bitcoin more than any other counterparty and believe we can leverage that system of trust for the greater good (I realize that phrase, greater good,  is up to interpretation).MicroStrategy Orange is working on a solution, but it seems geared toward their institutional clients.  MicroStrategy Orange is an \"enterprise-grade platform for implementing bitcoin-based decentralized digital identifiers across an organization\".  Doesn't sound like it's for us plebs.  However, their vision is \"to provide an internet-native decentralized digital identity backed by the bitcoin network\", and this seems to be exactly what I'm talking about.  For more info on MicroStrategy Orange, you can view their 30 minute presentation from their MicroStrategy World: Bitcoin for Corporations 2024 event at https://www.youtube.com/watch?v=nXQWj6P0P1k.  Other than the above presentation, I have found it very difficult to dive in further on MicroStrategy Orange and, more specifically, decentralized identifiers \"on\" Bitcoin.  I keep putting on in \"s because I don't know if the best solution involves DIDs right on mainnet, or a sidechain, or possibly a L2, etc.  So, DIDs on Bitcoin is necessary, but the \"on\" is debatable.  However - I'd argue - if DIDs are NOT on mainnet, there is no need to create a new token/coin.  Similar to the Lightning Network, why can't we just utilize BTC?  I realize there is a non-zero probably that a token is necessary/ideal, and I am open to discuss/debate this viewpoint as well.I've explained (arguably poorly) why DIDs are necessary on Bitcoin but I have not explained, why DIDs in the first place?  I will use governance as an example, but I believe DIDs have the potential to disrupt many additional industries as well - banking, real estate, healthcare, credit, employment, travel, education, and much, much more.Everyone knows about Decentralized Autonomous Organizations (DAOs), correct? [I know, I know... hear me out].  Well, currently, there's nothing decentralized about DAOs at all.  Hence, we call them DINOs - Decentralized In Name Only.  How embarrassing.  But why is this?  Because we have found out that 90% of DAO governance is owned by a very small group of people.  But how is this so?  Because in many cases, DAO voting rights are determined by token ownership - the more tokens you own, the more voting power you have.  But, you argue, they have smart contracts that limit token ownership, how can this be?  Because token ownership is limited by wallet address, and one person can have many different wallet addresses and therefore many votes.  DIDs can address this issue [loophole].  If wallet addresses are essentially individual DIDs, and DIDs are all owned and controlled by a specific individual, then the smart contract that controls ownership percentage is now actually able to successfully limit ownership percentage.  Decentralized autonomous organizations CAN BE decentralized.  Bye-bye DINOs.But what about privacy?  Bitcoin is an open, immutable ledger - so how does all of our personal identifiable information (PII) remain secure?  Zero Knowledge (ZK) technologies.  However, this probably deserves a separate post of its own, so we'll save that for the future.  At this point, I'd like to discuss the idea of a decentralized identity platform on Bitcoin with the assumption that privacy is not an issue.  (It is my understanding that the concept of ZK technologies on Bitcoin is a work in progress, and therefore - in regards to this discussion - it might be best to accept the positive outcome.  However, if the conversation leads us to discuss/debate these privacy concerns, so be it - I'm game.)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5502494",
  "comments": []
}