{
  "id": "topic_5464610",
  "title": "tg88",
  "author": "tg88",
  "created_time": "August 26, 2023, 01:09:05 AM",
  "content": "Essa noticia achei curiosa: Governo dos EUA leva golpe e envia R$ 270 mil em criptomoedas para criminososNão sei se a explicação dada na notícia está correta, o fato é que o DEA tinha USDT sendo guardado em uma Trezor e resolveram enviar para outro endereço que pertence ao governo federal. Eles fizeram uma transferencia de 50 $ para teste e eu entendi que o computador deles estava infectado e teve o endereço de destino da transação substituído por um similar com início e final iguais... Agora na noticia falam sobre um airdrop que entrou no endereço original e deu a entender pra eles que a transação foi creditada com sucesso.Confesso que essa parte do airdrop eu nao entendi  , no meu entendimento os criminosos só enviaram os 50 $ para o endereço original e ai passou a impresao que tudo estava ok e então o DEA enviou mais 55 mil $.   O criminosos utilizaram a Binance para fazer transações com o valor roubado, acho que eles não imaginavam com quem estavam lidando.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464610",
  "comments": [
    {
      "author": "alegotardo",
      "created_time": "August 26, 2023, 01:26:21 AM",
      "body": "É o dinheiro que a DEA sequestrou dos criminosos voltando para a mão deles, que pelo que li esse valor foi apreendido de duas contas usadas por quem trabalhava com tráfico de drogas, agora alguém certamente deve estar muito orgulhoso do trabalho realizado.Mas na real, eu estou acreditando mesmo que isso aí teve participação de alguém infiltrado na DEA, porque essa história ainda está muito confusa ou então foi o PortalDoBitcoin que a interpretou errado e traduziu/trouxe o fato sem se aprofundar melhor no assunto.De toda forma, fica o aprendizado para todo mundo... não confiem apenas nos primeiros e últimos caracteres da chave ao fazer uma transferência. comparem toda a String sempre, se possível façam essas transferências com o auxílio de um computador para que seja possível comparar ambos os endereços ao mesmo tempo sem precisar ficar intercalando de tela.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "August 26, 2023, 03:34:19 PM",
      "body": "Quote from: tg88 on August 26, 2023, 01:09:05 AMConfesso que essa parte do airdrop eu nao entendi  , no meu entendimento os criminosos só enviaram os 50 $ para o endereço original e ai passou a impresao que tudo estava ok e então o DEA enviou mais 55 mil $.   O criminosos utilizaram a Binance para fazer transações com o valor roubado, acho que eles não imaginavam com quem estavam lidando. Não sei se tu ja teve essa experiencia, mas é normal receber uns tokens que parece de ETH/USDT mas na verdade não é. Eles devem ter transferido um token com nome semelhante. Um dia eu abri uma waller minha e tinha seila, algo absurdo como 9.000 ETH em um token falso e no inciio fiquei meu deus que isso, to rica. Mas era só um spamzinho.Mas interessante o golpe, acho que isso de conferir só inicio e fim do endereço, merece uma grande atenção e fica como dica pra nós. Na matéria eles dizem ``o método usado foi um dos mais simples do setor para fraudes. '' Mas os caras antem tiveram que infectar o próprio computador da DEA. De qualquer forma, eu lembro que li uma vez que o Vitalik também fazia isso de fazer uma transação teste e o governo também kkkkkk",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "August 26, 2023, 04:09:09 PM",
      "body": "Agora re-li a matéria inteira original e eles citam que a DEA entrou em contato com a Tether pedindo congelamento da conta e a Tether disse que o dinheiro já tinha subido e por isso não podia fazer nada. Mas a Tether tem poder de congelar as contas?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "August 26, 2023, 06:45:51 PM",
      "body": "Quote from: Disruptivas on August 26, 2023, 04:09:09 PMMas a Tether tem poder de congelar as contas? Com certeza tem. Já fizeram isso várias vezes. Basta uma ordem judicial, principalmente se for dos Estados Unidos, eles congelaram a conta imediatamente. Tem vários endereços no blockchain da ethereum congelados. Principalmente de stablecoins envolvidos em Hacks e crimes de extorsão. Quem ousaria não cumprir o que o Tio Sam manda. Hahaha",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "August 26, 2023, 06:57:09 PM",
      "body": "Quote from: Disruptivas on August 26, 2023, 04:09:09 PMAgora re-li a matéria inteira original e eles citam que a DEA entrou em contato com a Tether pedindo congelamento da conta e a Tether disse que o dinheiro já tinha subido e por isso não podia fazer nada. Mas a Tether tem poder de congelar as contas? Facilmente… Uma única função e ambas Tether e Circle conseguem congelar as stables de qualquer endereço, até de smartcontracts de exchanges descentralizadas. Por exemplo, a Tether poderia hoje mesmo acabar com todas as pools que tem o par USDT no Uniswap, Sushiswap, etc...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "August 27, 2023, 01:14:57 AM",
      "body": "Quote from: Disruptivas on August 26, 2023, 04:09:09 PMMas a Tether tem poder de congelar as contas? Pela Dune dá para ver os endereços banidos pela Tether, Circle, etcUSDT: https://dune.com/phabc/usdt---banned-addresses (US$ 471 milhões já )USDC: https://dune.com/phabc/usdc-banned-addresses (US$ 68 milhões)Quote from: tg88 on August 26, 2023, 01:09:05 AMo endereço de destino da transação substituído por um similar com início e final iguais...  Estava lendo sobre esse tipo de golpe outro dia, afinal muita gente só confere o início e fim (e algumas carteiras também mostram só essas partes).. Para complicar, os golpistas estão enviando transações a partir de tais endereços, ai o usuário acaba copiando o endereço errado a partir de seu histórico de transações sem perceber que não é o dele. Fonte: https://livecoins.com.br/ceo-da-binance-anuncia-congelamento-de-us-20-milhoes/Tentei usar um VanityGen para ver quanto tempo demora para gerar um endereço do tipo, mas só consegui mudar o começo ou o final.. de qualquer forma é um trabalho demorado e custoso (precisa de GPUs boas e pagar pela energia)..Melhor é sempre conferir o endereço inteiro, umas 3 vezes",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "August 27, 2023, 01:11:09 PM",
      "body": "Quote from: sabotag3x on August 27, 2023, 01:14:57 AMTentei usar um VanityGen para ver quanto tempo demora para gerar um endereço do tipo, mas só consegui mudar o começo ou o final.. de qualquer forma é um trabalho demorado e custoso (precisa de GPUs boas e pagar pela energia)..Lembrei de um antigo tópico aqui da nossa aba local onde se não me engano o Alegotardo gerou um endereço de BTC muito chique com as iniciais do nome de usuário dele, na época não me animei para dar uma pausa na mineração para gerar um endereço personalisado pois realmente é algo que exige esforço.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l3pox",
      "created_time": "August 29, 2023, 12:02:26 PM",
      "body": "Quote from: alegotardo on August 26, 2023, 01:26:21 AMÉ o dinheiro que a DEA sequestrou dos criminosos voltando para a mão deles, que pelo que li esse valor foi apreendido de duas contas usadas por quem trabalhava com tráfico de drogas, agora alguém certamente deve estar muito orgulhoso do trabalho realizado.Mas na real, eu estou acreditando mesmo que isso aí teve participação de alguém infiltrado na DEA, porque essa história ainda está muito confusa ou então foi o PortalDoBitcoin que a interpretou errado e traduziu/trouxe o fato sem se aprofundar melhor no assunto.De toda forma, fica o aprendizado para todo mundo... não confiem apenas nos primeiros e últimos caracteres da chave ao fazer uma transferência. comparem toda a String sempre, se possível façam essas transferências com o auxílio de um computador para que seja possível comparar ambos os endereços ao mesmo tempo sem precisar ficar intercalando de tela.será que já existe algum malware que além de substituir o endereço, cria uma visualização falsa na tela do computador para parecer que vc está enviando para o endereço certo?De toda forma a ledger/trezor provavelmente mostraria que você está enviando para o endereço do golpista, mas ainda assim seria mais difícil perceber a cilada se a pessoa assina coisas sem atenção.nesse caso pelo que entendi só a segunda transação, maior, foi pro hacker, e a primeira de teste foi para o lugar certo, né?como será que fizeram, com um filtro para pegar apenas transações grandes?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}