{
  "id": "topic_5457405",
  "title": "elevates",
  "author": "elevates",
  "created_time": "June 24, 2023, 11:45:41 AM",
  "content": "I found this image on a different forum. RBI is approaching random national bank customers or is asking national bank staff to test the wallet. I went through all the replies on that thread. The most important question that everyone was asking was why India needs e-Ruppe while UPI doing pretty well. Some of them started comparing it with UPI and most found it similar. I laughed all out when the OP on one of his replies thought that CBDC will give anonymity to its users. To that reply, a user gave a counter reply as to how much the e-Rupee will help the Government to track everyone's transactions. That according to me is correct as a government's digital currency is meant to track transactions. The reason being the government is still not able to stop illegal activities such as money laundering using the UPI. Banking frauds plus scams are not that easy to solve. With the CBDC project, they plan to counter this issue. As the wallet is still in the testing phase some users have said that it is full of bugs. Hopefully, they would get solved. What do you guys think about it and if given a chance would you test this wallet? Above is the image of the wallet dashboard. All credits go to the creator of that thread u/PerfectKills.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457405",
  "comments": [
    {
      "author": "teosanru",
      "created_time": "June 24, 2023, 04:48:19 PM",
      "body": "Quote from: elevates on June 24, 2023, 11:45:41 AMI found this image on a different forum. RBI is approaching random national bank customers or is asking national bank staff to test the wallet. I went through all the replies on that thread. The most important question that everyone was asking was why India needs e-Ruppe while UPI doing pretty well. Some of them started comparing it with UPI and most found it similar. I laughed all out when the OP on one of his replies thought that CBDC will give anonymity to its users. To that reply, a user gave a counter reply as to how much the e-Rupee will help the Government to track everyone's transactions. That according to me is correct as a government's digital currency is meant to track transactions. The reason being the government is still not able to stop illegal activities such as money laundering using the UPI. Banking frauds plus scams are not that easy to solve. With the CBDC project, they plan to counter this issue. As the wallet is still in the testing phase some users have said that it is full of bugs. Hopefully, they would get solved. What do you guys think about it and if given a chance would you test this wallet? Above is the image of the wallet dashboard. All credits go to the creator of that thread u/PerfectKills.Ok just help me explain how exactly do you think it'll help you solve money laundering or such issues. Or let's say why do you think UPI can't solve this issue? The main idea whenever you want to track money laundering is the visibility of transaction which is available in both UPI and CBDC and infact was there in cheques and NEFT as well. CBDC will establish trails but truth is UPI already does that and every banking transactions does that. Even I have the question that why do we need the CBDC? Just to join the trend?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elevates",
      "created_time": "June 25, 2023, 01:17:26 PM",
      "body": "Quote from: teosanru on June 24, 2023, 04:48:19 PMOk just help me explain how exactly do you think it'll help you solve money laundering or such issues. Or let's say why do you think UPI can't solve this issue? The main idea whenever you want to track money laundering is the visibility of transaction which is available in both UPI and CBDC and infact was there in cheques and NEFT as well. CBDC will establish trails but truth is UPI already does that and every banking transactions does that. Even I have the question that why do we need the CBDC? Just to join the trend?The solution: To use UPI you would require a bank account. To use eRuppe you would not need a bank account. You only need this wallet and that is done. Now, let's look into the pain area for the government. Now, you might ask then why promote UPI? My point of view is that UPI got promoted accidentally because of the COVID-19 virus. Otherwise, it would have been hard for the government to get those kinds of transactions. There are still a lot of cash transactions happening and with the eRupee they would be controlling these transactions. Do remember the parallel economy that we had of unreported cash transactions has not disappeared. It is still active and thriving. The pain area: Unable to stop bank frauds, unable to stop financial scams, and Unable to stop counterfeiting. All these would be taken care of with the eRupee. You should read this article which was published last year about the benefits. Go through points 4, 6, 8 & 10. What I found hilarious is the first point. We are here because of decentralization, they are promoting a centralized product. You will get all your answers if you read this article thoroughly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "teosanru",
      "created_time": "June 25, 2023, 03:56:39 PM",
      "body": "Quote from: elevates on June 25, 2023, 01:17:26 PMQuote from: teosanru on June 24, 2023, 04:48:19 PMOk just help me explain how exactly do you think it'll help you solve money laundering or such issues. Or let's say why do you think UPI can't solve this issue? The main idea whenever you want to track money laundering is the visibility of transaction which is available in both UPI and CBDC and infact was there in cheques and NEFT as well. CBDC will establish trails but truth is UPI already does that and every banking transactions does that. Even I have the question that why do we need the CBDC? Just to join the trend?The solution: To use UPI you would require a bank account. To use eRuppe you would not need a bank account. You only need this wallet and that is done. Now, let's look into the pain area for the government. Now, you might ask then why promote UPI? My point of view is that UPI got promoted accidentally because of the COVID-19 virus. Otherwise, it would have been hard for the government to get those kinds of transactions. There are still a lot of cash transactions happening and with the eRupee they would be controlling these transactions. Do remember the parallel economy that we had of unreported cash transactions has not disappeared. It is still active and thriving. The pain area: Unable to stop bank frauds, unable to stop financial scams, and Unable to stop counterfeiting. All these would be taken care of with the eRupee. You should read this article which was published last year about the benefits. Go through points 4, 6, 8 & 10. What I found hilarious is the first point. We are here because of decentralization, they are promoting a centralized product. You will get all your answers if you read this article thoroughly.I get the point on two things, one is the intermediary banks will be eliminated therefore unnecessary settlement of books which is done within these banks will be eliminated. Enhanced visibility is a myth, they already have too much visibility especially with SFTRA in place, they are having all the major transactions monitored. And also UPI promotion wasn't an accident for sure. It did got accelerated due to Covid but the plan was fool proof starting from demonetisation itself",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "June 26, 2023, 03:30:15 AMLast edit: June 26, 2023, 03:46:26 AM by pakhitheboss",
      "body": "A few Youtube finance influencers have now been invited to test the wallet and describe their user experience. I recently watches one of those videos and found it very interesting and engaging. After watching it I was pretty convinced that the government would be able to stop the counterfeiting of INR with digital rupee. The reason being it comes with a currency number and when you make a payment the same note gets transferred to the payee. Only certain denominations are available wherein the lowest denomination is INR 0.50 and the biggest denomination at the moment is INR 2000. Why it has a 2000 rupee note has been explained in the video. Do watch this Video.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elevates",
      "created_time": "June 26, 2023, 12:14:02 PM",
      "body": "Quote from: pakhitheboss on June 26, 2023, 03:30:15 AMA few Youtube finance influencers have now been invited to test the wallet and describe their user experience. I recently watches one of those videos and found it very interesting and engaging. After watching it I was pretty convinced that the government would be able to stop the counterfeiting of INR with digital rupee. The reason being it comes with a currency number and when you make a payment the same note gets transferred to the payee. Only certain denominations are available wherein the lowest denomination is INR 0.50 and the biggest denomination at the moment is INR 2000. Why it has a 2000 rupee note has been explained in the video. Do watch this Video.This is really an eye opening video! The currency number would solve a lot of issues that the RBI is facing. What I like most is how simply a digital 4 rupee can be sent. I guess a lot went into designing the CBDC. While the US is still working on developing one India has already gone ahead and is in the phase of testing. Initially, they did explain the difference between Bitcoin and CBDC which is correct. The question that came to my mind was, how many Indians will understand the big difference between centralization & decentralization? Thanks for sharing this video.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "June 26, 2023, 04:09:16 PM",
      "body": "Quote from: elevates on June 24, 2023, 11:45:41 AMI found this image on a different forum. RBI is approaching random national bank customers or is asking national bank staff to test the wallet. I went through all the replies on that thread. The most important question that everyone was asking was why India needs e-Ruppe while UPI doing pretty well. Some of them started comparing it with UPI and most found it similar. I laughed all out when the OP on one of his replies thought that CBDC will give anonymity to its users. To that reply, a user gave a counter reply as to how much the e-Rupee will help the Government to track everyone's transactions. That according to me is correct as a government's digital currency is meant to track transactions. The reason being the government is still not able to stop illegal activities such as money laundering using the UPI. Banking frauds plus scams are not that easy to solve. With the CBDC project, they plan to counter this issue. As the wallet is still in the testing phase some users have said that it is full of bugs. Hopefully, they would get solved. What do you guys think about it and if given a chance would you test this wallet? Above is the image of the wallet dashboard. All credits go to the creator of that thread u/PerfectKills.I am a Quality Tester by profession and I would love to test this application because finding bugs is my passion.I personally think CBDC should be used for counterfeiting and money laundering as both of these issues can be tacked with cryptocurrencies.It all depends on how the government use it whether it is for their own benefit or for it's citizens benefits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "June 26, 2023, 06:16:35 PM",
      "body": "Not just government banks, even private banks are inviting people to test digital rupee wallet. I have received calls from my bank for the same but politely declined the invite. However, if you are willing to test and try the wallet. All major private banks have launched their wallet and available in their websites. Here's the link of ICICI Bank,https://www.icicibank.com/personal-banking/online-services/funds-transfer/digital-rupee",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "June 27, 2023, 05:34:53 AM",
      "body": "Quote from: avikz on June 26, 2023, 06:16:35 PMNot just government banks, even private banks are inviting people to test digital rupee wallet. I have received calls from my bank for the same but politely declined the invite. However, if you are willing to test and try the wallet. All major private banks have launched their wallet and available in their websites. Here's the link of ICICI Bank,https://www.icicibank.com/personal-banking/online-services/funds-transfer/digital-rupeeYes, it is already on the Google play store depending on the bank you have an account with you can download it. The outer screen will look different but the UI/UX is the same for all banks. I do not think you can apply for testing of the wallet as it is at the moment on an invite basis. If your bank thinks you are worthy of testing this application then only you would get an invite. My bank does not think about it in the same way at the moment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bureau",
      "created_time": "June 27, 2023, 08:07:09 AM",
      "body": "Any news or information when it will be rolled out for the general public? I did search on Google, wasn't able to find anything about it. It looks good at the moment, hoping it to be robust like UPI.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elevates",
      "created_time": "June 27, 2023, 11:31:36 AM",
      "body": "Quote from: avikz on June 26, 2023, 06:16:35 PMNot just government banks, even private banks are inviting people to test digital rupee wallet. I have received calls from my bank for the same but politely declined the invite. Why did you decline it? Eventually everyone would be using this wallet. Before us you did got a chance to familiarize with the wallet. I saw the video shared by pakhitheboss. The blockchain developed by the RBI is pretty fast. I saw the transaction completing in a few seconds. What came into my mind after watching it is that what will happen when everyone starts using the it? Will there be any issues with the transaction speed? Will the blockchain be able to handle a lot of transaction? We are talking about India which has a big internet penetration and lots of smartphone user. Since the Blockchain is private technical information might not be shared with the public.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "IIrik11",
      "created_time": "June 27, 2023, 11:35:09 AM",
      "body": "i don't know nothing about this, btw.i guess it would be like usdt backed by rupee, right?and the difference from upi would be that it will be on blockchain?and it can be used to send/receive transactions worldwide?i am hoping buying bitcoin using this would be easier since it would be easier to buy this in indian market..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bureau",
      "created_time": "June 27, 2023, 12:39:31 PM",
      "body": "Quote from: IIrik11 on June 27, 2023, 11:35:09 AMi don't know nothing about this, btw.i guess it would be like usdt backed by rupee, right?and the difference from upi would be that it will be on blockchain?and it can be used to send/receive transactions worldwide?i am hoping buying bitcoin using this would be easier since it would be easier to buy this in indian market..  Get yourself ready for an impenetrable product from the government of India. We have seen how successfully UPI has controlled every part of our daily activities. You can be rest assured this blockchain base INR will do more than UPI.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "June 28, 2023, 02:32:57 AM",
      "body": "Quote from: elevates on June 26, 2023, 12:14:02 PMThe question that came to my mind was, how many Indians will understand the big difference between centralization & decentralization. I don't think most would care in first place, if it's from government it must be safe. It'll be interesting to see how this is gonna be adopted in India. I'm quite proud of upi system, let's see how this gonna turn out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "June 28, 2023, 09:55:24 AM",
      "body": "Quote from: libert19 on June 28, 2023, 02:32:57 AMI don't think most would care in first place, if it's from government it must be safe. It'll be interesting to see how this is gonna be adopted in India. I'm quite proud of upi system, let's see how this gonna turn out. As a third-world country, every Indian is proud of the UPI, and why not we have built our own payment system which is far superior to any other payment system used by other Governments worldwide. It would be really interesting to watch whether CBDC can bring that same trust and confidence as UPI has been able to do till now. As for adoption, there is nothing an Indian can do but adopt it, we do not have any other option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "June 30, 2023, 04:02:23 PM",
      "body": "Quote from: pakhitheboss on June 28, 2023, 09:55:24 AMQuote from: libert19 on June 28, 2023, 02:32:57 AMI don't think most would care in first place, if it's from government it must be safe. It'll be interesting to see how this is gonna be adopted in India. I'm quite proud of upi system, let's see how this gonna turn out. As a third-world country, every Indian is proud of the UPI, and why not we have built our own payment system which is far superior to any other payment system used by other Governments worldwide. It would be really interesting to watch whether CBDC can bring that same trust and confidence as UPI has been able to do till now. As for adoption, there is nothing an Indian can do but adopt it, we do not have any other option.UPI had solved a big problem for us and has helped us with our day to day transactions.What difference will digital rupee bring to the table will directly tell us if it would make a positive impact in India or not.If digital rupee doesn't have anything different to offer then I don't think people will be interested in using it.Personally, I believe there are some positive usecases for digital rupee but I wonder if the government has those plans with it or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "July 01, 2023, 02:02:13 AM",
      "body": "Quote from: pawanjain on June 30, 2023, 04:02:23 PMUPI had solved a big problem for us and has helped us with our day to day transactions.What difference will digital rupee bring to the table will directly tell us if it would make a positive impact in India or not.If digital rupee doesn't have anything different to offer then I don't think people will be interested in using it.Personally, I believe there are some positive usecases for digital rupee but I wonder if the government has those plans with it or not.The biggest difference between UPI & Digital Rupee is that one needs a bank account and the other doesn't need a bank account. At the moment it is not clear how to load the wallet without a bank account. It is still in testing phase and after the wallet testing is completed we would know how it will be done.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "July 01, 2023, 12:58:50 PM",
      "body": "Just found a detailed video on Youtube by Labour Law Advisor on eRupee and it has cleared many doubts.Here's the link everyone should watch How to use e-Rupee | Digital Rupee App Tutorial | CBDCIn the year 2021-2022 the government spent around 5000 crore rupees for printing cash and the year previous to that it spent around 4000 crore rupees just to print more cash.The eRupee will be a digital currency issued by the RBI. It will be a legal tender backed by RBI. So the cost of printing issuing more money will become zero.The key takeaways from the video are:It will work on top of a Centralized Private blockchain which will be controlled by RBI.Holders need not have a bank account for holding eRupee.Transactions will remain anonymous for small values but can be traceable for higher values.It will be energy efficient when compared to cash.It will improve cross border transactions.In future, it will become interoperable with UPI and we will be able to scan UPI QR codes to send them eRupee.Note: Currently, eRupee is only on invite basis but it will soon be rolled out for public use.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elevates",
      "created_time": "July 02, 2023, 02:05:05 PM",
      "body": "Quote from: pawanjain on July 01, 2023, 12:58:50 PMJust found a detailed video on Youtube by Labour Law Advisor on eRupee and it has cleared many doubts.Here's the link everyone should watch How to use e-Rupee | Digital Rupee App Tutorial | CBDCIn the year 2021-2022 the government spent around 5000 crore rupees for printing cash and the year previous to that it spent around 4000 crore rupees just to print more cash.The eRupee will be a digital currency issued by the RBI. It will be a legal tender backed by RBI. So the cost of printing issuing more money will become zero.The key takeaways from the video are:It will work on top of a Centralized Private blockchain which will be controlled by RBI.Holders need not have a bank account for holding eRupee.Transactions will remain anonymous for small values but can be traceable for higher values.It will be energy efficient when compared to cash.It will improve cross border transactions.In future, it will become interoperable with UPI and we will be able to scan UPI QR codes to send them eRupee.Note: Currently, eRupee is only on invite basis but it will soon be rolled out for public use.Great summarising for the video posted by LLA. I did see the video as it was shared earlier in this thread by pakhitheboss. I still have questions about the Blockchain used by RBI to run the digital rupee. As of now we sometime face issues with UPI as in the transaction getting canceled or getting debited but not reaching the client. I am expecting somewhat like the mentioned situation with this wallet. When it happens RBI might get a backlash. What I assume the government wants is to simply eradicate cash, card, and credit transaction from the system. I do feel they as in the government might succed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "July 02, 2023, 02:11:43 PM",
      "body": "Quote from: elevates on July 02, 2023, 02:05:05 PMQuote from: pawanjain on July 01, 2023, 12:58:50 PMJust found a detailed video on Youtube by Labour Law Advisor on eRupee and it has cleared many doubts.Here's the link everyone should watch How to use e-Rupee | Digital Rupee App Tutorial | CBDCIn the year 2021-2022 the government spent around 5000 crore rupees for printing cash and the year previous to that it spent around 4000 crore rupees just to print more cash.The eRupee will be a digital currency issued by the RBI. It will be a legal tender backed by RBI. So the cost of printing issuing more money will become zero.The key takeaways from the video are:It will work on top of a Centralized Private blockchain which will be controlled by RBI.Holders need not have a bank account for holding eRupee.Transactions will remain anonymous for small values but can be traceable for higher values.It will be energy efficient when compared to cash.It will improve cross border transactions.In future, it will become interoperable with UPI and we will be able to scan UPI QR codes to send them eRupee.Note: Currently, eRupee is only on invite basis but it will soon be rolled out for public use.Great summarising for the video posted by LLA. I did see the video as it was shared earlier in this thread by pakhitheboss. I still have questions about the Blockchain used by RBI to run the digital rupee. As of now we sometime face issues with UPI as in the transaction getting canceled or getting debited but not reaching the client. I am expecting somewhat like the mentioned situation with this wallet. When it happens RBI might get a backlash. What I assume the government wants is to simply eradicate cash, card, and credit transaction from the system. I do feel they as in the government might succed.I don't think the issue you mentioned with UPI will happen with eRupee because it is running on a blockchain and the transactions are P2P.So if the eRupee is debited from your wallet it directly means it is credited to the other wallet.I believe this is a good move because it will have the capability to solve many issues we currently have with fiat cash.It will help in counterfeiting notes and will also help the government with anti money laundering.It will also help in giving out loans, fight corruption and the capabilities are endless.P.S: I didn't notice @pakhitheboss mentioned the video already else I wouldn't have posted it again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}