{
  "id": "topic_5461348",
  "title": "Yabani",
  "author": "Yabani",
  "created_time": "July 28, 2023, 07:51:19 PM",
  "content": "QuoteWe're introducing a new rule requiring your CoinList account to be fully funded with your desired purchase amount before you can complete a transaction in our Community Sales.Kaynak : https://blog.coinlist.co/a-new-era/Ön satışın'daki inanılmaz talebi bilmeyen yoktur. Coinlist artık diyorki hesapta para varsa ozaman katılabilirsin. Alacağın tutar cüzdanda hazır olacak.Kısaca diyorki kazanmak istiyorsan içeride bakiye tutacaksın.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461348",
  "comments": [
    {
      "author": "LGD2Business",
      "created_time": "July 28, 2023, 09:48:36 PM",
      "body": "Çok geç kalmışlar en başından beri bunu uygulamaları gerekirdi. Bu saatten sonra neye yarar siteye ilgi kalmamışken son çıkan projelerin hepsi fail olmuşken bilemiyorum. Belki düzgün 1-2 yeni proje patlama yaparsa siteye yeniden ilgi olur ama şu anki durumda ölü atı tekmeliyorlar. Hayata dönmeleri zor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "July 29, 2023, 05:21:28 AM",
      "body": "çok geç kalınmış bir yöntem olmadı mı sizce de dostlar? allah'tan umee'yi aldıktan sonra benim hesabı banlamışlardı çünkü bu tırt projeden sonra bir türlü düzgün bir şey çıkmadı. çıkan varsa da fiyat vs son derece kötüydü. neyse, bu sistemle birlikte multi hesaplar bir yere kadar kesilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "July 29, 2023, 09:50:49 AM",
      "body": "Bundan sonra yapacakları hiçbir satışa katılmayı düşünmüyorum hesap açmak basit ama adamlar cosmos aşığı ve getirdikleri çoğu proje bir şekilde ekosistemde yer bulmuş olsa bile genel anlamda yatırımcısına pek birşey kazandırmıyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "July 29, 2023, 11:29:51 PM",
      "body": "Hafızam beni yanıltmıyorsa böyle bir şey zaten en başında vardı. Daha sonra kaldırdılar şimdi yeniden getiriyorlar fakat bunun multiyi engellemek için çok etkili olacağını düşünmüyorum. Katılım hakkının 500$ gibi çoğu multici için küçük rakamlar olduğu ve hype dönemindeki pastanın büyüklüğü düşünüldüğünde tüm hesaplarına 500$ gibi bir miktarı seve seve deposit edecek çok sayıda insan var. Ve zaten uzun süredir Coinlist üzerinde multi yapıyorlarsa bu paraya da fazlasıyla sahiptirler. Belki sadece yeni başlayan multicileri engelleyebilirler. Ha birde satış sürecine katılıp hesabı OTC üzerinden para yatırmadan satmaya çalışan multiciler vardı onlarında bir kısmını eleyebilirler. Sonuçta ellerinde kalma olasılığı olduğu sürece paralarını riske etmek istemeyecektirler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kalemder",
      "created_time": "July 31, 2023, 11:24:27 AM",
      "body": "Maksat multicileri engellemek değil, iyi projelere daha güvenilir bir platform olduklarını göstermek. İyi proje bulmakta çok zorlanıyorlar. Artık eskisi gibi alternatifsiz değiller.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzigie",
      "created_time": "August 05, 2023, 01:37:53 PM",
      "body": "Parası olmayana satış hakkı vermek saçma bir uygulamaymış. Satın alım hakkı tanıdıktan sonra deposit için zaman tanıdıklarını biliyorum ama borsada para tutmayan birine gel herkesin satın almak için yarıştığı coini istediğin zaman al demişler neredeyse. Bence bu çok saçma bir uygulama. Bunu olsa olsa müşteri çekmek için yapmışlardır. Herkes kayıt olsa ve para yatırmasa bile satışa katılabiliyor. Bu da herkesin borsaya üye olmasını sağlayan bir sistem anlamına gelir. Artık yeterince müşteri topladıklarına inanmışlarsa bu uygulamadan vazgeçmişlerdir. Bu nedenle hesapta para tutma kuralı getirmiş olabilirler. Yarın müşterilerini kaybetseler yine aynı uygulamayı gündeme getirebilirler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "August 05, 2023, 01:48:31 PM",
      "body": "Tamamen merkeziyetsiz bir platformda çekiliş yapmadıkça her zaman akıllarda soru işareti kalacaktır. Hala icerideki parasını çekmekle ilgili problem yaşayanlar var. Para adamın parası bakıyorsun haftalarca yollamiyor. Bu adamlar kendileri çalıyor kendileri oynuyor sopa adamlarin elinde istediği tarafa çekiyor diyecek birşey yok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lachrymose",
      "created_time": "August 09, 2023, 06:26:26 PM",
      "body": "Bir tarafta üç kuruşa satilan, gelir modeli olan, yillanmis sarap gibi sirketler. Oteki tarafta yuzlerce alternatifi olan ve hicbir gelir modeli olmayip 200 milyon dolara satilan “tokenler”; swh",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}