{
  "id": "topic_5417862",
  "title": "mandown",
  "author": "mandown",
  "created_time": "October 21, 2022, 07:53:35 AM",
  "content": "Altta verdiğim adreste bu aksam  30 ve 100 usdlik 2 farklı ürün satışı olacak. Bir bakın bakalım yüzüklerin efendisi hayranı çoktur alsammı almasammı karar veremedim.Size göre alınmalı mı?https://web3.wb.com/warnermedia/movieverse",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417862",
  "comments": [
    {
      "author": "ZekiBeyy",
      "created_time": "October 21, 2022, 08:56:30 AM",
      "body": "Hocam ayı sezonunda piyasaya ilgi çok az son 1-2 haftadır dapper NFT'lerde bile ciddi düşüşler oldu satın almadan önce hype durumunu görebiliyorsanız ona göre alıp almama konusunda fikir sahibi olabilirsiniz hype düşük olduğu zaman genelde maliyeti karşılamıyor. Warnerbrosu hiç bilmiyorum biraz incelemek lazım hayran kitlesi ne durumdadır. Genel olarak NFT furyasında düşüş yaşanıyor parasal durumunuza göre 30 dolarlık alınabilir riske atarım derseniz yinede karar sizin elbette",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "October 21, 2022, 09:40:44 AM",
      "body": "30 ve 100 dolar, aslında denenebilir paralar bunlar, lord of the ringin inanılmaz bir hayran kitlesi olduğunu da düşünürsek alınabilecek nft gruplarından birisi hocam, deneyebilirsiniz, warner bros imzası taşıması da ayrıca değerlendiriyor, biraz saklayıp yine nft çılgınlığı zamanında piyasaya iyi bir şekilde satışını yapabilirsiniz belki",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "October 21, 2022, 10:01:54 AM",
      "body": "100 dolar verip Sauron ve yüzük temalı nft yi satın almak isterdim ama alabilir miyim hiç bilmiyorum. Bence o kadar çok lotr fanı var ki asla bırakmazlar satışa çıkar çıkmaz tükenirler bunlar adım gibi eminim. Hayır işin kötü tarafı asla fiyatı da düşmez eline geçen asla satmaz. Gördüğüm en garanti nft yatırımı gibi duruyor. Biraz araştıralım bakalım alma ihtimalimiz %1 mi %50 ye çıkabilir mi diye. Hoşuma gitti bu iş.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bobita",
      "created_time": "October 21, 2022, 10:21:43 AM",
      "body": "Quote from: Pierre 2 on October 21, 2022, 10:01:54 AM100 dolar verip Sauron ve yüzük temalı nft yi satın almak isterdim ama alabilir miyim hiç bilmiyorum. Bence o kadar çok lotr fanı var ki asla bırakmazlar satışa çıkar çıkmaz tükenirler bunlar adım gibi eminim. Hayır işin kötü tarafı asla fiyatı da düşmez eline geçen asla satmaz. Gördüğüm en garanti nft yatırımı gibi duruyor. Biraz araştıralım bakalım alma ihtimalimiz %1 mi %50 ye çıkabilir mi diye. Hoşuma gitti bu iş.Katılıyorum, bu tarz şeylerin fanlarının yanında fanatik futbol taraftarları çerez kalır, üstelik para harcamaktan da çekinmiyorlar, yukarıdaki rakamlar denemek için mantıklı ama realitede iş öyle olmayacaktır. Ancak bir yandan da kazanç getirisi anlamında tereddütlerim var (baz fiyattan alınamazsa), yani 100 dolar denilen şeyi atıyorum 800 dolara aldık diyelim, çok zayıf olmayan bir ihtimalle 800 dolar civarından pek ayrılmayacaktır, çünkü senin de yazdığın gibi alan satmaz, ama diğer taraftan da isteyen bitmez, dolayısıyla fiyat belli bir aralıkta sıkışabilir gibime geliyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jossque",
      "created_time": "October 21, 2022, 12:03:50 PM",
      "body": "Mint bu akşam saat 19:00 da olacak.https://twitter.com/eluvioinc Bu proje üzerinden yapılacak.Warner bros nft alanına adın atması güzel haber. Devamı gelecektir. Siteye gidip kayıt olmak gerekiyor sanırsam.30 dolarlıktan 10k adet, 100 dolarlıktan 999 adet mint olacak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "October 21, 2022, 02:06:47 PM",
      "body": "Alınmasına alınır. Lotr'dan bahsediyoruz o kadar fazla tutkunu var ki havada kaparlar gibi geliyor bana da. Fiyat ve arz olarakta makul geldi bana. İşte tek sıkıntı böyle koleksiyon olarak tutmak bana çekici gelmiyor bir işlevi olmalı bu Nftlerin anca öyle alırım. Alacak arkadaşlara bol şans umarım alabilirsiniz, çok sınırlı sayıdaki Lotr nftlerinizi",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "October 21, 2022, 03:34:35 PM",
      "body": "Quote The “Fellowship of the Ring” NFTs will be available to purchase with credit cards, debit or cryptocurrency. techcrunch'un makalesinde böyle bir ibare bulunuyor. bu da alım yapacak olan kişi sayısının daha da artmasına yol açar.https://twitter.com/WarnerBrosNFT adamların takipçi sayısına bakınca fazla değil ama her gönderileri iyi tepki almış. yorumlar sahte midir bilemem ama warnerbros işin içinde sonuçta yani hype iyi olabilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "October 21, 2022, 03:37:24 PM",
      "body": "Bu hesaba para nasıl atacağımızı bulan varmı?Burada nasıl satın alacağına dair bir sesli anlatım mevcut.https://twitter.com/bykriptotracker/status/1583480159172059136",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "October 21, 2022, 04:47:56 PM",
      "body": "Kayıt ve cüzdan oluşturdum  kredi kartı ile alım yapacağım. Hype durumunu görebilirsek alıp almama konusunda daha rahat karar verebiliriz şuan ayı piyasasında olmasak çok rahat gözü kapalı alınabilir riske edilir diyebilirdim. 30 dolarlık olandan 1 tane aldım 1 moment çıkıyor içinden. 99 dolarlık hepsi satılmış görünüyor 30 dolarlık olan ise 15 dakikada 1500 adet satıldı ayrıca markette aktif çıkan bazı momentler seri numarası iyi olmasa bile 70-150 arasında alıcı bulmuş kim neden alır daha ucuzu varken bilemiyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "October 21, 2022, 05:10:21 PM",
      "body": "WB bir proje ile ortaya çıkmışken dayanamadım bende satın aldım. Uncommon bir nft çıktı bakalım 10x fiyata satış koydum satılırsa efsane olur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "October 21, 2022, 05:15:45 PM",
      "body": "Quote from: mandown on October 21, 2022, 05:10:21 PMWB bir proje ile ortaya çıkmışken dayanamadım bende satın aldım. Uncommon bir nft çıktı bakalım 10x fiyata satış koydum satılırsa efsane olur.Bana da common geldi size çıkan comondan daha iyi bakalım ilerleyen zamanda nasıl bir süreçleri olacak. İlk satışları seviyorum genelde bonuslu olabiliyor 99 dolarlık 999 mintli satışı gördüğümde bitmişti onun olayı daha farklı olduğu için çoğunluk direkt olarak 99 dolarlık olanı tercih etmişler tabi içerik olarak da daha iyi NFT olduğu kesin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "October 21, 2022, 05:20:14 PM",
      "body": "Hayatımda böyle dolu dolu içeriği olan bir nft satışı görmemiştim.1. Yüzük kardeşiliği 4k malesef türkçe yok2. dolu dolu diğer içerikler, çizimler, çekim arkalarıi vsvs",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Red Pie",
      "created_time": "October 22, 2022, 07:39:59 AM",
      "body": "Quote from: mandown on October 21, 2022, 05:20:14 PMHayatımda böyle dolu dolu içeriği olan bir nft satışı görmemiştim.1. Yüzük kardeşiliği 4k malesef türkçe yok2. dolu dolu diğer içerikler, çizimler, çekim arkalarıi vsvsKazançlı olacağınızı düşünüyorum. siz ve alan arkadaşlar güle güle harcasınlar şimdiden paralarını. belki elinizde tutup buna koleksiyon muamelesi yapabilirsiniz. koleksiyonluk olması gereken serilerden birisi yüzüklerin efendisi, belki Harry potterda da bu potansiyel vardır. onun satışı gelirse oradan da kapmak lazım aslında.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "October 27, 2022, 05:33:09 AM",
      "body": "Üzücü bir şekilde uyuyakalarak kaçırdım bu satışı. Şu anda en ucuzu 170 dolardan gidiyor. (Elbette Sauronlu epic versiyonu kast ediyorum). Havadan 1000 lira kazandı alan arkadaşlar diyebilirim. Store fiyatı gördüğüm kadarıyla 150 doların altına hiç düşmeyecek gibi. Şimdi diğer 2 filmi de satışa çıkaracaklar oradan da epic alıp kenara atmakta fayda var bence. Belki birincisi kadar pahalı gitmez ama yine bir 20/30 dolar bedava kârı var gibi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "October 27, 2022, 08:33:10 AM",
      "body": "Quote from: Pierre 2 on October 27, 2022, 05:33:09 AMÜzücü bir şekilde uyuyakalarak kaçırdım bu satışı. Şu anda en ucuzu 170 dolardan gidiyor. (Elbette Sauronlu epic versiyonu kast ediyorum). Havadan 1000 lira kazandı alan arkadaşlar diyebilirim. Store fiyatı gördüğüm kadarıyla 150 doların altına hiç düşmeyecek gibi. Şimdi diğer 2 filmi de satışa çıkaracaklar oradan da epic alıp kenara atmakta fayda var bence. Belki birincisi kadar pahalı gitmez ama yine bir 20/30 dolar bedava kârı var gibi.Büyük ihtimalle uyuya kalmasanız da alamazdınız sanırım paket sayısı az olduğu için çabucak tükendi ama 30 dolar olanlara pek rağbet olmadığını düşünüyorum. Alabilenler 99 dolarlıktan yapıştırıp geçtiler markette 150-250 arası satılıyordu satışın yapıldığı akşam sonrasında takip etmedim. 30 dolarlık olanlarda belki sonradan biraz değerlenir ne diyeyim beklemeye devam",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "October 27, 2022, 02:42:04 PM",
      "body": "Quote from: ZekiBeyy on October 27, 2022, 08:33:10 AMQuote from: Pierre 2 on October 27, 2022, 05:33:09 AMÜzücü bir şekilde uyuyakalarak kaçırdım bu satışı. Şu anda en ucuzu 170 dolardan gidiyor. (Elbette Sauronlu epic versiyonu kast ediyorum). Havadan 1000 lira kazandı alan arkadaşlar diyebilirim. Store fiyatı gördüğüm kadarıyla 150 doların altına hiç düşmeyecek gibi. Şimdi diğer 2 filmi de satışa çıkaracaklar oradan da epic alıp kenara atmakta fayda var bence. Belki birincisi kadar pahalı gitmez ama yine bir 20/30 dolar bedava kârı var gibi.Büyük ihtimalle uyuya kalmasanız da alamazdınız sanırım paket sayısı az olduğu için çabucak tükendi ama 30 dolar olanlara pek rağbet olmadığını düşünüyorum. Alabilenler 99 dolarlıktan yapıştırıp geçtiler markette 150-250 arası satılıyordu satışın yapıldığı akşam sonrasında takip etmedim. 30 dolarlık olanlarda belki sonradan biraz değerlenir ne diyeyim beklemeye devam 30 dolarlık olanları da inceledim hocam, aslında onlar da filmi izleme fırsatı verdiği için koleksiyonluk sayılabilir fakat markette 30 doların altında 15-20 dolarlara satıldığı için neredeyse kimse satın almıyordu. 100 dolarlık olanın işlevinin de ötesinde görüntüsü de çok hoş. Yalnız bazı deposit sorunları vardı dikkat ettim. Umarım ikinci ve üçüncü nft satışlarında bunları çözerler. Daha Batman falan da satacaklar sanıyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "October 28, 2022, 03:47:20 PM",
      "body": "Quote from: Pierre 2 on October 27, 2022, 02:42:04 PMQuote from: ZekiBeyy on October 27, 2022, 08:33:10 AMQuote from: Pierre 2 on October 27, 2022, 05:33:09 AMÜzücü bir şekilde uyuyakalarak kaçırdım bu satışı. Şu anda en ucuzu 170 dolardan gidiyor. (Elbette Sauronlu epic versiyonu kast ediyorum). Havadan 1000 lira kazandı alan arkadaşlar diyebilirim. Store fiyatı gördüğüm kadarıyla 150 doların altına hiç düşmeyecek gibi. Şimdi diğer 2 filmi de satışa çıkaracaklar oradan da epic alıp kenara atmakta fayda var bence. Belki birincisi kadar pahalı gitmez ama yine bir 20/30 dolar bedava kârı var gibi.Büyük ihtimalle uyuya kalmasanız da alamazdınız sanırım paket sayısı az olduğu için çabucak tükendi ama 30 dolar olanlara pek rağbet olmadığını düşünüyorum. Alabilenler 99 dolarlıktan yapıştırıp geçtiler markette 150-250 arası satılıyordu satışın yapıldığı akşam sonrasında takip etmedim. 30 dolarlık olanlarda belki sonradan biraz değerlenir ne diyeyim beklemeye devam 30 dolarlık olanları da inceledim hocam, aslında onlar da filmi izleme fırsatı verdiği için koleksiyonluk sayılabilir fakat markette 30 doların altında 15-20 dolarlara satıldığı için neredeyse kimse satın almıyordu. 100 dolarlık olanın işlevinin de ötesinde görüntüsü de çok hoş. Yalnız bazı deposit sorunları vardı dikkat ettim. Umarım ikinci ve üçüncü nft satışlarında bunları çözerler. Daha Batman falan da satacaklar sanıyorum.30 dolarlık olanlar halen satışta olması kötü olmuş üstelikte satış çok yavaş ilerliyor paket içeriğinden 3 farklı tipte NFT çıkabilmekte bana common geldi yani en değersiz olanı markette en düşük 17 dolardan satılıyor. Beklediğimden düşük bir NFT satışı oldu aslında genel hype düşüktü bu sebeple alınmayabilirdi bilemiyorum umarım ileride değerlenir şimdilik düşük fiyattan satmayı düşünmüyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "October 30, 2022, 04:34:04 PM",
      "body": "Şimdi haberim oldu. Ben bunu sadece nft satışı ile kar elde etmek için değil, gerçekten alabilirim yani warnerbros şaşırtıcı şekilde iyi bir iş yapmış ve sinema sektöründe lotr gibi bir efsaneye yaraşır bir iş gibi gözüküyor. Tam olmasını beklediğimiz entegrasyon. Öncelikle umarım bu gerçekten tutar ve sonrasında tüm sektöre güzel yayılabilir. 15 yıl kadar önce yurtdışından dvd setini neredeyse dolar olarak aynı paraya almıştım, kamera arkası görüntüleri vs izleyebilmek için. Bunu nft satın alarak yapmak cidden iyi olmuş.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zonefloor",
      "created_time": "November 02, 2022, 03:37:53 PM",
      "body": "Warner bros işin içindeyse aslında denenebilirmiş. Son dönemde pek güzel işler çıkarmasada ben Warner brosun uzun vadede para edebileceğini düşünüyorum ki çok köklü işleri var ve yapmayada devam ediyorlar. Umarım alabilenler olmuştur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}