{
  "id": "topic_5398505",
  "title": "supermankid",
  "author": "supermankid",
  "created_time": "May 13, 2022, 01:00:28 PM",
  "content": "Hello all, is it possible to know the number of all live machines running the full node.If so, is there a website showing that. I saw some websites that show something ~17k active nodes only.But the text say there were already about 100k nodes recently.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398505",
  "comments": [
    {
      "author": "mk4",
      "created_time": "May 13, 2022, 01:02:29 PMLast edit: May 13, 2022, 01:13:54 PM by mk4",
      "body": "Not sure how accurate this site is but yea: https://coin.dance/nodesEDIT: can any expert here tell me why Bitcoin Knots had an uptick in runners?https://coin.dance/nodes/knots",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bill gator",
      "created_time": "May 13, 2022, 01:06:04 PM",
      "body": "The answer to your question requires a bit more specificity in the wording, or at least some definitions given for a few of the words.There are websites that I've come across in the past, that gives numbers like this -which will tell you the amount of \"Reachable Nodes\". I noticed in your question that you specified \"full\" nodes, which would indicate that not all active and reachable nodes would fit under the umbrella of your question. So, my formal answer is that your question begs more questions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "May 13, 2022, 06:53:20 PM",
      "body": "According to this website (https://bitnodes.io/nodes/all/) there are about 15,000 reachable nodes and an estimation of about 212,000 full nodes in total",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "supermankid",
      "created_time": "May 13, 2022, 09:42:14 PM",
      "body": "Quote from: bill gator on May 13, 2022, 01:06:04 PMThe answer to your question requires a bit more specificity in the wording, or at least some definitions given for a few of the words.There are websites that I've come across in the past, that gives numbers like this -which will tell you the amount of \"Reachable Nodes\". I noticed in your question that you specified \"full\" nodes, which would indicate that not all active and reachable nodes would fit under the umbrella of your question. So, my formal answer is that your question begs more questions.To rephrase, how many people are running bitcoin core?(Or like similar system).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "May 13, 2022, 10:57:36 PM",
      "body": "Quote from: supermankid on May 13, 2022, 09:42:14 PMTo rephrase, how many people are running bitcoin core?(Or like similar system).No there is no tool that you can able to know how many people running a Bitcoin core(either running pruned mode or not). Only those who run a full node is counting.You can't also able to know who is using Bitcoin core. All tools mentioned above are only for estimation there is no accurate tool to know how many full nodes are running. What actually do you want to achieve here?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "supermankid",
      "created_time": "May 15, 2022, 07:58:34 PM",
      "body": "As I understand, the strength of btc network rises with number of nodes.Just wanted to know how many nodes are there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "May 15, 2022, 08:02:40 PM",
      "body": "You can't really know.Some nodes as others have said are not reachable.Others are running on TORI have 5 nodes but I don't see any of them listed even though I know one is on a public IP and has 5+ connections to it now so even the sites that list the nodes are not 100% accurate.Figure 16K for sure provable. And more then 10X that number just sitting out there running.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "May 15, 2022, 08:18:05 PM",
      "body": "Quote from: DaveF on May 15, 2022, 08:02:40 PMYou can't really know.Some nodes as others have said are not reachable.If i may ask, is it any techniques that can detecte or explain while some nodes are not reachable.. from what i was assuming before now. I taught or with my instincts, was thinking that any running node you come in contact with is accurate, even though it's above ten (10) and all should be accurate... what's the secret behind inaccuracies of five (5) running node?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "May 15, 2022, 10:41:48 PM",
      "body": "Quote from: GeorgeJohn on May 15, 2022, 08:18:05 PMQuote from: DaveF on May 15, 2022, 08:02:40 PMYou can't really know.Some nodes as others have said are not reachable.If i may ask, is it any techniques that can detecte or explain while some nodes are not reachable.. from what i was assuming before now. I taught or with my instincts, was thinking that any running node you come in contact with is accurate, even though it's above ten (10) and all should be accurate... what's the secret behind inaccuracies of five (5) running node?Not a clue.More or less at the moment I have3 nodes in a box as described here:https://bitcointalk.org/index.php?topic=5364113 2 are on tor one is on a private IP with the ports forwarded back for bitcoin and LN This laptop running on my home cable with the ports forwarded back:https://bitcointalk.org/index.php?topic=5364742.msg59950468#msg59950468And a box on the office IP stack with a public IPAnd a box at a client site on a public FiOS IP.All have in & out connections.NONE are listed on any of the sites that show nodes.Nothing special has been done to them in terms of configuration and they all can see each other and connect with the addnode command.Noticed it once before and just checked again today when I saw this thread.<shrug>Could also be that since I do play with them a lot the constant going up and down caused the monitoring sites to ignore them. But that's only a guess.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "May 16, 2022, 07:08:19 AM",
      "body": "We are talking about a peer to peer network that is decentralized so there is no easy way of knowing the accurate number of full nodes. However, we can still come up with a good estimation.People already introduced bitnodes.io, what they do is that they simply run a node and list those nodes that are reachable or in other words the nodes that accept incoming connection. This number has always been lower than the total number of nodes that also includes nodes that do not accept incoming connection.Counting the second group of nodes is harder because they have to initiate the connection to the counter and they may never connect to that node ever ergo the counter may never know about them.Think of it this way, there are nodes A, B, C, D, E, F and only A and B are accepting incoming connection. This means when C and D connect to A they will find out about B too (through gossip protocol) but B will never know about C and D unless they also connect to B since it has no reason to know about them and A doesn't tell others about C and D whereas it does tell everyone about B. Same with E and F that connect to B and A will never know about them.In this case if node B is a counter node, it would think there is only 3 nodes in total: A, E and F.On the other hand bitnodes.io type counter only knows about A and B since they only look for \"reachable nodes\" which are nodes that their \"crawler\" can connect to so they can never connect to C, D, E or F so they are never counted.Others have attempted to count all nodes using different techniques:https://luke.dashjr.org/programs/bitcoin/files/charts/software.htmlhttps://luke.dashjr.org/programs/bitcoin/files/charts/historical.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}