{
  "id": "topic_5454981",
  "title": "bettercrypto",
  "author": "bettercrypto",
  "created_time": "June 03, 2023, 01:51:26 PM",
  "content": "This past May 31, the Fed continued to raise interest rates. And the reason is Quote\"Bitcoin Recedes to $27K as Fed's Mester Favors Unabated Tightening\" Because the Fed said,Quotethere is no compelling case to halt the liquidity tightening. The Fed's unrelenting tightening has roiled risk assets, including cryptocurrencies. Which means there is no compelling reason for the Fed to pause and stop raising interest rates. It was announced that it ended just Wednesday that said President Loretta Mester in an interview.And when Lorreta Mester said this, the value of Bitcoin immediately fell by 2% in the market. And not only Bitcoin was affected but also Nasdaq and other assets as well. But the dollar index increased by 0.27% assets. And Gold is not affected much. And I think what the Fed did is that it can be aggressive without causing the industry to collapse, this is what they decided because they think inflation is still high.So now the traders are no longer expecting the Fed to cut rates this year. Actually this is not good for Bitcoin, Although there is a lot of good news happening in other parts of the world like China and Hongkong, but still the U.S influence is greater in the crypto market. If you look at the price of Btc now, it is under our resistance level, which only proves that the pump in the past is very weak.What do you think about this matter and give us an opinion.Referrence: https://finance.yahoo.com/news/bitcoin-recedes-27k-feds-mester-072628064.html",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454981",
  "comments": [
    {
      "author": "FP91G",
      "created_time": "June 03, 2023, 02:23:00 PM",
      "body": "Quote from: bettercrypto on June 03, 2023, 01:51:26 PMWhat do you think about this matter and give us an opinion.Referrence: https://finance.yahoo.com/news/bitcoin-recedes-27k-feds-mester-072628064.htmlIf the Fed does not stop and continues to raise rates, then something else will break in the banking system. New bank failures will positively affect the price of Btc. And after the halving, the price of Btc should be more expensive, otherwise the stock prices of companies that are engaged in mining will fall.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "June 03, 2023, 02:25:02 PM",
      "body": "Trends created by FED will change with time but only one thing has never changed and will never be changed. They will continue to print more money and create more inflation on the US. dollar. Their printing pace can be sped up or cooled down but printing more money is what they always do.When FED make news, it is news about policy and has big effects but you can ignore them and focus on long term view. If they print more money, create more inflation, it is good for Bitcoin that has very less inflation with time.FED create inflation, fear on the US. dollar and Bitcoin has less inflationary scheme and some people consider it as deflationary too, Bitcoin can create FOMO. You can see what is a winner, Bitcoin. Let's stay and go along with Bitcoin.Bitcoin controlled supplyPurchasing power of US. dollar",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "June 03, 2023, 02:27:57 PM",
      "body": "It just a short term effect, it's ridiculous if FED raise the interest rate just because of Bitcoin, they can't stop Bitcoin, do we will see 100% interest rate in the future? Hongkong was accept Bitcoin since long time ago while China is want to reconsider unban Bitcoin, but until now there's no more action. U.S. is still give a huge influence because USD is the global reserve currency. Although Yuan could overtake USD, but I don't think Yuan will be the next global reserve currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "June 03, 2023, 02:32:10 PM",
      "body": "Quote from: bettercrypto on June 03, 2023, 01:51:26 PMThis past May 31, the Fed continued to raise interest rates. And the reason is Quote\"Bitcoin Recedes to $27K as Fed's Mester Favors Unabated Tightening\" Because the Fed said,It's the other way around, it's not the reason, that's the consequence.Quote from: FP91G on June 03, 2023, 02:23:00 PMNew bank failures will positively affect the price of Btc. And if those don't come?Bitcoin was doing great when the economy was doing great also, both the inflation and the war haven't helped the prices that much, so are we going to cheer for an economic disaster every time we want the price to go up?Quote from: FP91G on June 03, 2023, 02:23:00 PMAnd after the halving, the price of Btc should be more expensive, otherwise the stock prices of companies that are engaged in mining will fall.And? Miners have gone out of business, mining companies have gone bankrupt and others have begged investors for millions to keep them afloat, it's not a general rule that after the halving we need prices to get x2 to keep miners running at the same levels. This is not OPEC that can play with the output, if there will be no demand to rise the price to 60k it's bye-bye for most miners after the halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DanWalker",
      "created_time": "June 03, 2023, 03:00:52 PM",
      "body": "Quote from: FP91G on June 03, 2023, 02:23:00 PMQuote from: bettercrypto on June 03, 2023, 01:51:26 PMWhat do you think about this matter and give us an opinion.Referrence: https://finance.yahoo.com/news/bitcoin-recedes-27k-feds-mester-072628064.htmlIf the Fed does not stop and continues to raise rates, then something else will break in the banking system. New bank failures will positively affect the price of Btc. And after the halving, the price of Btc should be more expensive, otherwise the stock prices of companies that are engaged in mining will fall.Honestly, I don't see Fed caring about banks failing, and they used to say that everything is still under their control. To me, the collapse of banks is like a purge of fake projects in the cryptocurrency market, weak companies should be eliminated and made room for others. The banking industry also has fierce competition, they are not completely united, so this is like a rejection in business. Furthermore, there is no evidence that a bank failure will positively affect the bitcoin price. As I remember correctly, the collapse of SVB, Signature Bank, and Silvergate Bank did not impact the bitcoin price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 03, 2023, 03:48:22 PMLast edit: June 03, 2023, 04:55:03 PM by franky1",
      "body": "the \"fed\" dont care. because the fed has been losing value for decades now. due to things like mastercard and visacard the fed has not been getting much money from bankspreviously when people deposited money into a bank. the feds would burn the deposited bank notes. so that the bank can hoard the value as bank account balance (to ensure there is no double spends) but the fed then requested that banks keep upto 10% of depositors value as cash on hand incase customers wanted to withdraw. and so the bank would give the fed 10% of value which the fed then printed crisp bank notes at face value.however visacard and mastercard meant not many people used ATMs so the % on hand went down. and now its practically not a requirement so the fed no longer gets money from banks buying bank notes.this is why the fed wants to remove the need for payment processors like visa/mastercard who take a few % in merchant fees but give nothing to the fed.. and instead create a CBDC where the payment processors have to pay fees to the CDBC (aka the fed) so they want to debase fiat bank notes. so that when they offer $1CBDC for $10fiat people will notice how they can buy 7 loaves of bread for $1CBDC or $10 old money. and start to want the $CBDC insteaddue to endless inflations on the $FIAT, but les or structured inflation on  the $CBDCbut first they have to make people not want to use $fiat. so they want to annoy people with it.we see this politics playing out in other cryptos.. making mainnet utility annoying and expensive to promote stupid subnetwork units people should grab instead. in shortdont expect fee/inflation/annoyance drama to stop anytime soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Onset",
      "created_time": "June 03, 2023, 04:05:15 PM",
      "body": "@franky1 So in fewer words, things are just working according to their plan. Of course they want fiat to be devalued. Without a failing currency, how will they convince us to move on from old fiat to new CBDC? Create a problem and when things are worst, come up with the solution that’ll save us all from the worst of the worst. Then everyone just says yes in despair and here their plan goes.For now Bitcoin’s not that much of a winner against them either. Bitcoin doesn’t stay too stable when economy trembles, so they know a failure of old fiat will probably shake Bitcoin to the core. So it’s not that difficult to them after all to convince the average population that Bitcoin is inferior to CBDCs. Man, I wish things were the other way around but I just see them getting closer and closer to their goal!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 03, 2023, 04:58:54 PMLast edit: June 03, 2023, 05:33:53 PM by franky1",
      "body": "Quote from: Onset on June 03, 2023, 04:05:15 PM@franky1 So in fewer words, things are just working according to their plan. Of course they want fiat to be devalued. Without a failing currency, how will they convince us to move on from old fiat to new CBDC? Create a problem and when things are worst, come up with the solution that’ll save us all from the worst of the worst. Then everyone just says yes in despair and here their plan goes.they dont care about national debt.. think of it in terms of bread loafs..$31trill is about 15trillion bread loavesif they can inflate fiat where a new CBDC is swap rated at 10fiat:1cbdc (10x of old to new)where bread then converts over of being $2:2cbdc of current bread valuethey can pay off their fiat debt for only 1.5trillion loaves of bread instead of 15trillionbecasue the debt would be needed to be paid in the contracted old fiat. which has devalued at 10x by the time they offer CBDCthats why they like inflation. it appears as inflating the debt bill but when they change to new currency the debt bill shrinks when the hyper inflation occurs due to the swap ratewhy do you think zimbabwe went through hyper inflation and a couple swap rates of new bills. to shrink their national debt without having to pay as much real goods/services value",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "June 03, 2023, 05:25:11 PM",
      "body": "Quote from: bettercrypto on June 03, 2023, 01:51:26 PMWhat do you think about this matter and give us an opinion.The Fed doesn't want Bitcoin to get a pump so high that investors might put all their money into it rather than saving the money on the banks. They don't want the people to invest good amount of money into it and that's why they increased the taxes to very high levels to stop investors from putting money into it.The traders are sure because Fed won't cut tax rates this year, and I even think that they might not cut the rates in next year. The high tax rates will stop the citizens and investors from putting their money into Bitcoin and we all know that next year is the year of halving event. But, I'm sure that the influence of U.S won't be that high during the halving event and I think China might be a good player during this halving.Whenever the U.S goes against a thing the China supports it and this time U.S is surely against Bitcoin and other crypto-currencies, and the exchanges, in such case China will start favoring crypto-currencies and Bitcoin. The U.S might have to reconsider the tax rates if China decides to take the step, but until than we can hope for good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 03, 2023, 05:35:57 PMLast edit: June 04, 2023, 04:22:08 AM by franky1",
      "body": "Quote from: SamReomo on June 03, 2023, 05:25:11 PMQuote from: bettercrypto on June 03, 2023, 01:51:26 PMWhat do you think about this matter and give us an opinion.The Fed doesn't want Bitcoin to get a pump so high that investors might put all their money into the fed doesnt carewhilst we deposit our fiat into a bank and wire transfer it to an exchange to buy bitcoin..someone else is giving up their bitcoin to get that same fiatthe fiat does not vanish it just swaps hands. the totals still exist its just whos name is on the bank account that changes. to the fed it makes no difference. the bank account balances do not disapear. the funds just stir between different names. the fed actually loves it when fiat changes the name of owner..think of it like thissay you had $100k.. and held onto it for 10 years.in that 10 years the fed gets no income tax from it.. but now imagine you deposit $100k into an exchange. that exchange then has to pay corporation tax on anything it earns from those deposits(the market fees). the exchange customer selling btc to get fiat then has to pay cap gains tax on his gains from receiving fiat.. and the more that money stirs between recipients, the more tax the fed gets from the moving moneythey love fiat circulating due to swaps. so they are not against people using money to buy other things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "June 03, 2023, 07:32:23 PM",
      "body": "Well today Biden signed the debt ceiling deal so that’s one good thing. Bitcoin always follows legacy markets so I am really not in the mood for a recession & the devastation that brings.Talking about the Fed raising rates, I really hope they pause or cut soon but there are rumours they may not cut until 2024 which could hurt markets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "June 03, 2023, 07:50:22 PM",
      "body": "This thread would fit better in the economics board and not Bitcoin discussion.Quote from: bettercrypto on June 03, 2023, 01:51:26 PMAnd when Lorreta Mester said this, the value of Bitcoin immediately fell by 2% in the market. This is a volatile market, there does not have to be a reason for a 2% change in the price and the fact that a statement was put our prior to the market movement does not mean it's a consequence of it.Bitcoin has had its biggest gains in the market in the absence of any talk about interes rates or the FED, we do not always have to draw a correlation between both.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "June 03, 2023, 08:11:42 PM",
      "body": "Quote from: bettercrypto on June 03, 2023, 01:51:26 PMAnd when Lorreta Mester said this, the value of Bitcoin immediately fell by 2% in the market. And not only Bitcoin was affected but also Nasdaq and other assets as well. But the dollar index increased by 0.27% assets. And Gold is not affected much. And I think what the Fed did is that it can be aggressive without causing the industry to collapse, this is what they decided because they think inflation is still high.This has been ongoing for years now, and as much as it has affected the price of bitcoin, it's not the end of it all.Quote from: bettercrypto on June 03, 2023, 01:51:26 PMSo now the traders are no longer expecting the Fed to cut rates this year. Actually this is not good for Bitcoin, Although there is a lot of good news happening in other parts of the world like China and Hongkong, but still the U.S influence is greater in the crypto market. If you look at the price of Btc now, it is under our resistance level, which only proves that the pump in the past is very weak.We know that sooner or later this will has to change right? They can't just go and increase their rates, it will have consequences for them and to the world. As for bitcoin, we will have the halving, so regardless, we will see a massive pump, a new all time high. We are in the bear market so don't expect something big, on the contrary, if we follow the previous historical logs, we are just about where we should be, so nothing to worry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flyingcarpet",
      "created_time": "June 03, 2023, 09:35:02 PM",
      "body": "Quote from: FP91G on June 03, 2023, 02:23:00 PMQuote from: bettercrypto on June 03, 2023, 01:51:26 PMWhat do you think about this matter and give us an opinion.Referrence: https://finance.yahoo.com/news/bitcoin-recedes-27k-feds-mester-072628064.htmlIf the Fed does not stop and continues to raise rates, then something else will break in the banking system. New bank failures will positively affect the price of Btc. And after the halving, the price of Btc should be more expensive, otherwise the stock prices of companies that are engaged in mining will fall.That's one of the things I'm wondering about. If the Fed keeps raising interest rates like this, how long will it take for Bitcoin to take advantage of it in response to the broken system?Another thing I was wondering is are we sure the price will increase after the halving? What if otherwise?It's been awhile and I'm wondering what's going to happen. Many people are preparing their baskets and according to estimates, the value of bitcoin will increase after halving. I also think in this direction. If it's the opposite of what we think, I wonder how long it will take to heal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MoonOfLife",
      "created_time": "June 03, 2023, 11:49:05 PM",
      "body": "Quote from: Jawhead999 on June 03, 2023, 02:27:57 PMIt just a short term effect, it's ridiculous if FED raise the interest rate just because of Bitcoin, they can't stop Bitcoin, do we will see 100% interest rate in the future? It's just the illusion of people who always consider bitcoin as their whole world, they see bitcoin as the biggest thing but forget that bitcoin is nothing in the eyes of the Fed, nothing compared to the economy worth 100k billion dollars. Whether the Fed continues to raise interest rates or stops will not affect the market too much because this market is largely manipulated, so the increase or decrease depends on the market maker, not the Fed or any other organization.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "June 04, 2023, 04:51:27 AM",
      "body": "The fed hasn’t released its decision to raise rates or hold them. It’s later this month. Most likely they will hold for June but I am pretty sure for July they will need to be raised. Job market is still strong. Inflation is still there . We are nowhere near the 2% target. Inflation will be lower in the next few months but I think by year end or early next year it will keep going up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "June 04, 2023, 05:12:58 AM",
      "body": "Quote from: FP91G on June 03, 2023, 02:23:00 PMQuote from: bettercrypto on June 03, 2023, 01:51:26 PMWhat do you think about this matter and give us an opinion.Referrence: https://finance.yahoo.com/news/bitcoin-recedes-27k-feds-mester-072628064.htmlIf the Fed does not stop and continues to raise rates, then something else will break in the banking system. New bank failures will positively affect the price of Btc. And after the halving, the price of Btc should be more expensive, otherwise the stock prices of companies that are engaged in mining will fall.Isn't people will be no more afraid to invest in risky assets just as Bitcoin or stocks if Fed will continue to increase the interest rate? Because some may move their money into safer assets.I believe at the beginning of this event, we will see a lot of volatility in the entire cryptocurrency market, especially Bitcoin. We'll never know, because before, Bitcoin always surprises us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "June 04, 2023, 05:17:39 AM",
      "body": "Quote from: Jawhead999 on June 03, 2023, 02:27:57 PMIt just a short term effect, it's ridiculous if FED raise the interest rate just because of Bitcoin, they can't stop Bitcoin, do we will see 100% interest rate in the future? Thats what scares them that bitcoin would outgrew their economic stance. Probably some big players are just playing well with them but once bigger players decided to buy and hold they are the one will suffer. Fed can increase rate all they want but I doubt they can stop people from using and patronising bitcoin. Well thats unstoppable and only matter of time they realize that it already beat the bank strat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "June 04, 2023, 06:30:28 AM",
      "body": "Quote from: bettercrypto on June 03, 2023, 01:51:26 PMThis past May 31, the Fed continued to raise interest rates. And the reason is Quote\"Bitcoin Recedes to $27K as Fed's Mester Favors Unabated Tightening\" Because the Fed said,Quotethere is no compelling case to halt the liquidity tightening. The Fed's unrelenting tightening has roiled risk assets, including cryptocurrencies. Which means there is no compelling reason for the Fed to pause and stop raising interest rates. It was announced that it ended just Wednesday that said President Loretta Mester in an interview.And when Lorreta Mester said this, the value of Bitcoin immediately fell by 2% in the market. And not only Bitcoin was affected but also Nasdaq and other assets as well. But the dollar index increased by 0.27% assets. And Gold is not affected much. And I think what the Fed did is that it can be aggressive without causing the industry to collapse, this is what they decided because they think inflation is still high.So now the traders are no longer expecting the Fed to cut rates this year. Actually this is not good for Bitcoin, Although there is a lot of good news happening in other parts of the world like China and Hongkong, but still the U.S influence is greater in the crypto market. If you look at the price of Btc now, it is under our resistance level, which only proves that the pump in the past is very weak.What do you think about this matter and give us an opinion.Referrence: https://finance.yahoo.com/news/bitcoin-recedes-27k-feds-mester-072628064.htmlIf the feds keep increasing interest rate because it wants to undo bitcoin it will greatly harm the US economy. A lower interest rate encourages more spending which will promote local industry and increase employment opportunities. It discourages borrowing from banks and some local industries might really need these loans they can not access. These hikes in interest rate might negatively affect Bitcoin but it is also harming American banks and others that are connected to them. Bitcoin has recently had the same price movement as the stock exchange but it is gradually becoming semi-autonomous. So President of the Federal Reserve Bank of Cleveland Loretta Mester should know that they can't fight Bitcoin and not fight themselves because the Bitcoin financial sector is a force to reckon with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}