{
  "id": "topic_5405803",
  "title": "CrashVisualBasic",
  "author": "CrashVisualBasic",
  "created_time": "July 10, 2022, 03:09:52 PM",
  "content": "Ethereum chain fees are ridicolous high and full of ponzies scheme and smart contracts with bad purpouses when you want to sell and also when you want to buy because first you have to buy ethereum with bitcoin or dollars, and then after that, from ethereum you have to exchange it for the smartcontract that you want, and fees are really highi was wondering why there is not an exchange based on bitcoin, where you place your seed address and ready to exchangeexamplebitcoin address wants to trade 1 btc for 1 ltc, both should have an address, and value reference should be the dollar, and done, you send LTC to his LTC wallet, and he sends to you BTC to your BTC Addressand nobody had to lose giant amounts of money in feesim using ethereum, it asks me in metamask 1.5 dollars for accept permissons, and 4.5 dollars for a conversionwhen in a centralized exchange where you place your email to register, the fees for trading are really low in bitcoin and others blockchains currencies similar to bitcoinbut ethereum and its smart contracts? too expensive, im not using it anymore, i learned the lessoni was wondering if someone can tell me in which exchange my method is used1. registration not with an email, but with a private key2. low fees, i guess, this exchange should be a blockchain exchange based on stable coin dollar, then they will do the conversion against the stable coin, decreasing fees to the max and giving an small benefit to the exchange, i dont knowwell thats all, if someone can tell me where is a descentralized exchange for bitcoin and others currencies that not requires an email for registration, and is all descentralized like social sites such as member.cash, tell me please, thank you in advance",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405803",
  "comments": [
    {
      "author": "jackg",
      "created_time": "July 10, 2022, 03:18:31 PM",
      "body": "I used \"spookyswap\" for this I think.Back when fees were a lot higher and it was $80-$120 for a metamask trade, I'd bridge my eth across to a different chain (it did it automatically in metamask after asking permission) and paid a bridge fee of $20 both there and back.The transaction was still unnecessarily expensive, but cheaper.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "July 10, 2022, 09:48:05 PM",
      "body": "If the fee is really the issue, the i suggest you use instant swap exchanges. A number of them do not require you to sign up but you must read their terms and conditions to see if they ask for KYC or notCheck here – https://kycnot.me and here – https://bitcointalk.org/index.php?topic=5218464",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "edgycorner",
      "created_time": "July 10, 2022, 11:29:02 PM",
      "body": "Quote from: CrashVisualBasic on July 10, 2022, 03:09:52 PMbitcoin address wants to trade 1 btc for 1 ltc, both should have an address, and value reference should be the dollar, and done, you send LTC to his LTC wallet, and he sends to you BTC to your BTC AddressBut this system can't be trustless, right? There has to be a third party, or a mediator or escrow to make this deal happen. Unless they trust each other(which is very unlikely when it's two strangers).Dex is the only way. You can try bsc dex? they have low fees, unlike ETH.Or you could try the exchange section of this forum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "July 11, 2022, 12:53:23 AM",
      "body": "Quote from: logfiles on July 10, 2022, 09:48:05 PMIf the fee is really the issue, the i suggest you use instant swap exchanges. A number of them do not require you to sign up but you must read their terms and conditions to see if they ask for KYC or notKYC is terrible and I don't like KYC.Why KYC is extremely dangerous – and uselessQuoteCheck here – https://kycnot.me and here – https://bitcointalk.org/index.php?topic=5218464I used to like that site but then I realized that there are non-KYC exchanges that are not included in their list. I have my thinking that they don't actually give a fair list for exchanges. Maybe it is a paid site to promote exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "July 11, 2022, 01:34:38 AM",
      "body": "I think spot trades and swaps are a thing these days. So you don't have to send your coins to a platform and then send them once again to the person you are trading with. Swaps are instant and are everywhere. There are platforms offering that but there are also wallets that support swaps. I don't support an exchange where you need to input your seed phrase. That does not sound a great idea to me. That's risky. When it comes to fees, both Bitcoin and Ethereum's fees could rise at a very high level. But they could also go down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "July 11, 2022, 04:51:09 AM",
      "body": "Quote from: CrashVisualBasic on July 10, 2022, 03:09:52 PMi was wondering if someone can tell me in which exchange my method is used1. registration not with an email, but with a private key2. low fees, i guess, this exchange should be a blockchain exchange based on stable coin dollar, then they will do the conversion against the stable coin, decreasing fees to the max and giving an small benefit to the exchange, i dont knowPrivate key is private and should remain that way. If you are giving up control over your keys that makes it a centralized (custodial) exchange where YOU have no control over your funds and the exchange has full control. They also charge whatever fee they like on each of your trades.In true decentralized exchanges you don't \"sign up\" anywhere, you keep full control of your keys and find other peers to trade with and only pay the on-chain fees. If you use bitcoin you will pay low transaction fees 99% of the times and if you use shitcoins like ethereum you will have to pay very high fees 99% of the times.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "July 11, 2022, 01:52:10 PM",
      "body": "Quote from: CrashVisualBasic on July 10, 2022, 03:09:52 PMexamplebitcoin address wants to trade 1 btc for 1 ltc, both should have an address, and value reference should be the dollar, and done, you send LTC to his LTC wallet, and he sends to you BTC to your BTC AddressIf I can trade 1 BTC for 1 LTC, I would kill myself.  When you want to observe the crypto market, you should start your observation with Bitcoin. Ethereum is the next one. Binance BNB is a third one. You should start from the leader to a few top coins under the leader.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}