{
  "id": "topic_5461408",
  "title": "BlackHatCoiner",
  "author": "BlackHatCoiner",
  "created_time": "July 29, 2023, 02:52:28 PM",
  "content": "I'm thinking of implementing a little project of mine, which involves depositing and withdrawing coins to / from my lightning node. I don't have the resources to run this from my home (and I neither want to), so I'll have to trust some intermediary (i.e., VPS or simple web hosting) for not messing up with my money. The intermediary will not hold access to my lightning funds, but they will have access to the mysql database, which will list every user's balance.I'd like to read some recommendations on which service I should use. I need the server to run php and mysql.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461408",
  "comments": [
    {
      "author": "Faisal2202",
      "created_time": "July 29, 2023, 06:29:58 PM",
      "body": "So basically you are looking for Database service providers. The market is full of them but in my last Semester, I read a course on Cloud Computing where I was taught the use of AWS, and Azure. And both platform has the functionalities you are looking for. And they provide some next level of security. For example, when you will read the whitepaper provided by Azure then you will read somewhere that they did not provide users' data even to governments until you will give them permission. Ans AWS is also a good option for you. Selection depends on your use and longevity of yours. For the long term, you should prefer AWS Databases services and for the short term, you should use Azure because azure will cost you more when you will use it for a longer period of time. You can still use their calculators to calculate your budget. Note*Forgive my suggestions if they are irrelevant.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "July 29, 2023, 09:37:09 PM",
      "body": "Quote from: Faisal2202 on July 29, 2023, 06:29:58 PMFor example, when you will read the whitepaper provided by Azure then you will read somewhere that they did not provide users' data even to governments until you will give them permission.Azure is a Microsoft product. I'm pretty sure they will give the users' data to governments, given they're selling out every last piece of personal data already from all their products, Windows 10/11 first and foremost.No, I don't trust it, not for money confiscation; rather, for denial of their service. Not sure if I'm a money transmitting service according to the country Azure will run, and I definitely don't want Microsoft to stick in their nose and make it any easier to turn down. Quote from: Faisal2202 on July 29, 2023, 06:29:58 PMAns AWS is also a good option for you.Hmm. I don't think I need that much. As far as I know, AWS comes quite expensive, but besides that it also falls into my \"denial of service\" category. If I'm not mistaken, Amazon had announced last year that they'll be shutting down servers that are caught to using cryptocurrencies. Yeah, no thanks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "July 30, 2023, 11:54:53 AM",
      "body": "If you spec out what you need / want first it's going to be an easier discussion with providers.Things like do you need RAID or backup what OS what support options how much storage and so on?I can do something as simple as throwing a 6th gen i7 machine in our DC with a 256GB m.2 and install an os and give it an IP for a ton less money then getting you a cpanel control and putting it behind a firewall. Need RAID 1TB? Well that's also going to be more. Want off hours phone support that's going to be more and so on. Want a bunch of software pre installed / configured that will cost you more. I can keep going but I think you get the point. I even have a stack of PI for friends sitting on a shelf if that is all you need. So before you shop, figure out EXACTLY what you need. ANY service provider even if I am having my job do it for you as a bitcointalk friend is going to hand your data over to the government if they show up with a subpoena / court order. -Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "July 30, 2023, 04:01:26 PMLast edit: July 30, 2023, 05:53:14 PM by BlackHatCoiner",
      "body": "Quote from: ETFbitcoin on July 30, 2023, 09:44:22 AMIf you don't need terminal/root access and want to lower opreational cost, consider \"web hosting\" service rather than VPS which usually support php, mysql and wordpress.The way I imagine it, is as following:User visits site with two pages; deposit and withdraw. When depositing, the user receives a lightning invoice. To accomplish that, the site will give you an onion link, which will be my home's Raspberry hosting a mini-payment-processor page, with just the lightning invoice. Once paid, the Raspberry must query the site's database. Similarly, you can withdraw money. Quote from: DaveF on July 30, 2023, 11:54:53 AMANY service provider even if I am having my job do it for you as a bitcointalk friend is going to hand your data over to the government if they show up with a subpoena / court order.I understand, but it's quite different hosting that kind of stuff on an Azure, as they've made publicly clear that they don't like cryptocurrency supporting software in their servers, and with hosting it in some developing country in Africa, where even copyright enforcement is barely applicable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "July 30, 2023, 06:34:10 PM",
      "body": "Quote from: BlackHatCoiner on July 29, 2023, 09:37:09 PMAzure is a Microsoft product. I'm pretty sure they will give the users' data to governments, given they're selling out every last piece of personal data already from all their products, Windows 10/11 first and foremost.No, I don't trust it, not for money confiscation; rather, for denial of their service. Not sure if I'm a money transmitting service according to the country Azure will run, and I definitely don't want Microsoft to stick in their nose and make it any easier to turn down. Hmm. I don't think I need that much. As far as I know, AWS comes quite expensive, but besides that it also falls into my \"denial of service\" category. If I'm not mistaken, Amazon had announced last year that they'll be shutting down servers that are caught to using cryptocurrencies. Yeah, no thanks. Its not that i wanted you to use AWS or Azure but after reading your reply i became more interesting in knowing about it. Because one thing i can also say for sure, even if the platforms like Huawei (who got banned to use Google service provided by USA) mentioned in there policy like azure mentioned in there whitepaper that. They will not leak users information but still many platform like aforementioned do that. And make some extra bucks. So, i have no words for Azure.But i didn't find any statement saying that AWS doesn't support cryptocurrency related work, because they are integrated with 70+ blockchains and who is going to tell them you are using crypto related work. means they will not ask you why you need this service. You only hade to select your required hardware and buy it. Then start uploading and downloading the Data into your DB. Although if you find it expensive and that's why you are giving up on it then it's ok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "August 01, 2023, 11:50:48 AM",
      "body": "Here are some good VPS servers that support php and mysql you can try:https://www.digitalocean.comhttps://www.linode.comhttps://www.vultr.comOf course, all of these services are paid and their prices vary according to the speeds and services provided. I do not know if they suit your needs with regard to cryptocurrencies, but in general I do not think that you will find hosting sites that do not keep a copy of user data and there is no guarantee that they will not use it..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}