{
  "id": "topic_5487374",
  "title": "EluguHcman",
  "author": "EluguHcman",
  "created_time": "March 03, 2024, 07:38:07 AM",
  "content": "Most importantly in private and security situations pertaining your Bitcoin holding, trust no one and don't be so relaxed with the family that they would never betray you.Just in I traveled to my place of origin and so also other relatives who lives apart came in too due to a family emergency occurance that everyone has to be present.At our arrival in the central family from different destinations, it was actually a great and happy moment being around seeing ourselves because we all have not come together like that for long now.At some point a cousin said to me that... Let me see your beautiful phone so I gave it to him, then I watched to see what he was doing in the phone. I found out he was trying to penetrate on my wallets but unlucky for him that they are all on passwords and at his notice that I am being observant, he began to point out those wallet Apps in my phone that... What App is this and this and this? What is it used for? And suspiciously, he was only after knowing what my wallets Apps are such as the Binance exchange, Ethereum and what I uses them for.Then I told him some of them are system App which I don't even know about their importance and usage in the phone which I am hoping to delete them of from my phone sometimes because they are occupying spaces on my phone. He still stressed on to know why they are on passworded if I don't used them. And I asked him, so what are the Apps used for to your knowledge? He said to me that I must be a Bitcoin investor as he may guess and I asked him... Are you one of the Bitcoin investors? He said no that he does not even have an ideal of it and he was asking me if I could teach him about it because he heard it is a profitable investment. There i told him to let me know when he finds someone who would teach him about it so that we could both learn about it together because I am also looking for a flexible lucrative investment like that to engage on.At this point I was able to close the chapter but yet I was not feeling safe with him anymore because the guy was so eager, desperate and curious to invade my mobil privacies with his sensitive questions.This has thought me a lesson to encrypt my private Apps such as my wallets on a secret folder whereas it would be invisible even when my device is unlocked to the public accessibilities. If you keep your Private documents hidden and invisible to the public, it saves you from sorts of risks.I think that my cousin brother was up to some negative thoughts because he can't claim not to have known about what Bitcoin is and yet he knows about the Apps in used for it. Trust no one with your privacies and keep your source of income that has to be kept secret in a secret.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5487374",
  "comments": [
    {
      "author": "AirtelBuzz",
      "created_time": "March 03, 2024, 08:00:52 AM",
      "body": "@OP are you ok.I don't understand why you posted the same topic three times, did you do it by mistake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "March 03, 2024, 08:03:58 AM",
      "body": "Quote from: EluguHcman on March 03, 2024, 07:38:07 AM Trust no one with your privacies and keep your source of income that has to be kept secret in a secret.I just want to ask, is your cousin a kid or a young person? If it's the latter, then you've done well. It's not safe to trust anyone with your phone.It's usually recommended to secure your personal apps on your devices using passwords or other security features. This is to prevent others from accessing your private information. I never let anyone access my mobile phone for any reason. All my mobile wallets, exchanges, or any app that accesses my funds are hidden on my phone, and only I know where they are.Besides being a Bitcoin user, your phone often contains a lot of important data. If it's accessed by someone else, you could be at risk of theft or losing your funds or information. I've heard of situations where people's phones were accessed without permission, even when the person claimed to be making calls or watching movies as a friend or family member.So my best advice would be not to give out your device where you access your funds, or hide them on your device in a way that only you can access.Quote from: AirtelBuzz on March 03, 2024, 08:00:52 AM@OP are you ok.I don't understand why you posted the same topic three times, did you do it by mistake.It's not his fault. The forums server seems to be experiencing some technical difficulty and at this point is slow. So maybe op might have clicked the post button several times. So it's not his fault. Op, do well to delete them",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EluguHcman",
      "created_time": "March 03, 2024, 08:07:14 AM",
      "body": "Quote from: AirtelBuzz on March 03, 2024, 08:00:52 AM@OP are you ok.I don't understand why you posted the same topic three times, did you do it by mistake.Network error and I have been trying to refresh and reload for a successful upload on several occasions.I am already deleting some of them off at this moment but not working out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "March 03, 2024, 08:23:08 AM",
      "body": "It is unfortunate that you have been exposed to such a situation, but it is better to store your cryptocurrencies in a cold storage wallet and for the wallets on your phone to be watch-only, with some balance in other wallets for emergency purposes.You must also choose the password so that it is unique and cannot be known by anyone, and avoid storing it digitally or in a place that is easy for others to access. If you are in a shared house, it is better to have a Multisig wallets where you leave one of the seeds in your house, and the other two in a safe and separate place.Quote from: EluguHcman on March 03, 2024, 08:07:14 AMNetwork error and I have been trying to refresh and reload for a successful upload on several occasions.I am already deleting some of them off at this moment but not working out.I almost did the same thing, but I decided to open a new tab before refreshing the page and found that the post had already been posted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mrbluntzy",
      "created_time": "March 03, 2024, 08:44:37 AM",
      "body": "Quote from: EluguHcman on March 03, 2024, 07:38:07 AMThere i told him to let me know when he finds someone who would teach him about it so that we could both learn about it together because I am also looking for a flexible lucrative investment like that to engage on. If you keep your Private documents hidden and invisible to the public, it saves you from sorts of risks.I think that my cousin brother was up to some negative thoughts because he can't claim not to have known about what Bitcoin is and yet he knows about the Apps in used for it. Trust no one with your privacies and keep your source of income that has to be kept secret in a secret.Why am I feeling happy with the reply you gave to him on his request to know if you were a Bitcoin investment or notnot?  Because he really deserved the those cold reply  for trying to outsmart you thinking he can have acese to your wallet. I am staying in hostel on school campus and one day a fellow student who asked to see my phone went straight to my wallet, he succeeded to view my balance because I did not put it on password but he was so unlucky that he did not close all the tabs he opened on my phone. After I collected the phone I noticed he accessed my wallet and when I asked him why he did that, he said it's because of curiosity and that he is a Bitcoin lover and wants to learn but I asked him to go are learn from else where because am not telling him any thing. Some people don't have respect for others privacy and it's  not good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "March 03, 2024, 08:59:01 AM",
      "body": "Why did you even give it to him in the first place? I would understand if your cousin is a kid because most kids ask for adults’ phones and try to find games. It’s ok if it was a kid because it’s natural for them to be curious but if it is also an adult or even a teenager, it’s just weird for them to ask for your phone. Don’t they have a phone of themselves? If they don’t have a reasonable excuse to use your phone like their phone is dead and they need to call someone, then just don’t give your phone.I also suggest that you use two phones if you could. I think it would be safest that way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "March 03, 2024, 09:03:25 AM",
      "body": "Quote from: EluguHcman on March 03, 2024, 07:38:07 AMMost importantly in private and security situations pertaining your Bitcoin holding, trust no one and don't be so relaxed with the family that they would never betray you.The person you trust the most may be your greatest threat, that is why it is important to not trust people based on just the relationship you have with them but trust people only when they have proven themselves will be trustworthy. Family and friends can be as dangerous as strangers, hold that consciousness.Quote from: EluguHcman on March 03, 2024, 07:38:07 AMAt some point a cousin said to me that... Let me see your beautiful phone so I gave it to him, then I watched to see what he was doing in the phone.Second lesson is that you should be careful with people that you allow use your device that has your wallets or any other importance application that you have. Mobile phones are meant to be personal.If you are in a situation where it will be difficult turning people down whenever they demand to use your phone or device, then get a second device for yourself, so you can give friends or family that demand to use your phone or laptop the second device that has no important personal application.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "March 03, 2024, 09:46:01 AM",
      "body": "if you have enough funds on your phone to get emotional that your family is seen as a threat to your wealth for just touching your phone. then it means you have too much funds on your phonenever carry all your wealth on your phone. not only for safety from family, but from anyone pick pocketting you in public or you dropping your phone and someone finding itonly carry an amount you dont fear losingset up 2 wallets(cold wallet)1 seeds/private keys on paper or hardware wallet you dont carry around daily for long term hold(hot wallet)1 seeds/private key for just small daily spend amounts you have on your phonethe same goes for fiat currencydont carry a debit card or password of your entire wealth/investment portfolio account around with you, just carry around the debit card for daily spend amounts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "March 03, 2024, 10:38:39 AM",
      "body": "I mean your source of income and how much you make should always be unknown, no matter if it's your close friends or your family/relatives. We all have different source(s) of income and the biggest share of our income is mostly through our profession which you might share with everyone however these days, for example Crypto, that should be kept private from others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "March 03, 2024, 10:47:41 AM",
      "body": "Oh man, this whole saga with your cousin snooping around on your phone trying to get into your crypto wallets is pretty nuts! I mean, don't get me wrong, you gotta watch your back these days but automatically assuming the worst in people usually doesn't end well either.   Maybe your cuz was just curious about all the hype he's heard about Bitcoin and crypto and wanted to ask you some questions when he saw those apps on your phone.  Jumping straight to \"he was totally trying to steal all my coinz!\" is a bit of a stretch dont you think? Hey, props to you for keeping that stuff locked down tight with passwords and secret folders and whatnot.  Safety first, no doubt.  But next time something like this goes down, I'd say take a beat before raging at the dude and accusing him of trying to rob you blind. and  Try explaining crypto and your investments and all that jazz if he's genuinely interested in learning.  But definitely still keep those passwords and logins on the down low.  There's for sure a balanced approach between wearing a tinfoil hat 24/7 and leaving all your stuff unlocked for anyone to peek at.Maybe it's just me, but I trust my close family members, and I can't say we have any \"bad apples\" out there. And I wouldn't let distant relatives, with whom I'm not that close, snoop on my phone in the first place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "March 03, 2024, 11:03:26 AM",
      "body": "Quote from: btc78 on March 03, 2024, 08:59:01 AMWhy did you even give it to him in the first place? I would understand if your cousin is a kid because most kids ask for adults’ phones and try to find games. I would also not trust the phone even to a child, since children these days are smart enough to go to the app store and download from there what appears to be a game but is, in fact, an application that can harm the entire phone. I very often observe this behavior with my small children, who, when they get to my smartphone, download everything in a row, and after them, I have to clean the device. The difference is that I don't store anything serious on my phone, and my phone saves me when I have to drive in the car or wait for something with my kids.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AVE5",
      "created_time": "March 03, 2024, 11:18:43 AM",
      "body": "Quote from: btc78 on March 03, 2024, 08:59:01 AMWhy did you even give it to him in the first place? I would understand if your cousin is a kid because most kids ask for adults’ phones and try to find games. It’s ok if it was a kid because it’s natural for them to be curious but if it is also an adult or even a teenager, it’s just weird for them to ask for your phone. Don’t they have a phone of themselves? If they don’t have a reasonable excuse to use your phone like their phone is dead and they need to call someone, then just don’t give your phone.I also suggest that you use two phones if you could. I think it would be safest that way. I'm just wondering how the Op would had declined from giving his cousin brother the phone. It would be hard for me to not give him it I was even the one. Well, everything could had happened as a point of Ops feeling excited of meeting with his relatives after a long time just as explained. I think the Op even tried with his response to that his cousin because some personal looses control in such coming together situations. Especially when it calls for celebrations, if you don't stay mindful you'd even explain more than expected.But Op, I'd advise you stay at alert when being around the cousin because he doesn't sound genuine with you about all that with the phone but it's cool. I like the courage of you admitting even a relative can think evil against you for a personal interest.If you suggest that Op must use two phones then it should be advisable not to go moving about with the one that contains his Private and bitcoin details so as to enhance his private security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "March 03, 2024, 12:43:56 PM",
      "body": "Nope, the point isn't archiving the files, but you need to have two devices where the one is only used in your home and the other is for daily use. Don't forget you will leave a history because you're searching about Bitcoin in your browser, videos about Bitcoin, etc there are so many traces and you would forget to hide everything.Quote from: btc78 on March 03, 2024, 08:59:01 AMWhy did you even give it to him in the first place? I would understand if your cousin is a kid because most kids ask for adults’ phones and try to find games.If the @OP didn't give it to him, his mother will ask @OP to give him for a second.Other scenario he will say @OP is stingy, instead of enjoying the holiday, @OP would give a bad impression to him including other people (@OP's cousin will tell it to his mother, father, brother, sister etc).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "March 03, 2024, 12:57:54 PM",
      "body": "Quote from: EluguHcman on March 03, 2024, 07:38:07 AMThis has thought me a lesson to encrypt my private Apps such as my wallets on a secret folder whereas it would be invisible even when my device is unlocked to the public accessibilities. I've been doing this for a very long one now. For this reason and also plausible deniability if I ever run into a sticky situation; being from a country where the authorities can search your mobile devices without a warrant or plausible cause, the appearance of any crypto or unusual application could get you labeled a scammer and in more serious trouble.So it's best to keep all crypto and financial related applications private.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "March 03, 2024, 01:10:03 PM",
      "body": "Quote from: ImThour on March 03, 2024, 10:38:39 AMI mean your source of income and how much you make should always be unknown, no matter if it's your close friends or your family/relatives. We all have different source(s) of income and the biggest share of our income is mostly through our profession which you might share with everyone however these days, for example Crypto, that should be kept private from others.I live in a place where people assume that anyone who owns Bitcoin is rich. Most of them don't know that Bitcoin can be bought in bits, so they think that you have to own one or more Bitcoins to be a Bitcoiner. In this case, showing anyone a trace such as a wallet or exchange app on your phone will be very risky. You might immediately become a target of both online and physical criminals. To avoid any connection with Bitcoin I have two phones, one is what I use for my transaction and it is permanently only at home. While the phone I use outside my house doesn't have any apps that will link me with any form of cryptocurrency. This perception of the people in my area has also reduced the number of people I offer Bitcoin education because of the fear of being attacked. It is safer to keep every crypto-related information secret.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "March 03, 2024, 01:27:22 PM",
      "body": "Quote from: Solosanz on March 03, 2024, 12:43:56 PMIf the @OP didn't give it to him, his mother will ask @OP to give him for a second.Just a reminder: Grown-ups usually don't have to do everything their mothers tell them!Quote from: Solosanz on March 03, 2024, 12:43:56 PMOther scenario he will say @OP is stingy, instead of enjoying the holiday OP said it was \"a family emergency\", not a holiday.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alankasman",
      "created_time": "March 03, 2024, 02:20:46 PM",
      "body": "Quote from: EluguHcman on March 03, 2024, 07:38:07 AMMost importantly in private and security situations pertaining your Bitcoin holding, trust no one and don't be so relaxed with the family that they would never betray you.Just in I traveled to my place of origin and so also other relatives who lives apart came in too due to a family emergency occurance that everyone has to be present.Hiding anything that can present the suspicion of people is the concept of our lives in building a small family.Appear as good as it is without showing the slightest strength that has has provided extraordinary comfort even though living in an environment that each person only thinks of himself without taking care of anything that belongs to the neighbors.In matters of crypto assets like Bitcoin, I also do not want to tell and show anyone because for anyone who understands and knows about Bitcoin, this is a very sensitive thing.In maintaining, notifying family members who can really be entrusted I do and simply save in a special Bitcoin (not mobile wallet).Today there was a small disturbance so it was natural that many repeated topics occurred.At least what I experienced.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "March 03, 2024, 04:23:13 PM",
      "body": "Quote from: EluguHcman on March 03, 2024, 07:38:07 AM~snipIt is not a fact that your cousin (if he had access to those crypto apps) would steal your savings (by making a transaction to his wallet). But even simple curiosity justifies it in no way, because rummaging through someone else’s phone is a sign of bad taste. In the modern world, a telephone is a very intimate (extremely personal) device, because so many aspects of life are tied to this device. Starting from personal life, in the form of a list of contacts, messages, photos and other things, to banking services apps, exchangers like Binance and crypto wallets. You can only access this data with those with whom you are willing to share both your savings and information about yourself. Therefore, the phone and apps should be locked with passwords, and even better, don't give the device into the hands of those whom you don't want to introduce to your circle of especially close people. Even the information that you have crypto wallets installed already creates unnecessary questions (as was the case with OP), which can lead to unnecessary problems. Therefore, the fewer strangers who know what is on your phone (and related information), the safer it is for the safety of the contents of your wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "March 03, 2024, 04:35:32 PM",
      "body": "Quote from: EluguHcman on March 03, 2024, 07:38:07 AMAt some point a cousin said to me that... Let me see your beautiful phone so I gave it to him, then I watched to see what he was doing in the phone. I can still understand that you gave your smartphone to someone, but I can't understand why the phone was not protected with a PIN or a fingerprint, which would definitely prevent anyone from invading your privacy. I think you have learned an important lesson, and that is not to let anyone \"play\" with something that should be for your eyes only.Quote from: EluguHcman on March 03, 2024, 07:38:07 AMThis has thought me a lesson to encrypt my private Apps such as my wallets on a secret folder whereas it would be invisible even when my device is unlocked to the public accessibilities. Some smartphones also have a so-called private profile so that a person can separate private from business, but regardless of all privacy protection options, it is not wise for other people to have access to our devices. Those who use fingerprint or facial recognition are always at risk of someone abusing it while they are asleep or in some other unconscious state. It may sound paranoid, but when you go to sleep, turn on the PIN lock",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}