{
  "id": "topic_5408693",
  "title": "DdmrDdmr",
  "author": "DdmrDdmr",
  "created_time": "August 04, 2022, 11:15:27 AM",
  "content": "Pues según se recoge en el artículo abajo referenciado, en breve los citados aeropuertos contarán con cajeros de Bitbase, y por partida doble en los aeropuertos de las baleares.Cabe recordar que, en estos momentos, los cajeros de Bitbase permiten realizar TXs de hasta 995 € por persona y día son KYC (pero proporcionando un número de teléfono válido que controles para recibir los SMSs de confirmación), y con KYC si el importe es superior.Supongo que bajo el punto de vista del negocio, los aeropuertos son buenos puntos de instalación, aunque los usuarios sin KYC no es que vayan a realizar múltiples viajes al aeropuerto durante sus vacaciones (en contraposición a un cajero en el centro de alguna ciudad).https://www.businessinsider.es/aena-concede-primeras-licencias-espana-instalar-cajeros-criptomonedas-aeropuertos-ibiza-alicante-palma-mallorca-1103805",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5408693",
  "comments": [
    {
      "author": "Don Pedro Dinero",
      "created_time": "August 04, 2022, 03:17:57 PM",
      "body": "Si pero si tú tuvieras digamos 5.000 € sin declarar, ¿irías a un cajero de Bitbase?Si tienen tu número de teléfono, Hacienda les podría pedir el número dentro de un año, y creo entiendo que la empresa no se podría negar.Aunque me parece que habrá más de uno jugándosela.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "August 04, 2022, 03:19:59 PM",
      "body": "Quote from: DdmrDdmr on August 04, 2022, 11:15:27 AMCabe recordar que, en estos momentos, los cajeros de Bitbase permiten realizar TXs de hasta 995 € por persona y día son KYC (pero proporcionando un número de teléfono válido que controles para recibir los SMSs de confirmación), y con KYC si el importe es superior.y hasta 2.500€ registrándote en el ATM con tu DNI...Estaba viendo que Bitbase ofrece un Mapa en su sitio en donde podemos encontrar todos los ATM que operan en España y sus Horarios de Operación.Veo que Bitbase está muy bien posicionado en españa, y al parecer es a donde Bitso quiere llegar, espero ver cageros bitso en México pronto.Fuente: https://bitbase.es/cajeros-bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "August 04, 2022, 03:56:30 PM",
      "body": "Quote from: Don Pedro Dinero on August 04, 2022, 03:17:57 PM<…>Ahí tengo dudas acerca del alcance retrospectivo de la información que pedirán y será de obligatorio cumplimiento, aunque deberíamos ponernos en el peor de los escenarios, y suponer que se lo podrían llegar a dar bajo requerimiento administrativo. Ellos indican que los datos actuales sólo los entregan bajo mandato judicial, y puede que sea así ahora, pero no me fiaría de una potencial entrega de datos a Hacienda el año que viene sobre 2022 (especulo, claro está).Los extranjeros probablemente tengan menos problemas para dar su teléfono al utilizarlos de por sí. También los requisitos son distintos según el país de origen del teléfono:Ver:https://www.comparitech.com/blog/vpn-privacy/sim-card-registration-laws/https://prepaid-data-sim-card.fandom.com/wiki/Registration_Policies_Per_CountryQuote from: seoincorporation on August 04, 2022, 03:19:59 PM<…>Aunque quizás sean los menos los que quieren presentar el DNI/pasaporte …",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "August 04, 2022, 08:22:01 PMLast edit: August 04, 2022, 09:23:20 PM by Porfirii",
      "body": "Hace mucho tiempo que vengo pensando que los aeropuertos, grandes terminales de autobuses y trenes, son enclaves estratégicos para colocar uno de estos cajeros. Siempre que veo los \"típicos\" cajeros para extranjeros, me acuerdo.No creo que los extranjeros tengan mucho problema en dar sus datos, incluso para grandes cantidades: al fin y al cabo veo lejano en el tiempo que las autoridades tributarias de distintos países crucen datos, al menos por los importes que comentamos, y si el visitante proviene de fuera de la UE apaga y vámonos. Otro tema es la privacidad, pero por encima de ciertos volúmenes imagino que se tratará de un sacrificio a reconsiderar para algunos.Creo que para muchos nacionales este tipo de cajeros ya no son una opción interesante, quizá la naturaleza de estas nuevas localizaciones responda a un cambio de estrategia por parte de Bitbase buscando un nuevo nicho de mercado.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "August 04, 2022, 09:00:55 PM",
      "body": "Diría que el punto de prueba clave será cuando en lugar de un número de teléfono, se exija en la red de cajeros (Bitbase y supongo que todos los demás) un escaneo del DNI/pasaporte por cualquier importe. Allí entramos no tan solo en un aspecto de identificación, sino de privacidad en un rango superior, algo que conceptualmente es antagónico de lo que solemos querer, y con el riesgo de que los datos se vean comprometidos. Este aspecto podría afectar tanto a nacionales como extranjeros, donde los primeros temerían a Hacienda, y ambos que sus datos no se vean comprometidos a futuro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "August 11, 2022, 02:33:43 PM",
      "body": "Por lo visto, también está en los planes instalar estos cajeros de bitcoin en los aeropuertos de Madrid y Barcelona. AENA, la gestora de los aeropuertos, parece no obstante está por la labor de ver cómo va la experiencia en los aeropuertos citados en el OP, antes de dar cabida a contemplar replicar la experiencia en los escaparates principales de Madrid y Barcelona.Supongo que el artículo tampoco cuenta toda la intrahistoria al respecto, pero podría ser que a medio plazo viésemos estos cajeros en los aeropuertos principales las dos grandes urbes citadas. Ver: https://www.merca2.es/2022/08/11/cajeros-aena-bitbase-madrid-barcelona-1046842/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Csmiami",
      "created_time": "August 12, 2022, 09:44:27 AM",
      "body": "Quote from: DdmrDdmr on August 04, 2022, 11:15:27 AMSupongo que bajo el punto de vista del negocio, los aeropuertos son buenos puntos de instalación, aunque los usuarios sin KYC no es que vayan a realizar múltiples viajes al aeropuerto durante sus vacaciones (en contraposición a un cajero en el centro de alguna ciudad).Algun que otro guiri no; pero algun que otro trabajador con un telefono prepago... por mucho que se esté vigilado por cámaras (deduzco que estarán en el lado restringido de la terminal), tampoco es que las grabaciones vayan a valer de mucho",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}