{
  "id": "topic_5472971",
  "title": "franky1",
  "author": "franky1",
  "created_time": "November 05, 2023, 07:28:09 PM",
  "content": "OK so over the years i have read many regulations and  CBDC whitepapers and policies where i was under the implied impression that payment services had a data protection policy and regulation, in which with regards to other regulations and policies suggested that payment services only had to report information of customers to specific authorities if customers breached certain suspicion thresholds or value thresholds. where by depending on the event only that threshold event(not all records) is forwarded on to the specific authority dealing with that particular event. EG value amount thresholds go to the tax office and suspicion of criminal behaviour goes to the financial crimes department. where those departments investigate to see if it warrants a deeper look to then get a court order to then and only then gain access to that customers full records/data held by the payment services(bank)however many people in this forum were talking about CBDC how they will surveill and sanction people for stupid reasons.. and until this week i thought that was tin foil myth stuff.. because the whitepapers and policies WERE like the current due process mentioned first paragraph. yep even the likes of china's CBDC had payment services keeping the data and authorities only requesting full data with court orderhowever reading this: (about UK government and people in receipt of social security (unemployment/disability/pensions))https://www.msn.com/en-gb/money/other/dwp-propose-investigators-look-at-where-people-spend-their-money-to-stop-benefit-fraud/ar-AA1jnkOY?ocid=finance-verthp-feeds&cvid=2f3bbc2212ad4f89e9402ec193b72501&ei=11QuoteThe Department for Work and Pensions (DWP) is looking at potential legislative measures to help reduce levels of fraud, error and debt in the benefits system, as set out in the May 2022 policy paper, 'Fighting Fraud in the Welfare System'.The potential legislative measures include providing greater third-party access to data, which could see trained investigators collecting information from banks on where claimants are spending money. Trained investigators would also be able to execute search and seizure orders and make arrests,this got me thinking.UK government want full access to every spending habit of people on social security purely to find odd spending habits they can use to stop paying vulnerable claiming peoplei get it there are lots of fraudsters.. but if someone is privately working but pretending to be housebound the tax authorities can simply request a report on anyone in receipt of more then just social security.if this new access policy was to be activated and if UK were to make a CBDC giving out some \"universal basic income\"(replacing social security) they would want to see how people are spending it(so the tin foil hatters were not so insane after all)for instance the easy ones, if you say you are disabled and unable to walk 100m. if they spot a \"card present\" transaction in a supermarket. knowing these stores are long aisle of walking and card present means its someone physically in the store. they can claim you are not disabled because you were able to go shopping.. and your social security income/CBDC universal income stopsyes i can understand that someone genuinely housebound-disabled wouldnt be able to shop around a large supermarket. but their carer could. whereby someones payments are stopped until the disabled person can (months later) defend their case to explain the carer had the card in question. to re-initialise the paymentsthis can also be for instance if you have an add-on payment due to level of support needed. EG pay for a carer to cook for you. but they see instead of paying a care provider you are shown to have just ordered via uber-eats. this can have implications that you do not need a carer and that add-on stops.. again your unable to cook for yourself so order ubereats as a convenience compared to hiring a personal chef.. but that can only be defended at a later date appeal..before this i had the (false sense of trust) mindset that payment processors only had policies/legislation to reveal vague accounting information to central authority in a SARS report IF the payment processor found possible suspicions of crimes(laundering and such). where a court order was needed for full access data..however just being in receipt of central government social security will soon allow the social security department to read ALL of your income and spending habits to then see if they can find a crime/suspicionso again. it seems the dystopia of CBDC conspiracy is actually a possibility",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472971",
  "comments": [
    {
      "author": "Amphenomenon",
      "created_time": "November 05, 2023, 09:08:52 PM",
      "body": "With the cover up on criminal investigation, citizens won't be having their privacy, governments now see themselves as parents in the country and every citizen as a little child who are under the surveillance of anything they do especially online.  As the world is turning to a global village, government and big tech companies like Google will do all means (they claim to legal) to infringe on individuals privacy.Now people will value the anonymity of Bitcoin and the you use of DEX.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "November 05, 2023, 09:17:18 PM",
      "body": "Quote from: franky1 on November 05, 2023, 07:28:09 PMso again. it seems the dystopia of CBDC conspiracy is actually a possibilityWell that is not going to be a surprise, governments abusing of his power to spy people, that is bad, lets see how this is developing in some years, i wonder how many people is going to be controlled by that, something like china social credit.I hope it don't become that dystopia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "November 06, 2023, 04:47:13 AMLast edit: November 06, 2023, 05:07:09 AM by franky1",
      "body": "Quote from: albert0bsd on November 05, 2023, 09:17:18 PM i wonder how many people is going to be controlled by that, something like china social credit.I hope it don't become that dystopia.firstly 23million of 70m are on some form of social security, paid through the DWP (child tax credits, unemployment, disability, state pension)secondly. to debunk the myth.. so farchina does not have such system in operation (in the form the tin foil hatters promote)china does not have a system where people are paid on a \"one bank system\" requiring everyone to reveal their life story to get an account. nor does chinas commercial payment services require to send all information to chinese authority(just the suspicious stuff)china like many countries including the UK/US has private companies that use criminal records checks and private business information sharing, to create a social credit system(blacklist).. where businesses decide if they can trust/suspect their customer. but not at government level(yes i understand commercial payment services/businesses can use their own bespoke social credit system they create to aid in reporting suspicious activity to authorities. but in most countries usually the government is not forming their own \"surveillance\" department nor one that does not require court orders to enforce)its also funny that the city with most surveillance camera's per resident. is london.. yet people scream \"china china china\"here in the UK(and US), real estate agents and employers have a private \"social credit/blacklist system\" that determine if someone should get a rental agreement or employment based on social aspects(yep if your interviewed for a job, expect them to have looked up your social media). EG if someone receives anti-social behaviour orders, but still had good economic credit rating. they wont be first pick for good neighbourhood housing(HOA's do this the most)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "November 06, 2023, 10:45:15 AM",
      "body": "Well, the idea is that people who give you free money they work hard for have the right to know how the money is spent. The givers who deeply understand this concept wouldn't want you to spend their money wrongly and then they get blamed for it. So, if you receive free money, always have it in your mind that the ones giving the money could be watching to know how you spend it or they have the right to know how it's spent.  If some of the givers, who may not be aware of this rights, are not interested in knowing how their money is spent, it doesn't stop those who are aware or interested from knowing, even without your consent, as long as the other rights you sill have are not violated.This is why it's important to depend less on strangers for free things, or people who aren't part of your True Family, or people you do not trust. Depending on them means waving off some of the fundamental rights you have in risky manner. Another kind of people who lose such rights are criminals. If you become a prisoner to the system controlled by an evil entity, the system could assume that you are criminal and not take your rights seriously. If you value the rights and want them preserved then use 100% physical assets you fully own and control, like gold and other natural resources. You could also use certain physical national currencies as alternative means to buy & sell, instead of cyber ones. It's hard for them to surveil, confiscate or censor them, which is part of the reason they want Central Bank Digital Currency (CBDC)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hellflame",
      "created_time": "November 06, 2023, 09:35:04 PM",
      "body": "I cannot find the link online anymore but the CBDC was predicted along with all the main targets to be met by 2025/30 as per WEF recommendations to respective governments around the world who also have their cabinets saturated by WEF and other non elected bodies who are mere factions of higher nobility et al.The ones who claim to own the earth and everything on it CANNOT be unelected or challenged and their key players whether they be elected (preselected) or legacy civil servant within financial/legal or security branches CANNOT be unelected or challenged either.You may elect some preselected candidates as your management but you will NEVER decide who rules you. That is a GUARANTEE.Countries outside the realm of the order will not be left unbothered until ALL countries on earth are within it and divided up among such nobility whether by legacy inheritance or through survival of the fittest and every asset/human and anything of monetary value is itemised.YOU will own NOTHING and that is a GUARANTEE.There is NOTHING you can do about what is coming and if you think bitcoin is going to save you or give you financial freedom to remain outside the net you are sadly mistaken. You will not be allowed dominion or allodial title. You will rent and if you are foolish enough to think you own your property you are infantile because your property is owned by the King and will be taxed even if it earns you nothing and if you fail to pay this tax you are subject to then you will face a loss of property or freedom. Ah you say but taxes bring public services and yes to a point but at some stage those public services will be blatantly owned and your tax will serve the profits of the corporation who owns it and such corporations will be subject to the King or whatever nobility is the real owner of your central bank.China is no different to Russia as to USA as to UK in that these countries are OWNED by their respective factions.The CBDC is a simpler way manage the \"subjects\" who are tenants upon the land.The UK is the most prime example of an OWNED country within a caste system of Class nobility from the monarch to the landed dukes and earls. These are only part of the global black nobility although significantly powerful.Conspiracy theories are sometimes simply \"ridiculous\" notions before they are revealed as what was happening all along. Of course some conspiracy theories are nonsense from feeble minds who believe in aliens and such like but most credibvle ones when they appear are from genuine whistle blowers who soon face the walk of shame and are thrown to the masses of dogs who read tabloid sports pages as their bibles.The masses in most cases deserve what is coming although it is unfortunate there will be great people among these feeble minded fools who will also have to endure it ...for convenience sake of course. The DEVIL \"really is\" in the detail but fools don't read the fineprint.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "November 06, 2023, 11:00:12 PM",
      "body": "Quote from: franky1 on November 06, 2023, 04:47:13 AMchina like many countries including the UK/US has private companies that use criminal records checks and private business information sharing, to create a social credit system(blacklist).. where businesses decide if they can trust/suspect their customer. but not at government levelThat is actually the Social Credit system that I was talking, thank you.For all other check this full video: The Truth About China's Social Credit SystemAnd yes that is maybe optional for some cases, but in the future it may be enforced, we don't have way to know. dictatorships will always wonder us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hellflame",
      "created_time": "December 07, 2024, 01:35:29 PM",
      "body": "Quote from: albert0bsd on November 06, 2023, 11:00:12 PMQuote from: franky1 on November 06, 2023, 04:47:13 AMchina like many countries including the UK/US has private companies that use criminal records checks and private business information sharing, to create a social credit system(blacklist).. where businesses decide if they can trust/suspect their customer. but not at government levelThat is actually the Social Credit system that I was talking, thank you.For all other check this full video: The Truth About China's Social Credit SystemAnd yes that is maybe optional for some cases, but in the future it may be enforced, we don't have way to know. dictatorships will always wonder us.Some might say a global war after a temporary peace and civil strife is possibly planned by the acolytes of Satan where both problematic atheists and problematic true believers are the targets. An atheist cannot truly believe or worship Satan and a true believer never will either. Only those who can be deceived in their beliefs have such potential and these ones will accept the mark of Satan guided by their relevant false prophets. Only G-D knows the day and the hour.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paxmao",
      "created_time": "December 10, 2024, 09:02:34 PM",
      "body": "Quote from: franky1 on November 06, 2023, 04:47:13 AMQuote from: albert0bsd on November 05, 2023, 09:17:18 PM i wonder how many people is going to be controlled by that, something like china social credit.I hope it don't become that dystopia.firstly 23million of 70m are on some form of social security, paid through the DWP (child tax credits, unemployment, disability, state pension)[...]And that is the main problem. There are too many people using the system in UK - to the point that in London there are like 25% - and that may break it, but it is definetely the people who abuse it the ones that have to be tackled first. So yes, there'll be big brother for some.I would not go for people claiming disability as they usually have to go through a doctor's examination, but I am very much in favour of knowing how the subsidies are being spent - because it is far too easy - again not just in the UK, but in many EU countries - to fake and work underhand.If you are claiming XYZ, those must be your circumpstances and that is in UK or anywhere with a social system that supports individuals that either have a bad situation or have a more permanent condition.Quote from: albert0bsd on November 06, 2023, 11:00:12 PMQuote from: franky1 on November 06, 2023, 04:47:13 AMchina like many countries including the UK/US has private companies that use criminal records checks and private business information sharing, to create a social credit system(blacklist).. where businesses decide if they can trust/suspect their customer. but not at government levelThat is actually the Social Credit system that I was talking, thank you.For all other check this full video: The Truth About China's Social Credit SystemAnd yes that is maybe optional for some cases, but in the future it may be enforced, we don't have way to know. dictatorships will always wonder us.As far as I know, the \"credit system\" in Europe is about properly financial credit. If you don't pay, it is only fair that others are made aware. If you are a criminal and have a record, it is only fair that your future employers know, particularly dealing with kids, weapons or state secrets.I do not think this has any resemblance to the system in China, which is intended for political prosecution.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "December 11, 2024, 12:51:50 AM",
      "body": "Quote from: paxmao on December 10, 2024, 09:02:34 PMQuote from: franky1 on November 06, 2023, 04:47:13 AMQuote from: albert0bsd on November 05, 2023, 09:17:18 PM i wonder how many people is going to be controlled by that, something like china social credit.I hope it don't become that dystopia.firstly 23million of 70m are on some form of social security, paid through the DWP (child tax credits, unemployment, disability, state pension)[...]And that is the main problem. There are too many people using the system in UK - to the point that in London there are like 25% - and that may break it, but it is definetely the people who abuse it the ones that have to be tackled first. So yes, there'll be big brother for some.I would not go for people claiming disability as they usually have to go through a doctor's examination, but I am very much in favour of knowing how the subsidies are being spent - because it is far too easy - again not just in the UK, but in many EU countries - to fake and work underhand.If you are claiming XYZ, those must be your circumpstances and that is in UK or anywhere with a social system that supports individuals that either have a bad situation or have a more permanent condition.Quote from: albert0bsd on November 06, 2023, 11:00:12 PMQuote from: franky1 on November 06, 2023, 04:47:13 AMchina like many countries including the UK/US has private companies that use criminal records checks and private business information sharing, to create a social credit system(blacklist).. where businesses decide if they can trust/suspect their customer. but not at government levelThat is actually the Social Credit system that I was talking, thank you.For all other check this full video: The Truth About China's Social Credit SystemAnd yes that is maybe optional for some cases, but in the future it may be enforced, we don't have way to know. dictatorships will always wonder us.As far as I know, the \"credit system\" in Europe is about properly financial credit. If you don't pay, it is only fair that others are made aware. If you are a criminal and have a record, it is only fair that your future employers know, particularly dealing with kids, weapons or state secrets.I do not think this has any resemblance to the system in China, which is intended for political prosecution.The Western credit system is on the brink of failure. Anytime soon, now. Of course, it's so much more comfortable to lie to yourself... until it hits, that is.East vs. West: A Global Dollar Dump Is Inevitable And The US Must Preparehttps://alt-market.us/east-vs-west-a-global-dollar-dump-is-inevitable-and-the-us-must-prepare/This article was written by Brandon Smith and originally published at Birch Gold GroupIn October of 2024, Russia hosted the annual BRICS Summit in the city of Kazan with the intent to show unity among developing nations and general eastern interests. The Kremlin, a target of severe NATO sanctions since the start of the war in Ukraine, has been effective in solidifying economic guarantees from BRICS partners and circumventing western economic controls.Despite being removed from the SWIFT banking network and being cut off from a large percentage of global trade, Russia has continued to garner solid export revenues. We certainly aren't seeing the total collapse of the Russian economy that so many media \"experts\" predicted.  The reason? Russia is resource rich and in an inflationary environment countries that are heavy in commodities sold at lower prices are always sought after. The BRICS event this year was a reminder that the west's financial influence is in decline.At that same meeting, Putin called for an alternative international payment system and passed around a mock-up of what he called a BRICS \"bank note\". The paper note was purely symbolic, but it's presence at the summit started an uproar within the establishment media. Pundits were quick to \"fact check\" the story and declare that this was not a real unified currency announcement. As far as I know, no one said it was. What we did say, however, is that a real multilateral currency system cutting out the dollar is MUCH CLOSER than most people realize.US dollar dominance to end? BRICS launches symbolic banknote; Putin says, ‘They used it as weapon…’ - https://www.youtube.com/watch?v=AQJWijqGZvs...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mariannalik",
      "created_time": "December 11, 2024, 08:54:11 AM",
      "body": "Maybe it is, even the banks will never tell us the truth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}