{
  "id": "topic_5474483",
  "title": "Jossque",
  "author": "Jossque",
  "created_time": "November 17, 2023, 07:05:16 PM",
  "content": "OKX,X1 adlı ZK tabanlı L2 ağını duyurdu.Ağ oluşturulurken Polygon CDK kullandığını belirtmişler.X1, OKX ürünlerini, kullanıcılarını ve varlıklarını Web3'e bağlamayı ve herkesin üzerine inşa edebileceği açık bir ekosistem sağlamayı amaçlıyor.Mainnet lansmanının 2024 yılının 1. çeyreğinde yapılması ve zkBridge, zkOracle ve zkDEX'in tanıtılması planlanıyor.Ağ ile ilgili neler yapabileceğimize bakacak olursak eğer;Chainlist üzerinden ağı eklemek ile başlayabiliriz.https://chainlist.org/chain/195Daha sonra faucet üzerinden test token talep edebiliriz.https://www.okx.com/tr/x1/faucetYapabildiğimiz tek işlem olarak bridge var.Bunu test etmek ile başlayabiliriz.Sepolia ağında ETH'iniz yoksa faucetten talep edelim.https://www.okx.com/tr/x1/bridge-testDiğer tüm detaylar ve bilgiler için sitesini ziyaret edebilirsiniz.https://www.okx.com/tr/x1",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474483",
  "comments": [
    {
      "author": "Jossque",
      "created_time": "February 08, 2024, 03:46:29 PM",
      "body": "OKX X1 ağını da boşlamamak gerekiyor.Tekrar hatırlatmakta fayda var.ilk önce tekrardan faucete gidip hem sepolia ağında hem de X1 ağında faucet üzerinden mint gerçekleştirelim.https://www.okx.com/tr/x1/faucetdaha sonra gerçekleştirdiğimiz mintler sonrası bridge kullanarak bunları ağlar arası transfer etmeyi unutmayalım.https://www.okx.com/tr/x1/bridge-test",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bobita",
      "created_time": "February 10, 2024, 11:41:18 PM",
      "body": "Eyvallah Jossque, tekrar hatırlatmışsın sağolasın. bir cüzdandan mint, köprüleme  falan yaptım.Bu tarz şeyler çok arttı, kafanı çevirsen testnet, bridge vb rastgeliyorsun, çok büyük bölümü de hikaye olacak ama bir şeyler yakalamak için boşlamamak gerekiyor, bunun arkasında Okx olması da ayrı bir unsur tabii ki.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "demir77",
      "created_time": "February 12, 2024, 06:07:34 PM",
      "body": "Teşekkürler. İşlemleri yaptım. Okx adından söz ettirmek için airdrop yapabilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}