{
  "id": "topic_5450369",
  "title": "Mason2023",
  "author": "Mason2023",
  "created_time": "April 27, 2023, 12:19:19 PM",
  "content": "Hi, Im new here but i been in trading quite long time.Im looking for partners on trading maybe Even share the ideas and knowledge. I. Offering opportunity to you to follow my signals you pay little % later after successful trade.I do spot and futures signals but i guess futures signals are more valueble then spot ones.I never ask you the upfront money for anything and Im not interested just quick money Im more interested about building strong relations to help each other to get successful. NB.strictly,you pay only If you see results of my work I know about trading techicals aswell candle stick patterns and other type of imdicators Im using mostly Moving averages for quick profit.Send me pm and let's see what we can Do it.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450369",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "April 27, 2023, 12:24:02 PM",
      "body": "Learn how to trade yourself. Do away with signals, it will not help you.Quote from: Mason2023 on April 27, 2023, 12:19:19 PMSend me pm and let's see what we can Do it.You can post your signals on this your thread.They should send you pm because you care about your pocket. I can tell anyone to send me pm and what I will tell him will be different from what you post and I will only make sure he pay something. We humans can be cruel.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "April 27, 2023, 02:51:08 PM",
      "body": "You look like you're looking for a rabbit to test your trading skills, while you do nothing on your side. Unless of course you provide some signal samples to at least convince people here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mason2023",
      "created_time": "April 27, 2023, 03:17:22 PM",
      "body": "Quote from: noorman0 on April 27, 2023, 02:51:08 PMYou look like you're looking for a rabbit to test your trading skills, while you do nothing on your side. Unless of course you provide some signal samples to at least convince people here.Example then Sol/usdt looking bullish .for me from here. MOVING average shows the trend Will go up.Green candles set up looking nice aswell. Sol to 22-23$ but i would sell it when 22.45$ About btc: I see the local support from here and also the nice MOVING Average.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "April 27, 2023, 04:05:24 PM",
      "body": "Quote from: Mason2023 on April 27, 2023, 03:17:22 PM-snip-Why is it just text?You have to give your scribble on the chart that you are trying to predict. If this is your promotion, of course, others will not be interested in just making this kind of text LOL.Give us your portfolio and convince someone to join you. Your signals will only mislead others without any education or explanation of what you are predicting. Trading cannot be done instantly, it takes process and not just following signals. If you want to continue promoting yourself, post on the Service board, there you will find your customers (if they believe).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "April 27, 2023, 04:26:00 PM",
      "body": "Quote from: taufik123 on April 27, 2023, 04:05:24 PMWhy is it just text?I agree with taufik123 why you're only giving the signal in text form? If you're a competent trader then showing the signal via chart should be a better option. The text based signals are often copied from one group to other, and there are thousands of such groups on Telegram.Trading is a journey and it requires you to master the skills and throughout the journey you'll have to face  many challenges as well as losses. If you can prove that your signals are working then kindly share some working trades that you've done using the signals. You should move your topic to services board as that one seems more suitable for such offers. Here on trading board you're not offering something valuable that could be used for learning purposes. I would also recommend you to share some proper screen shots of your trades to show your trading skills.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oilacris",
      "created_time": "April 27, 2023, 07:56:04 PM",
      "body": "Quote from: Mason2023 on April 27, 2023, 12:19:19 PMHi, Im new here but i been in trading quite long time.Im looking for partners on trading maybe Even share the ideas and knowledge. I. Offering opportunity to you to follow my signals you pay little % later after successful trade.I do spot and futures signals but i guess futures signals are more valueble then spot ones.I never ask you the upfront money for anything and Im not interested just quick money Im more interested about building strong relations to help each other to get successful. NB.strictly,you pay only If you see results of my work I know about trading techicals aswell candle stick patterns and other type of imdicators Im using mostly Moving averages for quick profit.Send me pm and let's see what we can Do it.Why not putting up some of your signals on this thread of yours and let see if you do have that higher profitable winning trades than with losses? There's no need for you to ask out people tojoin up your telegram or would really be that making some PM because it is really just that too hassle. If you are planning up to build some user base or followers then you should really bethat be able to convince out and of course and just like on what i have recommended that posting up your trading tips and analysis on this thread itself wont really be a bad start.People here are really that tired on for those kind of post on where asking out for some partnerships and trying out to convince that they arent just subscription fee grab or simply money grab.We do know that trading isnt something that would really be that simple and we are all speculators on here on which there would be no assurance on profiting even if you do follow someone. If you are that profitable then why eager on getting some followers? Those income you would be getting would be that covered up with your trading profits which it do always boggles me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mason2023",
      "created_time": "April 27, 2023, 08:14:52 PM",
      "body": "Quote from: SamReomo on April 27, 2023, 04:26:00 PMQuote from: taufik123 on April 27, 2023, 04:05:24 PMWhy is it just text?I agree with taufik123 why you're only giving the signal in text form? If you're a competent trader then showing the signal via chart should be a better option. The text based signals are often copied from one group to other, and there are thousands of such groups on Telegram.Trading is a journey and it requires you to master the skills and throughout the journey you'll have to face  many challenges as well as losses. If you can prove that your signals are working then kindly share some working trades that you've done using the signals. You should move your topic to services board as that one seems more suitable for such offers. Here on trading board you're not offering something valuable that could be used for learning purposes. I would also recommend you to share some proper screen shots of your trades to show your trading skills. I have figured out that i can make about 3 successful trades per Week.Less trades for futures always the better and i try to catch if i can bigger waves of market movements. I do kinda coumpond style trading. My trading plan for one month is like this.3-4 times per Week so i trade about 10-15 days in one month. I started capital of 2000$ so each trade i use 50% . Of my capital i trade with bigger waves so i try to get at least 30% out of each trade. By doing math it would be profit 0.30%-0.70% per trade. I don't overtrade,Simply many traders can't be good when they overtrade.Yesrterday i had pretty good short i made some 200% quick profit couse of short wicks.(short wicks or long wicks are like needles on candles they move fast )- off course i was preparing a lot to Open position to get good entry.Me personally i dont prefer trading to collect small ammounts of each trade i rather keep the eyes on market when i see very good entry for long or short i do the entry.Im more successful by catching bigger moves and it Will keeping me more motivated. I prefer to watch all day the Market waiting for the right entry and then i make more with few hours then average person with few months of Job salary.The money i make i use money for healthy lifestyle it's important to have enough rest by sleeping and eating healthy food.  Enough time for rest i only trade max 4 days per Week. But usually i trade 2-3 days per Week becouse just with one day i make enough money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "disconnectme",
      "created_time": "April 27, 2023, 08:36:26 PM",
      "body": "I don't know your end goal but something is fishing somewhere. I have seen some people have purple patches and they feel they are good traders until reality is done on them when they have successive losses. I sense you want to monetize your knowledge and trading skill but you first need to gain trust, post  like 20 trades here and the results will speak for itself",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "April 27, 2023, 10:00:25 PM",
      "body": "Quote from: Mason2023 on April 27, 2023, 12:19:19 PM-cut-I never ask you the upfront money for anything and Im not interested just quick money Im more interested about building strong relations to help each other to get successful. NB.strictly,you pay only If you see results of my work -cut-Lol, you are basically asking for free money if you happen to guess right and i am guessing that gullible people would pay because they thought that your signals were reliable. If you guess wrong there are no repercussions what so ever for you. You can only win with this tactic while everyone else is better off just not listening to you at all . Prove me wrong and start a tradingview account with a history of your winnings. I am willing to bet you make more losses, but then again, it's 50-50 change if you are guessing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Myleschetty",
      "created_time": "April 27, 2023, 10:05:30 PM",
      "body": "Quote from: Mason2023 on April 27, 2023, 12:19:19 PMHi, Im new here but i been in trading quite long time.Im looking for partners on trading maybe Even share the ideas and knowledge. You don't need to partner with anyone just look around this forum you'll some users to post that trading trend and you can also join some trading experts on Twitter since they also post some trading knowledge sometimes.Quote from: Mason2023 on April 27, 2023, 12:19:19 PMI. Offering opportunity to you to follow my signals you pay little % later after successful trade.The signal is just a scam scheme used to scam naive crypto traders who don't want to learn the fundamental aspect of making a profitable crypto trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "April 27, 2023, 11:42:11 PM",
      "body": "Since you seem to be confident as you're trying to sell your picks and signals, why not apply it to your own trades and be the own customer of your signals?I don't understand that many such offers do exist and if you're good with your picks then make yourself the own benefactor of it and be productive with your trades.In that case, you'll not going to depend on the little commission that people that shall approach you and want to hear what you've got there. The results will benefit you instead of sharing it with others that might even runaway afterward if they profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slaman29",
      "created_time": "April 28, 2023, 04:02:16 AM",
      "body": "If you knew how to even make 5% a year on trading on your own for every year you have been trading, you would be the most famous trader in the world.I hate to repeat myself all the time but if you're a new account, and you can't even bother spelling properly in 2023 when spellchecker is free. Then why should anyone trust you with 1 single cent?Sometimes people show me this kind of stuff and it seems more common in crypto these days and it's so hard to argue how scammy the space can be :p",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "April 28, 2023, 04:34:46 AM",
      "body": "So you're looking someone to trade for you and when the trade is successful, you will ask some profit share of the successful trade without upfront payment? indeed it looks promising as you seems will not scam. But in order to convince anyone here, what if your signal will move opposite than your predictions? there's need a consequence about it. Will you accept escrow? whenever your prediction goes wrong, you will pay all of the losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jody.Drummer",
      "created_time": "April 28, 2023, 05:50:02 AM",
      "body": "Quote from: Mason2023 on April 27, 2023, 12:19:19 PMI never ask you the upfront money for anything and Im not interested just quick money Im more interested about building strong relations to help each other to get successful. NB.strictly,you pay only If you see results of my work First, why pay in advance when you haven't seen the results you get because it's like giving you free money.Second, get paid only for the results of the work, what do you offer when your work does not match the results in the end?Well actually I don't forbid things like this but when you look at the conditions you need to do many ways to convince everyone that you are really great.Maybe when it's done your efforts to fool it can still be considered lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "April 29, 2023, 03:19:16 AM",
      "body": "Such discussions will not lead you in any good direction. If you really intend to build strong relationships to help each other achieve success, all you have to do is share the data publicly and for free for a period of two to 6 months, then it will be a sufficient period to judge your experience and then you can make everything paid. And you will get a good return if you convince others to invest in your signals.I do not advise anyone to accept the help of a third party in trading, it is a personal experience that encourages learning, and therefore enhancing your capabilities is your best option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stable090",
      "created_time": "April 29, 2023, 04:57:52 AM",
      "body": "Quote from: Mason2023 on April 27, 2023, 12:19:19 PMI. Offering opportunity to you to follow my signals you pay little % later after successful trade.I do spot and futures signals but i guess futures signals are more valueble than spot ones.Another signal provided have been spotted, you are trying to build a relationship here, then why will the person pay you? If you want to buy a stronger relationship, then you should have make the signal free maybe the relationship will have been stronger. I won’t recommend anyone waste his money paying the Op, if anyone wants make money from crypto trading, then take your time and learn how to trade yourself, their are different books you can read that will guild you, don’t depend on trading signals.Quote from: Mason2023 on April 27, 2023, 12:19:19 PMI never ask you the upfront money for anything and Im not interested just quick money Im more interested about building strong relations to help each other to get successful. NB.strictly,you pay only If you see results of my work You are just like other signal providers, after making so much noise just to attract people then you end up fucking them up. Your main purpose of joining the forum is just to provide signals and sell to others. Maybe you didn’t get enough customers outside the forum, and you decided to create forum account and market yourself here since you noticed that this place is a crypto forum, don’t be surprised you will be disappointed, because you won’t get the expected result.Quote from: Mason2023 on April 27, 2023, 12:19:19 PMI know about trading techicals aswell candle stick patterns and other type of imdicators Im using mostly Moving averages for quick profit.Why don’t you just create a thread here and explain everything you just mentioned above on the thread, it will have been more better, let everyone learn so that they will put it in practice whenever they are trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ice18",
      "created_time": "April 29, 2023, 05:16:13 AM",
      "body": "Too risky! why would I trust my money to stranger with no assurance if getting back or you just runaway if you got liquidated, you said you are trading for a long time now and what is the result? You end up asking partners if you really good at trading then I assume you already earned enough money not inviting others to trust and use their hard earned money to you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "May 01, 2023, 08:27:06 PM",
      "body": "Show some results first. Where's your proof that your strategy really works? Major red flag that you have no proof or data which could make us believe that this is legit. And also coming to this forum with a new account and directly asking people to invest in your analysis gives it away instantly. I will never trust someone like you. Try to build up your account, then show us some progress, results and data that we can analysis to decide if it's worthy or not. Then we may consider looking into it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "irhact",
      "created_time": "May 02, 2023, 04:28:07 AM",
      "body": "Quote from: Mason2023 on April 27, 2023, 12:19:19 PMHi, Im new here but i been in trading quite long time.Im looking for partners on trading maybe Even share the ideas and knowledge. If you're as good as you say you're, why don't you just look for capital and keep trading on your own then make as much profits as you can without having to explain yourself to anyone like your students that would be asking lots of questions if they take this deal you're offering and it later turns out unsuccessful. If you are good at training, go look for some woekyti bring capital.While looking at your offer, it looks too good to be true, why are you putting yourself in a situation that people can use you. What happens when your partners don't keep to their end of the deal, what do you do then. You can stop them from receiving future signals but they have already profited from you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}