{
  "id": "topic_5401997",
  "title": "skiper",
  "author": "skiper",
  "created_time": "June 09, 2022, 08:31:36 PM",
  "content": "I'm not going to talk about money laundering in huobi... like in binance, what I'm here to say is about the LUNA airdrop and the way HUOBI stealsMay 25 they say that in block 7790000 they will capture an indicative hour, but they say that the capture will be done in block 7790000https://www.huobi.com/support/en-us/detail/34907813868220****May 26After the migration and upgrade, Huobi Global will take a snapshot of the LUNA and USTC positions on the original Terra in user accounts when the block height reaches 7,790,000 (''expected'' at 20:00 (UTC) on May 26, 2022) time they say expected, they do not say they will do it at 8:00 p.m. they say they will do it to block 7790000https://www.huobi.com/support/en-us/detail/44907894352859****May 29 this is the best... they no longer talk about the block... they say they took the snapshot at 20:00, this is already a clear idea of ​​not paying, because the currency only reached block 7790000 fell 50% because we all sold it...block 7790000 arrived at 18:30:08 on May 26https://atomscan.com/terra/blocks/7790000https://www.huobi.com/support/en-us/detail/104908111777765****and if you ask them for your old wallet... they say they can't give it to you, it's the new one... anywaythis is a clear example of manipulation, now we have to know if they did it to keep our moons, why would they have given them to them, in this case it would be a robbery and scam, please help people please, it's not just me if the luna airdrop was counted when block 779000 finished, which was at 18:38 and huobi made its own capture at 20:00, many of us sold after 18:38, where did those new lunas end up? LFT saw them in the wallet and supposedly sent them scammers huobi....",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401997",
  "comments": [
    {
      "author": "jackg",
      "created_time": "June 09, 2022, 08:41:48 PM",
      "body": "Did you actually make a trade within those 22 minutes then?I'd've expected them to suspend trading (their announcement said they did with margin accounts), if they didn't you might want to email their support and see if there's anything they'd be able to offer to do with it but it might be unlikely as they'll have already distributed your airdropped tokens to the buyer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "June 09, 2022, 08:54:43 PM",
      "body": "Hell, Okx didn't even send me any airdrop, yet I had some Luna in there and I don't even care because it's worthless anyway.My question is who took the snapshot, was it the Luna team or the Exchanges?Secondly, I hope you read this small note at the bottom of their announcements. I am not supporting them but am just sayingQuoteHuobi Global reserves the right in its sole discretion to amend, change or cancel this announcement at any time and for any reasons without prior notice. The above is for information purposes only, and Huobi Global makes no recommendations or guarantees in respect to any digital asset, digital asset derivative, product, or promotion on Huobi Global.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "June 10, 2022, 05:58:14 PM",
      "body": "Quote from: JeromeTash on June 09, 2022, 08:54:43 PMMy question is who took the snapshot, was it the Luna team or the Exchanges?It was done by the terra network as I received a notification from a few exchanges about it in advance of being credited funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "skiper",
      "created_time": "June 10, 2022, 08:53:49 PM",
      "body": "I already spoke with support for 4 days and nothing... they just said that they took a snapshot at 8pm I told them the official network 6.30pm... and nothing... they entered a loop...and they knew what was going to happen... everyone sold... just passing the block... but I risk my hand that they got the balance of 6:30 pm on lunas... yes or yes, they understand the robbery ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "June 10, 2022, 09:11:17 PM",
      "body": "Luna case needs a thorough investigation because it contains one of the most famous current collapses in cryptocurrencies and it may be a major scam in which the currency team involved with several parties, so without opening that investigation we can consider everyone involved to get as much as possible of profits.Exchanges have updated the balances of their clients who meet the Airdop conditions, and some of the unlucky clients will not get anything either because they violate the terms of use of the platform (and the platform knows this, but it lets them trade) or for other reasons.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "June 10, 2022, 09:43:30 PM",
      "body": "Quote from: skiper on June 10, 2022, 08:53:49 PMand they knew what was going to happen... everyone sold... just passing the block... but I risk my hand that they got the balance of 6:30 pm on lunas... yes or yes, they understand the robbery ?Everything about the Luna crash and the whole Luna 2.0 airdrop smells fishy. I have [people on Twitter complaining that even with the airdrop they received very few coins and on top of that a bigger portion was locked  So even the small portion of allocated Luna 2.0 that is tradable, I doubt if they have even been able to recover a tenth of the value of assets they lost during the crash and the value of Luna 2.0 keeps crashing every day which means within a month or so the value of the locked assets will also be worthless.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UserU",
      "created_time": "June 11, 2022, 05:15:38 PM",
      "body": "Quote from: JeromeTash on June 10, 2022, 09:43:30 PMEverything about the Luna crash and the whole Luna 2.0 airdrop smells fishy. I have [people on Twitter complaining that even with the airdrop they received very few coins and on top of that a bigger portion was locked  So even the small portion of allocated Luna 2.0 that is tradable, I doubt if they have even been able to recover a tenth of the value of assets they lost during the crash and the value of Luna 2.0 keeps crashing every day which means within a month or so the value of the locked assets will also be worthless.If the distribution wasn't vested, LUNA would crash to the very bottom.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}