{
  "id": "topic_5405189",
  "title": "Gencecikmen",
  "author": "Gencecikmen",
  "created_time": "July 04, 2022, 08:51:33 PM",
  "content": "TÜFE'de 2022 yılı Haziran ayında bir önceki aya göre %4,95 olarak açıklandı. Enflasyon 2022 yılının Ocak ayında yüzde 11,10, Şubat ayında yüzde 4,81, Mart ayında yüzde 5,46, Nisan ayında yüzde 7,25, Mayıs ayında yüzde 2,98, Haziran ayında da yüzde 4,95 olarak açıklandı. Son 6 aylık enflasyon oranı ise 34.85 oldu. Yıllık enflasyon oranı ise %78,62 oldu. ENAG son 6 ay için yüzde 71 enflasyon belirledi. Memurlar ve emekliler yüzde 30 eksik maaş artışı alacak.ENAG son 12 ay için yüzde 175.5 enflasyon belirledi. Memurlar ve emeklilerin son 12 aydaki kaybı ise yüzde 90 olarak gerçekleşti. Asgari ücrette ise kayıp daha fazla.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405189",
  "comments": [
    {
      "author": "Gerceklerisoyleyen",
      "created_time": "July 04, 2022, 10:04:34 PM",
      "body": "Quote from: Gencecikmen on July 04, 2022, 08:51:33 PMTÜFE'de 2022 yılı Haziran ayında bir önceki aya göre %4,95 olarak açıklandı. Enflasyon 2022 yılının Ocak ayında yüzde 11,10, Şubat ayında yüzde 4,81, Mart ayında yüzde 5,46, Nisan ayında yüzde 7,25, Mayıs ayında yüzde 2,98, Haziran ayında da yüzde 4,95 olarak açıklandı. Son 6 aylık enflasyon oranı ise 34.85 oldu. Yıllık enflasyon oranı ise %78,62 oldu. ENAG son 6 ay için yüzde 71 enflasyon belirledi. Memurlar ve emekliler yüzde 30 eksik maaş artışı alacak.ENAG son 12 ay için yüzde 175.5 enflasyon belirledi. Memurlar ve emeklilerin son 12 aydaki kaybı ise yüzde 90 olarak gerçekleşti. Asgari ücrette ise kayıp daha fazla.Böyle giderse 5 sene sonra askari ücret 100 bin tl olacak memurda 250-300 bin tl alacak aylık her yıl %40 zam var çünki biraz mantıga haykırı değil mi",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "July 05, 2022, 06:59:11 AM",
      "body": "hissedilen ile resmi rakam olarak açıklanan arasındaki fark aslında herşeyi ortaya koyuyor. enflasyon farkı olarak ödenen rakam da, normal zam oranı da aslında reelde yaşananın tam karşılığı değil. TÜİK' in objektifliği konusunda artık kimsenin kafasında soru işareti kaldığını düşünmüyorum. çok değil bir yıl öncesine gidip rakamları günümüz rakamları ile karşılaştıran sıradan matematik bilgisi sahibi biri bile, bu verilere mabadıyla güler. işin en kötü tarafı, öğrenilmiş çaresizlik içindeyiz, tepkilerimiz gittikçe güçsüzleşiyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "July 05, 2022, 07:02:56 AM",
      "body": "Bol sıfır geri geliyor ülke resmen şöyle yönetiliyor.birileri toplarlıyor o kıtlıkla başka bir parti geliyorkıtlığın bolluğu ve rahatlığı o partiye mal oluyor ve bunlar yiyor içiyor sıçıyor kıtlıkta birileri toplarlıyor ve o kıtlık ve sıkıntıs sonrası başka bir parti geliyor.aynı döngü böyle devam ediyor ülke yönetmeyi ev yönetmek sanıyorlar yaptığın bir harket yıllar sonra etkisini gösteriyor doğal olarakta bazı dönemlerde koltuğu boş bile bıraksan iyi yönetiliyormuşuz havası veriyor.Şimdi silinen sıfırların yavaş yavaş geri gelme zamanı.. Ekmek 20 lira olur çok kalmaz Bulunduğum ilçede 10 lira oldu.Rakamla oynayan başarılı iktidar mı olur. Anca kendini kandırır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "July 05, 2022, 09:03:33 AM",
      "body": "Quote from: Gerceklerisoyleyen on July 04, 2022, 10:04:34 PMQuote from: Gencecikmen on July 04, 2022, 08:51:33 PMTÜFE'de 2022 yılı Haziran ayında bir önceki aya göre %4,95 olarak açıklandı. Enflasyon 2022 yılının Ocak ayında yüzde 11,10, Şubat ayında yüzde 4,81, Mart ayında yüzde 5,46, Nisan ayında yüzde 7,25, Mayıs ayında yüzde 2,98, Haziran ayında da yüzde 4,95 olarak açıklandı. Son 6 aylık enflasyon oranı ise 34.85 oldu. Yıllık enflasyon oranı ise %78,62 oldu. ENAG son 6 ay için yüzde 71 enflasyon belirledi. Memurlar ve emekliler yüzde 30 eksik maaş artışı alacak.ENAG son 12 ay için yüzde 175.5 enflasyon belirledi. Memurlar ve emeklilerin son 12 aydaki kaybı ise yüzde 90 olarak gerçekleşti. Asgari ücrette ise kayıp daha fazla.Böyle giderse 5 sene sonra askari ücret 100 bin tl olacak memurda 250-300 bin tl alacak aylık her yıl %40 zam var çünki biraz mantıga haykırı değil miHocam maaş rakamları o seviyeye ulaşınca bu sefer derlerki \"paradan sıfır atıyoruz\" şak şak. Sanki sıfır atınca paradan para değerleniyor gibi algı yapılır sonra yine şak şak. Şak şak aslında şak şak şeklinde olan oluyor ama farkında değiller.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lossnet",
      "created_time": "July 05, 2022, 08:23:58 PM",
      "body": "Aslında bana ENAG'ın açıkladığı oran da yeteri kadar inandırıcı gelmiyor. Çünkü TÜİK'in ağırlık oranlarını kullanıyorlar mecburen. Mesela atıyorum; ekmeğin ağırlığı 2 puanken, kalem açacağının ağırlığı 3 puan ise orada bir sorun vardır. Bu hesaplamaya dahil edilen ağırlık oranları çok tartışılmıştı zamanında. Bakınız: pinpon topu:)TÜİK ve ENAG arasındaki temel fark bence şu: TÜİK bir ürünün piyasadaki en düşük fiyatını baz alıyor. ENAG ise en az 10 marketin ortalama fiyatını... TÜİK, çalışmasını yapacağı gün bazı marketlerde \"fiyat indirimi / promosyonu\" yaptırtıyor; hatta akaryakıt fiyatlarında genelde o gün ne hikmetse bir indirim oluyor. ENAG ise ay içerisinde rastgele birkaç farklı gün seçiyor ve ortalama alıyor.Sonuç: Bence aylık en az %10'dan, yıllıkta ise %250'den aşağı değildir!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "July 05, 2022, 08:33:16 PM",
      "body": "Quote from: lossnet on July 05, 2022, 08:23:58 PMAslında bana ENAG'ın açıkladığı oran da yeteri kadar inandırıcı gelmiyor. Çünkü TÜİK'in ağırlık oranlarını kullanıyorlar mecburen. Mesela atıyorum; ekmeğin ağırlığı 2 puanken, kalem açacağının ağırlığı 3 puan ise orada bir sorun vardır. Bu hesaplamaya dahil edilen ağırlık oranları çok tartışılmıştı zamanında. Bakınız: pinpon topu:)TÜİK ve ENAG arasındaki temel fark bence şu: TÜİK bir ürünün piyasadaki en düşük fiyatını baz alıyor. ENAG ise en az 10 marketin ortalama fiyatını... TÜİK, çalışmasını yapacağı gün bazı marketlerde \"fiyat indirimi / promosyonu\" yaptırtıyor; hatta akaryakıt fiyatlarında genelde o gün ne hikmetse bir indirim oluyor. ENAG ise ay içerisinde rastgele birkaç farklı gün seçiyor ve ortalama alıyor.Sonuç: Bence aylık en az %10'dan, yıllıkta ise %250'den aşağı değildir!Hocam size kesinlikle katılıyorum. Ben de ENAG'ın sonuçları bulma konusunda sizin gibi düşünüyorum. TÜİK'e göre baktığımızda kötünün iyisi yani daha doğru olması sebebi ile paylaştım. Yoksa tabi ki gazetecilerin tabiri ile hissedilen enflasyon ENAG'ın açıkladığı rakamdan da kat be kat yüksek.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "execijutiere",
      "created_time": "July 05, 2022, 08:58:46 PM",
      "body": "Quote from: lossnet on July 05, 2022, 08:23:58 PMAslında bana ENAG'ın açıkladığı oran da yeteri kadar inandırıcı gelmiyor. Çünkü TÜİK'in ağırlık oranlarını kullanıyorlar mecburen. Mesela atıyorum; ekmeğin ağırlığı 2 puanken, kalem açacağının ağırlığı 3 puan ise orada bir sorun vardır. Bu hesaplamaya dahil edilen ağırlık oranları çok tartışılmıştı zamanında. Bakınız: pinpon topu:)TÜİK ve ENAG arasındaki temel fark bence şu: TÜİK bir ürünün piyasadaki en düşük fiyatını baz alıyor. ENAG ise en az 10 marketin ortalama fiyatını... TÜİK, çalışmasını yapacağı gün bazı marketlerde \"fiyat indirimi / promosyonu\" yaptırtıyor; hatta akaryakıt fiyatlarında genelde o gün ne hikmetse bir indirim oluyor. ENAG ise ay içerisinde rastgele birkaç farklı gün seçiyor ve ortalama alıyor.Sonuç: Bence aylık en az %10'dan, yıllıkta ise %250'den aşağı değildir!Kalem açacağı 3 olurken ekmek nasıl 2 puan. Bu nasıl bir hesaplama Eğer gerçekten öyleyse bu işte bir saçmalık var ozaman dediğiniz gibi enag da eksik hesaplıyor enflasyonu.Tüik işine gelen veriyi alıyordur. İşine gelen veri de en ucuz olduğu yer haliyle. O yüzden bir anlamı yok tüik verilerinin. Araştırma şirketleri daha mantıklı bir değer açıklar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "July 06, 2022, 04:11:12 AM",
      "body": "Zaten yapılan oyunlar bu yüzden enflasyonun düşük gösterilmesi amaçlı yapılıyor, ülkemizde genel sıkıntılar var bunda şeffaflık olmaması, enflasyon sepetinin adil olmaması, insanların ekonomik gücünün her gün düşmesi, Türk lirasının bozuk 5-10 lira ihtiyacının doğması kadar düşmesi genel sebepler, insanlara yapılan zam oranı yüksek görünüyor ama hayat pahalılığı daha yüksek, bir de çıkıp sadece bu durumu biz düzeltebiliriz diyorlar ya gülesim geliyor, sebep olduk demiyorlar da biz düzeltebiliriz diyorlar",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "July 06, 2022, 04:37:27 AM",
      "body": "Her zaman yaptıkları en iyi işten birini yapıyorlar buda gerçek dışı yada sürekli değiştirilen enflasyon sepetine göre ortaya bir enflasyon rakamı çıkarıyorlar daha önce hesaplama kalemlerini de paylaşıyorlardı artık onu dahi paylaşmıyorlar çünkü tutarsızlık diz boyu. Gerçek enflasyonun çok daha yüksek olduğunu çoğunluk biliyor diyeyim çünkü halen bu açıklamalara inanlar var yada inanmak isteyenler var.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "July 06, 2022, 05:31:38 AM",
      "body": "valla bence hepimiz bir otobüsteyiz, otobüsü epeyce bir süredir aynı şoför kullanıyor, ama ne hikmetse her kaza yaptığımızda ya muavin, ya lastikçi, ya motorcu, ya kaportacı, ya mazotçu şoför tarafından hatalı bulunup değiştiriliyor, yani mutlaka son günlerin popüler tabiriyle adaya biri veda edip yerine yeni biri geliyor. ha bu yaşananlar sonucu değiştiriyor mu, elbette ki hayır. biz yine kaza yapmaya devam ediyoruz. Ama işin en acı tarafı ne biliyor musunuz arkadaşlar, otobüste bizimle seyahat eden minimum %30 luk kesim ne olursa olsun şoförü haklı buluyor...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "July 06, 2022, 09:46:42 AM",
      "body": "Quote from: totti67 on July 06, 2022, 05:31:38 AMvalla bence hepimiz bir otobüsteyiz, otobüsü epeyce bir süredir aynı şoför kullanıyor, ama ne hikmetse her kaza yaptığımızda ya muavin, ya lastikçi, ya motorcu, ya kaportacı, ya mazotçu şoför tarafından hatalı bulunup değiştiriliyor, yani mutlaka son günlerin popüler tabiriyle adaya biri veda edip yerine yeni biri geliyor. ha bu yaşananlar sonucu değiştiriyor mu, elbette ki hayır. biz yine kaza yapmaya devam ediyoruz. Ama işin en acı tarafı ne biliyor musunuz arkadaşlar, otobüste bizimle seyahat eden minimum %30 luk kesim ne olursa olsun şoförü haklı buluyor...Üstüne üstelik şoförün ehliyeti olmayabilir mi acaba? Birde otobüste bulunan şu dandik televizyondan da sürekli şoförün ne kadar iyi bir şoför olduğu ve olmasa otobüsün devrileceği ve otobüsün başına neler geleceği pompalanıyor. Hatta diğer otobüslerdeki yolcuların kıskançlığından filan bahsediliyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lossnet",
      "created_time": "July 06, 2022, 03:23:29 PM",
      "body": "Quote from: execijutiere on July 05, 2022, 08:58:46 PMKalem açacağı 3 olurken ekmek nasıl 2 puan. Bu nasıl bir hesaplama Eğer gerçekten öyleyse bu işte bir saçmalık var ozaman dediğiniz gibi enag da eksik hesaplıyor enflasyonu.Tüik işine gelen veriyi alıyordur. İşine gelen veri de en ucuz olduğu yer haliyle. O yüzden bir anlamı yok tüik verilerinin. Araştırma şirketleri daha mantıklı bir değer açıklar.Karman-çorman, evlere şenlik hesaplamalar var valla! Kalem açacağını \"sallıyorum\" diye örnekledim aslında:) ama demek istediğim şuydu: Zorunlu ihtiyaç olan bazı ürünlerin ağırlık değeri bilinçli olarak düşük tutuluyor. Zorunlu olmayıp da fiyatları az değişenlerin ağırlık oranı ise yükseltiliyor. Şimdi aklıma sadece pinpon topu geldi mesela. Araştırınca böyle şeyler çok çıkıyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "July 06, 2022, 03:37:11 PM",
      "body": "sizlerin aksine ben hala nasıl olur da eksi olarak açıklamadıklarına şaşırıyorum. tuik, en son sepette hangi ürünlerini kullandığını açıklamayacağını söylemişti ve inanın ben de bu doğru mu yoksa fikirleri değişti mi yoksa diye hiç bakmadım çünkü ne işimize yarayacak ki?! bugün böyle açıklanan oranlar şayet ilerleyen seçimler sonucu iktidar değişikliği ile değişecek mi? mesela x ayında enflasyon 80 diyelim, x+1 ayında yeni hükümet %200 diyebilecek mi? bence diyemeyecek ve devlet kurumlarına olan güvensizlik uzun bir süre devam edecek gibi. beni en çok üzen konu da bu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "July 07, 2022, 07:35:54 AM",
      "body": "Elbette işlerine gelen ürünleri işlerine gelen oranlarda ekliyorlar, temel tüketim maddelerinde ya da benzeri şeyler ile oluşturulmuş bir listede enflasyonun şu an söylenilenden 3 kat fazla çıkacağını herkes biliyor.Kendilerince kontrol altında ve yavaş yavaş artıyormuş gibi gösteriyorlar. Şu saatten sonra eksi enflasyon çıkartırlarsa herkes tepki verecek biliyorlar, en koyu hükümet yanlıları bile ekonomi hakkında konuşur oldu ve klasik din muhabbetleri olmasa başka partiye oy vereceklerini sile getirmeye başladılar",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "July 07, 2022, 09:41:04 AM",
      "body": "Quote from: xzone on July 07, 2022, 07:35:54 AMElbette işlerine gelen ürünleri işlerine gelen oranlarda ekliyorlar, temel tüketim maddelerinde ya da benzeri şeyler ile oluşturulmuş bir listede enflasyonun şu an söylenilenden 3 kat fazla çıkacağını herkes biliyor.Kendilerince kontrol altında ve yavaş yavaş artıyormuş gibi gösteriyorlar. Şu saatten sonra eksi enflasyon çıkartırlarsa herkes tepki verecek biliyorlar, en koyu hükümet yanlıları bile ekonomi hakkında konuşur oldu ve klasik din muhabbetleri olmasa başka partiye oy vereceklerini sile getirmeye başladılar Ekonomi o kadar kötü bir hale geldi ki kendi kemik kitlesinde bile çatlama bu konulardaki rahatsızlığını dile getirmeye başladı. Zaten geçenler de bir iktidar yöneticisi yaptırdıkları ankette kendi seçmenlerinin ekonomi ve yabancı uyruklu kişiler konusunda iktidara kırgın olduğu sonucu çıktığını açıklamıştı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Red Pie",
      "created_time": "July 13, 2022, 10:26:28 AM",
      "body": "Temmuz ayı enflasyon oranının açıklanması da Ağustos ayında olacak. o zaman görün ki enflasyon yine düşük gösterilecek. enflasyon, bu kadar para basılan bir ortamda nasıl düşecek anlayamıyorum. bankamatikten para çektim bankamatiğin verdiği para gıcır gıcır ve sadece 50 tl oluşan banknotlar. D serisi paralarla devam ediyoruz yolumuza.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "July 13, 2022, 11:26:06 AM",
      "body": "Quote from: Red Pie on July 13, 2022, 10:26:28 AMTemmuz ayı enflasyon oranının açıklanması da Ağustos ayında olacak. o zaman görün ki enflasyon yine düşük gösterilecek. enflasyon, bu kadar para basılan bir ortamda nasıl düşecek anlayamıyorum. bankamatikten para çektim bankamatiğin verdiği para gıcır gıcır ve sadece 50 tl oluşan banknotlar. D serisi paralarla devam ediyoruz yolumuza. yeni basılan paranın anlamı laps diye para basmak değildir hocam. mesela piyasadan toplanan ve haşatı çıkan paralar yerine yenileri sürülür ama bizdeki tabii ki böyle değil:))tüm dünyada enflasyon mevcut. adamlarda %2'den %5'e çıkmış \"vay babayin kemiğine sıçam.\" diyor. lan biz o oranları günlük yaşıyoruz sen ne diyorsun dürrük. temmuzu bayramla geçirdiğimiz için çok fazla fark etmedik ama bayram sonrası güzellikler bizi bekliyor. dolar zaten şahlanmış, rusya-ukrayna savaşı ayrı geçiriyor, avrupa'da kriz derinleşmek üzere ve bunların hiçbiri bizim işimize gelecek türden olaylar değil. bu sene ekonomik anlamda daha da zor geçecek hepimiz için.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "execijutiere",
      "created_time": "July 14, 2022, 08:25:50 PM",
      "body": "Quote from: Red Pie on July 13, 2022, 10:26:28 AMTemmuz ayı enflasyon oranının açıklanması da Ağustos ayında olacak. o zaman görün ki enflasyon yine düşük gösterilecek. enflasyon, bu kadar para basılan bir ortamda nasıl düşecek anlayamıyorum. bankamatikten para çektim bankamatiğin verdiği para gıcır gıcır ve sadece 50 tl oluşan banknotlar. D serisi paralarla devam ediyoruz yolumuza. Düşük gösterilmesi düşük olduğunun kanıtı değildir zaten. Ben istediğim gibi bir sayı sallayabilirim enflasyon adına. Ama bunun kanıtını göstermezsem bu sadece sallamasyon olur yani sadece benim gösterdiğim veya söylediğimle kalır. İşin iyi yanı bu enflasyon verilerine inanmayanların sayısı gün geçtikçe artıyor. Artık dışarı adım attığınızda 50 değil 200 türk lirası çıkmak zorunda cepten.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "judas",
      "created_time": "July 14, 2022, 08:38:56 PM",
      "body": "ENAG'ın açıkladığı oran daha inandırıcı geliyor bana. Yıllık enflasyon oranının her şeyden önce %100'den aşağı olmasına şu koşullarda imkan yok. Geçen sene marketten aldığınız örneğin etin, yumurtanın vs. fiyatı ile şimdi aldığınız fiyatı kıyaslamak bile kısa yoldan bir fikir verecektir. Hayat pahalılığı inanılmaz bir hızla arttı ve böyle giderse yakında en az yüzde 200 gibi yıllık enflasyon oranlarından da bahsetmeye başlayacağız. Enflasyonun önüne geçmek için yapıcı çözümler bulunmadığı sürece yükseliş durmayacak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}