{
  "id": "topic_5474439",
  "title": "Gormicsta",
  "author": "Gormicsta",
  "created_time": "November 17, 2023, 11:18:22 AM",
  "content": "QuoteNEW: Cathie Wood says “something has changed” in SEC’s attitude to a spot #Bitcoin ETF. The chances of approval have “gone up”!https://twitter.com/BTC_Archive/status/1724753354872525077?t=8RLs8J7kvAeXaJ2x88lD1w&s=19Currently, 12 applications for a spot bitcoin ETF are pending before the SEC, and the markets regulator is expected to issue a ruling as soon as November 17.And according to Seyffart if the agency wants to allow all 12 filers to launch, this would literally be the first available window since Grayscale's court victory was affirmed.While the window for accepting all 12 filings ends on Nov. 17, Seyffart also added that the chances of SEC making a decision on nine of the twelve applications would be anytime before Jan. 10.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474439",
  "comments": [
    {
      "author": "Beparanf",
      "created_time": "November 17, 2023, 11:24:42 AM",
      "body": "A different attitude of SEC doesn’t increase the chance of approval although ETF approval is already high chance to be approved since SEC is already out of reason to reject all of them since most of the ETF is already complied to their standards due to the long time of denial from them.But a word of a certain person that is one of the person who’s asking for approval is not a solid proof that chance of approval gone up just because she notice changes. SEC opinion itself is the most important part to determine chance rate of approval.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "November 17, 2023, 12:43:33 PM",
      "body": "Quote from: Gormicsta on November 17, 2023, 11:18:22 AMCurrently, 12 applications for a spot bitcoin ETF are pending before the SEC, and the markets regulator is expected to issue a ruling as soon as November 17.But, November 17 is today, right? It'll be real interesting to see what the SEC decides before the next deadline.   People in crypto land are definitely on the edge of their seats about this!However, I agree with Beparanf. Even though some folks seem to think the SEC is maybe warming up to the idea, that don't automatically mean they're gonna say yes to these things.  The chances do look higher for approval though since the companies probably learned from past rejections and changed their applications to match what the SEC wants.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "November 17, 2023, 12:47:36 PM",
      "body": "Quote from: Beparanf on November 17, 2023, 11:24:42 AMA different attitude of SEC doesn’t increase the chance of approval although ETF approval is already high chance to be approved since SEC is already out of reason to reject all of them since most of the ETF is already complied to their standards due to the long time of denial from them.But a word of a certain person that is one of the person who’s asking for approval is not a solid proof that chance of approval gone up just because she notice changes. SEC opinion itself is the most important part to determine chance rate of approval.Bitcoin is fine without Bitcoin Spot ETFs as it has been very strong so far, many years since 2009 without any Bitcoin Spot ETF. It made its all time high about $69,000 in 2021 without a Bitcoin Spot ETF and price now is lower than $40,000.I feel funny if anyone think Bitcoin Spot ETFs are very important for Bitcoin to break through $40,000 and reclaim $69,000. Next 6 months, we will have a Bitcoin halving and price will surely be higher than $40,000 that is even higher than today price. A halving is enough for Bitcoin to have a higher price, Bitcoin Spot ETF news is only a catalyst to make this market more unpredictable and chaotic for Newbies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gormicsta",
      "created_time": "November 17, 2023, 01:05:53 PM",
      "body": "Quote from: dzungmobile on November 17, 2023, 12:47:36 PMBitcoin is fine without Bitcoin Spot ETFs as it has been very strong so far, many years since 2009 without any Bitcoin Spot ETF. It made its all time high about $69,000 in 2021 without a Bitcoin Spot ETF and price now is lower than $40,000.You're absolutely right by saying Bitcoin has been doing so well without any Bitcoin Spot ETF, Bitcoin has attained unimaginable heights without any Bitcoin Spot ETF, but if a Bitcoin Spot ETF was as unnecessary as you claim then applications wouldn't be filing even after previously being rejected and we wouldn't currently have over 12 application filed on SEC's table right now. Have you ever imagined the future of Bitcoin if the Spot ETF is ever approved? Bitcoin has been doing good without a Spot ETF but with it, I believe it would do even better, coupled with the Bitcoin halving, Bitcoin would exceed it's ATH before we know it, so I strongly believe a Bitcoin Spot ETF approval would be an amazing stepping stone to achieving greater things in the Bitcoin world in the smallest unit of time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "November 17, 2023, 01:24:09 PM",
      "body": "This ETF thing seems overblown. It is true that it will be able to boost the price of Bitcoin if it is accepted in the near future, but it does not make the price of Bitcoin reach its ATH or exceed it. In fact, this ETF has no benefit at all to the Bitcoin ecosystem, because it does not represent Bitcoin, it only benefits brokers. Without this ETF, the Bitcoin market will still develop and adopters will continue to increase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "November 17, 2023, 01:28:20 PM",
      "body": "Well, about all 12ETF approvals, the news was just bluff! How it can be so easy? Anyway, what I think TBH is that most ETFs will get approved on their last deadline around FEB to MAR. There's a slight possibility that maybe SEC will approve an ETF in late JAN.There's no doubt this rally is exciting due to the ETF approvals, the current market sentiments are indicating a prominent domination of the ETF news, and even some fake news made the market momentum suppress the major resistances and use them as a strong support level. These 12 ETF applications started a chain-reaction not only for Bitcoin but even for some of the Altcoins. Currently according to the recent developments I'm hopeful for a good news soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "amishmanish",
      "created_time": "November 17, 2023, 01:40:16 PM",
      "body": "Quote from: Gormicsta on November 17, 2023, 01:05:53 PM Have you ever imagined the future of Bitcoin if the Spot ETF is ever approved? Bitcoin has been doing good without a Spot ETF but with it, I believe it would do even better, coupled with the Bitcoin halving, Bitcoin would exceed it's ATH before we know it, so I strongly believe a Bitcoin Spot ETF approval would be an amazing stepping stone to achieving greater things in the Bitcoin world in the smallest unit of time.What a bitcoin ETF means is that these big funds like Blackrock will actually keep BTC as an underlying backing while allowing investors to buy fractional shares of the instrument. Considering that they have applied for ETF, they must have seen demand from potential investors and would already haev bought as well as put in place the necessary operational methods to give them to consumers.Now whether the ETF turns into actual buying of the same from investors is not something i anticipate to be a lot of pent up demand. I mean whoever that actually understands and wants to invest has done it through CEXs by now. Is there a lot of pent up demand waiting to unlock? Depends on how these funds market it to their customers. One thing for sure is that the ETF itself adds little value except bring in some liquidity and bring a few more people into the fold.Purely on the basis of a value addition, simple listing of the commodity cannot ensure that it will see a huge price movement as many are hoping, nay, praying for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "November 17, 2023, 02:00:25 PMLast edit: November 17, 2023, 04:40:44 PM by Zlantann",
      "body": "Quote from: Gormicsta on November 17, 2023, 11:18:22 AMNEW: Cathie Wood says “something has changed” in SEC’s attitude to a spot #Bitcoin ETF. The chances of approval have “gone up”!Cathie Wood is the CEO of ARK Invest one of the applicants for the ETF. As a businesswoman, she is expectant that the SEC's decision will be favourable. However, her views are irrelevant because she is not part of the decision-making process and would have no effect on the SEC's position. Nevertheless, I don't underrate the position of these powerful business executives because they might have insiders who furnish them with relevant information.    Quote from: Beparanf on November 17, 2023, 11:24:42 AMA different attitude of SEC doesn’t increase the chance of approval although ETF approval is already high chance to be approved since SEC is already out of reason to reject all of them since most of the ETF is already complied to their standards due to the long time of denial from them.The District of Columbia Court of Appeal ruling that the SEC was wrong to reject Grayscale's proposed bitcoin ETF gave us the indication that the regulatory body might have exhausted all the excuses for denying the approval. However, Gary Gensler and his co-conspirators are evil geniuses who can come up with more reasons to delay the approval.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "November 17, 2023, 02:03:18 PM",
      "body": "-  I think that out of those 12 applications, they will actually have something approved there, as expected by most of the community investors here in the crypto space. But of course, this remains speculation until we see something they can actually approve.We still don't know what will really happen in the coming half of next year. And even if they get approved for these applications, they will not be implemented immediately; it will take months before they actually start.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "November 17, 2023, 02:40:57 PM",
      "body": "Quote from: dzungmobile on November 17, 2023, 12:47:36 PMI feel funny if anyone think Bitcoin Spot ETFs are very important for Bitcoin to break through $40,000 and reclaim $69,000. Next 6 months, we will have a Bitcoin halving and price will surely be higher than $40,000 that is even higher than today price. A halving is enough for Bitcoin to have a higher price, Bitcoin Spot ETF news is only a catalyst to make this market more unpredictable and chaotic for Newbies.I believe this will only favour more the big investors that are preparing to enter the market on the approval of the Bitcoin ETF. Small investors and newbies who are accumulating gradually before the upcoming bull run will be saddened to see a massive increase in price following the approval even when halving has not taking place. Many people know the advantage and disadvantage of the Bitcoin ETF. The Pros is that; it will make the price of bitcoin shoot up to an unimaginable price even before the time for a new all time high is anticipated to take place and the Cons; it makes the market more unpredictable and making it for smaller investors not hitting their target before a big rise in price of bitcoin.Quote from: Gormicsta on November 17, 2023, 01:05:53 PMYou're absolutely right by saying Bitcoin has been doing so well without any Bitcoin Spot ETF, Bitcoin has attained unimaginable heights without any Bitcoin Spot ETF, but if a Bitcoin Spot ETF was as unnecessary as you claim then applications wouldn't be filing even after previously being rejected and we wouldn't currently have over 12 application filed on SEC's table right now. Have you ever imagined the future of Bitcoin if the Spot ETF is ever approved? Bitcoin has been doing good without a Spot ETF but with it, I believe it would do even better, coupled with the Bitcoin halving, Bitcoin would exceed it's ATH before we know it, so I strongly believe a Bitcoin Spot ETF approval would be an amazing stepping stone to achieving greater things in the Bitcoin world in the smallest unit of time.Many of the companies or people that are interested in the Bitcoin ETF approval just want to have someone they can rely on with their investment. The market is full of volatility and predictions are always hard to determine. With the approval of this, we will have more people investing in bitcoin through this means but will only do it on the basis that their funds are safe with the companies and will get their own share of it in the long run. Asides this, I don’t see any tangible reason why they really want the Bitcoin ETF to be approved by SEC and this will definitely have substantial effect on the price of bitcoin when approved because of the number of investors that will be coming into the market hearing of this approval. Bitcoin ETF approval will make the market more unpredictable and will make it attain some certain milestones that are not expected to happen soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "November 17, 2023, 03:11:45 PM",
      "body": "Quote from: Gormicsta on November 17, 2023, 11:18:22 AMCurrently, 12 applications for a spot bitcoin ETF are pending before the SEC, and the markets regulator is expected to issue a ruling as soon as November 17.And according to Seyffart if the agency wants to allow all 12 filers to launch, this would literally be the first available window since Grayscale's court victory was affirmed.While the window for accepting all 12 filings ends on Nov. 17, Seyffart also added that the chances of SEC making a decision on nine of the twelve applications would be anytime before Jan. 10.What has changed exactly? or is it just to create suspense among the investors? Well, the result can be seen on January 10, when the first ETF will be approved or rejected, and if that gets approved, then we can see the approval of all other ETFs because there remains no objection for others as other ETFs have the same norms as the first one.Overall, I think ETFs will be approved because the hype created is so high and the price of BTC has already been impacted by it, even with the fake news like the one from Cointelegraph and the ticker manipulation,, etc., which has shown us the true impact that ETFs can have on BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "November 17, 2023, 03:39:52 PM",
      "body": "Quote from: Marvelman on November 17, 2023, 12:43:33 PMQuote from: Gormicsta on November 17, 2023, 11:18:22 AMCurrently, 12 applications for a spot bitcoin ETF are pending before the SEC, and the markets regulator is expected to issue a ruling as soon as November 17.But, November 17 is today, right? It'll be real interesting to see what the SEC decides before the next deadline.   People in crypto land are definitely on the edge of their seats about this!However, I agree with Beparanf. Even though some folks seem to think the SEC is maybe warming up to the idea, that don't automatically mean they're gonna say yes to these things.  The chances do look higher for approval though since the companies probably learned from past rejections and changed their applications to match what the SEC wants. I think SEC approval of an ETF is almost inevitable, but the question is when they will approve it and make a final announcement. Today is November 17 and everyone is waiting for the verdict from the SEC, and if you look at the market right now, you will see that the market is also a bit negative. I believe that if they continue to delay, we should not be surprised . I also read yesterday that the SEC postponed a decision on Hashdex's Bitcoin ETF proposal. So I don't have much hope if they continue to delay the remaining proposals today and tomorrow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Winterfrost",
      "created_time": "November 17, 2023, 04:03:32 PM",
      "body": "OP, just because people are saying that there are high odds of approving the Bitcoin ETF application means it would be approved. Dont forget its been a quite a long time since the application and yet no news. I dont know if Bitcoin really cares about the ETF. Since research shows that approval of the Bitcoin ETF would welcome about $16 billion of cash inflows in the first year of approval. So we should be more focused  on looking at our portfolio if it is enough to give us a good result during the bull run. It's also important to have some extra cash set aside, so you don't have to sell your investments in case of an unexpected event, like if you need to cover insurance deductibles after an accident. Even if you're determined to hold onto your investments during market downturns, unforeseen circumstances in life can still happen. These are the things we should be prepared for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Latviand",
      "created_time": "November 17, 2023, 04:13:12 PM",
      "body": "Quote from: Winterfrost on November 17, 2023, 04:03:32 PMOP, just because people are saying that there are high odds of approving the Bitcoin ETF application means it would be approved. Dont forget its been a quite a long time since the application and yet no news. I dont know if Bitcoin really cares about the ETF. Since research shows that approval of the Bitcoin ETF would welcome about $16 billion of cash inflows in the first year of approval. So we should be more focused  on looking at our portfolio if it is enough to give us a good result during the bull run. It's also important to have some extra cash set aside, so you don't have to sell your investments in case of an unexpected event, like if you need to cover insurance deductibles after an accident. Even if you're determined to hold onto your investments during market downturns, unforeseen circumstances in life can still happen. These are the things we should be prepared for.Just let these people enjoy the stuff that they're excited about, these people that are following the hype are a helpful addition to the chances of bitcoin going up even further. Sure ETF isn't the lynchpin to the next bullrun as many people thought it to be but that's beside the point, the possibility of money flowing into the market when it gets approved is still a big help into making bitcoin a powerhouse again in the investment circles, making it more valuable than any other stocks out there. Regarding the setting money aside, I think that it's the other way around, you should set aside money for your investment in bitcoin, you should learn your priorities so you won't be confused and having your priorities in order will help you with things not coming back to bite you in the ass, always prioritize the real world before investments, if you're not the son of a billionaire then that what I have said about priorities should be your thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shishir99",
      "created_time": "November 17, 2023, 04:15:48 PM",
      "body": "Do you guys still rely on those random tweets? There was a time when I started buying shit coins seeing tweets like This coin will give you 20x in the next few weeks or months, that coin is next bitcoin, etc. But the reality is, this thing never happened and I was the victim of that scam. Now I understand that all those tweets were shilling. Anyways, even though this is not any kind of marketing, but such a move from the SEC doesn't really increase the approval chance of ETF. At least that's what I think. Do not rely on these tweets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "November 17, 2023, 05:14:59 PM",
      "body": "I'm wondering why the ETF approval always come around after a massive dump and when we are waiting for the next bull market, years ago ETF was supposed to be approved too but it doesn't, I am not saying it won't this time but the chances are very slim with the way they are behaving right now, all I can do is wait and see. This could be another manipulation to massively dump the market, but I am sure that Bitcoin will be fine without the ETF approval, the dump after the ETF fail depends on how people react to it, but if there is another dump due to ETF disapproval make sure you take the advantage and buy some more Bitcoin. Only those who don't have some spare cash will feel bad when Bitcoin pulls back, always make sure you have some money just in case something we don't expect happens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "November 17, 2023, 05:41:31 PM",
      "body": "12 approved ETFs will probably turn BTC into 50K in a day. the time Blackrock ishares was listed, a big green candle went up in the 1-hour chart. for 12 ETFs, we'll be seeing a green weekly chart candle go straight up to 50k. but what did she mean something has changed? nothings new so that has happened. Biden calls Xi a dictator after having a productive APEC meeting. nothing has changed i think.  but i'm used to not getting my hopes up too much anymore when it comes to SEC. remember that they also said that approval could happen next year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "November 17, 2023, 06:03:24 PM",
      "body": "I agree with others, just because they have a different approach or different understanding, doesn't mean that it has gone up, it just means that it is \"different\", this could be lower, higher or even similar and doesn't mean anything has changed. I do agree that it is not going to be easy to get it approved, it is not going to be impossible neither.What I believe is that one day we will have a Bitcoin ETF for sure, it is not going to be like forever banned thing, we will see one before we get to old age, but I also believe that it is to going to be too easy, we are going to end up seeing companies work super hard for it. I hope that people could do something about making it accepted faster so that we could see it quicker but unfortunately it may take some more time. Meanwhile, price of bitcoin has gone up significantly, from under 20k to over 35k, without ETF, which proves that we are talking about this but it is useless, we can go up without that too for sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "November 17, 2023, 06:40:32 PM",
      "body": "Not sure what attitude of SEC you are referring to. But I firmly believe that attitude of individuals do not really matter when it comes to approval of spot ETF. I completely understand that there is a huge amount of expectation building up. So anyone can comment anything to bring personal visibility rather than adding any value to this entire matter. So stop expecting much or else the fallback will bring pain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}