{
  "id": "topic_5468177",
  "title": "libert19",
  "author": "libert19",
  "created_time": "September 26, 2023, 02:29:24 PM",
  "content": "Github, Cosmos, Osmosis and Ethereum users are eligible, check your eligibility and claim here: https://genesis.celestia.org",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468177",
  "comments": [
    {
      "author": "AnonBitCoiner",
      "created_time": "September 26, 2023, 07:30:05 PM",
      "body": "I heard first time about this project. Unfinished my address is not eligible for airdrop. I check manually by putting address. Eligibility criteria is not easy, not everyone and only pro users will be eligible for airdrop. The easiest one is to interect with Github but who know that only interection will be criteria for airdrop. Ethereum users had to make points and minimum fund needed was 50$. I have joined many airdrop and tried to met criteria but this one I totally missed. What do you think how much token will users recieved and price of the token?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "September 26, 2023, 10:32:02 PM",
      "body": "Quote from: AnonBitCoiner on September 26, 2023, 07:30:05 PMI heard first time about this project. Unfinished my address is not eligible for airdrop. I check manually by putting address. Eligibility criteria is not easy, not everyone and only pro users will be eligible for airdrop. The easiest one is to interect with Github but who know that only interection will be criteria for airdrop. Ethereum users had to make points and minimum fund needed was 50$. I have joined many airdrop and tried to met criteria but this one I totally missed. What do you think how much token will users recieved and price of the token? As I understand it, this airdrop was also distributed to those wallets that previously received airdrop from Arbitrum. And I have no illusions that this airdrop will somehow improve my financial situation, and it is unlikely that it will be more than $50. However, everyone who is eligible to receive this airdrop must receive it by October 17, 2023.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "September 26, 2023, 11:05:01 PM",
      "body": "I was going to try my GitHub account but then...Apart from GitHub, the airdrop seems to favor whales who have staked large amounts of tokens and those with very high activity in their addresses across the 3 different chains.Good luck to the successful ones",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Joeyp",
      "created_time": "September 27, 2023, 12:16:52 AM",
      "body": "Currently there are 1300+ various altcoins. New airdrops need serious financing. Without it new altcoins will loose the value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "makishart",
      "created_time": "September 27, 2023, 03:36:05 AM",
      "body": "The people who participated in the incentive nodes received generous reward from the developers. Due to my address only being considered among the top 10% activity scores, I am only eligible for 90.74 tia. I don't put so much hope with this reward as im sure it will worth nothing for sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "September 27, 2023, 04:06:10 AM",
      "body": "Quote from: AnonBitCoiner on September 26, 2023, 07:30:05 PMThe easiest one is to interect with Github but who know that only interection will be criteria for airdrop. If you were developer and active in web3 projects, making commits and doing github things, only then you are eligible, it's not as simple to have account on GH. Quote from: tvplus006 on September 26, 2023, 10:32:02 PMAs I understand it, this airdrop was also distributed to those wallets that previously received airdrop from Arbitrum. I got Arb airdrop yet wasn't eligible for this one. Quote from: Bitcoin_Arena on September 26, 2023, 11:05:01 PMApart from GitHub, the airdrop seems to favor whales who have staked large amounts of tokens and those with very high activity in their addresses across the 3 different chains.Not really whales, you only needed $75 worth tokens staked on Osmosis and Cosmos Hub, while for Ethereum it appears you needed $50 on your ethereum wallet otherwise no matter how much your activity was you were discarded. I don't think it's whale centric.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yanghelong",
      "created_time": "September 27, 2023, 04:53:49 AM",
      "body": "我的GITHUB账户没有资格",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "September 27, 2023, 12:47:08 PM",
      "body": "Quote from: libert19 on September 26, 2023, 02:29:24 PMGithub, Cosmos, Osmosis and Ethereum users are eligible, check your eligibility and claim here: https://genesis.celestia.orgI checked all of the wallets I have created before the January 1 2023 snapshot in which they all have decent Ethereum transactions. But the bad news is that none of them are eligible, so I do not get anything here. But on a positive note it’s one reason why we should keep doing retroactive drops as early adopters. This is where early adopters are rewarded with an unexpected airdrop announcement from Celestia. Oh well, I guess we just have to wait for the next big unexpected one though. Congrats to those who are eligible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tokeweed",
      "created_time": "September 27, 2023, 01:01:55 PM",
      "body": "Quote from: AnonBitCoiner on September 26, 2023, 07:30:05 PMI heard first time about this project. Unfinished my address is not eligible for airdrop. I check manually by putting address. Eligibility criteria is not easy, not everyone and only pro users will be eligible for airdrop. The easiest one is to interect with Github but who know that only interection will be criteria for airdrop. Ethereum users had to make points and minimum fund needed was 50$. I have joined many airdrop and tried to met criteria but this one I totally missed. What do you think how much token will users recieved and price of the token? It's gonna be so funny when botters start making pull requests from projects that haven't launched yet, thinking that they'll get a better chance to be eligible for future airdrops, which they might.  And it looks like other projects will follow this trend too?  What do you guys think..?  I guess it could help with spelling errors in the docs or in the comments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AnonBitCoiner",
      "created_time": "September 27, 2023, 02:40:44 PM",
      "body": "Quote from: tvplus006 on September 26, 2023, 10:32:02 PMAs I understand it, this airdrop was also distributed to those wallets that previously received airdrop from Arbitrum. And I have no illusions that this airdrop will somehow improve my financial situation, and it is unlikely that it will be more than $50. However, everyone who is eligible to receive this airdrop must receive it by October 17, 2023.I recieved airdrop from Arbitrum wallet but unfortunately not eligible gort this airdrop. This airdrop is mainly for Atom(cosmos) stakers and active Github users. Everyone who staked at least 70$ Atom tokens are eligible for airdrop. I have not staked any atom token and also my activity in Github is zero, this is the reason I am not eligible for this airdrop.Quote from: tokeweed on September 27, 2023, 01:01:55 PMIt's gonna be so funny when botters start making pull requests from projects that haven't launched yet, thinking that they'll get a better chance to be eligible for future airdrops, which they might.  I will not blame you because your message show that you have never received any speculation airdrop. I will recommend to read some articles how much people got free airdrop just by the method you are making fun. I got more than 3k$ airdrop in 2 years and I think this is enough for me and If i use 500$ again in other networks it is not bad deal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "September 27, 2023, 08:31:58 PM",
      "body": "If people complain a lot because of this airdrop (not-eligible) again, we are gonna f*ckup.I still remember the (SAI) tragedy, they make a trend hashtag #SAISCAM on twitter, damaging the company name just because the airdrop. In the future, we not gonna can get airdrop like these.Just check all of my account, not eligble all ~XD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "September 28, 2023, 02:39:36 AM",
      "body": "Quote from: ryzaadit on September 27, 2023, 08:31:58 PMI still remember the (SAI) tragedy, they make a trend hashtag #SAISCAM on twitter, damaging the company name just because the airdrop. In the future, we not gonna can get airdrop like these.Correction, it was SEI.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "September 28, 2023, 03:43:04 AM",
      "body": "Hello guys any airdrop receiver of this celestia? Ive got a problem and not sure if Im gonna recovered it or does anyone experience the same.I am able to see my eligibility for this drop with my ethereum roll up address. When I clicked claimed and connected my metamask, it prompt to create an address of celestia testnet, however upon clicking the terms and services, I click the generate address with the address display on the tab accidentally. So then I realized that I didnt create a celestia wallet, now given the process which I already submitted, is there a possible way to change it? Or did I just donate free airdrop tokens to a random address?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "@sriyan",
      "created_time": "September 28, 2023, 09:11:17 AM",
      "body": "Quote from: libert19 on September 26, 2023, 02:29:24 PMGithub, Cosmos, Osmosis and Ethereum users are eligible, check your eligibility and claim here: https://genesis.celestia.orgAlso they are given airdrop to EVM wallet users. This is similar to the sei cross chain airdrop. But the main thing is most of validators not available for the testnet airdrop. May be they need to decentralize the celestia ecosystem by distributing the tokens big user base.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "September 28, 2023, 10:52:03 AM",
      "body": "Quote from: cryptoaddictchie on September 28, 2023, 03:43:04 AMI am able to see my eligibility for this drop with my ethereum roll up address. When I clicked claimed and connected my metamask, it prompt to create an address of celestia testnet, however upon clicking the terms and services, I click the generate address with the address display on the tab accidentally. So then I realized that I didnt create a celestia wallet, now given the process which I already submitted, is there a possible way to change it? Or did I just donate free airdrop tokens to a random address? Mind watching this video and give timestamp where exactly did you make mistake? [1]Did you have Keplr/Leap wallet already installed when you were claiming the drop? You can try claiming again and it will show you address where your airdrop will go to, then compare that address with your Celestia address in Keplr/Leap.[1] https://youtu.be/1C7NysYOi9U?Quote from: @sriyan on September 28, 2023, 09:11:17 AMQuote from: libert19 on September 26, 2023, 02:29:24 PMGithub, Cosmos, Osmosis and Ethereum users are eligible, check your eligibility and claim here: https://genesis.celestia.orgAlso they are given airdrop to EVM wallet users. This is similar to the sei cross chain airdrop. But the main thing is most of validators not available for the testnet airdrop. May be they need to decentralize the celestia ecosystem by distributing the tokens big user base.Yea, EVM is probably the right word than Ethereum. Anyway, SEI must have used stupid criteria to determine eligibility, cause here I get $TIA for osmosis staking, sei didn't, mind you I have been staking Osmo for more than a year. There were people on reddit who staked/LP'ed and validating the chain yet they didn't qualify. Lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dbshck",
      "created_time": "September 28, 2023, 12:30:47 PM",
      "body": "Quote from: libert19 on September 26, 2023, 02:29:24 PMGithub, Cosmos, Osmosis and Ethereum users are eligible, check your eligibility and claim here: https://genesis.celestia.orgGot just under 100 $TIA for my EVM wallet. Yay!Quote from: AnonBitCoiner on September 26, 2023, 07:30:05 PMWhat do you think how much token will users recieved and price of the token? Considering the 1B max supply I don't think it'll be worth much. $1 per $TIA at best, most likely below that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "September 28, 2023, 12:41:29 PM",
      "body": "Quote from: libert19 on September 28, 2023, 10:52:03 AMDid you have Keplr/Leap wallet already installed when you were claiming the drop? You can try claiming again and it will show you address where your airdrop will go to, then compare that address with your Celestia address in Keplr/Leap.The problem here is I didnt create wallet, so when clicking the import address, which has a displayed one on the bar thats the one got saved. So Im finding ways how to revert that or at least change it. There is no supported testnet of celestia on keplr maybe on leap wallet only. Hays I think ive sent the tokens to the address not even generated or created. This is a bad move Id try to ask on their discord.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tokeweed",
      "created_time": "September 28, 2023, 12:43:04 PM",
      "body": "Quote from: AnonBitCoiner on September 27, 2023, 02:40:44 PMQuote from: tokeweed on September 27, 2023, 01:01:55 PMIt's gonna be so funny when botters start making pull requests from projects that haven't launched yet, thinking that they'll get a better chance to be eligible for future airdrops, which they might.  I will not blame you because your message show that you have never received any speculation airdrop. I will recommend to read some articles how much people got free airdrop just by the method you are making fun. I got more than 3k$ airdrop in 2 years and I think this is enough for me and If i use 500$ again in other networks it is not bad deal. Yeah cos I'm not an airdrop farmer bud.  I just got interested in airdrops because I got one from Arbitrum for 5k from guess what..?  Organic usage, not from botting and cheating these things from 1000 different accounts.And all I'm saying is all these sybil guys and botters will start to find more value in making pull requests from unreleased projects instead of onchain activity to do the most mundane things just to get something going.  Didn't mean anything bad by it.  It's just the way it is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "September 28, 2023, 12:47:28 PM",
      "body": "Quote from: dbshck on September 28, 2023, 12:30:47 PMQuote from: libert19 on September 26, 2023, 02:29:24 PMGithub, Cosmos, Osmosis and Ethereum users are eligible, check your eligibility and claim here: https://genesis.celestia.orgGot just under 100 $TIA for my EVM wallet. Yay! Appears everyone gets 50-100 TIA for each eligible chain (not sure about github one), but above it's mentioned validators were rewarded handsomely. I also don't expect it to be worth much since it has huge supply but who knows? I had 30 or smth ethlend tokens back in the day, sold them for peanuts, then it got rebranded to aave and reached ~600 USD, that'd be 20k at ATH. That taught me to hold, if selling isn't worth it. Quote from: cryptoaddictchie on September 28, 2023, 12:41:29 PMQuote from: libert19 on September 28, 2023, 10:52:03 AMDid you have Keplr/Leap wallet already installed when you were claiming the drop? You can try claiming again and it will show you address where your airdrop will go to, then compare that address with your Celestia address in Keplr/Leap.The problem here is I didnt create wallet, so when clicking the import address, which has a displayed one on the bar thats the one got saved. So Im finding ways how to revert that or at least change it. There is no supported testnet of celestia on keplr maybe on leap wallet only. Hays I think ive sent the tokens to the address not even generated or created. This is a bad move Id try to ask on their discord. Celestia is on Keplr, I myself claimed it on Keplr. Quote from: tokeweed on September 28, 2023, 12:43:04 PM-cutQuote from: AnonBitCoiner on September 27, 2023, 02:40:44 PMQuote from: tokeweed on September 27, 2023, 01:01:55 PM-cut-cutYeah cos I'm not an airdrop farmer bud.  I just got interested in airdrops because I got one from Arbitrum for 5k from guess what..?  Organic usage, not from botting and cheating these things from 1000 different accounts.I got few airdrops organically as well, that enticed me to farm drops but I felt burned out so I'm back to being genuine",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}