{
  "id": "topic_5403777",
  "title": "Hispo",
  "author": "Hispo",
  "created_time": "June 23, 2022, 12:40:40 PM",
  "content": "Esta mañana mientras tomaba mi desayuno y leía las noticias, me llega el siguiente correo a mi bandeja de entrada:En efecto este correo describía como Uphold (el popular exchange y billetera custodia de activos digitales) cerraría sus operaciones en mi país debido a supuestas sanciones por parte del gobierno de los Estados Unidos, al principio tomé la noticia como un posible esfuerzo de fishing, pero me pareció extraño que llegase si quiera a mi bandeja en lugar a la papelera de Spam. Un rápido vistazo a Twitter corroboró la información y ya hay noticias al respecto:Uphold se va de Venezuela y pide a usuarios que retiren sus criptomonedasFuente: Criptonoticias________________________________________Esta noticia es especialmente relevante, debido a la popularidad de este servicio en este país y como se le dió acogida, como Uphold reconoce en el correo que envió a sus clientes Venezolanos:QuoteVenezuela was one of the first countries to embrace Uphold and we love serving our customers there. We are taking this step very reluctantly.We hope to return to the market as soon as U.S. policy changes allow.Our top priority now is to help every Venezuelan customer to withdraw their money quickly in compliance with U.S. law.Debido a que no dudo que varios co-nacionales hacen uso de Uphold como billetera personal y de ahorros de divisas, no me sorprendería ver el precio del dolar Uphold caer el relacion al Bolivar.  Solo esperemos que nadie pierda sus ahorros por no saber como lidiar con esta situación.Nunca le tuve mucho cariño a Uphold, en especial luego de aprender sobre auto-custodia, pero aún así espero que las redes sociales no se llenen de mensajes de personas con sus fondos acorralados de una u otra forma mientras se aproxima la fecha final antes del cierre de las cuentas.#Notyourkeys",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403777",
  "comments": [
    {
      "author": "seoincorporation",
      "created_time": "June 23, 2022, 01:26:54 PM",
      "body": "De la fuente que compartiste podemos ver que esto se debe a presiones por parte de los Estados Unidos:Code:esperan volver tan pronto como lo permitan los cambios en la política de Estados Unidos. Sin duda alguna esto es parte del paquete de sanciones gringas, y es una lástima que una potencia como Estados Unidos haga lo que quiera sintiéndose el dueño del mundo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "June 23, 2022, 01:41:09 PM",
      "body": "Veo en el artículo de Criptonoticias que el Exchange da una serie de plazos para efectuar el retiro de los fondos, siendo la primera fecha límite la del 31/7/2022, momento a partir del cual no podrán realizar operaciones de intercambio, habiendo restricción total a partir del 30/09/2022. Cita alguna posibilidad de retiro posterior a través del servicio de atención al cliente, pero fíate.En sus faqs citan algo relevante, que ha sido actualizado hace escasas horas:QuoteComo institución financiera de los Estados Unidos, Uphold tiene que cumplir con los programas de sanciones de los Estados Unidos administrados por la Oficina de Control de Activos Extranjeros (OFAC) de los Estados Unidos, incluidos aquellos contra el Gobierno de Venezuela, las entidades estatales y sus empleados.Sin un cambio en la ley aplicable o un permiso específico de la OFAC, estas regulaciones pueden prohibirnos liberar fondos a un pequeño número de nuestros clientes Venezolanos.En el improbable caso de que no pueda retirar sus fondos debido a estas reglas, nos pondremos en contacto con usted de inmediato para informarle. Tenga en cuenta que la OFAC puede otorgar permiso para que se liberen fondos incluso si es un empleado del Estado Venezolano. Puedes aprender más aquí.Si no podemos liberar sus fondos de inmediato, mantendremos sus activos según lo exijan las reglamentaciones aplicables hasta que se permita la liberación.Vamos, que algunos además parece que van a ver sus fondos bloqueados, algo que sabemos puede pasar en cualquier entidad que custodia nuestras criptomonedas, pero habiendo un factor de indeterminación acerca de a quién le puede tocar, y más aún en un contexto como el de sanciones al país.Ver: https://support.uphold.com/hc/es/articles/6782367756571-I-am-unable-to-withdraw-funds-What-can-I-do-",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Artemis3",
      "created_time": "June 23, 2022, 06:57:06 PM",
      "body": "Si no son tus llaves...No es tu dinero.Al mismo tiempo Sunacrip desautoriza cualquier servicio que no esté registrado y autorizado por ellos.Las \"sanciones\" solo afectan a una lista de funcionarios y gente de alguna forma ligada con estos, son como las de Rusia. Pero Uphold tendría que mantener una \"lista negra\" y congelar cualquier cosa relacionada con esas direcciones, exactamente como pasa en Europa.Las sanciones no son contra todos los Venezolanos ni contra todos los Rusos, son contra individualidades particulares. En mi opinión no sirven para nada, esta gente puede evadirlas de todos modos, pero las usan como excusa para justificar todo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darxiaomi",
      "created_time": "June 23, 2022, 08:37:29 PM",
      "body": "Que cosa de mierda siempre tener que andar mirando de reojo que plataforma o que cosas usas porque no sabes si el dia de mañana se van o hay servicios que no llegan a tu pais.Si bien aca en Argentina la situacion no es tan grave como en Venezuela , recuerdo en su momento hace muchos años en la era dorada de las billeteras virtuales estilo Neteller, Skrill , Paypal , Payoneer y demas siempre habia algo o que no andaba, ya sea cargar saldo de alguna forma en particular, o no llegaba la tarjeta fisica, o de un año a otro dejaban de operar.Para colmo siempre te tenias que crear una cuenta para llegar a ver si funcionaba o no. Y esto forma parte de lo mismo sea por la cuestion que sea. 0 estabilidad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "June 24, 2022, 05:33:27 PM",
      "body": "Quote from: seoincorporation on June 23, 2022, 01:26:54 PMDe la fuente que compartiste podemos ver que esto se debe a presiones por parte de los Estados Unidos:Code:esperan volver tan pronto como lo permitan los cambios en la política de Estados Unidos. Sin duda alguna esto es parte del paquete de sanciones gringas, y es una lástima que una potencia como Estados Unidos haga lo que quiera sintiéndose el dueño del mundo. Sería bueno tener un comunicado con más detalle para saber si se trató de presiones por parte del departamento del tesoro o de algún político o grupos de políticos de alguna de las cámaras de los Estados Unidos.Viendo algunos Twits de hace algunos días, parece que antes de tomarse esta desición de irse del país ya habían restringido la creación de cuentas para clientes Venezolanos.Quote from: DdmrDdmr on June 23, 2022, 01:41:09 PM-snip-Se me pasó ese pequeño detalle. Pequeño pero relevante, singifica que si figuras como empleado de importancia o colaborador del gobierno bien podrías tener sus fondos bloqueados hasta el infinito y más allá. Y puedo asegurarte (porque he visto algunos casos), de que no hace falta haber cometido un crimen nacional o internacional, basta con tener un cargo alto en una empresa pública para que ya empiecen a afectarte algunas de esas medidas.Quote from: Artemis3 on June 23, 2022, 06:57:06 PMLas \"sanciones\" solo afectan a una lista de funcionarios y gente de alguna forma ligada con estos, son como las de Rusia. Pero Uphold tendría que mantener una \"lista negra\" y congelar cualquier cosa relacionada con esas direcciones, exactamente como pasa en Europa.Quizá esté pasando algo más grave a fondo para que tomen una medida así de desproporcionada, ¿puede que hubiese un mercado de compra/venta de cuentas verificadas? He visto algunos twits haciendo referencia a algo así, pero solo es especulación.Quote from: darxiaomi on June 23, 2022, 08:37:29 PMQue cosa de mierda siempre tener que andar mirando de reojo que plataforma o que cosas usas porque no sabes si el dia de mañana se van o hay servicios que no llegan a tu pais.Si bien aca en Argentina la situacion no es tan grave como en Venezuela , recuerdo en su momento hace muchos años en la era dorada de las billeteras virtuales estilo Neteller, Skrill , Paypal , Payoneer y demas siempre habia algo o que no andaba, ya sea cargar saldo de alguna forma en particular, o no llegaba la tarjeta fisica, o de un año a otro dejaban de operar.Para colmo siempre te tenias que crear una cuenta para llegar a ver si funcionaba o no. Y esto forma parte de lo mismo sea por la cuestion que sea. 0 estabilidad.A estas alturas supongo que lo más estable que se puede conseguir son las palabras clave en una placa de metal y listo.Se tendrán las criptos mientras la blockchain continue funcionando, a dormir tranquilo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Artemis3",
      "created_time": "June 28, 2022, 01:47:50 PM",
      "body": "Es mas sencillo: Si no está autorizado por Sunacrip, no puede operar. Pero Sunacrip no va autorizar a nadie que siga las reglas de la OFAC... Para ellos lavarse las manos y no quedar mal ante el gobierno Venezolano, tal vez pensando a futuro, emiten ese comunicado. Por supuesto el problema son ambos Estados, los individuos pagan los platos rotos. Por eso se inventó Bitcoin y por eso debemos dejar de cambiarlo y simplemente usarlo para pagar y recibir pagos sin intermediación de nadie.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MbyzIco",
      "created_time": "July 16, 2022, 03:03:34 PM",
      "body": "Este caso, no es aislado, esta pasando, y seguira pasando con muchas cosas en venezuela, producto de las sanciones, pero para entenderlo, debemos ir a la raiz del problema.partimos de un estado, que esta proporcionando desde pasaportes hasta apoyos economicos a irregulares del mercado mundial, para no entrar en mucho detalle ni herir suceptibilidades.ante esto, el sistema financiero, no otro, no el gobierno, no el congreso, el sistema financiero, busca protegerse de la incursion de estas personas y mas aun de dineros provenientes de este tipo de actividades, por tratar de mantener la legitimidad, de alli, nacen las sanciones, a personas en un principio, pero abarca cualquier relacion comercial entre anonimos, o estados. porque? porque los dineros mal habidos, cual virus van infectando toda la red de uso del mismo, porque se entiende que no son de proveniencia licita. recuerden que hablamos de un pais que atualmente esta dolarizado hasta los niveles mas bajos, como una panaderia de barrio, pero no tiene apoyo de la reserva federal, alguien se ha preguntado de donde viene ese dinero, pues, el sistema financiero si, y no se engaña diciendo que son ahorros que la gente saca de debajo de la almohada.en este punto es donde entra Uphold, donde se ve en una disyuntiva, perder su acceso a la banca o perder clientes en el mercado Venezolano.Si mantiene la relacion de anonimato con sus clientes en venezuela, pierde las cuentas, o las hace publicas y conserva las cuentas, pero mejor aun, mantiene el anonimato, libera a los clientes y mantiene las cuentas. esta fue su desicion.proteger a sus clientes, conservar su acceso al sistema financiero y dejar la puerta abierta para que en un futuro, si la economia de Venezuela se cristaliza, volver con la confianza de sus clientes.Nota: las referencias dadas aqui, no las colocopara entrar en una discusion de quien es el bueno o el malo, o quien tiene la razon o no, es para mera referencia didactica de lo sucedido.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "July 17, 2022, 10:25:38 PM",
      "body": "Al fin y al cabo Uphold, como empresa, es una cabeza a la que apuntar, y se ve atada de pies y manos para tener que cumplir la ley. Llevo usando Brave browser hace tiempo y tengo algún BAT acumulado, pero oara retirarlos tengo que pasar el KUC de Uphold... y para la cantidad que es no me compensa. Bien podían haber usado una solución no custodial, o alguna estructura DeFi, pero no, para algunas cosas muy innovadores pero cuando hay pasta en juego conservadores a más no poder.Ojalá finalmente ningún venezolano pierda sus depósitos, y el susto les sirva para buscar mejores alternativas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "July 18, 2022, 02:52:57 PM",
      "body": "Quote from: Porfirii on July 17, 2022, 10:25:38 PMOjalá finalmente ningún venezolano pierda sus depósitos, y el susto les sirva para buscar mejores alternativas.Conociendo los motivos para el cierre de sus actividades en este país se da a raíz de las sanciones en contra de individuos y empresas no me sorprendería en absoluto que se terminen congelando fondos de algunas personas que estén bajo sospecha de operar para personas de interés para los Estados Unidos y que está radicadas aquí en territorio Venezolano.He hecho un sondeo rápido en Twitter para ver si existe algún problema generalizado con los retiros de fondos y no he conseguido nada digno de resaltar por ahora, lo que me da a entender que las personas de a pie están pudiendo sacar sus criptomonedas de forma normal, veremos como se desarrollan los hechos luego del periodo de gracia que culmina el 31 de este mes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "July 19, 2022, 06:09:42 PM",
      "body": "Me tomaré la libertad de dumpear este hilo con una noticia acerca de Venezuela que he visto circulando en criptonoticias:Venezuela es el 3º país con más porcentaje de usuarios de bitcoin, informa la ONUFuente: https://www.criptonoticias.com/comunidad/adopcion/venezuela-3o-tercer-pais-mas-porcentaje-usuarios-bitcoin-informa-onu/QuoteEn términos porcentuales, Venezuela es el tercer país del mundo con mayor adopción de bitcoin (BTC) y criptomonedas. Así lo informó días atrás la Organización de las Naciones Unidas (ONU) a través de su Conferencia sobre Comercio y Desarrollo, en base a estadísticas de 2021.De acuerdo con los datos del organismo internacional, 1 de cada 10 venezolanos (o el 10,3%) posee criptomonedas. Con una población cercana a los 29 millones de habitantes, el país sudamericano tendría entonces casi 3 millones de personas que adquirieron algún activo digital.QuoteLos dos primeros puestos del ranking los ocupan Ucrania (12,7%) y Rusia (11,9%). Luego de Venezuela se hallan Singapur (9,4%), Kenya (8,5%) y los Estados Unidos (8,3%).Además de Venezuela, los otros países de habla hispana que está dentro del «top 20» son Colombia (puesto 10, con 6,1%) y Perú (puesto 18, con 3,7%).¿Qué opinan? ¿Creen que estos datos estadísticos tendrían sentido con el contexto historico que estamos viendo (o que vimos en el 2021) recientemente?¿O quizá existe algo de sesgo en los datos?Personalmente, creo que 1:10 de Venezolanos con uso de Bitcoin y criptomonedas en general estaría acorde con la aparente popularidad de Binance para comprar establecoins, como método de refugio de valor en el par VES/USD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "July 19, 2022, 08:27:46 PM",
      "body": "Quote from: Hispo on July 19, 2022, 06:09:42 PM<…>Según veo, los datos parten de este informe, pero este informe a su vez obtiene los datos a partir de los datos recogidos en la web de triple A. Los datos de Triple A (ver desglose de datos por país en su web) no cuadran del todo con el informe, por lo que entiendo que se han refrescado desde entonces.En la web de Tripple A figura, al final de la misma el apartado de metodología. Tras leerlo varias veces, lo encuentro confuso, y no me queda nada claro la bondad de la misma, mezclando múltiples fuentes y estimaciones extrapoladas. En su favor, a España le otorgan un 2,73% de la población con criptomonedas, sustancialmente más bajo que otras estimaciones que hemos visto de dos dígitos por aquí, y más alineado con mi intuición. No obstante, como he indicado, no me queda claro cómo se han calculado los datos realmente para poder opinar con más criterio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "February 26, 2023, 11:32:07 AM",
      "body": "Otro que se va de Venezuela, o más bien deja de prestar servicio a sus residentes, es la plataforma de pagos Wallbit Pay (fiat y criptomonedas), la cual, al compás de las sanciones de EEUU a Venezuela, ha sido presionada para cerrar las cuentas de los usuarios residentes en el país. No se han especificado plazos, pero se insta a sus clientes residentes en Venezuela a retirar sus fondos.No sé si alguien de Venezuela puede calibrar el peso operativo en el país de la plataforma de pagos, a fin de hacernos una idea de la relevancia que pueda tener en términos de alcance.Ver: https://twitter.com/WallbitPay/status/1629168831196286980https://www.criptonoticias.com/comunidad/usuarios-wallbit-pay-venezuela-acceso-plataforma/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darxiaomi",
      "created_time": "February 26, 2023, 04:26:05 PM",
      "body": "La gran pregunta es si realmente se van por eso o porque igual se les achico mucho el negocio debido a otras plataformas?.Otra cuestion, la gente de venezuela igual imagino que debe hacer ciertas triangulaciones y asi seguir operando por todos lados.Igual si, es muy molesto tener que hacerlas y no poder usar las plataformas como todo el mundo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Artemis3",
      "created_time": "February 27, 2023, 02:00:22 PM",
      "body": "Todavía funciona Binance, si estos deciden irse o como han hecho algunos, filtrar las IPs, pues...Para el Estado Venezolano es ilegal usar Binance porque \"no está autorizada\" por Sunacrip. Generalmente los que se van no lo hacen por el Estado Venezolano, lo hacen por el Estado en EE.UU. específicamente el tema de las sanciones. Técnicamente no es al país sino una lista de funcionarios, pero ellos tendrían que dedicar personal a investigar que ninguna cuenta tenga alguna relación con los sancionados de la lista, quienes por supuesto se apoyan en terceros para evadir las sanciones.Como siempre las sanciones solo afectan al pueblo los gobernantes tienen todo el poder para evadirlas. Apenas les arruinaron sus vacaciones a Miami porque sí, esos políticos de pacotilla que hablan mal de EE.UU. 24/7 tienen propiedades y cuentas en ese país y de ahí que las sanciones congelaron varias de esas posesiones (y les prohíben el viaje). Es el colmo del descaro pero son intocables.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "February 28, 2023, 09:54:05 PM",
      "body": "Quote from: darxiaomi on February 26, 2023, 04:26:05 PMLa gran pregunta es si realmente se van por eso o porque igual se les achico mucho el negocio debido a otras plataformas?.Otra cuestion, la gente de venezuela igual imagino que debe hacer ciertas triangulaciones y asi seguir operando por todos lados.Igual si, es muy molesto tener que hacerlas y no poder usar las plataformas como todo el mundo.Siempre va haber alternativas, como ya mencionó Artemis3, la plataforma que esta mandando aquí por lo momentos es Binance. Realmente ofrecen una liquidez enorme en el mercado venezolanos, a través del P2P.Y me gustaría agregar que, aunque el estado Venezolano no ha autorizado a Binance y a muchas otras, es poco lo que puede hacer para imponer o bloquear plataformas cripto aquí. Aquí en mi ciudad es común encontrar personas y algunos negocios que aceptan Bitcoin, altcoins y Binance Pay.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}