{
  "id": "topic_5397891",
  "title": "PrinceVisser",
  "author": "PrinceVisser",
  "created_time": "May 09, 2022, 01:42:30 PM",
  "content": "Hi. I want to promote my business here on BTalk but I don't have the necessary rank to do that. By buying a copper membership, can I wear a profile pic + signature or I need to get merit first? Thanks!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5397891",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "May 09, 2022, 01:44:21 PMLast edit: May 09, 2022, 02:07:06 PM by OmegaStarScream",
      "body": "No, you're not going to be able to wear a profile picture, you'll need to become a full member for that. This is[1] what you'll get with the copper membership.[1] https://bitcointalk.org/index.php?topic=2385104.msg24371150#msg24371150",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "May 09, 2022, 01:46:40 PM",
      "body": "Avatar - you need rank at least full member, of course you need a minimum of 100 merit and 120 activity. Signature - each rank has different max character and styling, copper membership's signature almost close to member rank.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "May 09, 2022, 01:46:43 PM",
      "body": "Quote from: PrinceVisser on May 09, 2022, 01:42:30 PM<...>Just the Signature (not the profile Avatar), similar to that of a Member (as per this post).Signature capabilities vary per Rank, so make sure to check that they apply to your needs:Quote from: theymos on February 26, 2014, 09:15:18 PMPerhaps the allowed signature styling should change with activity score / membergroup. Like:- Newbie: No styling (including links) allowed. Max 40 characters.- Jr. Member: Links allowed. Max 100 characters.- Member: Unlimited length.- Full: Color allowed.- Sr. Member: Size allowed- Hero: Background color allowed<...>Consider Member as the rank equivalent for Copper Members. Also ignore the Newbie entry in the above quote (it's outdated and no longer applies).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "May 09, 2022, 02:15:38 PM",
      "body": "aside from what the others have said, you can also try and hire someone to advertise your business for you, it would most likely be more expensive than buying a copper membership. to be honest, having only a signature is more than enough to properly advertise your business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "May 09, 2022, 02:22:16 PM",
      "body": "Quote from: PrinceVisser on May 09, 2022, 01:42:30 PMHi. I want to promote my business here on BTalk but I don't have the necessary rank to do that. By buying a copper membership, can I wear a profile pic + signature or I need to get merit first? Thanks!Copper membership, only for sigs that match the member's rank, for signatures: full, Senior, Hero, Legen can't, profile photos also can't if you buy copper members.If you want to do business here there are other alternatives, maybe you can recruit other members who meet the requirements for the business or an established manager, see here: https://bitcointalk.org/index.php?board=52.0, who knows you have the desire to do so, rent, if you have the funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "May 09, 2022, 02:35:57 PM",
      "body": "Quote from: PrinceVisser on May 09, 2022, 01:42:30 PMHi. I want to promote my business here on BTalk but I don't have the necessary rank to do that. By buying a copper membership, can I wear a profile pic + signature or I need to get merit first? Thanks!You can promote it yourself with simple signature until you rank up, but there are other ways you can promote your business in bitcointalk forum.One of them is to create signature campaign, hire manager and other members can promote it for you and get paid for that.Other way for promotion is purchasing ad space in Auctions created by theymos, and you can read more about rules and everything else here:https://bitcointalk.org/index.php?topic=5393608.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "May 09, 2022, 03:11:54 PM",
      "body": "Quote from: dkbit98 on May 09, 2022, 02:35:57 PMYou can promote it yourself with simple signature until you rank up, but there are other ways you can promote your business in bitcointalk forum.The OP would not be able to post any signature unless they get at least one merit to rank up to Jr. Member or if they buy copper membership, the period of signatures for newbie has been disabled for sometime now. Your other suggestions about how the OP can get publicity would surely help.Op if you are willing to discuss the business you plan to market, then you can get more appropriate help for your marketing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrinceVisser",
      "created_time": "May 09, 2022, 03:17:53 PM",
      "body": "Quote from: Upgrade00 on May 09, 2022, 03:11:54 PMQuote from: dkbit98 on May 09, 2022, 02:35:57 PMYou can promote it yourself with simple signature until you rank up, but there are other ways you can promote your business in bitcointalk forum.The OP would not be able to post any signature unless they get at least one merit to rank up to Jr. Member or if they buy copper membership, the period of signatures for newbie has been disabled for sometime now. Your other suggestions about how the OP can get publicity would surely help.Op if you are willing to discuss the business you plan to market, then you can get more appropriate help for your marketing.I'm currently building a pretty unique casino review website with a lot of new features and I don't want my time and money to result in nothing. That's why I'm asking",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "May 09, 2022, 03:18:10 PM",
      "body": "Quote from: PrinceVisser on May 09, 2022, 01:42:30 PMI want to promote my business here on BTalkI think that you can easily already start with an ANNouncement thread about your business (and here copper membership can indeed help with allowing you post images).Then, afaik, copper membership should allow you have at least links in the signature.Will this be enough for you? I'm not so sure. If you want to advertise it a lot, you'll need to post a lot. As already said, getting more people wear your signature may be the way forward.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "May 09, 2022, 03:34:34 PM",
      "body": "Quote from: NeuroticFish on May 09, 2022, 03:18:10 PMI think that you can easily already start with an ANNouncement thread about your business (and here copper membership can indeed help with allowing you post images).Besides the OP being able to post image if he buys a copper member, then he can also shorten the timeout between the first and second posts.To be honest, I don't know exactly whether newbie can use signature or not because as a registered user in 2020, I never had a signature space on my profile. Maybe previously allowed for some characters before changing, but maybe I missed it.Quote from: NeuroticFish on May 09, 2022, 03:18:10 PMThen, afaik, copper membership should allow you have at least links in the signature.At least it can when the OP has a rank up to Jr Member or above, IMO.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "May 09, 2022, 03:38:32 PM",
      "body": "Quote from: PrinceVisser on May 09, 2022, 03:17:53 PMI'm currently building a pretty unique casino review website with a lot of new features and I don't want my time and money to result in nothing. That's why I'm asking Marketing is an important factor of building any business and you should have budgeted for that from the beginning. No business can thrive without publicity.If you really want effective publicity, simply buying copper membership and wearing one might not reach out to much users. (You can of course market on other social platforms)Does your casino accept cryptocurrency, if so, then you should consider the advice on running a signature campaign. You can check out similar projects in the services section. You can handle it yourself if you're up for it or hire a campaign manager; I happen to be one.Quote from: _BlackStar on May 09, 2022, 03:34:34 PMTo be honest, I don't know exactly whether newbie can use signature or not because as a registered user in 2020, I never had a signature space on my profile. Maybe previously allowed for some characters before changing, but maybe I missed it.Newbies can no longer wear signatures, since the enhanced newbie restrictions;Quote from: theymos on September 17, 2018, 04:27:20 AMDue to excessive garbage-posting, you now need 1 merit to be a Jr Member. All existing Jr Members who didn't meet the requirement were demoted. Also, newbies can no longer set any signature or personal text.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "May 10, 2022, 01:59:40 AM",
      "body": "Follow this guide in order to buy a Copper Membership. After buying it, you must enable it as followsAfter you do that simple step, the Copper Member will be shown above your rank. If you don't wear it, you won't receive its extra permission than natural forum member rank that you have.Quote from: theymos on November 11, 2017, 06:01:16 AMOnce you have it, you get the choice:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blue King",
      "created_time": "May 10, 2022, 02:31:33 PM",
      "body": "Quote from: acroman08 on May 09, 2022, 02:15:38 PMaside from what the others have said, you can also try and hire someone to advertise your business for you, it would most likely be more expensive than buying a copper membership. to be honest, having only a signature is more than enough to properly advertise your business.You are right. He is present newbie If he wants to advertise now then his Must be at least a full member.So if he wants to advertise, if he wants to advertise, then there are many senior members in the forum. They can do it. There are many senior members in the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rubidrive",
      "created_time": "March 06, 2023, 03:31:37 PM",
      "body": "hello, sorry if I'm putting my question in the wrong place, but I chose to do it here, so as not to be opening a topic just for my doubt and as the theme here is identical, I chose to put my doubt here.Today I joined the Copper member, I followed the indications that are in the forum, I already made the payment but I still don't see the Copper member option, if possible I thank you for your help.thank you very much",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "March 06, 2023, 03:37:53 PM",
      "body": "Quote from: rubidrive on March 06, 2023, 03:31:37 PMToday I joined the Copper member, I followed the indications that are in the forum, I already made the payment but I still don't see the Copper member option, if possible I thank you for your help.thank you very muchIt simply doesn't get added. You have to wear the copper membership. Go to the copper membership page and you will have the option to wear the membership. It's not good to bump an old thread as it's called necro bump which may get deleted by mod. You could create a topic though I don't personally support that idea.Copper membership page- https://bitcointalk.org/index.php?action=credit;promote",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rubidrive",
      "created_time": "March 06, 2023, 03:45:03 PM",
      "body": "ok I'm sorry , but I go to that page you indicated , where I got the payment data and the page is the same , the form does not appear with the option to add copperthe page always appears as it is in the imagethank you for your precious help, thank you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "March 06, 2023, 04:11:25 PM",
      "body": "Quote from: PrinceVisser on May 09, 2022, 01:42:30 PMHi. I want to promote my business here on BTalk but I don't have the necessary rank to do that. By buying a copper membership, can I wear a profile pic + signature or I need to get merit first? Thanks!The picture you wore on your profile is called avatar while the long codes you post on your profile signatory space for the signature you want to wear, before you can wear an avatar you have to become a full member rank with 100 meirts and at least 120 activities, the copper membership you buy will only allow you to post images for the sake of your threads service announcement or any evidence that will warrant you posting an image, you can also wear a signature from a jr member rank without obtaining a copper membership.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "March 06, 2023, 05:11:47 PM",
      "body": "Quote from: rubidrive on March 06, 2023, 03:31:37 PM<…> I followed the indications that are in the forum, I already made the payment but I still don't see the Copper member option <…>Are you sure that your payment TX has received at least 1 confirmation? The network is working on steeper fees during long intervals of the day (thanks to Ordinals bloating the network), so if you paid relatively small fees, your TX may still be in queue to be processed (thus you wouldn’t be seeing the \"wear\" options yet).See: https://mempool.space/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rubidrive",
      "created_time": "March 06, 2023, 05:34:28 PM",
      "body": "Thank you for your answer, in my bitcoin wallet the amount sent is already fully confirmed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}