{
  "id": "topic_5420099",
  "title": "Coinbox1",
  "author": "Coinbox1",
  "created_time": "November 09, 2022, 11:24:58 AMLast edit: November 18, 2022, 06:41:18 AM by Coinbox1",
  "content": "Hello Bitcointalk community,TrustDice team here. As we continually improve our platform, we think it is crucial that we also seek some genuine inputs from Bitcointalk community, so we can better involve you all in this creation process and better cater to your needs. This fits what Blockchain truly stands for!What extra do you expect from a (somewhat established) crypto casino? A few aspects we can think of include:- More crypto original games. Minesweeper and plinko, so we've heard, are getting trendy. Any more thoughts and would these interest you?- More cryptos accepted as payment options. We currently support BTC, ETH, EOS, USDT and USDC. More has been requested - but will it make depositing easier for you? And which cryptos should we add, in your opinion?- Additional features for our chat room?And feel free to tell us anything else you really want!Just in case anyone isn't familiar, we launched in 2018 and have since become one of the longest standing names in this fiercely competitive industry. All of the games we offer—Crash, Dice, 6000+ casino and live casino games, sports betting, and esports betting—are powered by cryptos.Thank you for reading this post, and thank you all for being part of our journey!TrustDice TeamUpdate:As frequently asked by many on this thread, we do have a bonus exclusively for Bitcointalk forum members.  Click here to find out!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420099",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "November 09, 2022, 12:03:14 PM",
      "body": "Quote from: Coinbox1 on November 09, 2022, 11:24:58 AMWe currently support BTC, ETH, USDT and USDC. More has been requested - but will it make depositing easier for you? And which cryptos should we add, in your opinion?I can see on your website that you also accept EOS for deposit and withdraw.Having more crypto payment would be good, I can suggest litecoin which many other people are using. I found it surprising that you are not supporting litecoin deposit and withdraw.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UserU",
      "created_time": "November 09, 2022, 12:08:21 PM",
      "body": "Quote from: Oshosondy on November 09, 2022, 12:03:14 PMHaving more crypto payment will be good, i can suggest Litecoin which many other people are using. I found it surprising that you are not supporting Litecoin deposit and withdrawal.I may not have more suggestion because I gamble more on sport, especially football.This. Litecoin is like one of the alts (that's not shit) with super low fees that sits well among players.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "November 09, 2022, 12:09:12 PM",
      "body": "Quote from: Coinbox1 on November 09, 2022, 11:24:58 AM...- More cryptos accepted as payment options. We currently support BTC, ETH, USDT and USDC. More has been requested - but will it make depositing easier for you? And which cryptos should we add, in your opinion?From my personal point of view, it should be one among your top priorities to add support to more coins, specially top altcoins with fast block time and low fees, like Litecoin, for example. It is not necessary to add a ton of them, it is just matter of giving more options for players so they can deposit even during high congestion within the Bitcoin network and Ethereum network; sure, using the Tron network to send USDT/USDC is a solution but some more options would be welcomed. To be honest, I thought your casino also accepted EOS? I thought I saw it as an option somewhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "November 09, 2022, 12:09:32 PM",
      "body": "Quote from: Coinbox1 on November 09, 2022, 11:24:58 AM- More cryptos accepted as payment options. We currently support BTC, ETH, USDT and USDC. More has been requested - but will it make depositing easier for you? More is always better, BTC, ETH, USDT and USDC will only limit users, sometimes, it is not always convenient having to swap from one coin or token to another , pay Network/exchange fees just to get one the casino supports, so for me, i think its wise to add more coins...QuoteAnd which cryptos should we add, in your opinion?And coins i would suggest is, from my own observation, many gamblers tend to go well with meme like coins, that is coins that are very cheap, for example ..the likes of TRXSHIBA DOGE COINetc ..Will do perfectly well ..And also you might want to consider adding BNB too, this coin has a great number of community and users, it is just like ETH, its a coin used for gas settlement on the binance smart chain, so be sure there will be many users depositing from BNB too.QuoteAnd feel free to tell us anything else you really want!Since I am not a user of the casino yet, I will reserve other suggestions to those who have actually tried the casino and know what actually needs improving and what's not.QuoteJust in case anyone isn't familiar, we launched in 2018 and have since become one of the longest standing names in this fiercely competitive industry. All of the games we offer—Crash, Dice, 6000+ casino and live casino games, sports betting, and esports betting—are powered by cryptos.Though like i said above, i am not yet a user of TrustDice, but the name is very popular around here, its actually of the reputable casinos we have around, i am personally glad for your achievement and wish you guys more grace to scale to the topper top   .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coinbox1",
      "created_time": "November 09, 2022, 12:44:50 PM",
      "body": "Quote from: Oshosondy on November 09, 2022, 12:03:14 PMQuote from: Coinbox1 on November 09, 2022, 11:24:58 AMWe currently support BTC, ETH, USDT and USDC. More has been requested - but will it make depositing easier for you? And which cryptos should we add, in your opinion?I can see on your website that you also accept EOS for deposit and withdraw.Having more crypto payment would be good, I can suggest litecoin which many other people are using. I found it surprising that you are not supporting litecoin deposit and withdraw.Thanks! Updated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "November 09, 2022, 12:50:56 PM",
      "body": "Quote from: Coinbox1 on November 09, 2022, 11:24:58 AM- More cryptos accepted as payment options. We currently support BTC, ETH, EOS, USDT and USDC. More has been requested - but will it make depositing easier for you? And which cryptos should we add, in your opinion?Dogecoin should be your first priority because it is used a lot and it is accepted a lot on many casinos. If you add Dogecoin to your casino, it will be helpful for traders and gamblers to move their Dogecoin from exchanges or other casinos to your casino.Another coin I would suggest is BNB from Binance. They are great but I know many exchanges want to fight with Binance and does not accept BNB or BUSD on their exchanges. I am not sure about your team thinking about BNB and Binance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "November 09, 2022, 01:05:11 PM",
      "body": "if you want to add some crypto to your deposits and withdrawals I would suggest TRX as well as Dogecoin.for games, I don't follow many games the casino has to offer. I prefer sports books, and I spend more money there.I hope your casino provides a solution to some of the problems that have occurred recently. regarding claims that are against the rules of the casino.I mean, if the new account created did have problems with other accounts in the past (ban). I don't think there is any reason to accept their deposit and charge them to place a bet and win. when they make a withdrawal, just investigate the account issue. and end up with account ban and deposit refunds or even suspension of funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "November 09, 2022, 01:14:22 PM",
      "body": "The more payment options you have the higher the targeting of your user base will be.In nowadays there are people mining all different coins,and they are trying new ones especially since they can't mine in profit so most of them may even be gamblers just like am and also a miner.I like when I can use Litecoin because the cheapest fees and fast transaction confirmations,another coin that I collect is SHIBA which I mine through a platform and I have some of them,I own different coins so some of them are not of any importance to me and I can gamble them away without thinking to much.For me the best is to have the more possible coins accepted in your casinos,the other things like loyalty rewards,deposit bonuses,reloads and all other comes after the ease of access first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "November 09, 2022, 01:20:39 PM",
      "body": "Adding Plinko will be best idea according to me . I mean there are many OG gamblers out their in the marker who loves Plinko, and to be honest now also many few casinos left who have this game. So adding this will definitely help the site’s growth. You can also go for adding more currencies, this will give gamblers variety of options, but remember that during this bear market, not many people have other alts accept Bitcoins. It will be better if you a create a google form link and share it here. The option with more votes about the features will win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "November 09, 2022, 01:27:27 PM",
      "body": "It's good to see a representative of the casino creating a thread and asking the community what should be added more after 4 years of existence and doing great in the industry, there are already a lot of suggestions, some already granted, but my suggestion  not really a suggestion but more on asking on a future plan, do you have a plan of creating a of your own if ever a token based casino become the trend in the Crypto gambling industry, as we all now there are already some casinos at least 4 with their own token in existence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "November 09, 2022, 01:35:29 PM",
      "body": "What about think out of the box additional feature that most of the casino is already doing. I’m not a player of your casino since I’m already established on my current casino because all casino offers same game and just varies on the bonuses.I knew that this might be unrelated but I saw crypto.com benefits for there credit card user. They are rewarding them free subscription of spotify, netflix and other common services subs to motivate them to continue using there service. Why not offer this kind of benefits to your VIP system. Sometimes having a reward that can be use outside the casino such as subscription is motivating aside from the rakeback.Having a monthly subscription of netflix or hbogo with reaching a certain tier and maintaining wager amount per month is good tho.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jemzx00",
      "created_time": "November 09, 2022, 01:36:41 PM",
      "body": "Quote from: Coinbox1 on November 09, 2022, 11:24:58 AM- Which cryptos should we add, in your opinion?I'm suggesting Litecoin, Dogecoin, TRX, and even BNB/BUSD if possible. Those are tokens that I usually on most gambling casino and has lesser fees and faster transaction speed. If also possible, in platform token conversion so in case someone would like to withdraw on other crypto, they'll be able to do so. Quote from: Coinbox1 on November 09, 2022, 11:24:58 AM- Additional features for our chat room?How about adding a border design that varies depending on their level or even adding limited borders and badges for events and such? Just like from online games chatrooms.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "November 09, 2022, 04:05:19 PM",
      "body": "Add BNB BSC and MATIC can be an alternative for cheaper withdrawal transaction fees and I happen to have both in my wallet or it's easier to add an exchange feature also in gambling where people can exchange cryptocurrency A for cryptocurrency B this makes it easier for people can withdraw their funds with lower crypto transaction withdrawal fees",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "November 09, 2022, 04:55:28 PM",
      "body": "Quote from: Coinbox1 on November 09, 2022, 11:24:58 AMWhat extra do you expect from a (somewhat established) crypto casino? A few aspects we can think of include:- More crypto original games. Minesweeper and plinko, so we've heard, are getting trendy. Any more thoughts and would these interest you?- More cryptos accepted as payment options. We currently support BTC, ETH, EOS, USDT and USDC. More has been requested - but will it make depositing easier for you? And which cryptos should we add, in your opinion?- Additional features for our chat room?And feel free to tell us anything else you really want!* I think minesweeper and plinko isn't new maybe try more unique games. * Maybe add XRP and TRON on the list as it's more convenient to use these two coins for fast execution of deposit and withdrawals.* For chat room I think it's best that you add more emojis, the more options a user has the more it's engaging though on the part of just emojis only. Just my suggestion only.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danadc",
      "created_time": "November 09, 2022, 05:01:20 PM",
      "body": "One of the things that I would add if I were a casino owner would be the option of doing poker tournaments 24 hours a day and with 1usdt for registration, and 2 or 3 free tournaments with a payment of 5mBTC for the winner, that would be to encourage all the community that you like poker, I have seen in many threads that there is a recent search for many players to play in others, the main casinos have this game, but it is only against the casino and that is something that casinos do not want players, there are many courses that I have seen that are on Youtube, and there is a thread that is special about an online poker course, I think there is a lot of enthusiasm for that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eureka_07",
      "created_time": "November 09, 2022, 05:21:10 PM",
      "body": "Quote from: Coinbox1 on November 09, 2022, 11:24:58 AM<snip>For adding more payment method, do not bombard your casino with lots of crypto. Be picky at least if you'll consider adding some, personally I would like you to have XRP and Litecoin.For games, if you can create an in-house game which is unique and has a good quality that providers like Pragmatic and Hacksaw Gaming are offering, that'll be great!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Daltonik",
      "created_time": "November 09, 2022, 05:29:44 PM",
      "body": "Quote from: Hispo on November 09, 2022, 12:09:12 PMQuote from: Coinbox1 on November 09, 2022, 11:24:58 AM...- More cryptos accepted as payment options. We currently support BTC, ETH, USDT and USDC. More has been requested - but will it make depositing easier for you? And which cryptos should we add, in your opinion?<...>To be honest, I thought your casino also accepted EOS? I thought I saw it as an option somewhere.Hmm, well, I see that there is also EOS in the list of deposits, or only if it was not added today, and in general there are a huge number of coins and tokens there, I could get lost, but I counted more than 600 cryptocurrencies, it would not be bad if they did a search for the right tokens, flipping through the list is not very convenient.Upd: there is also XRP and LTC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "November 09, 2022, 06:14:22 PM",
      "body": "Because EOS has a free transaction fee, does it mean a free withdrawal fee also for EOS?I'm more of MMA actually, but looking into your list, I have struggled to find the SHOWMORE link to see the main event. Maybe a visible Big Downward Arrow than a tiny showmore will be better. Or perhaps putting the main cards on top.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "November 09, 2022, 06:55:40 PM",
      "body": "I don't blame some of these casinos for only accepting few coins which their website support because there are alot of cryptos which shouldn't be regarded as digital coins because of their high tendencies to cease from existing within a shorter period and with this most of the gambling websites now also come up with their own coins and introduce such to the market and add it to their list of supported currencies, and therefore, it is ideally to support not more than five to 10 currencies including the one introduced by the website, then another thing to work upon is the additional security measures to help maintain a steady functionality of the site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}