{
  "id": "topic_5453163",
  "title": "Alik Bahshi",
  "author": "Alik Bahshi",
  "created_time": "May 18, 2023, 06:53:41 AM",
  "content": "Alik BakhshiComplete asshole, or the last war of the Russian Empire         In Putin's Russia, where any bold word against the will of the Kremlin can be interpreted as treason, an incredible event took place, which is hard to believe, but which is quite expected, because sooner or later the truth will still be dressed in words, and these words were uttered, brought to to despair by the commander of Russian mercenaries Prigozhin: https://www.youtube.com/watch?v=4ivFdOt4Oco    Prigozhin boldly and insultingly accuses Putin, calling him grandfather, of failures at the front, explaining that neither Commander-in-Chief Putin nor Defense Minister Shoigu have ever served in the army, and “how to win the war if suddenly this grandfather turns out to be a complete asshole.” Prigozhin has no doubts, saying that the counteroffensive of the Armed Forces of Ukraine \"will start on the ground, and not on TV, because so far in our country everyone thinks that everything can be done on TV.\" Prigozhin's words are quite true - TV in Russia plays the role of a shepherd's whip, which obeys the silent flock. Putin is well aware of the importance of television in the management of the masses, and one of his first steps in power was to deprive the people of independent television. It must be said that the Russian people do not in the least oppose the tricks of the master of the Kremlin and obediently follow all his instructions. The Russian constitution has turned into a corrupt girl. In Russia, it is not Putin who is the guarantor of the Constitution, but the Constitution has become Putin's guarantor. It seems that the activities of the Nazi propagandist Goebbels had a great influence on Putin, consisting in the words: “A lie told once remains a lie. A lie repeated a thousand times becomes the truth.\"     Putin clearly follows the instructions of Goebbels. It is difficult to give an example when Putin spoke the truth. Lies have become the hallmark of Russia.(1) It seems that Putin decided to transfer his Russian experience of fooling the masses to the countries of Western democracy. False propaganda flooded not only Russia, taking advantage of the freedom of the media in democratic countries, Putin set out to deceive the world community with the help of infiltrated propagandists, present Russia as a peaceful democratic country, while hiding the secret goals of restoring the Russian Empire within the borders of the former USSR. By the way, I wrote about Putin's forthcoming revanchism from the very moment, as soon as he became the owner of the Kremlin (2,3,4). Unfortunately, neither the cowboy Bush Jr., who called the Russian dictator nothing less than “friend Putin,” nor the overly cautious Obama, who saw through Putin’s cunning by the end of his second term as president, did nothing to stop the insolent Putin biting the bit. The tolerant West silently looked at the brutal massacre of the Chechen people and slightly scolded for the war with Georgia. I want to give an excerpt from my article (5), in which I foresaw a Russian attack on Ukraine immediately after the end of the Sochi Olympiad:   “Will the West show integrity or surrender Ukraine, as it surrendered Chechnya, allowing Putin to brutally crack down on the Chechen people? Or it will continue to buy Russian energy carriers, preferring a purely pragmatic approach, not taking into account Sakharov's fair words that the most pragmatic approach is moral. One thing is clear here, before the Sochi Winter Olympics, Russia will not invade Ukraine, so as not to repeat the failed Moscow Olympics in 1980. Therefore, Ukrainians need to hurry up with joining the EU before the end of the Sochi Olympiad.”     Here we must honestly say that the Ukrainians themselves are to blame for the misfortune that befell them. The complete indiscriminateness in the choice of people in power structures is striking. Was it really not clear what was Putin's henchman, twice convicted Viktor Yanukovych. Democracy is good, of course, but in Ukraine democracy has been turned into a game for the oligarchs, sometimes presidential, sometimes parliamentary, and there’s no need to talk about corruption and venality in government bodies. Endless swearing and fights in the corrupt parliament between proteges of the oligarchs - all this could not but affect the country's defense capability. How could the Russian Empire lease the naval base in Sevastopol, and then also extend the lease for 25 years. Greed overshadowed the mind of Kyiv. Ukrainian politicians have forgotten the role played by Russian military bases in the Baltic countries, with the help of which Moscow overthrew the authorities there in 1939 and held referendums en masse for their entry into the USSR. Instead of following the example of Estonia, Latvia and Lithuania and reforming the country in accordance with EU requirements, Ukrainian politicians, concerned only with their own personal interests, created a favorable environment for the invasion, which was exploited, albeit belatedly, by the revanchist Putin. Under the guise of conducting military exercises near the borders of Ukraine, a powerful invasion army was created, which was not unnoticed by America. Fortunately, by this time there was a new President Zelensky in Ukraine, who managed to take care of organizing a proper meeting with the Russians. Ukraine's acquisition of lethal weapons, which Obama had previously recklessly refused to provide, helped thwart Putin's plans for a speedy end to the so-called special operation. Russian tanks burned like matchboxes from a Javelin hit. Putin's blitzkrieg failed in disgrace. Putin's hope is that it will be enough for the Russian hordes to cross the border, as the Ukrainian army will scatter in fear, and in two or three days Russian tanks will be throwing flowers on the streets of Kyiv. I have no doubt that Putin's agents in Kyiv had already prepared flowers for this occasion somewhere in the cellars.     Contrary to Putin's plans, it turned out that the Ukrainian people did not want to part with their independence, The future of the Ukrainian people, which was encroached upon by the fascist Putin (7), formalizing a plan for its liquidation in his article written on the eve of the invasion, the thesis of which was that the Russians and Ukrainians are one people. However, the fact that a Ukrainian soldier is ready to give his life for the freedom of his people was not included in the plan of the Kremlin revenge-seeker. Yes, Putin is a pragmatist, but he does not want to understand, or rather, with the psychology of a St. Petersburg gangster, he is unable to understand that pragmatism that excludes morality will inevitably lead to failure or crime, as it happened. Sakharov's words are involuntarily recalled:\"In the end, the moral choice is the most pragmatic.\"      The West appreciated the courage of the Ukrainian soldier, and today, in fact, he is the defender of not only his homeland, but also the defender of civilization and democracy, which was expressed in the provision of military assistance from NATO. Perhaps Putin did not expect such a solidarity of Western countries in the determination to rebuff his revanchist aspirations to restore the empire. The special operation, designed for two or three days, turned into a large-scale war of attrition, for which Putin was clearly not ready. Hence the dissatisfaction among the commanders of the Russian invaders, who not only lack material means for the successful conduct of the war, but also suffer huge losses among the personnel in the troops, which was expressed in Prigozhin’s insulting words to Putin. I believe that Prigozhin now needs to be very careful and wash his underpants himself in order to avoid the fate of Navalny. But the main thing in what happened is that discontent in the Russian army can become widespread, and then defeat is inevitable. The defeat of Russia in the war will inevitably be followed by the departure of Putin, general chaos and the collapse of the empire. I don’t think that Putin will have time to be in The Hague, the desperate people will first crucify him at the gates of the Kremlin, and Russia will return to its historical borders and acquire its former name Muscovy. (        1. Empire of Lies and its main liar. 06/20/14. https://alikbahshi.livejournal.com/22317.html2. Chechnya, who's next? Israel. Our country. 12/11/96.3. Money, war and politics, or Chechnya and how to crush the reptile. Israel. Our country. 10/14/99.4. A terrible price for the roof from the rose revolutions. 14.12.05. .https://alikbahshi.livejournal.com/3149.html5. Whose Crimea. 06.02.06. https://alikbahshi.livejournal.com/4030.html6. Ukraine as a victim of the immorality of the West in relation to Russia. 12/13/13. https://alikbahshi.livejournal.com/20891.html7. The ghost of Hitler haunts Europe. 04/25/18. https://alikbahshi.livejournal.com/38049.html8. The first president after Putin will be the first president of Muscovy. 06/21/2022  https://alikbahshi.livejournal.com/83920.html05/15/2023",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453163",
  "comments": [
    {
      "author": "BADecker",
      "created_time": "May 20, 2023, 10:47:17 PM",
      "body": "Putin wants the Russian people to back Russia so much, that he is at least suggesting the right to bear arms to them. Not only that, but he is advising Americans to keep their guns.I think we all know why. What started as a police action in Ukraine, showed Putin that the whole West banking system is as corrupt as can be, and that he needs us all to fight banking corruption. But it's true that if we don't, we will all become slaves... to the banks.Putin Tells U.S. Citizens \"Do Not Give Up Your Guns\"https://thepeoplesvoice.tv/putin-tells-u-s-citizens-do-not-give-up-your-guns/However, the U.S. government seem determined to take that right away from its citizens, amid Russia doing the exact opposite. President Putin wants to give Russian citizens the freedom to chose whether or not they arm themselves.Politicalvelcraft.org reports:This will probably come as a total shock to most of my Western readers, but at one point, Russia was one of the most heavily armed societies on earth. This was, of course, when we were free under the Tsar. Weapons, from swords and spears to pistols, rifles and shotguns were everywhere, common items.People carried them concealed, they carried them holstered. Fighting knives were a prominent part of many traditional attires and those little tubes criss crossing on the costumes of Cossacks and various Caucasian peoples? Well those are bullet holders for rifles.Various armies, such as the Poles, during the ??!?? (Times of Troubles), or Napoleon, or the Germans even as the Tsarist state collapsed under the weight of WW1 and Wall Street monies, found that holding Russian lands was much much harder than taking them and taking was no easy walk in the park but a blood bath all its own. In holding, one faced an extremely well armed and aggressive population Hell bent on exterminating or driving out the aggressor....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "May 21, 2023, 09:04:29 AM",
      "body": "Quote from: BADecker on May 20, 2023, 10:47:17 PMPutin wants the Russian people to back Russia so much, that he is at least suggesting the right to bear arms to them. Not only that, but he is advising Americans to keep their guns.I think we all know why. What started as a police action in Ukraine, showed Putin that the whole West banking system is as corrupt as can be, and that he needs us all to fight banking corruption. But it's true that if we don't, we will all become slaves... to the banks.Putin Tells U.S. Citizens \"Do Not Give Up Your Guns\" Here the topic is about the war in Ukraine, and not about the free sale of weapons to the population.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "May 21, 2023, 04:38:33 PM",
      "body": "Quote from: Alik Bahshi on May 21, 2023, 09:04:29 AMQuote from: BADecker on May 20, 2023, 10:47:17 PMPutin wants the Russian people to back Russia so much, that he is at least suggesting the right to bear arms to them. Not only that, but he is advising Americans to keep their guns.I think we all know why. What started as a police action in Ukraine, showed Putin that the whole West banking system is as corrupt as can be, and that he needs us all to fight banking corruption. But it's true that if we don't, we will all become slaves... to the banks.Putin Tells U.S. Citizens \"Do Not Give Up Your Guns\" Here the topic is about the war in Ukraine, and not about the free sale of weapons to the population.It's kind of amazing that you talk like you know what your own topic is about, but then show that you really don't know... right in the same words. That's quite a skill you have there.War is not something that major nations simply, on a whim, decide to do today, without any reason for it. The reasons for the war, are actually part of the war. If there were no reasons, there would be no war. So, essentially, the war starts with the reasons for it and behind it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "May 21, 2023, 05:04:29 PM",
      "body": "Quote from: BADecker on May 21, 2023, 04:38:33 PMQuote from: Alik Bahshi on May 21, 2023, 09:04:29 AM Here the topic is about the war in Ukraine, and not about the free sale of weapons to the population.It's kind of amazing that you talk like you know what your own topic is about, but then show that you really don't know... right in the same words. That's quite a skill you have there.War is not something that major nations simply, on a whim, decide to do today, without any reason for it. The reasons for the war, are actually part of the war. If there were no reasons, there would be no war. So, essentially, the war starts with the reasons for it and behind it. You are diverting the topic again. The topic does not talk about the cause of the war unleashed by Russia against Ukraine, but specifically about the old complete fool Putin, who started this war without calculating the resources, thinking that Russia would capture Kiev in 2-3 days. And if we talk about the reason for the war, then it is simple - Putin wants to restore Russia to its former borders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "May 21, 2023, 10:52:36 PM",
      "body": "Quote from: Alik Bahshi on May 21, 2023, 05:04:29 PMQuote from: BADecker on May 21, 2023, 04:38:33 PMQuote from: Alik Bahshi on May 21, 2023, 09:04:29 AM Here the topic is about the war in Ukraine, and not about the free sale of weapons to the population.It's kind of amazing that you talk like you know what your own topic is about, but then show that you really don't know... right in the same words. That's quite a skill you have there.War is not something that major nations simply, on a whim, decide to do today, without any reason for it. The reasons for the war, are actually part of the war. If there were no reasons, there would be no war. So, essentially, the war starts with the reasons for it and behind it. You are diverting the topic again. The topic does not talk about the cause of the war unleashed by Russia against Ukraine, but specifically about the old complete fool Putin, who started this war without calculating the resources, thinking that Russia would capture Kiev in 2-3 days. And if we talk about the reason for the war, then it is simple - Putin wants to restore Russia to its former borders.You and your goofy \"stay on topic\" stuff. Don't you even realize that when you talk like that, you are talking off topic? Or are you making \"off topic\" your new topic?Seems to me that you are blindly looking for somebody who simply agrees with everything you say. And that's what you call \"on topic.\" Anybody who has discussion with you that is opposed to your ideas is \"off topic\"... in your view.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "May 22, 2023, 06:32:08 AM",
      "body": "Quote from: BADecker on May 21, 2023, 10:52:36 PM You are diverting the topic again. The topic does not talk about the cause of the war unleashed by Russia against Ukraine, but specifically about the old complete fool Putin, who started this war without calculating the resources, thinking that Russia would capture Kiev in 2-3 days. And if we talk about the reason for the war, then it is simple - Putin wants to restore Russia to its former borders.You and your goofy \"stay on topic\" stuff. Don't you even realize that when you talk like that, you are talking off topic? Or are you making \"off topic\" your new topic?Seems to me that you are blindly looking for somebody who simply agrees with everything you say. And that's what you call \"on topic.\" Anybody who has discussion with you that is opposed to your ideas is \"off topic\"... in your view.[/quote]Again, the words are not clear what and most importantly, not on this topic.By the way, you asked about the reason for Russia's war in Ukraine, this is my topic here: \"The reason for the aggressiveness of the\" Russian world \":  https://bitcointalk.org/index.php?topic=5412450.msg60887081#msg60887081",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "May 22, 2023, 01:06:38 PM",
      "body": "I think is the last war of the Russian Empire,right now even if the war ends today which I highly doubt it as it took Russians a year to claim that they have taken Bakhmut which is near them geographically and this is not a complete take of the city as there are still Ukrainians fighting means that they have lost so many people,ammunition,war equipment that to replenish all of what they have lost and taken into consideration also the sanctions from the West it should take them about 10-40 years with 10 years being a very optimistic prediction regarding the ability of Russia to heal itself.Since war will not end today and that Ukraine is ready for a big counter offensive I think that Putin has made a grave mistake by launching an aggression of this caliber,he didn't want more NATO at his borders,now he added just 1300 KM of Finland bordering Russia as they entered NATO.I don't know what good has brought this war to the Russians yet,yet they are big enthusiasts of this war.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}