{
  "id": "topic_5432770",
  "title": "spazzdla",
  "author": "spazzdla",
  "created_time": "January 02, 2023, 08:07:56 PMLast edit: January 03, 2023, 10:21:59 PM by Mr. Big",
  "content": "Anyone used a Ledger Nano-S-Plus before?  I just rage threw it accross the room... 4 attempts to use a phrase I made via dice then 20 pin invalids and I smashed it...  This device is a massive pain in the ass I wouldn't recommend... Trezor I did let it make the words and no Issues. Touch screen is very nice to use. I will attempt to use the words I created on the trezor to see if it is any better.  WELL the device can be put back together easily LOL.I made a phrase from dice and keep getting \"recovery phrase is invalid, retry\"  Any one know why this would happen?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432770",
  "comments": [
    {
      "author": "Hispo",
      "created_time": "January 02, 2023, 08:37:13 PMLast edit: January 02, 2023, 08:47:37 PM by Hispo",
      "body": "Quote from: spazzdla on January 02, 2023, 08:25:22 PMWELL the device can be put back together easily LOL.I made a phrase from dice and keep getting \"recovery phrase is invalid, retry\"  Any one know why this would happen?I recall there was a discussion about this on the development board. If I remember correctly, if you are trying to get a 24 word seed with dices you are not supposed to get up to the 24th word, but rather only generate 23 words with dices and the 24th one must be calculated, for it in order to be valid.Ill scroll through the board and see if I can find the thread for you.Edit:I think I managed to find it, OP. It seems the 24th word is supposed to be a checksum of the rest of the words, so you can't just pick it.https://bitcointalk.org/index.php?topic=5423816.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "spazzdla",
      "created_time": "January 02, 2023, 08:50:06 PM",
      "body": "ooh..... I see... not easy to calculate it seems... I will try reading again to see how to calcualte.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "January 03, 2023, 01:13:20 AM",
      "body": "Quote from: spazzdla on January 02, 2023, 08:50:06 PMooh..... I see... not easy to calculate it seems... I will try reading again to see how to calcualte. You are welcome.It seems that there are some programs and webpages with helps you to perform the checksum and select a 24th word which would make your seed a valid one, however that may imply you would need to expose your seed to the internet, making it unsafe.My recommendation would be to use an open source code to make the checksum and run the process on a computer without internet connection, once it is done and you have your 24th word, proceed to delete the code. I am not sure how safe this will be though, It would be constructive to listen to other's opinion on this matter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChiBitCTy",
      "created_time": "January 03, 2023, 02:45:40 AM",
      "body": "This topic probably should be placed (moved, which you can do yourself OP) in hardware wallets just FYI...but if I were choosing between hardware wallets Ledger would not be in the conversation.  The two wallets that most of the \"professionals\" tend to recommend are Trezor but the other is Cold Card's.  Cold Cards aren't open source, which I know is one downfall, but include a lot of other stuff that makes them an exceptional wallet. Here's a ColdCard review- https://bitcointalk.org/index.php?topic=5405919.msg60552395#msg60552395",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "January 03, 2023, 02:53:52 AM",
      "body": "Im using safepal for about a year now, although I'm rarely using it daily. but so far so good but its using their own app to do transaction so its more like internet banking KEY, but it much simpler only use by scan it. but note the safepal is as far that i know is Closed Source so do your own research",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "January 03, 2023, 10:28:52 AM",
      "body": "Ledger and Trezor are most famous hardware wallets but you can find other hardware wallets from [LIST] Open Source Hardware Wallets.If you want more reviews, Cryptowisser.com can be helpful with their reviews.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "January 03, 2023, 11:02:19 AM",
      "body": "Quote from: spazzdla on January 02, 2023, 08:07:56 PMAnyone used a Ledger Nano-S-Plus before?  I just rage threw it accross the room... 4 attempts to use a phrase I made via dice then 20 pin invalids and I smashed it...  This device is a massive pain in the ass I wouldn't recommend... Someone who doesn't know how to post a thread in the appropriate board, and who also doesn't know the rules of the forum (Rule 32), will surely have big problems with devices like hardware wallets. If you want to destroy something next time, take a hammer and do it right. The S Plus is no different from the S model in terms of use, and it never occurred to me (and to most others) to solve our possible incapacity in that way. Read the instructions before use.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "January 03, 2023, 11:05:40 AM",
      "body": "I've heard good things about Coldcard from the Twitter Bitcoin maximalist crowd despite it being a tad more complicated to use/prepare for the typical non-technical person. Obviously though, it's Bitcoin-only so it's an easy no-go if you're a fan of holding other cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "January 03, 2023, 01:43:50 PM",
      "body": "Quote from: spazzdla on January 02, 2023, 08:07:56 PMAnyone used a Ledger Nano-S-Plus before?  I just rage threw it accross the room... 4 attempts to use a phrase I made via dice then 20 pin invalids and I smashed it...  This device is a massive pain in the ass I wouldn't recommend... You basically compared apples and oranges, and I think you are writing nonsense after you came back to forum after long period of inactivity.It's not that I like ledger hardware wallets, but blaming ledger wallet for not accepting seed words you generated who knows how is ridiculous, and why didn't you do the same thing importing them to Trezor?It's better to explain how exactly you generated seed words with dices.One bonus question for you spazzdla:- Can you please prove ownership for any of your address posted in forum before?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "January 04, 2023, 01:40:29 AM",
      "body": "Quote from: mk4 on January 03, 2023, 11:05:40 AMI've heard good things about Coldcard from the Twitter Bitcoin maximalist crowd despite it being a tad more complicated to use/prepare for the typical non-technical person. Obviously, though, it's Bitcoin-only so it's an easy no-go if you're a fan of holding other cryptocurrencies.About the Coldcard that you recommend, it is quite unique with a physical number button design and uses an OLED screen measuring 128x64 pixels.Using double security that can store seed words stored in special chips that are designed for double security. Verifiable source code.Features:- USB-C Connector- Unlimited Memory, no Bitcoin Transaction size restrictions- NFC Tap for all data types, PSBT(BIP174), Address, etc...- Sliding cover protects screen- support BIP39 passphrases 25th word- Even more security: Dual SE (Secure Elements) 1. Extensive duress PIN features 2. Multi-vendor solution- USB Virtual Disk modeThe price is still quite affordable, with $147.94, you can get the New COLDCARD Mk4 with upgraded secure elements, USB-C connector, new plastic, optional NFC, massive RAM for multi-sig, and much-much more.#fun factBut when you recommend Coldcard, there is something in common with the username you used, that is, this version of Colcard is named \"mk4\" on the board, are you the developer? or mk4 is just the serial name taken from the Toyota Supra mk4 which happens to be the same as your username.https://coldcard.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "January 04, 2023, 05:21:30 AM",
      "body": "Quote from: taufik123 on January 04, 2023, 01:40:29 AM#fun factBut when you recommend Coldcard, there is something in common with the username you used, that is, this version of Colcard is named \"mk4\" on the board, are you the developer? or mk4 is just the serial name taken from the Toyota Supra mk4 which happens to be the same as your username.Hah. Mk4 can mean many things — a car model(Volkswagen Golf Mk4, etc), a videogame(Mortal Kombat 4), an Iron Man armor version(Mark IV), etc. Coldcard's mk4 is just one of many similar names.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "January 04, 2023, 09:54:07 AM",
      "body": "Quote from: mk4 on January 04, 2023, 05:21:30 AMHah. Mk4 can mean many things — a car model(Volkswagen Golf Mk4, etc), a videogame(Mortal Kombat 4), an Iron Man armor version(Mark IV), etc. Coldcard's mk4 is just one of many similar names. LOL, I'm just guessing but maybe that's wrong. mk4 has a lot of things.Ok, forget about that.Regarding the Coldcard hardware wallet that you recommend, it is also provided with NFC features, is NFC safe for Hardware Wallet, because now we also know about a device that can easily hack NFC like \"Flipper Zero\" is a portable multi-tool for testers and geeks in toy form.Because I have never used a hardware wallet with the NFC feature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "January 10, 2023, 11:29:50 AM",
      "body": "Quote from: taufik123 on January 04, 2023, 09:54:07 AMRegarding the Coldcard hardware wallet that you recommend, it is also provided with NFC features, is NFC safe for Hardware Wallet, because now we also know about a device that can easily hack NFC like \"Flipper Zero\" is a portable multi-tool for testers and geeks in toy form.Because I have never used a hardware wallet with the NFC feature.It mostly depends on what kind of information you transmit via these NFC channels: if it is no different from what is already being transferred with blockchain, then there is nothing to steal, hack or peer into. Partially signed transactions, signed messages, addresses, or even public keys: this information is not interesting to the attacker unless they want to figure out how much money you have under the mattress. Private keys, seed words, or passphrases are never transmitted through public channels, you only have access to them for a short period of time when doing an actual signing, but that's an unavoidable trade-off: after all, these are merely pieces of metal and silicon that can be broken if you invest enough money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "January 10, 2023, 11:55:27 AM",
      "body": "@spazzdlaI suggest setting fire to your home or smashing up your car. That usually helps to generate valid seeds with the help of dices or figuring out why you can't do it.Quote from: ChiBitCTy on January 03, 2023, 02:45:40 AMCold Cards aren't open source, which I know is one downfall, but include a lot of other stuff that makes them an exceptional wallet. They aren't open-source, but if you are concerned about checking the codebase, you can still do that. Coldcards' code is available for verification and scrutiny if you know how to do it. Their Common Clause license prevents you to use their code in your own products. You aren't allowed to distribute it or build upon it. But as an end user with coding skills, you can make the necessary verifications.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vampobit",
      "created_time": "January 10, 2023, 08:44:10 PM",
      "body": "Quote from: spazzdla on January 02, 2023, 08:50:06 PMooh..... I see... not easy to calculate it seems... I will try reading again to see how to calcualte. let me just give you a good recommendation video by BTCSessions: https://www.youtube.com/watch?v=LxTkLwpV1Po&ab_channel=BTCSessionsYou can navigate in the video and find where he calculates the checksum (it's around 18min 40sec)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "January 11, 2023, 11:15:59 PM",
      "body": "Quote from: mk4 on January 04, 2023, 05:21:30 AMQuote from: taufik123 on January 04, 2023, 01:40:29 AM#fun factBut when you recommend Coldcard, there is something in common with the username you used, that is, this version of Colcard is named \"mk4\" on the board, are you the developer? or mk4 is just the serial name taken from the Toyota Supra mk4 which happens to be the same as your username.Hah. Mk4 can mean many things — a car model(Volkswagen Golf Mk4, etc), a videogame(Mortal Kombat 4), an Iron Man armor version(Mark IV), etc. Coldcard's mk4 is just one of many similar names. My personal favorite is the Ruger MkII, but the MkIV is nice too.  Really now, the ColdCard is a great weapon tool for the bitcoin maximalist, I've really been enjoying mine.  The other one I would recommend for the bitcoin maximalist is the Foundation Passport.  I recently got one myself but haven't used it too much just yet, however I can easily see it replacing my ColdCard as my favorite hardware wallet.  The Trezor Model T is also great and I would recommend it to those who need to hold alts on their hardware wallets.  Mine has been relegated to holding XMR and DOGE, since I've been exclusively using the ColdCard for bitcoin since last summer.Those are the three that I would recommend, and I specifically recommend avoiding the Ledger models.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OROBTC",
      "created_time": "January 12, 2023, 01:42:36 AM",
      "body": "...I have used three brands of hardware wallets.  I like my BitBox02 (BTC only version) and my Trezor Model T.  The Trezor is a little easier to use, but the BitBox has other advantages, so I like them about the same amount.I also used to use a Ledger S, but that was a little less confidence inspiring, and I have taken to heart what various others have written about Ledger...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "January 12, 2023, 02:47:25 PM",
      "body": "https://bitcointalk.org/index.php?topic=5193860.msg52830677#msg52830677The best weapons were invented many years ago, they do not need maintenance and the revolver can be kept loaded at all times. This weapon will not jam when fired.___https://www.ledger.com/blog/cometh-battle-blockchain-gaming-enters-ledger-liveThings to know:– Cometh Battle is the first blockchain-based game to join your Ledger Live app’s Discover Section.– Powered by the Polygon blockchain, Cometh Battle is a free-to-play tactical card game where you can play, earn, own, collect and trade your NFT cards and spaceships.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "January 13, 2023, 02:54:32 PM",
      "body": "For me, the best wallet right now is the Passport Batch 2. I've revieved their first hardware wallet as well and both are good products. Neither is perfect, but the batch 2 has improved on a lot of mistakes and is a joy to use regularly.Since I much prefer a device that has open-source, verifiable hardware and software (so basically everything) over one that doesn't, there are actually barely any other options on the market.If you're between Ledger and Trezor, always get the Trezor, since its firmware is open while Ledger is completely closed. No way for us to know if it has security issues, neither can we add features. Also if there was a security hole that the Ledger team fixed, if they don't mention it anywhere, you wouldn't even know it has happened. Kinda sketchy; if you already buy the product, you want to know what it's doing, right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}