{
  "id": "topic_5425551",
  "title": "arbiter5",
  "author": "arbiter5",
  "created_time": "December 04, 2022, 05:18:48 AM",
  "content": "Just purely out of curiosity. 99% of people who don't know how to properly create an airgapped device should be using hardware wallets.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5425551",
  "comments": [
    {
      "author": "pooya87",
      "created_time": "December 04, 2022, 06:15:58 AM",
      "body": "QuotePeople who don't use hardware wallets: Why not?I'm not willing to pay a centralized company to give me what I don't need and is only semi-cold storage.Quote from: arbiter5 on December 04, 2022, 05:18:48 AMJust purely out of curiosity. 99% of people who don't know how to properly create an airgapped device should be using hardware wallets.In my opinion it depends on how much they've invested in bitcoin. For example someone who has bought a couple of hundred dollars worth of bitcoin is never going to pay for a hardware wallet. It makes more sense for those who have large amounts of bitcoin.Another thing to consider is how many times you are going to want to access your funds. A paper wallet is more suitable for \"storage\" that you don't want to touch while a hardware wallet is more suitable for those who want to regularly access the funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "December 04, 2022, 06:16:17 AM",
      "body": "In summary:\"Coinbase/Binance is secure enough.\"\"What if I lose my backup?\"\"My phone/computer is secure because I have an antivirus.\"Probably something along those lines.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "December 04, 2022, 06:47:09 AM",
      "body": "I don’t think hw wallets a necessity. To me, it is the exact opposite. No matter how cheap and reliable they are, I will probably never use a hw wallet. That’s because a small laptop works for me and I don’t need a hw wallet and probably never will. I use linux on my laptop, it is connected to the internet and never had any problems. 99999 times out of 100000 (i’d say 100% but sometimes shit happens) you won’t have a problem with a simple setup like this. That’s if you don’t do pirating and similar crap on your PC and use a linux distribution as your OS.If you want to be 100% safe, create your wallet on a freshly linux installed laptop with no wifi card.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fennic",
      "created_time": "December 04, 2022, 06:48:23 AM",
      "body": "Quote from: arbiter5 on December 04, 2022, 05:18:48 AMJust purely out of curiosity. 99% of people who don't know how to properly create an airgapped device should be using hardware wallets.There are many reasons behind that people are not using hardware.wallet. And let me show you these,1) First Of All All people are not aware of Hardware wallets like ledge nano wallet etc. 2) hardware wallets are not cheap and they cost some hundred bucks. And low volume users cannot afford to buy these wallets.3) most people do not trust hardware wallets. As you can see it ranges from 150 to 300 dollars and that's the reason mostly people do not know about this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "December 04, 2022, 07:16:52 AM",
      "body": "In the same manner that you can also ask, why do people who have Bitcoin don't know anything about Bitcoin? I know of someone who invested money in Bitcoin but doesn't have a clue about what it is. I know of another who has Bitcoin herself but doesn't know what a hardware wallet is. She hasn't even heard of the Lightning Network yet. So if they don't even know what Bitcoin stands for, how surprising it would be to know that they don't have a hardware wallet?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "December 04, 2022, 07:23:10 AM",
      "body": "Quote from: fennic on December 04, 2022, 06:48:23 AMQuote from: arbiter5 on December 04, 2022, 05:18:48 AMJust purely out of curiosity. 99% of people who don't know how to properly create an airgapped device should be using hardware wallets.There are many reasons behind that people are not using hardware.wallet. And let me show you these,1) First Of All All people are not aware of Hardware wallets like ledge nano wallet etc. 2) hardware wallets are not cheap and they cost some hundred bucks. And low volume users cannot afford to buy these wallets.3) most people do not trust hardware wallets. As you can see it ranges from 150 to 300 dollars and that's the reason mostly people do not know about this.Yeah, the price is definitely not cheap but if you own 1btc or more, $300 is a small amount to pay for maximum security assuming this is what you get when you purchase a hardware wallet.i think the reasons are relative,  in my case, I never really find it that necessary to own one, especially the convenience of carrying it along, if you are forgeful, it can be a huge disadvantage too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "December 04, 2022, 09:42:59 AM",
      "body": "Quote from: fennic on December 04, 2022, 06:48:23 AMQuote from: arbiter5 on December 04, 2022, 05:18:48 AMJust purely out of curiosity. 99% of people who don't know how to properly create an airgapped device should be using hardware wallets.There are many reasons behind that people are not using hardware.wallet. And let me show you these,1) First Of All All people are not aware of Hardware wallets like ledge nano wallet etc. 2) hardware wallets are not cheap and they cost some hundred bucks. And low volume users cannot afford to buy these wallets.3) most people do not trust hardware wallets. As you can see it ranges from 150 to 300 dollars and that's the reason mostly people do not know about this.1) Mostly for beginners. It will take them some time to learn about the existence and purpose of hardware wallets. Only if they actively study the cryptocurrensy topic, and not just buy crypto and put it off for a long time.2) If the investment in crypto is a couple of hundred dollars or a little more, then what's the point of buying a HW for at least $80 -150? Then already buy crypto for this amount.3) Indeed, there is a category of crypto-enthusiasts who don't trust HW device manufacturers, and they are also able to organize the storage of their crypto in such a way that they don't need a hardware wallet. This is already the level of advanced users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "December 04, 2022, 09:55:01 AM",
      "body": "Quote from: arbiter5 on December 04, 2022, 05:18:48 AMJust purely out of curiosity. 99% of people who don't know how to properly create an airgapped device should be using hardware wallets.There are multiple reasons why many people including crypto veterans don't use hardware wallet,1. It's not completely decentralised2. Hardware wallets are costly 3. People can use good antivirus and anti-spyware for their PCI am personally attached with bitcoin since 2016, but I have never used a hardware wallet because I never felt like using one. Electrum is good enough for me!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "December 04, 2022, 10:01:52 AM",
      "body": "Bitcoin was designed to not be used with hardware wallets. So if you dont use a hardware wallet then you use bitcoin in its original form. If you dont know how to properly secure your computer then a hardware wallet can be used but it is not how it was originally designed. With that said I still use a hardware wallet, since you can just sleep better",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "December 04, 2022, 10:02:00 AM",
      "body": "The main reason for which many people don’t use hardware wallets is due to the necessity of the users. Most of the time, users don’t have large amount of Bitcoins. They basically hold a couple hundred dollars worth Bitcoins. Now in order to store it, they aren’t gonna buy a 200$ worth of wallets. Moreover Desktop or paper wallet can also be a good and free alternatives to these wallets, and majority of the users use this for it’s flexibility.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rehan Zakir",
      "created_time": "December 04, 2022, 10:11:17 AM",
      "body": "Most of the peoples did not use hardware wallets for storing crypto currencies. The reason behind that they want to earn money from trading, that's why they prefer to keep their funds on Crypto currency exchanges. But, the exchanges are not secure enough to keep millions of dollars on it. Exchanges are centralized. A recent FTX exchange Fraud in the market. Peoples have lost their thousand or even millions of funds on FTX. So, just keep small amount of dollars on exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "December 04, 2022, 10:19:15 AM",
      "body": "Create air-gapped walletsI think if a person does not have money to buy a new and official hardware wallelt, a non custodial wallet like Electrum wallet is good enough to use.You can use Electrum software to create a single signature wallet or a multi signature wallet.If you want to create a cold wallet with Electrum software, you can too.https://bitcoinelectrum.com/creating-a-cold-storage-wallet-in-electrum/They offer a 2FA wallet too but you will have to spend additional fee for your transaction to a company that hosts your 2FA codes. I would not like to use this one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "December 04, 2022, 10:21:40 AM",
      "body": "Quote from: arbiter5 on December 04, 2022, 05:18:48 AMJust purely out of curiosity. 99% of people who don't know how to properly create an airgapped device should be using hardware wallets.Because hardware wallets is expensive to ordinary person so many decide to use wallet which they think safe because they don't also store huge balance on their wallets. The only people need to grab some hardware wallets are those people who can spend millions of dollars since this is so big to be trusted on wallet apps since this maybe could turn them to scam if they see one of their costumer deposit some huge amount of money on their platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "glendall",
      "created_time": "December 04, 2022, 11:08:43 AM",
      "body": "actually the reason people don't use hard wallets is very simple, because their assets are not bigger than the price of those hardware wallets and it's more convenient to use regular wallets offered by platfrom  parties like imtoken , trust and others,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "December 04, 2022, 11:13:53 AM",
      "body": "Quote from: fennic on December 04, 2022, 06:48:23 AM2) hardware wallets are not cheap and they cost some hundred bucks. And low volume users cannot afford to buy these wallets.As you can see it ranges from 150 to 300 dollars and that's the reason mostly people do not know about this.Quote from: Taskford on December 04, 2022, 10:21:40 AMBecause hardware wallets is expensive to ordinary person so many decide to use wallet which they think safe because they don't also store huge balance on their wallets.Guys and girls, don't make me laugh with your comments about HW being too expensive, because that's simply not true. The Nano S Plus costs about $80, and the older Trezor model costs about the same. How much did you pay for your smartphones, TV, computers and other things you use every day?QuotePeople who don't use hardware wallets: Why not?For all the reasons already mentioned, but does it matter at all? Most people do not even understand what Bitcoin is, and investing in something without knowing what exactly it is about is completely wrong. When you build a house, you won't move into it if it doesn't have a roof, if you buy a car, you'll probably first get a driver's license and so on. So the first place should be knowledge, then the application of that knowledge in order to ensure proper storage, and only then investment - unfortunately, many go in the reverse order.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "December 04, 2022, 12:51:24 PM",
      "body": "Quote from: Lucius on December 04, 2022, 11:13:53 AMQuote from: fennic on December 04, 2022, 06:48:23 AM2) hardware wallets are not cheap and they cost some hundred bucks. And low volume users cannot afford to buy these wallets.As you can see it ranges from 150 to 300 dollars and that's the reason mostly people do not know about this.Quote from: Taskford on December 04, 2022, 10:21:40 AMBecause hardware wallets is expensive to ordinary person so many decide to use wallet which they think safe because they don't also store huge balance on their wallets.Guys and girls, don't make me laugh with your comments about HW being too expensive, because that's simply not true. The Nano S Plus costs about $80, and the older Trezor model costs about the same. How much did you pay for your smartphones, TV, computers and other things you use every day?QuotePeople who don't use hardware wallets: Why not?For all the reasons already mentioned, but does it matter at all? Most people do not even understand what Bitcoin is, and investing in something without knowing what exactly it is about is completely wrong. When you build a house, you won't move into it if it doesn't have a roof, if you buy a car, you'll probably first get a driver's license and so on. So the first place should be knowledge, then the application of that knowledge in order to ensure proper storage, and only then investment - unfortunately, many go in the reverse order.The block stream wallet is less then that: https://store.blockstream.com/product/blockstream-jade-hardware-wallet/I am going to go out and say most people don't use them because most people don't know.I had a friend who was into BTC for a while. Bought and sold on Coinbase for a while and pulled out to a local electrum wallet. Did not know about hardware wallets till I dropped a coldcard on his desk and said 'use this' Was partly my fault for not discussing it with him before, but it was just one of those things that although we did talk about crypto a lot the discussion of hardware wallets and security just never came up.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "December 04, 2022, 12:59:42 PM",
      "body": "Quote from: DaveF on December 04, 2022, 12:51:24 PMI am going to go out and say most people don't use them because most people don't know.Problem is that people will not recommend a specific brand because all people prefer different models. Because of that many people dont know which one to get and also there are some scandals like with ledger. Maybe there needs to be a official certificate from the bitcoin foundation for some brands.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "posi",
      "created_time": "December 04, 2022, 01:10:13 PM",
      "body": "The main reason is the cost, to own a hardware wallet, they will have to spend a few hundred dollars to own it. While many investors are new to the market, the bitcoin they hold is not too large, even less than the cost of buying a hardware wallet. Owning a hardware wallet does not mean that your crypto assets will be absolutely safe, what matters most is how you store and use them. Many people are still using software wallets like electrum to store their bitcoins, and they have never had any problems, so there is no reason for them to spend extra money buying hardware wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KaliLinux",
      "created_time": "December 04, 2022, 02:08:01 PM",
      "body": "Quote from: Darker45 on December 04, 2022, 07:16:52 AMIn the same manner that you can also ask, why do people who have Bitcoin don't know anything about Bitcoin? I know of someone who invested money in Bitcoin but doesn't have a clue about what it is. I know of another who has Bitcoin herself but doesn't know what a hardware wallet is. She hasn't even heard of the Lightning Network yet. So if they don't even know what Bitcoin stands for, how surprising it would be to know that they don't have a hardware wallet?From this, we can deduce that most people investing in Bitcoin nowadays are mostly doing so just for the sack of making a profit without even thinking of how to secure their Bitcoins. They only think, let me buy leave it in the exchange and sell it when it gains in price even though there are other means of securing your Bitcoin even if not in a hardware wallet if the cost was the issue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}