{
  "id": "topic_5465881",
  "title": "zasad@",
  "author": "zasad@",
  "created_time": "September 06, 2023, 04:12:11 PM",
  "content": "https://cointelegraph.com/news/uk-crypto-travel-rule-comes-into-effectUK’s Travel Rule comes into effect, could halt certain crypto transfers\"The crypto Travel Rule, which came into effect on Sept. 1, aims to stop money laundering and terrorist financing activities carried out on-chain.Crypto asset businesses in the United Kingdom could now begin withholding certain crypto transfers to comply with the new Travel Rule for crypto that came into effect on Sept. 1.The rules targeting virtual asset service providers were first introduced by the Financial Conduct Authority on Aug. 17, requiring that VASPs based in the U.K. “collect, verify and share information” relating to crypto-asset transfers.If an inbound payment is received from a person or entity from an overseas jurisdiction that hasn’t implemented the Travel Rule, the VASP must make a “risk-based assessment” as to “whether to make the cryptoassets available to the beneficiary.”\"",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465881",
  "comments": [
    {
      "author": "yhiaali3",
      "created_time": "September 09, 2023, 03:11:50 AM",
      "body": "This means, that any incoming transfer to any crypto exchange or service in the UK will have its origin checked in accordance with AML/CFT rules? If this transportation is discovered to be in violation, the travel rule will be applied and the transportation will be blocked.But what legal action will be taken in such a case? Will they just block the transfer without confiscating the crypto assets or will these transferred assets be confiscated?Through the Travel Rule, any transferred crypto assets can simply be blocked on the grounds that they are in violation of the Travel Rule. Centralized exchanges have become a very dangerous place and I expect to see more centralized exchanges leaving for wallets and decentralized exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "September 09, 2023, 09:00:37 AM",
      "body": "Quote from: yhiaali3 on September 09, 2023, 03:11:50 AMThis means, that any incoming transfer to any crypto exchange or service in the UK will have its origin checked in accordance with AML/CFT rules? If this transportation is discovered to be in violation, the travel rule will be applied and the transportation will be blocked.But what legal action will be taken in such a case? Will they just block the transfer without confiscating the crypto assets or will these transferred assets be confiscated?Through the Travel Rule, any transferred crypto assets can simply be blocked on the grounds that they are in violation of the Travel Rule. Centralized exchanges have become a very dangerous place and I expect to see more centralized exchanges leaving for wallets and decentralized exchanges.Exchanges have a compliance procedure for such operations. All operations will be blocked until the crypto exchange receives the necessary information, which will be documented.This gives exchanges even more grounds for blocking various operations, and the court will reject traders’ claims.Beware of crypto exchanges in the UK.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "September 10, 2023, 06:03:33 PM",
      "body": "Well! That was bound to happen! FATF is the governing body of this travel rule and it was suggested back in 2019. It means, UK crypto businesses will now have to follow a very stringent due diligence process to ensure that they are compliant to this travel rule. There's no denying of the fact that cryptocurrency is used for money laundering and now with all these nonsense NFTs, it has become even more easier for the criminals to conduct their activities. Slowly, more countries will start following this measures to ensure that they are compliant with FATF guidelines otherwise FATF has the power to downgrade the rating of a country which may affect the foreign cash flow of that country. However, I just hope that UK crypto businesses will ensure that they are ethical in conducting their business. Otherwise, a lot of genuine transactions might get stuck in the litigations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "September 11, 2023, 02:02:29 PM",
      "body": "This is happening in the post-Brexit UK, but unfortunately the EU is going in the same address. It will take a while yet, but I fear we are heading towards a Big Brother in Bitcoin control, or at least an attempt at it by governments. They want Bitcoin trading to be like stock trading, to have it all under control. What I am curious about is to see if they will appear some countries as safe havens to be able to trade Bitcoin with minimum KYC requirements,  with amounts under certain thresholds exempt from reporting and things like that, apart from El Salvador.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zoomic",
      "created_time": "September 11, 2023, 08:59:51 PM",
      "body": "Quote from: yhiaali3 on September 09, 2023, 03:11:50 AMBut what legal action will be taken in such a case? Will they just block the transfer without confiscating the crypto assets or will these transferred assets be confiscated?Of what essence is it to block the transfer without confiscating the funds when the funds is the major target. Even without targeting the funds, the evidence of defaulting the law is surely the assets, why let it go when the government is in hunt of how to rip people of their crypto assets.Some years back, if we can recall, we actually thought that a day like this will never come. But then, gradually regulation is dominating the crypto space. I fear what the next half decade will have for us all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "September 12, 2023, 01:51:27 AM",
      "body": "Quote from: Poker Player on September 11, 2023, 02:02:29 PMWhat I am curious about is to see if they will appear some countries as safe havens to be able to trade Bitcoin with minimum KYC requirements,  with amounts under certain thresholds exempt from reporting and things like that, apart from El Salvador. Probably the same country that acts as a tax haven. I think it should be expected if you rely on centralized services that you'll need to give your data sooner or later. Giving them to an overseas government probably has a higher risk compared to your local government, especially if you don't have any legal means to take back your money. It is unlikely that your government will help you either unless you hold a lot of power there. People should be prepared to use P2P more in the future if they want to avoid them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "September 12, 2023, 03:06:07 PM",
      "body": "Quote from: joniboini on September 12, 2023, 01:51:27 AMGiving them to an overseas government probably has a higher risk compared to your local government, especially if you don't have any legal means to take back your money.I have not talked about that. We are talking about the fact that in UK and EU governments are going to ask cryptocurrency companies to collect KYC information and provide it to them. What I am saying is that there will be some governments that will not do that, as happens in many cases in the rest of the world. At no time have I talked about you having to provide the information to any government, on the contrary. For example, in the UK if you go to a Bitcoin ATM they will force you to identify yourself with documents to make any transaction but in other countries below certain limits you will be able to do so without providing any document. Therefore, the government will not receive any information from you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "September 13, 2023, 12:15:35 PM",
      "body": "Quote from: Poker Player on September 12, 2023, 03:06:07 PMQuote from: joniboini on September 12, 2023, 01:51:27 AMGiving them to an overseas government probably has a higher risk compared to your local government, especially if you don't have any legal means to take back your money.I have not talked about that. We are talking about the fact that in UK and EU governments are going to ask cryptocurrency companies to collect KYC information and provide it to them. What I am saying is that there will be some governments that will not do that, as happens in many cases in the rest of the world. At no time have I talked about you having to provide the information to any government, on the contrary. For example, in the UK if you go to a Bitcoin ATM they will force you to identify yourself with documents to make any transaction but in other countries below certain limits you will be able to do so without providing any document. Therefore, the government will not receive any information from you. This is not the idea of the UK government, but the FATF norms, which must be observed in all countries that are members of it. The UK was the first, next year most of the crypto companies in Europe who want to operate legally will join these standards and there will no longer be such freedoms in other countries. The simplest option is to make exchanges of 300-500 dollars, so as not to attract unnecessary attention to such transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}