{
  "id": "topic_5423601",
  "title": "UmerIdrees",
  "author": "UmerIdrees",
  "created_time": "November 27, 2022, 05:42:50 AM",
  "content": "I just tried to open FTX again today after that FTX scam drama, and i am disappointed to know that the site is not opening. I knew they have stopped the withdrawals long ago but didn't know that FTX site is no longer accessible.When i open FTX.com, it takes me to this URL https://cases.ra.kroll.com/FTX/ .Does this mean that FTX site is down and they have officially scammed its users? The people funds saved in FTX are gone forever and there is no hope of getting them back",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5423601",
  "comments": [
    {
      "author": "Edwardard",
      "created_time": "November 27, 2022, 06:08:33 AM",
      "body": "Very sorry to hear this, but the truth is all your money is gone and ftx is not going to comeback. Also, it is suggested not to open the ftx website or use their apps as recently there was a trojan/malware case in which they can further hack into your system and look out to steal more btc from your personal wallet on your pc/phone, if any. Please beware!Just follow the ftx official account on twitter for any updates regarding the exchange. But I dont think they are going to make it, sam is gone",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "janggernaut",
      "created_time": "November 27, 2022, 07:15:07 AM",
      "body": "Quote from: UmerIdrees on November 27, 2022, 05:42:50 AMDoes this mean that FTX site is down and they have officially scammed its users? The people funds saved in FTX are gone forever and there is no hope of getting them back  Yes, that's sad part from that. I've seen lot of people put their lifesavings money, their future children money, planning to buy a house money, to FTX because it \"seems\" safe. But if you keep follow the news, you already know if those money is used by them to buy property for their employee, do trading with no stop loss and other illegal things with their customer's money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "November 27, 2022, 08:51:27 AM",
      "body": "Quote from: UmerIdrees on November 27, 2022, 05:42:50 AMWhen i open FTX.com, it takes me to this URL https://cases.ra.kroll.com/FTX/ . FTX has filled for bankruptcy, so they are gone and so is all the crypto found in their wallets. Kroll is a financial company that offers advisory solutions. Google also tells us that this company does debt restructuring and helps in insolvency cases, so that might be the reason why you are getting redirected to them. They could be responsible for the FTX case and dealing with investors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fortunecrypto",
      "created_time": "November 27, 2022, 09:00:47 AM",
      "body": "Quote from: janggernaut on November 27, 2022, 07:15:07 AMQuote from: UmerIdrees on November 27, 2022, 05:42:50 AMDoes this mean that FTX site is down and they have officially scammed its users? The people funds saved in FTX are gone forever and there is no hope of getting them back  Yes, that's sad part from that. I've seen lot of people put their lifesavings money, their future children money, planning to buy a house money, to FTX because it \"seems\" safe. But if you keep follow the news, you already know if those money is used by them to buy property for their employee, do trading with no stop loss and other illegal things with their customer's money. FTX has not only impacted their investors and holders it reverberated to the whole industry latest update is QuoteLender BlockFi and brokerage Genesis have already suspended cash withdrawals by their customers there will still be many victims but the good news is the head of Binance Changpeng Zhao is allocating a total $2 billion to firms and companies affected by the collapse.This is very weird for market experts because Zhao's decision started the beginning of the problem of FTX if he has not sold the $530 million worth of FTT, things still is going to be okQuoteHistory will remember that it was the decision of Zhao and Binance to sell $530 million worth of FTT, the cryptocurrency issued by FTX, which was the beginning of the end for the Bankman-Fried empire. Indeed, after the announcement of this decision on Twitter on November 6, there followed a run on the platform of panicked FTX customers. Five days later, the firm was bankrupt, after Binance had given up on acquiring it two days earlier.Now he wants to be a savior of this collapse by allocating $2 billion to companies and firms that will be affectedMore on this article:FTX Collapse: Binance Stores $2 Billion to Save Struggling Firms",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "November 27, 2022, 09:15:39 AM",
      "body": "Quote from: UmerIdrees on November 27, 2022, 05:42:50 AM....Does this mean that FTX site is down and they have officially scammed its users? The people funds saved in FTX are gone forever and there is no hope of getting them back  this is a well known news, that is also appeared in main stream press, and not only in the specialized one of the crypto sector. what users can hope (a bit like what happened in other cases such as mtgox or cryptopia) is to wait for funds to be identified/seized and hope that they are at least partially returned to users.it's a long process, full of uncertainties, and which will never give back 100% of the investment, but I think it's the only thing you can rely on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "November 27, 2022, 01:00:05 PM",
      "body": "The FTX is the reason why the market is down and many are not putting their money in the market because they want to see the big names in the industries' moves and reactions, what happened to FTX is a domino effect that will have an impact for major and minor players in the industry and those who are against Cryptocurrency will continue to create FUD, Binance and CZ created a buzz by pledging billions of dollars to those who will be affected, the major players should take action the market loss is their big loss, we will hear more about FTX in the coming days and it's not going to end easily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "November 27, 2022, 01:43:09 PM",
      "body": "just remembered the FTX General Counsel's last warning that users were barred from accessing the site because it was hacked. Idk if this redirect is related to that hack as their issue hasn't been fixed yet.From my side the site is completely inaccessible, the FTX ip has been blocked by most of my local internet providers. I think this blocking is government intervention",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasog",
      "created_time": "November 27, 2022, 02:09:53 PM",
      "body": "Quote from: Edwardard on November 27, 2022, 06:08:33 AMVery sorry to hear this, but the truth is all your money is gone and ftx is not going to comeback. Also, it is suggested not to open the ftx website or use their apps as recently there was a trojan/malware case in which they can further hack into your system and look out to steal more btc from your personal wallet on your pc/phone, if any. Please beware!Just follow the ftx official account on twitter for any updates regarding the exchange. But I dont think they are going to make it, sam is gone As soon as, they stopped the withdrawal, it was all over for FTX and i knew that they are not coming back. Later on things developed further, and we heard that exchange was hacked. I also believed that it was a hack done by the insiders or a false news was spread by SAM and his team, but it does not matter, as no matter what happens people funds are not coming back.I feel sorry for those who kept their life having in a FTX exchange when they knew it was a centralized platform and anything could have happened. People trusted SAM the same they trust the CEO of binance, both of them not to be trusted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batang_bitcoin",
      "created_time": "November 27, 2022, 11:11:29 PM",
      "body": "They are done when the issue has already popped and after a few days, they've already filed for bankruptcy. How much you still got there? Sorry for your loss if you've got a significant amount there because it will no longer be retrieved and it's lost forever.Quote from: UmerIdrees on November 27, 2022, 05:42:50 AMDoes this mean that FTX site is down and they have officially scammed its users? The people funds saved in FTX are gone forever and there is no hope of getting them back  Yes and that's what they've done for so long not until they've exposed and just filed for a bankruptcy. There are some speaking engagement for Sam Bankman-Fried and those that might want to have a chance to talk to him can attend that personally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "November 27, 2022, 11:23:50 PMLast edit: November 27, 2022, 11:51:58 PM by stompix",
      "body": "Quote from: UmerIdrees on November 27, 2022, 05:42:50 AMWhen i open FTX.com, it takes me to this URL https://cases.ra.kroll.com/FTX/ .Does this mean that FTX site is down and they have officially scammed its users? The people funds saved in FTX are gone forever and there is no hope of getting them back  The website has been transferred to their appointed claim agent,  it's old news and standard procedure as they have filled already for this in court long agohttps://twitter.com/FTX_Official/status/1593317347703590915The same thing happened to MtGox but in that case, they kept the domain alive and put all the notices on the main page.But I won't share the pessimism of everyone here, it's not really sure that everything is gone, people said that for MtGox also, and look how it turned out, there might be enough funds left to at least cover a few of the losses, probably nothing close to half of it but at least one quarter, maybe!$740 million have been recovered, who knows how much there is still hidden in some walletshttps://fortune.com/2022/11/23/ftx-collapse-assets-customers-crypto-bitcoin-ethereum-solana-bitgo/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CostaLeo",
      "created_time": "November 27, 2022, 11:41:53 PM",
      "body": "Quote from: UmerIdrees on November 27, 2022, 05:42:50 AMI just tried to open FTX again today after that FTX scam drama, and i am disappointed to know that the site is not opening. I knew they have stopped the withdrawals long ago but didn't know that FTX site is no longer accessible.When i open FTX.com, it takes me to this URL https://cases.ra.kroll.com/FTX/ .Does this mean that FTX site is down and they have officially scammed its users? The people funds saved in FTX are gone forever and there is no hope of getting them back  https://i.imgur.com/aJlYPuF.jpgI own a small exchange and I know how this works when you put a centralised payment system in it you generate a credit to the customer and not the currency but a voucher and I don't see a fiat voucher being the solution to cryptoactive exchange I keep wondering how many of these exchange's still have voucher accounts scattered I believe so my friend people have lost their monies I really believe in root exchange from cryptoactive to cryptoactive.And as I've learned here at bitcointalk never store your crypto at an exchange. What I learn from this mistake is to decentralise my exchange and be happy as I don't see any other alternative and outside that I now imagine the siege will close in tighter and tighter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Edwardard",
      "created_time": "November 28, 2022, 01:17:11 AM",
      "body": "Quote from: CostaLeo on November 27, 2022, 11:41:53 PMI own a small exchangeIf you dont mind, may we all know which exchange is that?QuoteWhat I learn from this mistake is to decentralise my exchange and be happyThats nice but is it so easy for a centralized exchange to go fully decentralized? For e.g. Can binance (centralized exchange) turn into dydx (decentralized) whenever they wish to?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "November 28, 2022, 08:45:35 PMLast edit: May 14, 2023, 03:45:32 PM by JeromeTash",
      "body": "Quote from: UmerIdrees on November 27, 2022, 05:42:50 AMI just tried to open FTX again today after that FTX scam drama, and i am disappointed to know that the site is not opening. I knew they have stopped the withdrawals long ago but didn't know that FTX site is no longer accessible.The app too would load a while back. I even deleted it as it was uselessThey have a banner notice at the top of the website. It should be able to explain what's going onQuote from: UmerIdrees on November 27, 2022, 05:42:50 AMDoes this mean that FTX site is down and they have officially scammed its users? The people funds saved in FTX are gone forever and there is no hope of getting them back  They have been misappropriating and scamming user funds for a long time, so the scam was already rolling on even before it was uncovered. The funds are most likely gone forever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}