{
  "id": "topic_5410519",
  "title": "tread93",
  "author": "tread93",
  "created_time": "August 19, 2022, 06:07:25 PMLast edit: August 19, 2022, 06:56:02 PM by tread93",
  "content": "Hey guys, Recently have been contemplating grading a few of my crypto coins w/ ICG, does anyone know if ICG does not grade certain crypto coins or if there is some type of list/catalog of their graded crypto varieties somewhere? If not maybe this would be good to start a reference page for all of these varieties of crypto collectible coins that they have graded. With new auctions ie stacks bowers generating more public awareness of these coins and new collectors joining the fun I'm sure that eventually some of the bigger numismatic coin grading companies like PCGS and NGC will start grading more and more of these coins, not just the Casascius coins. PCGS of course as you all know has started grading some Casascius coins and one sold recently for another record price I believe. Here is a link to the Stacks bowers auction: https://auctions.stacksbowers.com/auctions/3-XS6CZ/the-summer-2022-global-showcase-auction-session-8-rarities-night-featuring-selections-from-the-augustana-mocatta-collections-lots-7001-7310?limit=36&parent_category=3-U5GPQHere is a list of what I plan on sending into them: 2019 1 Mil Bits MoonBit, 2020 .001 funded Alpencoin, 2020 .005 funded Alpencoin, Binary Bull .001 BTC funded Sol Noctis, 2018 Mantis Crypto Bitcoin Penny, 2022 BITMEX ASTROBOTIC 1/1000 coin (This coin may be too big for their holders). Those are for sure ones I definitely want to send in to get graded. Some of the ones I am contemplating if I want to send in or not due to being DIY and Non-funded coins (but still have placed the hologram for the full effect) are the delos DIY coin and the DIY Alpen coins, one of each. Has anyone seen many of these non funded coins that still have the holo on their anyways get graded just for fun? I would grade the Satori coins as well but that just seems silly being completely plastic..... thoughts?  Side note somewhat unrelated but has anyone seen any of the Crypto Notes ie Bitcoin Sussie graded w/ PMG or some other note grading authority? I thought I saw one of those BS notes graded with PMG but can't find the image anywhere now, I thought maybe I saw it somewhere on Btalk....If anyone has any experience grading any of the coins I mentioned above or just grading with ICG in general I would love your input here. Thanks!Best, TREAD",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410519",
  "comments": [
    {
      "author": "MoparMiningLLC",
      "created_time": "August 19, 2022, 06:22:21 PM",
      "body": "it really just comes down to the size of the coin with ICG - someone correct me if I am wrong.They are local here to me and I have sent over 100 coins there (most for other members here) and so far the only coin I have had returned to me were the Slumberjack AZ coins - they were too thick for the slabs.looking at your list of coins, I don't think any of those would be an issue - again someone correct me if I am wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blucepheus",
      "created_time": "August 19, 2022, 06:58:39 PM",
      "body": "QuoteHas anyone seen many of these non funded coins that still have the holo on their anyways get graded just for fun?For sure. I had a beautiful (empty) buyer-funded Lealana graded by ICG.ICG has graded dozens of crypto coins for me over the past two years -- mostly Casascius and Crypto Imperator. The staff are fantastic and very helpful. You can always give them a call if you have any questions, but your best points of contact on the forum would be anonymousminer and minerjones, who both have exceptional relationships with ICG.I sent two redeemed 25 gold Casascius to PCGS, as ICG's slabs cannot accommodate a coin that large. Turnaround time was more significant, but they did a fine job as well.Over time, I think ICG will continue to establish themselves as the world's-foremost grader for crypto collectibles. They are in the lead by a landslide.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChiBitCTy",
      "created_time": "August 20, 2022, 09:07:58 AM",
      "body": "Quote from: blucepheus on August 19, 2022, 06:58:39 PMQuoteHas anyone seen many of these non funded coins that still have the holo on their anyways get graded just for fun?For sure. I had a beautiful (empty) buyer-funded Lealana graded by ICG.ICG has graded dozens of crypto coins for me over the past two years -- mostly Casascius and Crypto Imperator. The staff are fantastic and very helpful. You can always give them a call if you have any questions, but your best points of contact on the forum would be anonymousminer and minerjones, who both have exceptional relationships with ICG.I sent two redeemed 25 gold Casascius to PCGS, as ICG's slabs cannot accommodate a coin that large. Turnaround time was more significant, but they did a fine job as well.Over time, I think ICG will continue to establish themselves as the world's-foremost grader for crypto collectibles. They are in the lead by a landslide.I like ICG to an extent, but they are in the lead by default. ANACS was the only one of the major graders in the US who graded crypto coins for years, and would likely at least split business with ICG if they were still grading these coins.( Still don’t understand why they stopped). Now PCGS seems to be the “premier” crypto coin grader.  Maybe they will start to open up and grade everything crypto coin wise before long, or perhaps already are? If they do, ICG graded coins will shoot way down imo.  ICG needs to improve their slabs. Not only are they limited in size, the way coins are held in them is inferior to PCGS and NGC.  The overall quality of the slabs as well as the labels are also inferior.Although I believe PCGS embellished the grades for some of the first crypto coins they graded for Stacks (as do others) they are still considered the premier coin grader across the globe by a good margin. If I had a nice coin to grade and I had my choice, I’d spend a few more dollars on PCGS as it’ll carry more value for a number of reasons (as stated above), especially to those who are new to crypto coin collecting but not new to coin collecting. Collectors will feel safer/happier with PCGS vs ICG.  Don’t get me wrong I don’t dislike ICG. They are easy to work with, affordable, open minded, etc. @Tread-  if the hologram was put on by the maker, but unfunded, then yes absolutely worth slabbing. But I would never put one on myself and then send for grading/slabbing unless you plan to never sell it. Also- Grading poker chips, satori’s / BTCC chips etc is just silly. Getting them slabbed and authenticated is a different story, however. Tread you should share your convo with the head of NGC when you spoke about grading crypto coins w/them  lol",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "minerjones",
      "created_time": "August 20, 2022, 12:10:40 PM",
      "body": "\"The holder measures approximately 3 1/4 x 2 1/2 x 3/8 inches with slight indentations near the bottom portion of the label.  It holds coins, medals and tokens as large as 40 mm across and 4.5 mm thick.\"https://www.icgcoin.com/home-page/the-icg-sla/Can use this as a guide for what size coins can be graded by ICGCasascius 25 btc and the Bit-Mex Astrobotic coin (from Miami 2022) are about the same size and too large for ICG slabs",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tread93",
      "created_time": "August 22, 2022, 03:15:21 PM",
      "body": "Quote from: ChiBitCTy on August 20, 2022, 09:07:58 AMQuote from: blucepheus on August 19, 2022, 06:58:39 PMQuoteHas anyone seen many of these non funded coins that still have the holo on their anyways get graded just for fun?For sure. I had a beautiful (empty) buyer-funded Lealana graded by ICG.ICG has graded dozens of crypto coins for me over the past two years -- mostly Casascius and Crypto Imperator. The staff are fantastic and very helpful. You can always give them a call if you have any questions, but your best points of contact on the forum would be anonymousminer and minerjones, who both have exceptional relationships with ICG.I sent two redeemed 25 gold Casascius to PCGS, as ICG's slabs cannot accommodate a coin that large. Turnaround time was more significant, but they did a fine job as well.Over time, I think ICG will continue to establish themselves as the world's-foremost grader for crypto collectibles. They are in the lead by a landslide.I like ICG to an extent, but they are in the lead by default. ANACS was the only one of the major graders in the US who graded crypto coins for years, and would likely at least split business with ICG if they were still grading these coins.( Still don’t understand why they stopped). Now PCGS seems to be the “premier” crypto coin grader.  Maybe they will start to open up and grade everything crypto coin wise before long, or perhaps already are? If they do, ICG graded coins will shoot way down imo.  ICG needs to improve their slabs. Not only are they limited in size, the way coins are held in them is inferior to PCGS and NGC.  The overall quality of the slabs as well as the labels are also inferior.Although I believe PCGS embellished the grades for some of the first crypto coins they graded for Stacks (as do others) they are still considered the premier coin grader across the globe by a good margin. If I had a nice coin to grade and I had my choice, I’d spend a few more dollars on PCGS as it’ll carry more value for a number of reasons (as stated above), especially to those who are new to crypto coin collecting but not new to coin collecting. Collectors will feel safer/happier with PCGS vs ICG.  Don’t get me wrong I don’t dislike ICG. They are easy to work with, affordable, open minded, etc. @Tread-  if the hologram was put on by the maker, but unfunded, then yes absolutely worth slabbing. But I would never put one on myself and then send for grading/slabbing unless you plan to never sell it. Also- Grading poker chips, satori’s / BTCC chips etc is just silly. Getting them slabbed and authenticated is a different story, however. Tread you should share your convo with the head of NGC when you spoke about grading crypto coins w/them  lol Haha well not the head of NGC but the person who ran their IG page at the time, it was early 2019 when the Mcdonalds coins were a thing and I made fun of them for grading those and not satori tokens and other crypto coins. At the time they said that they had no plans to grade crypto coins. I'm sure that is going to change in the future though, especially with other grading companies further legitimizing it and breaking auction records. Ngl I may have to authenticate just one satori w/ ICG just to have one of each in a similar slab for display purposes. I hope that PCGS opens up to more of the coins, I'll have to ask around and see if I can figure out if the have some sort of list with all the ones that they would grade (or plan to in the future).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tread93",
      "created_time": "August 22, 2022, 03:15:58 PM",
      "body": "Quote from: minerjones on August 20, 2022, 12:10:40 PM\"The holder measures approximately 3 1/4 x 2 1/2 x 3/8 inches with slight indentations near the bottom portion of the label.  It holds coins, medals and tokens as large as 40 mm across and 4.5 mm thick.\"https://www.icgcoin.com/home-page/the-icg-sla/Can use this as a guide for what size coins can be graded by ICGCasascius 25 btc and the Bit-Mex Astrobotic coin (from Miami 2022) are about the same size and too large for ICG slabsGood to know, thanks for the info Miner!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}