{
  "id": "topic_5409483",
  "title": "vasya_rogov",
  "author": "vasya_rogov",
  "created_time": "August 11, 2022, 11:04:25 AMLast edit: October 23, 2024, 10:41:17 PM by vasya_rogov",
  "content": "https://i.postimg.cc/QCGnxF6T/vasya-rogov1.gifОтрисовка у Васи РоговаМонтаж и редактирование документов различной сложностиПринципы:Индивидуальный подход: Прямое общение с отрисовщиком и постоянная обратная связь.Без следов графических редакторов: Удаление или подмена метаданных (EXIF) изображения.Оплата по факту: Никакой предоплаты — вы платите только за выполненную работу.Особенности:Шаблоны собственного изготовления с разрешением до 1200 dpi.Использование инструментов компьютерной криминалистики (форензики) для анализа.Готовность к сложным и нестандартным заказам, постоянная открытость к сотрудничеству.Опыт работы с векторной и растровой графикой более 3 лет.Бесплатная консультация и система скидок для постоянных и оптовых клиентов.Доверь вопрос профессионалам!Telegram: https://t.me/vasya_rogov1vasya_rogov1Telegram-канал: https://t.me/+uD1LtvmVn1g1YTQy+uD1LtvmVn1g1YTQyПодтверждайте сделки через Форум и используйте Гарант-сервис!Photoshop to Make a Fake ID or Edit DocumentsOur Principles:Personalized Approach: Direct communication with the restorer and ongoing feedback.No Traces of Editing Software: We remove or alter image metadata (EXIF).Payment Upon Completion: No upfront fees—you pay only for the finished work.Key Features:Custom-made templates with resolutions up to 1200 dpi.Use of computer forensic tools for analysis.Readiness to handle complex and non-standard requests, with a constant openness to collaboration.Over 3 years of experience in both vector and raster graphics.Free consultations and a discount system for regular and bulk clients.васярогов вася рогов василий отрисовка отрисовки атрисовка отрисую отрисовать отрисовку отрисовкой отрисовке ортисовка отисовка орисовщик отрисовщика фотошопер рисовка правка правки править редактирование редактировать изготовить изготовим изгатовить изменение создать создание вставка вставки офрмление оформить оформление документов учредительные документы паспорт пасс пас книжка корешок ламисия ламинация ломаницая фото фотообработка фотозамена обработка обработка доработка оптимизация скрины скриншоты скриншот ксерокопии ксерокопия копии копия генератор генератар рандом random данные строки строк данных фотошоп фаташоп иллюстратор илюстратор корел coral coraldraw вектор векторные макеты макет вектар распечатка груз деловые линии мейджор сдек сдэк дипиди боксбери боксберри boxberry avito авито треки трек номер сбер сбербанк sberbank альфа акбарс тинькоф тинькофф tinkoff тиньков хоум скам фейк fake бонусхантинг бонусхантинк вилки договорняки ставки послегол бетка иксы бет365 марафон фонбет иксбет олимп коридоры казино гемблинг гэмблинг криптобиржи криптобиржа букмекерскиеконторы крипт крипто коинлист бинанс битрикс блокчейн блокчеин трейд трейдинг банковские аккаунты акаунты карж телефония авто почта пейпал палка facebook фейсбук vkontakte монобанк моно вконтакте киви qiwi юмани yoomoney опсосы теле2 цупис ростелеком билайн печать шрифты заказшрифтов шрифтыназаказ шривт шрифт сканы сканов скани скана скан дешевое бесплатно бесплатна безплатно халява низкие цены дешево быстро качество качества без предоплат посоплата постоплата неюзаные неюзанные юзаные юзанные платежные платежка системы услуги фотошоп живые дропы живых дропов разводные фотодропы оборудование оборудовании пластик пластике фотомонтаж коррекция коррекции коррекции просвет просветы прасвет востановление исходник исходники исходников восстановление росия россия забугор зарубеж штаты украина белоруссия белорусь канада болгария узбекистан таджикистан киргизия молдова москва Петербург питер юса британья англия сша штаты шаблоны заготовки заготовка шаблон template templates draw 1200dpi сэлфи селфи ракурс ракурсы комплекты видео видеоверификация видеовериф доков отрисовкадокументов экзиф exif коды generator drawing photoshop метаданные мета метки метадата metadata flash kyc кис ву водительское голо голограммы удостоверение удос удосы кинжка книжки права фантики вул внж пмж вадительское дипломы диплом приложение приложения военный билет военый виза визы спо нпо спецы спец учет осаго гимс предписание шенген постановление нотариус нотариальные нотариальный сертификаты сертификат свидетелсьво свидетельство рождении рождения рошдении смерть смерти заключение распоряжение декларация полис омс инн полисомс брака браки смена замена подбор база базы базыданных загс серия номер личныйномер код имени заявление заявления заявлении выписки выписок аттестат атестат аттестаты аттестаты договоры договор сот сотовых оператор операторов операторы детализация детализации доверенности доверенность довереность лицензии лицензия доверки плюш лицензия акт акты госзнак штампы трудовые книжки подписи подпись штамы флеш флэш штампи апостиль домовая книга домоваякнига медкомиссия апостил штемпельная печати типография полиграфия изготовлениепечатей гербы герпы факсимиле фасимиле мвидео чеки товарныйчек чек инвойсы биллинг пейстаб пейролл пэйстаб paystub инвойс invoice оттиск оттиски отиск клише клиш медицинские справки справка несудимость кредиты кредит налог налоги займ займы несудимости накладные накладная квитанции квитанция бланк бланки рецепты рецепт рецептурные счета счет стейт стейты бил билы билл счет счета купюры дубликат купюра банковскаякарта карта карты идентификация идентификации идент вериф верификация анонимность безопасность безопастность верификации кардинг картинг картошка картон карта СНИЛС егрн ОГРН снилс комуналка коммуналка айди corrections notarial certificates database licenses making changing creating insertion registration pass book spine screenshots clearance gaps free freebie low prices cheap fast quality prepayment post-payment payroll paystub invoice receipt form forms recipes prescription duplicate card Statement Driver License Bill electricbill Utility Selfie Selfi residencepermit barcode баркод баркоды pdf417 пдф417 пдф pdf псд psd code128 barcod draw lamination photocopy copies editing edit Coral Coraldraw Vector Mockups Layout Casino Gambling Bookmakers Crypto Stamps Stamp DIN Full Fullz Vehicle occupation insurance Drops Barcodes card Covid штрихкод штрихкоды эмбоссинг embossing passport грин загран загранпаспорт ковид covid тесты тест антитела медоотвод госуслуги фотодропы дропы дроп фотодроп дизайн дизайнерскиеуслуги графика Design Graphics дизайнер художник худ аватар аватарки оформление темы каналов каналы канал группы групп топиков топики объявления объявы акции скидки акция скидка призы топик сайты сайт баннеры баннер реклама рекламы боты логотип логотипы шапки подвал логотипов мессенджеры мессенджер месенджер мессенджеров визитка визитки заставки заставка прайсы прайс стикеры стикер лендинг лэндинг одностраничка одностраничники ленденги landing page страница гиф gif дизайн сайтов афиша афишы наклейка наклейки буклеты буклет флаера флаер упаковка упаковки макет макеты сайт сайты моушн мобильные приложения приложении приложениев UX/UI анимация анимации соцсети ветки социальные продвижение продвижения графический дизайн скрипт скритпы скрипты скриптов видео монтаж видеомонтаж видеоролики теневые шопы бренд брендирование приложения интерфейс интерфейсы интернет магазин портал порталы блоги блог постер постеры бизнес проекты проект",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409483",
  "comments": [
    {
      "author": "Xal0lex",
      "created_time": "August 11, 2022, 11:08:37 AM",
      "body": "Криптовалюту в качестве оплаты принимаете? И какую, если принимаете?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vasya_rogov",
      "created_time": "August 11, 2022, 11:12:34 AMLast edit: February 12, 2023, 11:46:03 AM by Xal0lex",
      "body": "Quote from: Xal0lex on August 11, 2022, 11:08:37 AMКриптовалюту в качестве оплаты принимаете? И какую, если принимаете?Изображение топика почему-то не отобразилось полностью, а лишь ссылкой. Там есть информация об этом.Принимаем BTC, USDT, LTC Примеры работhttps://postimg.cc/gallery/zfSBZxvОтзывыhttps://postimg.cc/gallery/cvCXw0x",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "August 11, 2022, 11:21:33 AMLast edit: February 12, 2023, 11:46:33 AM by Xal0lex",
      "body": "Потому что картинки у новичков не отображаются. Вам нужно достигнуть ранга Jr. Member или приобрести дополнительный ранг Copper Member.Подробнее можете прочитать здесь Система рангов на bitcointalk.org и здесь Дополнительный ранг Copper Member для новичков.А заодно вам нужно ознакомиться с правилами форума, та как вы пол-часа на форуме, а уже успели нарушить два правила  Ознакомьтесь Неофициальный список официальных правил",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klarki",
      "created_time": "August 14, 2022, 10:10:02 PM",
      "body": "vasya_rogov, какую-то ответственность несете, если биржа/сервис завернет вашу отрисовку? Список форумов, где вы прошли проверку безусловно круто, но хотелось бы гарантий, что ваша отрисовка не запорет акк.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vasya_rogov",
      "created_time": "August 15, 2022, 12:19:09 PM",
      "body": "Quote from: klarki on August 14, 2022, 10:10:02 PMvasya_rogov, какую-то ответственность несете, если биржа/сервис завернет вашу отрисовку? Список форумов, где вы прошли проверку безусловно круто, но хотелось бы гарантий, что ваша отрисовка не запорет акк. Здравствуйте. 100% гарантировать проходимость отрисовки невозможноПримеры работ https://t.me/vasya_rogov2/132Анализируем отрисовки на однородность компрессии и шумов на изображении, чтобы повысить % проходимости Подробнее https://t.me/vasya_rogov2/110Оплата по факту успешного результатаОбратитесь в телеграм, обсудим все нюансы",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vasya_rogov",
      "created_time": "August 17, 2022, 03:20:02 PMLast edit: August 26, 2022, 09:24:23 AM by vasya_rogov",
      "body": "Quote from: Excimer on August 17, 2022, 01:58:43 PMQuote from: klarki on August 14, 2022, 10:10:02 PMvasya_rogov, какую-то ответственность несете, если биржа/сервис завернет вашу отрисовку? Список форумов, где вы прошли проверку безусловно круто, но хотелось бы гарантий, что ваша отрисовка не запорет акк. Quote from: vasya_rogov on August 15, 2022, 12:19:09 PMОбратитесь в телеграм, обсудим все нюансыКороче никакой ответсвенности Васян не несетНесу ответственность за свой сервис и качество своих работ",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vasya_rogov",
      "created_time": "September 27, 2022, 12:46:11 PM",
      "body": "• Телеграм-канал vasya_rogov2 с нашим портфолио, выполненными заказами и отзывами был удален и больше не доступен!• Телеграм для связи по прежнему vasya_rogov1 (есть фейки, обращайте внимание на звездочку в профиле)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xandry",
      "created_time": "September 27, 2022, 01:39:42 PM",
      "body": "Quote from: vasya_rogov on September 27, 2022, 12:46:11 PM• Телеграм-канал vasya_rogov2 с нашим портфолио, выполненными заказами и отзывами был удален и больше не доступен!• Телеграм для связи по прежнему vasya_rogov1 (есть фейки, обращайте внимание на звездочку в профиле)Удалили то по какой причине? Может ещё какую-нибудь площадку стоит иметь для отзывов и портфолио? Портфолио, например, на не модерируемом файлохранилище типа storj, отзывы к нам можете направлять оставлять - у нас тут конфиденциальность тоже ценят.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vasya_rogov",
      "created_time": "October 04, 2022, 12:09:46 PM",
      "body": "Quote from: xandry on September 27, 2022, 01:39:42 PMQuote from: vasya_rogov on September 27, 2022, 12:46:11 PM• Телеграм-канал vasya_rogov2 с нашим портфолио, выполненными заказами и отзывами был удален и больше не доступен!• Телеграм для связи по прежнему vasya_rogov1 (есть фейки, обращайте внимание на звездочку в профиле)Удалили то по какой причине? Может ещё какую-нибудь площадку стоит иметь для отзывов и портфолио? Портфолио, например, на не модерируемом файлохранилище типа storj, отзывы к нам можете направлять оставлять - у нас тут конфиденциальность тоже ценят.Паблик канал исчез бесследно, возможно из-за жалоб конкурентовСоздадим новый приват канал и опубликуем пост об этомБлагодарю за совет, скорее всего так и будем делать",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vasya_rogov",
      "created_time": "February 27, 2023, 08:42:53 PMLast edit: March 16, 2023, 03:32:22 PM by vasya_rogov",
      "body": "https://i.postimg.cc/cH2xzZbp/vasya-rogov1.jpghttps://i.postimg.cc/FFksLdfN/vasya-rogov1-2.jpgВыполненный заказ",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vasya_rogov",
      "created_time": "March 06, 2023, 09:12:23 AMLast edit: June 12, 2023, 02:19:20 PM by vasya_rogov",
      "body": "https://i.postimg.cc/bv9d7VPM/t-me-vasya-rogov1.jpghttps://i.postimg.cc/bvhsFc7k/t-me-vasya-rogov1.jpgПример изготовления шаблона ID-карты ВеликобританииЦветокоррекция и восстановление текстур",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vasya_rogov",
      "created_time": "March 16, 2023, 03:31:58 PM",
      "body": "Отзывы на соседних бордахhttps://i.postimg.cc/rwWMWkcx/vasya-rogov1-deepweb.jpghttps://i.postimg.cc/zfFNtFyf/vasya-rogov1-legalizer.jpghttps://i.postimg.cc/hGBg15Pw/vasya-rogov1-v80team.jpg",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vasya_rogov",
      "created_time": "April 24, 2023, 08:32:26 AMLast edit: June 12, 2023, 02:15:50 PM by vasya_rogov",
      "body": "https://i.postimg.cc/J0x5qzGz/t-me-vasya-rogov.jpgОткрыть вложениеВыполненный заказ Поэтапная отрисовка документа на просвет на примере паспорта УзбекистанаВосстановлена вся защитная сеткаПравильная цветокоррекция и светотень",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Excimer",
      "created_time": "May 22, 2023, 01:27:48 PM",
      "body": "четкий сервисклассно рисуете",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vasya_rogov",
      "created_time": "May 25, 2023, 11:55:00 AMLast edit: October 14, 2024, 12:22:37 PM by vasya_rogov",
      "body": "Quote from: Excimer on May 22, 2023, 01:27:48 PMчеткий сервисклассно рисуетеБлагодарю!Приглашаем Вас посетить наш телеграм-канал, где мы публикуем статьи, отзывы клиентов и выполненные заказы+uD1LtvmVn1g1YTQy",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vasya_rogov",
      "created_time": "June 12, 2023, 02:13:50 PM",
      "body": "https://i.postimg.cc/RSdzqmDp/t-me-vasya-rogov1.jpghttps://i.postimg.cc/2j5NZJpk/t-me-vasya-rogov1.jpgОтзывы на соседних площадках",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vasya_rogov",
      "created_time": "August 01, 2023, 11:14:24 AM",
      "body": "https://i.postimg.cc/XYhVs02q/t-me-vasya-rogov1.jpghttps://i.postimg.cc/QMTjPnPb/t-me-vasya-rogov1.jpghttps://i.postimg.cc/W1tNm4wx/t-me-vasya-rogov1.jpgПример отрисовки селфи под вывод средств",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vasya_rogov",
      "created_time": "April 16, 2024, 09:04:36 AM",
      "body": "https://i.postimg.cc/hj6tGhdT/1.jpghttps://i.postimg.cc/SNFd3rv7/2.jpghttps://i.postimg.cc/4yZKbmWt/3.jpghttps://i.postimg.cc/1tMS2X9D/4.jpghttps://i.postimg.cc/vZMsY5c5/5.jpghttps://i.postimg.cc/xd4hzmTx/6.jpghttps://i.postimg.cc/c4Bzc2L8/7.jpghttps://i.postimg.cc/s2qHXRwb/8.jpghttps://i.postimg.cc/s2QKbNsm/9.jpghttps://i.postimg.cc/vZm0tmKp/10.jpghttps://i.postimg.cc/jqQvVN0p/11.jpghttps://i.postimg.cc/nhcnKvpp/12.jpgОтзывы на форумах",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vasya_rogov",
      "created_time": "March 03, 2025, 12:48:22 PM",
      "body": "https://i.postimg.cc/d3QCR7Kz/vasya-rogov1.gifОтрисовка документов требует компетентности и внимания к деталям!Мы поможем:Пройти верификациюВывести средстваНайти простые решения сложных задачTelegram: vasya_rogov1Telegram-канал: +uD1LtvmVn1g1YTQy",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}