{
  "id": "topic_5456105",
  "title": "Jet Cash",
  "author": "Jet Cash",
  "created_time": "June 12, 2023, 07:35:59 AM",
  "content": "I thought there was a global panic over egg supplies. Not so long ago they were rationing sales. This morning I bought some boxes of 6 big and fresh eggs for just 21 pence. The normal price is £1.40. It just shows how food prices and distribution is being manipulated to rip us off. That is if we aren't aware and exploiting the situation for our own benefit. The eggs were on sale at a m ajor Asda supermarket in Hampshire, England.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456105",
  "comments": [
    {
      "author": "un_rank",
      "created_time": "June 12, 2023, 07:56:28 AM",
      "body": "I do not think it was a global issue and for the most parts it is alleged that the big retail companies were gouging prices due to all the talk about shortages and possibly they were exaggerating the effect.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartGold01",
      "created_time": "June 12, 2023, 08:58:57 AM",
      "body": "Looking deep into what you said seems to be true the rate at which the price of eggs suddenly increase in State is something one should suspect of being a Global shortage. It was normally $0.093 (NGN 70) per egg and a crate of eggs was around $2.8 (NGN 2,100) in a medium size eggs while larger size was around $3.1 (NGN 2,356) as of last year, getting to this year the price has suddenly increased to 30 percent, where a piece of $0.13 (NGN 100). I was like could it be that the request for chicken is much in a way that leads to the increase of the price?All price above is converted to dollars with a current price of NGN 760 = $1, this is to show food prices are increasing every single months and year also by the next 2 years to come we may likely see a crate of egg at the rate of $5.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "June 12, 2023, 09:13:28 AM",
      "body": "Quote from: Jet Cash on June 12, 2023, 07:35:59 AMI thought there was a global panic over egg supplies. Not so long ago they were rationing sales. This morning I bought some boxes of 6 big and fresh eggs for just 21 pence. The normal price is £1.40. It just shows how food prices and distribution is being manipulated to rip us off. That is if we aren't aware and exploiting the situation for our own benefit. The eggs were on sale at a m ajor Asda supermarket in Hampshire, England.Who is ripping you off? Is it not the same country where you got the notion of an inflated commodity that you bought the same eggs? Well, you should know that countries' economy is dynamic, what you bought cheaply today might not be so the next day, and vice versa. It's you that should be conversant with the market reality and also consider the location. Locations have different prices, and you might need to ascertain if you are buying at a wholesale outlet or from a retailer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "June 12, 2023, 11:24:00 AM",
      "body": "Quote from: Jet Cash on June 12, 2023, 07:35:59 AMI thought there was a global panic over egg supplies. Not so long ago they were rationing sales. There is always a sales manipulation of the price of consumable goods since those goods' prices are not regulated, and I actually don't think the panic price increase of eggs has anything to do with demand or supply; all I see is a group of sellers trying to make more money from their sales. Layers have nothing to do with the economy aside from their feed price increase.Here in my country, the price is always changing; there's no fixed price; it always varies based on the shop you visit to get them, and they are sold out based on the size, which wasn't so before. I think it's just business as usual for egg sellers since every other good is topping something in price; they don't just want to be left behind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "June 12, 2023, 12:42:09 PM",
      "body": "It's hard to say because that sounds like a very domestic situation not a global one. Not to mention just because you bought some eggs one time and on sale that doesn't mean there are no problems. I did some quick search and considering the official UK stats are talking about a 24.6% reduction in production of eggs compared to last year, it is understandable to expect some shortage.But also we should consider other factors including the ongoing cost of living crisis in UK, decreased income, unemployment and increased price of everything from energy and rent to food. These things have affected the the demand for eggs (and basically everything else) which means decreased demand that could potentially negate the ~25% drop in production and solve the shortage problem.Quote from: Jet Cash on June 12, 2023, 07:35:59 AMThis morning I bought some boxes of 6 big and fresh eggs for just 21 pence. The normal price is £1.40.The eggs were on sale at a major Asda supermarket in Hampshire, England.Are you sure they were fresh? Place them in water, they should not float to surface. Also check their production date, when the products are close to expiration date these big super markets practically give them for free.Unless I'm missing something the price on their website shows a price of about £1.50 for 6 \"medium\" eggs and £2.5 for organic ones.https://groceries.asda.com/product/free-range-eggs/asda-6-medium-free-range-eggs/20511https://groceries.asda.com/product/organic-eggs/asda-organic-free-range-6-mixed-eggs/910000053377",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "June 12, 2023, 12:43:13 PM",
      "body": "Quote from: Jet Cash on June 12, 2023, 07:35:59 AMI thought there was a global panic over egg supplies. Not so long ago they were rationing sales. This morning I bought some boxes of 6 big and fresh eggs for just 21 pence. The normal price is £1.40. It just shows how food prices and distribution is being manipulated to rip us off. That is if we aren't aware and exploiting the situation for our own benefit. The eggs were on sale at a m ajor Asda supermarket in Hampshire, England.I guess it depends where you're living. If there's a shortage in your area then that's for sure will make the price higher. AFAIK, when the war of Russia and Ukraine has started it was like a domino effect coming from grains, flour and other ingredients and then almost everything went up. I also started to feel that the eggs can't skip that effect because it has increased a few cents where I am buying that. It's doubled the amount from how much I was buying it before but then it was just cents.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "June 12, 2023, 01:11:37 PM",
      "body": "Quote from: Jet Cash on June 12, 2023, 07:35:59 AMI thought there was a global panic over egg supplies.  There's no panic about egg supply in my country. The price of eggs have gone up but it is still readily available for you to buy whenever you need it simply because so many people are involved in the agricultural practice of rearing poultry birds. It is easy to understand why the price of the eggs have gone up and it is because the price of poultry feed and transportation has also increased.  The egg shortage was due toQuote food shortages, rising energy costs, and bird flu  (https://www.standard.co.uk/news/uk/egg-shortage-supermarkets-bird-flu-cost-of-living-b1040104.html)Rising energy cost will affect many farmers in the UK because they depend on it. Farmers in my country may not even be connected to any electricity grid, but have local methods of running a poultry farm effectively.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "June 12, 2023, 01:30:55 PM",
      "body": "In this recent world order, every country has their poultry to produce egg so what has happened was not a global issue but a National Inflation. Like my country a crate or a dozen of eggs (12 eghs) was sold $1 as of 2000 to 2020 but suddenly from 2021 till a dozen of eggs is sold $4 and above. Egg which was bought by the lower class is no longer the lower class food again. It is now meant for the middle class and above. The inflation is touching everything and everywhere in the globe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "June 12, 2023, 01:57:11 PM",
      "body": "Hoarding issues and monopoly I guess. Also, it would be impossible to have a global shortage with eggs, it is more likely to happen in a city or country but not as wide as global. Hoarding issue happens to many marketable goods. Inflation on tbe other hand is a different story wherein it affects majority of the world market concerning market prices. Based on what I have observed, if it is shortage with agricultural products then it would only last for a month or more, but if it is with minerals then that would be for a long period of time. This is because of resources wherein agricultural products can be 'cultured', which is a reason for us to not panic in some instances.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "June 12, 2023, 02:03:03 PM",
      "body": "Quote from: Jet Cash on June 12, 2023, 07:35:59 AMI thought there was a global panic over egg supplies. Not so long ago they were rationing sales. This morning I bought some boxes of 6 big and fresh eggs for just 21 pence. The normal price is £1.40. It just shows how food prices and distribution is being manipulated to rip us off. That is if we aren't aware and exploiting the situation for our own benefit. The eggs were on sale at a m ajor Asda supermarket in Hampshire, England.It costs me 1,89 € to buy six egg in Germany, in Bavaria. I workout and when I'm bulking, I have to eat tons of eggs, chicken breast, fish and it's very expensive experience, especially after the start of war between Russia and Ukraine.Btw I thought that prices in the UK were far worse than in Germany, at least that's what I hear all the time since Brexit and Russia-Ukraine war.@stompix you are an expert in Europe-related tasks, how are the prices in your country?By the way you can't imagine how cheap things are in Turkey. I was there recently and while there is a huge inflation, product prices aren't increased that much, for 10 Euro I was able to buy tons of food, I'm really shocked.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinTurk",
      "created_time": "June 12, 2023, 02:13:41 PM",
      "body": "Usually the price of a product rises when there is a shortage of production, increase in demand or after production costs are affected by inflation. Especially since I live in a country that consumes a lot of eggs I can easily say that there is no shortage of eggs at the moment because there has not been any decrease in egg stocks in the markets. In addition, there was no decrease in the meal or dessert options made with the use of eggs. For this reason, it is necessary to consider the possibility that the egg shortage you mentioned may be due to the location you live in or that the prices may have changed due to the inflation problem which has become a serious problem in nowadays. Finally, I would like to add that apart from my own observations I have not see across an article or news stating that there is an egg shortage problem that has affected the whole world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MoonOfLife",
      "created_time": "June 12, 2023, 02:23:50 PM",
      "body": "Quote from: Agbe on June 12, 2023, 01:30:55 PMIn this recent world order, every country has their poultry to produce egg so what has happened was not a global issue but a National Inflation. Like my country a crate or a dozen of eggs (12 eghs) was sold $1 as of 2000 to 2020 but suddenly from 2021 till a dozen of eggs is sold $4 and above. Egg which was bought by the lower class is no longer the lower class food again. It is now meant for the middle class and above. The inflation is touching everything and everywhere in the globe.Based on the rising egg prices alone, have you hastily concluded that inflation is increasing and affecting everything in the world? LOL.In my country, eggs are still very cheap, and their price has not increased, so how do you explain this? My country does not have inflation? Why don't you try to think of some supply issues, and this is only temporary? Don't talk about inflation all day when you know nothing about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "June 12, 2023, 02:47:36 PM",
      "body": "Quote from: Jet Cash on June 12, 2023, 07:35:59 AMI thought there was a global panic over egg supplies. Not so long ago they were rationing sales. This morning I bought some boxes of 6 big and fresh eggs for just 21 pence. The normal price is £1.40. It just shows how food prices and distribution is being manipulated to rip us off. That is if we aren't aware and exploiting the situation for our own benefit. The eggs were on sale at a m ajor Asda supermarket in Hampshire, England.I don't think that the issue was global because in many places the egg prices even dropped rather than increasing. The supplies have been increased because many people started farming of layer chicken which lay enough eggs to meet the demand of the residents of a location. In my place the price of 1 dozen eggs is around $1 and it hasn't increased at all even in many years when we compare it in dollars, but when we compare the prices in local currency then the prices have been increased more than 20% - 30%  during past 3-4 years.The egg prices are mainly increased due to feed prices and when the price for 1kg feed increases so does the price of eggs. Most of the farms are doing the business on commercial level and that's why they have to outsource the feed from other sellers who sometimes increase their feed prices because of geed, and when feed prices go higher and no one is willing to sell it for low price. The ones who run those layer farms are mostly influenced by feed prices and if there is issue with feed supplies then in that case egg prices also increase so the farmers could earn profit from selling the eggs. In some cases the utility stores increase egg prices because of greed only and the consumers have to pay some extra money because of those greedy fellows.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "June 12, 2023, 02:47:39 PM",
      "body": "Quote from: Nwada001 on June 12, 2023, 11:24:00 AMThere is always a sales manipulation of the price of consumable goods since those goods' prices are not regulated, and I actually don't think the panic price increase of eggs has anything to do with demand or supply; all I see is a group of sellers trying to make more money from their sales. Layers have nothing to do with the economy aside from their feed price increase.I think the feed price increase you actually mention is why they have increased the amount per each egg. Although when things go up everyone just wants to increase the price of there goods but this egg price increase Isn’t just done because of these. The layers you see are actually heavy consumers of their feed and since last there has been excessive increase of feed bought by the poultry farmers. The feed price has increased to almost 3x its normal price and not to talk about the increase in the cost of there vaccines too. So it is logical that for the farmers to increase the price for the egg just to gain ground on the profit level. Although I would say there is also manipulation of price because the number of farmers has decreased due to cost of feed and vaccines and also the period we are in now. It is mostly raining here now and many of these birds do not survive under this weather conditions and some farmers that can’t take the risk just bow out of rearing at this period of time and that gives the current farmers the opportunity to manipulate the price since it is not that high in supply. Another thing that could affect it again is the fact that not all countries actually produce there feeds so for the locals that have the feeds produced there they tend to get it at a lower cost than those import them. Because the fiat inflation will actually affect the price along the way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "summonerrk",
      "created_time": "June 12, 2023, 03:14:46 PM",
      "body": "Quote from: Jet Cash on June 12, 2023, 07:35:59 AMI thought there was a global panic over egg supplies. Not so long ago they were rationing sales. This morning I bought some boxes of 6 big and fresh eggs for just 21 pence. The normal price is £1.40. It just shows how food prices and distribution is being manipulated to rip us off. That is if we aren't aware and exploiting the situation for our own benefit. The eggs were on sale at a m ajor Asda supermarket in Hampshire, England.And I have often seen how, in times of panic, prices for buckwheat or rice begin to rise. At the same time, ordinary buyers themselves create panic, and unscrupulous sellers try to make a profit out of it. Such phenomena as correctly last a short period of time. And you need to be able to survive them. In the above case, I ate only pasta and bulgur, knowing that the prices of other cereals will fall to the previous levels. And so it happened. Another favorite product of sellers for manipulation is sugar and salt. People panic very easily when it comes to this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "June 12, 2023, 04:31:07 PM",
      "body": "Quote from: Synchronice on June 12, 2023, 02:03:03 PMBy the way you can't imagine how cheap things are in Turkey. I was there recently and while there is a huge inflation, product prices aren't increased that much, for 10 Euro I was able to buy tons of food, I'm really shocked. When there is high inflation (100%+) price of everything goes up including food. You can see some of the food inflation rates here (not completely accurate though, it is reporting them higher than reality):https://tradingeconomics.com/turkey/food-inflationGenerally speaking in periods like this (past 3-4 years that Lira is tanking hard) the governments don't let the food price go up as quickly as their fiat currency tanks. So when you exchange your 10 Euro to ~253 TL you end up being able to purchase more food in Turkey than you could in Europe.There is also the fact that there was an election in Turkey and in the recent months leading to this presidential election the president in office artificially kept the inflation and prices low to keep people happy and get their votes for himself!After the election however, the price of food jumped between 15% to 25% in matter of days. The election was about 18 days ago!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "June 12, 2023, 04:54:35 PM",
      "body": "It depends on what the problem is in your country or where you live and it happens due to several factors. In my place there is no shortage of eggs, but the price of eggs is very high and the price of 1 kilo of eggs is almost the same as the price of 1 chicken and that is because the demand for chicken eggs this year is much higher than the previous year, and that is one of the reasons for the increase in egg prices.This year the demand for eggs is higher than last year, also because there are not many production factors, but the demand is high. Supply and demand are out of balance, resulting in high prices.Eggs are a very important staple and regardless of the price, people will still buy them. But if chicken eggs are rare, then you have to investigate what are the causative factors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "June 12, 2023, 06:20:33 PM",
      "body": "Here in our country, 30 pcs of eggs is equivalent to 3$, this is the smallest size in our country, and the largest size is around 5$ for 30 pcs of eggs. If there is something called egg hoarding, I don't think anything like that happens in my country. And if there is maybe some control or manipulation of them, I think it's normal in the market. Because we are part of the business industry. And I don't see neither heard any news that there is a shortage here in our eggs, so far none.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "June 12, 2023, 06:35:17 PM",
      "body": "Quote from: Jet Cash on June 12, 2023, 07:35:59 AMI thought there was a global panic over egg supplies.I can't tell about UK, but here there was at some point an attempt to panic people with stories about the rising prices of electricity and gas that will make everything overly expensive.Just those prices did stabilize even before the winter has ended and afterwards the overly cheap grains from Ukraine flooding all the European markets made a lot of agriculture related products' prices fall fast.I will add that in my country I noticed (in a few different years, including this one) that around Easter (+/- a few weeks) there's a tendency to have over-production of eggs.I guess that there were many things that made the price of eggs go much lower (although your 21p is lower than I would have expected), including somewhat better supply chains from cheaper countries (PL, RO) towards the UK.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}