{
  "id": "topic_5419153",
  "title": "Crypt0Gore",
  "author": "Crypt0Gore",
  "created_time": "November 02, 2022, 08:36:20 AM",
  "content": "Is it possible that all those crypto influencers we know and hear stuffs about could face market manipulation charges under new regulation law that's coming? ...Is there popular word ' Not a Financial Advice' not enough to safe them from what's coming? Since they warned people about doing their own research too, isn't this enough to break them free?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5419153",
  "comments": [
    {
      "author": "NeuroticFish",
      "created_time": "November 02, 2022, 08:45:12 AM",
      "body": "Quote from: Crypt0Gore on November 02, 2022, 08:36:20 AMIs it possible that all those crypto influencers we know and hear stuffs about could face market manipulation charges under new regulation law that's coming? ...Is there popular word ' Not a Financial Advice' not enough to safe them from what's coming? Since they warned people about doing their own research too, isn't this enough to break them free? I don't know the new regulations, but I had the same kind of question when Kim Kardashian was fined.And I've got my answer for that case: no matter she said \"not a financial advice\", she should also have been stating that she was shilling because she was paid to do so.See the answer here: https://bitcointalk.org/index.php?topic=5415840.msg61066113#msg61066113And crypto influencers may indeed have the same fate because I expect many of them are paid to advertise this or that project now and then.So the NFA part is sometimes not enough, by the law.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "November 02, 2022, 09:53:16 AM",
      "body": "Quote from: Crypt0Gore on November 02, 2022, 08:36:20 AM<…>I suspect there may be closer looks into what and how they promote, though each country will proceed according to it’s own regulation, and that is not homogeneous.To provide an example, Spain was pretty laxed on the matter of publicity and influencers, until it suddenly determined to take a tougher approach: It now requires cypto related publicity to play by a given ruleset, with a mandatory pre-communication of the campaign for those aiming at over 100K potential viewers of the campaign. This is allegedly due to EU requirements, and thus, being so, I’d expect to see something alike spreading around the EU soon.Just last week, the CNMV, who is in charge of implementing an pursuing the above, indicated that it had detected a group of around 50 influencers that do not seem to comply with the rules when promoting or providing cripo advice (theoretically, they need to know what they’re on about, be objective, expose any conflicts of interests, and so forth). DYOR or alike is not a valid clause to exempt them from needing to comply and be scrutinized by the CNMV (in Spain). This is fairly new though, so we’ve yet to see how it plays out in practice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "November 02, 2022, 09:59:35 AM",
      "body": "Quote from: Crypt0Gore on November 02, 2022, 08:36:20 AMIs there popular word ' Not a Financial Advice' not enough to safe them from what's coming? Usually when there is a statement like this maybe an influencer is either paid for promotions or have bags on it when it still low. Im not really sure about regulation about that but NeuroticFish gave an example so I guess same also for those influencers. The thing is majority of them are anon, unlike Kim Kardashan, that is a high profile influencer. It will take time if theres a proven guilty of promoting scams.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "November 02, 2022, 11:45:40 AM",
      "body": "QuoteIs this not shilling but information sharing? Don't be naive and ask such a question, because do you really think that most people spend their precious time to share any useful information, without having any personal (financial) interest in it all? When it comes to cryptocurrencies, I am absolutely in favor of bringing some order to all the chaos that reigns on social networks. Promoting various crypto projects has become a lucrative business, but it results in great financial losses for many people and all those who participate in it should be held accountable for their actions.\"It is not financial advice\" cannot be enough, nor can it release them from responsibility for what they say and write. I am not against freedom of expression, but I am in favor of seriously dealing with all these scammers at all levels, which result in billions of dollars/euros in damage every year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "November 02, 2022, 12:18:08 PM",
      "body": "Quote from: Crypt0Gore on November 02, 2022, 08:36:20 AMIs it possible that all those crypto influencers we know and hear stuffs about could face market manipulation charges under new regulation law that's coming? ...Everyone knows the fact that Elon Musk is regularly engaged in shilling dogecoin coins, but I think it will be impossible to bring him to justice. Since they never openly called for the purchase of Doge, and everyone could interpret his publication of the photo in their own way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lordsilvabtc",
      "created_time": "November 02, 2022, 12:26:47 PMLast edit: November 02, 2022, 01:02:23 PM by Lordsilvabtc",
      "body": "Well I read about this news as well, And to be honest with you, I really don't think this would have a greater effects on those influencers, looking at their mode of operandi, you will discover that they made mentioned that at your discretion, Do your own research which is the best advice, anyone can ever give in the crypto world, Secondly every Content can be defined or explained differently, Take a look at Elon Musk shilling DogeCoin, watch he's choice of words, you will discovered that they're always very very constructive, beside with he's groundbreaking records, there's no way you can bring such an iconic man to Justice, Because he's method of shilling is simply unique and imaginable as he's own thoughts. So shilling with different explaination, I expect all influencers to come out victoriously on this. But we're to see the ruglatiom, The points and element which might incurred any sanctions",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "November 02, 2022, 12:39:31 PM",
      "body": "They might just move country too to somewhere with less regulations. There's enough places for most countries where people can set up businesses off shore and still return back if they ever needed to but don't infringe on laws by only making content on an explicit side of a border. There's enough influencers that seem to enjoy travelling anyway.A lot of influencers might also be hard to find or hard to prove they've broken laws. I imagine some participate in pump and dump schemes and find other ways to be paid (perhaps they know the coin won't do well and short the dump, maybe they buy in before making their post and sell at a fixed rate profit - like 10%).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "November 02, 2022, 01:01:15 PM",
      "body": "First of all, imo i think people should do their own research and not just invest in a project because one of their favorite celebrity thinks it is a good project, or because one influencer has good things to say about the project, people should be responsible for their actions, it is their money and they should be careful with what they invest it in.Having said that, some of this shillers/influencers know nothing about the projects they are promoting, they themselves haven't invested even a cent in them and they never directly tell anyone to buy them, they are just paid to say whatsoever good thing they say about the project, it is unethical, but to be fair some of them don't even know if the project will succeed or not, for instance if the project succeeds then no eyebrows will be raised.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "November 02, 2022, 10:07:47 PM",
      "body": "Sharing something or promoting something won't be financial advice at all. Everyone should take their own decisions when it's a matter of money. Influencers mean they will influence you to invest, but for safety reasons, they mention about not financial advice. This means you are the one who has to take the risk of your investment. It's basic things in crypto do your own research. If you make a profit it's yours, if you lost then it's yours as well. Don't trust anyone suddenly after seeing the video or whatever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "November 03, 2022, 12:59:44 AM",
      "body": "Quote from: Crypt0Gore on November 02, 2022, 08:36:20 AMIs it possible that all those crypto influencers we know and hear stuffs about could face market manipulation charges under new regulation law that's coming? ...Is there popular word ' Not a Financial Advice' not enough to safe them from what's coming? Since they warned people about doing their own research too, isn't this enough to break them free? I don't think that \"Not a Financial Advice\" disclaimer will be enough for the regulators not to come with this all crypto influencer.Specially the big fish here,  and for sure if the new regulations take effect, this influencers knows what coming from them, so maybe they will have to find another way to not obviously shill for certain projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "November 03, 2022, 01:15:51 AM",
      "body": "Not all crypto influencers probably. I don't know who these crypto influencers you are referring to, but I assume not all of them are paid shills. I suppose there are influencers that are promoting certain coins or projects only because they are heavily invested in them, or perhaps certain influencers who made their own independent and objective assessments. In other words, they're not hired to promote coins or projects. They're different from influencers who are plainly shilling for coins and projects because they're paid to do so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "November 03, 2022, 01:44:46 AM",
      "body": "Quote from: NeuroticFish on November 02, 2022, 08:45:12 AMQuote from: Crypt0Gore on November 02, 2022, 08:36:20 AMIs it possible that all those crypto influencers we know and hear stuffs about could face market manipulation charges under new regulation law that's coming? ...Is there popular word ' Not a Financial Advice' not enough to safe them from what's coming? Since they warned people about doing their own research too, isn't this enough to break them free? I don't know the new regulations, but I had the same kind of question when Kim Kardashian was fined.And I've got my answer for that case: no matter she said \"not a financial advice\", she should also have been stating that she was shilling because she was paid to do so.See the answer here: https://bitcointalk.org/index.php?topic=5415840.msg61066113#msg61066113And crypto influencers may indeed have the same fate because I expect many of them are paid to advertise this or that project now and then.So the NFA part is sometimes not enough, by the law.Which is why Musk purchased Twitter.  He can talk about Twitter as much as he wants since no one is paying him to say it. He also says he buys it and allows it to buy gear from Tesla = legal.If he has 10 billion coins as I type  and drives price to 4 bucks over next few years Twitter will be well worth the money he spent to buy it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "November 03, 2022, 02:47:20 AM",
      "body": "They should put the word of \"Not a financial advice\" in the top page of their website, they must increase the font size and make it bold! this will make people who visit the site doesn't need to waste their time to read a stranger's opinion. Most of them put it below of the page and sometime they write in small font, which make people wouldn't focus on that's part.It's shilling, but they just act like it they're didn't.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "November 03, 2022, 02:51:24 AM",
      "body": "The thing is in most cases, their so-called \"information sharing\" can be called an advertisement (and that's what they're paid for), and not really, well, proper sharing. Telling it's NFA or DYOR may be able to prevent most people from being scammed/influenced negatively, but it isn't an excuse for people to scam/influence others negatively, especially if they were paid to do so. In cases of influencers being an avid fan of certain coins, pretty sure they'd have enough of an understanding of it to know the pros and cons of the said coin, unlike paid shills.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adzino",
      "created_time": "November 03, 2022, 03:21:47 AM",
      "body": "Quote from: Crypt0Gore on November 02, 2022, 08:36:20 AMIs it possible that all those crypto influencers we know and hear stuffs about could face market manipulation charges under new regulation law that's coming? ...Is there popular word ' Not a Financial Advice' not enough to safe them from what's coming? Since they warned people about doing their own research too, isn't this enough to break them free? You can say it is \"not a financial advice\" when you are \"sharing information\" or giving your opinions. But if you are paid to do this, you must disclose that you are getting paid or else you face a risk of getting into legal troubles. It is because people must know that you are advertising and you are getting paid for promoting the crypto project or anything similar. This helps people to be aware that whatever they are listening to it is bullshit and all biased information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "November 03, 2022, 03:36:29 AM",
      "body": "Quote from: Darker45 on November 03, 2022, 01:15:51 AMNot all crypto influencers probably. I don't know who these crypto influencers you are referring to, but I assume not all of them are paid shills. I suppose there are influencers that are promoting certain coins or projects only because they are heavily invested in them, or perhaps certain influencers who made their own independent and objective assessments. In other words, they're not hired to promote coins or projects. They're different from influencers who are plainly shilling for coins and projects because they're paid to do so.Not all, 99.9(9)%.And you basically just said it yourself, if you're heavily invested in something and you advertise it for others with the obvious purpose of rising the price then, how do you call this but shilling? There is not a single \"influencer\" out there who promotes shittokens or NFT just for fun, they all either have a share in those or they are getting paid, it makes no sense to waste hours making videos for nothing.Just look at what happened with Kim:https://bitcointalk.org/index.php?topic=5415840.0Do you see what token she was promoting?https://coinmarketcap.com/currencies/ethereummax/A 5k rank, yeah ranked 5000 by market cap shitcoin that is just a copy-paste project with the same gimmicks as 5000 others.I never though that MICA would do something good for the community but at least, this thing is one huge thing that will cut a low of shills, a lot of spam, a lot of scammy projects and money-grabbing schemes.Quote from: philipma1957 on November 03, 2022, 01:44:46 AMIf he has 10 billion coins as I type  and drives price to 4 bucks over next few years Twitter will be well worth the money he spent to buy it.That sounds like buying a Marriot hotel to advertise the Pretzel shop on the other side of the road.Dogecoin has a 17 billion market cap, he has spent 44 billion for a platform that had a net loss of $1 billion in 2020 to shill some coins?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Techkoy407",
      "created_time": "November 03, 2022, 03:46:29 AM",
      "body": "Quote from: Crypt0Gore on November 02, 2022, 08:36:20 AMIs it possible that all those crypto influencers we know and hear stuffs about could face market manipulation charges under new regulation law that's coming? ...Is there popular word ' Not a Financial Advice' not enough to safe them from what's coming? Since they warned people about doing their own research too, isn't this enough to break them free? The influencer is only in charge of promoting and advertising, so the possibility of manipulation is very small, because he doesn't own the crypto and he gets paid after advertising the crypto.So I think influencers who manipulate the market are not fair.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "November 03, 2022, 03:57:40 AM",
      "body": "Quote from: NeuroticFish on November 02, 2022, 08:45:12 AMQuote from: Crypt0Gore on November 02, 2022, 08:36:20 AMIs it possible that all those crypto influencers we know and hear stuffs about could face market manipulation charges under new regulation law that's coming? ...Is there popular word ' Not a Financial Advice' not enough to safe them from what's coming? Since they warned people about doing their own research too, isn't this enough to break them free? I don't know the new regulations, but I had the same kind of question when Kim Kardashian was fined.And I've got my answer for that case: no matter she said \"not a financial advice\", she should also have been stating that she was shilling because she was paid to do so.See the answer here: https://bitcointalk.org/index.php?topic=5415840.msg61066113#msg61066113And crypto influencers may indeed have the same fate because I expect many of them are paid to advertise this or that project now and then.So the NFA part is sometimes not enough, by the law.Same thing applies here when I first heard of the Kim's fine over promoting a stuff despite stating it wasn't a financial advice, not until I found out she was paid for it.In most countries like mine, majority of this influencers aren't paid for the promotion they do, They only make some personal researches, being a referral link and possibly earn from the link and not been paid directly by anyone, hence I guess they're free from any persecution, and I think this is not a financial advice can truly be referenced in this case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "November 03, 2022, 04:21:13 AM",
      "body": "Quote from: stompix on November 03, 2022, 03:36:29 AMQuote from: Darker45 on November 03, 2022, 01:15:51 AMNot all crypto influencers probably. I don't know who these crypto influencers you are referring to, but I assume not all of them are paid shills. I suppose there are influencers that are promoting certain coins or projects only because they are heavily invested in them, or perhaps certain influencers who made their own independent and objective assessments. In other words, they're not hired to promote coins or projects. They're different from influencers who are plainly shilling for coins and projects because they're paid to do so.Not all, 99.9(9)%.And you basically just said it yourself, if you're heavily invested in something and you advertise it for others with the obvious purpose of rising the price then, how do you call this but shilling? There is not a single \"influencer\" out there who promotes shittokens or NFT just for fun, they all either have a share in those or they are getting paid, it makes no sense to waste hours making videos for nothing.Just look at what happened with Kim:https://bitcointalk.org/index.php?topic=5415840.0Do you see what token she was promoting?https://coinmarketcap.com/currencies/ethereummax/A 5k rank, yeah ranked 5000 by market cap shitcoin that is just a copy-paste project with the same gimmicks as 5000 others.I never though that MICA would do something good for the community but at least, this thing is one huge thing that will cut a low of shills, a lot of spam, a lot of scammy projects and money-grabbing schemes.Quote from: philipma1957 on November 03, 2022, 01:44:46 AMIf he has 10 billion coins as I type  and drives price to 4 bucks over next few years Twitter will be well worth the money he spent to buy it.That sounds like buying a Marriot hotel to advertise the Pretzel shop on the other side of the road.Dogecoin has a 17 billion market cap, he has spent 44 billion for a platform that had a net loss of $1 billion in 2020 to shill some coins?he sees what i see in doge.and he will be able to play it.and make money over and over and over.doge was at 75 billion and he crashed it on sat night live by calling it a hustle.by then he was sitting pretty with his positions on doge.this is a cash cow he can legally play with it.  and he can use twitter via his account .jan 1 2021 doge = 1 billionpeaked at 85 billion in april-may 2021was down to 8 billion a month agoup to 17 billion now.so 85-1= 84 billion gain of which he pushed.17- 8 = 9 billion gain of which he pushed84+9= 93 billion in gains much of which pushed.seems to me he grabbed a lot of that 93.it also seems to me he can seesaw it over and over and over.lets clock the moves the next 2 years i think it will be at least 93 billion more which he gets a lot of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}