{
  "id": "topic_5413467",
  "title": "Rruchi man",
  "author": "Rruchi man",
  "created_time": "September 13, 2022, 10:33:19 PM",
  "content": "A recent discussion brought up in my locale board lead me to this little striking detail from my research that holds a contrary opinion to what most know about the blockchain.QuoteBlockchain isn’t totally foolproof — there are a few ways that it can be hacked. “If 51% of the network of miners, or of work done by miners, is bribed to alter the ledger, this can result in corruption and incorrectness in the ledger.” Additionally, if one of the nodes of the blockchain network is disabled and it cannot communicate, it may be compromisedSOURCEThis is not to undermine the strength of the blockchain technology and make it less of what it is, but for us to discuss the possibility of this happening and the credibility of this information.Kindly share your opinion.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413467",
  "comments": [
    {
      "author": "Yogee",
      "created_time": "September 13, 2022, 11:08:26 PM",
      "body": "Can you be more specific which blockchain you're referring to? Is it okay to assume it's Bitcoin?Yes the possibility is still there but what are the chances? Pretty low isn't it? It's already been discussed quite a lot that it would take a lot of resources to control the chain and I don't think any group would be that crazy to risk their money......The case is different with alternative chains - look into Ethereum Classic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 13, 2022, 11:27:52 PMLast edit: September 13, 2022, 11:43:54 PM by franky1",
      "body": "there are atleast 1,500,000 asics mining the blocks 24/7 right now. split off into hundreds of thousands of individuals homes and thousands of asic farms. pooled into dozens of poolsyep BILLIONS of dollars of hardware decentralised. and a millions+ dollars an hour in electric(spread across hundreds of thousands of electric bill payers) spent mining blocksthere is not one single place to \"attack\" in regards to re-organising recent blocks of bitcoins blockchainto even attempt to amass enough hashpower to outpace the network someone needs to have control of ANOTHER 1,500,000+ asics this then means they have 50%+ of the hash power. to compete in the race to achieve and remain ahead of finding blocks faster then the rest of the networkbut even at a 1.5m vs 1.5m+ is a 50%+ chance of their block being first to be the next one added to the blockchain. and 10 minutes later. still 50% chance which this time they may not win. even then.. its not as simple as just changing any/all blocksill explainthe blocks are linked together. they cant just decide to change one block from year X in the middle of the blockchain.. they have to work backwards from the current block if they want to change older blocksbut before i get too far into that. lets just explain what they \"could\" do, which is 3 things:1. make new blocks do \"empty block\" meaning not include transactions.2. only include their prefered transactions in new blocks3. go back only a certain number of blockslets delve into (3)to go back 1 block and change its transaction list. requires then to re-mine that block. which takes time. then they have to mine the current block the clean network is mining and then the next block before the clean network does to outpace the clean network to then changed block list of the 3 blocks(past present and future) then become listed as the blocks the network follow.. but even this is not a 100% guarantee its a 51% guarantee they can win the race.to go back 2 blocks takes twice the amount of time meaning even less change.the costs of going back and editing a blocks transaction list costs more the fursther back you go with less and less success unless you have ALOT more then 51% of the clean networks asicsthe cost of the attack becomes too high to even be profitable. becasue all you will achieve at best is to change out a large transaction you already spent. to make it appear that it was not spent. so you can spend it again..but here is the thing. for any transaction of reasonable value. people do not accept it as immutible unless it has 6confirms.. thus knowing its safe to assume its immutable at that pointyep.it costs over $300k of just electric (and billions of hardware) to re-org 1 blockdouble that for 2 blocks($600k) double that again for 3 blocks($1.2m)  and so onso people that accept payments of lets say $50k know its not worth a malicious person to try to undo a $50k tx. so people accepting payments take the extra precaution of waiting for 6 confirms before assuming the transaction is immutibleyes they can assume immutibility of $50k at 1 confirm. but when $50k is involved, no point being impatient. just wait 10-20-50 more minutes and be rest assured its absolutely not worth a malicious person to try to double spend it.oh and also any merchant doing sales/accepting payments of large amounts is also watching the network for pools that are suddenly using higher hashrates compared to other pools.. there are many many safeguards and watch to watch for possible issues and also just to take precautions if dealing with large amounts....that said,,many many altcoins with very low PoW hashrates can easily be chain re-org (51% attacked) very cheap and without much effort.. those altcoins only protection is that no one cares/uses those alts enough to even be worth attacking. thus although they can be easily attacked. \"whats the point\" mind set is their reason no one bothers",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "September 13, 2022, 11:33:15 PM",
      "body": "Quote from: Rruchi man on September 13, 2022, 10:33:19 PMKindly share your opinion.It depends on what blockchain your are referring to but blockchain attacks do exist. Right now it's hard to pull of such an attack on Bitcoin network but could be easy to do so on some altcoins due to their very small level of decentralization or even the proof of stake algorithm which i personally don't trust.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "September 13, 2022, 11:56:15 PM",
      "body": "Quote from: Rruchi man on September 13, 2022, 10:33:19 PMBlockchain isn’t totally foolproof — there are a few ways that it can be hacked. “If 51% of the network of miners, or of work done by miners, is bribed to alter the ledger, this can result in corruption and incorrectness in the ledger.” Additionally, if one of the nodes of the blockchain network is disabled and it cannot communicate, it may be compromisedSOURCE[/quote]That's not what happens. 51% attack can undo the last blocks and replace them with new blocks, but the blocks still have to be valid. They can't edit the blockchain and transfer someone's bitcoins. Your coins can only be stolen if you received them recently. The more confirmations your coins have, the more expensive it is to steal them. It's not about just owning 51% of power, it's about paying for it to execute the attack. So if you receive $10,000,000 worth of BTC, it's better to wait for 50 confirmations or more, before viewing transaction as final. Although there has never been a documented case of a 51% attack on Bitcoin. But it happened with many altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "September 14, 2022, 12:24:53 AM",
      "body": "Quote from: hatshepsut93 on September 13, 2022, 11:56:15 PMThat's not what happens. 51% attack can undo the last blocks and replace them with new blocks, but the blocks still have to be valid. They can't edit the blockchain and transfer someone's bitcoins.That's not totally true.  If you look at what Bitcoin Gold did (I believe that's the fork that did it) they actually reorganized the forked chain to unlock satoshi's coins for their dev team.  This was also Craig Wright's plan for satoshi's coins on the BSV chain.  He believed if he could convince the world he was satoshi, he could order miners to go along with a new fork where satoshi's coins had been given to him.  Sure, this is insane and nobody would support a reorg or a forked Bitcoin chain to move coins around, but it is definitely possible.  Maybe someday in a distant future people will decide to fork BTC to unlock satoshi's coins for some good cause.  I could see this happening before increasing the amount from 21 million to further block rewards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "September 14, 2022, 12:33:01 AM",
      "body": "If a node is compromised only the information on that node is false, other nodes can still be productive and can prove they have the longest chain.A 51% attack would be quite impossible. If you wanted to do it now and you weren't a distributed attacker, you'd get rioters shutting you down because you've taken their power away from you. If you were a distributed attacker, you've got a hard job ahead of you for making the reward you're about to get worthless for no reason.51% attacks are unlikely to replace transactions in blocks that have already been mined too - especially if they happened more than a few blocks. It becomes exponentially harder to remove a block the further back you go.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 14, 2022, 01:06:08 AM",
      "body": "Quote from: OgNasty on September 14, 2022, 12:24:53 AMQuote from: hatshepsut93 on September 13, 2022, 11:56:15 PMThat's not what happens. 51% attack can undo the last blocks and replace them with new blocks, but the blocks still have to be valid. They can't edit the blockchain and transfer someone's bitcoins.That's not totally true.  If you look at what Bitcoin Gold did (I believe that's the fork that did it) they actually reorganized the forked chain to unlock satoshi's coins for their dev team. that was not a 51% attackthat event on the altcoin was rewriting the protocol code. nothing to do with a 51% attackif it involves changing the rules where a certain percentage of the network are not in agreement (contentious) where code changes are involved thats called a FORK. not a 51% attackyou cannot just steal coins from a dataset thats 13 years old via hashpower. thats not how blockchains work. it also requires the nodes to agree to the CODE change (which is usually possible on some crappy altcoin with not that many nodes to sway into accepting code changes that are malicious",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "September 14, 2022, 02:20:39 AM",
      "body": "I don't think mentioning it as hack is correct term to use.It's 51% attack or Replay attack. The cost is huge because total hashrate of Bitcoin network now is very huge, not like years ago. But even years ago, it did not happen. Do you think the Bitcoin network hashrate will continue to rise or will be decreased in future. If it rises more and more, the 51% attack becomes more impossible.In the past, some big pools with correlated owners had more than 51% hashrate of the network but they did not make such attack. They are smart to know such attack will not give any benefit to their pools because Bitcoin will lose faith in investors, then it will collapse to the ground. No pool, no whale want that to happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "September 14, 2022, 02:30:39 AM",
      "body": "Quote from: Rruchi man on September 13, 2022, 10:33:19 PMQuoteBlockchain isnt totally foolproof  there are a few ways that it can be hacked. If 51% of the network of miners, or of work done by miners, is bribed to alter the ledger, this can result in corruption and incorrectness in the ledger. Additionally, if one of the nodes of the blockchain network is disabled and it cannot communicate, it may be compromised51% attacks cannot be carried out if there are too many miners and hashrate (or \"staking\" and \"stake rate\") on the network because then it becomes cost-prohibitive to mount one. And specifically in BTC's case, there are not enough miners in the world to buy to embark on one, and it is virtually impossible to secretly bribe mining pools to mine a rival chain since their workers would mass-leave the pool.The \"node disable attack\" does not work in decentralized networks that are sufficently large, as there are no central nodes that coordinate all the other nodes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "September 14, 2022, 05:58:14 AM",
      "body": "The first part regarding 51% attack depends on what cryptocurrency we are talking about. Unfortunately when the quote says \"blockchain\" it can be any blockchain, for example if I create a PoW coin today with nothing to offer you can 51% attack it with your own CPU without really spending any money! But that doesn't work in bitcoin due to how huge the hashrate is and how well distributed the miners are.The second part doesn't make any sense. If a single node is disabled, then that single node is disabled not the whole network and it doesn't affect the \"blockchain\" at all. After that single node comes back online it catches up to the rest of the decentralized network by connecting to multiple other peers. Which means there is still no \"compromised\" state defined for that disconnected node.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "September 14, 2022, 06:11:07 AM",
      "body": "The \"51% attack\" theory has been discussed a gazillion times in the forum. What's the point of discussing it again?A 51% attack against the Bitcoin Core blockchain is:1.Too expensive and requires lots of investment.2. The end results probably won't lead to ROI and profits, because the Bitcoin price would crash severely and the attackers would be left with a bunch of worthless coins.The second theory about one of the nodes being disabled seems as ridiculous as the first theory.Isn't the whole meaning of \"decentralized network\" being a bunch of autonomous nodes, that can keep working even if one or several nodes become compromised? If all the nodes in the blockchain are dependent of one single one(or several nodes), the whole network actually isn't decentralized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "September 14, 2022, 06:54:58 AM",
      "body": "There was a time when we were close to a 51% attack... and you know what happened? 1. Some of the miners in the Ghash.io consortium/Pool .... left the Pool on their own account, because they knew a successful 51% attack would be bad for everyone. 2. Imagine that you managed to pull of a 51% attack and suddenly the media gets hold of that information.... well, the Bitcoin price will take a massive hit and it will go down like crazy... because it will show that the Blockchain security are not strong enough to prevent such attacks. 3. The attacker will also lose a shitload of money... because 51% of the total hashing power is incredibly expensive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jeger.Kiting",
      "created_time": "September 14, 2022, 07:53:54 AM",
      "body": "Blockchain technology is claimed to be incapable of being hacked because the data stored is not centralized but located in several places. If one is hacked then the other systems are not affected. However, there is one way to hack this technology which is to simultaneously hack most systems in all storage places. But the level of difficulty is also high. For example, there are five data storage systems with different encryption. If hackers can only break into three systems, then all of them will be hacked. So, Blockchain is indeed quite difficult to hack.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "September 14, 2022, 09:41:07 PM",
      "body": "Quote from: Yogee on September 13, 2022, 11:08:26 PMCan you be more specific which blockchain you're referring to? Is it okay to assume it's Bitcoin?Not exactly an assumption but, if you went through the information on source link I provided, you would see that the article concerns \"decentralized internet\" and when the topic of decentralization is brought forth the first pointer as one of the successful model of decentralization is cryptocurrency and when blockchain is mentioned in that regards, what that comes to mind is that of bitcoin. I believe if reference was made to another Blockchain, it would have been mentioned. Also you would notice that the quoted sentence is a harvest from Medium, I tried to see if I could get to the source article on Medium but I couldn't so I had to generally ask here for people's thoughts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "September 15, 2022, 12:18:15 PM",
      "body": "From the article the op linked, it seems to me that they're not referring to any specific Blockchain and certainly aren't talking about Bitcoin blockchain specifically. They are talking about the technology itself and its potential flaws that could manifest itself had decentralized Internet been built on blockchain. The 51% attack is a well-known thing, and yes, it's a vulnerability. But the bigger the network, the more people are involved and the more funds are required to even attempt it, the less likely it is to happen. And if decentralized Internet becomes the new standard, it's unlikely that it will be small enough to be vulnerable like that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "September 15, 2022, 02:07:59 PM",
      "body": "Technically speaking, yes. But I guess \"hack\" related issues, as far as I can remember, are more often involving user neglignecne, or simply involving human interaction such as, 'accidentally' sharing private keys, or logging to other devices in some instances, and encountering phishing sites. Not trying to sound cliche' but we must really take extra cautions with it, given that it involves our money in the first place. I have also heard some stories wherein 'hackers' managed to access their assets but I doubt they did nothing for those bad people to get access or to reach them, chabces are high that there were some errors, 'coz if there are no such thing, why are whales or big investors are not having problems of this kind then? Practically, they should be more of the target, right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "September 16, 2022, 11:52:07 AM",
      "body": "Quote from: Rruchi man on September 13, 2022, 10:33:19 PMQuoteBlockchain isn’t totally foolproof — there are a few ways that it can be hacked. “If 51% of the network of miners, or of work done by miners, is bribed to alter the ledger, this can result in corruption and incorrectness in the ledger.” Additionally, if one of the nodes of the blockchain network is disabled and it cannot communicate, it may be compromisedSOURCETalking about bitcoin’s blockchain; when a miner is trying to alter the ledger, other miners following the correct rule-see this and decline to accept the change. And as a result, the bad guy's work is pointless. At least 20% of the hashrate is now owned by publicly traded corporations, making it impossible for a miner with 51% of the hashrate to launch an attack quickly in a matter of seconds. Making this attempt can only result in troubles for the attacker, who will also face numerous legal actions. So launching an attack on the bitcoin blockchain is practically not feasible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "September 16, 2022, 12:32:57 PM",
      "body": "Quote from: Asiska02 on September 16, 2022, 11:52:07 AMTalking about bitcoin’s blockchain; when a miner is trying to alter the ledger, other miners following the correct rule-see this and decline to accept the change. And as a result, the bad guy's work is pointless. At least 20% of the hashrate is now owned by publicly traded corporations, making it impossible for a miner with 51% of the hashrate to launch an attack quickly in a matter of seconds.The 51% attack and you mentioned is about replacing an older blocks with another valid block meaning they both follow the same \"correct rule\" since they are both valid. You can't reject such blocks. Also technically it is not the miner rejecting invalid blocks, it is the node.The reason why 51% attack doesn't work is because how decentralized the mining in bitcoin is. It is not possible to gain control of that much hashrate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "September 16, 2022, 12:44:39 PM",
      "body": "Quote from: hatshepsut93 on September 13, 2022, 11:56:15 PMThey can't edit the blockchain and transfer someone's bitcoins.Reversing transactions is transferring someone's bitcoins. Stealing miners' rewards is transferring someone's bitcoins. Quote from: OgNasty on September 14, 2022, 12:24:53 AMMaybe someday in a distant future people will decide to fork BTC to unlock satoshi's coins for some good cause.Never going to happen. That'd violate censorship resistance. Also: Satoshi's coins are most likely going to be moved within the next 2 decades, probably, due to them being paid in public keys. Quote from: pooya87 on September 16, 2022, 12:32:57 PMThe reason why 51% attack doesn't work is because how decentralized the mining in bitcoin is. It is not possible to gain control of that much hashrate.And even if you did, it'd be much more profitable to just earn fees and block subsidies. This is where the game theory depends anyways.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}