{
  "id": "topic_5445844",
  "title": "MeCsc",
  "author": "MeCsc",
  "created_time": "March 21, 2023, 07:27:19 PM",
  "content": "I was told mining bitcoin with pc is a waste of resources because of the  difficulty of mining Bitcoin with pc, Even if I join a mining pool that I should go for ASICs hardware. So I will like to know the minimum ASICs hardware that is profitable in mining bitcoin using a mining pool",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445844",
  "comments": [
    {
      "author": "NotFuzzyWarm",
      "created_time": "March 21, 2023, 07:40:07 PM",
      "body": "1st point to consider: ASIC-based miners are VERY power hungry so you need VERY low cost electric power. Like at most maybe $0.06/kWh.If your power cost is more than that your only hope is to solo mine - aka 'lottery mining' using a small low power ASIC-based miner like the Gekko Compac-F or R909. They may not ever hit a block - but *IS* possible - and at least you will not be bleeding $$$ feeding them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "March 22, 2023, 01:04:33 PM",
      "body": "Like the post above profitability depends on your electricity rate if you have an electricity rate below 10 cents you can able to make a profit based on daily profitability.If you are looking for an ASIC unit that is profitable based on your current electricity rate you can use this tool below- https://www.asicminervalue.com/Use the search bar to filter them into bitcoin miners only by using the keyword \"SHA-256\" and then scroll down to the bottom and edit the electricity cost. It would list all profitable miners to the top and the earnings daily to the right.And take note if you decided which miner you are planning to buy make sure buy only miners directly from the manufacturers or verified distributors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}