{
  "id": "topic_5403391",
  "title": "DireWolfM14",
  "author": "DireWolfM14",
  "created_time": "June 20, 2022, 07:27:52 PM",
  "content": "Is anyone else having trouble loading images the past few weeks?I usually use imgbb.com for hosting images, and lately I've noticed the \"Bitcointalk.org Image Proxy: Invalid Image\" warning pop up frequently.  The problem is inconsistent, sometimes the image is displayed fine, other times the image won't load.Should I not be using imgbb.com, or is there something else going on?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403391",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "June 20, 2022, 07:36:59 PM",
      "body": "I use https://imgur.com/upload and copy the bbcode, it always work fine. It only work on desktop version.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "June 20, 2022, 07:47:45 PM",
      "body": "Quote from: DireWolfM14 on June 20, 2022, 07:27:52 PMI usually use imgbb.com for hosting images, and lately I've noticed the \"Bitcointalk.org Image Proxy: Invalid Image\" warning pop up frequently.  The problem is inconsistent, sometimes the image is displayed fine, other times the image won't load.I've seen that warning a lot more recently and I think it's just a forum problem.I thought it might've been due to more images trying to be loaded on the forums end and the proxy/Webserver dropping requests/communications. (it's especially apparent on pages with multiple images but is normally resolved by waiting a minute and refreshing).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "June 20, 2022, 07:53:29 PM",
      "body": "Quote from: Charles-Tim on June 20, 2022, 07:36:59 PMI use https://imgur.com/upload and copy the bbcode, it always work fine. It only work on desktop version. I can't stand imgur.  You can't upload photos without an account, and the adds are as obnoxious nails on a chalkboard.  Most of the time when I post images here they're obviously related to bitcoin, and I don't need some third party image hosting company tracking my financial habits.imgbb is a pretty decent image hosting site, and no need for KYC, lol.  Maybe it is imgbb that's causing the issue.  Right now I can see all my images that I've posted, but they've been problematic for at least two, maybe three weeks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "June 20, 2022, 07:58:41 PM",
      "body": "Quote from: DireWolfM14 on June 20, 2022, 07:53:29 PMI can't stand imgur.  You can't upload photos without an accountYou can without having an account with them. I don't know why it was asking you for having the account. However, with VPN that I use sometimes, it does not allow to upload image.About the problem you are having, I too experienced in some cases the image were not loading and I was thinking about my internet service provider or connection issue with TOR until now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BITCOIN4X",
      "created_time": "June 20, 2022, 08:02:52 PM",
      "body": "Quote from: DireWolfM14 on June 20, 2022, 07:53:29 PMI can't stand imgur.  You can't upload photos without an account, and the adds are as obnoxious nails on a chalkboard.  Most of the time when I post images here they're obviously related to bitcoin, and I don't need some third party image hosting company tracking my financial habits.I don't think so, I can even use the tool without having an account. Here's an example.Apart from that there are several other image hosting sites that are also great for you to use without having an account, no KYC required. Although I mostly use imgbb or imgur, but this one is also worth a try. https://postimages.org/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "June 20, 2022, 08:07:40 PM",
      "body": "Quote from: DireWolfM14 on June 20, 2022, 07:53:29 PMI can't stand imgur.  You can't upload photos without an account, and the adds are as obnoxious nails on a chalkboard.  Most of the time when I post images here they're obviously related to bitcoin, and I don't need some third party image hosting company tracking my financial habits.The upload link I posted above is what I am using, no ads there and I just upload directly using the link. I do not have account registered and it works fine. Edit: I just saw go ad-free on the site, but I have not gone for such option before and I saw no ads displayed, even I used it again just now and no ad seen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "June 20, 2022, 08:10:12 PM",
      "body": "Nope, no issues lately whatsoever, and I upload images on the regular basis.Quote from: BITCOIN4X on June 20, 2022, 08:02:52 PMAlthough I mostly use imgbb or imgur, but this one is also worth a try. https://postimages.org/I am using postimages almost exclusively and I can also recommend it. Its pretty basic but that's one of the reasons i prefer it over imgur and other more popular image hosting sites.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "June 20, 2022, 08:14:47 PM",
      "body": "Quote from: BITCOIN4X on June 20, 2022, 08:02:52 PMbut this one is also worth a try. https://postimages.org/The site was not known to me until now. It works even with tor which is awesome for me. Pretty fast and clean. Just to have a test of it here is my avatar on the hosting site.Bye bye imgur 😉",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "June 20, 2022, 08:23:57 PM",
      "body": "Quote from: DireWolfM14 on June 20, 2022, 07:27:52 PMIs anyone else having trouble loading images the past few weeks?True, I had the same problem for the last few weeks because I couldn't use imgbb to host the images I posted on this forum. But imgur seems to be a good choice as an alternative to hosting your images here, this site has no ads and I'm using this now.Quote from: DireWolfM14 on June 20, 2022, 07:53:29 PMI can't stand imgur.  You can't upload photos without an account, and the adds are as obnoxious nails on a chalkboard.Charles-tim and BITCOIN4X said, you don't need an account to use it. Same thing for me right now.Quote from: BITCOIN4X on June 20, 2022, 08:02:52 PMbut this one is also worth a try. https://postimages.org/Thanks for another alternative, that would be the image hosting site I would use next if imgbb and imgur really don't work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "June 20, 2022, 08:57:27 PM",
      "body": "I mostly use Imgur and I have an account there for uploading photos. I have experienced the bitcointalk proxy when uploading big resolution images and sometimes it just doesn't work. What I do is either put/select different sizes of the images. Like I put h,l m, etc. at the end of each photo link. Original codeCode:https://i.imgur.com/Y2IesH1.pngWith letters (sizes)Code:https://i.imgur.com/Y2IesH1m.pngImages too bigCode:https://i.imgur.com/sel6LtL.pngWhen size is changedCode:https://i.imgur.com/sel6LtLm.pngI hope this helps somehow. And thank you for sharing the new upload place BITCOIN4X.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "June 20, 2022, 09:18:27 PMLast edit: June 20, 2022, 11:26:13 PM by DireWolfM14",
      "body": "Okay, it sounds like others have been noticing the same thing, it's not just me or the image-hosting site I'm using.  I knew it wasn't my internet, because I'm getting the same issues at home and at work.  If nothing else, I hope this notifies theymos that there may be an issue with the forum.Quote from: BITCOIN4X on June 20, 2022, 08:02:52 PMhttps://postimages.org/Nice, thanks for that.  I'll check it out.  Still not a fan of imgur, however.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RickDeckard",
      "created_time": "June 20, 2022, 09:45:45 PMLast edit: January 20, 2024, 12:02:49 AM by RickDeckard",
      "body": "Quote from: DireWolfM14 on June 20, 2022, 09:18:27 PMNice, thanks for that.  I'll check it out.  Still not a fan of imgur, however.  If you're still looking for a new image host, I also recommend that you check vgy.me[1]. One can easily integrate their services with ShareX[2] and I like their Privacy Page statement[3]:[1]https://vgy.me/[2]https://getsharex.com/[3]https://vgy.me/privacy-policy",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "June 20, 2022, 09:56:01 PM",
      "body": "I can upload images on Imgur without an account, but it is a pain sometimes since it does not let me access so easily and even when I can, it sends back an error message when I try to upload anything. I assume it is because my global location or IP address.So I shall give a chance to those alternatives you all have share on this thread, thank you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "June 20, 2022, 11:19:10 PM",
      "body": "This usually happens when the file is large in size and its dimensions. And for god sake, i really hate imgur, aside that you cannot upload using mobile without the app, it has lots of ads unlike imgbb.Quote from: RickDeckard on June 20, 2022, 09:45:45 PM[1]https://vgy.me/[2]https://getsharex.com/[3]https://vgy.me/privacy-policyHere are some alternatives aside from the aboveCode:https://thumbsnap.com/https://imgbox.com/https://postimages.org/ - already mentioned aboveAnd the same thing, prepare for ads.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "June 20, 2022, 11:53:40 PM",
      "body": "Quote from: BitcoinGirl.Club on June 20, 2022, 07:58:41 PMYou can without having an account with them. I don't know why it was asking you for having the account. Quote from: BITCOIN4X on June 20, 2022, 08:02:52 PMI don't think so, I can even use the tool without having an account.I think that is why he said he can't upload images without an account in imgur maybe he is trying to upload images through the phone which is no option or upload button when accessing the Imgur through a mobile phone. But if he downloaded the imgur app he can able to upload without registering. On the PC when accessing the website the +New post button is there unlike on the phone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "June 21, 2022, 05:22:38 AM",
      "body": "I am using https://imgbb.com/.This works for me without registration and is always stable. There are multilingual versions and links are provided in different versions. I checked my screenshots from 2018, and they are also still alive and not blocked.For example:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "June 21, 2022, 05:28:18 AM",
      "body": "Quote from: lovesmayfamilis on June 21, 2022, 05:22:38 AMI am using https://imgbb.com/.This works for me without registration and is always stable. There are multilingual versions and links are provided in different versions. I checked my screenshots from 2018, and they are also still alive and not blocked.For example: Can you post the image alone without the embedded link of the image upload on imgbb.com? I'm having problem too on using this image hosting website and I can't post the image here whenever I remove the url attached on the bbcode provided by the imgbb. I just don't link to see a long bbcode when I'm attaching it to my post. Is there a remedy for it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "June 21, 2022, 05:40:11 AM",
      "body": "Quote from: Eternad on June 21, 2022, 05:28:18 AMQuote from: lovesmayfamilis on June 21, 2022, 05:22:38 AMI am using https://imgbb.com/.This works for me without registration and is always stable. There are multilingual versions and links are provided in different versions. I checked my screenshots from 2018, and they are also still alive and not blocked.For example: Can you post the image alone without the embedded link of the image upload on imgbb.com? I'm having problem too on using this image hosting website and I can't post the image here whenever I remove the url attached on the bbcode provided by the imgbb. I just don't link to see a long bbcode when I'm attaching it to my post. Is there a remedy for it?https://ibb.co/z8QQL4zNo, it doesn't work, if I understand you correctly. But what's the problem with using a ready-made link? Does it somehow deanonymize the user? I never remove the URL, but just paste it into the post.But you puzzled me, if possible, tell me why you do not use a ready-made link?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "June 21, 2022, 07:31:04 AMLast edit: December 16, 2023, 06:58:32 PM by Fivestar4everMVP",
      "body": "I too have been noticing the QuoteBitcointalk.org image proxy invalid image error on several posts of recent, but i on my own have not encountered such error on any image i post, ive never used imgbb, what i use all the time is imgur.Though i also discovered that image link can be copied wrongly, and when its copied wrongly, the image proxy error is displayed in place of the image ..For Example -Below is one/same image from imgur with two different links, first link is copied wrongly while the second link is copied correctly.image link was copied the wrong way/wrong formatQuotehttps://imgur.com/Qhlg7zbimage link is copied the right way/right format Quotehttps://talkimg.com/images/2023/12/16/E4E1c.jpegI guess this is the mistake some of this forum users always make while coping image link which then result to image proxy error that we see on several posts.So this is my personal note to everyone who might not know, when next you are trying to post an image on the forum through a link, make sure the image format is at the end of the link, else, the image wont display, image format can be .png or .jpg, and always remember to resize your image if its to large.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}