{
  "id": "topic_5402573",
  "title": "WealthyMaarten",
  "author": "WealthyMaarten",
  "created_time": "June 14, 2022, 12:52:31 PM",
  "content": "Hey,I'm new to crypto trading, so I decided to start with paper trading on tradingview.com. What I don't understand is the meaning of units you can buy or sell. I'm on a BTCUSD market. Configured papertrading to start with 10000 dollar. But the value of a single bitcoin is above the 10000 dollar. So, how is it possible for me to buy 50 units. Does that mean 50 times the value of a single bitcoin. It does not seem to be..Can someone explain?Thanks,Maarten",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402573",
  "comments": [
    {
      "author": "DdmrDdmr",
      "created_time": "June 14, 2022, 02:38:20 PM",
      "body": "I’m not really acquainted with the platform, but I’m pretty sure there are already some videos around that can help you with the process, such as these two:https://www.youtube.com/watch?v=vzNbFUXkToohttps://www.youtube.com/watch?v=4Pw2Ec2u7V8If you’re placing a bitcoin order, the units should be in bitcoins or fractions of a bitcoin, so either the system should not let you actually go through with a 50 BTC order having a 10K $ test configuration, or maybe you’ve got it configured in sats.In any case, following the procedure in videos such as those included above should guide you through the process well enough to begin with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "June 14, 2022, 03:18:53 PM",
      "body": "Why wouldn't you expect it to be $, I think I remember it being that (but I'm not too sure).If so, you're buying unit/unit price if you want to work out how much btc that is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "June 14, 2022, 03:34:28 PM",
      "body": "Are you talking about $10k paper dollar and buying 50 BTC?The price of BTC is currently $22.5k while the amount of paper dollars is $10k so you won't be able to buy 50BTC with $10k paper dollars. If you want to buy a 50BTC then you need $1.125m of paper dollars to buy 50BTC. The only problem is that tradingview only has a $100k limit of the paper dollar.If you want to practice your trading skills there are other sites that you can use check this link below for trading simulators. - https://github.com/SpiralDevelopment/Awesome-Crypto-Trading#trading-simulators",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "June 14, 2022, 06:33:13 PM",
      "body": "Paper trading, aka simulated trading It is a way to try all trading methods and test strategies to see how successful they are using fake money as your intention is to learn and therefore you will do all the tasks that you do on the platform except for the option to withdraw from the platform.I do not advise you to use tradingview for such methods to test the accuracy of your technical analysis, but you can find everything you ask about with this link.you can try those Trading Simulators:    Crypto trading simulator    Crypto trading simulator 2and you can follow some YouTubers about crypto and have to make technical analysis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}