{
  "id": "topic_5414499",
  "title": "knowngunman",
  "author": "knowngunman",
  "created_time": "September 22, 2022, 01:58:19 PM",
  "content": "It's worrisome that people use one's name to judge and conclude that one is a bad character. In my continent; Africa, most parents give names to their children in memories of their great parents depending on their traditions and culture. As such, the behavior of the child has nothing to do with the name he/she answered. Children are mostly influenced by the behavior of their parents and not the name they bear. QuoteEphesians 6:4Fathers, do not provoke your children to anger, but bring them up in the discipline and instruction of the Lord.This verse clearly proved that children are influenced by the character their parents taught them and not by the name given to them. I have heard stories about children bearing good names such as John, Moses, David, Jacob, Joseph etc involving in robbery and rape cases and all sorts of vices. On the contrary, some children with funny and ridiculous names partaking in community development. In my own case, I used this name (Knowngunman) in memory of the activities and atrocities they've committed against me and my beloved ones. Although, government address them as unknown gun men but I use the opposite because they are well known in one way or another. So, Having joined the forum newly and made a post in my country local thread, the kind of perception people had based on my username triggered me to make this post.Quote from: uchegod-21 on September 20, 2022, 10:46:07 PMWelcome Knowngunman, thankGod you know say your name get k-leg. There are plenty name wey jakpa where you go chose from answer but na gunman you see to pick.Quote from: Coyster on September 21, 2022, 02:49:01 PMHaving said that, if me i wan talk the truth as e suppose be ehn, your username no they send the right message wey you wan portray for your mind, any user wey see this username fit come get the wrong impression about you, and even if users no go openly tell you, for their mind them fit no wan associate with you in any way possible on the forum, but as you don choose am so nothing much, everything fit still go well, Good Luck in the forum.Quote from: Yawa2020 on September 22, 2022, 08:35:48 AMMake I no lie you brother, your name scared me too as I see am but hearing your explanation I understand your point now.The above quotes made me to understand that people still believe that your name has connection with your attitude and also made me to wonder whether I will have a chance to prove myself and be comfortable in this forum. Having bad name doesn't mean one is bad please.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5414499",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "September 22, 2022, 02:06:55 PM",
      "body": "Your ranking up is not determined by your name on bitcointalk. If you contribute good in discussions, you would be an established member on this forum. But it is good to give yourself a name not attributed to something bad.Also know that username can be different from people's real name. Do not make this confusing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "September 22, 2022, 02:12:24 PM",
      "body": "As they say, \"Don't judge a book by its cover\". There's no point in judging someone through an internet forum username. Do people think I'm a Little Mouse   lol. When I registered here, I was trying to get something unique that I never used in any other forum or anywhere on the internet. I believe most people pick usernames in that way.I got remember a forum username- ikilledcobain (can't remember where I have seen though.)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "knowngunman",
      "created_time": "September 22, 2022, 02:54:39 PM",
      "body": "Quote from: Charles-Tim on September 22, 2022, 02:06:55 PMYour ranking up is not determined by your name on bitcointalk. If you contribute good in discussions, you would be an established member on this forum. But it is good to give yourself a name not attributed to something bad.Also know that username can be different from people's real name. Do not make this confusing.Thanks for the clarity. Most people do think your username has everything to do with you forgetting that in most cases, they're generated out joy and not putting anything in consideration talk more of linking the username with their real attitude.Quote from: Little Mouse on September 22, 2022, 02:12:24 PMAs they say, \"Don't judge a book by its cover\". There's no point in judging someone through an internet forum username. Do people think I'm a Little Mouse   lol. When I registered here, I was trying to get something unique that I never used in any other forum or anywhere on the internet. I believe most people pick usernames in that way.I got remember a forum username- ikilledcobain (can't remember where I have seen though.)Lol  I have also seen weird names here with the little time I have spent here already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "September 22, 2022, 02:58:57 PM",
      "body": "Your birth name was given to you by your parents, however, when you register on the online forum, you can choose a username (nick) to go by. For this very reason, you are responsible for how other members will perceive you within the community. It is obvious that if you choose a username that will evoke emotional reactions from other members, your experience on the forum will be affected. I agree that a username alone cannot be a reflection of someone's character or personality, but you shouldn't expect others to change their perception simply because you are uncomfortable with it. Your choice of username should be something that is appropriate for the community. If someone sees your username and thinks that it's immature or unprofessional, then they'll have a negative opinion of you before they even get to know you.I'm not trying to tell you what name to choose, but rather to help you understand why choosing a username that is appropriate for the community can make all the difference.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "owlcatz",
      "created_time": "September 22, 2022, 03:07:34 PM",
      "body": "When I first created my account, I gave like zero thought to my \"Name\"... I just picked something different/unusual. It never meant anything at all really, it just popped into my head at the time.  So, based on my own experience, I don't judge anyone by their username, it's just a string of chars really... I judge people by their actions and words.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "September 22, 2022, 03:28:27 PM",
      "body": "Quote from: knowngunman on September 22, 2022, 01:58:19 PMHaving bad name doesn't mean one is bad please. It's quite clear, many people think that a person's character, personality  can be measured by name, but it is not a perfect benchmark in judging someone, because the name is only a gift, not from someone's personality, only as a gift.In this forum someone can give their account name however they want, basically:QuoteEach individual has its own personality traits, ranging from those that show a healthy personality or even unhealthy ones.The quote is a point, the name we think is funny is not funny, what we think is scary is not scary, meaning that you are comfortable in this forum not based on your name, but your comfort based on your attitude and behavior here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "September 22, 2022, 03:56:00 PM",
      "body": "well your username sounds like you are the Man from Toronto.we all have different culture. American Indians name their babies with something unusual going on the time the baby is born. thats why there are names like Crazy Horse because there was a horse acting crazily while they think of his name.this is you can picture what happened when you met someone with the name \"Two Dogs Fucking\" or \"Pocupine Coming out the ass Backwards\".seriously, i doubt youd be judged by your username though. but they may suspect something like you could be from the deep web looking for clients who pays for the service. are you?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "September 22, 2022, 07:02:22 PM",
      "body": "When a new user creates an account on the forum, he even doesn't know the culture of the forum (in case not alt). So username would be anything that the user like or have in mind. For example, since it's the crypto forum I use Vator with crypto. It doesn't mean I am an expert on crypto lol. But I work against many scams and still fight when I notice something unusual on the forum. So I don't believe username or name is related to users' behavior. How the username will go depends on the user's behavior. A bad name would be lightning by contribution. A good name would be a scammer as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "skarais",
      "created_time": "September 22, 2022, 07:26:54 PM",
      "body": "Whatever the name means, it's just your username. Many people use pseudonyms that don't really support any particular knowledge. Name isn't everything, forum need knowledge behind the name you use as username, and that's you.Sometimes the name can also be a imagin of the owner's personality, for example lovemayfamilis. He seemed to really love his family. But character someone is not formed from a name, it's something you do for whatever you like in this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "September 22, 2022, 10:51:27 PM",
      "body": "In theory it shouldn't matter, in reality it probably does matter to some extent, whether that's actually distinguishable is probably the right question. Ultimately though, you get to choose your own username here, so if you didn't want to get stereotyped or profiled because of your username, you could pick something that you deem less likely for that to happen. Ultimately for me, that wouldn't influence my decision. If people don't like my username or Welsh people, then that's fair enough . It's not going to be a factor in picking a username. Although, generally it's not something that pops into my head. I imagine many users here don't even look at the username of the poster unless they particularly like or dislike what was said. Quote from: Charles-Tim on September 22, 2022, 02:06:55 PMYour ranking up is not determined by your name on bitcointalk. If you contribute good in discussions, you would be an established member on this forum. But it is good to give yourself a name not attributed to something bad.Also know that username can be different from people's real name. Do not make this confusing.While this is probably true for the most part, there will be some subconscious bias to usernames, that's just human nature, which I think is what OP might be onto here. For example, and this is a rather loose example; If you like cars, and someone else has the name CARLOVER3948389, then you might be more inclined to give that user merit or pay more attention since they share a common interest. It might not be a massive amount of bias, but I'm sure there will be some there if you did a case study on it. I imagine there's been other studies in a similar vain that have been conducted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "September 22, 2022, 11:48:09 PM",
      "body": "You're name doesn't mean anything to me, your actions is how I see you on this forum. If you only post in altcoin sections and make bounty posts, I will conclude you are simply a user looking to claim bounty tokens. If you are informative in most of your posts and try to help users with your knowledge of a certain subject, I would conclude you're probably a genuine user who cares about the community.There are many more examples but the point is actions make the man, not the name.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "September 23, 2022, 03:25:00 AM",
      "body": "I don't know why people are very judgmental nowadays. People are basing one's attitudes on their usernames and in my case where most of the time I'm playing online games, there are some players that I saw where they are basing other players' attitude on their IGN which is unacceptable. I said unacceptable because I didn't ever do this. Usernames are only usernames for me, and it doesn't represent the true identity of the person who is using it. I've seen weirder more dangerous IGN's than you OP and I didn't try to judge them because I don't know them personally.Just look at my username LogitechMouse. Can people judge me based on my username .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Awaklara",
      "created_time": "September 23, 2022, 03:44:17 AM",
      "body": "Most of the usernames in this forum are chosen and used as uniquely as possible. it will not reflect anything against what is done on the forum. but for the most part, want to remain anonymous without being aware of his real-life issues.maybe someone made a username according to the intent and purpose of him being on the forum. like cheater detector. of course, he chose a username that was intended for a specific purpose as the identity of his activities on the forum.Quote from: LogitechMouse on September 23, 2022, 03:25:00 AMJust look at my username LogitechMouse. Can people judge me based on my username .I think you created it when you were confused about choosing a username and then looking at the brand of computer mouse device you are using.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "September 23, 2022, 06:54:04 AM",
      "body": "When registering on a crypto forum, today's newbies often use the word \"crypto\" in their nicknames, and this already indicates that people understand where they are. But many came to the forum just out of curiosity, registered in order to be able to communicate, and did not think about their nicknames. My nickname was created by the most common generator. Five options were offered, and I just chose the one that I have now by typing. It didn't seem to me like anything reprehensible if I chose this nickname; moreover, I did not expect to be on the forum for a long time. But everything turned out differently, and I practically abandoned all other forums, giving preference to this one. By the way, OP, there is a topic on funny nicknames. You can read it; I think it might be interesting for you.https://bitcointalk.org/index.php?topic=5397275.msg60041950#msg60041950",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "knowngunman",
      "created_time": "September 23, 2022, 09:17:18 AMLast edit: September 23, 2022, 09:29:32 AM by knowngunman",
      "body": "Quote from: Welsh on September 22, 2022, 10:51:27 PMWhile this is probably true for the most part, there will be some subconscious bias to usernames, that's just human nature, which I think is what OP might be onto here. Exactly my point. Since they already dislike your name, nothing from you will seems good to them and thereby shun your posts even the ones that make sense. I hope I won't be a victim of circumstance.Quote from: yahoo62278 on September 22, 2022, 11:48:09 PMYou're name doesn't mean anything to me, your actions is how I see you on this forum. The forum will be more better if everyone think the way you just said. But nahh the individual differences make things complicated. Like seriously it sink how people judge one by just a mere hearing of name.Quote from: Awaklara on September 23, 2022, 03:44:17 AMI think you created it when you were confused about choosing a username and then looking at the brand of computer mouse device you are using.  Lol   this is funny but you might be right thou. I anticipate to hear the rest of the story if he would mind to share.Quote from: lovesmayfamilis on September 23, 2022, 06:54:04 AMBy the way, OP, there is a topic on funny nicknames. You can read it; I think it might be interesting for you.https://bitcointalk.org/index.php?topic=5397275.msg60041950#msg60041950Thanks for bringing this up to my attention. I will definitely go through it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "September 23, 2022, 09:24:19 AM",
      "body": "Quote from: knowngunman on September 22, 2022, 01:58:19 PMThe above quotes made me to understand that people still believe that your name has connection with your attitudeI want to say: \"Of course!\" to this. Unlike the name your parents gave you, you actually chose your forum nickname by yourself. Mine came out of a random name generator.You can't blame users for having different expectations from someone named \"gunman\" than from someone named \"sensualbellax\" for instance.Quotemade me to wonder whether I will have a chance to prove myself and be comfortable in this forum. Having bad name doesn't mean one is bad please.Here too: Of course  Your nickname may give a first impression, but the rest is up to your actions. I've seen much worse nicknames than \"gunman\".Quote from: Little Mouse on September 22, 2022, 02:12:24 PMAs they say, \"Don't judge a book by its cover\".They also say: \"You only have one chance to make a first impression\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "knowngunman",
      "created_time": "September 23, 2022, 09:43:20 AM",
      "body": "Quote from: LoyceV on September 23, 2022, 09:24:19 AMThey also say: \"You only have one chance to make a first impression\" This is incredible! It's funny how you justify and deny most of my points  it's shows that you're a legend not only by Forum rank but by wisdom. However, I will agree to disagree with this particular quote. First impressions are mostly likely to be faked just as the name implies. It's to create impression for the first time and what what follows next is to exhibit their real character. I personally don't feel impressed by first encounter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "September 23, 2022, 10:07:36 AM",
      "body": "Quote from: Little Mouse on September 22, 2022, 02:12:24 PMDo people think I'm a Little Mouse   lol. Quote from: LogitechMouse on September 23, 2022, 03:25:00 AMJust look at my username LogitechMouse. Can people judge me based on my username .Wait a minute!!! You two aren't brothers?  I'll agree with Loycev on this, if you choose a random name that basically means nothing it's clear you don't care about making a statement with it, but if you choose one with gunman, p**ywrecker, Smoochy Woochy Poochy this does make a first impression you're going to have to work a bit to change.Speaking of names, I remember the story of how people who named their kids after GoT characters before seeing the end felt after that. You might name your kid something that sounds cool only to find two years later his character turns to be stupid or a villain, or even worse just when you think you have found a new cool name for your daughter a wanna-be pornstar thinks the same.Ps, Interpol is searching for 41 Jesus, funny enough they aren't searching for a single Judah.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zaim7413",
      "created_time": "September 25, 2022, 01:47:58 PM",
      "body": "There is a distinct element between real life and Bitcointalk forum.1 Name in real life.It is undeniable that a good name is expected to have a positive effect on children's behavior. But a good name means nothing if parents do not provide proper guidance and direction so that children become good human beings and have noble character as all parents dream of.Parents must be role models and idols for children, because in general children have idols or superheroes in the world of imagination. But in the real world, children also want to have a Superhero. Parents must be able to become what their children want so that the child's character changes for the better.2. Name in the Bitcointalk Forum.No matter how good your username is on the Bitcointalk forum, it will not have any effect on your account, because the forum ranking is not determined by the username, without contributing well to the forum you will never rank up.This forum does not look at the good and bad names of each user, the positive value here is the contribution to the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}