{
  "id": "topic_5439263",
  "title": "Kaminos",
  "author": "Kaminos",
  "created_time": "February 09, 2023, 06:49:51 PMLast edit: February 09, 2023, 07:00:03 PM by Kaminos",
  "content": "Bonjour la communauté ! Présentation aujourd'hui d'un projet 100% français, j'ai nommé Lyzi !Présentation du projetLyzi est une application mobile développée par la société PROOFEO, fondée il y a 4 ans (février 2019). Elle est représentée par le CEO de Lyzi, Damien PATUREAUX.L'application permet aux utilisateurs de payer en cryptomonnaie en magasin et en ligne. Le principe est simple : le client choisit de payer avec la cryptomonnaie de son choix, puis il saisit le montant en euro dans son application. Cette dernière génère un code QR. Le client présente ce code à la caisse. Le commerçant le flash. La transaction est finalisée et ce dernier reçoit un versement en euros. À ce jour, 21 cryptos sont utilisables via l'application. La supply du token est de 550M.Les avantages d'utiliser LyziLe cashback : Les utilisateurs de Lyzi bénéficient d'un cashback qui s'élève jusqu'à 5% sur leurs achats, sans condition d'éligibilité. Le cashback est financé par l'application.Les points fidélités  : L'utilisateur peut stocker toutes ses cartes fidélités dans le wallet sécurisé de Lyzi. Le fonctionnement est le même : il suffit de flasher la carte auprès de l'enseigne correspondante. De plus, les points non utilisés peuvent être convertis en token $LYZI ou échangés à la famille ou les amis.Réductions auprès des commerçants : selon les conditions prévues par le magasin, bien évidemment  Pas de plafond de paiement : En effet, contrairement à certains concurrents, le paiement n'est pas plafonné. Comment se rémunère Lyzi Lyzi prélève des frais de 0.8% à 3% sur les transactions (côté user). Ils vendent également des services aux commerçants partenaires (visibilité, loyalty 3.0, etc).Est-ce que les transactions sont soumises à la flat tax ? Oui. À partir du moment où une crypto est convertie en fiat et est en plus-value, la flat tax de 30% s'applique sur cette PV. Lyzi développe une solution qui permettra de répertorier toutes les transactions concernées afin de faciliter la déclaration d'impôts.Lyzi a une vision internationale et non locale, gardez donc en tête que la majorité des pays ne taxent pas les PV à hauteur de 30%, c'est bien en dessous.ICO en coursLyzi a déjà organisé une private sale qui est maintenant clôturée, avec un minimum d'investissement à 5.000€, prix du token 0.04$. Ainsi, 300.000€ ont été levés, soit 7.5M de tokens vendus.Nous sommes actuellement au round 1 de l'ICO, avec un minimum d'investissement de 1.000€ pour un prix de 0.08$. Vesting de 3 mois. Plus de 843.200€ ont été levés, soit 10,5M de tokens.Le R1 se fini le 28/02/2023.Le R2 commencera le 01/03/2023 avec un minimum d'investissement de 200€ pour un prix de 0.12$, sans vesting. Le listing est prévu pour avril 2023.Sachez que vous bénéficiez d'un bonus de parrainage si vous investissez, n'hésitez pas à utiliser mon lien afin d'avoir 2% de tokens supplémentaires : https://ico.lyzi.fr/invite?ref=UD00870Si vous souhaitez en savoir plus, voici les liens du projet :Le site web : https://lyzi.fr/Le whitepaper : https://lyzi.fr/wp-content/uploads/2023/01/Lyzi-Whitepaper-EN.pdfLe Telegram : https://t.me/Lyzi_frLe Twitter : https://twitter.com/lyzi_appLe LinkedIn : https://fr.linkedin.com/company/lyziLe Discord : https://discord.com/invite/f2FdQKc9VvLe Facebook : https://www.facebook.com/lyzi.frLa team derrière le projet avec les LinkedIn : https://lyzi.fr/notre-equipe/Le lien de parrainage : https://ico.lyzi.fr/invite?ref=UD00870Ce post n'est évidemment pas un conseil financier ni un conseil en investissement, DYOR  Bonne soirée à tous, au plaisir !",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5439263",
  "comments": [
    {
      "author": "elma",
      "created_time": "February 09, 2023, 07:30:32 PM",
      "body": "intéressant.Edit: (oh putain, ya Paglino dans le coup...)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "February 10, 2023, 12:23:00 AM",
      "body": "Quote from: Kaminos on February 09, 2023, 06:49:51 PMLe cashback : Les utilisateurs de Lyzi bénéficient d'un cashback qui s'élève jusqu'à 5% sur leurs achats, sans condition d'éligibilité. Le cashback est financé par l'application.Comment se rémunère Lyzi Lyzi prélève des frais de 0.8% à 3% sur les transactions (côté user). Ils vendent également des services aux commerçants partenaires (visibilité, loyalty 3.0, etc).Ça semble un peu douteux non ?En tout cas le principe de l'application est pas mal !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "debutant",
      "created_time": "February 25, 2023, 02:45:42 PM",
      "body": "Rien de tel que la Binance card pour payer, simple efficace, pas de qrcode ou quelque manip que ce soit !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "February 25, 2023, 07:07:20 PM",
      "body": "Quote from: debutant on February 25, 2023, 02:45:42 PMRien de tel que la Binance card pour payer, simple efficace, pas de qrcode ou quelque manip que ce soit !Conforter Binance dans son quasi monopole ?Tu penses pas qu'avoir quelques concurrents (je ne parle pas d'OP) serait quelque chose de bénéfique pour l'ensemble de l'écosystème crypto et associés ?On fera quoi quand CZ pètera un câble ? Binance est une secte entièrement dépendante de lui. Si demain il a un accident de bagnole, ça pue pour nos holdings. J'aimerais qu'ils ne soient pas les seuls à peser réellement dans la balance actuellementJe laisse le lien des volumes des CEX sur 24h pour illustrer mon propos : https://coinmarketcap.com/rankings/exchanges/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "debutant",
      "created_time": "March 14, 2023, 10:04:54 AM",
      "body": "Quote from: iwantmyhomepaidwithbtc2 on February 25, 2023, 07:07:20 PMQuote from: debutant on February 25, 2023, 02:45:42 PMRien de tel que la Binance card pour payer, simple efficace, pas de qrcode ou quelque manip que ce soit !Conforter Binance dans son quasi monopole ?Tu penses pas qu'avoir quelques concurrents (je ne parle pas d'OP) serait quelque chose de bénéfique pour l'ensemble de l'écosystème crypto et associés ?On fera quoi quand CZ pètera un câble ? Binance est une secte entièrement dépendante de lui. Si demain il a un accident de bagnole, ça pue pour nos holdings. J'aimerais qu'ils ne soient pas les seuls à peser réellement dans la balance actuellementJe laisse le lien des volumes des CEX sur 24h pour illustrer mon propos : https://coinmarketcap.com/rankings/exchanges/Perso, je choisi la rentabilité et la sécurité et surtout pas des copieurs venant d'anciens scams notoires !Ce projet est mort dans l'oeufQuand à CZ qui pétera un câble, ça n'est que pure spéculationCa sent tout de meme le rageux qui n'a pas su profiter de la croissance de Binance",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "March 14, 2023, 03:09:21 PM",
      "body": "Quote from: debutant on March 14, 2023, 10:04:54 AMPerso, je choisi la rentabilité et la sécurité et surtout pas des copieurs venant d'anciens scams notoires !Ce projet est mort dans l'oeuf  J'ai bien écrit que le projet est douteux, et dans mon message précédent que je n'incluais pas OP comme concurrent de Binance.Par contre Binance n'est pas synonyme de sécurité parce qu'ils ont un quasi monopole, c'est plutôt l'inverse, encore plus dans le secteur des cryptos. Ils sont non-stop target par des régulateurs, ce qui est \"moins\" le cas de certains de leur concurrents, normal, sachant que Binance a +90% de part de marché dans le secteur des CEX. Ils attirent bien trop l'attention et ont beaucoup trop de mal à maintenir des relations stables avec leurs processeurs FIAT pour être réellement safes.La Binance Card sécurisée ? Laisse moi rire, sur 2022 le support Européen (la BInance Card n'est que dispo en UE + Argentine) recevait en moyenne une centaine cas de hack \"réels\" par jour. Contis (le producteur de la carte) a eu par le passé de sacrés problèmes de fuites de données, il y a eu un précédent avec Revolut aussi par exemple. En octobre-novembre 2022 il y a eu une grosse fuite de données qui a impactés des milliers de transactions, de clients. Tout cela a été réglé bien sur, mais ça n'arrive pas à toutes les \"banques\" non plus. Et quand ça leur arrive, j'espère que leur support client est un peu plus pro que le support Binance l'a été.QuoteQuand à CZ qui pétera un câble, ça n'est que pure spéculationTu n'as pas compris l'idée derrière mon message ? Centraliser les cryptos via Binance => mauvaise idéeCentraliser les cryptos via Binance avec qu'une seule tête pensante aux commandes => dangereuxPersonne dans la boite, à part la numéro deux n'a de pouvoir de décision chez Binance. Et la numéro deux, n'a pas une masse de pouvoir, si ce n'est aucun, tu verras qu'elle sera très vite lost si CZ devait mourir ou se barrer du jour au lendemain. Elle doit être là pour rassurer les assureurs.QuoteCa sent tout de meme le rageux qui n'a pas su profiter de la croissance de BinanceFranchement ça va, ils me payaient grassement, les bonus annuels étaient dingues. Au début j'étais payé en full BNB, BUSD était pas encore dispo pour les salaires. Quand j'ai commencé chez eux, BNB était à 13 usd. Donc je considère avoir bien profité de la croissance de Binance, t'inquiète pas trop pour moi, mais c'est gentil",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "debutant",
      "created_time": "March 14, 2023, 03:34:35 PM",
      "body": "Dans ce cas, évites de cracher dans la soupe !Perso, Binance, Yearn Finance et ETH ont fait mon bullrun et aucun projets Français, bien au contraire !Team FR = red flag, en DEFI comme en CEFI Donc mini projet avec scammeur notoire, non merci car tel est ma critique sur Lyzi qui n'est là que pour exit les crédules en proposant quelque chose qui existe deja",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}