{
  "id": "topic_5432107",
  "title": "Outhue",
  "author": "Outhue",
  "created_time": "December 28, 2022, 06:41:34 AM",
  "content": "There are many projects asking investors to stake their tokens for APY but they collapsed later for example Midas, they offered 17% APY on USDC, the token went from 38$ to 0 and their swap feature is shut down.. I am just trying to warn you about Centralised Finance tokens and platforms, avoid taking big risks with CeFi Platforms. APY can be tempting at times, powerful enough to make you turn your back on the vital parts of the project, do not compare APY of a CeFi project with others especially when the project is not that popular. Now that we are even in a bear market, any projects offering high yield is a big red flag, this is not the time to focus on earning rewards.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432107",
  "comments": [
    {
      "author": "BlackBoss_",
      "created_time": "December 28, 2022, 07:15:31 AM",
      "body": "DeFi or CeFi.Bitcoin or altcoins.Altcoins or stable coins.Cryptocurrency or stocks.High yields sound like more similar to Ponzi which will die when their money flow gets broken. With them, the laer you join, the more risk you will be rekted by rug pulls, collapses, bankruptcies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "December 28, 2022, 08:10:40 AM",
      "body": "High APY rewards are just baits to get yourself to invest in their project without even thinking of its cons. Looks like this is their way to attract newbie investors but let me tell you this, I have already experienced such kind of investment and when they gather enough income, they most likely disappear and leave their investors like what happened to us but thankfully I haven't invested any money but only my bounty rewards got wrecked because I tried to hold it but I haven't figure out that it will lose its value once they don't develop their project anymore and it's too late before I realized my mistakes. So it's better to leave this kind of project because there is no way someone will actually give you that much except if they are hiding some real facts and agenda and most of the time it leads to a scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "December 28, 2022, 08:36:51 AM",
      "body": "Best example of this was the event on terra ust staking on Binance. The APY is really high that users are putting up their funds to stake. Even me got ruined by that offer and program. Fools Gold it is.Quote from: BlackBoss_ on December 28, 2022, 07:15:31 AMHigh yields sound like more similar to Ponzi which will die when their money flow gets broken. With them, the laer you join, the more risk you will be rekted by rug pulls, collapses, bankruptcies.It depends on the platform. Collaterizing some of those stablecoin could also turn out bad and reserve got compromise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maestro75",
      "created_time": "December 28, 2022, 09:40:28 AM",
      "body": "Quote from: cryptoaddictchie on December 28, 2022, 08:36:51 AMBest example of this was the event on terra ust staking on Binance. The APY is really high that users are putting up their funds to stake. Even me got ruined by that offer and program. Fools Gold it is.You are courageous to speak out and admit that you too also got fooled and your funds ruined by that. Alot of people will not admit it publicly because they fear the mockery that follows thereafter. But I have learned something from you now that everybody has their own mistakes they have made in life. Thank you for that. It is true that any staking site and project offering a high APY should be seen as a red flag that will later scam people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "December 28, 2022, 10:11:03 AM",
      "body": "Quote from: Outhue on December 28, 2022, 06:41:34 AMThere are many projects asking investors to stake their tokens for APY but they collapsed later for example Midas, they offered 17% APY on USDC, the token went from 38$ to 0 and their swap feature is shut down.. I am just trying to warn you about Centralised Finance tokens and platforms, avoid taking big risks with CeFi Platforms.This is a mix of \"if it's too good to be true then it's a scam\" and \"never keep money for long on centralized platforms\". Both keep to be preached and people still keep ignoring that in the name of earning some more fiat (ie fools' gold). Too bad.I've read too about Midas. It's just another one that bites the dust. 2022 has made plenty of casualties.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Getmon",
      "created_time": "December 28, 2022, 10:33:07 AM",
      "body": "Scams will continue to exist as long as billions of people lack proper education on money management. Swindlers will continue to mislead billions of people into believing they can make a fortune by taking advantage of them. Additionally, these con artists will continue to promote their bogus programs that can blind the greedy as long as there are greedy individuals. There is simply too much of a market for these con artists to stop. They can make money from it, so they won't stop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "December 28, 2022, 11:33:22 AM",
      "body": "Investing in a project that offers high yields on staking tokens should be done with extreme caution. Many projects have collapsed in the past, leaving investors with significant losses. Regardless of whether you invest in centralized finance (CeFi) or decentralized finance (DeFi) tokens and platforms, it's important to be aware of the risks involved. While these types of projects can offer attractive returns, they can also carry higher risks. There are no guarantees that any project will succeed, even if it seems legitimate and has a promising concept and a solid team. As with any investment, it's always a good idea to thoroughly research and make sure you understand all the risks involved before making an investment decision.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uchegod-21",
      "created_time": "December 28, 2022, 12:51:47 PM",
      "body": "Quote from: Outhue on December 28, 2022, 06:41:34 AMNow that we are even in a bear market, any projects offering high yield is a big red flag, this is not the time to focus on earning rewards. Whether in a bearish market or a bullish market, any project offering high yield is a complete red flag. Most times we try ask ourselves where the yield is coming from. Without we the investors are the yield. What the project owners do is to use the investment of about 30% of the investors to keep the system going until they cash out big and dump the project. If the market is in the bullish trend, they can manipulate it for a longer time, but the bearish market exhaust their breathe faster.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "December 28, 2022, 01:05:30 PM",
      "body": "not just for centralized financial platforms only. decentralized finance is also not that great when they offer quite a high APY. be aware of new or old platforms that offer that.I'll be honest, even if I'm staking on a platform like Binance, I wouldn't do it either. those assets that have large trades, will tend to be with small APY. but with new tokens, they usually offer high APY. but once you lock up your tokens, the state of the market value will change enormously. maybe the number of tokens we have will increase, but the value will decrease.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "December 28, 2022, 02:37:34 PM",
      "body": "All the services that gives you high APY are aimed at finding quick financing for investment plans, and if they have good financial management, this deficit will appear as a problem within two to four years, according to market conditions.As for what happens from the platforms that promise you quick profit, most of them fail within 6 months or the first test, which means that long-term retention of those currencies is a sure loss.Do not invest in these currencies for more than 3 months.Always sell when the color is green.Do not be greedy, because they collapse quickly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "December 28, 2022, 03:32:09 PM",
      "body": "Quote from: Maestro75 on December 28, 2022, 09:40:28 AM[quote author=cryptoaddictchie You are courageous to speak out and admit that you too also got fooled and your funds ruined by that. Alot of people will not admit it publicly because they fear the mockery that follows thereafter.Actually its the truth, speaking through my experience. I am blinded with the daily return of the Ust APY, I think some are too since its a top project that didnt expect a down fall like that. Well maybe charge to experience those mistakes and gonna be more careful next time. 2022 indeed is one of my worst year and I do hope that it will be lighten up next year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "December 28, 2022, 03:51:23 PM",
      "body": "The word centralised always have some strings attached to it and all these projects offering you high APY have set up with motive to earn personal profits out of your pocket and you loose like in this case.If we say about DeFi then we see lot of hacks in it as well like Ronin network hack worth $600 Million so do you consider it safe? We need to get more awareness that how to keep your funds safe and in your custody.Quote from: NeuroticFish on December 28, 2022, 10:11:03 AMThis is a mix of \"if it's too good to be true then it's a scam\" and \"never keep money for long on centralized platforms\". Both keep to be preached and people still keep ignoring that in the name of earning some more fiat (ie fools' gold). Too bad.I've read too about Midas. It's just another one that bites the dust. 2022 has made plenty of casualties.The people usually get attracted to high yield projects without even looking into the details that could end up their funds with these projects and they have high chance of rug but still they are ignorant enough derived by the greed factor that they invest money in them.We already have lot of case examples and information about how they are making fool of people through these lucrative offers and then stake your funds offering returns but you in end get nothing but still they ignore these examples and preaches going by their mind into scam projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oceat",
      "created_time": "December 28, 2022, 03:54:14 PM",
      "body": "Quote from: Maestro75 on December 28, 2022, 09:40:28 AMQuote from: cryptoaddictchie on December 28, 2022, 08:36:51 AMBest example of this was the event on terra ust staking on Binance. The APY is really high that users are putting up their funds to stake. Even me got ruined by that offer and program. Fools Gold it is.You are courageous to speak out and admit that you too also got fooled and your funds ruined by that. Alot of people will not admit it publicly because they fear the mockery that follows thereafter. But I have learned something from you now that everybody has their own mistakes they have made in life. Thank you for that. It is true that any staking site and project offering a high APY should be seen as a red flag that will later scam people. If it helps the reader to understand then why not share those mistakes, besides it's not about what the other people are thinking. It's the thought of helping the others that's why you share those mistakes that should not be repeated again.These \"fools gold\" are rampant in the altcoins/tokens they are all the same sharing the same ideology but at the end of the day, they just disappear leaving their investors in the air hanging with lots of losses. Anyone who tries to enter these kind of market should do their own research and be ready with the risk of losing or invest to what they can afford to lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "December 28, 2022, 08:46:15 PM",
      "body": "Quote from: Outhue on December 28, 2022, 06:41:34 AM for example Midas, they offered 17% APY on USDC, the token went from 38$ to 0 and their swap feature is shut down.This is yet another reason why some people call crypto scam: how can a token go from $38 to $0. I just imagine if a crypto newbie was introduced to such a project by a crypto enthusiast who was blinded by the high APY, the incident would definitely create a bad impression for the newbie.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "December 28, 2022, 09:16:31 PM",
      "body": "Hey dude, this is not the time to be thinking about APY especially from token like you mentioned. Just focus on investing because the bear market that is being held is an opportunity that you should take advantage of. I've never even been interested in staking, especially with the high APY percentage, it's just a trap that should be ignored.Remember these opportunities will disappear as the market recovers, so have the right mindset about investing and take advantage of the opportunities that exist. But of course you have to do it in an amount that you can afford to lose. Just increase your portfolio in bitcoin or it doesn't matter if you want to diversify it with some other assets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "December 28, 2022, 09:59:58 PM",
      "body": "OP, do not let the bear market keep you down, but rather use it to its advantage by investing into something worthwhile. If you are an investor, this is one of the best time to invest because prices have been dropping over a long period of time, and now you have many tokens with low price. Markets go in cycles, with peaks and valleys. The only thing that is certain is that markets will not stay down forever. We can make the most of this situation by not being greedy, learning to hold on to our coins and invest in more promising coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "December 29, 2022, 04:41:40 AM",
      "body": "This is why I said staking or invest in centralized company is really a dumb idea, they're too greedy to get those low APY but they take a risk to lost all of their coins. It's better for me to invest in Bitcoin and hold it on my non custodial wallet, the risk is almost 0% and there's a good chance I could get huge return in the future. So why I need to take huge risk to earn small return while I can go for low risk to earn huge return?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "December 29, 2022, 06:15:15 AM",
      "body": "Such a high percentage on its own should be a big red flag warning people to stay away from such things whether it is centralized shitcoin giving 17% APY or a centralized shitcoin that you think you are staking decentrally. This is a broken design used in monetary system too but there we have actual usage (ie fiat used in day to day transactions) so we only see inflation but in altcoins we have no usage but inflation that leads to people easily giving it up so they drop down to 0 (while fiat slowly loses value).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "December 29, 2022, 06:23:14 AM",
      "body": "Quote from: Outhue on December 28, 2022, 06:41:34 AMThere are many projects asking investors to stake their tokens for APY but they collapsed later for example Midas, they offered 17% APY on USDC, the token went from 38$ to 0 and their swap feature is shut down.. You shouldn't be patronizing any service that's centralized, they only have one fate which is collapsing and this can be caused from hacks or bad choices by the founders of the project just as we saw with the founder CEO of FTX exchange (Sam Bankman-Fried). You sending coins to this platforms only means you're giving up the ownership of your coins for some APY that mightn't be worth it due to the whole market dipping in price. The example by the OP is just one of the few ones that have left many people bankrupt this season. Avoid getting deceived by this promises by the project and just invest in well established project like Bitcoin that doesn't rely on the CEO for your investment to be profitable. During the bear market, lots of projects will collapses so it's best you stay away fro patronizing any service irrespective of them been decentralized or centralized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}