{
  "id": "topic_5399563",
  "title": "FMCPAY_GLOBAL",
  "author": "FMCPAY_GLOBAL",
  "created_time": "May 21, 2022, 02:42:14 AM",
  "content": "Terra posted three new revisions to its revival plan. This included increasing genesis liquidity, introducing a new liquidity profile and decreasing allocation for some holders.In a Tweet, Terra shared three major revisions to the proposed Terra revival and redistribution plan. These include increasing the genesis liquidity, introducing a new liquidity profile for pre-attack LUNA holders and decreasing the distribution to post-attack UST holders.Meanwhile, as some use the UST collapse to take a dig at the entire industry, some have tried to defend crypto. In an interview with Cointelegraph, Huobi Global co-founder Jun Du said that \"one bad apple in the short run will not affect [the] long-term demand for crypto.\"(Source: Cointelegraph)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5399563",
  "comments": [
    {
      "author": "JeffBrad12",
      "created_time": "May 21, 2022, 05:32:07 AM",
      "body": "Just wanna try to comment into the what already stated by co founder of huobi. He didn't even aware if this is also triggering so many governement to yelling about the regulation for the stable token. Even some regulators are thinking of the stable tokens issuers may come from the bankers. I think that that's for a long term but remember that if this can give so many people horrible experience with crypto. They are loosing their life but what was the worst thing other than it? He lost nothing and he can say that but people who have been loosing their life can't say like that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maestro75",
      "created_time": "May 21, 2022, 05:47:36 AM",
      "body": "Investors are not going to trust whatever plan Luna cones up with now. Those who list money will believe it is another way to scam them because how are they going to return Luna back when it has already minted more tokens. Those who will be happy with Luna will be those who bought millions of it with less than $10.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "May 21, 2022, 06:04:04 AM",
      "body": "Quote from: FMCPAY_GLOBAL on May 21, 2022, 02:42:14 AMMeanwhile, as some use the UST collapse to take a dig at the entire industry, some have tried to defend crypto. In an interview with Cointelegraph, Huobi Global co-founder Jun Du said that \"one bad apple in the short run will not affect [the] long-term demand for crypto.\"Of course. Othervise crypto would already be dead after silk road, mtgox, onecoin or bitconnect. No matter what scammer X do. Bitcoin will always be here.Quote from: FMCPAY_GLOBAL on May 21, 2022, 02:42:14 AMTerra posted three new revisions to its revival plan. Their plan was to back oce coin with second coin. It failed. Now their plan is to issue third token to rebuild value for the 2 that collapsed. Its it doomed to failure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adiebitsler",
      "created_time": "May 21, 2022, 08:07:03 AM",
      "body": "Quote from: FMCPAY_GLOBAL on May 21, 2022, 02:42:14 AMMeanwhile, as some use the UST collapse to take a dig at the entire industry, some have tried to defend crypto. In an interview with Cointelegraph, Huobi Global co-founder Jun Du said that \"one bad apple in the short run will not affect [the] long-term demand for crypto.\"What Jun Du said may be true and I think this will also apply to UST because it is said in the long term if UST doesn't die and is still alive as usual in the market even though every demand it always takes time to see an increase in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "May 21, 2022, 08:52:58 AM",
      "body": "This plan is complete crap. Most of the participants proposed to burn the Terra coins in order to recover the value of the stablecoin and keep the applications that need UST working. If the vote ends positively, then the old ecosystem will die.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittick",
      "created_time": "May 21, 2022, 01:33:31 PM",
      "body": "It will not work. This dictator called do known was trying to revive its project to avoid so many legal action against him. The fork token was just another useless solution in the current market. UST and LUNA are still dumping so hard. Any revival proposal that published by various parties will not work. This is the end for the terra luna. People are feeling skeptical with the revival plan that already planned. This dictator developers must face what he deserved as made so many people were loosing a lot of their money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "May 21, 2022, 02:34:56 PM",
      "body": "Quote from: bittick on May 21, 2022, 01:33:31 PMIt will not work. This dictator called do known was trying to revive its project to avoid so many legal action against him. The fork token was just another useless solution in the current market. UST and LUNA are still dumping so hard. Any revival proposal that published by various parties will not work.I agree he cannot just say I'm sorry then walk away, the investors who lose millions of dollars because of his failed mechanism and lack of right action will hold him accountable, this plan is a scapegoat to make up for the losses of its investors so the investors can have something to look forward QuoteThis is the end for the terra luna. People are feeling skeptical about the revival plan that is already planned. This dictator's developers must face what he deserved as made so many people were losing a lot of their money. Let's give him a chance but let's not give him 100% trust, this guy is so arrogant lets see if he change his character now that he is in an uphill climb, this is going to be a hard climb and he needs to show humility this time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "May 21, 2022, 04:20:22 PM",
      "body": "Quote from: Maestro75 on May 21, 2022, 05:47:36 AMInvestors are not going to trust whatever plan Luna cones up with now. Those who list money will believe it is another way to scam them because how are they going to return Luna back when it has already minted more tokens. Those who will be happy with Luna will be those who bought millions of it with less than $10.Correct, those that already lost their money to the scam known as Terra Luna do not have any more money or trust to spare, while those that did not lost their money are not going to care at all about the promises of a project that already failed once and that most likely will fail again, Terra Luna is done for and it is time people accept this simple reality, if they try to outsmart the markets and buy into this new coin then the chances that they will lose that money are very high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}