{
  "id": "topic_5407515",
  "title": "Tim1996",
  "author": "Tim1996",
  "created_time": "July 25, 2022, 04:21:38 AM",
  "content": "The Project Backed.finance is running the platform where users can buy startup coins and appreciate their wealth as the startup grows.Some of their marketing posts:Quote from: Backed_Finance on July 09, 2022, 09:13:46 AM#SpaceX officially becomes the first company on #BKD to break $1000 market cap. The upside of this #companycoin is mind blowing. Go to https://buff.ly/3Ieb9Ir to start trading #companycoin's today.More information at https://twitter.com/BackedTeam/status/1545418942700716033/photo/1How 50$ can turn into 300$Quote from: Backed_Finance on July 14, 2022, 04:06:25 PMThis Backer turned $50 into $300+ trading company coins on #Backed Check out their YouTube video covering it here:https://youtu.be/Lk6asEba36AMore information at https://twitter.com/BackedTeam/status/1547498468037595136I sent them a 9.1 Rated vulnerability report and they did not even appreciate it. What follows is their negligence and care for the investors or users who use their platform.They are pumping good money into marketing but when it comes to security they don't care even if an attacker attacks their clients. I did not expect this reply from a CTO of a company.More about the bug will be disclosed if the Backed.finance team does not reply to bitcointalk community.Their Announcement Post: https://bitcointalk.org/index.php?topic=5403653.0Their Website: https://backed.finance/Their Litepaper: https://backed.finance/litepaper@Bitcointalk community, any thoughts on this??",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407515",
  "comments": [
    {
      "author": "_BlackStar",
      "created_time": "July 25, 2022, 04:34:35 AM",
      "body": "Quote from: Tim1996 on July 25, 2022, 04:21:38 AM@Bitcointalk community, any thoughts on this??Feel free to post your thread on the Scam Accusations board if you believe there is evidence to say so.Reputation boards are for discussing more about user reputation. But any attempted scam, ponzi scheme or other things from an altcoin project must be in the correct board category. So move your thread there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "July 25, 2022, 06:13:32 AMLast edit: July 25, 2022, 06:26:44 AM by Rikafip",
      "body": "Quote from: Tim1996 on July 25, 2022, 04:21:38 AMMore about the bug will be disclosed if the Backed.finance team does not reply to bitcointalk community.If you really care about Backed Finance investors and want to prevent them from losing the money, why don't you provide the negligence evidence right now, instead of waiting for them to reply? Or are you maybe one of those bug hunters that are spamming projects with vulnerability reports and then asking for payment? edit: now I see that 5 days ago you threatened them to expose their vulnerability. They ignored your demand, 4 days passed since the deadline and vulnerability not disclosed yet. I might be wrong but to me this looks like a feeble attempt to get paid for that report.Quote from: Tim1996 on July 20, 2022, 10:47:03 PMWe are waiting for one more day and we will disclosure the vulnerability in public as backed.finance remain to be silent on the vulnerability issue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}