{
  "id": "topic_5450665",
  "title": "1miau",
  "author": "1miau",
  "created_time": "April 30, 2023, 12:52:32 AMLast edit: December 13, 2023, 10:24:22 PM by 1miau",
  "content": "Wichtig: die aktuellste Übersetzung des Originalbeitrags wird nun (ab 13.12.2023) von cygan bereitgestellt: https://bitcointalk.org/index.php?topic=5477701.0In Meta hat joker_josue ein neues Projekt von ihm vorgestellt (er ist offensichtlich Coder) und dort können Bitcointalk-Nutzer Bilder hochladen, um diese Bilder dann in ihre Beiträge einzubinden. Damit wäre die Seite von joker_josue eine Alternative zu bekannten Bilderseiten, wie Imgur. Zudem hat Imgur sowieso angekündigt hat, dass es demnächst anfängt, alte Bilder zu löschen. Der Fokus liegt dabei darauf, dass die Bilder dauerhaft dort gespeichert bleiben und schneller laden, was bei vielen Bilderseiten ein Problem darstellt. Hier die Übersetzung der originalen Ankündigung (wird derzeit überarbeitet): WWW.TALKIMG.COM Zweck  ____________________Zweck ist es, eine Seite ähnlich wie Imgur anzubieten, auf der man Bilder hochladen kann und die zudem praktisch und nützlich für jeden ist. Es ist beabsichtigt, dass die Bilder im Forum verfügbar bleiben und schnell laden.  Funktionen  ____________________- Alle hochgeladenen Bilder können nur im Forum verwendet werden (abweichende Anfragen bitte an joker_josue).- Neben JPG, JPEG, PNG kann man auch GIFs hochladen. - Bilder müssen eine Maximalgröße von 2,5 MB haben. - Sobald die Bilder hochgeladen wurden, können die Bilder nicht mehr gelöscht werden. Alle Bilder sind jedoch nur über den zum Zeitpunkt des Hochladens generierten Link abrufbar.- Bilder, die nicht sicher für die Arbeit sind, dürfen nicht hochgeladen werden. - Man muss sich kein Nutzerkonto auf der Seite erstellen, um Bilder hochladen zu können. - Die IP wird gespeichert, um Spammer identifizieren zu können. - Alle Metadaten der Bilder werden beim Hochladen gelöscht. - Es ist nur möglich, ein Konto auf der Webseite zu haben, wenn dies vom jeweiligen Nutzer angefordert wird und nach einer Analyse durch joker_josue.- Bilder werden auf einem Server gespeichert, der für TalkImg reserviert ist. Neu- Option im Code, um den BBCode bereits mit der aktuellen Höhe und Breite des Bildes zu adjustieren. Neu Bald verfügbare Funktionen  ____________________- Automatische Dateikonvertierung. - Größenänderung der Bilder, wie man es auch von BBCode kennt.  Langfristig  ____________________Langfristig plant joker_josue, dieses Projekt so lange wie möglich online halten zu können. Da er Coder ist, hat er mehrere Jahre Erfahrung mit Online-Galerien.  Server  _____________________Der Server für TalkImg steht sich in den Niederlanden und besteht aus NVMe-SSD-Festplatten, die die besten Lese- und Schreibgeschwindigkeiten garantieren. Es verwendet die LiteSpeed Web Server-Software, die eine bessere Leistung garantiert. Mit AMD EPYC-Prozessoren werden alle Informationen so schnell wie möglich verarbeitet. Die Gewährleistung dafür ist bereits für die kommenden Jahre gesichert und kann bei Bedarf verlängert werden. Accounts ____________________Dieser Dienstleistung ist ausschließlich für die Nutzung auf BitcoinTalk gedacht, in diesem Sinne können nur Forenmitglieder ein Konto auf TalkImg besitzen. Aus diesem Grund ist die Option zur Kontoerstellung für die breite Öffentlichkeit nicht verfügbar. Leute, die einen Account haben möchten, sollten sich per Nachricht an joker_josue wenden, um es anzufragen. Die Anfrage wird bearbeitet und wenn sie genehmigt wird, wird ein Account erstellt. Sicherungen ____________________Der Server erstellt täglich automatisch regelmäßige Sicherungen aller Webseiten-Inhalte, welche 30 Tage gespeichert werden.Wöchentlich wird eine Zip-Datei erstellt mit allen Bilder, die in der Woche zuvor hochgeladen wurden. Diese Datei wird man für 15 Tage herunterladen können: talkimg.com/tempbackups/ neu ZIP-Werkzeug _________________Ebenfalls stellt joker_josue ein Hilfswerkzeug bereit, mit dem man Bilder mit einer Größe von mehr als 2,5 MB komprimieren kann. Die Komprimierung kann allerdings die Bildqualität erheblich beeinträchtigen. Das Bild wird automatisch geladen, konvertiert und an TalkImg gesendet, wobei der Link des BBCodes für die Verwendung im Forum bereitgestellt wird. Dieses Werkzeug befindet sich noch in der BETA-Phase, und es können Fehler auftreten.Zugriff über folgenden Link: Bilder ZIP-Werkzeug - TalkImgneu Statistiken ________________Gesamtstatistiken, seit das Projekt gestartet wurde (April 28, 2023):                                                                      hochgeladene Bilder: 55.475beanspruchter Speicherplatz: 15.2GBLetzte Aktualisierung: 12.10.2023Monatliche Statistiken:Die Auswertung der monatlichen Aktivität in Form von hochgeladenen Bildern stellt joker_josue in einer separaten Statistik bereit: [Erste 15 Tage] [Mai 2023] [Juni 2023] [Juli 2023][August 2023][September 2023] Spenden und Werbung  ____________________Um das Projekt zu finanzieren, plant joker_josue, es durch Spenden sowie Werbung ähnlich der Werbebanner im Bitcointalk geben, die es vor einiger Zeit jeweils immer unter dem ersten Beitrag gab. Wenn jemand eine Anzeige auf TalkImg schalten möchte, kann joker_josue kontaktiert werden.- Spenden: Bezüglich der Spenden kann jeder, der dieses Projekt unterstützen möchte, seine Bitcoin-Spenden an die Adresse bc1qhwnncpdd8gfzqwjkk9n052wf7g9mvks3xaa7qa senden.- Werbung:Es wird eine Werbeanzeige auf der Webseite geben, ähnlich der Signaturen in den Profilen. Sollte ein Signaturkampagnenmanager eine Werbung auf TalkImg platzieren wollen, kann er joker_josue kontaktieren. . Mehr Details _________________Die Seite wird von joker_josue betrieben, welcher sie verwalten und Nutzer bei Rückfragen zur Verfügung steht.Er will sich gerne unsere Meinung und Vorschläge anhören; Dieser Dienst wurde für alle Mitglieder des Bitcointalks aufgelegt, um die Funktionen im Forum zu verbessern. Es ist beabsichtigt, dass dieses Projekt so lange wie möglich aktiv ist, unabhängig davon, ob es viel Akzeptanz erfährt oder nicht. Daher sind alle Bilder, die hochgeladen werden, für immer verfügbar. Nützliche Links und Sonstiges __________________TalkImgNutzungsbedingungenDatenschutzerklärungNeu Signatur zur Unterstützung von TalkImg###[Erweiterung] Fügt im Menü eine Schaltfläche hinzu, um ein Bild direkt aus dem Forum heraus hochzuladen - Erstellt von TryNinja[Script] Imgur zu TalkImg - repariert die nicht funktionierenden Bilder automatisch - Erstellt von TryNinja Lokale Forenbereiche __________________Hier gibt es Übersetzungen in weitere lokale Forumsbereiche: العربية (Arabic) Kavelj22Bahasa Indonesia (Indonesian) dansus021Bengali roksana.heeDeutsch (German) 1miauEspañol (Spanish)  PorfiriiPakistan (Urdu) JunaidAziziPilipinas PeanutswarPolski cyganPortuguês (Portuguese) joker_josuePyccкий (Russian) zasad@Română (Romanian) GazetaBitcoinTürkçe (Turkish) mindrustHier geht es zur Seite: https://www.talkimg.com/Hier geht es zum Originalbeitrag von joker_josue, der auch regelmäßig von ihm aktualisiert wird: TalkImg.com - Image hosting for BitcoinTalkIn diesem selbstmoderierten Faden gelten die allgemein anerkannten Regeln: - Kein Off-Topic- Keine Pyramidenzitate- Kein unnötiges Denglisch- Keine Beiträge oberflächlicher Qualität (Shitposts)- Keine Diffamierungen- Keine unnötigen Memes / GIFs- Kein GetrolleWir bitten um Beachtung.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450665",
  "comments": [
    {
      "author": "cygan",
      "created_time": "May 03, 2023, 08:00:49 AM",
      "body": "@1miau seit deinem eröffnungspost hat sich auf der seite einiges getan und joker_josue hat diese etwas überarbeitet. wäre angebracht diese übersetzung dann am laufenden zu halten um den fortschritt und die entwicklung des neuen projektes zu sehen ich persönlich benutze schon diesen bilderservice für meine beiträge und muss echt sagen, dass es ohne probleme funktioniert und die ganze prozedur sehr leicht zu verstehen ist. die bilder in den jeweiligen beiträgen werden auch schneller geladen/angezeigt",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "May 03, 2023, 11:23:57 AM",
      "body": "Schönes Projekt von joker_josue.Ich habe soeben einen Test durchgeführt und das hat wirklich gut geklappt!Danke für die Übersetzung und vielleicht magst du diese neue Möglichkeit auch noch in Bilder im Bitcointalk verwenden erwähnen 1miau.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "May 04, 2023, 12:12:04 AM",
      "body": "Quote from: cygan on May 03, 2023, 08:00:49 AM@1miau seit deinem eröffnungspost hat sich auf der seite einiges getan und joker_josue hat diese etwas überarbeitet. wäre angebracht diese übersetzung dann am laufenden zu halten um den fortschritt und die entwicklung des neuen projektes zu sehen ich persönlich benutze schon diesen bilderservice für meine beiträge und muss echt sagen, dass es ohne probleme funktioniert und die ganze prozedur sehr leicht zu verstehen ist. die bilder in den jeweiligen beiträgen werden auch schneller geladen/angezeigtHallo cygan, danke für den Hinweis. Der Originabeitrag von joker_josue ist tatsächlich ziemlich gewachsen. Ich werde die Änderungen, die ich eben teilweise ergänzt habe, am Wochenende komplettieren und auch das Design hier an das Design von joker_josue anpassen, damit es einheitlich ist (Farben, Überschriften) etc. Dass der Beitrag so wächst, hätte ich nicht gedacht, und mein Beitrag war erste eher als Zusammenfassung gedachtAber der Vollständigkeit halber werde ich dann das Design + alle Unterpunkte von joker_josue übernehmen.  Quote from: mole0815 on May 03, 2023, 11:23:57 AMDanke für die Übersetzung und vielleicht magst du diese neue Möglichkeit auch noch in Bilder im Bitcointalk verwenden erwähnen 1miau.Auf jeden Fall, habe ich dort ergänzt. Danke für den Tipp.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "May 12, 2023, 12:29:48 AM",
      "body": "Soeben hat imgur offenbar die Funktion deaktiviert, dort Bilder ohne Account hochzuladen bzw. diese Bilder können nun nicht mehr in Bitcointalk eingebunden werden und auch alle anderen Bilder in der Vergangenheit dort hochgeladenen Bilder werden nicht mehr im Forum angezeigt. Diese sind aber noch über den normalen Link auf imgur aufrufbar, sodass sie wieder gesichert und auf einer anderen Seitem wie z.B. TalkImg von joker_josue hochgeladen werden können. Einige Beiträge haben jetzt also Lücken, was echt schade ist...Ob imgur nur kurzfristige Probleme hat, ist aktuell noch nicht klar aber es wird vermutlich besser sein, jetzt auf TalkImg von joker_josue umzusteigen, da imgur sowieso alle alten Bilder löschen wollte.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bullrun2024bro",
      "created_time": "May 12, 2023, 10:18:00 AM",
      "body": "Quote from: 1miau on May 12, 2023, 12:29:48 AMOb imgur nur kurzfristige Probleme hat, ist aktuell noch nicht klar aber es wird vermutlich besser sein, jetzt auf TalkImg von joker_josue umzusteigen, da imgur sowieso alle alten Bilder löschen wollte. Die Frage ist, ob es sich wirklich nur um kurzfristige Probleme handelt, oder ob der \"Bitcointalk proxy error\" jetzt länger bestehen bleibt. Da ich in der Vergangenheit ausschließlich imgur für Uploads benutzt habe, sind dementsprechend alle meine Bilder weg (außer die, die ich komischerweise in den letzten Tagen hochgeladen habe, siehe letzte Posts). Ein Upload ist auch als nicht-registrierter Nutzer weiter möglich. Ich habe es gerade getestet. Ob das so bleibt, kA. Ich werde dann für die Zukunft auch den Service von @joker_josue nutzen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Buchi-88",
      "created_time": "May 12, 2023, 10:30:46 AM",
      "body": "Mir ist es auch schon aufgefallen, dass einzige was ich sehr eigenartig finde ist (ich lade immer direkt mit Greenshot die Bilder auf imgur) einige Bilder funktionieren noch und einige nicht? Aber hat wer bessere Kenntnisse in der Programmierung oder hat der neue Anbieter für BCT auch ein Api?Also Beispiel in der Greenshot.iniCode:; Greenshot Imgur Plugin configuration[Imgur]; Url to Imgur system.ImgurApi3Url=https://api.imgur.com/3; What file type to use for uploadingUploadFormat=png; JPEG file save quality in %.UploadJpegQuality=80; Reduce color amount of the uploaded image to 256UploadReduceColors=False; Copy the link, which one is controlled by the UsePageLink, on the clipboardCopyLinkToClipboard=True; Use pagelink instead of direct link on the clipboardUsePageLink=False; Use anonymous access to ImgurAnonymousAccess=True; Is the title passed on to ImgurAddTitle=False; Is the filename passed on to ImgurAddFilename=False; Filename for the Imgur uploadFilenamePattern=${capturetime:d\"yyyyMMdd-HHmm\"}; Imgur upload history (ImgurUploadHistory.hash=deleteHash)~Könnte man die Adresse mit der neuen Api einfach austauschen, würde ich dann auch testen und in meinen Greenshot Thread ergänzen. Denke, dass sollte nicht das große Problem darstellen?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bullrun2024bro",
      "created_time": "May 12, 2023, 10:34:24 AM",
      "body": "Quote from: Buchi-88 on May 12, 2023, 10:30:46 AMMir ist es auch schon aufgefallen, dass einzige was ich sehr eigenartig finde ist (ich lade immer direkt mit Greenshot die Bilder auf imgur) einige Bilder funktionieren noch und einige nicht? Aber hat wer bessere Kenntnisse in der Programmierung oder hat der neue Anbieter für BCT auch ein Api?@theymos hat sich bereits geäußert, dass er sich nicht auf ein Katz und Mausspiel mit imgur einlassen möchte und keine Veränderungen vornehmen wird.Die Nutzer sollen am besten auf einen anderen Service ausweichen, siehe hier:Quote from: theymos on May 12, 2023, 12:41:48 AMI think that what it is is that imgur added a new very restrictive per-IP limit on image downloads. So all ip.bitcointalk.org requests are blocked, but even many Tor exit nodes are being blocked, for example.I'm not going to attempt to play some cat-and-mouse game with imgur, so people will just have to use a different service such as TalkImg.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Real-Duke",
      "created_time": "May 12, 2023, 10:57:36 AM",
      "body": "Ich habe bisher immer problemlos ImgBB genutzt, aber werde ab sofort auch zu TKi umschwenken.Hatte mir den Link direkt nach dem Beitrag von 1miau hier abgespeichert und nehme die Probleme mit imgur jetzt als Anlass zum Wechsel.Prima das solche Projekte innerhalb unser eigenen Community entstehen und wenn möglich, sollte man sie auch unterstützen. Danke @joker_josue",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "May 12, 2023, 12:05:57 PM",
      "body": "ihr könnt euch, mit hilfe diesen von TryNinja erstellten skripts, euch das ganze noch bisschen einfacher machen und direkt durch den damit neuerstellten 'button' 'knopf'  eure bilder in eure beiträge hochladen und müsst nicht direkt auf die TalkImg seite gehen Quote from: TryNinja on May 10, 2023, 01:11:12 AMI don't know if @joker_josue is giving anyone who asks an account and API key, but if he is... you can use this script to add a button that instantly uploads an image directly from the forum!Install here: https://greasyfork.org/en/scripts/465886-bitcointalk-image-upload-button-talkimg✂",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "5tift",
      "created_time": "May 12, 2023, 12:11:45 PM",
      "body": "Praktisch, dank Dir für die Info.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "May 12, 2023, 10:40:43 PMLast edit: May 13, 2023, 01:30:46 AM by 1miau",
      "body": "Quote from: cygan on May 12, 2023, 12:05:57 PMihr könnt euch, mit hilfe diesen von TryNinja erstellten skripts, euch das ganze noch bisschen einfacher machen und direkt durch den damit neuerstellten 'button' 'knopf'  eure bilder in eure beiträge hochladen und müsst nicht direkt auf die TalkImg seite gehen Schaltfläche.  Quote from: bullrun2020bro on May 12, 2023, 10:18:00 AMQuote from: 1miau on May 12, 2023, 12:29:48 AMOb imgur nur kurzfristige Probleme hat, ist aktuell noch nicht klar aber es wird vermutlich besser sein, jetzt auf TalkImg von joker_josue umzusteigen, da imgur sowieso alle alten Bilder löschen wollte. Die Frage ist, ob es sich wirklich nur um kurzfristige Probleme handelt, oder ob der \"Bitcointalk proxy error\" jetzt länger bestehen bleibt. Da ich in der Vergangenheit ausschließlich imgur für Uploads benutzt habe, sind dementsprechend alle meine Bilder weg (außer die, die ich komischerweise in den letzten Tagen hochgeladen habe, siehe letzte Posts). Das wäre zu hoffen, dass es nur kurzfristige Störungen sind. Zumindest die Tatsache, dass die Bilder nach wie vor auf imgur per Link erreichbar sind, lässt auf diese Variante hoffen. Wenn die Vermutung von theymos stimmt, dass imgur da einen neuen Filter eingebaut hat, wird es ebenfalls schwer, dass sich das nochmal ändert. Vielleicht, wenn es viele Beschwerden gibt. Langfristig wird imgur aber wohl alle Bilder löschen, was natürlich sehr schade ist, da dadurch viele Inhalte im Forum verloren gehen werden... Quote from: bullrun2020bro on May 12, 2023, 10:18:00 AMEin Upload ist auch als nicht-registrierter Nutzer weiter möglich. Ich habe es gerade getestet. Ob das so bleibt, kA. Ja, hochladen ist dort weiter möglich aber leider werden die Bilder im Forum nicht mehr angezeigt. Zum Glück kann man weiterhin über den Link alte Bilder erreichen, sie herunterladen und auf einer anderen Seite wieder hochladen. Wenn man wichtige Bilder nicht mehr selbst gespeichert hat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "May 14, 2023, 02:01:32 PM",
      "body": "TryNinja hat nun ein browserskript entwickelt, das es ermöglichen soll, alle imgur.com links, die in dem eigenen beitragsverlauf gefunden werden, automatisch hochzuladen und zu bearbeiten (einschließlich derer in zitaten, die von anderen Leuten gemacht wurden).wie das ganze funktionieren soll und alle weiteren informationen findet ihr im offiziellen thread: [Script] Imgur to TalkImg - automatically fix your broken imagesaber irgendwie will das skript noch nicht so funktionieren, wie ich mir das vorstelle - habe es komplett durchlaufen aber die bilder werden trotzdem nicht angezeigt. mal schauen was TryNinja dazu später sagt",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "May 15, 2023, 03:16:29 PM",
      "body": "Sehr cool und die Erweiterung (das Script) von TryNinja habe ich erst jetzt entdeckt.Freut mich wenn BCT nun eine eigene (und noch bessere) Lösung bieten wird als bisher möglich Ein paar Kinderkrankheiten gilt es noch zu verbessern aber im Endeffekt wird das sicher gut!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "May 28, 2023, 07:33:36 PM",
      "body": "Scheint so, als ob die Bilder, die auf Imgur hochgeladen wurden, wieder im Bitcointalk angezeigt werden können. Hier ein Beispiel, die Bilder im Beitrag sind noch vom imgur: https://bitcointalk.org/index.php?topic=5213245.msg53464506#msg53464506Bilder werden zumindest bei mir angezeigt.  Edit nach Absenden dieses Beitrags, siehe unten*In der Zukunft würde ich trotzdem lieber TalkImg verwenden, denn das sollte langfristiger sein, zumal Imgur angekündigt hat, nach und nach alle alten Bilder, die keinem imgur-Account zugeordnet sind, zu löschen. *Edit: scheint sich dabei nur um alte Beiträge zu handeln, die \"repariert\" wurden, in neuen Beiträge bekomt man diese Nachricht, wenn man dort Bilder von imgur verwenden will:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "May 30, 2023, 05:25:29 PM",
      "body": "Ich habe \" Gott sei Dank \" das problem mit den Bildern nicht da ich Imgur wenn es hochkommt nur 1 oder 2 mal benutzt habe.Die meisten älteren Bilder von mir sind auf picr.de hochgeladen worden und immernoch verfügbar und auch gesüeichert dort , ok man muß dazu sagen das ich dort eine Spende gemacht habe und deswegen auch vorzüge habe oder gehabt habe.Aber seit 1 bis 2 jahren benutze ich nur imgbb.com ohne probleme und dies funktioniert immer noch hier im Forum.Ich muß auch ehrlich gestehen das ich TalkImg noch nicht benutzt habe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bct_ail",
      "created_time": "June 01, 2023, 01:51:48 PM",
      "body": "Quote from: cygan on May 14, 2023, 02:01:32 PMTryNinja hat nun ein browserskript entwickelt, das es ermöglichen soll, alle imgur.com links, die in dem eigenen beitragsverlauf gefunden werden, automatisch hochzuladen und zu bearbeiten (einschließlich derer in zitaten, die von anderen Leuten gemacht wurden).wie das ganze funktionieren soll und alle weiteren informationen findet ihr im offiziellen thread: [Script] Imgur to TalkImg - automatically fix your broken imagesHat Buchi-88 für uns übersetzt. Danke dafür.https://bitcointalk.org/index.php?topic=5454613.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Buchi-88",
      "created_time": "June 01, 2023, 01:53:51 PM",
      "body": "Quote from: bct_ail on June 01, 2023, 01:51:48 PMHat Buchi-88 für uns übersetzt. Danke dafür.https://bitcointalk.org/index.php?topic=5454613.0Bitte gerne, leider habe ich es selbst noch nicht getestet, hat das Skript schon jemand erfolgreich getestet? Ich sollte es auch einmal probieren, habe ja auch sehr viele Bilder bei Imgur liegen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "June 01, 2023, 04:30:58 PM",
      "body": "@Buchi-88ich habe es schon getestet und es funktioniert wunderbar. wenn man viele beiträge und viele bilder in seiner posthistory aufzuweisen hat, dann braucht das script schon länger....bei mir war es so, dass ich es über nacht laufen lassen habe. ganz wichtig dabei ist folgendes zu beachten: wenn das script gestartet ist, dürft ihr bitcointalk nicht benutzen!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Buchi-88",
      "created_time": "June 02, 2023, 08:39:01 AM",
      "body": "Quote from: cygan on June 01, 2023, 04:30:58 PM@Buchi-88ich habe es schon getestet und es funktioniert wunderbar. wenn man viele beiträge und viele bilder in seiner posthistory aufzuweisen hat, dann braucht das script schon länger....bei mir war es so, dass ich es über nacht laufen lassen habe. ganz wichtig dabei ist folgendes zu beachten: wenn das script gestartet ist, dürft ihr bitcointalk nicht benutzen!Danke für deine Erfahrung damit, also kann man das auf seinen PC ohne schlechtes Gewissen ausführen. Das mit dem benutzen von Bitcoin Talk steht auch in der Anleitung, werde ich dieses Wochenende auch einmal machen und laufen lassen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}