{
  "id": "topic_5474540",
  "title": "Fivestar4everMVP",
  "author": "Fivestar4everMVP",
  "created_time": "November 18, 2023, 10:02:03 AMLast edit: November 18, 2023, 10:50:18 AM by Fivestar4everMVP",
  "content": "I don't know about you guys, but for me, I have discovered that the longer one save in fiat, that is, hold fiat, the more life gets expensive, this is because fiat is known to lose value overtime for several reasons, when fiat loses value, they lose purchasing power, goods and services become more expensive, which in turn makes life more expensive.This experience I coined from the current economic hardship my country is going through.The naira lost significant value against some other major fiat currencies, most especially the dollar, this has made things in the country very expensive, which has also made life very expensive to live here in Nigeria.But for those who have been saving investing, saving in bitcoin, and maybe some other major cryptocurrencies, life is cheaper as we all have seen that overtime, the price of bitcoin increases, and when this happens, major altcoins too experience the boom, thereby making good profit for those who spent fiat accumulating when the prices are low.This is why I personally implore us all to be wise in how we choose to save our money,Keep one million dollars in the bank for 10 years, by the time the 10 years is over, you pull out your one million and discover it can't buy much because things are no longer at the same price as they were 10 years ago.But keep one million dollars in bitcoin for 10 years, by the end of the 10 years, one million dollars must have turned into 5 million dollars or more, and even if things have become more expensive in the market, this money will pay for it all and you will still have a lot of money left to do other things.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474540",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "November 18, 2023, 10:18:57 AM",
      "body": "Yes, definitely bitcoin is better. But it is worth knowing about bitcoin and know the right time to invest.It is better you mention the altcoins. This is because some people will invest or have all their fiat on some altcoins and it would be the worst regret of their lives.Some altcoins did not got to all-time-high when bitcoin and some other altcoins got to all-time-high in 2020/2021. Many altcoins can be gambled with while their prices have been plummeted to their lowest, but because they may not reach all-time-high, those that invested before when their prices are high may be losing. Some altcoins are just dead. So research, knowledge and experience are all important.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "November 18, 2023, 10:20:03 AM",
      "body": "No one has earned a million dollars while the other keeps it in the bank, especially if there is high inflation in his local currency or opportunities to invest it. Even banks contact you to offer you safe and low-risk investment opportunities, but the return from investing a million dollars varies according to your investment. It is true that investing in Bitcoin is profitable, but not Put your eggs in one basket and diversify your investments according to the options available to you while investing in unrelated asset classes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ultrloa",
      "created_time": "November 18, 2023, 10:34:04 AM",
      "body": "Quote from: Fivestar4everMVP on November 18, 2023, 10:02:03 AMI don't know about you guys, but for me, I have discovered that the longer one save in fiat, that is, hold fiat, the more life gets expensive, this is because fiat is known to lose value overtime for several reasons, when fiat loses value, they lose purchasing power, goods and services become more expensive, which in turn makes life more expensive.It will be expensive to save fiat because we will encounter some inflation issue and that decrease the purchasing power of our save fiat for long time. Unlike if we save Bitcoin and other top cryptocurrencies where it gives us huge potential to earn a lot of money especially if the price of bitcoin and other alts goes pretty much higher than we expect. For sure from that we can buy a lot of things that's why we think about its cheap because we can afford it.The only problem with this is the transaction fee of bitcoin since if we encounter the same case happening right now where the fees is so high then maybe we will get hurt paying high amount of money each transaction we made. So hopefully some can find a solution to aid up these issue since bitcoin is good to transact when fees is so cheap and for sure no one will think that this is also expensive and might all people would ever think about using this for more future use.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rachael9385",
      "created_time": "November 18, 2023, 10:45:13 AM",
      "body": "Quote from: Fivestar4everMVP on November 18, 2023, 10:02:03 AMI don't know about you guys, but for me, I have discovered that the longer one save in fiat, that is, hold fiat, the more life gets expensive, this is because fiat is known to lose value overtime for several reasons, when fiat loses value, they lose purchasing power, goods and services become more expensive, which in turn makes life more expensive.Correct, I am a Nigerian and in my country, our fiat currency is losing weight and the dollar is increasing as days pass by and those that invested their funds in the fiat naira have lost almost everything because the naira have no value and the cost of commodity is high.So it is a bad idea for one to invest his or her money in any fiat currency because fiat currency is at risk.Cryptocurrency (Bitcoin) is safer than fiat, so we should invest our funds in Bitcoin.Quote from: hugeblack on November 18, 2023, 10:20:03 AMNo one has earned a million dollars while the other keeps it in the bank, especially if there is high inflation in his local currency or opportunities to invest it. Even banks contact you to offer you safe and low-risk investment opportunities, but the return from investing a million dollars varies according to your investment. It is true that investing in Bitcoin is profitable, but not Put your eggs in one basket and diversify your investments according to the options available to you while investing in unrelated asset classes.You are apparently correct, because I haven't heard of any story whereby someone invested his or her fiat currency in a fiat bank and gets a million profit. But in Bitcoin, an investor can decide to invest 2 or more million dollars in Bitcoin and hold it for 10 years and get more than a million profit (although it's not guaranteed). However, I still agree that it is not advisable to invest all eggs in one place because they might get broken, but if they invest in separate places, like real estate business, fiat and Bitcoin, it will be better and safer than investing in one place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "November 18, 2023, 11:27:54 AM",
      "body": "Quote from: Fivestar4everMVP on November 18, 2023, 10:02:03 AM...This is why I personally implore us all to be wise in how we choose to save our money,Keep one million dollars in the bank for 10 years, by the time the 10 years is over, you pull out your one million and discover it can't buy much because things are no longer at the same price as they were 10 years ago.But keep one million dollars in bitcoin for 10 years, by the end of the 10 years, one million dollars must have turned into 5 million dollars or more, and even if things have become more expensive in the market, this money will pay for it all and you will still have a lot of money left to do other things.Every year, the power of money continues to decrease and it seems as if the price of goods is increasing even though in reality the value of the money is decreasing. If you have Bitcoin as an investment then you have protected the value of your money from a drastic decline due to inflation. In the next few decade, the price of Bitcoin will continue to rise and those who want to buy Bitcoin will have to spend more money to get it, therefore invest in Bitcoin from now on using the DCA method.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "November 18, 2023, 11:57:19 AM",
      "body": "Saving money in bank is actually the last thing I should be thinking of because banks are indirectly extorting us with exorbitant charges whereby if you had 1m Naira in your bank account by the end of the month you would noticed it's no longer 1m rather 999k, okay let say you wanna save for about 2 to 3 years you would noticed that you won't get exact figure in return and due to economic crisis you would noticed that such money is no place to be quantified to have a quality goods or product worths such amount but if invested in bitcoin or any foreign currencies that we knows that always gain weight over our currency, it  will appreciates overtime whereby if you decide to have back your money in local currency you will be amazed with the profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "November 18, 2023, 12:18:10 PM",
      "body": "agreed but btc is still not used completely by society you still need fiat better to have different kinds of savings one for daily expenses / one for emergency purposes / and one for investment or in cryptocurrency specifically you can’t save money for emergency in cryptocurrency because most markets are volatile there’s no assurance that by the time you need the money it has doubles or seen some profit it might even go lower for some altcoins so divide your money smart",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kentrolla",
      "created_time": "November 18, 2023, 12:29:13 PM",
      "body": "Bitcoin do beat inflation and fiat is no match to that considering the interest we earn from banks. We need to understand one thing that never go with a single asset for all your investments I would rather put 50% or 40% of my investments into Bitcoin followed by a mix of startups,  real estate and stocks. But never with Altcoins on a longer run as you mentioned even if Altcoin reaches ATH it will eventually drop and there is no guarantee that it will pump back hence I would skip Altcoin and yeah hodling fiat is one of the biggest blunders one can make. I would choose Bitcoin over Fiat anyday but need to take entry at the right moment it should be the peak of Bitcoin you invest your funds and wait for years to even make a break even, and occasionally you may convert your hodling to fiat whenever it's at peak of you have invested during bearish market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "November 18, 2023, 12:29:41 PM",
      "body": "You're spot on, OP. It's very obvious, except for those who've refused to realize that inflation has a way of dealing with fiat. This isn't the case with Bitcoin and that's because Bitcoin (from its angle as an asset) increases in value. It's not advisable to pile up cash in the bank as savings. The best thing to do is swap the cash for Bitcoin every pre-halving year and then wait till a post-halving year to reap the maximum dividends. As for inflation bitten countries like mine, those in cryptos in these countries who've swapped their fiat stand a double chance of earning both ways – the exchange angle and the rise in Bitcoin value. So, it's a win situation to keep funds in Bitcoin than in banks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Liliana1304",
      "created_time": "November 18, 2023, 12:32:22 PM",
      "body": "It's easier to lead your life with Bitcoin than the fiat of your country because that way you know your holdings are safe provided you have your keys because you won't be receiving messages from your bank telling you they took a certain amount to maintain your credit card or bank without your permission and also your privacy is assured unlike the traditional banks where they want to be all about your business using the guise of KYC and due diligence services.With the way inflation is biting hard, your millions in the bank become worthless as you won't be able to get the exact value for it. Bitcoin makes life cheaper but if it doesn't get accepted as a world means of exchange, we'd still need to convert it to fiat when we want to purchase what we need and to me, there lies the problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "November 18, 2023, 01:30:53 PM",
      "body": "FIAT is not for saving. It is only good for spending. It is because of the inflation the central banks create as you already pointed out. The more assets you own, the richer you are. Even if the central banks raise the interest rates to a ridiculous number (like 10%+), eventually they will have to lower them again and then asset prices will go up against the dollar. The only fools here are those who sell their assets (unless they have to sell it for various real life reasons) during that high interest period. Do you sell your house or car just because the rates went up? Then you shouldn’t sell your investments too because your investments make you money. They may fail to make big money today but that will eventually change in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "November 18, 2023, 01:37:37 PM",
      "body": "It's because that fiat can't skip the inflation that a country is going through. Most of the fiat currencies today are suffering inflation and devaluation. Whilst for Bitcoin, it is a deflationary asset and that's why it's best for us to keep savings in there. Some people might argue that it's not best for them looking at their economic situation and that's fine. But for the most of us, we've seen where it is better to save money and that's through Bitcoin. As you save, you don't only save but you also invest.Quote from: Fivestar4everMVP on November 18, 2023, 10:02:03 AMBut keep one million dollars in bitcoin for 10 years, by the end of the 10 years, one million dollars must have turned into 5 million dollars or more, and even if things have become more expensive in the market, this money will pay for it all and you will still have a lot of money left to do other things.While I am a believer of Bitcoin and based on our calculations this could happen or even more than that. But I just want to say that we don't know what can happen in 10 years time. A lot of things really can happen and change.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "November 18, 2023, 01:39:29 PM",
      "body": "Quote from: Fivestar4everMVP on November 18, 2023, 10:02:03 AMI don't know about you guys, but for me, I have discovered that the longer one save in fiat, that is, hold fiat, the more life gets expensive, this is because fiat is known to lose value overtime for several reasons, when fiat loses value, they lose purchasing power, goods and services become more expensive, which in turn makes life more expensive.This experience I coined from the current economic hardship my country is going through.The naira lost significant value against some other major fiat currencies, most especially the dollar, this has made things in the country very expensive, which has also made life very expensive to live here in Nigeria.But for those who have been saving investing, saving in bitcoin, and maybe some other major cryptocurrencies, life is cheaper as we all have seen that overtime, the price of bitcoin increases, and when this happens, major altcoins too experience the boom, thereby making good profit for those who spent fiat accumulating when the prices are low.This is why I personally implore us all to be wise in how we choose to save our money,Keep one million dollars in the bank for 10 years, by the time the 10 years is over, you pull out your one million and discover it can't buy much because things are no longer at the same price as they were 10 years ago.But keep one million dollars in bitcoin for 10 years, by the end of the 10 years, one million dollars must have turned into 5 million dollars or more, and even if things have become more expensive in the market, this money will pay for it all and you will still have a lot of money left to do other things.Yes and no.Don't forget that :- The price of cryptocurrencies is subject to huge jumps, both up...and down.- prices of goods are formed in local currencies or world currencies (dollar)- in a sufficient number of countries - cryptocurrency, to put it mildly - is either outlawed or income from crypto-trading is subject to additional taxes - your salary - 99.999% of the population - is in local, fiat currencies So until the situation changes on all counts, cryptocurrency is still a risky investment, but not a means of settlements for everyday life",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lombok",
      "created_time": "November 18, 2023, 01:56:20 PM",
      "body": "Quote from: mindrust on November 18, 2023, 01:30:53 PMFIAT is not for saving. It is only good for spending. It is because of the inflation the central banks create as you already pointed out. The more assets you own, the richer you are. Even if the central banks raise the interest rates to a ridiculous number (like 10%+), eventually they will have to lower them again and then asset prices will go up against the dollar. The only fools here are those who sell their assets (unless they have to sell it for various real life reasons) during that high interest period. Do you sell your house or car just because the rates went up? Then you shouldn’t sell your investments too because your investments make you money. They may fail to make big money today but that will eventually change in the future.Fiat is indeed suitable for spending to meet the needs of each country. However, using it as long-term savings is not the right choice. If it takes 5 to 10 years, perhaps the money we save will be meaningless because money continues to experience inflation every year. We can feel this for real, in the 1990s $100 was already a lot and could cover 2 months' living needs in my country, currently $100 can only last for 1 week or less. Maybe gold could help with the store of value problem, but after Bitcoin appeared we could have a better option. Gold investment is also complicated, having to go through KYC, has quite large taxes and a fairly large buying and selling gap. It is clear that Bitcoin has more advantages compared to investing in gold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "November 18, 2023, 02:03:46 PM",
      "body": "That happens in many countries. That is why we are advised to have investments in the form of crypto or gold. This is to anticipate the worst possibility that could happen in our country. By having investments, at least we can prepare ourselves and our families.Investing in Bitcoin has provided clear evidence that Bitcoin is the best choice we have today. Even though there are still many people who still choose gold, we can also still choose Bitcoin as our main investment. A million dollars that we save in the bank won't be able to buy many things in the future. But a million dollars in bitcoin could have a higher price in the future.For this reason, we have to prepare ourselves from now on before everything changes and we start too late.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "November 18, 2023, 02:12:49 PM",
      "body": "Quote from: Fivestar4everMVP on November 18, 2023, 10:02:03 AMI don't know about you guys, but for me, I have discovered that the longer one save in fiat, that is, hold fiat, the more life gets expensive, this is because fiat is known to lose value overtime for several reasons, when fiat loses value, they lose purchasing power, goods and services become more expensive, which in turn makes life more expensive.Life is indeed sweeter with bitcoin if we indeed know how to achieve this beauty in it, I've seen some some always complaining about bitcoin all because their level of understanding about it is very poor, we cannot be doing what is not safe and expected the best from it, some don't know how to maintain a perfect security measures, wallet to use or how to safely store their wallet private keys for their privacy, some might have been scammed as well for some reasons they permitted for that unknowingly to them, yet out of these countless diverse experience, bitcoin is still better than fiat if we understand how to make use of this decentralized digital currency for our privacy and security, including being profitable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "November 18, 2023, 02:13:16 PM",
      "body": "Quote from: michellee on November 18, 2023, 02:03:46 PMThat happens in many countries. That is why we are advised to have investments in the form of crypto or gold.Gold today is not a good investment to beat inflation, rather to hold value, and I think that is partly because Bitcoin has eaten into the market. Before Bitcoin, people who could save to escape inflation basically had gold, and then the rich had real estate, bought shares and things like that. Today we have the bitcoin, and also to escape inflation you can share index funds or shares of good companies, because it is not like 40 years ago, you can do it with small capitals, with low commissions and from your mobile phone. But of course, and it is normal that we say this in this forum, the best would be bitcoin, although you have to take into account the volatility, as DrBeer says.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "November 18, 2023, 02:15:06 PM",
      "body": "Totally agree to this. I’m not this kind of financially independent before I start on Bitcoin investments and just relying to my salary. Everything changes when I invest on Bitcoin 2015 using my major savings on bank but the amount is not that huge at that time. I put my future in Bitcoin that and I’m so glad that my gamble works a lot. Right now I still have some of my early Bitcoin investments while I barely touch my salary since I earn a lot now on trading and my investment. This will not happened if I just stay working and never venture to Bitcoin. So yeah, Life is indeed cheaper if you invest in Bitcoin in long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "November 18, 2023, 02:24:08 PM",
      "body": "Keeping the coins safe is important too, otherwise the one million dollars worth bitcoin will turn zero the next time you check. Keeping devices secure and not falling for phishing scams is important here.Although in many countries crypto is still in an outlaw state, the people there are collecting it secretly. I hope they dont fall in trouble because of this and eventually governments will be forced to become lenient about it.My portfolio has a mix of all types of asset class as I dont like being all-in on one, but defenitely crypto is a promising asset of them all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}