{
  "id": "topic_5461431",
  "title": "letteredhub",
  "author": "letteredhub",
  "created_time": "July 29, 2023, 08:50:19 PM",
  "content": "There's this scene I witnessed today at a local sport betting house  and I found it very funny and unbelievably true at same time. A certain young man after making his predictions placed his bet and his betting slip was printed to him then another gambler in the house approached him and asked to make a rebet of his games for himself but I was shocked when the young man refused with the excuse that he doesn't share his predictions that sharing it will make him lose his bet. More like having his luck to win reduce or changed maybe because the person he shared his games with could be someone with a bad luck on that day.Although I have heard of behaviors like this with some gamblers  but I never believe it not until I witnessed it myself today and it was weird to me imagining how you will get to lose your bet by allowing someone else rebet it. In all my years of gambling I believe that a game prediction that will play as predicted will definitely play not regarding the number of people that bet on same prediction. So why this belief or do you think it could be true? Or is it one of those superstitious belief among gamblers?Do you feel cool sharing your predictions with other people and how has the outcome been looking at all the times you have shared your predictions with others?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461431",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "July 29, 2023, 08:55:35 PM",
      "body": "Quote from: letteredhub on July 29, 2023, 08:50:19 PMSo why this belief or do you think it could be true? Or is it one of those superstitious belief among gamblers?Do you feel cool sharing your predictions with other people and how has the outcome been looking at all the times you have shared your predictions with others?The gambler has staked already, so there is nothing that can change that, it is just a superstition if true that is the reason.But we can think another reasons too. If I am the person that someone asked to stake the bet that I have staked, I will not answer the person if the person is a stranger or we do no know each other very well like a friend. I can let a my brother, family or a friend stake what that I staked, but not just anybody.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DoublerHunter",
      "created_time": "July 29, 2023, 08:57:40 PM",
      "body": "^ Wow, that is quite a fascinating and humorous story you witnessed at the sports betting house! It is not uncommon to encounter superstitious beliefs among gamblers, and this instance exemplifies one such belief. Some gamblers may feel that sharing their predictions could somehow alter their luck or reduce their chances of winning. However, in reality, the outcome of a bet should not be influenced by how many people share the same prediction. Gambling is based on probabilities, and each bet is independent of others, regardless of whether they share the same prediction. We know that gamblers do this but I can understand that some gamblers probably feel reluctant to share their predictions due to such superstitions. In the end, gambling is a game of chance, and sharing predictions with others should not affect the outcome.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "summonerrk",
      "created_time": "July 29, 2023, 09:07:33 PM",
      "body": "Quote from: letteredhub on July 29, 2023, 08:50:19 PMSo why this belief or do you think it could be true? Or is it one of those superstitious belief among gamblers?Do you feel cool sharing your predictions with other people and how has the outcome been looking at all the times you have shared your predictions with others?Once upon a time, I would have considered this behavior very strange. But after all these years of trading, I perfectly understand the person who refused to share his forecast. Now I will explain why using the example of my trading forecasts for bitcoin. When I do a technical analysis of graffiti, then at these moments I am absolutely sure that everything is right and correct. But if I share this analysis with another trader, I will have a feeling that the illusion of my rightness and confidence will crumble. I don't know why this is so, but this phenomenon exists.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "July 29, 2023, 09:11:57 PM",
      "body": "The belief that sharing game predictions with others could bring bad luck or reduce the chances of winning is indeed a superstitious belief among some gamblers. It's important to note that superstitions vary widely among individuals, and there's no logical reason to believe that sharing predictions would directly affect the outcome of the bet.In reality, the outcome of a bet is determined by random chance and the factors affecting the game being bet on, not by whether the prediction was shared or kept private. Sharing predictions with others should not have any impact on the actual results.Personally, I always exchange predictions with friends while placing sports bets at the local casino, and I don't find any problem at all. I don't feel that the people close to me are unlucky.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "July 29, 2023, 09:12:47 PM",
      "body": "I have heard and seen some bettors refuse to give out predictions they think will win due to the fact that they don’t have money so they feel if they give it out the person who’s going to wager on it will be the one profiting instead let the game end without anyone winning.But as for them being greedy after placing a bet I haven’t seen it before, it probably might be a superstition that they believe will happen if they give out their predictions to others and I call it a BS giving out your predictions has nothing to do with your winnings. People just do it to satisfy their greedy and selfish urges nothing else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Quidat",
      "created_time": "July 29, 2023, 09:15:06 PM",
      "body": "Quote from: letteredhub on July 29, 2023, 08:50:19 PMThere's this scene I witnessed today at a local sport betting house  and I found it very funny and unbelievably true at same time. A certain young man after making his predictions placed his bet and his betting slip was printed to him then another gambler in the house approached him and asked to make a rebet of his games for himself but I was shocked when the young man refused with the excuse that he doesn't share his predictions that sharing it will make him lose his bet. More like having his luck to win reduce or changed maybe because the person he shared his games with could be someone with a bad luck on that day.Although I have heard of behaviors like this with some gamblers  but I never believe it not until I witnessed it myself today and it was weird to me imagining how you will get to lose your bet by allowing someone else rebet it. In all my years of gambling I believe that a game prediction that will play as predicted will definitely play not regarding the number of people that bet on same prediction. So why this belief or do you think it could be true? Or is it one of those superstitious belief among gamblers?Do you feel cool sharing your predictions with other people and how has the outcome been looking at all the times you have shared your predictions with others?This is really just a belief on which there are really some gamblers who are really that sensitive when it comes on sharing up their bets and possible with those reasons that had mentioned above.But in overall it is really just that a belief because there's no such thing about factors which could affect your luck because if you are lucky then you would win but if not then you would definitely lose.It doesnt really matter nor mind on what you are dealing with.I dont really see any mistakes or anything about this kind of behavior since we do have our own approach when it comes to thingson which it would be normal that there might be some things that look odd or awkward but actually there's nothing we can do if they would really be having that kind of beliefs towards things.We could really be able to see the weirdest of the weirdest around but there are actually people who had been having that kind of behavior or something that they do follow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "July 29, 2023, 09:16:21 PM",
      "body": "Quote from: letteredhub on July 29, 2023, 08:50:19 PMSo why this belief or do you think it could be true? Or is it one of those superstitious belief among gamblers?Do you feel cool sharing your predictions with other people and how has the outcome been looking at all the times you have shared your predictions with others?Don't blame that gambler for his action, for he might have his reasons aside from his belief and faith when it comes to someone's bad luck affecting them and reducing their winning chances.If I can recall correctly, there was a year when a local betting platform called \"Bet9ja\" brought out an option. I can't tell if the option was added by mistake or not, but all I could remember was that some shared that option with others, and everyone predicted using that option, which could have been the downfall of that betting platform if they allowed everyone to cash out their winnings, as they recorded the highest number of winnings in that particular period, and they came up the next day and declared that option as an error and decided to refund everyone who played using that option.If the person who noticed that decided to hide it from others and played the game alone, and the number of wins was not that massive, would it have been possible for the betting site to detect that and cancel the whole game? This could also be the reason why the person refuses to share his game; maybe there is a special code in it that he doesn't want anyone to know about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.suevie",
      "created_time": "July 29, 2023, 09:23:01 PM",
      "body": "Quote from: letteredhub on July 29, 2023, 08:50:19 PMThere's this scene I witnessed today at a local sport betting house  and I found it very funny and unbelievably true at same time. A certain young man after making his predictions placed his bet and his betting slip was printed to him then another gambler in the house approached him and asked to make a rebet of his games for himself but I was shocked when the young man refused with the excuse that he doesn't share his predictions that sharing it will make him lose his bet. More like having his luck to win reduce or changed maybe because the person he shared his games with could be someone with a bad luck on that day.Although I have heard of behaviors like this with some gamblers  but I never believe it not until I witnessed it myself today and it was weird to me imagining how you will get to lose your bet by allowing someone else rebet it. In all my years of gambling I believe that a game prediction that will play as predicted will definitely play not regarding the number of people that bet on same prediction. So why this belief or do you think it could be true? Or is it one of those superstitious belief among gamblers?Do you feel cool sharing your predictions with other people and how has the outcome been looking at all the times you have shared your predictions with others?I don't know why you feel this kind of behavior is strange well in my place it's pretty normal among gamblers to be kind of secretive with their bets and I know a particular friend who is found of this of act and the worst part is that even with all the secretive things he is doing he doesn't even actually win although he won't announce if he is actually winning but I know that most gamblers just do this since they don't want to blame anyone for their losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "July 29, 2023, 09:36:54 PM",
      "body": "I'm shocked to hear this because I always see on many websites and on youtube videos and articles where the guys who do analysis talk about the teams that they believe will win the game and that they bet on that team, I've always seen this for years, so hearing that it could be bad luck is a big absurdity that honestly I didn't expect to hear, everyone or at least most people should know that sports betting doesn't depend on luck so there's no reason for a person not to talk about who bet but it is true that in the case of the lottery for exampleI have heard people in my country say that they cannot say they bought a lottery ticket because it could be bad luck and for that reason people in my country hardly say they are playing the lottery, I confess that I laugh a lot about it because people in my country my parents take this belief very seriously that when someone buys a lottery ticket they cannot tell other people because it will be bad luck, they reached the level of when they go to buy the tickets they hide their faces or they arrange for the worker to go buy them but they lie to the worker telling him that the note is for a very distant relative",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odusko",
      "created_time": "July 29, 2023, 09:46:59 PM",
      "body": "Quote from: Oshosondy on July 29, 2023, 08:55:35 PMQuote from: letteredhub on July 29, 2023, 08:50:19 PMSo why this belief or do you think it could be true? Or is it one of those superstitious belief among gamblers?Do you feel cool sharing your predictions with other people and how has the outcome been looking at all the times you have shared your predictions with others?The gambler has staked already, so there is nothing that can change that, it is just a superstition if true that is the reason.But we can think another reasons too. If I am the person that someone asked to stake the bet that I have staked, I will not answer the person if the person is a stranger or we do no know each other very well like a friend. I can let a my brother, family, or a friend stake what that I staked, but not just anybody.I won't blame the gambler too much because some negative energy can also affect his emotions towards whatever the outcome of the bet may be, when I was far away from gambling and hard not to try out my luck towards sports bets, I use to chase my friends who use to stake sport bet away from me because I believe that I was giving them bad luck since at that time I hate sports bets even though I haven't tried it before. Watching football for the fun of it is what has motivated me into active gambling mostly in sports bets, so as far as I know, some gamblers have their personal beliefs or privacy protection and we must respect that right.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "July 29, 2023, 09:52:00 PMLast edit: July 29, 2023, 10:12:00 PM by TimeTeller",
      "body": "Quote from: Odusko on July 29, 2023, 09:46:59 PMQuote from: Oshosondy on July 29, 2023, 08:55:35 PMQuote from: letteredhub on July 29, 2023, 08:50:19 PMSo why this belief or do you think it could be true? Or is it one of those superstitious belief among gamblers?Do you feel cool sharing your predictions with other people and how has the outcome been looking at all the times you have shared your predictions with others?The gambler has staked already, so there is nothing that can change that, it is just a superstition if true that is the reason.But we can think another reasons too. If I am the person that someone asked to stake the bet that I have staked, I will not answer the person if the person is a stranger or we do no know each other very well like a friend. I can let a my brother, family, or a friend stake what that I staked, but not just anybody.I won't blame the gambler too much because some negative energy can also affect his emotions towards whatever the outcome of the bet may be, when I was far away from gambling and hard not to try out my luck towards sports bets, I use to chase my friends who use to stake sport bet away from me because I believe that I was giving them bad luck since at that time I hate sports bets even though I haven't tried it before. Watching football for the fun of it is what has motivated me into active gambling mostly in sports bets, so as far as I know, some gamblers have their personal beliefs or privacy protection and we must respect that right.This shows your personal belief on certain occasions, but luck will play a great role on this.You may have had such belief because you may have had experience it and hence, forming in your mind that there's some factor in play.However, it may very well be a coincidence why such luck in that route of betting. But who knows? So you try to follow such route every time you bet. Whatever belief you may come up with, it is better to share it with your family or close friends rather than strangers, which may not know what they are thinking after you share it with them.And it all comes down to respect of each other's beliefs. It may not be true, but let them believe what they want. If you are not up to it, just politely decline whatever he wants you to do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "July 29, 2023, 10:06:04 PM",
      "body": "Quote from: Oshosondy on July 29, 2023, 08:55:35 PMQuote from: letteredhub on July 29, 2023, 08:50:19 PMSo why this belief or do you think it could be true? Or is it one of those superstitious belief among gamblers?Do you feel cool sharing your predictions with other people and how has the outcome been looking at all the times you have shared your predictions with others?The gambler has staked already, so there is nothing that can change that, it is just a superstition if true that is the reason.But we can think another reasons too. If I am the person that someone asked to stake the bet that I have staked, I will not answer the person if the person is a stranger or we do no know each other very well like a friend. I can let a my brother, family or a friend stake what that I staked, but not just anybody.When we are in the gambling house affiliation or relativeness ought not to matter with sharing your already staked game with a fellow gambler. At that moment we are gambling we are with same interest and that interest sought of bind us together against the gambling house for that moment alone a brother-like bond is in place. If you win, I win we  exchange handshake go home smiling",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "July 29, 2023, 10:19:50 PM",
      "body": "As far as I know, many professional athletes are very superstitious and have whole rituals before a match. Maybe that sentiment carries over to sports gamblers as well. I mean, we've all heard about players wearing lucky socks, following specific routines, or even eating the same meal before every game. It's like they believe these rituals bring them luck or help them perform better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "July 29, 2023, 10:20:11 PM",
      "body": "Quote from: letteredhub on July 29, 2023, 08:50:19 PMThere's this scene I witnessed today at a local sport betting house  and I found it very funny and unbelievably true at same time. A certain young man after making his predictions placed his bet and his betting slip was printed to him then another gambler in the house approached him and asked to make a rebet of his games for himself but I was shocked when the young man refused with the excuse that he doesn't share his predictions that sharing it will make him lose his bet. More like having his luck to win reduce or changed maybe because the person he shared his games with could be someone with a bad luck on that day.Although I have heard of behaviors like this with some gamblers  but I never believe it not until I witnessed it myself today and it was weird to me imagining how you will get to lose your bet by allowing someone else rebet it. In all my years of gambling I believe that a game prediction that will play as predicted will definitely play not regarding the number of people that bet on same prediction. So why this belief or do you think it could be true? Or is it one of those superstitious belief among gamblers?Do you feel cool sharing your predictions with other people and how has the outcome been looking at all the times you have shared your predictions with others?What do you mean if it could be true? Why would it be true? I mean it could be true that he believed what he said, but other than that, it has no basis on reality.And i am not sure what's the issue here. Guy was most likely superstitious. Everyone of us sort of have magical thinking as we are playing against better odds to win more. Or it could be that he didn't want to be the cause of someone else losing, this is the reason i am not giving any advices for my friends about what they should invest in cryptos. Because i don't want to be the cause and have that awkward conversation when they lose everything.And there's always a change for that he was so sure about his winning but he didn't want to anyone else to win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "July 29, 2023, 10:24:20 PM",
      "body": "Quote from: letteredhub on July 29, 2023, 08:50:19 PMSo why this belief or do you think it could be true? Or is it one of those superstitious belief among gamblers?Do you feel cool sharing your predictions with other people and how has the outcome been looking at all the times you have shared your predictions with others?This is one of the gamblers' fallacies that sharing his prediction will nullify his luck.  We all know that this kind of thing is not true since prediction results can go either way depending on whose team is performing better and sharing information about the bet does not affect that result.I am not comfortable sharing(talking about) my prediction with unknown people or strangers but I gladly talk about it with my friends.  But if I am asked politely I would probably tell the person my bet without explaining why.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "July 29, 2023, 10:30:35 PM",
      "body": "Quote from: letteredhub on July 29, 2023, 08:50:19 PMA certain young man after making his predictions placed his bet and his betting slip was printed to him then another gambler in the house approached him and asked to make a rebet of his games for himself but I was shocked when the young man refused with the excuse that he doesn't share his predictions that sharing it will make him lose his bet. There are some precautions we should always take care of whenever we are gambling because many can affect us and can be trickish on us especially when we are not used to the way some gamblers relate, there's no edge in sharing thesame game with someone, you can make suggestions or get them other alternative to gamble aside the exact link and game you've played, anyone interested so much in gambling should learn instead of relying on others, don't also make the mistake of misplacing your slip of allowing them have access to it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "July 29, 2023, 10:36:18 PM",
      "body": "Quote from: letteredhub on July 29, 2023, 08:50:19 PM So why this belief or do you think it could be true? Or is it one of those superstitious belief among gamblers?Do you feel cool sharing your predictions with other people and how has the outcome been looking at all the times you have shared your predictions with others?It is weird but it's not the weirdest, one of the reasons he doesn't want to share his bet is he doesn't want to share the pool money in case his bet wins, there are a lot of superstitions when it comes to horse racing some of the superstitions are looking on the horse for a sign or looking for the weather because there are horses that are good on a type of weather and some looking on the jockeys, they don't only bet on the record and the combination of the horses and jockey they also look for outward signs like betting on particular hours before the race started.Every horse racing bettor has a sign that they follow and the other bettors respect this belief, it's to each its own when it comes to belief and bettors' tradition.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "July 29, 2023, 10:43:56 PM",
      "body": "That is nonsense, mate. Some people are just so deliberately wicked and greedy that they don't want you to have their luck. I mean, they would not want a situation where if they win the game, you will also win it because of their help. Sometimes, too, some people are just so uneducated (like illiterates) that they end up living with some kind of superstitious belief. So, in either case, the man is probably affected by one thing, either illiteracy or greed. I have not heard of anything close to this; even in my area, you will see gamblers share gambling codes among themselves that another gambler has already predicted and staked.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "July 29, 2023, 10:53:13 PM",
      "body": "Quote from: letteredhub on July 29, 2023, 08:50:19 PMSo why this belief or do you think it could be true? Or is it one of those superstitious belief among gamblers?Do you feel cool sharing your predictions with other people and how has the outcome been looking at all the times you have shared your predictions with others?No one knows whether it's true. The truth of the matter is that everyone has their beliefs which often solidifies if it works for them. But IMO? It's not true (my belief differs from the gambler in question). In my experience, I get the same luck whether or not I share my predictions with people. There are macro factors that determines the outcome of these events that might not necessarily be linked to or tied to our beliefs.But if it works for him, he should keep it that way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}