{
  "id": "topic_5463024",
  "title": "romor",
  "author": "romor",
  "created_time": "August 12, 2023, 09:42:32 AM",
  "content": "Symmetrization of the \"Satoshi\" mystery BTC---------------------Little anecdote…It was in high school, I must have been 15, was sitting next to my best friend in physics class.Professor Boyer had given us an exercise and I was not really the best student, I had even repeated a class in college.But that day, by the greatest of luck, I seemed to find the result of the problem by using a different method than expected.Professor Boyer, his eyes plunged into my sheet, looked up at me and said \"You'll go far\" and continued around the tables.My best friend asked me how I had done. And I just couldn't answer him. Unaware of the thought process that had brought me to this result.I now come back to the title of this subject and I will not dwell on the how of the why since I am unable to do so, as with physical exercise. It is above all the unconscious crossing of years of research and cross-information on this subject, organized in an insoluble way for my consciousness.As an intuition, I propose here a new identity behind the pseudonym \"Satoshi Nakamoto\". It will be up to the community, if the idea germinates, to explore this and I apologize but it seems my nature.One name: Valery Chalidze (1938-2018)A USSR-born physicist, Soviet dissident and human rights activist. His nationality was withdrawn in 1972 following a trip to the USA where he remained until the end of his life.To get to the point, the potential evidence of his involvement in Bitcoin can be found in his book “Entropy Demystified: Potential Order, Life and Money” released in 2000.It includes the origin of proof of work and the genesis of the new iteration of human currency: Bitcoin.The key words revolve around thermodynamics, entropy, order and disorder and information theory, not to mention money of course. The book is exciting in many ways.You can find the pdf on waybackmachine at:https://web.archive.org/web/20181101233633/http://www.worksofvalerychalidze.com/uploads/1/0/2/8/102863812/entropy.pdfI thought long and hard about the implication of the symmetrization of the mystery of \"Satoshi\" identity.If it is confirmed by the community that Valery Chalidze is potentially the best entropy-reducing proposition on this issue, I hope that the rest of his work especially in cosmology will potentially be recognized and disseminated as the work, not of a new Einstein. Better, like the Chalidze on XXI century.https://web.archive.org/web/20181101233226/http://www.worksofvalerychalidze.com/The information is transmitted.Ps: Bitcoin is almost 15 years old, I think it's time for the community to know the identity of its father. I also learned at this age why my father had been absent from my birth to my six years, a long trip turned into a stay in prison.15 years old, maybe the age of a certain maturity.---------------------ROMOR",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463024",
  "comments": [
    {
      "author": "348Judah",
      "created_time": "August 12, 2023, 11:11:00 AM",
      "body": "Quote from: romor on August 12, 2023, 09:42:32 AMBitcoin is almost 15 years old, I think it's time for the community to know the identity of its father.How can the community do that if not Satoshi himself do so, but the surprising part of it is that nothing of such will ever happen, if what bitcoin is all about is on privacy and decentralization, then Satoshi being the father of bitcoin as you call it will always remain anonymous, what does it have to benefit you if he comes out today that am Satoshi, what we needed is the solution he gave and not his physical appearance.Quote from: romor on August 12, 2023, 09:42:32 AMI also learned at this age why my father had been absent from my birth to my six years, a long trip turned into a stay in prison.15 years old, maybe the age of a certain maturity.Haven't you heard about many children whose parents cannot be traced any any means and yet they lived their life and survived it, don't even bring in the idea maybe Satoshi is in prison or so in other not to bring another controversial discussion on your thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "August 12, 2023, 11:23:48 AM",
      "body": "Quote from: romor on August 12, 2023, 09:42:32 AMPs: Bitcoin is almost 15 years old, I think it's time for the community to know the identity of its father.You should have just gone straight to this point, rather than the long text.But no, the community doesn't need to know the identity of Satoshi. Privacy is a very important aspect of BTC, so just as i wouldn't want you or anyone in this forum to know my identity, Satoshi also probably wants the same thing, and he would be disappointed if the community join in the unnecessary manhunt for him, everyone deserves privacy, including Satoshi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}