{
  "id": "topic_5515166",
  "title": "wtfmidn",
  "author": "wtfmidn",
  "created_time": "October 25, 2024, 11:06:03 PM",
  "content": "Hi, I've just learnt that Cardano is integrating with the Bitcoin blockchain which will apparently facilitate new/better/trustless capabilities for bitcoin wrt smart contracts and verification etc.. I'm no expert but some Cardano fans such as CCV (not sure if I'm allowed to print his full name) on YT seem to think that this is very big news for both Cardano and Bitcoin. So, I was just wondering what the experts here think about that? Thanks in advance for any replies.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5515166",
  "comments": [
    {
      "author": "headingnorth",
      "created_time": "October 26, 2024, 07:20:56 AM",
      "body": "No Cardano is a scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 26, 2024, 07:23:38 AM",
      "body": "Cardano has failed to be an alternative or at least a strong competitor to Ethereum and does not seem to be profitable in the short term so any attempt to integrate with the Bitcoin blockchain will only be a temporary price pump but the general trend of the coin is to fail to offer smart contract transactions better than some altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SickDayIn",
      "created_time": "October 26, 2024, 07:40:08 AM",
      "body": "Cardano is just another project that hasn't delivered on promises. Makes you question about these altcoons, they exist to make the owners money and that's it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "October 26, 2024, 09:52:12 AM",
      "body": "I've heard the news, people out there are over-hyping the partnership between Cardano (ADA) and BitcoinOS, but I don't think it's that important. I think this is just Charles Hoskinson's way of rekindling the crypto public's interest in Cardano (ADA).Q: Is this integration important?A: Yes, this integration is important, but not for Bitcoin (BTC), only Cardano (ADA) has an interest here. Bitcoin does not need anything else outside the original network, it would only worsen the image of Bitcoin itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Larreate.x",
      "created_time": "October 26, 2024, 10:48:34 AM",
      "body": "Quote from: headingnorth on October 26, 2024, 07:20:56 AMNo Cardano is a scam. Yes, Cardano can be seen as a scam due to its unfulfilled promises and frequently missed development deadlines. Its technical complexity makes the project hard to grasp for many, which fuels distrust. Compared to competitors like Ethereum and Solana, Cardano struggles to build a strong community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "October 26, 2024, 09:36:29 PM",
      "body": "As I smelled that this could be related to one of my favourite topics (Layer 2's) I searched a bit about that \"integration\". And in general I support the idea to use blockchains which don't see much use, like Cardano, as a kind of Bitcoin sidechain.It seems BitcoinOS is a software platform to verify ZK proofs on the Bitcoin chain, see their website. In their whitepaper they state that they aim to improve on BitVM (one of the most innovative projects in the Bitcoin space) by simplifying the model and optimizing it for some use cases like bridges, so the scripts can become smaller, which looks interesting at a first glance.However, the whitepaper is a bit shallow. In general the system seems to work like a normal ZK rollup on Ethereum (or at least, how they \"claim\" to work in the future, because most of them are still 100% centralized). But the challenge is of course to replace Ethereum's turing-complete language with a construction in Bitcoin Script which really works.Until now I'm not really impressed because it doesn't seem to offer really many advantages over already existing bridge systems like tBTC (Threshold Network), but I'll continue to observe the BitcoinOS project. It seems however a bit strange that despite of the bold claims they make (basically to solve all of BitVM's problems) there doesn't seem much discussion about their solution in the \"Bitcoin-academic\" community. It looks more like most projects I've analyzed in the Sidechain observer, of which many are only of very limited usefulness and very centralized (to avoid using the S-word prematurely ...).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "headingnorth",
      "created_time": "October 26, 2024, 10:54:28 PM",
      "body": "Quote from: Larreate.x on October 26, 2024, 10:48:34 AMQuote from: headingnorth on October 26, 2024, 07:20:56 AMNo Cardano is a scam. Yes, Cardano can be seen as a scam due to its unfulfilled promises and frequently missed development deadlines. Its technical complexity makes the project hard to grasp for many, which fuels distrust. Compared to competitors like Ethereum and Solana, Cardano struggles to build a strong community. So called smart contracts and cross-chain bridges are a hacker's paradise. Virtually every single one that has ever been developed has been hacked and drained of its funds at one time another, often more than once and often to the tune of millions of dollars in losses. I wouldn't be surprised if the \"hackers\" were often the developers themselves. That is why they are called shitcoins, only good for promoting stupid crap like memecoins and NFTs, while  getting hacked and drained of funds over and over. A great way for idiots to lose their money. The variety of ways for idiots to lose their money to these scams are endless. As the saying goes, ethereum is the mother asshole from which the shitcoins spring. Also, a fool and his money are soon parted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "October 26, 2024, 11:00:32 PM",
      "body": "It bonds with Bitcoin supposedly to 'help' Bitcoin in a way?  There is no way Bitcoin can be helped by Cardano to be honest.  Every single Cardano user has likely heard of Bitcoin, but not all Bitcoin users have heard of Cardano.  Nor does Cardano bring any thing impressive to the game.  It is just an Altcoin like most others.  No thing special to see.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "October 27, 2024, 04:20:45 AM",
      "body": "This is a scam using a scam using a scam group using a scam project created by scammers to scam people. The only relationship to bitcoin is that they are using the name to hype their scam and hope to get some newbies onboard in order to take their money.Otherwise Cardano, BitcoinOS, Sovryn and all their crap token sales is just crap they've created to rip people off.Hopefully they continue keeping their garbage in their separate networks and don't infect bitcoin and its blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}