{
  "id": "topic_5398479",
  "title": "AEX2013",
  "author": "AEX2013",
  "created_time": "May 13, 2022, 10:37:47 AMLast edit: May 16, 2022, 02:47:50 AM by AEX2013",
  "content": "On May 13, MoonDAO token will be officially listed on AEX Global. AEX Global will open spot trading pair: MOONEY/USDT, and will partner with MoonDAO to send 30,000 MOONEY and $20,000 GAT to the community as an airdrop. On the airdrop event, AEX Global launched Deposit activity, Trading Contest, Referral event and Community Interaction etc.https://qph.cf2.quoracdn.net/main-qimg-7013ead41b395f03a909c4f2160e3e2d-pjlqMoonDAO is an international collective of people united by the mission of decentralizing access to space research and exploration. MoonDAO represents a decentralized, international, inclusive and transparent space exploration method. The token MOONEY will be used to manage the dencentralized community, and the holders of MOONEY token can vote for the policy made by MoonDAO. The total issue amount of MOONEY token is 2.61 billions.MoonDAO has a forward-looking vision on its concept and is trying to combine space exploration and NFT application, which drawed an attention of AEX Global Listing Committee. MoonDAO will support funding for individuals to go to space and fund future space research and exploration as it fits into the mission of becoming a governing body for the moon and other celestial bodies.The total prize amount in the airdrop pool is 20,000 MOONEY. AEX has opened the deposit of MOONEY Token and with any amount of MOONEY deposit, users can claim 40-800 MOONEY airdrop tokens. First come first served.MOONEY Trading Contest allows users to share $10,000 GAT. Users who trade more than 20 USDT in MOONEY/USDT can share the $10,000 GAT prize pool.Invite friends to trade MOONEY and share $10,000 GAT. Users who invite friends to trade MOONEY/USDT and reach 20 USDT can get the same amount that friends earned in the GAT prize pool.Community interaction has a prize pool of 10,000 MOONEY and the prize will be sent in the branding campaign and community activities. Users who participate in the AEX&MoonDAO AMA or share the events on Twitter, Facebook or other social accounts has a chance to win the prize. The prize amount is sent in a random amount with 2,888 GAT to the most.Go to AEX Global and share 30,000 MOONEY and $20,000 GAT:•Link: www.aex.com•Deposit event: 2022/05/13 15:00- 2022/05/20 15:00 (UTC+8)•Trade event: 2022/05/16 15:00-2022/05/23 15:00 (UTC+8)https://www.aex.com/announcement/en/blog/2022/05/13/10551.html/About AEX Global Founded in 2013, AEX, a cryptocurrency finance exchange, is committing to providing billions of people with safe, complete, easy, and diversified digital finance management services. The closer you look, the further you see. AEX offers a wide range of scenarios covering many fields, including Fiat, Spot, Finance, Loan, and Mining. In AEX Earn, there are Fixed Savings, Flexible Savings, DeFi, Staking, and Dual Investment to meet users' demands. AEX Earn is leading the world in coin type and APR, providing users with rich earning channels.AEX Listing: BD1ogmail.aex.com",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398479",
  "comments": []
}