{
  "id": "topic_5428917",
  "title": "makkamine",
  "author": "makkamine",
  "created_time": "December 15, 2022, 12:55:23 PM",
  "content": "Makka MineNot Just a Decentralized Cloud Mining Platform it is a Revolution in Finance.Makka Mine is making Revenue Generation with cryptocurrency super simple and accessible to everyone.Opportunities with Makka Mine:Hassle-Free Cloud MiningInvestment PlansCrypto Stacking PackagesAffiliate Three-Level BonusWhy Choose Makka Mine?Guaranteed ReturnsCloud-Mining Without Setup.Doesn’t require heavy investmenHassle-free ProceduresInstant Withdrawal24x7 SupportEv SSL, DDoS ProtectionLicenced ScriptUK Registered Company Steps To Invest in Makka Mine Project1. To invest you must first become a member of makkamine.cc. 2. Once you have signed up, you can make your first deposit. 3. All deposits must be made through the Member Area.4. You can log in using the member username and password you received when you signed up.Know the Team Behind Makka MineMakka Mine is a revolutionary project of Makka Mine Limited. The company is aimed at replacing the traditional Payment structure and creating a marketplace with global reach.Benefits of Makka Mine Charity Program❖ Free Education, Books and Materials To The Children ❖ Free Children Living And Refined Meals❖ Free Medical Expenses for the Health of the ChildrenWhat Are The Makka Mine's Core Values➔ To bring the various professionals under one umbrella for effective and faster communications ➔ Intelligently connecting the best of the best professionals to the consumer for an incredible outcome Makka Mine The Revolution in Finance this World Needs!Learn, Invest, Earn, and Grow Together.Communication DetailsMakka Mine LimitedCompany number: 1406322461 Gloucester Street Pimlico, London, United Kingdom, SW1V 4DZEmail: Support@Makkamine.ccWebsite: https://makkamine.ccWhitepaper: https://makkamine.cc/images/makkamine.pdf",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5428917",
  "comments": [
    {
      "author": "Obari",
      "created_time": "December 15, 2022, 01:21:59 PM",
      "body": "I'm not a fan of cloud mining.The moment I hear cloud and mining together, I just skip even without been told because if not all clod mining, then almost all or majority of tye cloud mining are all scam projects and I think you should also check the scam accusation board.OP please you shouldn't get me wrong bit I'm just trying to air my mind and opinion and it might not be easy to get people from this forum to buy and ney into your vision because there are already alot of negative things said about cloud mining and people wouldn't want to risk their time and money in cloud mining especially from a newbie member and I think you should hire a nice graphics designers and a manager to help you out on this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "makkamine",
      "created_time": "December 16, 2022, 07:40:57 AM",
      "body": "I understand you don't have enough knowledge of cloud mining and its potential. Maybe you have encountered a scam project in the past, so it will not be easy to believe any projects related to cloud mining for you. As you can see, Makka mine provides the following securities to gain users's trust:1. Guaranteed Returns2. Cloud-Mining Without Setup.3. Doesn’t require heavy investment4. Hassle-free Procedures5. Instant Withdrawal6. 24x7 Support7. Ev SSL, DDoS Protection8. Licenced ScriptAnd most important, it is a UK-registered company. Here is the registration number and company address:Address: 61 Gloucester Street Pimlico, London, United Kingdom, SW1V 4DZRegistration Number: 14063224Hope it will be enough for you.For more detail, please visit makkamine.cc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "December 19, 2022, 06:34:06 AM",
      "body": "I confess that I had to wait a while before posting because since I saw your thread I couldn't stop laughing, honestly explain the following to me:- How is it possible to have a decentralized mining company? and things only get worse because you still talk about decentralized cloud mining- Post videos of your mining farm, we want to see all the mining equipment you have- how much money did you invest in these mining equipment?- where is your mining farm located?- can you post all your employees?- how much do you profit from your mining farm? Do you have to show the entire profit report to be able to analyze whether your mining farm will be able to pay investors?and this:this can only be a joke, right? you know all hyip/ponzi sites have this",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "makkamine",
      "created_time": "December 19, 2022, 12:50:43 PM",
      "body": "MAKKA MINE LIMITED is officially Registered in the United KingdomCERTIFICATE OF INCORPORATION OF A PRIVATE LIMITED COMPANYCompany Number 14063224The Registrar of Companies for England and Wales, hereby certifies that MAKKA MINE LIMITED is this day incorporated under the Companies Act 2006 as a private company, that the company is limited by shares, and the situation of its registered office is in England and Wales Given at Companies House, Cardiff, on 22nd April 2022.CLICK TO VIEW CERTIFICATE",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "makkamine",
      "created_time": "December 27, 2022, 10:30:39 AM",
      "body": "Latest NewsRead About the Latest Cryptocurrency, News, and TrendsWith Makkamine Official Bloghttps://blog.makkamine.ccThis is an official blog, you can read the latest news, update, and information about MAKKA Mine and crypto investment industry. Both, Cryptocurrency and Cryptomining are creating endless opportunities for people interested in cryptocurrency and passive income. If you want to see an example then meet Makka Mine. It is a decentralized crypto mining project where you can choose a package to invest in and earn with it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "makkamine",
      "created_time": "January 12, 2023, 10:08:18 AMLast edit: January 13, 2023, 10:50:31 AM by makkamine",
      "body": "If you are looking for a Reliable Platform To Stake your Crypto Fund and Earn with it, Then Makka Mine is currently the Most Reliable Platform.Today Join us : https://makkamine.cc/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "January 12, 2023, 10:41:03 AM",
      "body": "Quote from: makkamine on January 12, 2023, 10:08:18 AMIf you are looking for a Reliable Platform To Stake your Crypto Fund and Earn with it, You didn't answer all the questions I asked you, it looks like you avoided answering all the questions I asked you because you don't know what you would answer me, so there is a great chance that you are lying about everything you are talking about, I saw a scam accusation against your site but I still asked you all those questions because I was hoping to give you another chance to hear your side of things but you just ignored all my questionsyou preferred to choose the path of lies, I keep asking myself what you really expect when following this path because let's be honest, if you created this site to be your business then if it is a ponzi scheme then you will not make a profit with it, you can even get it deceive and steal money from some people but in addition to becoming a thief and a criminal you will not have an honest and long-term business",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "makkamine",
      "created_time": "January 13, 2023, 10:55:08 AM",
      "body": "Opportunities with Makka MineMakka Mine is a cloud mining platform where you can stake your funds and earn enormously. The best part of Investing in crypto in Makka Mine is that everything is clearly stated on the website, from estimated returns to the lock-in period you will get everything in writing on this website. This effort makes the process transparent, eliminates confusion, and allows people to trust our vision.The project features various investment plans, Staking packages, referral program, and charity program which enables interested people to invest, earn and use their funds more efficiently. Check all the packages, choose one, and invest to earn and become part of one of the most efficient decentralized cloud mining platforms.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elyte0nes",
      "created_time": "January 19, 2023, 03:17:15 AM",
      "body": "Quote from: Slow death on December 19, 2022, 06:34:06 AMI confess that I had to wait a while before posting because since I saw your thread I couldn't stop laughing, honestly explain the following to me:- How is it possible to have a decentralized mining company? and things only get worse because you still talk about decentralized cloud mining- Post videos of your mining farm, we want to see all the mining equipment you have- how much money did you invest in these mining equipment?- where is your mining farm located?- can you post all your employees?- how much do you profit from your mining farm? Do you have to show the entire profit report to be able to analyze whether your mining farm will be able to pay investors?and this:https://makkamine.cc/images/whitepapper-img.jpgthis can only be a joke, right? you know all hyip/ponzi sites have thisI agree, thanks for asking these questions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "makkamine",
      "created_time": "February 07, 2023, 12:30:17 PM",
      "body": "Invest and Earn with Makka MineMakka Mine’s Investment plans you Should Know AboutCheck Out the six packages and what they offer. Then select a package, make an investment, and start using Makka Mine to generate passive income.PALLADIUM: Palladium is the most affordable investment plan at Makka Mine  You can start with as low as $10 and can have a daily return at 0.50%. With a lock-in period of 500 days, you will get back the principal return and bonus of $1.OSMIUM: You can invest $30 and can have a daily return at 0.70%. With a lock-in period of 500 days, you will get back the principal return and bonus of $1.50.IRIDIUM: You can subscribe to this package with just a $50 investment. With the same lock-in period as above two plans, it offers daily returns at 1% rate and a bonus of $2.25.RUTHENIUM: This plan offers a daily return of 1.25% and bonus of $3. You can opt-in to this plan with an investment of $100. Lockin time is 500 days and your principal amount will be returned.PLATINUM: With this investment plan you can get a daily return of 1.50% and a bonus of $4.30. You can choose this package by paying $200 and the lock-in period is 500 days.RHODIUM: Rhodium is last on our list, it is a highly profitable investment plan that offers 2% daily returns, and a bonus of $7.25. You can choose his profitable option by making an investment of $500. You can choose any of the investment plans from above just keep in mind that all attract a 500 days lock-in period and a limit of min $10 withdrawal. So, What are you waiting for? Invest in Makka Mine now and start making unmatched passive income.https://makkamine.cc/plan",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}