{
  "id": "topic_5415276",
  "title": "bobita",
  "author": "bobita",
  "created_time": "September 28, 2022, 10:54:02 PM",
  "content": "Bir evcil hayvan istiyorsanız onlara zulmeden tüccarlara para vermeyin, e-Devlete girin ve belediye barınaklarından sahiplenin, hizmet daha çok yeni olduğu için henüz çok az belediye var ama yaygınlaşacağını umuyorum. Kontrol ettiğimde şu an sadece Keçiören, Bağcılar ve Büyükçekmece belediyelerini gördüm ve bunların içinde de açılan bir tek Keçiören Belediyesi ama olsun, muhtemelen hizmet veren artacaktır.e-Devlete girip arama kısmına \"hayvan sahiplenme\" yazmanız yeterli.Ben bu hizmete çok sevindim, çok profesyonel ve işini vicdanla yapan hayvan yetiştiricileri de var tabii ama çoğu para uğruna gariplere eziyet ediyor.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415276",
  "comments": [
    {
      "author": "ajanwalker",
      "created_time": "September 28, 2022, 10:59:55 PM",
      "body": "Abi bence de güzel bir proje olmuş.Zaten hayvan barınaklarında bulunan kedi ve özellikle köpeklerin çoğu zamanında sahiplenilen ve sonrasında terk edilen hayvanlardan oluşuyor..Kim düşünmüş ise iyi düşünmüş.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bobita",
      "created_time": "September 29, 2022, 09:42:46 AM",
      "body": "Aslında bu uygulama yaygınlaşırsa esas faydası barınaktan alınan değil kalan hayvanlara olacak, çünkü bir kaç istisna dışında hepsi kapasite üstü çalışıyor ve barınaklarda da hayvanlar pek iyi durumda değil. Çok iyimser bir bakış belki ama oralar da biraz ferahlar umarım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "September 29, 2022, 09:51:51 AM",
      "body": "Uygulama güzel düşünülmüş böylelikle hayvanlar için daha iyi ortamlar oluşturulabilir. Uygulamanın tüm ülkeye yatılması daha fonksiyonel hale getirir. Ülkemizde insanlara değer verilmiyor ki hayvan dostlarımızın durumu çok daha kötü umarım böyle uygulamalar ile bir çoğuna yeni yuvalar bulunmuş olur. İnsanlarında bu uygulamadan haberdar olabilmeleri adına tanıtımlar yapılmalı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vonutage",
      "created_time": "September 29, 2022, 11:36:11 AM",
      "body": "Quote from: bobita on September 28, 2022, 10:54:02 PMBir evcil hayvan istiyorsanız onlara zulmeden tüccarlara para vermeyin, e-Devlete girin ve belediye barınaklarından sahiplenin, hizmet daha çok yeni olduğu için henüz çok az belediye var ama yaygınlaşacağını umuyorum. Kontrol ettiğimde şu an sadece Keçiören, Bağcılar ve Büyükçekmece belediyelerini gördüm ve bunların içinde de açılan bir tek Keçiören Belediyesi ama olsun, muhtemelen hizmet veren artacaktır.e-Devlete girip arama kısmına \"hayvan sahiplenme\" yazmanız yeterli.Ben bu hizmete çok sevindim, çok profesyonel ve işini vicdanla yapan hayvan yetiştiricileri de var tabii ama çoğu para uğruna gariplere eziyet ediyor.iyi de bu yolla kime nasıl hava atacak?Saf kan bir x aldığını nasıl anlatıcak?Ne yazık ki bizde hayvan sahiplenme işi \"genel\" olarak çok da olması gerektiği gibi değil. Bir özenti ya da hava atma göstergesi ne yazık ki.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "September 29, 2022, 01:12:24 PM",
      "body": "Keşke barınakların koşulları iyileştirilse, keşke orada yaşayan hayvan dostlarımız daha güzel bir dünyada yer alıyor olabilse. Türkiye'deki hayvan barınakları maalesef hayvan koğuşu olarak işlev görüyor. Sağda solda şikayet edilen hayvanları toplayıp bir tel örgü arkasına alıyorlar, iki tas kuru mama ile hayatına devam edebileceklerini düşünüyorlar. Temizlik deseniz yok, sevgi ihtiyacı zaten karşılanmıyor.Bu konuda sosyal medyayı aktif kullanan ya da biraz daha modern diyebileceğimiz belediyeler yeni düzenlemeler ile gerçekten güzel işler başarmaya başladılar. Ama birçok bölgede durum gerçekten sıkıntılı, çoğu hayvan telef oluyor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "September 29, 2022, 03:03:00 PM",
      "body": "Güzel bir proje genelde böyle projeleri fazla görmeyiz ama şaşırtıcı şekilde burada da işe yarar projeler çıkabiliyor demek ki hayvan satın almaya karşıyım karşı olmam bir şey ifade etmiyor yine de sahiplendirme adı altında para alıyorlar adına süt parası vs gibi farklı isimler koysalar da hayvan satışı yapılıyor yani sonuçta",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "September 29, 2022, 03:21:00 PM",
      "body": "valla ben anlamıyorum. hala eminönü'nde köpek yavrularını vitrinlerde sergiliyorlar. ha sorsan \"yok abi satmıyoruz.\" derler büyük ihtimalle ama o zaman orada ne işi var? mesela bende de cins kedi var ve yavrusu olsa 1 tanesi dışında kalanları isteyene ücretsiz olarak verirdim. tabii ki bakmak koşuluyla yoksa gariban hayvanlar. belediyenin yaptığı iş gayet güzel. sokaktan almayacaksan bu şekilde hareket edilmesi güzel.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "September 29, 2022, 03:27:04 PM",
      "body": "Quote from: gospodin on September 29, 2022, 03:21:00 PMvalla ben anlamıyorum. hala eminönü'nde köpek yavrularını vitrinlerde sergiliyorlar. ha sorsan \"yok abi satmıyoruz.\" derler büyük ihtimalle ama o zaman orada ne işi var? mesela bende de cins kedi var ve yavrusu olsa 1 tanesi dışında kalanları isteyene ücretsiz olarak verirdim. tabii ki bakmak koşuluyla yoksa gariban hayvanlar. belediyenin yaptığı iş gayet güzel. sokaktan almayacaksan bu şekilde hareket edilmesi güzel.Belediyelerin bir çoğunda maalesef koşullar iyi olmadığı için hayvanlar eziyet görüyorlar. Barınakta olmasa daha iyi diyeceğimiz onlarca belediye çöplükleri var. Ne yemek veriyorlar ne su. Geçen günlerde haberlerde bir belediyede hayvanların birbirini yediklerini haber yapmışlardı barınakta. Böyle olacağına gerçekten iyi şartlara sahip bir barınak tesis edilse de, sahiplenmek dışında gönül rahatlığıyla dünyalık ömürlerini orada tüketse hayvanlar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wolwoo",
      "created_time": "September 29, 2022, 03:32:53 PM",
      "body": "Proje güzel ancak sahile vuran deniz yıldızlarını denize atan adam hikayesi gibi soruna ufak bir dokunuş yapacak intibası uyandırdı bende...Sokaklarda hayvan kaynıyor, her yer kedi köpek tilki sıçan kirpi vs Bazı semtlerde köpek popülasyonu bazı yerlerde kedi istilası yaşanıyor.Hayvan bitki ve pek tabii insan fark etmez, her canlının yaşama hakkı olduğuna inanıyorum. Ancak bunların uyumlu bir birliktelik sergilemesi için çaba gerekiyor. Özellikle başıboş köpek saldırıları beni endişelendiriyor. Umarım kimsenin canı yanmadan güzel ve etkili çözümler bulunur. Bir anlık hevesle hayvan alıp sokağa atan eziyet edenlere de ceza verilmeli.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "September 29, 2022, 03:36:35 PM",
      "body": "Quote from: wolwoo on September 29, 2022, 03:32:53 PMProje güzel ancak sahile vuran deniz yıldızlarını denize atan adam hikayesi gibi soruna ufak bir dokunuş yapacak intibası uyandırdı bende...Sokaklarda hayvan kaynıyor, her yer kedi köpek tilki sıçan kirpi vs Bazı semtlerde köpek popülasyonu bazı yerlerde kedi istilası yaşanıyor.Hayvan bitki ve pek tabii insan fark etmez, her canlının yaşama hakkı olduğuna inanıyorum. Ancak bunların uyumlu bir birliktelik sergilemesi için çaba gerekiyor. Özellikle başıboş köpek saldırıları beni endişelendiriyor. Umarım kimsenin canı yanmadan güzel ve etkili çözümler bulunur. Bir anlık hevesle hayvan alıp sokağa atan eziyet edenlere de ceza verilmeli.Aslında sokaktaki köpeklerin saldırgan olması da sokak kültürlerinde yetiştikleri ve her şeyi tehdit olarak algıladıkları için oluyor. Yani orada da biraz bizim sorumluluğumuz var. Başı boş köpekler sağa sola daldırır vaziyetteler. Onlar için özellikle saldırgan olanlar için sakinleştirici etkili ilaçlar belki denenebilir. Tabi bu sistem dediğin gibi çok az etkisi olan bir sistem gibi olacak. Yine de insanlar arasında kullananlar olabilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wolwoo",
      "created_time": "September 29, 2022, 03:50:01 PM",
      "body": "Quote from: Phoenix Anka on September 29, 2022, 03:36:35 PMQuote from: wolwoo on September 29, 2022, 03:32:53 PMProje güzel ancak sahile vuran deniz yıldızlarını denize atan adam hikayesi gibi soruna ufak bir dokunuş yapacak intibası uyandırdı bende...Sokaklarda hayvan kaynıyor, her yer kedi köpek tilki sıçan kirpi vs Bazı semtlerde köpek popülasyonu bazı yerlerde kedi istilası yaşanıyor.Hayvan bitki ve pek tabii insan fark etmez, her canlının yaşama hakkı olduğuna inanıyorum. Ancak bunların uyumlu bir birliktelik sergilemesi için çaba gerekiyor. Özellikle başıboş köpek saldırıları beni endişelendiriyor. Umarım kimsenin canı yanmadan güzel ve etkili çözümler bulunur. Bir anlık hevesle hayvan alıp sokağa atan eziyet edenlere de ceza verilmeli.Aslında sokaktaki köpeklerin saldırgan olması da sokak kültürlerinde yetiştikleri ve her şeyi tehdit olarak algıladıkları için oluyor. Yani orada da biraz bizim sorumluluğumuz var. Başı boş köpekler sağa sola daldırır vaziyetteler. Onlar için özellikle saldırgan olanlar için sakinleştirici etkili ilaçlar belki denenebilir. Tabi bu sistem dediğin gibi çok az etkisi olan bir sistem gibi olacak. Yine de insanlar arasında kullananlar olabilir. Walla Çin tayland taraflarında bir savaş çıkarsa sokak hayvanı kalmaz. Onlar da gelir Türkiye'ye hepsini yerler",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "W Jr.",
      "created_time": "September 29, 2022, 04:15:43 PM",
      "body": "Quote from: wolwoo on September 29, 2022, 03:50:01 PMQuote from: Phoenix Anka on September 29, 2022, 03:36:35 PMQuote from: wolwoo on September 29, 2022, 03:32:53 PMProje güzel ancak sahile vuran deniz yıldızlarını denize atan adam hikayesi gibi soruna ufak bir dokunuş yapacak intibası uyandırdı bende...Sokaklarda hayvan kaynıyor, her yer kedi köpek tilki sıçan kirpi vs Bazı semtlerde köpek popülasyonu bazı yerlerde kedi istilası yaşanıyor.Hayvan bitki ve pek tabii insan fark etmez, her canlının yaşama hakkı olduğuna inanıyorum. Ancak bunların uyumlu bir birliktelik sergilemesi için çaba gerekiyor. Özellikle başıboş köpek saldırıları beni endişelendiriyor. Umarım kimsenin canı yanmadan güzel ve etkili çözümler bulunur. Bir anlık hevesle hayvan alıp sokağa atan eziyet edenlere de ceza verilmeli.Aslında sokaktaki köpeklerin saldırgan olması da sokak kültürlerinde yetiştikleri ve her şeyi tehdit olarak algıladıkları için oluyor. Yani orada da biraz bizim sorumluluğumuz var. Başı boş köpekler sağa sola daldırır vaziyetteler. Onlar için özellikle saldırgan olanlar için sakinleştirici etkili ilaçlar belki denenebilir. Tabi bu sistem dediğin gibi çok az etkisi olan bir sistem gibi olacak. Yine de insanlar arasında kullananlar olabilir. Walla Çin tayland taraflarında bir savaş çıkarsa sokak hayvanı kalmaz. Onlar da gelir Türkiye'ye hepsini yerler Şansımız, coğrafik olarak onlara uzağız.Bize gelene kadar onlarca ülke var gidebilecekleri.Asya bölgesi insanı Türkiye’de rahat edemez bu yüzden kendilerine yakın kültür ararlar.Şanslıyız ki, Türkiye’ye gelme ihtimalleri neredeyse sıfıra yakın.Hayvanlar için özellikle kedi/köpek sahiplenmeleri için güzel bir uygulama olmuş.Düşünenlerin eline yüreğine sağlık.İnşallah beklenilen ilgiyi görür de, tüm belediyeler bu hizmete başlarlar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Retro Harmony",
      "created_time": "September 29, 2022, 06:15:21 PM",
      "body": "Bir de şunu eklemek gerekiyor. Eğer ki patili bir hayvanı arkadaş edindiyseniz onların iyi bir insan arkadaşı olmayı çalışın. Hevesiniz geçince sokağa attığınız bir çok patili dostumuz sizin geleceğinizi umut ederek barınağa bırakıldığı ilk haftalarda yemek yemeyi bile reddediyorlar. Yani size, sizden daha fazla değer veren canlıları insan ırkının iyi bir ırk olduğunu gösterecek kadar hoşgörülü davranmanızı hatırlatıyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "September 30, 2022, 12:50:40 PM",
      "body": "Quote from: wolwoo on September 29, 2022, 03:32:53 PMProje güzel ancak sahile vuran deniz yıldızlarını denize atan adam hikayesi gibi soruna ufak bir dokunuş yapacak intibası uyandırdı bende...Barınaklardan hayvan sahiplendirilmesi projesi çok güzel ama dediğiniz çok doğru. Esas sorun çok daha büyük ve çözülmesi inanılmaz zor. Her gün de daha da zorlaşıyor ve hatta imkansız oluyor bence. Bizim de ufak bir köpeğimiz var, onu aldığımızdan beri öncesinde de hayvanları çok seviyor olmama rağmen tüm hayvanlara çok ayrı bir gözle bakıyorum. Bir yerde köpek gördüğümde kalbim pıt ediyor, hepsi gerçekten gözümde birer melek ancak hava kararınca işler değişiyor. Benim köpekle sürekli oynayan iyi huylu köpekler bile gece olunca canavara bağlıyor. Orman kenarında bir yerde oturuyorum. Özellikle gece dükkanlar kapandıktan sonra gürültü ve güvenlik büyük sorun. Ben hadi höt dedim mi söz geçirebiliyorum ve çok sorun yaşamadım ama bir kere koşuya çıktığımda bana bile saldırıyorlardı. Köpeğin adını ve sevgi sözleri söyledim de durdular. Kadınlar ve çocuklar gerçekten terör içinde yaşıyor. Ben dediğim gibi inanılmaz sevmeme rağmen ortada büyük bir sorun olduğunu düşünüyorum. Eski evimizde de kediler büyük bir sorun olmuştu. Taşındığımızda bir tane bile yoktu ancak pandemide insanlar acayip miktarlarda yiyecek bırakmaya başladılar ve hem kedi popülasyonu ciddi rahatsızlık verecek seviyeye çıktı, hem de hijyenik olarak acayip kötü görüntüler kokular oluştu. Her şeyin bir denge içerisinde olması gerekiyor. Petshoplar ise apayrı bir dram. Onun yerine böyle sahiplendirme projeleri çok iyi, ama ne yazık ki yetersiz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "October 01, 2022, 04:42:47 PM",
      "body": "Güzel bir işlem olmuş, bu uygulama sayesinde bir çok insan barınaklara gitmeden kurtulacak, barınak direkt adrese kadar getirirse daha iyi olur herhalde getiriyorlardır, bir de barınağa gidip hayvan seçmeyi de doğru bulmuyorum, eğer gerçekten iyi niyetli bir kişiyseniz herhangi bir hayvanı sahiplenebilirsiniz, cinsi fark etmemeli,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Red Pie",
      "created_time": "October 01, 2022, 04:57:23 PM",
      "body": "Zamanla diğer tüm belediyeler bu işe girişeceklerdir. özellikle İzmir Antalya gibi hayvan sahiplenmenin yüksek olduğu (gördüğün kadarıyla) şehirlerde bulunan ve sahiplenmek isteyenler için bulunmaz nimet. kıyı şeridindeki belediyelerin bu hizmet duyuldukça seri seri bu hizmete başlayacaklarını düşünüyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "October 01, 2022, 05:40:43 PM",
      "body": "Yıllardır evde muhabbet kuşu beslerim, tavuk olayını zaten konu olarak açmıştım, kopeklerim de oldu, şu an güzel bir kedimiz de var, yani hayvanlar konu olunca mutlaka kayıtsız kalamiyorum. uygulama gerçekten özellikle köpek sahiplenecekler için çok güzel. Yıllardır özellikle maddi durumu çok iyi ailelerin çocuklarına tatil hediyesi doğum günü hediyesi vs sebeplerle köpek alıp, hevesleri geçince sokağa saldiklarina tanık olmuşuzdur. Sonrasında ise bu köpeklerin kontrol dışı üremesi neticesinde özellikle sokaklarda durumdan rahatsız olan ve zarar gören insanlar da yok değil. Uygulama eğer yaygınlaşır ve toplumda da kabul görürse kesinlikle çok faydalı olacaktır, birçok sorunun da önüne geçecektir.Bu arada özellikle kedi ve köpek sahiplenecekler için, karakter yapınıza uygun cinsleri tercih ediniz lütfen. Ayrıca mutlaka sahipleneceginiz ırka ait ufak çaplı da olsa araştırma yapmanızda da büyük fayda var.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "October 01, 2022, 06:41:01 PM",
      "body": "Güzel düşünülmüş bir proje ve umarım sistemdeki barınak sayıları da artar. Böyle işlere başlandığını görmek sevindirici aynı zamanda barınakların imkanlarını da arttırırlarsa daha güzel işler olabilir. Sahiplenilen her can o ortamdan kurtulmuş olacak. Düşüncesi bile güzel. O ortam diye betimleyip barınaklara tepki göstermiyorum emeği geçenlerin hakları zaten ödenmez ama o kadar çok hayvan var ki oradakiler napsın. Buna bir çözüm bulunabilirse bakımın kalitesi daha da çok artar ve o hayvanlar daha iyi şartlarda büyür.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}